{"job title": "Machine Learning Scientist", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nJoin an innovative and passionate team of scientists who use Machine Learning, NLP, Statistical and Optimization techniques to build the next generation of intelligent customer service technology at Amazon. We love data and we have lots of it. We use big data to anticipate customer needs, to answer customer questions and to solve customer problems. We believe the best customer service means the customer never needs to call you. It just works.<br> <br> You will enjoy a creative environment that balances research with application; you will explore the frontier of Machine Learning techniques and take what you have found to solve real-world problems. You will work closely with engineering and business teams to lead the end-to-end process of identifying the problem, implementing the solution and scientifically measuring the impact on the company’s bottom line and the customer experience. If you love big data, if you are creative, if you believe there is no limit on how data can improve the way we serve customers, if you want to see your work in Machine Learning have an immediate and measurable impact on customers, then this is the team for you. <br> <br> Major responsibilities<br> <ul><li>Use statistics, NLP and machine learning techniques to create scalable solutions for business problems</li><li>Analyze and extract relevant information from large amounts of both structured and unstructured data to help automate and optimize key processes</li><li>Design, experiment and evaluate highly innovative models for predictive learning</li><li>Work closely with software engineering teams to drive real-time model experiments, implementations and new feature creations</li><li>Work closely with business staff to optimize various business operations</li><li>Establish scalable, efficient, automated processes for large scale data analyses, model development, model validation and model implementation</li><li>Track general business activity and provide clear, compelling management reporting on a regular basis</li><li>Research and implement novel machine learning and statistical approaches</li></ul><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>A PhD or equivalent degree in Statistics, Computer Science, Machine Learning, or in a highly quantitative field</li><li>1+ years of hands-on experience in predictive modeling and big data analysis</li><li>1+ years of experience using R/SAS and SQL in a Linux/UNIX environment</li><li>1+ years of experience with Python</li><li>Strong communication and data presentation skills</li><li>Strong problem solving ability</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<br><ul><li>3+ years of industry experience in predictive modeling, machine learning and big data analysis</li><li>Strong skills with Python and Java</li><li>1+ year distributed programming experience</li><li>Track records of deliver results and strong ownership<br></li></ul>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}