{"job title": "Immunohistochemistry Scientist", "company": "Bristol-Myers Squibb Company", "city state": "– Redwood City, California", "rating": "3.7", "job description": "The Immunohisotochemistry (IHC) Department at Bristol-Myers Squibb is seeking a highly motivated and talented PhD-level individual to join our Immuno-Oncology Discovery Research Division. The ideal candidate will possess vast knowledge in IHC, excellent communication and organization skills, problem-solving abilities, and a commitment to excellence.\n<br>\nThe candidate will work closely with other disciplines within BMS to drive advancement of early stage projects into clinical development, providing scientific and technical expertise in a highly collaborative, fast-paced research environment.\n<br>\nIn this role, the individual will conduct immunohistochemistry and imaging to advance our oncology portfolio and contribute to the design and interpretation of key feasibility, mechanism of action and toxicity questions from ongoing Oncology programs.\n<br><br>\nResponsibilities:\n<li>Provide IHC support for novel Oncology targets for proof of concept, indications and mechanism of action.</li><li>Develop novel IHC assays, collaborating closely within and across departments.</li><li>Create/provide tools for IHC. Tissue banking.</li><li>Candidate will present data at internal and external meetings, write technical summaries for regulatory documents, patent applications and manuscripts.</li>\nRequirements:\n<li>PhD degree in Biology or related fields, or equivalent experience in industry setting.</li><li>Experience in histology, including tissue sample preparation, sectioning (both cryostat and microtome), special stains and particularly immunohistochemistry both in Bright Field and Fluorescence is required</li><li>Hands-on IHC single and multi-plex staining in both Chromogenic and Fluorescence methods. Manual and automated-IHC on pre-clinical, non-clinical and clinical samples.</li><li>Imaging and analysis of tissue sections using manual and automated microscopy and image analysis such as quantification.</li><li>Expertise in antibody therapeutics is essential.</li> <li>Tissue culture is a must. Flow Cytometry, si/shKD or CRISPR is a plus.</li><li>Familiarity with tumor pathology, cancer biology and image analysis is preferred.</li><li>Excellent written and oral communication skills are required.</li><li>Excellent organization skills and familiarity with a fast-paced work environment are required.</li><li>Independent requiring minimum supervision, works well with others, and thrives in a collaborative, matrix environment</li>"}