{"job title": "SENIOR SCIENTIST", "company": "Bristol Myers Squibb", "city state": "– Hopewell, NJ", "rating": "3.7", "job description": "<ul>\n<li>*Key Responsibilities**</li>\n</ul>\n\n+ Assessment and implementation of novel molecular technologies to improve current platform processes for cell line performance and characterization.\n<br><br>\n+ Identify and develop new technologies and processes for constructing and enhancing cell line performance of cell lines destined for biological manufacturing.\n<br><br>\n+ Carry out the Bioinformatics necessary to further enhance cell line performance.\n<br><br>\n+ Identify the tolerance limits of the present platform, determine strategies to make quantum improvements in the technology and processes.\n<br><br>\n+ Evaluate new technologies and where appropriate introduce them into the cell line development process.\n<br><br>\n+ Set up and maintain collaborative interactions with Research and Development, Molecular Analytics, Process Development and where appropriate with manufacturing groups.\n<br><br>\n+ Maintain state of the art knowledge, present at meetings and publish their results and author technical documents.\n<br><br>\n+ Lead a small team to further these goals.\n\n\n<ul>\n<li>*Qualifications:**</li>\n</ul>\n\n<strong>The successful candidate will have:</strong>\n<br><br>\n+ PhD in Molecular Biology, Genetic, Bioinformatics, Cell Biology or relevant field.\n<br><br>\n+ Minimum of 4, preferably 8 or more years of industrial experience or equivalent.\n<br><br>\n+ Solid background in molecular biology including genetic manipulation, cell biology, as well as phenotypic and metabolic analysis of cell lines\n<br><br>\n+ A background in common bioinformatics data analysis tools especially in the areas of RNAseq, and data integration for pathway analysis.\n<br><br>\n+ Strong experimentalist that can lead independent research, with extensive cell molecular biology and tissue culture experience.\n<br><br>\n+ Take a scientific leadership position and work productively in a fast paced results oriented interdisciplinary team environment.\n<br><br>\n+ Effective oral and written communication capabilities.\n<br><br>\nBristol-Myers Squibb is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status."}