{"job title": "ASSISTANT SCIENTIST", "company": "Bristol-Myers Squibb Company", "city state": "– Syracuse, New York", "rating": "3.7", "job description": "Duties/Responsibilities:\n<br><br>\nPerform laboratory analysis of samples, using aseptic technique, following established procedures and in full compliance with official compendial, health authority regulations, and established BMS policies. Conduct qualification of methods and/or other laboratory studies, according to scientific protocols. Maintains accurate records of work performed and documents results, according to good documentation practices and established procedures as well as perform data entry into LIMS. Assist with review of worksheets, as assigned. Assists in the investigation of OOS results in areas of assigned responsibility. Operates and maintains laboratory instruments, while ensuring the reliability of instrumentation through proper maintenance, with ability to troubleshoot minor issues. Must analyze, evaluate, and interpret data, notifying clients of results, and assisting to resolve issues, if applicable. Identify opportunities for workflow and procedural improvements. Promotes quality, safety and health, by ensuring clean work area, and adherence to procedures and safety culture. The Assistant Scientist must participate and lead continuous improvement using lean principles to assist with streamlining and making the laboratory efficient.\n<br><br>\nQUALIFICATIONS\n<br><br>\nSpecific Knowledge, Skills, Abilities, etc:\n<br><br>\nAssistant Scientist I (D03): Must have knowledge of aseptic technique, environmental monitoring, and microbiological Quality Control testing and procedures. Has excellent manual dexterity and aseptic technique. Has ability to complete sampling or testing assignments in a timely and compliant manner, with minimal supervision. Perform limited interpretation of data. Demonstrate ability to handle multiple assignments simultaneously and complete assignments in a timely and compliant manner, with minimal supervision. Knowledge of cGMPs and compendial testing required. Must have effective verbal and written communication skills.\n<br><br>\nAssistant Scientist II (D03): Must have knowledge of aseptic technique, environmental monitoring, and microbiological Quality Control testing and procedures with the application and interpretation of GMP concepts and compendial requirements to daily laboratory operations. Has high level of technical understanding of methods, equipment, and procedures in work area. Analyzes, evaluates, and initially interprets data in assigned area. Demonstrates ability to handle multiple assignments simultaneously and complete assignments in a timely and compliant manner, with minimal supervision. Must have excellent verbal and written communication skills. Able to provide training to others in area of expertise, as assigned.\n<br><br>\nEducation/Experience/ Licenses/Certifications:\n<br><br>\nAssistant Scientist I (D03): B.S. degree in Biological Sciences or related field with 0-3 years of QC microbiology laboratory experience.\n<br><br>\nAssistant Scientist II (D03): B.S. degree in Biological Sciences or related field with at least 2 years of QC microbiology laboratory experience.\n<br><br>\nPhysical Demands:\n<br><br>\nThis position is a lab-based position which requires appropriate levels of personal protective equipment (PPE). This role will require contact with biohazardous materials such as live cell cultures and other hazardous chemicals including acids, and caustics. Powdered materials and high temperature liquids and solids are also handled. Frequent repeated motions such as pipetting, lifting, bending, twisting, squatting, crouching, kneeling, climbing on step-stools, and reaching is required. This role also requires frequent unassisted lifting (not to exceed 50 lbs). Repetitive use of arms/hands/wrists and grasping is also required. Depending on the work demands, office-based work requires sitting.\n<br><br>\nWork Environment:\n<br><br>\nThis position is based indoors and you will primarily be working with others, but also independently and alone at times. This position is a team-based position that will require shift work, weekends, and holidays."}