{"job title": "Telemetry DevOps Analytics Data Scientist and Platform Developer", "company": "Citibank", "city state": "– Irving, Texas", "rating": "3.5", "job description": "<div><ul>\n<li><strong>Primary Location:</strong> United States,Texas,Irving</li><li><strong>Education:</strong> Bachelor's Degree</li><li><strong>Job Function:</strong> Technology</li><li><strong>Schedule:</strong> Full-time</li><li><strong>Shift:</strong> Day Job</li><li><strong>Employee Status:</strong> Regular</li><li><strong>Travel Time:</strong> No</li><li><strong>Job ID:</strong> 18052299</li>\n</ul>\n\nDescription\n<br>\n<strong></strong>\n<br>\nThe <u>Telemetry DevOps Analytics Data Scientist and Platform Developer</u> will develop and manage a comprehensive Telemetry portal, providing capabilities and services for GCB to help drive a culture of learning and continuous improvement using actionable metrics. <br>\n<div>This person will be part of a team designing and developing a custom built telemetry portal, leveraging Java Microservices, Splunk, Angular, Hadoop technologies. The portal will provide GCB Technology with real-time insights into their technology practices, including the CI/CD pipeline, environment health and uptime, Project health, Application Performance and Infra performance.\n<br>\nAble to define the correct data, analyze and interpret data leveraging complex data models and noisy data sources. Proven technical ability with a variety of reporting analytics and data visualization tools such as Qlikview, Tableau, BI Cognos, SQL, Python and R. Knowledge and understanding of statistical techniques suitable for analysis of complex data sets. Proven experience in predictive analytics &amp; metrics formulation. Familiarity with the design and implementation of data telemetry systems\n<br>\nThe ideal person will be a multi-talented data scientist developer who would believe in, everything that can be done in technology space must be measured, can be measured and should be measured.\n<br>\n<strong>.</strong>\n<br><br>\n<strong><u>Key Responsibilities:</u>\n<br>\n</strong>\n\n\n<ul>\n<li>Design and Develop the comprehensive Business Intelligence - Telemetry Portal.</li>\n<li>Collaborate with Product Architecture, Product Owner and key stakeholders to devise and develop cutting-edge solutions.</li>\n<li>Be an active member of the Product Development scrum team.</li>\n<li>Provide support for the Telemetry Portal, including new requirements, enhancements or fixes.</li>\n<li>Partner with other scrum team members, including Bas, Scrum Masters and testers in support of the common goal.</li>\n</ul>\n\n<strong><u>Development Value:</u>\n<br>\n</strong>\n<br>\nThe job offers the opportunity for the candidate to advance in a technology development role, with exposure to multiple cutting edge technologies, including Java development, Angular UI development, Big Data (Splunk / Hadoop) and eventually machine learning / AI. The position will provide a wide exposure to customers and requirements across Global Consumer Technology.</div>\n<br>\nQualifications\n<br>\n<strong><u>Essential Skills:</u>\n<br>\n</strong>\n\n\n<ul>\n<li>Proven technical ability with a range of BI and development tools &amp; languages. One or more of these skills are needed:</li>\n</ul>\n\no Splunk\n<br>\no Java Microservices development (SpringCloud)\n<br>\no UI / Angular / HTML\n<br>\no Hadoop\n<br>\no Machine Learning / AI• Capable of guiding and inspiring team members, peers and stakeholders to drive the best possible practices\n\n\n<ul>\n<li>Broad knowledge of SDLC, CI/CD and ALM tools (incl. JIRA, HP ALM, Jenkins, ServiceNow).</li></ul>\n\n<u>Preferred Skills</u>\n\n\n<ul>\n<li>Ability to think out-of-the-box and give pleasant surprises to end users over the data telemetry served</li>\n<li>Proven technical ability with a variety of reporting analytics and data visualization tools such as Qlikview, Tableau, BI Cognos, SQL, Python and R is a plus.</li>\n<li>Knowledge and understanding of statistical techniques suitable for analysis of complex data sets is a plus</li>\n<li>Familiarity with the design and implementation of data telemetry systems and metrics formulation is a plus</li>\n</ul>\n\n<strong><u>Knowledge/Experience:</u> \n<br>\n</strong>\n\n\n<ul>\n<li>BS Degree in engineering, science, mathematics, information systems or computer science; or the equivalent in experience and evidence of exceptional ability.</li>\n<li>8 or more years experience in enterprise level IT projects.</li>\n<li>Experience with application / product development, incl. on-time and in-budget delivery.</li>\n<li>Experience with BI / Big-data solutions (Splunk / Hadoop) is a plus</li>\n<li>Experience with Microservice development in SpringCloud is a plus</li>\n<li>Experience with Angular development is a plus.</li>\n<li>Experience in and understanding of a wide variety of telemetric processes (governance, measurement, etc.)</li>\n<li>Experience in leading metrics and KPI automation</li>\n<li>Experience working within an agile software development environment</li>\n<li>Experience in designing, deploying and maintaining telemetry infrastructure on private and/or public clouds is a plus.</li>\n<li>Bachelor degree in computer science or other related or equivalent work experience.</li>\n</ul>\n\n<u>Competencies</u>\n\n\n<ul>\n<li>Excellent thought leadership in telemetry and IT development.</li>\n<li>Strong customer and quality-focus is a must.</li>\n<li>Sound problem resolution, judgment, decision-making and influencing skills required.</li>\n<li>Excellent organizational, interpersonal, and communication skills</li>\n<li>Ability to deal with conflicting ideas with emotional intelligence</li>\n<li>Excellent English communication skills both written and oral.</li>\n<li>Hard working and self-motivated. Able to work effectively under pressure.</li>\n<li>Ability to manage multiple activities and changing priorities.</li>\n</ul>\n\nThis position is located in Irving TX and Jacksonville Florida.\n<br>\nWe have set aside limited financial assistance relocation will be provided for out-of-state candidates.</div>\n\n<br>"}