{"job title": "Research Scientist", "company": "Cree", "city state": "– Durham, NC", "rating": "3.0", "job description": "The Wolfspeed Materials R&amp;D group within Cree is looking for a high potential, resourceful, hands-on, problem solving Research Scientist with a good understanding of materials behavior and capacity to quickly grasp and solve technical challenges. A solid background in mechanical and electrical applications with strong modeling and analytical skills are necessary.\n<br><br>\n<strong>What can Cree do for you?</strong>\n<ul>\n<li>Join the company that is a global leader in the manufacturing of 4H Silicon Carbide (SiC) substrates, SiC and III-Nitride epitaxial wafers</li><li>Be part of the team that has long proven expertise in SiC and GaN materials technology advancement with the focus and commitment to bring high quality solution platforms across all applications</li><li>The world runs on power and our SiC wide bandgap semiconductors far outperform conventional silicon components and set new standards for efficiency and reliability</li>\n</ul>\n<strong>What can you do for Cree?</strong>\n<ul>\n<li>Carry out research within the SiC applied scientific field that involves development and design work</li><li>Contribute or lead in SiC crystal growth technology development activities</li><li>Implement innovative solutions to SiC technology problems and drive them to high yield manufacturability</li><li>Create opportunities to enhance technical methodology through expansion of existing or development of new efforts</li><li>Develop project plans, technical approaches, timelines and deliverables for assigned projects</li><li>Work on several projects, simultaneously and deliver results in complete ownership</li><li>Work to establish practices which include employees’ positive involvement with opportunity for constructive input and action</li><li>Establish accountability for problem solving both on a permanent and ad-hoc basis, depending on need</li>\n</ul>\n<strong>What you need for success</strong>\n<ul>\n<li>PhD in Materials, Chemical, Ceramics, Electrical Engineering, or Physical Science with Engineering degree</li>\n\n<ul>\n<li>MS with 5+ years of related industrial R&amp;D experience</li>\n</ul>\n\n<li>Hands on electrical and mechanical skills and experience</li><li>Vacuum technology knowledge background</li><li>Computational skills toward thermal modeling and technical drawings</li><li>Statistical data analysis skills and experience</li><li>Independent thinking, attention to detail, strong organizational and planning abilities</li><li>Excellent analytical and problem solving skills</li><li>Strong leadership skills, high energy, self motivated with “whatever it takes” attitude</li><li>Ability to work constructively with a team of manufacturing personnel, engineers and technicians</li>\n</ul>\n<strong>Highly preferred skills and certifications</strong>\n<ul>\n<li>Knowledge in SiC and related materials</li><li>Characterization skills such as XRD, SEM, TEM, Raman, PL</li><li>Simulation and data analysis skills and experience on tools such as FE multi physics simulation, COMSOL, Python, SEQUEL, Autodesk Inventor, ANSYS, ProE, AutoCAD, JMP, FIDAP or similar</li>\n</ul>\nSince our beginning 30 years ago, we have introduced innovative and disruptive solutions that enable a more efficient, productive and safer world. We continue our leadership in developing market-leading lighting-class LEDs, lighting products and semiconductor products for power and radio frequency (RF) applications. We believe in unlocking the power and potential of technology, enabling the world to do more with less. We aim to transform the way people experience light and are also leading the innovation of Power/RF products that move us toward a more energy efficient future.\n<br><br>\nBe part of our future and have a direct impact while working for an organization that provides a place to work alongside brilliant people, a competitive total rewards package, and a problem solving culture. We invite you to submit an application if you feel we would be a good fit.\n<br><br>\n<em>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, national origin, disability status, protected veteran status, or any other characteristic protected by law.</em>\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}