{"job title": "Scientist, Asst Bioinformatics", "company": "Emory University", "city state": "– Atlanta, GA", "rating": "4.1", "job description": "**Description**<br> <br><br> <br>JOB DESCRIPTION:<br> <br><br> <br>+ Under minimal supervision, the Assistant Scientist, Bioinformatics performs a wide range of highly technical and complex bioinformatics procedures.<br> <br>+ Qualification for this position requires demonstrated expertise in designing and developing software, databases, and interfaces for analyzing and manipulating research data applications including expertise with simple programming using Perl/Python or Java, statistical programming, web-development, and database query through SQL.<br> <br>+ This role collaborates with researchers to develop high throughput data processing and analysis capability.<br> <br>+ Directs and guides database searches and the computational analysis of resulting data.<br> <br>+ Provides direct technical support and helps guide, implement, and maintain further improvements to bioinformatics software, databases, and interfaces and works with the entire bioinformatics team to diagnose and fix related issues.<br> <br>+ May assist in grant and other funding applications, as necessary and appropriate.<br> <br>+ Demonstrated ability to function as part of a team. Performs other responsibilities as required.MINIMUM QUALIFICATIONS:<br> <br>+ PhD in bioinformatics, computer science, biological or physical science and three years of experience.<br> <br>+ Experience prior to achieving the PhD will be considered.<br> <br><br> <br>Apply Now<br> <br><br> <br>Sorry the Share function is not working properly at this moment. Please refresh the page and try again later.<br> <br><br> <br>**Connect With Us!**<br> <br><br> <br>Not ready to apply?<br> <br><br> <br>**Job Number** _24783_<br> <br><br> <br>**Job Type** _Regular Full-Time_<br> <br><br> <br>**Division** _School Of Medicine_<br> <br><br> <br>**Department** _SOM: Neurology: Cog Neurobehav_<br> <br><br> <br>**This position may involve the following Health and Safety issues:** _Not Applicable_<br> <br><br> <br>**Job Category** _Laboratory_<br><br>Emory University is an equal opportunity/equal access/affirmative action employer fully committed to achieving a diverse workforce and complies with all applicable Federal and Georgia State laws, regulations, and executive orders regarding nondiscrimination and affirmative action in its programs and activities. Emory University does not discriminate on the basis of race, color, religion, ethnic or national origin, gender, genetic information, age, disability, sexual orientation, gender identity, gender expression, and veteran's status. Inquiries about this statement should be directed to the Office of Equity and Inclusion, 201 Dowman Drive, Administration Bldg, Atlanta, GA 30322"}