{"job title": "Associate Product Development Scientist", "company": "Nature's Sunshine Products", "city state": "– Lehi, UT", "rating": "3.1", "job description": "Job Description<div><strong>Job Summary</strong><strong>:</strong>\n<br><br>\nPerforms the following types of duties: recommends, specifies, and evaluates proposed new materials; assists in batch failure analysis and effective solution implementation; participates in interdepartmental improvement activities; communicates and coordinates all project activities; operates and maintains formulation lab equipment; maintains proper documentation and keeps accurate records of all work; performs other related duties as assigned.\n<br><br>\n<strong>Job Summary</strong><strong>:</strong>\n<ul>\n<li>Ensures records regarding formulas, specifications, are correct in Oracle and Agile</li><li>Evaluates documentation of new and existing materials</li><li>Documents processes</li><li>Reviews and analyzes QA data</li><li>Manages and communicates project activities</li><li>Reviews departmental SOPs for accuracy</li><li>Submits proper documentation for label creation and regulatory compliance</li><li>Maintains proper documentation and keeps accurate records of all work</li><li>Works effectively with multiple departments to complete projects</li><li>Conducts departmental orientation</li><li>Performs other related duties as assigned</li>\n</ul>\n<strong>Requirements</strong><strong>:</strong>\n<ul>\n<li>Experience with CFR Title 21</li><li>Knowledge of microbiology, formula structure, lab procedures, and testing methodology</li><li>Knowledge of GMP regulations</li><li>Vendor relations experience</li><li>Knowledge in herbal and nutritional science preferred</li><li>Basic math skills</li><li>Experience with data analysis</li><li>Experience managing multiple tasks</li><li>Strong organizational skills</li><li>BS in applicable science field, e.g., food science, nutritional science, chemistry, biology</li>\n</ul>\nFor more information, or to apply now, you must go to the website below. Please DO NOT email your resume to us as we only accept applications through our website.\n<br><br>\nhttps://www.applicantpro.com/j/855518-316925</div>Company Description<div>AT NATURE'S SUNSHINE, WE ARE IN THE BUSINESS OF LIFE TRANSFORMATION.\n<br>\nWe believe that natural health and wellness has the power to change lives; and through our products, our people and our business opportunity, we work to make it a reality every day. So while transformation is a bold promise to make, we do so with confidence. Nature’s Sunshine brings health and wellness to millions of customers every day. And when people are healthier, lives are truly transformed.\n<br><br>\nOver 46 years ago, Nature’s Sunshine Products built its business on the core values of quality, service, and integrity. It is these same values that we seek in our employees and job applicants.\n<br><br>\nWe’re on a mission to change lives for the better—for our employees and our 300,000+ member sales force.\n<br><br>\n<strong>Nature’s Sunshine’s:</strong>\n<br>\nVISION: Our vision is to become the world’s premier health, wellness, and lifestyle company\n<br><br>\nMISSION: Our mission is to transform lives around the world by providing the most innovative and highest quality health solutions.\n<br><br>\n<strong>VALUES:</strong>\n<br><br>\nQUALITY: Setting the standards, not just meeting them\n<br>\nINTEGRITY: Doing what’s right because it’s right\n<br>\nSERVICE: Providing value and showing respect for all\n<br>\nCOMMUNITY: Connecting those who share our passion\n<br>\nINNOVATION: Nurturing a spirit of discovery and advancement\n<br>\nFrom the first day we opened our doors for business to the present day, we’ve maintained the highest standards in quality, integrity and innovation in our products, and best-in-class service to those we serve. We look for these same character attributes in our employees and job applicants.\n<br><br>\nWe also believe that for us to continue to grow as a company, we must give our employees opportunities to grow professionally, lead when possible, and thrive in a team environment.\n<br><br>\nIf you see yourself as a part of our committed corporate team, please check out our current job openings and submit your application on the link below,\n<br><br>\nhttps://www.naturessunshine.com/us/company/c1/careers/</div>"}