{"job title": "Principal Scientist - Group Leader, Disease Biology", "company": "Recursion Pharmaceuticals", "city state": "– Salt Lake City, Utah", "rating": "4.6", "job description": "<strong>WHAT WE DO</strong>\n<br><br>\nPoised at the crossroads of biology and computation, Recursion is revolutionizing the pharmaceutical industrys approach to drug discovery. Our unique platform leverages the most advanced biology, high-throughput automation, and artificial intelligence to rapidly discover treatments for rare diseases, diverse immune and inflammatory diseases and new indications in the future.\n<br><br>\nWe start with human cells in our automated laboratory, where we do more than 100k experiments each week (e.g. model a disease of interest, add a chemical compound, or some combination of those). We then image the cells using high throughput microscopy, resulting in about 2 million new images or greater than 20 terabytes of data each week. These data are analyzed using computer vision and machine learning methods that help us measure how cell morphology changes in subtle ways in each biological context. We can answer direct questions (e.g. are there compounds that rescue a disease-specific set of morphological changes?), and over time as our dataset has increased, we can ask more complex questions across biology. From the outset, our approach is agnostic to preconceived notions and dogma. Potential treatments from this platform are then evaluated by our discovery biology team, who develop a literature-based understanding of the disease and use traditional wet-lab approaches to confirm and prioritize the hits.\n<br><br>\n<strong>HOW YOULL CONTRIBUTE</strong>\n<br><br>\nIn the Discovery organization, you will lead a research unit as part of our Disease Biology team. Using cellular and molecular biology techniques, you will drive many programs forward in parallel. Time is of the essence, and you will need to identify the most rapid way to make go/no-go decisions for each program in your purview.\n<br><br>\nThis role is ideal for someone who thrives on continuous learning and endless variety. On any given day, you'll work with a team to research multiple diseases as they come through the pipeline and drive quantitative biology approaches to rapidly enable us to prioritize or deprioritize compound hits for further research and development. In addition, you will execute, automate and scale those assays, manage projects and teams, communicate results and conclusions to a broader audience and champion candidate molecules towards clinical development.\n<br><br>\nFor this role, we are looking for people who are eager to:\n\n<ul>\n<li><strong>Lead</strong>- <em>We want scientists who thrive on being in the drivers seat.</em> You will act as a project champion to ensure the teams are focused on decision making experiments.</li> \n\n<li><strong>Deliver</strong>- <em>We want scientists that understand what is needed for the critical path.</em> You will need to mentor and guide your team to deliver high quality results that lead to key decisions to advance or discontinue programs across multiple diseases simultaneously.</li>\n<li><strong>Collaborate-</strong><em>We want scientists who are engaging.</em> In addition to managing a group of biologists, you will also work cross functionally with team members outside of Discovery, including Data Science, Software Engineering, and High Throughput Screening teams to drive our projects forward.</li>\n</ul>\n<strong>THE EXPERIENCE YOULL NEED</strong>\n\n<ul>\n<li>A Ph.D. in a biological field (experience in Immunology and Infectious Diseases are a strong plus)</li>\n<li>A record of outstanding past projects, publications, and collaborations</li>\n<li>7+ years of industry-based drug discovery experience, including experience leading drug discovery projects, managing and directing a team of biologists, and working cross-functionally</li>\n<li>Proven experience in evaluating and prioritizing candidates for further study</li>\n<li>Experience hiring exceptional talent</li>\n<li>Ability to multi-task and lead several projects simultaneously</li>\n<li>A passion for reading biological/medical literature and ability to rapidly understand new disease areas</li>\n</ul>\n<strong>THE PERKS YOULL ENJOY</strong>\n\n<ul>\n<li>Coverage of health, vision, and dental insurance premiums (in most cases 100%)</li>\n<li>401(k) with generous matching (immediate vesting)</li>\n<li>Stock option grants</li>\n<li>Two one-week paid company closures (summer and winter) in addition to flexible, generous vacation/sick leave</li>\n<li>Commuter benefit and vehicle parking to ease your commute</li>\n<li>Complimentary chef-prepared lunches and well-stocked snack bars</li>\n<li>Generous paid parental leave (including adoptive)</li>\n<li>Fully-paid gym membership to Metro Fitness, located just feet away from our new headquarters</li>\n<li>Gleaming new 100,000 square foot headquarters complete with a 70-foot climbing wall, showers, lockers, and bike parking</li>\n</ul>\n<em>Recursion is an equal opportunity employer and complies with all applicable federal, state, and local fair employment practices laws. Recursion strictly prohibits and does not tolerate discrimination against applicants because of race, color, religion, creed, national origin or ancestry, ethnicity, sex, pregnancy, gender (including gender nonconformity and status as a transgender individual), age, physical or mental disability, citizenship, past, current, or prospective service in the uniformed services, or any other characteristic protected under applicable federal, state, or local law.</em>"}