{"job title": "Quantitative Researcher in Machine Learning", "company": "Two Sigma", "city state": "– New York, New York, United States", "rating": "3.6", "job description": "At Two Sigma, we’re different from other investment firms. Founded by a statistician and a computer scientist, our approach is systematic and diversified. The global markets fuel our imagination with unlimited information to study, countless efficient ways to take action and meaningful opportunity to improve by iteration. We draw ideas and inspiration from the broader math, science, and investment communities.\n<br><br>\nWhen you work with us, you get to tackle tough problems alongside other scientists and engineers. People who will challenge your ideas. Who you can really learn from, and collaborate with. And you’re doing work that matters to a lot of people, too. Our investors include some of the world’s largest retirement funds, research institutions, educational endowments, healthcare systems and foundations. We admire what they do, and we’re proud to work with these organizations.\n<br><br>\n<strong>WHAT YOU'LL DO</strong>\n<br><br>\nAs a quantitative machine learning researcher, you will:\n<br><br>\n* Use a rigorous scientific method to develop sophisticated trading models and shape our insights into how the markets will behave\n<br><br>\n* Apply machine learning to a vast array of datasets\n<br><br>\n* Create and test complex investment ideas and partner with our engineers to test your hypotheses\n<br><br>\nAll the while, you’ll get to stay engaged in the academic community. As examples, you can:\n<br><br>\n* Join our reading circles to stay up to date on the latest research papers in your field\n<br><br>\n* Attend academic seminars to learn from thought leaders from top universities\n<br><br>\n* Share insights from conferences focused on statistics, machine learning, and data science\n<br><br>\n<strong>WHAT WE ARE LOOKING FOR</strong>\n<br><br>\nYou’ll do best in this role if you:\n<br><br>\n* Have a degree in a technical or quantitative discipline, like statistics, mathematics, physics, electrical engineering, or computer science (all levels welcome, from bachelor’s to doctorate)\n<br><br>\n* Possess intermediate skills in at least one programming language (like C, C++, Java, or Python)\n<br><br>\n* Understand the ins and outs of machine learning algorithms—and can tweak them as needed\n<br><br>\n* Applied machine learning to real-world datasets\n<br><br>\n* Are an independent thinker who can creatively approach data analysis and communicate complex ideas clearly\n<br><br>\n* Published your work in journals and/or have presented at conferences\n<br><br>\nYou don’t need a background in finance. It’s nice to have, but more than half of Two Sigma’s employees come from outside the finance industry. If you’ve got the quantitative skills, we will teach you the financial aspect of the job.\n<br><br>\n<strong>READY TO APPLY?</strong>\n<br><br>\nIf this sparks your interest, let’s connect."}