{"job title": "Research Scientist 1", "company": "University of Washington", "city state": "– Seattle, WA", "rating": "4.1", "job description": "As a UW employee, you will enjoy generous benefits and work/life programs. For a complete description of our benefits for this position, please visit our website, click here. As a UW employee, you have a unique opportunity to change lives on our campuses, in our state and around the world. UW employees offer their boundless energy, creative problem solving skills and dedication to build stronger minds and a healthier world.\n<br><br>\nUW faculty and staff also enjoy outstanding benefits, professional growth opportunities and unique resources in an environment noted for diversity, intellectual excitement, artistic pursuits and natural beauty. All of which has allowed the UW to be nationally recognized as a \"Great College to Work For\" for four consecutive years.\n<br><br>\nThe Department of Genome Sciences (GS) is part of the University of Washington School of Medicine and is comprised of 26 labs addressing leading edge questions in biology and medicine by developing and applying genetic, genomic and computational approaches taking advantage of genomic information now available for a host of species. GS is making major contributions in the application of genome science to understand the fundamentals of biology and to improve human health and wellbeing. Genome Sciences is a collaborative department supported by very different academic disciplines. We work with a multitude of Program Investigators (PIs) in departments both on the UW campus as well as worldwide. The department has gone through significant expansion since its beginning in 2001 with annual grant awards of $67M in FY17. The department has 47 training, teaching, and research faculty.\n<br><br>\nThe Department of Genome Sciences currently has an outstanding opportunity for a RESEARCH SCIENTIST 1.\n<br><br>\nThe Research Scientist 1 will conduct genetic, molecular and behavioral studies aimed at testing the therapeutic potential of investigative compounds for treating mitochondrial disorders.\n<br><br>\nThe Research Scientist 1 (RSE 1) will be responsible for setting up and performing assays to test candidate therapeutic compounds using the fruit fly Drosophila melanogaster.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nPerform genetic experiments aimed at identifying appropriate Drosophila strains for drug screening.\n<br><br>\nAdminister a large array of investigational compounds to flies and test the effects on their behavior and biochemistry.\n<br><br>\nProvide technical support on other projects as time permits.\n<br><br>\nHire, train, and supervise undergraduate student laboratory assistants.\n<br><br>\nPerform standard microbial genetics techniques such as cloning and transformation.\n<br><br>\nPerform routine analysis of data and assist with troubleshooting and daily quality control of data.\n<br><br>\nProvide status reports to immediate supervisor.\n<br><br>\nAssist with basic lab maintenance including ordering supplies, preparing Drosophila media, shipping stocks and helping with chemical safety paperwork.\n<br><br>\nParticipate in research-related discussion during weekly lab meetings.\n<br><br>\nPerform related duties as required.\n<br><br>\nThe position demands organization, commitment, the ability to work with others, the ability to maintain alaboratory notebook, and experience in laboratory protocols.\n<br><br>\n<strong>Minimum Requirements:</strong>\n<br><br>\nBachelor's degree in Biology or related field.\n<br><br>\nAt least 3 months of experience, whether academic or professional, working with routine molecular biology techniques, including PCR, western blotting, agarose gel electrophoresis, recombinant DNA.\n<br><br>\nMust be able to perform repetitive but delicate work with care and exact attention to procedural detail.\n<br><br>\nMust be able to lift 30 pounds.\n<br><br>\nMust be self-motivated with the ability to take initiative and work independently.\n<br><br>\nExcellent communication skills.\n<br><br>\nMeticulous record-keeping skills.\n<br><br>\nStrong organizational abilities.\n<br><br>\nBasic computational skills (MS Word, MS Excel). Knowledge of Google Docs desirable.\n<br><br>\nEquivalent education/experience will substitute for all minimum qualifications except when there are legal requirements, such as a license/certification/registration.\n<br><br>\n<strong>Desired Requirements:</strong>\n<br><br>\nAt least 12 months of experience, whether academic or professional, working with the fruit fly Drosophila melanogaster, and with routine molecular biology techniques, including PCR, western blotting, agarose gel electrophoresis, recombinant DNA.\n<br><br>\n<strong>Application Process:</strong>\n<br><br>\nThe application process for UW positions may include completion of a variety of online assessments to obtain additional information that will be used in the evaluation process. These assessments may include Work Authorization, Cover Letter and/or others. Any assessments that you need to complete will appear on your screen as soon as you select \"Apply to this position\". Once you begin an assessment, it must be completed at that time; if you do not complete the assessment you will be prompted to do so the next time you access your \"My Jobs\" page. If you select to take it later, it will appear on your \"My Jobs\" page to take when you are ready. Please note that your application will not be reviewed, and you will not be considered for this position until all required assessments have been completed."}