{"job title": "Biological Scientist III", "company": "University of Florida", "city state": "– Gainesville, FL", "rating": "4.2", "job description": "<strong>Job no:</strong> 507256\n<br>\n<strong>Work type:</strong> Staff Full-Time\n<br>\n<strong>Location:</strong> Main Campus (Gainesville, FL)\n<br>\n<strong>Categories:</strong> Agriculture/Life Science/Vet Medicine\n<br>\n<strong>Department:</strong>60080000 - AG-AGRONOMY<br>\n<div>\n<div>Classification Title:<br><br>Biological Scientist III</div> <div>Job Description:<br><br>Full-Time/Time-Limited\n<br><br>\n- The Biological Scientist III will play a critical role in coordination of all aspects of breeding and biotechnology research for improvement of sugarcane, cereals, turf and forage grasses, collection and compilation of data, field trial planning and execution within the grass biotechnology program http://agronomy.ifas.ufl.edu/fredy-altpeter/profile/ at the University of Florida-IFAS.\n<br><br>\n- In conjunction with project leader, define research objectives and design plant molecular biology, plant physiology and plant breeding experiments that are required to meet the objectives and contribute to the development of grant proposals to attract external funding. Studies will include laboratory, greenhouse, growth chamber, and field projects.\n<br><br>\n- Train undergraduate and graduate students, postdoctoral research associates, and visiting scientists in methods of plant molecular biology, plant physiology and plant management as well as the proper and safe use of laboratory greenhouse and field equipment.\n<br><br>\n- Independently carry out well-designed experiments using plant molecular biology, plant physiology and plant breeding techniques. Collect, analyze, and prepare data for the purpose of laboratory reports, presentation of posters or papers at the appropriate scientific meetings, publication of abstracts and manuscripts and to aid in the design of future experiments.\n<br><br>\n- Conduct literature reviews of relevant research topics.\n<br><br>\n- Order, appropriately store and monitor the appropriate use of all chemicals, enzymes, radioisotopes, pesticides, field and greenhouse supplies, equipment, and all other biological and non-biological supplies needed for the research. Maintain a hardcopy and computer disk copy of all laboratory inventory, pesticide use and use of radioisotopes.\n<br><br>\n- Ensure proper maintenance and functioning of all laboratory, growth chamber, greenhouse and field equipment. Perform or direct staff in necessary lab and greenhouse and growth chamber maintenance and safety functions such as autoclaving of tissue culture media, pipette tips and microfuge tubes, as well as preparation of laboratory stock solutions, and handling of field, laboratory and greenhouse material, providing the required growth environments for tissue cultures or plants.\n<br><br>\n<strong>NORMAL WORK SCHEDULE</strong>\n<br><br>\nMonday through Friday, 8:00 am to 5:00 pm (40 hr/week). Certain experiments may require a deviation from this schedule occasionally.\n<br><br>\n<strong>PROGRAM DIRECTION and DEVELOPMENT</strong>\n<br><br>\nIn conjunction with project leader, designs experiments to improve all aspects of breeding and biotechnology research for sugarcane, cereals, turf and forage grasses.</div>\n<br>\n<div>Advertised Salary:<br><br>$44,000.00 - $48,200.00: commensurate w/experience</div> <div>Minimum Requirements:<br><br>Doctoral degree in biology or a closely related field and two years of relevant experience; or a master’s degree in biology or a closely related field and five years of relevant experience; or a bachelor’s degree in biology or a closely related field and seven years of relevant experience.</div> <div>Preferred Qualifications:<br><br>A PhD in plant science or related area with relevant postdoctoral experience is preferred. Knowledge of current plant molecular biology, plant physiology and plant breeding techniques is essential. This includes knowledge of greenhouse, field and laboratory safety procedures and experience with plant breeding or plant management under field conditions.\n<br><br>\nExtensive experience with plant molecular biology techniques including, gene transfer, sequence comparison, molecular cloning, stable expression of transgenes in plants, PCR, Southern, Northern, Western blot analysis is required.\n<br><br>\nAbility to trouble-shoot experimental problems and work independently and in a team is essential. Excellent communication skills are required.</div> <div>Special Instructions to Applicants:<br><br>In order to be considered, you must upload your cover letter and resume.\n<br><br>\nApplication must be submitted by 11:55 p.m. (ET) of the posting end date.</div> <div>Health Assessment Required: No</div> </div>\n<br><strong>Advertised:</strong> 04 Sep 2018 Eastern Daylight Time\n<br>\n<strong>Applications close:</strong> 30 Sep 2018 Eastern Daylight Time"}