{"job title": "Data Engineer", "company": "VIVA USA", "city state": "– Chicago, IL", "rating": "4.3", "job description": "Req Ref No: MPILDE202\n<br>\nLocation: Chicago, IL\n<br>\nDuration: 6.0 months\n<br><br>\nDescription\n<br><br>\n<strong>Qualifications:</strong>\n<br>\nKnowledge and Skills\n<br><br>\nKnowledge of data warehouse technical architectures and ETL/ELT processes Knowledge of scripting languages Knowledge and proven understanding of big data tools and software Critical thinking and decision making abilities Possesses strong written and verbal communication skills Demonstrates excellent customer service skills Excellent attention to detail Education and Experience Bachelor's degree in Computer Science, related field or equivalent experience One or more years of relevant work experience\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nJob Summary\n<br><br>\nThe Data Engineer creates and enhances data solutions enabling seamless delivery of data. This position is responsible for collecting, parsing, managing and analyzing large sets of data across different domains for analysis. This role designs and develops data pipelines (data ingestion and ETL processes) that are scalable, repeatable and secure for stakeholder needs. This role operates under minimal supervision and has no direct reports. Principal Duties and Responsibilities Data Management Assists in creating the data management strategies to support business intelligence efforts for various stakeholders Builds out data architecture to support data strategy Leads the design of the logical data model and implements the physical database structure Constructs and implements operational data stores and data marts Provide support for deployed data applications and analytical models by being a trusted advisor to Data Scientists and other data consumers by identifying data problems and guiding issue resolution Data Pipeline Management Develops real-time and batch ETL data processes aligned with business needs Manages and augments the data pipeline from raw OLTP databases to data solution structures Documents data flow diagrams, security access, data quality and data availability across all business systems\n<br><br>\nComments/Special Instructions\n<br><br>\nThe successful candidate will be working with a team focused on business intelligence and data science using data modeling ETL Data Query. Must have proven Teamwork Collaboration Self Starter Critical thinking skills.Adaptability, and proven Communication skills. Responsibilities include Big Data Warehouse design, Data Management Program design, Technical adaptability to new big data tools/environment Successful candidate must have good prior experience with big data architecture in HADOOP environment and knowledge of tools used. Needs to be able to communicate/collaborate/consult with existing data team members to help pave path for a future state of the data project.\n<br><br>\nVIVA is an equal opportunity employer. All qualified applicants have an equal opportunity for placement, and all employees have an equal opportunity to develop on the job. This means that VIVA will not discriminate against any employee or qualified applicant on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status."}