{"job title": "Big Data Engineer ASE5", "company": "Wells Fargo", "city state": "– Chandler, AZ", "rating": "3.5", "job description": "<strong>Job Description</strong><br><br>At Wells Fargo, we have one goal: to satisfy our customers financial needs and help them achieve their dreams. Were looking for talented people who will put our customers at the center of everything we do. Join our diverse and inclusive team where youll feel valued and inspired to contribute your unique skills and experience.\n<br><br>\nHelp us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you.\n<br><br>\nEnterprise Finance &amp; Information Technology offers technology and services that exceed Wells Fargo customers expectations and directly enable them to succeed financially. We interact with customers more than 12 billion times a year through in-store, online, ATM, and telephone transactions. We impact customers directly, through systems availability and security, as well as indirectly, through our business partners who offer and deliver a myriad of products and services that meet customers financial needs. We provide a competitive advantage for the company through excellence in fundamentals, integrated partnerships, and our talented and engaged team members.\n<br><br>\n<strong><u>Job Description:</u> </strong>\n<br><br>\nNew and emerging technologies such as artificial intelligence (AI) are helping us deliver insightful and personalized experiences for customers and team members, drive greater operational efficiency, and better manage risk. The Enterprise Information Technology - Artificial Intelligence Technology team is creating a unified enterprise Machine Learning (ML) Platform that will enable end to end solution for other business lines to build and deploy their ML models.\n<br><br>\nOur team is looking for a highly motivated and experienced Java Developer to focus on building a unified solution to automate Machine Learning (ML) and Natural Language Processing (NLP) projects. The system will encompass not just the model learning itself, but also many practical challenges in ML systems: feature extraction/feature definition, data validation, monitoring, and management of features/models. Comparable systems include Facebook's FBLearner Flow, Google's TFX, and Uber's Michelangelo. Your architectural knowledge and experience will help us improve the reliability and efficiency of our platform as it grows. You will partner closely with product, design, data science, and our scientific teams to build web based tools to support data science life cycle.\n<br><br>\nIn this role you will be responsible for the:\n<ul>\n <li>Design and develop a framework for easily assembling training workflows and data pipelines for machine learning.</li> <li>Design and develop tools that allow large teams of modeling engineers to iterate on model quality and that help them keep their ML systems running smoothly.</li> <li>Addressing a wide range of challenging problems using techniques from applied statistics, machine learning and/or data mining fields.</li>  <li>Develop infrastructure for AI and analytic software development, automated testing, and release management.</li>\n</ul>\n\n<strong>Required Qualifications</strong>\n<ul>\n<li>7+ years of application development and implementation experience</li><li>2+ years of Python experience</li><li>3+ years of Hadoop experience</li>\n</ul>\n<strong>Desired Qualifications</strong>\n<ul>\n<li>Good verbal, written, and interpersonal communication skills</li><li>Experience with Spark, Hive and Kafka</li><li>1+ years of experience with machine learning tools</li><li>SQL experience</li><li>Ability to develop rule-based models, advanced predictive models, and descriptive statistics</li><li>Ability to dissect technical problems, analyze data, and recommend potential solutions</li><li>Ability to facilitate functional and systems design sessions</li><li>Ability to organize and manage multiple priorities</li><li>Ability to work effectively, as well as independently, in a team environment</li>\n</ul>\n<strong>Disclaimer</strong><br><br>All offers for employment with Wells Fargo are contingent upon the candidate having successfully completed a criminal background check. Wells Fargo will consider qualified candidates with criminal histories in a manner consistent with the requirements of applicable local, state and Federal law, including Section 19 of the Federal Deposit Insurance Act.\n<br><br>\nRelevant military experience is considered for veterans and transitioning service men and women.\n<br><br>\nWells Fargo is an Affirmative Action and Equal Opportunity Employer, Minority/Female/Disabled/Veteran/Gender Identity/Sexual Orientation."}