{"job title": "Associate Scientist", "company": "Amgen Inc", "city state": "– Cambridge, Massachusetts", "rating": "3.7", "job description": "To underpin our commitment to bring safe and transformative medicines to patients, we are growing our highly innovative Translational Systems Toxicology group at Amgen.\n<br><br>\nAmgen is seeking an Associate Scientist-Toxicology to work out of their Cambridge, MA location.\n<br><br>\nOur mission is to ensure that both the drugs and drug targets we develop are safe and that side effects are minimized or eliminated. To achieve this we are applying a variety of human in vitro approaches (including human genetics along with cell, molecular and structural biology techniques) to develop assays that can predict or elucidate mechanisms leading to drug safety issues. In addition to working broadly to support pipeline projects, we are also developing novel methodologies for assessing the safety of our drug targets in human systems with the long-term goal of being able to focus our future regulatory studies in this area.\n<br><br>\nWe are seeking a talented Associate Scientist with expertise in cellular and molecular biology assays to join our growing group. The successful candidate will play a hands on role in the lab as part of our cell and molecular biology team.\n<br><br>\nKey Responsibilities of the Associate Scientist:\n<li>Driving wet lab efforts with a focus on establishing and utilizing a variety of cell based models (including iPSC, primary cell, organoid and three-dimensional) to develop assays to predict and investigate drug safety issues</li><li>Application of an array of cell and molecular biology techniques to derive insight into molecular pathways that are perturbed by potential therapeutics or target intervention including a variety of omics approaches</li><li>Analysis, interpretation, meticulous documentation and presentation of data in group, department and project team meetings</li><li>Assessment and development of new technologies and approaches that drive efficiency and/or allow us to address key questions around drug safety in humans</li>\n<strong>Basic Qualifications:</strong>\n<br><br>\nMS with 2+ years of Pharmaceutical or Biotech industry experience\n<br><br>\nOR\n<br><br>\nBS with 4+ years of Pharmaceutical or Biotech industry experience\n<br><br>\n<strong>Preferred Qualifications:</strong>\n<li>Masters degree</li><li>3+ years of experience in cellular, molecular, or genomic research within the biotechnology industry</li><li>Experience in a variety of cellular, and molecular biology approaches and techniques.</li><li>Expertise in the establishment of cell based assays and approaches as applied to drug discovery efforts.</li><li>Comfort in working in a highly interactive and vibrant environment designed to promote frequent interaction and brainstorming</li>\n\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status."}