{"job title": "EUV Staff Systems Scientist", "company": "ASML", "city state": "– California,San Diego", "rating": "3.8", "job description": "“<em>This position requires access to controlled technology, as defined in the Export Administration Regulations (15 C.F.R. § 730, et seq.). Qualified candidates must be legally authorized to access such controlled technology prior to beginning work. Business demands may require ASML to proceed with applicants who are immediately eligible to access controlled technology</em>.”\n<br><br>\nASML is one of the world’s leading manufacturers of lithography systems that help enable Moore’s Law and the creation of increasingly powerful and capable electronic devices. At our San Diego location we are renowned for developing both deep ultraviolet (DUV) lithography light sources and next generation extreme ultraviolet (EUV) light sources. We are a multinational company with over 70 locations in 16 countries, headquartered in Veldhoven, the Netherlands.\n<br><br>\nIf you have a passion for technology and innovation you’ll want to check us out. Be a part of ASML. Be a part of progress.<br>\n<div><strong>Summary</strong> </div>\n<br>We are presenting you with a unique and exciting opportunity to join a dynamic and innovative Technology Development team, focused on conceiving and demonstrating the technologies required for next generations of high-power extreme ultraviolet (EUV) light sources. Based on a laser produced plasma (LPP), our light source relies on a wide range of unique and challenging technologies, ranging from laser light amplification and high-power optical systems to laser produced plasma for EUV generation, electro-optical signal detection and algorithm-based actuation for process control. You are invited to bring your passion, knowledge and expertise in areas of applied physics, plasmas, metrology, optics, controls, lasers, and experiment design to push the boundaries of these technologies forward.<br>\n<div><strong>Responsibilities</strong></div>\n\n\n<ul>\n<li>Guide development of high-level architecture as well as specific techniques for metrology, actuation, stabilization (both passive and active), and control in order to improve the EUV generation process</li>\n<li>Identification of key scientific learning objectives and corresponding experimental design which will further the technological progress of the EUV generation process</li>\n<li>Provide metrology, actuation, and stabilization design guidelines, performance requirements and procedures to product teams</li>\n<li>Demonstration of system-wide performance targets to meet the future technology roadmap</li>\n<li>Plan, develop and execute system and subsystem performance tests, analyze test results and extract actionable knowledge from sub-module to full-system levels</li>\n<li>Troubleshoot issues with laser, tin delivery, and optical systems in order to improve the EUV generation process</li>\n<li>Document learning and communicate knowledge to engineering and product development teams to guide product improvement and release of new product nodes</li>\n<li>Work independently and in teams to deliver on a stated objective, whether it be the pursuit of new knowledge, the demonstration of a new capability, or the characterization of existing performance</li>\n</ul>\n\n<div>\n\n\n<ul>\n<li>Guide development of high-level architecture as well as specific techniques for metrology, actuation, stabilization (both passive and active), and control in order to improve the EUV generation process</li>\n<li>Identification of key scientific learning objectives and corresponding experimental design which will further the technological progress of the EUV generation process</li>\n<li>Provide metrology, actuation, and stabilization design guidelines, performance requirements and procedures to product teams</li>\n<li>Demonstration of system-wide performance targets to meet the future technology roadmap</li>\n<li>Plan, develop and execute system and subsystem performance tests, analyze test results and extract actionable knowledge from sub-module to full-system levels</li>\n<li>Troubleshoot issues with laser, tin delivery, and optical systems in order to improve the EUV generation process</li>\n<li>Document learning and communicate knowledge to engineering and product development teams to guide product improvement and release of new product nodes</li>\n<li>Work independently and in teams to deliver on a stated objective, whether it be the pursuit of new knowledge, the demonstration of a new capability, or the characterization of existing performance</li>\n</ul>\n<strong>Minimum Qualifications</strong>\n\n<ul>\n<li>PhD or MS degree with a minimum of 8 years of relevant experience in physics, plasma engineering, photonics or equivalent field</li>\n<li>Deep understanding of scientific research methods and strong curiosity</li>\n<li>The successful candidate will not only have excelled in their technical field, but will have demonstrated inter-personal and communications strengths</li>\n<li>Hands-on experience with complex system design and build, characterization, and troubleshooting</li>\n<li>Extensive experience with experimental data analysis and development of data analysis tools with, for instance, Matlab or Python and data acquisition systems such as NI Labview</li>\n<li>Ability to clearly and logically communicate ideas and knowledge to various audiences</li>\n</ul>\n<strong>Preferred Skills And Experience Qualifications</strong>\n\n<ul>\n<li>Practical experience with breadth of metrology techniques and system design, including laser produced plasma systems</li>\n<li>High-precision optical metrology development, including associated high-speed data acquisition and integration with control system functionality</li>\n<li>Demonstrated ability to manage and lead a research project involving multiple stakeholders and constraints</li>\n<li>Demonstrated ability to work effectively as a part of a team and lead investigation and research efforts</li>\n</ul>\n<strong>PHYSICAL DEMANDS AND WORK ENVIRONMENT</strong>\n<br><br>\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n<ul>\n<li>While performing the duties of this job, the employee routinely is required to sit; walk; talk; hear; use hands to keyboard, finger, handle, and feel; stoop, kneel, crouch, twist, reach, and stretch.</li> \n\n<li>The employee is occasionally required to move around the campus.</li> \n\n<li>The employee may occasionally lift and/or move up to 20 pounds.</li>\n<li>May require travel dependent on business needs.</li>\n<li>Specific vision abilities required by this job include close vision, color vision, peripheral vision, depth perception, and ability to adjust focus.</li>\n<li>Can work under deadlines</li> </ul></div>\n\n<br>"}