{"job title": "Soil Scientist", "company": "Department Of Agriculture", "city state": "– Cass Lake, MN", "rating": "4.1", "job description": "<ul>\n<li>Videos</li>\n<li>Duties</li>\n</ul>\n\nHelpDuties Summary\n<br><br>\nWho May Apply: Current permanent Federal employees with competitive status, Land Management Workforce Flexibility Act, CTAP/RPL/ICTAP, VEOA, and reinstatement eligibles; Farm Service Agency permanent county employees; 30% or more disabled veterans; Individuals with Disabilities; former Peace Corps or VISTA volunteers; Public Land Corp eligibles; Resource Assistants; and those eligible for other Hiring Authorities.\n<br><br>\nThere are two positions available. One is located on Chippewa National Foreston at the Supervisor's Office in Cass Lake, MN. One is located on the Nez Perce-Clearwater National Forest at the Supervisor's Office in Kamiah, ID.\n<br><br>\nThese positions serve as a fully operating professional Soil Scientist.\n<br><br>\nFor additional information about the duties of this position in Cass Lake, please contact Jim Gries at 218-407-5831 or jgries@fs.fed.us. For additional information about the duties of this position in Kamiah, ID, please contact Michele Windsor at 208-935-4282 or micheleawindsor@fs.fed.us.\n<br><br>\nPay rates vary depending on location. Pay rates displayed above are for the Rest of the U.S. (RUS). See the OPM website at http://www.opm.gov/policy-data-oversight/pay-leave/salaries-wages/ for additional information on pay rates for specific locations.\n<br><br>\nLearn more about this agency\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nProvides technical expertise in analyzing soil related information related to theland management planning process. Formulates and recommends Forest short range programs for soils management and provides technical evaluation and support to the development of long range plans.\n<br><br>\nConducts reconnaissance and detailed soil surveys in areas of moderate complexity. Is completely responsible for development and interpretation of soil survey legend.\n<br><br>\nProvides soil related information needed to develop and maintain the Forest Land Management Plan, compartment examination prescriptions, and other project proposals and environmental analyses. Serves on interdisciplinary teams conducting environmental analyses of proposed projects.\n<br><br>\nServes as a technical expert on environmental programs that involve complex and conflicting program goals and requirements. Monitors ongoing projects to evaluate the effects of management practices on the soil.\n<br><br>\nPrepares inventory reports which include inventory descriptions, and map unit descriptions characteristics. Prepares technical papers.\n<br><br>\nAdvises land managers of capabilities and limitations of soils for a variety of contemplated uses and activities (e.g., timber sales, watershed rehabilitation projects, transportation planning, or recreation development).\n<br><br>\nConducts training of personnel in the use and application of exploratory soil surveys.\n<br><br>\nTravel Required\n<br><br>\nOccasional travel - Occasional travel for trainings and meetings may be required\n<br><br>\nSupervisory status\n<br><br>\nNo\n<br><br>\nPromotion Potential\n<br><br>\n<strong>11</strong>\n<br><br>\nWho May ApplyThis job is open to Current permanent Federal employees with competitive status, Land Management Workforce Flexibility Act, CTAP/RPL/ICTAP, VEOA/VRA and reinstatement eligibles; Farm Service Agency permanent county employees; 30% or more disabled veterans; Individuals with Disabilities; former Peace Corps or VISTA volunteers; Public Land Corp eligibles; Resource Assistants; and eligibles for other Hiring Authorities.\n<br><br>\nQuestions? This job is open to 6 groups.\n\n\n<ul>\n<li>Job family (Series)</li>\n</ul>\n\n0470 Soil Science\n<br><br>\nSimilar jobs\n\n\n<ul>\n<li>Scientists, Soil</li>\n<li>Soil Scientists</li>\n<li>Requirements</li>\n</ul>\n\nHelpRequirements Conditions of Employment\n\n\n<ul>\n<li>You must be a US Citizen or US National</li>\n<li>Males born after 12/31/59 must be Selective Service registered or exempt</li>\n<li>Satisfactory background investigation and/or fingerprint check</li>\n<li>Successful completion of a one-year probationary or trial period</li>\n</ul>\n\n<strong>ADDITIONAL INFORMATION:</strong>\n<br><br>\nA total of two positions which are both at grade GS-11 may be selected from this announcement. Each location will house one position. Union (Bargaining Unit), Telework, and Transfer of Station (TOS) information are as follows:\n<br><br>\nDefinition of Basic Transfer of Station (TOS): Entitlements for payment of basic moving expenses as required and to the extent allowed by the Federal Travel Regulations (FTR) 302-3.101, are authorized for eligible applicants changing duty station when the change meets the distance tests as provided in FTR 302-1.1 and 302-2.6.\n<br><br>\nSelectee will be responsible for tax obligations related to payments for moving expenses - 2017 Tax Cuts and Job Act, Public Law 115-97. Questions should be directed to the Travel Help Desk, 877-372-7248, Option 1, or email asc_tos@fs.fed.us.\n<br><br>\nCass Lake, MN\n\n\n<ul>\n<li>TOS: Yes. In addition: House Hunting Trip. Other relocation benefits may be negotiated with selectee.</li>\n<li>Telework: Yes</li>\n<li>Bargaining Unit: No</li>\n<li>Full Performance Level of the Position: GS-11</li>\n<li>Travel: Yes Occasional Travel for trainings and meetings.</li>\n</ul>\n\nKamiah, ID\n\n\n<ul>\n<li>TOS: Yes. In addition: House Hunting Trip and Temporary Quarters</li>\n<li>Telework: No</li>\n<li>Bargaining Unit: Yes</li>\n<li>Full Performance Level of the Position: GS-11</li>\n<li>Travel: Yes Occasional Travel for trainings and meetings.</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\nApplicants must meet all qualifications and eligibility requirements by the closing date of the announcement (or date of referral if an Open Continuous announcement) as defined below. For more information on the qualifications for this position, go to: http://www.opm.gov/qualifications/Standards/group-stds/gs-admin.asp\n<br><br>\nDegree: Successful completion of a full 4-year course of study in an accredited college or university leading to a bachelor's or higher degree that included a major field of study in soil science or a closely related discipline that included 30 semester hours or equivalent in biological, physical, or earth science, with a minimum of 15 semester hours in such subjects as soil genesis, pedology, soil chemistry, soil physics, and soil fertility.\n<br><br>\n<strong>OR</strong>\n<br><br>\nCombination of education and experience -- courses equivalent to a major in soil science or a related discipline that included at least 30 semester hours in the biological, physical, or earth sciences. At least 15 of these semester hours must have been in the areas specified above, plus appropriate experience or additional education.\n<br><br>\nIn addition to the requirements described above, the following additional education and/or experience are required for the grade(s) specified.\n<br><br>\nFor the GS-11 level: Applicants must have 3 years of progressively higher level graduate education leading to a Ph.D. degree or Ph.D. or equivalent doctoral degree (coursework directly related to position being filled) from an accredited college or university; OR one year of specialized experience equivalent to at least the GS-9 level; OR an appropriate combination of specialized experience and graduate level education (beyond what is required for a master's degree, i.e., more than 36 semester hours leading to a Ph.D.).\n<br><br>\nExamples of specialized experience are: Conducted reconnaissance and detailed soil surveys including field and/or laboratory examination, description, classification, and mapping of soils; Prepared soil survey reports, watershed restoration plans, erosion control plans, soil resource improvement plans, or soil management reports; Analyzed soils and related information and prepared interpretative material used to develop land management functional plans and resource use plans to ensure soil stability and erosion control protection.\n<br><br>\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n<br><br>\nTIME IN GRADE REQUIREMENT: If you are a current federal employee in the General Schedule (GS) pay plan and applying for a promotion opportunity, you must meet time-in-grade (TIG) requirements of 52 weeks of service at the next lower grade level in the normal line of progression for the position being filled. This requirement must be met by the closing date of this announcement.\n<br><br>\nTo receive consideration for this position, you must meet all qualification requirements by the closing date of the announcement.\n<br><br>\n<strong>Education</strong>"}