{"job title": "Scientist - Bioinformatician", "company": "DuPont", "city state": "– Madison, WI", "rating": "3.5", "job description": "<ul>\n<li>*Scientist - Bioinformatician (Job Number: 194823W-01)**</li>\n<li>*Description**</li>\n</ul>\n\nWe are currently seeking a highly motivated and talented bioinformatician to join our dynamic and collaborative team to support company goals in probiotic and human nutrition science. The successful candidate will be part of the Genomics and Microbiome Sciences Group with primary focus on evaluating and interpreting multi-omic datasets from studies of probiotics and the microbiome. This position will be leveraged globally across multiple locations within DuPont Nutrition and Health division and will work cross-functionally with technical teams involved in upstream research, applications and manufacturing.\n<br><br>\nThe successful candidate will be responsible for developing analysis pipelines and applications for NGS data, including: amplicon, metagenomic, transcriptomics, and metabolomic data. This role requires strong programming skills, expertise with NGS analysis tools and construction of microbiome networks, as well as demonstrated experience integrating networks with biological and medical profiles to infer significant interactions. A critical aspect of the position involves working with teams across multiple locations, and will require effective project coordination and communication skills. This is an exciting opportunity for candidates with strong bioinformatic skills who want to work at the interface of the microbiome, probiotics, and clinical development.\n\n\n<ul>\n<li>*KEY RESPONSIBILITIES**</li>\n</ul>\n\n+ Independently develops and implements multi-omic platforms, analytical procedures and data management tools to construct networks from probiotic and microbiome datasets.\n<br><br>\n+ Leads and collaborates on the interpretation of microbial structure and functional signatures from clinical and translational studies to transform critical insights from microbiome clinical studies to mechanisms of action and novel therapeutic probiotics.\n<br><br>\n+ Reconstructs genome-scale metabolic networks to aid in fermentation development.\n<br><br>\n+ Maintains thorough documentation of experimental plans, process workflows, and results.\n<br><br>\n+ Develops project plans in conjunction with Group manager.\n<br><br>\n+ Prepares results for presentation, inclusion in technical reports, and for publication in peer-reviewed scientific journals.\n<br><br>\n+ Stays current in bioinformatics methods / tools and emerging approaches in microbiome genomics and systems analyses by keeping up with relevant literature and attending scientific meetings.\n<br><br>\n+ Serves as a subject matter expert, resource, and mentor to biologists, wet lab scientists, and key stakeholders across the company\n\n\n<ul>\n<li>*SCOPE OF POSITION**</li>\n</ul>\n\nThe incumbent will be a member of the Madison-based R&amp;D group, specifically the Genomics and Microbiome Sciences Group. In this role, they will be expected to conduct independent research as part of multifunctional project teams, based on specific business goals as set by the Health &amp; Protection leadership. As needed, the individual will be expected to lead projects and project teams. Direction will come from the Genomics and Microbiome Sciences Group manager. Research activities and responsibilities will be integrated into the overall global Technology as part of Health &amp; Protection within Nutrition and Health.\n<br><br>\nThe main objective is to perform bioinformatic analysis of large nucleic acid data sets derived from probiotic and clinical samples. These analyses will further understandings of probiotic health benefits, probiotic strain safety and diversity, and probiotic mode-of-action. A thorough understanding of nucleic acid sequence analysis algorithms and methods to integrate biological and medical datasets together are essential to developing new health claims and probiotics. It is expected that the incumbent will master specific technical skills commensurate with modern bioinformatics that include integrating multi-omic frameworks sufficiently to independently perform such work and instruct others as well.\n<br><br>\nIt is expected that the incumbent will perform their research in accordance with sound scientific principles, endeavor to maintain a current level of expertise in the area of bioinformatics and foster an attitude of innovation and creativity. Additionally, it is expected that the incumbent will develop sufficient understanding to relate basic and applied research activities towards business goals and directives. The work and environment is considered multi-disciplinary requiring excellent technical, communication and people skills. Emphasis is placed upon the ability to constantly learn, improve, and apply new knowledge towards the research and business objectives. The scientist will be afforded every opportunity to expand their skill level and further develop their career.\n\n\n<ul>\n<li>*WORK CONDITIONS**</li>\n</ul>\n\nOperates in an office / laboratory environment. Full time, 40-hr per week. Some travel expected.\n\n\n<ul>\n<li>*GENERAL DUTIES AND RESPONSIBILITIES**</li>\n</ul>\n\n+ Independently conduct experimental work as defined by project objectives.\n<br><br>\n+ Ensure continuing project activity by coordinating the resources, supplies, equipment and priority for each project.\n<br><br>\n+ Ensure that experimental results are routinely recorded in a lab notebook. Updated written and/or oral reports to potential customers and to management and upon the completion of the project.\n<br><br>\n+ Keep up to date on new trends, technical developments and skills by monitoring the scientific and trade literature, competitors? activities, new methods and processes for food ingredients in associated areas though continuing education and/or technical seminars.\n<br><br>\n+ Represent R&amp;D as a scientific expert and resource for internal and external customers, conducting training presentations, answering technical questions.\n<br><br>\n+ Ensure that work areas are kept clean and meet GMP guidelines.\n<br><br>\n+ Regular attendance is an essential function of this position.\n<br><br>\n+ Compliance with applicable company policies concerning maintaining a drug free work place is required.\n\n\n<ul>\n<li>*Qualifications**</li>\n</ul>\n\n+ Trained in Microbiology, Genetics, Molecular Biology, Computer Science or related field with an emphasis in microbial bioinformatics and microbial ecology.\n<br><br>\n+ Position requires a min of 5 yrs experience with a PhD designation, 7+ yrs with MSc and/or 10+ yrs w/BSc of relevant experience\n<br><br>\n+ Extensive experience analyzing and interpreting microbial amplicon, genomic, transcriptomic, or metabolomic datasets from clinical studies, environmental samples, or other mixed/mono populations. Includes modeling and correcting raw sequencing data.\n<br><br>\n+ Demonstrated experience constructing and visualizing microbial networks via dissimilarity, correlation, and regression methods as well as Bayesian or Markov models (e.g. CoNet, ReBoot, Cytoscape)\n<br><br>\n+ Basic knowledge and experience with integrative algorithms for module extraction and comparison (e.g. COBRA, HotNet, NetworkBLAST)\n<br><br>\n+ Knowledge of machine learning frameworks and their application to NGS datasets.\n<br><br>\n+ Proficiency in UNIX/Linux development environment and relevant programming languages (e.g. R, Matlab, Python, Perl). Experience with HPC clusters and revision control is desirable.\n<br><br>\n+ Familiarity with large public and private sequence databases (e.g. KEGG, BioCyc, Pfam).\n<br><br>\n+ Strong publication record.\n<br><br>\n+ Demonstrated ability to independently design, manage, and perform multi-task projects to a successful result.\n<br><br>\n+ Must be a team player and a focused individual with a strong work ethic and great attention to detail.\n<br><br>\n+ Experience in project management; planning, tracking and reporting, desirable.\n<br><br>\n+ Possess excellent oral and written communication skills for presentation of scientific concepts and results to internal and external customers.\n<br><br>\n+ Compliance with all company policies is required.\n<br><br>\n+ Other functions as required (non-essential functions).\n<br><br>\n+ Responsible for adherence to all quality systems including, ISO 9002 and Food Safety, with an understanding of DuPont Quality Policy and procedures\n\n\n<ul>\n<li>*Primary Location:** _NA-United States-Wisconsin-Madison_</li>\n<li>*Organization:** _Nutrition and Health_</li>\n<li>*Schedule:** _Full-time_</li>\n<li>*Education Level:** _Bachelor's Degree (?16 years)_</li>\n<li>*Employee Status:** _Regular_</li>\n<li>*Job Type:** _Experienced_</li>\n</ul>\n\nDuPont is an equal opportunity employer. Qualified applicants will be considered without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability or any other protected class. If you need a reasonable accommodation to search or apply for a position, please visit our Accessibility Page for Contact Information. For US Applicants: See the ?Equal Employment Opportunity is the Law? poster."}