{"job title": "Scientist II", "company": "Entegris", "city state": "– CT", "rating": "3.3", "job description": "<div><div>\n<div>Why work at Entegris?\n<br><br>\nLead. Inspire. Innovate. Define Your Future.\n<br><br>\nNot everyone who works for a global company shares the same background, experiences and perspectives. We leverage the differences of our employees to bring new ideas to the table. Every employee throughout the company is encouraged to share input on projects and initiatives. Our decision making process is truly a collaborative effort as we realize there are leaders at every level of the organization. We put our values at the core of how we operate as an organization — not just when it’s convenient, but in a lasting and meaningful way. We want the time and energy you spend here to have a positive impact on your life inside and outside of the office.\n<br><br>\n<strong>Entegris is a values-driven culture and our employees rally around our core PACE values:\n<br><br>\nPeople</strong> \n<br>\n<strong>Accountability</strong>\n<br><br>\n<strong>C</strong><strong>reativity</strong> \n<br>\n<strong>Excellence</strong></div>\n</div>\n</div>\n\n<br>The Role<br>\n\n<div>\n<div>\n<div>Entegris is currently seeking a talented and innovative Analytical Chemist to join its Analytical Services Organization in Danbury, CT.\n<br><br>\nIn this role, you will support several of our product development teams as well as be responsible for the metrology roadmap for the product area. In line with our values, which is fostering an environment of teamwork you will have an opportunity to collaborate with technicians, scientists, applications engineers, local management, sales &amp; marketing, as well as global technical team members.\n<br><br>\nThe ideal candidate will be results oriented and an excellent team player, with solid knowledge of materials science &amp; physics, and familiarity with semiconductor device materials, structures, and metrology.</div>\n</div>\n</div>\n\n<br>In this role you will<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li>Use product and testing expertise to collaborate with internal and external customers to determine root causes in product development and quality problems</li><li>Respond to customers’ feedback on technical problems and improve product value as well as customer satisfaction</li><li>Perform material characterizations using analytical instruments</li><li>Solve customers’ quality complaints and provide solutions to their technical issues</li><li>Participate in technology exchanges with customers by visiting and tele-conferencing</li><li>Promote Entegris’s image by participating in industrial conferences and seminar</li><li>Continuous training on the various analytical techniques and methods</li></ul></div>\n</div>\n</div>\n\n<br>Traits we believe make a strong candidate<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li>Bachelor of Science in chemistry, physics or engineering required Masters and Ph.D. preferred</li><li>General analytical lab instrumentation (HPLC, LC-MS, IC, ICP-OES, GC, GC-MS, NMR, Raman, FTIR) operations and maintenance experience required</li><li>Use of advanced chemometric software for data processing and analysis</li><li>Prior experience working in a chemical / gas manufacturing environment preferred</li><li>Experience with applicable quality tools such as pareto, FMEA’s, SPC/SQC, histograms, trend analysis, process mapping, design of experiments, cause and effect diagrams, 8D problem solving methodology</li><li>Strong Expertise in chemical analysis related to blended cleans and advanced deposition materials</li><li>Demonstrated problem solving skills with a passion for learning and teaching</li><li>Ability to operate in a global environment</li><li>Knowledge of proper safe handling/disposal of chemicals and ability to maintain a clean and safe workspace</li> <li>Mandarin or Korean is a plus</li><li>Ability to travel 10% of time, some international</li> </ul></div>\n</div>\n</div>\n\n<br>Your success will be measured by<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li>Tests and analyzes R&amp;D samples, manufactured materials, and in-process samples when needed and in timely manner</li><li>Confers with process engineers, development scientists, and manufacturing personnel regarding results and research, prepares technical reports and presentations to promote learning</li><li>Good communication and coordination abilities and presentation skills</li><li>Ability to conduct project independently and navigate ambiguity</li><li>Demonstrated ability to work on multiple projects in parallel</li> <li>Strong independent operation skills and ability to complete lab work safely</li><li>Ability to learn and become proficient at several analytical techniques</li></ul></div>\n</div>\n</div>\n\n<br><strong>What we offer:\n<br><br>\n</strong>\n<br>\n<div>\n<div>\n<div>Our total rewards package goes above and beyond just a paycheck. Whether you’re looking to build your career, improve your health, or protect your wealth, we offer generous benefits to help you achieve your goals.\n<ul>\n<li>Very Competitive total compensation plans.</li><li>A 401(K) plan to help you plan for your future with an impressive employer match that’s all yours- no vesting!</li><li>Great health, dental and vision insurance packages to fit your needs to ensure you’re happy and healthy.</li><li>A progressive PTO policy that empowers our employees to take the time they need to recharge!</li>\n</ul>\n<em>At Entegris we are committed to providing equal opportunity to all employees and applicants. Our policy is to recruit, hire, train, and reward employees for their individual abilities, achievements and experience without regard to race, color, religion, sexual orientation, age, national origin, disability, marital or military status.</em>\n<br><br>\n<em>#LI-JL1</em>\n<br><br>\n<em>ENT789</em></div>\n</div>\n</div>\n<br>"}