{"job title": "Bioinformatics Support Scientist", "company": "Illumina", "city state": "– North /A, CA", "rating": "4.2", "job description": "Responsibilities:\n<br><br>\n·Technical consultation and collaboration with Illumina Sales and Support teams both pre- and post- sale to facilitate adoption of Illumina Sequencing and Informatics products\n<br><br>\n· Troubleshoot complex issues related to Illumina Informatics and Sequencing offerings, including the BaseSpace suite and DRAGEN. This function interacts with a variety of teams including Field Service Engineers, Field Applications Scientists, Sales, Technical Support and internal developers regarding customer challenges in these areas:\n<br><br>\n· Integrating Illumina sequencers and informatics solutions in customer IT environments\n<br><br>\n· Networking and connection to Illumina cloud environments (AWS hosted)\n<br><br>\n· Statistical, analytic, and design challenges impacting customer data.\n<br><br>\n· Increase customer satisfaction by acting as an expert resource for customer questions and onboarding related to Illumina data, sequencing applications, and informatics offerings\n<br><br>\n· Develop, coordinate, and deliver advanced bioinformatics and application trainings and demonstrations for customers\n<br><br>\n· Actively participate in product development teams capturing customer needs and feature requests, support of customer beta tests, and development of training and documentation prior to product launch\n<br><br>\nRequirements\n<br><br>\n· Network troubleshooting experience in both Windows and Linux contexts is strongly preferred, as our instruments typically operate in a mixed Windows/Linux environment\n<br><br>\n· Previous experience with Illumina informatics offerings including BaseSpace, Sequence Hub and the Sequence Hub API, CLI, or DRAGEN is highly desirable.\n<br><br>\n· Experience working with Docker, APIs, HTML5, JavaScript and Liquid or previous experience developing BaseSpace Sequence Hub apps is desirable.\n<br><br>\n· NextGen Sequencing (NGS) bioinformatics, experimental design, and practice are important to the role; this should include experience with NGS pipelines and components, scripting, and HPC configurations\n<br><br>\n· Demonstrated written and verbal communication and training skills are critical to success for this customer-facing role\n<br><br>\n· 5+ years of relevant biotech experience including experience in an external customer-facing role preferred\n<br><br>\nEducation:\n<br><br>\n· MS/PhD in Computer Science, Bioinformatics, Statistics, Genetics or related field, or BS with extensive experience required"}