{"job title": "Research Scientist", "company": "North Carolina State University", "city state": "– Raleigh, NC", "rating": "4.2", "job description": "<div>\nPosting Details\n<br>\n <div>\n<div>\nPosting Information\n<br>\n <div>Vacancy Type EHRA Non-Faculty</div> <div>Is Internal Transfer Only No</div> <div>Working Title Research Scientist</div> <div>Salary Range</div> <div>Anticipated Hiring Range Commensurate with education and experience</div> <div>Position Number 00103587</div> <div>Work Schedule Monday - Friday; 8:00 am- 5:00 pm</div> <div>Full Time Equivalent (FTE) 1.0</div> <div>Department 141901 - Computer Science-engr</div> <div>Department Computer Science-engr</div> <div>Job City &amp; State Raleigh, NC</div> <div>Primary Function of Organizational Unit<br><br>The Department of Computer Science is an academic teaching and research department in the College of Engineering. It is a large and complex unit that encompasses research intensive, teaching intensive and professional activities. It is one of the largest such departments in the nation by the number of faculty and students, and its total budget and size are comparable to, or larger than, a number of NC State University colleges and divisions.</div> <div>Essential Job Duties<br><br>The Center for Educational Informatics is seeking a Research Scientist to participate in research and development activities for projects investigating advanced learning technologies, intelligent user interfaces, and learning analytics. This position involves contributing to ongoing research programs and assisting with the development of new research programs. The ideal candidate will have excellent written communication skills and prior experience managing, developing, and improving software systems, as well as experience guiding junior researchers and developers.\n\n\n<ul>\n<li>Designs, develops, tests, maintains, and documents artificial intelligence-based software systems.</li>\n<li>Participates in developing system architectures including hardware and software recommendations.</li>\n<li>Works closely with target user populations to identify system requirements.</li>\n<li>Performs detailed systems analysis to develop implementation strategies and scope projects appropriately.</li>\n<li>Actively participates in project planning by creating project schedules as well as monitoring progress according to schedules and providing status reports.</li>\n<li>Assists with collecting, inputting, editing, and analyzing quantitative and qualitative data.</li>\n<li>Analyzes user behavior through qualitative and quantitative techniques using interaction log data, physiological data, behavioral data, and surveys/questionnaires.</li>\n<li>Collaborates with staff and students on solving research problems.</li>\n<li>Stays up-to-date on literature in advanced learning technologies and related areas.</li>\n<li>Leads preparation of papers and reports describing the research.</li>\n<li>Participates in fielding and deploying software at user sites, such as schools, museums, and after-school programs.</li>\n<li>Gives demonstrations and presentations at meetings and conferences as needed.</li>\n<li>Performs other related duties as assigned or requested.</li></ul></div> <div>Other Work/Responsibilities<br><br>Perform other related duties as assigned or requested. This position is contingent upon funding.</div> <div>Minimum Education/Experience<br><br>Ph.D. degree in Computer Science or closely related field. Prior experience with research and development in educational software, serious games, and artificial intelligence-based software. Strong background in artificial intelligence and machine learning. Extensive programming expertise including experience with languages such as C#, Java, Python, and C++.\n\n\nIf no applicants apply who meet the required competencies and education/experience requirements, then other applicants may be considered.</div> <div>Departmental Required Skills<br><br>Ability to quickly learn and follow established development processes and standards. Ability to take constructive criticism resulting from peer reviews, software testing, and client feedback. Strong written and oral communication skills required, including the ability to work collaboratively with a diverse team.</div> <div>Preferred Experience, Skills, Training/Education<br><br>At least 5 years of professional experience designing and developing software applications. A strong publication record is a plus. A background working with game engines such as Unity or Unreal with a deep understanding cross-platform design and development. Prior experience with machine learning and working with behavioral trace data. A clear understanding of best practices for software design, development, and maintenance with demonstrated creativity in solving complex problems. Experience working with statistical packages such as SPSS, SAS, and JMP as well as previous experience conducting studies in K-12 classroom environments is desired.</div> <div>Required License or Certification<br><br>N/A</div> <div>Special Instructions<br><br>In addition to your application, please attach a CV, cover letter, contact information for professional references, and a research statement.</div> <div>Job Open Date 08/06/2018</div> <div>Anticipated Closing Date</div> <div>Is this position partially or fully funded on ARRA stimulus monies? No</div> <div>Proposed Hire Date 09/01/2018</div> <div>AA/EOE<br><br>NC State University is an equal opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, national origin, religion, sex, gender identity, age, sexual orientation, genetic information, status as an individual with a disability, or status as a protected veteran.\n<br><br>\nIndividuals with disabilities requiring disability-related accommodations in the application and interview process, please call 919-515-3148.\n<br>\nFinal candidates are subject to criminal &amp; sex offender background checks. Some vacancies also require credit or motor vehicle checks. If highest degree is from an institution outside of the U.S., final candidates are required to have their degree verified at www.wes.org. Degree must be obtained prior to start date.\n<br><br>\nNC State University participates in E-Verify. Federal law requires all employers to verify the identity and employment eligibility of all persons hired to work in the United States.</div> </div>\n </div>\n </div>\n\n<br>Supplemental Question\n<br>\n <div>Required fields are indicated with an asterisk (*).\n\n<ul>\n\n <li> * \n<br>\n How did you learn of this opportunity?\n\n\n<ul>\n\n <li>NCSU Website</li>\n<li>NCSU Executive Search Services</li>\n<li>Monster.com</li>\n<li>CareerBuilder.com</li>\n<li>InsideHigherEd.com</li>\n<li>HigherEdJobs.com</li>\n<li>Other Online Job Board</li>\n<li>Carolina Job Finder / Employment Guide</li>\n<li>Job / Career Fair</li>\n<li>The Chronicle of Higher Education</li>\n<li>Professional Journal</li>\n<li>Print Advertisement (Newspaper / Periodical)</li> \n\n<li>Professional Organization</li>\n<li>Higher Education Recruitment Consortium (HERC)</li>\n<li>Direct Contact from NCSU HR Representative / Recruiter</li>\n<li>NCSU Employee Referral</li>\n<li>Social Media (LinkedIn, Twitter, Facebook, Other)</li>\n<li>Other</li>\n</ul>\n\n </li>\n<li>\n If you learned about this vacancy from \"other source\" or \"other website\", please provide the source.<br><br>(Open Ended Question)</li>\n\n</ul>\n\n</div>\n\n<br>Application Materials Required\n<br>\n <div>\n<strong>Required Documents</strong>\n\n\n<ul>\n\n <li>Cover Letter</li>\n<li>Curriculum Vitae</li>\n<li>Contact Information for References</li>\n<li>Research Statement</li>\n</ul>\n\n<strong>Optional Documents</strong>\n\n</div>\n<br>"}