{"job title": "Research Scientist", "company": "NYU Langone Medical Center", "city state": "– New York, NY", "rating": "3.8", "job description": "Tracking Code\n \n \n 1049847_RR00025794 \n \n \n \n \n Job Description\n \n \n <p><strong>NYU School of Medicine</strong> is one of the nation's top-ranked medical schools. For 175 years, NYU School of Medicine has trained thousands of physicians and scientists who have helped to shape the course of medical history and enrich the lives of countless people. An integral part of NYU Langone Health, the School of Medicine at its core is committed to improving the human condition through medical education, scientific research, and direct patient care. For more information, go to med.nyu.edu, and interact with us on Facebook, Twitter and Instagram.</p>\n<p> </p>\n<p> </p>\n<p><strong>Position Summary:</strong><br>We have an exciting opportunity to join our team as a Research Scientist. <br> <br> In this role, the successful candidate is responsible for collaborating with Principal Investigators (PI) and working independently within the scientific framework of the PIs laboratory.</p>\n<p> </p>\n<p> </p>\n<p><strong>Job Responsibilities:</strong></p>\n<ul>\n<li>Demonstrates knowledge of the organizations Core Values and incorporates them into the performance of duties.</li>\n<li>Initiates, interprets, organizes, executes, and coordinates research assignments critical to departments mission.</li>\n<li>Formulates and conducts research on problems of considerable scope and complexity.</li>\n<li>Explores subject area and defines scope and selection of problems for investigation through conceptually related studies or series of projects of lesser scope.</li>\n<li>Makes decisions and recommendations that have a major impact on extensive scientific research activities.</li>\n<li>Develops new ideas that promote current research. Exercises a high degree of creativity, foresight, and mature judgment in planning, organizing, and guiding extensive scientific research programs and activities of outstanding novelty and/or importance.</li>\n<li>May manage the operations of a lab for the Principal Investigator by supervising Post Docs and technicians. Oversees the maintenance and upkeep of all instruments and laboratory facilities.</li>\n<li>Ensures timely and accurate completion of research projects.</li>\n<li>May provide students with technical guidance and direction in the operation of various sample preparation techniques, extraction lines, and equipment as well as general laboratory practices and safety protocols.</li>\n<li>May seek grant funding from external sources in support of their independent research projects with consent of the PI and the Department Chair. May participate in writing grant proposals.</li>\n<li>May be responsible research/lab quality control and compliance.</li>\n<li>May develop protocol for the collection and quality of research data.</li>\n<li>Develops research techniques and methodologies.</li>\n<li>May determine and establish laboratory policies, procedures and practices.</li>\n<li>Maintains a thorough knowledge of the advances in specialized fields through attendance of scientific conferences.</li>\n<li>May make significant contributions to scientific papers. Is a resource/ author/ co-author for reports and presentations.</li>\n<li>May provide recommendations for equipment purchases and for the redesign of lab space.</li>\n<li>May coordinate the activity and experimental design between various labs, scientific staff, and collaborators. Identifies and resolves technical problems.</li>\n<li>May serve on internal committees to help further goals of research projects and bring new expertise to the research program.</li>\n<li>Performs other duties as assigned.</li>\n</ul>\n<p> </p>\n<p><strong>Minimum Qualifications:</strong><br>To qualify you must have a Master of Science degree in a related discipline and 2-4 years of work experience; excellent communication skills, written and verbal; medical or scientific writing experience a must, ideally with an established record of publication.</p>\n<p> </p>\n<p> </p>\n<p><strong>Preferred Qualifications:</strong><br>PhD degree and substantial experience from having completed post-doctoral training; established record of publications.</p>\n<p> </p>\n<p> </p>\n<p><em>Qualified candidates must be able to effectively communicate with all levels of the organization.</em><br><br>NYU School of Medicine provides its staff with far more than just a place to work. Rather, we are an institution you can be proud of, an institution where you'll feel good about devoting your time and your talents.<br><br>NYU School of Medicine is an equal opportunity and affirmative action employer committed to diversity and inclusion in all aspects of recruiting and employment. All qualified individuals are encouraged to apply and will receive consideration without regard to race, color, gender, gender identity or expression, sex, sexual orientation, transgender status, gender dysphoria, national origin, age, religion, disability, military and veteran status, marital or parental status, citizenship status, genetic information or any other factor which cannot lawfully be used as a basis for an employment decision. We require applications to be completed online. <br>If you wish to view NYU School of Medicine's EEO policies, please click here. Please click here to view the Federal \"EEO is the law\" poster or visit https://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm for more information. To view the Pay Transparency Notice, please click here.</p>\n \n \n \n \n Company Location\n \n \n NYU School of Medicine \n \n \n \n Department\n \n \n Pediatrics \n (S840)\n \n \n \n \n Position Type\n \n \n Full-Time/Regular"}