{"job title": "Sr Scientist", "company": "Occidental Petroleum Corporation", "city state": "– Wichita, Kansas", "rating": "3.9", "job description": "Description Contribute. Grow. Lead with OxyChem. Looking for a challenge? Desire to achieve your true potential? OxyChem is a growing, action-oriented, safety driven chemical manufacturing company continually striving to be the best in the business while staying focused on environmental protection. The secret to our success has and will continue to be our people. Occidental Chemical Corporation (OxyChem) is a leading North American manufacturer of chlorine and caustic soda, and polyvinyl chloride (PVC) resins key building blocks for a variety of indispensable products such as plastics, pharmaceuticals, and water treatment chemicals. Other OxyChem products include caustic potash, chlorinated organics, sodium silicates, chlorinated isocyanurates, and calcium chloride. For every product it makes, OxyChems market position is No. 1 or No. 2 in the U.S. In a fast-paced industry that demands precision, we create a supportive workplace where the safety and well-being of our employees are paramount. We are committed to rewarding top performers, offering very competitive pay and benefits, and providing tremendous career development opportunities. We are looking for an experienced and self-motivated individual contributor to fill the position of Senior Scientist within our Technology organization. The position will reside at our Technical Center in Wichita, Kansas.Essential Job Duties This position is responsible for leading R&amp;D activities to support OxyChems Business objectives. <strong> Essential Job Duties</strong> Maintain as our highest priority the protection of the environment, the health and safety of our employees, customers, and the communities in which we operate and/or transport our products. Understand and work in accordance with all site safety and environmental procedures including the site Chemical Hygiene Plan. Adhere to the use of personal protective equipment as required. to develop new products, improve existing products, reduce manufacturing costs, improve safety, improve quality, or reduce environmental impact of OxyChem products. Apply advanced understanding of chemistry and technical expertise to the planning and execution of significant, complex, or innovative technologies related to the synthesis, manufacture, and applications of organic and inorganic chemicals. Maintain current awareness of significant trends and advances in chemistry or markets, and initiate and recommend new technology for project development or use in manufacturing. Produce clear, concise, accurate, and timely written and oral reports in which conclusions and recommendations are effectively supported by analytical and/or research data and supporting literature. Serve as technical specialist and resource person for major process and/or product technologies. Understand raw material selection choices and work with vendors to evaluate and develop new products and technologies. Act as liaison and provide technical support to manufacturing, marketing, and business management through the identification, planning, and execution of joint projects and/or implementation of new technologies. Participate in the Wichita Plant process safety programs to complete Process Hazard Analysis, to complete the Management of Change requirements, and to investigate process safety incidents. Ensure process safety information is current and accurate for the physical assets (P &amp; IDs), for the process conditions (PFDs), for the process chemistry (SDSs), and for the technician-process activities (procedures and work instructions). Qualifications Minimum Requirements Doctorate degree in Chemistry, Chemical Engineering, or related field is required. Emphasis in chlorination chemistry, organic chemistry, and/or photochemistry is desired. Ability to design, construct and/or assemble, operate, and troubleshoot non-routine laboratory experimental apparatus. Collect samples, analyze data, and draw conclusions from the results. Proficient in the operation and maintenance of analytical instrumentation. High degree of problem solving and organizational skills. Good written and verbal communication skills. Comfortable presenting information to all levels of management, vendors, and customers. Self-motivated with the ability to work efficiently with minimal supervision. Must be able to work in teams. Must be able to handle multiple complex issues at the same time. High proficiency in Microsoft Office applications. Familiarity with public domain technical and patent literature. May require domestic travel as required to support assignments. Physical requirements Must be able to lift 40 pounds, climb ladders, and stairs. Walking, bending, stooping is required. Must be able to wear personal protective equipment as required. Must be able to respond to visual and audible alarms. Experience in an industrial R&amp;D or Technology organization. PhD dissertation topic or direct professional experience with chlorination chemistry, organic chemistry, and/or photochemistry. Knowledge of sulfur chemistry. Formal statistics training. Occidental is an Equal Opportunity Employer/Individual with Disability/Veteran Status"}