{"job title": "Business Intelligence Analyst - Communications", "company": "Peraton", "city state": "– US-VA-Herndon", "rating": "3.2", "job description": "Overview<br>\n\n<div>\n<div>We are seeking a Business Intelligence Analyst in Herndon, VA to support the Peraton Communications Sector.\n<br><br>\nThe position will report to the Director of Business Intelligence and work closely with leaders from all functional areas. The Peraton Communications Sector provides innovative, reliable communications solutions to the nations most sensitive and mission-critical programs and systems. As a trusted provider of highly differentiated secure communications capabilities, the Peraton Communications Sector is a critical partner to the Intelligence Community, Department of Defense, and select federal agencies and commercial entities.</div>\n</div>\n\n<br><strong>Responsibilities</strong><br>\n\n<div>\n<div>This position will be responsible for the following:\n<br><br>\n• Assist the sales and business development teams with identifying, analyzing, and vetting new prospective opportunities from a multitude of data sources\n<br><br>\n• Support sales leaders and program managers with creating and maintaining opportunity records in the Deltek GovWin Opportunity Management system\n<br><br>\n• Conduct research to gather information about target markets, competing products/services, customers, competitors, potential partners, and potential acquisition targets\n<br><br>\n• Conduct quantitative and qualitative analysis of data from enterprise applications and open sources to help drive strategy and planning\n<br><br>\n• Develop and maintain reporting and analysis tools using Excel and Tableau Desktop\n<br><br>\n• Support and/or adapt existing Excel, Tableau, Power BI, SQL queries, and other tools as needed\n<br><br>\n• Coordinate with corporate IT resources and enterprise application owners to define, design, develop, and implement ETL processes\n<br><br>\n• Coordinate with stakeholders across the business to consolidate information into PowerPoint slides for monthly and quarterly business reviews\n<br><br>\n• Assist with driving business process improvement and streamlining initiatives. Actively participate in meetings to capture and translate business requirements for new processes and tools\n<br><br>\n• Assist with organizing and managing SharePoint sites\n<br><br>\n• Collaborate with business leaders to develop business cases to justify investment</div>\n</div>\n\n<br><strong>Qualifications</strong><br>\n\n<div>\n<div><strong>REQUIRED:</strong>\n<br><br>\n• Masters degree with 3+ years of relevant experience or 4-year degree with 5+ years of relevant experience in data analytics, management consulting, computer science, engineering, finance/accounting, mathematics, or related field. Experience requirement may change depending on the relevant education level and certifications.\n<br><br>\n• 3+ years of experience conducting primary and secondary market research\n<br><br>\n• 3+ years of experience with manipulating and analyzing large data sets\n<br><br>\n• 5+ years of experience with Microsoft Excel\n<br><br>\n• 3+ years of experience with Tableau Desktop\n<br><br>\n• 3+ years of experience with Tableau Prep\n<br><br>\n• 3+ years of experience with Tableau Online and/or Tableau Server\n<br><br>\n• 3+ years of experience with Microsoft Power BI\n<br><br>\n• 3+ years of experience with writing SQL queries\n<br><br>\n• 3+ years of experience working with data from a multitude of databases and data warehouses (Microsoft SQL Server, Oracle, MySQL, Microsoft Azure, Amazon Web Services, Microsoft Access)\n<br><br>\n• Experience with briefing senior business leaders and executives\n<br><br>\n• Experience facilitating large meetings with several participants\n<br><br>\n<strong>PREFERRED:</strong>\n<br><br>\n• Masters degree in Business, Computer Science, Engineering, Finance/Accounting, Mathematics, or related field with 3+ years of relevant experience\n<br><br>\n• 5+ years of hands-on experience with Tableau Desktop to create executive dashboards, reports, and forecasts\n<br><br>\n• 3+ years of project management experience with PMP certification\n<br><br>\n• 2+ years of experience using the Deltek GovWin Opportunity Management system\n<br><br>\n• 2+ years of experience using the Deltek GovWin IQ system to search for, identify, and vet new government contracting opportunities\n<br><br>\n• 2+ years of experience using Salesforce.com\n<br><br>\n• 2+ years of experience using the FedBizOps.gov website to search for, identify, and vet new government contracting opportunities\n<br><br>\n• 2+ years of experience using the Federal Procurement Data System (FPDS) to research and analyze government procurement data\n<br><br>\n• Tableau Desktop Certified Professional certification\n<br><br>\n• Six Sigma Green Belt certification\n<br><br>\n• Strong analytical and critical thinking skills\n<br><br>\n• Strong oral and written communication skills\n<br><br>\n• Self-directed team player with proven ability to deliver tasks timely and efficiently, and a demonstrated ability to interact professionally with all levels of management\n<br><br>\n• High level problem solving and interpersonal skills\n<br><br>\n• Flexible and able to work in a dynamic environment\n<br><br>\n• Experience in the aerospace, defense, and/or telecom industries\n<br><br>\n• Knowledge of satellite and/or terrestrial communications products and services\n<br><br>\n• Experience with government contracting\n<br><br>\n• Knowledge of Federal Acquisition Regulation (FAR)\n<br><br>\n<strong> SECURITY CLEARANCE: This position requires the candidate to obtain and maintain a Secret security clearance. In order to obtain a clearance, you need to be a U.S. Citizen and show proof of citizenship.</strong></div>\n</div>\n\n<br>About Peraton<br>\n\n<div>\n<div>Peraton provides innovative, reliable solutions to the nations most sensitive and mission-critical programs and systems. Peraton has significant experience providing highly differentiated secure communications, space, and technology solutions to key customers, and has become a trusted partner on missions that are critical to the security priorities of the United States. Capabilities include complex software and technology services and solutions, as well as end-to-end mission operations abilities, including Software Systems Development, Cyber, Modeling &amp; Simulation, Mission Operations, Signal Intelligence (SIGINT), and Quick Reaction Capabilities (QRC) / Research &amp; Development. The company is headquartered in Herndon, VA, with approximately 3,500 employees across the U.S. and Canada.</div>\n</div>\n\n<br>EEO Statement<br>\n\n<div>\n<div><em>We are an Equal Opportunity/Affirmative Action Employer. We consider applicants without regard to race, color, religion, age, national origin, ancestry, ethnicity, gender, gender identity, gender expression, sexual orientation, marital status, veteran status, disability, genetic information, citizenship status, or membership in any other group protected by federal, state, or local law.</em></div>\n</div><br>\n\n<div>\n<div>\nWe can recommend jobs specifically for you!\n<br><br>\nClick here to get started.</div>\n</div>\n<br>"}