{"job title": "Associate Scientist", "company": "PPD", "city state": "– Middleton, WI", "rating": "3.4", "job description": "PPD Development, L.P. is seeking an Associate Scientist in Middleton, WI.\n<br><br>\nJob Duties:Conduct standardized biological, microbiological or biochemical tests and laboratory analyses to evaluate the quantity or quality of physical or chemical substances in pharmaceutical products. Analyze experimental data and interpret results to write reports and summaries of findings. Keep detailed logs of all work-related activities. Monitor laboratory work to ensure compliance with set standards. Perform a variety of routine to complex sample preparation and analysis procedures to quantitatively measure pharmaceutical and biopharmaceutical compounds in a variety of formulations and biological matrices for stability and analytical testing. Follow validated or experimental analytical procedures with periodic direct supervision. Responsible for review and compilation of results and data comparison against SOP acceptance criteria, methodology, protocol, and product specifications. Problem solve with assistance pertaining to extraction and instrumentation problems. Train on routine operation, maintenance, and theory of analytical instrumentation, SOPs, and regulatory procedures and guidelines. Manage QC/QA responsibilities without supervisor or QA input. Communicate project status to project leader.\n<br><br>\nBachelor?s degree in Biology, Biochemistry, Pharmaceutical Sciences, or related field and one (1) year of experience in the offered role or performing pharmaceutical studies in a laboratory environment. Must have one (1) year of experience with each of the following: applicable regulatory authority (FDA), compendia (USP), and ICH guidelines; applying GMPs to everyday work with regard to documentation and instrument use; Microsoft Excel and Word; optimizing analytical methods; project management; and troubleshooting.\n<br><br>\nPPD is an affirmative action employer that values diversity as a strength and fosters an environment of mutual respect. PPD provides equal employment opportunities without regard to age, race, color, pregnancy, national origin, religion, sex, gender identity, sexual orientation, disability, veteran status or other status within any other protected group.\n\n\n<ul>\n<li>*Job:* *Biopharmaceuticals*</li>\n<li>*Organization:* *CGMP Lab-United States (LBGUS)*</li>\n<li>*Title:* *Associate Scientist*</li>\n<li>*Location:* *Wisconsin-Middleton - Research Way*</li>\n<li>*Requisition ID:* *149876*</li>\n</ul>"}