{"job title": "Research Scientist", "company": "The General Hospital Corporation", "city state": "– Boston, Massachusetts", "rating": "3.6", "job description": "<strong><br><br>Description</strong>\n<br><br>\nThe Cost-Effectiveness of Preventing AIDS Complications (CEPAC) group within the Medical Practice Evaluation Center has an opportunity for an enthusiastic and energetic individual to join our research team investigating the clinical and economic value of alternative strategies of HIV treatment and prevention, as well as modeling other diseases. The position is with an internationally-recognized, multidisciplinary team from Massachusetts General Hospital, Harvard Medical School, Harvard School of Public Health, Yale School of Medicine, Brigham and Womens Hospital, as well as multiple international collaborators. Together, the group studies the clinical impact and cost-effectiveness of various HIV/AIDS, TB, smoking, diabetes, cardiovascular, and other disease prevention and treatment options in the United States, Europe, and resource-limited settings in Botswana, Brazil, Côte dIvoire, France, India, Mozambique, South Africa, and Zimbabwe.\n<br><br>\nThe candidate should be highly motivated with extensive experience in quantitative methods, independent mathematical model development, parameterization, and debugging. The position offers a stimulating and multi-disciplinary environment and the opportunity to contribute to the development of the CEPAC model and potentially other disease models. The primary responsibilities of this individual will be to assist with model refinement and extension, to conduct CEPAC model-based cost-effectiveness analyses, to lead in abstract presentation and manuscript preparation, and to assist with future grantsubmissions. There are multiple possibilities for interaction with other researchers in Boston, as well as collaboration with many national and international research groups and institutions.\n<br><br>\nInterested candidates should apply via www.massgeneral.org/careers (Job Number: 3066856).\n<br><br>\n**When applying, please include a cover letter along with your resume.**\n<br><br>\nFor more information regarding our group, please visit http://www.massgeneral.org/mpec/.\n<br><br>\nResponsibilities include, but are not limited to, the following activities:\n<li> Lead US and international projects to complete the aims of numerous NIH grants, including development and specification of mathematical simulation models</li> <li> Conduct multiple clinical and cost-effectiveness analyses on different aspects of HIV disease management using a computer simulation model of HIV disease (the CEPAC-US and CEPAC-International models), assuring consistency with guidelines for best practices</li> <li> Develop and apply new methodologies in stochastic computer simulation to address these issues, as well as other problems in global chronic disease</li> <li> Perform literature reviews and synthesize relevant data for these projects with biostatistics staff; work with these staff to convert published data into usable and appropriate input parameters</li> <li> Assist with the parameterization and documentation of the model</li> <li> Develop novel simulation models to address complications related to HIV as well as otherchronic diseases</li> <li> Develop analysis plans and protocols for studies consistent with federal guidelines</li> <li> Troubleshoot model inconsistencies (bugs) alongside the programmer and other research staff (Research Assistants and Project Managers)</li> <li> Provide guidance and advice to Research Assistants, particularly regarding methodological issues</li> <li> Provide input into major studies undertaken by the research team</li> <li> Lead abstract and manuscript preparation, as well as presentation of study results for multiple projects at a time</li> <li> Assist in the preparation of Institutional Review Board (IRB) applications regarding human subjects compliance for these projects, with the Principal Investigator</li> <li> Prepare grant applications and related documents</li> <li> Attend national and international scientific meetings</li> <li> Present research at seminars, working group meetings, and lectures</li>  <li> Take a major role in technology transfer and training meetings with US and international investigators</li> <li> Coordinate design of specific studies which include US and international collaborators in multiple sites</li> <li> Assist in the training of new employees in use of the CEPAC model</li> <li> Other duties as assigned</li>\nDuties will be carried out in a typical office environment. Occasional evening or weekend work may be required.\n<br><br>\nSupervisory responsibilities include overseeing the analysis of fellows, graduate students, post-docs, and other researchers within the MPEC as needed.\n<br><br>\nThis description has been designed to indicate the general nature and level of work performed by an employee within this position. The actual duties, responsibilities and qualifications may vary based on need.\n<br><br>\n<strong><br><br>Qualifications</strong>\n<br><br>\nJob qualifications include the following:\n<br><br>\n•PhD or ScD in Operations Research, Decision Science, Systems Engineering and Uncertainty Quantification, or related area\n<br><br>\n•Minimum of 7 years of research experience (inclusive of graduate studies)\n<br><br>\n•Capacity to manipulate large amounts of data and outstanding judgment with regards to study design and protocols\n<br><br>\n•Ability to work with mathematical models, including Markov and Monte Carlo simulation models, compartmental and agent-based epidemiological models, as well as deterministic and probabilistic sensitivity analysis, and ability to solve technical problems in these areas\n<br><br>\n•Superior writing, presentation, and organizational skills for manuscript and abstract preparations, as well as completion of grants and contracts in a timely fashion\n<br><br>\n•Facility with SAS and ACCESS data and R, python or other statistical software\n<br><br>\n•Proficiency with standard office software (Microsoft Word, Excel, and PowerPoint as well as Internet applications) and the ability to learn new computer applications\n<br><br>\n•Ability to work independently as well as part of a team\n<br><br>\n•Intellectual independence and initiative\n<br><br>\n•Ability to supervise research assistants and others on the team in collaborative projects\n<br><br>\n•Experience in public health, health economics, and health policy, preferably in HIV/AIDS and/or TB\n<br><br>\n•Ability to work within NIH and other federal and foundation regulations and guidelines\n<br><br>\n•Previous international healthcare research experience preferred<br><br>EEO Statement<br><br>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law."}