{"job title": "Staff Scientist", "company": "Vanderbilt University Medical Center", "city state": "– Nashville, TN", "rating": "3.6", "job description": "A Staff Scientist is sought to start as soon as possible at the Vanderbilt Institute for Global Health (VIGH), reporting directly to the VIGH Director/Project PI.\n<br><br>\nThe successful applicant will work primarily on the Hausa Brain Health Collaborative, a new collaborative network between VIGH and working initially Hausa Brain Health Collaborative ? a series of projects focusing on improving the health of people with neurological, psychiatric, and substance abuse disorders among the Hausa-speaking people of Africa with a focus on northern Nigeria. The current active studies include work in childhood epilepsy, status epilepticus, depression among caregivers of people with brain disorders, and dementia, with a focus on studies of task-shifted care, population-based epidemiology of brain disorders, and clinical trials. The staff scientist will be responsible for overall data management and data analysis for the project, as well as management of IRB submissions, and manuscript and grant preparations, and other research-related administrative duties as assigned. Although some travel may be required, this position will be based in Nashville, Tennessee USA in the VIGH offices.\n<br><br>\nMinimum requirements include a relevant doctoral degree (PhD, MD, ScD, DrPH) and experience in population-based and/or clinical based research, with experience in data management and analysis (e.g., SPSS, SAS, STATA and REDCap). An MPH (or equivalent degree or experience) in global health or epidemiology is preferred in addition to the doctoral degree.\n<br><br>\nExcellent writing and communication skills, as well as organizational skills are required. Fluency in English, spoken and written, is required. Excellent language skills in Spanish, Portuguese, French and/or Hausa is also preferred.\n<br><br>\nDoctorate/PhD (or equivalent experience) and 2 years experience\n\n\n<ul>\n<li>*Licensure, Certification, and/or Registration (LCR):**</li>\n<li>*Physical Requirements/Strengths needed &amp; Physical Demands:**</li>\n<li>*Movement**</li>\n</ul>\n\n+ Occasional: Sitting: Remaining in seated position\n<br><br>\n+ Occasional: Standing: Remaining on one's feet without moving.\n<br><br>\n+ Occasional: Walking: Moving about on foot.\n<br><br>\n+ Occasional: Lifting under 35 lbs: Raising and lowering objects under 35 lbs from one level to another\n<br><br>\n+ Occasional: Push/Pull: Exerting force to move objects away from or toward.\n<br><br>\n+ Occasional: Bending/Stooping: Trunk bending downward and forward by bending spine at waist requiring full use of lower extremities and back muscles\n<br><br>\n+ Occasional: Reaching below shoulders: Extending arms in any direction below shoulders.\n<br><br>\n+ Occasional: Handling: Seizing, holding, grasping, turning or otherwise working with hand or hands.\n\n\n<ul>\n<li>*Sensory**</li>\n</ul>\n\n+ Occasional: Vision: Clarity of near vision at 20 inches or less and far vision at 20 feet or more with depth perception, peripheral vision, color vision.\n<br><br>\n+ Frequent: Noise: May include exposure to occupational noise levels which equal or exceed an 8-hr time-weighted average of 85 decibels, requiring enrollment in VUMC's Hearing Conservation Program which includes training, use of hearing protection, and periodic audiometry.\n<br><br>\n+ Continuous: Communication: Expressing or exchanging written/verbal/electronic information.\n\n\n<ul>\n<li>*Environmental Conditions**</li>\n<li>*Job** _Research_</li>\n<li>*Organization:** _Institute for Global Health 104216_</li>\n<li>*Title:** _Staff Scientist_</li>\n<li>*Location:** _TN-Nashville-2525 West End Ave_</li>\n<li>*Requisition ID:** _1808041_</li>\n</ul>"}