{"job title": "Data Engineer", "company": "ViaSat Inc", "city state": "– Germantown, Maryland", "rating": "4.1", "job description": "ViaSat designs, builds, and operates high-capacity satellite networks - bringing broadband Internet access to the world.\n<br><br>\nOur Team\n<br>\nWe employ the latest technologies (Spark, Kafka, Impala, Hadoop) to analyze the Petabytes of data our operational systems produce. We employ developers, data scientists, and engineers to gain insight; solving both business and technical problems. Our innovative solutions are a result of the diversity of our team.\n<br><br>\nYour Opportunity\n<br>\nAs a team member, you'll build a breadth of knowledge including software development, distributed systems, machine learning, and data science. You will design, develop, and deploy systems to solve analytics questions across multiple business areas and disciplines.\n<br><br>\nOur Ideal Candidate\n<br>\nWe value curiosity, learning, and adaptability. Our ideal candidate loves solving tough problems using data.\n<br><br>\nIn this position, you will:<li> Design and build big data collection &amp; storage systems</li> <li> Design and build analytic tools</li>\nRequirements<br><br>At a minimum, we are looking for people with the following skills:<li> A BS in Computer Science, Computer Engineering, Software Engineering, Electrical Engineering, Math, Physics or related field</li> <li> Familiar with several languages, including Python, Java, Scala, C/C++</li> <li> Familiar with any scripting language (Python, Ruby, BASH, etc)</li> <li> Familiar with Linux environment and common tools</li> <li> Experienced designing highly scaled systems</li>\nPreferences\n<br><br>\nYou'll be especially competitive if you have any of:\n<li> Experience with Hadoop, map/reduce, Spark, Kafka, Impala, or other big data technologies</li> <li> Familiarity with RDBMS technologies (PostgreSQL, MySQL, Oracle, etc.)</li> <li> Understanding of distributed and parallel computing architectures</li> <li> Experience with modern DevOps toolchains, including Ansible</li> <li> Built highly-available, API-driven web services before (Node.js, Angular.js, d3)</li> <li> 2 to 3+ years of development experience</li> <strong> How to Apply:</strong>\n<br>\nFollow the link below.\n<br>\nAlternatively, send an email to sean.berger@viasat.com for an initial, confidential discussion.\n\n\n<ul>\n<li>---------</li>\n</ul>\n\n<strong>#LI-CN</strong>"}