{"job title": "Health Care Data Analyst", "company": "Advanced Technology Solutions, Inc", "city state": "– Plainsboro, NJ", "rating": "4.6", "job description": "Job Description<div>We are seeking a Data Steward for Healthcare Customers (including Professionals and Organizations) which includes, but is not limited to:\n<br><br>\n• Consolidation of duplicate records\n\n\n<ul>\n<li>Ensuring all required identifiers are listed on the consolidated records</li>\n<li>Investigating potential affiliations between both HCP and HCO</li>\n<li>Addressing field force data change requests</li>\n<li>Assist Data Management functions within the team</li>\n<li>Organize and analyze multiple data sources</li>\n<li>Data Quality Assurance</li>\n<li>Conduct UAT (User Acceptance Testing) for various system releases</li>\n<li>Provide ad-hoc assistance to various team members</li>\n<li>Proficient written and verbal communication skills</li>\n<li>Strong Attention to detail</li>\n</ul>\n\n<strong>Minimum Requirements:</strong>\n\n\n<ul>\n<li>Minimum of 2 years of coursework towards a degree in Business Administration, or other applicable Business areas</li>\n<li>Proficient computer skills using Microsoft Excel - ability to create and edit pivot tables, experience in using ‘vlookup’ and ‘if’ statements.</li>\n<li>Must be able to work independently and have excellent communication and writing skills.</li>\n<li>Organized and Detail Oriented</li>\n<li>Ability to multi-task, and transition between assignments quickly</li>\n<li>Experience in Customer Master and Data Analysis a plus, preferably in Pharmaceutical / Health Industry Professional and Organization customer data (IMS Health HCPS / HCOS data)</li></ul></div>Company Description<div>ATS is an information technologies consulting company providing services to Fortune 500 companies nationwide. ATS specializes in providing full-service staffing solutions by providing technical and business personnel through staff supplementation and project engagements. The company has extensive contacts within its Fortune 500 client base and is able to access a large pool of talented and responsive professionals with proven records of accomplishment in both the technical and business fields.</div>\n"}