{"job title": "Data Analyst II", "company": "Centene Corporation", "city state": "– Albuquerque, New Mexico", "rating": "3.1", "job description": "<strong>ProfessionalPosition Purpose:</strong>\n\n<li>Analyze health management programs including: data collection, validation and outcome measurement. May include:\n<br>\no Financial, pharmacy, claims, provider, and member data\n<br>\no IRS, CMS, HHSC, HEDIS reporting\n<br>\no Internal data cleansing and data reconciliation analysis\n<br>\no Trend analysis in various functional areas of health care management.</li>\n<li>Create and generate reports through MS-Excel, MS-Access, and SQL using Business Objects interface and direct links to core databases (ODS/EDW)</li>\n<li>Produce reports for and interface with senior management and internal and external stakeholders.</li>\n<li>Gather and interpret business requirements and monitor data trends to proactively identify issues</li>\n<li>Execute data changes and update core systems as needed</li>\n<li>Handle multiple projects and timelines effectively and communicate risks and issues to manager regularly</li>\n<li>Assist with training lower level Data Analysts.</li>Responsible for analytical data needs. Handle complex data requests, reports, and predictive data modeling.\n<br><br>\n<strong>Knowledge/Experience:</strong>\n<br>\nBachelors degrees related field or equivalent experience. 2+ years of statistical analysis or data analysis experience. Advanced knowledge of Business Objects, SQL, and Microsoft Applications, including Excel and Access.\n<br><br>\n<strong>HEDIS:</strong>\n<br>\nBachelors degree related field or equivalent experience. 2+ years of statistical analysis or data analysis experience or 1+ years of HEDIS data analysis experience including measurement and rates impacted. Advanced knowledge of Business Objects, SQL, and Microsoft Applications, including Excel and Access.\n<br><br>\n<strong>BUSINESS ANALYTICS:</strong>\n<br>\nBachelors degree related field or equivalent experience. 2+ years of statistical analysis or data analysis experience or 1+ years of related IT experience, including data warehouse, coding or ETL experience. Advanced knowledge of Business Objects, SQL, and Microsoft Applications, including Excel and Access.\n<br><br>\n<strong>PHARMACY UNDERWRITING:</strong>\n<br>\nBachelors degree related field or equivalent experience. 2+ years of statistical analysis or data analysis experience or 1+ years of related financial or IT experience, including data warehouse, SQL, coding experience, financial reporting / auditing, Underwriting, client reporting or predictive analytic experience. Intermediate knowledge of Business Objects, SQL, and Microsoft applications, including Excel and Access.\n<br><br>\nCentene is an equal opportunity employer that is committed to diversity, and values the ways in which we are different. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other characteristic protected by applicable law."}