{"job title": "DATA PROCESSING SYSTEMS ANALYST I (SR-20)", "company": "CIty and County of Honolulu, Hawaii", "city state": "– Honolulu", "rating": "3.6", "job description": "<div>\n \n Position Information\n <p></p><div>Assists in the design and development of electronic data processing systems and procedures for functionally distinct activities of an organization and carries out assigned phases thereof independently; analyzes and evaluates operating methods and practices relative to the information needs of specific programs and activities; and performs other related duties as required.</div><br><u>Current Vacancies</u>: Independently performs assignments to assist with the analysis, design, development, implementation, maintenance, and support of departmental enterprise systems. Presently working with a consultant to modify and implement a third-party application at the Honolulu Board of Water Supply.<p></p>\n Additional Job Information\n <p>At time of application, you must be a citizen, national or permanent resident alien of the United States or a non-citizen eligible under federal law for unrestricted employment.<br> </p><div>***Salary amount may be subject to pay adjustments***<br><br><strong>1) Only ONLINE applications will be accepted.<br><br>2) Paper applications will <u>NOT</u> be accepted.</strong><br><br>All vacancies are with the Honolulu Board of Water Supply (HBWS) in the Application Development Section only. This list may be used for future vacancies in these and other departments.</div><div> </div><div><div><strong><u>Important Notice:</u></strong></div><div><strong>Some notifications may be sent via e-mail. You are responsible for monitoring instructions and correspondence from this office by checking your email account in a timely manner. To ensure proper delivery, please make sure you:<br> - use a valid e-mail account;<br> - verify your e-mail address is entered correctly on your GovernmentJobs account;<br> - check your spam folders; and<br> - add info@governmentjobs.com to your contact list.</strong></div></div><p></p>\n Minimum Qualification Requirements\n <p><u>EDUCATION REQUIREMENT</u>:<br>Equivalent to graduation from an accredited college or university with major work in Computer Science, Public or Business Administration, Accounting, Mathematics or a related field.<br><br><u>Verification Requirement</u>: You must submit evidence of your education within 7 days of filing this application. A reproduced copy of your diploma and/or transcript which shows the embossed seal must be submitted in order to be given credit. Copies will not be returned. Mail or drop off: Department of Human Resources, 650 South King Street, 10th Floor, Honolulu, HI 96813.<br><br><u>Substitution</u>: Work experience may be substituted for the bachelor's degree on a year-for-year basis. Such experience must have provided the knowledge, skills, and analytical ability normally gained from attainment of a bachelor's degree.<br><br><u>EXPERIENCE REQUIREMENT</u>:<br>One year of experience in the analysis of operating practices, methods, and procedures, some of which shall have involved the conduct of feasibility studies and the analysis and design of systems for the electronic processing of data.<br><br><u>Substitution</u>:<br>1) A Bachelor's degree in Computer Science or MIS from an accredited university may be substituted for six months of the experience requirement.<br>2) A Master's degree in Computer Science or MIS from an accredited university may be substituted for the one year experience requirement.<br><br><u>Verification Requirement</u>: You must submit evidence of your education within 7 days of filing this application. A reproduced copy of your diploma and/or transcript which shows the embossed seal must be submitted in order to be given credit. Copies will not be returned. Mail or drop off: Department of Human Resources, 650 South King Street, 10th Floor, Honolulu, HI 96813.</p>\n Examination Process\n <p><u>EDUCATION AND EXPERIENCE EVALUATION</u>: In addition to meeting the above minimum qualifications, your application will be further evaluated. Your score will be based on the quality, quantity and/or recency of your education and experience. Failure to provide sufficient information may result in your application being rejected or your receiving a lower grade. Do NOT submit a copy of your resume or position description in lieu of providing detailed and complete information on your application form.<br><br>EXAMINATION WEIGHT:<br>Education and Experience Evaluation . . . . . . . . . . . . . . . . 100%</p>\n\n \n </div>"}