{"job title": "Technical Data Analyst", "company": "Clearwater Analytics", "city state": "– Boise, ID", "rating": "3.8", "job description": "As a Technical Data Analyst, you will leverage your raw skills in SQL, VBA, and Python in tandem with proprietary tools to efficiently analyze and process data sets. TDAs will analyze data content, develop new systematic checks, identify and correct erroneous data points, research new functionality, and work with constituents both inside and outside of Clearwater to ensure data accuracy and client success. As a member of Operations, you will be called upon to interact with top professionals within client and prospective client organizations in the Corporate Cash, Government, Insurance, and Investment Management industries.\n<br><br>\n<strong>Responsibilities</strong>:\n<ul>\n <li>Utilize programming and internal tools to re-engineer inefficient processes with the goal of improving system automation, speed, accuracy, and operational workflow</li> <li>Leverage SQL, VBA and Python to gather and analyze data to resolve problems and inconsistencies</li> <li>Work on a dynamic and fast paced team, applying your analytical and problem-solving skills for maximum impact across the organization and industry</li> <li>Strategize with development teams to improve our client experience, operational efficiency, and target prospective opportunities</li> <li>Effectively communicate and collaborate with a global team to accurately and efficiently resolve problems</li> <li>Reconcile investment transactions and accounting for portfolios using a state-of-the-art web-based system</li> <li>Work with multiple teams and departments to ensure accuracy and consistency of financial records and data</li>\n</ul>\n<strong>Requirements</strong>\n<ul>\n <li>Bachelor’s degree in Mathematics, Computer Science, Information Systems, or related area of study</li> <li>Strong aptitude for problem solving and math</li> <li>Experience with VBA, SQL, and/or Python</li> <li>Strong organizational and interpersonal skills</li> <li>Work with minimal direction and able to coordinate complex activities in an evolving environment</li> <li>Right to work in the U.S. without employment-based sponsorship now or in the future</li>\n</ul>\n<strong>Desired Experience and Skills:</strong>\n<ul>\n <li>Knowledge of investment accounting and related investment vehicles</li> <li>Securities or financial markets experience</li> <li>Experience with business intelligence solutions and relational databases</li>\n</ul>\n<strong>Benefits</strong>\n<br><br>\n<strong>What we offer:</strong>\n<ul>\n <li>Access to cutting edge investment reporting technology and expertise</li> <li>Continual learning and growth opportunities</li> <li>Team-focused culture that promotes innovation and ownership</li> <li>Competitive salary and benefits package</li> <li>Business casual atmosphere</li> <li>Brand new office in the heart of downtown Boise</li>\n</ul>"}