{"job title": "Senior Data Analyst, SEO", "company": "Compass", "city state": "– New York, NY", "rating": "4.6", "job description": "Compass is a technology-driven real estate platform that provides comprehensive brokerage services, combining exceptional agents with thoughtfully crafted digital products to make the process of buying, selling, or renting a home intelligent, deliberate, and seamless.\n<br><br>\nWe're looking for a Sr. SEO Analyst who will play a key role in building out our SEO practice at Compass. As a Sr. SEO Analyst you will be tasked with optimizing our front end and back end for search, as well as establishing reporting dashboards and helping the team make proactive, data-driven decisions. You will work with Product Managers, Engineers and Marketers to ensure we are adhering to best practices and to ensure our content is optimally discoverable across all major search engines.\n<br><br>\n<strong>At Compass You Will:</strong>\n\n<ul>\n<li>Writing specification documents and designing experiments to test new strategies and opportunities for growth.</li> \n\n<li>Identifying growth opportunities in core areas such as site link structure, keyword selection and other on-page factors.</li>\n<li>Analyzing experiment results and pushing forward next steps at a fast pace</li>\n<li>Identifying and analyzing competitor techniques to determine what should be incorporated into Compass SEO best practices.</li>\n<li>Monitoring daily performance metrics to understand organic search performance</li>\n<li>Performing traffic and conversion analysis to gain insight into keyword and landing page performance</li>\n<li>Optimizing internal linking structures to maximize rankings across our keyword portfolio</li>\n</ul>\n<strong>What We Look For:</strong>\n\n<ul>\n<li>BA/BS degree in quantitative field such as economics, mathematics, statistics, or computer science/engineering</li>\n<li>5+ years of in-house SEO work experience with an industry leading website. This experience has given you a demonstrable track record of business results through SEO.</li> \n\n<li>You are a passionate search marketer who is extremely knowledgeable about best practices and the latest new areas of SEO</li>\n<li>Expert level ability with Excel and/or Google Sheets</li>\n<li>Exposure to SQL, Python or other coding languages is strongly desired</li>\n<li>Exposure to Looker, Tableau or other BI systems is strongly desired</li>\n<li>Comfort with a fast-paced work environment at a rapidly evolving organization</li>\n<li>Excellent written communication and compelling presentation style that helps you get buy in for your ideas</li>\n<li>Quantitative, pragmatic, and methodical in your approach to SEO.</li>\n<li>You are a strong problem solver and have a genuine curiosity about how consumers search for information.</li>\n<li>You get excited by large volumes of data and keywords and are adept at analyzing data at scale</li>\n</ul>\nAt Compass, our mission is to help everyone find their place in the world. This means we continually celebrate the diverse community different individuals cultivate. As an equal opportunity employer, we stay true to our mission by ensuring that our place can be anyone's place."}