{"job title": "Senior Business Analyst ( Data Platform)", "company": "Coupang", "city state": "– Seattle, WA", "rating": "3.9", "job description": "<div>Coupang is one of the largest and fastest growing e-commerce platforms on the planet. Our mission is to create a world in which Customers ask \"How did I ever live without Coupang?\" We are looking for passionate builders to help us get there. Powered by world-class technology and operations, we have set out to transform the end-to-end Customer experience -- from revolutionizing last-mile delivery to rethinking how Customers search and discover on a truly mobile-first platform. We have been named one of the \"50 Smartest Companies in the World\" by MIT Technology Review and \"30 Global Game Changers\" by Forbes.</div>\n<br>\n<div>Coupang is a global company with offices in Beijing, Los Angeles, Seattle, Seoul, Shanghai, and Silicon Valley.</div>\n\n<br><strong>Mission</strong>\n<br><br>\nDo you see data &amp; analytics as a crucial enabling technology in today's business environment? Do you have strong subject matter expertise in business intelligence software architecture and analysis? Are you execution-oriented with attentive detail to driving business enhancements and improvements using Data analysis? If you answered yes to the above, then you might be the right person to be the Business Analyst in Data &amp; Analytics Organization.\n<br><br>\nBI data &amp; Analytics is critical to Coupang business strategy. This role will be responsible for Business and technical data analysis, diving deep into data to understand and help improve business processes and increase efficiencies in our systems and business decisions. You will be part of a Global team working from different locations but still works as a central connected unit.\n<br><br>\nAs a Business Analyst, you will work closely with members of multiple Business &amp; Engineering teams, product marketing, operations, sales &amp; finance teams to help define, streamline, design and analysis data to build business requirements and decisions. In addition, the ideal candidate must possess a high degree of collaborative skills, and the ability to communicate effectively on many levels.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\n· Strong business &amp; technical analytical capability to understand data &amp; scenarios. Should be able to dive deep into data analysis, write SQL queries and provide data analysis to team and customers\n<br><br>\n· Strong blend of technical, business acumen that enables seamless communication across teams, project execution and great customer reach.\n<br><br>\n· Should be able to come up with scenarios and business requirements by analyzing data and business needs.\n<br><br>\n· Develop metrics measuring inputs and outputs, in collaboration with business teams, senior management and Engineering teams\n<br><br>\n· Provide root cause analysis affecting key business problems\n<br><br>\n· Work with Data TPM &amp; Engineering team to get the right data modelled and built for scalability and make accurate business decisions.\n<br><br>\n· Identify, design and champion innovative ways to positively impact our customers at scale\n<br><br>\n· Conduct in-depth data analyses to drive and deliver insights to help business &amp; leadership make strategic decision\n<br><br>\n· Partner with different functional teams, leveraging various tools to automate models and reports using Tableau, Power BI etc.\n<br><br>\n· Cares deeply about data quality and demonstrates this commitment by attention to quality of data and code generated\n<br><br>\n· Excellent cross-group collaboration and communication skills\n<br><br>\n· Strong problem-solving skills, analytical capabilities, and attention to detail\n<br><br>\n<strong>Who we are looking for!</strong>\n<br><br>\n· Minimum of 3 - 5 Years of Business Analysis / Data Analyst experience on Business Intelligence / Data Warehouse / Big Data Technologies with emphasis on data analysis (quality, profiling, conformed modeling, etc.)\n<br><br>\n· At least 3 - 5 years of experience with advanced skill in using SQL is a must.\n<br><br>\n· Must have experience in reporting building visualization tools (e.g. Tableau, Power BI etc.)\n<br><br>\n· Preferred experience with a scripting language (e.g. Python)\n<br><br>\n· Intermediate to advanced skills in using Excel and Access is preferred.\n<br><br>\n· Experience querying Big Data Systems (Hive, Hadoop, Hue, Zeppelin etc.)\n<br><br>\n· Strong research and analytical mindset\n<br><br>\n· Bachelors in computer science, mathematics, statistics, or equivalent\n<br><br>\n· Strong capability to draw insights/conclusions from raw data and summarizing results quickly and efficiently\n<br><br>\n· Ability to prioritize work in a complex, fast-paced environment.\n<br><br>\n· Ability to work with ambiguous problems.\n<br><br>\n<strong>Perks:</strong>\n\n<ul>\n<li>Autonomy to make decisions in a rapidly growing company</li>\n<li>Free medical, dental, and vision insurance</li>\n<li>18 days PTO + 12 national holidays off</li>\n<li>Catering lunches 3 days</li>\n<li>401K matching</li>\n<li>Pre-IPO stock options</li>\n<li>Mobile &amp; fitness reimbursement</li>\n<li>Flexible working hours</li> \n</ul>\n<em>Coupang is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex or gender (including pregnancy, gender identity, gender expression, sexual orientation, transgender status), national origin, age, disability, medical condition, HIV/AIDS or Hepatitis C status, marital status, military or veteran status, use of a trained dog guide or service animal, political activities, affiliations, citizenship, or any other characteristic or class protected by the laws or regulations in the locations where we operate.</em>\n<br><br>\n<em>If you need assistance and/or a reasonable accommodation in the application or recruiting process due to a disability, please contact us at usrecruiting@coupang.com.</em>"}