{"job title": "Data Entry Analyst", "company": "Cypress HCM", "city state": "– Sunnyvale, CA", "rating": "4.3", "job description": "<div><strong>Data Entry Analyst</strong></div><div><strong> </strong></div><div><strong>Job Overview:</strong></div><ul><li>Our developer platform enables LinkedIn to drive growth, engagement, and monetization globally by delivering on partnerships, in collaboration with product, engineering, business development, and other cross-functional teams. You will work alongside a great team of Partner Engineers to drive innovation through our APIs, developer platform, and partner integrations.</li><li>We are looking for smart, high energy, and passionate service-oriented people who are looking to make a big impact. Partner Operations Engineer is the point of contact for day-to-day issue management for external developers building on our platform. This person will assist developers during integration with our APIs and support post-launch technical issues.</li></ul><div><strong> </strong></div><div><strong>Responsibilities include:</strong></div><ul><li>Accurately copy, type, enter information from one system to another. </li><li>Clean up, reformat and wordsmith where necessary.</li><li>Configure our community forum and help center</li></ul><div><strong> </strong><strong>Basic Qualifications:</strong></div><ul><li>College senior or grad </li><li>Excellent written and verbal communication skills</li><li>Excellent attention to detail required</li><li>Strong organizational skills are required</li><li>Ability to work in a fast-paced environment</li><li>Computer skills are required </li><li>Experience understanding and following instructions and procedures quickly and timely</li><li>Provide high quality work and meet deadlines</li></ul><div><strong> </strong><strong>Preferred Qualifications:</strong></div><ul><li>Bachelors Degree in Computer Science or Equivalent degree and/or experience</li></ul><div><strong> </strong><strong>Personal Attributes:</strong></div><ul><li>Ability to multi-task and perform in a fast-paced environment with good time management skills</li><li>Results-oriented individual who can make a difference; willing to take the initiative and make things happen, accepts accountability, and has a \"can do\" attitude.</li><li>Action oriented self-starter and quick learner; not afraid to roll up their sleeves and get into the details; has a sense of urgency</li></ul><div> </div>"}