{"job title": "Financial Data Analyst - Accounts Payable", "company": "Foodbuy", "city state": "– ALPHARETTA, GA", "rating": "3.3", "job description": "<p></p><p><b>A family of companies and experiences</b></p><p>As the leading foodservice and support services company, Compass Group USA is known for our great people, great service and our great results. If you’ve been hungry and away from home, chances are you’ve tasted Compass Group’s delicious food and experienced our outstanding service. Our 200,000 associates work in award-winning restaurants, corporate cafes, hospitals, schools, arenas, museums, and more in all 50 states.</p><p>Our reach is constantly expanding to shape the industry and create new opportunities for innovation. Join the Compass family today!</p><p><b>great people. great services. great results.</b></p><p>Each and every individual plays a key role in the growth and legacy of our company. We know the next big idea can come from anyone. We encourage developing and attracting expertise that differentiates us as a company as we continue to raise the bar.</p><div><p></p><p>Job Summary\n</p><p></p><p><strong>Foodbuy</strong> is the foodservice industry's leading Group Purchasing Organization (GPO) focused on lowering purchasing and product costs for foodservice organizations. Currently we offer a Great Opportunity for career development and growth as a Data Integration Coordinator based in our <strong>Alpharetta, GA</strong> office.</p><p> </p><p>The <strong>Data Integration Coordinator </strong>is responsible for working directly with Distributors and vendors to obtain complete and timely transaction level reporting. This process results in the successful capture and processing of Foodbuy customers' purchase transactions, and the generation of manufacturer invoices, customer rebates and price audits ensuring maximum revenue and savings for those customers.</p><p><br><strong>Responsibilities: </strong><br>• Coordinate and ensure the timely receipt and processing of invoice/transaction data from distributor partners <br>• Analyze distributor data to identify gaps in reporting and potential revenue opportunities <br>• Ensure accuracy and completeness of information received from distributor<br>• Present findings to management and solicit feedback via formal/informal communication <br>• Demonstrate comprehensive understanding of invoice/transactional reporting process<br>• Generate and maintain reports used for analysis and management of daily workload<br>• Formulate new methodologies and analytics to drive efficiencies and increase customer data capture <br>• Test and validate data specifications and content to assist the Vendor On-boarding process<br>• Collect and provide analysis to assist in the on-boarding of vendors to MyFinance / eVIA (electronic vendor invoice approval)<br>• Collect and process AP Recon and PCard data files<br>• Other duties as required</p><p> </p><p><strong>Qualifications:</strong><br>• Working knowledge of MS Office Suite with specific ability to fully utilize Access<br>• Working knowledge of SQL or commercial query tool a plus<br>• Oracle database tools (Toad/DBSaint or similar) a plus<br>• Completion of undergraduate degree and/or equivalent business experience required<br>• Financial or trend analysis experience<br>• Minimal travel required (typically to the Corporate office in Charlotte)<br>• Detail-oriented<br>• Analytical problem solving<br>• Flexible/Adapts well to change<br>• Collaborative - works well as a member of a team<br>• Strong verbal and written communications skills<br>• Customer service focus<br>• Innovative<br>• High level of Integrity and Ethics</p>\n<p></p><p></p></div><p><b>Apply to Foodbuy today!</b></p><p>Foodbuy is a member of Compass Group USA</p><p><b>Click here to Learn More about the Compass Story</b></p><p><b>&nbsp;</b></p><p><b>Compass Group is an equal opportunity employer. At Compass, we are committed to treating all Applicants and Associates fairly based on their abilities, achievements, and experience without regard to race, national origin, sex, age, disability, veteran status, sexual orientation, gender identity, or any other classification protected by law.</b></p><p><strong>Req ID:&nbsp;</strong>204075</p><p>Foodbuy&nbsp;</p><p>CAMERON C BLACK&nbsp;</p><p>SALARIED EXEMPT&nbsp;</p>"}