{"job title": "Data Analyst Supporting the FBI-Top Secret Preferred #18-535", "company": "Forfeiture Support Associates", "city state": "– New Orleans, LA", "rating": "3.2", "job description": "Salary: 21.88\n<br><br>\n<strong>Published Job Title:</strong>\n<br>\nData Analyst Supporting the FBI-Top Secret Preferred\n<br><br>\n<strong>Requisition::</strong>\n<br>\n<strong>18-535</strong>\n<br><br>\n<strong>Worksite::</strong>\n<br>\n<strong>FBI</strong>\n<br><br>\n<strong>Position Schedule::</strong>\n<br>\nPart-time\n<br><br>\n<strong>Description::</strong>\n<br>\n<div>Focused on delivering unsurpassed services in support of law enforcement and homeland security, FSA, a rapidly growing joint venture owned by trusted solutions providers Engility and AECOM, has a vacancy for a Data Analyst supporting the FBI.</div><br>\n\n<div><strong>A Data Analyst executes the following duties:</strong></div>\n<ul>\n<li>Provide organization and management of case files</li>\n<li>Review data (completeness of information, proper execution)</li>\n<li>Extract data from data base</li>\n<li>Obtain additional information from other investigative agencies/data base</li>\n<li>Establish/maintain physical file</li>\n<li>Prepare notices/advertisements</li>\n<li>Receive, suspense petitions, claims, process sharing requests</li>\n<li>Reconcile inconsistencies</li>\n<li>Prepare declarations</li>\n<li>Gather information and organize investigative package</li>\n<li>Verify case files and case tracking system</li>\n<li>Maintain internal status information on the disposition of all forfeited assets</li>\n<li>Assure information is accurate and perform analytical computations necessary to process data</li>\n<li>Conduct and reconcile inventories</li>\n<li>Distribute and receive documents</li>\n<li>Assist lead analyst or official in obtaining/collecting all documents/information to complete case file</li>\n<li>Provide administrative information and assistance concerning case to other investigative agencies, local law enforcement agencies, US Attorney, and other DOJ processing units, and higher headquarters</li>\n<li>Extract data from agency data base for management and program reports</li>\n<li>Perform word processing relevant to case documentation</li>\n<li>Perform data entry relevant to case</li>\n</ul>\n\n<strong>Requirements::</strong><br>\n\n<div><strong>A Data Analyst must meet the following qualifications:</strong></div>\n<ul>\n<li>High School diploma, bachelor's Degree preferred</li>\n<li>Ability to review and analyze data and information from multiple sources</li>\n<li>Ability to establish case/project files</li>\n<li>Ability to enter and retrieve data from data bases</li>\n<li>Ability to prepare and format management reports</li>\n<li>Ability to manipulate, transfer, and compute and print information</li>\n<li>Ability to create and manipulate spreadsheets</li>\n<li>Ability to prepare and correct reports and correspondence using word processing software</li>\n<li>Top Secret clearance is strongly preferred</li>\n</ul>\n\n<div><strong>This position requires U.S. Citizenship and a 7 (or 10) year minimum background investigation.</strong></div>\n\n<br><strong>EEO Statement:</strong>\n<br>\nForfeiture Support Associates (FSA) LLC is proud to be an Affirmative Action/ Equal Opportunity Employer. We recruit, employ, train, compensate, and promote qualified persons in all job titles without regard to age, ancestry, color, gender, HIV status, marital status, medical condition, national origin, physical or mental disability, race, religion, sex, sexual orientation (including gender expression and identity) veteran status, family leave status, and any protected group status as defined by applicable law.\n<br><br>\n<strong>FSA Internal Use Only::</strong>\n<br><br>"}