{"job title": "HRIS Data and Reporting Analyst - North American Support Center", "company": "Hudson Group", "city state": "– East Rutherford, New Jersey", "rating": "2.2", "job description": "<div>\n<div>\n<div>\nPosition: HRIS Data and Reporting Analyst</div>\n </div>\n</div><br>\n\n <div>\nLocation: North American Support Center (NASC)</div><br>\n\n<div><strong>GROW <em>With</em> US!</strong>\n<br><br>\nFor 30 years Hudson Group has led the way and prides itself in knowing what matters in travel retail. As airports and transportation terminals have evolved, so has Hudson Group, striving to bring sophistication and convenience to today's traveler.\n<br><br>\nHudson Group is North America's largest specialty travel retailer. We offer great career opportunities for individuals who will provide excellent customer service and maximize sales by assisting in the daily operation of the stores.\n<br><br>\n<strong>JOB DESCRIPTION:</strong>\n<br><br>\nThe HRIS Data and Reporting Analyst provides day to day support for HR systems, including advanced reporting, troubleshooting and various analysis as well as resolving support issues by working directly with both internal clients and external service providers.\n<br><br>\nThis position will act as a liaison to other Human Resource teams, the Information Technology Department, Payroll Department and other business units to ensure that systems provide the means for and enable processes to effectively gather, maintain, and utilize HR-related information.\n<br><br>\nThis individual will drive the successful delivery of accurate human capital metrics for the business and ensure data integrity for all HR systems. The HRIS Data and Reporting Analyst will also be responsible for documenting system processes and procedures and assist in the training of end-users. The qualified candidate will report to the Director of HR Systems &amp; Payroll.\n<br><br>\n<strong>JOB RESPONSIBILITIES:</strong>\n\n<ul>\n<li>Analyzes HR processes and makes recommendations for improvements via the use of technology.</li>\n<li>Designs and develops reports.</li>\n<li>Perform system maintenance and testing of system enhancements for our HCM Solutions.</li>\n<li>Troubleshoot and offer technical assistance in support of Payroll, Human Resources, IT and various business units.</li>\n<li>Maintains data integrity in HR systems by conducting routine audits, analyzing and updating data where appropriate</li>\n<li>Documents and maintains accurate and thorough HRIS end-user processes and procedures</li>\n<li>Acts as HRIS Security Administrator including managing user system access.</li>\n<li>Updates system fields and tables associated with business change and operations.</li>\n<li>Performs all other duties as may be required by the needs of the business.</li> \n</ul>\n<strong>Necessary Skills / Qualifications</strong>\n\n<ul>\n<li>Strong HCM System knowledge is a must.</li>\n<li>Ability to work independently and under minimal supervision and as a member of the HRIS team.</li>\n<li>Strong administrative and organizational skills with the proven ability to take initiative to complete assignments and responsibilities on time.</li>\n<li>Proficiency in problem analysis, issue resolution, planning and time management.</li>\n<li>Clear and concise verbal and written communication skills.</li>\n<li>Ability to manage multiple priorities at the same time.</li>\n<li>Ability to work in a fast-paced office environment.</li>\n<li>Strong MS Office skills (e.g., Word, Excel, PowerPoint).</li>\n<li>Advanced knowledge of <strong>Microsoft Excel</strong> (pivot tables, vlookup and other advanced Excel functions and formulas).</li>\n<li>ADP EV5, Kronos WFC 7 and Success Factors Implementation and Administrator experience is preferred.</li>\n<li>Ability to maintain confidentiality information, professional demeanor under pressure and effectively work with employees at all levels.</li>\n<li>Working knowledge of Employee and Manager Self Service is preferred but not required.</li>\n</ul>\n\n<strong>EDUCATION AND EXPERIENCE:</strong>\n\n\n<ul>\n<li>Minimum 3+ years’ experience in a combination of the following areas: report writing, data administration and analysis, HRIS (or similar system experience), and training</li>\n<li>Bachelor’s Degree in Computer Science, HR or related field</li>\n</ul>\n\nHudson Group is always on the lookout for top quality people who want to be a part of a winning retail team. With many stores and concepts across the country and throughout the world, we have the ability to help you find the job that is right for you. We recognize that our employees are a driving force behind our success! Our dedicated team enjoys an exciting and friendly environment!<br><br><strong>We invite you to learn more about our …</strong>\n\n<ul>\n<li>Competitive Salaries,</li>\n<li>Medical, Dental &amp; Vision Insurance,</li>\n<li>Company Paid Life Insurance,</li>\n<li>Paid Vacation,</li>\n<li>Paid Sick Time,</li>\n<li>Employee Recognition Programs,</li>\n<li>Advancement and Growth Opportunities,</li>\n<li>On-going Training &amp; Development.</li>\n</ul>\nQualified candidates should submit their resume for immediate consideration.\n<br><br>\nThe job that’s right for you!\n<br><br>\nHudson Group will consider all qualified applicants for employment without regard to race, color, religion, national origin, sex (including pregnancy) sexual orientation, age, disability, veteran status or other characteristics protected by law.\n<br><br>\njobs@hudsongroup.com</div><br>\n\n <div>\nApply Now</div>\n\n<br>Apply"}