{"job title": "Data Analyst", "company": "ICONMA", "city state": "– Atlanta, Georgia", "rating": "3.4", "job description": "<strong><u>Data Analyst</u></strong>\n<br><br>\nLocation: Atlanta, GA\n<br>\nDuration: 6 months with possible contract to hire\n<br><br>\n<strong>Description:</strong>\n<br>\nA Bachelor's Degree is required.\n<br><br>\n<strong>Business Initiative/Purpose:</strong>\n<br>\nLeads complex BIO projects with moderate to high risk working with key business stakeholders and IT to provide strategic decision capabilities in consumer banking domain. The successful candidate will be responsible for recommending business actions to business leaders based on interpreted findings, data and facts. Takes ownership and leads discussion on analytical solutions collaborating with business and IT on the implementation of those solutions. The member also provides direction on project approach, requirements, testing, governance and implementation. Additional as a senior member will coach lower level Business Analysts to assists in their task planning and monitoring the progress and quality of their work. Experience working on SQL and SAS is preferable. Should have good database knowledge and ability to synthesize large data sets to meaningful KPIs and metrics.\n<br><br>\n<strong>Additional responsibilities include but are not limited to:</strong>\n\n\n<ul>\n<li>Supports execution of standard and ad hoc reporting capabilities by conducting in-depth portfolio analysis and summarizing portfolio performance and trends.</li>\n<li>Covers a large amount of business analysis, responds to change; solve highly complex business problems.</li>\n<li>Creates new processes and interacts with all levels of management and executives within assigned LOB/Function(s).</li>\n<li>Develops and documents highly complex business requirements for new reporting capabilities and conducts the pertinent user acceptance testing.</li>\n<li>Performs quality assurance testing on standard and ad hoc reporting capabilities with high complexity</li>\n</ul>\n\n<strong>Must have skills</strong>\n<br>\nSQL, Reporting experience, Business and Data Analysis using SQL, Requirements gathering, Validation and testing, Banking Experience, Communication Skills, Atleast a bachelor's Degree, 8+ years' experience as a data analyst\n<br><br>\n<strong>Plus/nice to have skills</strong>\n<br>\nSAS, Banking deposits experience, familiarity with COGNOS or QLIKView"}