{"job title": "Junior Data Analyst - Periscope, New Ventures", "company": "McKinsey &amp; Company", "city state": "– San Jose, California", "rating": "4.3", "job description": "<strong> Qualifications</strong>\n<li> Bachelor's degree in Information Technology</li> <li> 1-2 years of experience in the field of Data Analytics, IT (Database-focused), ETL and/or data analysis domains</li> <li> Experience with SQL Server and Excel</li> <li> Python or Java/.NET programming background</li> <li> Ability and inclination to process large set of data</li> <li> Big Data technologies exposure (Hadoop, Kudu, Impala)</li> <li> Exposure to AWS, Exasol and Jenkins is considered a plus</li> <li> Excellent time management skills</li> <li> Strong interpersonal skills including assertiveness, not afraid to challenge constructively, fast learner, client oriented, respect of commitments, etc.</li> <li> Sound problem-solving skills and action-oriented mindset</li> <li> Good attitude for getting the task executed and creative implementation of technology</li> <li> Able to cope with pressure and demonstrate a reasonable level of flexibility/adaptability</li> <li> Good communication skills in English; added language (French or Portuguese) is a plus</li>\n<strong> Who You'll Work With</strong>\n<br><br>\nYoull work with our Periscope team in our San Jose, Costa Rica office. Periscope is part of McKinseys New Ventures. This is part of an exciting, highly visible fast-growing group within our Marketing &amp; Sales Ventures and the broader firm.\n<br><br>\nFounded in 2007, Periscope by McKinsey enables better commercial decisions by uncovering actionable insights. The Periscope platform combines world leading intellectual property, prescriptive analytics, and cloud based tools to enable25 solutions which focus on insights and marketing,expert support and training. It is a unique combination that drives revenue growth both now and in the future. Customer experience, performance, pricing, category, and sales optimization are powered by the Periscope platform. Periscope has a presence in 26 locations across 16 countries with a team of 350+ IT and business professionals and a network of 300+ experts. To learn more about how Periscopes solutions and experts are helping businesses continually drive better performance, visit http://www.periscope-solutions.com/\n<br><br>\nNew Ventures fosters innovation driven by analytics, design thinking, mobile and social by developing new products/services and integrating them into our client work. It is helping to shift our model toward asset-based consulting and is a foundation for and expands our investment in our entrepreneurial culture. Through innovative software as a service solutions, strategic acquisitions, and a vibrant ecosystem of alliances, we are redefining what it means to work with McKinsey.\n<br><br>\nAs one of the fastest-growing parts of our firm, New Ventures has more than 1,000 dedicated professionals (including more than 800 analysts and data scientists) and were hiring more mathematicians, data scientists, designers, software engineers, product managers, client development managers and general managers.\n<br><br>\n<strong> What You'll Do</strong>\n<br><br>\nYou will perform configuration of applications based on instructions and specifications provided by the Service Management team.\n<br><br>\nYou will be responsible for performing uploads of data into applications. This entails using application administration tools (combination of proprietary tools, Microsoft SQL Server, Excel, VBA scripting depending on the application), validating raw data quality and taking corrective measures in case of issues.\n<br><br>\nYou will perform manual data cleansing and QA activities related to the execution of application configuration and data upload activities. You will also code and script (SQL, SSIS, etc.) for automating data transformation and loading."}