{"job title": "Business Development Data and Reporting Analyst (FULL-TIME)", "company": "Nemours Foundation", "city state": "– Wilmington, DE", "rating": "3.5", "job description": "As one of the nation’s leading pediatric health care systems, Nemours is committed to providing all children with their best chance to grow up healthy. We offer integrated, family-centered care to more than 300,000 children each year in our pediatric hospitals, specialty clinics and primary care practices in Delaware, Florida, Maryland, New Jersey and Pennsylvania. Nemours strives to ensure a healthier tomorrow for all children – even those who may never enter our doors – through our world-changing research, education and advocacy efforts. At Nemours, our Associates help us deliver on the promise we make to every family we have the privilege of serving: to treat their child as if they were our own.<br><br>Nemours is seeking a Business Development Data and Reporting Analyst (FULL-TIME) to join our team in Wilmington, Delaware.\n<br><br>\nAs the birthplace of the Nemours healthcare system, the Nemours/Alfred I. duPont Hospital for Children in Wilmington, Del. honors our legacy of delivering exceptional care to the children of the Delaware Valley and beyond. Ranked among the nation’s best pediatric hospitals by U.S. News &amp; World Report and honored with the ANCC’s Magnet Designation for excellence in nursing practice, we offer intensive and acute inpatient and outpatient services covering more than 30 pediatric specialties. We recently completed a multi-phase hospital expansion that includes new inpatient rooms, Pediatric Intensive Care Unit and Emergency Department. Additionally, Nemours duPont Pediatrics allows us to reach more children across the region through community-based physician services and collaborative partnerships with health and hospital systems.<br><br><strong>Job Duties</strong>\n<br><br>\nThe Center for Health Delivery Innovation (CHDI) uses evidence-based decision making to optimize revenue generation and value-based care derived from Nemours’ digital assets including Nemours CareConnect (telehealth platform), consumer websites (Nemours.org, KidsHealth.org, and ReadingBrightStart.org) patient portal/app, and educational content. The Business Analyst will quantify the business impact (access, financial, patient satisfaction) of our digital assets using a variety of data including financial, patient records, CRM, and digital usage metrics. The successful candidate will track, analyze and surface opportunities to reduce friction for consumers, improve our business outcomes and drive loyalty through use of our consumer-facing digital interfaces. Analysis of different aspects of the data will include but not be limited to: understanding referral patterns, activity from one site to the next, tracking leads to conversions such as making an appointment online or having an online video visit with a doctor, tracking to reduce costs of care, ROI, patient satisfaction, etc. The successful candidate <u>must</u> have an attitude of ownership for these responsibilities, and will demonstrate this through initiative in collaborating with multiple stakeholders to provide them the insights required for strategic decision making.\n<ul>\n<li>Develop dashboards and reports for CHDI leadership on KPIs for key digital assets, including helping to formulate indicators that approximate financial impact (such as cost of care savings, loyalty and lifetime value of patients).</li><li>Draw insights from the data in those dashboards and reports in order to, among other needs, develop hypotheses on the means to increase revenue and loyalty, and reduce expense.</li><li>Initiate business questions beyond those posed by stakeholders and gather data appropriate to inform and answer those questions.</li><li>Identify and track the types of outcomes achieved by users of the different Nemours digital assets, for example, users of KidsHealth achieve X kinds of outcomes, users of Nemours CareConnect achieve Y kinds of outcomes/generate Y revenue, etc. Process ad hoc (that is, not regularly-published) requests for metrics on business issues related to Nemours digital assets.</li><li>Create and maintain strong, resilient relationships with individuals at a variety of levels within Nemours necessary to accomplish the functions above.</li><li>Periodically assist the CHDI B2B business development team around analysis of its content licensing business (e.g., web content, patient instructions, and video) to other health systems, payors, etc.</li><li>Provide analysis for current and developing health system partner telehealth contracts.</li><li>Additional miscellaneous duties and responsibilities, as may be assigned from time to time by employee’s supervisor.</li>\n</ul>\n<strong>Job Requirements</strong>\n<ul>\n<li>Bachelor's Degree required. Degree work should include subjects entailing quantitative analysis as it applies to real-world, pragmatic problem solving (i.e., business, psychology, or engineering rather than pure mathematics), as well as exposure to information technology. If this latter was not part of the academic course of study, then the lack can be made up through professional certification training and/or on-the-job experience.</li><li>Minimum of three (3) to five (5) years' experience required.</li><li>Business analytics experience to extract actionable insights from data patterns guiding strategic decision making by internal stakeholders for optimizing revenue &amp; value.</li> <li>Experience in a healthcare providing organization or healthcare insuring (payor) organization a must (note – we do not define the pharma industry as healthcare for our purposes.</li><li>Experience with a hospital system a strong plus.</li><li>SPSS, SAS, or other statistical software experience required.</li><li>Familiarity with data extraction from electronic health records (EPIC CLARITY preferred) and financial systems (Lawson preferred).</li><li>Experience using data visualization tools such as Qlik, Tableau, or similar.</li><li>Experience conducting analysis using basic statistics (descriptive) required; data modeling for revenue projections required; inferential statistics a plus.</li><li>Knowledge of hierarchical and relational database structures, including use of SQL for data extraction.</li>\n</ul>\nOur dedication to professionals who are dedicated to children frequently earns Nemours a spot on the list of top workplaces in the communities we serve. Our Associates enjoy comprehensive benefits, including our unique “Bridge to a Healthy Future” pediatric health plan, an integrated wellness program, opportunities for professional growth, and much more. As an equal opportunity employer, Nemours focuses on the best-qualified applicants for our openings."}