{"job title": "Sr Data Analyst EDM", "company": "Protective Life", "city state": "– Birmingham,AL", "rating": "3.1", "job description": "The<strong>Enterprise Data Analyst II</strong> will work as part of the Enterprise Data Services(EDS) team under the direction of the Manager of Enterprise Data Management. The position relies on good judgment and guidance from EDS leadership to perform analytical and data services functions to interpret data and trends in support of EDS and business activities, requiring a broad degree of independence, knowledge and problem solving skills.\n<br><br>\nThe position will provide tactical support to the organization by analyzing and interpreting the data to provide creative solutions for sourcing and delivering required information. The candidate will serve as a data interpretation resource, should have knowledge of data analysis tools, data profiling techniques and computer systems technology. This position will work closely with our Enterprise Business Analysts and the Data Integration team to develop technical requirements and comprehensive solutions to extract data from multiple source systems or models, transform data according to Business Rules and Master Data Management, work with the Enterprise Data Governance team to assure attributes are properly governed and also loaded into operational and presentation models.\n<br><br>\nThe ideal candidate will have experience collecting user requirements, data analysis, documenting technical specifications, and understand core data characteristics. The role influences others in IT through sharing of specialized business intelligence technical knowledge. This role is expected to support and expand a culture of operational excellence. The ability to understand complex business needs, logical problem solving skills, and strong written and verbal communication skills are required. Additionally, a strong understanding of database methodology, data analysis and business intelligence applications are required.\n<br><br>\nThis position requires a technical individual that has the ability to communicate clearly with EDS Management, Enterprise Data Architects, Enterprise Data Operations, Project Managers, Business Users and other IT professionals using technically sound terminology and excellent communication skills.\n<br><br>\nResponsibilities:\n<ul>\n<li>Map data source attributes to governed attribute definitions</li><li>Support all Master Data Management (MDM) and Operational Reference Data Management (RDM) processes</li><li>Contribute to the development of a mature data stewardship process that feeds new attribute values out to business representatives on the Enterprise Data Governance Committee</li><li>Research data requests to determine availability, sourcing and fulfillment options</li><li>Work with Business Analysts to provide technical guidance and design for project and data requests</li><li>Identifying patterns and help the business react to changing business conditions</li><li>Perform root cause analysis on data quality issues</li><li>Identify data anomalies and work with data stewards in other units to develop policies and best practices</li><li>Monitor the state of data quality within their scope of responsibility</li><li>Work toward established goals for data quality improvement</li><li>Identify the best approaches for resolving data quality issues</li><li>Formulate business rules governing use of the data, including security and data life cycle management</li><li>Escalate problems where necessary to leaders of the data quality initiative</li><li>Actively participate in Team design reviews and co-operative project design initiatives</li><li>Create and maintain quality documentation for technical and non-technical staff</li><li>Participate in the testing and implementation of technology solutions</li><li>Work directly with Developers, Line of Business Data Stewards, and Business Analysts on data requirements and Quality Assurance</li><li>Work independently under the direction of Enterprise Data Management leadership</li><li>Support validation processes that profile data attributes against their intended meaning</li>\n</ul>\nQualifications:\n<ul>\n<li>Bachelor’s degree or equivalent certifications / experience required</li><li>Experience with Microsoft SQL Server (specifically SQL Server 2012) and/or Oracle preferred</li><li>Database and SQL experience preferred</li><li>8+ years IT analysis experience required</li><li>4+ years Data Analysis/Data Stewardship or relevant work experience. Experience in actuarial sciences a Plus</li><li>2+ years of Business Intelligence application delivery using the Microsoft Business Intelligence stack (SSIS, SSAS, SSRS, SQL Server) a plus</li><li>Experience working on a project team using a waterfall methodology required. Agile SDLC methodology preferred</li><li>Experience in relational and dimensional data modeling required</li><li>Experience in the Insurance industry and/or LOMA coursework; FLMI certification a plus</li><li>Fundamental understanding of Service Management with ITIL is a plus, ITIL Foundation V3 Certification preferred</li><li>Ability to lead, influence and modify behaviors on a comprised of IT and Business partners in support of data quality improvement</li><li>Ability to work independently</li><li>Advanced knowledge of BI and analytics</li><li>Advanced knowledge of structured data, such as entities, classes, hierarchies, relationships and metadata</li><li>Knowledge of database management system (DBMS) including tables, joins and SQL querying</li><li>Ability to combine data from multiple sources when needed for analysis</li><li>Familiarity with and ability to document the use cases, business purposes and quality of the data</li><li>Advanced understanding of data quality concepts, best practices and tools, with strong experience with data analysis techniques</li><li>Communication and conflict resolution skills to help reconcile the different points of view and requirements that clash during cross-team and cross-organization efforts</li>\n</ul>"}