{"job title": "Engineering Data Analyst", "company": "Raytheon", "city state": "– Andover, Massachusetts", "rating": "3.7", "job description": "<strong>Quality:</strong>\n<br><br>\nThe Raytheon IDS Mission Assurance Quality and R6s organization assures that functional products are delivered to the program areas using quality and effectiveness throughout the product life cycle. Our goal is to establish, oversee and coordinate quality policy and practices ensuring alignment to the business and enabling Mission Assurance.\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nThe individual will be responsible for analyzing and publishing supplier quality performance metrics / data. This will include analyzing data and identifying trends, such as defect and supplier performance data, to identify key drivers and implement continuous improvements. This may also include development of tools which aid in day to day data processing for the Supplier Quality team. The individual will also be responsible for using supplier performance data to manage and make decisions impacting the supplier base, to include management of the Supplier Performance Management Improvement Program, Supplier Conferences and Supplier Awards.\n<br><br>\nThis position can be a Salary Grade G08 or Salary Grade G09 based on the candidate's qualifications as they relate to the skills, experience and responsibility requirements for the position.\n<br><br>\n<strong>Basic Qualifications:</strong> \n\n<ul>\n<li>Minimum 2 years of experience in a technical discipline (such as engineering, quality or operations).</li> <li>Working knowledge of statistical mathematics and statistical process control tools</li> <li>Strong / Advanced Microsoft Excel skills</li> <li>Experience working with quality systems, ISO/AS 9100, quality concepts, management and / or planning tools.</li> <li>Competent user of Microsoft PowerPoint and Word</li>\n</ul>\n\n<strong>Desired Qualifications:</strong>\n\n<ul>\n<li>Experience developing and analyzing metrics / trends, using the information to drive improvements, and predicting future business/program performance.</li> <li>Experience in continuous improvement processes such as Six Sigma and / or Lean Methodologies.</li> <li>High energy, selfstarting team player who achieves goals and continuous improvement.</li> <li>Working knowledge of database systems and data analysis tools.</li> <li>Competence in Access, MiniTab, SQL and / or VBA.</li> <li>Understanding and experience with supply chain and procurement processes.</li> <li>Strong Planning, Facilitating and Team-coordination skills.</li> <li>Excellent coordination, written &amp; verbal communication and presentation skills.</li> <li>SAP (PRISM) product knowledge and experience.</li> <li>Understanding of business processes, metrics and the relationship between them.</li> <li>Technical background in software development and/or infrastructure design and deployment, with particular focus on defining requirements.</li> <li>Track record of delivering results.</li> <li>Ability to lead / get things accomplished by influence.</li> <li>General knowledge of aerospace / defense products and systems technologies, regulations and standards.</li> <li>Experience generating, reviewing, and / or implementing policies and procedures.</li> <li>Six Sigma (GB or BB preferred), Lean and / or American Society for Quality (ASQ) Certification (CQE, CQM/OE, CSQE, CQA, CRE, etc.).</li> <li>Understanding of Supplier Quality tools: Supplier Rating System (SRS), Enterprise Supplier Risk Tool (ESRT), Supplier Corrective Action Request (SCAR), Supplier Health &amp; Assessment Reporting Portal (SHARP), Raytheon Enterprise Supplier Assessment (RESA).</li> <li>Experience with language other than English or experience with a culture other than US.</li> <li>Ability to obtain a DoD Security Clearance.</li> \n</ul>\n\n<strong>Required Education:</strong>\n\n<ul>\n<li>BS Engineering, Science, Math or relevant major.</li>\n</ul>\n\nWork Location: Andover, MA\n\n\n<ul>\n<li><strong><u>This position requires either a U.S. Person or a Non-U.S. Person who is eligible to obtain any required Export Authorization.</u></strong></li>\n</ul>\n\n119133BR 119133<br><br>Raytheon is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, sex, sexual orientation, gender identity, national origin, disability, or protected Veteran status."}