{"job title": "People Data Analyst", "company": "Travelport", "city state": "– ATLANTA", "rating": "3.1", "job description": "<br><b>Title</b><br>People Data Analyst<br><br><b></b><br>11-Sep-2018<br><br><b>Job Description</b><br><strong>Purpose Statement: </strong><br>The People Data Analyst will support the Head of HR Data &amp; Analytics in developing and managing a global HR performance reporting service and tools, supporting with the detailed statistical analysis of our people data to identify actionable insights, and ultimately building predictive models. The insight from this analysis will be used to drive targeted people investment and talent management decisions, and assess overall effectiveness of our people agenda. The position will help shape data management architecture, create and statistically analyze large data sets. This role will support introducing data management and insight solutions that eliminate rework, standardize practice, define and automate sound process and produce representative talent insight associated with Travelport People Strategy.<br> <br><br><strong>Main Accountabilities: </strong><ul><li>Deliver reporting solutions and provide expertise to identify and support HR with reporting and data needs. Proactively initiate and prioritize reporting tool enhancements and prepare reporting solution specifications.</li><li>Partner with COEs to help them build metrics and reporting disciplines to highlight trends, business insights, impact assessment of people interventions and support decision making..</li><li>Build partnerships with HRTS and other internal tech systems Development teams and vendors to deliver tools and system solutions.</li><li>Support the design and implementation of self-service reporting tools and data management that reflects the needs and the complexity of our global business.</li><li>Support with the design and maintenance of HR analytics capability.</li><li>Support with the interpretation of our people data in order to identify significant anomalies,, relationships, and trends in data. Report results of statistical analyses in the form of graphs, charts, and tables that are self-explanatory and appropriate for senior leadership audience.</li><li>Develop predictive models for talent attraction, retention, management, and development needs to optimize our ability to attract, retain and develop the right capabilities for the business..</li><li>Manipulate and analyze large datasets using analytic features of multiple tools.</li><li>Identify statistical analysis techniques required to deliver insights.</li><li>Advance the use of complex analytical techniques and statistical thinking across Human Resources.</li><li>Serve as an active participant on cross-functional project teams and provide guidance and training to teams in asking appropriate questions, interpreting data, and translating into action.</li><li>Develop an in-depth understanding of enterprise current state in order to identify solutions to both strengthen the foundation of the enterprise and support the cultural direction and talent management of the company.</li><li>Consult with direct and indirect stakeholders to design and implement flexible solutions that stay relevant and of value to the organization.</li><li>Support knowledge transfer to build a baseline of data analytics capability across the Function and actively build knowledge and capability of latest thinking and solutions to continue to drive for continually enhance the service offering to the business.</li></ul> <br><strong>Knowledge, Skills, Experience, Training, Education:</strong><ul><li>Ability to communicate complex data to non-experts in both a written and verbal manner.</li><li>Critical thinking skills in interpreting complex data sets, and being able to make educated assumptions when data may be unavailable.</li><li>Strong data analytics capability with the ability to present complex data in easy to analyze format to support the ability to draw insights and trends.</li><li>Intellectual curiosity and ability to handle high levels of ambiguity.</li><li>Ability to work under pressure and within tight deadlines.</li><li>Detail oriented with a focus on quality results/deliverables</li><li>Outstanding client and stakeholder management skills </li><li>Ability to work collaboratively with others</li><li>Advanced Excel and other data systems capability</li><li>5-7 years HRIS systems experience.</li><li>Oracle system experience needed.</li></ul><br><br><b>Auto req ID</b><br>5968BR<br><br><b>Employee type</b><br>Employee<br><br><b>Employment type</b><br>Regular - Full Time <br><br><b>Office location</b><br>US - ATLANTA - HQ <br><br><b>Functional Area</b><br>HR<br>"}