{"job title": "Applied Scientist, SSPA", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "Amazon Sponsored Ads is one of the fastest growing business domains and we are looking for talented scientists to join this team of incredible scientists to contribute to this growth. We are still in Day 1 and there is an abundance of opportunities that are yet to be explored. We are a team of highly motivated and collaborative team of machine learning scientists, with an entrepreneurial spirit and bias for action. We have a broad mandate to experiment and innovate, and we are growing at an unprecedented rate with a seemingly endless range of new opportunities.\n<br><br>\nThe Targeting team works across the entire spectrum of ad serving including CTR prediction, dynamic pricing, ranking, ad relevance, ad quality, query understanding, recommendation systems, and much more. Our technology enables thousands of brands, sellers and authors to drive discovery and sales of their products at Amazon by millions of customers. This role specifically sits within the broader machine learning team within Ads with the primary focus on determining the relevancy of specific ads in the context of the user query.\n<br><br>\nWe are looking for Applied Scientists to explore the rich meta data source of Amazon to improve our Advertiser Controls and Recommendations. You will be expected to demonstrate strong ownership, and should be curious to learn and leverage the rich textual, image, and query level data to optimize for ad relevancy.\n<br><br>\nThis role will challenge you to utilize cutting edge machine learning techniques in the domain of natural language processing (NLP), deep learning, and image recognition to deliver significant impact for the business. Ideal candidates will be able to work cross functionally across multiple stakeholders, synthesize the science needs of our business partners, develop models to solve business needs, and implement their solutions in production. Hence, we would expect them to be independent, have a natural bias to action, strong communicator, and be agile to make continuous incremental progress on a project without losing focus of the end goal.\n<br><br>\nPrimary responsibilities\n<br>\n· Use machine learning and analytical techniques to create scalable solutions for business problems\n<br>\n· Analyze and extract relevant information from large amounts of Amazon's historical business data (e.g. product catalog, browsing history, images, search queries) to perform feature engineering\n<br>\n· Design, development and evaluation of NLP, deep learning, and generalized ML models\n<br>\n· Work closely with software engineering teams to drive real-time model implementations and new feature creations\n<br>\n· Work closely with business stakeholders to identify opportunities of current model improvements and new models to significantly benefit the business bottom-line.\n<br>\n· Collaborate with scientists within the Ads organization as well as other parts of Amazon business to share and imbibe learnings that benefit our models.\n<br>\n· Establish scalable, efficient, automated processes for large scale data analyses, model development, model validation and model implementation\n<br>\n· Research and implement novel machine learning and statistical approaches."}