{"job title": "Applied Scientist - Advertising Technology", "company": "Amazon", "city state": "– US, CA, Palo Alto", "rating": "3.8", "job description": "Amazons Advertising technology teams build the technology infrastructure and ad serving systems to manage billions of advertising queries every day. The result is better quality advertising for publishers and more relevant ads for customers. Our infrastructure supports millions of Internet users and handles billions of queries per day, all delivered in milliseconds. Our data platform processes massive data sets to develop business intelligence and analytics that are critical for the efficiency and profitability of our advertising business.\n<br><br>\nThe Experimentation and Supply Optimization team is responsible for optimizing Amazons programmatic ad serving platform by applying advanced Machine Learning and predictive analytics solutions that yield superior performance for our advertisers. We are seeking an Applied Scientist with a deep curiosity about the advertising domain and passion to tackle complex problems that impact our ad serving platform.\n<br><br>\n<strong>In this role, you will:</strong>\n<br>\n· Conduct hands-on data analysis, build large-scale machine-learning models and data pipelines and quickly iterate from idea to production code within days\n<br>\n· Lead data-driven investigations into key business and operational questions related to computational advertising and communicate your results to various business and technical leaders\n<br>\n· Conduct applied research in the area of computational advertising\n<br>\n· Be a member of the Amazon-wide Machine Learning Community, participate in internal and external events and help recruit top technical talent\n<br>\n· Work on a platform that spans Hadoop, Map/Reduce, Pig, Redshift, and S3 using programming languages such as Java, C++ and Python\n<br>\n· Be an early adopter of emerging AWS big data technologies for AdTech use cases.\n<br><br>\nJoining this team, youll experience the benefits of working in a fast-growing, fast-paced environment, while leveraging the resources of Amazon.com (AMZN), one of the world's leading Internet companies. We provide a highly customer-centric, team-oriented environment in our offices located in Palo Alto, California.\n<br>"}