{"job title": "Research Scientist - Pricing and Advertising", "company": "Amazon", "city state": "– US, WA, Seattle", "rating": "3.8", "job description": "Ever wonder what it's like to put the power of data and machine learning to work managing a global economy through dynamic pricing, promotions, and advertising?\n<br><br>\nThe Amazon Appstore team is looking for a Research Scientist to help us build machine learning applications for our pricing and advertising systems and drive the direction of our fast-moving products based on data science. Responsibilities include:\n<br>\n· Predict future customer behavior and business conditions (Machine Learning, Predictive Modeling)\n<br>\n· Utilize Deep Learning and NLP techniques to understand our apps and customers and personalize our interactions\n<br>\n· Algorithmically drive our business actions to optimize performance under real world constraints (Optimization, Exploration/Exploitation, Bandit Algorithms)\n<br>\n· Understand the impact our pricing and promotional campaigns have on our customers and business (Experiment Design, Hypothesis Testing, Causal Inference)\n<br>\n· Shape our products and activities to improve the customer experience and business impact\n<br>\n· Investigate and design data driven solutions for challenging business problems\n<br><br>\nYou must also be able to manage timelines, work within our agile software development process, and coordinate your work with other team members. Your work must be accurate, timely, and insightful. You must be a self-starter and be able to learn on the go. You must be analytical and creative, and you must never, ever give up.\n<br><br>\nAre you holding out for an opportunity to:\n<br>\n· Have the ability to use your unique skills to make a huge impact?\n<br>\n· Shape the direction of products that touch millions of people?\n<br>\n· Work with an amazing team of scientists, engineers, and product managers?\n<br>\n· Play an important role in one of the most innovative companies in the world?\n<br>\n· Have a great time doing it?\n<br>\nThen join us!\n<br><br>\nAbout Us\n<br>\nWith over 800,000 apps and games, the Amazon Appstore offers an ever increasing selection to its customers on Amazon Fire Tablets, Fire TV and the entire family of Android devices. Amazon Coins is a virtual currency for the Amazon Appstore that empowers customers by enabling them to save tons of money on apps and in-app purchases. Combining coins rewards with customer outreach and targeted advertising, we have powerful set of tools to drive our business and delight our customers. Determining when and how to set those discounts and rewards is where the art of data science takes over. We have an economy to tune."}