{"job title": "Applied Scientist, Prime Video", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "Prime Video is an industry leading, high-growth business and a critical driver of Amazon Prime subscriptions, which contribute to customer loyalty and lifetime value. Prime Video is used daily by a massive audience on Amazon's websites and through a variety of devices including the Kindle Fire, game consoles, smart TVs and Blu-ray players. Prime Video is a digital video streaming and download service that offers Amazon customers the ability to rent, purchase or subscribe to a huge catalog of videos. Movies range from new releases to classic favorites, and Prime Video offers major television episodes, entire seasons, or even day after air TV.\n<br><br>\nThe Prime Video Content Analytics team uses machine learning, econometrics, and data science to optimize Amazons streaming-video catalogue, driving customer engagement and Prime member acquisition. We generate insights to guide Amazons digital-video strategy, and we provide direct support to the content-acquisition process. We use detailed customer behavioral data (e.g. streaming history) and detailed information about content (e.g. IMDb-sourced characteristics) to predict and understand what customers like to watch.\n<br><br>\nWe are looking for applied scientists to build innovative systems for classifying content and predicting customers response to individual titles. For example, we need to predict the performance of first-run TV shows (never before seen) based on incomplete information (e.g. genre, creator, actors). Key responsibilities of Prime Video Applied Scientists include the following:\n<br>\n· Optimizing the digital video catalog to improve customer experience and grow the Amazon business.\n<br>\n· Improving model usability by analyzing customer behavior and by gathering requirements from business owners and other tech teams. Incorporating new data sources and implementing creative methodology innovations to improve model performance.\n<br>\n· Creating and tracking accuracy and performance metrics\n<br>\n· Helping build production systems that take inputs from multiple models and support decision making.\n<br>\n· Mentoring junior members to improve their understanding and application of ML techniques\n<br><br>"}