{"job title": "Scientist - Structural Biology", "company": "Amgen", "city state": "– US - Massachusetts - Cambridge", "rating": "3.7", "job description": "<strong>Career Category</strong>Research<strong>Job Description</strong><br><br>Amgen is a leading global biotechnology company, with a mission to serve patients around the world. As a science-based, patient-focused organization, we discover and develop innovative therapies to treat serious illnesses. Our medicines have made a dramatic difference in the lives of millions. To underpin our commitment to serve patients, Amgen is significantly expanding our Research and Development facility in Cambridge MA (AMA).\n<br><br>\nWe are looking for a highly motivated and creative structural biologist to join the interdisciplinary AMA Structural Biology group. This laboratory provides comprehensive molecular insight and structure-based design for drug target assessment, mechanism of action, protein-protein and protein-ligand interactions, as well as protein engineering to facilitate drug discovery across all therapeutic areas at Amgen.\n<br><br>\nThe successful candidate will have the opportunity to contribute directly to the exciting drug discovery process through structural studies on a wide variety of important biological systems, including human integral membrane proteins.\n<br><br>\nThe candidate will be responsible for leading projects through the entire protein crystallographic and cryo-EM processes, including protein chemistry. The candidate will be working closely with molecular biologists and protein biochemists in the protein technology team. The candidate will also interact directly with both small molecule and large molecule project teams, including computational scientists, medicinal chemists, and protein engineers.\n<br><br>\n<strong>Basic Qualifications:</strong>\n<br><br>\nDoctorate degree\n<br><br>\nOR\n<br><br>\nMaster’s degree and 4 years of scientific experience\n<br><br>\nOR\n<br><br>\nBachelor’s degree and 6 years of scientific experience\n<br><br>\n<strong>Preferred Qualifications</strong>\n<br><br>\nPhD in protein biochemistry, crystallography, or related discipline with significant postdoctoral research experience\n<br><br>\nKnowledge of state-of-the-art protein structural biology techniques including all aspects of construct design, expression, purification, characterization, crystallization, structure determination and analysis\n<br><br>\nExperience with single particle cryo-EM process (including sample/grid preparation and screening, data collection and processing, three-dimensional reconstruction and model building)\n<br><br>\nExcellent presentation skills (written and oral) that enhance team-based progress\n<br><br>\nAbility to work independently and effectively within timelines and to collaborate in a multidisciplinary environment\n<br><br>\nAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.\n<br><br>\nAmgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people’s lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world’s leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.<br><br><strong>Join Us</strong><br><br><strong>If you're seeking a career where you can truly make a difference in the lives of others, a career where you can work at the absolute forefront of biotechnology with the top minds in the field, you'll find it at Amgen.</strong>\n<br><br>\n<strong>Amgen, a biotechnology pioneer, discovers, develops and delivers innovative human therapeutics. Our medicines have helped millions of patients in the fight against cancer, kidney disease, rheumatoid arthritis and other serious illnesses.</strong>\n<br><br>\n<strong>As an organization dedicated to improving the quality of life for people around the world, Amgen fosters an inclusive environment of diverse, ethical, committed and highly accomplished people who respect each other but compete intensely to win. Together, we live the Amgen values as we continue advancing science to serve patients.</strong><br><br>Amgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status..\n<br><br>\nApply"}