{"job title": "Scientist, Translational Immunology", "company": "Amgen Inc", "city state": "– South San Francisco, California", "rating": "3.7", "job description": "Amgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.\n<br><br>\nAmgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve peoples lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the worlds leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.\n<br><br>\nThe Translational Immunology laboratory within the Comparative Biology and Safety Sciences organization at Amgen is seeking a highly motivated Scientist to independently investigate the mechanisms of immune related safety events in preclinical species and humans.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nMake major scientific laboratory-based contributions to the goals of the immunotoxicology group\n<br><br>\nDevelop predictive safety assays\n<br><br>\nInteract with colleagues at multiple research sites to develop novel and creative experimental solutions that enable efficient and innovative drug development practices\n<br><br>\nDesign, conduct and communicate experiments that provide solutions for immune related safety issues\n<br><br>\nInterface with project teams and represent the immunotoxicology group internally and externally through contributions to projects, presentations, collaborations and publications\n<br><br>\nSurvey the literature and conferences and stay up to date with novel technologies. Assess and apply them into experimental opportunities.\n<br><br>\nCollaborate with scientists from oncology, inflammation, neuroscience and cardiometabolic disorders to advance Amgens innovative pipeline\n<br><br>\nWork closely with toxicologists and interdisciplinary scientists from areas such as biologics, bioinformatics, proteomics, genome analysis unit,\n<br><br>\nMentor Research Associates and aid their scientific and career development\n<br><br>\nBasic Qualifications:\n<br><br>\nDoctorate degree\n<br><br>\nOR\n<br><br>\nMasters degree and 4 years of scientific experience\n<br><br>\nOR\n<br><br>\nBachelors degree and 6 years of scientific experience\n<br><br>\nPreferred Qualifications:\n<br><br>\nPhD in immunology, molecular or cell biology or a closely-related life sciences discipline.\n<br><br>\n3+ years of research experience in the area of cellular and/or molecular immunology\n<br><br>\nDemonstrated track record of independent critical thinking and scientific achievement in the area of immunology\n<br><br>\nExcellent verbal and written communication and presentation skills\n<br><br>\nAbility to balance moving projects forward in the face of continuously evolving priorities and timelines while creating an environment of scientific curiosity promoting the exchange of ideas\n<br><br>\nExpertise in the following areas:\n<br><br>\nEstablishing complex cell-based assays from cell lines and or primary cells. Cell culture, maintenance of cell lines\n<br><br>\nMagnetic and other cell isolation and enrichment techniques of primary cells, sample preparation for downstream cellular and or molecular analyses\n<br><br>\nExperience with peripheral blood mononuclear cells, whole blood and other tissues from various species\n<br><br>\nMulticolor flow cytometry and or CyTOF\n<br><br>\nVarious soluble immunoassays (ELISA, MSD, Luminex and others).\n<br><br>\nIntegrated understanding of complex datasets and ability to synthetize data; plan and execute next steps based on experimental results<br><br>Amgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n<br><br>\nAmgen will consider for employment qualified applicants with criminal histories in a manner consistent with the San Francisco Fair Chance Ordinance."}