{"job title": "Data Strategist", "company": "Ascensia Diabetes Care", "city state": "– Valhalla, NY", "rating": "3.0", "job description": "Data Strategist (RD0056)<br> <br><br> <br><br> <br>Ascensia Diabetes Care<br> <br><br> <br><br> <br><br> <br><br> <br><br> <br><br> <br><br> <br><br> <br><br> <br>20 reviews<br> <br><br> <br><br> <br><br> <br>-<br> <br><br> <br>Valhalla, NY<br> <br><br> <br><br> <br><br> <br><br> <br><br> <br><br> <br><br> <br><br> <br><br> <br><br> <br>Ascensia Diabetes Care<br> <br><br> <br><br> <br><br> <br><br> <br><br> <br><br> <br><br> <br><br> <br>20 reviews<br> <br><br> <br><br> <br>Read what people are saying about working here.<br> <br><br> <br><br> <br><br> <br><br> <br><br> <br><br> <br><br> <br><br> <br><br> <br><br> <br>Ascensia Diabetes Care is a global specialist diabetes care company, dedicated to helping people living with diabetes. Our mission is to empower people living with diabetes through innovative solutions that simplify and improve their lives. We use our innovation and specialist expertise in diabetes to develop high quality solutions and tools that make a positive, daily difference for people with diabetes.<br> <br><br> <br>POSITION PURPOSE:The Data Strategist?s job is to lead the development of comprehensive data strategies across multiple products and collaborate with multiple stakeholders. Successful candidates will have extensive experience in data science and data management, with a proven track record of success from planning to delivery of platforms and solutions. The right candidate will be able to architect and analyze multiple sources of data to surface patient behaviors and needs to be able to work closely with data scientists and AI architect to ensure proper analysis and appropriate algorithm development.<br> <br><br> <br>MAJOR TASKS AND RESPONSIBILITIES OF POSITION:<br> <br><br> <br><br> <br>+ Responsible for establishing a data roadmap and data management processes.<br> <br><br> <br>+ Lead the development and execution of data strategy for mobile application product(s) from beginning to end, including the gathering and execution of requirements.<br> <br><br> <br>+ Evaluates business requirements and works closely with stakeholders to identify key business needs and translate that into a clear data strategy solution.<br> <br><br> <br>+ Continuously strive to improve the effectiveness of data management strategy by identifying new opportunities for data and analytics to advance business needs as well as identifying and convey data quality and gaps.<br> <br><br> <br>+ Summarize and convey data findings to both a technical and non-technical audience<br> <br><br> <br><br> <br>QUALIFICATIONS:<br> <br><br> <br><br> <br>+ Experience in a fast-paced software development environment, and an ability to execute against aggressive timelines<br> <br><br> <br>+ Proven ability to influence cross-functional teams without formal authority<br> <br><br> <br>+ Experience working with Development teams to ensure meaningful data collection.<br> <br><br> <br>+ Hands on experience with Analytics tagging principles and analytics tools.<br> <br><br> <br>+ Strong database development skills including a solid understanding of database technologies, as well as logical and physical data modeling<br> <br><br> <br>+ Experience with statistical programming languages and a database querying language like SQL.<br> <br><br> <br>+ Experience with machine learning methods like k-nearest neighbors, random forests, ensemble methods and more.<br> <br><br> <br>+ Data-driven problem-solver<br> <br><br> <br>+ Degree in Computer Science, Engineering, Statistics, Technical Science or 4+ years of IT/Programming experience<br> <br><br> <br>+ Proven leadership and communication (verbal and written) skills<br> <br><br> <br>+ MS: 6 years of experience<br> <br><br> <br>+ BS: 8 years of experience<br> <br><br> <br>+ Health care industry experience is a plus<br> <br><br> <br>+ Experience with development in regulated environment is a plus<br> <br><br> <br>+ Experience with medical devices or software is a plus<br> <br><br> <br><br> <br>YOUR APPLICATION:Ascensia offers a wide variety of competitive compensation and benefits programs. If you meet the requirements of this unique opportunity, and are driven by innovation and the desire to improve the lives of our patients, we encourage you to apply now. Job postings will remain open for a minimum of five business days and are subject to immediate closure thereafter without additional notice.<br> <br><br> <br>TO ALL RECRUITMENT AGENCIES:Ascensia does not accept unsolicited third party resumes.<br> <br><br> <br>Ascensia is an Equal Opportunity Employer.<br> <br><br> <br>IND123<br> <br><br> <br>Job Type: Full-time"}