{"job title": "Bioinformatics Scientist", "company": "Biocept, Inc.", "city state": "– San Diego, CA", "rating": "3.1", "job description": "Bioinformatics Scientist\n<br><br>\nBiocept, Inc.\n\n\n<ul>\n<li>San Diego, CA 92121</li>\n</ul>\n\nContract\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nTasks and Responsibilities\n\n\n<ul>\n<li>Develop and maintain analysis pipelines for next generation sequencing data in research and diagnostic environments</li>\n<li>Deep dive analysis of specific sequencing datasets to assess data/experiment quality</li>\n<li>Develop analysis algorithms for use in creating diagnostic quality data including cutoffs, sensitivity and specificity limits.</li>\n<li>Monitor data integrity and quality and alert team members when inconsistencies arise</li>\n<li>Trouble shooting and problem solving code, NGS experiments, and run failure patterns</li>\n<li>Use data mining tools to develop root cause hypotheses and analysis tools to perform follow-up tests</li>\n<li>Maintain software coding standards while growing adoption of shared libraries and scripts across the organization</li>\n<li>Solve complex technology and development challenges</li>\n</ul>\n\nRequired Skills&amp;Experience\n\n\n<ul>\n<li>MS/PhD in bioinformatics, mathematics, computer science, biology, chemistry, or similar, with 3-5 years experience in an industrial environment.</li>\n<li>Strong programming (Python, C++, or Java) or scripting (Perl, R, or Bash) ability, specifically in the analysis of NGS data</li>\n<li>Strong familiarity with existing pipelines/algorithms for alignment (BWA, Bowtie, etc.) and variant calling (GATK, VarScan, FreeBayes, etc.).</li>\n<li>Experience building/validating pipelines in a clinical diagnostics environment.</li>\n<li>Previous experience next generation data interpretation, preferably within the context of diagnostics development environment.</li>\n<li>Experience with current bioinformatics tools supporting NGS applications (RNASeq, CHiPSeq, genome re-sequencing, and de novo genome assembly).</li>\n<li>Previous experience with managed code and source control concepts.</li>\n<li>Results oriented and methodical</li>\n<li>Must be able to design experiments and perform data analysis for others and have demonstrated experience in achieving results with team members in non-biological disciplines</li>\n<li>Ability to work collaboratively with people across multiple functional areas.</li>\n</ul>\n\nJob Type: Contract\n<br><br>\nJob Type: Contract\n<br><br>\n<strong>Experience:</strong>\n\n\n<ul>\n<li>Bioinformatics: 5 years (Required)</li>\n</ul>\n\n<strong>Education:</strong>\n\n\n<ul>\n<li>Master's (Preferred)</li>\n</ul>\n\n<strong>Location:</strong>\n\n\n<ul>\n<li>San Diego, CA (Required)</li>\n</ul>\n\n<strong>Work authorization:</strong>\n\n\n<ul>\n<li>United States (Required)</li>\n</ul>\n\n10 days ago - save job - report job"}