{"job title": "Associate Director, HEOR Scientist", "company": "Bristol Myers Squibb", "city state": "– Princeton, NJ", "rating": "3.7", "job description": "<ul>\n<li>*Summary**</li>\n</ul>\n\nMakes strategic recommendations that get incorporated into a brand access strategy\n<br><br>\nDevelops the US Health Economics and Outcomes Research (HEOR) data generation plan that is aligned with brand and access strategies for demonstrating the value of BMS products to healthcare customers\n<br><br>\nProposes and defends the rationale for funding an HEOR book of work\n<br><br>\nEffectively leads scientifically rigorous HEOR studies and manages projects from concept through full execution, including reporting the evidence at scientific congresses, in peer reviewed publications, and proactive/reactive BMS communication tools\n<br><br>\nEstablishes strong cross-functional relationships with internal BMS stakeholders\n<br><br>\nIs viewed as an internal HEOR expert who is fully integrated into the BMS matrix team and provides critical input into the development of effective communication tools and programs for optimal market access\n<br><br>\nDemonstrates the ability to make decisions on selecting external organizations and researchers with appropriate expertise for research collaborations\n<br><br>\nStrives to demonstrate BMS behaviors of Passion, Speed, Innovation, and Accountability\n\n\n<ul>\n<li>*Qualifications and Skills**</li>\n</ul>\n\nAdvanced degree in health sciences (e.g. PhD, MS, MPH, PharmD).\n<br><br>\nFive plus years of previous experience working in outcomes research, health economics or epidemiology in the pharmaceutical industry\n<br><br>\nAbility to lead a cross-functional team and influence without formal authority\n<br><br>\nAbility to understand, interpret, and make recommendations concerning the evolving US market\n<br><br>\nStrong communication and interpersonal skills\n<br><br>\nPrevious experience executing research and managing projects independently\n<br><br>\nPrevious experience in publishing scientific data with strong publication track record\n<br><br>\nIn depth understanding of healthcare economics, epidemiology, quality of life and clinical research\n<br><br>\nStrong understanding of US payer and market access challenges\n<br><br>\nStrong knowledge of pharmaceutical development and product promotion\n<br><br>\nBristol-Myers Squibb is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status."}