{"job title": "Associate Scientist, NGS (33)", "company": "Bristol Myers Squibb", "city state": "– Redwood City, CA", "rating": "3.7", "job description": "We are looking for an experienced scientist to participate in the NGS operations within the antibody lead generation group. NGS is an integral part of ongoing effort to streamline the lead discovery effort within the department. This scientist is expected to contribute in every aspect of the NGS operation especially high throughput sample preparation and data processing.\n<br><br>\n<strong>Major responsibilities:</strong>\n<br><br>\n? Use molecular biology approach such as RT-PCR to recover transcripts of interest, in high throughput environment from immunized animals.\n<br><br>\n? Follow current NGS protocols to modify and prepare cDNA samples for NGS.\n<br><br>\n? Make improvement and adjustment to current NGS reagents and protocols to expand the scope of application\n<br><br>\n? Operate NGS machine and process NGS data.\n<br><br>\n? Excellent written and oral skills are necessary.\n<br><br>\n? Accomplish goals under project team time lines.\n<br><br>\n<strong>Qualifications:</strong>\n<br><br>\n? PhD with 2+ years, MS with 5+ years, and BS with 10+ years of relavant research or industry experience. The degree should be in molecular biology or related field.\n<br><br>\n? Demonstrated experience in molecular biology techniques especially RT-PCR and PCR is required.\n<br><br>\n? Ability to handle large number of delicate samples simultaneously is required. Past experience with automation is desirable.\n<br><br>\n? A good understanding of the principle of NGS (Illumina) is required, and past experience working with NGS is highly desirable.\n<br><br>\n? Good work ethics and being self-motivated are essential.\n<br><br>\n? Excellent communication and time management skills are required\n<br><br>\nBristol-Myers Squibb is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status."}