{"job title": "MEDICAL LAB SCIENTIST, ADVANCED", "company": "Duke University Health System", "city state": "– Durham, North Carolina", "rating": "3.9", "job description": "Job Description\n<br><br>\n<strong> Occ Summary</strong> \n<br>\nCoordinate and participate in a variety of complex technical tasks in the performance of laboratory tests to obtain data for use in the diagnosis and treatment of disease.\n<br><br>\n<strong> Work Performed</strong> \n<br>\nMay perform any or all of the following duties:\n<li> Coordinate and participate in the performance and interpretation of complex technical duties in support of medical laboratory testing; record determinations and results for review by laboratory management and physician/caregiver staff.</li> <li> Participate in specimen collection when required according to test requested, either directly by venipuncture or skin puncture; maintain responsibility for patient identification, specimen labeling and collection verification, or instructing patients or other healthcare providers in collection and preservation techniques for urine, sputum, stool, scrapings, autologous/directed donations, or other specimens for analysis.</li> <li> Set up, evaluate and operate current and new equipment, instruments and apparatus required for specific laboratory tests and assume adequate responsibility to maintain operations including preventive maintenance.</li> <li> Coordinate the preparation and quality assurance of culture media, chemicals, reagents, stains and solutions as appropriate.</li> <li> Evaluate collected laboratory data and prepare reports assessing accuracy, completeness, timeliness, progress, adverse trends and appropriate recommendations or conclusions.</li> <li> Participate in the development of new medical laboratory procedures and techniques</li> <li> Provide technical guidance and instruction to students, interns, residents, staff and other employees</li> <li> Participate in the development and implementation of clinical evaluations.</li> <li> Act as a person in charge (PIC) as well as a resource person/role model, as per guidelines determined by laboratory management.</li> <li> Monitor Quality Control, Quality Assurance, Safety and Infection Control practices to assure compliance with internal and external regulations.</li> <li> Maintain sufficient inventory of material supplies and equipment for performance of duties; clean and maintain standard laboratory equipment.</li> <li> Monitor workflow, assessment of staffing levels and reassignment as needed. Follow up to ensure work is completed.</li> <li> Utilize various laboratory and hospital information systems and software.</li> <li> Communicate in a professional and courteous manner with patients, family and other medical personnel as necessary to obtain information for laboratory records, explain procedures, clarify orders and communicate status.</li> <li> Interact courteously with doctors, nurses and health unit coordinators (HUC) and other healthcare providers when answering questions or providing other information about a patient's results.</li> <li> Participate in lab inspections and work with inspectors as needed.</li> <li> Provide advanced problem solving, troubleshooting, interpretation/consultation, verification of specimen quality and test results.</li> <li> Perform related duties incidental to the work described herein.</li>\n\n<strong> Knowledge, Skills and Abilities</strong> <li> Experience involving patient contact, customer service in a medical setting, strong communication skills # both verbal and written.</li> <li> Basic knowledge of medical terminology.</li> <li> Working knowledge of laboratory and hospital computer systems is helpful.</li> <li> Thorough knowledge of laboratory safety and infection control procedures and practices including standard precautions and hazardous chemical handling.</li> <li> Ability to demonstrate required dexterity, knowledge, and ability to complete assigned laboratory tasks and skills, attention to detail and compliance with all appropriate regulatory and safety requirements.</li> <li> Ability to maintain effective working relationships with other employees.</li> <li> Ability to perform independently in resolving lab problems.</li>\n\n<strong> Level Characteristics</strong> <li> Act as the PIC (person in charge aka General Supervisor in the absence of the Supervisor/Manager/Tech III) after attaining 1 yr of high complexity laboratory experience post scientific baccalaureate degree or 2 years high complexity experience post scientific associate degree.</li> <li> Provide daily supervision and/or oversight of the laboratory operation and personnel performing testing and reporting test results.</li> <li> Provide direct supervision of all high complexity testing.</li> <li> Monitor testing to ensure that acceptable levels of analytic performance are maintained.</li> <li> Responsibilities delegated from the director or technical supervisor include:</li> <li> Assure remedial action is taken and documented whenever tests systems deviate from established performance specifications</li> <li> Ensure that patient testing results are not reported until corrective action has been taken and the test system is functioning properly</li> (Medical Laboratory Scientist, Med Lab Scientist, Medical Technologist, MLS, MT, MLT, Lab Tech, Laboratory, Med Tech, Med Lab and Lab)"}