{"job title": "Medical Laboratory Scientist", "company": "Gundersen Health System", "city state": "– La Crosse", "rating": "3.9", "job description": "<div> <div>Medical Laboratory Scientist</div>\n</div> <div>\n<div> Department Core Laboratory-H<div><strong>Contact</strong> Heberlein, Melissa M.</div>\n </div> <div> Location Onalaska</div> <div> Schedule/Shift Days, PM, Rotate, Weekends</div> <div> FTE 0.5 FTE</div> <div> Benefit Eligible Yes</div> <div> Temporary Position No</div> </div><br>\n\n <div> Job Details</div> <div>This position will work rotating days and PM shifts and every third weekend.\n<br><br>\nThis position will primarily be working in the fertility clinic.\n<br><br>\nThe Medical Laboratory Scientist demonstrates competency with the full scope of laboratory procedures, chemical, microscopic, bacteriologic, molecular and transfusion medicine. Analyzes information, monitors quality performance and takes action to ensure the efficient delivery of accurate and timely laboratory test results and services. Understands the requirements and standards of regulating agencies and ensures compliance within the laboratory. Delegates and provides clinical laboratory expertise for Medical Technicians and support staff within the laboratory and provides technical expertise in a manner that promotes collaboration with internal and external customers. Actively seeks education opportunities to learn and stay current in information relevant to the section(s) and participates in initiatives to advance department strategic goals and key operating strategies for the organization. Collects blood from patients and performs EKG's following the prescribed procedures.</div><br>\n\n <div> Job Responsibilities</div> <div> <li> Responsible for achieving and maintaining competence in performing automated and non-automated laboratory testing as demonstrated by departmental skills rosters. Recognizes unexpected test results, troubleshoots to determine cause and takes corrective action to resolve technical, instrument, pre-analytical and post-analytical problems.</li>\n<li>Plans and prioritizes workload demands; works as a team to best ensure the laboratory delivers high quality laboratory test results in accurate and timely manner.</li>\n<li>Assists with processing and collection of specimens by clinically acceptable means including phlebotomy and capilalary draws, and point of care.</li>\n<li>Monitors Quality Control, Quality Assurance and variance reporting are within acceptable performance standards. Evaluates, compares and interprets ambiguous and changing data, distinguishes clinically significant shifts and trends and makes decisions on most appropriate corrective action to resolve technical, instrument, pre-analytical and post-analytical problems.</li>\n<li>Understands the flow of laboratory data and information via laboratory information system and electronic health records. Understands the systems and the needs of the external customers; plans appropriately, and provides guidance for others during times of failure to ensure laboratory data continues to be delivered in an accurate and timely manner.</li>\n<li>Participates as a member of a team to select, validate and implement new test methodologies/instrumentation. Gains technical expertise related to new technologies, often via independent study, and trains and educates others within the laboratory.</li>\n<li>Works with new employees/students to orient, train and assess skills. Provides explanation of theoretical background of testing. Writes/revises procedures for the section to ensure that they are current, accurate and meet the standards of accrediting agencies.</li>\n<li> Evaluates cost effectiveness for laboratory products from various vendors and suppliers.</li>\n<li> Performs other job related responsibilities as requested.</li></div><br>\n\n<div> Scope of the Job</div> <div> Age Specific Population Served Infant (less than 1 year)\n<br>\nGeriatric (65 years &amp; older)\n<br>\nPediatric (1 - 12 years)\n<br>\nAdolescent (13 - 17 years)\n<br>\nAdult (18 - 64 years)</div>\n<br>\n<div> OSHA Category Category I - All Employees in this job title have a reasonably anticipated risk of occupational exposure to blood and/or other potentially infectious materials.</div><br>\n\n<div> Position Qualifications</div> \n<br>\n<div><strong>Education and Experience:</strong></div><div> Required Associate degree in \n<br>\n Clinical Laboratory Science (CLS) a related field Medical Technology (MT/CLS)\n<br>\nwith previous experience. A copy of the applicant's/employee's diploma and/or transcript as confirmation of the education requirement must be provided at time of hire.</div> <div> Desired Bachelor's degree in \n<br>\n Medical Technology (MT/CLS) or Clinical Laboratory Science (MLT/CLT) or a related field</div><br>\n\n<div><strong>Work Experience:</strong></div><div> Required</div> <div> Desired 2 years prior experience in a clinical laboratory.</div> \n<br>\n<div><strong>Skills:</strong></div><div> Required Ability to...</div> <div> Computer Systems/Software/Applications operate computer</div> <div> Communication excellent oral and written communication skills</div> <div> Communication effectively communicate in technical and lay language</div> <div> General - All Positions provide excellent customer service to people both inside and outside the organization</div> <div> General - All Positions have professional attitude in regard to motivation, cooperation, flexibility, confidentiality, ethics and personal development</div> <div> General - All Positions work cooperatively with a wide variety of people</div> <div> Reasoning/Decision Making develop new skills and keep abreast of new knowledge</div> <div> Reasoning/Decision Making appreciate people whose values, goals, and cultures are different from your own</div> <div> Reasoning/Decision Making be professional, honest and have personal integrity</div> <div> Reasoning/Decision Making have positive attitude</div> <div> Desired Ability to...</div> <div> License and Certifications</div> <div> Required</div> <div> Desired Medical Laboratory Technician (MLT)\n<br>\nMedical Technologist (MT)</div><br>\n\n<div> Physical Requirements/Demands of the Position</div> <div> Sitting Occasionally (6-33% or 3 hours)</div> <div> Static Standing Occasionally (6-33% or 3 hours)</div> <div> Walking/Standing Frequently (34-66% or 5.5 hours)</div>\n<br>\n<div> Driving</div>\n<br>\n<div> Stooping/Bending Rarely (1-5% or .5 hours)</div>\n<br>\n<div> Squatting</div>\n<br>\n<div> Kneeling/Half Kneel</div>\n<br>\n<div> Climbing Stair</div>\n<br>\n<div> Climbing Ladder</div>\n<br>\n<div> Reaching - Shoulder Level Occasionally (6-33% or 3 hours)</div>\n<br>\n<div> Reaching - Below Shoulder Occasionally (6-33% or 3 hours)</div>\n<br>\n<div> Reaching - Above Shoulder</div>\n<br>\n<div> Repetitive Actions - Pinch Forces Rarely (1-5% or .5 hours) Pounds of force: 0-25</div> \n<br>\n<div><strong>Repetitive Actions - Grip Forces Pounds of force:</strong></div><div> Repetitive Actions - Fine Manipulation Frequently (34-66% or 5.5 hours)</div> <div> Balance - Right Leg</div> <div> Balance - Left Leg</div> <div> Lifting - Floor to Waist Rarely (1-5% or .5 hours) Number of lbs: 25-50</div> <div> Lifting - Waist to Overhead Rarely (1-5% or .5 hours) Number of lbs: 0-25</div> \n<br>\n<div><strong>Lifting - Other Number of lbs:</strong></div><div> Carrying - Long Carry (&gt;50 feet) Number of lbs:</div> <div> Carrying - Short Carry Rarely (1-5% or .5 hours) Number of lbs: 25-50</div> <div> Carrying - Right Carry Rarely (1-5% or .5 hours) Number of lbs: 0-25</div> <div> Carrying - Left Carry Rarely (1-5% or .5 hours) Number of lbs: 0-25</div> <div> Carrying - Push/Pull (Static Force) Rarely (1-5% or .5 hours) Number of lbs: 50-75</div> <div> Other:\n<br>\n<strong>Number of lbs:</strong></div><strong> \n<br>\n</strong><br>\n\n <div> Environmental Conditions</div> <div> Exposed to infectious diseases.\n<br>\nSubject to hazards.\n<br>\nSubject to inside environmental conditions.\n<br>\nRequired to wear a respirator.\n<br>\nSubject to atmospheric conditions.</div><br>\n\n<div> Medical Laboratory Scientist</div>\n<br>Equal Opportunity Employer"}