{"job title": "Post Doc Visiting Scientist-FDE", "company": "Lilly", "city state": "– Cambridge, MA", "rating": "3.8", "job description": "<ul>\n<li>*43944BR**</li>\n<li>*Responsibilities:**</li>\n</ul>\n\nIn 2015, Lilly opened a state of the art Innovation Center in Cambridge, Massachusetts to explore how next generation therapeutics, connected delivery solutions, and data analytics can improve patient health while reducing the clinical, psychosocial and economic burden that is systemic throughout healthcare today. Integration of Pharmaceutical Sciences and Delivery Device Innovation is a focal point of the site. Formulation scientists and device engineers collaborate to bring innovative and integrated solutions to drug product development and delivery challenges.\n<br><br>\nWe are seeking highly motivated professionals with a start-up mentality to join our new Innovation Center in Cambridge, Massachusetts, to explore, develop and prototype new and emerging formulation and drug delivery technologies. If you have an interest in exploring new frontiers in formulation and drug delivery and use interdisciplinary problem solving methods to create breakthrough solutions for patients, you should consider joining our diverse team.\n<br><br>\nThe primary responsibility for the scientist will be to conduct fundamental studies to understand protein interactions at high concentrations with novel excipients. You will be responsible for conducting studies to identify excipients that can mitigate issues with high viscosity and stability. You will explore other novel and innovative ways to reduce viscosity of high concentration biologics. Understanding of physical and chemical stability challenges in high concentration bioproduct formulations will be a critical area of focus.\n<br><br>\nThe responsibilities for this role will include:\n<br><br>\n+ Explore novel avenues to reduce viscosity of high concentration biologics\n<br><br>\n+ Explore interactions between excipients and proteins that can lead to reduction in viscosity and increase in stability\n<br><br>\n+ Identify and/or synthesize model excipients that can be designed to disrupt high viscosity and other challenges at high concentration\n<br><br>\n+ Based on knowledge gained, build model(s) that can predict viscosity of bioproducts using inputs such as molecule properties, surface charge and formulation variables.\n<br><br>\n+ Understand the reasons for physical and chemical stability challenges for bioproducts at high concentration\n<br><br>\n+ Keep abreast of relevant new technologies / capabilities and regulatory initiatives / requirements.\n<br><br>\n+ Authoring of technical reports, research grants, and journal publications.\n\n\n<ul>\n<li>*Req ID:**</li>\n</ul>\n\n<strong>43944BR</strong>\n\n\n<ul>\n<li>*Additional Skills/Preferences:**</li>\n</ul>\n\n+ Basic understanding of insulins, peptides, proteins, degradation pathways, and general approaches for stabilization\n<br><br>\n+ Able to independently contribute from the bench (design and execute studies to develop a formulation)\n<br><br>\n+ Experience/ knowledge of parenteral formulations development for preclinical, clinical and commercial use (including lyophilized and solutions formulations).\n<br><br>\n+ In depth understanding of protein chemistry, structure and conformation, as relates to chemical and physical stability of small and large molecules.\n<br><br>\n+ Demonstrated technical / scientific leadership skills; applied to problem-solving\n<br><br>\n+ Good oral and written communication skills\n<br><br>\n+ Must be able to work productively in an interdisciplinary team environment\n\n\n<ul>\n<li>*Additional Information:**</li>\n</ul>\n\nLilly credits its exceptional employees for its successes, and knows the key to ongoing achievement lies in attracting and retaining the best people. A company rich in heritage, Lilly employs individuals, conducts research and markets products worldwide. By providing for the unmet needs of our customers through a continuous stream of innovation, we will outgrow all competitors.\n<br><br>\nLilly earns consistent and wide recognition for creating an exceptional work environment:\n<br><br>\n+ Business Week magazine 50 Best Places To Launch A Career?\n<br><br>\n+ FORTUNE America?s Most Admired Companies?\n<br><br>\n+ FORTUNE 50 Best Companies for Minorities?\n<br><br>\n+ Working Mother 100 Best Companies for Working Mothers?\n<br><br>\n+ Industry Week magazine 100 Best-Managed Companies?\n<br><br>\n+ Business Ethics magazine 100 Best Corporate Citizens?\n<br><br>\n+ Science magazine Best Companies for Scientists?\n<br><br>\nThis position is not permanent. It is for a fixed duration of two years with potential to extend annually for up to 4 years.\n<br><br>\nLilly is an EEO/Affirmative Action Employer and does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status\n\n\n<ul>\n<li>*Title:**</li>\n</ul>\n\nPostdoctoral Scientist Formulations-FDE\n\n\n<ul>\n<li>*Job Category:**</li>\n</ul>\n\nScience\n\n\n<ul>\n<li>*Basic Qualifications:**</li>\n</ul>\n\n+ PhD in Pharmaceutical Chemistry, Physical chemistry, Pharmaceutical Sciences, Biophysics, Biomedical Engineering or Biochemistry\n<br><br>\n+ Experience/ knowledge of biophysical, physical and chemical characterization of proteins\n\n\n<ul>\n<li>*Company Overview:**</li>\n</ul>\n\nFor more than 140 years, Lilly has been dedicated to meeting the health care needs of people in the United States and around the world. We address these needs primarily by developing innovative medicines?investing a higher percentage of our sales in research and development than any other major pharmaceutical company.\n\n\n<ul>\n<li>*City:**</li>\n</ul>\n\nCambridge\n\n\n<ul>\n<li>*Country:**</li>\n</ul>\n\n<strong>USA</strong>\n\n\n<ul>\n<li>*State / Province:**</li>\n</ul>\n\nMassachusetts\n\n\n<ul>\n<li>*Region:**</li>\n</ul>\n\nNorth America"}