{"job title": "Associate Scientist- Flow Cytometry Specialist", "company": "Medix", "city state": "– Rockville, Maryland", "rating": "3.2", "job description": "TITLE AND CLASSIFICATION: Flow Cytometry Specialist, Exempt Position\n<br><br>\nREPORTING LOCATION: Rockville, MD\n<br><br>\nREPORTS TO: Lab Manager, Flow Cytometry (TOS)\n<br><br>\nOBJECTIVES: Performs specialized laboratory tasks in flow cytometry in support of preclinical and clinical studies. Maintains and collect data using various systems.\n<br><br>\nKNOWLEDGE, SKILLS, AND ABILITIES\n<br>\nHas expertise in multicolor flow cytometry analyses and panel design.\n<br>\nCan perform as least some of the following additional ex vivo analyses independently: PCR, histology, immunohistochemistry, ELISA, and culture of primary cells.\n<br>\nDemonstrated ability to work effectively and productively in a team-oriented environment while maintaining a strong sense of integrity and confidentiality.\n<br>\nCreative problem solving skills and the ability to exercise sound and accurate judgment in making timely decisions.\n<br>\nStrong planning, organizational, troubleshooting, computer, written and verbal communication skills.\n<br>\nDemonstrated accountability and responsibility for own work.\n<br>\nAbility to observe safety and security procedures.\n<br>\nAbility to assist with other tasks/duties as needed in a small company environment.\n<br><br>\nDUTIES AND RESPONSIBILITIES\n<br>\nPerforms as the technical lead with new platform development to expand TOS offerings in Flow Cytometry.\n<br>\nLeads analysis efforts including preclinical and clinical flow cytometry. Generates and analyses data associated with these platforms.\n<br>\nDesigns panels for cell phenotyping and validates new antibodies and gating methods.\n<br>\nActs as a technical point of contact for internal and external stakeholders around flow cytometric assays.\n<br>\nDevelops workflow protocols and SOPs for GCP compliance.\n<br>\nAssists Program and Project Leaders in tracking models and animals designated for preclinical research for TOS sponsor studies and R&amp;D.\n<br>\nMaintains sample inventories and logs for chain of custody tracking and reporting.\n<br>\nPerforms molecular biology techniques involved with processing of sample for flow cytometry including blood, spleen, bone marrow and tumor tissues.\n<br>\nCryopreserves blood and tissue samples for future viable staining and analysis.\n<br>\nProvides high quality, analyzed data to Project Leaders and/or clients.\n<br>\nAssists with other laboratory based duties and projects as assigned.\n<br><br>\nEDUCATION AND EXPERIENCE\n<br>\nMS degree or BS with 5+ years' experience in biology, immunology, pharmacology or related field.\n<br>\nMust have at least one year of multicolor flow cytometry experience.\n<br>\nExperience with FlowJo and BD FACSuite software is preferred.\n<br>\nPrefer minimum 5 years of basic laboratory and animal facility experience.\n<br><br>\nPHYSICAL DEMANDS AND WORK ENVIRONMENT\n<br>\nMust be able to sit and use hands to finger, handle and feel; lift and move packages weighing up to 50 pounds; sit for long periods of time using a computer in a typical office environment in a multi-level facility\n<br>\nSome activities require repetitive motion and reaching, pulling or pushing.\n<br>\nIn carrying out the duties of the job there will be frequent exposure to fumes and chemical hazards.\n<br>\nDuties performed routinely require exposure to blood, body fluid and tissue."}