{"job title": "Assistant Scientist - Biopharmaceuticals", "company": "PPD", "city state": "– Middleton, WI", "rating": "3.4", "job description": "PPD is a leading global contract research organization. At PPD we are passionate, deliberate, and driven by our purpose - to improve health.\n<br><br>\nPPD Laboratories offer the most comprehensive set of laboratory services available in the industry. Our services are designed to accelerate pharmaceutical development for small molecules, biologics, and vaccines,allowing our clients to make faster decisions about their compounds.\n<br><br>\nAs an Assistant Scientist, you will use state-of-the-art technologies to perform high-quality sample testing for key pharmaceutical clients across the industry.\n<br><br>\nYour sample preparation and sample analysis serves as an integral piece in helping PPD accomplish our goal of helping bring life-changing therapies to market.\n<br><br>\nGrow your career within the scientific ladder, pursue project management, or develop into a leader. These are just a few career pathways available once you chose to Be with PPD.\n<br><br>\nAt PPD we hire the best, develop ourselves and each other, and recognize the power of being one team. It's not just talk, our award-winning training programs speak for themselves.\n<br><br>\nJoin PPD in our relentless pursuit of excellence - apply now!\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Possesses an understanding of laboratory procedures and under general supervision can conduct complex analysis.</li>\n<li>Performs a variety of routine sample preparation and analysis procedures to quantitatively measure pharmaceutical and biopharmaceutical compounds in a variety of formulations and/or biological matrices for stability and analytical testing.</li>\n<li>Trains on routine operation, maintenance and theory of analytical instrumentation, SOPs and regulatory guidelines.</li>\n<li>Responsible for review and compilation of results and data comparison against SOP acceptance criteria, methodology, protocol and product specifications.</li>\n</ul>\n\n<strong>Education and Experience:</strong>\n\n\n<ul>\n<li>Bachelor's degree or equivalent and relevant formal academic / vocational qualification</li>\n<li>Previous experience that provides the knowledge, skills, and abilities to perform the job (comparable to 0 to 2 years?) or equivalent combination of education, training, &amp; experience.</li>\n</ul>\n\n<strong>Knowledge, Skills and Abilities:</strong>\n\n\n<ul>\n<li>Knowledge of routine operation, maintenance and theory of analytical instrumentation, SOPs and regulatory guidelines</li>\n<li>Knowledge of applicable regulatory authority, compendia and ICH guidelines</li>\n<li>Excellent manual dexterity skills</li>\n<li>Good written and oral communication skills</li>\n<li>Time management and project management skills</li>\n<li>Proven problem solving and troubleshooting abilities</li>\n<li>Ability to cross-train on sample preparation techniques with another laboratory group</li>\n<li>Ability to work in a collaborative work environment with a team</li>\n</ul>\n\n<strong>Knowledge, Skills and Abilities:</strong>\n\n\n<ul>\n<li>Manual dexterity.</li>\n<li>Communicate effectively and follow detailed written and verbal instruction.</li>\n<li>Cooperate with coworkers within an organized team environment or work alone with supervision.</li>\n<li>Manage time effectively to complete assignments in expected time frame.</li>\n<li>Maintain a laboratory notebook and complete all laboratory documentation in clear and accurate language and according to SOP.</li>\n</ul>\n\n<strong>Working Conditions:</strong>\n\n\n<ul>\n<li>Work is performed in a laboratory and/or a clinical environment with exposure to electrical office equipment.</li>\n<li>Occasional drives to site locations, occasional domestic travel.</li>\n<li>Exposure to biological fluids with potential exposure to infectious organisms.</li>\n<li>Rare exposure to skin and lung irritants, radiation, toxic materials and hazardous waste.</li>\n<li>Personal protective equipment required such as protective eyewear, garments and gloves.</li>\n<li>Exposure to fluctuating and/or extreme temperatures on rare occasions.</li>\n</ul>\n\n<strong>Physical Requirements:</strong>\n\n\n<ul>\n<li>Ability to work in an upright and /or stationary position for 6-8 hours per day.</li>\n<li>Repetitive hand movement of both hands with the ability to make fast, simple, repeated movements of the fingers, hands, and wrists to operate lab equipment.</li>\n<li>Occasional mobility needed.</li>\n<li>Occasional crouching, stooping, with frequent bending and twisting of upper body and neck.</li>\n<li>Light to moderate lifting and carrying (or otherwise moves) objects including luggage and laptop computer with a maximum lift of 15-20 lbs.</li>\n<li>Ability to access and use a variety of computer software developed both in-house and off-the-shelf.</li>\n<li>Ability to communicate information and ideas so others will understand; with the ability to listen to and understand information and ideas presented through spoken words and sentences.</li>\n<li>Frequently interacts with others to obtain or relate information to diverse groups.</li>\n<li>Works independently with little guidance or reliance on oral or written instructions and plans work schedules to meet goals. Requires multiple periods of intense concentration.</li>\n<li>Performs a wide range of variable tasks as dictated by variable demands and changing conditions with little predictability as to the occurrence. Ability to perform under stress. Ability to multi-task.</li>\n<li>Regular and consistent attendance.</li>\n</ul>\n\nPPD is an affirmative action employer that values diversity as a strength and fosters an environment of mutual respect. PPD provides equal employment opportunities without regard to age, race, color, pregnancy, national origin, religion, sex, gender identity, sexual orientation, disability, veteran status or other status within any other protected group.\n\n\n<ul>\n<li>*Job:* *Biopharmaceuticals*</li>\n<li>*Organization:* *CGMP Lab-United States (LBGUS)*</li>\n<li>*Title:* *Assistant Scientist - Biopharmaceuticals*</li>\n<li>*Location:* *Wisconsin-Middleton - Research Way*</li>\n<li>*Requisition ID:* *149538*</li>\n</ul>"}