{"job title": "Bioinformatics Research Scientist", "company": "Van Andel Institute", "city state": "– Grand Rapids, US-MI", "rating": "4.3", "job description": "Bioinformatics Research Scientist\n<br><br>\nThe Bioinformatics and Biostatistics Core provides computational and statistical research support to the growing number of scientists dedicated to studying cancer, neurodegenerative disease, and epigenetics at Van Andel Research Institute. We process and analyze next generation sequencing data, aid in experimental design, perform statistical simulations, and more. To ensure quality, expeditious assistance for such diverse requests and responsibilities, we are looking for a full-time Bioinformatics Research Scientist to join our team.\n<br><br>\nAs a Bioinformatics Research Scientist on our team, your first and foremost responsibility will be to work closely with scientists on the design, processing, and analysis of next-generation sequencing studies. But the fun doesn’t stop there. Any given day’s responsibilities might include:\n<br><br>\n• Meeting with a scientist to discuss a grant\n\n\n<ul>\n<li>Wrangling data into a useable format</li>\n<li>Patiently explaining to a researcher why an experiment failed</li>\n<li>Develop, maintain, and support bioinformatics software for VAI research projects</li>\n<li>Integrate primary data and publically available data sets for comprehensive analysis and evaluation</li>\n<li>Analyze data through established and novel bioinformatics techniques.</li>\n<li>Provide experimental design and analysis expertise/timelines to research faculty</li>\n<li>Participate in grant and manuscript writing with research faculty</li>\n<li>Develop and implement bioinformatics educational materials through seminars and workshops</li>\n<li>Serve as a co-mentor to interns and graduate students that have a significant bioinformatics component to their research project</li>\n<li>Work with the genomics core and faculty to develop novel applications of sequencing technology and subsequent analysis</li>\n<li>Engage in bioinformatics literature to ensure the availability of robust methods, resources, and data sources to support the user groups</li>\n<li>Present novel bioinformatics analyses and/or methods at scientific conferences</li>\n<li>Leading a workshop on how to use R, Python, or the latest bioinformatics analysis tools</li>\n<li>Brainstorming with fellow teammates on making the Bioinformatics and Biostatistics Core better\n<br><br>\nThe Van Andel Institute Bioinformatics and Biostatistics Core is an energetic, innovative and diverse group of scientists that are passionate about data analysis. This job might be right for you if:\n<br><br>\nYou are interested in joining a team of professionals dedicated to advancing scientific knowledge. This is an opportunity to leave your mark.\n<br><br>\nYou love taking on difficult challenges and finding the best solution whether it be tried-and-true or cutting edge.\n<br><br>\nYou enjoy helping others. Taking a few moments to explain how sequencing works makes you feel warm and fuzzy. You are patient and levelheaded.\n<br><br>\nYou pay attention to detail. Every analysis, big or small, is worth doing well, every single time so that the results are robust and reproducible.\n<br><br>\nYou are motivated and driven. You take ownership of your projects. You like learning new things and advancing your skillset. If you don’t know the answer, you’ll dig until you find it.\n<br><br>\nYou play well with others. You enjoy collaborating and working as a team. You respect the skills each team member brings to the table while still being willing to provide constructive criticism.\n<br><br>\nTo join our team you will need to have at least:\n<br><br>\n• A Ph.D. in Bioinformatics, Computational Biology, Molecular Biology, or similar field with demonstrable computational and statistical skills</li>\n<li>Experience in NGS data analysis and/or data integration (Required)</li>\n<li>Understanding of cellular and molecular biology and/or genetics</li>\n<li>Experience in R (Required) and at least one other programming/scripting language (i.e. Python, C++, Perl)</li>\n<li>Advanced mathematical and/or statistical skills as related to the analysis of NGS data</li>\n<li>Experience working in a Linux environment (Required)\n<br><br>\nYou must have the ability to contribute independently to experimental design when given a broad research question/problem. You will be expected to actively seek out information on methods and applications or consult with peers. Within 3 months, you will be expected to have met with and developed ongoing relationships with a number of VARI laboratories. as well as developing educational resources and conducting short-courses, workshops, and seminars on NGS and bioinformatics. You will have the opportunity to author publications as well as develop new statistics and bioinformatics analysis tools and/or methods.\n<br><br>\n<strong>APPLY TODAY</strong> by submitting an CV and cover letter outlining your interest in this role and how your background aligns with the position description. If you have any difficulty uploading your application or any questions, please email Eric Miller at eric.miller@vai.org.\n<br><br>\n<strong>VAI is actively striving to diversify its workforce and strongly encourages qualified individuals from underrepresented groups to apply. <em>Van Andel Institute is an EEO and Affirmative Action Employer</em></strong><br><br>Required Skills</li>\n</ul>\n\n<strong>Required Experience</strong>\n<br><br>\nJob Location\n<br>\nGrand Rapids, US-MI\n<br>"}