{"job title": "Environmental Project Scientist", "company": "AECOM", "city state": "– Glen Allen, VA", "rating": "3.2", "job description": "<ul>\n<li>*Business Line** Environment</li>\n<li>*Position Title** Environmental Project Scientist</li>\n</ul>\n\nUnited States of America - Virginia\n<br><br>\nGlen Allen\n\n\n<ul>\n<li>*Job Summary**</li>\n</ul>\n\nThe AECOM, Glen Allen, Virginia office offers a dynamic atmosphere and career growth opportunities for an Environmental Scientist who is interested in combining fieldwork, data management, and reporting to support environmental compliance and permitting services for a variety of local and national clients.\n<br><br>\nThe ideal candidate will be self-motivated and able to complete assigned tasks with minimal supervision. He or she will interact extensively with internal and external clients, requiring strong oral and written communication skills. The position will involve extensive fieldwork, both managing and self-performing assigned tasks. Following field assignments, the employee will be responsible for compiling and analyzing data and report writing.\n<br><br>\n<strong>Primary duties will include:</strong>\n<br><br>\n+ Scheduling and safely implementing field tasks on time and within budget;\n<br><br>\n+ Providing multi-media environmental support for compliance with applicable regulations, permits, and plans.\n<br><br>\n+ Conducting site inspections to ensure ongoing construction and related activities comply with all environmental requirements.\n<br><br>\n+ Identifying potential compliance issues and providing recommendations for corrective actions.\n<br><br>\n+ Preparing technical reports to document field activities and recommendations.\n<br><br>\n+ Communicating effectively with Client, Project Manager, and construction contractors.\n\n\n<ul>\n<li>*Minimum Requirements**</li>\n</ul>\n\n+ Bachelor of Science degree in Environmental Science, Geology, or Chemistry\n<br><br>\n+ 2+ years experience\n<br><br>\n+ Erosion and Sediment Control Inspector certification\n<br><br>\n+ Pipeline construction or oversight experience a plus\n<br><br>\n+ HAZWOPER 40-hour training a plus\n\n\n<ul>\n<li>*Preferred Qualifications**</li>\n</ul>\n\nKnowledge of the following environmental regulations and requirements is strongly preferred:\n<br><br>\n+ Land Disturbance/Grading Permits including Erosion &amp; Sediment Control Plans;\n<br><br>\n+ Virginia Stormwater Management Program Construction Storm Water General Permit and Storm Water Pollution Prevention Plan (SWPPP);\n<br><br>\n+ Virginia Department of Environmental Quality (DEQ) VWP Permit for Stream and Wetland impacts;\n<br><br>\n+ Corps of Engineers Section 404 Permit for Stream and Wetland impacts;\n<br><br>\n+ Conditional Use or Special Use Permits;\n<br><br>\n+ Spill Prevention Control and Countermeasure (SPCC) Plans;\n<br><br>\n+ Emergency Planning Community Right to Know Act (EPCRA) ? Tier I/II reporting requirements;\n<br><br>\n+ Clean Water Act (CWA) applicable requirements ? Protection of Waters of the United\n<br><br>\n+ States (storm water, surface water, groundwater, wetlands);\n<br><br>\n+ Resource Conservation and Recovery Act (RCRA) applicable requirements ? Solid and Hazardous Waste\n<br><br>\n+ Clean Air Act (CAA) applicable requirements ? Management of fugitive dust emissions and temporary emission sources\n<br><br>\n+ Any other site-specific permits, plans, and/or approvals required for a construction project.\n\n\n<ul>\n<li>*What We Offer**</li>\n</ul>\n\nAECOM is a place where you can put your innovative thinking and business skills into high gear and work alongside other highly intelligent and motivated people. It's a place where you can apply your skills to some of the world's most challenging, interesting, and meaningful projects worldwide. It's a place that values the diversity of our areas of practice and our people. It's what makes AECOM a great place to work and grow. AECOM is an Equal Opportunity Employer.\n<br><br>\nAt AECOM, employee's safety and security are our top Safeguarding core value. All employees are expected to set the highest level of safety expectation in their work, display the highest level of safe behavior, and actively participate in AECOM's Safety For Life Program. SH&amp;E is a part of our company culture and participation is required for all employees.\n<br><br>\n_NOTICE TO THIRD PARTY AGENCIES: Please note that AECOM does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed Recruitment Fee Agreement, AECOM will not consider or agree to payment of any referral compensation or recruiter fee. In the event a recruiter or agency submits a resume or candidate without a previously signed agreement, AECOM explicitly reserves the right to pursue and hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of AECOM._\n\n\n<ul>\n<li>*_Job Category_** _Sciences_</li>\n<li>*_Business Group_** _Design and Consulting Services Group (DCS)_</li>\n<li>*_Country_** _United States of America_</li>\n<li>*_Position Status_** _Full-Time_</li>\n<li>*_Requisition/Vacancy No._** _192128BR_</li>\n</ul>\n\n_Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status._"}