{"job title": "Scientist - Clinical Pharmacology Modeling and Simulation", "company": "Amgen", "city state": "– Thousand Oaks, CA", "rating": "3.7", "job description": "Amgen, Thousand Oaks, CA is seeking a highly motivated and team-oriented candidate for the position of Scientist in the Clinical Pharmacology Modeling &amp; Simulation Department within Medical Sciences. The individual will be responsible for the designing, planning and execution of clinical pharmacology strategies &amp; studies in support of development of small and large molecule drugs &amp; cutting-edge novel modalities.\n\n\n<ul>\n<li>*Basic Qualifications**</li>\n</ul>\n\n+ Doctorate degree\n<br><br>\n<strong>OR</strong>\n<br><br>\n+ Master's degree and 4 years of Biotechnology/Pharmaceutical Industry experience\n<br><br>\n<strong>OR</strong>\n<br><br>\n+ Bachelor's degree and 6 years of Biotechnology/Pharmaceutical Industry experience\n\n\n<ul>\n<li>*Preferred Qualifications**</li>\n</ul>\n\n+ PhD (in Pharmacokinetics or Pharmaceutical Sciences or Pharmacology) or equivalent professional degree (MD or PharmD)\n<br><br>\n+ 3 years of experience as Clinical Pharmacology functional representative on product development teams in the Biotechnology/Pharmaceutical Industry.\n<br><br>\n+ Experience in designing strategic clinical pharmacology, modeling &amp; simulation plans in support of development of small molecule and/or protein therapeutics.\n<br><br>\n+ Experience in leading the design and execution of clinical pharmacology studies including bioequivalence, drug-drug interaction, special population, ethnic sensitivity, ADME and pediatric studies and integrating results into regulatory filings, and product labels.\n<br><br>\n+ Experience with PK and PK/PD strategies, data analysis, interpretation, and reporting of PK and PK/PD data from clinical studies.\n<br><br>\n+ Hands-on experience in population PK/PD &amp; PBPK modeling and simulation.\n<br><br>\n+ Experience in authoring regulatory documents, knowledge of global regulatory requirements and guidances, and experience of interaction with global health authorities.\n<br><br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status."}