{"job title": "Postdoctoral Scientist (Pulmonary Research)", "company": "Cedars-Sinai", "city state": "– Los Angeles", "rating": "3.9", "job description": "<div>The position is in the Chen Laboratory at Cedars-Sinai Medical Center(https://www.cedars-sinai.edu/Research/Research-Labs/Chen-Lab/). This NIH-funded laboratory focuses on lung&nbsp;epithelial biology and the response to injury in normal and pathological conditions. The laboratory has projects in acute lung injury, lung infections, and fibrosis using a variety of cell based, murine models, and human samples for translational work. The specific project being offered is working on influenza-induced lung injury as an extension of our recently published findings (doi: 10.1164/rccm.201509-1878OC). In this work, the postdoctoral scientist will study the innate immune functions in the lungs after influenza infection and test some novel hypotheses on how syndecan-1, a cell surface proteoglyan, regulates the&nbsp;resolution of lung inflammation after injury. The environment is within the Women’s Guild Lung Institute, where a number of postdoctorate scientists,&nbsp;research&nbsp;associates, and graduate students continue&nbsp;high impact work under the guidance of prominent investigators to understand the&nbsp;mechanisms of various lung diseases (https://www.cedars-sinai.edu/Research/Research-Areas/Pulmonary/). Furthermore, these researchers are highly interactive and&nbsp;collaborative in their approach to&nbsp;science with weekly joint research meetings and journal clubs.&nbsp;\n<br><br>\n&nbsp;\n<br><br>\nThe postdoctoral scientist is expected to work&nbsp;independently but in close cooperation and in consultation with the Principal Investigator and other Research Scientists. The Postdoctoral Scientist will perform routine and complex laboratory procedures throughout training period and may develop, adapt, and implement new research techniques and protocols. He/she will analyze and interpret data, assist in preparation of grant proposals, and participate in publications and presentations as author or co-author. For eager postdoctoral scientists interested in applying for grant funding, mentorship will be provided, but there is&nbsp;no requirement for generating grant funding in this position. Moreover, we have a T32 institutional training grant within the Lung&nbsp;Institute that is another opportunity for&nbsp;research training for qualified individuals.&nbsp;The position is in the Chen Laboratory at Cedars-Sinai Medical Center.\n<br><br>\n&nbsp;\n<br><br>\nDEPARTMENT SPECIFIC – ESSENTIAL JOB RESPONSIBILITIES:\n\n\n<ul>\n<li>Monitors and ensures compliance with safety standards and procedures.&nbsp;</li>\n<li>Independently creating and updating protocols for all research in the laboratory (e.g., IACUC).</li>\n<li>Understand the basic premise of all the laboratory projects and helping laboratory members carry out their research as needed.</li>\n</ul>\n\n<strong>Facilitate publications and grant applications by:</strong>\n\n\n<ul>\n<li>Generating new data for the research project</li>\n<li>Analyzes data and prepares scientific findings for publication as author or co-author.&nbsp;</li>\n<li>Work independently on a project and push it forward into novel areas</li>\n<li>Help other laboratory members move their project in novel directions</li>\n<li>Compile and organize the data generated by members of the laboratory and create appropriate figures with statistical analysis</li>\n<li>Overseeing all work in the laboratory to ensure it is carried out with the highest scientific rigor</li>\n</ul>\n\n<strong>Other duties include:</strong>\n\n\n<ul>\n<li>Providing miscellaneous clinical/research support (ad hoc data analysis, hypothesis development, programming, troubleshooting, etc.).&nbsp;</li>\n<li>Organizing clinical/research trials in conjunction with the Principal Investigator and sponsor and/or funding source.</li>\n<li>Making independent presentations.&nbsp;</li>\n<li>Providing system administration and maintenance for the local workstation network.&nbsp;</li>\n<li>Training Research Lab Assistants, Research Fellow, lower level Research Associates, and other related support staff and may be requested by PI to take on specific supervisory activities.</li></ul></div>\n"}