{"job title": "Data Science Consultant", "company": "Duke Energy", "city state": "– Charlotte, NC", "rating": "3.7", "job description": "More than a career - a chance to make a difference in people's lives.<br><br>Build an exciting, rewarding career with us – help us make a difference for millions of people every day. Consider joining the Duke Energy team, where you'll find a friendly work environment, opportunities for growth and development, recognition for your work, and competitive pay and benefits.<br><br>Position Summary<br><br>The data science consultant will support the growing analytics needs of the company. This position is responsible for business consulting activities for internal business customers within various Duke Energy business units as the primary interface and as a liaison to Information Technology in order to:\n<br><br>\n• Serve as an expert in translating complex data into key strategy insights and valuable actions.\n\n\n<ul>\n<li>Discover business narratives told by the data and present them to other scientists, business stakeholders, and managers at various levels.</li>\n<li>Develop and test heuristics</li>\n<li>Create, train, test, run and refine models</li>\n<li>Perform data exploration and data mining</li>\n<li>Create business intelligence, dashboards, visualizations, and/or other advanced analytics reports to adequately tell the business narrative and offer recommendations that are practiced, actionable, and have material impact, in addition to being well-supported by analytical models and data.<br><br>Responsibilities<br><br>Partner with Business Clients, establish professional relationship, and communicate with analytics clients in order to understand business needs.\n<br><br>\nFrame Problems with Stakeholder, research and construct problem frames in order to understand the analysis context and scope that will provide timely, useful results.\n<br><br>\nWork in Project Teams and participate in multidisciplinary analytics project teams.\n<br><br>\nInterview Subject Matter Experts, plan and conduct individual interviews with experts to gain valid information and data needed for analysis.\n<br><br>\nElicit Information from Groups, plan and conduct group elicitation sessions with working groups to develop and assess alternatives, uncertainties, and value and risk preferences.\n<br><br>\nCommunicate Results to Decision Makers, explain the Results and conclusions of the analytics process in both written and oral presentation formats.\n<br><br>\nCreate recommendations that are practical, actionable, and have material impact, in addition to being well-supported by analytical models and data.\n<br><br>\nEmployees in this role will also:</li>\n</ul>\n\no Identify unique opportunities to collect new data.\n<br>\no Design new processes and build large, complex data sets.\n<br>\no Strategize new uses for data and its interaction with data design.\n<br>\no Locate new data sources, analyze statistics and implement quality procedures.\n<br>\no Perform data studies of new and diverse data sources.\n<br>\no Find new uses for existing data sources.\n<br>\no Conduct statistical modeling and experiment design.\n<br>\no Develop, test, validate and refine predictive models to optimize customer experiences, revenue generation, operational effectiveness, marketing success and other business outcomes.\n<br>\no Build web prototypes and performs data visualization.\n<br>\no Conduct scalable data research on and off the cloud.\n<br>\no Implement automated processes for efficiently producing scale models.\n<br>\no Design, modify and build new data processes.\n<br>\no Generate algorithms and create computer models.\n<br>\no Collaborate with database engineers and other scientists.\n<br>\no Implement new or enhanced software designed to access and handle data more efficiently.\n<br>\no Train the data services center team on new or updated procedures.<br><br>Basic/Required Qualifications\n\n<ul>\n\n<li>Graduation from a four-year college or university with a degree in statistics, physics, mathematics, engineering, computer science, economics, finance, or management of information systems.</li>\n<li>3-5 Years of prior equivalent work related experience in addition to a degree:</li>\n\n</ul>\n\nDesired Qualifications\n\n<ul>\n\n<li>Strong critical thinking skills and the ability to relate them to the products or services the company is producing.</li>\n<li>Mastery of statistics, machine learning, algorithms and advanced mathematics.</li>\n<li>Strong knowledge of basic and advanced prediction models.</li>\n<li>Knowledge of electricity and natural gas utility business model and operations.</li>\n<li>Basic knowledge of Linux command line interface.</li>\n<li>Basic knowledge of Hadoop ecosystem, including tools for data mining and analytics, including Sqoop, Hive, Pig, Spark and/or Scala.</li>\n<li>Experience with SAP HANA for predictive analytics.</li>\n<li>Knowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks.</li>\n<li>Knowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications.</li>\n<li>Data mining knowledge that spans a range of disciplines.</li>\n<li>Strong exploratory analysis skills.</li>\n<li>Excellent verbal and written communication skills as well as the ability to bridge the gap between data science and business management.</li>\n<li>Exceptional organizational skills and is detail oriented.</li>\n\n</ul>\n\nSpecific Requirements\n\n<ul>\n\n<li>Working knowledge of statistics and predictive modeling.</li>\n<li>Working knowledge of code writing and programming.</li>\n<li>Understanding of and ability to use programming languages for predictive analytics modeling, like Python, R or SAS.</li>\n<li>Understanding of and ability to use scripts like SQL (Structured Query Language) and / or Hive for accessing and wrangling data.</li>\n\n</ul>\n<strong><strong>Travel Requirements</strong></strong><br><br>5-15%Relocation Assistance Provided (as applicable)NoRepresented/Union PositionNoVisa Sponsored PositionNo<br><br><strong><strong>Posting Expiration Date</strong></strong><br><br>Wednesday, September 12, 2018<br><br>All job postings expire at 12:01 AM on the posting expiration date.<br><br>Please note that in order to be considered for this position, you must possess all of the basic/required qualifications."}