{"job title": "Group Technical Program Manager, Data Warehouse", "company": "Facebook", "city state": "– Menlo Park, California", "rating": "4.5", "job description": "Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities we're just getting started.Facebook is seeking a Technical Program Management leader for the Data Warehouse team. The team's mission is to build the best-in-class Data Warehouse that enables Facebook to learn better and faster from data. This person will support the Data Warehouse TPM organization. Their responsibilities include people management for the Technical Program Manager team and growing the areas that TPMs support within the organization, as well as driving planning and programs within the larger Data Warehouse organization. This is a full-time position based in our Menlo Park office and will report to the Group Technical Program Manager for Data Infrastructure.\n<br><br>\n<strong>Responsibilities:\n<br>\n</strong>\n\n<ul>\n<li>Manage cross-functional infrastructure software engineering programs in a matrix organization</li><li>Help define the long term vision &amp; strategy for Data Warehouse space</li><li>Partner with key infrastructure groups &amp; data engineers, scientists &amp; analysts across the company to understand and anticipate their needs.</li><li>Forge partnerships with the Infrastructure teams to collaboratively solve hardware/software problems.</li><li>Bring a strong sense of execution and ownership to the team.</li><li>Build highly scalable, performant and reliable systems and infrastructure.</li><li>Responsible for hiring, mentoring and developing the best TPM talent for FB in Data Warehouse.</li><li>Define and own key metrics and key performance indicators.</li><li>Responsible for people management of a team, providing performance reviews, continual feedback, coaching and career growth for direct reports.</li><li>Manage 3 8 direct reports.</li><li>Articulate the technology, requirements, goals and milestones of your team.</li>\n</ul>\n\n<strong>Mininum Qualifications:\n<br>\n</strong>\n\n<ul>\n<li>Experience managing a team of technical program managers, including building and growing the team.</li><li>Two or more years of experience in Big Data, Data Warehouse or Large Scale Cloud systems, five or more years of experience as a Technical Program Manager, and two or more years experience as a People Manager.</li><li>Experience operating enterprise class cloud services.</li><li>B.S. in a technical discipline or equivalent experience.</li><li>Communication and interpersonal skills, including relationship building and collaboration within a diverse, cross-functional team.</li><li>Organizational and coordination skills along with multitasking capabilities to get things done in a fast-paced environment.</li><li>Experience understanding product requirements and translating needs into plans.</li><li>Experience managing team members in remote locations</li>\n</ul>\n\n<strong>Preferred Qualifications:\n<br>\n</strong>\n\n<ul>\n<li>Knowledge of Data Platforms.</li><li>Experience with Product and Program Management.</li><li>Knowledge of large-scale distributed systems.</li><li>Master's or Ph.D. in CS, Math, Statistics or related areas.</li><li>Knowledge of capacity, migration, and management.</li><li>Distributed performance tracing and critical path analysis</li><li>Experience with Disaster Recovery and business continuity.</li>\n</ul>"}