{"job title": "Senior Clinical Data Analyst", "company": "Health Catalyst", "city state": "– Salt Lake City, UT", "rating": "4.4", "job description": "<strong>Job Title:</strong> Senior Clinical Data Analyst\n<br><br>\n<strong>Department:</strong> Technology\n<br><br>\n<strong>Location:</strong> TBD, USA\n<br><br>\n<strong>Travel:</strong> Up to 35%, USA\n<br><br>\n<strong>Open date:</strong> 9/4/18\n<br><br>\n<strong>Close date:</strong> TBD\n<br><br>\n<strong>About Health Catalyst</strong>\n<br><br>\nHealth Catalyst has been named as one of the 30 Best Workplaces in Technology by Fortune Magazine and a winner of Gallup Great Workplace award. Health Catalyst earned the highest overall score in Healthcare BI by KLAS and, for the sixth year in a row, was named to the Best Places to Work in Healthcare list by Modern Healthcare. Health Catalyst analyzes healthcare records of almost a third of the US population (65 million patients) and recently released the first open source software for healthcare machine learning: healthcare.ai.\n<br><br>\nHealth Catalyst's platform and applications are being used at leading health systems including, John Muir Health, UPMC, MultiCare Health System, Partners HealthCare, Banner Health, Stanford Hospital &amp; Clinics, Texas Children's Hospital, and over 40 others. Health Catalyst products and services are utilized in over 400 hospitals and 4000 clinics, supporting over 90 million patients.\n<br><br>\nOur team lives the cultural attributes of Smart, Hardworking and Humble. Learn more about working at Health Catalyst here: https://www.healthcatalyst.com/company/careers/key-health-catalyst-values.\n<br><br>\n<strong>Job Summary</strong>\n<br><br>\nThe Senior Clinical Data Analyst will be responsible for designing, developing, evaluating and modifying clinical analytics solutions aimed at deriving insights from Health Catalyst's existing extensive clinical datasets. The SCDA will be experienced in clinical data and fluent in disease terminology to evaluate critically sources and quality of data being utilized to derive insights and be able to rapidly recognize inconsistencies and initiate resolution to data problems. Initial focus will be on identification of robust patient cohorts and associated treatment, biomarker and outcome data aimed at internal R&amp;D evaluation for product development, external publications as well as projects with clients based on their needs. The role will involve rapid prototyping of new solutions with the support of data scientists, data engineers and biostatisticians on the team, thus some experience with statistical programming (using SciPy/R/Shiny) will be required and experience with data science notebook environments (e.g. Jupyter, Google Datalab) would be beneficial. We seek an SCDA who will have the ability to drive projects, and who could eventually lead a team. The SCDA will report to the Director of Life Science Analytics and will support the Director and the SVP/head of the business unit in engaging both with internal management as well as client management to grow successfully the business unit and demonstrate impact on drug development R&amp;D and ultimately patient outcomes. The role has great potential for a successful candidate as they will form the initial seed of a new business unit with significant patient outcome and business potential. This role will ideally be based in Cambridge, MA but can also be in Salt Lake City, UT or remote as long as candidate is willing to travel regularly.\n<br><br>\n<strong>Duties &amp; Responsibilities</strong>\n\n<ul>\n<li><em>Evaluate existing and available Health Catalyst Data sources</em>  provide in depth evaluation of existing Health Catalyst data assets, their quality, usability for life sciences applications, and any potential gaps that might emerge. Focus initially on disease, treatment and biomarker data, and verify breadth and depth of current data assets across key drug development pipeline relevant indications. Take \"deep dives\" in a few prioritized areas to rapidly prototype specific analytics solutions.</li>\n<li><em>Design, evaluate and develop clinical analytics solutions</em>  Work with other members of the team (data scientists, data engineers, biostatisticians) to rapidly prototype solutions that allow to transform Health Catalyst real-world clinical and biomarker data into actionable insights using robust statistical methods and insightful data visualizations easily approachable by a variety of users.</li>\n<li><em>Execute rapid prototyping projects for internal R&amp;D, publications and clients</em>  Identify with Director and head of unit key initial projects to be executed for internal R&amp;D, external publications and/or clients, where SCDA can exercise full project ownership from start to end, taking a project from initial requirements and feasibility assessment to execution and delivery/communication of results.</li>\n<li><em>Contribute to development of initial LS prototype platform</em>  Work with other team members to produce a first prototype of the life sciences platform embedding the first packages/applications developed by the team into a more generalizable framework that can be re-utilized and re-deployed to solve other similar problems, leveraging the Google Datalab platform/Jupyter Notebooks.</li>\n<li><em>Project status communication</em> Clearly articulate to clients and internal management status of projects and provide insight to any additional support needed for a viable success of the implementation. Actively participate in relevant internal meetings, providing feedback on processes and strategic issues. Actively engage with broader HC community and with clients to rapidly shape the business unit and make it successful.</li>\n<li><em>Provide guidance, training and knowledge transfer to other HC teams as needed</em>  as the business unit will start developing solutions, working with clients and interacting with the broader RWD life sciences community, all team members will also be expected to support existing HC teams across the organization to receive guidance, learn and be trained in areas pertaining drug development, clinical trials, translational research, to support and enhance existing products, services and business relationships.</li>\n<li><em>Managing collaborations/internships as needed</em>  While initially the role is as individual contributor, as the business unit will be engaging in collaborations with Boston based colleges and Institutes, it is expected that the SCDA will take on students/interns and/or collaborations with academic labs to further the impact of the team.</li>\n</ul>\n<strong>Required Skills</strong>\n\n<ul>\n<li>Must possess deep expertise in evaluating and assessing quality of clinical data used in the context of translational research, drug development, population health.</li>\n<li>Must have experience in quantitative science, statistical analysis, ability to derive robust insights from complex RWD datasets</li>\n<li>Must have experience in performing data analysis utilizing statistical frameworks (R, SciPy, SAS) and ideally experienced already in using environments such as Jupyter Notebooks/Google Datalab</li>\n<li>Some data engineering experience (ETL, SQL) highly desirable</li>\n<li>Must be comfortable working in rapid prototyping environment, using agile approaches to guiding teams and projects</li>\n<li>Must have good understanding of drug development process and use of biomedical data for drug development and clinical trials design</li>\n<li>Strong communication skills; ability to guide small projects, interacting with clients and internal management.</li>\n<li>Ability to mentor/train/educate others, including interns/students at collaborating Institutions.</li>\n<li>Good interpersonal skills with the ability to effectively guide and facilitate meetings.</li>\n<li>Must possess advanced presentation skills and be comfortable presenting to internal management, clients and at conferences. Ability to present key concepts to small and large audiences effectively. Ability to communicate in a group setting, concisely at a detail level when needed.</li>\n<li>Ability to adapt quickly and change direction as needed to address evolving needs of business unit for both R&amp;D and client needs.</li>\n<li>Ability to learn new skills and software tools quickly and ask for help or training when necessary.</li>\n</ul>\n<br><br>\n<strong>Work Experience</strong>\n\n<ul>\n<li>Required: 8+ years of relevant experience in delivering insights from complex translational/clinical datasets, PhD in relevant discipline (e.g. life science R&amp;D)</li>\n<li>Required: 3+ years of experience performing statistical analysis/data science on complex datasets using R, Python, Jupyter Notebooks</li>\n<li>Experience working in the life sciences industry or with/for the life science industry strongly preferred</li>\n<li>Experience working with Real World Data strongly preferred.</li>\n<li>1+ year experience effectively communicating to clients/conferences/management required</li>\n<li>Experience of working as part of analytics/data science teams preferred</li>\n<li>Experience managing small teams/students preferred</li>\n<li>1+ year project management experience preferred.</li>\n</ul>\n<br><br>\n<strong>Education &amp; Relevant Experience</strong>\n\n<ul>\n<li>Required - Bachelor's degree in life sciences, medicine or a quantitative science</li>\n<li>Required PhD, ideally with combination of quantitative sciences and life science applications</li></ul>\n\n\n<ul>\n<li>Required Expert in statistics, min 3 years experience in statistical analysis of clinical and/or translational datasets</li>\n<li>Secondary skills/attributes (highly desired);\n\n\n<ul>\n<li>Data Science, Machine Learning, AI, etc.</li>\n<li>Programming (Python, Java)</li>\n<li>Project management</li>\n</ul>\n\n</li>\n</ul>\n<em>The above statements describe the general nature and level of work being performed in this job function. They are not intended to be an exhaustive list of all duties, and indeed additional responsibilities may be assigned by Health Catalyst.</em>"}