{"job title": "Clinical Scientist, Assoc Dir", "company": "IQVIA", "city state": "– USA-North Carolina-Research Triangle Park", "rating": "3.4", "job description": "<div><b>PURPOSE</b></div>\n<div> </div>\n<div>The Clinical Scientist position is intended for an individual aspiring to lead full product development programs within the pharmaceutical industry. To this end, the incumbent will have responsibility for preparation of various work products of the Strategic Drug Development group that are part of product development process (including preparation of integrated product development plans, clinical trial applications, sections of Investigational New Drug applications, preclinical and clinical study protocols, investigator brochures, supporting statistical documents, integrated clinical/statistical final study reports, and sections of marketing applications.) </div>\n<div> </div>\n<div><b> </b></div>\n<div><b>RESPONSIBILITIES</b></div>\n<div> </div>\n<div>Duties of the Clinical Scientist include but are not limited to:</div>\n<ul>\n<li>\n<div>Leading in the development of proposals for potential clients</div></li>\n<li>\n<div>Providing standardized templates for proposals and key deliverable outputs</div></li>\n<li>\n<div>Researching current literature to assist in the drug development lead in preparation for all deliverables, including current product label, treatment guidelines, competitive landscape assessments and standard of care. </div></li>\n<li>\n<div>Contributing to various sections of investigational brochures; summarizes animal and clinical studies, and draws conclusions as to the potential safety of the drug under study.</div></li>\n<li>\n<div>Assisting in writing documents to support regulatory submissions including, but not limited to, protocol synopses, clinical trial authorizations (INDs, CTAs), marketing authorization applications (NDAs, BLAs, NDSs, MAAs), device authorizations (IDEs, 510Ks, PMAs).</div></li></ul>\n<div><b>REQUIRED KNOWLEDGE, SKILLS AND ABILITIES</b></div>\n<div><b> </b></div>\n<ul>\n<li>Masters degree (or equivalent) are required but a PhD, PharmD, or MD degree are preferred as well as excellent reasoning capabilities, scientific acumen, and writing capabilities are required. </li>\n<li>Minimum of two years’ work experience (e.g., student internships, postdoctoral fellowships, laboratory positions, or project management). </li>\n<li>Working knowledge of medical terminology and basic statistical concepts is strongly preferred. </li>\n<li>Experience with medical, pharmaceutical, and/or research concepts.</li>\n<li>Experience with principles of or project work involving Chemistry, Manufacturing, and Controls (CMC), nonclinical safety research, or clinical study design, management, or participation is desirable.</li>\n<li>Proficiency with software packages including, but not limited to: Microsoft Word, Excel, PowerPoint, Project and Visio. </li>\n<li>Proficiency in scientific writing (outlining, drafting, revising, and reviewing.) </li>\n<li>Basic editorial and proofreading skills</li></ul>\n<div>In addition, the successful incumbent must be:</div>\n<ul>\n<li>Detail-oriented, thorough, and methodical. </li>\n<li>Able to reduce voluminous complex scientific data to it essence in tabular or summary form.</li>\n<li>Adaptable to changes in work duties, responsibilities, and requirements.</li>\n<li>Team-oriented individuals who keep others informed of the progress and status of writing projects.</li>\n<li>Able to perform numerous tasks simultaneously without losing sight of overall objectives.</li></ul>EEO Minorities/Females/Protected Veterans/Disabled"}