{"job title": "Research Scientist - Translational Molecular Pathology", "company": "MD Anderson Cancer Center", "city state": "– United States, Texas, Houston, Houston", "rating": "4.1", "job description": "<div><div><div><div><div><strong>SUMMARY</strong>\n<br><br>\nThe person in this position will be assigned to work will all faculty collaborators and sponsor translational research scientists for the liquid biopsy program. This person will assist in the development and design of clinical and translational research goals and objectives. Reviews, evaluates and correlates research data. Prepares data and quality control information related to Liquid biopsy protocols and pipelines, compiles, writes and submits reports to superior. Plans and supervises the training of technicians and other laboratory personnel with respect to proper laboratory techniques, the use of laboratory equipment, Laboratory information systems, Standard of procedures and safety procedures. Help on grants, abstracts, and manuscript submissions. Writes and prepares publications and reviews analyses and interpretations of data. Assigns and reviews work of subordinates, determines specific goals or objectives to be attained, evaluates their resulting research data and revises techniques or approaches to work problems. Supervises the design, development or adapting of equipment used in experiments or research to obtain desired results.<br>\n<div><strong>JOB SPECIFIC COMPETENCIES</strong></div>\n<br>\n<div></div>\n<br><strong>Liquid Biopsy Standard of Procedures (SOP), Enhancement and Maintenance</strong><br>\n<div>1. Work with users at all levels to identify potential solutions and develop analytical pipelines that helps with enhancing productivity of the Next Generation Sequencing workflows and LIMS Platforms</div>\n<br>\n<div>2. Coordinate with end users to perform analysis of requirements and develop prototypes for new analytical technologies (RNA editing and Molecular Barcoding tools)</div>\n<br>\n<div>3. Design, develop, execute and analyze, standard DNA/RNA NGS and new methodologies for Next Generation Molecular barcodes sequencing technologies</div>\n<br>\n<div>4. Identify and develop laboratory methods for quality controls of NGS and other Genomic Platforms</div>\n<br>\n<div>5. Coordinate and develop Standard of Procedures (SOP) as needed</div>\n<br>\n<div>6. Work with the Liquid Biopsy Scientific Manager on projects initiatives, project reports and workflows implementation</div>\n<br>\n<div>7. Work with Vendors to implement new methodologies (workflow and integration) utilizing institutional resource and systems</div>\n<br>\n<div>8. Work with Laboratory equipment vendors to troubleshoot and/or repair defective or nor optimal equipment.</div>\n<br>\n<div>9. Present proposed solutions to development team and seek buy in from all relevant parties.</div>\n<br>\n<div><strong>Analytics &amp; Reporting</strong></div> \n<br>\n<div>1. Work with Center Researchers and Scientists with the development of reports</div>\n<br>\n<div>2. Work with the Center Specimen &amp; Data Team to ensure sample collection methodology and quality standards are secured in all sample collections.</div>\n<br>\n<div>3. Work with the Center Laboratory Team to ensure reporting features, data incorporations on LIMS and team functions are available and accurate.</div>\n<br>\n<div>4. Work to interface and curate data for Analytic and Reporting tools with LIMS and Bioinformatics pipelines</div>\n<br>\n<div>5. Assist with the development of clinical protocols that align with Moonshot Platform and Information Services</div>\n<br><strong>General Functions</strong><br>\n<div>1. Coordinate efforts with Liquid Biopsy team members and User</div>\n<br>\n<div>2. Represent the Center Platform at meetings and functions</div> \n<br>\n<div>3. Facilitate and coordinates the smooth flow of communication by acting as a liaison</div> \n<br>\n<div>4. Maintain and exercises center development practices</div>\n<br>\n<div>5. Demonstrate excellent team work, oral and written communication skills when working with center researcher or contacting other institutions, patients, and departments by phone, email, and/or face-to-face interactions.</div>\n<br>Other duties as assigned<br>\n\n<div>\nPhD in one of the natural sciences or related field or Medical degree With PhD, no experience required. With Medical degree, two years of experience in experimental or scientific work. It is the policy of The University of Texas MD Anderson Cancer Center to provide equal employment opportunity without regard to race, color, religion, age, national origin, sex, gender, sexual orientation, gender identity/expression, disability, protected veteran status, genetic information, or any other basis protected by institutional policy or by federal, state or local laws unless such distinction is required by law. http://www.mdanderson.org/about-us/legal-and-policy/legal-statements/eeo-affirmative-action.html</div>\n </div>\n</div>\n </div>\n </div>\n</div>\n<br>"}