{"job title": "Senior Scientist, Biomolecular Interactions", "company": "Merck USA", "city state": "– Boston, MA", "rating": "3.7", "job description": "<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong><br>\n<div><strong>Requisition ID:</strong> MOL000390<br><br>Merck &amp; Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck’s success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.\n<br><br>\nMerck is on a quest for cures and is committed to being the world’s premier, most research-intensive biopharmaceutical company. Today, we’re doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck’s leading discovery capabilities and world-class small molecule and biologics R&amp;D expertise to create breakthrough science that radically changes the way we approach serious diseases.\n<br><br>\nWe are seeking a highly motivated senior scientist to join our Biomolecular Interactions team within the Protein Sciences organization at our research division in Boston. The qualified candidate will be responsible for the development of fit-for-purpose binding assays with an array of technologies to characterize the binding activity, epitope specificity, cross reactivity, and quality of various protein antigens and biologics including but not limited to antibodies, bi-specifics, Fc-fusions, and receptors. Other responsibilities include developing new technologies, performing protein conjugations and limited biophysical characterization assays, managing multiple projects and workflows, communicating results in reports and presentations to project team stakeholders, and participation in cross-functional and/or cross-site teams.<br><br><strong>Qualifications</strong><br><br>Education Minimum Requirement:\n<br><br>\nBachelor's degree in biomedical sciences/engineering or related discipline with 5+ years of relevant lab experience, M.S. degree with 3-5 years of experience, or PhD in a related field.\n<br><br>\nRequired Experience and Skills:\n<br><br>\nHands on experience with Biacore or other biosensor platforms (ForteBio, Carterra) assay development and data interpretation of protein:ligand interactions\n<br><br>\nExperienced user of data analysis software such as GraphPad Prism or MS Excel\n<br><br>\nDemonstrated ability to independently develop assays, design experiments, critically review data, and troubleshoot assays\n<br><br>\nPreferred Experience and Skills:\n<br><br>\nHands on experience with ELISA, Microscale Thermophoresis, or KinExA assays development\n<br><br>\nHands on experience with protein conjugation techniques, SDS-PAGE, western blotting, and protein quantification\n<br><br>\nExperience with automated liquid handling systems\n<br><br>\nExperience using flow cytometry and FACS\n<br><br>\nExperience with Spotfire (highly desired)\n<br><br>\nYour role at Merck is integral to helping the world meet new breakthroughs that affect generations to come, and we’re counting on your skills and inventiveness to help make meaningful contributions to global medical advancement. At Merck, we’re inventing for life.\n<br><br>\nIf you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request to staffingaadar@merck.com.\n<br><br>\n<strong>Search Firm Representatives Please Read Carefully:</strong>\n<br><br>\nMerck &amp; Co., Inc. is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any employee at Merck via email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Merck. No fee will be paid in the event the candidate is hired by Merck as a result of the referral or through other means.\n<br><br>\nFor more information about personal rights under Equal Employment Opportunity, visit:\n<br><br>\nEEOC Poster\n<br><br>\nEEOC GINA Supplement<br><br><strong>Job:</strong> Molecular Discovery - Biologics\n<br>\n<strong>Other Locations:</strong> \n<br>\n<strong>Employee Status:</strong> Regular\n<br>\n<strong>Travel:</strong> \n<br>\n<strong>Number of Openings:</strong> 1\n<br>\n<strong>Shift (if applicable):</strong> \n<br>\n<strong>Hazardous Materials:</strong> BSL-2 Reagents\n<br>\n<strong>Company Trade Name:</strong> Merck</div>"}