{"job title": "Production Scientist 1", "company": "Promega", "city state": "– Madison, WI", "rating": "4.2", "job description": "<strong>This is a 12 month project position.</strong>\n<br><br>\n<strong>JOB OBJECTIVE:</strong>  Manufacture products and perform quality control tests.\n<br><br>\n<strong>ESSENTIAL DUTIES:</strong>\n<br><br>\n1. Manufacture a variety of biologics and/or biochemical products so as to meet product specifications. Follow production schedules to assure on-time delivery of finished product. Understand basic laboratory concepts and perform basic lab techniques.\n<br><br>\n2. Perform assays to assure that products meet existing requirements for purity, activity and functionality. May require supervision to determine +/- passing results.\n<br><br>\n3. Follow the quality requirements that relate to area. Demonstrates good documentation practices and consistently produces quality products and documentation. Follow existing policies for data recording and record keeping.\n<br><br>\n4. Understands and complies with ethical, legal and regulatory requirements applicable to our business.\n<br><br>\n<strong>O<strong>CCASIONAL DUTIES:</strong></strong>\n<br><br>\n1. Participate in and follow project plans and experimental design with assistance. Provide data or information to others in work area, and assist in implementation activities for own products. MANDATORY\n<br><br>\n<strong><strong>MANDATORY QUALIFICATIONS:</strong></strong>\n<br><br>\n1. A.D. or B.S. degree in a scientific discipline (e.g., Biochemistry, Biotechnology, Molecular Biology, Microbiology). May have 0-3 years of related experience.\n<br><br>\n2. Familiar with biochemical separations, buffer preparation, and assay methods.\n<br><br>\n3. Familiar with basic principles of documentation using either laboratory notebook or batch record.\n<br><br>\n4. Strong computer skills including Microsoft Office, ERP systems, etc<strong>.</strong>\n<br><br>\n<strong><strong>PREFERRED QUALIFICATIONS:</strong></strong>\n<br><br>\n1. Experience (beyond coursework) with proteins, nucleic acids, and chemistry.\n<br><br>\n2. Prior industry experience and/or clean room experience is a plus.\n<br><br>\n3. Familiarity with ISO 9000 or cGMPs.\n<br><br>\n4. Experience with use of computers for collection and analysis of experimental data.\n<br><br>\n<strong><strong>PHYSICAL REQUIREMENTS:</strong></strong>\n<br><br>\n1. Ability to work at a laboratory bench for extended periods of time.\n<br><br>\n2. Ability to work with hazardous materials (e.g. chemicals, radioactivity, electrical equipment) so as not to endanger oneself or others.\n<br><br>\n3. Ability to use computers in an interactive manner for extended periods of time.\n<br><br>\n4. Ability to use standard laboratory protective equipment (e.g. goggles, lab coat, protective gloves).\n<br><br>\n5. Ability to lift 50 lb. occasionally<strong>.</strong>\n<br><br>\nDiversity is important at Promega. We are proud to be an Equal Opportunity Employer, and make employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran status, disability, or any other protected class.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}