{"job title": "Sr Scientist -Toxicologist", "company": "RAI Services Company", "city state": "– Winston Salem, NC", "rating": "5.0", "job description": "Reynolds American Incorporated is positively transforming the tobacco industry. Were a family of companies that strives for success in everything we do. The future inspires us because our people are igniting the breakthroughs that are redefining the ways adult tobacco consumers enjoy tobacco in the 21st century.\n<br><br>\nWhen other companies talk about growth, they only talk about size. At RAI, we focus on the growth of our people. We take pride in each others growth and well-being throughout our careers. We invest in your career and total well-being because we know our companies succeed when our people thrive.\n<br><br>\nAt the RAI companies youll have the opportunity to work on iconic brands and revolutionary products by collaborating with visionary, principled and passionate people every day.\n<br><br>\nThis position is within Reynolds American Services Companya subsidiary that provides support services, including compliance, HR, law, finance, informationmanagement, and more to all of the subsidiaries ofRAI.\n<br><br>\n<strong>Position Description:</strong>\n<br><br>\nEmployer (RAIS) is seeking a toxicologist to support the development of new products consistent with RAIS' Growth, Innovation and Harm Reduction Platforms, and provide support for efforts such as regulatory submissions. The incumbent will be required to provide stewardship and regulatory support for consumer products, critically assess a broad range of toxicological information, evaluate chemical and toxicological data, develop technical documents on a variety of scientific and risk assessment topics, and assist with the preparation and/or review of information supporting regulatory submissions. The individual will be required to interact cross-functionally, across the enterprise, and globally, as well as manage multiple projects to ensure project timelines are met.\n<br><br>\n<strong>Key responsibilities will include:</strong>\n<ul>\n<li>Provide stewardship support across products, materials, ingredients, technologies, manufacturing processes, etc., for RAI Operating Companies</li><li>Develop technical documents on various scientific, risk assessment, and regulatory topics, including toxicological data summaries.</li><li>Assist with the design, management, and interpretation of chemical and toxicological studies at contract research organizations to support product development and regulatory submissions.</li><li>Lead and/or assist with the preparation of documents in support of regulatory submissions.</li>\n</ul>\n<strong>Position Qualifications:</strong>\n<br><br>\n<em>Educational Requirements</em>\n<ul>\n<li>PhD in Toxicology, Pharmacology or related discipline.</li><li>MS in Toxicology, Pharmacology or related discipline with minimum 2 years of industry experience conducting human safety assessments of consumer products (e.g., cosmetics, household products), medical devices, pharmaceuticals, or chemicals.</li>\n</ul>\n<em>Required Skills</em>\n<ul>\n<li>Mastery of literary &amp; laboratory research skills to use web search and scientific databases for bibliographic research and scientific monitoring.</li><li>Strong scientific and technical writing skills.</li><li>Proficiency in Microsoft Office software; strong computer experience is essential.</li><li>Excellent project management and teamwork skills.</li><li>Excellent interpersonal, written/oral communication skills.</li>\n</ul>\n<em>Preferred Skills</em>\n<ul>\n<li>Experience applying quantitative risk assessment (QRA) approaches and the preparation of human health risk assessments.</li><li>Experience with the preparation of documents in support of regulatory submissions.</li><li>Experience with critical evaluation of <em>in vivo</em> and <em>in vitro</em> toxicological studies.</li><li>Experience organizing and working with large datasets of information.</li><li>Proficiency with EndNote or equivalent.</li>\n</ul>\n<u>Compensation/Targeted Bonus</u>\n<ul>\n<li>Competitive Annual Salary</li><li>Targeted Annual Bonus</li><li>Relocation assistance available for those who qualify.</li>\n</ul>\n<u>Benefit Summary</u>\n<br><br>\n<em>Our company offers very competitive compensation and benefit plans, including:</em>\n<ul>\n<li>401(k) plan that offers opportunity to save on pre- and post-tax basis up to 50 percent of eligible compensation. Company matches 100 percent of employee pre-tax/Roth (401k) contributions up to six percent</li><li>Comprehensive health- and welfare-benefits package</li><li>Eleven paid company holidays annually, plus a generous paid vacation plan based on length of service</li><li>Company-paid sick and personal days, funeral leave and jury duty leave</li><li>Confidential personal financial counseling service</li><li>On-site health clinics and fitness centers</li><li>A matching grants program that enables employees to direct and double their donations to qualifying charitable organizations of their choice</li><li>Health-care advocacy service</li><li>Volunteer service opportunities</li><li>Federal credit union membership through Allegacy Federal Credit Union</li><li>Extensive training opportunities</li>\n</ul>\n<strong>ABOUT OUR ORGANIZATION:</strong>\n<br><br>\nReynolds American Inc. is an indirect, wholly owned subsidiary of British American Tobacco p.l.c., and the U.S. parent company of R. J. Reynolds Tobacco Company; Santa Fe Natural Tobacco Company, Inc.; American Snuff Company, LLC; Niconovum USA, Inc.; Niconovum AB;R. J. Reynolds Vapor Company; Lorillard Licensing Company, LLC; and Reynolds Brands, Inc..\n<br><br>\nReynolds American Inc. and its affiliated companies is an Equal Opportunity / Affirmative Action Employer.\n<br><br>\n<strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.</strong>\n<br><br>\nOur organization offers a level of challenge, responsibility and creativity for motivated employees that stands apart from the crowd.\n<br><br>\nWe are also committed to employing a diverse workforce and valuing different perspectives, experiences and talents to maximize the company's potential for successfully achieving its business objectives.\n<br><br>\n-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n<br><br>\n<strong><u>Only</u></strong> applicants requiring reasonable accommodation for any part of the application and hiring process should contact us directly.\n<br><br>\nTelephone: 262-###-####\n<br><br>\nEmail: ...@RJRT.com<br><br>Associated topics: biopharmaceutical, cytometry, disease, nephrology, patient, physiologist, protein, therapeutic, toxicologist, trauma"}