{"job title": "Medical Laboratory Scientist", "company": "Samaritan Health Services", "city state": "– Corvallis, OR", "rating": "3.6", "job description": "<div>\n<div>\n\n\n<ul>\n\n \n<li>\n <div>\n<strong>JOB SUMMARY/PURPOSE</strong></div>\n\n\n<ul>\n\n \n<li>\n <div>\nProvides safe, effective, quality medical laboratory services to infant, pediatric, adult and geriatric patients in accordance with professional standards. Performs analyses that require a complex network of steps and variables. Confirms and verifies results through an in-depth knowledge of techniques, principles and instruments. Correlates and interprets data based on knowledge of physiological conditions affecting test results. Establishes and monitors quality assurance programs.</div></li>\n\n\n</ul>\n\n </li>\n<li>\n <div>\n<strong>DEPARTMENT DESCRIPTION</strong></div>\n\n\n<ul>\n\n \n<li>\n <div>\nThe laboratory teams at Samaritan Health Services have responsibilities for testing samples that may include blood, body fluids and tissue to aid in diagnosis of diseases, illnesses or conditions that may need medical attention. Lab tests are processed for hospital inpatients and emergency room patients twenty four hours a day. In addition, testing is performed on outpatient and clinic specimens. All Samaritan Health Services labs are licensed by the U.S. Centers for Medicare and Medicaid Services - the Clinical Laboratory Improvement Amendments Act (CLIA), and accredited by the College of American Pathologists (CAP).</div></li>\n\n\n</ul>\n\n </li>\n<li>\n <div>\n<strong>EXPERIENCE/EDUCATION/QUALIFICATIONS</strong></div></li>\n\n\n</ul>\n\n<ul>\n\n \n<li>\n Candidates must be actively following or have completed a Medical Laboratory Scientist approved route to meet eligibility criteria for certification. ASCP, AMT or equivalent certified Medical Laboratory Scientist required within six (6) months of hire.</li>\n\n\n<li>\n Microbiology experience highly preferred.</li>\n</ul>\n\n<ul>\n\n \n<li>\n <div>\n<strong>KNOWLEDGE/SKILLS/ABILITIES</strong></div>\n\n\n<ul>\n\n \n<li>\n <div>\nAnalytical/Problem Solving Skills – Ability to collect and analyze data and other information, solve problems and make decisions while using clear and logical steps.</div></li>\n\n\n<li>\n <div>\nClinical Laboratory Technology - Working knowledge in areas of laboratory medicine and technology including clinical chemistry, hematology, immunology, microbiology and molecular biology.</div></li>\n\n\n<li>\n <div>\nQuality Assurance Fundamentals – Basic knowledge and understanding of clinical quality assurance and quality control techniques and activities.</div></li>\n\n\n<li>\n <div>\nCompliance Monitoring – Ability to monitor performance of self, other individuals and processes by applying knowledge of established performance standards from regulatory agencies as well as employer and understanding regulatory licensure and conditions.</div></li>\n\n\n<li>\n <div>\nCustomer Service – Knowledge of principles and processes for providing customer service within the healthcare community. This includes customer needs assessment, meeting quality standards for services and evaluation of customer satisfaction.</div></li>\n\n\n<li>\n <div>\nTraining and Education – Ability to communicate technical concepts and to make presentations and demonstrations to customers and new employees.</div></li>\n\n\n</ul>\n\n </li>\n<li>\n <div>\n<strong>PHYSICAL DEMANDS</strong></div>\n\n\n<ul>\n\n \n<li>\n <div>\n<div><strong>Rarely</strong>\n<br>\n(1 - 10% of the time)\n<br><br>\n<strong>Occasionally</strong>\n<br>\n(11 - 33% of the time)\n<br><br>\n<strong>Frequently</strong>\n<br>\n(34 - 66% of the time)\n<br><br>\n<strong>Continually</strong>\n<br>\n(67 – 100% of the time)</div> <div>WALK - INCLINE\n<br><br>\nCLIMB - LADDER\n<br><br>\nLIFT (Floor to Waist: 0\"-36\") 0 - 20 Lbs\n<br><br>\nLIFT (Floor to Waist: 0\"-36\") 20 - 40 Lbs\n<br><br>\nLIFT (Knee to chest: 24\"-54\") 0 – 20 Lbs\n<br><br>\nLIFT (Waist to Eye: up to 54\") 0 - 20 Lbs\n<br><br>\nCRAWL (hands &amp; knees)\n<br><br>\nCARRY 1-handed, 20 - 40 pounds\n<br><br>\nCARRY 2-handed, 40 - 60 pounds\n<br><br>\n<strong>CARRY 1-handed, 0 - 20 pounds</strong>\n<br><br>\nBEND FORWARD at waist\n<br><br>\nKNEEL (on knees)\n<br><br>\nSQUAT Static (hold &gt;30 sec)\n<br><br>\nSQUAT Repetitive\n<br><br>\nCLIMB - STAIRS\n<br><br>\nPUSH (0 - 20 pounds force)\n<br><br>\nPULL (0 - 20 pounds force)\n<br><br>\nROTATE TRUNK Standing\n<br><br>\nREACH - Upward\n<br><br>\nSIT\n<br><br>\nSTAND\n<br><br>\nWALK – LEVEL SURFACE\n<br><br>\nCARRY 2-handed, 0 - 20 pounds\n<br><br>\nCARRY 2-handed, 20 - 40 pounds\n<br><br>\nROTATE TRUNK Sitting\n<br><br>\nREACH - Forward\n<br><br>\nPINCH Fingers\n<br><br>\nGRASP Hand/Fist\n<br><br>\nMANUAL DEXTERITY Hands/wrists\n<br><br>\nFINGER DEXTERITY</div> </div>\n</li>\n\n\n\n</ul>\n\n </li>\n</ul>\n\n </div>\n</div>\n<br>"}