{"job title": "Operations Research Scientist", "company": "Staples", "city state": "– Framingham, MA", "rating": "3.1", "job description": "Description\n<br><br>\nWe collaborate and innovate\n<br><br>\nOur North American Supply Chain network brings technology and people together in innovative ways to deliver stateoftheart products, services, and expertise. Our extensive portfolio of opportunities span from traditional inventory, fulfillment and delivery to specialized strategy, automation, engineering, analytics, leadership, and logistics. Our diverse network paired with a continued commitment to and investment in our people, process, platforms and the communities in which we live and serve are the foundation on which we build our bright future.\n<br><br>\nIf you are interested in leveraging your talents to drive innovation, customer satisfaction, market growth, personal development and industry change in a dynamic team work environment---please explore the opportunities within our world class Supply Chain team!\n<br><br>\n<strong>Position Summary</strong>\n<br><br>\nThe Scientist is responsible for applying advanced analytical methods to drive business-critical decisions at Staples. Using mathematical optimization, statistical analysis and machine learning the individual plays a key role in supporting the development of state-of-the-art solutions to complex decision-making problems.\n<br><br>\nThese problems will come from all parts of the Staples Supply Chain and will include challenges like:\n\n\n<ul>\n<li>Developing and implementing vehicle routing algorithms to optimize last mile parcel delivery and build optimization models to support the development of an international transportation network using multiple modes including Truck load, LTL and ocean freight</li>\n<li>Developing demand prediction models to estimate transportation and labor capacity and build scheduling tools to support improvements in delivery speed and customer service while driving growth and increase profitability</li>\n<li>Building and deploying algorithms that reduce order fulfilment costs across the Staples warehouse and transportation network through robotic automation, process control, and capacity optimization</li>\n</ul>\n\nPrimary Responsibilities\n\n\n<ul>\n<li>Work closely with key business partners to understand critical, complex, data-driven business and operations challenges, and then apply analytical methods to solve them resulting in a significant, positive impact on the Staples' bottom-line.</li>\n<li>Research, design, and implement data models and innovative algorithms to analyze diverse sources of data to realize actionable results</li>\n<li>Communicate results to executive leadership</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\n<strong>Basic:</strong>\n\n\n<ul>\n<li>PhD in Computer Science, Statistics, Operations Research, Applied Mathematics, Applied Physics or related field, plus 1-3 years industry experience</li>\n<li>Hands-on experience with mathematical modeling, and mathematical optimization techniques and technologies as well as advanced machine learning, data mining, statistical inference</li>\n<li>Hands-on experience with querying databases in order to drive required analysis independently and swiftly</li>\n<li>Excellent ability to communicate complex quantitative analysis in a clear, precise, and actionable manner with both technical and non-technical stakeholders.</li>\n<li>Keen attention to detail, and ability to dive deep</li>\n</ul>\n\nPreferred\n\n\n<ul>\n<li>Experience developing large scale systems using parallel and distributed computing</li>\n<li>Experience working with development tool sets such as Spark, Hadoop, Python, C++, Java, R, H2O, Shiny, Docker, MYSQL, Teradata, NOSQL, etc.</li>\n<li>Experience using deterministic and non-deterministic mathematical programming, constraint satisfaction, advanced supervised and unsupervised learning techniques, natural language processing, robotics, markov decision process, and control theory</li>\n<li>Experience with various areas of the supply chain such as customer order, inventory, warehouse, and transportation management</li>\n<li>Experience with financial modelling</li>\n</ul>\n\nAdditional Requirements\n\n\n<ul>\n<li>The ability to think big, manage ambiguity to move quickly and deliver results in an entrepreneurial environment</li>\n<li>Fearless but thoughtful in their pursuit of results</li>\n<li>Flexible and resourceful, and easily adaptable to changes in environment and prioritization</li>\n<li>Possess excellent business judgment, and a practical, common-sense approach to getting things done</li>\n</ul>\n\nStaples is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other basis protected by federal, state, or local law.\n<br><br>\nStaples"}