{"job title": "eCommerce SMART Data and Analytics Manager", "company": "Unilever", "city state": "– United States-Seattle", "rating": "3.9", "job description": "<div> </div><div><div>About half of all purchase decisions are digitally influenced. The ability to link any digital moment right through to purchase in the Connected World, means that data becomes key to unlocking new growth opportunities. Unilever e-commerce sales will depend heavily on influencing shoppers to start shopping online shop more frequently, make larger purchases, and to buy from a broader array of Unilever categories.</div><div> </div><div>The objective of SMART DATA is to enable Unilever business teams to create a mutually profitable and high-growth business with ecommerce retailers.</div><div> </div><div>You must have a passion, proven credentials of driving “data driven” growth and are able to get into the details of the analysis. You will work closely with a team of data scientists and technology teams. This is a great opportunity for someone, who wants to be a part of an aggressive data-driven growth agenda, leveraging latest capabilities of machine learning, Robotic process automations and Artificial Intelligence to make a big impact and leave a positive legacy for Unilever.</div><div> </div><div>Still interested? This is a great job because,</div><div> </div><ul><li><b>Your mantra is “data driven” growth</b>: you believe that data is the Unilever’s biggest asset - it drives growth, transforms companies and the biggest bet against disruption. You will need to</li><ul><li>Get into the details of data , basic modelling and forecasting</li><li>Develop performance management systems ( BI) and analytics for <b>“speed &amp; growth”</b></li><li>Automate and scale with IT teams</li></ul><li><b>You are passionate about ecommerce:</b> You believe that eCommerce is not only transforming the way people shop and interact with our brands, it’s an influential media vehicle and future path breaking capabilities.</li><li><b>You are a self-starter:</b> you love working with ambiguity, developing new solutions and challenging the immune systems within corporation.</li><li><b>You love building out your own analytics “apps”: </b>You are not happy with black boxes or check boxes – you like to create your own applications using visual analytics, modelling and technology. You love to invent, simplify and automate.</li><li><b>You are a teacher, a guru:</b> you can make the most complex things easy to understand, you love training people on new techniques and tools.</li></ul><div> </div><div><b> You know if it’s not real-time it’s probably too late:</b> You believe in process automation, assisted and predictive decision making</div><div><b> </b></div><div><b>Responsibilities</b></div><div> </div><div>Creating &amp; managing \"Performance Management\" systems for Amazon , Walmart.com <br>- Innovations on data driven investment optimisation &amp; operational efficiency (availability)</div><div>- Embedding /management of SMART DATA analytics tools</div><div>- Ongoing evolution &amp; embedding of data tools for US amazon team<br>- Developing Machine Learning solutions with external vendors &amp; CD –IT</div><div>- Collaborates with e-com Category Management Teams<br>- Works with the Global SMART DATA teams to contribute to learning networks</div><div> </div><div><b> </b></div><div><b>Candidate profile</b><br>the candidate must have an excellent understanding of analytical including data management, forecasting, optimization, predictive modelling, and visualization. Appreciation of machine learning is a positive.</div><ul><li>Understanding of ecommerce shopper journey – demand creation through media, demand capture, winning portfolio and demand fulfilment.</li><li>In the past has worked with analytics agencies, eCommerce business teams to deliver analytics solutions.</li><li>Good understanding of financial metrics, pricing , ROI and promo evaluations</li><li>Working understanding of IT data warehousing and data sources along with experience in marketing automation.</li><li>Working knowledge of digital media, search and investment optimization</li></ul><div><b> </b></div><div><b>Qualifications: </b></div><ul><li>7 years of experience of statistical modelling, creating analytics frameworks for retail or ecommerce.</li><li>Analytics managers in large retail , CPG companies or ecommerce data consultancies <br></li></ul><div><br></div><div><div> </div><div><b>Culture for Growth</b><b> | </b><b>Top Notch Employee Health &amp; Well Being Benefits</b><b> | </b><b>Every Voice Matters</b><b> | </b><b>Global Reach</b><b> | </b><b>Life at Unilever</b><b> | </b><b>Careers with Purpose</b><b> | </b><b>World Class Career Development Programs</b><b> | </b><b>Check Out Our Space</b><b> | </b><b>Focus On Sustainability</b></div><div> </div><div> </div><div>Unilever is an organization committed to diversity and inclusion to drive our business results and create a better future every day for our diverse employees, global consumers, partners, and communities. We believe a diverse workforce allows us to match our growth ambitions and drive inclusion across the business.</div><div> </div><div>Equal Opportunity/Affirmative Action Employer Minorities/Females/Protected Veterans/Persons with Disabilities</div><div> </div><div>Applicants and employees are protected from discrimination under Federal law. For more information, please see EEO is the Law</div><div><br></div></div></div><br>"}