{"job title": "Bioinformatics Scientist - Primer Design", "company": "Volt Workforce Solutions", "city state": "– South San Francisco, CA", "rating": "3.1", "job description": "Bioinformatics Scientist - Primer Design in South San Francisco, CA at Volt\n<br><br>\n# Date Posted: _8/6/2018_\n<br><br>\n# Job Snapshot\n<br><br>\n+ **Employee Type:** Contingent\n<br><br>\n+ **Location:** South San Francisco, CA\n<br><br>\n+ **Job Type:** Scientific/Biotech\n<br><br>\n+ **Duration:** 36 weeks\n<br><br>\n+ **Date Posted:** 8/6/2018\n<br><br>\n+ **Job ID:** 128378\n<br><br>\n+ **Contact Name** Volt Branch\n<br><br>\n+ **Phone** 714-921-7460\n<br><br>\n# Job Description\n<br><br>\nCandidate will be responsible for primer design for the development of targeted sequencing panels, pipelines and algorithms for the next-gen DNA sequencing.\n<br><br>\n<strong># Responsibilities:</strong>\n<br><br>\n+ Develop, maintain, and operate bioinformatics pipelines for assay design, data mining and analysis\n<br><br>\n+ Design assays for custom targeted sequencing panels for external and internal researchers\n<br><br>\n+ Understand the core scientific questions and design assays to best address these questions.\n<br><br>\n+ Collaborate closely with the molecular biologists, product management, sales, experimental researchers and other members of the Bioinformatics team\n<br><br>\n# Skills/Knowledge Requirements\n<br><br>\n+ Experience working and developing bioinformatics production systems.\n<br><br>\n+ **The following are also required:** hands-on experience with the relevant sequence analysis tools (e.g. Blast, Clustalw, bowtie, etc.)\n<br><br>\n+ The candidate must have experience in Perl / Python programming, shell scripting and SQL.\n<br><br>\n+ This position requires the knowledge and skills normally acquired through completion of a MS/PhD in Bioinformatics, Computational Biology, Computer Science, Genomics or related field. Three years of relevant working experience is required.\n<br><br>\n# Volt is an equal opportunity employer\n<br><br>\nIn order to promote this harmony in the workplace and to obey the laws related to employment, Volt maintains a strong commitment to equal employment opportunity without unlawful regard to race, color, national origin, citizenship status, ancestry, religion (including religious dress and grooming practices), creed, sex (including pregnancy, childbirth, breastfeeding and related medical conditions), sexual orientation, gender identity, gender expression, marital or parental status, age, mental or physical disability, medical condition, genetic information, military or veteran status or any other category protected by applicable law."}