{"job title": "Software Engineer, Data Team (Python)", "company": "Yummly", "city state": "– Redwood City, CA", "rating": "4.6", "job description": "Born from the belief that great things come to those who cook, Yummly provides limitless inspiration, with the tools to make it happenfrom recipe discovery to prep to perfect results. Just as appliances removed the most cumbersome chores, the next tipping point in daily life is upon us in the food space. A system of personalized discovery that learns you better to serve you better, so the question \"what's for dinner?\" is answered before it's even asked.\n<br><br>\nYummly has grown to over 29M registered users and our mobile apps are consistently the #1 recipe apps on iPhone, iPad, Android, and Windows. Next on the menu? Building the connected kitchen of the future.\n<br><br>\n<strong>As a Software Engineer, you will:</strong>\n\n\n<ul>\n<li>Work with our small but powerful team of scientists and developers, building the most advanced ML-powered software in the kitchen</li>\n<li>Build and maintain backend systems for content understanding, search, personalization, computer vision, and tracking user behavior</li>\n</ul>\n\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>Demonstrated experience building and shipping production software</li>\n<li>Expertise in Python</li>\n<li>A collaborative attitude and strong desire to succeed as part of the team</li>\n<li>Self-motivation and a desireto learn</li>\n</ul>\n\n<strong>Bonus:</strong>\n\n\n<ul>\n<li>A strong interest in functional programming</li>\n<li>Experience with TensorFlow, Caffe, Torch, scikit-learn</li>\n<li>Interest in or experience with ML, deep learning, NLP, search, computer vision, or recommendation systems</li>\n<li>Experience with AWS or GCP</li>\n</ul>\n\n<strong>And a little more about us:</strong>\n<br><br>\nAt Yummly, we are a team of talented and diverse technology professionals on a mission to rule the kitchen. We've seen great success using machine learning and artificial intelligence to make cooking fun, easy, and personalized. Our iOS and Android apps have 4.5+ star reviews, millions of downloads, and many awards (download and give it a try!).\n<br><br>\nWe were recently acquired by Whirlpool, the world's largest home appliance maker. Together, we have appetizing aspirations to build the fully-connected kitchen of the future.\n<br><br>\nWe're located in a beautiful, modern office in downtown Redwood City, a few minutes' walk from Caltrain. Please talk to us if you have a love for data, hard problems, and food!"}