{"job title": "Data Analyst", "company": "Alaka`ina Foundation", "city state": "– ", "rating": "3.8", "job description": "<div><div><div>\n\n \n\n</div>\n\n<strong>\nData Analyst\n</strong>\n<div>\n<div>\n\nLocation\n\n<strong>\nUK-Lakenheath RAB\n</strong>\n</div>\n<div>\n\nJob Code\n\n<strong>\n4109\n</strong>\n</div>\n<div>\n\n# of openings\n\n<strong>\n1\n</strong>\n</div>\n</div>\n</div>\n\nApply Now\n</div>\n<div><p>The Alaka`ina Foundation Family of Companies (FOCs) is comprised of industry-recognized government service firms designated as Native Hawaiian Organization (NHO)-owned and 8(a) certified businesses. The Family of Companies (FOCs) includes Ke`aki Technologies, Laulima Government Solutions, Kūpono Government Services, and Kāpili Services. Alaka`ina Foundation activities under the 501(c)3 principally benefit the youth of Hawaii through charitable efforts which includes providing innovative educational programs that combine leadership, science &amp; technology, and environmental stewardship.</p>\n<p>Laulima Government Solutions is looking for qualified Data Analysts to provide Advisory and Assistance Services (A&amp;AS) to a Department of Defense (DoD) medical agency. Support with include data analysis and compliance services, collecting external workload, analyzing clinical currency obtained, investment cost of participating in agreements, and providing detailed analyses to appropriate customers. Data analysts will be placed at regional areas across the medical service where there is a high volume of clinical currency being obtained at civilian and VA hospitals. A Data Analyst will be required for each of the following locations: San Antonio, Texas (TX); Suffolk, United Kingdom (UK); Hampton, Virginia (VA); Tampa, Florida (FL); Las Vegas Valley, Nevada (NV); Solano County, California (CA); University of Alabama; and Greene County, Ohio (OH). </p>\n<p>Data Analysts will:</p>\n<p>· Collect all procedures being performed at the civilian facilities by military providers/surgeons, coordinating with clinical coding to list applicable current procedural terminology (CPT) codes, document the </p>\n<p>​ information on the External Workload Capture Form, and submit monthly to the customer </p>\n<p>· Coordinate with the civilian facility business office to establish a workflow to receive workload performed by military providers/surgeons monthly </p>\n<p>· Coordinate with the military providers/surgeons working at civilian facilities to collect data monthly</p>\n<p>· Coordinate with clinical coding to receive associated CPT codes for all of the providers/surgeons procedures</p>\n<p>· Document all information collected on the customer’s External Workload Capture Form and submit to the customer no later than (NLT) the 15th of the following month</p>\n<p>· Coordinate with the Resource Management Office (RMO) to determine the workspace within the treatment facility</p>\n<p>· Ensure labor hours are correctly reported in Defense Medical Human Resources System internet (DMHRSi) for support to the treatment facility as indicated by the RMO staff</p>\n<p>· Coordinate between the providers/surgeons working at the civilian facility and the RMO staff to ensure labor hours are reported accurately in DMHRSi</p>\n<p>· Handle multiple projects and appropriately prioritize tasks to meet deadlines</p>\n<p><strong><u>Degree/Education/Certification Requirements:</u></strong></p>\n<p>· Minimum of an Associate’s Degree in a business or related field (e.g. business management, computer information systems, healthcare, and health management)</p>\n<p><strong><u>Required Skills and Experience:</u></strong></p>\n<p>· Must be able to communicate the English language clearly, both orally and in writing</p>\n<p>· Demonstrated experience prioritizing and multitasking to meet deadlines, as required </p>\n<p>· Demonstrated knowledge and understanding of Military Health System (MHS) guidelines</p>\n<p>· Must have a Tier 1 investigation accomplished prior to beginning work</p>\n<p><strong><em>We are an Equal Opportunity/Affirmative Action Employer of individuals with disabilities and veterans. We are proud to state that we do not discriminate in employment decisions on the basis of race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status. If you are a person with a disability and you need an accommodation during the application process, please click here to request accommodation. We E-Verify all employees.</em></strong></p></div>"}