{"job title": "Data Analyst", "company": "Aramark Corporation", "city state": "– Chicago, IL", "rating": "3.0", "job description": "Overview\n<br><br>\nAbout AramarkAramark (NYSE: ARMK) proudly serves Fortune 500 companies, world champion sports teams, state-of-the-art healthcare providers, the world's leading educational institutions, iconic destinations and cultural attractions, and numerous municipalities in 19 countries around the world. Our 270,000 team members deliver experiences that enrich and nourish millions of lives every day through innovative services in food, facilities management and uniforms. We operate our business with social responsibility, focusing on initiatives that support our diverse workforce, advance consumer health and wellness, protect our environment, and strengthen our communities. Aramark is recognized as one of the World's Most Admired Companies by FORTUNE, as well as an employer of choice by the Human Rights Campaign and DiversityInc. Learn more at www.aramark.com or connect with us on Facebook and Twitter.\n<br><br>\nDescription\n<br><br>\nThe Data Analyst will Identify and assess the service/administrative process needs for the Office of Nutrition Support Services.\n<br><br>\n<strong>POSITION EXPECTATIONS:</strong>\n\n\n<ul>\n<li>Develop and maintain the appropriate administrative systems as needed for each CPS location</li>\n<li>Managing information supporting food service deliverables / requests including but limited to location information, menu tracking, service models, and location specific dining programs</li>\n<li>Primary operational interface with procurement and nutritional team supporting District Managers</li>\n<li>Prepare monthly operational reports for DMs / client including dining KPI's&amp;SLA's</li>\n<li>Develop and maintain CPS labor coverage tracking process. Provide weekly updates to DMs / senior management</li>\n<li>Providing payroll / management scheduling support to District managers</li>\n</ul>\n\n<strong>POSITION DUTIES:</strong>\n\n\n<ul>\n<li>Position requires ability to work effectively with senior management, strong managerial, project management and people skills, solid judgment and tact in engaging with client and Aramark staff.</li>\n<li>Strong communication skills (written and verbal).</li>\n<li>Collaborate with procurement / nutrition teams on integrated business process and application systems.</li>\n<li>Perform work efficiently and effectively in accordance with established policies and procedures; document procedures performed; exercise judgment and creativity when performing support that is not guided by established polices; drafts comprehensive and meaningful weekly reports.</li>\n<li>System reviews, including recommendations for improvements, to the appropriate levels of management; effectively communicate to emphasize the value of the analytic findings facilitating quality work / efficiency.</li>\n<li>Requisition necessary IT services from CPS IT or Aramark Corporate IT as appropriate.</li>\n<li>Monitor the implementation and ongoing administration of FM / FS QA process.</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\n<strong>QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>Must have at least five years of progressive experience, with at least two years in project/administrative management, and a strong background in Information Systems, standards and process development</li>\n<li>Candidates must have strong experience and a working knowledge of administrative system development, project management, standards and operating systems</li>\n<li>This position requires a Bachelor's degree</li>\n<li>Ability to analyze and integrate operational and administrative processes and apply</li>\n<li>Ability and willingness to train on-site teams on system use</li>\n<li>Strong organization skills and ability and willingness to document process improvements</li>\n<li>Professional attitude, comfortable working in a rapidly changing environment</li>\n<li>Flexibility and the willingness and ability to perform a diverse array of tasks</li>\n<li>Self-motivated and self-directed, requiring a low-level of direct supervision to accomplish responsibilities.</li>\n<li>Ability to travel to various client sites within the city of Chicago</li>\n<li>All Windows Platforms: MS Outlook, Office Products</li>\n<li>Knowledge of wireless technologies</li>\n<li>K-12 food service expereince strongly preferred</li>\n</ul>"}