{"job title": "Data Analyst", "company": "Asembia", "city state": "– Florham Park", "rating": "2.9", "job description": "For more than a decade, Asembia** has been working with specialty pharmacies, manufacturers, prescribers, payers and other industry stakeholders to develop solutions for the high-touch specialty pharmaceutical service model.\n<br><br>\nThrough collaborative programs, contracting initiatives, patient support hub services and innovative technology platforms, Asembia is committed to positively impacting the patient journey.\n<br><br>\nAsembia** focuses on the specialty pharmacy segment and offers comprehensive hub services, pharmacy network management, group purchasing (GPO) services, innovative technology platforms and more.\n<br><br>\nAs a leading industry voice and advocate, Asembia is committed to bringing strategic channel management solutions, leading-edge products and high-touch services to the specialty pharmacy industry that help our customers optimize patient care and outcomes.\n<br><br>\n<strong>Primary Function</strong>:\n<br>\nWe are hiring a Data Analyst to join our Enterprise Data Management team in our Florham Park, NJ headquarters to be the dedicated analyst to support the day to day operations and provide business intelligence for a pharmaceutical manufacturer program. This role is responsible for the data aggregation, data quality, reporting and trending to understand the program performance and patient journey. The ideal candidate should be highly analytical and have a strong technical skill-set, with solid experience in a data extraction language (such as SQL).\n<br><br>\n<strong>Responsibilities</strong>:\n\n\n<ul>\n<li>Design, develop and validate standard processes, data infrastructure, operational best practices to support program data aggregation and reporting requirements- Analyze data, identify trends, implement optimizations on a day to day basis, building dashboards and delivering timely reports to support analyses- Evaluate data and report findings for accuracy, completeness, scope; ability to provide reasoning for data variations. Support pharmaceutical manufacturer client on data needs and insights- Responsible for data aggregation from different data sources for report generation. Identify, investigate, and resolve data anomalies using SQL or other statistical analysis software. Monitor and process daily reporting and trending needs for the program. Ensure that Asembias data reports meet program requirements and are delivered in a timely manner by making necessary changes to improve data accuracy. Successful collaboration with other Asembia team members to attain a common goal. Mentor/train other junior level staff. Compliance with the provisions of the Health Insurance Portability and Accountability Act of 1996 and its implementing regulations, as amended (HIPAA).\n<br><br>\n<strong>Qualifications</strong>:</li>\n<li>Bachelors Degree required. B.A./B.S. Information Systems or similar field preferred. Minimum 5 years of experience working with pharmaceutical data in a team-driven environment. 1-2 years of programming or system integration experience. Ability to work with programmers to communicate application issues and work through resolution. Must have advance level skills in developing solutions using SQL and SSIS. Proven track record with taking ownership of data investigations, understand interdependencies within data and seeing them through to resolution, preferably using SQL. Basic knowledge of data visualization using tools like Tableau. Ability to evaluate insights from data analysis and suggest data process improvements. Ability to manage multiple initiatives in a fast paced, dynamic environment. Strong self-starter with a sense of ownership. Excellent organizational and collaboration skills.</li>\n</ul>\n\nAsembia is committed to Equal Employment Opportunity (EEO) and to comply with all Federal, State and local laws that prohibit employment discrimination on the basis of race, color, age, national origin, religion, gender, gender identity, sexual orientation, pregnancy, marital status, genetic disposition, disability, veteran's status or any other classification protected by State/Federal laws."}