{"job title": "Data Analyst", "company": "Benaiah Consulting Group", "city state": "– Kingwood, TX", "rating": "NA", "job description": "Benaiah Consulting Group is a 13-year-old specialty recruiting firm with an established track-record of success partnering with consulting firms and accounting firms to secure excellent Top-Shelf talent to assist in their growth. We are currently partnering with a consulting firm that has built a solid reputation within their space and is looking to get to the next level. Our client is seeking a qualified Data Analyst to assist in that process who has:\n\n<ul>\n<li>2+ years experience working with Big Data projects</li>\n<li>Prior experience working in a similar analytical role with some exposure to financial data/tax data would be a plus</li></ul>\n\n\n<ul>\n<li>Bachelor's degree in a business field</li>\n<li>Programming abilities would be a plus</li>\n</ul>\nThis role will support a team of consultants and contribute directly to the analytics on which many of the key decisions are made in respect to customer exposure pertaining to transactional tax implications. The focus of this position is on the development of analytics infrastructure and model implementation and requires a strong technical skill set. The position will also include work with large data sets from customers that must be sorted and drilled into to draw relevant conclusions as it pertains to financial exposure on each transaction.\n<br><br>\nThis position will interface consistently with the firm's senior leadership and will offer an exceptional opportunity to help set direction for the future growth of the company.\n<br><br>\nIf you have been seeking an opportunity that would allow you a foot-in-the-door to one of Houston's leading consulting firms that values bright minds with exceptional work-ethics, coupled with an employee and family-friendly work environment, then you owe it to yourself to explore this opportunity by reaching out to one of our recruiters ASAP. Our client is looking to have new \"boots on the ground\" no later than mid-October!"}