{"job title": "Sr. Risk Data Analyst", "company": "Bill.com", "city state": "– Palo Alto, CA, United States", "rating": "4.3", "job description": "<strong>About Bill.com</strong>\n<br><br>\nBill.com is the leading business payments network, with 3 million members paying and getting paid over $52 billion per year. Bill.com saves companies more than 50% of the time typically spent on financial back-office operations and helps businesses get paid 3 - 4 times faster by automating end-to-end payment processes. The company is the choice of 4 of the top 10 U.S. banks; leading accounting software providers QuickBooks Online and Xero; and over 50 percent of the top 100 U.S. accounting firms. It is the only business payments solution endorsed by the American Institute of CPAs (AICPA). The recipient of more than 70 awards, Bill.com proudly received multiple PC Magazine's Editor's Choice Awards and CEO René Lacerte was recently recognized as an E&amp;Y Entrepreneur of the Year.\n<br><br>\n<strong>Mission:</strong>\n<br><br>\nWe are looking for a talented, enthusiastic and dedicated person to join Bill.coms Risk Management team. The incumbent will be responsible for leading key projects associated with predictive fraud detection, risk modeling and loss mitigation at Bill.com. This position requires a person who has experience with performing analytics, refining risk strategies and developing predictive algorithms preferably in risk domain.\n<br><br>\n<strong>Professional Experience/Background to be successful in this role:</strong>\n<ul>\n<li>Minimum 2 years of industry experience in risk analytics, data analysis or data science</li><li>An advanced degree (M.S., PhD.), preferably in Statistics, Physical Sciences, Computer Science, Economics, or a related technical field</li><li>Experience using statistics and machine learning to solve complex business problems</li><li>Proficiency in SQL, Python and/or R including key data science libraries</li><li>Experience working with large datasets</li><li>Ability to clearly communicate complex results to technical experts, business partners, and executives</li><li>Comfortable with ambiguity and yet able to steer analytics projects toward clear business goals, testable hypotheses and action-oriented outcomes</li><li>Desirable to have experience and aptitude solving problems related to risk using data science and analytics</li><li>Bonus: experience with AWS</li> \n</ul>\n<strong>Competencies (Attributes needed to be successful in this role):</strong>\n<ul>\n<li>Functional/Technical Expertise</li><li>Learning Abilities/Tech Savvy</li><li>Communication</li><li>Team Player</li>\n</ul>\n<strong>Expected Outcomes:</strong>\n<ul>\n<li>Build and productionalize fraud detection algorithms by utilizing advanced statistical modeling, machine learning, or other data mining techniques</li><li>Utilize advanced analytics and data science to build strategies that can address fraud mitigation, customer friction and operations efficiency</li><li>Continuously evolve the strategies and models to improve the performance and detection rates</li><li>Analyze diverse sources of data to achieve targeted outcomes related to anomaly detection and probability of fraud</li><li>Identify and evaluate new data sources to build effective fraud controls for online transactions</li><li>Provide on-going tracking and monitoring of performance of decision systems and statistical models</li><li>Work with product and engineering team to evangelize data best practices and design/implement new analytical systems/frameworks</li><li>Design and measure A/B tests to optimize existing fraud and credit strategies</li>\n</ul>\n<strong>Bill.com Culture:</strong>\n<ul>\n<li>Humble No ego</li><li>Fun Celebrate the moments</li><li>Authentic We are who we are</li><li>Passionate Love what you do</li> <li>Dedicated To each other and the customer</li>\n</ul>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}