{"job title": "Data Analyst", "company": "Calero Software", "city state": "– Rochester", "rating": "2.2", "job description": "Calero Software is seeking a dynamic Data Analyst who will have the primary responsibility of identifying, implementing and managing best practices around obtaining and loading vendor data, with the goal of meeting the business needs of both Calero stakeholders and clients.\n<br><br>\nResponsibilities of this role include, but are not limited to, establishing and maintaining detailed functional requirements (DFRs) for our vendor data and working with the Product team to ensure that best practices are incorporated into our Calero products. This individual will build and maintain successful relationships with our vendors where you will identify and implement the managment of specific vendor data, which could include invoice data, CSRs, MACD details and reports. You will need to assess the quality of vendor data which is used for each client, making sure that Calero is utilizing this data effectively, along with identifying opportunities for new readers and subsequently submit requests for development.\n<br><br>\n<strong>Experience and Skills</strong>:**:\n<br>\nWe ask that you have a Bachelors' Degree in Finance, Business, Mathematics or IT - you may also have the equivalent combination of education and work experience to be considered for this role.\n<br><br>\nTo be successful in this role, you should have 5+ years of experience with telecommunications carrier billing, contracts, tariffs, services/fee structures, CSRs, vendor reporting, vendor portals and other vendor data. An additional 5+ years of experience in relational databases, having thorough knowledge of architecture, management principles and concepts. Finally, you should also possess knowledge in how to create data standards, determine business data requirements and business rules.\n<br><br>\nRequired Technical Knowledge:\n\n<ul>\n<li>Web browsers, web crawlers, FTP, EDI and internet</li>\n<li>Strong SQL skills</li>\n<li>Advanced Excel skills</li>\n<li>Excellent written and verbal communication, alongside interpersonal skills</li>\n<li>Product or Project management is a plus</li>\n</ul>"}