{"job title": "Data Analyst", "company": "CDW", "city state": "– Lincolnshire, IL", "rating": "3.7", "job description": "The Analytics &amp; Insights team is passionate about creating a story out of data, research and insights. This team serves as a source of knowledge of CDW customers, providing research and insights to Sales and Marketing. They develop research and performance analyses to drive strategic decision-making and planning to create more targeted, relevant messaging and improve ROI. They must understand how CDW solutions are applicable in the marketplace and act as the conduit between CDW and its customer-facing leaders for customer, market and competitive intelligence. The Insights team’s outputs is used to help develop marketing contact, channel, and campaign strategies.\n<br><br>\nThis Insights Analyst is responsible for helping support data analysis and insights-based reporting, allowing for improved decision-making for better business outcomes. This coworker enables Insights Managers to share relevant analyses and insights with the Sales organization, empowering their ultimate business decisions.\n<br><br>\nReporting to the Manager of Research &amp; Insights Operations, this coworker will ensure relevant data has been compiled into meaningful dashboards and reports, and is shared with relevant stakeholders within Insights.\n<br><br>\nKey Areas of Responsibility\n\n<ul>\n<li>Compile, prepare, and translate data into simple, high-level information for Insights</li>\n<li>Managers to further analyze, package, and present to internal business leaders as needed.</li> \n\n<li>Design and produce standard reports on a weekly/monthly/quarterly basis and support requests for ad-hoc analysis by the Insights team members.</li> \n\n<li>Complete complex data analysis projects to support various company initiatives.</li> \n\n<li>Evaluate ongoing analytics and insights needs from stakeholders and implement reporting in CDW’s growing automated business intelligence environment.</li> \n\n<li>Support the development of operational metrics to assess and elevate the quality of data and troubleshoot data file related issues.</li> \n\n<li>Assist in finding insights and creating recommendations to be used with customer-facing leaders at CDW.</li> \n\n<li>Support the leveraging of analytics throughout CDW [Sales and PPM, and elsewhere within Marketing] to assess and make strategic recommendations to improve analysis gathering and dissemination.</li> \n\n<li>Establish and maintain strong relationships with key stakeholders across the Analytics &amp; Insights team, as well as other relevant analytics teams across CDW.</li> \n\n<li>Support the evaluation of future analytics needs from Insights stakeholders to optimize future investments and resources.</li>\n</ul>\n<strong>Qualifications</strong>\n<br><br>\nMinimum Qualifications\n\n<ul>\n<li>Bachelor’s Degree and/or Graduate degree with a concentration on Finance, Economics,</li>\n<li>Accounting, Statistics, Mathematics, Computer Science, or Engineering.</li> \n\n<li>2 years of analyst experience with sales analysis, financial analysis, economics, or statistics</li> \n\n<li>Expert-level skills in Microsoft Excel</li> \n</ul>\nOther Required Qualifications\n\n<ul>\n<li>Proficient with Microsoft Office applications: Word, Outlook, and PowerPoint, with explicit proficiency in Excel.</li> \n\n<li>Strong analytical skills. Ability to problem solve independently. Able to analyze large volumes of raw data, package the data for further consumption, draw conclusions, and develop actionable recommendations.</li> \n\n<li>Highly detail-oriented with the ability to work in a fast-paced environment.</li> \n\n<li>Proven ability to identify areas of opportunity for existing practices/processes and execute appropriate improvements.</li> \n\n<li>History of balancing multiple priorities simultaneously with the ability to adapt to the changing needs of the business while meeting deadlines.</li> \n\n<li>Demonstrated experience in leading analytical projects.</li> \n\n<li>Excellent written and verbal communication skills with the ability to effectively interact with and present to all stakeholders.</li> \n\n<li>Demonstrated ability to work independently with little direction.</li> \n\n<li>Track record of building and maintaining strong working relationships.</li> \n</ul>\nPreferred Qualifications\n\n<ul>\n<li>3 years of analytics experience, including but not limited to: Customer analytics, marketing analysis, database marketing, marketing automation, market research, sales analysis, financial analysis, economics, or statistics.</li> \n\n<li>Cognos, Pyramid, ProClarity, or other analytical or business intelligence tool experience.</li> \n\n<li>Data warehouse experience.</li> \n\n<li>Relational database experience, such as SQL or SAS a strong plus.</li> \n\n<li>Tableau experience a strong plus.</li> \n\n<li>Project management experience.</li>\n</ul>"}