{"job title": "Data Analyst, Business Operations", "company": "DataRobot", "city state": "– Boston, MA", "rating": "4.4", "job description": "Being scientific is one of the core values in DataRobot.\n<br><br>\nYou will work with the team of data scientists, software engineers, and business analysts to measure, report on, and optimize processes within the company. You will have to understand how teams operate and what data they need to be more effective. The results of your research will be used to scale the company and maintain operational excellence.\n<br><br>\nWe don't care where you went to school. We are looking for a person who is smart, able to learn fast and solve any problems that come their way without much guidance.\n<br><br>\nYour first responsibility will be to help HR team with driven insights from data. This includes collecting, tabulating and evaluating the data; preparing summaries of data analyzed utilizing charts, graphs and tables to represent data; and compiling statistical data to assist in compliance deficiencies addressed in meetings.\n<br><br>\nDataRobot helps businesses across the world apply data science and machine learning in every part of their organization. This is an unique opportunity to learn from the best while working on the data science projects with the real-world impact.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Research the data and build actionable visualizations/reports that drive decisions (60%)</li>\n<li>Collect the data required to extract actionable insights (30%)</li>\n<li>Look for more data science use cases inside the company (10%)</li>\n</ul>\n<strong>Requirements</strong>\n\n<ul>\n<li>Working knowledge of SQL, Python or other scripting languages;</li>\n<li>At least 2 years of experience doing similar job independently, without supervision.</li>\n<li>Working knowledge of statistical learning.</li> \n\n<li>Knowledge of tools required to extract, transform and visualize data (Tableau, Chart.io).</li>\n<li>Ability to write code for collecting and transforming data.</li>\n<li>Experience in extracting value from the real-world business data.</li>\n</ul>\n<strong>Bonus</strong>\n\n<ul>\n<li>Experience with analyzing business operations: marketing, sales, HR, etc.</li>\n</ul>"}