{"job title": "Data Analyst", "company": "DealerSocket", "city state": "– Draper, UT", "rating": "3.0", "job description": "<div><strong>SUMMARY</strong></div>\n<br>An Operational DATA Analyst of DATA Solutions will be a key individual in handling both pro-active and re-active cases for our existing customer base. All our software applications are driven off data and the accuracy of that data is critical to our company being successful. This role is crucial in understanding the inner workings of the various DATA aspects of the platform including the troubleshooting &amp; resolutions of those issues.<br>\n<div><strong>ESSENTIAL DUTIES AND RESPONSIBILITIES</strong></div>\n\n\n<ul>\n\n <li>Ability to work well under pressure for critical issues that require prompt response and resolution of the indicated issues.</li> \n\n<li>Troubleshoot and resolve data-related issues in Microsoft SQL Server reported by customers and internal employees after dealership implementation.</li>\n<li>Coordinate with vendors to set up and troubleshoot software integrations.</li>\n<li>Create, modify and troubleshoot SQL Legacy DTS packages, SSIS packages, and store procedures.</li>\n<li>Convert, manipulate and scrub large volumes of data in various formats in SQL Server 2000/2005/2008/2012, and Microsoft Excel</li>\n<li>Maintain a high level of customer satisfaction with exceptional customer service, technical and consultative skills</li>\n<li>Professional &amp; Timely communication through its various forms such as e-mail, IM, phone, and other areas is essential.</li>\n<li>Collaborate with internal departments to resolve customer issues.</li>\n<li>Work on multiple issues at the same time, while providing excellent customer service to each individual customer.</li>\n<li>Perpetual learning of the DealerSocket product and the various appropriate integrations</li>\n<li>Work in conjunction as a leadership team to continue to progress your development &amp; career through increased performance and quarterly based reviews.</li> \n</ul>\n\n<div>\n<strong>BASIC QUALIFICATIONS</strong></div>\n\n\n<ul>\n\n <li><strong>Education:</strong><strong> High school Diploma / GED Required.</strong> Bachelor Degree Preferred. Preferably in computer science, computer information systems or IT Management.</li>\n<li><strong>Excellent communication skills &amp; detail oriented</strong></li>\n<li><strong>Basic troubleshooting skills &amp; root cause analysis understanding</strong></li>\n<li><strong>Technical:</strong></li>\n<li>MS SQL Server: 1-3 years</li>\n<li>HTML / Web Development: 1-2 years</li>\n<li>Networking TCP / IP Knowledge: 1 – 2 years</li>\n<li><strong>Software Precisionist</strong>: Microsoft Products including Visio, PowerPoint, Excel, Word<br><br><strong>PREFERRED SKILLS AND EXPERIENCE</strong></li>\n\n<li>Advanced troubleshooting skills and problem-solving</li>\n<li>Ability to translate technical knowledge to a usable or understandable terminology to the remainder of the organization.</li>\n<li>Must have excellent problem-solving skills and enjoy challenges</li>\n<li>Excellent customer service skills and a positive attitude</li>\n<li>Experience in a customer support environment</li>\n<li>Organized and able to multi-task well</li>\n<li>Display strong teamwork and interpersonal skills</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Salesforce knowledge / previous use</li>\n<li>DealerSocket Product Platform knowledge</li>\n</ul>"}