{"job title": "Data Analyst", "company": "GlassRatner", "city state": "– Atlanta, Georgia", "rating": "2.4", "job description": "Company Description<br><br>GlassRatner is a multi-office specialty financial advisory services firm providing Solutions to complex business problems and Board level agenda items. The firm applies a unique mix of skill sets and experience to address matters of the utmost importance to the enterprise such as planning and executing a major acquisition or divestiture, pursuing a fraud investigation or corporate litigation, managing through a business crisis or bankruptcy and other top level, non-typical business challenges.<br><br>Job Description<br><br><strong>Summary:</strong> Candidate will conduct detailed analysis of large financial and operational data sets in connection with forensic accounting, litigation support, and due diligence services, and create meaningful visualizations in PowerPoint, Corel Draw, and related programs.\n<br><br>\nResponsibilities:\n<ul>\n<li>Oversee export of data from ERP systems (such as payroll, timekeeping, marketing, sales, product, royalty, cost accounting, and customer service systems) in complex financial litigation matters</li><li>Import data using software such as Access or Excel for analysis</li><li>Verify completeness and accuracy of extracted data</li><li>Perform data analytics relevant to the investigative issues</li><li>Document audit trail from source data to summarized results</li><li>Prepare schedules, tables and charts to summarize findings</li><li>Prepare complex and compelling graphics in PowerPoint, Corel Draw, or related program</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n<ul>\n<li>Position requires 1-5 years of experience in conducting complex data analytics</li><li>Proficiency in Excel, PowerPoint, and relational databases a must</li><li>Proficiency in Corel Draw, Tableau, or related program</li><li>High level of verbal and written communication skills</li><li>Some travel may be required</li>\n</ul>\n\n<strong>Additional Information</strong>\n\n<ul>\n<li>Commensurate with experience</li>\n<li>Competitive benefits package</li>\n</ul>\nAll your information will be kept confidential according to EEO guidelines.\n<br><br>\nNO CALLS PLEASE."}