{"job title": "Data Analyst", "company": "Honda of America Mfg., Inc.", "city state": "– Ohio-East Liberty", "rating": "3.8", "job description": "<div><b>Position Core Role:</b></div>\n<div>Data Automation Analyst in the Manpower team responsible for automation of reporting/analytics of manpower related data and information. Support PSD department by identifying, proposing, and developing reports, dashboards, KPIs, and metrics that help bring about solutions for increased efficiencies. Associate will also be responsible for the manpower controller activities for the Paint and Bumper Paint Departments which includes budgeting, auditing and ensuring manpower is appropriately allocated according to plans.</div>\n<div> </div>\n<div><b>Essential Function and Responsibilities:</b></div>\n<div>Interpret and analyze manpower related data using statistical techniques</div>\n<div> </div>\n<div>Acquire data from multiple sources and establish automated reports for increased team efficiency and accuracy</div>\n<div> </div>\n<div>Validate data to identify and correct code/accuracy </div>\n<div> </div>\n<div>Develop process improvements through automation for increased team efficiency and accuracy of reporting for manpower team and Productions Services Department</div>\n<div> </div>\n<div>Ensure the adherence to data standards is followed across all areas by performing periodic audits.</div>\n<div> </div>\n<div>Create &amp; maintain problem lists to support settings next step direction, priority &amp; to track countermeasures effectiveness.</div>\n<div> </div>\n<div>Perform Audit Processes to ensure standardization is adhered to</div>\n<div> </div>\n<div>Lead manpower budget process and analyze information including: analyzing data, generating reports and explaining all gaps clearly and concisely</div>\n<div> </div>\n<div>Lead and oversee maintaining process list and workforce categories to ensure they align with the appropriate department</div>\n<div> </div>\n<div>Manpower controller for Paint and Bumper Paint:</div>\n<div>-Daily Team changes</div>\n<div>-Reporting</div>\n<div>-Promotions </div>\n<div>-Budgeting (SAP)</div>\n<div> </div>\n<div><b>Daily Tasks:</b></div>\n<div>Develop data &amp; reports related to top problem &amp; provide to management</div>\n<div> </div>\n<div>Analyze data for department and plant trends</div>\n<div> </div>\n<div>Perform data requests; confirm requests are all encompassing of info needed</div>\n<div> </div>\n<div>Training of team on new reports and information</div>\n<div> </div>\n<div>Identification of efficiency and process improvements for team through automation</div>\n<div> </div>\n<div>Paint and BPA team changes, reporting and data entry</div>\n<div> </div>\n<div>Budgeting and reconciliation of plan vs actual</div>\n<div><br><b>Required Knowledge, Skills and Abilities:</b></div>\n<div>Advanced knowledge of using software packages or tools for processing and visualizing data (e.g. Microsoft Excel, VBA, Oracle, Business Objects, SAP BI, SQL Queries, and Tableau etc.)</div>\n<div> </div>\n<div>Analysis and problem solving skills with an ability to analyze data from various sources to determine next steps</div>\n<div> </div>\n<div>Math mind and the ability to interpret mathematical information</div>\n<div> </div>\n<div>Ability to schedule and budget </div>\n<div> </div>\n<div>Ability to identify problems effectively and systematically to frame the problem, and leverage tools to identify potential solutions to propose</div>\n<div> </div>\n<div>Attention to detail</div>\n<div> </div>\n<div>Ability to translate business requirements into technical solutions</div>\n<div> </div>\n<div>Communication and time management</div>\n<div> </div>\n<div>Presentation skills verbal and written</div>\n<div> </div>\n<div><b>Required Experience:</b></div>\n<div>Minimum of 2 of relevant experience based on education</div>\n<div> </div>\n<div>Minimum of 2 year in a role automating, reports and analyzing data</div>\n<div> </div>\n<div><b>Education Requirements:</b></div>\n<div>Bachelor’s Degree in Business, Mathematics or Computer Technology or applicable work experience</div>\n<div><b> </b></div>\n<div><b>Honda Factors:</b></div>\n<div>Approximately 50-60&gt; of time Data Analytics/Automation</div>\n<div>50-40&gt; of time Manpower Controller Paint and Bumper Paint</div>\n<div> </div>\n<div>#LI-BS1</div>"}