{"job title": "Data Analyst with Tableau Expertise", "company": "Hoverstate", "city state": "– Woodland Hills, CA", "rating": "4.2", "job description": "NOTE: Currently, we are looking for LOCAL CANDIDATES who are NOT currently on a work Visa/work permit such as EAD, H1, F1, OPT, TN, H4, etc. If you are in this category or anything similar, please do not apply at this time.\n<br><br>\n<strong>Company Overview</strong>\n<br><br>\nHoverstate is a digital innovation company with offices in California, Texas, Washington and Italy specializing in Health and Life Sciences. We are a full-service design/development shop specializing in creating innovative digital products; forward-thinking technology strategies; leveraging compliant technologies; developing rock-solid code; testing our products with a robust QA team/automation; then backing it all with marketing support. If there is a problem to be solved in the digital space, Hoverstate can solve it.\n<br><br>\nSince 2008, Hoverstate has counted world-renowned health insurance and life sciences companies among our roster of clients. Our focused expertise keeps our clients on top of changes in policy, privacy rules and usability for their customers. Our mission is to continually create best-in-class user experiences through our robust design and testing practices, backed by some pretty impressive feats of technology, to bring this slow-to-innovate sector into the 21st century.\n<br><br>\nHoverstate + Pega: A Long History. Hoverstate has been a Certified Pega partner since 2013. Every day we leverage Pegas adaptable architecture to deliver applications to our clients in record time while creating outstanding user experiences with meaningful business results. Thanks to our extensive experience, and proven ability to execute Pega projects the \"Pega Way\", we were chosen as one of the first Pega Ventures funded partners in 2017. That means we have the full backing and endorsement of Pegasystems.\n<br><br>\n<strong>Job Summary</strong>\n<br><br>\nData analyst responsibilities include conducting full lifecycle analysis to include requirements, activities and design. Data analysts will develop analysis and reporting capabilities. They will also monitor performance and quality control plans to identify improvements.\n<br><br>\n<strong>Qualifications and Skills</strong>\n\n<ul>\n<li>2+ years professional experience as a data analyst or business data analyst</li>\n<li>BS in Mathematics, Economics, Computer Science, Information Management or Statistics</li>\n<li>Masters Degree in a quantitative science preferred</li>\n<li>Expert knowledge in Tableau</li>\n<li>Technical expertise regarding data models, database design development, data mining and segmentation techniques</li>\n<li>Strong knowledge of and experience with reporting packages (Business Objects etc), databases (SQL etc), programming (XML, Javascript, or ETL frameworks)</li>\n<li>Knowledge of statistics and experience using statistical packages for analyzing datasets (Excel, SPSS, SAS etc)</li>\n<li>Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy</li>\n<li>Adept at queries, report writing and presenting findings</li>\n</ul>\n<strong>Responsibilities and Duties</strong>\n\n<ul>\n<li>Interpret data, analyze results using statistical techniques and provide ongoing reports</li>\n<li>Develop and implement databases, data collection systems, data analytics and other strategies that optimize statistical efficiency and quality</li>\n<li>Acquire data from primary or secondary data sources and maintain databases/data systems</li>\n<li>Identify, analyze, and interpret trends or patterns in complex data sets</li>\n<li>Filter and clean data by reviewing computer reports, printouts, and performance indicators to locate and correct code problems</li>\n<li>Work with management to prioritize business and information needs</li>\n<li>Locate and define new process improvement opportunities</li>\n</ul>\n<strong>Benefits and Perks</strong>\n\n<ul>\n<li>Competitive salary and bonus plan</li>\n<li>Relocation Assistance</li>\n<li>401K program with company-contributed benefits</li>\n<li>Generous healthcare benefits</li>\n<li>Paid training and education program</li>\n<li>Flexible PTO policies</li>\n<li>A rapidly growing well-established business</li>\n<li>The opportunity to make a tangible impact on Hoverstate as well as our market-leading clients</li>\n<li>A fun and friendly environment that is collaborative, loose, fast, yet professional!</li>\n<li>Regular, personal interaction with the Hoverstate senior leadership team and senior leadership of our clients.</li>\n<li>Opportunity for accelerated recognition and rewards, where youll see your contributions and great ideas directly impact our business</li>\n</ul>\nNOTE: Currently, we are not accepting applications for any candidate on a work Visa/work permit such as EAD, H1, F1, OPT, TN, H4, etc."}