{"job title": "Business/Data Analyst", "company": "Kforce", "city state": "– Charlotte, NC", "rating": "3.7", "job description": "<strong>RESPONSIBILITIES:</strong><br><br>Kforce has a client in search of a Business/Data Analyst in Charlotte, North Carolina (NC).\n<br><br>\n<strong>Summary:</strong>\n<br>\nStart your career off on the right foot with one of 'America's Top 500 Companies', as awarded by Forbes. Our client is known as a place where people feel included, valued, supported and respected. Innovative thinking and industry-leading technology allow their associates to thrive and grow in their careers. And with a priority placed on their culture and company principles, their commitment to diversity, ethics and the communities in which they operate is their driving force.\n<br><br>\n<strong>Duties Include:</strong>\n\n\n<ul>\n<li> Develop enhanced operational reporting, metrics and dashboards for both executive and functional leaders; assist with planning, development and provide direction to the analysis of complex business processes and the development of report automation</li>\n<li> Develop and maintain internal SharePoint site to support team knowledge sharing and operations</li>\n<li> Works with stakeholders to provide training, address questions, assess user needs, and recommend changes</li>\n<li> Prepares specifications for system changes</li>\n<li> Recommends and initiates systems testing</li>\n<li> Consultant within technology and business groups, use quality tools and process definition/improvement to re-engineer reporting systems for greater efficiencies</li>\n</ul>\n<strong>REQUIREMENTS:</strong>\n\n<ul>\n<li> Knowledge and understanding of database querying and creating complex reports using SQL or similar querying methods</li>\n<li> Experience with Tableau or similar reporting tools</li>\n<li> Experience with SharePoint site development and maintenance</li>\n<li> Knowledge and understanding of business requirements gathering and translation to technical requirements</li>\n<li> Advanced Microsoft Office (Word, Excel, Outlook and PowerPoint) skills</li>\n<li> Knowledge and understanding of banking or financial services industry</li>\n<li> Knowledge and understanding of threat analysis and assessment of potential and current information security risk/threats</li>\n<li> Excellent verbal, written, and interpersonal communication skills</li>\n<li> Ability to prioritize work, meet deadlines, achieve goals, and work under pressure in a dynamic and complex environment</li>\n<li> Ability to work effectively, as well as independently, in a team environment</li>\n<li> Experience working in a large enterprise environment</li>\n<li> Strong analytical skills with high attention to detail and accuracy</li>\n<li> Customer service focus with the ability to respond to requests in a timely manner</li>\n<li> Knowledge and understanding of Information Technology audit and risk management</li>\n<li> Ability to present complex material in a digestible, consumable manner to all levels of management</li>\n<li> Ability to interact with integrity and a high level of professionalism with all levels of team members and management</li>\n<li> Ability to work effectively in a team environment and across all organizational levels, where flexibility, collaboration, and adaptability are important</li>\n</ul>\n\nKforce is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status."}