{"job title": "Data Analyst", "company": "LogicSource", "city state": "– Norwalk, CT", "rating": "3.4", "job description": "<div><div><strong>Analyst</strong>\n<br><br>\n<strong>LogicSource Overview</strong>\n<br><br>\nLogicSource is an innovative leader in sourcing and procurement services, we help companies increase profits through better buying. LogicSource® is owned and operated by an experienced group of global business veterans who came together under the common goal to radically change the way sourcing and procurement works. We’ve reinvented sourcing and procurement with an execution-based, fully transparent business model that ensures clients don’t spend a dime until they see results.\n<br><br>\nOur people gain exposure to projects and clients spanning a broad set of categories across multiple industries. Opportunities for getting involved, whether working across functions or learning a new category abound.\n<br><br>\nOur business model reflects our culture – radically different and rife with opportunity to make a difference. Our professionals enjoy the intellectual stimulation, challenge and satisfaction that only a sophisticated organization, coupled with relevant and meaningful business challenges to solve, can afford.\n<br><br>\n<strong>Position Summary:</strong>\n<br><br>\nWe have an immediate opening for a full-time Analyst in our Norwalk, CT headquarters. You will be a key member of our analytics team, reporting to the Managing Director, Business Analytics.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nYou will be responsible for managing multiple clients’ historic and current purchasing data in order to forecast and report spend and savings. Responsibilities include but are not limited to:\n\n<ul>\n<li>Collaborating with client and internal stakeholders to identify and secure relevant data for analysis</li>\n\n<li>Interpreting and classifying complex purchasing data in order to understand clients’ historic and current services, specifications, and costs</li> \n\n<li>Identifying, securing, and assessing data in a variety of formats and from a variety of sources</li>\n\n<li>Analyzing data, evaluating costs, and providing analysis throughout the solutions and transition phases of client engagements</li> \n\n<li>Analyzing vendor pricing and RFx results and preparing analysis to support sourcing and procurement decisions</li> \n\n<li>Measuring savings and identifying economies by comparing RFx pricing with client baseline data</li>\n\n<li>Preparing reports of findings for presentations to client and internal stakeholders</li>\n\n<li>Utilizing savings models and building scenarios in support of solution development</li> \n\n<li>Refining data management systems and reporting processes to deliver accurate and quality insights for ongoing decision-making</li>\n</ul>\n<strong>Required Education and Experience:</strong>\n\n<ul>\n<li>Bachelors Degree required</li>\n\n<li>Experience managing and analyzing large quantities of data</li> \n\n<li>Knowledge of data cleansing and formatting methods and techniques</li>\n\n<li>Advanced proficiency in Excel (pivot tables, v-look-ups)</li>\n\n<li>Prior experience with databases and business intelligence reporting tools is a plus</li>\n\n<li>Ability to quickly learn and apply new software</li>\n\n<li>Strong problem solving skills</li>\n\n<li>Ability to produce quality materials within tight timeframes and manage multiple projects simultaneously, prioritizing accordingly to meet deadlines</li>\n\n<li>Ability to work effectively as part of a diverse cross-functional team</li>\n\n<li>Excellent organizational skills; strong attention to detail</li> \n\n<li>Strong verbal and written communication skills</li>\n</ul>\n<strong>Travel</strong>\n<br><br>\nThis position does not require Travel\n<br><br>\n<strong>Other Duties</strong>\n<br><br>\nThis Position Description is not an exhaustive list of the duties and responsibilities, and the employee is expected to perform other duties as necessary and assigned. The duties and responsibilities of this position may be modified at any time to meet changing business needs.</div> </div><div></div>"}