{"job title": "Data Analyst", "company": "Medifast", "city state": "– US-MD-Baltimore", "rating": "2.8", "job description": "<div><div>\n<div>Our Data Governance organization ensures our data is correct, being used properly, protected and overall being governed and measured. Our Data Analyst will partner with our internal owners, stewards and custodians to keep our metadata updated, our master data accurate and policies up-to-date.</div>\n</div>\n</div>\n\n<br>Responsibilities<br>\n\n<div>\n<div>\n<div>\n<div>1. Partner with business (i.e. internal owners, stewards, and custodians) to keep our metadata updated, our master data accurate and policies up-to-date.</div> <div>2. Performs data analysis, entry and review of our metadata into our Data Governance system. This includes our dictionaries, glossaries, business rules, processes and metrics.</div> <div>3. Reviews our Master Data Management (MDM) exceptions which will include making modifications, working with data stewards or custodians to make changes or proposals to MDM rules and processes based on these exceptions and understanding acceptable patterns.</div> <div>4. Gathers data metrics and helps our business/IT partners create and execute mediation plans.</div> <div>5. Assists in creating and curating all artifacts including policies, standards, plans, metrics, open issues etc.</div> <div>6. Helps in Data Privacy areas like data classification, data retention, testing, running simulation exercises, and regulatory reviews,</div> </div>\n</div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li>Bachelor’s Degree in IT, Business Management, or related field.</li><li>2 – 5 years’ experience in data, business, or financial analysis.</li><li>Proficient computer navigation abilities.</li> <li>Strong Excel skills.</li><li>Knowledge of Data Governance and/or Master Data Management systems a plus.</li> <li>Detail oriented and very organized.</li><li>Passionate about data governance and analytics.</li><li>Excellent written, verbal, and interpersonal communication skills.</li><li>Problem-solver that is able to work independently.</li></ul></div>\n</div>\n</div>\n<br>"}