{"job title": "Data Analyst", "company": "Related Partners", "city state": "– New York, NY", "rating": "3.5", "job description": "Related Companies is the most prominent privately owned real estate firm in the United States. Formed over 40 years ago, Related is a fully integrated, highly diversified industry leader with experience in virtually every aspect of development, acquisitions, management, finance, marketing and sales.\n<br><br>\nHeadquartered in New York City, Related has offices and major developments in Boston, Chicago, Los Angeles, San Francisco, South Florida, Washington, D.C., Abu Dhabi, London, and Shanghai and boasts a team of over 3,500 professionals. The Company’s portfolio of over $50 billion in real estate assets owned or under development is made up of best-in-class mixed-use, residential, retail, office and affordable properties in premier high-barrier-to-entry markets. Related has developed preeminent mixed-use projects such as Time Warner Center in New York and CityPlace in West Palm Beach and is currently developing the 28-acre Hudson Yards project on Manhattan’s West Side. Related also manages approximately $4 billion of equity capital on behalf of sovereign wealth funds, public pension plans, multi-managers, endowments, and family offices. Related was recently named to Fast Company Magazine’s list of the 50 Most Innovative Companies in the World.\n<br><br>\nRelated also owns Equinox® Fitness Clubs and SoulCycle further expanding the company's capabilities into the health and fitness arena and enhancing the value of its properties through an exclusive, branded amenity and lifestyle offering. Related is a partner in CORE, a boutique residential brokerage.\n<br><br>\nThe Data Analyst will develop and maintain processes and systems that help us evaluate construction labor costs we are incurring on specific projects. This will also include bringing together different systems and creating reporting tools that communicate clear results to management. This will also involve taking already established processes and standards and raising them to new levels. To accomplish this, the Data Analyst will interface with a number of different parties, including but not limited to Related IT, Related Project Managers, Related Management, Related Security, Related Accounting, CM’s and subs, and other 3rd parties as required. The ideal candidate is a highly entrepreneurial and self-motivated person who thrives in a dynamic work environment and demonstrates a flexible and adaptable work style that responds quickly and efficiently.\n<ul>\n<li>Establish dashboard of benchmarks to measure payroll and swipe data reliability, detect issues and study trends.</li><li>Create useful screens and reporting tools based upon user/consumer requirements.</li><li>Help rationalize the current suite of data analysis tools maintained in 1) Tableau, 2) MSRS and 3) shared drive folders/files. Determine usability and applicability of each.</li><li>Help drive user acceptance and usage in other functional areas (i.e. Risk, Related PM’s, Security, Accounting, etc.).</li><li>Work with Related IT to continue building out the current suite of data tools.</li><li>Development and implementation of payroll to security swipe hours reconciliation system</li><li>Establish original (and current) system requirements along with ongoing data quality procedures.</li><li>Interface with IT regarding system issues and updates.</li><li>Work with 3rd parties regarding requests for information.</li></ul>\n\n<ul>\n<li>Bachelor’s degree in Business</li><li>4 to 6 years of experience working with data and databases</li><li>Excellent written and communication skills</li><li>Strong analytical and organizational skills</li><li>Mature professional with sound judgement and interpersonal skills</li><li>Proficiency required with standard suite of Microsoft Office applications, especially Excel and MSRS</li><li>Proficiency preferred with Tableau data reporting tool</li><li>Ability to handle multiple tasks and work independently with attention to details</li>\n</ul>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}