{"job title": "Data Analyst", "company": "SS&amp;C Advent", "city state": "– Jacksonville, FL, United States", "rating": "2.8", "job description": "Want to work in a dynamic environment at the intersection of Wall Street and Technology? Advent Software, a leading provider of award-winning software and services for the global investment management industry, is seeking a Data Analyst in Jacksonville.\n<br><br>\nThis Data Analyst will specifically handle the historical data that new clients convert from their previous provider. This candidate will need to work closely with internal and external clients to complete the necessary tasks and provide feedback on process improvements. Candidates should be well organized, detail oriented, and possess strong communication skills. The ideal candidate will have financial industry knowledge and intermediate to advanced Excel skills.\n<br><br>\n<strong>Job Responsibilities</strong>\n<ul>\n\n<li>Work with institutional partners and clients to clearly define conversion requirements and identify appropriate conversion solutions and procedures</li>\n<li>Manage data conversion project from start to finish while maintaining deadlines and overall client experience</li>\n<li>Analyze data points provided and ensure proper formatting before loading into Black Diamond</li>\n<li>Identify anomalies that may arise during the process and propose a meaningful solution</li>\n<li>Understand and communicate effectively results of audits before and after data is loaded</li>\n<li>Set appropriate expectations with internal partners as well as client stakeholders</li>\n\n</ul>\n<strong>Qualifications Requirements</strong>\n<ul>\n<li>Bachelor’s Degree from an accredited institution in a business-related field required</li>\n<li>Strong attention to detail</li>\n<li>Proficient/Advanced skills working with Microsoft Excel</li>\n<li>Strong project management skills preferred</li>\n<li>Self-motivation a must</li>\n<li>Great organization skills</li>\n<li>Ability to work in a true team environment</li>\n\n</ul>\nAt Advent, you will find a rewarding career where you can thrive at every level. We invest in our employees through offering competitive compensation and benefits, progressive training opportunities, and wellness programs that empower employees to achieve total (physical, financial, social &amp; community) wellbeing. In addition to challenging and meaningful work, you will find a strong work-life balance and deep commitment to giving back to the communities where we live and work. Advent’s culture thrives on teamwork and diversity. So, bring your unique perspective and talent to Advent and thrive in your work today!\n<br><br>\nAdvent Software is an equal opportunity employer, committed to a diverse workforce.<br><br><strong>Principals only please. NO AGENCY CANDIDATES WILL BE CONSIDERED.</strong> Please apply directly to Advent. No phone calls please.<br><br><strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}