{"job title": "Data Analyst", "company": "TracFone Wireless", "city state": "– Miami, US-FL", "rating": "2.5", "job description": "<strong>Position Highlights:</strong>\n<br><br>\n<ul>\n<li><strong>Recognized leader:</strong> Rated #1 Prepaid Wireless Provider in the U.S.</li>\n\n<li><strong>Technology driven:</strong> Opportunity to work with state-of-the-art technology</li>\n\n<li><strong>Teamwork:</strong> A supportive team environment that thrives on innovation.</li>\n\n<li><strong>Culture:</strong> An entrepreneurial focus, where ownership and ingenuity are expected.</li>\n\n<li><strong>Benefits:</strong> Excellent health benefits, Matching 401K, and education reimbursement.</li>\n</ul>\n<strong>What you will do:</strong>\n<br><br>\nOur Carrier Line Management team is seeking a Data Analyst, who will be responsible for ensuring data integrity within TracFone’s systems related to carriers including ownership, technology, coverage, and preferences. The Data Analyst’s main responsibility is to work to reduce carrier costs while providing the customer with the best possible service.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n<li>Prepare, execute, and analyze monthly audits on core activation tables to ensure proper carrier selection during customer activation/reactivation transactions, data integrity within our systems, and measure processes effectiveness.</li>\n\n<li>Prepare, execute and analyze monthly carrier line inventory reconciliations.</li>\n\n<li>Weekly store trait performance reports in order to measure sales and returns performance for traited carrier / technology and recommend adjustments to in-store products when necessary to minimize returns and ensure best possible service for activations.</li>\n\n<li>Carrier analysis, which includes analyzing carriers’ rate to ensure carriers’ and ensure proper number assignment at the point of activation.</li>\n\n<li>Prepares and executes test cases and plans for IT rollouts that impact the business unit, provide User Acceptance to management for sign-off, and collaborate with the Information Technology team on identified defects for resolution.</li>\n\n<li>Manage service plan to rate plan mapping for monthly plan offerings.</li>\n\n<li>Maintains updated records of FCC carrier market ownership, license changes, and/or market swaps to ensure we transact with our carriers in all available markets.</li>\n\n<li>Review, recommend, and execute all carrier zone changes and additions to ensure selected carriers are available for activations and ensure zones are constructed correctly for number assignment.</li>\n</ul>\n\n<strong>Required Skills</strong>\n<br><br>\n<strong>Required Experience</strong>\n\n\n<ul>\n<li>Associates Degree or equivalent combination of education and experience.</li>\n\n<li>Four years of data audit or data analysis experience required.</li>\n\n<li>Must have proficient computer skills including Excel, Access, and SQL.</li>\n\n<li>Wireless Industry experience preferred.</li>\n</ul>\n\nJob Location\n<br>\nMiami, US-FL\n<br>"}