{"job title": "Data Analyst", "company": "VillageCare", "city state": "– New York, NY", "rating": "2.2", "job description": "VillageCareMAX is seeking a Data Analyst for a full-time in house position. The qualified candidate will provide analytical support across business functions including, but not limited to, care management, utilization management, quality, business operations, compliance, and claims. The position is an integral part of Analytics team, competent to work with various teams and capable of independently carrying out all essential data related tasks:\n\n\n<ul>\n<li>Compiles, analyzes and interprets varied and complex healthcare, clinical and utilization data for Analytics department, supporting across business functions including, but not limited to, care management, utilization management, quality, business operations, compliance, and claims</li>\n<li>Develops and maintains customized reports and dashboards for various departments using various tools (SQL, Access, Excel, BI Tools, etc.)</li>\n<li>Ability to run complex queries, manipulates, transform, and generate reports using SQL, MS Access, MS Excel, and BI tools</li>\n<li>Works with VillageCare IT department in automation of information through dashboard development to track or monitor metrics or data, subsequent to analysis, including validation and testing. Participates in the design and development of dashboards that will automate the collection or analyzing of data</li>\n<li>Works closely with all levels of business users to clearly define reporting requirements in support of strategic decision making. This includes standard reports, ad-hoc analysis, dashboards, and scorecards</li>\n<li>Utilizes various software tools and identify the best format to present and communicate data to provide clear, concise and easyto-understand information</li>\n<li>Performs other duties and responsibilities as assigned</li>\n</ul>\n\n<strong>Requirements:</strong>\n<br><br>\nBachelor's degree in Computer Science, Mathematics, Statistics, Engineering or other relevant field required.\n<br><br>\nHaving a master's degree in a related field is highly preferred.\n\n\n<ul>\n<li>3-5 experience in business intelligence and analytics performing increasingly complex data analysis and report/dashboard development, preferably in a health care setting<br><br>SDL2017</li>\n\n</ul>"}