{"job title": "Data Analyst", "company": "Winnebago Industries, Inc.", "city state": "– Middlebury, IN", "rating": "2.7", "job description": "<strong>Position Description:</strong>\n<br><br>\nPrimary Objective of Position: Responsible for providing comprehensive views of data to individual departments. Daily responsibilities will include meeting with individual departments to discover what they are lacking in information (reports, dashboards, etc.); finding the data to fill the gap, or help identify how the data can be collected; find and develop the best delivery method of the needed information to the end user.\n<br><br>\nA successful candidate will have the right blend of analytical expertise, SQL skills, Microsoft BI experience, and communication acumen.\n<br><br>\n<strong>Key Areas of Responsibility:</strong>\n\n\n<ul>\n<li>Meet with business stakeholders to determine data needs</li>\n<li>Identify where data exists that can satisfy the needs</li>\n<li>Where data does not already exist, develop and execute plan for acquiring the data</li>\n<li>Develop BI Solutions in the Microsoft stack (primarily PowerBI and Excel)</li>\n<li>Partner with enterprise BI team to leverage existing (or in development) data infrastructure and reports</li>\n<li>Proactively identify opportunities to improve current digital solutions or processes</li>\n<li>Contribute to creation of processes that improve data quality</li>\n<li>Continually work on data verification to confirm reporting accuracy</li>\n<li>Assist in general IT support as needed</li>\n</ul>\n\nCritical Competencies\n\n\n<ul>\n<li>Strong analytical skills focusing on market and operational data analytics</li>\n<li>Demonstrated ability to design and implement processes or industry best practices</li>\n<li>Strong results orientation; strives to deliver great results and drive continuous improvement</li>\n<li>Ability to collaborate and interact with business partners across all levels of the organization to define solutions to address key opportunities</li>\n<li>Strong interpersonal skills ability to build trust and commitment and influence others; promotes open communication and diverse perspectives; a true team collaborator</li>\n<li>Demonstrates flexibility and adaptability; thrives in a changing and/or fast paced environment; ability to balance multiple priorities and projects</li>\n<li>Motivated by the opportunity to learn and solve problems; takes initiative to improve processes and systems</li>\n<li>Ability to work independently with minimal supervision</li>\n</ul>\n\nRequired Education and Experience\n\n\n<ul>\n<li>2+ years of related IT experience</li>\n<li>Experience with Visualization tools (Power BI, SSRS, R, Python, other analytics solutions)</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Experience with Microsoft Dynamics AX 2012</li>\n</ul>\n\nFor immediate consideration for this position, please submit your resume online to careers@winnebagoind.com.\n<br><br>\nWinnebago Industries, Inc. is an equal opportunity employer."}