{"job title": "Data Analyst I in Corning, NY at AccruePartners", "company": "Accrue Partners", "city state": "– Corning, NY", "rating": "3.3", "job description": "<div>\n <div>\n Job Description\n <p>AccruePartners values our contract and consulting employees. We offer a competitive benefits package to meet the diverse needs of all of our contractor and consulting employees and their family members. Here is a listing of what our company offers:&nbsp;401(k) Medical, Dental, Vision, Life Insurance, Employee Assistance Program, Medical and Prescription Drug, Short and Long-Term Disability Insurance.&nbsp;</p><p><b>THE TEAM YOU WILL BE JOINING</b>:</p><ul>\t<li>Fortune 500 manufacturing and technology organization with significant investment in R&amp;D and Innovation</li>\t<li>Rich history with over 150 years of significant growth and innovation</li>\t<li>Expanding global footprint in North America, South America, Europe and Asia</li>\t<li>Industry leader within all 8 divisions and leader in each</li>\t<li>Known for growing talent internally and promoting internally</li></ul><p></p><p><b>WHAT THEY OFFER YOU:</b></p><ul>\t<li>Culture: Highly collaborative, teamwork-oriented environment</li>\t<li>Growth: Make an immediate impact in this high visibility role</li>\t<li>Opportunity: Ability to drive change within organization with a focus on process improvement</li>\t<li>Stability: Strong executive leadership team investing in its talent and elevating the global footprint</li></ul><p></p><p><b>WHERE THIS POSITION IS LOCATED:</b></p><ul>\t<li>Corning, NY</li></ul><p><b>WHY THIS ROLE IS IMPORTANT:</b></p><ul>\t<li>Support for analyzing capability of processes and activities (tracking, performance standards, conformity and compliance). Work closely with project managers to gather and analyze attribute and process statistical data. Work closely with project administrator confirming conformance and compliance with respect to predefined internal Corning format. Document and track deviations from standard setups, root cause, corrective action plan, closure. Capture and publish action items and meeting minutes from run to standard governance meeting; support document audits and updates and writing of new documents as necessary.</li></ul><p><b>THE BACKGROUND THAT FITS:</b></p><ul>\t<li>Must be proficient in MS Office (Word, Excel, Outlook - with some PowerPoint) and have intermediate / expert skills in Excel and be able to learn/understand new systems/business processes.</li>\t<li>Must be able to work in an environment with a high level of change.</li>\t<li>Education - 2 year or 4 year degree (ideally 4 year but will accept a 2-year with work experience) in purchasing/procurement; data analysis, accounts payable</li>\t<li>Experience - minimum 2 years work experience but ideally 3-4 years minimum</li>\t<li>Tools: ERP system - purchasing or accounts payable processing (e.g., PeopleSoft, SAP, Oracle) or Ariba sourcing/contracting</li></ul>\n</div>\n\n </div>\n \n\n <div>\n \n </div>"}