{"job title": "Sr. Data Analyst/QA in Charlotte, NC at AccruePartners", "company": "Accrue Partners", "city state": "– Charlotte, NC", "rating": "3.3", "job description": "<div>\n <div>\n Job Description\n <p>AccruePartners values our contract and consulting employees. We offer a competitive benefits package to meet the diverse needs of all of our contractor and consulting employees and their family members. Here is a listing of what our company offers:&nbsp;401(k) Medical, Dental, Vision, Life Insurance, Employee Assistance Program, Medical and Prescription Drug, Short and Long-Term Disability Insurance.</p><p>WHO OUR CLIENT IS:</p><ul>\t<li>Fortune 100 Financial Services Company</li>\t<li>100-year history of dedication to customer satisfaction, success and growth</li>\t<li>Tremendous growth and new business strategy leading to the need for new talent</li>\t<li>Significant investments in cutting-edge technology</li></ul><p>WHY YOU SHOULD CONSIDER THIS OPPORTUNITY:</p><ul>\t<li>Culture: Excellent work environment that fosters collaboration</li>\t<li>Growth: Ability to make an impact on the direction of the organization</li>\t<li>Opportunity: Gain hands-on experience working with cutting-edge technology</li>\t<li>Stability: Recent financial performance of the company has reported record profits</li></ul><p>WHERE THE POSITION IS LOCATED:</p><ul>\t<li>Waltham, MA; Charlotte, NC</li></ul><p>WHAT YOU WILL DO:</p><ul>\t<li>Utilize SQL, Tableau and Alteryx to analyze large data tables in SQL and Hadoop systems</li>\t<li>Perform exploratory analysis on new data sources to understand the data and quality</li>\t<li>Analyze the lineage of data through corporate warehouses</li>\t<li>Develop SQL, Tableau or Alteryx solutions to analyze data, join multiple data sets and answer ad-hoc business questions; document all findings</li>\t<li>Provide data testing support to small team of Tableau developers building complex interactive dashboards. Focus on testing of data and validation of calculations</li>\t<li>Plan testing tasks and activities to support the overall outcome of the deliverable</li>\t<li>Use appropriate tools and processes to support clear reporting of progress</li>\t<li>Conduct the testing and work with team members and stakeholders to ensure a quality deliverable</li>\t<li>Conduct production systems health checks on regular basis</li>\t<li>Analyze/interpret data requirements and perform current/target/gap/impact analyses</li>\t<li>Research beyond documented and happy-path cases to identify missing requirements</li>\t<li>Focus on data generation, flow, transformation and accuracy; correlate the functionality to the data</li>\t<li>Monitor overall test execution and manage contingency planning for test plan variances</li>\t<li>Defect reporting and tracking; including collaboration on defect resolution with developers/partners and identification of retest requirements</li>\t<li>Multi-task and prioritize activities to address complex needs of a large organization</li>\t<li>Adapt quickly to moving targets and changes in requirements</li></ul><p>HOW YOU ARE QUALIFIED:</p><ul>\t<li>Collaborate with geographically dispersed teams</li>\t<li>Bachelor's degree from a four-year college or university, or equivalent technical training</li>\t<li>Experience with SQL development - MariaDB, MySQL, or PostgreSQL</li>\t<li>Experience with Hadoop</li>\t<li>Excellent communication skills (oral/written)</li>\t<li>Excellent interpersonal skills</li>\t<li>Ability to work independently to resolve complex issues</li>\t<li>Demonstrate strong problem solving abilities</li>\t<li>Ability to take a definition of a complex KPI calculation from a dashboard and independently generate SQL directly from a data warehouse to validate</li></ul>\n</div>\n\n </div>\n \n\n <div>\n \n </div>"}