{"job title": "Data Visualization Analyst", "company": "Axelon, Inc.", "city state": "– Devens, Massachusetts", "rating": "3.5", "job description": "Job Description: Data Visualization Analyst\n<br><br>\n<strong>Role Overview:</strong>\n<br>\nThe Data Visualization Analyst will be working on a variety of projects in the areas business intelligence and data analytics using Spotfire and other reporting tools. The ideal candidate is a creative developer that can think outside of the box, enjoys challenging projects in a fast paced industry. Participates in visualization design, development, ongoing support, and delivery activities related to data services. Provides expertise on dashboard and reporting solutions across site.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Work as integral member of cross-functional team to gather and document requirements to meet business needs.</li>\n<li>Design, develop and test reports and dashboards that utilize underlying data warehouse and import files.</li>\n<li>Prepare comprehensive documentation and ensures timely completion of assigned work.</li>\n<li>Develop standard solutions and escalates with proper documentation when necessary.</li>\n<li>Collaborates with the business stakeholders to learn the aspects of the business and develop analytic insight.</li>\n<li>Analyzes application requirements and provides recommended design</li>\n<li>Collaborate with IT team to develop and recommend changes on Data Analytic and Business Intelligence strategic roadmap</li>\n</ul>\n\n<strong>Qualifications and Skills:</strong>\n\n\n<ul>\n<li>Bachelor Degree preferably in MIS, Computer Science, Mathematics or related field with 4 – 5 years Business Intelligence experience.</li>\n<li>4 – 5 years' experience with reporting and / or visualization tool (e.g. Tableau, Tibco Spotfire, Crystal Report, Microsoft Report, SSRS etc.)</li>\n<li>Experience administrating, developing and implementing reports and dashboards.</li>\n<li>Strong knowledge of data warehousing concepts with working SQL and Big data experience,</li>\n<li>Experience with multiple interactive reporting tools</li>\n<li>Experience in programing and coding e.g. VBA,.Net application, Visual Studio, Python</li>\n<li>Front end development (GUI interfaces) utilizing ODBC to connect to any Open Architecture RDBMS (Relational Database Management Systems) – such as Oracle and Sybase</li>\n<li>Experience with designing Data Warehouse architecture, data design and implementation</li>\n<li>Strong presentation, verbal and written communications skills</li>\n</ul>"}