{"job title": "Master Data Analyst", "company": "BayForce", "city state": "– Milwaukee, WI", "rating": "3.3", "job description": "We are seeking an SAP Master Data Analyst for one of our direct, global clients in the Milwaukee area. This consultant will be responsible for extending materials and bill of materials (BOM) to plants. They will primarily support our clients US/CA regional business but will occasionally support other global business material master data initiatives. The Master Data Analyst should be knowledgeable in the SAP Material Master and Production Planning modules, and must know how to extend materials, routings, and BOMs to plant locations. This role utilizes Winshuttle's suite of products to create scripts to perform mass master data updates to SAP master data. S/he will work in collaboration with Material Data Stewards to identify and provide assistance in resolving data quality problems through the appropriate choice of error detection and correction, process control and improvement, or process design strategies.Role and Responsibilities: Using SAP Material Master (MM) and Production Planning (PP) modules and understanding of cross-functional modules of Finance (FI) and Sales and Distribution (SD) extend materials and BOM's to plants, and create routings and production versions. Using SAP conduct data maintenance required of the business on master data to include: Bill of Materials, Material Master creation, routings and production versions. Conduct Mass Material Master Data updates as needed by the business using mass update technology to include Winshuttle and LMSW Develop and maintain mass maintenance scripts as needed using Winshuttle suite of products (10.7, 11.x) including script development, workflow designer, Infopath/Form development, Powershell scripts, Query and Transaction development Coordinates extensively with global domain data stewards and data quality lead to ensures master data integrity and data quality in key systems is aligned to approved data standards and business rulesProject Details:Role: Master Data AnalystLength: 6+ monthsLocation: Milwaukee, WIWork week: Mon-FriRequired Skills:5+ years of experience in a manufacturing, operational, finance, or data management functional area is required 2+ years of experience in data analysis or computer programming Functional understanding of SAP Material Master (MM) and (PP) Knowledge/understanding of SAP FI, SD (for cross functional purposes) - provided by Dice 5+ years of experience in a manufacturing, operational, finance, or data management functional area\n<br>\nAssociated topics: data analyst, data engineer, data integrity, data manager, data management, data scientist, etl, erp, mongo database, teradata"}