{"job title": "Sr Data Analyst", "company": "F5 Networks", "city state": "– Seattle, WA", "rating": "3.9", "job description": "Come work at a place where innovation and teamwork come together to support the most exciting missions in the world!\n<br><br>\n<strong>Position Summary</strong>\n<br><br>\nThis position will support all analytical and data modeling aspects of the price optimization initiative for F5. Position will involve a large number of spreadsheets, SQL, and statistical data modeling. This position will work closely with corporate sales operations and other cross functional teams. The focus of this position will be performing analytical functions to ensure quality, and efficiency in price optimization and support the program's analytical needs.\n<br><br>\nPrimary Responsibilities\n\n\n<ul>\n<li>Dedicated Analyst embedded in design and implementation of pricing optimization for Sales</li>\n<li>Works on data set creation, model design and validation</li>\n<li>Responsible for quarterly readout to Executive team on program success and key metrics</li>\n<li>Data model owner who supports annual refreshes and enhancements</li>\n<li>Continually evaluate, develop and implement meaningful methods for data analysis to inform the company about program performance</li>\n<li>Identify and implement process and reporting improvement opportunities to provide more relevant and timely reporting of key metrics</li>\n<li>Build presentations providing the clear analytics story program impact, what the analytics reveal, and make recommendations for price optimization levers</li>\n<li>Performs other related duties as assigned</li>\n</ul>\n\nThe Job Description is intended to be a general representation of the responsibilities and requirements of the job. However, the description may not be all-inclusive, and responsibilities and requirements are subject to change.\n<br><br>\nKnowledge, Skills and Abilities\n\n\n<ul>\n<li>Expert business and statistical analysis skills including building reports, complex spreadsheets in excel and statistical modeling</li>\n<li>Strong understanding of regression, CHAID tree and other statistical models</li>\n<li>Advanced SQL</li>\n<li>Experience with SPSS Modeler or other statistical modeling tools (preferred)</li>\n<li>Expert ability to draw concise, well supported recommendations based on detailed analysis of the given issue</li>\n<li>On the collaboration front, the ideal candidate will have experience driving partnerships, managing dependencies, collaborative prioritization, sizing/estimation of tasks into realistic schedules, and Agile development practices</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>BA/BS degree in Statistics, Mathematics, Business Administration or related field required</li>\n<li>A minimum of 8 years relevant experience within Sales Operations or comparative field, and/or financial analysis experience supporting a Sales Organization</li>\n</ul>\n\nPhysical Demands and Work Environment\n\n\n<ul>\n<li>Duties are performed in a normal office environment while sitting at a desk or computer table</li>\n<li>Duties require the ability to utilize a computer, communicate over the telephone, and read printed material</li>\n<li>Duties may require being on call periodically and working outside normal working hours (evenings and weekends)</li>\n<li>Job may be performed in an office environment sitting at a desk or computer table.</li>\n<li>Quarter end flexibility required to allow for occasional extra hours.</li>\n<li>Duties may require the ability to travel via automobile or airplane, approximately 10% of the time spent traveling.</li>\n</ul>\n\nF5 Networks, Inc. is an equal opportunity employer and strongly supports diversity in the workplace.\n<br><br>\n<strong>#LI-MC3</strong>\n<br><br>\nThe Job Description is intended to be a general representation of the responsibilities and requirements of the job. However, the description may not be all-inclusive, and responsibilities and requirements are subject to change.\n<br><br>\nEqual Employment Opportunity\n<br><br>\nIt is the policy of F5 to provide equal employment opportunities to all employees and employment applicants without regard to unlawful considerations of race, religion, color, national origin, sex, sexual orientation, gender identity or expression, age, sensory, physical, or mental disability, marital status, veteran or military status, genetic information, or any other classification protected by applicable local, state, or federal laws. This policy applies to all aspects of employment, including, but not limited to, hiring, job assignment, compensation, promotion, benefits, training, discipline, and termination. Reasonable accommodation is available for qualified individuals with disabilities, upon request."}