{"job title": "Data Management Analyst III", "company": "Fannie Mae", "city state": "– VA-Reston", "rating": "3.7", "job description": "<div><strong>JOB INFORMATION</strong>\n<br>\nThis position establishes, maintains, and communicates standards for recording, searching, and reporting data kept in the enterprise's databases and warehouses. This position documents data flows, data mappings, performs data lineage analysis as required by various enterprise projects. This position confers as needed with other technical staff to plan database conversion projects, or to establish large scale mining, reporting, or data display exercises. Leads or provides technical assistance to data projects or operations to maintain enterprise-wide standards and attain more efficient use of data resources. Researches, assesses, and reports use of data standards and ways in which they can be modified as needs change and corporate platforms develop.\n<br><br>\n<strong>KEY JOB FUNCTIONS</strong>\n\n<ul>\n<li>Collaborate with business partners, technical partners, and representatives from other organizations to understand and evaluate their requirements regarding data, and ensure they are meet the needs and conform to the enterprise standards.</li> \n\n<li>Perform any necessary data mapping and data lineage activities, documents information flows.</li> \n\n<li>Manage initiatives focused on implementing enterprise data management capabilities.</li> \n\n<li>Align enterprise data management activities with industry best practices.</li> \n\n<li>Develop metrics associated with core job functions, exhibiting how better data management practices improve business value.</li> \n\n<li>Align data management efforts/initiatives directly to providing business value.</li> \n\n<li>Work with manager to monitor use and form of reporting data in multiple platforms and reports throughout the organization. Contribute to developing and communicating corporate and regulatory standards for using, providing access to, and reporting data, and to the compliance framework for tracking the implementation of these standards.</li> \n\n<li>Request and track reporting from departmental units on use of and security standards for data used in variety of databases and warehouses.</li> \n\n<li>Assist manager in establishing data security guidelines for data subject to specific regulatory requirements.</li> \n\n<li>Communicate with organizational units concerned with risk management, legal compliance and privacy to ensure unit's standards and practices are consistent.</li></ul></div><br>\n\n<div><strong>EDUCATION</strong>\n\n<ul>\n<li>Bachelor's Degree or equivalent required</li>\n</ul>\n<strong>MINIMUM EXPERIENCE</strong>\n\n<ul>\n<li>4 years of related experience</li>\n</ul>\n<strong>SPECIALIZED KNOWLEDGE &amp; SKILLS</strong>\n\n<ul>\n<li>Hands-on data analysis experience, preferably in the secondary mortgage domain</li> \n\n<li>Ability to absorb information and data from multiple sources, apply strong analytical skills, and provide thoughtful and strategic recommendations to deliver tangible business value</li> \n\n<li>Good general understanding of the data concepts (Data Quality, Data Modeling, etc.) with emphasis on Metadata.</li> \n\n<li>Experience with Big Data/Cloud metadata collection a plus</li> \n\n<li>Demonstrated high proficiency in SQL, MS-Excel and MS-Access</li> \n\n<li>Establishes and maintains strong working relationships with business partners.</li> \n\n<li>Must have strong communication skills with ability to work with all management levels.</li> \n\n<li>Knowledge of the mortgage or financial services industry is required.</li> \n\n<li>Excellent interpersonal skills and a demonstrated ability to work effectively in a team environment; ability to work independently as well as in a dynamic matrix team environment.</li>\n</ul>\n<strong>EMPLOYMENT</strong> \n<br><br>\nAs a condition of employment with Fannie Mae, any successful job applicant will be required to pass a pre-employment drug screen and to successfully complete a background investigation.\n<br><br>\nFannie Mae is an Equal Opportunity Employer.</div>"}