{"job title": "Stability Data Analyst", "company": "Herbalife", "city state": "– Winston Salem, NC", "rating": "3.6", "job description": "<strong>POSITION SUMMARY STATEMENT:</strong>\n<br><br>\nThe Stability Data Analyst, shares the responsibility for implementing corporate stability processes, reviewing and editing stability protocols and stability reports, organizing corporate stability data, and assisting with trending data and researching formulas during laboratory investigations. This role will review stability requirements, review internal protocols designed to test the stability of Herbalife products, review analytical data generated during stability studies and review internal reports that detail the stability evaluation and compliance of Herbalife formulas.\n<br><br>\n<strong>DETAILED RESPONSIBILITIES/DUTIES:</strong>\n\n\n<ul>\n<li>Interface with Quality, R&amp;D, and Licensing partners to understand specifications and how to interpret results.</li>\n<li>Collaborate with Stability Coordinator in creating stability reports using pre-defined templates and pre-existing data, as required.</li>\n<li>Participate in the biweekly stability protocol review meetings (STF Meetings).</li>\n<li>Participate in Project Meetings, as required.</li>\n<li>Ensure adherence with GLPs, GMPs and SOPs.</li>\n<li>Assist management in conducting formal procedural inquiries and investigations to determine the cause of quality problems, recommend verbal and/or written corrective action, as required.</li>\n<li>Research Formulations to ensure assigned specifications are correct and accurate.</li>\n<li>Perform Trend analysis for formulations and/or RM inputs.</li>\n<li>Collaborate with QC Scientists if Methodology is thought to be a contributor to aberrant data.</li>\n<li>Review documentation and identify trends; provide detailed written observations to management as appropriate.</li>\n<li>Interact effectively with co-workers, management and vendors in order to resolve problems.</li>\n<li>Registers Stability samples, create LIMS protocols and establish inventory, as required</li>\n<li>Confer with interdisciplinary team to understand how to deal with products that don't adhere to specification limits and proactively work to resolve these issues.</li>\n<li>Be an active participant on the Stability Sensory Panel, up to and including running the Sensory Panel, as a backup for the Sensory Technician.</li>\n<li>Data Analyst, Stability is responsible for and empowered to stop an analysis that may produce poor quality results as required by ISO17025.</li>\n<li>Other duties as assigned.</li>\n</ul>\n\n<strong>REQUIRED QUALIFICATIONS:</strong>\n<br><br>\n<strong>Skills:</strong>\n\n\n<ul>\n<li>Maintain documentation in accordance with GLPs, ISO17025 and Herbalife internal procedures</li>\n<li>Good interpersonal and communication skills</li>\n<li>Ability to communicate effectively verbally and in written English</li>\n<li>Computer literacy, with solid PC and laboratory software experience</li>\n<li>Strong ability to work independently and as a team member under the pressure of manufacturing</li>\n<li>Able to interface with individuals from licensing, quality, and development backgrounds</li>\n<li>Skilled at managing multiple simultaneous projects</li>\n<li>High attention to detail and ability to learn Herbalife specific standards</li>\n</ul>\n\n<strong>Experience:</strong>\n\n\n<ul>\n<li>5+ years of analytical experience in a laboratory or research setting, including familiarity with testing and specifications requirements</li>\n<li>Technical writing experience (SOP, Regulatory submissions, technical reports.)</li>\n<li>Knowledge GLPs and GMPs for the food, supplement, pharmaceutical or medical device industry</li>\n</ul>\n\n<strong>Education:</strong>\n\n\n<ul>\n<li>Bachelor of Science Degree in Chemistry or Related Science, or an equivalent combination of education and experience may be considered.</li>\n</ul>\n\n<strong>PREFERRED QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>Agile PLM (Product Lifecycle Management)/PQM (Product Quality Management)/PPM (Product Portfolio Management)</li>\n<li>LIMS</li>\n<li>Previous work history involving stability studies at a food, supplement, pharmaceutical, or cosmetic company</li>\n<li>Sensory Experience<br><br>SDL2017</li>\n\n</ul>"}