{"job title": "Lead Data Analyst", "company": "ICF", "city state": "– Atlanta, GA", "rating": "3.6", "job description": "<u><strong>Working at ICF</strong></u><br><br>Working at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you’re seeking to make a difference in the world, visit www.icf.com/careers to find your next career. ICF—together for tomorrow.<br><br><strong>Lead Data Analyst,\n<br>\nAtlanta, GA</strong><br><br><br><br>ICF is seeking a Lead Data Analyst to assist in the implementation of utility energy efficiency programs that incorporate installation of energy efficiency equipment in commercial and residential buildings.\n<br><br>\nThis position requires experience with data analytics and reporting tasks, as well as a management consulting perspective, including project oversight, client management, and team management. The Lead Data Analyst will support and oversee processes and tasks required for recurring reporting deliverables, analysis of program performance, forecasting program performance, and will be responsible for providing strategic direction and management of a team of junior analysts.\n<br><br>\n<u><strong>What you will do:</strong> </u>\n<ul>\n<li>Manage a team of data analysts to deliver accurate and timely deliverables to client and internal teams and provide strategic direction to meet short-term and long-term goals</li><li>Collaborate with program managers, data analysts, internal IT team, and the client to manage incoming reporting and analysis requests, define requirements, and provide reports which accurately describe program activities and monitor progress toward program goals and benchmarks</li><li>Be the client point of contact for reporting needs and questions, and provide education and awareness of reporting capabilities</li><li>Introduce efficiencies, best practices, and standardization into reporting and data maintenance activities</li><li>Oversee reporting activities to ensure consistency, accuracy, and quality control and provide key business intelligence to internal and external stakeholders</li><li>Identify training needs across the team of data analysts and connect them with resources for their development</li>\n</ul>\n<strong><strong><u>B</u></strong><u>asic Qualifications and Professional Skills</u></strong>\n<ul>\n<li>Bachelor’s degree including statistical/data analysis courses</li><li>5+ years’ experience managing timely and accurate reporting deliverables</li><li>Advanced skills in Microsoft Excel and PowerPoint</li><li>Strong project planning, management, and organizational skills</li></ul>\n\n<ul>\n<li>Exceptional verbal, interpersonal, and written communication skills</li></ul>\n\n<ul>\n<li>Self-motivated and able to manage competing priorities/deadlines in a fast-paced environment while maintaining accuracy and quality</li><li>Team player with strong collaborative abilities</li></ul>\n\n<ul>\n<li>Sound business ethics, including the protection of proprietary and confidential information</li></ul>\n<br>\n<u><strong>Preferred Skills/Experience</strong></u>\n\n<ul>\n<li>Advanced knowledge of Tableau, Power BI, or other analytics/data visualization software</li><li>Experience with Report Builder</li><li>2-3 years’ experience managing and mentoring a team</li> \n</ul>\nICF offers an excellent, an award benefits package winning talent development program, and fosters a highly skilled, energized and empowered workforce.\n<br><br>\nICF is an equal opportunity employer that values diversity at all levels. (EOE – Minorities/Females/ Protected Veterans Status/Disability Status/Sexual Orientation/Gender Identity)\n<br><br>\n<u><strong>Statement Pay Transparency:</strong> </u>For more information, please click here: https://www.dol.gov/ofccp/pdf/pay-transp_formattedESQA508c.pdf<br><br>Atlanta, GA (GA15)"}