{"job title": "Data Analyst - USA", "company": "Ingram Micro.", "city state": "– Irvine, CA", "rating": "3.3", "job description": "Marketing Data Analyst and Customer Insights Role<br> <br> Ingram Micro helps businesses fully realize the promise of technology.TM No other company delivers the full spectrum of global technology and supply chain services to businesses around the world. Ingram Micro's global infrastructure and deep expertise in technology solutions, supply chain, cloud and mobility enable its business partners to operate efficiently and successfully in the markets they serve. Combined with distinct market insights and the trust and dependability generated from decades of strong partner relationships, Ingram Micro stands apart as the global technology services provider for the future.<br> <br> * As a Marketing Data Analyst, you will analyze and synthesize partner, market and competitive data to translate findings into business insights and action plans to support improved performance.<br> <br> * You will provide financial and business information, analysis, and insight to the company's leadership team around Marketing initiatives. You will be a member of a high-impact, fast paced, Account team driven to show marketing results.<br> <br> * Develop and present insightful presentations across departments that outline significant changes in customer behavior and the marketplace with recommendations for actions. You will Communicate insights across relevant forums in order to broadly inform key decision makers.<br> <br> * The Marketing Analyst is responsible for developing and analyzing data models that generate knowledge into the project owner's business objectives and show how marketing activities tie to revenue growth.<br> <br> * He or she will utilize reports of findings and create appropriate materials to communicate the findings across multiple departments.<br> <br> * They will maintain a broad understanding of Ingram Micro's business model along with becoming educated on vendors, partners, end users and internal division's business models and needs.<br> <br> * They must understand client's objectives and translate business needs into the appropriate technical data models.<br> <br> * Expertise to prepare data models and review output to ensure model accuracy, along with translating the trends and applying to business demands.<br> <br> * They must have the ability to data-mine and aggregate data from multiple sources and provide a cohesive report back to associates and people managers.<br> <br> * He or she must have strong business acumen and be able to work on most projects independently and lead projects with guidance from management.<br> <br> * Effectively listen, communicate, recommend, and present data analytic solutions to internal and external clients, including over the phone meetings, in person presentations with PowerPoint, and other media sources.<br> <br> * We're looking for an ambitious, focused professional who is comfortable with change and can provide great story-telling through data.<br> <br> Requirements:<br> <br> * Master's degree in quantitative discipline (Statistics, Applied Mathematics, Operations Research, Computer Science, or Econometrics) and 2 years of experience OR Bachelor's degree in quantitative field with 5-10 years relevant experience.<br> <br> * Experience working on research and analytics initiatives in the areas of digital marketing, customer experience, branding, advertising, marketing communications and customer segmentation.<br> <br> * Experience in analysis of large data sets, identifying trends and patterns.<br> <br> * Experience with Modeling Techniques (linear regression, logistic regression, decision tree), Query Languages (SQL, Python), Automation (SQL Stored Procedures, SSIS, APIs), Reporting (Excel, .Net, MicroStrategy), prior management of a project in which a relational database was built and utilized for analysis, Google Analytics, and Data Mining experience<br> <br> Ingram Micro Inc. is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, or any other protected category under applicable law.<p>SDL2017</p>"}