{"job title": "Sr. Research Data Analyst", "company": "Johns Hopkins University", "city state": "– Baltimore, MD", "rating": "4.1", "job description": "Classified Title: Sr. Research Data Analyst\n<br><br>\nWorking Title: Sr. Research Data Analyst\n<br><br>\nRole/Level/Range: ACRP/04/MD\n<br><br>\nStarting Salary Range: $51,975-$71,497\n<br><br>\nEmployee group: Full Time\n<br><br>\nSchedule: Mon-Fri/8:30-5\n<br><br>\nExempt Status: Exempt\n<br><br>\nLocation: 200 N. Wolfe Street\n<br><br>\nDepartment name: 10003079-SOM Ped Gen Pediatrics Adoles Medicine\n<br><br>\nPersonnel area: School of Medicine\n<br><br>\nThe Johns Hopkins Department of Pediatrics seeks a Senior Research Data Analyst to lead data management and statistical analysis for the Rales Center for the Integration of Health and Education (Rales Center). The Rales Center seeks to redesign school-based health programs to improve the health and academic achievement of urban, racial/ethnic minority, low-income children and adolescents. This includes the implementation of an innovative school health program that: 1) provides accessible pediatric primary care tailored to the needs of urban children in poverty at KIPP Baltimore; 2) provides comprehensive health education; 3) promotes a school climate that supports healthy behaviors; and 4) reduces barriers to health and healthy behaviors at home and at school.\n<br><br>\n<strong>Specific Duties/Responsibilities:</strong>\n\n\n<ul>\n<li>Oversee the collection, organization and management of research and program evaluation data in REDCap and other data management platforms as needed; Lead the development and optimization of new databases</li>\n<li>Create data quality protocols and train and oversee staff in their use</li>\n<li>Create analytic data files using data from multiple sources, including data linking where appropriate</li>\n<li>In collaboration with the Rales Center team, conduct or direct statistical analyses including but not limited to techniques for missing data, propensity score methods, regression-based longitudinal and multilevel analyses, and structural equation/latent variable approaches</li>\n<li>Provide technical assistance on statistical approaches to team members, trainees, and faculty members.</li>\n<li>Collaborate with the study team to produce reports for scientific, lay and policy audiences summarizes study findings and progress. Help in the preparation of manuscripts for publication, and help with preparation of presentations and reports.</li>\n<li>Ensure data integrity and compliance with security policies governed by FERPA and HIPAA</li>\n</ul>\n\n<strong>Minimum qualifications:</strong>\n<br><br>\nMaster's degree in related discipline. Typically require PhD. 1 year related experience. Require highly specialized advanced knowledge, education and/or training in a specialized field of study to conduct research. Demonstrated ability on significant graduate project or additional doctoral education may substitute for experience to the extent permitted by the JHU equivalency formula.\n<br><br>\nJHU Equivalency Formula: 30 undergraduate degree credits (semester hours) or 18 graduate degree credits may substitute for one year of experience. For jobs where equivalency is permitted, up to two years of non-related college course work may be applied towards the total minimum education/experience required for the respective job.\n<br><br>\n<strong>Preferred qualifications:</strong>\n<br><br>\nPhD in public health (e.g., epidemiology, bioinformatics), education, sociology, psychology, or related field. 3 years of relevant experience as an analyst.\n<br><br>\n<strong>Special knowledge, skills, and abilities:</strong>\n\n\n<ul>\n<li>Experience with data management and administrative data required.</li>\n<li>Experience working with health and/or educational data required.</li>\n<li>Demonstrated experience with longitudinal and multilevel analyses in child health, development, or family health required. Experience with probabilistic data linkage preferred.</li>\n<li>Must have programming expertise in Stata, MPlus, R, and/or SAS. Experience with ArcGIS helpful.</li>\n<li>Position requires careful and thorough documentation, high levels of organization, and willingness to collaborate with a wide range of stakeholders.</li>\n</ul>\n\nThe successful candidate(s) for this position will be subject to a pre-employment background check.\n<br><br>\nIf you are interested in applying for employment with The Johns Hopkins University and require special assistance or accommodation during any part of the pre-employment process, please contact the HR Business Services Office at jhurecruitment@jhu.edu. For TTY users, call via Maryland Relay or dial 711.\n<br><br>\nThe following additional provisions may apply depending on which campus you will work. Your recruiter will advise accordingly.\n<br><br>\nDuring the Influenza (\"the flu\") season, as a condition of employment, The Johns Hopkins Institutions require all employees who provide ongoing services to patients or work in patient care or clinical care areas to have an annual influenza vaccination or possess an approved medical or religious exception. Failure to meet this requirement may result in termination of employment.\n<br><br>\nThe pre-employment physical for positions in clinical areas, laboratories, working with research subjects, or involving community contact requires documentation of immune status against Rubella (German measles), Rubeola (Measles), Mumps, Varicella (chickenpox), Hepatitis B and documentation of having received the Tdap (Tetanus, diphtheria, pertussis) vaccination. This may include documentation of having two (2) MMR vaccines; two (2) Varicella vaccines; or antibody status to these diseases from laboratory testing. Blood tests for immunities to these diseases are ordinarily included in the pre-employment physical exam except for those employees who provide results of blood tests or immunization documentation from their own health care providers. Any vaccinations required for these diseases will be given at no cost in our Occupational Health office.\n<br><br>\nEqual Opportunity Employer\n<br><br>\nNote: Job Postings are updated daily and remain online until filled.\n<br><br>\nEEO is the Law\n<br><br>\n<strong>Learn more:</strong>\n<br><br>\nhttps://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf\n<br><br>\nImportant legal information\n<br><br>\nhttp://hrnt.jhu.edu/legal.cfm\n<br><br>\nSchool of Medicine - East Baltimore Campus"}