{"job title": "Party Reference Data Analyst", "company": "JPMorgan Chase&amp;Co.", "city state": "– Newark, DE", "rating": "3.8", "job description": "Apply Now\n<br><br>\nParty Reference Data Analyst\n<br><br>\nReq #: 180064709\n<br><br>\nLocation: Newark, DE,US\n<br><br>\nJob Category: Operations\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nDescription\n<br><br>\nParty Reference Data Utility (PRDU) is an organization that provides data governance and operational utilities for core party reference and master data and is used across all lines of business within the firm. The PRDU team manages and maintains reference data to ensure that our customers, employees, and lines of business are in adherence with firm standards and required regulations. The mission of Party Reference Data is to deliver best in class Reference Data Platforms, Processes, and Quality to help simplify operations and enhance analytical capabilities.\n<br><br>\nWe are looking to fill this position with a candidate who has experience with client support, reporting, and product delivery that focusses on quality results. Flexibility is a necessity in this role as responsibilities may fluctuate based on process changes / enhancements and business needs. This position will also interface directly with managers to fulfill ad-hoc requests. Responsibilities include the following:\n\n\n<ul>\n<li>Create and maintain reference data within the Party Central repository by onboarding new clients, and processing amendments that could include hierarchy changes, static data updates, mergers and deactivations</li>\n<li>Ensure the procedural guidelines are followed and supporting documentation is validated prior to action</li>\n<li>Proactively identify process and knowledge gaps, as well as areas for potential operational efficiencies</li>\n<li>Liaise with requestors / business partners through various communication channels</li>\n<li>Assist in tracking and reporting of ad hoc business requests and projects</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Excellent working knowledge of MS Suite Excel, Word and PowerPoint</li>\n<li>Attention to detail and control/quality awareness with strong analytical skills</li>\n<li>Ability to work as an individualcontributor as well as perform in a collaborative environment</li>\n<li>Strong influence and negotiation skills to drive process control, changes, and provide supporting rationale</li>\n<li>Proactive approach to problem solving, taking ownership of issues and driving solutions</li>\n<li>Client focused with relationship-building abilities across lines of business and regions</li>\n<li>Proven ability to communicate effectively at all levels, internally and externally</li>\n<li>College degree or equivalent work experience in Financial Services Industry</li>\n</ul>"}