{"job title": "QM Data Analyst", "company": "MJHS", "city state": "– US-NY-Brooklyn", "rating": "3.6", "job description": "Overview<br><br>The challenges of affordable healthcare continue to create new opportunities. Elderplan and HomeFirst, our Medicare and Medicaid managed care health plans, are outstanding examples of how we are expanding services in response to our patients' and members' needs. These high-quality healthcare plans are designed to help keep people independent and living life on their own terms.<br><br>Why work for MJHS?<br><br>When you work with us you will receive comprehensive and affordable health and financial benefits, in addition to generous paid vacation, personal and holiday time that you won't find at our competitors. Do you receive a paid day off for your birthday now? No? You will here! You will also receive the training, tuition assistance and career development you desire to help you achieve your career goals. You take care of our patients, residents and health plan members, and we will take care of the rest!\n<br><br>\nBenefits include:\n\n<ul>\n\n <li>Sign-on Bonuses OR <u>Student Loan Assistance</u> for clinical staff</li>\n<li><u>FREE</u> Online RN to BSN and MSN degree programs!</li>\n<li><u>Tuition Reimbursement</u> for all full and part-time staff</li>\n<li><u>Dependent Tuition Reimbursement</u> for clinical staff!</li>\n<li>Generous paid time off</li>\n<li><u>Affordable</u> medical, dental and vision coverage for employee and family members</li>\n<li><u>Two retirement plans</u>! 403(b) AND Employer Paid Pension</li>\n<li>Flexible spending</li>\n<li>And MORE!</li>\n</ul>\n\nResponsibilities<br><br>Implements company-wide Quality Management data gathering, tracking and reporting systems and processes based on identified needs. Conducts needs analysis to determine users’ data and reporting needs for new and ongoing projects. Evaluates and recommends improvements to business processes, workflow, database design and reporting mechanisms to insure quality control and data integrity. Maintains up to date current level of knowledge of technical specifications relevant to QM databases, including database design/changes, file structure and data elements. Estimates time and cost required to implement improvement projects and new initiatives. Prepares and maintains technical and procedural manuals for data gathering, data entry, data analysis and reporting. Designs, prepares and distributes ad hoc and recurring reports, including charts and graphs, for presentation to management, regulatory surveyors or external clients. Participate in HEDIS data submission and audits. Develop and maintain database(s) outlining clinical and administrative HEDIS benchmarks and other targeted performance indicators. Perform data base queries and informational updates. Coordinate provider report card data in collaboration with other departments. Participate in vendor and data selection for quality measurements. Works collaboratively with software vendor(s) and other departments to improve data flow and reporting. Manipulates raw data through software applications to fulfill company performance reporting needs. Report development by merging data and other data mining tools, on a routine or an ad-hoc basis, using various programs including, but not limited to, SQL and Crystal Reporting. Generate monthly utilization and activity reportsevaluating outcomes and other performance measures. Present findings of report reviews identifying trends and patterns in report and presentation formats.<br><br>Qualifications\n\n\n<ul>\n\n <li>BA/BS, from a four-year college or university.</li>\n<li>3 years related experience and/or training; or equivalent combination of education and experience.</li>\n<li>Strong knowledge of information systems including knowledge of reporting tools, spreadsheet software; web-based software and database software.</li>\n<li>MS Office, Access, Crystal Reports. SQL Server.</li>\n<li>Excellent analytical, problem solving, project management, technical and communication skills.</li>\n</ul>"}