{"job title": "Data Analyst II", "company": "Premera Blue Cross", "city state": "– Mountlake Terrace, Washington", "rating": "3.1", "job description": "<div><div><strong>Join Our Team: Do Meaningful Work and Improve People’s Lives</strong>\n<br><br>\nOur purpose, to improve customers’ lives by making healthcare work better, is far from ordinary. And so are our employees. Working at Premera means you have the opportunity to drive real change by transforming healthcare.\n<br><br>\nTo better serve our customers, we’re creating a culture that promotes employee growth, collaborative innovation, and inspired leadership. We are committed to creating an environment where employees can do their best work and where best-in-class talent comes, stays, and thrives!\n<br><br>\nAre you a self-proclaimed data junkie? As a Data Analyst II within Operations, you will collect, process, analyze, compile and present data to help answer business questions and solve business problems. This role will require applying statistics and mathematical techniques to create wide range of analyses. Translate numbers into plain English and visualizations that can be better used to understand the business. You will produce operational reports and trend analysis using traditional and programmatic methods for Premera’s call reduction program for the Customer Service team. This role will perform moderate complex work following professional standards and department guidelines.\n<br><br>\n<strong>What you’ll do:</strong>\n<ul>\n<li> Design, develop, and implement operational reporting and trend analysis for internal and external customers</li><li> Collect, validate and maintain data from internal and external sources</li><li> Analyze data sets as appropriate for reporting and analytics using excel, business intelligence tools, SAS and python</li><li> Provide routine and ad hoc data reports and models for management using visualization and statistics to understand and solve business problems</li><li> Troubleshoot issues as they arise and solve problems independently or collaboratively with other teammates</li><li> Perform thorough review of data products and processes for content and accuracy and identify associated problems</li><li> Work with stakeholders and team to understand business questions and problems and to scope data and reporting requests</li><li> Prepare documentation on all projects to enable peer review and ensure continuity of data product quality</li><li> Other duties as assigned</li>\n</ul>\n<strong>What you’ll bring:</strong>\n<ul>\n<li> Bachelor’s degree in statistics, mathematics, information systems, computer science, finance, information management, economics or similar quantitative area or the equivalent of 4 years work experience in field required</li><li> 2 years’ experience in applying quantitative analytics tools, methods and processes required</li><li> VBA or SQL scripting skills</li><li> Experience in data reporting and database design</li><li> Experience producing operational reporting with analytics</li><li> Skill creating and maintaining production reports based on analytic techniques</li><li> Experience using software such as Microsoft excel, SAS or other analytical software</li><li> Strong reporting skills and ability to identify trends in business data.</li><li> Able to present analytical findings to non-technical audiences and effectively address questions pertaining to those findingsAbility to use analytical methods to identify and troubleshoot errors and issues in work product and common datasets</li>\n</ul>\n<strong>What we offer:</strong>\n<ul>\n<li> Medical, vision and dental options</li><li> Life and disability insurance</li><li> Retirement programs (Yes! This includes a pension!)</li><li> Workplace wellness programs</li><li> Time off to reenergize</li><li> Free parking</li><li> And MORE!</li>\n</ul>\nEOE - Equal Opportunity Employer. Minorities, women, veterans and individuals with disabilities are encouraged to apply.\n<br><br>\n#LI-EH1</div></div>"}