{"job title": "Data Analyst Population Health", "company": "Providence Health &amp; Services", "city state": "– Seattle, WA", "rating": "3.4", "job description": "<strong>Description:</strong>\n<br><br>\n<strong>Providence is calling a Data Analyst Population Health to Providence Health &amp; Services in Renton, WA or Portland, OR</strong>\n<br><br>\nWe are seeking a Data Analyst Population Health to develop algorithms, metrics, reports, and dashboards needed to support population health initiatives and risk contracts. The incumbent implements analytic methods, and supports analytic projects as Providence expands population health and value-based care initiatives. The incumbent will work with healthcare data from internal and external sources and create reporting dashboards and metrics for Providence Health and its partner organizations.\n<br><br>\n<strong>In this position you will:</strong>\n\n<ul>\n<li>Develop algorithms, metrics, reports, and dashboards needed to support population health initiatives and risk contracts.</li>\n\n<li>Implement analytic methods.</li>\n\n<li>Support analytic projects as Providence expands population health and value-based care initiatives.</li>\n\n<li>Work with healthcare data from internal and external sources and create reporting dashboards and metrics for Providence Health and its partner organizations.</li>\n</ul>\n<strong>Qualifications:</strong>\n<br><br>\n<strong>Required qualifications for this position include:</strong>\n\n<ul>\n<li>Bachelors degree in a related field (e.g. Health Informatics, Statistics, Computer Science, etc.) or equivalent experience.</li>\n\n<li>At least 2-5 years of experience writing complex SQL queries and project experience working with health claims data.</li>\n\n<li>Experience performing complex analyses with adjudicated claims and other healthcare data.</li>\n\n<li>Experience designing and implementing complex algorithms and/or quality metrics.</li>\n\n<li>Experience creating progress reports and dashboards for clinical audiences.</li>\n\n<li>Experience working with relational data tables.</li>\n</ul>\n<strong>Preferred qualifications for this position include:</strong>\n\n<ul>\n<li>Experience with Informatica or other ETL software</li>\n\n<li>Training or experience programming in Scala, Python and or Spark SQL</li>\n</ul>\n<strong>About the department you will serve.</strong>\n<br><br>\nPopulation Health Informatics provides a variety of functional and system support services for all eight regions of Providence Health &amp; Services from Alaska to California. We are focused on supporting our Mission by delivering a robust foundation of services and sharing of specialized expertise.\n<br><br>\n<strong>We offer a full comprehensive range of benefits - see our website for details</strong>\n<br><br>\nhttp://www.providenceiscalling.jobs/rewards-benefits/\n<br><br>\n<strong>Our Mission</strong>\n<br><br>\nAs expressions of Gods healing love, witnessed through the ministry of Jesus, we are steadfast in serving all, especially those who are poor and vulnerable.\n<br><br>\n<strong>About Us</strong>\n<br><br>\nProvidence Health &amp; Services is a not-for-profit Catholic network of hospitals, care centers, health plans, physicians, clinics, home health care and services guided by a Mission of caring the Sisters of Providence began over 160 years ago. Providence is proud to be an Equal Opportunity Employer. Providence does not discriminate on the basis of race, color, gender, disability, veteran, military status, religion, age, creed, national origin, sexual identity or expression, sexual orientation, marital status, genetic information, or any other basis prohibited by local, state, or federal law.\n<br><br>\n<strong>Schedule:</strong> Full-time\n<br><br>\n<strong>Shift:</strong> Day\n<br><br>\n<strong>Job Category:</strong> Finance &amp; Accounting\n<br><br>\n<strong>Location:</strong> Washington-Seattle\n<br><br>\n<strong>Other Location(s):</strong> Oregon-Portland\n<br><br>\n<strong>Req ID:</strong> 191417"}