{"job title": "Data Analyst/ Business Analyst", "company": "TMNA Services LLC", "city state": "– Bala Cynwyd, PA", "rating": "4.2", "job description": "<strong>Duties</strong><br>\n<div><strong><u>Job Summary</u></strong></div> <div>Business Analyst III/ Integration Team is responsible for the analysis, integration requirements, functional specifications and data mapping development of integrations for the enterprise applications and various data integration solutions for TMNAS companies. In this role, he/she will be expected to work with our business stakeholders, business analysts/data analysts, subject matter experts, architects, development teams and external vendors to analyze and document business/data requirements and data anomalies. A candidate for this position must be able to work in a varied, fast paced environment as part a service delivery function for TMNA Services (TMNAS) and its Group Companies and is expected to possess advance skills in key areas (articulated below).</div><div><strong><u>Job Responsibilities</u></strong>\n<ul>\n<li>Participate in the analysis, requirements, design and implementation of the functional enhancements and data integration solutions\n\n<ul>\n<li>Responsible for the analysis, integration requirements, functional specifications and data mapping</li><li>Perform data analysis and create data mapping for multiple integration points.</li><li>Work with business users to solicit, analyze, and document business needs</li><li>Document business/data requirements from source and target applications to support integrations.</li><li>Responsible for the development and maintenance of SDLC artifacts related to implementation</li></ul></li>\n<li>Perform data profiling on source data and document data anomalies.</li><li>Formulate and define objective and scope based on user needs and thorough understanding of business processes</li><li>Participate in on-going operational L3 support and maintenance for implemented integrations (real time or batch)\n\n<ul>\n<li>Provide resolution of support and maintenance tickets per established SLAs.</li><li>Provide resolution of various data issues reported</li><li>Develop procedures and queries for data analysis and reports.</li> <li>Maintain the data integrity by establishing, automating and enhancing operational checks, balance routines and maintaining KPIs</li></ul></li>\n<li>Works with internal business groups on process improvement projects designed to improve business results.</li><li>Collaborate with the UI/UX teams to create designs</li><li>Define analytics requirements. Work with analytic products to create reports, measure websites performance and analyze the data to provide usability improvements and optimization recommendations</li><li>Work collaboratively with architects, technical leads and subject matter experts of the various upstream and downstream systems responsible for receiving and/or sending data in support of existing systems</li><li>Define acceptance criteria as part of requirements</li><li>Review test strategy and test scenarios for QA resources and provide testing support</li><li>Participate in UAT execution and support end user training, as required for eventual product implementation</li><li>Align to the maintenance and enforcement of SDLC processes, departmental standards, style requirements and all other procedures necessary for data and system integrity.</li><li>Complies with proper internal controls as necessary to conduct job functions and/or carry out responsibilities and/or administrative activities at the Company</li><li>Performs special projects and other duties as may be assigned.</li> </ul></div>\n<br><strong>Qualifications</strong><br>\n<div><strong><u>Degree / Licenses and Professional Certifications</u></strong>\n<ul>\n<li>Bachelor Degree (preferably in MIS, IT, or Business) preferred</li><li>Insurance knowledge/certifications a plus</li></ul></div>\n<br>\n<div><strong><u>Experience</u></strong>\n<ul>\n<li>3-5 years of prior experience focused in data analysis, modeling, profiling and mapping</li><li>Experience writing business requirements and functional specs. Ability to decompose complex business and data requirements into technical specifications and mapping documents.</li><li>Experience working in insurance industry P&amp;C sector</li><li>Experience and knowledge of SQL and XML</li><li>Experience utilizing data modeling tools such as Erwin, Embarcadero etc.</li><li>Experience working with source code repositories (Subversion, Team Foundation Server) and continuous integration/deployment</li><li>Experience and knowledge of Microsoft Office products (Visio, Excel, Word and PowerPoint)</li><li>Practical experience with tools such as Informatica Analyst, Informatica Metadata Manager , Informatica Data Quality or Collibra is preferred</li><li>Experience with Data Lake or Hadoop implementations is a plus</li></ul></div>\n<br>\n<div><strong><u>Knowledge</u></strong>\n<ul>\n<li>Knowledge on techniques, principles and concepts in data warehousing</li><li>Strong Knowledge of the data governance and data management concepts and practices</li><li>Strong Knowledge of the concepts, and best practices for ETL development</li><li>Knowledge of activities, tasks, practices, and deliverables associated with soliciting and clearly defining and documenting required business functionality as well as non-functional requirements.</li><li>Knowledge of SDLC and software support and maintenance approaches</li><li>Knowledge of Guidewire Insurance or Data Management products is a plus.</li><li>Knowledge of HP Application Lifecycle Management is a plus</li></ul></div>\n<br>\n<div><strong><u>Skills</u></strong></div> <div>\n\n<ul>\n<li>Strong writing and communication skills.</li><li>Clear communication and comprehension skills</li><li>Excellent problem solving and analytical skills</li><li>Strong customer service orientation (responsive, consultative, collaborative and accurate)</li><li>Proficiency in communicating technical recommendations back to business analysts, subject matter experts and end users.</li><li>Strong interpersonal relationship building skills: able to work with a variety of people and groups in a constructive and collaborative manner.</li></ul></div>\n<br>\n<div><strong><u>Abilities</u></strong></div> <div>\n\n<ul>\n<li>Strong analytical ability with the capability to determine the root cause of problems and issues and provide solutions.</li><li>Strategic thinking; Applies organizational acumen to identify and maintain focus on key success factors for the organization.</li><li>Strong drive to execute and deliver</li><li>Ability to juggle multiple, competing, frequently changing time-sensitive deadlines and priorities.</li><li>Ability to work independently and without supervision.</li></ul></div>\n<br><strong>EEO Statement</strong>\n<br><br>\nTokio Marine Group of Companies (including, but not limited to the Philadelphia Insurance Companies, Tokio Marine America, Inc., TMNA Services, LLC and First Insurance Company of Hawaii, Ltd.) is an Equal Opportunity Employer. In order to remain competitive we must attract, develop, motivate, and retain the most qualified employees regardless of age, color, race, religion, gender, disability, national or ethnic origin, family circumstances, life experiences, marital status, military status, sexual orientation and/or any other status protected by law."}