{"job title": "Electronic Communications Data Analyst", "company": "University of Colorado", "city state": "– Denver, CO", "rating": "4.1", "job description": "The Office of University Relations is responsible for all official public communication regarding the Office of the President, which includes responding to requests from the news media for information, interviews and official statements. The office also directs the president's community tours and outreach, manages the president's regional business and community councils, the CU Advocates program and oversees the university's special events and outreach with targeted communities. University Relations also produces the weekly CU Connections, news and information for CU Faculty and Staff, and oversees the system-wide branding initiative and the implementation of an online alumni communications tool, among many other print, Web and social media projects.\n<br><br>\nThe Electronic Communications Data Analyst works collaboratively and strategically to resolve data and integration issues for the eComm platform. The eComm program, housed in the Office of the president at the CU System, provides email marketing and event management support to users across all four CU Campuses (Anschutz, Boulder, Colorado Springs, and Denver), the System Office, and Advancement using Salesforce, Marketing Cloud, and Cvent. Learn more at www.cu.edu/ecomm. The Electronic Communications Data Analyst works to to identify data integrity concerns, assess their scope, and identify possible solutions for consideration with associated teams. This position also works to support communicators using the eComm platform in the CU System.\n<br><br>\nThe Electronic Communications Data Analyst will be called upon to assist other campus department's in their communications efforts. This position will need to have a thorough understanding of the electronic communications program as well as data support, user access management, and program support. The Electronic Communications Data Analyst will also help the Office of the President's efforts as assigned and may involve the \"back-up\" of program executive director when they are out of the office. This position reports to the Executive Director of Electronic Communication, and is exempt from the State of Colorado Classified Staff system.\n<br><br>\n<strong>Duties and Responsibilities:</strong>\n<br><br>\nDuties and responsibilities of the position include, but are not limited to:\n<br><br>\neComm program system-wide data support (50%)\n<br><br>\nManage data-related initiatives that directly affect the electronic communications (eComm) program and the University of Colorado's (CU) system-wide constituent outreach in coordination with Advancement, University Information Systems (UIS), and the CU Salesforce Center of Excellence (COE) which includes:\n\n\n<ul>\n<li>Managing data integrity in concert with UIS and the COE to ensure collaborative and innovative solutions to data management issues</li>\n<li>Serving as the primary liaison between eComm and the COE and works directly with the COE team on a regular basis to resolve data-related tickets and integration issues between Salesforce, MDM, Advance, HRMS, and other source systems</li>\n<li>Identifying areas for improvement and establish associated process and procedures to ensure data is accurate and available throughout the CU System.</li>\n<li>Assisting the executive director of electronic communication and the campus eComm specialists in troubleshooting and addressing data issues to ensure accuracy and timeliness in system-wide outreach.</li>\n<li>Managing contact information change requests from system-wide constituents in concert with Advancement and other data owners.</li>\n<li>Managing un/subscribe requests from system-wide constituents.</li>\n<li>Collaborating with the COE, UIS, and Advancement to complete quarterly email address purges.</li>\n<li>Assisting with new contact processing and list processing for the eComm team.</li>\n<li>Serving as eComm's Salesforce ADM201 certified team member to ensure that technology is being used in an appropriate and fiscally-responsible manner that supports CU's system-wide communication goals.</li>\n</ul>\n\neComm program user access management (15%)\n<br><br>\nManage provisioning and deprovisioning for system-wide eComm users and work closely with campus eComm specialists and the COE team to implement user changes in eComm applications (Salesforce, Marketing Cloud and Cvent) which includes:\n\n\n<ul>\n<li>Managing user information that tracks all details associated with eComm access</li>\n<li>Conducting quarterly system-wide audits to ensure that required training has been completed and that users are in compliance with data security and privacy standards</li>\n<li>Meeting with the COE provisioning team quarterly to review issues and goals.</li>\n<li>Establishing and follows process in concert with the COE to implement user changes that may include ticket submission, management, troubleshooting, and resolution</li>\n<li>Ensuring that requested tasks have been completed successfully, implemented correctly, and solved so that issues will not become permanent burdens</li>\n<li>Tracking user counts throughout the system and alerts campus eComm specialists when user numbers are exceeding FY's allotted users.</li>\n</ul>\n\neComm support to CU system users (25%)\n<br><br>\nProvides exceptional customer service and ongoing technical and best practices support to CU system users of the eComm platform to include:\n\n\n<ul>\n<li>Meeting with potential users to identify needs and relevancy for use of eComm and sets expectations for user onboarding and training depending on license availability.</li>\n<li>Providing tier 1 user support to users as needed and outside of user groups and training. Support addresses any aspect of the use of eComm applications. When issue is not resolvable, position follows programmatic process to submit, manage and track tickets</li>\n<li>Coordinating with users and creating email reports and/or campaigns for Marketing Cloud email sends, which may involve the processing and/or investigation of separately maintained lists</li>\n<li>For users who leverage Cvent, position approves Cvent events to go \"live\" based on a pre-defined checklist. Working with user if changes are required before launching event.</li>\n<li>Conducting regularly-scheduled user groups to address calendaring, best practices, success stories, and user questions</li>\n<li>Maintaining a list of CU system users according to a pre-identified number of allocated CU system licenses for each eComm application</li>\n<li>Creating, maintaining, and regularly running analytics for system users that include but are not limited to:</li>\n<li>User licenses and activity (eg; user login counts)</li>\n<li>Email send and open data</li>\n<li>Event form data including number of events created, registration totals, and funds generated</li>\n</ul>\n\neComm program general (5%)\n<br><br>\nMaintains an in-depth and current understanding of all aspects of eComm, including but not limited to its applications, users, business requirements, programmatic goals and objectives and the role eComm plays in the greater CU enterprise Salesforce solution. This includes:\n\n\n<ul>\n<li>Collaborating and sharing with eComm specialists across the CU system, which includes activities such as attending and participating in regularly-scheduled meetings, calendaring, sharing of best practices, lessons learned, initiative engagement, etc.</li>\n<li>Meeting deadlines when system-wide projects are assigned</li>\n<li>Understanding FERPA, HIPPA, CAN-SPAM and other relevant legislation and applies these guidelines when coordinating or executing communications and inculcates best practices when training and supporting eComm system users</li>\n<li>Understanding eComm data intimately to effectively support the development and troubleshooting of Salesforce reports for user-generated email marketing sends</li>\n<li>Completing continuing education courses as needed and that are identified in coordination with program executive director and vice president for communication. This may involve attending user conferences but is dependent upon budget availability.</li>\n</ul>\n\n<strong>Knowledge, Skills, and Abilities:</strong>\n<br><br>\nTo be successful in this position a candidate will need the following:\n\n\n<ul>\n<li>Knowledge of Electronic Communication best practices.</li>\n<li>Knowledge of data and database support.</li>\n<li>Ability to troubleshoot issues within applications.</li>\n<li>Ability to support multiple projects simultaneously.</li>\n<li>Organized, detail-oriented, strong project management skills and team player mentality.</li>\n<li>Excellent communication and interpersonal skill.</li>\n</ul>\n\nWho we are: System Administration, which also houses the Office of the President, is located in the uptown neighborhood of Denver with an office in Broomfield and a few smaller offices located on the campuses. However, this position is located in Denver. Many of our departments support the educational and research missions of the four University of Colorado campuses. We provide diverse opportunities for professional development, innovation, and collaboration with talented staff and faculty.\n<br><br>\n<strong>What we offer:</strong>\n<br><br>\nSalary: The salary has been established at $60,500.\n<br><br>\nBenefits: The University of Colorado offers an excellent benefits package including:\n\n\n<ul>\n<li>Medical: Multiple plan options</li>\n<li>Dental: Multiple plan options</li>\n<li>Additional Insurance: Disability, Life, Vision and Wellness</li>\n<li>Retirement 401(a) Plan: Employer contributes 10% of your gross pay</li>\n<li>Paid Time Off: Accruals over the year</li>\n<li>Vacation Day: 22</li>\n<li>Sick Days: 15</li>\n<li>Holiday Days: 10</li>\n<li>Tuition Benefit: System employees have the benefit on all campuses</li>\n<li>ECO Pass: RTD Bus and light rail service</li>\n<li>Additional Perks&amp;Programs: Click here to access a few more Perks and Programs</li>\n</ul>\n\nClick here to access our Total Compensation Calculator to see what your total rewards could be at CU. This position is a University Staff position.\n<br><br>\nFor more information on benefits programs, including eligibility, is available at www.cu.edu/employee-services/.\n<br><br>\n<strong>Minimum Requirements:</strong>\n\n\n<ul>\n<li>Bachelor's degree from an accredited institution of higher education or equivalent professional experience. (The educational requirement may be substituted for professional experience on a year-for-year basis).</li>\n<li>Two (2) years of experience with data management.</li>\n<li>One (1) year of experience in a communications support position or similar role.</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Experience with email marketing.</li>\n<li>Experience with Salesforce, Marketing Cloud, and Cvent.</li>\n<li>Experience with database integrations and data management best practices.</li>\n</ul>"}