{"job title": "Data Analyst - Hopkins, MN", "company": "US Bank", "city state": "– Earth City, MO", "rating": "3.5", "job description": "An intermediate experienced individual contributor that works under limited supervision and reports to an Analytics lead/manager. This individual contributor applies subject matter expertise to develop new insights and understanding of business performance based on data and statistical methods. Analyzes data from multiple sources to assess trends and develop actionable insights and recommendations to business partners/management. Utilizes data, statistical and quantitative analysis, exploratory, explanatory and predictive modeling to drive decision making. They will be relied upon to support other analysts on the team as it relates to data acquisition and compliance methodologies.\n<br><br>\n<strong>ESSENTIAL FUNCTIONS:</strong>\n\n\n<ul>\n<li>Acquire data from multiple data sources in order to perform analysis.</li>\n<li>Identify, analyze and interpret trends or patterns in complex data in order to provide answers to business questions as well as provide recommendations for action.</li>\n<li>Interpret data and analyze results using various statistical techniques and tool.</li>\n<li>Present data and analysis in a clear and concise manner allowing the audience to quickly understand the results and recommendations so they activate upon them and make data driven decisions.</li>\n<li>Collaborate with business partners to prioritize requests/needs.</li>\n<li>Collaborate with various partners to provide a holistic view of the analysis (examples: research, IS&amp;E partners, competitive team).</li>\n<li>Measure and monitor results of applied recommendations and present adjustments, if necessary.</li>\n</ul>\n\nEnsure all data acquisition, sharing and results of applied recommendations are compliant with company standards\n<br><br>\nBasic Qualifications\n\n\n<ul>\n<li>Bachelor's degree, or equivalent work experience</li>\n<li>Three to five yearsof experience in project management activities</li>\n<li>Minimum one year of supervisory experience</li>\n</ul>\n\n<strong>PREFERRED SKILLS/EXPERIENCE:</strong>\n\n\n<ul>\n<li>Possess technical skills, experience with SAS, SQL, Tableau, Business Objects or similar data tools.</li>\n<li>Basic knowledge of mortgage banking</li>\n<li>Demonstrates effective work habits and organizational skills by prioritizing and planning, with the ability to handle multiple tasks simultaneously and adapt to changing work priorities.</li>\n<li>Meets or exceeds results within time, budget, and quality standards even under shifting priorities.</li>\n<li>Shows initiative, including eagerness to work on projects. May offer suggestions and / or take action to implement new or more effective solutions for work procedures, issues, or to meet customer needs.</li>\n<li>Possesses exemplary oral and written communication skills, demonstrated through interactions with clients, outside auditors, and colleagues throughout the organization.</li>\n<li>Two to three years of experience in reporting or project analyst activities</li>\n<li>Advanced knowledge of Microsoft Excel including creating formulas, macros, pivot tables, and charts</li>\n<li>Uses refined analytical and problem-solving skills and judgment to quickly identify problem areas and proactively resolve issues.</li>\n<li>Is a team-oriented professional, interacting collaboratively with team members and others across the organization.</li>\n<li>Ability to work independently with minimal supervision</li>\n</ul>"}