{"job title": "Application Engineer", "company": "8x8", "city state": "– San Jose, CA", "rating": "3.7", "job description": "<div>If you are an engineer who is comfortable with coding and interested in building out tools and infrastructure focused on system level availability, agility, transparency and scalability, then we have the right challenge for you.</div>\n<br>\n<div><strong>Responsibilities:</strong></div><div>You will be responsible for maintaining and scaling production services and servers across multiple data centers for complex and data-intensive cloud services</div><div>You will play a critical part in company’s hybrid cloud journey</div><div>You will improve scalability, service reliability, capacity, and performance</div><div>You will write automation code for provisioning and operating infrastructure at massive scale</div><div>You will work with development teams to make sure the applications fit nicely within the infrastructure and scalability/reliability/security is designed and implemented from the start</div><div>You will work with QE on building pipelines and automation for delivering and deploying applications to production</div><div>You will participate in the occasional on-call rotation supporting the infrastructure</div><div>You will take a lead role in managing major service outages</div><div>You will roll up the sleeves to troubleshoot incidents, formulate theories and test your hypothesis, and narrow down possibilities to find the root cause</div>\n<br>\n<div><strong>Qualifications:</strong></div><div>Minimum two years experience of SIP / VoIP-based telephony or equivalent real-time IP-based communication</div><div>Broad knowledge of networking and networked applications with deep understanding at all layers from physical to application.</div><div>Hands on experience in building fault tolerant and scalable systems</div><div>BS/CS or EE or equivalent</div><div>Strong development/automation skills. Must be very comfortable with reading and writing Python code. Java is a plus</div><div>Proven ability to apply a methodical, systematic approach to fault diagnosis and problem solving</div><div>Tools-first mindset. You build tools for yourself and others to increase efficiency and to make hard or repetitive tasks easy and quick</div><div>A risk-averse mentality familiar with principles of change control, risk mitigation and information security C, I and A</div><div>Experience with monitoring large scale environment</div><div>Experience with containerization is a plus</div><div>Organized, focused on building, improving, resolving and delivering. Good communicator in and across teams, taking the lead</div>\n<br><strong>ABOUT 8x8</strong>\n<br><br>\n8x8, Inc. (NASDAQ: EGHT) is the trusted provider of secure and reliable enterprise cloud communications solutions to more than 45,000 businesses operating in over 100 countries across six continents. 8x8's out-of-the-box cloud solutions replace traditional on-premises PBX hardware and software-based systems with a flexible and scalable Software as a Service (SaaS) alternative, encompassing cloud business phone service, contact center solutions, and conferencing.\n<br><br>\nIn today’s competitive market 8x8 continues to deliver service excellence, with a consistent, innovative, cohesive, progressive and dynamic culture.\n<br><br>\nFor additional information, <em>visit</em> <em>www.8x8.com</em><em>,</em> <em>www.8x8.com/UK</em><em> or connect with 8x8 on</em> <em>LinkedIn</em><em>,</em>\n<br><br>\n<em>Twitter</em><em>,</em> <em>Google+</em><em> and</em> <em>Facebook</em>\n<br><br>\n8x8 is proud to provide equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics.\n<br><br>\nFor 8x8 jobs located in the US: 8x8 participates in the E-Verify program.\n<br>\nView the Participant Poster in English | Español.\n<br>\nView the Right to Work Poster in English | Español.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}