{"job title": "Senior Software Engineer, Graphics/Engine", "company": "Blizzard Entertainment", "city state": "– Irvine, CA, United States", "rating": "4.5", "job description": "Blizzard Entertainment is seeking an experienced and enthusiastic engineer to work on a robust first-person engine for an unannounced project. You will be responsible for developing systems on multiple platforms, working in areas like rendering, memory management, file and network I/O, and whatever else needs to be done to make the best player experience possible. We’re an intensely collaborative group, passionate about our project. If you thrive in an environment that values communication and knowledge sharing, drop us a line!\n<br><br>\nThis is a full-time position on Blizzard’s main campus in Irvine, CA.\n<br><br>\n<strong>Responsibilities</strong>\n<ul>\n<li>Collaborate with designers, game programmers and fellow engine programmers to develop and refine key systems</li><li>Design and implementation of new development tools for artists</li><li>Communicate with other departments within the team to improve existing tools and determine new solutions</li><li>Maintain tools for performance, stability, and error-free operation</li><li>Identify and resolve pipeline issues and discover opportunities for improvement</li>\n</ul>\n<strong>Requirements</strong>\n<ul>\n<li>Advanced understanding of C / C++</li><li>A minimum of 5 years’ application programming experience</li><li>Experience working with game engines</li><li>Strong passion for graphics programming and algorithms / mathematics (linear algebra, trigonometry)</li><li>Familiar with state-of-the-art rendering techniques, shader development and graphics hardware and API’s</li><li>Able to communicate with non-technical users.</li><li>Must love working with artists.</li><li>Experience working in a collaborative team environment and handling multiple projects simultaneously.</li><li>Service-oriented attitude with an eye for efficiency and workflow</li><li>Advanced understanding of game content pipeline and tools</li><li>Strong debugging skills</li>\n</ul>\n<strong>Pluses</strong>\n<ul>\n<li>Detailed knowledge of 3D graphics, animation, camera control, and lighting</li><li>C#, Javascript, Python, or other languages</li><li>Experience shipping multiple game titles</li><li>Interest in workflow automation</li>\n</ul>\n<strong>Required Application Materials</strong>\n<ul>\n<li>Resume</li><li>Cover letter is optional but should include:</li>\n\n<ul>\n<li>Why you are interested in working at Blizzard</li><li>What games you are currently playing</li></ul>\n</ul>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}