{"job title": "Cloud Container/Docker Engineer", "company": "Booz Allen Hamilton Inc.", "city state": "– Springfield, VA", "rating": "3.7", "job description": "<strong>Job Number: R0027135</strong>\n<br><br>\nCloud Container/Docker Engineer<br><br>Key Role:\n<br><br>\nProvide guidance to development teams and direct support to encapsulating technology solutions into Docker containers to modernize an agencys enterprise and capabilities. Work with groups that include technical project teams, Cloud devops teams, system engineers, and solution architects to assist with migrating existing applications to a microservices architecture. Assist with transitioning and deploying solutions within the Cloud, including AWS and on-premise high performance computing (HPC) environments. Work with the customer directly to establish and maintain client relationships and engage in technical strategy discussions. Work in a fast-paced, dynamic, and challenging position requires the ability to work with a multitude of cutting-edge technologies.\n<br><br>\nBasic Qualifications:\n<br><br>\n-9 years of experience in a science, technology, engineering, or math (STEM) field, including new technologies and trends\n<br><br>\n-Experience with Docker containers and orchestration platforms, including ECS, Kubernetes, Mesos, or Swarm\n<br><br>\n-Experience in any hybrid Cloud environment, including AWS, GCP, or Azure a plus\n<br><br>\n-Knowledge of containerization and how to migrate existing applications to a micro-services architecture\n<br><br>\n-Knowledge of a high-level programming language, including Python or Java\n<br><br>\n-Ability to multi-task and adapt to changing priorities, procedures, and information technology tools\n<br><br>\n-TS/SCI clearance\n<br><br>\n-BA or BS degree\n<br><br>\nAdditional Qualifications:\n<br><br>\n-Experience with NGA\n<br><br>\n-Experience with transitioning technologies from R&amp;D into a pilot operational environment\n<br><br>\n-Experience with devops process and support tools\n<br><br>\n-Knowledge of GEOINT technology and data\n<br><br>\n-Ability to facilitate and interact in a cross-functional team environment\n<br><br>\n-MA or MS degree\n<br><br>\nClearance:\n<br>\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; TS/SCI clearance is required.\n<br><br>\nWere an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change.<br><br>#LI-AH1, CB17, CJ1, DH1, GD17, MPPC\n<br><br>"}