{"job title": "Sr Software Engineer", "company": "CA Technologies", "city state": "– Lisle, IL, US", "rating": "3.4", "job description": "<div><div><div></div>\n\n\n\n\n </div>\n</div><br>\n\n <div>\n<div>\n<div>\n<div>\n<div>\nSr Software Engineer</div>\n</div>\n </div>\n </div><br>\n\n<div>\n<div>\n<div>\n<div>\nRequisition No.:\n<br><br>\n166828</div>\n </div>\n </div>\n </div><br>\n\n <div>\n<div>\n<div>\n<div>\nCategory:\n<br><br>\nInformation Technology - IT</div>\n </div>\n </div>\n </div><br>\n\n <div>\n<div>\n<div>\n<div>\nLocation:<br><br>Lisle, IL, US<br><br>#job-location.job-location-inline {\n<br>\n display: inline;\n<br>\n }</div>\n</div>\n </div>\n </div><br>\n\n<div>\n<div>\n<div>\n<div>Do you want to help eliminate barriers between ideas and business outcomes? We want you to bring your unique experiences and creative ideas to the table. CA Technologies provides software and solutions that help our customers to develop, manage, and secure complex IT environments to increase productivity and enhance competitiveness in their businesses. It’s our aim to encourage global collaboration and results-oriented innovation, while supporting and developing our talented people and our communities. CA Technologies will empower you to drive authentic success, for both the business and yourself in the application economy.\n<br><br>\nHere at CA Technologies, you will be working in the Mainframe line of business. Our teams are focused on developing modern data privacy and compliance solutions to the data centric users on the Mainframe. Bringing these solutions to the market involves working closely with product management and architects to create highly complex and sophisticated software that span several teams, making surgical changes in our back-end Java code base to resolve an environmentally specific defect or performance, or changing the front-end code base to add visualization. We believe radically transforming the way software is built, delivered and monitored is exciting stuff, and we’re looking for developers who want to join the fun.\n<br><br>\n<strong><em>Work Location:</em></strong> Lisle, IL\n<br><br>\n<strong><em>What you will be doing in a typical week:</em></strong>\n\n<ul>\n\n\t<li>Applying your past experience to inform the product roadmap;</li>\n<li>Experimenting with new technologies that improve our software;</li>\n<li>Developing modern high quality software;</li>\n<li>Working on automated CI systems for common code software repositories;</li>\n<li>Driving test automation improvement;</li>\n<li>Improving our deployment pipeline.</li>\n</ul>\n<strong><em>Qualifications:</em></strong>\n<br><br>\nAt the end of the day, the main things we’re searching for are talent and passion. However, experience in one or more of these areas could make you a great addition to our team:\n\n<ul>\n\n\t<li>At least 5+ years of experience writing modern large scale software with prime focus on Java and JavaScript;</li>\n<li>Experience developing XML, SOAP, RESTful APIs;</li>\n<li>Hands-on experience with DevOps and Continuous integration tools like Jenkins, GitHub, Webpack, TeamCity, NPM etc.;</li>\n<li>Experience developing test automation using frameworks like Selenium, JUnit, Jest, Enzyme etc.;</li>\n<li>Experience with BDD, ATDD, software quality tools and methodologies;</li>\n<li>Experience in Agile Software Development;</li>\n<li>Experience in SAFe is a plus;</li>\n<li>Strong understanding of Database skills – ODBC/JDBC\n\n\n<ul>\n\n <li>Schema design, queries, procedures, triggers etc.</li>\n</ul>\n\n\t</li>\n</ul>\n<strong><em>Why you will excel here:</em></strong>\n\n<ul>\n\n\t<li>You are curious and eager to try new things;</li>\n<li>You break stuff just to fix it;</li>\n<li>You love to collaborate with awesome teammates;</li>\n<li>You have a broad background in software development, networking or operations;</li>\n<li>You believe in your can-do attitude;</li>\n<li>Your trust common sense.</li>\n</ul>\n<strong><em>Here are some great reasons to be a Principal Software Engineer at CA Technologies:</em></strong>\n\n<ul>\n\n\t<li>Growth – We work in a lot of different, leading-edge technologies that are modernizing a legacy way of software.</li>\n<li>Variety – This is not a simple day-to-day position. We work in a variety of code areas, with varied tools, and in an ever-changing environment.</li>\n<li>Collaboration – Our team is awesome, and we tackle problems collaboratively in an Agile environment.</li>\n<li>Pace - Sustainable.</li>\n<li>Career - Support for attending conferences, writing books, blogging and speaking.</li> \n</ul>\n<strong>More About Working at CA:</strong>\n<br><br>\nCA has earned scores of Workplace Excellence awards in the last few years – and there’s a reason for that. Here you’ll have the opportunity to eliminate barriers for our customers and earn a competitive compensation and total rewards package – all while pushing the boundaries of what’s possible by collaborating with a diverse team of global innovators. In short, CA’s fun, diverse, and fast-paced culture has put us on the map as one of the best employers in Information Technology.\n<br><br>\nWe offer competitive salary, company-sponsored premium Medical/Prescription &amp; Dental Plans, company-paid Holidays, Vacation, Anniversary Service and Sick Days, 401(k) Plan, Education/Training Reimbursement, Charitable Gift Program, Adoption Assistance Program.\n<br><br>\nLearn more about CA Technologies and this opportunity now at http://ca.com/careers\n<br><br>\nWe and all of our subsidiaries are equal opportunity employers. As such, it is our corporate policy to fill positions with qualified candidates regardless of the candidate’s race, color, sex, age, religion, ancestry, national origin, citizenship status, marital status, sexual orientation, gender identity, genetic information, disability, pregnancy, military status, veteran status or any other protected group status.\n<br><br>\n<em><strong>Note to Recruiters and Placement Agencies</strong>: We do not accept unsolicited agency resumes. Please do not forward unsolicited agency resumes to our website or to any of our employees. We will not pay fees to any third party agency or firm and will not be responsible for any agency fees associated with unsolicited resumes. Unsolicited resumes received will be considered our property and will be processed accordingly.</em>\n<br><br>\nIf you require an accommodation with the online application process, please contact Talent Acquisition at 1-800-454-3788.\n<br><br>\nEOE/Min/Women/Veterans/Disabled</div>\n </div>\n </div>\n </div>\n<br><strong>Nearest Major Market:</strong> Chicago</div>\n\n<br>"}