{"job title": "Performance Improvement Engineer", "company": "CHRISTUS Health", "city state": "– San Antonio, TX", "rating": "3.5", "job description": "<strong>Description</strong>\n<br>\n<u>POSITION SUMMARY</u><br><br>The Performance Improvement Engineer will guide and implement efforts to ensure that performance improvement (PI) programs are developed and managed using a data driven focus which sets priorities for improvements aligned to ongoing strategic imperatives.<br><br><u>MAJOR RESPONSIBILITIES</u>\n\n\n<ul>\n<li>Participates and/or leads teams, work groups, projects, and activities designed to improve operational performance and processes.</li>\n<li>Researches opportunities for performance improvement, establishes plans, and coordinates teams in achieving performance improvement for the assigned area of responsibility.</li>\n<li>Manages multiple projects and can work at various levels of the organization in both a clinic and inpatient environment.</li>\n<li>Can manage large scale projects through the entire project life cycle. Has breadth of knowledge to acquire data, convert to information, draw action plans and coach departments to their targets.</li>\n</ul>\n\n<strong>Requirements</strong>\n<br>\n<u>POSITION QUALIFICATIONS</u>\n<br>\nA. Education/Skills\n\n\n<ul>\n<li>Bachelor's Degree, Industrial Engineering</li>\n<li>Experience in project management and change management.</li>\n<li>Able to work in both clinic and hospital environment.</li>\n<li>Proficient Knowledge in Microsoft Office Suite</li>\n<li>Microsoft Project, Minitab</li>\n<li>Highly accurate, organized, detail oriented, self-motivated, maintain confidentiality, multi task oriented, and exhibit excellent judgment and problem solving skills.</li>\n</ul>\n\n<div><strong>B.</strong> <strong>Experience</strong></div>\n\n\n<ul>\n<li>3-10 years' experience in designing and carrying out performance improvement plans.</li>\n</ul>\n\nC. Licenses, Registrations, or Certifications\n\n\n<ul>\n<li>Clinical or Healthcare background</li>\n<li>LEAN and/or Six Sigma Training</li>\n</ul>"}