{"job title": "Senior Big Data Engineer", "company": "CyberCoders", "city state": "– San Jose, CA", "rating": "3.9", "job description": "Senior Big Data Engineer <div>\nIf you are a Senior Big Data Engineer skilled with Python, Scala or Java - please read on!\n<br><br>\nBased in San Jose, CA (near the Westfield Valley Fair), we're a mid-sized security company (~100 people) with recent funding on a mission to ensure the security of many global organizations. Our solution software is configurable for both local and multinational organizations and has evolved into the lightest, most scalable endpoint solution in the world.</div>\n<br>\nTop Reasons to Work with Us<div>\n\n\n<ul>\n<li>You'll be working with the latest backend frameworks/libraries!</li>\n<li>Your day to day programming duties will play a huge role in our overall company success, your work will be helping keep enterprise companies around the globe secure!</li>\n<li>We've got a really cool office space in a great location - literally in the middle of tons of restaurants and shops.</li></ul></div>\n\n\nWhat You Will Be Doing<div>\n\n\n<ul>\n<li>Design, Build and Maintain a big data platform using open source technologies such as Hadoop, Spark and ElasticSearch</li>\n<li>Translate business requirements into data models, algorithms and processes in order to produce the necessary results from customer data sets</li>\n<li>Apply advanced data mining and machine learning techniques to specific domain problems for our next generation solution</li></ul></div>\n\n\nWhat You Need for this Position<div>\n\n\n<ul>\n<li>Bachelors degree in CS/EE</li>\n<li>Strong background in Statistics, Math, Data Mining and Machine Learning Algorithms</li>\n<li>Experience working with large data sets using tools like Hadoop, MapReduce, Spark and ElasticSearch etc</li>\n<li>Working knowledge of RDBMS and NoSQL data back ends</li>\n<li>Strong programming experience in languages like Java, Scala or Python</li>\n<li>Working knowledge of data analysis and visualization tools like R and Matlab</li>\n<li>Experience building end-to-end solutions</li></ul></div>\n\n\nWhat's In It for You<div>\n\n\n<ul>\n<li>HUGE room for career growth, we promote upward movement.</li>\n<li>You work will be combating cyber fraud/hacking.</li>\n<li>Great office location, plenty of things to do and places to eat on your lunch break / after work.</li>\n<li>We're a leading company, with a global presence, fun office environment with very sharp engineers.</li></ul></div>\n\n\n<div>\nSo, if you are a Big Data Engineer local to the San Jose area - please apply today!</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}