{"job title": "Software Engineer (Data)", "company": "CyberCoders", "city state": "– Irvine, CA", "rating": "3.9", "job description": "Software Engineer (Data) <div>\nIf you are a Modern Data Architect with experience, please read on!\n<br><br>\nWe are the first company to offer micro investing to the world. The proprietary financial engine allows customers to roundup spare change from everyday purchases and invest these sub-dollar amounts into a professionally managed portfolio of index funds. Simply connect any credit or debit card and a checking account, then spend money like you normally do to watch your portfolio grow with the market. It's easy to get started when you can invest any amount, any time with no commissions or minimums.</div>\n\n<br>What You Will Be Doing<div>\n<strong>Within 1 month, you will:</strong>\n\n\n<ul>\n<li>Interface with various part of business, Products, Project Management, and Leadership.</li>\n<li>Be familiarized with toolsets and environments, given proper access to execute task.</li>\n<li>Understand data landscape and data flow and processes.</li>\n<li>Fix or enhance production data pipelines.</li>\n</ul>\n\n<strong>Within 6 months, you will:</strong>\n\n\n<ul>\n<li>Work with the engineering leadership team to align, establish and promote engineering-wide</li>\n</ul>\n\npriorities, including new features, infrastructure, and tool building.\n\n\n<ul>\n<li>Optimize performance of business-critical data process and identify and resolve data process</li>\n</ul>\n\nissues.\n\n\n<ul>\n<li>Develop new data pipeline for ingesting, integrating various heterogeneous data sources.</li>\n<li>Assist Data Science to integrate algorithms into a production environment.</li>\n<li>Assess level of effort on a project and deliver with internal and external teams.</li>\n<li>Propose and promote new way to solve a problem to gain efficiency and to scale.</li>\n</ul>\n\n<strong>Within 12 months, you will:</strong>\n\n\n<ul>\n<li>Contribute and execute on our Data Roadmap.</li>\n<li>Author, propose and execute technical initiatives.</li>\n<li>Lead a junior level individual contributor.</li>\n<li>Lead setting standards and best practices for a growing engineering organization</li>\n<li>Define career path opportunities for development.</li></ul></div>\n\n\nWhat You Need for this Position<div>\n\n\n<ul>\n<li>BA/BS from top-tier university</li>\n<li>1+ years of Java/Scala/Python experience</li>\n<li>3+ years of software engineering experience in an internet facing solution</li>\n<li>Object oriented fundamentals (OOA, OOP, OOD)</li>\n<li>Advanced understanding of SQL and database/data warehouse design concepts</li>\n<li>Setting standards and best practices for a growing engineering organization</li>\n<li>Experience with Test Driven Development</li>\n<li>Understand advanced algorithms and data structures</li>\n<li>Experience building API services</li>\n<li>Experience with AWS, Hadoop, Spark, and Kafka or Kinesis</li>\n<li>Experience in building high-performance, reliable and scalable services</li>\n<li>Experience in Agile Methodology</li></ul></div>\n\n\nWhat's In It for You<div>\n\n\n<ul>\n<li>Competitive salary and stock options</li>\n<li>A comprehensive benefits package to meet the needs of you and your family</li>\n<li>Unlimited paid time off</li>\n<li>Corporate gym access</li>\n<li>Daily breakfast, weekly team lunches, and an endless supply of snacks</li>\n<li>Numerous career possibilities that allow you to grow with us</li>\n<li>Talented and motivated team members who care deeply about one another, our mission and our customers</li>\n<li>The rare opportunity to create a new world. We inspire one another every day to do meaningful work that solves big societal challenges</li></ul></div>\n\n\n<div>\nSo, if you are a Modern Data Architect with experience, please apply today!</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}