{"job title": "Sr. Python Data Engineer", "company": "CyberCoders", "city state": "– San Francisco, CA", "rating": "3.9", "job description": "Sr. Python Data Engineer <div>\nWe are seeking a talented Python Data Engineer to join our team building an AI-based website optimization product. If this sounds intriguing, please keep reading!\n<br><br>\nBased in San Francisco, CA we have brought together a team of world-renowned experts in AI and Machine Learning to build the world's fastest and most distributed computational AI platform. Companies are leveraging our platform for scientific research, business intelligence, finance and robust web marketing. Now that we have secured an incredible level of funding from some of the most influential investors in the world, we are looking to scale out our B2B services. This particular product improves conversion rates on eCommerce sites for our customers, by conducting automated A/B tests at AI scale.</div>\n<br>\nWhat You Will Be Doing<div>\nAs an integral part of our R&amp;D and web optimization product team, your challenge will be to understand our data needs, architect an effective solution from the ground up, and then build it, all in conjunction with data scientists, core engineers, and architects.</div>\n<br>\nTop Reasons to Work with Us<div>\n\n\n<ul>\n<li>) We have closed our largest round of funding to date and are scaling out our team, products and revenue streams</li>\n<li>) At the forefront of artificial intelligence, we are evolving technology and business with never-before-seen capabilities.</li>\n<li>) We offer top market salaries, stock, benefits, part-time telecommute options, bonuses, 401K and more!</li></ul></div>\n\n\nWhat You Need for this Position<div>\n\n\n<ul>\n<li>Bachelor's Degree in Computer Science (or closely related)</li>\n<li>6+ years of professional experience developing a combination of data and server technologies</li>\n<li>2+ years of Python development experience</li>\n<li>Experience working with a range of data systems (e.g., Spark, Cascading, Hadoop, Hive, Pig, Storm, ElasticSearch)</li>\n<li>Deep knowledge of relational, structured, semi-structured and unstructured data systems and when to use each type of system</li>\n<li>Experience building scalable, distributed systems with microservices architecture</li>\n</ul>\n\n<strong>Bonus:</strong>\n\n\n<ul>\n<li>Experience with RESTful services, JSON and XML metadata, Docker containers.</li>\n<li>Experience with evolutionary algorithms, or machine learning.</li>\n<li>Experience with AWS, the Netflix stack, and microservices.</li>\n<li>Knowledge of and an appreciation for open source projects, design patterns, and enterprise architecture patterns.</li></ul></div>\n\n\nWhat's In It for You<div>\n\n\n<ul>\n<li>Take-as-you-need vacation!</li>\n<li>10 company holidays</li>\n<li>Telecom reimbursement</li>\n<li>Tons of snacks and beverages</li>\n<li>Catered educational lunches every Tuesday</li>\n<li>Catered lunch every Friday</li>\n<li>Super-convenient location near BART, Caltrain, Muni, Ferries</li>\n<li>Team Events, Happy Hours, Holiday Parties, more.</li></ul></div>\n\n\n<div>\nSo, if you are a Sr. Level Data Engineer with Python skills, please apply today!</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}