{"job title": "Linux MySQL Engineer", "company": "Datto Inc.", "city state": "– Norwalk, CT", "rating": "3.6", "job description": "At Datto, our mission is to be a hero to the companies we serve, 24/7/365. Datto solutions safeguard businesses from IT disasters, human error, and malicious activity. With Datto defending business data, we promise our partners business continuity with uninterrupted access to data on-site, in transit, and in the cloud. Whether it's helping them over the phone or sending our Disaster Response Team to the rescue, we are committed to keeping data safe, recoverable, and accessible. It's this commitment that has made us the world's leading provider of MSP delivered IT solutions. Datto is headquartered in Norwalk, CT, with offices worldwide.\n<br><br>\n<strong>A look inside the job:</strong>\n\n<ul>\n<li>Participate in the architecting, installation, and operation of numerous MySQL databases</li>\n<li>Create, automate, provision, and deploy Linux-based MySQL systems</li>\n<li>Ensure system stability, scalability, security, and performance</li>\n<li>Create and maintain documentation surrounding our infrastructure</li>\n<li>Think out of the box and solve complex scaling challenges</li>\n<li>Work with developers to construct solutions to analytics problems</li>\n<li>Explore alternatives, like Cassandra, Redis, and Elasticsearch, when MySQL is the wrong data store for the use case</li>\n</ul>\n<strong>About You:</strong>\n\n<ul>\n<li>Engineering degree not required</li>\n<li>Demonstrated interest in database engineering, including summer work, school work or a personal project</li>\n<li>2+ years of experience with Linux administration and configuration; Ubuntu preferred</li>\n<li>Some experience with MySQL or PostgreSQL (or a strong willingness to learn)</li>\n<li>Experience troubleshooting Linux performance and stability issues</li>\n<li>Experience with scripting and systems automation (Bash, Python, Perl, Awk, etc.)</li>\n<li>The ability to work effectively under pressure in a fast-paced environment</li>\n<li>Strong verbal and written communication skillsdocumentation skills mandatory</li>\n<li>Great diagnostic expertise including problem investigation, root-cause analysis, and resolution skills</li>\n<li>The desire and ability to see a problem through to a complete solution</li>\n<li>The ability to quickly acquire new skills and thrive in a team-based environment</li>\n<li>The ability to leave attitude at the door, be receptive to new ideas and be able to switch projects at the drop of a hat</li>\n<li>A professional and courteous attitude</li>\n<li>The ability to effectively manage time and push multiple projects at once</li>\n<li>A willingness to perform other related duties as assigned</li>\n<li>Being willing to travel on a limited basis as required</li>\n<li>Being available for off hours/on-call support; needed</li>\n</ul>\nAt Datto, we believe YOU are our greatest strength! We know that exceptional results rarely come from ordinary effort and our work hard, play hard attitude creates an atmosphere where you can do your life's work. Be inquisitive! Be irreverent! Be bold! Datto believes in building a foundation that helps each other succeed. We are a team that respects and trusts each other, and we do the right thing by putting our customers first. We also believe in work-life balance. Go on vacation using your unlimited time off. Sign up for a class on us with our education reimbursement program. Try that new gym everyone's been talking about. We'll help with our fitness reimbursement program. To see our full listing of open positions check out datto.com/careers today!\n<br><br>\nBy submitting an application, you acknowledge we will process your data in order to consider you for the position you apply for and for other open positions within our company for which you may be suited. We collect and store your data in accordance with our Recruiting Privacy Practices."}