{"job title": "Dell Career ReStart - Senior Software Engineer IT", "company": "Dell", "city state": "– Round Rock, Texas", "rating": "3.8", "job description": "Dell provides the technology that transforms the way we all work and live. But we are more than a technology company we are a people company.\n<br><br>\nDell is excited to be launching Dell Career ReStart. This program provides weeks of support and training for a smooth transition back into the workforce. Eligible candidates are experienced professionals who have taken a 12-month+ career break.\n<br><br>\nIn this program, we will put your professional and life skills back to work with an unprecedented level of support including:\n<br><br>\n• Mentoring and coaching\n<br><br>\n• On-the job training\n<br><br>\n• Personalized development plans for quick skill lift (technical, business, and/or professional)\n<br><br>\n• Other preparative offerings during the first few months to provide foundational support for success\n<br><br>\n• High touch orientation across locations\n<br><br>\nLearn more about the Dell Career ReStart Program <strong>here</strong>.\n<br><br>\n<strong><strong>Senior Software Engineer Digital-IT</strong></strong>\n<br><br>\n<strong><strong>Why Work at Dell?</strong></strong>\n<br><br>\nWe are a team of passionate technologists and innovators that will build and deliver a modern, global, cloud-based, omni-channel commerce platform delivered in an agile way. If you are someone who thrives on the creative process, problem solving, and building innovative solutions then Dell Digital is the environment for you.\n<br><br>\n<strong><strong>What you will love about this job:</strong></strong>\n<br><br>\nYou will get to be part of the Digital IT team looking to change the way we do business and deliver products in a faster more efficient way. You will feel like youre working in a start up with the stability and knowledge of the best technology company in the world.\n<br><br>\nIn the Digital Transformation Program youll work closely with other designers, developers, researchers, architects, and business stakeholders to achieve the design objectives for each concept. This transformation program has three primary goals:\n<ul>\n<li><strong><strong>Establish</strong></strong> a modern, global, cloud-based, omni-channel commerce platform.</li><li><strong><strong>Enable</strong></strong> new capabilities, and seamless user experiences across product, marketing, commerce and services. New capabilities and experiences include, but are not limited to, personalized mobile &amp; web purchasing, AR driven sales and support, voice-enabled purchase assistance, and support for Internet of Things (IoT).</li><li><strong><strong>Empower</strong></strong> all Dell Technologies businesses to utilize and build on the core commerce platform to create experiences to meet their customer and business needs.</li>\n</ul>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Develops high availability and highly scalable applications which will be used by both internal and external customers.</li>\n<li>Works with clients and Business Analysts to determine software requirements and system impacts</li>\n<li>Generates technical documentation as well as unit and functional tests</li>\n<li>Analyzes business requirements, processes, data, and system integration points to determine/recommend appropriate technology solutions</li>\n<li>Works closely with the global development team, other senior Solution Architects, and executives within the Online Product Engineering group to plan ongoing feature development, product maintenance, and management of development teams</li>\n</ul>\n\n<strong><strong>Qualifications:</strong></strong>\n\n\n<ul>\n<li>Engineering Degree in Computer Science/Engineering, or equivalent professional experience.</li>\n<li>Typically requires 4+ years of related experience in a professional role with a Bachelors degree; or 2+ years with a Masters degree; or a PhD with no experience; or equivalent experience.</li>\n<li>Strong commitment to writing and maintaining high quality Java code</li>\n<li>Understanding of Spring Framework fundamentals</li>\n<li>Solid understanding of Microsoft Stack</li>\n<li>Strong communication skills</li>\n</ul>\n\n<strong><strong>Desired Skills:</strong></strong>\n\n\n<ul>\n<li>Experience contributing to open source projects</li>\n<li>Established background in public speaking at user groups, conferences, etc.</li>\n<li>Experience with cloud native architectures and infrastructure\n<br><br>\n<strong><strong>Dell offers:</strong></strong>\n<br><br>\n- Opportunity to work with a strong brand at one of the world's largest IT solutions providers\n<br><br>\n- Competitive compensation and benefits plans including bonus, 401K match and generous time away allotment.\n<br><br>\n- Dynamic, challenging, international work environment\n<br><br>\n- A team with a high level of energy, integrity and motivation to win\n<br><br>\n- Exciting internal career opportunities with an individual professional development plan\n<br><br>\n- A commitment to diversity and inclusion\n<br><br>\n<strong>Dell</strong> is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Learn more about Diversity and Inclusion at Dell here.</li>\n\n</ul>"}