{"job title": "Sr Principal SW Engineer-Ecommerce", "company": "Dell", "city state": "– Austin, Texas", "rating": "3.8", "job description": "Why Work at Dell?\n<br><br>\nAbout Us\n<br><br>\nDell is a collective of customer-obsessed, industry-leading visionaries. At our core is a commitment to diversity, sustainability and our communities. We believe in working together to build a brighter future, celebrating the entrepreneurial spirit that lives inside us all, and marrying innovation with action. Dell is proud to offer unparalleled growth and development opportunities for our team members. We believe that technology is essential for driving human progress, and were committed to providing that technology to people and organizations everywhere, so they can transform the way they work and live. We cant wait for you to discover this for yourself as a Sr Principal Software Engineer on our Dell Digital team.\n<br><br>\nWhen you choose our company, you join a diverse world of innovative thought leaders. At our core is a commitment to workplace diversity, the sustainability of our planet, and community corporate involvement. We offer highly competitive salaries, bonus programs, world-class benefits, and unparalleled growth and development opportunities-all to create a compelling and rewarding work environment.\n<br><br>\n<strong>Sr Principal SW Engineer,Round Rock,TX</strong>\n<br><br>\nWhat you will love about this job:\n<br><br>\nYou will get to be part of the Digital IT team looking to change the way we do business and deliver products in a faster, more efficient way. You will feel like youre working in a start up with the stability and knowledge of the best technology company in the world.\n<br><br>\nAs part of the digital transformation team, youll work closely with other designers, developers, researchers, architects, and business stakeholders to achieve the design objectives for each concept. This transformation program has three primary goals:\n<br><br>\n•Establish a modern, global, cloud-based, omni-channel commerce platform\n<br><br>\n•Enable new capabilities, and seamless user experiences across product, marketing, commerce and services. New capabilities and experiences include, but are not limited to, personalized mobile &amp; web purchasing, AR driven sales and support, voice-enabled purchase assistance, and support for Internet of Things (IoT)\n<br><br>\n•Empower all Dell Technologies businesses to utilize and build on the core commerce platform to create experiences to meet their customer and business needs\n<br><br>\nResponsibilities:\n<br><br>\n- Develops high availability and highly scalable applications which will be used by both internal and external customers\n<br><br>\n- Works with clients and Business Analysts to identify software requirements and system impacts\n<br><br>\n- Generates technical documentation as well as unit and functional tests\n<br><br>\n-Evaluate business requirements, processes, data, and system integration points to assess/recommend appropriate technology solutions\n<br><br>\n- Works closely with other teams and managers to plan ongoing feature development, product maintenance, and management of development teams\n<br><br>\n-Influence outcomes, facilitate discussions and present information to business leaders and stakeholders\n<br><br>\nQualifications:\n<br><br>\n-Typically requires 12+ years of related experience in a professional role with a Bachelors degree; or 8+ years with a Masters degree; or 5+ years with a PhD; or equivalent experience\n<br><br>\n-Strong commitment to writing and maintaining high quality Java code\n<br><br>\n-Understanding of Spring Framework fundamentals\n<br><br>\n-Solid understanding of Microsoft Stack and Open Source technologies\n<br><br>\n-Strong communication skills\n<br><br>\nDesired Skills:\n<br><br>\n-Computer Science Degree\n<br><br>\n-Experience contributing to open source projects\n<br><br>\n-Experience with cloud native architectures and infrastructure\n<br><br>\nDell is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy), sexual orientation, gender identity and/or expression, national origin, protected veteran status, disability, genetics, or citizenship status (when otherwise legally authorized to work) and will not be discriminated against on the basis of such characteristics or any other status protected by the laws or regulations in the locations where we operate. Dell encourages applicants of all ages."}