{"job title": "Site Reliability Engineering Solutions Architect Dell Data Security DevOps", "company": "Dell", "city state": "– Richardson, Texas", "rating": "3.8", "job description": "<strong>Job Title</strong>\n<br><br>\nSite Reliability Engineering Solutions Architect Dell Data Security DevOps\n<br><br>\n<strong>Location</strong>\n<br>\nRichardson, TX\n<br><br>\nDell provides the technology that transforms the way we all work and live. But we are more than a technology company we are a people company. We inspire, challenge and respect every one of our over 100,000 employees. We also provide them with unparalleled growth and development opportunities. We cant wait for you to discover this for yourself as a Site Reliability Engineering Solutions Architect on our Dell Data Security DevOps team in Richardson, TX.\n<br><br>\nThe Software Engineering team delivers next-generation software application enhancements and new products for a changing world. Working at the cutting edge, we design and develop software for platforms, peripherals, applications and diagnostics all with the most advanced technologies, tools, software engineering methodologies and the collaboration of internal and external partners.\n<br><br>\n<strong>Key Responsibilities</strong>\n<ul>\n<li>Collaborate with other team members to provide innovative solutions to complex problems</li><li>Design, develop, and implement tools and solutions to support agile development process</li><li>Evaluate new technologies and integrate those that add value and drive efficiency</li><li>Develop tools and plugins that leverage cloud-based VMs for automated testing</li><li>Drive scale and stability improvements to existing build tools and processes</li>\n</ul>\n<strong>Essential Requirements</strong>\n<ul>\n<li>BS or MS in Computer Science or Computer Engineering</li><li>Strong understanding of cloud technology (especially AWS) with a broad understanding of infrastructure and AWS Ecosystem technologies.</li><li>Significant experience in the design of distributed, high availability server-based network computing infrastructures; AWS and Azure design, build and/or operational experience.</li><li>Knowledge and experience with object orientated programming languages such as Java, C#, C/C++</li><li>Understand the concepts and best practices related to application lifecycle process, agile development, secure development, use of cloud, DevOps, high availability, disaster recovery, monitoring and automation, change management</li><li>Must be highly motivated and willing to work and learn in a team environment</li><li>Must have strong communication skills</li><li>Must be able to work with minimal day-to-day direction</li>\n</ul>\n<strong>Desirable Requirements</strong>\n<ul>\n<li>Demonstrated leadership experience in Software Development teams</li><li>Familiar with agile development tools such as JIRA, Confluence, Bamboo and Jenkins</li><li>Experience with Python, Powershell, Docker, Kubernetes, Puppet, Chef</li><li>Good understanding of Linux tools and administration AWS certifications</li>\n</ul>\n<strong>Benefits</strong>\n<br>\nWe offer highly competitive salaries, bonus programs, world-class benefits, and unparalleled growth and development opportunities all to create a compelling and rewarding work environment.\n<br><br>\nIf youre ready to develop cutting-edge software for a changing world, this is your opportunity to develop with Dell.\n<br><br>\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Learn more about Diversity and Inclusion at Dell here."}