{"job title": "Dell Sr. Software Engineer - Automation", "company": "Dell", "city state": "– Austin, Texas", "rating": "3.8", "job description": "Senior Principal Software Engineer - Automation<br><br>Dell provides the technology that transforms the way we all work and live. But we are more than a technology company we are a people company. We inspire, challenge and respect every one of our over 100,000 employees. We also provide them with unparalleled growth and development opportunities. We cant wait for you to discover this for yourself as a Senior Principal Software Engineer on our Robotic Process Automation Center of Excellence (CoE) team in either Austin, Texas or Franklin, Massachusetts.\n<br><br>\n<strong>Competitive salary</strong>\n<br><br>\n<strong>Key Responsibilities</strong>\n<ul>\n<li>Working with the RPA CoE team as well as the business unit to convert business requirements to automations</li><li>Develops software solutions by studying information needs; conferring with users; studying systems flow, data usage, and work processes; investigating problem areas; following the software development lifecycle</li><li>Define &amp; build the automation/workflow solutions through distribution, release &amp; deployment</li><li>Managing and supporting multiple projects</li><li>Review and assess new technologies as they apply to process automation and managing the digital workforce</li>\n</ul>\n<strong>Essential Requirements</strong>\n<ul>\n<li>Engineering web development, all layers, from database to services to user interfaces</li><li>Experience in Java, C#, .NET, and MS SQL and Oracle with database analysis and design</li><li>Experience in SOAP, WSDL, REST APIs, python, C/C++ and/or scripting</li><li>Experience in Web services security</li><li>Experience in developing data queries for existing databases or data repositories,</li><li>Good understanding of SDLC processes, spanning requirements/issue management, defect tracking, source control, and release management.</li> <li>Ability to think strategically, but also possess technical skills to implement new solutions.</li> <li>Strong technical, interpersonal, negotiation, communication, presentation, documentation and problem solving skills</li><li>Ability to act independently, take initiative and drive tasks and issues to resolution</li><li>Bachelors in Computer Science, Software Engineering, or related field</li><li>10+ Years of software development experience</li>\n</ul>\n<strong>Desirable Requirements</strong>\n<ul>\n<li>Minimum of 2 Years RPA Experience</li><li>Familiarity with the latest Data Science technologies</li><li>Masters in Computer Science</li><li>5+ Years of Data Engineering Experience</li>\n</ul>\n<strong>Benefits</strong>\n<br>\nWe offer highly competitive salaries, bonus programs, world-class benefits, and unparalleled growth and development opportunities all to create a compelling and rewarding work environment.\n<br><br>\nIf youre ready to develop cutting-edge software for a changing world, this is your opportunity to develop with Dell.\n<br><br>\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Learn more about Diversity and Inclusion at Dell here."}