{"job title": "Cloud Infrastructure Engineer", "company": "Deltek", "city state": "– Herndon", "rating": "3.6", "job description": "Pncpl Software Architect\n<br><br>\n13-Jun-2018\n<br><br>\n<strong>Company Summary</strong>\n<br>\nDeltek is the leading global provider of enterprise software and solutions for government contractors, professional services firms and other project-based businesses. For decades, we have delivered actionable insight that empowers our customers to unlock their business potential. 22,000 organizations and millions of users in over 80 countries around the world rely on Deltek to research and identify opportunities, win new business, recruit and develop talent, optimize resources, streamline operations and deliver more profitable projects. Deltek. Know more. Do more.® www.deltek.com\n<br><br>\n<strong>Auto req ID</strong>\n<br>\n<strong>3988BR</strong>\n<br><br>\n<strong>External Job Title</strong>\n<br>\nCloud Infrastructure Engineer\n<br><br>\n<strong>Position Responsibilities</strong>\n\n\n<ul>\n<li>Architect, implement and manage cloud server/storage deployments including promotion process, image management, data transfers, backup/restore, HA/DR</li>\n<li>Develop tools for infrastructure management and automation</li>\n<li>Monitor system stability and performance and ensure system availability, reliability, and usability</li>\n<li>Troubleshoot complex problems, provide software fault diagnosis resolve operational issues, and interact with vendors, etc.</li>\n<li>Provide advanced solution design including server and disk space provisioning</li>\n<li>Provide monitoring solution for system resource utilization, trending, and capacity planning</li>\n<li>Provide solution for database management and tuning activities</li>\n<li>Define and document system architectures, systems configurations, and technical operational processes and policies</li>\n<li>Create and implement monitoring, procedures, tools and standards related to system and application security (e.g. intrusion detection, denial of service, configuration change, cross site scripting, SQL injection, OS patching, etc.)</li>\n</ul>\n\n<strong>Work Location</strong>\n<br>\nUS HDQ-Herndon, VA\n<br><br>\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Computer Science Degree (or Computer Science Masters)</li>\n<li>5+ years experience in a technical field</li>\n<li>2+ years experience as a system administrator</li>\n<li>2+ years experience administering SaaS Based products</li>\n<li>Diverse range of technical and operational interests and capabilities, including Microsoft, Java/J2EE, Ruby on Rails, LAMP, MySQL, SQL Server, Oracle, virtualization, monitoring, automation technologies</li>\n<li>Extensive experience with public cloud providers, AWS (Amazon Web Services) is preferred.</li>\n<li>Senior level experience with Windows Server 2012, SQL Server 2012, Linux CentOS, MySQL, IIS, Apache, Tomcat</li>\n<li>Expert knowledge of DNS, Load Balancing, DB Clustering, and High Availability as it related to all tiers of architecture</li>\n<li>Strong background in scripting: PowerShell, python, node.js</li>\n<li>Experience with automated deployment technologies</li>\n<li>Experience with enterprise monitoring and management tools</li>\n<li>Ability to work in high pressure, highly flexible environment against both short and long term requirements</li>\n</ul>"}