{"job title": "Test Engineer, Senior Staff", "company": "Inphi Corporation", "city state": "– Irvine, CA, United States", "rating": "3.7", "job description": "<strong>Test Engineer, Senior Staff</strong>\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\n* Responsible for implementing and validating production and characterization ATE solutions\n<br><br>\n* Work with the design and product development teams to define testability, verification, and characterization plans and implement ATE tests\n<br><br>\n* Develop production-worthy ATE hardware (board/socket) which involves working with simulation and design teams to close the signal integrity simulation to meet required performance.\n<br><br>\n* Define the DFT requirements working with design teams to achieve high digital/analog test coverage at low cost of test.\n<br><br>\n* Sustain existing bench test platforms running high speed tests and make improvements.\n<br><br>\n* Work with planning and product engineering to support customer sampling requirements.\n<br><br>\n* Contribute to continuous process improvement activities within PTE team\n<br><br>\n* Target product cost reduction efforts through test time reduction and multisite testing.\n<br><br>\n* Collaborate with Design, Product, Reliability Engineering and Supply Chain to meet NPI deliverables and milestones.\n<br><br>\n* Work with product engineering to characterize products and deliver timely and complete characterization reports with the goal of maximizing yield and outgoing quality levels for highly complex products.\n<br><br>\n* Work with PE to ensure NPI meets production release requirements and successful bring up at OSAT.\n<br><br>\n* Identify and drive production capacity improvement needs via test time reduction, first pass retest rate reduction, qualifying alternate sources....\n<br><br>\n* Support customer returns working laterally with Quality, Design and Test engineering in a timely manner.\n<br><br>\n<strong>Qualifications</strong><strong>:</strong>\n<br><br>\n* Solid academic credentials. MS degree in Electrical Engineering preferred.\n<br><br>\n* Minimum of 7 years relevant experience\n<br><br>\n* Proficiency with Teradyne UltraFLEX and/or Advantest 93K ATE platforms\n<br><br>\n* Mixed signal, SERDES and/or RF test experience, vector translation and debugging skills\n<br><br>\n* Experience with Lab equipment (VNA, spectrum analyzer, scope, BERT etc)\n<br><br>\n* Strong programming/coding skills (VBA, C, Python)\n<br><br>\n* Understanding of complex and high-performance test hardware\n<br><br>\n* Proven track record of transitioning products from NPI to volume production.\n<br><br>\n* Experience with complex data analysis using JMP, Galaxy, Data conductor, or other semiconductor yield tools.\n<br><br>\n* Proven track record of engineering leadership resulting in quantifiable improvements in quality, yield, cost or process.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}