{"job title": "Senior Product Manager, Data Center Automation Suite", "company": "Micro Focus", "city state": "– Sunnyvale, United States", "rating": "2.9", "job description": "<strong>Senior Product Manager</strong> <strong>for Data Center Automation</strong>\n<br><br>\nAt Micro Focus, everything we do is based on a simple idea: The fastest way to get results is to build on what you have. Our software solutions enable organizations to do just that. Secure and scalable, with analytics built in, they bridge the gap between existing and emerging ITfast-tracking digital transformations across DevOps, Hybrid IT, Security, and Predictive Analytics. In the race to innovate, Micro Focus customers have the clear advantage.\n<br><br>\n<strong>Our portfolio spans the following areas:</strong>\n<br><br>\nDevOps | IT Operations| Cloud | Security | Info Governance | Big Data, Machine Learning, &amp; Analytics\n<br><br>\nTake charge of your future and join our team as we go to market with a best-in-class portfolio that will help shape the worlds software landscape.\n<br><br>\n<strong>About the Role</strong>\n<br><br>\nThe Senior Product Manager for Data Center Automation (DCA) suite will be responsible for defining and executing the business strategy and help build the product road map for future versions in a highly competitive automation market for Server OS, Databases, Middleware, AWS and Hybrid Cloud technologies. This is an exciting , senior level position - an individual role -- within a highly collaborative team. Check out our web site for exciting news about the portfolio: https://software.microfocus.com/en-us/products/data-center-automation/overview.\n<br><br>\n<strong>The Senior Product Manager will:</strong>\n<ul>\n<li>Establish the product value proposition and vision, strategy and go-to-market (GTM) plan</li><li>Develop data-driven strategies to define specific market segment, create fiscal plan, and create direct/partners/channel plan to achieve the required growth</li><li>Serve as product expert for the portfolio</li><li>Work closely with the engineering team to bring product to market in a reasonable timeframe and end of life products when appropriate</li><li>Write epics and features, prioritize new features, build consensus, and coordinate product schedules with a team of engineers and ensure consistent delivery of user- centric experiences developed with measurable goals, grounded in needs, supported by data, in an iterative fashion</li>\n</ul>\n<strong>Education and Experience Required:</strong>\n<ul>\n<li>BA/BS degree from a highly respected academic institution, MBA preferred</li><li>At least 10 years experience in product management, technical marketing, pre-sales solution consulting, sales engineering, or professional services</li>\n</ul>\n<strong>Knowledge and Skills:</strong>\n<ul>\n<li>Experience in automation / orchestration of Data Center processes, Server OS, Database and Middleware technologies, public/private clouds (AWS, Azure, VMware-based private clouds) and the shift to cloud native application architectures</li><li>Experience driving software product life cycle in an Agile software development environment</li><li>Ability to act both strategically and tactically</li><li>Strong competitive drive, focused helping our team beat the competition</li><li>Demonstrated executive communication and presentation skills</li>\n</ul>\nIf you want to be part of what's next and find out more about our available opportunities, visit Micro Focus Careers.\n<br><br>\n#LI-SD1"}