{"job title": "Seeking Technical Project Engineer with PM responsibilities for a Connected Automotive Vehicle (CAV) team", "company": "OSI Engineering", "city state": "– Raymond, OH", "rating": "4.9", "job description": "<strong>JOB DESCRIPTION:</strong>\n<br>\nSeeking Technical Project Engineer with PM responsibilities for a Connected Automotive Vehicle (CAV) team in Raymond, Ohio\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Assist pilot deployment program management of Connected Automotive Vehicle (CAV) with collaboration from device vendors, industry consortiums, universities, and other internal departments.</li>\n<li>Conduct both in-lab and in-vehicle test and data analysis, report results.</li>\n<li>Engage CAV fleet participates through various activities such as conducting driver interview, create and distribute monthly news letter relevant to the CAV system, analyze fleet driver feedback, propose and implement improvements.</li>\n<li>Participate internal/external brainstorming meetings to generate new application ideas.</li>\n<li>Apply new communication technologies and/or new techniques to improve existing wireless technologies such as DSRC and/or cellular, for safety, mobility and other transportation related applications, in both real world and closed track testing environment.</li>\n<li>Help fleet management, and vehicle installation, and new feature implementation</li>\n<li>Understand wiring and layout if system is not functioning. Should be able to come up with diagnosis and solutions to fix.</li>\n<li>Help fleet management, and vehicle installation, and new feature implementation</li>\n<li>Assist with interacting with system and configurations.</li>\n</ul>\n\n<strong>Must Have Skillsets:</strong>\n\n\n<ul>\n<li>Engineering project implementation skill with at least 2 year industry work experience.</li>\n<li>C or C++ Programming skills</li>\n<li>Strong understanding of wireless connectivity, connected vehicle concept is a plus.</li>\n<li>Understand technology in general and experience implementing applications.</li>\n<li>Hardware skills, putting devices in car, and diagnose problems, Track progress, contact vendors, etc.</li>\n<li>Understand wiring and layout if system is not functioning. Should be able to come up with diagnosis and solutions to fix.</li>\n<li>General engineering experimental and analytical skills using common tools.</li>\n<li>Ability to interface devices at hardware level, especially within vehicle. For example: ability to build wiring harnesses and route wiring between the communication devices and the main ITS platform, design and build simple in-car mounting fixtures etc.</li>\n</ul>\n\n<strong>Desired Skillsets:</strong>\n\n\n<ul>\n<li>3+ years project engineering experience</li>\n<li>Familiarity with either telematics, networking, wired, wireless, in-vehicle, or V2V V2I communications protocols (examples: 3G, 4G LTE, 5G, UDP, IEEE802.11, CAN, V2V, V2I, V2X …)</li>\n<li>Programming for interfacing between devices (some examples: reading sensor via serial port, processing an analog signal)</li>\n<li>Experience programming within Unix-based operating systems, such as Linux</li>\n<li>Programming in Matlab</li>\n<li>Programming of embedded devices</li>\n<li>Traffic simulation tool such as sumo</li>\n</ul>\n\nType: Fulltime or Contract\n<br>\nLocation: Raymond, OH\n<br><br>\n<strong>CONTACT INFORMATION:</strong>\n<br>\nAlan Bui\n<br>\nalanb@OSIengineering.com\n<br>\n(408) 550-2800 x106\n<br>\n<strong>OSIJOBS</strong>"}