{"job title": "Systems Engineer", "company": "Raytheon", "city state": "– Hampton, Virginia", "rating": "3.7", "job description": "Raytheon Intelligence, Information and Services (IIS) is seeking a Systems Engineer to join our team in support of the Air Operations Center Weapon System (AOC WS) Long-Term Modification and Sustainment (LTM&amp;S) program. The position is located in Hampton, Virginia, at the US Air Force customer site.\n<br><br>\nThis position requires systems engineering experience with demonstrated expertise in the systems integration requirements of complex information technology systems and communications systems at the scale of a large operations center in a program with global reach. The successful candidate will serve as a member of a small team of systems engineers directly supporting the AOC Production Center (PC) Chief Technology Officer (CTO). This team will be responsible for the development and maintenance of the AOC Sustainment Technology Roadmap, as well as performing integration requirements analysis, supporting sustainment project planning and prioritization, and liaising with fielding and operational support personnel on variances to the AOC WS baseline driven by the unique technical requirements at AOC sites.\n<br><br>\nThe successful candidate will employ effective communication skills in face-to-face interactions with customers and other contractors. The candidate must be able to work independently, as well as collaborate in a team or working group setting. Domestic and international travel is required with expected travel at 10%.\n<br><br>\nThe successful candidate will be working closely with other team members and supporting day-to-day technical execution including:\n<ul>\n<li>Engage with key commercial product vendors and government providers of systems currently on or that are prospective candidates for the AOC WS baseline to collect information related to future technologies, development plans, schedules, and other details relevant to AOC WS baseline sustainment planning.</li><li>Maintain structured data supporting the AOC WS Technology Roadmap.</li><li>Prepare for and support periodic reviews of the AOC WS Technology Roadmap in coordination with the Government.</li><li>Obtain and analyze product or system documentation; place documents under data management control in government-provided environments.</li><li>Conduct tabletop systems engineering analysis of candidate changes to facilitate preliminary implementation planning, including scope, value, and dependencies.</li><li>Support Working Groups where candidate baseline changes to the AOC WS are considered and full baseline lifecycle system engineering requirements are addressed.</li><li>Support the maintenance of a prioritized backlog of candidate sustainment projects to account for emerging content and evolving needs.</li><li>Analyze proposed variances from the approved baseline for impact of requested program sustainment support.</li><li>Provide integration engineering support for program fielding efforts to accommodate site unique configuration requirements.</li><li>Participate in planning and analysis efforts relevant to program risk and opportunity management.</li>\n</ul>\n\n<strong><u>Required Skills:</u></strong>\n\n<ul>\n<li>Active/Current DoD Secret Clearance</li><li>Current Security+ Certification OR must be able to obtain Security + certification within 60 days of hire.</li><li>6 years of systems engineering and/or systems integration experience</li><li>Experience working in an Agile/DevOps environment</li><li>Familiarity with relevant DoD requirements for Cybersecurity, Test, etc., as applied to systems integration programs</li><li>Demonstrated understanding of technologies and systems relevant to the multi-domain baseline, including networking, computing, storage, and virtualization.</li><li>Experience in one or more relevant technical disciplines: system architecture, requirements management, systems integration, configuration management/data management, field service engineering</li><li>Experience in supporting the preparation of management-level briefings and summary explanations</li><li>Proven written and oral communication skills, including presentation and facilitation skills</li><li>Familiarity with DoD acquisition process and related programs and policies</li>\n</ul>\n\n<strong><u>Desired Skills:</u></strong>\n\n<ul>\n<li>AOC-specific system development, integration, test, certification, and/or fielding experience</li><li>Hands-on systems administration/network administration experience on relevant AOC baseline systems</li><li>Practical implementation of agile best-practices applied to large-team system development or systems integration projects, including participation in related activities such as sprint planning, scrum, backlog grooming, retrospective, etc.</li><li>Detailed system knowledge and experience in a technical role supporting key DoD C2 and ISR or commercial product infrastructure systems on the AOC baseline</li><li>Experience using automation tools and metrics in managing processes</li><li>Experience in risk and opportunity management</li><li>Experience in conducting trade studies</li>\n</ul>\n<strong><u>Required Education:</u></strong>\n<br>\nBS in a relevant engineering, math, or hard sciences field with 6 years of related work experience. Masters with a minimum of 4 years of functional area experience.<br><br>119165BR 119165<br><br>Raytheon is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, sex, sexual orientation, gender identity, national origin, disability, or protected Veteran status."}