{"job title": "Principal Systems Engineer", "company": "Raytheon", "city state": "– McKinney, Texas", "rating": "3.7", "job description": "Raytheon Integrated Defense Systems (IDS) is seeking motivated and capable systems engineers with a track record of successfully developing Built-In Test and Diagnostics for advanced ground based radar systems. The successful candidate will have experience in requirements design, analysis, documentation, development and integration of Built-In test and diagnostics for systems. This position includes supporting existing and new military programs.\n<br><br>\nThis role may include supporting customer demonstrations and software/systems integration and testing related travel. Qualified candidate must have an existing DOD Secret Clearance.\n<br><br>\nResponsibilities include but are not limited to:\n\n<ul>\n<li>Collaborate on the development of effective testability, Built-In test (BIT), and diagnostic technical solutions</li><li>Develop BIT, testability and diagnostic associated requirements</li><li>Perform testability analyses to verify diagnostic effectiveness and facilitate troubleshooting activities at all levels of factory test and maintenance</li><li>Confer with hardware/software design teams to define sub-system failure modes, their effects on the system, and associated detection and isolation methodologies</li><li>Collaborate with hardware/software design teams to develop diagnostic test capabilities</li><li>Participating in trade study investigations to optimize the design for diagnostics</li><li>Develop source data for design reviews and customer presentations</li><li>Generate formal reports to document analytical results</li><li>Develop BIT Algorithm Description Documents</li><li>Provide technical support for systems planning, execution, and documentation activities</li>\n</ul>\n\n<strong>Required Skills:</strong>\n\n<ul>\n<li>Minimum 8 years of related experience</li><li>Experience with testability analysis tools</li><li>Experience in failure modes and mechanisms related complex system designs</li><li>Experience working with and interpreting interfaces between hardware and software</li><li>Experience in working with software/firmware development and implementation</li><li>Experience performing circuit analysis and evaluating circuit designs</li><li>Experience with mechanical CAD authoring or design evaluation</li><li>Experience with product testing and troubleshooting in the factory/depot or field environment</li><li>Experience with testability/diagnostics aspects of system development engineering</li><li>Experience applying systems principles, processes, and analysis</li><li>Experience analyzing data from a variety of sources using standard modeling tools</li><li>Proficiency with Microsoft Office applications</li><li>Experience working across multiple organizational levels</li><li>Ability to obtain DoD Secret Clearance</li><li>U.S. Citizenship</li>\n</ul>\n\n<strong>Desired Skills:</strong>\n\n<ul>\n<li>Existing DoD Secret clearance</li><li>Ability to function well in a high pressure multi-tasking environment</li><li>Radar system experience</li><li>Possess strong people and change agent skills</li><li>Diagnostic dependency modeling experience</li><li>Experience working in the DoD customer community (US Army, US Air Force, US Navy)</li>\n</ul>\n\n<strong>Required Education:</strong>\n\n<ul>\n<li>BS degree in electrical or systems engineering, physics or related technical field.</li>\n</ul>\n\n<strong>Desired Education:</strong>\n\n<ul>\n<li>MS degree in electrical or systems engineering, physics or related technical field.</li>\n</ul>\n\n110896BR 110896<br><br>Raytheon is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, sex, sexual orientation, gender identity, national origin, disability, or protected Veteran status."}