{"job title": "Software Engineer", "company": "Satcom Direct, Inc.", "city state": "– Melbourne, FL, US", "rating": "3.3", "job description": "<div>SATCOM DIRECT (SD) offers world-class global communications services, support, and technology to business and general aviation, military, government, emergency response, media, and others who depend on reliable, global communications. We support customers via locations around the globe including our world headquarters and network operations center (NOC) located in beautiful Melbourne, Florida.</div><br>\n\n<div>Our company culture is based on innovation and creativity which allows our team members to thrive in a lively and dynamic atmosphere. We offer our employees a dynamic environment with an excellent benefits package including health and dental insurance, 401(k) retirement plan and highly competitive compensation. SD hires team players with a high level of professionalism that demonstrate a positive attitude and an overall willingness to get the job done. We are looking for people who are passionate about customer satisfaction and who excel in a rapidly changing technology environment.</div><br>\n<div><strong>JOB SUMMARY</strong></div><br>\n<div>This is a contractor position. We are seeking a full-stack Angular/C#.NET web developer to assist our scrum teams with developing a customer facing web application. The successful candidate will be responsible for writing high quality, innovative, fully testable, and highly performing web applications, web services, and SQL queries.</div><br>\n\n<div><strong>RESPONSIBILITIES</strong></div><br>\n<div>\n\n<ul>\n<li>Team player (professional, dependable, positive, approachable, helpful, thoughtful, can do attitude is a must)</li>\n<li>Solid understanding and experienced with full stack development of enterprise and commercial web applications</li>\n<li>Create, maintain and support web applications</li>\n<li>Develop responsive web sites using the latest technologies</li>\n<li>Analyze software performance and complete troubleshooting and debugging to appropriately identify and correct issues</li>\n<li>Write well designed, testable, efficient code by using best software development practices</li>\n<li>Analyze and refine requirements</li>\n<li>Create and maintain software documentation</li>\n<li>Agile Scrum experience required</li>\n<li>Proven strong analytical skills</li>\n<li>Proven written and verbal communication skills</li>\n<li>Successful candidates must successfully complete a background check and drug test</li>\n</ul>\n</div><br>\n\n<div><strong>QUALIFICATIONS</strong></div><br>\n<div>\n\n<ul>\n<li>Bachelor of Science degree in a related discipline preferred</li>\n<li>5+ years full-stack web application development experience in the Microsoft stack</li>\n<li>Full-stack web application development in the Microsoft stack</li>\n<li>AngularJS 1.5 and Angular 2+</li>\n<li>C#.NET</li>\n<li>Bootstrap</li>\n<li>HTML5 / CSS3</li>\n<li>ASP.NET MVC 4+</li>\n<li>WCF and/or Web API</li>\n<li>AJAX</li>\n<li>JSON</li>\n<li>JavaScript</li>\n<li>JQuery (a plus but not required)</li>\n<li>Visual Studio 2017</li>\n<li>SQL Server</li>\n<li>Linq</li>\n<li>SQL</li>\n<li>Unit testing</li>\n<li>TFS and/or Git</li>\n<li>Jira and/or TFS</li>\n<li>Willingness to code review and QA other team members' work</li>\n<li>Troubleshooting and Debugging</li>\n</ul>\n</div>\n<br>\n<div><div>SD is an Equal Opportunity Employer and is committed to hiring the most qualified candidates for approved company positions, without preference to any individual on the basis of race, color, age, religion, gender, sexual orientation, disability, or national origin. Our policy is to engage in recruitment and selection practices that are in compliance with all applicable federal and state employment laws. SD and its businesses follow talent acquisition practices that identify qualified and diverse candidates, promote opportunities for employee development, and provide equal employment opportunity for all applicants and employees.</div>\n</div>"}