{"job title": "Sr Engineer, Voice", "company": "Sysco", "city state": "– Houston, TX, United States", "rating": "3.3", "job description": "<strong>Sysco Associate Apply - Click Here</strong>\n<br><br>\nCompany: CORP Enclave\n<br>\nLocation: US-TX-Houston\n<br>\nZip Code: 77077\n<br>\nMinimum Level of Education: Bachelor's Degree\n<br>\nMinimum Years of Experience: 8\n<br>\nPosition Type: Exempt\n<br>\nTravel Percentage: 0\n<br><br>\n<strong>More information about this job:</strong>\n<br><br>\n<strong>OVERVIEW:</strong>\n<br>\nAt Sysco, we offer our associates the opportunity to grow personally and professionally, to contribute to the success of a dynamic organization, and to serve others in a manner that exceeds their expectations. We are looking for talented, hard-working individuals to join our team. Come grow with us and let us show you why good things really do come from Sysco.<br><br><strong>POSITION SUMMARY:</strong>\n<br><br>\nNetwork Services team works to enable our business to lead in a market that is increasingly enhanced by technology, Sysco is undertaking a substantial technology transformation in the area of Networking and Voice Cloud Services. Sysco currently has an opportunity for a Sr Voice Engineer. <strong><br><br>RESPONSIBILITIES:</strong>\n\n<ul>\n <li> Report to the Network Services Manager as a Voice Subject Matter Expert (SME) </li><li> Lead both simple to complex projects start to finish with proper documentation as required (SOWs &amp; As build Visio diagrams) </li><li> Evaluate, design, consult, and maintain technical and complex aspects of the existing and proposed voice telecommunication systems that will reside in the cloud. </li><li> Designs, oversee implementation, direct contractors, provided status reports, and maintain highly advanced Voice strategies to meet a broad spectrum of business needs </li><li> Provides support to the Sysco Enterprise for voice based services including Cloud based solutions </li><li> Partner and work with 3rd party teams and vendors </li><li> Support the user community (via Remedy tickets), and provide recommendations </li><li> Manage the designs and implementation of voice based solutions or modifications for the Sysco Enterprise </li><li> Operate as a Level 2-3 Voice Engineer </li><li> Assist and Lead efforts with Call Center Technology </li><li> Oversee the operation aspects of Voice based systems with vendors and managed service providers </li><li> Manages relationships between telecommunications carriers, vendors, managed services, and users </li><li> Act as team lead, perform configuration as required, or project manager on projects. </li><li> Establish an communicate objectives and direction for projects </li><li> Manage project schedules, BOMs, costs, and configurations </li><li> Conduct user training as required </li><li> Oversee the efforts of contract staff or managed services </li><li> Manage and support Call Center solutions </li><li> Vendor based number management for 1800s and DID/DOD (Example AT&amp;Ts Route-IT) </li><li> Place orders with Vendors, prepare Changes controls, Purchase Request, Produce BOM, order circuits, and MAC for Voice services </li><li> Design, implement, maintain, recommend, and support local and remote portions of the Sysco enterprise Voice Solutions. </li><li> Creates and maintains detailed project plans, scopes of work, diagrams, and other technical documentation of the enterprise voice network. </li><li> Provide timely project status updates to customers, project managers, and management. </li><li> Understanding of LAN, WAN, QOS, Security, and DataCenter related operations and configurations. </li><li> Participate in the ongoing support and maintenance of existing voice infrastructure. </li><li> Work in an enterprise IT environment with specific tasks related to Voice. Conduct regular compliance assessments of the enterprise voice environment. </li><li> Participate in design and strategy meetings for assigned IT projects for the enterprise voice network. </li><li> Work with various IT and business based groups as a subject matter expert (SME). </li><li> Perform complex problem isolation within the voice infrastructure and Voice services </li><li> Provide continuous research, assessment, recommendations, and implementation of new technologies as needed by the Sysco organization. </li><li> Expected to be available 24X7X365 as required to maintain the enterprise infrastructure. </li><li> Participate in an enterprise infrastructure On-call rotation. </li><li> Participate in an advisory role with other IT and Business based groups as it relates to Voice. </li><li> Lead implementation efforts across the enterprise and insure that projects are executed according to design, within project timeframes, and budget. </li><li> Develops and recommends strategies for growth, direction, and other enhancements by maximizing functionality of voice infrastructure. </li><li> Conduct, research, and recommend solutions as it relates to capacity planning for the enterprise voice network. </li><li> Support the campus environments as required and locations nationwide. </li><li> Develop operational knowledge of voice-based tools that support the enterprise voice network environments worldwide. </li><li> Working knowledge of Voice Tools to support Voice Environment. </li><li> Additional duties as assigned by the Network Services Leadership Team.\n</li></ul>\n<strong>QUALIFICATIONS:</strong><br><br>Education and / or Experience:\n\n<ul>\n <li> Bachelor's Degree, or equivalent experience, with eight or more years previous Networking experience required and five years in management </li><li> Certifications of Cisco products, and/or other voice related products. </li><li> Understanding and full support capabilities of complex aspects of Contact Center communications technologies as well as data and voice telecommunication systems associated with Call Centers. </li><li> Proven leadership skills both project and technical based.\n</li></ul>\nProfessional Skills:\n\n<ul>\n <li> Cisco Unified Communication Solutions Call Manager (Stand alone and cluster based) </li><li> Cisco Session Border Controllers (Cube) </li><li> Cisco Gateways (Routers/VG) </li><li> Cisco Enterprise VOIP implementations </li><li> Cisco Video Conferencing </li><li> Call path and routing </li><li> Solution monitoring </li><li> Nice Voice Recording </li><li> Evaluate CDR logs and produce reports </li><li> Program IVR / ACD / CTI / Call Routing / Call Vectors / Dial Plan / etc. </li><li> Voice Solutions and there interoperability with other applications or soltuions (Overhead Paging) </li><li> Voice Tools </li><li> Circuit ordering / RFC / 1800 Management / DID/DOD, etc. </li><li> Maintain Documentation &amp; Flow Process </li><li> SIP Trunk routing &amp; manipulations </li><li> SIP Trunking technologies from Telecommunication providers. </li><li> Complete understanding of QOS and is tagging parameters </li><li> Good understanding of the LAN and WAN operations in an enterprise environment. </li><li> Experience in a large enterprise environments (&gt; 10000 voice handsets) </li><li> 24x7x365 on-call rotation based on the number of people on our team </li><li> Possess a high degree of professionalism, customer service, and dependable. </li><li> Ability to apply a comprehensive and in-depth knowledge of technical concepts, practices and procedures. </li><li> Solid written and verbal communication. </li><li> Must present exceptional leadership, problem solving, decision making, and time management skills. </li><li> Ability to work in a remote capacity. </li><li> Ability to work in a team environment </li><li> Cisco Unified Communications </li><li> Cisco Gateways </li><li> Media gateways </li><li> 3rd Party operations (Lync, Parlance, ELoyalty, etc.) </li><li> Session Broader controllers </li><li> SIP Trunking with Provides and other SIP based solutions. </li><li> Voice Mail </li><li> Call recording (Nice) </li><li> CDR Solutions </li><li> Monitoring (Fluke, Solarwinds, etc.)\n</li></ul>\nCertificates, Licenses and Registrations:\n\n<ul>\n <li> Certificates such as CCNP (Cisco Certified Network Professional), CCIE (Cisco Certified Internetwork Expert), and/or MCSE preferred\n</li></ul>\n\nPhysical Demands:<br><br>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.\n\n<ul>\n <li> The physical demands include the installion of Network devices that will be mounted in communication based racks, and/or cabinets. Requires operation of a drill driver, and/or screw driver. </li><li> The physical demands incude installing patch cords, cross connects from patch pannels, or demarcation points to Network devices. Installing a patch cord and phone handsets at a desk location </li><li> May require being on a lift or ladder for short intervals </li><li> While performing the duties of this job, the employee is regularly required to sit, stand, walk and use hands and fingers to operate a computer keyboard, mouse, and telephone to talk and hear. The employee is frequently required to sit and reach with hands and arms. The employee must occasionally lift and/or move up to 30 pounds </li><li> Position may require travel to remote locations. Estimated travel 10%\n</li></ul>\nWo<br><br>Applicants must be currently authorized to work in the United States.\n<br><br>\nSysco is proud to be an Equal Opportunity and Affirmative Action employer, and considers qualified applicants without regard to race, color, creed, religion, ancestry, national origin, sex, sexual orientation, gender identity, age, disability, veteran status or any other protected factor under federal, state or local law.\n<br><br>\nThis opportunity is available through Sysco Corporation, its subsidiaries and affiliates.<br><br>Employment Type: Full Time"}