{"job title": "Senior Scientist, BIochemistry", "company": "AbbVie", "city state": "– North Chicago, USA", "rating": "3.7", "job description": "<div><div><div><div><div><div>The Global Protein Sciences group at AbbVie is seeking a highly-motivated research scientist to join a dynamic core team supporting biologics drug-discovery. The applicant must have diverse therapeutic protein purification expertise and have proficiency in all standard bioprocess and chromatography techniques. The applicant should be experienced in biophysical and analytical characterization techniques for proteins, and have a demonstrated strong ability to effectively drive process development activities. As a creative problem solver, the individual should be able to independently develop and implement new technologies and platforms, and also be proficient in overcoming issues (i.e. solubility, aggregation, recovery, purity, etc) with challenging therapeutic proteins. The applicant should have a detailed understanding of how molecular- and post-translational attributes of biologics translate to their function, and be capable of leveraging this knowledge to generate optimized molecules. Experience with engineering of novel therapeutics and antibody-drug conjugation is also beneficial.\n<br><br>\nThe applicant will be working in a Discovery organization at AbbVie. She/he should be able to work independently while contributing in a team environment, and manage several projects simultaneously. She/he needs to stay current with applicable internal/external scientific literature and apply new information in innovative ways to successfully complete work assignments. The applicant should be able to analyze, document, and report data concisely and rigorously. She/he should possess excellent communication skills and be proficient in presenting in front of groups.<br>\n<div>\n<strong><br>\n\n<div><strong>Basic:</strong></div><div>\n\n\n<ul>\n<li>BS, MS, or Ph.D. in Biochemistry, Biophysics, Chemical Engineering or related field</li>\n<li>10+(BS), 8+(MS), 0+(Ph.D) years of relevant experience</li>\n<li>Possess thorough theoretical and practical understanding of own scientific discipline.</li>\n<li>effective writer and communicator of research or other regulatory materials.</li> \n</ul>\n<strong>Key Leadership Competencies:</strong>\n\n<ul>\n<li>Builds strong relationships with peers and cross functionally with partners outside of team to enable higher performance.</li>\n<li>Learns fast, grasps the \"essence\" and can change course quickly where indicated.</li>\n<li>Raises the bar and is never satisfied with the status quo.</li>\n<li>Creates a learning environment, open to suggestions and experimentation for improvement.</li>\n<li>Embraces the ideas of others, nurtures innovation an manages innovation to reality.</li>\n</ul>\n<strong>Equal Opportunity Employer Minorities/Women/Veterans/Disabled</strong></div></strong></div></div><strong>\n </strong></div><strong>\n</strong></div><strong>\n </strong></div><strong>\n </strong></div><strong>\n</strong></div><strong>\n<br></strong>"}