{"job title": "Speech Scientist Intern", "company": "Amazon", "city state": "– ", "rating": "3.8", "job description": "Job Description<br>\n\n<div>\n<div>\n<div>\nWe are looking for an outstanding Applied Scientist who is able to apply theory into practice through experimentation and invention, in the field of Speech Synthesis. You should be comfortable with a degree of ambiguity that’s higher than most projects and relish the idea of solving problems that, frankly, haven’t been solved before - anywhere. Along the way, we guarantee that you’ll learn a lot, have fun and make a positive impact on millions of people.\n<br><br>\nIf you have an entrepreneurial spirit, know how to deliver, are deeply technical, highly innovative and long for the opportunity to build pioneering solutions to challenging problems, we want to talk to you.</div>\n</div>\n</div>\n\n<br>Notwendige Qualifikationen<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li>MSc. or PhD degree in Computer Sciences, Machine Learning, or related technical field - or working on a degree</li><li>Familiarity with deep learning techniques</li>\n<li>Knowledge of C/C++</li><li>Proficiency in at least one scripting languages (Perl, Python, Hadoop, Hive, etc)</li><li>Strong fundamentals in problem solving, algorithm design and complexity analysis.</li><li>Fundamentals in data structures.</li><li>Strong personal interest in learning, researching, and creating new technologies with high commercial impact.</li></ul></div>\n</div>\n</div>\n\n<br>Wünschenswerte Qualifikationen<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li>Knowledge of parametric and/or unit selection TTS technology.</li><li>Knowledge of software engineering practices &amp; best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations.</li><li>Clear, professional communication skills able to contribute to team discussions.</li></ul></div>\n</div>\n</div>\n<br>\n<strong>.</strong>"}