{"job title": "Staff Scientist", "company": "Arconic", "city state": "– New Kensington, PA", "rating": "3.1", "job description": "The primary purpose of the Staff Scientist in the Analytical Chemistry department is to develop customized thermal analysis methods to characterize novel metal alloys, powders, advanced ceramics, and other inorganic materials, in support of Arconic research projects.\n\n\n<ul>\n<li>This position requires a broad technical knowledge of and hands-on experience with a variety of analytical techniques (e.g., XRF/XRD, FTIR, LECO, physical measurements, etc.) to provide testing support to the department and technical leadership to cross-functional project teams.</li>\n<li>The selected individual is responsible for maintaining close partnerships with Arconic project teams and business units to establish a strong working knowledge of project processes, materials, and products; the ability to leverage technical expertise in analytical chemistry to deliver innovative testing solutions that solve complex project problems is a key accountability.</li>\n</ul>\n\n<strong>Major Activities / Key Challenges:</strong>\n\n\n<ul>\n<li>Provide strong technical leadership in the thermal analysis laboratory by developing advanced analytical methods and demonstrating strong data interpretation skills for multiple techniques, including DSC, TGA, and TMA.</li>\n<li>Partner with Arconic project teams and business unit locations to develop a strong working knowledge of projects/processes and deliver sound technical guidance and analytical solutions that drive project success; lead cross-functional teams to achieve project objectives.</li>\n<li>Initiate and lead projects to characterize materials and develop customized test methods for a variety of sample matrices, including metal alloys (primarily aluminum, titanium, and nickel), metallic powders, ceramics, lubricants, etc.</li>\n<li>Exhibit strong problem solving skills; demonstrate troubleshooting skills with advanced analytical instrumentation.</li>\n<li>Perform advanced data interpretation utilizing instrument software, Excel, and statistical tools.</li>\n<li>Communicate results and drive project implementation through technical reviews, detailed technical reports, and technical presentations.</li>\n<li>Continually monitor new developments in the field of analytical chemistry and implement where appropriate to ensure Arconic remains a leader in the industry.</li>\n<li>Provide hands-on testing support and technical guidance to multiple laboratories within the Analytical Chemistry department; identify and implement efficiencies to current processes as needed.</li>\n<li>Demonstrate a strong quality commitment; implement measurement capability studies and laboratory quality control processes; ensure adherence of test methodologies to specifications and quality system requirements for ISO 17025 and NADCAP accreditations.</li>\n<li>Support Arconic EHS policies and programs</li>\n</ul>\n\n<strong>Essential Knowledge &amp; Skills / Education:</strong>\n\n\n<ul>\n<li>M.S. or Ph.D degree in Chemistry, Physics, Chemical Engineering, or Materials Science</li>\n<li>Experience with thermal techniques, including DSC, TGA, and TMA</li>\n<li>Proven ability to develop and implement new analytical methods</li>\n<li>Capable of providing technical leadership and support to multiple test areas within Analytical Chemistry</li>\n<li>Baseline knowledge of metallic materials and additive manufacturing processes</li>\n<li>Proven ability to handle multiple tasks with a high degree of accuracy in a fast-paced environment</li>\n<li>Ability to process complex data sets using Excel and basic statistical tools</li>\n<li>Excellent technical writing and presentation skills</li>\n<li>Must have a positive, collaborative, and highly adaptive work style</li>\n<li>Basic Qualifications*</li>\n<li>Masters Degree in Chemistry, Chemical Engineering, Materials Science or Physics from an accredited institution</li>\n<li>Minimum 5 years laboratory/materials research experience</li>\n<li>Employees must be legally authorized to work in the United States. Verification of employment eligibility will be required at the time of hire. Visa sponsorship is not available for this position.</li>\n<li>Preferred Qualifications*</li>\n<li>*</li>\n<li>Ph.D in Chemistry, Chemical Engineering, Materials Science, or Physics plus 10 years experience with thermal techniques, including DSC, TGA, and TMA</li>\n<li>Laboratory experience developing methods and performing thermal testing, including DSC, TGA, or TMA</li>\n<li>Experience with a variety of analytical techniques and instrumentation; FTIR and PSD (particle size) experience</li>\n<li>Experience analyzing metal (aluminum, titanium, nickel) and ceramic matrices, bulk and powder</li>\n<li>Familiarity with quality systems and ASTM test methods</li>\n<li>Communication and interpersonal skills to partner with projects and provide technical expertise</li>\n<li>Data reduction and analysis skills</li>\n<li>*Job:** **Technical*</li>\n<li>*Organization:** **00160-16301 Analytical Sciences*</li>\n<li>*Title:** *Staff Scientist*</li>\n<li>*Location:** *PA-Alcoa Center*</li>\n<li>*Requisition ID:** *18000640*</li>\n</ul>"}