{"job title": "Machine Learning Research Scientist", "company": "Bosch", "city state": "– Pittsburgh, PA", "rating": "3.5", "job description": "Machine Learning Research Scientist\n<br><br>\n+ 2555 Smallman St, Pittsburgh, PA 15222, USA\n<br><br>\n+ Full-time\n<br><br>\nLegal Entity: Robert Bosch LLC\n<br><br>\n<strong>Company Description</strong>\n<br><br>\nThe Bosch Group operates in most countries in the world. With over 400,000 associates, a career at Bosch offers a chance to grow an exceptional career in an environment that values diversity, initiative and a drive for results.\n<br><br>\n<strong>Job Description</strong>\n<br><br>\n+ Development of novel Deep Learning algorithms, implementation and evaluation using multi-modal Bosch data from application areas such as autonomous driving, robotics, and Internet of Things\n<br><br>\n+ Original research, theoretical investigations, publications at top Machine Learning conferences and journals\n<br><br>\n+ Close contact to the scientific Machine Learning community, scouting and assessment of new approaches\n<br><br>\n+ Technical discussions and creation of new ideas within the existing Deep Learning research team\n<br><br>\n+ Supervision of Master and PhD students\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nBasic Qualifications\n<br><br>\n+ PhD in Machine Learning (preferably Deep Learning) with excellent publication record\n<br><br>\n+ 2+ years programming experience, in particular Python\n<br><br>\n+ Experience in development and implementation of state-of-the art Deep Learning technologies\n<br><br>\nPreferred Qualifications\n<br><br>\n+ Experience with Deep Learning frameworks\n<br><br>\n+ Broad knowledge of machine learning algorithms and principles\n<br><br>\n+ Strong teamplayer,\n<br><br>\n+ Motivation and experience to define personal research roadmap\n<br><br>\n<strong>Additional Information</strong>\n<br><br>\nBy choice, we are committed to a diverse workforce - EOE/Protected Veteran/Disabled.\n<br><br>\nBOSCH is a proud supporter of STEM (Science, Technology, Engineering &amp; Mathematics)Initiatives:\n<br><br>\n+ FIRST Robotics (For Inspiration and Recognition of Science and Technology)\n<br><br>\n+ AWIM (A World In Motion)\n<br><br>\nVideos To Watch\n<br><br>\n+ Job Location"}