{"job title": "Analytics Scientist - Credit Modeling", "company": "Ford Motor Company", "city state": "– Dearborn, MI", "rating": "3.9", "job description": "**30873BR**<br> <br>**Job Title:**<br> <br><br> <br>Analytics Scientist - Credit Modeling<br> <br><br> <br>**Job Description &amp; Qualifications:**<br> <br><br> <br>**Position Description/Overview:**<br> <br><br> <br>A high-potential analytics analyst is needed to assist in all phases of the development, deployment, monitoring, and evaluation of credit models &amp; tools. We are looking for highly motivated, multi-faceted individuals to work in a high-visibility functional area.<br> <br><br> <br>**Responsibilities:**<br> <br><br> <br>+ Work with Risk Analytics and Risk Operation teams to support credit model development<br> <br>+ Employ statistical procedures<br> <br>+ Maintain models and algorithms on an ongoing basis<br> <br>+ Continuously explore ways to enhance models<br> <br>+ Develop model tracking methodologies and reports to monitor model performance<br> <br>+ Investigate data &amp; implementation issues<br> <br>+ Work with various data sources and platforms (PC, Mainframe, Unix/Linux, Teradata, flat files) to compile data<br> <br>+ Utilize statistical software (e.g., SAS, R, Python) to develop models<br> <br><br> <br>**Basic Qualifications:**<br> <br><br> <br>+ Master?s Degree in a quantitative field of study<br> <br>+ 3+ years of work or academic experience with statistical, econometric, and/or other quantitative methods (e.g., logistic, time series, seasonal adjustments, non-linear methods)<br> <br>+ 3+ years of experience using analytics in a business or academic environment<br> <br>+ 3+ years of experience in one of the following: SAS, R, or Python<br> <br><br> <br>**Preferred Qualifications:**<br> <br><br> <br>+ Ability to translate complex quantitative methods for business audiences<br> <br>+ Experience in applications of operations research, mathematics, and/or statistics in an industrial/applied environment<br> <br><br> <br>The distance between imagination and ?. Creation. It can be measured in years of innovation, or in moments of brilliance. And, it can be a road you start traveling right now. When you join Ford Motor Company, your journey begins. You become part of a team that is already leading the way, with ingenious solutions and attainable products ? and it is always ready to go further.<br> <br><br> <br>Visa sponsorship may be available for this position.<br> <br><br> <br>Ford Motor Company is an equal opportunity employer committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, disability status or protected veteran status.<br> <br><br> <br>**Auto req ID:**<br> <br><br> <br>30873BR<br> <br><br> <br>**Company:**<br> <br><br> <br>Ford Motor Credit Company<br> <br><br> <br>**Function:**<br> <br><br> <br>GDIA<br> <br><br> <br>**Skill Team:**<br> <br><br> <br>Ford Motor Credit Company<br> <br><br> <br>**Sub-Component:**<br> <br><br> <br>Ford Motor Credit Company<br> <br><br> <br>**State:**<br> <br><br> <br>Michigan<br> <br><br> <br>**Location:**<br> <br><br> <br>Dearborn"}