{"job title": "Senior Analytics Consultant", "company": "Health Care Service Corporation", "city state": "– Austin, TX", "rating": "3.2", "job description": "<strong>Description:</strong>\n<br><br>\nWithin our dedicated Healthcare Economics Team, you will support BCBSTX's largest employer client. By analyzing their health, utilization and financial data, you will provide meaningful and actionable insights to ultimately help the client save money and optimize health care consumption for their members. This is a high-visibility role in the organization with exposure to various other departments and executives. This is a great opportunity for those that enjoy working in a fast-paced, dynamic environment.\n<br><br>\n<strong>BASIC FUNCTION:</strong>\n<br>\nThis position is responsible for constructing forecasts, recommendations and strategic/tactical plans based on business data and market knowledge. Creates specifications for reports and analysis based on business needs and required or available data elements. May provide consultation to users and lead cross-functional teams to address business issues. Produces datasets and reports for analysis using system reporting tools. May perform research and assists in analyzing financial and health data, including medical algorithms to determine health care expenditures, medical and economic outcomes, and cost containment strategies. Analyzes complex business problems and issues using data from internal and external sources to provide insight to decision-makers. Identifies and interprets trends and patterns in datasets to locate influences.\n<br><br>\n<strong>JOB REQUIREMENTS:</strong>\n\n\n<ul>\n<li>Bachelor Degree and 5 years experience in health care services, statistical analysis, or insurance industry economics including 1 year experience in data analysis and information reporting relating to healthcare data, including pharmacy OR 7 years experience in health care services, statistical analysis, or insurance industry economics including 1 year experience in data analysis and information reporting relating to healthcare data, including pharmacy.</li>\n<li>Requires specialized depth and/or breadth of expertise</li>\n<li>Interprets internal or external business issues and recommends best practices</li>\n<li>Takes initiative to solve complex problems; takes an outside-in perspective to identify innovative solutions</li>\n<li>Works independently, with guidance in only the most complex situations</li>\n<li>May lead functional teams or projects</li>\n</ul>\n\n<strong>PREFERRED REQUIREMENTS:</strong>\n\n\n<ul>\n<li>Ability to articulate depth and breadth of expertise in the following: analytical thinking, communication for results, conceptual thinking, information seeking, initiative, openness to learning, results orientation, teamwork, thoroughness, understanding environment.</li>\n<li>Technical experience using SQL &amp; Tableau to create reports or deliver data analysis / dashboards</li>\n</ul>\n\nThis position is based in Austin, TX.\n<br>\nRelocation will not be provided for this position.\n<br>\nSponsorship will not be provided for this position\n<br><br>\nLocation: TX - Austin\n<br>\nActivation Date: Sunday, July 29, 2018\n<br>\nExpiration Date: Saturday, September 15, 2018\n<br>"}