{"job title": "Senior Scientist, Oncology", "company": "Immunomic Therapeutics, Inc.", "city state": "– Rockville, MD", "rating": "4.0", "job description": "Senior Scientist, Oncology\n<br><br>\n<strong>Job Description</strong>\n<br>\nImmunomic Therapeutics, Inc. is seeking an innovative and highly motivated scientist to join the nucleic acid vaccine team in Oncology.\n<br>\nThe candidate will be responsible for supporting and/or leading oncology projects, and have the opportunity to identify and interrogate the immunomodulatory target pathways using cutting-edge technologies and novel approaches to enrich the UNITE Platform pipeline.\n<br>\nPrior experience in cancer immunology immunotherapy research and potentially nucleic acid vaccines is preferred but not required.\n<br>\nThe selected candidate will work closely with other scientists, participate in project teams, and work in a multidisciplinary environment in order to advance projects.\n<br>\nEssential Functions The duties of this position will involve supporting and/or leading a multidisciplinary team to develop the ITI -UNITE Platformfor cancer therapy, and utilizing in vivo mouse models with in vitro cell-based immunoassays to elucidate mechanism of action of these vaccines.\n<br>\nThe ideal candidate will have in-depth and hands-on expertise in immunoassays, flow cytometric analysis of immune cells and in utilizing in vivo mouse cancer models.\n<br>\nThe candidate must be able to work both independently and collaboratively in a matrixed environment to design, execute, interpret and communicate oncology studies for one or more projects utilizing good scientific judgment and strong team skills.\n<br>\nPrior supervisory experience is preferred.\n<br>\nExpertise in current technology practices in cancer biology and immunology is required\n<br>\nExperience in immunoassays is required.\n<br>\nExperience with in vivo rodent cancer models is required.\n<br>\nAbility to independently design experiments, make detailed observations, analyze data, interpret results and deliver timely results.\n<br>\nExcellent presentation and oral and written communication skills.\n<br>\nProven ability to prepare precise technical summaries and protocols and maintenance of appropriate documentation.\n<br>\nAbility to prioritize and work in a fast-paced and diverse environment.\n<br>\nStrong sense of urgency, initiative, ethics/integrity and innovation is required.\n<br>\nExperience in nucleic acid (mRNA or DNA) vaccination is preferred.\n<br>\nExperience in flow cytometry is preferred.\n<br>\nExperience in cancer target or drug discovery and cancer histopathology is preferred.\n<br>\nCompetencies &amp; Skills Customer Focus\n<br>\nCommunication/Presentation Skills (spoken, written)\n<br>\nIntegrity/Ethics Initiative\n<br>\nSense of Urgency Teamwork\n<br>\nCollaboration Skills Innovation\n<br>\nPhysical Demands\n<br>\nRequires both office and laboratory work\n<br>\nAble to lift a minimum of 20lbs. Exposure to chemicals used in a laboratory environment with proper Personal Protective Equipment\n<br>\nWork Environment\n<br>\nThis position operates in a professional laboratory and office work environment\n<br>\nThis role requires hands-on laboratory work employing aseptic technique, standard molecular and microbial process with limited exposure to inorganic and organic compounds\n<br>\nThis role routinely uses standard office equipment such as computers, phones, photocopiers, filing cabinets and fax machines.\n<br>\nPosition Type and Expected Hours of Work\n<br>\nThis is a full-time position.\n<br>\nDays and hours of work are Monday through Friday, 8:30 a.m. to 5 p.m.\n<br>\nRequired Education and Experience Ph.D. in appropriate discipline required (e.g., immunology, cell biology, molecular biology)\n<br>\nMinimum 8+ years experience (industry experience preferred)\n<br>\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job.\n<br>\nDuties, responsibilities and activities may change at any time with or without notice.\n<br>\nPlease visit our careers site at http://www.immunomix.com/careers/.\n<br>\nSend your cover letter and credentials as described on the Careers page along with the Job Code: 2018 RD002 in the subject line.\n<br>\nEqual Opportunity EmployerPandoLogic. Category: Science, Keywords: Senior Scientist"}