{"job title": "Research Scientist Internship", "company": "Intel", "city state": "– Hillsboro, OR", "rating": "3.8", "job description": "<ul>\n<li>*Job Description**</li>\n</ul>\n\nIntel Labs is the company's world-class, industry leading research organization, responsible for driving Intel's technology pipeline and creating new opportunities. The mission of Intel Labs is to deliver breakthrough technologies to fuel Intel's growth. This includes identifying and exploring compelling new technologies and high risk opportunities ahead of business unit investment and demonstrating first-to-market technologies and innovative new usages for computing technology. Intel Labs engages the leading thinkers in academia and industry in addition to partnering closely with Intel business units.\n<br><br>\nJoin a team of researchers at the Intel Wireless Communications Technology Lab at Hillsboro, Oregon, responsible for research on future wireless Technologies. An important part of this research involves generating new concepts, implementing them on simulation and prototyping platforms, conducting experiments and collecting and analyzing the data to support them\n<br><br>\nThe intern is expected to contribute in developing system and link level simulations, or FPGA emulation system, formulating creative solutions and conducting experiments on research problems related to advanced wireless networks.\n\n\n<ul>\n<li>*_The ideal candidate should exhibit the following behavioral traits:_**</li>\n</ul>\n\nExcellent communication skills and demonstrated ability to follow instructions accurately and work independently, on occasion when required.\n\n\n<ul>\n<li>*Qualifications**</li>\n</ul>\n\nYou must possess the below minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Experience listed below would be obtained through a combination of your school work/classes/research and/or relevant previous job and/or internship experiences.\n\n\n<ul>\n<li>*Minimum Requirements:**</li>\n</ul>\n\nThe candidate must be pursuing a PhD. in Computer Science, Computer Engineering, Computational Science or any related field.\n<br><br>\nMinimum 6 months of work/coursework experience in/with:\n<br><br>\n+ Simulation of wireless communication systems or wireless communication on FPGA or other platform.\n<br><br>\n+ Programming in MATLAB, C/C++ for Link-level/System-level/Network simulator, or RTL.\n\n\n<ul>\n<li>*Preferred Qualifications:**</li>\n</ul>\n\n+ Research experience in advanced wireless technologies, especially 3GPP LTE/LTE-Advanced and WiFi MAC/PHY protocols.\n<br><br>\n+ Coursework/experience with prototyping and FPGA/VHDL programming.\n<br><br>\n+ Past experience and expertise in simulating advanced wireless systems is a must.\n<br><br>\n+ Understanding and research background in LTE/LTE.\n\n\n<ul>\n<li>*Inside this Business Group**</li>\n</ul>\n\nIntel Labs is the company's world-class, industry leading research organization, responsible for driving Intel's technology pipeline and creating new opportunities. The mission of Intel Labs is to deliver breakthrough technologies to fuel Intel's growth. This includes identifying and exploring compelling new technologies and high risk opportunities ahead of business unit investment and demonstrating first-to-market technologies and innovative new usages for computing technology. Intel Labs engages the leading thinkers in academia and industry in addition to partnering closely with Intel business units.\n\n\n<ul>\n<li>*Posting Statement.** Intel prohibits discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status.</li>\n</ul>"}