{"job title": "Prinicpal Research Scientist", "company": "Lilly", "city state": "– Indianapolis, IN", "rating": "3.8", "job description": "<ul>\n<li>*43660BR**</li>\n<li>*Responsibilities:**</li>\n</ul>\n\nThe Real World Analytics (RWA) Statistician provides scientific expertise, research design and methodological proficiency, and strategic insights to ensure the successful fulfillment of the health economics and outcomes research agenda. The RWA Statistician is responsible for the analytic integrity of research studies and for establishing best practices for specialized analytic capabilities for Health Outcomes Research and Real World Evidence. The RWA statistician will support, initiate, and execute cross-functional research, drive relevant methodological research, provide advanced analytic consultations for real world research projects to both advance the Lilly portfolio and expand the expertise across the organization, and drive broader acceptance and appropriate use of real world evidence across Lilly and externally. The RWA Statistician is responsible for working with health outcomes scientists and multi-disciplinary research teams to advance the timely and credible use of real world evidence to improve patient outcomes and appropriately disseminate research findings.\n<br><br>\nThe RWA Statistician at this level provides analytical and statistical leadership on multiple dimensions including:\n<br><br>\n+ Provides technical leadership and expertise in design, execution, and interpretation of statistical and analytic approaches to generating real world evidence that supports and advances the Lilly portfolio and HCP and Market Access activities;\n<br><br>\n+ Leads the assessment, introduction, and implementation of new analytic and statistical technologies and methodologies to apply to broader practice;\n<br><br>\n+ Leads or assists in the development and fulfillment of research plans, innovative protocol designs, and statistical analysis in collaboration with health outcomes scientists and cross-functional teams applying RWE throughout the development lifecycle;\n<br><br>\n+ Provides advanced analytics education and consultation for high priority customer questions and real world evidence initiatives, including drug development, regulatory, policy, payer/value based agreements, provider, economic modeling, FDAMA114, and digital health related applications.\n<br><br>\n+ Works with thought leaders to influence external real world evidence initiatives and methodological improvements to advance best practices and grow the potential value for quality real world evidence.\n<br><br>\nThe job tasks listed below outline the scope of the position. The application of these tasks may vary, based upon current business needs.\n<br><br>\nStatistical Knowledge and Expertise\n<br><br>\n+ Maintain strong technical expertise in health economics and outcomes research and real world evidence including advances in statistical methodology, proficiency in applying new and varied methods and competence in justifying methods selected\n<br><br>\n+ Drive statistically robust approaches or solutions that increase the probability of technical success, save time, increase efficiency, enable market access, or otherwise directly affect business.\n<br><br>\n+ Provide sound peer-review of work products from other statistical colleagues, and advise others on technical aspects.\n<br><br>\n+ Collaborate with research personnel to provide input on research study designs and write protocols for the conduct of research studies\n<br><br>\n+ Assist in or be accountable for selecting the right and innovative statistical methods for data analysis, authoring the corresponding sections of the protocol or disclosures, conducting analysis, and interpretation of results.\n<br><br>\nDelivery of RWA strategy\n<br><br>\n+ Prioritize RWA activities in alignment with health outcomes scientists and cross-functional teams to enable delivery of on-strategy, on-time, on-budget research plans that advance the portfolio and enable HCP and market access activities\n<br><br>\n+ Implement RWA strategy through developing and implementing new analytic capabilities, technologies, methodologies, or applications\n<br><br>\n+ Define or adjust project objectives or deliverables to reflect broader strategy and objectives.\n<br><br>\nCommunication, Leadership and Influence\n<br><br>\n+ Effectively lead cross-functional or multi-disciplinary collaborations and use technical expertise to influence business decisions.\n<br><br>\n+ Collaborate with team members to write reports and communicate results.\n<br><br>\n+ Assist with, or be responsible for, communicating study results via regulatory/payer submissions, promotional materials, manuscripts, or oral presentations in group settings, as well as for communicating one-on-one with key customers and presenting at scientific meetings.\n<br><br>\n+ Respond to regulatory/payer queries and interact directly with regulators/payers.\n<br><br>\n+ Communicate effectively with respect to analytics research considerations and their medical and/or commercial impact, and conduct shared learning opportunities to effectively share RWA knowledge and expertise\n<br><br>\nPharmaceutical Industry/Therapeutic Area Knowledge and Environmental Awareness\n<br><br>\n+ Leverage a broad understanding of the drug development and commercialization process to inform therapeutic area and RWE capability analytical/statistical needs.\n<br><br>\n+ Enhance customer focus and collaboration through demonstration of scientific contribution and deep understanding of relevant disease states.\n<br><br>\n+ Establish and maintain presence and relationship with the research community in the health care sector, pharmaceutical industry, and academia while maintaining awareness and influencing the external environment, and anticipating significant developments in the field, including new methodologies, tools, or applications\n<br><br>\nRegulatory Compliance\n<br><br>\n+ Perform work in full compliance with assigned curriculum(s) and will be responsible for following applicable Corporate, Medical, local, and departmental policies, procedures, processes, and training.\n\n\n<ul>\n<li>*Req ID:**</li>\n</ul>\n\n<strong>43660BR</strong>\n\n\n<ul>\n<li>*Additional Skills/Preferences:**</li>\n</ul>\n\n+ Experience with real world data analysis (e.g. insurance claims data, electronic medical records, prospective observational studies, pragmatic trials) ability to address issues arising from these data using analytic methods relevant to health outcomes research.\n<br><br>\n+ Strong interpersonal and communication skills for effective consultation\n<br><br>\n+ Demonstrated teamwork and leadership skills, with ability to influence others\n<br><br>\n+ Self-management skills with a focus on results for timely and accurate completion of competing deliverables\n<br><br>\n+ Resource and project management skills\n<br><br>\n+ Demonstrated ability for creativity and innovation\n<br><br>\n+ Demonstrated problem solving ability and strategic thinking\n<br><br>\n+ Ability to think and act globally with customer focus and with action-, results-, and solution-orientation Great learning agility and flexibility in working different contexts\n\n\n<ul>\n<li>*Additional Information:**</li>\n</ul>\n\nLilly is an EEO/Affirmative Action Employer and does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status\n\n\n<ul>\n<li>*Title:**</li>\n</ul>\n\nPrinicpal Research Scientist\n\n\n<ul>\n<li>*Job Category:**</li>\n</ul>\n\nScience\n\n\n<ul>\n<li>*Basic Qualifications:**</li>\n</ul>\n\n+ Ph.D in Statistics or Biostatistics with 5+ years of relevant postgraduate experience in the pharmaceutical or related industry\n\n\n<ul>\n<li>*Company Overview:**</li>\n</ul>\n\nLilly is the 10th largest pharmaceutical company in the world, and has been creating medicines that help improve peoples' quality of life for more than 135 years. Across the globe, we are a leader in investing in research and development and we also invest in our employees ? in competitive salaries, training and development, and health. The pharmaceutical industry is a complex, rapidly changing environment and we are looking for highly capable leaders to help us continue bringing innovation to patients.\n<br><br>\nIf you are interested in being considered for employment at Lilly, we encourage you to review the following opportunity\n\n\n<ul>\n<li>*City:**</li>\n</ul>\n\nIndianapolis\n\n\n<ul>\n<li>*Country:**</li>\n</ul>\n\n<strong>USA</strong>\n\n\n<ul>\n<li>*State / Province:**</li>\n</ul>\n\nIndiana\n\n\n<ul>\n<li>*Region:**</li>\n</ul>\n\nNorth America"}