{"job title": "Research Scientist-Clinica", "company": "Lilly", "city state": "– Indianapolis, IN", "rating": "3.8", "job description": "<ul>\n<li>*43962BR**</li>\n<li>*Responsibilities:**</li>\n<li>*Medical Engagement Strategy**</li>\n</ul>\n\n+ Formulate Insulin/Glucagon/Connected care Medical Engagement strategy and help the team implement it\n<br><br>\n+ Work with TL Engagement to create and update TL target lists and TL engagement plans incl. owner and programs of cooperation\n<br><br>\n+ Represent single point of contact to MSL team\n<br><br>\n+ Work with Commercial team, USMA colleagues and MSL leadership to formulate clear MSL team strategy, reflect on challenges which we must quickly tackle with SEs\n<br><br>\n+ Cooperate with USMA colleagues and MSL leadership in creating and delivering adequate training which is going to position our MSL team as top of industry\n<br><br>\n+ Keep MSL team informed about changes in Pharma and Technology markets, deliver regular Lilly and competitor update\n\n\n<ul>\n<li>*Business/ customer support (pre and post launch support)**</li>\n</ul>\n\n+ Understand and anticipate the scientific information needs of all local/regional customers (payers, patients, health care providers)\n<br><br>\n+ Actively address customer (payer, patient and health care providers) questions in a timely fashion by leading data analyses and new clinical or health outcomes research efforts.\n<br><br>\n+ Contribute to the development of medical strategies to support brand commercialization activities by working closely with the global Medical Affairs and brand teams, Global Patient Outcomes/Real World Evidence and global PRA, clinical management or personnel and other cross-functional management\n<br><br>\n+ during the development of the local business plan.\n<br><br>\n+ Contribute as a scientific and clinical expert to activities and deliverables of the PRA organization, in particular giving clinical input and insight to develop payer partnership programs and defend the product value.\n<br><br>\n+ Support business-to-business and business-to-government activities as medical expert.\n<br><br>\n+ Contribute actively on an ongoing basis to the strategic planning for currently marketed brands.\n<br><br>\n+ By offering scientific and creative input, contribute to the development, review, and approval of promotional materials for the brand team.\n\n\n<ul>\n<li>*Scientific Data Dissemination/Exchange**</li>\n</ul>\n\n+ Knowledge of and compliance with local laws and regulations, and global policies and procedures, compliance guidelines with respect to data dissemination and interactions with external health care professionals.\n<br><br>\n+ Understand and actively address the unsolicited scientific information needs of external health care professionals according to guidelines above.\n<br><br>\n+ Support the planning ofsymposia, and actively participate in advisory board meetings, scientific exchange meetings, and the facilitation of other meetings with health care professionals.\n<br><br>\n+ Support medical information associates in preparation and review of medical letters and other medical information materials.\n<br><br>\n+ Support training of local medical personnel, including medical and/or outcome liaisons and health outcomes staff.\n<br><br>\n+ Prepare or review scientific information in response to customer questions or media requests.\n<br><br>\n+ Provide follow-up to information requested by health care professionals as per global SOPs.\n<br><br>\n+ Support data analysis and the development of slide sets (through reviewing and/or approving) and publications (abstracts, posters, manuscripts).\n<br><br>\n+ Establish and maintain appropriate collaborations and relationships with external scientific experts, thought leaders, and the general medical community on a local, national, regional, and possibly international basis.\n<br><br>\n+ Develop and maintain appropriate collaborations and relationships with relevant professional societies.\n<br><br>\n+ Support the design of customer research as medical expert.\n<br><br>\n+ Provide congress support (for example, availability to answer questions at exhibits, provide oral and poster presentations, staff medical booth, meet thought leaders, and participate in customer events).\n<br><br>\n+ Participate in data analyses, development of scientific data dissemination, and preparation of final reports and publications.\n<br><br>\n+ Participate in reporting of clinical trial data in Clinical Trial Registry activities.\n\n\n<ul>\n<li>*Translational Medicine teams.**</li>\n</ul>\n\n+ Communicate local/regional research needs and collaborate with other regions and the global Development and Medical Affairs teams, Global Patient Outcomes/Real World Evidence, and PRA teams to ensure Phase 3, 3b, and 4 (and Phase I and II where applicable) clinical programs meet the needs of local/regional customers (for example, through global medical planning processes).\n<br><br>\n+ Understand and keep updated with the pre-clinical and clinical data relevant to the molecule.\n<br><br>\n+ Represent the clinical needs of the country/region to the business unit medical leadership in the development of clinical strategies, development plans and study protocol design.\n\n\n<ul>\n<li>*Clinical Researchffrial Execution and Support**</li>\n</ul>\n\n+ Review and approve local informed consent documents and risk profiles to ensure appropriate communication of risk to study subjects.\n<br><br>\n+ Collaborate with clinical research staff in the design, conduct and reporting of local clinical trials (for example, sample size, patient commitment, timelines, grants, and governance review interactions).\n<br><br>\n+ Collaborate with clinical research staff, regional clinical operations staff, statisticians, global patient outcomes, research scientists and selected investigators in the development of protocols and data collection requirements.\n<br><br>\n+ Participate in investigator identification and selection, in conjunction with clinical teams.\n<br><br>\n+ Ensure that the clinical operations team has documented the completion of administrative requirements for study initiation and conduct (i.e., ethical review board, informed consent, regulatory approval/notification) consistent with Good Clinical Practices (GCPs) and local laws and requirements.\n\n\n<ul>\n<li>*Regulatory Support Activities**</li>\n</ul>\n\n+ Participate in development and review of local labeling and labeling modifications in collaboration with global Development, brand teams, regulatory, and legal. Demonstrate deep knowledge of local label. Provide medical expertise to regulatory scientists.\n<br><br>\n+ Support/ assist in the preparation of regulatory reports, preparation for regulatory agency advisory committee hearings and label discussions, local registration efforts, and communication and resolution of regulatory issues, including regulatory response, from an affiliate/countryperspective.\n<br><br>\n+ Participate in advisory committees.\n<br><br>\n+ Participate in risk management planning along with global Development team(s), business unit, local area, and Global Patient Safety (GPS).\n\n\n<ul>\n<li>*Scientific I Technical Expertise and continued development**</li>\n</ul>\n\n+ Be aware of current trends and projections for clinical practice and access in the therapeutic area(s) relevant to the product, both near term (1-2 years) and longer-term (3-5 years).\n<br><br>\n+ Critically read and evaluate the relevant medical literature; know the status and data from competitive products; and keep updated with medical and other scientific developments relevant to the product.\n<br><br>\n+ Responsible for the scientific training of the clinical study team.\n<br><br>\n+ Acts as scientific consultant and protocol expert for clinical study team members and others in medical.\n<br><br>\n+ Explore and take advantage of opportunities for extramural scientific experiences.\n<br><br>\n+ Attend, contribute and participate in medical congresses/scientific symposia.\n\n\n<ul>\n<li>*Req ID:**</li>\n</ul>\n\n<strong>43962BR</strong>\n\n\n<ul>\n<li>*Additional Skills/Preferences:**</li>\n</ul>\n\n+ 3+ years of clinical experience or 3+ years of pharmaceutical experience paired with an advanced degree is preferred\n<br><br>\n+ Demonstrated ability to balance scientific priorities with business priorities with examples of successful leadership skills\n<br><br>\n+ Demonstrated strong communication, interpersonal, teamwork, organizational and negotiation skills\n<br><br>\n+ Demonstrated ability to influence others (both cross-functionally and within the function) in order to create a positive working environment.\n<br><br>\n+ Engagement in domestic and international travel to the degree appropriate to support the business of the team will be required. Tarvel requirement &gt;40% of time.\n<br><br>\n+ Fluent in English, verbal and written communication\n\n\n<ul>\n<li>*Additional Information:**</li>\n</ul>\n\nLilly is an EEO/Affirmative Action Employer and does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.\n\n\n<ul>\n<li>*Title:**</li>\n</ul>\n\nClinical Research Scientist, US Medical Affair - Diabetes\n\n\n<ul>\n<li>*Job Category:**</li>\n</ul>\n\nScience\n\n\n<ul>\n<li>*Basic Qualifications:**</li>\n</ul>\n\nAn advanced health/medical/scientific (for example, in Pharmacology, physiology, microbiology) or related graduate degree such as DVM, PharmD, PhD, MSN with advanced clinical specialty (Clinical Nurse Specialist/Nurse Practitioner)\n<br><br>\n<strong>OR</strong>\n<br><br>\nHave a BS or Masters degree in health/medical/scientific or related field and 7+ years of clinical or pharmaceutical industry experience that is directly related to Medical Affairs, Medical Information, Scientific Communication, Regulatory Affairs, or similar areas\n\n\n<ul>\n<li>*Company Overview:**</li>\n</ul>\n\nAt Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 39,000 employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We?re looking for people who are determined to make life better for people around the world.\n\n\n<ul>\n<li>*City:**</li>\n</ul>\n\nIndianapolis\n\n\n<ul>\n<li>*Country:**</li>\n</ul>\n\n<strong>USA</strong>\n\n\n<ul>\n<li>*State / Province:**</li>\n</ul>\n\nIndiana\n\n\n<ul>\n<li>*Region:**</li>\n</ul>\n\nNorth America"}