{"job title": "Molecular Analyst - Scientist", "company": "Monsanto", "city state": "– Saint Louis, MO", "rating": "4.0", "job description": "We are seeking an outstanding **Molecular Analyst-Scientist** to work in the Molecular Characterization platform of the Regulatory Product Characterization Center. The Molecular Characterization Platform is a fast-paced, timeline-driven, project-managed, team oriented environment that requires researchers to collaborate on group based projects. Quality science, strong attention to detail and a willingness to work in a strict Good Laboratory Practices (GLP) environment is mandatory. A successful candidate will be highly self-motivated with the ability to work without detailed oversight on significant projects.\n\n\n<ul>\n<li>*Responsibilities include:**</li>\n</ul>\n\n? Performing the molecular characterization studies required for regulatory approvals to define our biotechnology-derived products at the DNA and RNA level\n<br><br>\n? Generating high quality molecular data and reports\n<br><br>\n? Utilizing scientific knowledge to provide intellectual support for our pending dossiers\n<br><br>\n? Contributing to the development and implementation of strategic direction for molecular characterization of Biotech products\n<br><br>\n? Interacting with and influencing global stakeholders within Monsanto to support regulatory submissions\n\n\n<ul>\n<li>*Required Education and Skills/Experience:**</li>\n</ul>\n\n? Minimum of Master?s degree in Molecular Biology, Biology or closely related field\n<br><br>\n? Minimum of five or more years of experience in Molecular Biology\n<br><br>\n? Strong skills in the development of high quality molecular data\n<br><br>\n? Prior experience in molecular biology including genomic DNA and RNA extraction and related analysis technique\n<br><br>\n? Excellent communication, writing, and team work skills within a diverse organization\n<br><br>\n? Strong results orientation, problem solving, project management, and multi-tasking skills\n<br><br>\n? Self-motivated with the ability to meet timelines and project targets with little direct supervision\n<br><br>\n? Strong skills in Excel, Word, PowerPoint, and Outlook\n\n\n<ul>\n<li>*Desired Education and Skills/Experience:**</li>\n</ul>\n\n? PhD in Molecular Biology, Biology or closely related field\n<br><br>\n? Experience with gene editing technologies such as CRISPR/Cas9 and/or CRISPR/Cpf1\n<br><br>\n? Prior experience conducting the following analysis techniques: PCR, Southern blot analysis, northern blot analysis, sequence analysis, and/or genome editing\n<br><br>\n? Experience with RNA expression analysis techniques such as QuantiGene\n<br><br>\n? Experience with data management and analysis\n<br><br>\n? Demonstrated success in the highly creative application of IT technologies\n<br><br>\n? Experience in a GLP, ISO, and/or GMP environment\n<br><br>\n? Prior research with an emphasis in plant biology, genetics, and/or biotechnology\n<br><br>\n? Experience with standard bioinformatics sequence analysis tools\n<br><br>\nBayer successfully completed the acquisition of Monsanto in June 2018, bringing together Monsanto?s leadership in seeds and plant traits with Bayer?s leadership in chemical and biological crop protection. By joining forces, we will create even more extensive career opportunities for talent around the world. We?re a global team working to shape agriculture through breakthrough innovation that will benefit farmers, consumers, and our planet.\n<br><br>\nWhile we are now Bayer, we will continue to hire using separate career sites until we can integrate our career platforms. We invite you to explore the career opportunities available at the combined company by visiting advancingtogether.com/careers .\n\n\n<ul>\n<li>*Organization:** _GLB Regulatory Sciences_51177233_</li>\n<li>*Title:** _Molecular Analyst - Scientist_</li>\n<li>*Location:** _North America-USA-Missouri-St. Louis_</li>\n<li>*Requisition ID:** _01RQ8_</li>\n<li>*Job:** _Research &amp; Development_</li>\n<li>*Schedule:** _Full-time_</li>\n</ul>\n\nAt Monsanto, we value a diverse combination of ideas, perspectives and cultures. All qualified applicants will receive consideration for employment without regard to, among other things, race, religion, color, national origin, age, sex, sexual orientation, gender identity, gender expression, status as a protected veteran, or status as a qualified individual with a disability. If you need a reasonable accommodation to access the information provided on this website, please for further assistance.access our disability accommodations process\n<br><br>\nU.S. Employment Law (applicable for U.S. jobs ONLY): EEO Employer Minorities/Females/Protected Veterans/Disabled. For information about equal employment opportunity rights, please refer to this information from the U.S. federal government: ; .\n<br><br>\nEEOC PosterEEOC Supplement"}