{"job title": "Senior Protein Scientist", "company": "Monsanto", "city state": "– Saint Louis, MO", "rating": "4.0", "job description": "Our Protein Expression and Purification team in the Plant Biotechnology organization is hiring a **Senior Protein Scientist** in St. Louis, Missouri. We are dedicated to the discovery, development and commercialization of next-generation traits for modern agriculture that provide useful and sustainable solutions for our customers. Identification, testing, and optimization of proteins is critical to development of durable agronomic traits to protect crops from insect pests and for deployment of advanced weed management systems.\n<br><br>\nWe are seeking a protein scientist interested in producing complex, newly discovered, and diverse proteins that require development of optimal expression systems and purification methods to support downstream studies. Our team is part of a multi-functional scientific group with access to the tools of modern protein science. If you are passionate about science, bring your best every day, enjoy taking calculated risks, operate with urgency, enjoy a dynamic team environment, and want to stretch your science into adjacent disciplines, then this may be the best opportunity for the next step in your career.\n\n\n<ul>\n<li>*Responsibilities include:**</li>\n</ul>\n\n? Ensure the team remains at the cutting edge of protein production and characterization technology\n<br><br>\n? Develop new methods for production and characterization of proteins\n<br><br>\n? Identify and implement new or proven technologies to meet evolving project needs on protein production\n<br><br>\n? Collaborate with multi-disciplinary teams to design and execute experiments that enable product development decisions\n<br><br>\n? Exercise diligence in record keeping and publication in peer reviewed journals\n\n\n<ul>\n<li>*Required Education and Skills/Experience:**</li>\n</ul>\n\n? Minimum of a Ph.D. in a relevant discipline (biochemistry, biophysics, Structural Biology, etc.)\n<br><br>\n? Minimum of three or more years of experience in industry or academia with demonstrated and sustained practical expertise in protein production and characterization\n<br><br>\n? Experience in functional protein expression in microbial hosts and/or experience with expression system engineering\n<br><br>\n? Ability to work with strict deadlines in a highly demanding and agile environment\n<br><br>\n? Experience with laboratory automation\n<br><br>\n? Highly effective written and oral communication and interpersonal skills\n<br><br>\n? Demonstrated experience working on multidisciplinary collaborative teams\n\n\n<ul>\n<li>*Desired Skills/Experience:**</li>\n</ul>\n\n? Isolation and reconstitution of membrane proteins\n<br><br>\n? Characterization of proteins by mass spectrometry\n<br><br>\n? Structural Biology\n<br><br>\n? Development of advanced laboratory automation systems\n<br><br>\n? Coding and advanced data analysis skills\n<br><br>\nBayer successfully completed the acquisition of Monsanto in June 2018, bringing together Monsanto?s leadership in seeds and plant traits with Bayer?s leadership in chemical and biological crop protection. By joining forces, we will create even more extensive career opportunities for talent around the world. We?re a global team working to shape agriculture through breakthrough innovation that will benefit farmers, consumers, and our planet.\n<br><br>\nWhile we are now Bayer, we will continue to hire using separate career sites until we can integrate our career platforms. We invite you to explore the career opportunities available at the combined company by visiting advancingtogether.com/careers .\n\n\n<ul>\n<li>*Organization:** _US Biotech-Trait Design and Science_51013268_</li>\n<li>*Title:** _Senior Protein Scientist_</li>\n<li>*Location:** _North America-USA-Missouri-St. Louis_</li>\n<li>*Requisition ID:** _01S14_</li>\n<li>*Job:** _Research &amp; Development_</li>\n<li>*Schedule:** _Full-time_</li>\n</ul>\n\nAt Monsanto, we value a diverse combination of ideas, perspectives and cultures. All qualified applicants will receive consideration for employment without regard to, among other things, race, religion, color, national origin, age, sex, sexual orientation, gender identity, gender expression, status as a protected veteran, or status as a qualified individual with a disability. If you need a reasonable accommodation to access the information provided on this website, please for further assistance.access our disability accommodations process\n<br><br>\nU.S. Employment Law (applicable for U.S. jobs ONLY): EEO Employer Minorities/Females/Protected Veterans/Disabled. For information about equal employment opportunity rights, please refer to this information from the U.S. federal government: ; .\n<br><br>\nEEOC PosterEEOC Supplement"}