{"job title": "Remote Sensing Scientist", "company": "Monsanto", "city state": "– Saint Louis, MO", "rating": "4.0", "job description": "As a Remote Sensing\n<br><br>\nScientist, you will have opportunity to work in a high-tech, high-energy\n<br><br>\nenvironment for a company that encourages innovation and collaboration at all\n<br><br>\nlevels. You will engage with industry leading scientists on projects that will\n<br><br>\nrevolutionize agriculture through the rapid development of next generation\n<br><br>\ntechnologies. You will collaborate closely with data scientists, breeders,\n<br><br>\nother spatial and environmental scientists and developers. You will help build\n<br><br>\nthe next generation of phenomics using novel imagery.\n\n\n<ul>\n<li>*Responsibilities:**</li>\n</ul>\n\n+ Develop new vision and image processing technologiesfor next-generation sensors and platforms.\n<br><br>\n+ Develop 2D and 3D object detection and segmentationalgorithms using RGB, multi and hyperspectral imagery.\n<br><br>\n+ Design algorithms for 3D object classification usingpoint cloud and image data.Deploy efficient data structures that you willbenchmark on speed, accuracy and robustness\n\n\n<ul>\n<li>*Minimum Qualifications:**</li>\n</ul>\n\n+ Master?s Degree or higher\n<br><br>\n+ Previous experience in computer vision, imageprocessing and remote sensing principles.\n<br><br>\n+ Solid foundation in curating and interpreting data froma multitude of imaging modalities (RGB, thermal, LiDAR,multi/hyperspectral, etc.).\n<br><br>\n+ Preferred knowledge with multi-temporal dataprocessing, video processing and 3D scene reconstruction methods.\n<br><br>\n+ Skills in at least two of the followingareas are preferred: QGIS, Python, R, Deep Learning, software interfacingto AWS services, machine learning and spatial data mining\n<br><br>\nBayer successfully completed the acquisition of\n<br><br>\nMonsanto in June 2018, bringing together Monsanto?s leadership in seeds and\n<br><br>\nplant traits with Bayer?s leadership in chemical and biological crop\n<br><br>\nprotection. By joining forces, we will create even more extensive career\n<br><br>\nopportunities for talent around the world. We?re a global team working to shape\n<br><br>\nagriculture through breakthrough innovation that will benefit farmers,\n<br><br>\nconsumers, and our planet.\n<br><br>\nWhile\n<br><br>\nwe are now Bayer, we will continue to hire using separate career sites until we\n<br><br>\ncan integrate our career platforms. We invite you to explore the career\n<br><br>\nopportunities available at the combined company by visiting advancingtogether.com/careers .\n\n\n<ul>\n<li>*Organization:** _GLB Breeding - Analytics &amp; Pipeline Des_51190876_</li>\n<li>*Title:** _Remote Sensing Scientist_</li>\n<li>*Location:** _North America-USA-Missouri-St. Louis_</li>\n<li>*Requisition ID:** _01RPM_</li>\n<li>*Job:** _Research &amp; Development_</li>\n<li>*Schedule:** _Full-time_</li>\n</ul>\n\nAt Monsanto, we value a diverse combination of ideas, perspectives and cultures. All qualified applicants will receive consideration for employment without regard to, among other things, race, religion, color, national origin, age, sex, sexual orientation, gender identity, gender expression, status as a protected veteran, or status as a qualified individual with a disability. If you need a reasonable accommodation to access the information provided on this website, please for further assistance.access our disability accommodations process\n<br><br>\nU.S. Employment Law (applicable for U.S. jobs ONLY): EEO Employer Minorities/Females/Protected Veterans/Disabled. For information about equal employment opportunity rights, please refer to this information from the U.S. federal government: ; .\n<br><br>\nEEOC PosterEEOC Supplement"}