{"job title": "Food Scientist", "company": "Palermo's Pizza", "city state": "– Milwaukee, WI", "rating": "3.4", "job description": "Palermo Villa Inc. is interested in a high-energy, poised and confident individual to assist in the development of concepts, products and optimization projects through Palermo's vigorous consumer-driven R&amp;D process.\n<br><br>\nThe position will apply scientific and engineering principles in research, development, production technology, quality control, packaging, processing, and utilization of foods by performing the following duties. The successful candidate will be required to plan and conduct work requiring a mastery of specialized techniques or ingenuity in selecting and evaluating approaches to unforeseen or novel problems. May be asked to lead technically complex and multi function project teams.\n<ul>\n<li>Identify, evaluate and develop potential new product development opportunities. From bench-top samples to commercialized products, including COG, BOM , raw material &amp; finished product specifications development</li><li>Applies an analytical approach to the solution of a wide variety of problems and assimilates the details and significance of various scientific analyses, procedures, and tests.</li><li>Demonstrates initiative, creativity and thoroughness in the execution of complex projects.</li><li>Plans and conducts independent research projects and participates in the development of project objectives.</li><li>May lead cross-functional teams charged with the development of new business opportunities. Develops strong cross-functional relationships.</li><li>May have managerial duties</li> <li>Conducts new product research and development of foods.</li><li>Contributes to the development of project strategies and recommends technical direction to management.</li><li>Fully understands food standards, safety and sanitary regulations, and good manufacturing practices.</li><li>Evaluates technical trends in their specific area of expertise or assignment, and makes recommendations for process or product improvements and identify opportunities for new or improved process or products.</li><li>Conducts or supervises the testing of new products in test kitchen, the development of specific processing methods in laboratory pilot plant and scaling products up in manufacturing facilities.</li><li>Organize and direct sample development for sales presentations, consumer testing and food safety assurance</li><li>Maintains written technical documentation and product and process specifications as pertaining to R&amp;D.</li><li>Utilizes or directs internal (manufacturing, engineering, marketing, quality systems, procurement) and external (suppliers, consultants) functional experts to resolve issues.</li><li>Assist in PR events, food shows and Sales presentations on key customer calls</li><li>Provide technical support/serves as product development contact for Sales, Customer and Operations</li><li>Oversees the samples shipped out and received by Palermo’s</li><li>Will work cross functionally to deliver year over year cost savings.</li> \n</ul>\nSupervisory responsibilities:\n<br><br>\nMay indirectly supervise one to two Scientists or technicians. Carries out supervisory responsibilities in accordance with the organization's policies and applicable laws. Responsibilities include interviewing, and training employees; planning, assigning, and directing work; appraising performance; rewarding and disciplining employees; addressing complaints and resolving problems.\n<br><br>\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The position requires 10+ years' experience developing products within the food industry, with 5+ of those years' working within a CPG organization, with:\n<ul>\n<li>Strong interpersonal, project management and communication skills, and demonstrated leadership skills.</li><li>Ability to read, analyze, and interpret common scientific and technical journals, financial reports, and legal documents.</li><li>Ability to respond to common inquiries or complaints from customers, regulatory agencies, or members of the business community.</li><li>Ability to effectively present information to top management, public groups, and/or boards of directors.</li><li>Ability to apply advanced mathematical concepts such as exponents, logarithms, quadratic equations, and permutations.</li> <li>Ability to apply mathematical operations to such tasks as frequency distribution, determination of test reliability and validity, analysis of variance, correlation techniques, sampling theory, and factor analysis.</li><li>Ability to define problems, collect data, establish facts, and draw valid conclusions.</li> <li>Strong computer skills are necessary</li> <li>Ability to interpret an extensive variety of technical instructions in mathematical or diagram form and deal with several abstract and concrete variables.</li>\n</ul>\nEducational Requirements:\n<br><br>\nBachelor's Degree in Food Science, Biology, Chemistry, Culinary or equivalent\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}