{"job title": "Principal Scientist, Clinical Testing", "company": "Pfizer", "city state": "– United States - New York - Pearl River", "rating": "3.9", "job description": "<strong>ROLE SUMMARY</strong>\n<br><br>\nThis position is within the Biofunctional Assay area of the High Throughput Clinical Testing group within VRD. The purpose of this position is to design, generate and implement strategies for, as well as to oversee the management of, biofunctional assays and to be responsible for all activities pertaining to the development, qualification and/or validation of bacteriological and/or virological biofunctional assays to support vaccine clinical trials. This work will include state-of-the-art experimental design and technical approaches (including robotics), associated clinical serology laboratory efforts, and extensive documentation (i.e. laboratory notebooks, technical reports, qualification reports, research papers, internal and external presentations, and contributions to regulatory submissions.). All work is to be done in a compliant manner according to relevant SOPs and cGLP guidelines, as appropriate, always following good laboratory safety practices. This position operates with limited supervision and may direct the activities of Ph.D. level scientists and/or other junior scientific staff. Additionally, the incumbent holds supervisory responsibility in training new, as well as managing both new and existing colleagues, providing objectives and goals for their development plans and providing year-end performance reviews.\n<br><br>\n<strong>ROLE RESPONSIBILITIES</strong>\n\n<ul>\n<li>Designs, generates and implements strategies for the development, qualification and/or validation (DQV) of bacteriological and/or virological biofunctional assays using current or innovative technologies, incorporating robotics as appropriate, within business timelines to support vaccine clinical development programs.</li><li>Oversees the management of all aspects of biofunctional assay DQV, including sample preparation and critical reagent acquisition and qualification to support vaccine clinical development programs.</li><li>Designs and oversees the performance of assays, and data analysis and interpretation, to support critical reagent testing, assay DQV and troubleshooting.</li><li>Provides critical review and interpretation of clinical and non-clinical data in order to strategize successful paths forward. This will entail experimental design and execution to facilitate collection and analysis of assay data to support troubleshooting, qualification/validation and other assay-related needs.</li><li>Authors and/or oversees the authoring of technical reports, documents and SOPs needed to support biofunctional assay DQV. This includes data organization/review, and qualification/validation documents when relevant.</li><li>Provides intellectual contributions, and authors documents/reports, for program team needs and regulatory submissions, as needed.</li><li>Satisfactorily completes all cGLP, safety and other assigned training in conformance with job/departmental requirements. Where applicable, performs job responsibilities in compliance with cGLP and all other regulatory agency requirements.</li><li>Engages and supports in OWNIT behavior and culture at Pfizer</li>\n</ul>\n\n<strong>QUALIFICATIONS</strong>\n\n<ul>\n<li>This position requires a Ph.D. with at least 5 years of relevant academic, pharmaceutical, or biotechnology laboratory post-doctoral experience.</li> <li>A strong background in immunology, microbiology, virology, and/or bacteriology is essential. Strong verbal and written communication skills are required.</li><li>In addition to training in virology, cell culture, immunology and/or microbiology, training in a cGLP environment and other international regulatory guidelines is preferred but not required</li>\n</ul>\n\n<strong>EEO &amp; Employment Eligibility</strong>\n<br><br>\nPfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.\n<br><br>\n<strong>Sunshine Act</strong>\n<br><br>\nPfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider’s name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.\n<br><br>\n<strong>Other Job Details:</strong>\n\n<ul>\n<li>Eligible for Relocation Package</li><li>Eligible for Employee Referral Bonus</li>\n</ul>\n\nPfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates."}