{"job title": "Associate Scientist, Upstream Process Development - Weekend Shift", "company": "Solid Biosciences", "city state": "– Cambridge, MA", "rating": "5.0", "job description": "Solid Biosciences is seeking two Associate Scientists to join our Manufacturing and Process Development team and contribute to the development of our upstream Phase III and commercial viral vector manufacturing process. This individual will join a dynamic and motivated team to develop and characterize unit operations in support of a mid to late stage viral vector program, as well as tech transfer of the process to the clinical/commercial manufacturing team. The successful candidate will support experiments supporting development, characterization, scale-up, and transfer of the upstream manufacturing processes. They will also be responsible for evaluation and implementation of new and existing technology.\n<br><br>\nJob duties:\n\n<ul>\n<li>Work with supervisor to design, plan and conduct cell culture experiments using high throughput cell culture models, benchtop bioreactors and/or pilot scale Single Use Bioreactors</li>\n\n<li>Daily monitoring and maintenance of cultures and bioreactor processes, including sampling and performing basic assays</li>\n\n<li>Perform data analysis, prepare technical reports, SOPs, internal and external presentations</li>\n\n<li>Coordinate with other departments and outside vendors for repair, maintenance, and/or calibration of laboratory equipment and systems</li>\n\n<li>Ordering, stocking, and organization of lab supplies</li>\n\n<li>Preparation of reagents, media/buffer, and equipment as needed to support experiments</li>\n\n<li>Maintain good communication and collaboration with colleagues</li>\n\n<li>Performs other related duties and ad hoc projects as required by position</li>\n\n<li>*Please note: This position requires weekend work; i.e., Thursday - Monday or similar</li>\n</ul>\nKnowledge: Education, Experience, &amp; Skills:\n\n<ul>\n<li>Bachelor’s degree in Chemical Engineering, Biochemical Engineering, Biochemistry or equivalent related fields with 1+ years relevant industrial experience required</li>\n\n<li>Bachelor’s or Master’s degree in Chemical Engineering or related field with 2+ years in the biopharmaceutical industry preferred</li>\n\n<li>Experience with cell culture systems of various scales including shake flasks, spin tubes, spinners, and benchtop and Single-Use bioreactors.</li>\n\n<li>Experience with cell culture technologies and operations</li>\n\n<li>Solid understanding and application of scientific and technical knowledge in mammalian cell culture processes</li>\n\n<li>The candidate should be self-motivated, accountable, inquisitive, and have excellent organization and communication skills</li>\n</ul>"}