{"job title": "Data Engineer", "company": "Stride Search", "city state": "– California, United States", "rating": "NA", "job description": "Work in a fast growing startup with unlimited opportunity and\n<br>\nlots of room for growth and advancement. Were on a mission to\n<br>\nsimply residential real estate transactions nationwide by\n<br>\nbringing world-class software, data science, and design to an\n<br>\nage-old industry.\n<br><br>\nWere seeking an exceptional Data Engineer to work on data\n<br>\nproducts at the core of our company's business. Our valuation\n<br>\nmodel, predictive modeling infrastructure, and customer-facing\n<br>\ninformation dashboards are deeply reliant on your work.\n<br><br>\nDay to day, you'll develop systems that ingest, sanitize and\n<br>\nnormalize diverse datasets into meaningful structured data for\n<br>\nanalysts, scientists and engineers. Youll also build expressive\n<br>\nAPIs and performant services that serve this data both internally\n<br>\nand externally.\n<br><br>\n<strong>As a Data Engineer you will:</strong>\n\n\n<ul>\n<li>Develop data infrastructure to ingest, sanitize and normalize</li>\n</ul>\n\na diverse set of entities pertinent to the real-estate market\n\n\n<ul>\n<li>Build performant and expressive interfaces to the data</li>\n<li>Increase the fidelity and amount of metadata we have about</li>\n</ul>\n\neach entity, as well as the connections between these entities\n\n\n<ul>\n<li>Monitor the quality of our geo platform and reduce duplicate</li>\n</ul>\n\nentities\n\n\n<ul>\n<li>Collaborate with Data Scientists to derive features that</li>\n</ul>\n\nimprove our pricing models\n\n\n<ul>\n<li>Become a domain expert in real-estate</li>\n</ul>\n\n<strong>Were looking for teammates who bring:</strong>\n\n\n<ul>\n<li>Experience building data pipelines from disparate sources</li>\n<li>Familiarity with basic classes of ML algorithms, concepts in</li>\n</ul>\n\nentity resolution and feature extraction\n\n\n<ul>\n<li>An understanding of databases and large-scale data processing</li>\n</ul>\n\nframeworks\n\n\n<ul>\n<li>A resourceful and pragmatic approach, not dogmatic or overly</li>\n</ul>\n\nacademic\n<br><br>\n<strong>Bonus points:</strong>\n\n\n<ul>\n<li>Experience working with geodata</li>\n<li>You love delighting customers with honest, transparent</li>\n</ul>\n\nproducts and experiences\n<br><br>\nWe value Openness\n<br><br>\nOur team celebrates our diverse backgrounds, being open\n<br>\nabout who we are and what we do allows us to be better.\n<br>\nIndividuals seeking employment with us are considered without\n<br>\nregards to race, color, religion, national origin, age, sex,\n<br>\nmarital status, ancestry, physical or mental disability, veteran\n<br>\nstatus, or sexual orientation."}