{"job title": "Data Analyst", "company": "360training.com", "city state": "– Austin, TX", "rating": "2.6", "job description": "<strong>If you love working with numbers, creating spreadsheets and pulling data, this is the job for you!</strong>\n<br><br>\nWe are seeking a Data Analyst that will collect, organize and interpret statistical information to make it usable for accurate reporting. A successful candidate will be able to pull raw data from various sources and will facilitate the creation of the reports and analytics for the Finance team. This person should be well-versed in creating insightful analytical models to present to management when needed.\n<br><br>\n<strong>Essential Functions and Responsibilities:</strong>\n\n<ul>\n<li>Collect and interpret statistical data</li>\n<li>Create analytical models to represent the data collected</li>\n<li>Use a proactive approach to analyze and problem-solve</li>\n<li>Ability to sift through data and develop financial models to identify inconsistencies, trends and to ensure accurate reporting.</li>\n<li>Comfortable exploring and analyzing unfamiliar datasets, both structured and unstructured</li>\n</ul>\n<strong>Minimum Knowledge, Skills, and Abilities:</strong>\n\n<ul>\n<li>Bachelor of Science degree in Statistics, Business, or Economics or related field</li>\n<li>Extensive experience using Excel for data reporting and modeling</li>\n<li>Good attention to detail and follow-through</li>\n<li>Strong research and data mining capabilities</li>\n<li>Knowledge of data science or informatics in preferred</li>\n<li>Strong analytical and critical-thinking skills</li>\n<li>Search engines, web analytics and business research tools acumen is a plus</li>\n<li>Familiarity with Google Sheets or Google Analytics is a plus</li>\n</ul>\n<strong>Physical/Environmental:</strong>\n\n<ul>\n<li>Constant sitting, standing, walking and computer use</li>\n<li>Constant communication both in person and via telephone and/or computer</li>\n<li>Occasional bending, reaching and lifting</li>\n<li>A medium to high level of manual dexterity required</li>\n</ul>"}