{"job title": "Data Analyst", "company": "Abbott", "city state": "– United States - New Jersey - Princeton", "rating": "3.5", "job description": "At Abbott, we're committed to helping people live their best possible life through the power of health. For more than 125 years, we've brought new products and technologies to the world -- in nutrition, diagnostics, medical devices and branded generic pharmaceuticals -- that create more possibilities for more people at all stages of life. Today, 99,000 of us are working to help people live not just longer, but better, in the more than 150 countries we serve.<p> </p><b>JOB DESCRIPTION:</b><p>In this role, you will Identify different types of data that need tracking to improve business performance.</p><p>Generate easy-to-interpret reports based on collected data.</p><p>Work with the management team to prioritize suggested changes to each business segment.</p><p>Use statistical methods to identify areas for operational improvement and make suggestions for streamlining processes.</p><p>Work with Technical Service managers to create data collection guidelines for internal global use.</p><p></p><p>Qualifications/Experience:</p><p></p><p>Bachelor’s degree or equivalent experience required with a minimum Bachelor's degree or equivalent experience and demonstrated competence Typically requires 3-5 years of experience to develop the competence to meet the skills and responsibilities of the position. Candidates / incumbents should possess the following: -ability to evaluate complex processes and apply critical-thinking skills to complete assignments that are complex in nature where judgment and initiative are necessary to resolve problems; - ability to assimilate complicated technical information; - ability and aptitude to determine methods to resolve customer concerns and issues in real-time; - independent decision-making skills in critical, fast-paced settings; - problem-solving and troubleshooting skills; - ability to clearly, concisely and accurately convey communications; - ability to form and develop interpersonal, professional relationships; display socially and professionally appropriate behavior; - ability to work independently and in groups; ability to work cross-functionally; - ability or aptitude to use various databases and other computer software applications to complete tasks</p><p>2+ years of data mining experience.</p><p>2+ years in an analyst role.</p><p>Ability to work effectively with management and part of a team to meet targets.</p><p>Strong attention to detail.</p><p>Problem solving and critical thinking skills</p><p>High-level excel skills and the ability to translate information into concise reports.</p><ul><li>Plus to have:</li></ul><p>Experience in call center; developing forecasts/scheduling and workforce planning</p><p>Experience with sf.com application (requirement building and report generation).</p><p></p><p> </p><b>JOB FAMILY:</b>Support Services<p> </p><b>DIVISION:</b>APOC Point of Care<p> </p><b>LOCATION:</b>United States &gt; Princeton : 2 Research Way<p> </p><b>ADDITIONAL LOCATIONS:</b><p> </p><b>WORK SHIFT:</b>Standard<p> </p><b>TRAVEL:</b>No<p> </p><b>MEDICAL SURVEILLANCE:</b>No<p> </p><b>SIGNIFICANT WORK ACTIVITIES:</b>Continuous sitting for prolonged periods (more than 2 consecutive hours in an 8 hour day), Keyboard use (greater or equal to 50% of the workday)<p> </p>Abbott is an Equal Opportunity Employer of Minorities/Women/Individuals with Disabilities/Protected Veterans.<p> </p>EEO is the Law link - English: http://webstorage.abbott.com/common/External/EEO_English.pdf<p> </p>EEO is the Law link - Espanol: http://webstorage.abbott.com/common/External/EEO_Spanish.pdf"}