{"job title": "Data Analyst", "company": "Affiliated Monitoring", "city state": "– Union, NJ", "rating": "3.8", "job description": "Do you want to make an impact? Affiliated Monitoring is a leading technology company focused on life safety security monitoring. We own and operate two of the largest UL listed monitoring centers in the United States. Since our founding in 1977, we have grown by developing innovative services and solving challenging problems for our partners and customers. At Affiliated you’ll have an opportunity to join a work environment that prioritizes learning and collaboration while helping to improve the safety and security of people through technology.\n<br><br>\nWe have an immediate opening for a Data Analyst in our Union, NJ location. This individual will join a team that works with our Data Entry and Sales teams to help onboard new large partners. This team works large complex data sets of critical life safety information. Utilizing tools you will prepare that data for import into our various business systems. At the minimum you should be a pro with Microsoft Excel and database platforms including Microsoft SQL and MySQL. We are looking for a quick learner who is eager to grow their career at a fast growing company that has an important mission protecting the lives and property of its customers.\n<ul>\n<li>Bachelor’s degree required</li><li>High level of MS Excel proficiency, MS Access a plus</li><li>Strong familiarity with MS SQL, MySQL, and other database platforms</li><li>Excellent problem solving skills as well as good communication are required.</li> <li>Experience in an office environment</li> \n</ul>\nData Extraction and Formatting\n<ul>\n<li>Extract data from various file formats, including Excel, CSV, PDF, and others</li><li>Use Excel functions, formulas, and VBA to manipulate data</li> <li>Format data for import into various business systems, including automation and finance systems</li>\n</ul>\nData Import and QA\n<ul>\n<li>Work with Data Entry team to import data into various business systems</li><li>Perform QA of data in these systems to ensure integrity of data</li><li>Make corrections to data, sometimes in bulk, based on issues or changes using SQL and other tools</li>\n</ul>\nSales Support\n<ul>\n<li>Work with Sales team to gather information about customers</li><li>Support Sales team throughout sales process</li><li>Interact with Sales team as needed throughout the customer onboarding process to ensure customer satisfaction</li>\n</ul>\nWe offer a competitive base salary and employees are entitled to a generous comprehensive benefits package including:\n<ul>\n<li>Medical</li><li>Dental</li><li>Vision</li>\n</ul>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}