{"job title": "Data Analyst", "company": "Analytical Mechanics Associates", "city state": "– Dallas, TX", "rating": "3.4", "job description": "<div><div><strong>\n<br>\nData Analyst</strong><br>\n\n<div>\n<div>\nSite\n<br><br>\n<strong>\n<br>\nDallas, TX</strong>\n</div><br>\n\n<div>\nEmployment duration\n<br><br>\n<strong>\n<br>\nPart-Time/Casual</strong>\n</div><br>\n\n<div>\nJob Category\n<br><br>\n<strong>\n<br>\nBusiness Analytics</strong>\n</div>\n</div>\n</div>\n\n<br>Apply Now</div><br>\n\n<div><div>\nJob Brief<br><br>We are actively seeking several motivated Data Analyst at our Dallas, TX location!</div>\n<br><em>Analytical Mechanics Associates, Inc., (AMA) is proud of our customer relationships, our diverse and dynamic work environment, and our employees' career satisfaction. AMA is a small business specializing in aerospace engineering, business analytics, information technology, and visualization solutions. AMA combines the best of engineering and mathematics capabilities with the latest in information technologies and visualization to build creative solutions. Headquartered in Hampton, VA, AMA has operations in Huntsville, AL; Dallas and Houston, TX; Denver, CO; Santa Clara and Mountain View, CA; New Orleans, LA; and Hancock County, MS. We offer a competitive salary and attractive benefits package. Our website describes our corporate values and how they apply to the professional success and growth of our employees.</em><br><br>Job Description<br><br>Analytical Mechanics Associates, Inc. (AMA) is actively seeking several motivated Data Analyst at our Plano, TX location. Project duration is 6-12 months with possible extensions. Projected hours are 40 per week. Key responsibilities include:\n\n<ul>\n<li>Develop an understanding of the business context of financial services data and the business process that generated related data.</li>\n\n<li>Re-factor current data process to improve the aggregation and analysis of data based on assigned task.</li>\n\n<li>Develop and own the intent related to data processes supporting the financial services business function.</li>\n\n<li>Co-ordinate with multiple stakeholders and customers to refine business requirements, escalate data issues, backlog review and prioritization and accountable executive sign-offs on data requests.</li>\n\n<li>Translate knowledge of the business context and business process into suitable data sanity and validation checks</li>\n</ul>\n\nEducation and Qualifications\n\n\n<ul>\n<li>Candidates should possess a M.S. in an analytical field (math, computer science, engineering), or equivalent with 2+ years of professional experience.</li>\n</ul>\n\nExperience should include:\n\n\n<ul>\n<li>2+ years of experience in data analyst role in Mortgage domain (Default/Servicing area)</li>\n\n<li>2+ years SQL experience (Teradata preferred), must be hands-on with SQL</li>\n\n<li>Strong desire and experience with data in various forms (data warehouses/SQL, unstructured data environments/PIG,HIVE, Impala)</li>\n\n<li>Working knowledge of at least one analytics programming language – SAS, R, Python, Java, VBA</li>\n\n<li>Enterprise applications and reporting (Tableau, Cognos, Business Objects, etc.)</li>\n\n<li>Experience leading projects to deliver complex data management solutions; working with internal and external partners</li>\n\n<li>2+ years of experience working within process management and improvement methodologies – Lean, Six Sigma, etc.</li>\n\n<li>2+ years of experience delivering Data Governance and Data Quality Management concepts and practices within the financial services industry</li>\n\n<li>2+ years of experience working with Agile development methodologies</li>\n\n<li>Experience with GIT HUB, subversion, or similar version control software</li>\n\n<li>Unix experience is a plus</li>\n</ul>\nAMA is an Equal Opportunity Employer.</div>"}