{"job title": "Data Analyst", "company": "CJ Affiliate", "city state": "– Santa Barbara, CA", "rating": "3.1", "job description": "<strong>Description</strong><br><br><strong>Account Analyst, Data Science</strong>\n<br><br>\n<strong>Job Summary</strong>\n<br><br>\nCJs Account Analyst is on the Data Science team and works closely alongside Client Development, Product Management, and other internal teams to address business problems through reporting and data analysis. The Account Analyst translates business questions to technical solutions and develops them. A strong candidate will have a passion for deriving actionable information from complex datasets, as well as the ability to work with cross-functional teams to deliver against client and internal goals.\n<br><br>\nThe ideal candidate understands marketing channels, how to evaluate their performance and how to ask questions that provide clear definition of problems or hypotheses.\n<br><br>\n<strong>Core Responsibilities</strong>\n<ul>\n <li>Master and perform all steps required to conduct advanced analytics and create analysis-ready data sets; including data acquisition from various sources, integration and blending, pre-processing, variable preparation/transformation, and quality control (QA/QC)</li> <li>Work directly with client-facing teams to best utilize CJ's core technology platform to achieve and/or exceed client goals</li> <li>Collaborate with internal stakeholders to translate business problems into technical solutions</li> <li>Appropriately account for the timeliness, quality and accuracy of all assignments</li> <li>Manage multiple projects concurrently</li> <li>Present technical solutions to key internal stakeholders in a formal setting, effectively communicating (verbally and written) key concepts and functionalities</li> <li>Ability to use terminology appropriate to each industry (retail, finance, travel, etc.)</li> <li>Effective at managing client expectations via direct and frequent communication with high quality results</li>\n</ul>\n<strong>Minimum Qualifications</strong>\n<ul>\n <li>Bachelors degree in a quantitative discipline (e.g., statistics, economics, mathematics, marketing analytics) or significant relevant coursework/experience</li> <li>2-4 years professional experience with data analysis and business intelligence</li> <li>Demonstrated ability to improve performance by deriving actionable insight from complex datasets</li> <li>Strong technical skills and analytic thought process with excellent attention to detail</li> <li>Strong communication skills and desire to work in cross-functional groups.</li> <li>Experience using SQL on large datasets (or related environments like SAS, Hadoop, Python, etc.)</li> <li>Experience creating data visualizations (Tableau, Domo, Cognos, Power BI, etc.)</li> <li>Expertise with Microsoft Office products; including Excel, PowerPoint, and Outlook</li> <li>Effective organization and time management skills</li> <li>Strong critical thinking and problem solving skills</li>\n</ul>\n<strong>Desirable Qualifications:</strong>\n<ul>\n <li>Advanced degree (MS/PhD) in Statistics, Economics or other quantitative discipline</li> <li>Understanding of basic regression and classification models, including limitations of predictive analytics</li> <li>Understanding of basic statistical theory</li> <li>Ability to program in newer and emerging languages; working knowledge of Hadoop and other big data technologies</li>\n</ul>\n\n<strong>Qualifications</strong><br><br><strong>Why CJ Affiliate?</strong>\n<br><br>\nWere a great place to work! CJ Affiliate offers ideal career development and growth opportunities where you will hone skills in strategic planning and execution, as well as enhance your negotiation and presentation skills. You will develop partnerships and motivate affiliates, learn technical skills applicable to digital marketing and nearly every other industry, and so much more. CJ Affiliate is a leader because our teams have advanced tools, present creative solutions, execute strategically, and drive high performance.\n<br><br>\nWe offer many of the typical benefits like health and dental insurance but we also offer many other great perks like flexible time off, fun activities in our offices, competitive compensation, just to name a few. Our benefits are designed to take care of the whole you and keep you healthy, whether physically, emotionally, financially or socially.\n<br><br>\nCJ Affiliate is a business unit within Conversant and Epsilon which is part of Alliance Data, a top performing Fortune 500 company included in the S&amp;P 500- NYSE: ADS.\n<br><br>\nReady to Work Hard, Play Hard and Make a difference? <strong>Apply now at CJ.com/careers</strong>\n<br><br>\nAlliance Data is an Equal Employment Opportunity employer\n<br><br>\nAlliance Data participates in E-Verify\n<br><br>\nLI*AE"}