{"job title": "Data Analyst", "company": "CyberCoders", "city state": "– Belmont, CA", "rating": "3.9", "job description": "Data Analyst <div>\nAre you tired of working on the same products that don't provide value to the world? Are you looking to make a difference while building products that actually improve people's lives daily in an exciting startup environment? With nearly 100 million regular users in over 125 countries globally, our products are changing the way educators, teachers, parents &amp; student interact &amp; communicate on a daily basis. Due to our constant growth, our team needs to bring on 2-3 Data Analysts (2-3 yrs through Lead Level) to help us continue to scale out &amp; build new products. Ready to join a mission-driven company where you will know your work actually makes a difference in the world? Apply today!</div>\n\n<br>What You Will Be Doing<div>\n\n\n<ul>\n<li>Using stats, predictive modeling, data analysis/trend analysis for collection, exploration and identification of the right data for analysis from both external and internal sources</li>\n<li>Working extensively in SQL, R &amp; Tableau</li>\n<li>Advanced statistical analysis</li>\n<li>Expanding data collection process, including relevant info for build out of analytical systems</li>\n<li>Clean, processing &amp; verifying data &amp; integrity in data</li>\n<li>Building &amp; customizing data models, driving innovative solutions</li>\n<li>Validating current models, implementing improvements</li>\n<li>Building predictive models with data, testing models on results, verifying the model in real-world setting</li>\n<li>Using machine learning, data mining to help design &amp; implement algorithms to analyze and model big data sets</li></ul></div>\n\n\nWhat You Need for this Position<div>\n\n\n<ul>\n<li>We need multiple levels, from 2 years professional experience to lead-level</li>\n<li>MA/MS in Computer Science/Math/Stats/Physics (PhD is nice to have) or related discipline &amp; 3+ years related data science, data analysis with a background in consumer facing products</li>\n<li>Should have a strong statistics background or applied statistics experience</li>\n<li>SQL experience including doing ad-hoc SQL queries, etc. - a SQL test will be part of the screening process</li>\n<li>Tableau or related data visualization tool experience</li>\n<li>Social Network company experience is a plus</li>\n<li>Advanced data modeling &amp; excel experience</li>\n<li>Data Mining experience and/or Advanced Statistical Analysis or Math experience is a big plus</li></ul></div>\n\n\nWhat's In It for You<div>\nJoin a mission-driven company where you have a real opportunity to make a big difference to millions of users!\n<br>\nCompetitive pay + pre-IPO stock\n<br>\nMedical, dental, disability / AD&amp;D insurance covered by company\n<br>\n401k\n<br>\nFree lunch every day! Breakfast weekly, commuter benefits (close to Caltrain!), easy parking, open floor plan\n<br>\nPaid membership to a gym within shouting distance to the office!\n<br>\nOnsite weekly massages at a solid discount</div>\n<br>\n<div>\nSo, if you are a Data Analyst or Scientist with consumer facing products experience, please apply today!</div>\n\n<li><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}