{"job title": "Senior Analyst, Data and Analysis", "company": "Digitas", "city state": "– US-NY-New York", "rating": "3.5", "job description": "<div><div>\n<div><strong>Senior Analyst – Data &amp; Analysis</strong>\n<br><br>\nDigitas is a highly-caffeinated playground where brilliant minds come together to bring bold, award-winning ideas to life.\n<br><br>\nThe Data &amp; Analysis team uses data-driven insights to fuel strategic growth for clients. We believe that data should never exist in a vacuum; instead, it should be put to work to bring the best ideas and stories to our clients.\n<br><br>\nTo help with this, we’re looking for an outstanding Senior Analyst – someone who can analyze massive data sets, make insightful cross-channel recommendations, and communicate strategic ideas to clients. Sound like you? Read on.\n<br><br>\n<strong>What you’ll do:</strong>\n<br><br>\nAs a Senior Analyst, you’ll build the strategic and tactical foundation for data-driven marketing efforts. You’ll work to achieve client goals through brand and acquisition campaigns, site optimization, and/or online testing strategy.\n<br><br>\n<strong>Day-to-day, your role includes:</strong>\n<ul>\n<li>Instituting frameworks across project and campaign lifecycles, including measurement plans, primary and secondary research, and performance reporting</li><li>Diving into large data sets, uncovering insights, and providing impactful recommendations to clients</li><li>Connecting the dots across channels through data (including display media, site, search, email, and social) to provide a holistic view of marketing efforts</li> <li>Communicating with clients regularly on scheduled deliverables and ad-hoc requests</li><li>Collaborating with internal teams and external partners to drive success for client’s business goals</li>\n</ul>\n<strong>We’re looking for strong, impactful work experience, which typically includes:</strong>\n<ul>\n<li>3-5 years of experience in analytics or strategy</li> <li>A four-year college degree</li><li>Passion for digital marketing and emerging trends in the digital landscape</li><li>Experience communicating with internal and external stakeholders at a variety of levels</li><li>Fluency with Excel (including pivot tables and vlookups) and/or other data analysis tools such as SQL or Tableau</li> <li>Comfortable in a fast-paced and deadline-driven environment</li>\n</ul>\nGot what it takes? We’d love to hear from you.\n<br><br>\nDigitas is an equal opportunity employer.</div>\n</div>\n</div>\n<br>"}