{"job title": "Data Analyst", "company": "Everlane", "city state": "– San Francisco, CA", "rating": "3.8", "job description": "<div>Everlane is seeking a Data Analyst to join our Data and Analytics team, where youll use data to help us build a better understanding of how our product works, who our customers are, and what drives our companys growth.</div><br>\n<div>As a team, we lean on a full-stack set of methodologies and tools to solve these problems, taking a data science problem from an initial open ended question to the eventual business implementation of a model. The subject areas that you will impact span the entire company, from quantifying the experience of our customers on everlane.com, to identifying optimization opportunities in our supply chain.</div>The Job\n\n<ul>\n<li>Work with business stakeholders to create metrics and self service reporting around key strategies</li><li>Partner with teams across the company to translate their questions into robust data analyses</li><li>Communicate results in clear and informative fashion, both in order to advise strategy, but also to guide other teams in interpreting their own data</li><li>Design and analyze rigorous experiments aimed at understanding customer behavior</li>\n</ul>\n\nThe Qualifications\n\n<ul>\n<li>BA/BS degree in a quantitative or computing focused degree</li><li>2+ years of experience wrangling and analyzing large datasets to solve open ended business problems</li><li>Experience in SQL extending to knowledge of database design and warehousing concepts</li><li>Understanding of the fundamentals of statistics and probability</li><li>Strong communicator, especially when distilling complex concepts for a general audience</li><li>Experience in R, Python, or another data science suitable language</li>\n</ul><br>\n\n<div>At Everlane, were rethinking the way retail works. We have no middlemen taking their cut and no brand markups. Instead, we design our own luxury basics and sell them exclusively at a fraction of the traditional retail price. Since launching in November 2011, Everlane has attracted over 1,300,000 members and has been featured in The New York Times, New York Magazine, The Economist, Elle, and GQ.</div><br>\n<div>Please note before submitting an application: as a company, we take hiring very seriously. Interviewing with Everlane may include video and phone interviews, written projects, and/or on-site interviews. Although we are unable to follow-up with each and every applicant, we do our best to run a thorough process for candidates with whom we identify a potential fit.</div><br>\n<div>Everlane provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, genetics, sexual orientation, gender identity or gender expression.</div>"}