{"job title": "Data Analyst", "company": "H10 Capital", "city state": "– Seattle, WA", "rating": "4.5", "job description": "Job Description<div>Our E-commerce client is looking fro a qualified candidate for the following role:\n<br><br>\n**************************************************************************************\n<br><br>\n<strong>Title: Data Analyst (29666)</strong>\n<br><br>\n<strong>Duration: 9 months</strong>\n<br><br>\n<strong>*Potential for Extensions or Conversion</strong>\n<br><br>\nWe are currently seeking an Agile Configuration Management Analyst to join our Configuration Management team at our Seattle location in the Data Center Life Cycle team, Infrastructure.\n<br><br>\nWe are looking for an individual who is responsive, flexible and able to succeed within an open collaborative peer environment. You must be motivated to work in a data driven environment, have a desire to drive change, and long for the opportunity to analyze systematic issues and implement solutions to challenging problems.\n<br><br>\n<strong>Job Responsibilities:</strong>\n\n\n<ul>\n<li>Participates in the coordination and administration of assigned configuration management activities relative to Agile PLM</li>\n<li>Work closely with Oracle Agile PLM key stakeholders to design and implement application configurations to meet business process and application requirements</li>\n<li>Configure the PLM system in adherence to business requirements, system administration, customizations etc</li>\n<li>Facilitating and leading process mapping, data collection, process learning and continuous improvements</li>\n<li>Support PLM activities for Part/ BOM creation, releases, changes and maintenance, Document Control Operations, Engineering Change Notices, and all other related PLM efforts</li>\n<li>Collaborating in problem-solving teams and driving activities that enhance business outcomes</li>\n<li>Researching and verifying technical content as needed. Evaluating technical content for cohesiveness and completeness</li>\n<li>Coordinating changes to configuration management processes with engineering, manufacturing, and other support stakeholders</li>\n<li>Ensures that customer requirements are implemented and ensures compliance with configuration management policies</li>\n<li>Act as an advocate of Product Lifecycle Management best practices, methods, and processes</li>\n<li>Support the users and Agile analyst in troubleshooting both application and business process issues</li>\n</ul>\n\n<strong>Required Skills</strong>\n\n\n<ul>\n<li>Bachelor's Degree in Computer Science/Computer Engineering/Information Technology/Industrial Engineering or related discipline</li>\n<li>Excellent time management and organizational skills</li>\n<li>Excellent decision making capability to make timely decisions with the information at hand</li>\n<li>Proven ability to work with and influence peers and management and facilitate agreement among stakeholders with different interests</li>\n</ul>\n\n<strong>Preferred Skills</strong>\n\n\n<ul>\n<li>Working knowledge and understanding of engineering documentation (i.e. drawings, specifications, manufacturing plans)</li>\n<li>Knowledge or demonstrated experience using Oracle Agile PLM functionality/software</li>\n<li>Experience with SQL to extract data from Oracle EBS for Manufacturing and Quality analytics.</li>\n<li>Proven track record of complex and creative problem solving</li>\n<li>Team player with strong written and verbal communication skills and the ability to work with diverse internal and external customer groups</li>\n<li>Ability to work in an ambiguous, 'internet-speed' environment</li>\n<li>Proven ability to work with and influence peers and management and facilitate agreement among stakeholders with different interests</li></ul></div>Company Description<div>We're a staffing agency specializing in contract and contract-to-hire positions in the Greater Seattle Area. One of the things we pride ourselves in is only sourcing from the Greater Seattle area as well. This allows us to go to our clients we work with and tell them that you're ready to work within a 2 weeks notice. No moving relocation fees are necessary. The two companies that we primarily deal with, and who we are also preferred vendors for are Microsoft and Amazon.\n\n\nOften times we hear that people feel like their resumes go into this void and they never get contacted. Come work with us and we'll help you get that foot in the door!</div>"}