{"job title": "Data Analyst", "company": "Investor Management Services", "city state": "– Charlotte, NC", "rating": "4.4", "job description": "<strong>Summary/Objective of Position:</strong><br><br>We are growing and are adding a Data Analyst to the team. In this position you will interact with clients to aggregate their data (including: asset level, investment level, distributions, contacts and documents) and organize it within the IMS Platform. You will work with our product team to provide a solid foundation for clients to utilize the platform.\n<br><br>\nThis role is an incredible opportunity to get into a technology startup experiencing explosive growth, work with our most strategic clients, and provide a career growth platform for your high ambition and drive.<br><br><strong>\n<br>\nCompetencies for Success in This Role:</strong>\n\n\n<ul>\n<li>Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy</li>\n\n<li>Experience working with advanced financial calculations</li>\n\n<li>Time management and organizational skills</li>\n\n<li>Solid communication skills</li>\n\n<li>Flexibility for business travel</li>\n\n<li>Excellent written and verbal communication skills with client facing responsibilities</li>\n\n<li>Self-Starter with the ability to multi-task in a fast paced start up environment</li>\n\n<li>Willingness and drive to succeed and deliver results to internal and external clients</li>\n\n<li>Insatiable appetite for learning and constant improvement. Not afraid to challenge and redesign the status quo. Everything done well can be done better</li>\n</ul>\n\n<strong>\n<br>\nRequired Education and Experience:</strong>\n\n\n<ul>\n<li>Bachelor’s degree required</li>\n\n<li>Minimum of 1 to 3 years of prior business experience required</li>\n\n<li>Previous modeling and/or financial analysis work required</li>\n\n<li>Commercial Real Estate (CRE) finance knowledge is a plus. Private Equity finance experience is a big plus.</li>\n\n<li>Experience with Microsoft products, including: Excel (expert level), Outlook, Word and PowerPoint</li>\n</ul>\n\n<strong>\n<br>\nLocation:</strong><br><br>This role is located in Charlotte, North Carolina."}