{"job title": "Data Analyst", "company": "Mercatus Center", "city state": "– VA, Arlington", "rating": "4.2", "job description": "<div>The Mercatus Center at George Mason University is seeking an entry-level Data Analyst to join our Policy Analytics Team. The Policy Analytics Team—a key part of Mercatus’s Program for Economic Research on Regulation—works at the frontier of policy research, applying the tools of data science in the realm of public policy to advance our understanding of the causes and effects of policy decisions.\n<br><br>\n<strong>Your Work Will Include:</strong>\n<ul>\n\t<li>Developing innovative data visualizations that allow users to explore and interact with our unique data products</li>\t<li>Helping to develop new platforms for data visualization</li>\t<li>Helping design and develop new tools and datasets that facilitate cutting-edge research at the intersection of data science, economics, and public policy</li>\n</ul>\n<strong>Basic Qualifications:</strong>\n<ul>\n\t<li>Experience with at least one modern programming language, such as JavaScript or Python</li>\t<li>Familiarity with web design and development</li>\t<li>Strong applied statistical skills</li>\t<li>Firm grasp of data visualization best practices</li>\t<li>Experience with version control tools, such as Git</li>\n</ul>\n<strong>Particularly Strong Candidates May Also Have:</strong>\n<ul>\n\t<li>Experience with common data visualization toolkits, such as plotly, d3, matplotlib or ggplot2</li>\t<li>Experience with SQL and/or NoSQL</li>\t<li>Basic understanding of economics, especially in application to public policy</li>\t<li>Familiarity with WordPress</li>\t<li>Familiarity with Docker</li>\t<li>Familiarity with continuous integration and deployment tools (Jenkins, TravisCI)</li>\t<li>Experience with Amazon Web Services</li>\n</ul>\n<strong>Help us grow</strong>\n<br>\nPlease submit your cover letter and resume through our online application process. Your cover letter must indicate your interest the Mercatus Center's mission.\n<br><br>\n<strong>Employee Benefits</strong>\n<br>\nSalary is competitive and will be commensurate with experience. In addition, excellent benefits to all individual employees, including full health and dental coverage, flexible spending accounts, long-term disability and life insurance, a 403(b) retirement savings program, a parking permit, and free credits at George Mason University.\n<br><br>\n<strong>About the Mercatus Center at George Mason University</strong>\n<br>\nFor over 25 years, the Mercatus Center at Georg e Mason University has been the world’s premier university source for market-oriented ideas—bridging the gap between academic ideas and real-world problems. A university-based research center, Mercatus works to advance knowledge about how markets work to improve our lives by training graduate students, conducting research, and applying sound economics to offer solutions to society’s most pressing problems.</div> <div> Full-Time/Part-Time Full-Time</div> <div> Location Mercatus Center</div><br>\n\n<div>This position is currently accepting applications.</div> <div>Apply Now</div> <br>"}