{"job title": "Data Analyst", "company": "pymetrics", "city state": "– New York, NY", "rating": "4.9", "job description": "Using neuroscience-based assessments and machine learning algorithms, pymetrics is reinventing the recruiting industry by matching candidates to jobs and companies where they are most likely to succeed. We are leading the charge in an evolving industry, and growing our amazing team to support the mission of using data to unleash one's full potential and remove bias from hiring.\n<br><br>\nWe are looking for a talented Data Analyst who has a curiosity for solving problems and a propensity for exploring data. You will work with the Data Team to draw insights into what makes our clients unique, and use a growing data set to explore how neuro-cognitive traits predict job fit. The ideal candidate will have some exposure to data science and machine learning, statistics, and computer programming.\n<br><br>\n<strong>Requirements</strong>\n<ul>\n <li>BS/BA required.</li> <li>0-2 years experience in the field.</li>  <li>Some experience with computer programming:\n\n<ul>\n <li>Ability to work with large, messy datasets to perform data processing, manipulation, and analysis.</li> <li>Experience in Python and its scientific libraries (SciPy, Scikit, Pandas, NumPy) required.</li></ul> </li>\n<li>Some experience with statistics (1+ course).</li> <li>Strong interest in data science, machine learning, and predictive modeling (previous exposure is even better!):\n\n<ul>\n<li>Ability to think critically about data, developing creative solutions to unique problems.</li></ul></li>\n<li>Effectively communicate results via written reports and presentations explaining complex problems and solutions to non-technical audiences.</li> <li>Prefers working in a collaborative environment.</li>\n</ul>\n<strong>Benefits</strong>\n<ul>\n <li>Health care plan (medical, dental &amp; vision)</li> <li>Unlimited paid time off (including vacation, sick &amp; public holidays)</li> <li>Family leave (maternity, paternity)</li> <li>401k</li> <li>Team budget for training &amp; development</li> <li>Stock option plan</li> <li>Commuter transportation reimbursement</li> <li>Fun, diverse and intellectually eager coworkers</li> <li>Team happy hours and retreats</li> <li>Dog-friendly workplace</li>\n</ul>"}