{"job title": "Data Analyst", "company": "Tekwissen", "city state": "– Homewood, IL", "rating": "4.1", "job description": "Job Description<div><strong>Duration:</strong> 6 Months (Possibility going to Direct)\n<br><br>\n<strong>Description:</strong>\n<br><br>\nThis position will be responsible for working with engineering, operations and fleet teams to manage Reliability projects in the railroad environment on locomotives and other systems with a goal of identifying trends/abnormalities in faults and other data that lead to early detection of trends.\n<br><br>\n<strong>Essential Responsibilities</strong>\n<br><br>\n§ Maintain project scorecards for tracking outcomes and implementation.\n<br><br>\n§ Maintain daily, weekly &amp; Monthly reporting for fleet team and prepare ad hoc reports\n<br><br>\n§ Make presentations to other teams and management on projects.\n<br><br>\n§ Support and drive projects to enable condition-based maintenance in the service operation\n<br><br>\n§ Assist customer and shop / field teams in implementing projects, troubleshooting project issues by performing data mining, analysis and reporting.\n<br><br>\n§ Continuously embed discoveries/learning back into other business functions and project teams by data analysis.\n<br><br>\n<strong>Qualifications/Requirements</strong>\n<br><br>\n§ Bachelor’s Degree from an accredited college or university\n<br><br>\n§ Minimum of 3 years of data analysis experience preferably in an engineering, Production or Manufacturing environment.\n<br><br>\n§ Expert level Excel user (Graphs, Charts, V-Lookups, Pivot tables, etc.) with above average skills in MS Access, SQL and other commonly used data analysis tools.\n<br><br>\n§ Proficient in use of commonly used office software with aptitude to learn custom systems quickly.\n<br><br>\n§ Strong statistical &amp; mathematical background with analytical and quantitative skills; familiarity with Six Sigma concepts and tools.\n<br><br>\n<strong>Desired Characteristics</strong>\n<br><br>\n§ Ability to communicate with all levels of internal and external organizations, including upper management\n<br><br>\n§ Ability to execute multiple projects simultaneously and work effectively in a cross-functional team\n<br><br>\n§ Ability to identify opportunities to improve processes and initiate change; demonstrated commitment for process improvement\n<br><br>\n§ Strong interpersonal, influence, and conflict resolution skills\n<br><br>\n§ 1st hand knowledge of railroad operations and maintenance practices\n<br><br>\n§ Six Sigma, Lean, or equivalent Quality Program certification.\n<br><br>\n§ Working knowledge of RR information systems and databases</div>Company Description<div>TekWissen Is Hiring!!</div>"}