{"job title": "Data Analyst", "company": "The Boston Globe", "city state": "– Taunton, MA", "rating": "3.5", "job description": "<div><div><strong>COME JOIN OUR TEAM!</strong> The Boston Globe direct marketing division, Globe Direct, is searching for a full-time Data Analyst to drive client's direct-marketing strategy, outlining data solutions for direct mail, e-mail and multi-channel marketing campaigns.\n<br><br>\nResponsible for increasing client’s lead generation and response rates across all marketing platforms. Work closely with Sales team and executives to craft a data approach that will maximize client’s return on investment.\n<br><br>\nPerform various data functions, including the generation of list counts and orders, geo-targeted maps, and ad-hoc and weekly analysis reporting. Lead the conception, organization and execution of mid-year and year-end analysis reports to gauge effectiveness of marketing programs.\n<br><br>\nCompetitive Salary, 401K, and Benefits including Medical, Dental, Vision. Life and Long-term Disability Insurance. Position is 40 hours per week.\n<br><br>\nJOB RESPONSIBILITIES:\n\n<ul>\n<li>Create and implement client campaign strategy, marketing schedules and budgets.</li>\n\n<li>Perform advanced analytics including modeling, segmentation, forecasting, and predictive analysis.</li> \n\n<li>Provide recommendations for growth, cost reduction and optimization of operational performance.</li> \n\n<li>Identify customer demographics for sales campaigns, generate reports, and score data.</li> \n\n<li>Identify trends or patterns that impact strategy and future marketing campaigns.</li> \n\n<li>Create recommendations and new methods to enhance current analytics.</li> \n\n<li>Support the production of new analytical capabilities and solutions to increase campaign results.</li>\n\n<li>Work with sales staff creating clients initiatives, providing data sets and demographics for potential and existing sales campaigns.</li>\n\n<li>Provide end of campaign reporting results and analysis.</li>\n</ul>\nQUALIFICATIONS:\n\n<ul>\n<li>Bachelor’s degree in Marketing, Computer Science, Applied Math/Science or related field.</li> \n\n<li>4+ years analytics experience with focus on Marketing or Business Analytics.</li> \n\n<li>Proficient in SQL, SAS, DataFlux, Tableau</li>\n\n<li>Knowledge of industry best practices in marketing measures, data-mining, experimental design and other statistical techniques.</li> \n\n<li>Advanced in Microsoft Office, with focus on Excel and Powerpoint.</li> \n\n<li>Training experience.</li> \n\n<li>Strong communication, presentation, multi-task and organizational skills, with ability to prioritize and meet strict deadlines.</li> \n\n<li>Strong attention to detail, along with strategic thinking and effective problem-solving ability.</li> \n\n<li>Team player.</li>\n</ul>\n\n</div>\n</div><div></div>"}