{"job title": "Data Scientist", "company": "AvidXchange", "city state": "– 1210 AvidXChange Lane, Charlotte, NC 28206", "rating": "2.9", "job description": "<div>\n&nbsp;\n<br><br>\nData Scientist&nbsp;\n<br>\nCharlotte, NC&nbsp;<br><br>As a Data Scientist at AvidXchange, you will have the opportunity to work with cross-functional and interdisciplinary teams to solve challenging and engaging business problems that have a direct and measurable impact on the business. We are seeking intelligent and innovative thinkers, creative problem-solvers, and those with an aptitude for learning both quickly and continuously to help us establish and build out a data science practice at our firm. You will be challenged to excel and lead alongside the brightest talent in the Financial Technology industry, to build and validate models, and to create meaningful data products and insightful analytics that positively transform the organization’s capabilities.<br><br>Job Responsibilities:\n\n<ul>\n<li>Design, construct, train, and deploy machine learning / artificial intelligence models aimed at both automating business processes and approximating business functions</li> <li>Create probabilistic and deterministic models to drive business decision making</li> <li>Generate insight and socialize results across organization</li> <li>Build mutually beneficial relationships across organization and help empower business units to translate business problems into data science problems</li> <li>Compile and deliver documentation such as white papers and technical notebooks for presentations</li> <li>Collaborate with engineering teams to develop prototypes and products that can be deployed across varied environments</li> <li>Work directly with C-level executives to develop a portfolio of projects and products that will drive competitive advantage</li> \n</ul>\n\n<strong>Experience and Qualifications:\n<br>\n</strong>\n\n<ul>\n<li>Bachelor’s degree or equivalent in statistics, mathematics, computer science, operations research, economics, or a related quantitative field</li><li>At least 2 years of experience with data querying languages (e.g. SQL)</li><li>At least 2 years of experience with scripting languages (e.g. Python), or statistical/mathematical software (e.g. R, Weka, SAS, Matlab), OR Master’s Degree in related quantitative field</li><li>Ability to apply relevant machine learning and data modelling techniques used in supervised problems (e.g. support vector machines, random forests, gradient boosted machines, linear/logistic regression, deep learning, etc.) and unsupervised problems (e.g. clustering, dimensionality reduction, etc.) in at least one statistical tool/language (e.g. R, Python)</li><li>Experience with end-to-end machine learning process based on CRISP-DM framework</li><li>Experience articulating business questions and using quantitative techniques to arrive at a solution using available data</li><li>Excellent verbal and written communication skills with the ability to effectively advocate technical solutions to both engineering teams and business audiences</li><li>Proven track record of dealing well with ambiguity, prioritizing needs, and delivering results in a dynamic environment</li>\n</ul>\n\n<strong>Preferred Qualifications:\n<br>\n</strong>\n\n<ul>\n<li>Master’s Degree in related quantitative field</li><li>Experience delivering insights and decision support for sales and marketing organizations, especially in financial services</li><li>Experience with big data analytics technology such as Azure, Hadoop, Spark and related modules</li><li>Experience with natural language processing and text mining</li><li>Knowledge of deep learning architectures (e.g. Convolutional Neural Networks, Feedforward Neural Networks, Restricted Boltzmann Machines, etc.)</li>\n</ul>\n&nbsp;\n<br>\n<strong>&nbsp;</strong>\n<br>\n<strong>&nbsp;</strong>\n<br>\n&nbsp;</div>\n<br>"}