{"job title": "Data Scientist", "company": "Groupon", "city state": "– Palo Alto, United States", "rating": "3.5", "job description": "Groupon, Inc. is looking for a Data Scientist to join our team in Palo Alto, CA.\n<br><br>\nCore Responsibilities:\n<ul>\n<li>Design and build scalable computing systems for collecting, integrating and processing large sets of structured and unstructured data from disparate sources and feed the results of the computations to other downstream systems within established service level agreement timeframes</li><li>Work closely with peers from the product, engineering and data science teams to form good hypotheses on how to improve the business</li><li>Design, execute and measure experiments to test these hypotheses</li><li>Productionalize solutions that show lift</li><li>Build complex algorithms that create personalized experiences for each of our millions of customers while working with the team to design user interactions that are simple, intuitive and implemented correctly</li><li>Architect code for large scale, high performance, and maximum security</li><li>Develop highly flexible data pipelines that execute complex ETL processes, and develop and maintain tools that automate and visualize the data pipelines</li><li>Analyze existing data system capabilities and requirements utilizing various technologies and web logs to adapt to new hardware and data storage needs to optimize performance of the system.</li>\n</ul>\n<strong>REQUIREMENTS:</strong>\n<br><br>\nBachelor's degree in Computer Science, Computer Engineering, Statistics, Economics, or related field or foreign academic equivalent plus 2 years related experience.\n<br><br>\n<strong>Experience must have included any level of experience in:</strong>\n<ul>\n<li>Design and build scalable computing systems for collecting, integrating and processing large sets of structured and unstructured data from disparate sources and feed the results of the computations to other downstream systems within established service level agreement timeframes</li><li>Work closely with peers from the product, engineering and data science teams to form good hypotheses on how to improve the business</li><li>Design, execute and measure experiments to test these hypotheses</li><li>Productionalize solutions that show lift</li><li>Develop highly flexible data pipelines that execute complex ETL processes, and develop and maintain tools that automate and visualize the data pipelines</li><li>Analyze existing data system capabilities and requirements utilizing various technologies and web logs to adapt to new hardware and data storage needs to optimize performance of the system</li>\n</ul>\n#LI-DNP #LI-DNI"}