{"job title": "Senior Scientist, Regulatory and Nutrition", "company": "Cargill", "city state": "– Wayzata", "rating": "3.5", "job description": "<div><div><div>Position Purpose &amp; Summary</div>\n<br>\n<strong></strong><br>\n\n<div>This position will provide scientific and regulatory leadership and nutrition support in the food and feed space in the North America to help enable significant and sustainable growth in these businesses.</div> \n<br>\n<strong></strong><br>\n\n<div>Principal Accountabilities</div>\n<br>\n<strong></strong><br>\n\n<div>40&gt; - Work independently and with external and internal expert resources, to develop regulatory strategies for Cargill products and to prepare scientific support documentation for regulatory submissions, US and globally, e.g., GRAS notifications, food and feed additive petitions, novel food submissions. Critically review and finalize regulatory dossiers to support new and expanded product uses/approvals. Liaise with regulatory bodies and governmental officials regarding submissions. Assess data related to the efficacy of Cargill products for purposes of claim substantiation as needed.</div> \n<br>\n<strong></strong><br>\n\n<div>20&gt; - Provide regulatory leadership and support to Cargill business marketing/communications, technical functions, and customers. For example, complete review of new ingredient claims, product labeling, advertising and marketing initiatives to assess product compliance with appropriate regulations.</div> \n<br>\n<strong></strong><br>\n\n<div>20&gt; - Provide strategic scientific and regulatory support to FSQR/Corporate Affairs/Law in developing Cargill positions on proposed nutrition&amp; other regulatory initiatives that impact current and future directions for Cargill products.</div>\n<br>\n<strong></strong><br>\n\n<div>20&gt; - Participate in external trade and science-based initiatives (e.g. ILSI, IFIC, GMA) and monitor regulatory and nutrition trends (issues and opportunities), communicate appropriately to internal business partners. Provide regulatory support and interpretation for Cargill customers, as needed. Establish a professional network of expert</div> \n<br>\n<div>Required Qualifications</div>\n<br>\n<strong><ul>\n<li>MS or PhD in Nutrition, Food Science, Biochemistry or related life sciences</li>\n<li>Working knowledge of food and/or feed regulations, specifically pertinent to food safety and human health</li>\n<li>Minimum three years’ experience in nutrition Science and Regulatory Affairs</li>\n<li>Willingness to travel, including international (up to 20&amp;)</li> \n\n<li>Ability to work effectively both independently and as part of cross-functional teams</li> \n\n<li>Ability to create an internal network to be able to quickly answer to customer requests</li> \n\n<li>Ability to effectively communicate &amp; partner with internal (different BU) &amp; external stakeholders</li> </ul></strong></div><strong>\n\n<br><strong></strong><br>\n\n<div>Preferred Qualifications</div>\n<br>\n<strong></strong>\n<br><br>\n<strong><ul>\n<li>Strong desire to work in the food industry</li> \n\n<li>Ability to work in cross-functional team environment across the geographies.</li></ul></strong></strong></div><strong><strong>\n\n<br><strong></strong>\n<br></strong></strong>"}