{"job title": "Data Analyst", "company": "CyberCoders", "city state": "– Lake Forest, CA", "rating": "3.8", "job description": "Data Analyst <div>\nAre you tired of working on the same products that don't provide value to the world? Are you looking to make a difference while building products that actually improve people's lives daily in an exciting startup environment? Due to our constant growth, our team needs to bring on 2-3 Data Analysts (2-3 yrs through Lead Level) to help us continue to scale out &amp; build new products. Ready to join a mission-driven company where you will know your work actually makes a difference in the world? Apply today!\n</div>\n\nWhat You Will Be Doing<div>\nAs a Data Analyst, you will analyze hyper-local data sources to develop accurate interpretations of audiences and behaviors, and develop data structures to facilitate the analysis. A mixture of analytical approaches are required, including raw data mining, data visualization, application of rules and heuristics and supervised / unsupervised machine learning techniques. <br>We deal with extremely large data sets requiring the design and development of highly memory- and cpu-efficient methods. We use a mixture of commercial, open source and home-grown solutions. <br>Responsibilities:<br>- Raw data analysis - assessing quality, cleansing, structuring for downstream processing<br>- Design and prototype of accurate and scalable prediction algorithms<br>- Functional and technical documentation of designs<br>- Collaboration with engineering team to bring analytical prototypes to production<br>- Communication of results to partners and customers\n</div>What You Need for this Position<div>\nKnowledge/Skill Requirements:<br>Advanced level of proficiency in Microsoft Office, with advanced Excel functions and modeling, including the use pivot tables and macros for Financial Analysis<br>Experience with Oracle Business Intelligence Enterprise Edition (OBIEE) and/or the Oracle Sales Module<br>Experience with web technology including dashboards and portals<br>Demonstrated experience with modeling, abstract-trend analysis<br>Proven ability to manage large amounts of data efficiently<br>Proficient in learning new systems, creating training documentation, and developing/delivering training sessions<br>Solid planning, priority setting, and project management skills with experience managing multiple individual and/or team based projects and resources concurrently<br>Excellent verbal, written communication and organizational skills and good at developing relationships across cross-functional teams (including Sales, Marketing, Finance, Operations and Engineering resources)<br>Ability to display data visually, creating powerful presentations which effectively demonstrate the value of analytic deliverables<br>Proven problem-solving &amp; root cause analysis skills, using creativity and out-of-the box thinking to resolve issues<br>Team player with the ability to mentor less experienced resources<br>Uncompromising judgment towards confidentiality &amp; business ethics<br>Conduct research and provide data on industry, our customers and the competition<br>Education/Experience Requirements: <br>Required:<br>Bachelor's Degree, ideally in a quantitative discipline (statistics, economics, mathematics, marketing analytics); MBA preferred<br>8+ years of Sales Forecasting, Financial Analysis, and/or related Analytics experience<br>3+ years in Aviation, Aerospace and/or In-flight Entertainment &amp; Communications<br>3+ years' experience with Oracle, SQL and/or Hyperion<br>Solid experience with business visualization tools (e.g. interactive dashboard software)\n</div>What's In It for You<div>\n- Vacation/PTO<br>- Medical<br>- Dental<br>- Vision<br>- Relocation<br>- Bonus<br>- 401k<br>- Telecommute\n</div><div>\nSo, if you are a Data Analyst with experience, please apply today!\n</div> - <p>Applicants must be authorized to work in the U.S.</p><br><br>\n <b>CyberCoders, Inc is proud to be an Equal Opportunity Employer</b>\n <br><br>\n All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n <br><br>\n <b>Your Right to Work</b> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}