{"job title": "Principal Scientist, Manufacturing, Technology, Fermentation", "company": "Endo Pharmaceuticals", "city state": "– Horsham, Pennsylvania", "rating": "3.2", "job description": "Description\n<br>\n <div>Job Summary -<em> a concise overview of the job</em></div> <div>The successful candidate will provide fermentation, technical, and statistical expertise in support of commercial manufacturing, process validation and process improvement, and analytical projects. Key areas of focus include execution of scale down models of the fermentation process for process improvement, process trouble-shooting and resolution of deviations, validation studies, qualification of raw materials, and development and optimization of production fermentation processes. This candidate will provide timely input and evaluation of changes and process outputs, as well as make recommendations for resolution of problems or areas for improvement. This role is responsible for the Continuous Process Verification process.\n<br><br>\n<em>All incumbents are responsible for following applicable Division &amp; Company policies and procedures.</em></div> <div>Scope of Authority <em>- span of control (work unit, site, department, division, etc.), monetary value of budget/spend authority ( capital, operating, etc.), P&amp;L responsibility, etc.</em></div> <div>Responsible for the Manufacturing Technology activities for the Horsham, PA site including expense and capital budget development, forecasting, and maintenance. Responsible for working cross-functionally with the Manufacturing, Validation, Quality Control, Quality Assurance, Materials Management, Manufacturing Technology, and R&amp;D teams.</div> <div>Key Accountabilities <em>- key outcomes/deliverables, the major responsibilities, and % of time</em></div> <div>Accountability\n<br><br>\nResponsibilities\n<br><br>\n% of Time</div> <div>Manufacturing and Analytical Technical Support\n<br><br>\n§ Design and execute experiments in support of the commercial manufacturing process including development, scale up, troubleshooting/deviations.\n<br><br>\n§ Support of protein purification/isolation and characterization work and perform analytical analysis (SGS-PAGE, RP-HPLC, etc.) in support of experiments.\n<br><br>\n§ Identify and support improvements to the commercial manufacturing process, focusing on increased product yield or quality improvements, increased efficiency or simplification of operations, risk mitigation, and/or reduced cycle time.\n<br><br>\n§ Collaborate with Manufacturing Technology, Manufacturing, and Quality Control, R&amp;D, Validation, and Quality Assurance on projects and initiatives.\n<br><br>\n§ Responsible for performing statistical analyses of production, experimental, analytical, and project-related data in support of specific process or analytical issues, projects and initiatives.\n<br><br>\n§ Responsible for managing the Continuous Process Verification program, including routine interim reporting to the CPV team and site management. Responsible for the monitoring and assessment of trends in performance data, including in-process and release data, and for identifying and recommending actions (or no actions) for responding to trends.\n<br><br>\n§ Responsible for supporting the Quality Control unit in laboratory investigations, test plans, out of specification results, and changes in test methods.\n<br><br>\n§ Maintain equipment and supplies as needed for experimentation and general laboratory upkeep.\n<br><br>\n§ Lead and participate in technical risk assessments as needed.\n<br><br>\n55%</div> <div>Documentation\n<br><br>\n§ Author annual Continuous Process Verification summary report.\n<br><br>\n§ Responsible for the Process Validation Master Plan, Process Validation Project Plans, and other associated process validation risk assessments, protocols, and summary reports.\n<br><br>\n§ Responsible for accurate and timely documentation of work in approved lab batch records and/or notebooks.\n<br><br>\n§ Author development or technical reports to document major experimental findings in support of projects, regulatory filings, and intellectual property.\n<br><br>\n§ Author, review, and approve protocols, reports, and SOPs associated with manufacturing process, analytical and Quality Control laboratory policies and procedures.\n<br><br>\n35%</div> <div>Training\n<br><br>\n· Remain current on training requirements as outlined in the training matrix and other company policies.\n<br><br>\n· Participate in cross-functional training as required for projects and initiatives.\n<br><br>\n· Assist in training new or existing Manufacturing Technology, Manufacturing, and Quality Control personnel, as needed/requested.\n<br><br>\n10%</div> <div>Total\n<br><br>\n100%</div> <div>Education &amp; Experience\n<br><br>\n<em>Minimal acceptable level of education, work experience and certifications required for the job</em></div> <div>§ Bachelor’s degree in Biological Sciences, Bioengineering, or related discipline with 10+ years’ experience working in fermentation process development and/or process validation laboratories OR\n<br><br>\n§ Master’s degree in the above disciplines with 6+ years’ relevant experience (preferred) OR\n<br><br>\n§ PhD in the above disciplines with 4+ years’ relevant experience (preferred).\n<br><br>\n§ Experience in a development, process validation, or manufacturing environment is preferred. Experience working with and supporting commercial and / or clinical manufacturing groups.\n<br><br>\n§ Experience with protein chemistry, characterization, and analytical methods, including SDS-PAGE, Western Blot, spectrophotometric assays, and RP-HPLC.\n<br><br>\n§ Demonstrated proficiency with interpretation of data, statistical analysis of data, and presenting data in a format that satisfies the objective of the team and drives decisions and/or supports projects.\n<br><br>\n§ Experience with experimental design, PAT and QbD principles.</div> <div>Knowledge\n<br><br>\n<em>Proficiency in a body of information required for the job</em>\n<br><br>\n<em>e.g. knowledge of FDA regulations, GMP/GLP/GCP, Lean Manufacturing, Six-Sigma, etc.</em></div> <div>§ Thorough background and knowledge in process development is required.\n<br><br>\n§ Strong knowledge of process technology, development, and validation practices for biopharmaceutical products.\n<br><br>\n§ Knowledge of cGMP and FDA and international regulations.\n<br><br>\n§ Knowledge of microbial fermentation processes for expression of proteins.\n<br><br>\n§ Knowledge of working with biosafety level-2 organisms and general safe laboratory practices for fermentation processes.\n<br><br>\n§ Strong knowledge of GMP/GLP/GCP and safe laboratory practices.</div> <div>Skills\n<br><br>\n&amp;\n<br><br>\nAbilities\n<br><br>\n<em>Often referred to as “competencies”, leadership attributes, skills, abilities or behaviors that may be enterprise, functional or job specific e.g. coaching, negotiation, calibration, technical writing etc.</em></div> <div>§ Proven ability to work well with others and establish strong working relationship with Manufacturing, Quality, Validation, and Facilities/Engineering.\n<br><br>\n§ Exhibits open and constructive communication style based on the need of the receiver and by using the appropriate communication method.\n<br><br>\n§ Exhibits high degree of accuracy and attention to detail.\n<br><br>\n§ Innovative and efficient when solving problems, while considering possible implications of the decisions made. Strong critical thinking skills.\n<br><br>\n§ Ability to manage complex technical activities in a dynamic, team based environment.\n<br><br>\n§ Demonstrated ability to work independently as well as within a collaborative multi-disciplinary project team environment.\n<br><br>\n§ Ability to effectively communicate and defend own work, orally and in writing.</div> <div>Physical Requirements\n<br><br>\n<em>Physical &amp; mental requirements e.g. lift 40 pounds, walk across plant/warehouse, business travel (% of time), driving as part of work responsibilities, etc.</em></div> <div>§ Standing for moderate periods of time.\n<br><br>\n§ Wearing lab coat, gloves, and other personal protective equipment required for working in the laboratory and cGMP cleanrooms.</div> <strong><em>Disclaimer:</em></strong><em> The above statements are intended to describe the general nature and level of work performed by employees assigned to this job. They are not intended to be an exhaustive list of all duties, responsibilities, and qualifications. Management reserves the right to ch</em>\n<br>"}