{"job title": "Analyst - Data Operations", "company": "Ford Motor Company", "city state": "– Dearborn, MI", "rating": "3.9", "job description": "**30935BR**<br> <br>**Job Title:**<br> <br><br> <br>Analyst - Data Operations<br> <br><br> <br>**Job Description &amp; Qualifications:**<br> <br><br> <br>**Job Description/Overview:**<br> <br><br> <br>At Ford Motor Company, we are dedicated to designing, manufacturing and selling high quality vehicles that meet the diverse needs of our customers. We believe our employees and the different perspectives that they bring to the business are the driving force behind our success. Come discover a company that is focused on the quality of our vehicles, the environment, the community and the world in which we live. The Data Ops Analyst role resides within the Ford GDIA organization which was formed to support Ford?s Blueprint for Mobility strategy and the OneFord Plan for profitable growth. In this role, you will support the data requirements of the Data Scientists who are using analytics to achieve business outcomes including insights to accelerate our Connected Customer and Connected Vehicle initiatives.<br> <br><br> <br>**Responsibilities:**<br> <br><br> <br>Responsible for providing the data support for enterprise data integration tasks, including ingestion, standardization, enrichment, mastering and assembly of data products for downstream applications.<br> <br><br> <br>In addition, you will:<br> <br><br> <br>+ Drive the Data Strategy and align it with continuously changing business landscape<br> <br>+ Work on all the data types across the enterprise including Customer, Dealer, Vehicle, Manufacturing, etc.<br> <br>+ Continuously increase Data Coverage by working closely with the Data Scientists, understanding and evaluating their data requirements and delivering the data they need<br> <br>+ Support the data requirements of the different functional teams like MS&amp;S, PD, Quality, etc. and all the regional KPI / Metrics initiatives<br> <br>+ Evaluate, explore and select the right data platform technologies including Big Data, RDBMS &amp; NoSQL to meet the analytics requirements<br> <br>+ Provide visibility to Data Quality issues and work with the business owners to fix the issues<br> <br>+ Implement an Enterprise Data Governance model and actively promote the concept of data sharing, data reuse, data quality and data standards<br> <br>+ Perform any necessary data mapping, data lineage activities and document information flows<br> <br>+ Build the Metadata model &amp; Business Glossary by gathering information from multiple sources: business users, existing data sources, databases and other relevant documents and systems<br> <br>+ Serve as data subject matter expert and demonstrate an understanding of key data management principles and data use<br> <br>+ Drive Master Data Management(MDM) strategy including implementing the governance model for Master Data<br> <br>+ Drive Data profiling and data exploration for basic understanding and profiling of the data<br> <br><br> <br>**Job Requirements:**<br> <br>**Basic Qualifications**<br> <br><br> <br>+ Bachelor?s Degree in Computer Science or engineering<br> <br>+ 2+ years? of experience in Big Data / NoSQL technologies<br> <br><br> <br>**Preferred Qualifications**<br> <br><br> <br>+ 5+ years? of experience in a Data Management role including running queries and compiling data for analytics<br> <br>+ 3+ years? of experience in data design, data architecture and data modeling (both transactional and analytic)<br> <br>+ Experience with Hadoop (HDFS, MapReduce, Hive, Scala, Spark, Informatica etc.), especially command line experience with loading and manipulating files within HDFS<br> <br><br> <br>The distance between imagination and ? creation. It can be measured in years of innovation, or in moments of brilliance. When you join the Ford team discover all the benefits, rewards and development opportunities you?d expect from a diverse global leader. You?ll become part of a team that is already leading the way, with ingenious solutions and attainable products ? and it is always ready to go further.<br> <br><br> <br>Visa sponsorship may be available for this position.<br> <br><br> <br>Ford Motor Company is an equal opportunity employer committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, disability status or protected veteran status.<br> <br><br> <br>**Auto req ID:**<br> <br><br> <br>30935BR<br> <br><br> <br>**Company:**<br> <br><br> <br>Ford Motor Company<br> <br><br> <br>**Function:**<br> <br><br> <br>GDIA<br> <br><br> <br>**Skill Team:**<br> <br><br> <br>GDI&amp;A<br> <br><br> <br>**Sub-Component:**<br> <br><br> <br>Data Operations<br> <br><br> <br>**State:**<br> <br><br> <br>Michigan<br> <br><br> <br>**Location:**<br> <br><br> <br>Dearborn"}