{"job title": "Geologist or Environmental Scientist", "company": "Golder Associates", "city state": "– Greensboro, NC", "rating": "3.1", "job description": "<ul>\n<li>*At Golder, we thrive on challenges.**</li>\n</ul>\n\nGolder is not just a place to work, it is a promise of a living, dynamic environment where people collaborate, innovate, build enduring relationships, excel, and grow professionally in a strong culture of ownership.\n<br><br>\nDo you have the desire to learn? The drive to excel and thrive in an engaged, collaborative environment?\n<br><br>\nGolder is currently seeking a **Geologist or Environmental Scientist** for a **full-time** opportunity open at our **Greensboro office** . This individual will manage environmental projects that involve field studies, report preparation, budget management, and interaction with coworkers, clients, subcontractors, and regulators. Projects will include groundwater, surface water, soil, and air sampling; environmental site assessments; regulatory permitting; subsurface site characterizations involving drilling, soil classification, aquifer testing, and bedrock mapping; remediation; and treatment system operation, maintenance, and monitoring.\n\n\n<ul>\n<li>*Responsibilities include:**</li>\n</ul>\n\n+ The successful candidate should enjoy identifying new business opportunities and building successful client relationships.\n<br><br>\n+ Understand various regulatory environments and associated technical requirements;\n<br><br>\n+ Prepare proposals (scope, schedule, and budget);\n<br><br>\n+ Evaluate analytical data and identify, develop, and manage the remedial solutions for our clients;\n<br><br>\n+ Oversee drillers and other on-site contractors;\n<br><br>\n+ Prepare boring and well construction logs;\n<br><br>\n+ Prepare state and federal level reports and other deliverables\n<br><br>\n+ Interact with environmental agencies and clients;\n<br><br>\n+ Simultaneously manage multiple projects through all phases of development;\n<br><br>\n+ Supervise, coordinate, and review/evaluate activities carried out by junior engineers and scientists;\n<br><br>\n+ Ability to thrive in a fast-paced working environment;\n<br><br>\n+ Assist with junior staff mentoring; and\n<br><br>\n+ Build and maintain long-term relationships with key clients by providing technical expertise, attending client meetings, participating in industry events, and responding to requests for proposals.\n\n\n<ul>\n<li>*Requirements:**</li>\n</ul>\n\n+ Position requires traveland fieldwork.\n<br><br>\n+ Requires B.S. (minimum)in Geology, Environmental Science, or similar earth science,\n<br><br>\n+ Minimum of 5 yearsof environmental project experience, including project management, proposalwriting, client contact, and regulatory interaction.\n\n\n<ul>\n<li>*Desirable Skills:**</li>\n</ul>\n\n+ Strong computer skillsincluding Word and Excel. Specialized computer skills including databaseapplications, groundwater and contaminant modeling software, GIS, gINT, andAutoCAD;\n<br><br>\n+ Strong and effectiveverbal and written communication skills;\n<br><br>\n+ North Carolina, SouthCarolina, and Georgia regulatory experience;\n<br><br>\n+ Environmental fieldmonitoring / sampling experience using various methods and equipment(groundwater, surface water, soil, air);\n<br><br>\n+ Drilling and wellinstallation experience using various drilling methods;\n<br><br>\n+ Treatment systemoperation, maintenance, and monitoring experience;\n<br><br>\n+ Leadership ability witha positive attitude;\n<br><br>\n+ Ability to workindependently and within groups;\n<br><br>\n+ 40-hour OSHA HAZWOPERhealth and safety training\n\n\n<ul>\n<li>*Preferred:**</li>\n</ul>\n\n+ North Carolina PG orequivalent license preferred.\n\n\n<ul>\n<li>*Your benefits at Golder will include:**</li>\n</ul>\n\n+ Competitivebenefits and remuneration packages\n<br><br>\n+ Optionto purchase shares in Golder\n<br><br>\n+ Employeeowned structure - own the business, own the result\n<br><br>\n+ Deepenyour expertise in a dynamic work environment\n<br><br>\n+ Innovativeand collaborative multidisciplinary projects\n<br><br>\n+ Onthe job training, mentoring and coaching\n<br><br>\nRenowned\n<br>\nfor technical excellence, Golder is a leading, global employee-owned\n<br>\nengineering and consulting firm with over a half century of successful service\n<br>\nto its clients. With over 165 offices in over 40 countries, Golder?s 6,500\n<br>\nprofessionals are driven by a passion to deliver results, offering unique\n<br>\nspecialized skills to address the ever-evolving challenges that earth,\n<br>\nenvironment and energy present to clients across the infrastructure, mining,\n<br>\noil and gas, manufacturing and power sectors.\n\n\n<ul>\n<li>*Equal Opportunity Employment Statement**</li>\n</ul>\n\nGolder is an\n<br>\nEqual Opportunity/Affirmative Action employer. All qualified applicants will\n<br>\nreceive consideration for employment without regard to race, color, religion,\n<br>\nsex, sexual orientation, gender identity, national origin, disability, veteran\n<br>\nstatus or other characteristics protected by law. Golder is a background\n<br>\nscreening, drug-free workplace.\n<br><br>\nTo learn more about our\n<br>\ncompany and culture click here to view The Promise of\n<br>\nGolder at https://vimeo.com/252065645 video.\n\n\n<ul>\n<li>*Title:** *Geologist or Environmental Scientist*</li>\n<li>*Location:** *NC-GREENSBORO*</li>\n<li>*Requisition ID:** *18001767*</li>\n</ul>"}