{"job title": "Senior Data Engineer", "company": "Gradient.io", "city state": "– Seattle, WA", "rating": "NA", "job description": "At Gradient, we are building sophisticated technology to transform how brands grow on ecommerce channels. We use data and machine learning to ensure our customers’ brands are well-represented, discovered, and purchased. In turn, we drive material sales and profitability for brands that they cannot achieve elsewhere.\n<br><br>\nWe are obsessed with our customers and with building a company, product, and culture that serves our customers and team well.\n<br><br>\nGradient is seeking a talented &amp; intellectually curious Senior Backend Engineer to build data pipelines, backend systems, and APIs that turn large quantities of data into valuable products. In this role, you will get to collaborate with amazing colleagues to solve challenging problems, have a material impact on Gradient’s success, and grow with our company.\n<br><br>\n<strong>What you will do</strong>\n<ul>\n <li>Architect and build data pipelines that ingest and process large quantities of structured and unstructured data from varied sources</li> <li>Scale our ability to use the data we collect to build production applications and machine learning models</li> <li>Collaborate with engineers, data scientists, and product managers to design and build APIs and systems for our products</li> <li>Ensure our systems are secure and easy to build, test, and deploy</li> <li>Define and inform our product and technical roadmaps and review code</li> <li>Constantly seek and deliver feedback so that we make good decisions for our customers and company</li>\n</ul>\n<strong>Requirements</strong>\n<br><br>\n<strong>What we’re looking for</strong>\n<ul>\n <li>At least a bachelor’s degree in computer science or a related technical discipline, but if you do not then you have sufficient &amp; relevant industry experience</li> <li>6+ years experience building/operating backends for products</li> <li>A solid systems background, experience designing and building distributed systems, and experience building web APIs</li> <li>Experienced Python programmer with hands-on, in-depth knowledge of relevant tools &amp; frameworks in Python’s ecosystem</li> <li>Experience with deployment software to cloud environments</li> <li>GCP experience is a plus, as is experience with DevOps tooling for provisioning, configuration, and deployment</li> <li>Sharp analytical abilities, proven software design skills, and a track record of delivering quality products</li> <li>Ability to take high-level product and technical direction to drive priorities and manage work</li> <li>Excellent writing &amp; communication skills.</li>\n</ul>\n<strong>Qualifications we prefer, but are not required</strong>\n<ul>\n <li>‍Experience leading a team to build a complex software system that has been successfully delivered to customers</li> <li>Experience influencing best practices for software engineer teams</li> <li>Experience communicating with users, technical teams, and senior management to collect requirements, describe software product features, technical designs, and product strategy</li> <li>Experience building software in the startup world or as a consultant</li>\n</ul>\n<strong>Benefits</strong>\n<ul>\n <li>Competitive Base Salary</li> <li>Equity Stake</li> <li>100% covered benefits</li>\n</ul>"}