{"job title": "Senior Product Manager, Partner Data Products", "company": "JW Player", "city state": "– New York, NY", "rating": "3.9", "job description": "<strong>The Senior Product Manager, Partner Data Products will drive the development of a new suite of partner products leveraging JW Player's Video data. This is a critical initiative to build a new revenue stream and will provide a unique opportunity to build products from the ground up.</strong>\n<br><br>\n<strong>The Senior Product Manager will guide the development of new products, perform market scoping, speak with prospects, execute a go-to-market strategy and drive revenue with product launches. This role works shoulder to shoulder with senior executives to build a new business leveraging our video intelligence capabilities.</strong>\n<br><br>\n<strong>In this role, you will:</strong>\n\n<ul>\n<li>Review market opportunities and make recommendations on prioritizing which market to pursue</li>\n<li>Speak with potential customers to understand their needs and requirements for a viable product</li>\n<li>Define and execute the product roadmap to build new products to bring in new business</li>\n<li>Understand the data available and make necessary enhancements to deliver the right products to customers</li>\n<li>Set and manage KPIs for product growth to help attain company goals</li>\n<li>Provide sales, support, and documentation for internal and external consumers</li>\n<li>Work with multiple stakeholders, both internal and external, to gather and prioritize product/feature requirements and deliver product functionality</li>\n<li>Act as product owner in an Agile development process</li>\n<li>Collaborate with other product managers, data scientists, product marketing, designers, and engineering teams to deliver products</li>\n<li>Continuously identify new opportunity areas to build partner-facing products</li>\n<li>Review and write functional specifications to communicate and guide product development</li>\n<li>Integrate and analyze product usage to continually optimize performance and user experience</li>\n</ul>\n<strong>We're excited about candidates who have:</strong>\n\n<ul>\n<li>5+ years product management or related work experience in data-driven companies in an agile environment</li>\n<li>A record of taking products to market from idea conception to launch in a fast-paced environment</li>\n<li>Delivered products at scale by working with customers to solve their unique needs</li>\n<li>Experience building products utilizing data for advertising and/or reporting</li>\n<li>Excellent written and verbal communication skills with both internal and external stakeholders</li>\n<li>Experience with big data, data analysis, data visualization, API's and real time services</li>\n<li>Strong knowledge of SQL and a penchant for making data-driven decisions</li>\n<li>Technical background with a B.S or higher in Computer Science, Information Systems, Engineering or a related field or equivalent experience</li>\n</ul>\n<strong>About JW Player</strong>\n<br><br>\nJW Player pioneered video on the web over a decade ago and continues to innovate as the world's largest network-independent platform for video delivery and intelligence. Media companies including Fox, VICE, Business Insider, and Univision, in addition to hundreds of thousands of creators of all types and sizes, rely on JW Player to deliver and monetize their content across all devices. JW Player's massive global footprint of over 2 billion unique devices creates a powerful data graph of unique consumer insights and generates billions of incremental video views. The company is headquartered in New York, with offices in London and Eindhoven, and was named to Deloitte's Technology Fast 500 in 2017. For more information, visit http://www.jwplayer.com.\n<br><br>\n<strong><em>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</em></strong>"}