{"job title": "Associate Scientist II", "company": "Kemin Industries", "city state": "– US-IA-Des Moines", "rating": "3.5", "job description": "<div><div>\n<div><strong>Position Overview</strong>\n<br><br>\nThe Associate Scientist II is responsible for leading multiple R&amp;D projects, performing literature reviews, participate in the evaluation of intellectual property, and participate in external research collaborations. The candidate will have a strong background in chemistry and synthesis, but research conducted in this position will be variable and not focused on synthesis. The candidate will be responsible for research and development at the chemistry-plant biology interface and for innovation of new concepts, including all experimental design, feasibility determination, execution, and analysis.\n<br><br>\n<strong>We Are Kemin</strong>\n<br><br>\nWe are visionaries who see things differently and are inspired by the world around us. We have been dedicated to using applied science to improve the quality of life for over half a century. Committed to feed and food safety, Kemin maintains top-of-the-line manufacturing facilities where over 500 specialty ingredients are made for humans and animals in the global feed and food industries, as well as the health, nutrition, beauty and textile markets. We provide product solutions and options to customers in more than 120 countries.\n<br><br>\nA privately held, family-owned and operated company, Kemin has more than 2,300 global employees and operates in 90 countries including manufacturing facilities in Belgium, Brazil, China, India, Italy, Russia, Singapore, South Africa and the United States.\n<br><br>\n<strong>What you’ll be doing:</strong>\n<ul>\n<li>Plan and execute 3-5 R&amp;D projects, with guidance.</li> <li>Focus, prioritize projects and assume responsibility for their success.</li><li>Perform literature reviews and incorporate collected information into research strategies.</li><li>Independently investigate, create and develop research protocols and communicate research plans.</li> <li>Independently develop SOPs and research methods.</li> <li>Independently conduct research experimental in the field of extraction of targeted actives or process optimization.</li><li>Independently perform advanced data analysis on own projects and review other’s data.</li><li>Maintain accurate, organized and detailed electronic laboratory notebooks and research files.</li><li>Prepare and present research reports in multiple formats for both internal and external audiences.</li> <li>Generate scientific publications used for internal or external purposes.</li><li>Actively identify and lead research areas that could lead to new product development or process improvement, with guidance.</li> <li>Review internal publications.</li> <li>Must adhere to laboratory standard operating procedures, documentation and guidelines.</li> <li>Troubleshoot issues with laboratory equipment and instrumentation.</li> <li>Manage and mentor direct reports to reach goals.</li> <li>Participate in the strategic planning process and customer meetings.</li><li>Identify external partners for research collaborations.</li> <li>Participate in the evaluation of intellectual property.</li><li>Participate in external research collaborations, representing Kemin.</li>\n</ul>\n<strong>What we require of you:</strong>\n<ul>\n<li>PhD with 1-5 years of relevant experience at the chemistry-plant biology interface.</li><li>Master’s Degree with 7+ years of relevant experience at the chemistry-plant biology interface.</li><li>Background and expertise in chemistry, biochemistry and extraction is highly desirable.</li><li>Experience as an effective project team player, leader and motivator desired.</li><li>Proven track record of accomplishments.</li><li>Must have a solid understanding and adherence to the Servant Leadership philosophy.</li><li>Strong scientific curiosity and innovation.</li><li>Strong written and oral communication skills, suitable for external presentations.</li><li>Strong leadership abilities and project management skills.</li><li>Excellent scientific skills in experiment design, data collection and problem solving.</li><li>Strong analytical lab skills with ability to maintain instruments.</li><li>Must be detail oriented, organized, and motivated by accomplishment.</li><li>Must be able to work independently and have the ability to work in a fast-paced multidisciplinary environment.</li><li>Ability to handle multiple projects efficiently and work in a continually changing environment.</li><li>Ability to apply knowledge quickly to projects.</li><li>Ability to interact well with others in a team environment.</li><li>Advanced computer knowledge (Word, Excel, PowerPoint, etc.).</li><li>Ability to understand and perform basic statistical analysis.</li><li>Reliable and self-motivated.</li><li>Fluent in English</li> \n</ul>\n<strong>Your work week:</strong> This position is located at the Kemin headquarters in Des Moines, Iowa and is considered exempt. Up to 10% travel may be required.\n<br><br>\n<strong>What’s in it for you:</strong>\n<ul>\n<li><strong>A competitive financial package</strong>- in addition to your salary, we offer an uncapped bonus opportunity, 401k match program, and paid vacation and holidays.</li><li><strong>Robust health and wellness support</strong>- we are proud to offer a fitness reimbursement (for your whole family!), an on-site fitness center, restaurant with seasonal fresh food</li></ul></div></div></div>"}