{"job title": "Institute Research Scientist - Medicinal Chemistry", "company": "MD Anderson Cancer Center", "city state": "– United States, Texas, Houston, Houston", "rating": "4.1", "job description": "<div><div><div><div><div><div>MD Anderson is known for providing cancer patients with exceptional care, which includes early access to innovative new treatments through clinical trials. The Institute for Applied Cancer Science (IACS) is a new hybrid model that uniquely combines the drug discovery capabilities of the biopharmaceutical industry and the extensive knowledge of biology found in academia with the expertise of MD Anderson's top clinicians. IACS has the singular goal of rapidly developing novel, effective and safe therapeutics that improve patient health. IACS executes programs with the highest probability of clinical success in a rigorous, goal-oriented, data-driven manner.</div><div><br></div><div>We are seeking a highly motivated PhD scientist to join our team of medicinal chemists at the Institute for Applied Cancer Science. The Institute Research Scientist, Medicinal Chemistry, will be a key contributor to the advancement of our oncology drug pipeline. The candidate will be a highly creative synthetic chemist with a strong desire to succeed at the highest level. He/She will be responsible for the design, optimization and synthetic execution of small molecules targets to advance IACS oncology drug discovery projects, and will participate in cross-functional research working closely with members of the computational chemistry, structural biology, in vitro pharmacology and biology</div><div>teams.</div><div><br></div><div>The ideal candidate will have a PhD in organic chemistry, a post-doc in organic synthesis and research experience in the field of medicinal chemistry and drug discovery acquired within the pharmaceutical or biotech industry or equivalent. Strong knowledge of contemporary synthetic organic chemistry, with a demonstrated track record of creative independent problem solving. Expert knowledge in the latest synthetic methods.</div><div><br></div><div><div>KEY FUNCTIONS </div><div><br></div><div>1. Apply and develop cutting edge synthetic and medicinal chemistry methodologies for the design and synthesis of new chemical entities to enable advancement of Institute's drug discovery projects through leadership and experimental activities.</div><div><br></div><div>2. Analyze data generated on lead compounds by other groups including ADME/PK, in vitro and in vivo pharmacology and program biology teams, and leverage results for the design of future compounds with superior overall profiles.</div><div><br></div><div>3. Actively contribute to the hypothesis generation, design and synthesis of new target molecules with improved overall profile to overcome issues facing lead compounds on projects.</div><div><br></div><div>4. Work closely with medicinal chemists, computational chemists and other project team members towards the design and optimization of compounds with improved potency, selectivity, and functional activity on their protein target, together with improved ADME properties.</div><div><br></div><div>5. Leverage latest synthetic approaches, parallel MedChem and purification techniques to prepare complex drug candidates. Trouble shoot synthetic issues with his / her synthetic targets, as well as those of other project team members.</div><div>6. Contribute to patent filing in order secure the intellectual property rights for novel small molecules.</div><div><br></div><div>7. Ability to work in a dynamic team environment with other project contributors. Adapt to new technologies and find solutions to related program studies.</div><div>8. Employ safe lab practices.</div><div><br></div><div>9. Maintain research records and laboratory notes.</div></div><div><br></div><div><br></div>\n \n \n\n \n \n \n \n \n <div>\n Education<div>Required: Bachelor's degree in Biology, Biochemistry, molecular biology, cell biology, enzymology, pharmacology, chemistry or related field. </div><div><br></div><div>Preferred: PhD in synthetic organic chemistry or medicinal chemistry.</div><div><br></div><div>Experience</div><div>Required: Ten years of relevant research laboratory experience. With Master's degree, eight years of required experience and with PhD, two years of required experience. </div><div><br></div><div><div>Preferred: Relevant industrial experience within the pharmaceutical or biotech industry or equivalent, or post-doc in organic synthesis.</div><div>\t</div><div>The ideal candidate will have a PhD in organic chemistry, a post-doc in organic synthesis and research experience in the field of medicinal chemistry and drug discovery acquired within the pharmaceutical or biotech industry or equivalent. Strong knowledge of contemporary synthetic organic chemistry, with a demonstrated track record of creative independent problem solving. Expert knowledge in the latest synthetic methods. Skilled experimentalist with demonstrated ability to conduct challenging multi-step organic chemistry synthesis and overcome synthetic hurdles, trained in various purification and analytical techniques. Strong publication record in peer reviewed journals. Interest in automated and computational chemistry. Experience in mentoring chemists. Excellent communication, writing, and organizational skills are a must. The ideal candidate will have experience in medicinal chemistry and drug discovery process, familiarity with relevant biological disciplines and ability to integrate knowledge of these areas into the design of new bioactive compounds.</div></div><div><br></div><div><br></div><div><br></div><div>It is the policy of The University of Texas MD Anderson Cancer Center to provide equal employment opportunity without regard to race, color, religion, age, national origin, sex, gender, sexual orientation, gender identity/expression, disability, protected veteran status, genetic information, or any other basis protected by institutional policy or by federal, state or local laws unless such distinction is required by law. http://www.mdanderson.org/about-us/legal-and-policy/legal-statements/eeo-affirmative-action.html</div>\n </div>\n \n \n\n \n <div>\n \n </div>\n \n\n \n </div>\n </div>\n </div>\n\n \n </div>\n\t</div>"}