{"job title": "Data Analyst", "company": "Progressive Insurance", "city state": "– United States-Ohio-Mayfield Heights", "rating": "3.7", "job description": "<p><strong>Data Analyst</strong><br><br>This exciting analyst opportunity is part of the Claims Control Field Staffing and Efficiency team. </p>\n<div> </div>\n<div>As a data analyst you will work on analyses and staff models that touch all Claims process areas (e.g. property, injury, etc.). You will collect, analyze and digitize work effort data to develop and validate standard times for claims-handling processes. Responsibilities will include data cleaning, data mining, supporting work measurement studies, collaborating with multiple business areas, completing ad hoc requests as needed and maintain some ongoing reporting. Analysis and reporting is discussed with varying levels of leadership within the Claims Organization to help understand and drive operational efficiency. </div>\n<div> </div>\n<div>Nature of this job requires more travel (travel to various claims handling offices) than typical analyst jobs; 3-5 times a year. </div>\n<p><br><strong>Must have qualifications</strong><br>* Bachelor's degree in a related field of study (Finance, Mathematics, Accounting, Economics, Statistics or Actuarial Sciences) and two years of property casualty insurance experience or analytical work experience in a professional setting<br>* Instead of a degree, five years of property casualty insurance experience with related analytical experience (such as analytical work in a professional setting)<br><br><strong>What we also look for</strong><br>* Knowledge of Big Data concepts, practices and terminology<br>* Intermediate MS Office skills including intermediate skills in Excel including the ability to create, manipulate and formulate spreadsheets, including v-look-up, pivot tables, charts and graphing <br>* Proven aptitude for learning and using data analysis reporting tools <br>* Basic to intermediate SAS and SQL programming skills including the ability to create basic programs<br>* Ability to prepare reports and conduct presentations <br>* Ability to work with and maintain confidential information <br>* Ability to work in a team-oriented environment, adapt to new situations and learn quickly<br><br><strong>Our company</strong><br>As one of the largest insurance companies in the nation, Progressive's data analysts and scientists have access to the most telematics data recorded. With freedom and encouragement to implement your own ideas, you'll be solving big data problems that impact billions of dollars of business. You'll also benefit from:<br>* Annual gainshare bonus of up to 24% of your salary; Progressive rewards each of us with an annual bonus based on company performance<br>* 401k which includes dollar-for-dollar company match of up to 6%<br>* Dedication to work/life balance which includes flexible work arrangements and tools to support your lifestyle<br>* Dynamic company culture that encourages engagement, supports Employee Resource Groups, values diversity and embraces a relaxed atmosphere<br>* Onsite gym and wellness programs with discounts &amp; rewards<br>* Healthcare onsite and standard benefits (medical, dental, vision)<br><br>Equal Opportunity Employer</p>"}