{"job title": "Senior Scientist - Bioanalytical", "company": "Teva Pharmaceuticals", "city state": "– West Chester, PA", "rating": "3.1", "job description": "Senior Scientist - Bioanalytical<br> <br><br> <br>**Date:** Aug 28, 2018<br> <br><br> <br>**Location:** West Chester, Pennsylvania, US, 19380<br> <br><br> <br>**Company:** Teva Pharmaceutical Industries Ltd.<br> <br><br> <br>**Company Info** <br> <br><br> <br>Teva is a global pharmaceutical leader and the world?s largest generic medicines producer, committed to improving health and increasing access to quality health solutions worldwide.<br>Our employees are at the core of our success, with colleagues in over 80 countries delivering the world?s largest medicine cabinet to 200 million people every day.<br>We offer a uniquely diverse portfolio of products and solutions for patients and we?ve built a promising pipeline centered around our core therapeutic areas.<br>We are continually developing patient-centric solutions and significantly growing both our generic and specialty medicines business through investment in research and development, marketing, business development and innovation.<br>This is how we improve health and enable people to live better, healthier lives. Join us on our journey of growth!<br> <br><br> <br>**Job Description** <br> <br><br> <br>We are seeking a highly talented, motivated Bioanalytical Senior Scientist - Large Molecule within Biomarker Team in our West Chester, PA location. We are looking for an experienced Scientist with a strong background in large molecule method development, validation and implementation. This role is critical in the drug development from early to late stages, including regulatory submission.<br> <br><br> <br>**Responsibilities include but are not limited to:**<br> <br><br> <br>+ Provide technical expertise for evaluation and selection of methodology approach/format for biomarker analysis,<br> <br>+ Contribute to the in-house method development, validation, troubleshooting,<br> <br>+ Oversee sample testing, conduct data analysis and present data internally,<br> <br>+ Ensure compliance and data integrity throughout the studies,<br> <br>+ Evaluate, select CROs for study not supported in-house, oversee the work performed at the CROs,<br> <br>+ Author, review validation plans, validation reports and bioanalytical reports,<br> <br>+ Provide logistic support in collaboration with sample management group and CROs for clinical study (examples but not limited to sample collection/processing procedure, shipping instructions, sample reconciliation, etc?),<br> <br>+ May lead a team of Scientists and Research Associates,<br> <br>+ Participate in new instrument/platform evaluation.<br> <br><br> <br><br> <br><br> <br>**Qualifications** <br> <br><br> <br>_In order to be considered for this role you must possess the following:_<br> <br><br> <br>+ MS degree in Biochemistry, Cell Biology, Pharmacology or related field with a minimum of 10 years of relevant experience or Ph.D. with a minimum of 5 years of pharmaceutical, biotechnology or CRO bioanalytical experience.<br> <br>+ Extensive knowledge and hands-on in ligand binding assay method development and its application to biomarker analysis as evidenced by laboratory skills and/or a good publication record is required.<br> <br>+ Familiarity with automation system, Watson LIMS system, and new ligand binding assay platforms is a plus.<br> <br>+ Experience in clinical drug development is beneficial.<br> <br>+ Strong managerial skills, ability to work collaboratively, ability to manage multiple projects<br> <br>+ Good oral and written communication skills.<br> <br><br> <br><br> <br><br> <br>**Function** <br> <br><br> <br>Research &amp; Development<br> <br><br> <br><br> <br><br> <br>**Sub Function** <br> <br><br> <br>Drug Analysis and Formulation<br> <br><br> <br><br> <br><br> <br>**Reports To** <br> <br><br> <br>In process of validation<br> <br><br> <br>**Teva?s Equal Employment Opportunity Commitment** <br> <br><br> <br>Teva Pharmaceuticals is committed to equal opportunity in employment. It is Teva's global policy that equal employment opportunity be provided without regard to age, race, creed, color, religion, sex, disability, pregnancy, medical condition, sexual orientation, gender identity or expression, ancestry, national or ethnic origin or any other legally recognized status entitled to protection under applicable laws.<br> <br><br> <br>**Nearest Major Market:** Philadelphia"}