{"job title": "Environmental Scientist - Riley County", "company": "The Kansas Department of Administration", "city state": "– Riley", "rating": "4.1", "job description": "postings<br>\n\n<div>\n<div> Job Title: Environmental Scientist - Riley County \n<br>\n (to\n<br>\n directly link to this job posting, copy\n<br>\n this link)</div>\n<br>\n <div> County Riley</div> <div> Req. No: 190438</div> <div> Agency: Kansas Dept of Agriculture</div> <div> Posting Type: External</div> \n<br>\n<div><strong>Applications accepted through:</strong></div><div> <div>\nJob Description:<br><br><strong>This position will remain posted until filled.</strong>\n<br><br>\n<strong>Job Summary:</strong>\n<ul>\n <li>Assists applicants in preparing new applications to appropriate water for beneficial use and change applications, ensuring the documents are accurate and complete. Examines and reviews existing file information relevant to this process. Communicates with the applicant providing relevant information specific to his/her application processing based on the Kansas Water Appropriation Act.</li> <li>Conducts initial review of Applications for Permit to Appropriate Water for Beneficial Use (K.A.R. 5-3-1), Applications for Approval to Change the Place of Use, the Point of Diversion, or the Use Made of Water under an existing Water Right (K.A.R. 5-5-1) for completeness for processing, and Temporary Permits (K.S.A. 82a-727). Works with applicants regarding incomplete applications noting additional information required for processing. Uses scientific, geologic, and hydrologic knowledge and expertise to evaluate assigned projects and bring them to final action. Frequently communicates directly with applicants and consultants at all stages of application processing. Upon completion of the total evaluation process, writes a concise, scientific summary and makes recommendations in the public’s interest to approve or deny a pending application for final action by superiors.</li>  <li>Examines, reviews and processes applications for Term Permits to use water. Term permit applications may encompass unique projects and special conditions. Completes the required documents and submits with a written report for final decision.</li>\n</ul>\n<strong>Salary:</strong> $48,485 - $50,909/Year\n<br><br>\n<strong>Qualifications:</strong>\n<ul>\n <li>Four years of experience in an environmental field and/or program. Education may be substituted for experience as determined relevant by the agency. Courses in hydrology and geology are strongly preferred.</li> <li>Valid driver’s license</li> <li>Kansas Professional Geologist license is preferred.</li> <li>Must be able to travel in-state with some overnight stays required.</li>\n</ul>\n<strong>The application process has 3 STEPS.</strong>\n<br><br>\n<strong>STEP 1:</strong> Register by completing the online Personal Data Form. (Skip this step if you already have an Applicant ID number.)\n<br><br>\n<strong>STEP 2:</strong> Complete the State of Kansas Application Form and submit to the Kansas Department of Agriculture. If you prefer to mail your application, please send to: Kansas Department of Agriculture, Human Resources, Attention: Kelsey Senn 1320 Research Park Dr. Manhattan, KS 66502.\n<br><br>\n<strong>STEP 3:</strong> Email these additional required documents to Kelsey Senn at HRServices@KDA.KS.GOV. Include the job requisition number and your last name in the subject line.\n<ul>\n <li>Letter of Interest</li> <li>Resume</li> <li>Kansas Tax Clearance Certificate</li>\n</ul>\n<strong>KANSAS TAX CLEARANCE CERTIFICATE REQUIRED:</strong> Each applicant applying for a State of Kansas job vacancy must obtain a valid Kansas Certificate of Tax Clearance by accessing the Kansas Department of Revenue's website at http://www.ksrevenue.org/taxclearance.html A Tax Clearance is a comprehensive tax account review to determine and ensure that an individual's account is compliant with all primary Kansas Tax Laws. A Tax Clearance expires every 90 days. <strong><u>All applicants, including current state employees, are responsible for submitting a valid certificate with all other application materials to the hiring agency.</u></strong> This is in accordance with Executive Order 2004-03. If you need assistance with the tax clearance, please contact 785-296-3199.\n<br><br>\n<strong>Recruiter Contact:</strong>\n<br><br>\n<strong>Name:</strong> Kelsey Senn\n<br>\n<strong>Phone:</strong> (785) 564-6712\n<br>\n<strong>Email:</strong> Kelsey.Senn@ks.gov\n<br><br>\n<strong>Fax:</strong> (785) 564-6777\n<br><br>\n<strong>How You Will Be Evaluated:</strong>\n<br><br>\nYour application will be considered incomplete and you may be found ineligible if you fail to submit all required documentation. Your application will be reviewed to ensure you meet the qualifications of the position. Next, your application will be evaluated based on selection criteria and competencies for the position.\n<br><br>\n<strong>What to Expect Next:</strong>\n<br><br>\nAfter your application is evaluated, you may be referred to the hiring manager for further consideration and possible interview. You will be notified of the outcome after the selection process is complete. Individuals with disabilities are encouraged to contact the agency recruiter if reasonable accommodations are needed for any part of the application or hiring process.\n<br><br>\n<strong>The Kansas Department of Agriculture is an Equal Opportunity Employer</strong><br>\n<div>\nFind out more about us at our \n<br>\n website</div>\n</div>\n </div> <div> Class/Uncl: U \n<br>\n Full/Part Time: F \n<br>\n Grade 001 \n<br>\n Hiring Rate: $0.00\n<br>\n Pay Frequency: Hourly</div>\n </div>\n\n<br>"}