{"job title": "Junior Data Science", "company": "TransVoyant", "city state": "– Alexandria, VA", "rating": "3.0", "job description": "TransVoyant is seeking a <strong>Junior Data Scientist</strong> to work on live and predictive analytics research for our patented Continuous Decision Intelligence Platform. The ideal candidate will structure data for analytics needed to provide insights into our customer domainsranging from predicting customer demand to forecasting port disruptions to getting in front of activities in Supply Chain. This position will craft statistical models, mathematical formulas, principles to test hypotheses and visually summarize, interpret and report on TransVoyant CDI-driven intelligence.\n<br><br>\n<strong>RESPONSIBILITIES</strong>\n\n<ul>\n<li>Become an expert on TransVoyant CDI Platform solutions and how they solve pressing customer challenges within Supply Chain arenas</li>\n<li>Identify, retrieve, relate, exploit an apply mathematical models to multiple TransVoyant structured and unstructured data sets from thousands of various sources (ex. live aircraft, forecast weather)</li>\n<li>Apply formulas and create methods, models and algorithms to understand the meaning of streaming live data, translating it into insightful predictive output for customer applications and data products</li>\n<li>Educate internal staff (ex. development, sales, marketing) on how data science data analysis and resulting predictions can be productized for key industry verticals</li>\n<li>Assist with pre-sales and post-sales engagementsperforming hands-on customer work when required</li>\n<li>Represent TransVoyant and our solutions to customers and prospects at industry networking events and tradeshows</li>\n<li>Keep up to date on competitive solutions, products and services</li>\n<li>May need to travel up to 10% of time</li>\n</ul>\n<strong>DESIRED SKILLS &amp; EXPERIENCE</strong>\n\n<ul>\n<li>1+ years of cloud-based data analysis, manipulation and visualization experience</li>\n<li>Ability to explain mathematical formulas and statistical findings to non-technical users and decision makers</li>\n<li>Honed presentation and product demo skills</li>\n<li>Basic programming and scripting experience with Java, JavaScript, and JSON is not mandatory, but is considered a plus</li>\n<li>Understanding of Hadoop stack and data analytics tools to exploit massive sets of TransVoyant data (e.g. HDFS, Spark, R, etc.) is a plus</li>\n<li>Domain knowledge in enterprise demand, supply chain, and/or transportation management and visibility technologies is a plus</li>\n<li>Bachelors degree is required</li>\n</ul>\n<strong>ABOUT TRANSVOYANT</strong>\n<br><br>\nTransVoyant delivers our customers continuous insights to increase revenues, reduce costs and manage risks by combining the current and future behavior of their enterprises, their ecosystems and they dynamic world around them. We are innovative, creative, focused on customer success and love what we do. Team members enjoy highly competitive compensation, a fast-growing and flexible work environment, comprehensive benefits, 100% 401k matches, unlimited vacation days and professional development opportunities.\n<br><br>\nWe respect your personal information. Please review our Privacy Policy to find out more."}