{"job title": "RDSC Data Systems Developer", "company": "University of Rochester", "city state": "– Rochester, NY", "rating": "4.1", "job description": "Opening\n<br><br>\nFull Time 40 hours Grade 054 Institute for Data Science\n<br><br>\nSchedule\n<br><br>\n<strong>9AM-5PM</strong>\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>*General Purpose:**</li>\n</ul>\n\nThe University of Rochester's Goergen Institute of Data Sciences (GIDS) is seeking a Data Systems Developer for its new Rochester Data Science Consortium (RDSC).\n<br><br>\nAs an employee of GIDS/RDSC, the successful candidate will have responsibility for developing solutions for projects in the RDSC, which is focused on advancing regional economic development and supports a range of partnerships with industry in areas of data science research, training, technology development and access to research computing expertise and resources. The candidate will work with the GIDS/RDSC Research Scientists, staff and other university researchers in these domains to understand both current world-class competencies and planned future research thrusts.\n<br><br>\nAnalytics have shown the power to dramatically transform all aspects of our lives - Big Data is no longer an issue, rather it is how, when everything has become a data source, we best leverage and capture the meaning of this data. Our goal is to leverage the power of UR Data Sciences to transform regional businesses beyond their existing core offerings to forward-looking, high-value, transformative offerings that propel a redefinition of Rochester as a dynamic economic hub.\n\n\n<ul>\n<li>*Specific Responsibilities:**</li>\n<li>Collaborate with commercial clients and university researchers</li>\n<li>Develop workable proof-of-concept data analytic solutions on a variety of platforms including cloud computing, big data, web and mobile.</li>\n<li>Design and implement large scale data ingestion and integration. Recommend and implement performance improvements in an effort to solve complex project problems.</li>\n<li>Provide leadership in technical areas, acquiring expertise in relevant applications and technologies. Keeps abreast of trends as they relate to the computer field by self study, attending job related seminars, courses or conferences which enhance personal development and strengthen the user service orientation.</li>\n\n<strong><li>*Requirements**:</li>\n</strong></ul><strong>\n\n</strong>\n<br>\nMinimum of Bachelor's degree in relevant technical field (Data Science, Engineering, Computer Science, etc.) and 3-4 years of related experience; preferably with 1-2 years in a supervisory capacity; or and equivalent combination of education and experience. Proficient developer with knowledge and experience in several of the following (and willing to learn others as needed):\n\n\n<ul>\n<li>Linux, Python including machine learning modules, Relational database systems, Github, Azure, AWS</li>\n</ul>\n\nSpecialization areas in any of the following areas preferred:\n\n\n<ul>\n<li>Geo-spatial systems, Video/Image Processing, Natural language processing, UX/lnterface design.</li>\n</ul>\n\nExcellent verbal and written communications skills with ability to interface with persons of varying technical backgrounds.\n\n\n<ul>\n<li>EOE Minorities/Females/Protected Veterans/Disabled*</li>\n<li>Job Title:* RDSC Data Systems Developer</li>\n<li>Location:* The College</li>\n<li>Job ID:* 208533</li>\n<li>Regular/Temporary:* Regular</li>\n<li>Full/Part Time:* Full-Time</li>\n</ul>"}