{"job title": "RESEARCH SCIENTIST 1", "company": "UW Medicine", "city state": "– Seattle, WA", "rating": "3.3", "job description": "<div> RESEARCH SCIENTIST 1</div> <div> \n<div> Req #: 159917</div> <div> Department: MICROBIOLOGY</div> <div> Job Location: South Lake Union</div> <div> Posting Date: 09/05/2018</div> <div> Closing Info: Open Until Filled</div> <div> Salary: Salary is commensurate with education and experience</div> <div> Shift: First Shift</div> <div> Notes:\n<br><br>\nAs a UW employee, you will enjoy generous benefits and work/life programs. For a complete description of our benefits for this position, please visit our website, click here.</div>\n</div>\n<br>\n <div>\nAs a UW employee, you have a unique opportunity to change lives on our campuses, in our state and around the world. UW employees offer their boundless energy, creative problem solving skills and dedication to build stronger minds and a healthier world.\n<br><br>\nUW faculty and staff also enjoy outstanding benefits, professional growth opportunities and unique resources in an environment noted for diversity, intellectual excitement, artistic pursuits and natural beauty. All of which has allowed the UW to be nationally recognized as a “Great College to Work For” for four consecutive years.\n<br><br>\nThe Department of Microbiology is one of the premier biological science departments in the country. The department has a national reputation for high quality teaching and an international reputation for excellence in research. Because of the revolution in biology that began in the 1970s, rapid advances in microbiology and the development of biotechnology have increased our understanding of all living systems. This has in large part been determined by studies of microorganisms. The research programs of the faculty in the Department of Microbiology at the University of Washington reflect exciting areas of modern microbiology. Our faculty span a broad range of interests including microbial ecology, physiology, virology, and microbial pathogenesis in both animal and plant systems. The members of our department are largely concerned with understanding the mechanisms by which organisms interact with one another and with their environment at the cellular and molecular levels. Because of the strong interdisciplinary nature of these interests, numerous collaborative efforts between our faculty and those in other science and medicine departments have developed.\n<br><br>\nThe Department of Microbiology currently has an outstanding opportunity for a <strong>RESEARCH SCIENTIST 1</strong>.\n<br><br>\nThis role is expected to perform meticulous investigative laboratory work in support of research into the pathogenesis of HIV-disease (AIDS), specifically relating to the understanding of HIV latency and vaccine development.\n<br><br>\nWork is performed under the supervision of and in support of research goals developed by principal investigator, postdoctoral fellow or research scientist. The position requires dependable and responsible work towards assigned goals, with daily to weekly meetings, as needed, to assess progress. Interacts with the principal investigator and other members of his research teams (junior faculty, postdoctoral fellows, research techs), as well as outside collaborators as needed to discuss research goals, methods, and results.\n<br><br>\n<strong>Major Job Duties and Responsibilities:</strong>\n\n\n<ul>\n<li>Implement experimental protocols in molecular biology and tissue culture.</li>\n<li>Perform and analyze HIV in virus infection experiments 100%, broken out as:</li>\n<li>Perform PCR and qPCR ~ 15%</li>\n<li>Maintain tissue culture facility and perform tissue culture,~ 35%</li>\n<li>Maintain uninfected and virus-infected mammalian cell in biosafety level 2 and 2+ facilities, ~ 10%</li>\n<li>Operate and maintain laboratory instruments,~ 5%</li>\n<li>Prepare laboratory reagents,~ 5%</li>\n<li>Perform basic mathematical and computer assisted data analyses,~ 10%</li>\n<li>Maintain research data, laboratory records, inventory and supplies,~ 10%</li>\n<li>Perform other research duties as required. ~10%</li>\n</ul>\n\n<strong>Desired Qualifications:</strong>\n\n\n<ul>\n<li>Expertise in methods and protocols for studying HIV, experience with qPCR, independent thinking skills, creative approaches to experimental design</li>\n<li>Experience in mammalian cell culture, including work with PBMC and mammalian cell lines</li>\n</ul>\n\n<strong>Minimum Requirements:</strong>\n\n\n<ul>\n<li>Bachelor's Degree in Biology or related field.</li>\n<li>Three months to one year of related experience.</li>\n<li>Ability to meticulously organize and work well both independently and in collaboration, in an intense laboratory environment</li>\n<li>Strong collaborative and interpersonal skills</li>\n</ul>\n\n<strong>Application Process:</strong>\n<br>\nThe application process for UW positions may include completion of a variety of online assessments to obtain additional information that will be used in the evaluation process. These assessments may include Work Authorization, Cover Letter and/or others. Any assessments that you need to complete will appear on your screen as soon as you select “Apply to this position”. Once you begin an assessment, it must be completed at that time; if you do not complete the assessment you will be prompted to do so the next time you access your “My Jobs” page. If you select to take it later, it will appear on your \"My Jobs\" page to take when you are ready. <strong>Please note that your application will not be reviewed, and you will not be considered for this position until all required assessments have been completed.</strong></div><br>\n\n<div> <div>The University of Washington is a leader in environmental stewardship &amp; sustainability, and committed to becoming climate neutral.</div><br>\n\n <div>The University of Washington is an equal opportunity, affirmative action employer.\n<br>\n To request disability accommodation in the application process, contact the Disability Services Office at 206-543-6450 / 206-543-6452 (tty) or dso@uw.edu.</div>\n </div> <div> Apply for this job</div>"}