{"job title": "Staff Scientist, Integrative Oncology", "company": "Weston Solutions, Inc.", "city state": "– Seattle, Washington", "rating": "3.2", "job description": "Job ID 10426\n<br>\nType Regular Full-Time\n<br>\nCompany Fred Hutchinson Cancer Research Center\n<br>\nLocation US-WA-Seattle\n<br>\nCategory Staff Scientist\n<br><br>\nOverview\n<br><br>\nThe Fred Hutchinson Cancer Research Center and the Seattle Cancer Care Alliance (SCCA) have a staff scientist position available in the new SCCA Integrative Medicine Program. The SCCA brings together the leading research teams and cancer specialists of Fred Hutch, Seattle Children's, and UW Medicine at the only National Cancer Institute-designated comprehensive cancer center in the Pacific Northwest. One extraordinary group whose sole mission is the pursuit of better, longer, richer lives for our patients. SCCA's purpose is to provide state-of-the-art, patient and family centered care; support the conduct of cancer clinical research and education; enhance access to improved cancer interventions; and advance the standard of cancer care regionally and beyond.\n<br><br>\nThe mission of the Integrative Medicine Program is to provide effective, interdisciplinary, evidence-based complementary and integrative therapies in collaboration with conventional oncology care, and to conduct cutting-edge research on promising therapies. An independent, nonprofit research institute based in Seattle, Fred Hutch houses the nation's first and largest cancer prevention research program. Core resources available through the Fred Hutch Public Health Sciences Division include clinical research space, a metabolic kitchen, an exercise research center and clinical research space.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nCandidates should have an interest in the investigation of novel, interdisciplinary research questions related to identifying, testing and implementing effective integrative oncology clinical protocols. The staff scientist position will be under the direction of Dr. Heather Greenlee, Director of the Integrative Medicine Program at the SCCA and a member of the Division of Public Health Sciences. The Integrative Medicine Program uses both clinical trials and observational studies to examine a broad range of complementary/integrative therapies for cancer prevention and control, especially in under-resourced and vulnerable populations. Program researchers will work with national and international organizations to form clinical practice guidelines. Staff scientist responsibilities will include grant writing, developing and implementing research protocols, managing study staff, analyzing data, and manuscript preparation. Studies will include single institution and multi-site trials, including local and national clinical trials consortia, as well as observational cohorts.\n<br><br>\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>PhD or doctoral equivalent in Health Outcomes Research, Acupuncture, Psychology, Nursing Science, Behavioral Science, Nutrition, Exercise Physiology, Epidemiology, Naturopathic Medicine, Medicine or other field related to the practice and research of integrative oncology</li>\n<li>At least 2 years of post-doctoral research experience in a related field</li>\n<li>Experience implementing clinical trials and/or observational studies of integrative oncology therapies</li>\n<li>Strong quantitative and analytic programming skills</li>\n<li>Strong written and verbal communication skills</li>\n<li>Successful track record in grant writing and manuscript publication</li>\n<li>Demonstrated ability to work well within interdisciplinary teams and collaborations</li>\n<li>A long-term interest in a non-tenure track staff position</li>\n<li>Experience working with underserved communities strongly preferred</li>\n<li>An interest in transforming health care delivery and policy</li>\n</ul>\n\nOur Commitment to Diversity\n<br><br>\nWe are committed to cultivating a workplace in which diverse perspectives and experiences are welcomed and respected. We are proud to be an Equal Opportunity and VEVRAA Employer. We do not discriminate on the basis of race, color, religion, creed, ancestry, national origin, sex, age, disability, marital or veteran status, sexual orientation, gender identity, political ideology, or membership in any other legally protected class. We are an Affirmative Action employer. We encourage individuals with diverse backgrounds to apply and desire priority referrals of protected veterans. If due to a disability you need assistance/and or a reasonable accommodation during the application or recruiting process, please send a request to our Employee Services Center at ********************* or by calling ************."}