{"job title": "Scientist/Senior Scientist, Neuroscience", "company": "Alnylam Pharmaceuticals, Inc.", "city state": "– Cambridge, MA", "rating": "4.1", "job description": "Scientist/Senior Scientist, Neuroscience\n<br><br>\nOverview\n<br><br>\nAlnylam was founded in 2002 on a revolutionary vision and bold mission which remain firmly in place today. We are leading the translation of RNA interference (RNAi) into a new class of innovative medicines with the potential to transform the lives of people with rare genetic, cardio-metabolic, hepatic infectious, and central nervous system diseases with unmet need. ONPATTRO (patisiran), for the treatment of the polyneuropathy of hereditary transthyretin-mediated amyloidosis in adults, is Alnylam's first U.S. FDA-approved RNAi therapeutic. In addition, Alnylam has three investigational medicines in late-stage development. Alnylam is proud to have been recognized as one of The Boston Globe's Top Places to Work in 2015, 2016, and 2017.\n<br><br>\nWe are currently seeking an experiencedand highly motivated Neuroscientist who shares our passion for the promise of RNAi therapeutics to join us at the Scientist/Senior Scientist level. The successful candidate will work with our multidisciplinary CNS team to advance our CNS platform. They will have a strong background in neuroscience with a focus on cell biology as well as biomarker discovery and development.\n<br><br>\nSummary of Key Responsibilities\n\n\n<ul>\n<li>Contribute to our effort to advance RNAi for CNS delivery</li>\n<li>Assay development for CNS biology including cell based and biochemical assays</li>\n<li>Work with the team enhance our understanding of RNAi for CNS targets in primary and derived cells</li>\n<li>Participate in advancement of our CNS RNAi platform</li>\n<li>Identify nucleic acid and protein biomarkers and optimize assays for the assessment of functional RNAi in CNS</li>\n<li>Partner with clinical stage program teams to design biomarker strategies to further patient segmentation and understanding of MOA</li>\n<li>Establish and manage relationships with academic collaborators and/or CROs, including development of research plans and deliverables.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Requirements include a Ph.D. in an appropriate biological discipline such as neuroscience, pharmacology, genetics or molecular/cellular biology.</li>\n<li>At least 2 years of experience in an academic or industrial setting are required, with demonstrated expertise in CNS biology.</li>\n<li>Prior experience working with, or developing models of CNS disease and elucidating disease mechanism of action required.</li>\n<li>The candidate must be self-motivated, flexible, able to thrive in a team environment and be comfortable working on and prioritizing multiple projects.</li>\n<li>The candidate should have strong verbal and written communication skills and be capable of routinely interpreting data and making presentations to diverse groups within Research and Development.</li>\n</ul>\n\nAlnylam Pharmaceuticals is an EEO employer committed to an exciting, diverse, and enriching work environment.\n<br><br>\n<strong>#LI-MM1</strong>"}