{"job title": "Bioinformatics Scientist", "company": "CyberCoders", "city state": "– Albany, CA", "rating": "3.9", "job description": "Bioinformatics Scientist <div>\nIf you are a Bioniformatics Scientist with experience, please read on!</div>\n\n<br>What You Will Be Doing<div>\nThe successful candidate will work collaboratively with biologists, statisticians and clinical scientists to analyze immune monitoring data from clinical studies, perform cross-platform data analysis and integration with clinical data to identify biomarkers for patient stratification, clinical response and\n<br><br>\nDevelop and implement tools for the analysis of large-scale, multiparametric immune monitoring data obtained from genomic, transcriptomic and proteomic platforms\n<br>\nPerform cross-platform data integration\n<br>\nDevelop and implement tools for data visualization\n<br>\nSupport immune monitoring data analysis needs\n<br>\nDocument study design, methods and results in a meticulous and compliant manner\n<br>\nOrganize and present results concisely at regular team and cross-functional meetings\n<br>\nLiaise with Biometrics, Statistics, Clinical Science and Data Management teams to integrate immune monitoring with clinical data</div>\n<br>\nWhat You Need for this Position<div>\nAt Least 1 Year of experience and knowledge of:\n<br><br>\nStrong programming skills in Python, R and SQL are required\n<br>\nExperience in statistical packages (R/SAS) is desirable\n<br>\nExperience with visualization and pathway analysis software (IPA, CytoSCAPE, DAVID) are required\n<br>\nExperience in the analysis of next-generation sequencing and microarray data\n<br>\nExperience in developing and implementing algorithms to support clinical or biomedical R&amp;D\n<br>\nBioinformatics expertise in in immunology or cancer biology is highly desirable.\n<br>\nAt least one year of experience in the biotech industry is required\n<br>\nExperience in documentation of methods, analysis plans and results in a GxP compliant manner is a plus\n<br><br>\nPhD degree in Computational Biology, Statistics, Biostatistics, Computer Science or Bioinformatics, with at least 1 year experience in the biotech industry\n<br>\nDemonstrated ability to interrogate large biological data sets, preferably using human biologic data, and to address focused biological questions\n<br>\nAbility to work independently and within a dynamic team environment</div><br>\n\n<div>\nSo, if you are a Bioniformatics Scientist with experience, please apply today!</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}