{"job title": "Project Manager--Data Analytics", "company": "DSN", "city state": "– Springfield, IL", "rating": "3.9", "job description": "Job Description<div>Diversified Services Network, Inc. is seeking Project Manager to serve as the technical advisor in planning the technology and data needed for the Independent Data Analytic Practices for its lifespan. The desired candidate will be responsible developing and implementing approach for working with the program areas to create analytics solutions.\n<br><br>\n<strong>Responsibilities</strong>\n<ul>\n<li>Serving as a technical advisor in planning the technology and data infrastructure for its lifespan.</li><li>Communicating ongoing and functioning as an available resource to its staff.</li><li>Developing and implementing a consistent approach staff will use when working with program areas to create analytics solutions.</li><li>Coordinating work with key agency stakeholders to facilitate standing up the IDOR – DAP within the agency.</li><li>Holding regular status update and steering committee meetings to communicate with key agency stakeholders on progress relating to the IDOR - DAP and seeking feedback throughout the process.</li><li>Coordinating with the data analytics resources in the analysis of the existing approach and in the formation of a recommended approach to the data analytics process.</li><li>Assessing the approach used by the IDOR - DAP to date in identifying opportunities for analytics and business intelligence to provide a benefit to areas within the department.</li><li>Creating a recommended approach incorporating best practices in developing and completing data analytics projects.</li><li>This recommendation will include relevant components of lean management, process management, six sigma and quality management as a basis for the applications of data analytics as an improvement tool.</li><li>This recommended approach will focus on identifying and prioritizing data analytics opportunities based on estimated return on investment.</li><li>Throughout the nine-month engagement, the Project Manager will work in conjunction with the Data Scientist to consult with the Audit Bureau on their operations. The Project Manager and Data Scientist will be expected to lead regular consulting sessions with the Audit staff.</li><li>The goal of these consultation sessions will be to discover and document operational issues in the Audit area and consider potential resolutions/solutions available using data analytics.</li><li>When the Project Manager and Data Scientist identify an issue that can be resolved by applying data analytics, they will work with the Audit area to develop and document a use case.</li><li>Once documented, the use case will become the primary responsibility of the Data Scientist to investigate and resolve.</li>\n</ul>\n<strong>Qualifications:</strong>\n<ul>\n<li>Minimum 2 years of experience in tax administration or a closely related field</li><li>Minimum of 3 years of progressive project management experience in Information Technology.</li><li>Prefer experience directly related to data analytics.</li><li>Prior experience in leading a staff for a new unit within an organization.</li><li>PMP certification.</li><li>Minimum of a Master’s degree in Information systems, data analytics, computer science, statistics, or a closely related field.</li></ul></div>\n<br>\nCompany Description<div>DSN is an industry-leading consulting services company providing value to enterprise and government clients. We leverage extensive industry experience and expertise to deliver innovative solutions utilizing best-practice methodologies, top talents, and proven tool-sets. Since 1989, we have been delivering consulting services focused on Engineering, IT and Project Management.</div>"}