{"job title": "Pre-Sales Analytics – Lead Data Scientist", "company": "Equifax", "city state": "– Atlanta, GA", "rating": "3.0", "job description": "Pre-Sales Analytics – Lead Data Scientist<p></p><p>Equifax has a new career opportunity for a lead data scientist in our pre-sales analytics team. The person is able to design and develop advanced innovative pre-sales analytical solutions that provide sales support to the analytical sales consulting team. This position will sit at our Atlanta office.<br><br><b>Position Description </b></p><ul><li>Collaborate with analytical sales team in crafting and executing on compelling pre-sales analytical projects that demonstrate the value of Equifax solutions to customers.</li><li>Work with analytical consultants and analytical teams in creating consulting proposals that clearly explains Equifax innovative solutions.</li><li>Articulate and educate various internal stakeholders on Equifax data and analytical solutions.</li><li>Build a library of pre-sales analytical solutions that will be leveraged by the analytical consultants and various internal Equifax teams.</li><li>Develop proof of concept predictive models that demonstrates the value of various Equifax data assets that are being positioned in the market.</li><li>Respond to functional and technical elements of RFPs as necessary.</li><li>Proactively identify and generate pre-sales content that demonstrate value of Equifax solutions internally and externally.</li><li>Ensure quality end-to-end deliverables of developed pre-sales analytical solutions.</li><li>Contribute to process improvement initiatives within entire analytics group.</li></ul><p></p><p><b>Position Requirements</b></p><ul><li>5+ years’ experience in developing risk and marketing analytical solutions with at least 3 years in Financial Services preferred</li><li>Strong consultative acumen with responsibility for analytical project design and management as well as presentation of results to external customers</li><li>Strong knowledge of credit bureau specific data and the business problems in financial services preferred</li><li>Ability to lead on-shore and off-shore resources on projects</li><li>Ability to clearly present statistical solutions to non-statistical people and articulate value and insights to the business</li><li>Master’s degree or higher in Statistics, Business Analytics, Mathematics, Economics or other quantitative discipline</li><li>Exceptional data/ analytical skills and demonstrable attention to detail</li><li>Experience building logistic and linear regression solutions as well as knowledge of machine learning and other alternative methodologies preferred</li><li>Experience with SAS, R, SQL, or Python required</li><li>Experience with MS Office (Word, Excel, Access, PowerPoint)</li><li>Experience with Hadoop, Hive, Impala a plus</li></ul><p></p><p></p><p><b>Primary Location:</b></p>USA-Atlanta-One-Atlantic-Center<p></p><p></p><p></p><p></p><p><b>Function:</b></p>Function - Data and Analytics<p></p><p></p><p><b>Schedule:</b></p>Full time"}