{"job title": "Mass Spectrometry Scientist", "company": "INFICON", "city state": "– East Syracuse, NY", "rating": "3.9", "job description": "<strong>Company Overview:</strong>\n<br><br>\nINFICON is a growing, global, leading provider of innovative technologies that enhances productivity and quality in sophisticated industrial processes. The products provided by INFICON are world-class instruments for gas analysis, measurement, and control and are vital to manufacturers and end-users in the complex fabrication of semiconductors and thin film coatings for optics, flat panel displays, solar cells, and industrial vacuum coating applications. INFICON is headquartered in Switzerland and has world-class manufacturing facilities in Europe, the United States and China with subsidiaries located throughout the world. This position will be located at INFICON's U.S. headquarters in East Syracuse, NY. For more detailed information about INFICON, please visit our website at www.inficon.com.\n<br><br>\n<strong>Broad Function:</strong>\n<br><br>\nThe ideal candidate will leverage their background knowledge of physics, chemistry, engineering, and materials science in the development of analytical and scientific instrumentation based on Mass Spectrometry technologies. The selected candidate will be responsible for instrumentation development and product support.\n<br><br>\nINFICON is not sponsoring applicants for work visas.\n<br><br>\n<strong>Major Responsibilities:</strong>\n\n<ul>\n<li>Work with a small team of innovative scientists and engineers in the research, development, and testing of quadrupole mass spectrometers, GC/MS and other scientific instruments. This includes: instrument design, computer modeling, translating customer requirements into system specifications, testing new sensor designs, designing experiments, collecting and analyzing sensor data, optimizing and automating laboratory test equipment.</li> \n\n<li>Help specify performance and then test new instruments and sensors as they are developed. This will include designing and building prototypes as well as qualifying pre-production instruments.</li>\n\n<li>Documentation of sensor design, test, and manufacturing requirements. Furthermore this position will be involved in transferring design knowledge to manufacturing.</li>\n\n<li>Stay current with advances in relevant gas sensing technologies and assess whether there is any potential for application of these technologies to new products.</li>\n\n<li>Participate in relevant trade and technical organizations such as ASMS and HEMS to stay aware of any changes to industry standards. Participate in standard development committees as appropriate.</li>\n\n<li>Less than 10% travel will be expected for collaborations with INFICON locations, customers, suppliers, and other research institutions.</li>\n</ul>\n<strong>Required Qualifications:</strong>\n\n<ul>\n<li>A Ph.D in analytical chemistry and/or physics. Will consider other Ph.D. degrees if more than 5 years experience designing mass spectrometers.</li>\n\n<li>Will consider applicants with a Master's degree in Chemistry, Physics or Engineering and 10 or more years of relevant experience. Experience must be with the design and operation of mass spectrometers (preferably quadrupole) and instrumentation science, test and measurement electronics and vacuum technology.</li>\n\n<li>Mass spectrometer instrumentation design and development experience.</li> \n</ul>\n<strong>Preferred Qualifications:</strong>\n\n<ul>\n<li>Experience with chemical instrumentation (e.g., gas chromatographs, mass spectrometers, optical spectrometers).</li>\n\n<li>Experience with LabVIEW, SIMION, or other computer programming or simulation software.</li> \n\n<li>Experience designing quadrupole based mass spectrometers.</li> \n</ul>\n<strong>Compensation and Benefits:</strong>\n<br><br>\nCompensation will be commensurate with experience including a competitive base salary, bonus opportunity, and competitive benefits package.\n<br><br>\nINFICON, is committed to ensuring that our online application process provides an equal opportunity to all job seekers that apply without regard to race, religion, ethnicity, national origin, citizenship, gender, age, protected veteran status, disability status, genetic information, sexual orientation, or any other protected characteristic. A notice describing Federal equal employment opportunity laws is available here and here to reaffirm this commitment.\n<br><br>\nINFICON is also committed to providing reasonable accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for an employment opportunity at INFICON and require special assistance or an accommodation during the application process, please contact Human Resources at 315-434-1100. Determination on requests for reasonable accommodations are made on a case-by-case basis.\n<br><br>\nPAY TRANSPARENCY NONDISCRIMINATION PROVISION"}