{"job title": "Process Development Associate Scientist |", "company": "Kelly Services", "city state": "– Juncos, PR", "rating": "3.5", "job description": "Process Development Associate Scientist\n<br><br>\n-Technical support of bioreactor operations and pre-culture activities in development of bioreactor processes for current products.\n<br><br>\n- Conduct bioreactor and small-scale cell culture experiments in support of those activities.\n<br><br>\n- Be familiar with basic laboratory techniques, including but not limited to: aseptic expansion of mammalian cell culture and routine analytical procedures on cell culture samples.\n<br><br>\n- Have good understanding of cell culture parameters in general (cell growth rate, cell density, viability, population doubling, metabolites and cell waste, etc.).\n<br><br>\n- Be responsible for daily monitoring of the cell culture and keeping thorough record of cell culture parameters and results into data sheets and/or electronic notebooks.\n<br><br>\n- Responsible for data integrity and accuracy. T\n<br><br>\n- Experience with aseptic techniques, cell culture in shake flasks, Wave bioreactors and small bioreactors, and cell counting methods and equipment (Cedex) is preferred.\n<br><br>\nMasters degree or Bachelors degree and 2 years of directly related experience\n<br><br>\nCompetencies\n<br><br>\n- Strong computer, scientific, and organizational skills.\n<br><br>\n- Excellent communication (oral and written) and attention to detail.\n<br><br>\n- Working knowledge of analytical methodologies and analytical instruments qualification programs. Excellent computer technical writing skills.<br>\n<div>Why Kelly®?</div>\n<br><br>\nAt Kelly \n<br><br>\nServices®, we work with the best. Our clients include 95 of the Fortune \n<br><br>\n100™ companies, and more than 70,000 hiring managers rely on Kelly annually to access \n<br><br>\nthe best talent to drive their business forward. If you only make one career connection today, connect \n<br><br>\nwith Kelly.<br>\n\n<div>About \n<br><br>\nKelly Services®</div>\n<br><br>\nAs a workforce advocate for over 70 years, we are proud to directly employ nearly 500,000 people \n<br><br>\naround the world and have a role in connecting thousands more with work through our global network of \n<br><br>\ntalent suppliers and partners. Revenue in 2017 was $5.4 billion. Visit <u>kellyservices.com</u> and connect with us on <u>Facebook</u>, <u>LinkedIn</u> and <u>Twitter</u>.<br><br>Kelly Services is an equal opportunity employer including, but not limited to, Minorities, Females, \n<br><br>\nIndividuals with Disabilities, Protected Veterans, Sexual Orientation, Gender Identity and is \n<br><br>\ncommitted to employing a diverse workforce. <u>Equal Employment Opportunity \n<br><br>\nis The Law.</u>"}