{"job title": "Risk and Data Analyst", "company": "LSQ", "city state": "– Maitland, FL", "rating": "4.4", "job description": "<strong>About LSQ:</strong>\n<br><br>\nLSQ is a leading invoice finance platform in the U.S. We give entrepreneurs the power to access $5,000 - $50 million in working capital with the click of a button. Through our platform, businesses can upload unpaid invoices and get their money instantly without having to wait 30, 60, 90 or more days to get paid by customers. By freeing their cash from open invoices, businesses can get the financing they need to grow without having to take out a loan.\n<br><br>\nFounded in 1996, we’ve delivered over $10 billion in funding to thousands of businesses across the nation. We’re profitable, expanding rapidly between our Orlando (HQ) and New York offices, and recently raised $100+ million in growth capital.\n<br><br>\n<strong>What the Risk and Data Analyst will be responsible for:</strong>\n<br><br>\nThe Risk and Data Analyst is responsible for reviewing and analyzing the risk profile of small businesses (B2B), communicating directly with prospective clients, and proposing creative structures and solutions to facilitate deals. This is NOT a traditional Underwriting role found at banks, insurance companies, auto loans, etc. - data and technology will be at the forefront of your decision making process. This is a data-based analytical role. This is also not a Sr. level role; we need someone with 3+ years of experience.\n<br><br>\n<strong> What the Risk and Data Analyst will do:</strong>\n\n<ul>\n\n <li>Learn and understand business and A/R billing procedures to identify risks, propose solutions to facilitate potential funding decision-making</li>\n\n<li>This role is THE decision-maker regarding whether or not we fund a new client. There is no committee to send documentation to. The Data Analyst is the committee</li>\n\n<li>Leverage data and analytical tools to bring quantitative rigor to the funding and decision-making process</li> \n\n<li>Work with Excel, SQL, Tableau and Python regularly. If you are not familiar with them walking in the door, that is OK. We are offering you the chance to learn these business critical skills and will give you training</li>\n\n<li>Effectively communicate with external and internal constituents, with a keen focus on problem solving</li>\n\n<li>Issue and negotiate closing documentation (contracts, guaranties, subordinations)</li>\n\n<li>Manage the preparation of client for the transition to Operations Team</li>\n</ul>\n<strong>What the Risk and Data Analyst needs to have:</strong>\n\n<ul>\n\n <li>Bachelor’s degree, preferably in Finance, Accounting or Business</li>\n\n<li>3 or more years in an analytical role that focuses on data review and ingestion, decision making and analytics. Experience in the capital markets, fixed income, equity, RIA and/or Broker-Dealer industries is ideal</li>\n\n<li>Experience making decisions that will impact \"go/no-go\" within various business transactions</li>\n\n<li>Working knowledge of Microsoft Office: MS Excel, MS Word, MS Outlook, Google Docs and the ability to learn SQL, Tableau and Python</li>\n\n<li>The ability to be a problem solver; solution-driven work and results</li>\n</ul>\n<strong>Other skills needed:</strong>\n\n<ul>\n\n <li>Strong communication skills</li>\n\n<li>Resourceful, self-starter, independent thinker</li>\n\n<li>Team player, collaborative, responsive</li>\n\n<li>Detail-Oriented</li>\n</ul>\n<strong>What we offer</strong>\n\n<ul>\n\n <li>Competitive salary</li>\n\n<li>Casual dress – Florida is hot. Dress comfortably</li>\n\n<li>Really good health insurance, with one option being 100% employer paid!</li>\n\n<li>HSA &amp; FSA options</li>\n\n<li>Dental, Vision, Life, Short term &amp; Long term disability insurance - 100% employer paid!</li>\n\n<li>15 days of personal time off per year</li>\n\n<li>401K with company matching</li>\n\n<li>Financial planning services</li>\n\n<li>Discount on RDV Sportsplex membership</li>\n\n<li>Open floorplan</li>\n\n<li>Nice chairs</li>\n\n<li>Company provided snacks &amp; drinks in the office</li>\n\n<li>An incredible amount of training so you can learn what we do and don’t need to spend months piecing it together yourself.</li>\n</ul>\nPosition Type and Expected Hours of Work: This is a full-time position located in our Maitland headquarters.\n<br><br>\nTravel: Minimal travel\n<br><br>\nLSQ is not accepting unsolicited assistance from search firms for this employment opportunity. All resumes submitted by search firms to any employee at LSQ via-email, the Internet or in any form and/or method without a valid written Statement of Work in place for this position from LSQ HR/Recruitment will be deemed the sole property of LSQ. No fee will be paid in the event the candidate is hired by LSQ as a result of the referral or through other means.\n<br><br>\nLSQ is an Equal Opportunity Employer that does not discriminate on the basis of actual or perceived, race, religion, color, sex (including pregnancy and gender identity), sexual orientation, parental status, national origin, age, disability, family medical history or genetic information, political affiliation, military service, any other non-merit based factor or any other characteristic protected by applicable federal, state or local laws. Our leadership team is dedicated to this policy with respect to recruitment, hiring, placement, promotion, transfer, training, compensation, benefits, employee activities and general treatment during employment. If you’d like more information about your EEO rights as an applicant under the law, please click here http://www1.eeoc.gov/employers/poster.cfm"}