{"job title": "Data Engineer", "company": "Paycom", "city state": "– Oklahoma City - Oklahoma City, OK", "rating": "4.2", "job description": "<div><div>Job Details</div></div><div><div><div>Level <div><div>Experienced</div></div></div><div>Job Location <div><div>Oklahoma City - Oklahoma City, OK</div></div></div><div>Position Type <div><div>Full Time</div></div></div><div>Education Level <div><div>Graduate Degree</div></div></div></div><div><div>Job Shift <div><div>Day</div></div></div><div>Job Category <div><div>Information Technology</div></div></div></div></div><div><div>Description</div></div><div><div> <div>This position will be located within (Dev/IT) and work closely with computer scientists, IT and data scientists to deploy and optimize machine learning models in the Paycom production system environment.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n\n\t<li>Work closely with IT/Computer Scientists on technical aspects of deploying machine learning models in production.</li>\n<li>Work closely with Data Scientists to understand, implement, refine, design, and test deployment of machine learning models in production.</li>\n<li>Optimize the environment for production machine learning models to access and handle data more efficiently and ensure scalability.</li>\n<li>Designs new processes and builds large, complex data sets needed for machine learning processes.</li>\n<li>Serve as SME on machine learning technology and recommend acquisition of appropriate technology for production purposes.</li>\n<li>Advise and assist IT/infrastructure on install and configuration of machine learning systems.</li>\n<li>Explore, design, and implement a robust production-grade data processing pipeline that can ingest, aggregate, and transform large datasets.</li>\n<li>Independently conduct literature search to keep informed of best practices and new methods.</li>\n<li>Serve as on-call for production issues related to machine learning processes.</li>\n</ul>\n\n</div>\n</div></div><div><div>Qualifications</div></div><div><div> <div><strong>Education</strong>\n\n<ul>\n\n\t<li>BS degree in Computer Science or related field with 5 years machine learning engineering experience or MS/PhD degree in Computer Science or related field with 3+ years of machine learning engineering experience.</li>\n</ul>\n<strong>Experience</strong>\n\n<ul>\n\n\t<li>3+ years hands-on experience deploying production-level machine learning algorithms and productionizing them at scale in a distributed computational environment.</li>\n<li>1+ year experience with R. Working knowledge of R required.</li>\n<li>Experience working with large, messy real-world data.</li>\n<li>Experience with SQL, Ruby, Python, C#, Pig and other query and programming languages.</li>\n<li>Experience with machine learning database tools and platforms such as HBase, Mongo, Hive, Cassandra, MySQL, SQL Server, PostgreSQL, Hadoop, Spark.</li>\n<li>Experience with machine learning optimization tools and related technologies such as H2O, Theano, mlpack, TensorFlow. Experience with H2O required.</li>\n<li>Experience with machine learning platforms for production models such as Apache, Pattern, Shogun.</li>\n</ul>\n<strong>Skills and Abilities</strong>\n\n<ul>\n\n\t<li>Strong expertise in computer science fundamentals: data structures, performance complexities, algorithms, and implications of computer architecture on software performance such as I/O and memory tuning.</li>\n<li>Working knowledge software engineering fundamentals: version control systems such as Git and Github, workflows, ability to write production-ready code.</li>\n<li>Strong knowledge of data architecture and system/pipeline and data processing engines such as Spark and Hadoop.</li>\n<li>Working knowledge of R and Rstudio.</li>\n<li>Working knowledge of SQL, Pig, Python, and other query languages.</li>\n<li>Knowledge of C++, PHP, Java and other languages.</li>\n<li>Knowledgeable with machine learning tools and frameworks like Python, Spark, H2O, Theano, mlpack, TensorFlow.</li>\n<li>Knowledge of machine learning platforms such as Amazon, IBM Watson, Azure, Google Predict, BigML</li>\n<li>Strong trouble-shooting skills.</li>\n<li>Knowledge of technical infrastructure.</li>\n<li>Knowledge of installation and configuration of machine learning systems/technology.</li>\n<li>Strong technical aptitude.</li>\n<li>Basic knowledge of statistics, calculus and probability, experimental design, and machine learning techniques to enable conceptual understanding of Data Scientist’s models.</li>\n<li>Has strong critical thinking skills and the ability to relate them to the products of Paycom.</li>\n<li>Possesses a combination of creative abilities and business knowledge.</li>\n<li>Demonstrates excellent verbal and written communication skills as well as the ability to bridge the gap between data science and business management.</li>\n<li>Displays exceptional organizational skills and is detailed oriented</li>\n</ul>\n<em><strong>Paycom provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, pregnancy, military and veteran status, age, physical and mental disability, genetic characteristics, or any other considerations made unlawful by applicable state or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training. Paycom expressly prohibits any form of workplace harassment based on race, color, religion, sex, national origin, pregnancy, military and veteran status, age, physical and mental disability, or genetic characteristics.</strong></em></div></div></div>"}