{"job title": "Senior Scientist", "company": "Pfizer", "city state": "– United States - New York - Pearl River", "rating": "3.9", "job description": "<u><strong>Sr. Scientist (Biologist) Tumor Cell Discovery</strong> </u>\n<br><br>\n<strong><strong>ROLE SUMMARY</strong></strong>\n<br><br>\nPfizer Inc. is offering an exciting opportunity for an exceptional Biologist to join our tumor cell biology team in Pearl River, NY. We are seeking a highly motivated, independent scientist to support the development and implementation of molecular and cellular assays and models to drive drug discovery in human cancer\n<br><br>\n<strong><strong>ROLE RESPONSIBILITIES</strong></strong>\n<br><br>\nIn order of importance, indicate the primary responsibilities critical to the performance of the role. It is recommended not to list actual tasks but focus on 5-8 essential responsibilities that highlight accountability and level of judgment required.\n<ul>\n<li>Responsible for developing in vitro assays towards discovering novel targets/therapeutics for caner</li><li>Independently design and perform key studies to understand disease biology, elucidate mechanism of action at the functional genomics, molecular and cellular level to analyze/interpret experiments to understand novel areas of cancer biology to support drug discovery projects</li><li>Provide strong scientific and technical skills, utilizing extensive technical expertise in new technology/techniques, including gene editing</li><li>Critically analyze/ interpret complex data and able to present document and results effectively to a variety of audiences</li><li>Communicate effectively with colleagues from cross-functional disciplines (inter/intra department).</li><li>Ability to navigate and be proactive in a fast-paced, highly-matrixed work environment</li>\n</ul>\n<strong>TECHNICAL DUTIES INCLUDE</strong>\n<ul>\n<li>Modulate targets in vitro via utilization of genetic and pharmacologic approaches and understand the functional role(s) on cancer initiation and progression.</li><li>Implement functional genomic screens to identify new targets and able to perform drug combination studies</li><li>Utilize 2D and 3D cell culture assays to measure cell proliferation, migration, and invasion.</li><li>Perform cell-based assays across various technology platforms to assess target modulation and measure downstream signaling pathways– qPCR, ChIP-seq, FACS, immunofluorescence, western blotting, ELISA, high content screening, etc.</li><li>Utilize electronic data capture/analysis tools such as Excel, GraphPad, Biobook, Spotfire and PowerPoint for experimental documentation and data analysis/presentations</li>\n</ul>\n<strong><strong>BASIC QUALIFICATIONS</strong></strong>\n<ul>\n<li>BS or MS in Cellular, Cancer, or Molecular Biology, Genetics, or Immunology</li><li>5+ years’ of post-graduate research experience</li><li>Extensive experience in standard molecular and cell biology techniques including, but not limited to, CRISPR/Cas9 gene editing, cloning, Western blotting, quantitative PCR, and immunofluorescence techniques</li><li>It is essential that the candidate possess strong communication ability in a team environment, problem solving skills, collaborative spirit, and technical expertise in the laboratory.</li>\n</ul>\n<strong><strong>PREFERRED QUALIFICATIONS</strong></strong>\n<ul>\n<li>Strong track record in target identification/validation and screening approaches using small-molecule inhibitors and/or genetic manipulation (shRNA, CRISPR)</li><li>Expertise in cancer biology or epigenetics</li><li>Experience implementing and executing novel drug combination strategies</li>\n</ul>\n<strong><strong>EEO &amp; Employment Eligibility</strong></strong>\n<br><br>\nPfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.\n<br><br>\n<strong><strong>Sunshine Act</strong></strong>\n<br><br>\nPfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider’s name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.\n<br><br>\nPfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates."}