{"job title": "Bioinformatics Scientist", "company": "UNC-Chapel Hill", "city state": "– Chapel Hill, NC", "rating": "4.1", "job description": "<div>\n<div>\n<div><strong>Classification Title:</strong></div><div>\nBioinformatics Scientist</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Working Title:</strong></div><div>\nBioinformatics Scientist</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Campus:</strong></div><div>\nUNC-Chapel Hill</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Region:</strong></div><div>\nPiedmont/Triangle</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Job Summary:</strong></div><div>\nAre you interested in helping push cancer research forward? Would you like to tackle big data problems? Do you want to be a part of a team that assists in providing personalized data driven treatments to cancer patients? If so, the Lineberger Bioinformatics Core is looking for you! The Bioinformatics Core Facility at the Lineberger Comprehensive Cancer Center (LCCC) provides bioinformatics and computational biology research services for the cancer center. As a member of the Bioinformatics Core Facility, The Bioinformatics Scientist will be responsible for data analysis, including statistical analysis, machine learning, and the development and execution of software to support LCCC sponsored research. Specific research goals will be identified through collaboration with geneticists, oncologists, immunologists, and, bio-statisticians. Fulfillment of this responsibility requires strong proficiency in R, strong scientific communication skills, experience with next-generation sequence analysis, Python or Perl, data mining, and statistical and machine learning experience.</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Minimum Qualifications:</strong></div><div>\nThe candidate must have proficiency in R, Python or Perl, knowledge of statistics and machine learning, knowledge of molecular biology and genomics, and have a passion for collaborative and interdisciplinary research. Candidate should be highly motivated and able to work independently, and exhibit excellent oral and written communication skills. Experience with next-generation sequence analysis and working in a high performance computing environment is preferred.A PhD or MS in bioinformatics, genetics, computer science, mathematics, physics, genetics, statistics, computational biology, or relevant field is required.</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Position Number:</strong></div><div>\nNF0002930</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Posting Date:</strong></div><div>\n02/08/2018</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<strong><div>Closing Date:</div></strong></div><strong>\n </strong></div><strong>\n\n<br></strong><br>\n\n<div>\n<div>\n<div><strong>American Recovery &amp; Reinvestment Act Funded:</strong></div><div>\nNo</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div>\nApply Now</div>\n</div>\n </div>\n\n<br>"}