{"job title": "Research Scientist, Asst", "company": "University of Wyoming", "city state": "– Laramie, WY", "rating": "4.0", "job description": "<div> <div>Please Note</div>\n</div> <div> <div><div><strong>Laboratory Technician\n<br>\n<u>WILDLIFE GENOMICS, POPULATION GENETICS, and DISEASE ECOLOGY</u></strong>\n<br><br>\nA laboratory technician position is available to assist research in wildlife population genetics &amp; genomics. The position will be primarily lab-based within the Ernest Wildlife Genomics and Disease Ecology Laboratory in the Department of Veterinary Sciences which has affiliations with the University of Wyoming (UW) Graduate Program in Ecology.\n<br><br>\n<strong>*Apply as soon as possible, applications will be reviewed as they are received. See instructions below*</strong>\n<br><br>\nThe technician will be responsible for lab work, including assisting other lab members with research and responsibilities may include supervising and mentoring undergraduate students. Lab work may involve genomic (next gen sequence data generation and analysis) and genetic (microsatellite) to examine landscape-level genetic diversity, population structure, and population health/disease of wildlife species in the Rocky Mountain West and California. Projects will involve species of current focus in our lab (see our website). Work will involve processing samples, entering data into electronic data bases, maintaining lab safety procedures, equipment and reagents, and more. This position will contribute to graduate students’ and lab’s research on genomics and population health of pronghorn, mule deer, hummingbird, sea otter, black bear, and/or other species, as well as aspects of wildlife population health and/or disease ecology. Responsibilities may also include contributing to data analysis, manuscript writing for peer-reviewed publication, grant-writing, and development of oral and poster presentations of research. Desire to assist in lab management is a plus.\n<br><br>\nThe Ernest Wildlife Genomics and Disease Ecology Laboratory is a dynamic and highly collaborative lab at UW. We work with other academic institutions, as well as state, federal, and non-governmental agencies toward wildlife conservation and management. There are many opportunities to work with recognized leaders who apply excellence in science toward wildlife conservation and management. Quality mentorship of trainees of all educational levels is a priority for the laboratory. University of Wyoming hosts excellent wildlife and ecology science and a collegial academic atmosphere. Laramie is a wonderful college town of ~ 30,000 and offers easy access to the Rocky Mountains and outdoor activities including skiing, hiking, climbing, birding, and fishing &amp; hunting.\n<br><br>\nThe work requires the ability to read and interpret very small print and subtle visual differences such as in data readouts, lifting of objects up to 30 pounds, potentially having rabies vaccination series (if needed for work with samples from carnivores and bats), and occasional field work involving hiking and work in potentially harsh outdoors environments (see below, under requirements) with or without a reasonable accommodation.\n<br><br>\n<strong><em>The University of Wyoming invites diverse applicants to consider our employment opportunities. We are also especially interested in candidates who have experience working with diverse populations and/or diverse initiatives</em></strong>.</div></div>\n</div> <div> <div>Minimum Qualifications</div>\n</div> <div> <div><div><strong>Required Qualifications</strong>\n<br><br>\n<strong>The successful candidate will have:</strong>\n<ul>\n\t<li>A BS in wildlife biology, ecology, genetics, genomics, bioinformatics, or related field; and work that involved laboratory and data analysis in animal, microbial, or plant population genetics or genomics.</li>\t<li>Demonstrated knowledge, skills, and abilities in the following areas: laboratory bench work with organism sample preparation for DNA analysis and archiving, DNA extraction from multiple sample types (such as any of tissue, liquid blood, dried blood, saliva, feces, etc.), PCR, preparation of samples for DNA sequencing and/or DNA genotyping (SNP and/or microsatellite); excellent pipetting and laboratory fluid handling skills for large (liters) and small (1 microliter, for example) volumes.</li>\t<li>Documented research laboratory and computer file organization skills and abilities.</li>\t<li>Demonstrated knowledge, skills, and abilities with Excel, Word, and PowerPoint, as well as data sets involving sample information.</li>\t<li>Documented interest in applied conservation-oriented research in wildlife genetics, non-invasive DNA analysis, population genomics, and ecology of wildlife.</li>\t<li>Demonstrated track record of collegiality, interpersonal skills, communication, creative leadership and problem-solving abilities that promote a positive team work atmosphere. Demonstrated ability to work both independently and in teams, and ability to respond and adjust to difficult situations. Demonstrated ability to work with and communicate with wide diversity of stakeholders, staff, students, field biologists, and members of the public.</li>\t<li>Demonstrated ability to conduct wildlife field work (up to 2-3 times a year) that may involve harsh environmental conditions (cold, hot, windy, steep, rocky, etc.), sampling wildlife (blood, tissues, feces, potential for exposure to disease organisms that can cause illness in people, etc.), and hiking over rough terrain with heavy gear.</li>\t<li>Demonstrated ability to work or travel occasionally (up to a 2-3 times a year) for periods of time (such as a few days or up to a week) and including weekends, holidays, and evenings; a valid driver’s license.</li></ul></div>\n</div>\n</div> <div> <div>Desired Qualifications</div>\n</div> <div> <div><div><strong><u>Additional preferred documented skills, knowledge, and abilities include any of following (in priority order):</u> </strong>\n<ul>\n\t<li>An MS in wildlife biology, ecology, genetics, genomics, bioinformatics, or related field; and with graduate work that involved laboratory and data analysis in wildlife population genetics or genomics.</li>\t<li>Demonstrated knowledge, skills, and abilities in laboratory data generation of genotypic DNA data (microsatellites and/or SNPs), Sanger DNA sequence data, mitochondrial DNA, non-invasive (fecal, hair, e-DNA, etc.), and DNA laboratory techniques; working knowledge of DNA capillary gel electrophoresis.</li>\t<li>Demonstrated knowledge, skills, and abilities in computational data analysis of genotypic DNA data (microsatellites and SNPs), Sanger DNA sequence data, mitochondrial DNA data, non-invasive (fecal, hair, etc.).</li>\t<li>Experience with lab management or lab upkeep including: equipment maintenance, lab safety regulations, creating and organization of standard operating procedures, ordering reagents/supplies, lab financial budgeting, guiding and helping with lab activities of other lab members and undergraduate interns, etc.</li>\t<li>Quantitative skills as demonstrated through documented knowledge, skills, and abilities with mark-recapture analysis (such as MARK, SECR, and/or CAPWIRE and similar programs), statistics, computational modeling. Construction and maintenance of SQL/relational databases for large DNA data sets.</li>\t<li>Next Generation Sequencing DNA library preparation and construction techniques and equipment (such as dd-RAD techniques, Pippen size selection, DNA fragment analyzer, etc.), and next generation sequencing (NGS; Illumina or similar) data.</li>\t<li>Demonstrated skills, knowledge, and ability with population genetics software and genotype (microsatellite data analysis; R statistical software environment.</li>\t<li>Experience with wildlife field work that involved repeated handling of free-ranging wildlife animals in challenging environmental conditions.</li>\t<li>Wild mammalian mark-recapture study design, field work, telemetry data analysis, tracking, and/or non-invasive DNA analysis.</li>\t<li>Laboratory disease diagnostic testing including pathogen PCR testing, ELISA, or other techniques.</li>\t<li>Geographic Information Systems (GIS) knowledge, skills, and abilities including ESRI Inc. programs such as ArcGIS and/or other geospatial analysis packages in R; data analysis, map and publication-quality figure creation using GIS.</li>\t<li>Bioinformatics for genomics; such as Linux-based computing and programing; programming language used in genetic and/or genomic data analysis (such as Python, Perl).</li></ul></div>\n</div>\n</div> <div> <div>Required Materials</div>\n</div> <div> <div><div>Complete on-line application and <strong>upload the following as one document</strong>: cover letter stating research interests, resume/C.V., and <u>specifically list how the \"required\" and any \"preferred\" qualifications are met,</u> and the contact information (name, position, email, phone, institutional affiliation, and research area) for at least three work-related references.\n<br><br>\n<strong>Preferred start date is preferably in August/September 2018 or as soon as possible. Applications will be reviewed as they come in and will remain open until at least July 25, 2018 and until filled.</strong></div></div>\n</div> <div> <div>Hiring Statement</div>\n</div> <div> <div><div><em>The University of Wyoming is an Equal Employment Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status or any other characteristic protected by law and University policy. To review the EEO is the Law Poster and its Supplement, please see The Diversity &amp; Fairness page.</em>\n<br><br>\n<em>Pursuant to Wyoming State law, W.S. 19-14-102, as amended, an honorably discharged veteran who has been a resident of the state of Wyoming for one (1) year or more at any time prior to the date when the veteran applies for employment, or any surviving spouse who was married to such veteran at the time of the veteran’s death, who is receiving federal survivor benefits based on the veteran’s military service and is applying for employment, shall receive an interview preference during the applicant screening process with the University of Wyoming. At the time of application the applicant must possess the business capacity, competency, education or other qualifications required for the position. If disabilities do not materially interfere with performance of job duties, disabled veterans will be given preference over able-bodied veterans. Appropriate documentation of veteran status must be provided at time of application as outlined in the application process. No preference will be given to a veteran currently employed by a public department.</em>\n<br><br>\n<em>We conduct background investigations for all final candidates being considered for employment. Offers of employment are contingent upon the completion of the background check.</em>\n<br><br>\nApplicants with disabilities may request accommodation to complete the application and selection process. Please notify Human Resources at least three (3) working days prior to the date of need.</div></div>\n</div> <div> <div>Welcome to Laramie</div>\n</div> <div> <div><div>The University of Wyoming is located in Laramie, a town of 30,000 in the heart of the Rocky Mountain West. The state of Wyoming continues to invest in its university, helping to make it a leader in academics, research and outreach. The university has state-of-the-art facilities in many areas and the community provides the advantages of a major university.\n<br><br>\nLocated in a high mountain valley near the Colorado border, Laramie offers both outstanding recreational opportunities and close proximity to Colorado’s Front Range, a bustling group of metropolitan cities including Denver, Boulder, and Fort Collins. This beautiful mountain landscape offers outdoor enjoyment in all seasons, with over 300 days of sunshine annually. For more information about the region, please visit http://visitlaramie.org/</div></div>\n</div>"}