{"job title": "Data Science Intern", "company": "Zillow", "city state": "– Seattle", "rating": "4.2", "job description": "About the teamZillow Group's Decision Science team helps solve problems and derive insights for organizations across the company. Each team member focuses on a cross-section of the Zillow Group community. Our team structure is very flat and you will soon find yourself communicating directly with Senior Leadership. You'll work with them to make important, strategic decisions that influence the future of the company.\n<br><br>\nBelow are some of the areas in which our Data Science Interns focus their energy.\n\n\n<ul>\n<li>Business. Create data-driven insights to fuel the future of each of Zillow Group’s businesses</li>\n</ul>\n\n(e.g., Agent, Rentals, New Construction) by identifying opportunities for innovation and\n<br>\nassessing performance of current initiatives.\n\n\n<ul>\n<li>Marketing. Develop data-driven strategies for B2C and B2B marketing efforts through a wide</li>\n</ul>\n\nrange of marketing channels and measure their performance.\n\n\n<ul>\n<li>Product. Analyze how our consumers are interacting with our web and app products to insure</li>\n</ul>\n\nwe are providing them with a delightful experience for all things home.\n\n\n<ul>\n<li>Sales. Analyze the intersection of human behavior, incentive structures, and sales process to</li>\n</ul>\n\ncreate a more efficient sales force that scales with Zillow Group’s ambition.\n\n\n<ul>\n<li>Pricing. Develop and implement pricing strategies that deliver the best value possible for our</li>\n</ul>\n\nclients (Premier Agents, Lenders, Landlords, etc).\n\n\n<ul>\n<li>Tools. Create data-focused information products from billions of data points we collect each</li>\n</ul>\n\nday for internal and external clients.About the role<br><br>Once you are here you'll help architect, analyze, and report on data to improve our understanding of our marketplaces from multiple perspectives (e.g., product development, consumer behavior, monetization). More specifically:\n<ul>\n\n<li><strong>Dive into Zillow's internal and third party data (think Hive, Presto, SQL Server, Redshift, Python, Mode Analytics, Tableau, R) to identify opportunities for improvement (e.g., personalized user flows, segmented marketing audiences, more accurate pricing forecasts).</strong></li>\n<li><strong>Assist in the scoping and development of new product features and business initiatives, and compile and analyze data describing the performance of those initiatives (e.g., AB tests, pilots, incrementality tests).</strong></li>\n<li><strong>Coordinate with others on the team as well as engineers, product developers, and marketers to develop a common language and approach to analyzing and communicating information and insights.</strong></li>\n<li><strong>Work directly with teams across Zillow Group to develop, maintain, and document a robust set of important metrics to monitor day-to-day bug detection and long-term performance tracking.</strong></li>\n<li><strong>Tell stories that describe analytical results and insights in meetings of all sizes with diverse audiences.</strong></li>\n<li><strong>Consult with stakeholders and provide analytics-oriented thought leadership across a variety of non-technical audiences to ensure that all levels of Zillow Group make data-driven, rational decisions.</strong><strong>​</strong></li>\n\n</ul>\n\nWho you are<br><br>You will not shy away from complexity or uncertainty. You will develop a solid understanding of our mission, business models, and personas. We want you to use that intuition you've developed (both in business and real life) to find opportunities for growth and develop insights from our massive data sets. These opportunities and insights allow the broader organization to meet its goals, improve its performance, and positively impact how our users navigate our marketplaces.\n<br><br>\n<strong>We're looking for a seasoned data scientist that has:</strong>\n<ul>\n\n<li><strong>Problem solving expertise gained while working towards an undergraduate or Master's degree in a quantitative field (e.g. science, engineering, economics, finance, statistics, or similar) or demonstrable experience within data science and analytics.</strong></li>\n<li><strong>Experience involving quantitative data analysis and complex problem solving (preferably focused on consumer-facing internet products).</strong></li>\n<li><strong>Foundational analytical skills (solid understanding of SQL, total command of Excel, and experience using R and/or Python) and are a Tableau pro.</strong></li>\n<li><strong>Interest in working with multi-terabyte-sized data sets and are comfortable accessing those data (even if they're in JSON format) with Hive and Presto.</strong></li>\n<li><strong>An understanding of concepts, terminology, and issues related to web traffic.</strong></li>\n<li><strong>Strong written and verbal communication skills, and work well on teams of all sizes with representatives from a diverse set of technical backgrounds.</strong></li>\n<li><strong>The skill to ask the right questions, can push stakeholders to focus on realistic goals and projects, and concisely communicate in written, verbal, and visual formats in a way that provides context, offers insights, and minimizes misinterpretation.</strong></li>\n\n</ul>\n\nGet to know usZillow Group houses a portfolio of the largest and most vibrant real estate and home-related brands on the web and mobile. Our mission is to build the largest, most trusted and vibrant home-related marketplace in the world.<br><br>Zillow Group is owned, fueled and grown by innovators who help people make better, smarter decisions around all things home. We encourage one another at every level, and our efforts are supported by employee-driven, world-class benefits that enable us to enjoy our lives outside the office while building fulfilling careers that impact millions of individuals every day.\n<br><br>\nZillow Group is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. Therefore, we provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, or any other protected status in accordance with applicable law. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know."}