{"job title": "Data Scientist", "company": "PACCAR", "city state": "– Bellevue, WA", "rating": "3.1", "job description": "Company Information\n<br><br>\nPACCAR is a Fortune 500 company established in 1905. PACCAR Inc is recognized as a global leader in the commercial vehicle, financial, and customer service fields with internationally recognized brands such as Kenworth, Peterbilt, and DAF trucks. PACCAR is a global technology leader in the design, manufacture and customer support of high-quality light-, medium- and heavy-duty trucks under the Kenworth, Peterbilt and DAF nameplates. PACCAR designs and manufactures advanced diesel engines and also provides customized financial services, information technology and truck parts related to its principal business.\n<br><br>\nWhether you want to design the transportation technology of tomorrow, support the staff functions of a dynamic, international leader, or build our excellent products and services you can develop the career you desire with PACCAR. Get started!\n<br><br>\nJob Functions / Responsibilities\n\n\n<ul>\n<li>Be a leading expert and organizational resource on developing and evaluating advanced analytics.</li>\n<li>Work with business stakeholders and Senior leaders to develop new analytics solutions, identify new data useful for analytics projects, and support analytics best practices.</li>\n<li>Develop sophisticated advanced analytics models; including creating, validating, analyzing and explaining the data used for model development.</li>\n<li>Assess the effectiveness and accuracy of new data sources and analytics techniques.</li>\n<li>Develop processes to extract, clean, merge, transform and compile data from various data sources, including relational database, flat files, NoSQL databases and unstructured data.</li>\n<li>Introduce improvements to increase the speed, accuracy and efficiency of advanced analytics across the PACCAR Financial organization.</li>\n<li>Provide accurate, relevant and meaningful ad-hoc analysis to management to support strategic and tactical decision-making.</li>\n<li>Create and present materials on data projects, data science architecture, and analytics strategies.</li>\n</ul>\n\nQualifications and Skills\n<br><br>\n<strong>Required Qualifications:</strong>\n\n\n<ul>\n<li>Minimum five years of applicable job experience, with a proven ability to develop advanced analytics models.</li>\n<li>Significant experience with, or deep understanding of, statistical techniques, modelling, and machine learning.</li>\n<li>Significant experience with, or deep understanding of, programming (R, Python, Java, or C#).</li>\n<li>Significant experience with, or deep understanding of, structured and unstructured data, including relational databases (SQL Server), graph databases (Neo4J), NoSQL databases (MongoDB) and unstructured data.</li>\n<li>Experience with, or understanding of, programming (R, Python, Java, or C#).</li>\n<li>Experience with working with big data (Scala, Spark, Pig).</li>\n<li>Must be a highly-motivated self-starter and self-directed learner with a creative mind, high attention to detail and a solution-oriented outlook.</li>\n<li>Candidate must demonstrate strong analytical skills, excellent general business acumen, with the ability to concisely and clearly communicate complex topics.</li>\n<li>Ability to maintain balance between solid \"pragmatism\" and \"scientific rigor\" to meet the needs of a dynamic business.</li>\n<li>Proficiency with Microsoft Office suite.</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Demonstrable in-depth understanding of data structures and ETL processes (including SSIS).</li>\n<li>Familiarity with cloud storage and compute on Azure or AWS.</li>\n<li>Experience with container deployments (Docker, Kubernetes, ECS).</li>\n<li>Experience with the operationalization and maintenance of analytics APIs using Plumber, Flask, Swagger and similar.</li>\n</ul>\n\n<strong>Education</strong>\n\n\n<ul>\n<li>Master's Degree in Statistics, Mathematics, Analytics, Computer Science or related field required.</li>\n<li>PhD in Data Science, Computer Science, or related field preferred.</li>\n</ul>\n\nAdditional Job Board Information\n<br><br>\nPACCAR is an Equal Opportunity Employer/Protected Veteran/Disability.\n<br><br>\nNearest Major Market: Seattle\n<br><br>\nNearest Secondary Market: Bellevue\n<br><br>\nJob Segment: Database, Scientific, Scientist, Computer Science, Plumbing, Engineering, Technology, Science, Manufacturing"}