{"job title": "Data Scientist, Digital Ag", "company": "DuPont", "city state": "– Johnston, IA", "rating": "3.5", "job description": "<strong>Job Description</strong>\n<br><br>\nCorteva Agriscience has a rich history of scientific discoverythat has enabled countless innovations. We're looking for more people, in moreplaces, to collaborate with us to create a market-shaping, agriculture companywith leading positions in seed technologies, crop protection and digitalagriculture.\n<br><br>\nWe need Data Scientists to collaborate with visionary cropscientists, agronomists, plant breeders, and engineers to build digitally enabledscience and business capabilities.\n<br><br>\nAre you looking for an opportunity to use your data scienceskillset to contribute to our team and help us on our mission!?\n<br><br>\n<strong>In this role, you will:</strong>\n\n\n<ul>\n<li>Engage with a team of domain scientists, data scientists, engineers,and software developers assembled to identify business problems, discover newdata opportunities, provide data driven solutions, and deliver productionapplications which enhance value and efficiency for collaborators andcustomers.</li>\n<li>Identify, acquire, and engineer feature data sets with potentialto address customer needs.</li>\n<li>Develop, prototype, and implement data pipeline and softwaresolutions with engineering and production teams.</li>\n<li>Apply machine learning, statistical or mechanistic models andother computational approaches to extract insights from datasets in complexagronomic systems.</li>\n<li>Collaborate with scientists from multiple domains insolution/experiment design and analyses.</li>\n<li>Conduct and communicate results of research on data scienceapproaches to improve decisions, add value to services, extend or improvein-house models and algorithms, and contribute to the advancement of theseideas into the marketplace.</li>\n<li>UpholdCorteva Agriscience Core Values at all times.</li>\n</ul>\n\nJob Qualifications\n\n\n<ul>\n<li>Outstanding problem solving skills and a proven ability toindependently deliver analytic solutions by asking the right questions,identifying necessary data sources, building predictive models, and producingactionable results.</li>\n<li>Expertise in machine learning, deep learning, data mining,statistical methodology, or simulation modeling and demonstrated experienceusing these techniques.</li>\n<li>Expert in Python or R in linux environments.</li>\n<li>Comfort in using cloud based systems and services, especiallyAWS.</li>\n<li>Strong skills in building visualizations of scientific data.</li>\n<li>Proven ability to work in a team setting and ability to completecomplex projects on time and in budget.</li>\n<li>Superior communication skills, both verbal and written.</li>\n<li>An M.S. or PhD in Data Science, or Computer Science, Physics,Mathematics, or Statistics with demonstrated data science applications.</li>\n</ul>\n\n<strong>What will generate excitement:</strong>\n\n\n<ul>\n<li>Experience working with and managing geospatial data sets withopen source tools</li>\n<li>Experience designing Docker based deployments</li>\n<li>API focused solution capability</li>\n<li>Strengthwith Database technologies.</li>\n</ul>\n\nWe are excited to announcethat Corteva Agriscience is the name of the new Agriculture Divisionof DowDuPont. We are bringing together DuPont Crop Protection, DuPontPioneer and DowAgroSciences to create a market-shaping, standaloneagriculture company with leading positions in seed technologies, cropprotection and digital agriculture. We will work across the global agriculturevalue chain to create a more efficient food system.\n<br><br>\nAt Corteva Agriscience,we seek to enrich the lives of those who produce and those who consume. Thismeans we will help rejuvenate the agricultural ecosystem to support people andthe planet and to ensure progress for generations to come."}