{"job title": "Medical Lab Scientist", "company": "ADN Healthcare", "city state": "– Springfield, IL", "rating": "5.0", "job description": "<strong>Location:</strong> Springfield, IL\n<br><br>\n<strong>Job Type:</strong> Direct\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nBasic Function:\n<br><br>\nCollects, prepares and handles specimens for analysis from patients of all ages. Performs scientific work in the laboratory for a wide variety of laboratory procedure using both manual and automated methods.\n<br><br>\nServes as a resource for Level I Med Tech and other lab staff.\n<br><br>\n<strong>QUALIFICATIONS:</strong>\n\n<ul>\n<li><strong>Bachelor's degree</strong> in Medical Laboratory Sciences or related Allied Health field required.</li>\n<li>Registered <strong>MLS (ASCP)/MT (ASCP)/BS MT ASCP I/MT(NCA)</strong> required.</li>\n<li>At least <strong>4 years work experience as a MLS</strong> or equivalent.</li>\n<li>Moderate physical effort.</li>\n</ul>\nPrinciple Responsibilities:\n\n<ul>\n<li>Performs all technical skills required at the level of Medical Laboratory Scientist Il according to laboratory policy.</li>\n<li>Operates hospital computer system acquiring necessary patient information to enter, delete or credit the patient account.</li>\n<li>Follows all established departmental procedures.</li>\n<li>Participates in continuing education and maintaining a level of skill and knowledge outlined by an accrediting agency.</li>\n<li>Promotes good communication and interpersonal skills in accordance to laboratory policy.</li>\n<li>Actively participates in competency assessment process.</li>\n<li>Performs preventive and corrective maintenance and repairs on lab instrumentation. Calibrate instruments to assure accuracy.</li>\n<li>Performs analytical and decision-making functions without direct supervision, recognizes unexpected results, and take necessary corrective action.</li>\n<li>Provides technical and analytic interpretive skills for Medical Laboratory Science I and supports educational activities for the Medical Laboratory Scientist I and peers in these skills.</li>\n<li>Integrates and relates laboratory data generated by various sections in making judgments regarding possible discrepancies.</li>\n<li>Assists in the preparation and presentation of teaching materials for the Laboratory department 10. May be asked to assist with evaluation and/or development of new test procedures, monitors them for unexpected problems or sources of error.</li>\n<li>May be asked to assist in researching, reviewing and writing of technical procedures.</li>\n<li>Assists in orientation/training of new employees as directed.</li>\n<li>Obtains blood and body fluids from inpatients/outpatients of all ages as requested by authorized personnel.</li>\n<li>Demonstrates knowledge and theory behind instrumentation. Operates all instrumentation in assigned areas and performs technical procedures.</li>\n<li>Assures quality and timeliness of patient results, assists with investigation of any problems.</li>\n<li>Recognizes unexpected results, error and problems with patient tests.</li>\n<li>Maintains confidentiality of information regarding all patient testing/results as details in hospital policy.</li>\n<li>Conserves hospital resources by using equipment and supplies as needed to perform job duties.</li>\n<li>Assures compliance with all local, state, federal and national agencies.</li>\n<li>Contributes by promptly greeting patients and offering assistance.</li>\n<li>Reports to work on time and meets acceptable standards for attendance. Must be able to work assigned schedule including holidays and weekends.</li>\n<li>Performs other duties as assigned or requested.</li>\n</ul>"}