{"job title": "Senior Scientist", "company": "Aon", "city state": "– US-IL-Chicago", "rating": "3.4", "job description": "<div><div>\n<div>We have an exciting career opportunity for Senior Scientist with our Aon Impact Forecasting division. This role will sit in our corporate offices in Chicago, IL.\n<br><br>\n<strong>DUTIES AND RESPONSIBILITIES –</strong>\n<ul>\n<li>Actively participating in the development of peril models used for reinsurance.</li> <li>Development <strong>severity field/wildfire perimeter</strong> using boundary layer and terrain models and the corresponding forcing wind-field.</li> <li>Working to improve <strong>IF’s storm surge flood model</strong> for tropical cyclones.</li><li>The Catastrophe Modeling senior scientist will be actively collaborating with software development teams in all aspects of the model development and implementing the methodologies developed by the R&amp;D group at IF.</li> <li>Solid experience in writing codes for R&amp;D model development projects in languages such as FORTRAN and/or MATLAB, Python and/or C# and R. Being familiar with probability theory and use it in modeling.</li> <li>Provide critical analysis of modeling results for internal validation of models and explaining results to clients when needed.</li> \n</ul>\n<strong>MINIMUM SKILLS AND REQUIREMENTS –</strong>\n<ul>\n<li>At least 2 years’ direct experience in hurricane catastrophe modeling or Wildfire modeling following school.</li> <li>Graduate degree in a quantitative field such as engineering or meteorology.</li> <li>Exceptional analytical, technical and critical thinking skills.</li> <li>Strong verbal and written communication skills.</li> <li>Proven execution skills and ability to effectively manage multiple project/deliverables.</li> <li>Proven record of capability to work in a team effectively and respect team work environment.</li> \n</ul>\n<strong>MINIMUM EDUCATION -</strong> \n<br><br>\nPhD\n<br><br>\n<strong>We offer you</strong>\n<br><br>\nA competitive total rewards package, continuing education &amp; training, and tremendous potential with a growing worldwide organization.\n<br><br>\n<strong>Our Colleague Experience:</strong>\n<br><br>\nFrom helping clients gain access to capital after natural disasters, to creating access to health care and retirement for millions, Aon colleagues empower results for our clients, communities, and each other every day. They make a difference, work with the best, own their potential, and value one another. This is the Aon Colleague Experience, defining what it means to work at Aon and realizing our vision of empowering human and economic possibility. To learn more visit Aon Colleague Experience.\n<br><br>\n<strong>About Aon:</strong>\n<br><br>\nAon plc (NYSE:AON) is a leading global professional services firm providing a broad range of risk, retirement and health solutions. Our 50,000 colleagues in 120 countries empower results for clients by using proprietary data and analytics to deliver insights that reduce volatility and improve performance.\n<br><br>\nBy applying for a position with Aon, you understand that, should you be made an offer, it will be contingent on your undergoing and successfully completing a background check consistent with Aon's employment policies. Background checks may include some or all of the following based on the nature of the position: SSN/SIN validation, education verification, employment verification, and criminal check, search against global sanctions and government watch lists, fingerprint verification, credit check, and/or drug test. You will be notified during the hiring process which checks are required by the position.\n<br><br>\nAon provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, creed, sex, sexual orientation, gender identity, national origin, age, disability, veteran, marital, or domestic partner status. Aon is committed to a diverse workforce and is an affirmative action employer.\n<br><br>\nDISCLAIMER:\n<br>\nNothing in this job description restricts management's right to assign or reassign duties and responsibilities to this job at any time.</div>\n</div>\n</div>\n<br>"}