{"job title": "Senior Scientist", "company": "Bayside Solutions", "city state": "– San Jose, California", "rating": "3.6", "job description": "Bayside Solutions is seeking a<strong> Senior</strong> <strong>Scientist</strong> to be part of our client's team in the South Bay. This is an opportunity to work with the largest privately held pharmaceutical corporation in the world and ranks among the world's 20 leading pharmaceutical corporations.\n<br><br>\nOur Client's culture is highly collaborative, offers an environment that encourages employees to expand their knowledge in order to make a profound impact on patients' lives. This could explain why their company has been recognized as one of the \"Top Twenty Employers\" in biotechnology and pharmaceuticals by Science Careers.\n<br><br>\n<strong>Our Company Bio:</strong> Bayside Solutions was founded in 2001, Bayside was recognized as one of the fastest growing professional staffing companies in Northern California. The numbers tell the story: We have close to a 100% client retention rate, 700% growth in four plus years and over 95% repeat business. Our dedication to building partnership relationships with both our clients and our recruits is the key to our phenomenal success.\n<br><br>\nYou can find additional information on our company website at <strong>www.baysidesolutions.com</strong>.\n<br><br>\n<strong>Senior Scientist</strong>\n<br><br>\n<strong>Job Benefits:</strong>\n<ul>\n<li>An opportunity to join a patient-focused organization that is driven to develop, manufacture and commercialize medicines to treat life threatening conditions.</li><li>Work for a company that is local to the bay area and recognized as a leader of innovation.</li><li>Competitive compensation commensurate with experience.</li><li>This position is eligible for medical, vision, dental benefits, paid sick time, and 401K.</li>\n</ul>\n<strong>Summary of Responsibilities:</strong>\n<ul>\n<li>Works under minimal supervision, to conduct laboratory experiments utilizing established and published procedures with advanced technical and theoretical understanding.</li><li>Makes recommendations to resolve problems encountered during experimental procedures.</li><li>Assumes responsibility for the accuracy, quality, and timeliness of experimental results.</li><li>Summarizes experimental results, and reviews conclusions with supervisor/project leader.</li><li>Communicates results of experiments in the form of reports and presentations.</li><li>Keeps supervisor/project leader informed of project status, particularly of significant findings and results in critical problem areas.</li><li>Performs work according to established internal safety guidelines and procedures, and as specified by appropriate external regulatory agencies (e.g., OSHA).</li><li>Accurately and consistently records experimental methods, materials, and results.</li><li>Applies advanced technical writing skills to produce reports and documents such as summaries, SOPs, DHFs, presentations and manuscripts.</li><li>Participates in routine lab maintenance, lab safety, ISO, and QSR implementation.</li>\n</ul>\n<strong>Summary of Qualifications:</strong>\n<ul>\n<li>Bachelor's degree in Biological/Life Sciences, Chemistry, Biochemistry or related field, or equivalent combination of education and work-related experience.</li><li>Minimum of 7 - 10 years of relevant industry experience is required.</li><li>Ability to design and execute relevant laboratory experimentation and determine next steps within the context of overall project goals and direction.</li><li>Background and technique skills in biochemistry and molecular biology.</li><li>Hands-on experiences with PCR, and/or Microarray, and/or NGS technology.</li><li>Good understanding of bioinformatics and biostatistics.</li><li>Good data analysis skills and good documentation skills.</li>\n</ul>"}