{"job title": "Scientist", "company": "Corporate Management Group", "city state": "– Denver, CO", "rating": "1.6", "job description": "<div><strong>General Summary</strong>\n<br><br>\nCompletes projects that provide technical support for production operations and validation testing of production systems. Completes process validation, equipment/systems and utility qualification, and supports product development projects with minimal supervision as required.\n<br><br>\n<strong>Essential Duties</strong>\n<br><br>\nCompletes projects that provide general technical support for production operations and validation testing of production systems. Completes process validation, equipment/systems/utilities qualification, and supports product development projects with minimal supervision. Ability to operate in a dynamic environment with several projects and priorities.\n<br><br>\nDescription of Essential Duties\n<br><br>\n1. Write equipment qualification reports, process validation reports, technical reports, and validation master plans.\n<br><br>\n2. Perform monitoring, sampling, and testing to validate equipment, systems, and processes per\n<br><br>\nvalidation protocols. Assist in the generation of user requirements, functional specifications, and design specifications as required for equipment qualification projects.\n<br><br>\n3. Coordinates validation activities with other functional groups. Executes the strategies and testing required to validate equipment, systems, and processes per validation protocols.\n<br><br>\n4. Identify and execute activities for change control system.\n<br><br>\n5. Assist with laboratory or pilot scale batches and manufacture of production experimental scale batches.\n<br><br>\n8. Review and verify data generated in laboratory notebooks and technical documents.\n<br><br>\n9. Tabulate and perform statistical analysis of all study data. Present conclusions with clear, logical explanations and justifications via technical reports.\n<br><br>\n10. Provide technical consultation and support to both Technical Services and external departments as required.\n<br><br>\n<strong>Education: Bachelors</strong>\n<br><br>\nExperience Type: Bachelors degree in Pharmacy, Chemistry, Chemical Engineering, or related life science field with a minimum of 4 years experience product development/manufacturing, process/equipment engineering, or process validation in a regulated environment, including familiarity with equipment/process government regulations (e.g. camps, NDAs, ANDAs);\n<br><br>\nTravel Requirements: No Travel\n<br><br>\nPhysical Requirements: Sitting: 34 - 66% (Frequent). Standing (Moving About): 34 - 66% (Frequent). Listening: 34 - 66% (Frequent). Near acuity (vision): 34 - 66% (Frequent). Speaking: 34 - 66% (Frequent). Use of computer keyboard / mouse: 67 - 100% (Constant). Color determination: 1 - 33% (Occasional).\n<br><br>\n<strong>Mental and Motor Requirements</strong>\n<br><br>\nComputer Skills: 67 - 100% (Constant). Problem Solving: 34 - 66% (Frequent). Reading / Comprehension: 67 - 100% (Constant). Verbal communication: 34 - 66% (Frequent). Writing / Composition: 34 - 66% (Frequent). Attention to detail: 67 - 100% (Constant). Advanced math calculations: 34 - 66% (Frequent). Interaction with others using professionalism and tact: 34 - 66% (Frequent). Independent decision making: 34 - 66% (Frequent).</div>\n<br>"}