{"job title": "Associate Scientist", "company": "Danaher", "city state": "– Sunnyvale, CA", "rating": "3.3", "job description": "Job Description Job ID: CEP002096\n<br><br>\nAbout Us\n<br><br>\nAt Cepheid, we are passionate about improving healthcare through faster, more accurate diagnostic tests. With our GeneXpert® System, we've taken the most sophisticated molecular technology and packaged it into an automated, easy-to-use format that has quickly become the platform of choice worldwide. From the largest laboratories to small physician offices, our game-changing solution delivers critical answers when clinicians and patients need them most. Through strong molecular biology capabilities and ongoing product innovation, we are focused on developing tests for healthcare-associated infections, sexual health, critical infectious disease, virology, and oncology applications. Come join our vision for a better way and help make life better for us all! For more details, visit us at www.cepheid.com or follow us on Twitter (@CepheidNews).\n<br><br>\nDescription\n\n\n<ul>\n<li>This position is in the Biotechnology R&amp;D group and is primarily a bench level job focusing on real time PCR and RT-PCR assay and product development in an FDA-QSR and ISO9001 compliant organization. The candidate will plan and execute laboratory research, demonstrate appropriate technical proficiency, scientific creativity and collaboration with cross-functional departments. In addition to technical qualifications, the ideal candidate will be highly goal-oriented, organized and be able to thrive in an atmosphere of shifting demands and priorities. The candidate should possess excellent oral and written communication skills. The ability to work in a cross-functional team-based environment is a requirement.</li>\n</ul>\n\n<strong>ESSENTIAL JOB RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>Research and develop molecular diagnostic tests for infectious agents on the GeneXpert platform.</li>\n<li>Design and optimize oligo designs for infectious agents including virus, bacteria and parasites.</li>\n<li>Perform analytical studies required for design verification of complex assays prior to validation phase.</li>\n<li>Optimize sample preparation, real time PCR and RT-PCR assays based on design of experiments and design input requirements.</li>\n<li>Handle clinical samples and perform microbiology work of BSL-2 organisms, including various bacterial and viral strains.</li>\n<li>Help develop and write verification and validation SOPs and technical reports.</li>\n<li>Maintain detailed experimental records.</li>\n<li>Apply analytical problem solving skills to reagent and system integration issues to identify critical performance factors.</li>\n<li>Present data at weekly technical meetings.</li>\n<li>May contribute to scientific literatures and conferences.</li>\n<li>Allocate time and resources efficiently, effectively prioritize, and continually seek ways to meet individual, team and corporate goals.</li>\n</ul>\n\nJob Requirements\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n<strong>\n</strong><ul><strong>\n<li>MINIMUM REQUIREMENTS:</li>\n\n</strong>\n\n<li>US Citizen</li>\n</ul>\n\n<strong>Education or Experience (in years):</strong>\n\n\n<ul>\n<li>Minimum MS with 3+ years of experience in Molecular Biology (or related discipline), with at least 1-2 years of experience at a molecular diagnostics / pharmaceutical companies, public health laboratories or similar institutions.</li>\n</ul>\n\n<strong>Knowledge and skills:</strong>\n\n\n<ul>\n<li>Experience working with BSL-2 microorganisms involved in infectious diseases, tissue cell cultures, and molecular biology techniques including nucleic acid extraction, BLAST, and DNA sequencing.</li>\n<li>Experienced in BSL-2(+) viral culture and oligo design will be a plus.</li>\n<li>Experienced in elementary statistical programs and analyses including Excel, Minitab, or JMP.</li>\n<li>Experienced in RT-PCR product development and familiar with design of experiments methods are highly desirable.</li>\n<li>Experienced in interpreting and analyzing large scale experimental data as well as results from clinical trials.</li>\n<li>Strong problem-solving/troubleshooting skills that can translate to direct guidance of team members through complex issues.</li>\n<li>Proficient with standard Microsoft Office programs.</li>\n<li>Excellent writing, communication, and organizational skills.</li>\n<li>Ability to work in a Clean Room as well as a BSL-2(+) laboratory environment.</li>\n<li>Able to collaborate within departments and with outside collaborators.</li>\n</ul>\n\nDanaher Corporation Overview\n<br><br>\nDanaher is a global science&amp;technology innovator committed to helping our customers solve complex challenges and improve quality of life worldwide. Our world class brands are leaders in some of the most demanding and attractive industries, including life sciences, medical diagnostics, dental, environmental and applied solutions. Our globally diverse team of 67,000 associates is united by a common culture and operating system, the Danaher Business System, which serves as our competitive advantage. We generated $18.3B in revenue last year. We are ranked #162 on the Fortune 500 and our stock has outperformed the S&amp;P 500 by more than 1,200% over 20 years.\n<br><br>\nAt Danaher, you can build a career in a way no other company can duplicate. Our brands allow us to offer dynamic careers across multiple industries. We're innovative, fast-paced, results-oriented, and we win. We need talented people to keep winning. Here you'll learn how DBS is used to shape strategy, focus execution, align our people, and create value for customers and shareholders. Come join our winning team."}