{"job title": "Scientist II", "company": "DRS Technologies", "city state": "– Dallas, TX", "rating": "3.6", "job description": "<strong>LEONARDO DRS</strong>\n<br><br>\nLEONARDO DRS is a leading supplier of integrated products, services and support to military forces, intelligence agencies and prime contractors worldwide. Focused on defense technology, we develop, manufacture and support a broad range of systems for mission critical and military sustainment requirements, as well as homeland security.\n<br><br>\nHeadquartered in Washington, DC, the Company is a wholly owned subsidiary of Leonardo S.p.A. which employs more than 70,000 people worldwide. We offer a competitive compensation package and a business culture that rewards performance. For additional information on DRS, please visit our website at www.leonardodrs.com.\n<br><br>\n<strong>Company Overview</strong>\n<br><br>\nLEONARDO DRS Electro Optical Infrared Systems (EOIS) has locations in Dallas, TX, Melbourne, FL, and Cypress, CA. We develop, manufacture, and support infrared and electro-optical solutions for soldiers, ground vehicles and airborne platforms. We offer an exciting and challenging work environment, a competitive salary and benefits package, and a business culture that rewards performance.\n<br><br>\nEmploying the worlds brightest. Supporting the worlds bravest.\n<br><br>\n<strong>Location</strong>\n<br><br>\nDallas, TX\n<br><br>\n<strong>Position Summary</strong>\n<br><br>\nLeonardo DRS Electro-Optical &amp; Infrared Systems (EOIS), an industry leader in the design and manufacture of advanced infrared imaging components and systems, is looking for a highly motivated individual to join our Uncooled Development team. The engineer/scientist will be an integral part of new product development in advanced uncooled infrared sensors. This person will interface and work closely with other team members representing a wide range of disciplines and subject matter experts, including device physics, material science, read-out integrated circuits, device characterization, electro-optical test engineering, electronics, and infrared imaging system design. The candidate will be involved in the development of new uncooled infrared focal plane arrays. Duties will include integrated-circuit CAD, analytical and finite-element modeling. Duties will also include data analysis, report generation, and oral presentations.\n<br><br>\n<strong>Basic Qualifications and Required Skills</strong>\n<ul>\n<li>Education: PhD in physics, related sciences or engineering is preferred</li>\n<li>Experience: 2 5 years experience with uncooled micro bolometer-based infrared focal plane arrays</li>\n<li>Deep understanding of the physics of uncooled micro-bolometers and/or MEMS</li>\n<li>Understanding of imaging systems and optics</li>\n<li>Experience with Microsoft Office tools including Word, Excel, PowerPoint</li>\n<li>Experience with data analysis using MATLAB or similar programing environment</li>\n<li>US citizenship is required</li>\n</ul>\n<strong>Desired Skills</strong>\n<ul>\n<li>In-depth understanding of microbolometers, microbolometer materials, and MEMS fabrication</li>\n<li>Working knowledge of Readout Integrated Circuits for focal plane arrays</li>\n<li>Programming with Python, C++, MATLAB, or other.</li>\n<li>Motivated overachiever with one or more proven episodes of genius</li>\n</ul>\n<strong>Duties and Responsibilities</strong>\n<ul>\n<li>Imaging sensor data collection and analysis</li>\n<li>Report generation</li>\n<li>Verbal presentation and reporting</li>\n<li>Other duties as assigned</li>\n</ul>\n<strong>Working Conditions</strong>\n<ul>\n<li>Travel, up to 5% per year</li>\n</ul>\nOnly candidates that meet the qualifications as outlined above will be contacted for further information.\n<br>\nApplicants selected for this position will be subject to a government security investigation and must meet eligibility requirements for access to classified information. <strong>Only US citizens are eligible for a Security Clearance.</strong>\n<br><br>\nLEONARDO DRS is an equal opportunity/affirmative action employer. We consider applicants without regard to race, color, religion, creed, gender, national origin, age, disability, genetic information, marital or veteran status, or any other category protected by federal, state or local law. #EOIS"}