{"job title": "Glass Scientist", "company": "EnergeiaWorks", "city state": "– Philadelphia, PA", "rating": "5.0", "job description": "<div>The Glass Scientist will modify existing products and to initiate, plan, design, develop and introduce new products to market by formulating and developing material solutions with the understanding of the materials science and physics used in the development of finished products.</div>\n\n<div><br>\n<strong>Duties and Responsibilities</strong></div>\n\n<ul>\n<li>Solve complex technical problems, apply technology and new ways, develop and recommend new alternatives by utilizing expertise to accelerate development of new products</li>\n<li>Independently plan, direct, and conduct experiments and other research activities supporting the design of new products to customer or industry specifications or the modification of existing products for new applications</li>\n<li>Act as a leader and mentor to engineers and/or technicians conducting research activities under his or her guidanceFunction as a resource to sales, marketing, technical service, and manufacturing<br>\nAnalyze/identify/solve problems or customer complaints regarding existing products and originate formula or process changes for new applications</li>\n<li>Engage internal and external raw material and equipment suppliers </li>\n<li>Remain abreast of technical developments in the field; obtain information through literature and patents</li>\n<li>Attend technical conferences, trade shows, and educational courses to remain current in the field as it relates to existing and future technologies; ability to present at same</li>\n<li>Author technical reports, technical papers, patent applications, project updates, and technical overviews as required</li>\n<li>Record precise results and findings in laboratory book, database and/or files</li>\n<li>Review and provide updates to product data sheets and technical data packages</li>\n<li>Follow safety guidelines for handling materials with the use of protective equipment as required</li>\n<li>Maintain organization and cleanliness of work area, laboratory instruments and equipment</li>\n<li>Handle confidential information with care</li>\n<li>Provide leadership, supervision and training as assigned</li>\n</ul>\n\n<div><strong>Education and/or Experience</strong></div>\n\n<ul>\n<li>Masters Degree in Materials Science or related field and a minimum of four to six years of laboratory experience are required. A PhD is preferred and may have less experience.</li>\n<li>Four (4) years of specialized experience should be in one or more of the following areas: Si based PV processing, glass science, organic/inorganic chemistry or related field.</li>\n<li>Knowledge and formulation experience of thick film paste/ink is required. </li>\n<li>Self-starter with an attention to detail required.</li>\n<li>Demonstrate a high level of professionalism and leadership ability; exhibit a high level of motivation and initiative. </li>\n<li>Demonstrate a track record of successful product developments or fundamental breakthroughs. </li>\n</ul>\n\n<div> </div>\n\n "}