{"job title": "Formulation Scientist", "company": "GlaxoSmithKline", "city state": "– Collegeville, PA", "rating": "3.7", "job description": "<strong>Your Responsibilities:</strong>\n<br><br>\n<strong>Key Responsibilities:</strong>\n\n\n<ul>\n<li>Member of a team responsible for enabling the progression of NCE's from candidate selection to product commercialization.</li>\n<li>Member of matrix teams supporting product development.</li>\n<li>Progress drug product design&amp;development aspects of projects, utilizing experience and expertise as part of a Product Development&amp;Supply technical matrix team and wider matrix teams.</li>\n<li>Exercise professional judgment to determine the most appropriate course of action for a project.</li>\n<li>Contributes to Drug Product Design&amp;Development strategies.</li>\n<li>Develop phase appropriate formulations to support clinical studies and ultimately commercialization.</li>\n<li>Develop and optimize processes for the manufacture of drug products and participate in manufacturing of clinical supplies.</li>\n<li>Design and execute DOE, scale up studies, and participate in technology transfer.</li>\n<li>Prepare development reports and participate in preparing regulatory documents.</li>\n<li>Propose and deliver innovative approaches to achieve project goals.</li>\n<li>Provide correct interpretation of results and perform complex data management and analysis.</li>\n</ul>\n\n<strong>Why You?Basic qualifications:</strong>\n\n\n<ul>\n<li>PhD or MS in Pharmaceutics, Chemical Engineering, or other related fields</li>\n<li>2 years of industrial experience in pharmaceutical development.</li>\n</ul>\n\n<strong>Preferred qualifications:</strong>\n\n\n<ul>\n<li>Experience in formulation and process development of small molecules, particularly novel complex injectable products, e.g. long acting injectables, liposomes, etc.</li>\n<li>Experience in developing phase appropriate formulations and manufacturing processes for small molecules.</li>\n<li>Good understanding of physico-chemical properties and biopharmaceutics is desired.</li>\n<li>Expertise in sterilization techniques is preferred.</li>\n<li>Experience in working within a product development matrix team.</li>\n<li>Demonstrates networking skills through interactions across departments, divisions, and disciplines</li>\n<li>Familiar with cGMP and regulatory requirements for manufacturing operations and documentation.</li>\n<li>Good oral and written communication skills.</li>\n</ul>\n\n<strong>Why GSK?:</strong>\n<br><br>\nAt GSK, our mission is to improve the quality of human life by enabling people to do more, feel better and live longer. Our three world-leading businesses research and deliver innovative medicines, vaccines and consumer healthcare products. We need a talented and motivated workforce to deliver against our strategy. To achieve this, we strive to attract the best people and to create an environment that empowers and inspires.\n<br><br>\n<strong>Contact information:</strong>\n<br><br>\nYou may apply for this position online by selecting the Apply now button.\n<br><br>\nIf you require an accommodation or other assistance to apply for a job at GSK, please contact the GSK HR Service Centre at 1-877-694-7547 (US Toll Free) or +1 801 567 5155 (outside US).GSK is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive equal consideration for employment without regard to race, color, national origin, religion, sex, pregnancy, marital status, sexual orientation, gender identity/expression, age, disability, genetic information, military service, covered/protected veteran status or any other federal, state or local protected class.\n<br><br>\nImportant notice to Employment businesses/ Agencies\n<br><br>\nGSK does not accept referrals from employment businesses and/or employment agencies in respect of the vacancies posted on this site. All employment businesses/agencies are required to contact GSK's commercial and general procurement/human resources department to obtain prior written authorization before referring any candidates to GSK. The obtaining of prior written authorization is a condition precedent to any agreement (verbal or written) between the employment business/ agency and GSK. In the absence of such written authorization being obtained any actions undertaken by the employment business/agency shall be deemed to have been performed without the consent or contractual agreement of GSK. GSK shall therefore not be liable for any fees arising from such actions or any fees arising from any referrals by employment businesses/agencies in respect of the vacancies posted on this site.\n<br><br>\nPlease note that if you are a US Licensed Healthcare Professional or Healthcare Professional as defined by the laws of the state issuing your license, GSK may be required to capture and report expenses GSK incurs, on your behalf, in the event you are afforded an interview for employment. This capture of applicable transfers of value is necessary to ensure GSK's compliance to all federal and state US Transparency requirements. For more information, please visit GSK's Transparency Reporting For the Record site."}