{"job title": "Lead Scientist, Plant Environment", "company": "Indigo", "city state": "– Boston, MA", "rating": "4.7", "job description": "Indigo is a company dedicated to harnessing nature to help farmers sustainably feed the planet. With a vision of creating a world where farming is an economically desirable and accessible profession, Indigo works alongside its growers to apply natural approaches, conserve resources for future generations, and grow healthy food for all. Utilizing beneficial plant microbes to improve crop health and productivity, Indigos portfolio is focused on cotton, wheat, barley, corn, soybeans, and rice. The company, founded by Flagship Pioneering, is headquartered in Boston, MA, with additional offices in Memphis, TN, Research Triangle Park, NC, Sydney, Australia, Buenos Aires, Argentina, and São Paulo, Brazil. www.indigoag.com\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n<li>Understand the impact of microbial treatments on agronomic traits</li>\n<li>Understand soil microbiology in context of plant-microbe interaction</li>\n<li>Understand how RSI interacts with pipeline traits</li>\n<li>Understand core focus of research team</li>\n<li>Review current types of data collected and propose how to use for analysis</li>\n<li>Review standard processes in literature and develop proposal for our pipeline</li>\n<li>Review current projects and pipelines and provide a proposal for path forward\n\n\n<ul>\n<li>Identify and propose plant-based stress screening assays</li>\n</ul>\n\n</li>\n<li>Develop research plan, team goals, and individual development plans for Environment Team\n\n\n<ul>\n<li>Understand and articulate environment team goals</li>\n<li>Develop long range goals for team and team members</li>\n<li>Develop one-year research plan for team</li>\n</ul>\n\n</li>\n</ul>\n<strong>Competencies:</strong>\n\n<ul>\n<li>Team player; works well with others</li>\n<li>Flexible; able to adapt to changing needs</li>\n<li>Works well under pressure and with multiple deadlines</li>\n<li>Able to handle multiple projects at the same time</li>\n<li>Strategic; able to develop team goals and plans</li>\n<li>Excellent communication skills</li>\n<li>Enjoys mentoring and managing others</li>\n<li>Analytical; strong command of relevant tools</li>\n<li>Excels in cross-functional environment</li>\n<li>Understands, embodies, and is excited by Indigos mission and core values</li>\n</ul>\n<strong>Qualifications:</strong>\n\n<ul>\n<li>PhD in Plant Biology, Plant Science, or related field Population Genetics\n\n\n<ul>\n<li>Strong understanding of plant physiology, plant breeding, and population genetics</li>\n<li>Experience working with microbes preferred</li>\n<li>Understanding of plant-microbe interaction at biochemical, molecular and genetics levels</li>\n</ul>\n\n</li>\n<li>2+ years industry experience</li>\n<li>Experience using R, Python, Spotfire, etc. to analyze large data sets\n\n\n<ul>\n<li>Experience analyzing/generating plant genome/metatranscriptome data sets</li>\n</ul>\n\n</li>\n<li>Experience designing field based experiments (out of greenhouse) and evaluating field data</li>\n<li>Experience leading, mentoring, and managing junior staff and scientists</li>\n<li>Experience with SNP pipelines and SNP design experience</li>\n<li>Strong publication record (particularly relating to population genetics)</li>\n</ul>"}