{"job title": "Senior Bioscientist - Diagnostics Scientist", "company": "ProClinical", "city state": "– Geneva", "rating": "4.6", "job description": "A well-known global pharmaceutical company with leading products across various therapeutic areas is looking to hire a Senior Bio scientist. This vacancy is an exciting opportunity to work at a top global pharmaceutical company that has a workforce of more than 6,700 employees across multiple sites in the UK.\n<br><br>\nPrecision Medicine and Genomics (PMG) focuses on matching medicines to those patients who will benefit from them most and delivers tissue-based companion or complimentary diagnostic assays that align with the drug development process and enhance personalised healthcare approaches in our drug portfolio.\n<br><br>\nJob Responsibilties:\n<ul>\n<li>Manage relationships with global testing facilities to implement new diagnostic assays for clinical trials.</li><li>Managing projects across internal and external partners in a global multi-disciplinary environment with the application of scientific, technical and operational expertise</li><li>Monitor diagnostic test data from the labs and quality control for the delivery to clinical studies</li><li>Deliver work packages, including submission to regulatory authorities, to enable diagnostic approval in-line with approval of targeted therapeutic</li><li>Ensure that all activities are delivered demonstrating behaviours and values aligned to our Code of Conduct and supporting policies, standards and procedures, including compliant management of Budget, Safety, Health and Environment</li><li>Transfer the diagnostic assay in laboratory testing networks to enable its delivery within a clinical study setting.</li><li>Preparation and review of documentation</li><li>Project management; data monitoring, management and quality control for ongoing clinical studies</li><li>Technical troubleshooting of the diagnostic assay</li><li>Preparation of study reports and their presentation at study team meetings</li><li>Work within both study and diagnostic teams to deliver data suitable for submission to regulatory authorities</li>\n</ul>\nSkills and Requirements:\n<ul>\n<li>Operational experience of clinical trial set up, documentation and monitoring</li><li>At least a BSc or equivalent in a biological science-based subject</li><li>Excellent organisational skills, with the proven ability to deliver high quality work on time in full</li><li>Ability to communicate with stakeholders for study updates, testing progress through oral presentations and progress reports</li><li>Ability to collaborate with and influence internal and external partners</li><li>Willingness to travel both nationally and internationally.</li><li>Experience of working with, or in a Clinical Research Organisations</li><li>Experience of drug discovery and development</li><li>Knowledge of clinical testing procedures and applicable laboratory testing regulations such as GCP, CLIA</li><li>Knowledge of tissue-based biomarker assays, such as immunohistochemistry (IHC) and/or in situ hybridisation (ISH), including troubleshooting and QC</li><li>Data management and statistical analysis (experience in one of the following: R, SPSS, SAS, Minitab)</li><li>Knowledge of Spotfire, Matlab.</li><li>An understanding of drug and companion diagnostic assay co-development and commercialisation</li><li>We would also like to hear from those with strong clinical trial experience and strategic understanding of tissue diagnostics</li> \n</ul>\nTo Apply:\n<br><br>\nPlease click on the Apply button. Please include a short note outlining why you are interested in the role and why you think you are suitable.\n<br>\nIn case you have difficulty in applying or if you have any questions, please call Weronika Ficek on +44 203 0789 550 or upload your CV on our website - www.proclinical.com.\n<br>\nA full job description is available on request.\n<br>\nProClinical is a specialist employment agency and recruitment business, providing job opportunities within major pharmaceutical, biopharmaceutical, biotechnology and medical device companies."}