{"job title": "Principal Medical Scientist", "company": "ProClinical", "city state": "– Foster City, California", "rating": "4.6", "job description": "At ProClinical, we are seeking an experienced individual to fill the role of Principal Medical Scientist, based in Boston, MA. The successful individual will be responsible for broad accountabilities, centering around the medical and scientific support for the development and maintenance of clinical trial strategy, review of clinical trial proposals and external relationship management.\n<br><br>\nResponsibilities\n<ul>\n<li>Lead the generation of external clinical development strategy for a program.</li><li>Lead clinical proposal reviews, and scientific discussions with external Investigators.</li><li>Represent the project internally and support oncology drug development externally as a medical scientific expert.</li><li>Liaise with scientists to provide clinical input to the development of the line of sight.</li><li>Ensure and champion consistent medical &amp; scientific aspects of the clinical study plans across the program.</li><li>Provide medical scientific leadership to data and safety reviews ensuring consistency throughout the process.</li><li>Provide medical science support to specific studies when requested by the physician as appropriate</li><li>Communicates information to multiple teams in various areas of the drug development process, ensuring all involved parties are aware of important developments.</li><li>Guide aspects of the Clinical Development Plan (CDP) and Clinical Study Protocols in keeping with the approved CDP and ensuring linkage of trial data to target product claims/profile.</li><li>Input medical scientific information to internal documentation such as risk management plans, Investigator Brochures and strategic planning documents.</li><li>Write and review content and quality of publications and input to development of publication strategy.</li><li>Understand early phase clinical trials.</li>\n</ul>\nSkills And Qualifications\n<ul>\n<li>Relevant Pharmacy, Nursing, MS or PhD and significant clinical drug development or medical affairs experience.</li>\n</ul>\nTo Apply:\n<br><br>\nPlease click on the Apply button. Please include a short note outlining why you are interested in the role and why you think you are suitable.\n<br><br>\nIn case you have difficulty in applying or if you have any questions, please call Miles Tobin at (+1) 6175455922 or upload your resume on our website - www.proclinical.com.\n<br><br>\nA full job description is available on request.\n<br><br>\nProClinical is a specialist employment agency and recruitment business, providing job opportunities within major pharmaceutical, biopharmaceutical, biotechnology and medical device companies."}