{"job title": "Associate Scientist - Physical Chemistry", "company": "ProClinical", "city state": "– Cambridge, Massachusetts", "rating": "4.6", "job description": "This job Associate Scientist - Physical Chemistry is an exciting opportunity to join one of the top 10 global pharmaceutical companies. This leading Swiss pharmaceutical company are currently looking to hire a Associate Scientist - Physical Chemistry to be based at their site in Basel. The company employ over 100,000 professionals and have operations in more than 140 countries worldwide.\n<br><br>\nAs part of a physical-chemical-analytical group within biologics technical development, you will be responsible for the analysis and characterization of biopharmaceuticals in early phase clinical development with focus on method development.\n<br><br>\nBesides routine analyses your main task will be the development of chromatographic or electrophoretic analytical methods. This involves independently planning, performing and evaluation of analyses. You will also oversee the technical organization of an analytical lab and reporting to the laboratory head.\n<br><br>\nYou have experience in protein analytics and in instrumental analytics (e.g. chromatography, electrophoresis, or spectroscopy). Applicants should have good organizational and team skills, and good knowledge of English\n<br><br>\nPerform scientific experiments or pilot plant processes for the preparation and timely delivery of drug substances (DS), drug products (DP), processes and procedures in collaboration with a multifunctional project team coordinated by Project Leader.\n<br><br>\nJob Responsibilties:\n<ul>\n<li>Meet quality, quantity and timelines in all assigned projects.</li> <li>Design perform and document scientific experiments/plant activities in collaboration with experienced team members if necessary. Seeks proactively for support and coaching from Project Leader or Scientific Expert/or other team members during the whole process if necessary.</li> <li>Provide documentation of raw data, evaluation and contribute to interpretation of results. Provide input for the selection of next experiments.</li> <li>Optimize existing methods (lab or plant) or contribute to new method development and reproduce published methods.</li> <li>Actively support the transfer of analytical or manufacturing procedures to pilot plant or production, including process steering controls etc.</li> <li>Provide raw data documentation, evaluation and results interpretation. Propose and provide input for the design of next experiments.</li> <li>Communicate and address problems, perform safety and literature searches under guidance from more experienced team members.</li> <li>Address simple problems. Recognize and communicate complex problems within he project team or network if necessary together with the respective Project Leader, Network leader or Senior Scientific Expert or a relevant team member.</li> <li>Actively perform simple safety and literature searches under direction of relevant and experienced team members.</li> <li>Keep record of chemicals, intermediates, excipients and solvents within own area of responsibility.</li> <li>Collaborate with other team members to facilitate deliveries of DS and/or DP.</li> <li>Schedule and perform routine maintenance of lab instruments/equipment.</li> <li>Contribute to lab procedures, reports and/or instructions and/or SOP's.</li> <li>Contribute to the evaluation of new lab equipment.</li> <li>Actively participate in project teams/meetings/networks.</li> <li>Actively contributes to team goals.</li> <li>Ensure all own activities are aligned with overall drug development process.</li> <li>Work according to appropriate SOPs, GMP, GLP, QM, HSE, ISEC &amp; company Guidelines.</li> <li>Strategic and scientific contribution to Networks, target achievements according to network charter and annual objectives Language Position Purpose</li> <li>Major Accountabilities Key Performance Indicators</li> \n</ul>\nSkills and Requirements:\n<ul>\n<li>Technician with continuing education (EU) or BS (US) or equivalent</li> <li>Minimum of 3 years' experience as Technician (promotional pathway) or 0-4 years (for BS) or 0-2 years (for MS).</li><li>Awareness for safe handling of chemicals, potentially dangerous materials and equipment. Adequate scientific or technical knowledge in a specific area (e.g. synthetic, analytical, galenical).</li><li>Basic knowledge in scientific/technical areas of collaboration.</li><li>Good knowledge of laboratory and/or technical tools.</li><li>Adequate knowledge of software and computer tools. Basic presentation skills.</li> <li>Adequate knowledge of English (oral and written).</li>\n</ul>\nTo Apply:\n<br><br>\nPlease click on the Apply button. Please include a short note outlining why you are interested in the role and why you think you are suitable.\n<br>\nIn case you have difficulty in applying or if you have any questions, please call Weronika Ficek on +44 203 0789 550 or upload your CV on our website - www.proclinical.com.\n<br>\nA full job description is available on request.\n<br>\nProClinical is a specialist employment agency and recruitment business, providing job opportunities within major pharmaceutical, biopharmaceutical, biotechnology and medical device companies."}