{"job title": "Senior Staff Scientist II", "company": "ProClinical", "city state": "– Plainsboro, New Jersey", "rating": "4.6", "job description": "At ProClinical, we are seeking a skilled individual to fill the role of Senior Staff Scientist II, based in Plainsboro, NJ.\n<br><br>\nResponsibilities\n<ul>\n<li>Design, plan and carry out experiments and associated research assignments.</li><li>Devise procedures or studies to search out causes and remedies for problems.</li><li>Perform and/or oversee work to attain objectives.</li><li>Operate and/or oversee the operation of equipment to acquire experimental data.</li><li>Assume responsibility for assigned projects.</li><li>Prepare reports covering work objectives, methods and results.</li><li>May act as a project coordinator.</li><li>Promote implementation and compliance with XBL safety policies, practices, and procedures to maintain a safe work environment and minimize or eliminate injury.</li><li>Maintain and enhances technical expertise, knowledge, in the Bioanalytical area which include up-to-date-technology in method development and sample analysis for parent drugs and its metabolites in various biological matrices.</li><li>Prepare scientific presentation in-house and in scientific meetings.</li><li>Thorough understanding of Protocol Design (Pre-clinical and Clinical Studies).</li><li>Identify safety hazards and initiate corrective action. Assist in the safety training for subordinates and/or less experienced staff.</li>\n</ul>\nSkills And Qualifications\n<ul>\n<li>BA or MS in a related discipline and 7-10 years of relevant experience.</li><li>Knowledge of Laboratory Information Management System (LIMS)</li><li>Knowledge of Data Acquisitions and Operating Software as Analyst, MassLynx.</li><li>Up-to-date knowledge of Bioanalytical techniques in method development and sample analysis of analyte and its metabolites in biological matrices.</li><li>Familiarity with and adherence to regulatory guidelines consistent with XBL requirements</li><li>Effective written, verbal, and interpersonal communication skills.</li><li>General computer savvy, as well as knowledge of Microsoft Office suite.</li>\n</ul>\nTo Apply:\n<br><br>\nPlease click on the Apply button. Please include a short note outlining why you are interested in the role and why you think you are suitable.\n<br><br>\nIn case you have difficulty in applying or if you have any questions, please call Mike Raletz at (+1) 2674287770 or upload your resume on our website - www.proclinical.com.\n<br><br>\nA full job description is available on request.\n<br><br>\nProClinical is a specialist employment agency and recruitment business, providing job opportunities within major pharmaceutical, biopharmaceutical, biotechnology and medical device companies."}