{"job title": "Bioinformatics Research Scientist - Geeleher Lab", "company": "St. Jude Children's Research Hospital", "city state": "– Memphis, TN", "rating": "4.7", "job description": "Overview<br>\n\n<div>\n<div>The Geeleher Lab is seeking a Bioinformatics Research Scientist (to start in February 2019) to work on exciting projects related to cancer genomics, pharmacogenomics, and drug repurposing in the St. Jude Department of Computational Biology. One of the premier pediatric research institutions in the world, St. Jude Childrens Research Hospital provides exceptional resources, a collaborative environment, and access to extensive, unique cancer genomics datasets from large-scale research initiatives.</div>\n</div>\n\n<br><strong>Responsibilities</strong><br>\n\n<div>\n<div>In this role, you will have the opportunity to develop and apply innovative analytical and statistical approaches for studying genetic variation and its relationship to cancer development and chemotherapeutic response. You will also contribute ideas to develop and improve analyses and methods, work with postdoctoral fellows on cutting-edge research, participate in collaborative projects, assist in preparing manuscripts and grants, and assist with establishing protocols and pipelines. Depending on your interests and goals, you may also lead and publish your own projects.\n<br><br>\nThe Geeleher Lab is recognized for developing innovative computational approaches and has led drug re-purposing efforts, spearheaded publications in Nature, Genome Research, Genome Biology, Journal of the National Cancer Institute (JNCI) and Bioinformatics in the last five years, and is funded by the NIH. St. Jude offers an exceptional research environment, including state-of-the-art high-performance computing facilities, robust analytical pipelines, the latest wet-lab technology, access to outstanding core facilities and scientific expertise in genomics, cancer biology, statistics, and computer science. The Department of Computational Biology is highly interactive with collaborative opportunities across basic and clinical departments and mentorship from faculty-level scientists with deep experience in data analysis, data management and delivery of high-quality results for highly competitive projects. More information is available at geeleherlab.org.\n<br><br>\nLearn more about bioinformatics careers at St. Jude.\n<br><br>\n<strong>Benefits</strong>\n<br><br>\nSalary is highly competitive (comparable to industry) and employee benefits are outstanding. Relocation assistance is available. Working at St. Jude provides the opportunity to make a tangible difference to pediatric cancer patient care and survival and St. Jude has been consistently ranked in Fortune magazines 100 Best Places to Work list and is exceptionally positively reviewed on GlassDoor.</div>\n</div>\n\n<br>Minimum Education<br>\n\n<div>\n<div>A Ph.D. in Computational Biology, Bioinformatics, Computer Science, Statistics, Mathematics, Molecular Biology, Biochemistry or a related field is required. Postdoctoral experience is an advantage.</div>\n</div>\n\n<br>Minimum Experience<br>\n\n<div>\n<div>PhD in Molecular Biology, Biochemistry, Computer Science, Statistics, Mathematics, Bioinformatics or related field required. Prior experience must include research related to bioinformatics (such as analysis of DNA and RNA sequence data, microarray, SNPs, imaging data, proteomics data, or biological pathways; development of algorithms, statistical methods, or scientific software).\n<br><br>\nOR\n<br><br>\nIf PhD training did not include bioinformatics research, then two years of pre-doctoroal or postdoctoral research experience in Computational Biology or Bioinformatics research is required.\n<br><br>\nExperience with programming languages such as Perl, C, or Java is required, while experience with R or Python is highly desired. Experience with C, C++ or Java is desirable. A strong knowledge of applied statistics and machine learning is highly desirable. Experience working in pediatric cancer is an advantage but not necessary. Fluency in English is essential.\n<br><br>\n<strong>Memphis - A Great Place to Live &amp; Work</strong>\n<br><br>\nSt. Jude is based in Memphis, TN with relocation assistance available. Memphis is a family-friendly metropolitan area that more than one million people call home. Memphis is recognized for its world-class music, food, and hospitality. Cost of living is one of the biggest attractions.</div>\n</div>\n\n<br>EEO Statement<br>\n\n<div>\n<div>St. Jude is an Equal Opportunity Employer<br><br>No Search Firms:<br><br>St. Jude Children's Research Hospital does not accept unsolicited assistance from search firms for employment opportunities. Please do not call or email. All resumes submitted by search firms to any employee or other representative at St. Jude via email, the internet or in any form and/or method without a valid written search agreement in place and approved by HR will result in no fee being paid in the event the candidate is hired by St. Jude.</div>\n</div><br>\n\n<div>\n<div>\nWe're breaking new ground at St. Jude. Stay up-to-date on our latest news and career opportunities in the areas you're most interested in by becoming a St. Jude Careers Insider.\n<br><br>\nSearch all St. Jude Jobs, including postdoctoral research fellowships, clinical fellowships and faculty appointments.</div>\n</div>\n<br>"}