{"job title": "Information Scientist II", "company": "TalentBurst", "city state": "– Mcpherson, KS", "rating": "3.5", "job description": "Job Description: THIS POSITION IS FOR A LIMS MASTER DATA TEMPLATE BUILDER/TESTER:\n\n\n<ul>\n<li>Build and Provide Source Documents to LIMS Object Builders</li>\n<li>Review and Approve DEV Builds</li>\n<li>Executes Verification (User Acceptance Testing(UAT) / Verification Testing(VT)) Testing; Log Defects</li>\n<li>Approves VT/UAT results</li>\n<li>Escalates any potential issues or risks to Site and Core Team</li>\n<li>Participate in the Global Workshops and Site Business Processes</li>\n<li>Participate in Group Huddle Meetings.</li>\n<li>Participate is any trainings identified by Site Team.</li>\n<li>Document any site business process requirements via gap enhancement processes.</li>\n<li>Create required business process documentation.</li>\n<li>Participate in site validation testing and documentation.</li>\n<li>Support and actively participate in instrument integration planning and execution activities.</li>\n<li>Translation and modification of training material, SOPs as necessary.</li>\n</ul>\n\nPosition Comments visible to MSP and Supplier:\n<br><br>\n<strong>Company Description:</strong>\n<br><br>\nTalentBurst is an award winning IT, Accounting &amp; Finance staffing firm headquartered in Boston with offices in San Francisco, Miami, Milwaukee, Toronto, Bangalore, and Gurgaon. Our clients include the leading social media, technology, banks, utilities, pharmaceutical, and biotech companies.\n<br><br>\nWe work with 75 of the Fortune 500 companies. Our recruiting team is one of the most successful in the industry and has a strong reputation for treating our employees well and helping you find your next dream project.\n<br><br>\n<strong>Benefits</strong>\n<br><br>\nAt TalentBurst, one of our founding principles has been to provide our employees with the best benefits available. Benefits we have available include:\n\n\n<ul>\n<li>Health, Dental, and Vision Plan</li>\n<li>401(k) Plan</li>\n<li>Life Insurance</li>\n<li>Immigration assistance</li>\n<li>Credit Union Membership</li>\n<li>Direct Deposit</li>\n<li>Vacation pay (only for FTEs)</li>\n</ul>"}