{"job title": "Computer Scientist - Artificial Intelligence", "company": "University of Southern California", "city state": "– Marina Del Rey, CA", "rating": "4.3", "job description": "The Information Sciences Institute (ISI) is home to over 100 researchers in artificial intelligence who carry out world-class research in a collaborative, academic environment. ISI is part of the University of Southern California (USC) and a sister to USC’s Computer Science Department, Electrical Engineering Department, and others in the Viterbi School of Engineering.\n<br><br>\nISI scientists have the opportunity to spend the majority of their time doing the research they love. Projects are critically accelerated by research programmers and students at all levels, and USC/ISI operates one of the world’s largest academic high-performance computing clusters. ISI has three research campuses: one in Marina del Rey, CA, one in Arlington, VA, and one in Waltham, MA.\n<br><br>\n<strong>This position is located in Marina del Rey, CA</strong>\n<br><br>\nThe successful computer scientist candidate will be capable of generating research ideas and solutions to complex computer science problems, providing research support on problems of diverse scope, and executing research projects in collaboration with others. Applies computer science and other scientific principles and concepts in planning, coordinating and executing research objectives. Contributes to state-of-the-art technology and theories. Solves a wide range of research problems. Creates or modifies methods and techniques for obtaining solutions. Writes articles for publication. Interacts with peers. Makes presentations at conferences, and participates in workshops and collaborates in specific areas of research.\n<br><br>\nISI welcomes applications from computer scientists in any of the following areas:\n<br><br>\n• Information Extraction\n<br><br>\n• Semantic Web\n<br><br>\n• Biomedical data integration and knowledge engineering\n<br><br>\n• Intersection of Neuroscience and Computing\n<br><br>\n• Information Integration\n<br><br>\n• Interactive Knowledge Capture\n<br><br>\n• Semantic eScience\n<br><br>\n• Machine Translation\n<br><br>\n• Natural Language Processing\n<br><br>\n• Robotics\n<br><br>\n• Social networks and Social Media Analytics\n<br><br>\n• Machine learning\n<br><br>\n• Data Science\n<br><br>\nThe University of Southern California values diversity, and is committed to equal opportunity in employment.<br><br>Minimum Education: Master's degree, Combined experience/education as substitute for minimum education\n<br><br>\nMinimum Experience: 3 years\n<br><br>\nMinimum Field of Expertise: Knowledge of research processes and computer science.\n<br><br>\n<strong>USC is an equal opportunity, affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristic protected by law or USC policy.</strong> <strong>USC will consider for employment all qualified applicants with criminal histories in a manner consistent with the requirements of the</strong> <strong>Los Angeles Fair Chance Initiative for Hiring</strong><strong> ordinance</strong>. <strong>We provide reasonable accommodations to applicants and employees with disabilities. Applicants with questions about access or requiring a reasonable accommodation for any part of the application or hiring process should contact USC Human Resources by phone at (213) 821-8100, or by email at uschr@usc.edu. Inquiries will be treated as confidential to the extent permitted by law.</strong>\n<br><br>\n<strong>Read USC’s Clery Act Annual Security Report</strong>\n<br><br>\n<strong>Required Legal Notices</strong>\n<br><br>\n<strong>Certain positions are subject to background screening</strong>\n<br><br>\nIf you are a current USC employee, please apply to this USC job posting in Workday by copying and pasting this link into your browser:<br><br>https://wd5.myworkday.com/usc/d/inst/1$9925/9925$17212.htmld"}