{"job title": "SCIENTIST/RESEARCHER III", "company": "University of Oklahoma", "city state": "– Norman, OK", "rating": "4.1", "job description": "The ConocoPhillips School of Geology and Geophysics (CPSGG) is recruiting a full-time Geoscience IT administrator (Scientist/Researcher III). This position will support faculty and students in (1) maintaining the existing Linux infrastructure, and (2) maintaining and using existing software related to seismic processing/interpretation and other geoscientific applications. The candidate must have a strong background in Linux system administration and must be familiar with professional software packages used in seismic exploration and interpretation. This position will also be a liaison to OU IT and will maintain software licenses including renewal requests. Please submit resume, cover letter, academic transcripts and two reference letters.<br><br><strong>Required Education:</strong> Master's Degree OR:\n<ul>\n<li>6 years of relevant professional experience</li>\n</ul>\n<strong>Skills</strong>:\n<ul>\n<li>Able to communicate well and build rapport quickly with students, faculty and staff</li><li>Able to work well with interdepartmental teams and initiatives</li><li>Must be able to perform basic data analysis</li>\n</ul>\n<strong>Certifications</strong>:\n<ul>\n<li>None required</li>\n</ul>\n<strong>Advertised Physical Requirements:</strong>\n<ul>\n<li>Must be able to engage in repetitive motions and communicate. Remain for extended periods in front of computer monitor using a keyboard. Lift up to 50 lbs.</li>\n</ul>\n<strong>Departmental Preferences:</strong>\n<ul>\n<li>Excellent Linux system administration skills and experience.</li><li>Windows administration skills.</li><li>Familiarity with professional geoscientific and seismic processing software in industry or academic</li><li>Programming and scripting skills.</li><li>Effective communication skills.</li><li>Experience with ProMax.</li><li>Experience with X11/VNC and other graphical connection solutions between Windows and Linux.</li><li>Ability and interest in classroom teaching (lab).</li>\n</ul>\n<strong>Supervision:</strong> No Supervisory Duties<br>\n\n<div><strong>Special Instructions:</strong> If you are selected as a final candidate for this position, you will be subject to The University of Oklahoma Norman Campus Tuberculosis Testing policy. To view the policy, visit http://www.hr.ou.edu/policies/tbtesting.asp.</div>"}