{"job title": "Computer Scientist - HPC", "company": "University of Southern California", "city state": "– Arlington, VA", "rating": "4.3", "job description": "<strong>Information Sciences Institute (ISI)</strong>, a unit of USC’s Viterbi School of Engineering, is a world leader in the research and development of advanced information processing, computing, and communications technologies. ISI operates one of the world’s largest academic high-performance computing clusters. ISI has three research campuses: one in Marina Del Rey, CA; one in Arlington, VA; and one in Waltham, MA.\n<br><br>\n<strong>*This position is located in Arlington, VA.*</strong>\n<br><br>\nISI is home to nearly 250 researchers in a variety of fields, including computational systems and technology, artificial intelligence, and networking, who carry out world-class research in a collaborative, academic environment. ISI scientists have the opportunity to spend the majority of their time doing the research they love. Projects are critically accelerated by research programmers and Ph.D. and M.S. students.\n<br><br>\nISI is looking for highly talented and motivated researchers with demonstrated expertise in high performance computing and I/O optimization to join a team developing state-of-the-art high performance cloud and big data systems.\n<br><br>\nPreferred Qualifications:\n<ul>\n<li>PhD in Computer Science, Computer Engineering, or a related field</li><li>Experience in performance tuning and optimization with a preferred emphasis on high performance storage</li><li>Knowledge of systems and familiarity with operating systems internals</li><li>Good written and oral skills will be necessary to compose technical reports, write peer-reviewed papers, and deliver presentations to sponsors and academic audiences</li><li>Highly self-motivated, able to set goals, coordinate with teammates, and work semi-autonomously</li>\n</ul>\n<strong>The selected applicant must obtain and maintain a Top Secret clearance with Sensitive Compartmented Information eligibility and access. Per U.S. government regulations, eligibility for this clearance requires U.S. citizenship.</strong>\n<br><br>\nThe University of Southern California values diversity and is committed to equal opportunity in employment.<br><br>Minimum Education: Master's degree, Combined experience/education as substitute for minimum education\n<br><br>\nMinimum Experience: 3 years\n<br><br>\nMinimum Field of Expertise: Knowledge of research processes and computer science.\n<br><br>\n<strong>USC is an equal opportunity, affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristic protected by law or USC policy.</strong> <strong>USC will consider for employment all qualified applicants with criminal histories in a manner consistent with the requirements of the</strong> <strong>Los Angeles Fair Chance Initiative for Hiring</strong><strong> ordinance</strong>. <strong>We provide reasonable accommodations to applicants and employees with disabilities. Applicants with questions about access or requiring a reasonable accommodation for any part of the application or hiring process should contact USC Human Resources by phone at (213) 821-8100, or by email at uschr@usc.edu. Inquiries will be treated as confidential to the extent permitted by law.</strong>\n<br><br>\n<strong>Read USC’s Clery Act Annual Security Report</strong>\n<br><br>\n<strong>Required Legal Notices</strong>\n<br><br>\n<strong>Certain positions are subject to background screening</strong>\n<br><br>\nIf you are a current USC employee, please apply to this USC job posting in Workday by copying and pasting this link into your browser:<br><br>https://wd5.myworkday.com/usc/d/inst/1$9925/9925$21250.htmld"}