{"job title": "Waste Characterization Scientist", "company": "AECOM", "city state": "– Carlsbad, NM", "rating": "3.2", "job description": "**Business Line** Government<br> <br>**Position Title** Waste Characterization Scientist<br> <br>United States of America - New Mexico<br> <br>Carlsbad<br> <br>**Job Summary**<br> <br>Nuclear Waste Partnership, an LLC of AECOM, is seeking a<br> <br>**Waste Characterization Scientist** to be based in our Carlsbad, New Mexico location.<br> <br>The successful candidate will perform Data Verification and Validation, Identification and Disposition of Non-conformances, Procedure review, Acceptable Knowledge Accuracy reporting. Ensure characterization activities are performed in compliance with CBFO guidelines mandated by the Waste Analysis Plan and the Transuranic Waste Acceptance Criteria for the Waste Isolation Pilot Plant.<br> <br>**Minimum Requirements**<br> <br>+ Bachelor?s Degree in Chemistry, or a science related field is required.<br> <br>+ Must be able to work in a dynamic environment.<br> <br>+ Must be proficient with Microsoft Office Applications.<br> <br>+ Due to the nature of the work, candidates must be US Citizens.<br> <br>**Preferred Qualifications**<br> <br>+ Two years of relevant experience is preferred.<br> <br>+ Laboratory or DOE site experience is preferred.<br> <br>+ Familiarity with Non-destructive Assay, Non Destructive Examination characterization processes and data review and validation is preferred.<br> <br>+ An understanding of DOE Configuration Management requirements and experience working within a DOE Quality Assurance Program is a plus.<br> <br>**What We Offer**<br> <br>AECOM is a place where you can put your innovative thinking and business skills into high gear and work alongside other highly intelligent and motivated people. It's a place where you can apply your skills to some of the world's most challenging, interesting, and meaningful projects worldwide. It's a place that values the diversity of our areas of practice and our people. It's what makes AECOM a great place to work and grow.<br> <br>AECOM is an equal opportunity employer and Minorities, Females, Veterans, and Disabled persons are encouraged to apply. For further information, please click here to view the EEO Is The Law poster.<br> <br>**Job Category** Sciences<br> <br>**Business Group** Management Services Group (MS)<br> <br>**Country** United States of America<br> <br>**Position Status** Full-Time<br> <br>**Requisition/Vacancy No.** 184871BR<br> <br>Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status."}