{"job title": "Entry Level Environmental Scientist", "company": "AECOM", "city state": "– Minneapolis, MN", "rating": "3.2", "job description": "<ul>\n<li>*Business Line** Environment</li>\n<li>*Position Title** Entry Level Environmental Scientist</li>\n</ul>\n\nUnited States of America - Minnesota\n<br><br>\nMinneapolis\n\n\n<ul>\n<li>*Job Summary**</li>\n</ul>\n\nThe Environment Business Line at AECOM Technical Services is seeking an Entry Level Environmental Scientist to join our Minneapolis office as project staff.\n<br><br>\nImagine working on rewarding projects within a diverse culture, and having access to exceptional training and career development opportunities. Working at AECOM means being part of a global team, working with award-winning professionals across the world. Aspire to be a key player on some of the best projects regionally, with opportunities to work on projects nationally or internationally. Our people bring deep industry knowledge to help you succeed. AECOM will provide 40?hour OSHA HAZWOPER training.\n<br><br>\nThe responsibilities of this position include, but are not limited to:\n<br><br>\n+ Oversee and work with subcontractors, enforce safety requirements, and document observations\n<br><br>\n+ Complete assigned field tasks safely, such as soil logging, monitoring well installation, media sampling, testing, contractor oversight, and water level/groundwater gradient surveys\n<br><br>\n+ Technical report preparation\n<br><br>\n+ Supporting projects of various size and scope in field and office setting in contaminant investigation, contaminant remediation, environmental permitting, and environmental due diligence\n<br><br>\n+ Other duties as assigned\n\n\n<ul>\n<li>*Minimum Requirements**</li>\n</ul>\n\n+ Bachelor's degree in environmental science, geology or related scientific discipling\n<br><br>\n+ Experience in contaminant investigations, remediation, hydrogeology, and/or environmental sampling\n<br><br>\n+ Strong communication skills, the ability to write, and the ability to convey thoughts and ideas clearly\n<br><br>\n+ Ability to follow written and/or verbal instructions, and the confidence to ask questions to grasp objectives\n<br><br>\n+ Ability and enthusiasm to work collaboratively with multi-disciplinary teams\n<br><br>\n+ Proficient with MS office products and the ability to organize data clearly\n<br><br>\n+ Travel will be required, potentially including out-of-state short-term overnight stays\n<br><br>\n+ Valid Driver?s License\n<br><br>\n+ Must be able to work outdoors year-round\n<br><br>\n+ Due to the nature of this work, qualified applicants who are offered apositoin must pass a pre-employment substance abuse test\n\n\n<ul>\n<li>*Preferred Qualifications**</li>\n</ul>\n\n+ Master?s degree preferred\n<br><br>\n+ Knowledge of environmental data collection, investigation, and data entry skills\n<br><br>\n+ Knowledge of Upper-Midwest geology and/or environmental chemistry\n<br><br>\n+ Proficiency in using pumps, field instruments, and mechanical skills are beneficial\n<br><br>\n+ Knowledge of soil and groundwater remedial techniques\n<br><br>\n+ Experience acquiring and manipulating spatial data and knowledge of GIS data and collection\n<br><br>\n+ GIS coursework preferred\n\n\n<ul>\n<li>*What We Offer**</li>\n</ul>\n\nAECOM is a place where you can put your innovative thinking and business skills into high gear and work alongside other highly intelligent and motivated people. It's a place where you can apply your skills to some of the world's most challenging, interesting, and meaningful projects worldwide. It's a place that values the diversity of our areas of practice and our people. It's what makes AECOM a great place to work and grow. AECOM is an Equal Opportunity Employer.\n<br><br>\nAt AECOM, employee's safety and security are our top Safeguarding core value. All employees are expected to set the highest level of safety expectation in their work, display the highest level of safe behavior, and actively participate in AECOM's Safety For Life Program. SH&amp;E is a part of our company culture and participation is required for all employees.\n<br><br>\n_NOTICE TO THIRD PARTY AGENCIES: Please note that AECOM does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed Recruitment Fee Agreement, AECOM will not consider or agree to payment of any referral compensation or recruiter fee. In the event a recruiter or agency submits a resume or candidate without a previously signed agreement, AECOM explicitly reserves the right to pursue and hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of AECOM._\n\n\n<ul>\n<li>*_Job Category_** _Sciences_</li>\n<li>*_Business Group_** _Design and Consulting Services Group (DCS)_</li>\n<li>*_Country_** _United States of America_</li>\n<li>*_Position Status_** _Full-Time_</li>\n<li>*_Requisition/Vacancy No._** _193794BR_</li>\n</ul>\n\n_Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status._"}