{"job title": "Applied Scientist - Operations Research", "company": "Amazon", "city state": "– US, WA, Seattle", "rating": "3.8", "job description": "Amazon Devices Demand Planning team is looking for an Applied Scientist with a background in Operations Research and Management Sciences. We develop sophisticated algorithms that involve learning from large amounts of past data, such as actual sales, prices, promotions, similar products and products attributes in order to forecast the demand for all Amazon devices and to use these forecasts to determine if we should green-light products, the level of investment in capital expenditures, ordering material, managing inventory and determining financial performance. We also work closely with Supply Chain and Logistics teams to optimize our inventory allocation in our worldwide channels given operational constraints.\n<br>\nThe successful candidate will be a self-starter, comfortable with ambiguity, with strong attention to detail, an ability to work in a fast-paced and ever-changing environment and a desire to help share the overall business.\n<br><br>\nYou will have an opportunity to work on large mathematical problems, with large elements of unpredictability. You will write and solve linear and mixed-integer problems to find optimal solutions to build decisions given capacity constraints and the demand distributions. You will also drive process changes that comes with automation and smarter optimization. You are an individual with outstanding analytical abilities, communication skills, and are comfortable working with technical teams and systems. You will be responsible for researching, experimenting, and analyzing forecasting strategies and mathematical models. You will also be prototyping the implementations.\n<br><br>\n<strong>Key responsibilities:</strong>\n<br>\n· Design and develop complex mathematical, simulation and optimization models and apply them to define strategic and tactical needs and drive the appropriate business and technical solutions in the areas of inventory management, network flow, supply chain optimization, demand planning.\n<br>\n· Apply theories of mathematical optimization, including linear programming, combinatorial optimization, integer programming, dynamic programming, network flows and algorithms to design optimal or near optimal solution methodologies to be used by in-house decision support tools and software.\n<br>\n· Prototype these models by using modeling languages such as R, MATLAB, Mosel or in software languages such as Python.\n<br>\n· Create, enhance, and maintain technical documentation, and present to other Scientists.\n<br>\n· Lead project plans from a scientific perspective by managing product features, technical risks, milestones and launch plans\n<br>\n· Influence organization's long term roadmap and resourcing, onboard new technologies onto Science team's toolbox, mentor other Scientists\n<br><br>\nIn order to perform the above responsibilities well, you also need to\n<br>\n· Gather data required for analysis and mathematical model building by writing ad-hoc scripts and database queries\n<br>\n· Interact with software and multiple business teams across the company to develop an understanding of their business requirements and operational processes."}