{"job title": "Applied Robotics Scientist", "company": "Amazon", "city state": "– Sunnyvale, CA", "rating": "3.8", "job description": "Amazon Lab126 is an inventive research and development company that designs and engineers high-profile consumer electronics. Lab126 began in 2004 as a subsidiary of Amazon.com, Inc., originally creating the best-selling Kindle family of products. Since then, we have produced groundbreaking devices like Fire tablets, Fire TV, and Amazon Echo. What will you help us create?\n<br><br>\n<strong>The Role:</strong>\n<br>\nWe are a smart team of doers that work passionately to apply cutting-edge advances in robotics and software to solve real-world challenges that will transform our customers experiences in ways we cant even imagine yet. Key responsibilities will be to conduct research and development in computer vision and related disciplines, and to collaborate with cross-functional engineering teams, including Amazon Robotics, to put the concepts you develop into production. You will determine where commercially available solution and academic research can be applied to solve Amazon business problems, as well as identify opportunities for innovation. You will use a large amount of data to train and test algorithms to bring them up to production level quality\n<br><br>\nIf this describes you, come join our team at Lab126 in the heart of Silicon Valley. The team is using computer vision, image recognition, machine learning, real-time and distributed systems to convert requirements into concrete deliverables. A Researcher on this team will translate business and functional requirements into working code. Comfort with a high degree of ambiguity and ability to solve problems that havent been solved to scale before are essential.\n<br><br>\nKey responsibilities will be to conduct research and development in computer vision and related disciplines, and to collaborate with cross-functional engineering teams to put the concepts you develop into production. You will determine where commercially available solution and academic research can be applied to solve Amazon business problems, as well as identify opportunities for innovation. You will use a large amount of data to train and test algorithms to bring them up to production level quality. In this role, you will:\n<br><br>\n· Research, design, implement and evaluate novel computer vision algorithms\n<br>\n· Work on large-scale datasets, focusing on creating scalable and accurate computer vision systems in versatile application fields\n<br>\n· Collaborate closely with team members on developing systems from prototyping to production level\n<br>\n· Collaborate with teams spread all over the world\n<br>\n· Work closely with software engineering teams to drive scalable, real-time implementations\n<br>\n· Track general business activity and provide clear, compelling management reports on a regular basis"}