{"job title": "Sr Associate Scientist", "company": "Amgen Inc", "city state": "– South San Francisco, California", "rating": "3.7", "job description": "Amgens Bioassay Technology team of the Genome Analysis Unit is seeking an enthusiastic cellular imaging specialist and biologist to join our biotechnology group at our research facility in South San Francisco. The successful candidate will be self-motivated and able to work both independently and as part of cross-disciplinary teams. The candidate will join an energetic research team responsible for the design and execution of research projects involving automated cellular imaging, image analysis, and the production of high quality data. Responsibilities of this position include designing and conducting experiments to interrogate cell biology using cellular imaging techniques, development of image analysis algorithms to extract relevant information, and comprehension of such results in order to communicate findings to colleagues. Additional responsibilities include mammalian cell culture, assay development, and incorporation of laboratory automation where suitable.\n<br><br>\n<strong>Basic Qualifications</strong>\n<br><br>\nMasters degree and 3 years of scientific experience\n<br><br>\nOR\n<br><br>\nBachelors degree and 5 years of scientific experience\n<br><br>\n<strong>Preferred Qualifications</strong>\n<br><br>\nA demonstrated strong background in cellular imaging, fluorescence microscopy, cell biology, and cell-based assay development\n<br><br>\nExperience with mammalian tissue culture, iPSC culture, image analysis, lab automation, and high content screening is desirable\n<br><br>\nAbility to design and execute experiments independently\n<br><br>\nExcellent communication skills and the desire to work in a team\n<br><br>\nComputer literacy, analytical and problem-solving skills, highly organized and ability to multi-task\n<br><br>\nAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.\n<br><br>\nAmgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve peoples lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the worlds leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.<br><br>Amgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n<br><br>\nAmgen will consider for employment qualified applicants with criminal histories in a manner consistent with the San Francisco Fair Chance Ordinance."}