{"job title": "Medical Scientist, Oncology", "company": "AstraZeneca", "city state": "– US - Gaithersburg - MD", "rating": "3.8", "job description": "<strong><u>Job Title: Medical Scientist, Oncology</u></strong>\n<br><br>\n<strong>Location: Gaithersburg, Maryland</strong>\n<br><br>\n<strong>Salary: We offer a competitive salary and benefits package.</strong>\n<br><br>\nAt AstraZeneca we work together across global boundaries to make an impact and find answers to challenges. We do this with integrity, even in the most difficult situations because we are committed to doing the right thing.\n<br><br>\nGlobal Medicines Development (GMD) is the science engine room for our late stage development. We transform clinical concepts into medicines that deliver patient health benefits. There are around 5,000 people in GMD. Our critical, core drug development expertise is at the heart of our three vibrant scientific centers in Gothenburg (Sweden), Cambridge (UK) and Gaithersburg (US).\n<br><br>\nThis is an exciting period for us, as well as for those poised to join us. Our strategy and ability to transform our portfolio means we have a late stage pipeline that presents incredible opportunities to push the boundaries of science to deliver life-changing medicines. We are responsible for enabling the business to make critical pipeline and investment decisions, to ensure they select the right molecules to progress and to seize the right lifecycle management opportunities – generating the data required to drive regulatory submissions for new medicines and expanded indications and generating the evidence that shows their true value.\n<br><br>\nOncology within GMD has a broad pipeline, offering career development options. We are looking for established scientists who wish to broaden their roles. As a Medical Scientist you will have a role in developing new registration-focused trials. You will be working independently with guidance in only the most complex situations and be a close partner to the physician on the team.\n<br><br>\n<strong>Main Duties and Responsibilities</strong>\n<ul>\n<li>You may coordinate the activity of a research team and will hold full accountability for projects, often with Global impact.</li> <li>You will have key relationships internally with clinical project teams, and externally with regulatory bodies and external service providers.</li><li>You will ensure there is adequate input into the drug development process from experts in each of the various areas of drug development, or provide input into one or more of these areas as a technical expert.</li> <li>You will develop and design studies to determine the scientific and clincial viability of a particular drug or portfolio of drugs and interpret the results of these studies, either as the head of a team, or by providing expert input.</li> <li>You will participate in protocol design, writing and Implementation to meet GCP, ICH and all AZ quality standards.</li><li>You will manage cross functional projects to ensure the successful passage of drugs through all phases of the drug development process, or contribute to one or more elements of such a project as a technical expert.</li> <li>You will review and interpret medical data and clinical trial data and come up with conclusions</li> <li>You will also have responsibility for delivery of pieces of the trials and may lead submissions from a process standpoint.</li>\n</ul>\n<strong>Essential Requirements</strong>\n<ul>\n<li>PhD in a scientific field is required</li> <li>Oncology clinical trials experience.</li><li>Experience managing and interpreting the results of clinical trials as well as exposure to writing protocols</li><li>Strong analytical skills.</li><li>Experience of authoring scientific documents.</li><li>Well-developed communication skills.</li><li>Sufficient technical and disease area knowledge to be able to interact with confidence with internal and external partners.</li>\n</ul>\n<strong>Desirable Requirements</strong>\n<ul>\n<li>Considerable relevant experience in the pharmaceutical industry is preferred, however academic experience will be considered.</li><li>Experience across phases II - III drug development.</li>\n</ul>\n<strong>Next Steps – Apply today!</strong>\n<br><br>\n<strong>To be considered for this exciting opportunity, please complete the full application on our website at your earliest convenience – it is the only way that our Recruiter and Hiring Manager can know that you feel well qualified for this opportunity. If you know someone who would be a great fit, please share this posting with them.</strong>\n<br><br>\n<strong>AstraZeneca is an equal opportunity employer. AstraZeneca will consider all qualified applicants for employment without discrimination on grounds of disability, sex or sexual orientation, pregnancy or maternity leave status, race or national or ethnic origin, age, religion or belief, gender identity or re-assignment, marital or civil partnership status, protected veteran status (if applicable) or any other characteristic protected by law. AstraZeneca only employs individuals with the right to work in the country/ies where the role is advertised.</strong>\n<br><br>\n<strong>Date Posted</strong><br><br>07-Aug-2018<br><br><strong>Closing Date</strong>"}