{"job title": "Analyst, Data&amp;Analytics", "company": "Casper", "city state": "– New York, NY", "rating": "4.1", "job description": "Looking for a job to get you out of bed?\n<br><br>\nCasper is looking to add an Analyst to our Data and Analytics team. The Analyst will touch all aspects of the organization including fulfillment, planning and manufacturing engineering to provide actionable, data-driven insights and inform strategic decision-making. We are a data-driven company, so there will be no shortage of interesting questions to answer!\n<br><br>\nCasper (casper.com) is a global sleep company that launched in 2014 with an obsessively engineered, outrageously comfortable mattress sold directly to consumers. Its critically acclaimed sleep surface was developed in-house, has a sleek design, and is delivered in a small, \"how did they do that?\"-sized box. The company is one of the fastest-growing consumer brands of all time, and its product line has expanded to include sheets, pillows, a matching foundation, and a dog mattress. Casper was named one of Fast Company's 50 Most Innovative Companies in 2017, and its eponymous mattress was crowned one of TIME Magazine's Best Inventions.\n<br><br>\nWe are deeply committed to building a diverse and inclusive workforce so that we represent all those who dream big equally.\n<br><br>\nWhen you're not catching zzz's, this is what you'll do\n\n\n<ul>\n<li>Work with Executive team to understand weekly, monthly and quarterly business performance and trends.</li>\n<li>Work with global operations team to improve fulfillment speed, identify cost savings and improve manufacturing quality</li>\n<li>Develop KPI reports and make strategy recommendations to inform major operations decisions.</li>\n<li>Contribute to the analytics toolkit through iterating on analysis methodology and acting cross-functionally to generalize frameworks.</li>\n<li>Tell the story behind the data to non-technical team members so they can execute more effectively.</li>\n</ul>\n\nOur dream candidate is...\n\n\n<ul>\n<li>Experienced as a Data Analyst, Data Scientist or Management Consultant, preferably at an e-commerce brand with a high volume of complex data (1-3 years preferred)</li>\n<li>Experience with SQL and python</li>\n<li>Experienced with visualization tools (e.g. Looker, Tableau)</li>\n<li>A highly motivated self-starter; flexible, adaptable, and able to work in an entrepreneurial environment</li>\n<li>Experienced applying statistics and machine learning techniques to real-world data a plus</li>\n<li>Operations analytics experience a plus</li>\n</ul>"}