{"job title": "Applications Scientist, Home Care", "company": "Lubrizol", "city state": "– Cleveland, OH", "rating": "3.5", "job description": "<ul>\n<li>*Applications Scientist, Home Care**</li>\n</ul>\n\nLubrizol Advanced Materials is an essential ingredient in improving lives. Our innovative products enhance the shampoos, lotions and soaps you use; the medicine you take; the sports apparel and shoes you wear; the detergents that keep your whites whiter and your colors from fading; the medical devices that speed your recovery and enhance your comfort; the specialty coatings that make your wood furniture, floors and cabinets more durable, more beautiful and more sustainable; and the plumbing systems in your home that will never corrode, pit or scale. With such a diverse portfolio, Lubrizol Advanced Materials offers unparalleled career growth opportunities for top-talent. To learn more about each of our core businesses, click on the following links: Engineered Polymers at https://www.lubrizol.com/Engineered-Polymers/ , Personal Care at https://www.lubrizol.com/Personal-Care , Home Care at https://www.lubrizol.com/Home-Care , Lubrizol LifeSciences at https://www.lubrizol.com/Life-Sciences , Performance Coatings at https://www.lubrizol.com/Coatings , and Lubrizol CPVC Piping Systems at https://www.lubrizol.com/CPVC/ .\n\n\n<ul>\n<li>*LUBRIZOL HOME CARE**</li>\n<li>*Adding value through improved functionality and enhanced performance to economical, efficient cleaning applications.**</li>\n</ul>\n\nLubrizol Advanced Materials is hiring an Applications Scientist to support our Home Care Applications team. Learn more about our Home Care Division at https://www.lubrizol.com/Home-Care\n\n\n<ul>\n<li>*What you will do:**</li>\n</ul>\n\n+ Support product application developments for Home Care Applications in coordination with the Global Application Manager.\n<br><br>\n+ Perform laboratory experiments, design formulations and conduct performance evaluations of Home Care products.\n<br><br>\n+ Provide technical support to key customers by demonstrating product benefits through testing data.\n<br><br>\n+ Work closely with the account managers as a technical liaison to help commercialize customer projects.\n<br><br>\n+ Develop unique formulated solutions and property relationships by using industry standards or develop unique test methods to demonstrate Lubrizol product superiority.\n<br><br>\n+ Complete projects and assignments in a timely manner and summarize results.\n<br><br>\n+ Produce accurate and reproducible tests and data.\n<br><br>\n+ Organize laboratory work to meet multiple assignment objectives.\n<br><br>\n+ Maintain clear records of experiments, results and conclusions. Keep up to date laboratory notebook.\n<br><br>\n+ Troubleshoot and solve problems independently.\n<br><br>\n+ Ensure compliance with safety procedures and good housekeeping practices.\n<br><br>\n+ Actively participate in department safety programs.\n\n\n<ul>\n<li>*What you need:**</li>\n</ul>\n\n+ Minimum of B.S. Degree in Chemistry, Chemical Engineering or similar.\n<br><br>\n+ Ability to work independently and in support of the Sr Scientists and/or Application Manager.\n<br><br>\n+ Understanding of formulations, applications, handling of chemicals and safe work practices.\n<br><br>\n+ Some industrial experience in Home Care ingredients and formulations, as well as performance testing desired.\n<br><br>\n+ Ability to plan and organize multiple assignments with minimal supervision.\n<br><br>\n+ Good chemical and math abilities in recipe calculations.\n<br><br>\n+ Ability to maintain an accurate legal record of experimental results, provide written summaries and offer initial interpretation of results.\n<br><br>\n+ Self-motivated with ability to identify and obtain necessary materials to maintain laboratory and support ongoing projects.\n<br><br>\n+ Good organizational, interpersonal, written, verbal and computer skills.\n\n\n<ul>\n<li>*CONSIDERED A PLUS:**</li>\n</ul>\n\n+ Technical experience in Home Care Products formulation and testing\n<br><br>\n+ Knowledge of the polymers and additives used in above-mentioned market formulations.\n<br><br>\nWith multiple facilities in and around Cleveland, Ohio at http://www.thisiscleveland.com/ , Lubrizol is located in one of the largest economic regions in the United States. Buzzing with business, culture, knowledge and entertainment, Northeast Ohio at http://www.globalcleveland.org/ is a vibrant place for people of all ages and walks of life to live, learn, work and play. This region offers a little bit of everything for everyone - ethnically-diverse communities, affordable housing, award-winning schools and universities, world-class healthcare, indoor waterparks and zoos, ski resorts, museums, halls of fame, one of the longest water-fronts in the country, and the most concentrated square mile of art, cultural, education and health institutions in the nation. From making your heart race at Cedar Point, to attending a professional sporting event or biking or hiking through over the 100,000 acres of state parks, to catching a Broadway show at Playhouse Square - the second largest performing arts center in the country, you can make it happen right here in Cleveland, Ohio .\n<br><br>\n_Lubrizol is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to sex, race, color, national origin, citizenship, age, religion, marital status, military service, sexual orientation, genetic information, gender identity, or any other characteristic or trait protected by federal, state, or local law._\n\n\n<ul>\n<li>*Nearest Major Market:** Cleveland</li>\n<li>*Job Segment:** Chemistry, Scientific, Chemical Research, Scientist, Engineer, Science, Engineering</li>\n</ul>"}