{"job title": "Senior Clinical Development Scientist", "company": "Philips", "city state": "– Osseo, MN", "rating": "3.4", "job description": "Has wide-ranging experience, uses professional concepts and company objectives to resolve complex issues in creative and effective ways.\n<br><br>\n+ ? Distinguished by additional specialized knowledge in\n<br><br>\nbreadth and/or depth, as well as record of success in relevant business process/function.\n<br><br>\n+ ? Has expert level knowledge of company products and services and may be tasked with introducing new concepts.\n<br><br>\n+ ? Regularly interacts with senior management or executive levels on matters concerning several functional areas, divisions, and/or customers.\n<br><br>\n+ Works on issues where analysis of situations or data requires an in-depth knowledge of organizational objectives.\n<br><br>\n+ Implements strategic policies when selecting methods, techniques, and evaluation criteria for obtaining results.\n<br><br>\n+ Establishes and assures adherence to budgets, schedules, work plans, and performance requirements.\n<br><br>\nThis position is responsible for managing a part of a business process or function.\n<br><br>\n+ ?Manages activities of two or more sections or departments.\n<br><br>\n+ ?Exercises supervision in terms of costs, methods, and staffing.\n<br><br>\n? In some instances this manager may have subordinate supervisors.\n<br><br>\n? Primary duty is managing individual contributors or managing two or more sections or departments.\n<br><br>\nWe welcome you to join Philips Image Guided Therapy - Devices as a **Senior** **Clinical Development Scientist** in our Maple Grove, MN or Colorado Springs, CO locations.\n<br><br>\nIn this role, you have the opportunity to work with a cutting edge product line **-** IGT Devices is part of the Philips Image Guided Therapy (IGT) at https://intranet.philips.com/Pages/Image-Guided-Therapy.aspx business group.\n<br><br>\nAs the Senior Clinical Development Scientist, you will be responsible for developing and delivering evidence generation/dissemination strategies for multiple and/or complex projects; including, but not limited to, study design, scientific validity, data integrity, strategic guidance and reporting.\n\n\n<ul>\n<li>*You are responsible for**</li>\n</ul>\n\n+ Will provide strategic input into clinical aspects related to the end to end (E2E) coronary &amp; peripheral clinical development portfolio, from ideation through post marketed products\n<br><br>\n+ Work closely together with internal (project owners, regulatory, clinical study managers, statisticians, business leaders, etc.) and external (clinical consultants such as Key Opinion Leaders (KOL) and subject matter experts (SME?s)) stakeholders to ensure that the clinical safety and performance objectives will be met for all new products through non-clinical and clinical strategic input on product development and validation testing.\n<br><br>\n+ Responsible for professional collaboration with, investigators, IRB?s/EC?s, Regulatory Agencies, societies, and associations\n<br><br>\n+ Additional collaboration may occur to support claims, reimbursement, health economic outcomes and / or market access.\n<br><br>\n+ Through active cooperation with physicians and / or medical researchers, the clinical scientist will work with scientific writing personnel or take a leading role to support the publication of study results.\n<br><br>\n+ Will ensure appropriate interpretation and dissemination of all evidence generated, including Clinical Study Reports (CSRs), Clinical Evaluation Reports (CERs), abstracts, peer reviewed manuscripts, as assigned.\n<br><br>\n+ Will lead or support scientific discussions with regulatory agencies / notified bodies to drive support of the clinical and regulatory strategy, including proposed clinical investigations; review process of clinical evidence generated for marketing authorization, line extensions, including during sponsor regulatory inspections.\n\n\n<ul>\n<li>*You are a part of**</li>\n</ul>\n\nThe Senior Clinical Development Scientist reports to the Director of Clinical Affairs. This position offers the opportunity to impact lives through the development and testing of quality Philips products and solutions that help countless people all over the world. We have a fantastic work environment and culture that is respectful and rewarding, that offers opportunities to develop and grow both personally and professionally. These opportunities are limited only by ones initiative and desire to succeed. The ability of this position to work with both internal and external customers promotes a broader vision to additional opportunities across Philips as a global company.\n\n\n<ul>\n<li>*To succeed in this role, you should have the following skills and experience**</li>\n</ul>\n\n+ Must have medical device industry experience\n<br><br>\n+ Scientific education (preferably Masters or PhD degree preferred in BioMedical Science or Health related field), with extensive experience in doing research for industry\n<br><br>\n+ A demonstrated working knowledge of GCP, ICH guidelines, FDA regulations (21CFR812) and EU (ISO14155) regulations\n<br><br>\n+ Deep understanding of product development and associated design controls within the operational framework of a Quality Management System for medical devices.\n<br><br>\n+ Extensive clinical research knowledge and cross-functional understanding of clinical trial methodology and operational experience is a must\n<br><br>\n+ 10+ years of experience in a similar role in the Medical Device or Pharma industry\n<br><br>\n+ Excellent verbal and written communication skills (English); multiple languages is a plus\n<br><br>\n+ Ability to collaborate effectively with various teams - clinical operations, engineering, cross-functional team members, as well as external partners\n<br><br>\n+ Self-directed with a strong work ethic, with an ability to work in a goal-oriented environment\n<br><br>\n+ Strong writing skills to produce quality clinical documents, including final reports\n<br><br>\n+ Analytical thinking, able to present statistical methods and results to a variety of audiences, especially non-statisticians\n<br><br>\n+ Proficient computer skills across multiple applications (MS Office, with experience in and an aptitude for clinical trial software, proven ability to apply statistics into method development and sample analysis, experience with SAS/SPSS statistical software is a plus\n\n\n<ul>\n<li>*Travel:** Able to travel, including international (25% travel, or more at times)</li>\n<li>*In return, we offer you**</li>\n</ul>\n\nWe offer you the opportunity to grow within the organization and Philips ? working cross functionally with R &amp; D, on various projects and initiatives to drive our products to our customers and be a part of saving people?s lives every day.\n\n\n<ul>\n<li>*Why should you join Philips?**</li>\n</ul>\n\nWorking at Philips is more than a job. It?s a calling to create a healthier society through meaningful work, focused on improving 3 billion lives a year by delivering innovative solutions across the health continuum at http://www.philips.com/b-dam/corporate/corporateblog/2016/Philips_Chronic_Disease_5.jpg . Our people experience a variety of unexpected moments when their lives and careers come together in meaningful ways. Learn more by watching this video\n<br><br>\nFind out more info about Philips at www.philips.com/na/careers\n<br><br>\nPhilips is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex (including pregnancy), sexual orientation, gender identity, national origin, genetic information, creed, citizenship, disability, protected veteran or marital status.\n<br><br>\nAs an equal opportunity employer, Philips is committed to a diverse workforce. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants that require accommodation in the job application process may contact 888-367-7223, option 5, for assistance.\n<br><br>\n<strong>\\#LI-PH1</strong>"}