{"job title": "Upstream Processing Scientist III (Senior)", "company": "Planet Pharma", "city state": "– West Point, PA", "rating": "4.1", "job description": "<strong>Qualifications:</strong>\n<br><br>\nQualifications: Basic Minimum Qualifications: • B.S. in Biology, Bio/chemistry, Bio/chemical Engineering, or related science • laboratory experience in mammalian cell culture. • General laboratory skills, experience with aseptic manipulations, pipettes • Experience in culturing microbial cells (shake flasks, bioreactor work) • Experience with bioreactors (Ambr250, stainless steel reactors, glass bioreactors, Single use bioreactors) • Experience performing basic lab scale assays (pH, optical density, etc) • Experience using formulas and linking spreadsheets in Excel • Highly computer literate. Capable of quickly learning and adapting to new computer programs. Strong computer, scientific, and organizational skills • Excellent communication (oral and written) and attention to detail • Ability to work independently and as part of a team, self-motivated, adaptable, and displays a positive attitude • Ability to learn new techniques, perform multiple tasks simultaneously, keep accurate records, follow instructions, and comply with company policies • Engaged in work practices, scientific understanding, and excellence in execution\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nUpstream Process Scientist Responsibilities: Scientist responsibilities include, but are not limited to, the following: • Prepare laboratory reagents, solutions and culture media • Perform lab-scale upstream processing of vaccine products and process intermediates (including work with Biosafety Level-2 organisms) • Setup process equipment for lab-scale experiments • Perform in-process monitoring assays • Analyze, collate, track, and report data back to client staff members • Maintain records and test results following good laboratory practices (GLP) • Work independently and efficiently • Document work clearly and perform tests accurately • Communicate effectively with client staff members • Follow laboratory procedures as required to perform the above tasks, and escalate deviations/issues to client staff members in a timely fashion\n<br><br>\nType:Temp/ContractLocation:West Point, PA"}