{"job title": "Project Wetlands Scientist", "company": "Terracon", "city state": "– Baton Rouge, LA", "rating": "3.4", "job description": "Job Description<br><br>General Responsibilities:<br><br>Working primarily in the Gulf South Region (MS, LA, AL), Terracon's Baton Rouge, Louisiana location seeks a Project Wetland Scientist to provide a wide range of services for federal, local, private, and state projects. Terracon's multidisciplinary consulting team of natural and cultural resource professionals develop innovative solutions for diverse clients. We are looking for an energetic, enthusiastic and highly self-motivated individual looking to build his or her career in providing and leading the growth of Terracon's natural resource consulting services.<br><br>As a Project Wetlands Scientist at Terracon, you will conduct wetland delineations including field reconnaissance work and report writing. Duties include but are not limited to locating wetland in the field, utilizing a submeter global positioning (GPS) unit for surveying, collecting appropriate field data form information, and preparing wetland delineation reports summarizing findings. Assessing project sites for threatened and endangered (T&amp;E) species habitat also comprises a portion of job responsibilities. Environmental Biologists at this level work under general direction with limited to moderate supervision and are expected to apply limited to moderate experience and increase proficiency in the application of scientific principles, theories, practices, and company standards. You will be expected to work autonomously and meet the required scope, schedule, and budget of any given project as well as consult with other technical professionals and/or your supervisor on routine and moderately complex projects. Proficiency in basic computer software, and approximately 25 to 40 percent travel, with occasional overnight travel, is required.<br><br>Essential Role and Responsibilities:<br><br>* Using prescribed methods, assist in the collection and evaluation of data from field sampling, reports, maps, drawings, tests, and other resources to complete projects<br><br>* Experience with the identification of hydrologic indicators such as vegetation, hydrology, and hydric soils<br><br>* Identify and analyze T&amp;E habitat in the field<br><br>* Review, interpret, and accurately convey in written format scientific, analytical, and other technical data<br><br>* Perform site inspections, record and convey field observations accurately, conduct field data collection, and/or complete other field assignments as directed<br><br>* Must be well organized, efficient, and detail-oriented, have the ability to manage multiple projects simultaneously, and meet the required scope, schedule, and budget of any given project<br><br>* The ability and willingness to perform light to moderate physical activity in all weather conditions is required. Must have the ability and willingness to work near or in aquatic environments and sometimes hilly terrain<br><br>* Sites requiring field work can include remote and/or large tracts of undeveloped land<br><br>* Participates in the development of marketing strategies and formal presentations of qualifications to clients on various projects in area of expertise.<br><br>* Maintain relationships with various regulatory agencies (federal, state, and local). Louisiana experience is preferred.<br><br>* Coordinate with accounting for financial management of business intelligence, invoicing and collections<br><br>* Develop an understanding and be aware of project-related risk. Be familiar with what could go wrong on a project and how to protect the Company. Be familiar with company risk policies.<br><br>Lead safety efforts for team and ensure team follows safety rules and guidelines. Responsible for creating and modeling a safe work environment; demonstrate safety practices. Promote pre-task planning for all projects.<br><br>Requirements:<br><br>* Bachelor's and/or Master's Degree(s) in Botany, Biology, Ecology, Ecosystem Science, Soils Science, or other relevant field of study;<br><br>* Eight plus years of related or applicable experience in wetland project management and environmental permitting;<br><br>* Excellent plant identification skills, especially of wetland species in the northern Gulf Coast and coastal environments;<br><br>* Thorough understanding of, and/or committed willingness to learn, Federal, State, and local environmental regulations and permitting requirements (e.g., Clean Water Act, Endangered Species Act, National Environmental Policy Act, local state requirements);<br><br>* Excellent verbal and written communication skills (please provide sample);<br><br>* Experience with energy, transmission corridor, and highway projects, is desirable;<br><br>* Proficiency in use of GIS and Microsoft Office software, including electronic document preparation is desirable;<br><br>* Ability to work independently and manage multiple project budgets and deadlines simultaneously<br><br>* Ability to work away from home under challenging field conditions for extended periods of time.<br><br>* Valid driver's license with acceptable violation history.<br><br>Desired Experience and Certifications:<br><br>Field experience identifying T&amp;E species and habitat<br><br>* Knowledge of federal and state waters permitting<br><br>* Knowledge of working/permitting within Louisiana's Coastal Zone<br><br>* Knowledge of Endangered Species Section 7 and 10 Consultation<br><br>About Terracon<br><br>Terracon is a 100 percent employee-owned consulting engineering firm providing quality services to clients. Since 1965, Terracon has evolved into a successful multi-discipline firm specializing in environmental, facilities, geotechnical, and materials services. Terracon currently has more than 3,500 employees in 130 offices with services available in all 50 states. Terracon's growth is due to valued employees exceeding expectations in client service and growing their careers with new and exciting opportunities in the marketplace.<br><br>EEO Statement<br><br>Terracon offers an excellent compensation and benefits package including: medical, dental, vision, life insurance, 401(k) plan, and paid holidays.<br><br>Terracon is an EEO employer. We encourage qualified minority, female, veteran and disabled candidates to apply and be considered for open positions. We do not discriminate against any applicant for employment, or any employee because of race, color, religion, national origin, age, sex, sexual orientation, gender identity, gender, disability, age, or military status."}