{"job title": "Associate Scientist, SAS", "company": "The Estee Lauder Companies", "city state": "– Melville, NY", "rating": "3.5", "job description": "**Associate Scientist, SAS**<br> <br><br> <br>**Brand:** Est?e Lauder Companies Corporate Departments<br> <br><br> <br>**Description**<br> <br><br> <br>This is an entry level research position working on setting raw material specifications, through analytical testing, on new ingredients coming through the innovation pipeline to ensure they comply with corporate and global regulatory requirements. This testing includes standard test methods and evaluation of physical attributes of raw material that requires the ability to make decisions on subjective tests (color, odor and appearance). Daily analysis will include physical and chemical testing using wet chemistry techniques and analytical instrumentation. Also responsible for data entry, documentation and informing appropriate personnel of critical issues when necessary. Must have excellent communication skills and be able to interact with chemists and management.<br> <br><br> <br>Independence of Action and Accountability: Works independently with minimum supervision to complete evaluation of raw materials (60%).<br> <br><br> <br>Problem Solving: Evaluates raw materials for appropriate tests and results for acceptability (20%).<br> <br><br> <br>Decision Making: Recognizes critical analytical issues and informs supervisor so that issues can be addressed (20%).<br> <br><br> <br>**Qualifications**<br> <br><br> <br>University Degree (BA or BS) in Chemistry<br> <br><br> <br>6 months of experience<br> <br><br> <br>Must be able to understand and use analytical instrumentation in the laboratory including, HPLC/UPLC, GC, UV-Vis, Karl Fischer, pH meter, Gardner colorimeter, ICP, Melting point/Drop point apparatus, and Mercury Analyzer. Will also be required to run wet chemistry / physical attribute tests. Good scientific knowledge is required. Familiarity of USP/NF, FCC, AOCS, and other compendial monographs required. Knowledge of ASTM, and ISO standards preferred. Minimum 6 to 12 months in testing raw materials in a R&amp;D/GMP environment required. Position requires excellent communication skills to discuss and/or explain test results to management. Microsoft Office and Access knowledge a plus. Experience working in a regulated environment.<br> <br><br> <br>**Job:** Research &amp; Development<br> <br><br> <br>**Primary Location:** Americas-US-NY-Melville<br> <br><br> <br>**Job Type:** Standard<br> <br><br> <br>**Schedule:** Full-time<br> <br><br> <br>**Shift:** 1st (Day) Shift<br> <br><br> <br>**Travel:** No<br> <br><br> <br>We are an equal opportunity employer. Minorities, women, veterans, and individuals with disabilities are encouraged to apply. **Job Number:** 188508"}