{"job title": "Data Analyst, Magento Services - Analytics team", "company": "Adobe", "city state": "– Austin", "rating": "4.2", "job description": "<p><b>The Challenge</b></p><p>Being a Data Analyst within the Analytics team in Magento Services is all about problem solving to help our clients grow their commerce businesses. They look to us to understand what is going on with their business and why - from a data drive perspective - and how to increase performance across KPIs associated with mobile, web, in-store, and so on.</p><p></p><p><b>What You'll Do</b></p><p>Your top priority will be working with clients to transform their data into valuable insights. This involves ensuring data quality, setting up useful dashboards and reports, producing advanced analyses including the potential for data science. Ultimately, you are charged with making our clients love us by making their data actionable and their businesses grow.</p><p></p><p>Examples of your specific responsibilities include:</p><ul><li>Providing stellar customer interactions</li><li>Analyzing and extracting insights from large, unstructured datasets</li><li>Helping users understand and analyze their data effectively</li><li>Managing client data warehouses to support analysis</li><li>Validating data replication from 3rd party sources to ensure accuracy</li><li>Querying databases to identify causes of data discrepancy issues</li></ul><ul><li>Evangelizing analysis best-practices</li></ul><ul><li>Improving internal processes to maximize efficiency.</li></ul><p></p><p><b>What You Need to Succeed</b></p><p>This is a demanding position where only highly-motivated, self-driven candidates will excel. Qualified candidates should have 3 - 5 years of relevant professional experience. All applicants must possess the following qualities: </p><p></p><ul><li>Commerce data experience</li><li>Previous use of Google Analytics. While you will be using a variety of analytics and BI tools, GA experience is necessary.</li><li>Aptitude for problem solving </li><li>Strong quantitative analysis skills</li><li>Excellent written and spoken communication skills and good presentation skills</li><li>Expertise with a database language (e.g. SQL, MongoDB)</li><li>Track record of learning new skills and putting them to use immediately</li><li>Customer or client facing experience</li><li>Sense of ownership and pride in your performance and that of the company</li></ul><p></p><p></p><p></p><p>At Adobe, you will be immersed in an exceptional work environment that is recognized throughout the world on <u>Best Companies lists</u>. You will also be surrounded by colleagues who are committed to helping each other grow through our unique <u>Check-In</u> approach where ongoing feedback flows freely.</p><p></p><p>If you’re looking to make an impact, Adobe's the place for you. Discover what our employees are saying about their career experiences on the Adobe Life blog and explore the meaningful benefits we offer.</p><p></p><p>Adobe is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of race, gender, religion, age, sexual orientation, gender identity, disability or veteran status.</p>"}