{"job title": "Associate Scientist", "company": "APN Software Services Inc.", "city state": "– Hackettstown, NJ, US", "rating": "3.9", "job description": "<div>\nAssociate Scientist</div> <div>\nDuration:10-11 months</div><div>\nLocation: Hackettstown NJ.</div><div>\n\n\n<ul>\n<li>** Pay Rate is $25 an hour *** Desired start date is 3/1/18</li>\n</ul>\n\nJob Purpose/Overview\n<br><br>\nThe External Manufacturing Associate Scientist role supports external manufacturing quality initiatives in the region to ensure the ongoing production of high quality and safe food products within the external manufacturing network. This role supports the implementation and verification of all applicable Mars Global Quality and Food Safety Standards throughout the External Manufacturing network. In addition, may also support qualification, product start up, performance management, and process improvement initiatives at Mars Wrigley Confectionery external manufacturing locations.\n<br><br>\nKey Responsibilities\n<br><br>\nPlease list the most important and relevant responsibilities\n\n\n<ul>\n<li>Supports the deployment and compliance of the Mars Global EMQM standard and other applicable standards within the External Manufacturing network</li>\n<li>Coordinates and conducts Product Verification program, including managing schedule for required shipments, verifying items meet internal specifications (weight, packaging, code date, etc), notifying site QA lead of non-conformances, supporting follow up activities and managing records.</li>\n<li>Supports the quality team in monthly metrics data collection and reporting.</li>\n<li>Manage customer inquiries and provide response on quality programs and certifications. •</li>\n</ul>\n\nContext and Scope\n<br><br>\nComplete how the job gets done and the way it operates (impact and interaction)\n\n\n<ul>\n<li>This position will be based at the MWC National Office in Hackettstown, NJ</li>\n<li>Will be required to interact with internal cross-functional team as well as External Manufacturing partners.</li>\n</ul>\n\nMinimum qualifications\n\n\n<ul>\n<li>Background in Chemistry, Food Science, Engineering or related technical field required</li>\n</ul>\n\nPreferred\n\n\n<ul>\n<li>AS or BS degree in Chemistry, Food Science, Engineering or related</li>\n<li>Knowledge/Experience</li>\n<li>Experience in a technical area such as Quality &amp; Food Safety, R&amp;D product development, laboratory management, or food process engineering</li>\n<li>Excellent interpersonal skills and the ability to work independently and as a member of a team</li>\n<li>Strong Microsoft Excel skills</li>\n</ul>\n\nPreferred\n\n\n<ul>\n<li>Understanding of Good Manufacturing Practices (GMPs), Good Laboratory Practices (GLPs), HACCP, Sensory, Microbiology, Regulatory and Food Law guidelines</li>\n<li>Experience or understanding of GFSI systems such as SQF, BRC and FSSC 22000</li></ul></div>\n"}