{"job title": "Associate Scientist II, CPD", "company": "bluebird bio", "city state": "– Cambridge, MA", "rating": "4.4", "job description": "<strong>Associate Scientist</strong>\n<br><br>\n<strong>Cellular Process Development</strong>\n<br><br>\n<em>Stem cell therapies</em>\n<br><br>\n<strong><em>bluebird bio is developing potentially transformative, one-time gene therapies for severe genetic and orphan diseases. At the heart of bluebird bio's product creation efforts is its broadly applicable gene therapy platform for the development of new treatments for diseases with few or no clinical options. bluebird bio has two clinical stage product candidates in development, one for childhood cerebral adrenoleukodystrophy (CCALD) and one for beta-thalassemia major/sickle cell disease, and an early stage oncology program in partnership with Celgene Corporation.</em></strong>\n<br><br>\nJoin bluebird bio's enthusiastic and collaborative team by contributing to the overall success of our novel gene therapy approach. The focus of this position is to provide support for the testing and development of new assays for characterization clinical samples. We are looking for a motivated associate scientist with the experience and drive to take ownership of important development and characterization projects.\n<br><br>\n<strong>Activities include:</strong>\n\n<ul>\n<li>Support studies into variables that effect recovery of CD34+ cells from mobilized peripheral blood and bone marrow</li>\n<li>All aspects of mammalian cell culture, including media and buffer preparation, culture initiation, propagation, and cryopreservation of cells, including primary human cells</li>\n<li>Perform complex technical work related to stem cell biology, viral gene transfer, and molecular biology, including tissue culture, flow cytometry and RT-PCR</li>\n<li>Coordinate acquisition of samples from clinical sites, including communications with internal Quality, Clinical and Logistics functions</li>\n<li>Preparation of cells to meet the demands of multiple concurrent projects that may require working evenings and occasional weekends</li>\n<li>Performance of general laboratory tasks, including maintenance of equipment</li>\n<li>Maintain accurate and reliable record keeping including database management, batch records, notebooks, and all other pertinent documentation</li>\n</ul>\n<strong>Preferred Qualifications:</strong>\n\n<ul>\n<li>BS cell biology, immunology or related discipline with at least 2 years experience in the biotechnology or pharmaceutical industry or MS cell biology, immunology or related discipline with 0 years experience in the biotechnology or pharmaceutical industry</li></ul>\n\n\n<ul>\n<li>Willingness to work with lentiviral vector and human biological samples</li>\n<li>Ability to take ownership of projects and results</li></ul>\n\n\n<ul>\n<li>Independently motivated, detail oriented and good problem solving ability</li>\n<li>Excellent organizational skills, sufficient to multi-task in a fast-paced environment with changing priorities</li>\n<li>Strong verbal and written skills; ability to provide focus and clarity; able to handle confidential information and material appropriately</li>\n<li>Well versed in a variety of cell based methods with a strong understanding of tissue culture, cell biology, immunoassays, and general laboratory techniques.</li></ul>\n\n\n<ul>\n<li>Working knowledge of various computer software, hardware, and standard office sufficient to record scientific data and results, and prepare reports.</li></ul>\n\n\n<ul>\n<li>Ability to work in a team environment, meet deadlines, and prioritize and balance work from multiple individuals</li>\n<li>Ability to work effectively in a collaborative team environment where results are achieved through influence and the incorporation of multiple points of view</li></ul>\n\n\n<ul>\n<li>Be ready to embrace the principles of the bluebird bio culture: <em>b colorful, b cooperative, and b yourself</em></li>\n</ul>"}