{"job title": "Scientist, Mammalian Aging", "company": "Calico", "city state": "– South San Francisco, CA", "rating": "5.0", "job description": "<strong>Who we are</strong>\n<br><br>\nCalico is a research and development company whose mission is to harness advanced technologies to increase our understanding of the biology of aging. Our longer term mission will utilize this knowledge to devise interventions that enable people to lead longer and healthier lives. Executing on this mission will require an unprecedented level of interdisciplinary effort and a long-term focus for which funding is already in place.\n<br><br>\n<strong>Position description</strong>\n<br><br>\nCalico is seeking a scientist to join a cutting-edge laboratory focused on tackling aging through basic research and translational efforts. Aging is a multifaceted process, and the lab studies aging at the system level in mammalian models by employing automated monitoring technologies to quantify multiple aspects of physiological decline simultaneously in individual animals. The lab also tests translational aging interventions using these technologies.\n<br><br>\nIn this role, you will design, plan, and execute studies aimed at quantifying and ameliorating mammalian aging to an unprecedented degree. This will entail generating, analyzing, and visualizing rich, multi-dimensional time-series from mouse models, as well as organizing and guiding the activities of an interdisciplinary team of scientists, computational biologists, and engineers. The ideal candidate is someone who likes to test ideas with their own hands, uses the right tool for the job whether it's a pipette or a code block, and can integrate diverse sources of information into a cohesive whole.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nPosition requirements\n\n<ul>\n<li>Ph.D. in biological sciences, physiology, computational biology, or related field</li>\n<li>2+ years of postdoc experience or relevant work experience</li>\n<li>Experience analyzing large datasets using Python or R, with statistical know-how</li>\n<li>Experience with mouse research, particularly quantifying metabolism, physiology and behavior</li>\n<li>Clear verbal and written communication skills</li>\n<li>An unquenchable drive to bring order out of chaos</li>\n</ul>\nHighly valued qualifications\n\n<ul>\n<li>Demonstrated ability to be a creative driver and organizer of complex, collaborative projects involving people from very diverse backgrounds</li>\n<li>Experience with high-dimensional longitudinal data</li>\n<li>Experience with molecular biology, protein analysis, and mammalian cell culture</li>\n<li>Experience with video data</li>\n</ul>"}