{"job title": "Research Scientist", "company": "Eli Lilly and Company", "city state": "– Indianapolis, Indiana", "rating": "3.8", "job description": "Research Scientist\n<br><br>\n05-Sep-2018\n<br><br>\n03-Jan-2019\n<br><br>\n<strong>Responsibilities</strong>\n<br>\n<div> The Clinical Project Statistician develops or assists in the development of protocol designs, clinical plans, and data analysis plans in collaboration with physicians, veterinarians, and/or medical colleagues. The Clinical Project Statistician is responsible for working with research associates and scientists to establish a reporting database and for analyzing data for these types of studies.\n<br><br>\nThe job tasks listed below outline the scope of the position. The application of these tasks may vary, based upon current business needs.\n<br><br>\nStatistical Trial Design and Analysis\n\n<ul>\n<li>Operate in collaboration with study personnel to provide input on study protocol, design studies and write protocols for the conduct of each study.</li> <li>Assist in or be accountable for selecting statistical methods for data analysis, authoring the corresponding sections of the protocol, and conducting the actual analysis once a reporting database is created.</li> <li>Collaborate with data management in the planning and implementation of data quality assurance plans.</li> <li>Maintain currency with respect to statistical methodology, to maintain proficiency in applying new and varied methods, and to be competent in justifying methods selected.</li> <li>Participate in peer-review work products from other statistical colleagues.</li> <li>Communication of Results and Inferences Collaborate with team members to write reports and communicate results. Assist with, or be responsible for, communicating study results via regulatory submissions, manuscripts, or oral presentations in group settings, as well as for communicating one-on-one with key customers and presenting at scientific meetings.</li> <li>Respond to regulatory queries and to interact with regulators. Therapeutic Area Knowledge\n<br>\nUnderstand disease states in order to enhance the level of customer focus and collaboration and be seen as a strong scientific contributor.</li>\n</ul>\n\nRegulatory Compliance\n\n<ul>\n<li>Perform work in full compliance with assigned curriculum(s) and will be responsible for following applicable Corporate, Medical, local, and departmental policies, procedures, processes, and training.</li>\n</ul>\n\nThe Project Statistician at this level provides statistical leadership in multiple dimensions including:\n\n<ul>\n<li>Introduces and applies innovative methodology and tools to solve critical problems</li> <li>Merges scientific thinking &amp; business knowledge to identify &amp; impact business issues.</li> <li>Drives projects internally (or externally), and works effectively across functions.</li> <li>Uses technical expertise to influence business decisions.</li> <li>Identifies broad technical issues, drives assessment of options and implements robust solutions.</li> <li>Has broad understanding of regulatory environment; demonstrates leadership on regulatory issues.</li></ul></div>\n\n<br><strong>Req ID</strong>\n<br>\n<strong>44475BR</strong>\n<br><br>\n<strong>Additional Skills/Preferences</strong>\n<br>\n<div><div>\n\n<ul>\n<li>Proficiency in statistical programming languages/software such as SAS, R, Spotfire, WinBUG, etc.</li> <li>Interpersonal communication skills for effective customer consultation</li> <li>Teamwork and leadership skills</li> <li>Technical growth and application with working knowledge of experimental design and statistics</li> <li>Self-management skills with a focus on results for timely and accurate completion of competing deliverables</li> <li>Resource management skills</li> <li>Creativity and innovation</li> <li>Demonstrated problem solving ability and strategic thinking</li> <li>Business process expertise associated with critical activities (e.g. regulatory submissions)</li></ul></div>\n</div>\n\n<br><strong>Additional Information</strong>\n<br>\n<div>Lilly is an EEO/Affirmative Action Employer, and does not discriminate on the basis of race, gender, protected veteran status, disability or any other legally protected status</div>\n\n<br><strong>Title</strong>\n<br>\nResearch Scientist - Statistician\n<br><br>\n<strong>Job Category</strong>\n<br>\nScience\n<br><br>\n<strong>Basic Qualifications</strong>\n<br>\n<div>\n\n<ul>\n<li>Master’s degree in Statistics/ Biostatistics or related field with at least 9 years of clinical trial experience in pharmaceutical industry.</li> <li>Qualified candidates must be legally authorized to be employed in the United States. Lilly does not anticipate providing sponsorship for employment visa status (e.g., H-1B or TN status) for this employment position.</li></ul></div>\n\n<br><strong>Company Overview</strong>\n<br>\n<div>Lilly is a global health care leader that unites caring with discovery to make life better for people around the world. For more than a century, we have stayed true to a core set of values—excellence, integrity, and respect for people—that guide us in all we do: discovering medicines that meet real needs, improving the understanding and management of disease, and giving back to communities. We also are committed to investing in our employees and supporting a culture of well-being —through competitive pay, comprehensive employee benefit programs, and training and development resources.\n<br><br>\nWe’re doing extraordinary things. Join us and you could be, too!</div>\n\n<br><strong>City</strong>\n<br>\nIndianapolis\n<br><br>\n<strong>Country</strong>\n<br>\n<strong>USA</strong>\n<br><br>\n<strong>State / Province</strong>\n<br>\nIndiana\n<br><br>\n<strong>Region</strong>\n<br>\nNorth America\n<br>"}