{"job title": "Data Engineer", "company": "InVisionApp", "city state": "– San Francisco, CA", "rating": "4.6", "job description": "InVision is the digital product design platform used to make the world's best customer experiences. We provide design tools and educational resources for teams to navigate every stage of the product design process, from ideation to development. Today, more 4 million people use InVision to create a repeatable and streamlined design workflow; rapidly design and prototype products before writing code, and collaborate across their entire organization. That includes more than 80 percent of the Fortune 100, and organizations like Airbnb, Amazon, HBO, Netflix, Slack, Starbucks and Uber, who are now able to design better products, faster.\n<br><br>\nOur team is in search of an awesome Data Engineer to help us change the way digital products are designed.\n<br><br>\n<strong>About the Team:</strong>\n<br><br>\nInVision's Data Science &amp; Engineering team helps the rest of the business to measure and analyze the impact of ongoing product changes. This allows us to make data-driven decisions about what to build next: and do more of what works, less of what doesn't.\n<br><br>\nBuilding, scaling, and owning a high-volume data pipelinefrom the frontend event code all the way back to the data warehouserequires constant collaboration with the brightest people in the organization. Whether you're at a beach house in Hawaii or a coffee shop on the East Coast, you'll have the support of brilliant developers, analysts, and scientists at your fingertips to get you through and keep the workday challenging and fun.\n<br><br>\n<strong>What you'll do:</strong>\n\n<ul>\n<li>Supporting and scaling the pipeline that relays data from InVision's production applications back to our warehouse. This includes:</li>\n\n\n<ul>\n<li>Writing, operating, and documenting analytics libraries for our production apps.</li>\n<li>Replicating state and events from MySQL, MongoDB, and Kafka using various third party tools.</li>\n<li>Maintaining and extending scripts and components to consume raw event data into our warehouse.</li>\n<li>Monitoring and tuning Redshift.</li>\n</ul>\n\n<li>Organizing our data warehouse to be a self-explanatory, self-documenting, performant resource for product managers, engineers, and business analysts.</li>\n<li>Working with our data scientists to tune and improve shared scripts for postprocessing raw data into clean, easy-to-analyze schemas.</li>\n<li>Restructuring our warehouse to support increasingly sophisticated and more real-time analysis.</li>\n<li>Investigating new technologies for incorporation into our architecture.</li>\n<li>Helping engineers implement best practices for measuring the business impact of their features.</li>\n</ul>\n<strong>What you'll bring:</strong>\n\n<ul>\n<li>1+ years of experience designing, implementing and operating production ETL and data pipelines.</li>\n<li>Full stack development experience, especially writing APIs and/or libraries called by coworker teams.</li>\n<li>A track record of maintaining databases (MySQL, Redshift, etc.) and/or querying them performantly.</li>\n<li>A quality mentality: You write automation, do spot checks, and get creative to make sure the data you've stored tells the true, accurate story of what happened.</li>\n<li>Excellent communication and collaboration skills with coworkers, teams, and stakeholders.</li>\n</ul>\n<strong>About InVision:</strong>\n<br><br>\n<strong>InVision offers an incredibly unique work environment.</strong> The company employs a diverse team all over the world. Each InVision team member is given the freedom and tools to do their best work from wherever they choose.\n<br><br>\nThe benefits we offer in the United States and Canada include competitive health plans and a retirement plans. Some InVision-wide benefits offered to all employees across the globe include a flexible vacation policy, monthly coffee shop stipends, annual allowances for books related to your profession, and home office setup &amp; wellness reimbursements. InVision is an international employer so some benefit offerings will vary from country to country.\n<br><br>\nInVision is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. If you have a disability or special need that requires accommodation, please let us know."}