{"job title": "Analytical Scientist - Method Validation", "company": "Kelly Services", "city state": "– Cherry Hill, NJ", "rating": "3.5", "job description": "<p><strong>Analytical Scientist – Method Validation</strong></p>\n\n<p>1+ Year Contract</p>\n\n<p> </p>\n\n<p>The Scientist is responsible for stability assessment and validation activities associated with pre-commercialization drug product development projects. Specific activities include; execution of studies to evaluate the influence of a variety of environmental factors, such as temperature, humidity, and light, and execution protocols for analytical method validation. This position is laboratory based role, but will include generation of study reports.</p>\n\n<p> </p>\n\n<p><strong>Responsibilities:</strong></p>\n\n<ol>\n\t<li>Responsible executing analytical method validation protocols</li>\n\t<li>Responsible for executing simulated environmental excursion studies.</li>\n\t<li>Accurately interprets, troubleshoots, and completes non-routine procedures when necessary.</li>\n\t<li>Responsible, in collaboration with management, to develop and achieve project timelines.</li>\n\t<li>Effectively communicate work activities both orally and in writing. Participate in cross departmental project teams as required.</li>\n\t<li>Document test data clearly and accurately. Maintain data integrity and ensure compliance with company policies, procedures, cGMPs, and regulatory requirements.</li>\n</ol>\n\n<p> </p>\n\n<p><strong>Qualifications:</strong></p>\n\n<ul>\n\t<li>B.S. / B.A. in chemistry or closely related field with 3 years, or more, of relevant hands-on experience in a GMP compliant pharmaceutical laboratory.</li>\n\t<li>Must have experience in validation of chromatographic methods such as HPLC and GC</li>\n\t<li>Must have understanding of laboratory instruments and methods for evaluation of pH, gravimetric analysis, assay by titration, assay by UV / Vis spectroscopy, and chromatographic assay / purity.</li>\n\t<li>Ability to use software tools such MS Excel and MS Word to generate results and data.</li>\n\t<li>Knowledge of Waters Empower Chromatography Data Software is desired.</li>\n</ul>\n<br><br><p>\n\n</p><div>Why Kelly®?</div><p></p>\n <p>With Kelly, youll have access to some of the worlds highest-regarded scientific organizations\n\nproviding you with opportunities to work on todays most challenging, research-intensive, and relevant \n\nprojects. Our connections can lead you to innovative scientific pursuits youll be proud to help \n\nadvance. We work with 95 of the Fortune 100 companies, and found opportunities for more than 9,000 \n\nscientific professionals last year.\n\n</p><p>You pursued a career in science to fuel your quest for knowledge and your desire to make the world \n\na better place. Let Kelly fuel your careerconnect with us today.</p>\n\n<p></p><div>About\nKelly Services®</div><p></p>\n\n<p>As a workforce advocate for over 70 years, we are proud to directly employ nearly 500,000 people around the world and have a role in connecting thousands more with work through our global network of talent suppliers and partners. Revenue in 2017 was $5.4 billion. Visit <u>kellyservices.com</u> and connect \n\nwith us on <u>Facebook</u>, <u>LinkedIn</u> and <u>Twitter</u>. \n\n</p><p>Kelly Services is an equal opportunity employer including, but not limited to, Minorities, Females, \n\nIndividuals with Disabilities, Protected Veterans, Sexual Orientation, Gender Identity and is \n\ncommitted to employing a diverse workforce. <u>Equal Employment Opportunity \n\nis The Law.</u></p>"}