{"job title": "Research Scientist", "company": "KLA-Tencor Corporation", "city state": "– Milpitas, California", "rating": "3.7", "job description": "<strong>Company Overview</strong>\n<br><br>\nCalling the adventurers ready to join a company that's pushing the limits of nanotechnology to keep the digital revolution rolling. At KLA-Tencor, we're making technology advancements that are bigger—and tinier—than the world has ever seen.\n<br><br>\nWho are we? We research, develop, and manufacture the world's most advanced inspection and measurement equipment for the semiconductor and nanoelectronics industries. We enable the digital age by pushing the boundaries of technology, creating tools capable of finding defects smaller than a wavelength of visible light. We create smarter processes so that technology leaders can manufacture high-performance chips—the kind in that phone in your pocket, the tablet on your desk and nearly every electronic device you own—faster and better. We're passionate about creating solutions that drive progress and help people do what wouldn't be possible without us. The future is calling. Will you answer?\n<br><br>\n<strong>Group / Division</strong>\n<br><br>\nWith over 40 years of semiconductor process control experience, chipmakers around the globe rely on KLA-Tencor to ensure that their fabs ramp next-generation devices to volume production quickly and cost-effectively. Enabling the movement towards advanced chip design, KLA-Tencor's Global Products Group (GPG), which is responsible for creating all of KLA-Tencors metrology and inspection products, is looking for the best and the brightest research scientist, software engineers, application development engineers, and senior product technology process engineers.\n<br><br>\nThe LS-SWIFT Division of KLA-Tencors Global Products Group provides patterned wafer inspection systems for high-volume semiconductor manufacturing. Its mission is to deliver market-leading cost of ownership in defect detection for a broad range of applications in the production of semiconductors. Customers from the foundry, logic, memory, automotive, MEMS, advanced packaging and other markets rely upon high-sample wafer inspection information generated by LS-SWIFT products.\n<br><br>\nLS (Laser Scanning) systems enable cost-effective patterned wafer defect detection for the industrys most sophisticated process technologies deployed in leading-edge foundry, logic, DRAM, and NAND fabs. SWIFT (Simultaneous Wafer Inspection at Fast Throughput) systems deliver all-wafer-surface (frontside, backside, and edge) macro inspection that is critical for automotive IC, MEMS, and advanced packaging processes as well as foundry/logic and memory fabs.\n<br><br>\nLS-SWIFT operates from a global footprint that includes the US, Singapore, India and Germany, and serves a worldwide customer base across Asia, Europe and North America.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nThe Research Scientist will be responsible for designing and conducting feasibility investigations to provide valuable guidance for KLA-Tencor's roadmap in optical wafer inspection and metrology.\n<br><br>\nThe advent of devices having 10nm and smaller design rules, using advanced processes and materials, presents a particularly challenging goal of maintaining high-speed inspection, metrology and classification defects.\n<br><br>\nThe Research Scientist will work within a small technology group to identify and develop promising new concepts, methods and subsystems that could be used to meet these challenges. Developing special optical benches and testing apparatus, the Scientist will devise and conduct experiments and imaging trials, and will also work with Applications and Design Engineers to investigate new uses of our existing inspection and metrology tools. The Research Scientist will acquire, analyze and present his/her data to the technology group and to the rest of the organization.\n<br><br>\n<strong>Preferred Qualifications</strong>\n<br><br>\n<strong>M.S./Ph.D. in a scientific or engineering field that involves electro-optical detection, metrology or imaging is required</strong>, along with 2 to 4 years of relevant industry or academic experience.\n<br><br>\nA Ph.D. in any of these fields is preferred. The successful candidate will have a proven record of designing highly complex experiments or engineering trials that involve sophisticated optical data collection and other physical measurements. The candidate will also have proficiency in data analysis packages such as MATLAB and demonstrate the ability to extract clear results from large, complex data sets. Excellent communication and presentation skills are required.\n<br><br>\n<strong>Minimum Qualifications</strong>\n<ul>\n<li>Doctorate (Academic) with 2-4 years of industry or academic experience, OR</li><li>Master's Level Degree with at least 4 years of experience.</li>\n</ul>\nKLA-Tencor is an Equal Opportunity Employer. Applicants will be considered for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristics protected by applicable law.\n<br><br>\nJob Type: Full-time\n<br><br>\nEducation:\n<ul>\n<li>Master's (Required)</li>\n</ul>\nWork authorization:\n<ul>\n<li>United States (Required)</li>\n</ul>"}