{"job title": "Research Scientist", "company": "Lyft", "city state": "– San Francisco, CA", "rating": "4.0", "job description": "<div>At Lyft, community is what we are and its what we do. Its what makes us different. To create the best ride for all, we start in our own community by creating an open, inclusive, and diverse organization where all team members are recognized for what they bring.</div><br>\n\n<div>Lyfts Research Science Team builds mathematical models underpinning the platforms core services. Compared to other technology companies of a similar size, the set of problems that we tackle is incredibly diverse. They cut across optimization, prediction, modeling, inference, transportation, and mapping. We are hiring motivated experts in each of these fields. The ideal candidate is a critical thinker, is passionate about solving mathematical problems with data, and is excited about working in a fast-paced, innovative and collegial environment.</div>\n<br>\n<strong>Responsibilities:\n<br>\n</strong>\n<br>\n<div>\n\n\n<ul>\n<li>Work with Engineers, Product Managers, and Business Partners to frame problems, both mathematically and within the business context.</li>\n<li>Perform exploratory data analysis to gain a deeper understanding of the problem</li>\n<li>Construct and fit statistical, machine learning, or optimization models</li>\n<li>Write production modeling code; collaborate with Software Engineers to implement algorithms in production</li>\n<li>Design and run both simulated and live traffic experiments</li>\n<li>Analyze experimental and observational data; communicate findings; facilitate launch decisions</li>\n</ul>\n\n<strong>Experience &amp; Skills:\n<br><br>\n</strong>\n\n\n<ul>\n<li>M.S. or Ph.D. in Statistics, Operations Research, Mathematics, Computer Science, or other quantitative fields</li>\n<li>4+ years professional experience</li>\n<li>Passion for solving unstructured and non-standard mathematical problems</li>\n<li>End-to-end experience with data, including querying, aggregation, analysis, and visualization</li>\n<li>Proficiency with Python, or another interpreted programming language like R or Matlab</li>\n<li>Willingness to collaborate and communicate with others to solve a problem</li>\n</ul>\n<em>Lyft is an Equal Employment Opportunity employer that proudly pursues and hires a diverse workforce. Lyft does not make hiring or employment decisions on the basis of race, color, religion or religious belief, ethnic or national origin, nationality, sex, gender, gender identity, sexual orientation, disability, age, military or veteran status, or any other basis protected by applicable local, state, or federal laws or prohibited by Company policy. Lyft also strives for a healthy and safe workplace and strictly prohibits harassment of any kind. Pursuant to the San Francisco Fair Chance Ordinance and other similar state laws and local ordinances, and its internal policy, Lyft will also consider for employment qualified applicants with arrest and conviction records.</em></div>\n<br>"}