{"job title": "Principal Data Engineer", "company": "Target", "city state": "– Sunnyvale, California", "rating": "3.4", "job description": "Description: <div><strong>JOIN US AS A PRINCIPAL DATA ENGINEER</strong></div><div></div><div>Join Targets Data Science &amp; Engineering team in Sunnyvale as a Principal Data Engineer Data Architect. Here we employ cutting edge technologies to help Target meaningfully engage with guests and make intelligent business decisions using huge data sets. Our Data Engineers partner closely with Data Scientists continuously innovating to harness valuable insights from data generated. Youll work in an environment that provides the freedom and agility of a startup with the security and vast resources of a large established company.</div><div>As a Principal Data Engineer, youll get the chance to design and architect high quality, flexible, manageable and performant systems and services. You will architect solutions that will capture, manage, process and serve small to large data at scale. This role allows you to work with business partners to provide technical solutions for business problems on a large scale in a fast moving retail data industry. Responsibilities will include analyzing, designing, programing, debugging, modifying software for existing and new, proprietary data products used in distributed, large scale analytics solutions.</div><div>Were looking for a highly motivated engineering professional who will partner with Lead Technical Product Owners and management at one end as well as lead and motivate Scrum development teams on the other.</div> <div><strong>Key Responsibilities:</strong> </div>\n\n<ul>\n<li><div>Lead decision-making process for selection of software products and architecture solutions</div></li><li><div>Develop software systems using test driven development employing continuous integration practices</div></li><li><div>Mentor and partner with engineers to develop software that meets business needs</div></li><li><div>Follow agile methodology for software development and technical documentation</div></li><li><div>Innovate constantly and keep systems up to date with current technologies</div></li>\n</ul>\n\n<strong><div>Requirements:</div>\n<br>\n</strong>\n\n<ul>\n<li><div>MS or PhD degree in Computer Science or equivalent experience in data architecture</div></li><li><div>10+ years of experience in developing software applications</div></li><li><div>3+ years of experience working on Big Data products - preferred experience with Hadoop, Spark, Hive, Druid, etc.</div> </li><li><div>Proficient in application/software architecture (Definition, Business Process Modeling, etc.)</div></li><li><div>Extensive understand of application/software development and design</div></li><li><div>Collaborative personality ability to engage in interactive discussions with diverse engineering teams</div></li><li><div>Stays current and up to date on Big Data technology and trends</div></li><li><div>Experience mentoring and developing skillsets of data engineers</div> </li>\n</ul>\n\n<strong>Qualifications:</strong>"}