{"job title": "Biology Scientist 2", "company": "Tekwissen", "city state": "– Menlo Park, CA", "rating": "4.1", "job description": "Job Description<div><strong>Job Title:</strong> Biology Scientist 2\n<br><br>\n<strong>Duration:</strong> 7 Months\n<br><br>\n<strong>Job Description Summary\n<br>\nThe Scientist II is responsible for participating in the development of new genomics products and making improvements to existing genomics products. Documents experiments in a concise and organized manner. Troubleshoot according to established procedures. Executes experiments independently and evaluates, discusses, presents and explains data of moderate complexity. Works under general direction, but may independently determine and define solutions to experimental problems.\n<br><br>\n<strong>Job Description</strong>\n<br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Supporting the development of new molecular products and technologies.</li>\n<li>Performing reagent and workflow experiments to prove feasibility, develop, optimize, verify and validate, under the general supervision of a senior level scientist.</li>\n<li>Contributing to the development of new procedures and user guides, e.g. Editing and providing technical input.</li>\n<li>Following existing protocols.</li>\n<li>Working with a senior level scientist to ensure Design History Files are accurate and complete.</li>\n<li>Working according to product development procedures.</li>\n<li>Contributing to the completion of milestones associated with specific project plans.</li>\n<li>Developing knowledge of Biosciences products through training.</li>\n<li>Working under general supervision.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>General knowledge of molecular biology, biochemistry or a related discipline.</li>\n<li>Specific knowledge of NGS instrumentation and data analysis.</li>\n<li>Experienced in NGS library preparation and sequencing.</li>\n<li>Familiarity with general cell culture techniques.</li>\n<li>Familiarity with operation of standard laboratory instruments.</li>\n<li>Effective oral and written communication skills.</li>\n<li>Effective interpersonal skills.</li>\n<li>Demonstrated analytical and problem-solving skills.</li>\n<li>Demonstrated ability to keep accurate and complete laboratory records and logs.</li>\n</ul>\n\n<strong>Education and Experience:</strong>\n\n\n<ul>\n<li>Bachelor’s degree in a biological science discipline preferred.</li>\n<li>Minimum 2 years of relevant experience.</li>\n</ul>\n\nSkills needed\n<br>\nResearch associate, lab experience, molecular, cells, PCRs. Etc.</strong></div>Company Description<div>TekWissen Is Hiring!!</div>"}