{"job title": "Scientist - Chemist", "company": "Washington River Protection Solutions", "city state": "– Richland, WA", "rating": "3.6", "job description": "TitleScientist - Chemist\n<br><br>\nPosition Number30733\n<br><br>\nCompanyWA River Protection Solutions\n<br><br>\nLocation200W\n<br><br>\nPosted08/14/2018\n<br><br>\nCloses09/13/2018\n<br><br>\nRegular/TemporaryRegular\n<br><br>\nJob Responsibilities/Duties\n<br><br>\nThe Scientist - Chemist position within analytical Organic Studies group is responsible for performing as the functional lead for client projects, supporting analysis of Hanford Tank Farm vapor samples, special analytical studies, method development and process improvements. This organization is accountable for the effective utilization of technical resources to meet unique client needs directed at the acceleration of Hanford Site cleanup missions including Hanford Tank Vapor sample analysis, Industrial Hygiene Vapor sample analysis, waste and environmental sample analysis, process control support, field and sampling services, and expertise in chemistry and data quality.This position provides leadership in directing the analytical activities of the Engineering Technicians and works with other scientists in accomplishing group goals to obtain results. This position focuses on Industrial Hygiene Vapor analysis and includes the development of new processes and procedures especially in the fields of Gas Chromatography/ Mass Spectrometry and Liquid Chromatography/ Mass Spectrometry at the 222-S Laboratory. Requires the ability to assess and diagnose problems with GC/MS and LC/MS analyses and equipment, as well as to develop alternative strategies for resolution. As a member of the Organic Studies group encountering and resolving problems is routine. Assists and helps guide the technicians in troubleshooting and repairing problems with the analyses or equipment, setting up equipment or experiments, and other over site activities. Working with other organizations at the facility such as maintenance crafts to trouble shoot equipment is also required. Oversight and assistance is available, but development of alternatives for solving problems is required.\n<br><br>\nRequired Qualifications\n<br><br>\nBachelors of Science in Chemistry and a minimum of 7 years direct analytical laboratory experience\n<br><br>\n<strong>Desired Qualifications</strong>\n<br><br>\nMaster's Degree or PhD degree desired. 1 year nuclear experience desired.\n<br><br>\nRelocation Funding ProvidedYes\n<br><br>\nU.S. Citizenship RequiredYes\n<br><br>\nClearance RequiredNo\n<br><br>\nJob ClassificationExempt\n<br><br>\nShift Work RequiredNo\n<br><br>\nThis contractor shall abide by the requirements of 41 CFR ?? 60-1.4(a), 60-300.5(a) and 60-741.5(a). These regulations prohibit discrimination against qualified individuals based on their status as protected veterans or individuals with disabilities, and prohibit discrimination against all individuals based on their race, color, religion, sex, or national origin. Moreover, these regulations require that covered prime contractors and subcontractors take affirmative action to employ and advance in employment individuals without regard to race, color, religion, sex, national origin, protected veteran status or disability.\n<br><br>\nEEO It's the Law Poster\n<br><br>\nApplicants and employees are protected under federal law against discrimination. To view information regarding these rights, please click on these links:\n<br><br>\n+ EEO is the Law poster\n<br><br>\n+ EEO is the Law Poster Supplement\n<br><br>\n+ Pay Transparency Policy Statement"}