{"job title": "Scientist I - Chemistry", "company": "Zolon Tech", "city state": "– South San Francisco, CA", "rating": "3.7", "job description": "Job Description<div><strong>Job Description:</strong>\n<ul>\n<li>This is an exciting opportunity to become part of a multi-disciplinary group advancing the Ion Torrent next generation sequencing platform.</li><li>You will play a vital role toward our mission of enabling our customers to make the world healthier, cleaner and safer.</li>\n</ul>\n<strong>Key responsibilities:</strong>\n<ul>\n<li>Perform biology and chemistry related activities on the Ion Torrent sequencing platforms. These activities may include production and characterization of samples, instrument support, surface chemistry, sequencing, microscopy and data analysis Interact within Chemistry R&amp;D, Product and Process Development groups, Semiconductor Device Fabrication R&amp;D, and others Develop new analytical tools and assays as needed to analyze data, derive conclusions, document findings and prepare reports for sharing within and between R&amp;D groups Conduct experiments and troubleshooting activities to support new product development and resolve technical issues Assist with preparing protocols, reports, and test methods Maintain detailed records and documentation</li>\n</ul>\n<strong>Required Skills:</strong>\n<ul>\n<li>Experience working in a lab environment Experience in a structured workflow (manufacturing, QC, GXP, etc.) is highly desirable Experience with common molecular biology techniques used with DNA Experience with microscopy and image analysis Knowledge of next generation sequencing techniques is highly desirable Experience with programming languages (R, python, etc.)</li><li>Anticipate needs and problems while creating solutions.</li><li>Not always instruction-based Demonstrates a sense of urgency, contagious optimism and a \"can do \" attitude Is curious, inquisitive, innovative, never satisfied with the status quo Greets challenge and change as opportunity Collaborates with others and strong orientation towards team work Embraces and leverages diversity of culture and thought</li>\n</ul>\n<strong>Education/ Experience Requirements:</strong>\n<ul>\n<li> BS in materials science, chemistry, physics, biology, or a related field Minimum of 2 years' experience working in a lab environment</li></ul></div>\n<br>\nCompany Description<div>Zolon Tech, Inc. (ZTI) is a fast-growing, 8(a) certified business providing Information Technology solutions and services to Federal and commercial clients. ZTI is CMMI Level 3, ITIL, and ISO 20000 certified and is a leader in the IT industry. Headquartered in Herndon- VA.</div>"}