{"job title": "Data Analyst", "company": "Booz Allen Hamilton Inc.", "city state": "– Washington, DC", "rating": "3.7", "job description": "<strong>Job Number: R0037581</strong>\n<br><br>\nData Analyst, Mid<br><br><strong>The Challenge:</strong>\n<br><br>\nAre you excited at the prospect of unlocking the secrets held by a data set? Are you fascinated by the possibilities presented by the IoT, machine learning, and artificial intelligence advances? In an increasingly connected world, massive amounts of structured and unstructured data open up new opportunities. As a data scientist, you can turn these complex data sets into useful information to solve global challenges. Across private and public sectors from fraud detection, to cancer research, to national intelligence you know the answers are in the data.\n<br><br>\nWe have an opportunity for you to use your analytical skills to improve our client's processes and support the advancement of their important missions. Youll work closely with your customer to understand their questions and needs, and then dig into their data-rich environment to find the pieces of their information puzzle. Youll develop algorithms, build predictive analytics, and compose data visualizations and use the right combination of tools and frameworks to turn that set of disparate data points into objective answers to help federal customers make informed decisions. Youll provide your customer with a deep understanding of their data, what it all means, and how they can use it. Join us as we use data science for good in support of our federal customers.\n<br><br>\nEmpower change with us.\n<br><br>\n<strong>Build Your Career:</strong>\n<br><br>\nAt Booz Allen, we know the power of analytics and were dedicated to helping you grow as a data analysis professional. When you join Booz Allen, you can expect:\n<ul>\n<li>access to online and onsite training in data analysis and presentation methodologies, and tools like Hortonworks, Docker, Tableau, and Splunk</li><li>a chance to change the world with the Data Science Bowlthe worlds premier data science for social good competition</li><li>participation in partnerships with data science leaders, like our partnership with NVIDIA to deliver Deep Learning Institute (DLI) training to the federal government</li>\n</ul>\nYoull have access to a wealth of training resources through our Analytics University, an online learning portal specifically geared towards data science and analytics skills, where you can access more than 5000 functional and technical courses, certifications, and books. Build your technical skills through hands-on training on the latest tools and state-of-the-art tech from our in-house experts. Pursuing certifications? Take advantage of our tuition assistance, on-site bootcamps, certification training, academic programs, vendor relationships, and a network of professionals who can give you helpful tips. Well help you develop the career you want, as you chart your own course for success.\n<br><br>\n<strong>You Have:</strong>\n<br><br>\n-3+ years of experience with data analytics\n<br><br>\n-Experience with Microsoft Excel including Visual Basic for Applications (VBA)\n<br><br>\n-Experience with at least one data visualization tool, including Tableau, Qlik or Microsoft Power BI\n<br><br>\n-Experience with engaging directly with the client to design and develop impactful, dynamic, and insightful business intelligence visualizations, and dashboards.\n<br><br>\n-Ability to present results from large and complex data sets in a coherent and clear format, tailored for the audience, as needed\n<br><br>\n-Ability to develop deliverables, recommendations, and analysis independently\n<br><br>\n-Ability to obtain a security clearance\n<br><br>\n-BA or BS degree in Economics, Statistics or Mathematics\n<br><br>\n<strong>Nice If You Have:</strong>\n<br><br>\n-Experience with supporting federal clients\n<br><br>\n-Experience with multiple data visualization tools such as Tableau, Qlik or Microsoft Power BI\n<br><br>\n-Experience with Economics, Statistics or Mathematics\n<br><br>\n-Ability to work on multiple projects, multi-task, manage time effectively, and show flexibility in responding to conflicting deadlines or priorities\n<br><br>\n-Ability to serve as a technical resource and subject matter expert for visualization and computing platforms, and act as a liaison between software engineering teams and business stakeholders\n<br><br>\n-Possession of excellent client-facing and consulting skills\n<br><br>\n-Possession of excellent interpersonal communication skills\n<br><br>\n<strong>Clearance:</strong>\n<br><br>\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information.\n<br><br>\nWere an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change."}