{"job title": "Data Analyst", "company": "Charles Schwab", "city state": "– Phoenix, AZ", "rating": "3.5", "job description": "Description:<br><br>Phoenix - AZ, PHX4701A, 4701 E Francisco Dr, 85044-5365\n<br>\nDavid Slade\n<br>\n20180622-4145\n<br><br>\n<strong>We believe that</strong>, when done right, investing liberates people to create their own destiny. <strong>We are driven</strong> by our purpose to champion every client’s goals with passion and integrity. <strong>We respect</strong> and appreciate the diversity of our employees, our clients, and the communities we serve. <strong>We challenge</strong> conventions strategically to create value for our clients, our firm and the world. We live and bring to life the concept of ‘own your tomorrow’ every day. <strong>We champion</strong> our employee strengths, guide their development, and invest in their long-term success. <strong>We hire</strong> optimistic, results-oriented, curious, innovative, and adaptable people with the desire to help our clients and one another succeed.\n<br><br>\nAs a company, we were established by Chuck over 40 years ago to champion Main Street over Wall Street, and to help Americans transform themselves from earners to owners. Through advocacy and innovation, we work to make investing more affordable, accessible and understandable for all. As we enter our fifth decade, we are looking for talented, innovative and driven people who believe they can help themselves, and our clients, create a better future.\n<br><br>\n<strong>Our Opportunity:</strong>\n<br><br>\nWe are looking for a highly experienced, self-driven Data Analytics Developer and Data Manager, well versed in analytical and business intelligence reporting, relational databases, SQL, and data analysis. As a member of the Business Management office in the Technology Infrastructure Services team, you will work directly with technology and business partners to develop, define and establish data governance processes to ensure analytics and reporting are functioning from trusted and certified data sources.\n<br><br>\n<strong>What you’ll do:</strong>\n<br><br>\nYour work will include a high degree of data visualization and user-driven analysis capabilities geared toward driving action and business service reliability; it will provide predictive analysis to support improving reliability and availability of Schwab’s critical systems, and it will be the catalyst to drive the process of performing “Health Reviews” for systems exhibiting signs of instability.\n\n<ul>\n<li>Work aggressively toward developing and implementing a data governance model for data sources used in analytics and business insight development</li>\n<li>Coordinate, compile and analyze highly complex reporting requests for the organization from a variety of sources. Verifies data for accuracy and is able to identify inconsistencies and recommend corrective action</li>\n<li>Perform rigorous testing to assess the quality and accuracy of data in the system; support ideas and methodologies to ensure data quality</li>\n<li>Lead efforts in certification of data sources, data governance and auditing to ensure all data sources are compliant with quality, security, and compliance</li>\n<li>Prepare guidelines on accessing and building dashboards from the right data sources</li>\n<li>Partner with service assurance business intelligence teams on data governance methods, report and dashboard governance</li>\n<li>Work with business teams to understanding and document their business, analytical, and reporting needs, including the identification of critical metrics and KPIs</li>\n<li>Leverage strong analytical and problem solving skills to identify and deliver actionable insights to relevant decision makers</li>\n<li>Partner closely with internal cross-function technology team members and analysts to deliver reporting projects that solve business requirements</li>\n</ul>\n<strong>What you have:</strong>\n\n<ul>\n<li>5+ years of Data Analytics development, specific to Data Management and Data Manager role</li>\n<li>5+ years SQL structured programming, ad hoc queries, and data analysis development using Teradata, Oracle, and/or Microsoft SQL Server</li>\n<li>5+ years of experience in creating highly interactive data visualization Tableau Desktop &amp; Tableau Server dashboards using features such as data blending, extracts, LOD calculations, filters, actions, parameters, context filters, sets, groups and aggregate measures.</li> \n\n<li>Experience establishing and managing a data governance framework, data certification and standards</li>\n<li>Experience developing dashboard wireframes and design requirements based on discussion with an understanding of technical and visual design considerations</li>\n<li>Superb acumen for managing priorities and determining you are working on the most impactful and value-add items</li>\n<li>Work directly with business leaders to get beyond the initial “ask” to understand the underlying business needs, critical path, and timeline surrounding key goals</li>\n<li>Ability to consistently deliver solid, successful solutions with short development cycles that hit the mark on the initial delivery.</li> \n</ul>\n<strong>What you’ll get:</strong>\n\n<ul>\n<li>Comprehensive Compensation and Benefits package</li>\n<li>Financial Health: 401k Match, Employee Stock Purchase Plan, Employee Discounts, Personalized advice, Brokerage discounts</li>\n<li>Work/Life Balance: Sabbatical, Paid Parental Leave, New Mothers returning to work Program, Tuition Reimbursement Programs, Time off to volunteer, Employee Matching Gifts Program</li>\n<li>Everyday Wellness: Health and Lifestyle Wellness Rewards, Onsite Fitness Classes, Healthy Food Choices, Wellness Champions</li>\n<li>Inclusion: Employee Resource Groups, Commitment to diversity, Strategic partnerships</li>\n<li>Not just a job, but a career, with an opportunity to do the best work of your life</li>\n</ul>\nLearn more about Life@Schwab.\n<br><br>\nCharles Schwab &amp; Co., Inc. is an equal opportunity and affirmative action employer committed to diversifying its workforce. It is Schwab's policy to provide equal employment opportunities to all employees and applicants without regard to race, color, religion, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), gender identity or expression, national origin, ancestry, age, disability, legally protected medical condition, genetic information, marital status, sexual orientation, protected veteran status, military status, citizenship status or any other status that is protected by law. Schwab also does not discriminate against applicants or employees because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. At Schwab, we believe that every employee, through their diverse abilities and experiences, can contribute to our growth, innovation and client loyalty. We embrace diversity and are committed to providing equal opportunity to all employees and applicants. If you have a disability, and require reasonable accommodations in the application process, call Human Resources at 800-725-3535. We will be happy to assist you. Schwab will only share your accommodation request with those individuals who have a specific need to know. The request for an accommodation will not affect Schwab's hiring decisions. All other submissions should be performed online.<br><br>Job Specifications <div> Relocation Offered?: No</div> <div> Work Schedule: Days</div> <div> Languages: English - spoken</div> <div> Current Licenses / Certifications: None</div> <div> Relevant Work Experience: IT-Other Specialty Engineering-2-5 yrs</div> <div> Position Located In: AZ - Phoenix</div> <div> Education: BA/BS</div> <div> Job Type: Full Time</div> \n<br>\nCategory:Information Technology\n<br>\nActivation Date: Friday, August 10, 2018\n<br>\nExpiration Date: Thursday, November 1, 2018\n<br>\nApply Here"}