{"job title": "Data Analyst", "company": "CLEAResult", "city state": "– Chicago, IL 60607 United States", "rating": "3.1", "job description": "Click the Apply link to create your Job Application\n<br><br>\n<strong>Job Description Summary</strong><br><br>CLEAResult’s Strategic Energy Management (SEM) team is expanding, and has a new opportunity in our Calgary, AB office for the position of Data Analyst. As a Data Analyst, you will help support talented teams of SEM experts across the US and Canada. In addition to the satisfaction of helping program participants save energy, working at CLEAResult offers some great perks:\n\n\n<ul>\n<li>Progressive workplace made up of efficiency-minded colleagues</li>\n<li>Nice benefits and compensation</li>\n<li>Generous vacation allowance</li>\n<li>Paid time off to volunteer</li>\n<li>Career progression opportunities<br><br><strong>Job Description</strong>\n<br><br>\nThe Data Analyst position is ideal for you if you have a strong Microsoft Excel background, like to be involved at multiple levels of a project, and enjoy performing a variety of duties in a dynamic work environment. Our proven SEM program curriculum and materials are well-established, but since we are in the business of continuous improvement we are always collaborating to make things better. No workday is the same, and many tasks are on strict deadlines. The pace is fast, the work is fun, and the position includes the following activities:\n<br><br>\nEnergy model pre-processing:</li>\n\n</ul>\n\n\n<ul>\n<li>Production data manipulation and formatting</li><li>Analyzing production and utility data to check for consistency and errors</li><li>Integration of data into statistical software interface</li><li>Creation of new templates to improve modeling processes</li>\n</ul>\nEnergy model maintenance:\n<ul>\n<li>Update and maintain weather data files for multiple programs</li><li>Excel-based client model updates</li><li>Savings tracking spreadsheet updates</li><li>Transfer processed statistical data into Excel templates</li><li>Capital project checks</li>\n</ul>\nReporting:\n<ul>\n<li>Final model and report tracking</li><li>Final report drafting, editing, and QC</li>\n</ul>\nData Automation:\n<ul>\n<li>Assess modeling and reporting processes to streamline and automate</li><li>Work with program teams to eliminate unnecessary data processing</li><li>Visual Basic troubleshooting, modification, and creation</li>\n</ul>\n\nRequirements\n\n<ul>\n<li>Very experienced with Microsoft Excel including the use of integrated formulas and Visual Basic development environment</li><li>Experience troubleshooting and fixing Excel formulas and macros</li><li>Experience creating new and/or improving macros for productivity improvements</li><li>Experience writing, editing and proofing reports</li><li>Knowledge of the energy efficiency industry</li><li>Ability to professionally interface with clients and program participants in-person and by email and phone</li>\n</ul>\nPreferred background\n\n\n<ul>\n<li>Bachelor’s degree</li>\n<li>Experience in a consulting environment</li>\n<li>Knowledge of continuous improvement such as Lean/Six-Sigma\n<br><br>\n<strong>Additional Job Description</strong>\n<br><br>\n<strong>Equal Opportunity Employer</strong>\n<br><br>\nAs an Equal Opportunity Employer, we are committed to ensuring equal employment opportunities for all job applicants and employees. Employment decisions are based upon job-related reasons regardless of an applicant’s race, color, religion, national origin, marital status, age, disability, protected veteran status, sexual orientation or any other protected status.\n<br><br>\nThe above job description and job requirements are not intended to be all inclusive. CLEAResult retains the right to make changes or adjustment to job descriptions and/or job requirements at any time without notice.\n<br><br>\n© Copyright 2013 CLEAResult. All rights reserved.</li>\n\n</ul>"}