{"job title": "Data Analyst", "company": "Flex", "city state": "– Memphis, Tennessee, United States", "rating": "3.6", "job description": "<b>Job Description</b><p></p><p></p><p>The <b><u><b>Data Analyst</b></u></b> will be based in <b><u><b>Memphis, TN </b></u></b>Provide expertise to acquire, manage, manipulate, and analyze data and report results. Escalate data integrity issues.</p><p></p><p><b><b>We are looking for</b> someone who demonstrates:</b></p><ul><li>Intense collaboration</li><li>Passionate customer focus</li><li>Thoughtful, fast, disciplined execution</li><li>Tenacious commitment to continuous improvement</li><li>Relentless drive to win</li></ul><p></p><p><b><b>Here is a glimpse of what you’ll do:</b></b></p><ul><li><b><b>Daily Operations </b></b></li><li>Identify problematic areas and conduct research to determine the best course of action to correct the data</li><li>Analyze and problem solve issues with current and planned systems as they relate to the integration and management of patient data (for example, review for accuracy in record merge, unmerge processes)</li><li>Analyze reports of data duplicates or other errors to provide ongoing appropriate inter-departmental communication and monthly or daily data reports (for example, related to the EMPI)</li><li>Monitor for timely and accurate completion of select data elements (for example, verbal physician orders)</li><li>Identify, analyze, and interpret trends or patterns in complex data sets</li><li>Monitor data dictionary statistics</li></ul><p></p><ul><li><b><b>Data Capture </b></b></li><li>In collaboration with others, develop and maintain databases and data systems necessary for projects and department functions</li><li>Acquire and abstract primary or secondary data from existing internal or external data sources</li><li>In collaboration with others, develop and implement data collection systems and other strategies that optimize statistical efficiency and data quality</li><li>Perform data entry, either manually or using scanning technology, when needed or required</li></ul><p></p><ul><li><b><b>Data Reporting </b></b></li><li>In collaboration with others, interpret data and develop recommendations based on findings</li><li>Develop graphs, reports, and presentations of project results</li><li>Perform basic statistical analyses for projects and reports</li><li>Create and present quality dashboards</li><li>Generate routine and ad hoc reports</li></ul><p></p><p><b><b>Specialized Job: </b></b></p><ul><li>Evaluate the data that comes in from each department</li><li>Make reports that compile the data into simple and understandable format for the management</li><li>Collect data on a daily basis</li><li>Coordinate with all the other departments of the company</li><li>Make use of the statistics and the programs provided by the company</li><li>Work closely with the senior management and help them make decisions</li><li>Design efficient data collection techniques specifically for the company</li><li>Prepare reports in the stipulated time</li><li>Check and recheck the data as any mistake on your behalf could magnify even a small mistake</li><li>Great ability with number as you will have to deal with not just simple calculations, but also with complicated algorithms</li></ul><p></p><p><b><b>Here is some of what you’ll need (required):</b></b></p><ul><li>BS in Mathematics, Economics or Computer Science.</li><li>At least 2 - 4 years of experience</li><li>Technical expertise regarding data models and database design development.</li><li>Understanding of XML and SQL</li><li>Proficient in MS word, Excel, Access, and PowerPoint</li><li>Experience using SAS, SPSS or other shop floor systems. Statistical package</li><li>Ability to present complex information in an understandable and compelling manner.</li></ul><p></p><p><b><b>Here are a few examples of what you’ll get for the great work you provide:</b></b></p><p><b><b>• Competitive Salary.<br>• Life &amp; Medical insurance.<br>• Christmas Bonus.<br>• Food Coupons.<br>• Saving Fund.</b></b></p><b>Job Category</b>Operations<p></p><p></p>Flex does not accept unsolicited resumes from headhunters, recruitment agencies or fee based recruitment services. Flex is an Equal Opportunity Employer and employment selection decisions are based on merit, qualifications, and abilities. Flex does not discriminate in employment opportunities or practices on the basis of: age, race, religion, color, sex, national origin, marital status, sexual orientation, gender identity, veteran status, disability, pregnancy status or any other status protected by law. Flex provides reasonable accommodation so that qualified applicants with a disability may participate in the selection process. Please advise us of any accommodations you request in order to express interest in a position by e-mailing: accesibility@flex.com. Please state your request for assistance in your message. Only reasonable accommodation requests related to applying for a specific position within Flex will be reviewed at the e-mail address. Flex will contact you if it is determined that your background is a match to the required skills required for this position. Thank you for considering a career with Flex.<p></p>The information we collect:<b>We may collect personal information that you choose to submit to us through the Website or otherwise provide to us. This may include your contact details; information provided in online questionnaires, feedback forms, or applications for employment; and information you provide such as CV/Resume. We will use your information for legitimate business purposes such as responding to comments or queries or answering questions; progressing applications for employment; allowing you to choose to share web content with others or; where you represent one of our customers or suppliers, administering the business relationship with that customer or supplier.</b> "}