{"job title": "Data Analyst", "company": "Linium Recruiting", "city state": "– New York, New York", "rating": "3.7", "job description": "<strong></strong><div><strong>Responsibilities:</strong>\n<br>\nThe Data Analyst is responsible for collaborating with Senior Business Leaders, the Payroll Accounting Manager, and other key functions such as IT, HR, Finance, and Payroll Processing. This role is designed to provide operational, analytical and consultative support to various business organizations to ensure payroll is appropriately recorded for optimal business unit decision making regarding cost distributions, budgeting, and planning. In addition, this position assists in ensuring the accuracy of employee related data within the UlitPro system. \n\n\n<ul>\n\n\t<li>Oversee payroll allocation process among all Related businesses ensuring all time and expense are recorded to the appropriate platform.</li>\n\n<li>Develop an understanding of how different business organizations conduct their payroll budgeting and manage the distribution of time for cost distribution purposes.</li>\n\n<li>Provide consultative, service oriented, support to senior level business stakeholders to ensure they have the necessary understanding of the systems, processes, and data available to them for managing the payroll cost distributions.</li>\n\n<li>Oversee and coordinate monthly reporting development and distribution, subsequently field questions regarding those reports and overarching data.</li>\n\n<li>Prepare ad-hoc reports and high level analysis of payroll allocations.</li>\n\n<li>Constantly evaluate system, processes, and data for opportunities to improve methods and provide more cost effective and accurate services, construct recommendations, and implement those improvements.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n\n\t<li>Undergraduate degree with a minimum of 5 years of relevant experience in areas such as finance, analytics, and/or consulting.</li>\n\n<li>Analytical skills with ability to evaluate complex data and present solutions that consider a multitude of business requirements, ability to problem solve with micro and macro views.</li>\n\n<li>Strong communication and presentation skills to work effectively with and present to a broad range of business stakeholders.</li>\n\n<li>Superior organizational skills, must be detail oriented and have the ability to prioritize and handle multiple projects to meet deadlines.</li>\n\n<li>Mature professional with sound judgment, excellent interpersonal skills and ability to work independently or as part of a team.</li>\n\n<li>Strong Excel skills and experience with accounting systems and information tools such as JD Edwards, UltiPro and other database applications while knowledge of COGNOS is a plus.</li>\n\n<li>Baseline knowledge of key accounting concepts or an interest/ability to quickly learn the fundamentals is a plus.</li>\n\n<li>Experience in real-estate development, management, construction or other industries with complex payroll, cost distribution dynamics is considered a plus.</li>\n</ul>\n\n</div>\n\n<br>"}