{"job title": "Data Quality Incident Analyst - Associate Vice President", "company": "Mitsubishi UFJ Financial Group", "city state": "– Ontario, CA", "rating": "3.0", "job description": "<div>Discover your opportunity with Mitsubishi UFJ Financial Group (MUFG), the 5th largest financial group in the world with total assets of over $2.4 trillion (as ranked by SNL Financial, April 2016) and 140,000 colleagues in nearly 50 countries. In the U.S., we're 13,000 strong, working together to positively impact every customer, organization, and community we serve. We achieve this by delivering on our values, putting people first, fostering long-term relationships built on honesty and mutual understanding, and inspiring the best in each other. This is all part of our inclusive, high-performing culture supported by Total Rewards that include our cash balance pension plan. Join a team that's working to fulfill its vision to be the world's most trusted financial group.</div>\n<br>\n<div></div><br>\n\n<div><strong>Job Summary:</strong></div><div>The Data Quality Incident Analyst is based within the Compliance Data Office of the Americas Financial Crimes Compliance (AFCC) Division and reports directly to the Compliance Data Officer for the Americas. This new position is required to support Data Management and related initiatives within the Americas, with a specific focus on supporting the Data Quality Incident management process.</div><br>\n\n<div><strong>Major Responsibilities:</strong></div>\n<ul>\n\n<li>\n<div>Support the Data Quality (DQ) Incident Lead in the management of a data incident as it relates to Transaction Filtering, Transaction Monitoring, and KYC business processes and associated systems</div></li>\n<li>\n<div>Support projects from a data management perspective to support execution of AFCC's data initiatives or regulatory mandates</div></li>\n<li>\n<div>Work closely with the compliance LOBs, CDO, ISA and our data producers to understand and facilitate triage/resolution/prioritization of DQ issues</div></li>\n<li>\n<div>Develop tactical solutions to DQ issues as appropriate</div></li>\n<li>\n<div>Keep management updated on DQ issues, highlighting DQ themes, and provide input into periodic KPI/KRI reporting</div></li>\n</ul>\nAdditional Information:\n\n<ul>\n<li>Bachelor's Degree</li>\n<li>Minimum of 2 years of data analysis experience with good knowledge of financial services</li>\n<li>Ability to research information and analyze data to arrive at valid conclusions, recommendations, and courses of action</li>\n<li>Experience with root cause analysis and the ability to ask probing questions in the process to piece together from end to end</li>\n<li>Proven experience in a consultancy or solutions analysis environment with specialization in business analysis</li>\n<li>Ability to work in a fast-paced environment, with proven ability to handle multiple projects at one time</li> \n\n<li>Excellent communication and interpersonal skills</li>\n<li>Excellent planning and organizational skills</li>\n</ul>\n\n<div><strong>Preferred Skills:</strong></div>\n<ul>\n<li>Proven strategic thinker and decision maker</li>\n<li>Strong analytical, critical thinking, and problem solving skills</li>\n<li>Extensive knowledge of emerging industry practices in problem solving scenarios</li>\n<li>Change management skills</li>\n<li>An excellent level of analysis experience and knowledge of structured techniques and industry standards</li>\n</ul>\n\n<div>The above statements are intended to describe the general nature and level of work being performed. They are not intended to be construed as an exhaustive list of all responsibilities duties and skills required of personnel so classified.\n<br><br>\nWe are proud to be an Equal Opportunity / Affirmative Action Employer and committed to leveraging the diverse backgrounds, perspectives, and experience of our workforce to create opportunities for our colleagues and our business. We do not discriminate in employment decisions on the basis of any protected category.\n<br><br>\nA conviction is not an absolute bar to employment. Factors such as the age of the offense, evidence of rehabilitation, seriousness of violation, and job relatedness are considered in all employment decisions. Additionally, it's the bank's policy to only inquire into a candidate's criminal history after an offer has been made. Federal law prohibits banks from employing individuals who have been convicted of, or received a pretrial diversion for, certain offenses.</div>"}