{"job title": "Data Analyst", "company": "Monetate", "city state": "– , US", "rating": "3.9", "job description": "<div>\n<strong>DATA ANALYST</strong></div><br>\n<div>\n<strong>Location</strong>: Conshohocken, PA, New York, NY, or London, UK</div><br>\n\n<div><strong>WHO WE ARE:</strong></div><div>\nMonetate, the personalization vendor most preferred among IR 500 brands is hiring! With a history of fast growth and the backing of VCs such as First Round and OpenView, it's no wonder that over 300 marquee consumer-facing brands choose Monetate to power their e-commerce success.</div><br>\n<div>\nOur cutting-edge technology leverages artificial intelligence (AI) and processed more than 2.1 billion personalized pages over Cyber weekend alone, offering peace of mind that we deliver real-time personalization at astounding scale. Designed for marketers, we are beloved for our ease-of-use.</div><br>\n<div>\nAt Monetate, we love this stuff and our Monetaters fervently believe in a world in which brands can effortlessly deliver the best experiences to their customersevery time, using everything known about the customer, in every place a brand engages with them.</div><br>\n<div>\nIf you want to be a part of a bigger purpose, bringing cutting edge technology to market, Monetate may be the right spot for you!</div><br>\n\n<div><strong>WHAT YOULL DO AS AN DATA ANALYST:</strong></div><div>\nYou will navigate Monetates data-rich environment to make business insights accessible to the organization. They have the ability to communicate complex findings in an easily digestible manner to the business.</div> <br>\n<div>\nThis position supports numerous aspects of the business including the Services, Marketing, Sales, and Product teams.</div><br>\n\n<div><strong>You will have a knack for articulating desired outcomes and executing elegant solutions. You are an influential, self-driven individual who enjoys a rolling up their sleeves in a fast-paced startup/pre-IPO environment. You will:</strong></div><ul>\n<li>\nManage data integrity between Monetate and our clients</li>\n<li>\nCultivate and analyze transactional data to increase the effectiveness of our Business Insights to customers</li>\n<li>\nExecute product engagement analytics to understand macro-level usage and impact of the Monetate platform.</li>\n<li>\nExecute ad-hoc queries using multiple data sources within the Monetate ecosystem</li>\n</ul>\n\n<div><strong>WHAT WERE LOOKING FOR:</strong></div><ul>\n<li>\n1-5 years experience honing business insights in a data-rich corporate environment</li> \n<li>\nStrong SQL skills, preferably having previously used Redshift and MySQL</li>\n<li>\nStrong analytical skills - you can break complex problems into manageable tasks in order to achieve desired outcomes</li>\n<li>\nAffinity toward simple and effective solutions to seemingly complex problems</li>\n<li>\nBachelors Degree in Mathematics, Statistics, or a related analytical field</li>\n<li>\nExcellent communicator. Strong interpersonal, multi-tasking, organizational, and project planning skills, and demonstrating ability to meet aggressive deadlines</li>\n<li>\nFamiliarity with Python and Pandas</li>\n</ul><br>\n\n<div><strong>OUR TEAM &amp; CULTURE:</strong></div><div>\n<strong><em>Were relentlessly customer focused</em></strong>: Everything we do, we do to make things better for our customers. We innovate and continuously improve. Better products. Better service. More Value. Repeat</div><div>\n<strong><em>Were here to win</em></strong><strong>:</strong> We lead in a market that never stops moving. We have the courage to commit, to make tough decisions and when we need to we turn on a dime.</div><div>\n<strong><em>We love this stuff</em></strong><strong>:</strong> We hire smart, fun, talented people who want to make a difference. Were building the worlds most amazing team of personalization zealots.</div><div>\n<strong><em>Weve got each others backs</em></strong>: We value candor, appreciate diversity and insist on respect. Were here for each other. Every day. We win as a team with a shared spirit of optimism.</div> <div>\n<strong><em>Were owners and we act like it</em></strong><em>:</em> We take initiative, act with urgency and are accountable for results. Were all engaged</div> <div>\n<strong><em>Integrity is non-negotiable</em></strong><em>:</em> Our customers, suppliers, partners, stakeholders, communities and competitors can all trust us to do the right thing. No BS. No exceptions</div><br>\n\n<div><strong>PERKS:</strong></div><ul>\n<li>\nYoull get to work with a very talented and passionate team of product managers, software engineers and designers</li>\n<li>\nWe pride ourselves on upholding a respectful and supportive environment; if there's something you need to get your work done, well get it for you</li>\n<li>\nWe understand that everyone is different. We have flexible hours, no dress code, and you're free to migrate between dedicated desks (standing desks available), private rooms, open lounges with couches, or even the lawn to get your work done.</li>\n<li>\nYou'll never go hungry - catered lunches and tons of snacks</li>\n<li>\nUnlimited PTO</li>\n<li>\n12 weeks of fully paid maternity leave and 4 weeks of fully paid paternity leave</li>\n<li>\nFull Benefits, 401k &amp; Stock options</li>\n</ul>\n\n<br>\n<div>\nMonetate is an Equal Opportunity Employer. We consider qualified applicants for employment without regard to race, religion, color, national origin, ancestry, age, sex, gender, gender identity, gender expression, sexual orientation, genetic information, medical condition, disability, marital status, or protected veteran status.</div><br>"}