{"job title": "Data Analyst", "company": "Philips", "city state": "– Nashville, Tennessee", "rating": "3.4", "job description": "Job Description Summary:<p> The Data Analyst will ensure compliance with national and international regulations on complaint tending. Available data sets include CT and AMI complaint data, field change order data, part usage and return data, and production quality data. The Complaint Analyst will ensure that business processes and procedures are documented as the trending improves and all new tools are validated as required. The analyst will engage process owners, stakeholders and subject matter experts throughout the business to facilitate insights into customer complaint drivers and the impact of different feedback systems, and will play a key role in improving the customer experience.</p> <p> Key Areas of Responsibility:<br> • Drives data analysis of quality performance to identify high priority issues relating to safety, complaints, customer satisfaction and the complaint process.<br> • Creates a clear picture for Philips stakeholders that speaks to the state of the products Philips has on the market<br> • Determine drivers of complaint volumes and emerging trends<br> • Understand relationship between customer satisfaction, business results, and complaint volume trends<br> • Quantify business impact of dissatisfaction across lines of business<br> • Communication with business partners to facilitate discussions around complaint drivers and impacts<br> • Development of standardized complaint analysis frameworks that can be leveraged across businesses and functions<br> • With Management, leads the development of complaint metrics.<br> • Perform complaint data horizontal analysis as requested per functional groups.<br> • Prepare clear &amp; informative presentations on tracking and trending for Management Review or other meetings as required.<br> • Generate data for Competent Authorities (FDA, BSI and other regulatory bodies).</p> <p> Minimum Qualifications:<br> • Bachelors degree or equivalence work experience<br> •3+ years of related experience in a medical device or regulated industry</p> <p> Desired Qualifications:<br> • Strong working knowledge of Microsoft Office: PowerPoint, Access, Excel<br> • Degree in business analytics, computer science, information technology, engineering or equivalent.<br> • Minimum 3 years experience working with large corporate customer databases/applications and producing reporting</p> <p> Skills:<br> • Excellent communication and presentation skills<br> • Demonstrated research &amp; analysis skills<br> • Strong time management skills<br> • Demonstrated verbal, written and interpersonal skills.<br> • Demonstrated problem solving and troubleshooting skills.<br> • Demonstrated multitasking and organizational skills.</p> <p> <b> Why should you join Philips?</b> </p> <p> Working at Philips is more than a job. Its a calling to create a healthier society through meaningful work, focused on improving 3 billion lives a year by delivering innovative solutions across the health continuum. Our people experience a variety of unexpected moments when their lives and careers come together in meaningful ways.</p>"}