{"job title": "Data Analyst", "company": "Popular Bank", "city state": "– San Juan, PR", "rating": "3.0", "job description": "<div>\nData Analyst\n<br>\n <div>\nApply now »<br>\n\n <div>\nApply now \n\n\n<ul>\n\n \n<li><br>\n\n <div> Start apply with LinkedIn</div> </li>\n\n<li><br>\n\n <div> Start apply with Facebook</div> </li>\n\n<li><br>\n\n <div> Apply Now</div> </li>\n\n<br>\n  <div>\n<div>\n<div>\nStart</div>\n </div>\n </div>\n\n<br><li>\n <div>\n<strong>Please wait...</strong></div>\n</li>\n\n</ul>\n\n </div>\n</div>\n </div>\n<br><strong>Date:</strong> \n<br>\n Aug 13, 2018\n<br><br>\n<strong>Location:</strong>\n<br><br>\n San Juan, PR<br><br>#job-location.job-location-inline {\n<br>\n display: inline;\n<br>\n<strong> }</strong><br>\n\n<div>\n<div><strong>Full Time Job Opportunity</strong>\n<br><br>\n<strong>General Description</strong>\n<br><br>\nThe <strong>Data Analyst</strong> designs and executes data mining plans, performs primary and secondary analyses, prepares reports, and conducts research &amp; presentations of moderate difficulty on a wide range of projects. Tasks typically involve quantitative analysis, data integration from both internal &amp; external sources and database development.\n<br><br>\n<strong>Essential Duties and Responsibilities</strong>\n\n<ul>\n\n\t<li>Performs data mining and analyze large sets of data to identify patterns and trends by applying quantitative and analytical tools. Ensures data quality by performing segmentation, applicable policies and accuracy audits.</li>\n<li>Pinpoints trends, correlations and patterns in complicated data sets.</li>\n<li>Works in partnership with the Supervisor and Marketing staff to provide a holistic and integrated view of opportunities to the business units.</li>\n<li>Devises methods and procedures for obtaining, maintaining and updating customer related data, including the collection, coding, and tabulation. Leads the evaluation of the data as well as the database development and maintenance or relational database and data system.</li>\n<li>Assists the Supervisor in the integration of market data from all sources (customer survey and qualitative data, customer databases, market measures, competitive intelligence, market assessments, industry reports, etc.)</li>\n<li>Uses statistical methods to analyze data and generate useful reports. For example, customer profiles and response analyses.</li> \n\n<li>Develops analysis and recurrent reports for management and internal clients, presenting the results of research and analysis. Provides concise data reports and clear data visualizations for management.</li>\n<li>Helps facilitate processes to translate data insights into strategic direction.</li>\n<li>Supports integration of propensity models previously developed into database process and analyses.</li>\n<li>Manages database suppliers and consultant’s agreements, as applicable.</li>\n<li>Leads knowledge transfer in his/her area of responsibility.</li>\n<li>Manages projects as assigned.</li>\n<li>Performs related duties and responsibilities required.</li>\n</ul>\n<strong>Minimum Education</strong>\n<br><br>\nBachelor's Degree in Computer Science or Statistics\n<br><br>\n<strong>Experience</strong>\n<br><br>\nTwo (2) years of experience in data mining, research, market analysis and/or data management, financial analysis or other related fields.\n<br><br>\n<strong>Certifications / Licenses</strong>\n<br><br>\n<strong>Other Qualifications</strong>\n\n<ul>\n\n\t<li>Knowledge of and ability to design database analyses.</li>\n<li>Knowledge of and ability to perform quantitative analysis.</li>\n<li>Working knowledge of data management, including database and spreadsheet applications, with the ability to use moderately complex models or specialized computer applications.</li>\n<li>Advanced statistical analysis skills. Specifically, ability to apply advanced analysis methodologies, interpret and present findings in a clear, concise manner, including the creation and use of tables, charts and graphics to summarize results.</li>\n<li>Proficient in statistical programs like SAS, SPSS, R and / or data processing tools like SQL, Power Pivot, FoxPro and Cognos.</li>\n<li>Ability to evaluate design, analysis and conclusions based on database information.</li>\n<li>Ability to prepare clear and comprehensive reports.</li>\n<li>Ability to make sound decisions in a consistent manner with essential job functions.</li>\n<li>Excellent oral and communication skills, both in English and Spanish.</li>\n<li>Ability to work independently with minimal supervision.</li>\n</ul>\n<strong>Competencies</strong>\n<br><br>\nAccountability\n<br><br>\nAnalytical Discipline\n<br><br>\nBusiness Excellence\n<br><br>\nChange Agent\n<br><br>\nCharacter\n<br><br>\nCollaboration &amp; Teamwork\n<br><br>\nCustomer Centric\n<br><br>\nSelf Development</div>\n<br><strong>Popular Inc., is an Equal Opportunity Employer</strong>\n<br><br>\n<strong>Job Segment:</strong> \n<br>\n Data Analyst, Statistics, Quantitative Analyst, Data Management, Data</div><br>\n\n <div>\nApply now »<br>\n\n <div>\nApply now \n\n\n<ul>\n\n \n<li><br>\n\n <div> Start apply with LinkedIn</div> </li>\n\n<li><br>\n\n <div> Start apply with Facebook</div> </li>\n\n<li><br>\n\n <div> Apply Now</div> </li>\n\n<br>\n  <div>\n<div>\n<div>\nStart</div>\n </div>\n </div>\n\n<br><li>\n <div>\n<strong>Please wait...</strong></div>\n</li>\n\n</ul>\n\n </div>\n</div>\n\n<br>"}