{"job title": "Data Analyst", "company": "Progressive Insurance", "city state": "– United States-Ohio-Mayfield Heights", "rating": "3.7", "job description": "<div>Progressive's Claims Control group is looking for an Analyst professional to join our team. This Analyst opportunity is a highly-quantitative data modeling role that will contribute to the optimization of claims handling throughout our organization, through use of/exposure to cutting edge tools and technology Progressive’s Claims organization handled over 5 million claims last year with an estimated $14 billion in losses. </div>\n<p> </p>\n<p>This position is a unique opportunity for you to play a central role in delivering demonstrable value to Progressive. We will rely on your expertise to not only identify high-leverage opportunities, but to also to help implement them. </p>\n<p> </p>\n<p><strong>Here’s what you can expect as a professional on our team:</strong></p>\n<p> </p>\n<p>• Deep involvement and influence in the decision-making process.</p>\n<p>• Immense and complex data sets, where you will be empowered to learn/leverage the most advanced analytical tools at Progressive. An opportunity to work with every business though out the Claims organization. </p>\n<p>• Involvement in work that spans the country, across all products and channels.</p>\n<p>• Work that has a direct impact to Progressive’s bottom line expenses/profitability.</p>\n<p>• Owning a key role in the entire lifecycle of an idea, from inception to deployment.</p>\n<p>• Highly collaborative and fast-paced environment. </p>\n<p> </p>\n<p><strong>The ideal candidate will possess the following skills/behaviors:</strong></p>\n<p><strong></strong> </p>\n<p>• Advanced analytical and technical abilities including predictive data modeling statistical and mathematical methods. </p>\n<p>• Experience working with large data sets</p>\n<p>• Proven problem-solving ability.</p>\n<p>• High accuracy and efficiency.</p>\n<p>• Collaborative, curious, creative, proactive and autonomous.</p>\n<p>• Comfort with complex and unstructured analytical challenges.</p>\n<p>• Can distill and translate complex analyses into simple and clear language/visuals.</p>\n<p>• Strong business judgment: ability and willingness to make informed recommendations supported by rigorous analysis.</p>\n<p>• Experience developing business/program logic in applications such as SQL/DB2, SAS or R, Python, VBA, etc.</p>\n<p></p>\n<p><br><strong>Minimum Requirements:</strong></p>\n<p><br>• Bachelor's degree with an emphasis in Finance, Mathematics, Accounting, Economics or Statistics <br>• Two years business experience with three years prior analyst experience</p>\n<p>-In lieu of a degree, a minimum of 5 years property casualty insurance experience with related analytical experience (e.g., analytical work in a professional setting)</p>\n<p>-This position requires online pre-employment testing for external candidates</p>\n<p>• Thorough understanding of business processes and systems knowledge <br>• Proven ability to develop predictive data models using statistical and mathematical methods <br>• Proven aptitude for learning and using data analysis reporting tools <br>• Advanced skills in Excel with knowledge of spreadsheet functionality including v-look-up, pivot tables, charts, graphing and macros <br>• Intermediate computer skills including MS Word, PowerPoint, and database experience including the ability to create PowerPoint graphs, tables and information reports in slide format <br>• Solid communication skills, both verbal and written <br><br><strong>Preferred Skills</strong> </p>\n<p><br>• Expert SAS or R and SQL programming skills </p>\n<p> </p>\n<div><b>Our company</b></div>\n<div><strong></strong> </div>\n<div>As one of the largest auto insurance company in the nation, Progressive's data analysts and scientists have access to the most telematics data recorded. With freedom and encouragement to implement your own ideas, you’ll be solving big data problems that impact billions of dollars of business. You’ll also benefit from:</div>\n<div> </div>\n<p>• Annual gainshare bonus of up to 24</p>\n<p>• 401k which includes dollar-for-dollar company match of up to 6%</p>\n<p>• Dedication to work/life balance which includes flexible work arrangements and tools to support your lifestyle</p>\n<p>• Dynamic company culture that encourages engagement, supports Employee Resource Groups, values your input and embraces a relaxed atmosphere</p>\n<p>• Onsite gym and wellness programs with discounts &amp; rewards</p>\n<p>• Healthcare onsite and standard benefits (medical, dental, vision)<b> </b></p>\n<p> </p>\n<div><b>Apply today!</b></div>\n<div>Equal Opportunity Employer</div>"}