{"job title": "Data Analyst", "company": "Redstream Technology", "city state": "– Waltham, Massachusetts", "rating": "3.1", "job description": "<strong>Data Analyst to join a Data Discovery Team in Waltham, MA</strong>\n<br><br>\n- Long Term Consulting\n<br><br>\nThe Data Analyst, will be a member of the data discovery team. Data Analyst will work with internal clients to outline data needs to meet the business requirements. They will also be responsible for translating the data into an understandable document.\n<br><br>\nMust be able to analyze knowledge and content data about potential clients for the consultants. Will also be looking at metadata around documents, videos, etc. They'll look at people data, geophysical data, engagement data, reference data, ERP data.\n<br><br>\nExperience with tools such as NoSQL, R are needed, familiarity with PoolParty and Geonames would be preferred\n<br><br>\n<strong>Job Duties and Responsibilities:</strong>\n<ul>\n<li>Synthesize pertinent facts from large amounts of information/data.</li><li>Have resourcefulness to figure out how to get the data from different systems.</li><li>Be able to condense information to key points.</li><li>Communicate findings through written reports and visualizations.</li><li>Develop innovative ways to present information.</li><li>Understand and identify limitations of sources or analysis.</li><li>Develop and maintain strong relationships with team and business partners by demonstrating effective interpersonal skills.</li><li>Responsible for communicating status updates to Project Manager/Coordinator, team members, stakeholders, and supervisor communicate information across effectively.</li>\n</ul>\n<strong>Experience:</strong>\n\n<ul>\n<li>Bachelor’s degree required, advanced degree a plus.</li><li>Experience in data/business research.</li><li>Ability to write queries.</li><li>Experience with presenting synthesized data via Excel or Tableau.</li><li>Excellent oral, written, and presentation communication skills.</li><li>Highly organized, self-directed, and curious.</li><li>Personable and positive, with a high level of integrity.</li>\n</ul>"}