{"job title": "Data Analyst", "company": "Synoptek", "city state": "– Denver, CO", "rating": "3.1", "job description": "Data Analyst\n<ul>\n<li>Conducting full lifecycle analysis to include requirements, activities and design.</li> <li>Develop analysis and reporting capabilities.</li> <li>Monitor performance and quality control plans to identify improvements.</li> <li>Interpret data, analyze results using statistical techniques and provide ongoing reports.</li><li>Develop and implement databases, data collection systems, data analytics and other strategies that optimize statistical efficiency and quality.</li><li>Acquire data from primary or secondary data sources and maintain databases/data systems.</li><li>Implementation data visualization reports and dashboards using industry known tools such as Power BI and Tableau.</li> <li>Identify, analyze, and interpret trends or patterns in complex data sets.</li><li>Filter and “clean” data by reviewing computer reports, printouts, and performance indicators to locate and correct code problems.</li><li>Work with management to collect and prioritize business and information needs.</li><li>Work as a consultant with our clients nationwide.</li><li>Locate and define new process improvement opportunities.</li><li>Utilize technical expertise regarding data models, database design development, data mining, machine learning, and segmentation techniques.</li><li>Strong knowledge of and experience with reporting packages (Business Objects etc.), and databases (SQL etc.).</li> <li>Utilize knowledge of statistics.</li><li>Utilize strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy.</li><li>Adept at queries, report writing and presenting findings.</li>\n</ul>\n<strong>MINIMUM REQUIREMENTS:</strong> <strong>Education:</strong> Master of Science in Data Science, Predictive Analytics, or equivalent degree. <strong>Experience:</strong> 1 year in the job offered or as a data analyst, business data analyst, or Analytics Consultant; documented experience using statistical packages for analyzing datasets and working with big data; and 2 years in project and client engagement and direct customer service.\n<br><br>\n<strong>Tools:</strong> Hadoop, Power BI and Tableau. <strong>Technologies utilized:</strong> Business Objects, SQL, Excel, SPSS, SAS, R, Python.\n<br><br>\n<strong>SALARY:</strong> $87,090.00\n<br><br>\n<strong>LOCATION OF JOB:</strong> Synoptek, LLC, 19520 Jamboree Road, Suite 110, Irvine (Orange County), California 92612\n<br><br>\nApplication is by Resume only. For consideration, email resume to Kristen Diet at kdietz@synoptek.com. This position qualifies for our Employee Referral Program.\n<br><br>\nTHIS NOTICE IS BEING POSTED BECAUSE AN APPLICATION FOR PERMANENT LABOR CERTIFICATION HAS BEEN FILED FOR THE POSITION DESCRIBED ABOVE. ANY PERSON MAY PROVIDE DOCUMENTARY EVIDENCE BEARING ON THIS APPLICATION TO THE:\n<br><br>\n<strong>Certifying Officer</strong>\n<br><br>\nUSDOL Employment and Training Administration\n<br><br>\nAtlanta National Processing Center\n<br><br>\nHarris Tower\n<br><br>\n233 Peachtree Street, N.E., Suite 410\n<br><br>\nAtlanta, Georgia 30303\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}