{"job title": "Data Analyst", "company": "UnitedHealth Group Inc.", "city state": "– Hartford, CT", "rating": "3.3", "job description": "In this role as Data Analyst, you will be responsible for the management and manipulation of mostly structured data, with a focus on building business intelligence tools, conducting analysis, performing normalization operations and assuring data quality. Depending on the specific business line, example responsibilities in this function could include creating specifications to bring data into a common structure, creating product specifications and models, developing data solutions to support analyses, performing analysis, interpreting results, developing actionable insights and presenting recommendations for use across the company. Team members will typically use business intelligence, data visualization, query, analytic and statistical software to build solutions, perform analysis and interpret data. Positions in this function work on predominately descriptive and regression-based analytics and leverage subject matter expert views in the design of their analytics and solutions.\n<br><br>\nPrimary Responsibilities\n\n\n<ul>\n<li>Identifies solutions to non-standard requests and problems.</li>\n<li>Assesses and interprets customer needs and requirements.</li>\n<li>Solves moderately complex problems and/or conducts moderately complex analyses.</li>\n<li>Works with minimal guidance; seeks guidance from subject matter experts to ensure quality and deliver on-time solutions</li>\n<li>Provides explanations and information to others on difficult issues.</li>\n<li>Acts as a resource for others with less technical knowledge, skills, and abilities</li>\n<li>Use pertinent data and facts to identify and solve a range of problems within area of expertise</li>\n<li>Investigate non-standard requests and problems, with some assistance from others</li>\n<li>Work with multiple business units to create solutions as a cross-functional team</li>\n<li>Prioritize and organize own work to meet deadlines</li>\n<li>Ability to identify trends and recommend solutions</li>\n<li>Provide explanations and information to others on topics within area of expertise</li>\n</ul>\n\nRequired Qualifications\n\n\n<ul>\n<li>Bachelors degree in Engineering, Computer Science, Information Technology, Healthcare Economics, Mathematics, Statistics, or Actuarial Science</li>\n<li>2 years in enterprise architecture or data warehousing or business intelligence or software development</li>\n<li>Proficiency in at least one programming language with demonstrated experience developing technical solutions: Java, C, .NET, SQL</li>\n<li>Ability to document and communicate complex technical concepts</li>\n<li>Competency to convert research requirements to analytical specifications</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Experience in working with multiple business units to create solutions as a cross-functional team</li>\n<li>Demonstrated use of business intelligence, data visualization, query, analytic and statistical software to build solutions</li>\n<li>Prior experience in working on predominately descriptive and regression-based analytics</li>\n<li>Able to recognize technical and analytical problems and solution with minimal supervision</li>\n<li>Effective in fast-paced team-oriented environment</li>\n<li>Demonstrated time management and project management skills</li>\n<li>Ability to navigate and drive results in a matrix environment</li>\n</ul>\n\nCareers at UnitedHealthcare Employer&amp;Individual. We all want to make a difference with the work we do. Sometimes we're presented with an opportunity to make a difference on a scale we couldn't imagine. Here, you get that opportunity every day. As a member of one of our elite teams, you'll provide the ideas and solutions that help nearly 25 million customers live healthier lives. You'll help write the next chapter in the history of health care. And you'll find a wealth of open doors and career paths that will take you as far as you want to go. Go further. This is your life's best work.SM\n<br><br>\nDiversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.\n<br><br>\nUnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment.\n<br><br>\nJob Keywords: Excel; Business Intelligence; data visualization; Tableau; Microstrategies; Cognos; SQL, Hartford, CT, Connecticut, Cypress, CA, California, Sandy, UT, Utah"}