{"job title": "Data Analyst", "company": "V.L.S. Systems", "city state": "– Location: Downtown Washington DC", "rating": "3.5", "job description": "<div> <div><strong>Job Title:</strong> \n<br>\n Data Analyst</div> Apply Print</div> \n<br>\n <div> <div><strong>Location:</strong> Downtown Washington\n<br>\n DC</div></div> <div> <strong>Required Skills:</strong></div> <div> <div>\ndata warehouse solutions, requirements analysis techniques, User Stories, backlog maintenance , project planning, daily stand-up meetings, reviews, retrospectives, sprint and release planning, demos, backlog maintenance , Business Process Modeling, Business Rules Development, Agile</div>\n </div> <div> <strong>Job Description:</strong></div> <div> <div>\nAs a Business Analyst, you will provide overall analytical, documentation, validation, and subject matter guidance in the evolution of National Geographic's global marketing and data warehouse systems. This position will provide broad cross-domain and cross-disciplinary expertise in establishing the scope through active collaboration with many stakeholder groups to implement, plan for and launch the software solutions that the many facets of the organization relies on to deliver its globally recognized products. On a daily basis, the Business Analyst is responsible for writing business requirements, performing gap analysis, write user acceptance test scripts, developing business design/process/specification artifacts, and collaborating with highly skilled software development team and external service providers. This position will also respond to due diligence and other related activities as well as build long-standing, positive relationships with stakeholders to become the \"ears on the ground\" for new project opportunities to meet their needs.\n<br><br>\nRequirements/Responsibilities\n\n\n<ul>\n<li>BS in Business, technology/information systems specialty is preferred</li>\n<li>Prior experience with marketing-based data warehouse solutions</li>\n<li>Prior experience with Big 4 or well-known consulting firms</li>\n<li>Experience using various requirements analysis techniques</li>\n<li>Experience Authoring Business and Functional Requirements as User Stories</li>\n<li>Experience participating in project planning, daily stand-up meetings, reviews, retrospectives, sprint and release planning, demos, and other activities as needed</li>\n<li>Experience performing backlog maintenance and working with stakeholders on requirement prioritization</li>\n<li>Experience with Business Process Modeling</li>\n<li>Experience with Business Rules Development</li>\n<li>Document “AS IS” and “TO BE” processes</li>\n<li>Experience with Agile development Methodologies</li>\n<li>Demonstrated strong verbal and written communication skills</li>\n<li>Conduct walkthroughs with internal and external teams.</li>\n<li>Leading user acceptance testing sessions and facilitating solution signoff</li>\n<li>Elicit requirements from Product Owners and Stakeholders</li>\n<li>Assist with internal and external communication, improving transparency, and radiating information</li>\n<li>Assist with prioritization and resolution of defects/bugs</li>\n<li>Participate proactively in developing and maintaining team standards, tools, and best practices</li></ul></div>\n\n\n</div>"}