{"job title": "Data Analyst", "company": "XLA", "city state": "– US-DC-Washington DC", "rating": "3.6", "job description": "<div><div>\n<div>XLA is looking for a Data Analyst to support our government customer in Washington, D.C. The ideal candidate will have experience in responding to requests for information, conducting searches in government databases, and developing concise summaries with decision points under tight deadlines. Must have an active security clearance.\n<ul>\n<li>Enter ECCO and agency related information into the Tableau business intelligence and analystics database.</li><li>Provide statistical analysis, and ad hoc reporting using Tableau analytics database.</li><li>Ability to work independently and manage/prioritize multiple work assignments while completing frequent requests for ad hoc reports.</li><li>Ability to provide well organized oral reports to executive leadership.</li><li>Ability to write executive summaries for leadership briefings.</li><li>Willingness to work eight (8) hour days on-site in downtown D.C. for a full five (5) day work week.</li><li>Demonstrated client-centric mind set.</li><li>Proven experience with sustaining and improving client relations.</li> </ul></div>\n</div>\n</div>\n\n<br>Requirements<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li><div>Advanced experience with Microsoft Excel, Microsoft Word, Microsoft Outlook, and Microsoft Access.</div></li><li>Experience responding to requests for information, conducting searches in government databases, and developing concise summaries with decision points under tight deadlines.</li><li>Excellent reading comprehension, writing and communication skills.</li><li>Ability to review A-files and other immigration enforcement documentation, and perform detailed analytical and research support services.</li><li>Knowledge and experience working with RAD Apps; to include CRM tools.</li> <li>Resources at the Consultant 2 level are primarily responsible for providing quantitative and qualitative reporting.</li> <li>Must have strong knowledge of ICE ERO’s data systems, and be able to define queries to extract the appropriate data sets.</li> <li>Must be able to accurately perform quantitative and qualitative analysis of these data sets and summarize findings and recommendations in reports.</li> <li>Experience producing dashboard reports using Microsoft Excel.</li><li>Experience consolidating voluminous excel spreadsheets into reviewer friendly charts and tables.</li> \n<li>Law enforcement experience or experience in interpreting and applying immigration law is preferred.</li>\n<li>The ability to read and comprehend documents in English and Spanish is preferred.</li>\n<li>Experience in utilizing DHS and legacy INS databases desirable.</li>\n<li>Bachelor's Degree with two (2) additional years of experience; Associates Degree with three (3) additional years of experience; No degree with five (5) additional years of experience, for a total of six (6) years of experience.</li> \n</ul>\nActive DHS Public Trust Clearance.</div>\n</div>\n</div>\n<br>"}