{"job title": "Senior Associate Data Scientist", "company": "Amgen", "city state": "– Thousand Oaks, CA", "rating": "3.7", "job description": "Amgen is seeking a Senior Associate Data Scientist to be based in our Thousand Oaks, CA global headquarters, who will report into the Senior Data Scientist.\n<br><br>\nThe Next Generation Insights &amp; Intelligence Amgen Full Potential (NGII AFP) initiative's remit is to drive systematic utilization of data, analytics, artificial intelligence, and automation across all aspects of the business to reduce costs and increase revenue, speed and efficiency.\n<br><br>\nAs part of the Strategy, Commercialization &amp; Innovation function, the Senior Associate Data Scientist will interface across Amgen's value chain in advancing projects and technical deliverables for the NGII AFP. Responsibilities include executing on projects and/or providing technical input to projects involving data science, machine learning, and artificial intelligence across Amgen.\n<br><br>\nWith respect to projects executed within the scope of NGII, the Senior Associate Data Scientist may advance technical projects with aims to systematically integrate data, derive insights, and automate processes. These projects may touch across the entire value chain and hence offers the opportunity for the candidate to interact and learn from teams involved in Amgen processes ranging from R&amp;D to Commercialization. Successful execution of these projects will not only demonstrate technical feasibility for advanced informatic capabilities but will also ultimately derive substantial business value for Amgen.\n\n\n<ul>\n<li>*Primary Responsibilities for the Senior Associate Data Scientist include:**</li>\n</ul>\n\n+ Engages with the business function to understand and identify opportunities to deliver business value\n<br><br>\n+ Collaborates with other Data Scientists on the team\n<br><br>\n+ Develops requirements based on consulting with the respective business function\n<br><br>\n+ contribute to the technical solution for the business function either through quick prototypes or engagement with broader technical team\n\n\n<ul>\n<li>*Basic Qualifications:**</li>\n</ul>\n\nMaster's degree\n<br><br>\n<strong>OR</strong>\n<br><br>\nBachelor's degree and 2 years of Data Science experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nAssociate's degree and 6 years of Data Science experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nHigh school diploma / GED and 8 years of Data Science experience\n\n\n<ul>\n<li>*Preferred Qualifications:**</li>\n</ul>\n\n+ Experience with variety of data analysis and modeling methods particularly in their application to biological systems (i.e. Unsupervised (PCA, K-Means), Supervised (Linear/Logistic Regression including PLS, Deep Learning approaches), Bayesian, Fourier/Laplace\n<br><br>\n+ Proficient in SQL, Python, R and familiar with big data approaches\n<br><br>\n+ Familiarity and background with biotechnology processes and regulatory requirements\n<br><br>\n+ Strong analytical / quantitative skills\n<br><br>\n+ Strong communication and interpersonal skills\n<br><br>\n+ Self-starter with the ability to take on several projects at one time\n<br><br>\n+ Comfort and agility with changes in business priorities\n<br><br>\nAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.\n<br><br>\nAmgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.\n<br><br>\n<strong>\\#DS2018</strong>\n<br><br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status."}