{"job title": "Senior Data Scientist", "company": "Careoregon", "city state": "– Portland", "rating": "3.3", "job description": "<div><strong>Position Title: Senior Data Scientist</strong>\n<br><br>\n<strong>Department: Information Systems</strong>\n<br><br>\n<strong>Title of Manager: Director of Applications and Analytics</strong>\n<br><br>\n<strong>Supervises: Non-Supervisory</strong>\n<br><br>\n<strong>Exemption Status: Exempt</strong>\n<br><br>\n<strong>Requisition: 12132</strong><br><br><strong>General Statement of Duties</strong><br><br>The Senior Data Scientist provides strategic leadership for research, design and statistical methodology used in modeling and outcomes studies related to population health, cost and utilization, and other member-centric outcomes. This position makes evidence-based recommendations and presentations to staff, partners, domain experts and all levels of internal management. This position serves as the analytical lead for large and complex projects involving multiple resources and tasks, while providing direct expertise in support of organizational objectives.<br><br><strong>Essential Position Functions</strong>\n\n\n<ul>\n\n\t<li>Mentor individuals for acquiring and/or maintaining the skills through which they can advance their own capabilities as analysts and data scientists.</li> \n\n<li>Stays abreast of changing trends in population health, health delivery, or other demographic data sources.</li>\n<li>Collaborate with managers and leadership to set the vision and lead the design, development and implementation of an integrated data gathering and evaluation system responsive to the internal and external needs of CareOregon and its partners</li>\n<li>Design analysis to drive critical financial, clinical, operational, and/or strategic decisions.</li> \n\n<li>Drive management decisions through descriptive and inquisitive data analytics using tools such as SAS, machine learning, BI tools, and/or other data extraction tools.</li> \n\n<li>Lead collaboration efforts between developers, research analysts, departmental staff, and external partners on the design and implementation of solutions which inform critical thinking for CareOregon and its members.</li>\n<li>Research and recommend strategies and models to improve the quality of member-centric or patient-centric data.</li>\n<li>Ensure that all population data products are in compliance with regulatory bodies and statutes, including HIPPA standards for PHI protection and transmission.</li>\n</ul>\n\n<strong>Essential Department and Organizational Functions</strong>\n\n\n<ul>\n\n\t<li>Propose and implement process improvements.</li>\n<li>Meet deadlines for completion of workload.</li>\n<li>Maintain agreed upon work schedule.</li>\n<li>Demonstrate cooperation and teamwork.</li>\n<li>Provide cross-training on specific job responsibilities.</li>\n<li>Meet identified business goals that contribute to departmental goals.</li>\n<li>Perform other duties as assigned.</li>\n</ul>\n\nKnowledge, Skills and Abilities Required\n\n\n<ul>\n\n\t<li>Advanced knowledge and skills in the following areas:\n\n\n<ul>\n\n <li>Qualitative and quantitative research methods and study design</li>\n<li>Integration of disparate data sources for purposes of population analysis</li>\n<li>Analysis of large population data sets</li>\n<li>Design and execution of analytic plans using multiple statistical software platforms</li>\n<li>Proficiency in the content and analysis of health system payer or provider data</li>\n<li>Database structure and design</li>\n<li>Applied measurement theory and related methodologies</li>\n<li>Program evaluation and outcomes assessment</li>\n</ul>\n\n\t</li>\n<li>Advanced skills in the synthesis, display and communication of complex information via written, graphic and web-based modalities for all skill-levels of professional and lay audiences</li>\n<li>Advanced written and verbal communication skills</li>\n<li>Ability to build and leverage collaborative working relationships and negotiate favorable outcomes across diverse sets of customers and stakeholders</li>\n<li>Leverages in-depth knowledge of business data/systems and understanding of the business process to identify and implement solutions and influences business processes that will result in significant bottom-line contributions and/or efficiency improvements.\n<br>\nExcellent critical thinking and problem solving skills</li>\n<li>Information network project management skills, including agile development processes</li></ul>\n\n\n<ul>\n\n\t<li>Strong understanding of Medicaid and Medicare programs</li>\n</ul>\n\nPhysical Skills and Abilities<br>\n\n<div>Lifting/Carrying up to 0 Pounds\n<br><br>\nPushing/Pulling up to 0 Pounds\n<br><br>\nPinching/Retrieving Small Objects\n<br><br>\nCrouching/Crawling\n<br><br>\nReaching\n<br><br>\nClimbing Stairs\n<br><br>\nRepetitive Finger/Wrist/Elbow/\n<br><br>\nShoulder/Neck Movement\n<br><br>\n0 hours/day\n<br><br>\n0 hours/day\n<br><br>\n0 hours/day\n<br><br>\n0 hours/day\n<br><br>\n0 hours/day\n<br><br>\n0 hours/day\n<br><br>\nMore than 6 hours/day\n<br><br>\nStanding\n<br><br>\nWalking\n<br><br>\nSitting\n<br><br>\nBending\n<br><br>\nSeeing\n<br><br>\nReading\n<br><br>\nHearing\n<br><br>\nSpeaking Clearly\n<br><br>\n0 hours/day\n<br><br>\n0 hours/day\n<br><br>\n0 hours/day\n<br><br>\n0 hours/day\n<br><br>\nMore than 6 hours/day\n<br><br>\nMore than 6 hours/day\n<br><br>\n3-6 hours/day\n<br><br>\n3-6 hours/day</div>\n<br><strong><u>Cognitive and Other Skills and Abilities</u></strong>\n<br><br>\nAbility to focus on and comprehend information, learn new skills and abilities, assess a situation and seek or determine appropriate resolution, accept managerial direction and feedback, and tolerate and manage stress.\n<br><br>\n<strong><u>Education and/or Experience</u></strong>\n<br><br>\nRequired:\n\n<ul>\n\n\t<li>Minimum 8 years’ experience in data science and analytics, including 2 years in managed care; experience should include investigating and identifying patterns in big data to generate business or clinical insights, as well as design and implementation of HIPAA compliant secure data applications for access to and dissemination of PHI</li>\n<li>Bachelor’s degree in Mathematics, Statistics, Engineering, Finance, or a Health industry field</li>\n</ul>\nPreferred:\n\n<ul>\n\n\t<li>Minimum 10 years’ related experience</li>\n<li>Masters or higher degree in one or more of the following fields: Mathematics, Statistics, Engineering, Finance, or a Health industry field</li>\n</ul>\n<strong><u>Working Conditions</u></strong>\n\n<ul>\n\n\t<li>Environment: This position’s primary responsibilities typically take place in the following environment(s) (check all that apply on a regular basis):</li>\n</ul>\n☒ Inside/office ☐ Clinics/health facilities ☐ Member homes\n<br><br>\n☐ Other_________________________________________\n\n<ul>\n\n\t<li>Travel: This position may include occasional required or optional travel outside of the workplace, in which the employee’s personal vehicle, local transit, or other means of transportation may be used.</li>\n<li>Equipment: General office equipment</li>\n<li>Hazards: n/a</li>\n</ul>\n<strong>Equal opportunity employer. This company considers all candidates regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.</strong>\n<br><br>\nVeterans welcome to apply</div>\n<br>"}