{"job title": "Associate Scientist", "company": "Certara", "city state": "– Parsippany, NJ, US", "rating": "3.1", "job description": "<p><b>Certara\nis hiring a Pharmacometrics Associate Scientist to support the Certara\nStrategic Consulting team! This position\nwill be remote based in the Toronto area or near one of our east coast offices\nin the US.</b></p>\n\n<p><b> </b></p>\n\n<p><b>About Certara Strategic Consulting</b></p>\n\n<p>Certara Strategic Consulting is the largest pharmacometric organization\nin the world and assures that various career pathways are offered to match the\nambition and personal interests of our employees! We are a division of Certara and deliver\nvalue by integrating advanced simulation approaches into the most crucial drug\ndevelopment deliverables—to inform internal decision-making and strengthen\nglobal regulatory submissions. \nLeveraging our experience working on thousands of key drug development\nprojects on behalf of hundreds of biopharma companies, we bring a track record\nof success and a broad range of expertise to each assignment.</p>\n\n<p><b> </b></p>\n\n<p><b>Responsibilities</b></p>\n\n<p><b> </b></p>\n\n<ul>\n <li>Associate may conduct any or\n multiple of the following activities as a billable consultant (~80%\n of “time in the office”), in the areas of PK and data management.</li>\n <li><b>PK:</b></li>\n <ul>\n <li>Associate PK tasks such as NCA, entry level Modeling and\n Simulation, creation of TFL, authoring of CSR PK sections, ADA summaries.</li>\n <li>Performs noncompartmental analyses (NCA), creation of tables,\n figures and listings (TFL), authoring of pharmacokinetic (PK) sections in\n Clinical Study Report, Regulatory Modules, PK analysis plans and ADA\n summaries.</li>\n <li>Performs entry level Modeling and Simulation skills\n (popPK).</li>\n </ul>\n <li><b>Data Management:</b></li>\n <ul>\n <li>Conducts data-management in support of CSRs and modeling.</li>\n <li>Construct datasets and/or databases in support of PK modeling or\n model-based meta analyses (Trial Specialist).</li>\n </ul>\n <li>Conducts quality control and\n quality assurance activities on datasets and reports.</li>\n <li>May participate in company\n initiatives to improve efficiency of dataset construction, analysis and\n reports (e.g. IT, methodology, efficiency, automation, quality).</li>\n<b></b></ul><p><b>Education &amp; Experience \n\n</b></p><ul><li><p>BS, MSc, PhD, PharmD, or\nequivalent in Pharmaceutical Sciences, Pharmacology, Toxicology, Statistics,\nMathematics, or related fields. </p></li><li><p>Minimum 1- 5 years’\nexperience and expertise in PK analysis, data management, reporting writing,\nand regulatory requirements. </p></li></ul>\n\n\n\n<p><b> </b></p>\n\n<p><b>Skills\n&amp; Abilities</b></p>\n\n<div><ul><li>General knowledge of\nclinical drug development and demonstrated knowledge of pharmacokinetics and\npharmacology is preferred. </li><li>Proficiency in performing\nPK and statistical analysis using software (e.g., WinNonlin), and optimally\nstatistical analysis using software (SAS/R).</li><li>Proficiency in performing\nPK using software (e.g. WinNonlin, Phoenix WinNonlin, AutoPilot) or is an expert\nin dataset construction (e.g. R, S-plus, SAS).</li><li>Entry level developing\nmodeling skills preferred</li><li>R skills a plus</li><li>Ability to support and\ncoordinate multiple projects as requested.</li><li>Excellent verbal and\nwritten communications skills in English. </li></ul></div><p><b><b>\n</b>\n\n<b> </b></b></p>\n\n<p><b>About Certara</b></p>\n\n<p>Certara is a growing\ncompany that provides a novel and exciting place to work. Our purpose is to\nassist in accelerating the development of meaningful medicines that make an\nimpact on our society and the people that need them most. Innovation and\ncreativity are highly valued, and everyone is given the opportunity for\ntraining and continuous development. Our\nportfolio spans the discovery, preclinical, clinical and post-marketing phases\nof drug development, working with 1,200 commercial companies, 250 academic\ninstitutions, and numerous regulatory agencies. </p>\n\n<p> </p>\n\n<p>The wellbeing of our\nemployees is a priority at Certara, and that is why we support the most\nimportant aspects of their lives:</p>\n\n<p> </p>\n\n<ul><li><p>Financial – competitive pay, incentives, retirement plans, income\nsecurity programs</p></li><li><p>Health and Wellness – comprehensive benefit package, wellness\nprograms, healthy lifestyle office environments</p></li><li><p>Work/Life –unlimited paid time off and an employee assistance\nprogram </p></li><li><p>Growth &amp; Development – performance driven environment </p></li><li><p>Community Impact – volunteering opportunities, matching gifts,\ncharitable contributions</p></li></ul>"}