{"job title": "Sr. Data Scientist", "company": "FM Global", "city state": "– US-RI-Johnston", "rating": "3.5", "job description": "<div><div>\n<div>FM Global is a leading property insurer of the world's largest businesses, providing more than one-third of FORTUNE 1000-size companies with engineering-based risk management and property insurance solutions. FM Global helps clients maintain continuity in their business operations by drawing upon state-of-the-art loss-prevention engineering and research; risk management skills and support services; tailored risk transfer capabilities; and superior financial strength. To do so, we rely on a dynamic, culturally diverse group of employees, working in more than 100 countries, in a variety of challenging roles.</div></div>\n</div>\n\n<br>Responsibilities - External<br>\n\n<div>\n<div>\n<div>As a Senior Data Scientist, you will focus on translating business needs into analytics, interpretation of analytics into business applications, advanced technologies and artificial intelligence solutions. This role will provide you with the opportunity to innovate, explore and build solutions for FM Global using emerging technologies. You will develop and apply artificial intelligence, machine learning, and deep learning to various business problems in loss prevention.\n<br><br>\nYou’ll be part of a leading-edge and diverse team of sophisticated data and analytics professionals. You’ll work alongside multiple departments including operations, innovation, business technology transformation, underwriting and engineering to streamline artificial intelligence efforts. Through constant learning, innnovation, discovery and collaboration you’ll not only help FM Global deliver on the promise of loss prevention, you’ll also grow your career and the scope of your impact across the company.\n<br><br>\nYou will use your creativity and leverage a vast array of techniques and tools. You will plan, conduct, and direct the development and evaluation of real-world, large-scale problems using artificial intelligence/machine learning with minimal or limited supervision.\n<br><br>\nYour projects will be interesting, exciting and challenging. You will use advanced analytics with artificial intelligence to advance the mission and goals of FM Global.</div>\n</div>\n</div>\n\n<br>Qualifications - External<br>\n\n<div>\n<div>\n<div>Required\n<br><br>\nPh.D. in Data Science, Computer Science, AI, Applied Mathematics, Statistics, Operations Research, or other relevant fields with 2+ years of business experience (or Master’s degree with 10+ years of business experience)\n<br><br>\nAdvanced programming skills with modern languages including but not limited to R, Pyhton, C#, Java, Scala and Go\n<br><br>\nAdvanced knowledge of ML tasks (supervised, unsupervised)\n<br><br>\nExtensive experience in various ML applications including but not limited to clustering, classification, regression and feature reduction\n<br><br>\nAdvanced knowledge of leading AI/ML techniques and frameworks including but not limited to Tensorflow, Chainer, PyTorch, Caffe, CNTK, and Theano\n<br><br>\nExpertise in the analysis of large scale data from a variety of sources (enterprise systems, sensor data, historical data, metadata, etc.)\n<br><br>\nExperience in design, validation and testing of algorithms and systems\n<br><br>\nExperience in state of the art AI learning techniques (reinforcement learning, transfer learning, etc.) and highly scalable deep learning model training and inferencing\n<br><br>\nExperience with deep learning network architectures (unsupervised, convolutional, recurrent, recursive)\n<br><br>\nFamiliarity with graph-based algorithms, reasoning systems architectures, Bayesian techniques, ontology-based reasoning\n<br><br>\nHighly analytical with strong problem-solving skills\n<br><br>\nStrong attention to detail\n<br><br>\nStrong verbal and written communication skills\n<br><br>\nDesire and ability to work well with others in a team environment and across disciplines\n<br><br>\nStrongly preferred\n<br><br>\nUnderstanding of and experience in Agile development process\n<br><br>\nA plus\n<br><br>\nGeneral business knowledge related to risk management and/or insurance</div>\n</div>\n</div>\n<br>"}