{"job title": "Data Scientist - Vehicle Valuations", "company": "Ford Motor Company", "city state": "– Dearborn, MI", "rating": "3.9", "job description": "**31277BR**<br> <br>**Job Title:**<br> <br><br> <br>Data Scientist - Vehicle Valuations<br> <br><br> <br>**Job Description &amp; Qualifications:**<br> <br><br> <br>**Job Description/Overview:**<br> <br>Perform analysis and modeling of residual values, auction prices, and market drivers to support Business and Sales Planning Analytics (BSPA) ? Used Vehicle Valuations team and customers.<br> <br><br> <br>**Responsibilities:**<br> <br><br> <br>+ Develop models to quantify the relationship between auction prices and key residual values drivers<br> <br>+ Quantify and decompose residual value gaps between brands and vehicles<br> <br>+ Create data analysis visualization for presentations and dashboards<br> <br>+ Assemble data from multiple systems and sources, which includes evaluation of data accuracy and completeness<br> <br>+ Support Total Ownership Lifecycle Management and Residual Value Quality Operating System workstreams (i.e. preparing reports, ad hoc analyses, etc.)<br> <br><br> <br>**Job Requirements:**<br> <br>**Basic Qualifications:**<br> <br><br> <br>+ Master?s degree in quantitative field, such as Statistics, Economics, Mathematics, Computer Science, Data Science, Operation Research<br> <br>+ 2+ years of experience conducting statistical analysis in a business or academic environment<br> <br>+ 2+ years of experience with one or more of the following tools: Data Gathering skills/tools (e.g. SQL, Hadoop, Teradata, SAS, Business Objects, etc.) OR Visualization skills/tools (e.g. QlikView, Tableau, WebFocus, etc.)<br> <br><br> <br>**Preferred Qualifications:**<br> <br><br> <br>+ 3+ years of auto industry related work (e.g. used vehicle valuations, marketing, sales, etc.)<br> <br>+ 3+ years of experience with one or more of the following tools: Data Gathering skills/tools (e.g. SQL, Hadoop, Teradata, SAS, R, Python, Business Objects, etc.) OR Visualization skills/tools (e.g. QlikView, Tableau, WebFocus, etc.)<br> <br>+ Familiar with various modeling methodologies including economics, econometrics, statistics, and data mining<br> <br>+ Ability to handle multiple projects within a given timeframe.<br> <br>+ Strong oral and written communication skills<br> <br>+ Strong problem formulation and problem solving skills<br> <br>+ Make reasonable judgments and conclusions with limited information and resources<br> <br>+ Be aspirational and curious in technical excellence and innovation<br> <br>+ Have a lifetime learning attitude<br> <br><br> <br>The distance between imagination and ?. Creation. It can be measured in years of innovation, or in moments of brilliance. And, it can be a road you start traveling right now. When you join Ford Motor Company, your journey begins. You become part of a team that is already leading the way, with ingenious solutions and attainable products ? and it is always ready to go further.<br> <br><br> <br>Visa sponsorship may be available for this position.<br> <br><br> <br>Ford Motor Company is an equal opportunity employer committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, disability status or protected veteran status.<br> <br><br> <br>**Auto req ID:**<br> <br><br> <br>31277BR<br> <br><br> <br>**Company:**<br> <br><br> <br>Ford Motor Company<br> <br><br> <br>**Function:**<br> <br><br> <br>GDIA<br> <br><br> <br>**Skill Team:**<br> <br><br> <br>GDI&amp;A<br> <br><br> <br>**Sub-Component:**<br> <br><br> <br>Business and Sales Planning Analytics<br> <br><br> <br>**State:**<br> <br><br> <br>Michigan<br> <br><br> <br>**Location:**<br> <br><br> <br>Dearborn"}