{"job title": "Senior Data Scientist - Manager", "company": "Guidehouse", "city state": "– Mc Lean, VA", "rating": "4.5", "job description": "PwC Public Sector, LLP helps federal, state, and local governments solve complex business issues, manage risk and add value in financial management, program management, operations improvement, and security and data management. In today's changing environment, the public sector is seeing an increase in physical and cyber threats, financial and performance reporting requirements, diversity in the workforce, and the impact of rapidly changing technologies.\n<br><br>\nPwC Public Sector LLP provides management consulting, technology consulting and risk consulting services to help federal and international government agencies anticipate and address these and other complex challenges.\n<br><br>\nPwC Public Sector LLP is one of four organizations to receive the 2014 Malcolm Baldrige National Quality Award. The Baldrige Award is the nation?s highest Presidential honor for performance excellence, recognizing U.S. organizations for superior quality and world-class results across six categories defined by Baldrige including Leadership, Strategic Planning, Customer Focus, Measurement, Analysis and Knowledge Management, Workforce Focus, and Operations Focus. For more information on our journey to performance excellence, view our winner profile on the NIST website.\n<br><br>\nIt was announced in February of 2018 that Veritas Capital, a leading private equity investment firm had signed a definitive agreement to acquire its US Public Sector business.\n<br><br>\nProfessionals in PwC Public Sector LLP may be subject to a government security investigation and may need to meet related eligibility requirements for access to classified information. Our Information Management consultants help clients maximize the value of their data. This high performing team helps clients define their information strategy, architecture and governance, get the most value from business intelligence and analytics, and implement enterprise content and data management solutions to reduce cost and complexity, increase trust and integrity, and improve operational effectiveness.\n<br><br>\nMinimum Years of Experience: 6\n<br><br>\nMinimum Degree Required: Bachelor's degree in Economics, Statistics, Operations Research, Computer Science, Information Systems, Engineering or similar quantitative discipline\n<br><br>\n<strong>Knowledge Preferred:</strong>\n<br><br>\nDemonstrates extensive knowledge of, and proven success with a role, executing various aspects of the business or information technology-related client engagements and/or projects within a professional services environment, including knowledge of an industry or functional domain and expertise in at least two of the following areas:\n\n\n<ul>\n<li>Statistical Analysis and Techniques;</li>\n<li>Customer, Product and Pricing Analysis;</li>\n<li>Business and Operations Analysis within marketing, operations, or risk analysis using quantitative techniques.</li>\n</ul>\n\nDemonstrates significant experience working with analytical models or techniques and the ability to apply such methods to an applicable challenge within the larger field of expertise. This background should include:\n\n\n<ul>\n<li>Visualization techniques and tools;</li>\n<li>Advanced analytics techniques (regression, simulation, etc.);</li>\n<li>Applicable sources of external, internal or new data sources to support analytic methods and visualization techniques;</li>\n<li>Healthcare, Insurance, Financial Services, Customer an industrial Products and Services, Manufacturing or Telecom Industries.</li>\n</ul>\n\n<strong>Skills Preferred:</strong>\n<br><br>\nDemonstrates extensive skills and success in consulting-related projects within a professional services environment, including:\n\n\n<ul>\n<li>Analyzing large and complex data sets to solve business challenges and present insights to non-analytics minded individuals;</li>\n<li>Collaborating and contributing as a team member: understanding personal and team roles, contributing to a positive working environment by building solid relationships with team members, proactively seeking guidance, clarification and feedback</li>\n<li>Identifying and addressing client needs, building relationships with clients, developing requests for information, demonstrating flexibility in prioritizing and completing tasks, communicating potential conflicts to a supervisor;</li>\n<li>Prioritizing and handling multiple tasks, researching and analyzing pertinent client, industry and technical matters, utilizing problem-solving skills, and communicating effectively in written and verbal formats to various management levels and external;</li>\n<li>Coaching and collaborating with associates who assist with this work, including providing coaching, feedback and guidance on work performance; - -</li>\n<li>Applying analytical techniques correlated to business value and selecting the appropriate analytical techniques for the problem at hand.</li>\n<li>Demonstrates extensive abilities as a team leader that include the following: leading teams to generate a vision, establish direction and motivate members, create an atmosphere of trust, leverage diverse views, coach staff, and encourage improvement and innovation.</li>\n</ul>\n\nEqual Opportunity Employer/Protected Veterans/Individuals with Disabilities\n<br><br>\nThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor?s legal duty to furnish information."}