{"job title": "Sr. Data Scientist", "company": "Health Management Systems, Inc.", "city state": "– Danvers, MA", "rating": "3.5", "job description": "HMS makes the healthcare system work better for everyone. We fight fraud, waste, and abuse so people have access to healthcare?now and in the future. Using innovative technology and powerful data analytics, we help government and commercial payers reduce costs, increase quality, and achieve regulatory compliance. We also help consumers take a more active role in their own health. Each year, we save our clients billions of dollars while helping people live healthier lives. At HMS, you will develop new skills and build your career in a dynamic industry while making a difference in the lives of others.\n<br><br>\nWe are seeking a talented individual for a **Data Scientist II** who is mainly responsible for responding to questions from internal clients, and providing insights gathered from the data after data onboarding. The Data will work closely with business users, product owners, and others in the organization to clearly define problems and articulate questions. The incumbent would accurately answer those questions from the data and perform complex analysis to generate models that could provide potential solutions. The incumbent must be able to clearly communicate the results to non-technical users and be detail-oriented. The incumbent is also responsible in maintaining a reputation for quality and trustworthiness.\n\n\n<ul>\n<li>*Essential Responsibilities:**</li>\n</ul>\n\n+ Work with stakeholders to identify the business requirements and the expected outcome\n<br><br>\n+ Collaborate with subject matter experts to select the relevant sources of information\n<br><br>\n+ Work closely with data engineers to identify gaps in data availability and quality\n<br><br>\n+ Become an expert in our healthcare datasets\n<br><br>\n+ Design experiments, test hypotheses, and build models\n<br><br>\n+ Develop analytic studies with an aim of delivering immediate and actionable insights to business users\n<br><br>\n+ Work in iterative processes and validates findings\n<br><br>\n+ Present findings in a clear and compelling format using visualization and storytelling, where necessary\n<br><br>\n+ Produce new and creative analytic solutions that will become part of our core deliverables\n<br><br>\n+ Provide expertise on mathematical concepts for the broader analytics team and inspire the adoption of advanced analytics and data science across the entire breadth of our organization\n\n\n<ul>\n<li>*Non-Essential Responsibilities:**</li>\n</ul>\n\n+ Performs other functions as assigned\n\n\n<ul>\n<li>*Knowledge, Skills and Abilities:**</li>\n</ul>\n\n+ Ability to translate business customer problems and questions into clear requirements for analysis\n<br><br>\n+ Ability to write complex and efficient SQL code freehand from scratch\n<br><br>\n+ Ability to wrangle and analyze data using Python or R\n<br><br>\n+ Strong understanding of statistics and probability\n<br><br>\n+ Proficient in Microsoft Power Point, Outlook and Word\n<br><br>\n+ Ability to work under pressure while managing competing demands and deadlines\n<br><br>\n+ Well organized with meticulous attention to detail\n<br><br>\n+ Good understanding of Agile methodology\n<br><br>\n+ Strong sense of ownership, urgency, and drive\n<br><br>\n+ Experience with machine learning is a plus\n\n\n<ul>\n<li>*Work Conditions and Physical Demands:**</li>\n</ul>\n\n+ Primarily sedentary work in a general office environment\n<br><br>\n+ Ability to communicate and exchange information\n<br><br>\n+ Ability to comprehend and interpret documents and data\n<br><br>\n+ Requires occasional standing, walking, lifting, and moving objects (up to 10 lbs.)\n<br><br>\n+ Requires manual dexterity to use computer, telephone and peripherals\n<br><br>\n+ May be required to work extended hours for special business needs\n<br><br>\n+ May be required to travel at least 10% of time based on business needs\n\n\n<ul>\n<li>*Minimum Education:**</li>\n</ul>\n\n+ Bachelor?s Degree in CS, Statistics, Applied Mathematics or relevant major required\n\n\n<ul>\n<li>*Minimum Related Work Experience:**</li>\n</ul>\n\n+ 4 years of work experience in a data analytics role required\n<br><br>\n+ 4 years of experience with SQL preferred\n<br><br>\n+ 4 years of experience with R or Python preferred\n<br><br>\n+ Working experience with BI and visualization tools\n<br><br>\n+ Experience identifying data quality issues and working with data engineer to resolve issues\n<br><br>\n_Nothing in this job description restricts management?s right to assign or reassign duties and responsibilities to this job at any time._\n\n\n<ul>\n<li>*Title:** _Sr. Data Scientist_</li>\n<li>*Location:** _Massachusetts-Danvers_</li>\n<li>*Requisition ID:** _180010QA_</li>\n</ul>\n\nEEO/Minorities/Females/Protected Veterans/Disabled."}