{"job title": "DATA SCIENTIST 3", "company": "Huntington Ingalls Industries", "city state": "– Newport News, VA", "rating": "3.5", "job description": "**24713BR**<br> <br>**Job Title:**<br> <br><br> <br>DATA SCIENTIST 3<br> <br><br> <br>**Department/Cost Center:**<br> <br><br> <br>T53: Digital Transformati<br> <br><br> <br>**External Job Description:**<br> <br><br> <br>Are you ready to apply your skills to real industrial challenges and assist in the implementation of a cutting edge analytics ecosystem? We believe that successful companies are built on their ability to manage and leverage their data and information. If the challenge of applying new and evolving capabilities in the data science world appeals to you then come work for Newport News Shipbuilding?s Analytics, Machine Learning and IoT Capability Team.<br> <br>Newport News Shipbuilding?s Analytics, Machine Learning and IoT Capability Team is seeking someone with a unique blend of experience analyzing and working with diverse structured and unstructured data sets to solve real world use cases, excellent communication skills, and a strong business acumen. We are looking for someone with equal commitment to technical excellence and growing customer relationships, someone who is seeking to grow with the evolving field of data science and help NNS realize the benefits of these methodologies. If you possess a demonstrated history of creative problem solving and superior analytical skills; an in-depth understanding of emerging data science and analytics trends and technologies; and rapidly adopting, architecting and implementing solutions, we want to talk to you.<br> <br>As a member of the Analytics, Machine Learning and IoT capability team, you will play an important role in the transformation of our company?s data analytics capabilities. Specifically you will:<br> <br>? Develop software programs, algorithms, dashboards, information tools, and queries to clean, model, integrate and evaluate datasets.<br> <br>? Lead the development of long term implementation strategies for analytics capabilities across our organization.<br> <br>? Develop concepts and drive them from the design phase through initial pilots.<br> <br>? Work collaboratively with agile and business teams to develop scalable solutions to business problems.<br> <br>? Work as a liaison between the capability team and our end users.<br> <br>? Make a meaningful contribution to the overall planning of projects by articulating requirements to project management stakeholders and critically evaluating new projects.<br> <br>? Actively work across organizational teams to understand future data analytics needs while positioning the team to support those requirements.<br> <br>? Rapidly research emerging trends in the field to deliver solutions and drive business value.<br> <br>If you are a dynamic self-starter willing to learn and grow with the business at this exciting time in our company?s digital transformation come join our team.<br> <br><br> <br>**Auto req ID:**<br> <br><br> <br>24713BR<br> <br><br> <br>**Marketing Title:**<br> <br><br> <br>Data Scientist, Sr. Level 3<br> <br><br> <br>**Basic Qualifications:**<br> <br><br> <br>Bachelor?s Degree in related field and 5 years of relevant professional/exempt experience. Master?s Degree in related field and 3 years of relevant professional/exempt experience. PhD in related field and 0 years of relevant professional/exempt experience. An additional 4 years of specific job experience with a HS diploma may be substituted for the Bachelor?s degree requirement for this job.<br> <br><br> <br>**Entity:**<br> <br><br> <br>NN SHIPBUILDING (0265)<br> <br><br> <br>**Schedule:**<br> <br><br> <br>Full-time<br> <br><br> <br>**Clearance Type:**<br> <br><br> <br>None<br> <br><br> <br>**Shift:**<br> <br><br> <br>1st<br> <br><br> <br>**Travel:**<br> <br><br> <br>No<br> <br><br> <br>**Company Statement:**<br> <br><br> <br>Huntington Ingalls Industries is America?s largest military shipbuilding company and a provider of professional services to partners in government and industry. For more than a century, HII?s Newport News Shipbuilding and Ingalls Shipbuilding divisions in Virginia and Mississippi have built more ships in more ship classes than any other U.S. naval shipbuilder. HII?s Technical Solutions division provides a wide range of professional services through its Fleet Support, Integrated Missions Solutions, Nuclear &amp; Environmental, and Oil &amp; Gas groups. Headquartered in Newport News, Virginia, HII employs nearly 37,000 people operating both domestically and internationally.<br> <br><br> <br>**Relocation Assistance:**<br> <br><br> <br>Relocation assistance will be available<br> <br><br> <br>**Minimum Education:**<br> <br><br> <br>Bachelor's Degree<br> <br><br> <br>**Location:**<br> <br><br> <br>Newport News-Virginia-United States<br> <br><br> <br>**US Citizenship Required for this Position:**<br> <br><br> <br>Yes<br> <br><br> <br>**EEO Statement:**<br> <br><br> <br>Equal Opportunity Employer - Veterans/Disabled Welcome. U.S. citizenship required for most positions.<br> <br><br> <br>**Preferred Qualifications:**<br> <br><br> <br>Preferred Qualifications:<br> <br>? Proficient in verbal communication, presenting to large audiences, and senior leadership<br> <br>? Past experience in industrial/commercial application of Data Science.<br> <br>? Understanding and experience using machine learning techniques and algorithms, including but not limited to Linear Models, Neural Networks, Decision Trees, Bayesian Techniques, Clustering, Anomaly Detection, and more.<br> <br>? Experience with data science languages such as Python, R, MatLab, etc.<br> <br>? Experience with machine learning framework, such as PyTorch, TensorFlow, Theano, Keras, etc.<br> <br>? Individual should be able to work in a team environment and have good business interaction skills.<br> <br>? Hands-on, self-starter who is capable and willing to learn and grow with the business<br> <br>? Detail and results oriented, capable of managing multiple tasks simultaneously<br> <br>? Familiarity with Agile Development (preferably Scrum or KanBan)"}