{"job title": "Healthcare Finance Data Scientist", "company": "Moffitt Cancer Center", "city state": "– Tampa, FL", "rating": "3.7", "job description": "<div>Location\n <div>\n <p>\n \n Moffitt Business Center, 12653 Telecom Drive, Tampa, FL 3363<br>\n\n \n \n </p>\n </div> \n </div> \n\n \n\n <div>\n Department\n <div>\n <p>\n Financial Analysis \n </p>\n </div>\n </div>\n\n \n\n <div>\n Employment Status\n <div>\n <p>Full Time</p>\n </div>\n </div>\n\n \n\n <div>\n Hours per Pay Period\n <div>\n <p>80</p>\n </div>\n </div>\n\n \n\n <div>\n Shift\n <div>\n <p>Day Shift</p>\n </div>\n </div>\n\n \n\n <div>\n Hours\n <div>\n <p>M-F 8-5</p>\n </div> \n </div> \n\n \n\n \n <div>\n Job Details\n <div>\n \n\n\n <div>\n <div>\n \n <p>Moffitt Cancer Center is internationally recognized for our focus on personalized cancer care and translational research. The mission of Moffitt is clear, focused, and fully stated in nine words, \"To contribute to the prevention and cure of cancer.\" With a tradition of excellence that began with the first patient admission in 1986, dedicated Moffitt physicians, scientists, and staff members have remained committed to excellence in an atmosphere characterized by kindness, caring, and hope.<br><br>\n </p>\n </div>\n </div>\n\n <div>\n <p> </p> <p><b>Position Highlights:</b> </p> <p>· The \"Healthcare Finance Data Scientist\" or Senior Medical Economics Analyst is responsible for providing innovative and sophisticated analysis in support of Moffitt's payer strategies initiative. </p> <p>· Emphasis on understanding the role and growth of alternative payment models (APMs) in the healthcare industry, and aiding a collaborative team by developing and reporting on Moffitt's current and future APMs.</p> <p>· The role also provides financial analysis to a team which develops and implements Moffitt's clinical pathways, including identifying trends and drivers of costs to care for patients. </p> <p><b>The Ideal Candidate</b></p> <p>· The ideal candidate will have experience in financial analysis and/or medical economics <b></b></p> <p>· The successful candidate will have strong quantitative, analytic and problem solving skills. <b></b></p> <p>· The candidate will have a knowledge of relational database principles (exp with SQL, SAS, Access, or other database /data mining tools) <b></b></p> <p>· The candidate will have experience with claims data, pharmaceutical data, and /or provider managed care<b></b></p> <p>· Will be experienced with the use of graphical business intelligence visualization tools<b></b></p> <p><b> Responsibilities:</b> </p> <p>· Provide Financial and Strategic support with Alternative Payment Models</p> <p>· Provide analytic support of Clinical Pathways team</p> <p>· Analyze, research, and explain factors contributing to APM results and outcomes</p> <p>· Analyze cost of care for patients determined to be on or off pathway</p> <p><b>Credentials and Qualifications:</b> </p> <p>· Bachelor's Degree required; field of study in Economics, Statistics, Information Sciences, Medical Informatics</p> <p>· <b>5 years of experience in financial analysis and/or medical economics </b></p> <p> \n </p></div>\n \n </div>\n </div>\n\n \n \n\n <div>\n Equal Employment Opportunity\n <div>\n <p>Moffitt Cancer Center is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, or protected veteran or disabled status. We seek candidates whose skills, and personal and professional experience, have prepared them to contribute to our commitment to diversity and excellence.</p>\n </div> \n </div> \n\n \n \n <div><div><p> </p></div></div>\n\n \n <div>\n \n <div></div></div>"}