{"job title": "Data Analyst - IT Admin Services Team", "company": "Norfolk Southern Corp.", "city state": "– Atlanta, GA", "rating": "2.9", "job description": "Requisition 10492: Data Analyst - IT Admin Services Team&nbsp;\n<br><br>\n&nbsp;<br>\n<div>\n<strong>Job Description</strong>\n<br><br>\n<strong>Education:</strong> 4-yr college degree preferably in Information Systems, Computer Science or technology-related fields\n<br><br>\nNorfolk Southern Corporation is seeking a bright and energetic candidate to fill the position of Data Analyst, reporting to the Manager of IT Administrative Services. The successful applicant will be proficient with use of statistical methods for analysis of a variety of data sources. The candidate will also have access to a range of data visualization tools (such as Microsoft Access, Microsoft Excel, SQL, Spotfire) enabling creation of valuable insights used to better manage our Information Technology department. The candidate has exposure to all levels of IT leadership and management through the creation and execution of these reports. This role makes significant contributions to critical department functions including performance management, merit processing, recruiting and on-boarding. Additionally, the position is responsible for budgeting, scheduling and coordinating technology training courses, seminars, and conferences for all IT employees.\n<br><br>\n<strong>Skill Focus:</strong> Data Analytics\n<ul>\n<li>Demonstrates the ability to innovate and design queries, link tables, write reports, and output pivot tables, charts and graphs using MS Access and Excel</li><li>Proficiency with using MS Excel functions and charts (VLOOKUPS, AVG, PMT, CONCAT, MAX, MIN, IF, Waterfalls, etc.)</li><li>Knowledge and experience with tools such as BW, TIBCO Spotfire, SharePoint, Microsoft Project Server (PWA), SQL</li><li>Proficient with Microsoft Outlook</li><li>Ability to create and document processes and procedures to support IT Admin Services</li><li>Familiarity with evaluating new technologies or processes and preparing formal recommendations based off evaluations</li><li>Security and compliance monitoring focus, as it relates to confidential and sensitive data</li><li>Planning and organization using calendars, OneNote, and Excel</li><li>Resourcefulness to gain information and plan for hiring and training, including taking the initiative to follow up with management as needed</li>\n</ul>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Create, maintain, and enhance data quality and reporting used to manage personnel, contractor, and budget functions.</li><li>Research, coordinate, schedule training for department’s 500+ employees on an ad hoc basis as well as at key times during their employment.</li><li>Maintain training course history for tax credit benefit.</li><li>Create interview schedules for co-ops and trainees using Excel.</li><li>Update and manage the Admin Services SharePoint sites.</li><li>Document current systems and assess opportunities to enhance systems for improved efficiency and consistency of reporting.</li>\n</ul>\n</div><strong>Company Overview</strong><br><br>Norfolk Southern Corporation (NYSE: NSC) is one of the nation’s premier transportation companies. Its Norfolk Southern Railway Company subsidiary operates approximately 19,500 route miles in 22 states and the District of Columbia, serves every major container port in the eastern United States, and provides efficient connections to other rail carriers. Norfolk Southern operates the most extensive intermodal network in the East and is a major transporter of coal, automotive, and industrial products.\n<br><br>\nWe are a team of more than 28,000 employees working together to maintain our reputation as \"The Thoroughbred of Transportation\". As an industry leader, Norfolk Southern offers a competitive salary and an excellent benefits package.\n<br><br>\nNorfolk Southern is an equal opportunity employer including veterans and disabled."}