{"job title": "Senior Data Scientist", "company": "SAP", "city state": "– Palo Alto", "rating": "4.5", "job description": "<strong>Requisition ID:</strong> 180307\n<br>\n<strong>Work Area:</strong> Software-Design and Development\n<br>\n<strong>Expected Travel:</strong> 0 - 10%\n<br>\n<strong>Career Status:</strong> Professional\n<br>\n<strong>Employment Type:</strong> Regular Full Time\n<br>\n&nbsp;\n<br><br>\n<strong>COMPANY DESCRIPTION</strong>\n<br>\nAs market leader in enterprise application software, SAP helps companies of all sizes and industries innovate through simplification. From the back office to the boardroom, warehouse to storefront, on premise to cloud, desktop to mobile device – SAP empowers people and organizations to work together more efficiently and use business insight more effectively to stay ahead of the competition. SAP applications and services enable customers to operate profitably, adapt continuously, and grow sustainably.\n<br><br>\n<strong>Expectations &amp; Tasks - Deliverables</strong>\n<br><br>\nWe are looking for a bright individual who will join us as a data scientist to help analyze machine/telematics data from our customer co-innovation projects. This position will be responsible for building predictive analytics models using various machine learning techniques.\n<br><br>\n<strong>Learning &amp; Development Opportunities</strong>\n<br><br>\nThe employee will have the opportunities to lead a customer co-innovation project as a data scientist; to be able to directly interface with customer and understand the requirements, and to be able to apply leading-edge techniques to solve challenging high-value IoT business requirements.\n<br><br>\n<strong>Work Experience</strong>\n<br><br>\nIdeally, the Candidate should have professional experiences in the following:\n<br><br>\n• Data mining and machine learning techniques\n<br><br>\n• Statistics, applied mathematics or operations research background\n<br><br>\n• R, Python, SQL and other programming languages\n<br><br>\n<strong>Education &amp; Qualifications / Skills &amp; Competencies</strong>\n<br><br>\nMaster or above degree in a related field is desirable\n<br><br>\n<strong>SAP'S DIVERSITY COMMITMENT</strong>\n<br>\nTo harness the power of innovation, SAP invests in the development of its diverse employees. We aspire to leverage the qualities and appreciate the unique competencies that each person brings to the company.\n<br>\n&nbsp;\n<br><br>\nSAP is committed to the principles of Equal Employment Opportunity and to providing reasonable accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team (Americas:Careers.NorthAmerica@sap.com or Careers.LatinAmerica@sap.com, APJ: Careers.APJ@sap.com, EMEA: Careers@sap.com). Requests for reasonable accommodation will be considered on a case-by-case basis.\n<br>\n<strong>EOE AA M/F/Vet/Disability:</strong>\n<br>\nQualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, gender, sexual orientation, gender identity, protected veteran status or disability.\n<br>\n<strong>Additional Locations:</strong>"}