{"job title": "*Data Scientist", "company": "Zurich NA", "city state": "– Schaumburg, IL", "rating": "NA", "job description": "<ul>\n<li>*Data Scientist**</li>\n<li>*Description**</li>\n</ul>\n\nZurich (Schaumburg, IL) seeks a Data Scientist to apply advanced analytical techniques to complex data sets in order to develop distinctive analytical and risk insights that deliver improvements in business results.\n<br><br>\nSpecific responsibilities include: understand and structure business challenges and opportunities for insight generation; generate hypotheses, from a broad range of sources and functions; scan a broad spectrum of internal/external, structured/unstructured data sources to define the optimal data set for testing the hypotheses; test and validate hypotheses to deliver improved business results; support synthesizing distinctive analytical and risk insights into compelling ideas and messages; improve analytic techniques for generating insights; support preparation of internal/external, structured/unstructured data sets to build/rebuild/refresh predictive models; establish and maintaincollaborative relationships across the organization; utilize established financial systems to track budgets and highlight variances (either internal or within vendor contracts); develop simple business cases for defined projects using IT expertise, to determine potential benefits, clarify the rationale for investment and support the planning process; research best practice and review and analyze detailed business models to support senior management in improving IT processes and systems; act as technical expert in a specific process or product area, conduct process reviews and initiate change in order to contribute to continuous improvement of services to internal customers; provide specialist advice to address specific technical queries from internal clients and design/develop and deliver appropriate solutions; contribute to the delivery of assigned IT projects for specific lines of business, collaborate with IT colleagues as an approach for project/program management; solve internal customer issues or escalate appropriately to manager, internal partners or external vendors; record and report core metrics, and ensure internal partners and vendors meet defined policies/SLAs (service level agreements) on information management; work with colleagues across the IT function to ensure plans are aligned to functionalDR&amp;BC plans and policy. Position requires occasional travel within the U.S. Must be willing to work extended hours during peak periods.\n<br><br>\nPosition requires a bachelor's degree or foreign equivalent in Computer Science, Mathematics, Statistics or related quantitative field plus 2 years of experience in the job offered or as Manager-Business Analytics, or similar position. Specific experience must include 2 years of experience with each ofthe following: modeling using generalized linear models or machine learning; constructing modeling files with dataset inputs that are large (1 million ); identifying and evaluating external data sources to support predictive models; converting business ideas into objective, testable hypotheses; getting models into production; and working with one of the following programming languages: Python, SAS, or R. Position requires occasional travel within the U.S.. Must be willing to work extended hours duringpeak periods.\n<br><br>\nFull time position. Apply by submitting your resumes at Zurich.com/en/careers, Job ID: 1800005R4\n\n\n<ul>\n<li>*Primary Location:** United States-Illinois-Schaumburg</li>\n<li>*Schedule** Full-time</li>\n<li>*Travel** Yes, 5 % of the Time</li>\n<li>*Job Posting** 07/27/18</li>\n<li>*Unposting Date** Ongoing</li>\n<li>*Req ID:** 180005R4</li>\n</ul>\n\nIt is the Policy of Zurich in North America, as an equal opportunity employer, to attract and retain the best-qualified individuals available, without regard to race/ethnicity, color, religion, gender expression, genetic information, national origin, sex, gender identity, sexual orientation, marital status, age, disability or protected veteran status."}