{"job title": "Micro Strategy/Power BI - Data Analyst Alina Care", "company": "C4 Technical Services", "city state": "– Chicago, Illinois", "rating": "3.6", "job description": "<strong>Must haves:</strong>\n<ul>\n\t<li>Must be Local to Chicago, IL</li>\n\t<li>Power BI</li>\n\t<li>Must be a hands-on, be able to extract data from databases, healthcare experience (Provider data/billing coding) required and SQL experience needed.</li>\n\t<li>Healthcare vertical industry a plus</li>\n</ul>\n<br>\n<strong>Micro Strategy/Power BI - Data Analyst<br>\nLocation: Western Suburbs, IL<br>\nDuration: 3-6 months likely extension</strong><br>\n \n<p><em>As a Data Analyst- Micro Strategy/Power BI will have the ability to work directly with client teams in a collaborative environment to provide value added input, deliver projects built around identified and strategic issues, and ensure the delivery of high levels of client satisfaction. Successful candidates should demonstrate thought leadership, flexibility, develop rapport with clients, team members, and managers. The individual in this role must be able to successfully apply skills and methodology to manage others, proactively mitigate risks, resolve issues, and escalate issues when appropriate. Associates with client's work across multiple disciplines and industries, and must be able to understand their clients’ businesses and build credibility quickly.</em></p>\n\n<p><strong> </strong></p>\n\n<p><strong>Key Areas of Responsibility:</strong></p>\n\n<ul>\n\t<li>Demonstrate knowledge of the client’s business to design effective processes, organizations to drive real business benefits</li>\n\t<li>Acquiring data from primary or secondary data sources and maintaining databases/data systems</li>\n\t<li>Interpreting data, analyzing results using statistical techniques and providing ongoing reports, databases, data collection systems, data analytics and other strategies that optimize statistical efficiency and quality</li>\n\t<li>Identify, analyze, and interpret trends or patterns in complex data sets</li>\n\t<li>Filter and “clean” data by reviewing computer reports, printouts, and performance indicators to locate and correct code problems </li>\n\t<li>Earn client trust though building solid relationships, creating strong client relationships with client and Trexin peer teams.</li>\n\t<li>Work with project teams to integrate change management into overall project plans.</li>\n\t<li>Participate in requirements gathering and solutions design sessions, document business/system requirements in alignment with business users to understand priorities and how to leverage technology solutions to improve performance.</li>\n\t<li>Work in multiple disciplines across industries and build client knowledge and credibility quickly (projects vary in length, lasting anywhere from a few weeks to several months)</li>\n</ul>\n\n<p> </p>\n\n<p><strong>Skills &amp; Requirements:</strong></p>\n\n<ul>\n\t<li>Bachelor’s degree in business or technical area, or the equivalent combination of education and experience.</li>\n\t<li>Technical expertise data models, database design development, data mining and segmentation techniques</li>\n\t<li>Strong knowledge of and experience with reporting packages (Business Objects etc), databases (SQL etc), programming (XML, Javascript, or ETL frameworks)</li>\n\t<li>Knowledge of statistics and experience using statistical packages for analyzing datasets (Excel, SPSS, SAS etc) </li>\n\t<li>Strong communication (oral and written), demonstrated interpersonal and relationship building skills.</li>\n\t<li>Ability to work creatively and analytically in a problem-solving environment.</li>\n\t<li>Proactive with demonstrated independent drive and ability to forge relationships with senior resources on the team. </li>\n</ul>\n\n<p> </p>\n \n\n<p> </p>"}