{"job title": "Commercial Bank - Reference Data FRW Analyst – WLS", "company": "Chase", "city state": "– US-DE-Newark-NCC5 / 00778", "rating": "3.6", "job description": "JPMorgan Chase &amp; Co. (NYSE: JPM)\n<br>\nis a leading global financial services firm with assets of $2.6 trillion and\n<br>\noperations worldwide. The firm is a leader in investment banking, financial\n<br>\nservices for consumers and small business, commercial banking, financial\n<br>\ntransaction processing, and asset management. A component of the Dow Jones\n<br>\nIndustrial Average, JPMorgan Chase &amp; Co. serves millions of consumers in\n<br>\nthe United States and many of the world’s most prominent corporate,\n<br>\ninstitutional and government clients under its JPMorgan Chase &amp; Co brands.\n<br>\nJPMorgan Chase &amp; Co.is committed to providing a comprehensive set of benefits\n<br>\nchoices to meet different employee needs and lifestyles, which include choices\n<br>\nsuch as Flexible Work Arrangements with periodic work from home and\n<br>\nnon-standard business hours, fully paid parental leave time, health care\n<br>\ninsurance and retirement benefits.\n<br><br>\nWholesale Lending Services (WLS) exists within\n<br>\nCommercial Banking and provides loan servicing functions to all four JPMorgan\n<br>\nlines of business. The organization\n<br>\nconsists of approximately 2,300 employees and is responsible for 340,000 loans\n<br>\nwith JPM balance sheet value of nearly $400 billion. These functions include\n<br>\ndeal closing management, loan documentation, deal setup and funding, payment,\n<br>\nfee and related processing, syndication loan and trade processing, asset\n<br>\nvalidation, credit administration and collateral perfection and management. This role resides in the WLS Utility\n<br>\nFunction.<br>\n<div></div>\n\n<br><strong></strong><div><strong>General Summary:</strong>\n</div>\n<br>The Reference\n<br>\nData FRW Analyst provides operational support to WLS teams responsible for\n<br>\nJPMorgan Agented syndicated credit structures, bilateral loans, or loan trading\n<br>\nactivity. The FinRisk Warehouse (FRW) integrates\n<br>\nproduct system data into the Finance and Risk infrastructure as a single,\n<br>\ncentralized source with complete data feeds to ensure consistency for both\n<br>\ninternal and external reporting. FRW includes a comprehensive and\n<br>\nrationalized data model, and a consistent process for data exceptions,\n<br>\nreconciliations, and adjustments. Data from these strategic feeds will be used\n<br>\nfor Liquidity Risk, Interest Rate Risk, Credit Risk, Country Risk and Credit\n<br>\nCapital reporting, as well as Finance Reporting. Interacting with downstream support teams and ensuring\n<br>\nthe resolution of data exceptions in the feeds to FRW are critical tasks the\n<br>\ndata analyst will be responsible for. A\n<br>\nsuccessful candidate should be able to manage multiple demands throughout the\n<br>\ncourse of business in addition to working on strategic projects that may be\n<br>\nassigned.<br>\n<div></div>\n\n<br><strong><div>Core Responsibilities:</div>\n\n<br></strong>\n\n<ul>\n<li>Own the Error Correction System (ECS) break resolution process\n<br>\n holistically for Wholesale Lending Services</li><li>Submit the daily WLS ECS break response with correcting values in\n<br>\n line with established SLAs</li><li>Drive the remediation of validation errors with the appropriate\n<br>\nprocessing team(s)</li><li>Track re-occurring breaks and/or review metrics to identify\n<br>\n improvement opportunities</li><li>Tactically deploy mitigating measures while developing strategic\n<br>\n solutions for reoccurring issues</li> <li>Effectively communicate process change to key stakeholders when\n<br>\n they occur</li> <li>Add or enrich system records as required to support BAU activity</li> <li>Raise and escalate any identified technical gaps in the\n<br>\n organization’s downstream feeds</li> <li>Provide information as requested by operations, technology, or the\n<br>\n WLS FRW program manager</li><li>Participate in\n<br>\n system testing, as needed, which may occur during non-business hours</li> <li>Perform quality control at\n<br>\n critical stages in the process life cycle to ensure accuracy</li><li>Back up co-workers, participate\n<br>\n in ad hoc projects or other tasks assigned</li><li>Create and capture monthly\n<br>\n metrics for upper management</li><li>Understand core processing of\n<br>\n both the Asset Based Servicing and Deals Setup &amp; Funding teams in\n<br>\n order to anticipate impacts to ECS and FRW stemming from processing or\n<br>\n product change</li> \n</ul>\n\n<strong><div>Minimum Requirements:</div>\n\n<br></strong>\n<br>\n<strong></strong><ul><strong></strong><li><strong>Education:</strong>\n<br>\n Minimum undergraduate degree from an accredited university, preferably\n<br>\n majoring in Business, Economics, or MIS related areas of study. Relevant\n<br>\n job and industry experience is a plus.</li><li>Strong\n<br>\n analytical, problem solving and proven decision-making skills</li> <li>General\n<br>\n business knowledge with the ability to apply principles to new scenarios</li><li>Ability\n<br>\n to manage concurrent assignments in an effective, efficient and organize\n<br>\n manner</li><li>Ability\n<br>\n to work independently within a team environment</li><li>Excellent\n<br>\n oral and written communications skills and strong interpersonal/client\n<br>\n servicing skills</li><li>Strong\n<br>\n analytical, problem solving and proven decision-making skills</li> <li>Solid\n<br>\n working knowledge of Microsoft Office applications (i.e. Excel, Word and\n<br>\n PowerPoint)</li><li>Loan experience or loan operations\n<br>\nis a plus</li><li>Flexible\n<br>\nworking schedule with some overtime required</li>\n</ul>"}