{"job title": "Senior Business/Data Analyst (C12/AVP)", "company": "Citigroup Inc.", "city state": "– Tampa, FL", "rating": "3.6", "job description": "ESC Systems - Senior Business / Data Analyst\n<br><br>\nEnterprise Supply Chain (ESC) is Citi's global organization with responsibility for support of the end-to-end supplier lifecycle process, from supplier risk assessment, to competitive bidding and selection, contracting and payment. ESC Data Warehouse Systems team seeks for a dynamic and result oriented Business / Data Analyst to be part of the team responsible to drive development and implementation of a global data warehouse system and analytical / reporting tools.\n<br><br>\nThe candidate must have Functional experience indata warehousing and Business Intelligence domain. The person should be able to independently complete as well as provide input into various project documentations such as Business/Functional Requirements, Test Scripts, Testing and Production Checkout.\n<br><br>\n<strong>Specific responsibilities include:</strong>\n\n\n<ul>\n<li>Perform system designs, gather and document business requirements, conduct Joint Analysis and Design (JAD) sessions with technology, assist with internal testing.</li>\n<li>Perform trouble-shooting and issue resolution using analytical skills, and provide production support. Lead / participate in weekly production support related calls to review support tickets. Provide timely user communications for any system related issues.</li>\n<li>Interaction with internal customers, including participation in deep-dive meetings and conference calls.</li>\n<li>Lead and complete POCs of different analytical tools and other emerging technologies in Business Intelligence domain.</li>\n<li>Additional responsibilities may include project management, metric reporting, presentation creation, development of training materials, and conducting system demonstrations.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>7 years of relevant experience</li>\n<li>Exhibit strong communications and interpersonal skills</li>\n<li>Must have excellent analytical, problem-solving and decision-making skills</li>\n<li>Strong knowledge about Data Warehousing concepts and principle and ETL process. Prior experience working in Data Warehousing environment is a plus.</li>\n<li>Experience with one or more of reporting analytics and data visualization tools such as MicroStrategy, Arcadia, Datameer, Cognos.</li>\n<li>Candidate must possess strong SQL writing skills in Oracle or equivalent relational database platform</li>\n<li>Strong hands on experience with Microsoft Office tools (Word, Excel, Powerpoint etc.)</li>\n<li>Ability to successfully manage multiple requests in a deadline-driven environment.</li>\n</ul>\n\n<strong>Preferred Skills:</strong>\n\n\n<ul>\n<li>Knowledge of Oracle eBusiness Suite applications and different modules (AP, PO, Requisition, EGL) including table structures and data flows is a plus.</li>\n<li>Experience in Big Data technologies and predictive analytics using R / Python is a big plus.</li>\n<li>Prior experience working in Citi in a similar environment and familiarity with Citi's financial systems.</li>\n<li>A candidate that is actively engaged and asks questions.</li>\n</ul>"}