{"job title": "GCB Data Quality Analyst .", "company": "Citigroup Inc", "city state": "– Irving, Texas", "rating": "3.6", "job description": "<strong><br><br>Description</strong><br><br>Citis Global Consumer Business Operational Risk and Controls (CBORC) organization drives global consistency for addressing Operational Risk and Control issues in the Global Consumer Bank. CBORC fosters a culture of control and customer centricity and accountability by leading efforts to identify, anticipate and mitigate regulatory, reputational, and operational risks. A key component of this Organization is the GCB Data Governance team, which drives the data management discipline and culture that values information in support of GCBs business strategies. GCB Data Governance is responsible for the implementation of the data guidelines, standards and controls to protect Citis critical information asset, data. Data must be managed to ensure GCB meets its regulatory obligations, but also to create opportunities to leverage the data for innovation, competitive advantage and enhanced operational efficiencies. To further drive our investment in this area, the GCB Data Governance team is looking for individuals to help support their global data quality initiatives. <strong> PURPOSE OF JOB</strong> Working with business and IT data stewards and data managers: assist in leading data quality initiatives, propose defect prevention processes and techniques, assist with data quality assessments, root cause analysis and coordinate data quality improvement efforts. Works closely with cross-functional team members in the development and delivery of data quality business solutions. Independently performs complex work assignments and problem resolution across systems, processes, and channels. Creates, communicates, and delivers business solutions. Develops and ensures understanding and adoption of common Data Quality processes and other standards. <strong> JOB DUTIES</strong> <li> Develops processes to streamline data quality measurement, monitoring and remediation across Citis lines of business and enterprise data flows.</li> <li> Assist in measuring and monitoring data quality and identifying business impacting data quality issues.</li> <li> Assists in conducting data quality assessments and derive metrics for the data elements of most business value</li> <li> Assist in identifying the perceived versus real data quality issues and assure explanation of perceived problems to all stakeholders</li> <li> Assists and provides data collection and data transformation processes to determine the cause of systematic errors or data quality improvement opportunities</li> <li> Upon finding root causes of errors, assists with solution or options for correction and prevention</li> <li> Assesses and provides metrics of the data quality characteristics (e.g., validity, integrity, accuracy, completeness, timeliness control) and CDE metadata (e.g., availability, relevance, usefulness, accessibility, and definition)</li> <li> Provides a framework for determining the priority of data quality correction activities</li> <li> Coordinates data correction processes</li> <li> Develops and maintains working relationships with business leaders/strategy owners</li> <li> Collaborate with IT to select and implement data quality tools</li> <li> Provide training on data quality processes and procedures</li> <li> Assists in measuring data quality capability and maturity</li> <li> Proposes processes and practices that will prevent data quality problems</li> <li> Coordinates the prioritization and implementation of data quality improvement initiatives</li> <li> Works to include data quality prevention techniques and methods into the business process engineering methods</li> <li> Assist in profiling of data sets to ascertain and validate data domains and relationships</li> <li> Lead the effort to clean up and ensure the accuracy of metadata within the primary data repository Compass.</li> <li> Assists in formulating and conducting awareness forums, both formal and informal</li> <li> Facilitates and documents meetings with stewards, stakeholders, development teams</li>  <li> Prepares formal reports and presentations of findings and recommendations.</li> <li> Assesses and measures the process capability to capture and maintain the quality of data throughout all business and system processes</li> <li> Evaluates the data lineage capabilities of business processes and automated applications to determine adequacy and ability to find root causes of data quality problems</li> <li> Develops processes to document and maintain data lineage, critical data element metadata and data quality rules</li>\n<strong><br><br>Qualifications</strong><br><br>Minimum Requirements: <li> Bachelor's degree or equivalent work experience</li> <li> 3-5+ years relevant experience</li>  <li> Experience in consumer/retail banking or financial services</li> <li> Understanding of data quality management principles</li>  <li> Data quality business process improvement experience</li>  <li> Data quality tool implementation</li>  <li> Ability to lead implementation of data quality tool to stakeholders</li>  <li> Advanced knowledge of data quality analysis tools</li>  <li> Knowledge of process engineering methodologies and/or Business Process Management (BPM) and process management principles</li>  <li> Solid working knowledge of core business functions such as quality management, data management, business intelligence, and information technology</li>  <li> Experience in program and project management</li> <li> Strong written, verbal, and interpersonal communication skills</li>  <li> Strong process viewpoint</li> <li> Ability to think strategically, creatively problem solve, and the ability to engage resources outside of their direct control to achieve objectives</li>  <li> Cooperative problem solving mindset</li> <li> Able to work well across multiple functional areas</li>  <li> Solid understanding of business strategy and IT landscape</li> <li> Proven ability to communicate business rationale to internal and external counterparts</li> <li> Knowledge of data, reporting and analytic functions within a financial services organization</li>  <li> Demonstrated ability to deal with ambiguity and to interface with internal and external resources to define requirements</li>  <li> Demonstrated ability to succeed in a fast-paced, rapidly changing business environment</li>"}