{"job title": "Data Warehouse Analyst II", "company": "Crescent Bank and Trust", "city state": "– Chesapeake VA, Chesapeake, Virginia, United States", "rating": "3.4", "job description": "<div>Crescent Bank is looking for a talented professional to fill an open position as a Data Warehouse Analyst II. This position Maintains Data Warehouse system of imports; performance tunes queries; develops and maintains ETL packages and Analysis Service databases; develops and maintain Reporting Service and Power BI. Works with business units, interpreting business requirements and working with other development staff to design and implement new data marts. Recommends solutions based on business requirements and experience.\n<br><br>\n<strong>Company Profile:</strong>\n<br><br>\nCrescent Bank is a privately owned, state chartered, FDIC insured commercial bank. We have been in business for over 25 years and are located in over 20 states. While our primary business is providing auto loans to those who have a hard time securing a loan, we also provide a variety of personal and business banking services throughout Louisiana. We strive for employee advancement and growth. We offer a wide variety of benefits. Unlike your average bankers, we actually have fun.\n<ul>\n<li><div>\nPaid Vacation, Personal, Holiday, Bereavement, and Jury Duty</div> </li><li><div>Medical, Dental, and Vision Insurance</div> </li><li><div>AD&amp;D and Multiple Life Insurances</div> </li><li><div>Long and Short Term Disability Insurance</div> </li><li><div>Flexible Spending Accounts (Medical and Dependent)</div> </li><li><div>Wellness Programs</div> </li><li><div>401(k) with Company Match</div> </li><li><div>Tuition Reimbursement</div> </li><li><div>Free No Fee Savings and Checking Accounts</div> </li>\n</ul>\n<strong>Essential Duties and Responsibilities:</strong>\n<ul>\n<li><div>\nPosition requires exposure to highly sensitive customer information</div> </li><li><div>Assist in the development and maintenance of ETL processes, including performance tuning, troubleshooting and support.</div> </li><li><div>Assist in the monitoring of jobs associated with BI/DW processes to ensure they are functioning as expected</div> </li><li><div>Development of BI/DW reports using SSRS and BI/DW components</div> </li><li><div>High level of expertise with Microsoft SQL Server 2008 R2-2017 Analysis Server environments</div> </li><li><div>Assist in the development, documentation and maintenance of data marts based on defined requirements</div> </li><li><div>Works effectively as part of a team atmosphere to perform duties and achieve daily operational goals</div> </li><li><div>Meets productivity standards in accordance with Crescent Bank’s confidentiality policies and organizational values</div> </li><li><div>Performs additional duties as needed within the department</div> </li>\n</ul>\n<strong>Position Requirements:</strong>\n<ul>\n<li><div>\nBachelor’s Degree in Computer Science, Information Systems, Engineering or other related field</div> </li><li><div>Experience in mapping data using disparate data sources such as flat files, databases, xml files and/or unstructured data</div> </li><li><div>Extensive experience with SSRS, PowerBI, or other report writing tools for use within MS SQL Server environment</div> </li><li><div>Expert level knowledge of data modeling tools for use within MS SQL Server environment</div> </li><li><div>Expert level knowledge of SSIS or other ETL tools for use within MS SQL Server environment</div> </li><li><div>Expert-level SQL coding/querying skills in SQL Server</div> </li><li><div>Extensive experience with SQL Analysis Server and ETL Tools</div> </li></ul></div>\n<br>"}