{"job title": "Sustainability Data Analyst", "company": "Ferguson Enterprises", "city state": "– Newport News, VA", "rating": "3.4", "job description": "<strong>Job Description:</strong>\n<br><br>\n<strong>JOB OBJECTIVE</strong>:\n<br><br>\nThis position is responsible for analyzing waste, fuel and utility data (electricity, natural gas, water and sewer) and modeling business group performance against corporate goals. Identifies and reports on data anomalies, interfaces with branch leadership and associates to resolve operational issues, and tracks energy and cost savings. Assists in the development of new software measurement tools. Generates reports to identify areas of opportunity for reduction and proposes projects for implementation based on lifecycle assessments and business case analysis. Researches utility incentive opportunities and vendor partnerships that help the corporation achieve sustainability targets. Provides support during annual environmental data audit, and assists in the preparation of quarterly reports for the Executive Committee and the Board. Contributes to annual external reporting, and develops content for associate engagement efforts.\n<br><br>\n<strong>Measuring and Monitoring Performance Data</strong>\n<ul>\n<li>Collects, analyzes and interprets quantitative and qualitative data on each business group's carbon and waste performance versus stated goals.</li><li>Identifies anomalies and works with utilities and branch management to determine root cause.</li><li>Dashboards metrics and reports to Director of Sustainability regarding progress.</li><li>Performs life cycle assessment and return on investment calculations, and models projected improvements from energy, fuel or waste initiatives.</li>\n</ul>\n<strong>Qualifications</strong>\n<ul>\n<li>Demonstrates strong analytical abilities, attention to detail and commitment to accuracy.</li><li>Previous experience with data analysis and information modeling.</li><li>Translates complex data for a variety of stakeholders in a clear and concise manner.</li><li>Possesses the ability to work on multiple and complex projects with strong organizational skills.</li><li>Exhibits sound judgment, problem-solving, decision-making, and oral / written communication skills, and the ability to interact with all areas of the corporation.</li><li>Demonstrates initiative, works independently and as a supportive team member with minimal supervision.</li><li>Strongly Preferred: Programming experience with Python, Excel VBA, or other scripting language</li>\n</ul>\n-\n<br><br>\nThe Company is an equal opportunity employer as well as a government contractor that shall abide by the requirements of 41 CFR 60-300.5(a), which prohibits discrimination against qualified protected Veterans and the requirements of 41 CFR 60-741.5(A), which prohibits discrimination against qualified individuals on the basis of disability."}