{"job title": "Data Quality Analyst Advisor", "company": "General Dynamics Information Technology", "city state": "– USA CA Seaside", "rating": "3.3", "job description": "<u><strong>Clearance Level Must Currently Possess:</strong></u>\n<br><br>\n<u><strong>Clearance Level Must Be Able to Obtain:</strong></u>\n<br><br>\n<u><strong>Suitability:</strong></u>\n<br><br>\n<u><strong>Job Family:</strong></u><br><br>Information Technology<br><br><u><strong>Job Description:</strong></u>\n<br><br>\nWe are seeking a Data Quality Analyst Advisor in Seaside, CA!\n<br><br>\nEssential Job Functions:\n<br><br>\nWork in a fast-paced team responsible for reducing duplication of data, monitoring and maintaining Data Quality within very large Oracle production databases.\n<ul>\n<li>Provide insight and innovation to the team, to help find, investigate, and map out strategies to correct data quality issues that impact any of numerous DEERS business areas, particularly military healthcare benefits &amp; eligibility, patient registry and duplicate identities resolution.</li> <li>Research, design and implement remediation plans to reduce duplicated identities in the system. Work includes both responding to urgent data quality issues as they arise as well as proactive analysis to discover and research previously unknown problem areas.</li><li>Use SQL and PL/SQL to investigate data quality issues and continue to expand the team’s suite of recurring and ad-hoc error reports to assess the state of data quality in DEERS and monitor these reports for anomalies pointing to new issues to examine.</li><li>Create and provide insightful analysis of analytical reports and metrics on data quality issues, duplication/overlay of records, root cause and remediation plans.</li> <li>Work closely with other data quality team analysts, management, project managers, business analysts, developers, quality assurance and DBAs, internal and external customers, upstream and downstream customers to determine root causes for data quality issues or data/identity discrepancy between DMDC and upstream/downstream master data index, or discrepancy between various internal data schemas. Devise remediation plans that both prevent future occurrences and restore data that has already been affected.</li><li>Help train other more junior analysts on your area of expertise.</li><li>Position demands active, continuous collaboration and learning about the business rules underlying the many lines of business, as well as the variety of data stores, data sources, applications and tiers that make up the DEERS architecture. Must be willing to constantly seek out this knowledge from other staff and provide expertise support in the course of day to day work.</li><li>Must be a self-driven individual who can work on many concurrent projects and deliver results on each, whether working independently or collaborating with other members of the team or leading a group of analysts.</li>\n</ul>\nRequired Qualifications:\n<ul>\n<li>Bachelors degree plus 10-20 yrs. of experience; or equivalent combination of education and experience.</li><li>Must be a US Citizen</li><li>Expert in various lines of business at DMDC</li><li>Experience with Relational Database concepts</li><li>Experience with SQL</li><li>PL/SQL (or T-SQL) or experience with other procedural programming language</li><li>SQL query optimization</li><li>Excellent tasks and time management skills</li><li>Public Trust</li>\n</ul>\nDesired Qualifications:\n<ul>\n<li>Excellent problem solving and analysis ability</li><li>Strong verbal and written communication</li><li>Expert in communicating complex business concepts, in person to client or in business writing</li><li>Proficient at using Microsoft product suite (Words, Excel, Access, OneNote, etc.)</li><li>Expert in Oracle</li><li>Background in Statistics</li><li>Data quality experience and familiarity with commercial data quality software</li><li>Experience with Informatica or IBM Infosphere MDM data quality tools</li><li>Familiarity with IBM InfoSphere MDM (10.1 or later version), Workbench and/or Identity Management</li><li>Knowledgeable of or experience with data warehouse, graphical presentation of large dataset</li>\n</ul>\n<u><strong># of Openings:</strong></u><br><br>0<br><br><u><strong>Scheduled Weekly Hours:</strong></u><br><br>40<br><br><u>T<strong>elecommuting Options:</strong></u>\n<br><br>\n<u><strong>Work Location:</strong></u><br><br>USA CA Seaside - 400 Gigling Rd (CAC001)<br><br><u><strong>Additional Work Locations:</strong></u>\n<br><br>\n<strong>CSRA is committed to creating a diverse environment and is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</strong>"}