{"job title": "Data Analyst, Membership and Council Health", "company": "Girl Scouts of the USA", "city state": "– New York, NY", "rating": "3.2", "job description": "We’re seeking to hire a <strong>Membership and Council Health Data Analyst</strong> with responsibilities such as:\n<ul>\n<li>Provide comprehensive assessment of individual council and Movement-wide impacts of initiatives</li><li>Deliver actionable insights to continuously improve performance.</li> <li>Support councils with their local reporting and analytics.</li> \n</ul>\nThis position is part of the five-person team responsible for the analysis of national membership trends and business process effectiveness, to drive mission delivery strategy, membership growth, and council operational efficiencies.\n<br><br>\n<strong>The job could be the right fit for you if:</strong>\n<ul>\n<li>Have excellent \"storytelling\" skills to craft insight into clear, logical written presentations designed for a senior audience</li><li>Can interpret requests and dig into the business questions for clarification/intent</li><li>Anticipate needs and are skilled in resolving current issues</li><li>Confident in building long-term solutions and roadmaps to meet the needs of external and internal shareholders</li> </ul>\n\n<ul>\n<li>Analyze, interpret and communicate data on all aspects membership trends and business process optimization.</li> <li>Derive actionable insights to enhance business efficiencies, program effectiveness, customer experience and loyalty, and membership retention and growth.</li> <li>Develop and build Salesforce reports, Looker dashboards, and Excel models to compile and analyze information.</li> <li>Produce written reports and PowerPoint decks to communicate key findings and work with local offices to drive adoption of best practices. Metrics on outcomes include membership trends, customer experience trends, girl outcomes, business efficiencies, and financial return on investment.</li> <li>Perform ongoing and ad hoc analysis to support the Customer Office in understanding council performance as needed.</li></ul>\n\n<ul>\n<li>2+ years of proven analytical expertise with demonstrated results in driving improvements in operation systems and/or financial systems</li> <li>Keen ability to compile information from multiple sources and distill into actionable recommendations</li><li>Advanced proficiency of Excel, PowerPoint, and Word</li><li>Advanced knowledge in Salesforce and/or Looker reporting; experience training others a plus business process analysis and documentation experience</li><li>Superior analytical abilities, team-working capabilities, and results-oriented nature</li><li>Demonstrated written and verbal communication skills including communicating complex information with clarity to diverse audiences, and preparing and presenting reports and other written communications to GSUSA and council stakeholders</li><li>To be a proven relationship builder based upon trust, respect, effective communication, and achievement of common goals; experience in identifying potential needs and opportunities and in fostering collaboration and support</li> <li>Strong organization, communication, interpersonal, and presentation skills</li>\n</ul>\n<br><br>\nGirl Scouts of the USA is an Equal Opportunity Employer and does not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}