{"job title": "Data Analyst Disaster Recovery Implementation", "company": "ICF", "city state": "– Austin, TX", "rating": "3.6", "job description": "<p><u><b>Working at ICF</b></u></p><p></p><p></p>Working at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you’re seeking to make a difference in the world, visit www.icf.com/careers to find your next career. ICF—together for tomorrow.<p></p><p></p><p>ICF is currently seeking staff to support state and local post-disaster recovery efforts implementing programs funded by federal disaster recovery programs. </p><p></p><p>These are full-time positions located in hurricane affected areas. This important work takes a special commitment and you’ll need to be able to commit to some long hours under challenging circumstances but we, like you, know why this matters.</p><p></p><p>Our opportunities span a variety of levels and our team is excited to explore your career at ICF with you! As you learn more about ICF you’ll discover that longer-term opportunities abound that give you opportunities for a superb learning environment surrounded by smart and passionate leaders in their field! US Citizenship is a requirement and you may need to successfully complete a Public Trust Security Clearance. </p><p></p><p>Key Responsibilities:</p><p>- Collect data on Hurricane Harvey impacts on individuals, businesses, and communities</p><p>- Conduct quantitative analysis of data and present data in formats to support executive decision-making</p><p>- Writing background summaries for program management<br><br>Basic Qualifications:</p><p>- Bachelor's degree </p><p>- 5+ years of data analytics and data visualization experience</p><p>- Expertise in Microsoft Excel and Microsoft Access.</p><p>- Experience using GIS and other data sets to support understanding and identification of effected individuals in specific geographic spaces</p><p>- Experience using analysis to reviewing and evaluate program performance measures in grant distribution and financial performance</p><p></p><p>Preferred Skills/Experience:</p><p>- Data retrieval from Data bases and Data warehouses</p><p>- GIS plotting</p><p>- Integrating data from external sources to FEMA disaster software programs</p><p>- SharePoint development and expansion</p><p></p><p>Professional Skills:</p><p>- Excellent verbal, interpersonal and written communication skills</p><p>- Self-starter/team player with the ability to work in a fast-paced environment with experience handling multiple priorities and ability to work extended hours.</p><p>- Demonstrated level of professionalism in providing administrative support, including ability to exercise good judgment, discretion, tact, diplomacy and commitment. </p><p></p><p>ICF offers an excellent benefits package, an award winning talent development program, and fosters a highly skilled, energized and empowered workforce.</p><p></p><p>ICF is an equal opportunity employer that values diversity at all levels. (EOE – Minorities/Females/Protected Veterans Status/Disability Status/Sexual Orientation/Gender Identity) </p><p></p><p>Pay Transparency Statement: For more information, please click here: https://www.dol.gov/ofccp/pdf/pay-transp_formattedESQA508c.pdf </p><p></p><p></p>Texas Remote Office (TX99)<p></p><p></p>"}