{"job title": "Wealth Management, CWM Operations - Data Protection Analyst - Associate", "company": "JPMorgan Chase&amp;Co.", "city state": "– Plano, TX", "rating": "3.8", "job description": "Apply Now\n<br><br>\nWealth Management, CWM Operations - Data Protection Analyst - Associate\n<br><br>\nReq #: 180091658_1\n<br><br>\nLocation: Plano, TX,US\n<br><br>\nJob Category: Asset Management\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nAbout JP Morgan Asset and Wealth Management\n<br><br>\nJ.P. Morgan Asset and Wealth Management, with client assets of $2.4 trillion, is a global leader in investment and wealth management. Its clients include institutions, high-net-worth individuals and retail investors in every major market throughout the world. The division offers investment management across all major asset classes including equities, fixed income, alternatives, multi-asset and money market funds. For individual investors, the business also provides retirement products and services, brokerage and banking services including trusts and estates, loans, mortgages and deposits.\n<br><br>\nWealth Management Operations supports the JPMorgan Private Bank and Chase Wealth Management in JP Morgan's Asset Wealth Management line of business.\n<br><br>\nThe Private Bank is the world's premier service provider for ultra and high net worth individuals. Our goal is to help these affluent individuals across the globe optimize their wealth, after taxes and across generations. Wealth Management Operations provides end-to-end support for all aspects of the client experience, working closely with client service, fiduciary, product specialty groups, third party vendors and other internal groups.\n<br><br>\nChase Wealth Management encompasses our Chase Private Client (CPC) and Chase Investment Services businesses. Through a dedicated team of a banker and J.P. Morgan Advisor, Chase Private Client brings our affluent clients concierge banking from Chase and access to the investment expertise from J.P. Morgan. Chase Investment Services provides investment solutions to a broad range of Chase customers through Chase Investment Advisors. The J.P. Morgan Securities Client Service Center's mission is to create a great client experience and help individuals across all 50 U.S states to save and invest wisely. The group works in a team environment to assist clients with service over the telephone and serves as experts on our online platform, such as Chase.com.\n<br><br>\n<strong>Position Summary</strong>\n<br><br>\nChase Wealth Management Operations Control&amp;Governance advocates a culture of shared responsibility for managing risk within the Wealth Management Operations organization through collaborative analysis, great-practices sharing, training&amp;awareness and effective governance and execution of control improvement programs.\n<br><br>\nThe Chase Wealth Management Operations Data Protection Associate is accountable to organize, direct, manage, and execute the activities of assigned control reviews and/or initiatives ensuring on time completion, as well as delivery of the stated strategic goals and objectives. The Chase Wealth Management Data Protection Associate will partner closely with business, technology, and other support partners to ensure successful execution of initiatives.\n<br><br>\nThe Chase Wealth Management Operations Data Protection Associate is also responsible for monitoring the details and status of assigned controls, preparing standard and ad hoc updates and reports, identifying and resolving issues, effectively escalating decisions and issues, as well as establishing quality measures and standards that ensure milestones are met.\n<br><br>\nThe Chase Wealth Management Operations Data Protection Associate is accountable for oversight and reporting of controls including: Knowledge Management, Privacy&amp;Fraud Identification and Prevention, Employee Onboarding, Licensing&amp;Registration, Consecutive Leave, Records Management, Electronic Communication Review, Clean Desk, and other controls as assigned.\n<br><br>\nAdditional responsibilities will include execution of assigned control reviews and/or initiatives ensuring on time completion, as well as delivery of the stated strategic goals and objectives.\n<br><br>\nClear communication, transparent reporting, and effective presentation building will also be vital elements of the position. The successful candidate will excel at creative thinking and problem solving; be self-motivated, confident and organized and ready to work in a fast-paced, energetic environment.\n\n\n<ul>\n<li>Bachelor's degree or equivalent in Business Administration, Compliance, Controls or related field.</li>\n<li>1-2 years of experience in financial services, preferably in investment related roles. Experience in a risk and control function strongly preferred.</li>\n<li>Knowledge of regulatory requirements</li>\n<li>Experience with operational risk analysis, process improvement, developing procedures</li>\n<li>Experience with line of business applications knowledge a plus</li>\n<li>Project management experience</li>\n<li>Change management experience</li>\n<li>Strong oral and written communication skills</li>\n<li>Strong process analysis and improvement skills</li>\n<li>Strong consulting and relationship building skills</li>\n<li>Ability to effectively escalate and resolve issues</li>\n<li>Meticulous attention to detail; highly organized</li>\n<li>Flexibility; ability to adapt and respond quickly to change</li>\n<li>Mastery of MS Office products and the use of SharePoint as a repository</li>\n<li>Works independently</li>\n\n<strong><li>Recommended:</li>\n\n</strong>\n\n<li>AML/KYC Knowledge (Know Your Customer)</li>\n<li>JPMC Systems, Releases and Data Knowledge</li>\n</ul>"}