{"job title": "Need - Healthcare Data Analyst - Baltimore, MD - Long Term Contract", "company": "KLNtek", "city state": "– Baltimore, MD", "rating": "3.6", "job description": "Hi , Please check below position and reply back with the below details and updated resume if you are comfortable. Healthcare Data AnalystBaltimore, MDLong Term Mandatory Skills:Thorough understanding of healthcare dataExperience of source data analysis and data profilingMapping source data to target data modelHands-on with SQL query writingKnowledge of ETL and Data Warehousing conceptsExperience of requirements gathering and working with technical teams as well as business usersExcellent written and verbal communication skillsExperience of requirements gathering and client interaction Job Responsibilities / Role:Understanding of data modelling, dimensional modellingKnowledge of healthcare workflows such as clinical, claims, eligibility, etc. and familiarity with healthcare dataUnderstanding of standard healthcare vocabularies and coding systemsUnderstanding of complex data formats (e.g. CCDA, QRDA, etc.)Understanding of Data Reconciliation, Data Quality and transformationsExperience using tools such as IBM Quality Stage, IBM Information Analyzer, Oracle Data Quality, Microsoft Data Profiling Task, etc. for performing data profiling and quality checksExperience of Agile development Please Fill the below details and send me along with your resume if you are interested. Skill Matrix:SkillsObtained Years of ExperienceLast Year UsedAs a Data Analyst Understanding of healthcare data Experience of source data analysis and data profiling Mapping source data to target data model Hands-on with SQL query writing ETL and Data Warehousing concepts Understanding of data modelling, dimensional modelling Understanding of healthcare workflows such as clinical, claims, eligibility, etc. and familiarity with healthcare data Understanding of standard healthcare vocabularies and coding systems Understanding of complex data formats (e.g. CCDA, QRDA, etc.) Understanding of Data Reconciliation, Data Quality and transformations Experience using tools such as IBM Quality Stage, IBM Information Analyzer, Oracle Data Quality, Microsoft Data Profiling Task, etc. for performing data profiling and quality checks Experience of Agile development PASSPORT Number is Mandatory for any EAD or H1B consultants. Details:Full Name Visa Status Availability Current Location Willing to Relocate..? Contact Number for interview Email ID Webcam ID (Skype ) Expected Rate/Salary *Passport Number (If EAD or H1B holder) *Full DOB (DD/MM/YYYY) Last 4 Digits of SSN# Total IT Exp Degree- (which degree) &amp; Year of Graduation Good Time to Reach Face to Face (Yes/No) Currently Any Interviews in pipe line..? - provided by Dice Data Analyst, Healthcare, SQL, healthcare data.CCDA, QRDA, agile, data warehouse, data modelling, of healthcare workflows such as clinical, claims, eligibility, etc. healthcare vocabularies &amp; codinig"}