{"job title": "Clinical Data Manager/Outcome Analyst", "company": "Knowesis Inc.", "city state": "– Aberdeen, MD", "rating": "3.4", "job description": "Knowesis, a Service Disabled Veteran Owned (SDVO) (CVE certified) and Small Di/sadvantaged Business (SBA certified 8a), is looking for subject matter experts to supplement and enhance the existing workforce and training and operational support for the U.S. Army Public Health Center (APHC) located at Aberdeen Proving Ground in Edgewood, Maryland. The APHC's mission is to promote health and prevent disease, injury, and disability of Soldiers and military retirees, their families, and the Department of the Army civilian employees; and assure effective execution of full spectrum veterinary service for Army and Department of Defense Veterinary missions.\n<br><br>\nIn direct support of the Army Public Health Center's Division of Behavioral and Social Health Outcomes Practice we are looking for a Clinical Data Manager/Outcome Analyst to serve as a program evaluation subject matter expert.\n<br><br>\n<strong>The successful candidates will:</strong>\n\n\n<ul>\n<li>Collaborate with multidisciplinary teams of quantitative, qualitative, social and clinical and public health scientists to design and implement retrospective and prospective analyses of multiple data sources to inform the evaluation of direct-care and community-based programs and services that address behavioral and social health concerns and inform DA and DoD level policies</li>\n<li>Advise on evaluation techniques and metrics, and the development and delivery of quality data collection tools and deliverables</li>\n<li>Employ qualitative and quantitative software to gather and analyze data and report findings</li>\n<li>Design, implement, analyze, synthesize and report on interviews, focus groups, index case analyses, and surveys using qualitative and mixed methods for epidemiological investigations, field studies and program evaluations related to behavioral and social health outcomes</li>\n<li>Conduct literature reviews to inform the development of project plans and manuscripts.</li>\n<li>Provide technical expertise to internal and external multidisciplinary working groups and stakeholders. Provide feedback on project plans, information papers, project deliverables and manuscripts.</li>\n<li>Perform at a level to present work at national convening organizations, American Psychological Association, and publish peer reviewed manuscripts</li>\n</ul>\n\nExperience and Skills\n<br><br>\nEducation and Experience Requirements\n\n\n<ul>\n<li>Bachelor's Degree in a scientific discipline plus 2-5 years of related experience in scientific research and analysis</li>\n<li>Prior experience employing NVivo for qualitative data analyses, Verint for survey development, and SAS to conduct descriptive analyses</li>\n<li>Demonstrated experience translating analytic findings into relevant actionable recommendations to address behavioral and social health issues such as suicidal behavior, interpersonal violence, substance misuse</li>\n</ul>\n\n<strong>Benefits</strong>\n<br><br>\nAbout Knowesis\n<br><br>\nFounded in 2007, Knowesis Inc. has been providing data driven decisions and solutions to federal healthcare clients from day one. Our core capabilities include analytics and information management, planning and operations, and communication and engagement strategies. Knowesis' highly qualified, customer-focused professionals are committed to providing information and advice to enable client success through holistic, thorough, thoughtful, and aligned approaches. Our clients leverage these capabilities to support data driven decisions for their key business functions. Knowesis is dedicated to earning the loyalty of clients and staff through work ethic, collaboration, and humility. Our intent is to be a positive impact to our clients, team, and community.\n<br><br>\nKnowesis is Service Disabled Veteran Owned (SDVO) (CVE certified) and Small Disadvantaged Business (SBA certified 8a) with offices in San Antonio, Texas and Fairfax, Virginia. We offer a highly competitive compensation and benefits package inclusive of medical, dental, and paid time off.\n<br><br>\nFor more information about working with Knowesis, please visit our website at http://www.knowesis-inc.com.\n<br><br>\nKnowesis is an equal opportunity employer and makes employment decisions on the basis of merit and business needs. Knowesis will consider all qualified applicants for employment without regard to race, color, religious creed, national origin, ancestry, age, sex, sexual orientation, genetic information, physical or mental disability, veteran or marital status, or any other class protected by law. To comply with applicable laws ensuring equal employment opportunities to qualified individuals with a disability, Knowesis will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant or an employee unless undue hardship to the Company would result.<br><br>SDL2017"}