{"job title": "Data Analyst / Salesforce Data Steward - In Person interview", "company": "Momento USA LLC", "city state": "– Princeton, NJ", "rating": "3.3", "job description": "Role: Data Analyst / Salesforce Data StewardLocation: Princeton, NJDuration of Project: 6 months plusInterview Mode: In-Person Interview with client The Salesforce Data Steward is an integral part of the SFDC Platts product team who is responsible for data quality in collaboration with their stakeholders, to ensure efficient data maintenance on the SFDC Platts Platform. This position is responsible for maintaining clean data, working with the tech team to eliminate duplicates and resolving any data discrepancies in the SFDC environment. The Data Steward will be responsible for managing and prioritizing activities to mitigate data quality risks and issues. He/she will also take the initiative in developing strategies to maintain data integrity in the most efficient manner. Main responsibilities include:Take ownership of updating and maintaining accurate data on the SFDC Platts platformUnderstand all business process in relation to SFDC and how data integrity is impactedIdentifying duplicates and working with tech team to merge dataIntroduce data best practices and user behavior management strategies to maintain data integrityWork with multiple tech teams integrated with SFDC to ensure data accuracy for downstream systemsAssist with all data cleanup effortsCommunicate with end users to gather missing information to ensure data accuracyDevelop strategies to clean up data and for duplicate preventionProduce and maintain data governance documentationProvide data governance perspective on Salesforce releasesCreate reporting and analytics on data cleanliness of platformAssist with UAT testing when needed Qualifications:2+ years working with databases and/or CRMExcellent attention to detail with great time management skillsExcellent analytical skills with large amounts of dataStrong problem solving skills with an innate curiosity and desire to question the status quoExpertise in improving data quality to improve business processes and accuracyAble to communicate with all levels of the organizationSalesforce Admin Certificate preferred Note: Momento USA is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status. Thanks and Regards,Adam G.Momento USA | Exceeding Customer Expectations 440 Benigno Blvd, Unit#A 2nd Floor. Bellmawr, NJ 08031Interstate Business ParkDirect: 856-###-#### / Tel: 856-###-#### ext 1010 / Fax: (866) ###-####Email: ...@MomentoUsa.com YM: adam_momento Web: www.MomentoUSA.com - provided by Dice SFDC, Data Steward, CRM\n<br>\nAssociated topics: data analytic, data engineer, data integration, data manager, data quality, data scientist, data warehouse, database administrator, hbase, sql"}