{"job title": "Analyst, Data Science, CIEM", "company": "Ralph Lauren", "city state": "– New York, NY", "rating": "3.6", "job description": "The Analyst, Data Science, will partner with other members of the Data Science team as well as outside vendors to develop and implement advanced analytics across all brands, regions, and business units within Ralph Lauren. The Analyst will also partner with business leads (e.g. marketing, store ops, merchandising) to drive the adoption and success of predictive and descriptive statistical techniques e.g. propensity models, segmentations, experimental design, cluster analyses, survey sampling, CHAID, hypothesis testing, etc\n<br><br>\nEssential Duties&amp;Responsibilities\n\n\n<ul>\n<li>Participate in the design of an advanced analytics roadmap, informed by larger CIEM team and key business stakeholders</li>\n<li>Complete ad-hoc analytics projects (i.e. customer profiling, cross-shop analyses, program measurement) leveraging our Global Customer Database through SAS / SQL</li>\n<li>Build statistical models, segmentations, and cluster analyses</li>\n<li>Partner with key business stakeholders to develop learning objectives that drive business growth</li>\n<li>Design measurement and statistical methodologies that align with strategic learning objectives</li>\n<li>Provide comprehensive analysis and actionable business applications</li>\n<li>Partner with data platform team to help optimize data capture, validation, and models</li>\n<li>Collaborate with business stakeholders as an analytics leader to help inform key business decisions</li>\n<li>Be passionate about the transformative power of data; continue to learn best in class data analytics</li>\n</ul>\n\nExperience, Skills&amp;Knowledge\n<br><br>\nExperience\n\n\n<ul>\n<li>Bachelor's degree in quantitative field, Master's degree a plus</li>\n<li>3+ years hands-on experience analyzing large databases</li>\n<li>2+ years using SAS; SQL a plus; R a plus</li>\n<li>Proficient with BI, campaign management tools, and relational databases</li>\n<li>Experience with customer data and analytics such as customer profiling and segmentation</li>\n</ul>\n\nKnowledge&amp;Skills\n\n\n<ul>\n<li>1-2 years experience designing measurement and analytic plans</li>\n<li>Knowledge of statistical methodologies and segmentation models</li>\n<li>Ability to gather, manipulate, and analyze large sets of data</li>\n<li>Experience leveraging and analyzing unstructured data, i.e., social media data</li>\n<li>Ability to transform data to create a story with actionable insights</li>\n<li>Experience leveraging clickstream data preferred</li>\n<li>Team player; ability to work with a diverse set of professionals</li>\n<li>Ability to manage multiple projects and deliverables in a fast-paced environment</li>\n<li>Excellent follow-through, prioritization skills, and attention to detail</li>\n<li>Strong writing and presentation skills</li>\n<li>Strong Excel and PowerPoint skills</li>\n</ul>\n\nAnalyst, Data Science, CIEM"}