{"job title": "Data Analyst - DBA/DBSA", "company": "State Farm", "city state": "– Location: Bloomington, IL", "rating": "3.1", "job description": "<p><b>Requisition ID:</b><br> \nreq5042</p>\n\n<p><b>Job Title:</b><br>\nData Analyst - DBA/DBSA</p>\n\n<p><b>Number of Openings:</b><br>\n1</p>\n\n<p><b>Job Category:</b><br>\nProfessional/Technical\n\n</p><p><b>Employment Type:</b><br>\nRegular Full-Time</p>\n\n<p><b>Shift:</b><br>\nFirst</p>\n\n<p><b>Weekends:</b><br>\nPeriodic</p>\n\n<p><b>Location:</b><br>\nBloomington, IL</p>\n\n<p><b>Duties and Responsibilities:</b><br>\n</p><ul><li>Based on assignment, requires the technical ability to work in at least one data discipline including data design, data movement, data infrastructure platforms, and data analytics</li><li>Provides data design/data movement services to help develop solutions that improve overall quality of data and support enterprise data strategies</li><li>Uses applied analytics to enable data driven decisions by applying innovative analytic techniques, and providing exploratory research and analysis</li><li>Develops data access related to storing, retrieving or acting on housed data</li><li>Ensures work and/or the work of their teams are in compliance with enterprise policies and policies and standards within their domain of expertise and area of responsibilities</li><li>Design and execute the policies, practices, and procedures that support data quality, data security, data governance, data standardization &amp; integration</li><li>Translates functional and technical requirements into detailed design</li><li>Develops for technical data platforms such as DB2, SQL, IMS across multiple operating systems</li><li>Defines, designs, and documents conceptual and logical data models</li><li>Uses Informatica toolset to develop applications and deploy data integration/data quality applications</li><li>Tests data requirements for the movement, replication, synchronization and validation of data</li><li>Provides support for data movement solutions including extract, transformation, load (ETL)</li><li>Understands data infrastructure needed to support data services and automation</li><li>Proactively increase knowledge in the data industry, its related technologies and tools in order to work on a wide variety of assignments and products</li><li>Provides product and/or process subject matter expertise necessary to support design, development, testing and execution of technology solutions</li><li>Exhibits DevOps mindset where team is accountable for product from inception to sunset</li></ul><p></p> \n\n<p><b>Additional Details:</b></p><p>The Data Monitoring &amp; Access Reporting product team is looking for an experienced Data Analyst with prior Database Administration experience to provide support for the Guardium and Guardium Big Data Intelligence tools. In this role, your daily job will be a combination of support and maintenance activities as well as helping grow and expand data monitoring activities throughout the organization. You will be working within an agile team that is highly knowledgeable and values teamwork. </p><p> </p><p>Primary Responsibilities:</p><ul><li>Configure and maintain appliance infrastructure.</li><li>Patch installs on appliances.</li><li>Configure new appliances.</li><li>Make configuration changes as needed.</li><li>Performance monitoring of appliances.</li><li>Troubleshooting appliance issues.</li><li>Open issues/problems for any defects or issues.</li><li>Work with Business Partners to implement data monitoring solutions.</li><li>Install product software on Linux or Windows servers.</li><li>Create and maintain policies for monitoring.</li><li>Install and apply fixes/patches to vendor software on a mainframe environment.</li></ul><p>Additional Duties and Responsibilities:</p><ul><li>Provides product and/or process expertise necessary to support design, development, testing and execution of solutions.</li><li>Utilizes business and technical knowledge of server platforms/operating systems to develop and support data, databases or vendor products.</li><li>Participates in agile sprint planning; provides work estimates to deliver product stories; owns development stories.</li><li>Completes assigned stories to satisfy the defined acceptance criteria and deliver desired outcome.</li><li>Develops solutions on a variety of platforms according to business requirements.</li><li>Identifies opportunities to apply solutions which increase efficiency and effectiveness of the product.</li><li>Maintain an understanding of how technology can enhance and offer a range of solutions for continual improvement of processes in order to increase business value and/or improve efficiencies.</li></ul><p>Key Skills/Experience Necessary:</p><ul><li>Experience with database administration.</li><li>Experience working with Linux Operating System.</li><li>Proficient in SQL.</li><li>Experience with Shell Scripting. </li><li>Ability to cultivate effective working relationships and empower others. </li><li>Ability to foster innovation, encourage diversity of thought, and incorporate new ideas. </li><li>Strong communication skills, both verbal and written.</li></ul><p>Additional skills/experience desired:</p><ul><li>Mainframe knowledge/experience.</li><li>Mongo Database knowledge. </li><li>Prior experience with IBM Guardium tool.</li><li>Prior experience with IBM Guardium Big Data Intelligence/SongarG tooling.</li></ul><p><b></b><br>\n<br>Incumbency:<br><br>\nThis position will have an 18-month incumbency period, beginning on the effective date of the position, which must be met before the employee can post for any other lateral State Farm position. Employees may be considered for openings for Technology Engineer positions or promotional opportunities into leadership at any time, and into a promotional position within the same job structure after 6 months from the effective date of the position. In these cases, the remaining incumbency would be waived. The incumbency period does not affect the at-will relationship between State Farm and the employee and does not create an employment contract, nor contractual rights.<br><br>\nLast Date to Apply: 10/15/2018<br>\n</p><ul><li>Job may require travel via commercial transportation and/or driving motor vehicles</li><li>Job may require irregular work hours and travel outside normal business hours</li></ul><p></p><p>MON18</p><p>SFARM</p><p>#LI-LF1</p>"}