{"job title": "Data Migration Analyst (U.S. Citizen)", "company": "Telesto Group LLC", "city state": "– ", "rating": "3.7", "job description": "<strong><em>Telesto Group – Demystifying Application Lifecycle Management</em> </strong>\n<br><br>\nFounded in 2001, we are a specialty provider of Application Lifecycle Management (ALM) competency analysis and improvement. At Telesto Group, we strive to be the partner of choice to educate our clients and prepare them for change through our collaborative approach from strategy to implementation of their ALM solutions.\n<br><br>\nOur proven experts focus on client context - not just tools. We provide impartial, sustainable solutions delivered through an effective and efficient process-driven approach that values people, process, and organization.\n<br><br>\nAt Telesto Group, we go the extra mile; it’s part of who we are. We are continuously challenging ourselves to enhance the IT operations landscape in each of our clients.\n<br><br>\nWe are in the process of identifying a world-class <strong>Data Migration Analyst</strong> to join our Federal Sector Practice Area as a Telesto Group full-time employee or 1099 Consultant.\n<br><br>\n<strong>Job Objectives and Responsibilities</strong>\n\n\n<ul>\n\n\t<li>Hands-on experience with SAP Data Services; assessing data definitions and quality; configuring TM (Transportation Management) data fields to ingest legacy data; recommending solutions for quality improvements; and collaborating with cross functional teams comprised of customer and project team members</li>\n\n<li>Experience with collaborating data with owners and users/analysts across the customer operations to modify or implement new repeatable and reliable businesses processes to improve and sustain effective data governance resulting in improved quality and consistency of data used to drive key business decisions.</li>\n\n<li>Hands-on experience identifying, assessing and solving complex business problems for area of responsibility, where analysis of situations or data requires an in-depth evaluation of variable factors.</li>\n</ul>\n\n<strong>Skills, Knowledge and Experience Required</strong>\n\n\n<ul>\n\n\t<li>A U.S. Citizen (no dual status)</li>\n\n<li>Possess an active security clearance or candidate must be clearable</li>\n\n<li>Preference given to candidates local or willing to relocate to the St. Louis MO metro area</li>\n\n<li>Minimum of ten (10) + years SAP implementation experience</li>\n\n<li>Experience working with SAP TM, SAP MDM, and Master Data</li>\n\n<li>Participated in at least two (2) full life cycle implementations</li>\n\n<li>Strong understanding of SAP ALM and Operations methodologies in an environment using SAP Solution Manager and ChaRM</li>\n\n<li>Should work with multiple teams including BI, Data cleansing etc as needed.</li>\n\n<li>Should have good documentation skills including creating SOP, conversion execution document, and technical design document for the SAP environment as needed.</li>\n\n<li>Able to ensure that all SAP technology requirements are incorporated into the enterprise change management process</li>\n\n<li>Ability to translate business needs into technical solutions</li>\n\n<li>Ability to assess all changes for the appropriate risk level and impact.</li>\n\n<li>Excellent analytical and problem-solving skills.</li>\n\n<li>Excellent Communication skills (oral and written).</li>\n\n<li>Experience in onsite/offshore model</li>\n\n<li>B.S. in computer science, information systems, or an engineering discipline require</li>\n</ul>\n\n<strong>Desired Skills and Qualifications</strong>\n\n\n<ul>\n\n\t<li>Experience in complex SAP environments supporting multiple components preferred</li>\n\n<li>Understanding of compliance requirements for SAP changes is preferred</li>\n\n<li>Public Sector, Government, or Federal experience is preferred</li>\n\n<li>ITIL Certification is preferred</li>\n\n<li>SAP Certification is preferred</li>\n\n<li>M.S. in a related field is preferred</li>\n</ul>\n\n<strong>Telesto Group LLC provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, national origin, age, disability, genetic information, marital status, ancestry, or status as a covered veteran in accordance with applicable federal, state and local laws. Telesto Group LLC complies with applicable state and local laws governing non-discrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including, but not limited to, hiring, placement, promotion, termination, layoff, recall, transfer, leave of absence, compensation, and training.</strong>\n<br><br>\nDISCLOSURE: Please be advised that in the normal course of processing an employment application, Telesto Group will request a signed consent to perform the following screenings at the time of offer, including but not necessarily limited to: Social Security number validation, eVerify employment eligibility verification, consumer reports screening, civil and criminal public records screening, criminal history records investigation, pre-employment drug screening, and verification of employment history.\n<br>"}