{"job title": "Data&amp;Market Analyst", "company": "VIVENDI", "city state": "– Brentwood, TN", "rating": "3.6", "job description": "Under the Capitol Music Group umbrella of UMG, Capitol Christian Music Group is the market leader in the field of recorded music, distribution, and music publishing. Employing over 150 people, Capitol CMG provides a challenging and rewarding work environment characterized by a commitment to our staff, our artists and songwriters, one another, our customers and community service.\n<br><br>\nAs a part of the Business and Market Development team, this person will provide detailed analysis with a focus on artist consumption, release, account, publishing, consumer and revenue strategies.\n<br><br>\nThe analyst will need to be a proven self-starter, solutions based creative thinker with a hunger to constantly learn and evolve strategies associated with the company's artists, writers, and commercial partners.\n<br><br>\nThe analyst will be required to dive deep into performance across streaming platforms with a requirement to make recommendations based on compelling analyses, insights and big data queries. These recommendations will be used by account management and senior executive team to make informed business decisions.\n<br><br>\nThe position requires both a wide-ranging skill set for working across every department at a modern music company and a unique perspective to think ahead and anticipate the needs of tomorrow.\n<br><br>\n<strong>Job Functions:</strong>\n\n\n<ul>\n<li>Produce a variety of daily, weekly and monthly reporting.</li>\n<li>Produce ad-hoc analysis on an as-needed basis.</li>\n<li>Research&amp;build customized reports based on financial and marketing data.</li>\n<li>Collaborate as a stakeholder&amp;advocate for data analysis across Commercial Partnerships, Publishing, Marketing, Finance, Promotion, Sync&amp;Licensing, and Creative departments.</li>\n<li>Interface with central UMG Analysis, Artist Portal&amp;Research teams as well as outside data providers such as Nielsen and comScore.</li>\n<li>Create SQL queries to extract data from files within Google BigQuery.</li>\n<li>Build visualizations in Tableau, DOMO, and Google DataStudio.</li>\n<li>Support Brand Partnership&amp;Advertising initiatives with data organization and analysis</li>\n<li>Build, develop and maintain various partner, consumer behaviour, and consumption trend projects with ongoing summaries and recommendations to constantly evolve the company.</li>\n<li>Monitor and understand key performance indicators relating to our streaming partner's consumer behaviour and consumption trends to integrate into dataanalysis.</li>\n<li>Work with various visualization tools to present findings in a visually compelling way.</li>\n<li>Help develop and review methodology for cross-departmental reporting tools.</li>\n<li>Coordinate with various teams to ensure inclusion and alignment acrossdepartments and initiatives.</li>\n<li>Other duties as assigned.</li>\n</ul>\n\n<strong>Job Requirements:</strong>\n<br><br>\n<strong>Skills/Abilities:</strong>\n\n\n<ul>\n<li>In-depth knowledge of current music industry trends including key accounts,consumption pattern shifts, and the impact/variety of social media.</li>\n<li>Adept in distilling large amounts of data into concise, actionable summaries.</li>\n<li>Advanced MS Excel skills (Pivot tables, V-Lookups, index functions, CSE functions etc).</li>\n<li>Experience in Tableau, DOMO, Google DataStudio and SQL within GoogleBigQuery or other SQL platforms.</li>\n<li>Highly organized and detail-oriented team player.</li>\n<li>Ability to present findings in a visually compelling and articulate manner.</li>\n<li>Self-sufficient with the confidence to independently pursue information.</li>\n<li>Currently holding a position with a heavy use of data analytics.</li>\n<li>Possess a relaxed and confident approach to all business relationships internally and externally.</li>\n<li>Ability to understand the perspective from artist, manager, or partner at any given time.</li>\n<li>Ability to thrive in fast paced environment, manage multiple tasks at once and work to deadlines</li>\n</ul>\n\n<strong>Experience:</strong>\n\n\n<ul>\n<li>3-5 years of experience in analysis, forecasting, planning and/or industry research</li>\n<li>Music Industry preferred</li>\n</ul>\n\n<strong>Education:</strong>\n\n\n<ul>\n<li>Bachelors Degree preferred</li>\n</ul>\n\nUniversal Music Group is an Equal Opportunity Employer.\n<br><br>\nDisclaimer\n<br><br>\nThis job description only provides an overview of job responsibilities that are subject to change."}