{"job title": "Business Intelligence Analyst/Data Modeler", "company": "Webster Bank", "city state": "– New Britain, Connecticut", "rating": "3.5", "job description": "If you're looking for a meaningful career, you'll find it here at Webster. Founded in 1935 by Harold Webster Smith, our focus has always been to put people first--doing whatever we can to help individuals, families and businesses achieve their financial goals. And while we've grown into a leading commercial bank, we remain passionate about serving our customers, supporting our communities, and making a difference in people's lives. We can make a difference in your life, too. By empowering you to build the meaningful career you've been looking for.\n<br><br>\nResponsibility, respect, trust, teamwork and citizenship are the values on which Webster was founded. Together we call them The Webster Way, and they are what set us apart as a bank and an employer. Guided by these values, we put people first - working hard to live up to our customers, and each other, every day.\n<br><br>\n<strong>Position Summary:</strong>\n<br><br>\nThe Business Intelligence Analyst/Data Modeler will be responsible for supporting the Manager of Business Intelligence in providing our lines of business with trusted, high-quality data for identifying and addressing business opportunities and business risks. They will be responsible for creating data models by defining and analyzing business workflows and data requirements. They will create and use data models to connect people with data, translating important company data into digestible information that improves corporate and business processes. In support of multiple programs of business unit-focused initiatives, the Business Intelligence Analyst/Data Modeler will utilize methods to analyze data that will assist our business partners in drawing insight, driving value, and recognizing needs and goals through analysis and reporting.\n<br><br>\nMajor Duties and Responsbilities\n\n<ul>\n<li>Ability to reverse engineer databases and transfer business requirements into conceptual, logical, and/or physical models of data sets in order to support business processes</li><li>Provide analytic support and data interpretation for business partners throughout the organization</li><li>Use data to identify and recommend new ways to streamline business processes and ensure that applications and data assets are sufficient and effective</li><li>Create data models that can be easily consumed, where large data changes are scalable, where performance is predictable, and where changes in requirements are easily adaptable</li><li>Organize the integration of data and migration activities to enhance operating efficiency</li><li>Use data to create models that depict trends in the customer base and the consumer population</li><li>Identify patterns within the data models in order to build associations and relationships between data elements, assisting users in making sense of the information</li><li>Understands our businesses and ensures that there is integration between our lines of business and technology</li><li>Work with departmental managers to outline the specific data needs for each business</li><li>Educate our lines of business in the interpretation and usage of relevant business data</li><li>Ensure that data is not repeated or unnecessary, making data interpretation simpler</li><li>Test models to ensure that they are comprehensive and easy to navigate</li><li>A major contributor to the Analytics Project Development Life Cycle</li><li>Mentor and educate less experienced peers and staff on BI conceptual knowledge</li>\n</ul>\n\nEducation, Experience, and Skills\n\n<ul>\n<li>Bachelor's degree in Information Technology, Computer Science, or Mathematics preferred</li><li>5+ years of experience in the design, development and maintenance of various data models and their components</li><li>5+ years of relevant industry experience in Business Intelligence techniques and technologies, including data warehousing</li><li>5+ years in a data analyst role, with proven analytical and problem-solving skills</li><li>5+ years data mining experience</li><li>5+ years of experience with Business Intelligence tools (i.e. Tableau, Business Objects, Power BI desired but not required)</li><li>Strong knowledge of Oracle and SQL database management</li><li>Strong knowledge of metadata management</li><li>Strong knowledge of Microsoft excel (pivots, excel formulae...)</li><li>Experience in data virtualization (Denodo desired but not required)</li><li>Experience in data integration engines (Informatica desired but not required)</li><li>Practical application ability with Microsoft Office and Visio</li><li>A creative mind with a passion and skill for discovering patterns</li><li>Ability to collaborate effectively and work as part of a team</li><li>Strong social knowledge for interacting with various departments across the organization</li><li>Strong social knowledge for integrating various teams across the organization</li><li>Enthusiastic learner and devoted to customer service and quality control</li><li>Solid public speaking and presentation skills</li><li>Strong attention to detail</li><li>Strong communication skills</li><li>Strong time management skills</li><li>An understanding of Data Governance and Master Data Management concepts desired but not required</li><li>Six Sigma Training or Certification desired but not required</li>\n</ul>"}