{"job title": "Senior Scientist", "company": "ADM", "city state": "– Decatur, IL", "rating": "3.6", "job description": "<ul>\n<li>*Job Title:**</li>\n</ul>\n\nSenior Scientist - Decatur, IL\n\n\n<ul>\n<li>*Department/Function:**</li>\n</ul>\n\nResearch &amp; Development\n\n\n<ul>\n<li>*Job Description:**</li>\n</ul>\n\nFor more than a century, the people of Archer Daniels Midland Company (NYSE: ADM) have transformed crops into products that serve the vital needs of a growing world. Today, we?re one of the world?s largest agricultural processors and food ingredient providers, with approximately 32,000 employees serving customers in more than 160 countries. With a global value chain that includes approximately 500 crop procurement locations, 250 ingredient manufacturing facilities, 38 innovation centers and the world?s premier crop transportation network, we connect the harvest to the home, making products for food, animal feed, industrial and energy uses. Learn more at www.adm.com\n\n\n<ul>\n<li>*Senior Scientist- Applications Science and Technology ? Decatur, IL**</li>\n<li>*Research &amp; Development**</li>\n</ul>\n\nThis is an exempt level position.\n\n\n<ul>\n<li>*Position Summary:**</li>\n</ul>\n\nThe research group of Archer Daniels Midland Company is actively seeking an individual to serve as a Senior Scientist within AS&amp;T. The position will serve two primary functions:\n<br><br>\n+ Serve as AS&amp;T expert in food and beverage applications, working closely with process specialists to optimize current or new specialty ingredients;\n<br><br>\n+ Provide formulation/production expertise to customers using ADM ingredients in applications.\n\n\n<ul>\n<li>*Job Responsibilities:**</li>\n</ul>\n\n+ Evaluate ingredients for their suitability in food and beverage applications with respect to sensory, stability, &amp; processing\n<br><br>\n+ Provide feedback to ingredient experts on existing or new functional ingredients to optimize their performance\n<br><br>\n+ Formulate food and beverage prototypes using ADM ingredients to achieve specific consumer nutrition and flavor targets\n<br><br>\n+ Assist customers in the production of food and beverage products including attending plant trials, providing troubleshooting as needed\n<br><br>\n+ Participate in food and beverage applications platforms team globally to share expertise and information across the company in order to drive more unique, high quality food and beverage applications\n<br><br>\n+ Work closely with sensory science department to generate data needed for marketing purposes and to understand flavor and texture changes in applications over shelf-life\n<br><br>\n+ Provide customers with training in the use of ADM ingredients in food and beverage systems through presentations and bench/pilot experimentation\n<br><br>\n+ Assist customers in product scale-up, partnering with co-manufacturing plants and food innovation incubators\n<br><br>\n+ Gain and maintain excellent knowledge of current food and beverage market related to ingredients and customer trends by working closely with ADM marketing groups and attending trade shows\n\n\n<ul>\n<li>*Job Requirements:**</li>\n</ul>\n\n+ PhD or Master of Science Degree in Food Science or related field of study\n<br><br>\n+ Must have 5-10 years? experience actively developing food and beverage products\n<br><br>\n+ Strong expertise utilizing starch ingredients in a variety of applications\n<br><br>\n+ Must be willing to work on the bench actively developing/evaluating applications\n<br><br>\n+ Possess strong knowledge of formulation and processing to change flavor, color, texture, nutritional value, or physical, chemical, and microbiological composition a variety of applications\n<br><br>\n+ Possess excellent project management skills to prioritize projects and move multiple projects to completion simultaneously\n<br><br>\n+ Must be able to work independently and be self-motivated\n<br><br>\n+ Must possess good interpersonal skills and the ability to work and relate directly to individuals from the areas of food science, production, sales, marketing, and commercial teams\n<br><br>\n+ Must be a team player and have excellent written, verbal and presentation skills\n<br><br>\n+ The position requires approximately 20% travel and will be based in Decatur, IL\n<br><br>\nRelocation assistance is available with this position.\n<br><br>\n<strong>.</strong>\n\n\n<ul>\n<li>*Job Description (Continued):**</li>\n</ul>\n\nThis position offers a complete benefit package, including 401K/ESOP, pension, health, life, vision, and dental insurance.\n<br><br>\nADM requires the successful completion of a pre-employment drug screen and a background check.\n<br><br>\nADM is an EOE for minorities, females, protected veterans and individuals with a disability.\n\n\n<ul>\n<li>*City:**</li>\n</ul>\n\nDecatur\n\n\n<ul>\n<li>*State:**</li>\n</ul>\n\nIL - Illinois\n\n\n<ul>\n<li>*Ref ID:**</li>\n</ul>\n\n<strong>\\#LI-DNP</strong>\n\n\n<ul>\n<li>*EEO:**</li>\n</ul>\n\nADM is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability and veterans status."}