{"job title": "Practice Manager, Data Science", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "Amazon Web Services (AWS) Professional Services team is looking for a Practice Manager in the AI Global Services Practice with a successful history of delivering best-in-class AI/ML solutions, managing world-class talent, and possessing the drive and experience to scale both to effectively meet the needs of our customers.\n<br><br>\nThe Practice Manager will build a working relationship with their sales, solution architects, and professional services counterparts. The Practice Manager will also have a team of 8-12 direct reports that are data scientists to develop a long-term AI (Artificial Intelligence) /ML (Machine Learning) strategy and execution plan within their geographic regions with other AWS Professional Services colleauges. This individual is a trusted adviser for our enterprise customers and requires the skills to excel at all aspects of business development, people management, relationship development, delivery of AI solutions and program management in their accounts, following a player/coach model.\n<br><br>\n<strong>RESPONSIBILITIES</strong>\n\n\n<ul>\n<li>Hiring, developing and retaining top talent.</li>\n<li>Engage with commercial enterprise customers to understand their business drivers and application portfolio.</li>\n<li>Development of long term AI/ML strategy for our customers</li>\n<li>Identification and development of specific AI opportunities and supporting business cases.</li>\n<li>Mitigation of delivery risks and issues.</li>\n<li>Overseeing delivery of AI projects, ensuring high quality delivery.</li>\n<li>Act as single person of contact for Customer executives, developing deep, trustful relations.</li>\n<li>Educate customers on AWS AI/ML services and translate those into a clear business value proposition.</li>\n<li>Envision and inspire customers, on the potential of ML to help their business.</li>\n<li>Coaching Customer and Partner teams to be self-sufficient</li>\n</ul>"}