{"job title": "Conservation Research Scientist", "company": "Arizona-Sonora Desert Museum", "city state": "– AZ, Tucson", "rating": "2.8", "job description": "The Arizona-Sonora Desert Museum is a world-renowned zoo, botanical garden, natural history museum, and Art Institute, with a long history of basic and applied research in support of Sonoran Desert conservation. The Conservation Research Scientist position provides an opportunity for an excellent scientist to contribute new knowledge, understanding and conservation action consistent with The Arizona-Sonora Desert Museum’s mission of protecting the Sonoran Desert.\n<br><br>\n_________________________\n<br><br>\n<strong>Position Description</strong>\n<br><br>\n<strong>Department:</strong> Conservation Education &amp; Science\n<br>\n<strong>Reports To:</strong> Director of Conservation Education and Science\n<br>\n<strong>Reviewed:</strong> April 26, 2018\n<br>\n<strong>Expected Start Date:</strong> October 1, 2018\n<br><br>\n<strong>Summary</strong> \n<br>\nThe Arizona-Sonora Desert Museum has played a crucial role in developing and disseminating the foundational knowledge of Sonoran Desert natural history. Over its 66-year history, it has also contributed to significant conservation efforts, including numerous endangered species recovery and survival plans; establishing protected areas in the Gulf of California, Sonoran Tropical Deciduous Forest and Arizona’s Ironwood Forest National Monument; developing the Sonoran Desert Conservation Plan for Pima County; documenting the needs and ecosystem services of migratory pollinators, and the founding of the Southern Arizona Buffelgrass Coordination Center. As a well-known and highly-respected institution with skills at translating science for general audiences, the Museum has often filled the niche of catalyst, helping to gather critical data, connect conservationists across cultural and political borders, translate science for decision-makers and tell inspiring conservation stories.\n<br><br>\nThe Conservation Research Scientist will carry out their own research as well as work with regional partners to facilitate research and information exchange. He/she will identify and secure resources to catalyze and elevate conservation efforts. Current research and conservation areas of focus are invasive species and pollinator ecology in the Sonoran Desert. The Museum welcomes applications from scientists whose work ties to any aspect of these topics, from the landscape to the organismal scale. In addition to research and conservation work, the Conservation Research Scientist will help build awareness, understanding and support for conservation among the Museum’s audiences via regular communication through presentations and workshops, and popular articles. The Conservation Research Scientist is ideally expected to divide their time among research, coordination of conservation partnerships and public outreach.\n<br><br>\n<strong>Essential Duties and Responsibilities</strong> include the following. Other duties may be assigned.\n<ul>\n\t<li>Research\n\n<ul>\n <li>Maintains an active research program in a field related to the Museum’s current focus areas, pollination biology and invasive species,</li> <li>Contributes to conservation science by publishing in the peer-reviewed literature.</li> <li>Collaborates with colleagues at the University of Arizona, and possibly other universities to build robust partnerships that have the critical mass to “move the needle” on a conservation issue.</li></ul>\t</li>\n<li>Conservation Coordination and Fundraising\n\n<ul>\n <li>Fosters and maintains collaborations among scientists, land managers, conservationists and other professionals and organizations that advance Sonoran Desert conservation, working in both Mexico and the US.</li> <li>Strategically chooses conservation efforts in which the Museum can play a catalytic role, helping to move the programs to the next level.</li> <li>Works with Museum colleagues to develop and implement short-term and long-term funding strategies through a combination of public and private grants. It is expected that the Conservation Research Scientist help to raise a portion of their salary each year.</li></ul>\t</li>\n<li>Public Outreach\n\n<ul>\n <li>Builds capacity for conservation via activities such as:\n\n<ul>\n <li>Providing training opportunities for students and young professionals on both sides of the US-Mexico border.</li> <li>Engaging the general public via citizen science and volunteer opportunities, public presentations and digital and printed media.</li> <li>Teaching public programs and providing training to Museum staff and volunteers, including teen and college interns.</li></ul> </li>\n<li>Provides guidance and answers questions in the area of Sonoran Desert science and conservation from ASDM staff, volunteers, and the public on both sides of the border.</li> <li>Contributes to the scientific accuracy of ASDM interpretive and educational programs, and publications.</li></ul>\t</li>\n</ul>\n<strong>Supervisory Responsibilities</strong> \n<br>\nThis job has no supervisory responsibilities.\n<br><br>\n<em>This position does not have a closing date and is considered open until filled; however, it is recommended that all credentials be submitted for consideration as soon as possible. Please understand that if offered a position, you will, as a final condition of employment, be required to successfully complete</em> <em><em>pre-employment drug screen.</em></em>"}