{"job title": "Senior Scientist", "company": "Bristol Myers Squibb", "city state": "– Devens, MA", "rating": "3.7", "job description": "<ul>\n<li>*Senior Scientist - Downstream ? Microbial and New Modality Non-Platform Process Development**</li>\n<li>*BIOLOGICS PROCESS DEVELOPMENT**</li>\n</ul>\n\nBristol-Myers Squibb is a global biopharmaceutical company whose mission is to discover, develop and deliver innovative medicines that help patients prevail over serious diseases.\n<br><br>\nOne shared journey is moving us forward at Bristol-Myers Squibb. Around the world, we are passionate about making an impact on the lives of patients with serious disease. Empowered to apply our individual talents and ideas so that we can learn and grow together. And driven to make a difference, from innovative research to hands-on community support. Bristol-Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees the resources to pursue their goals, both at work and in their personal lives.\n<br><br>\nBristol-Myers Squibb has expanded the large-scale biologics manufacturing facility in Devens, Massachusetts. The expansion included biologics development and clinical trial manufacturing capabilities to the site. Both represent new capabilities for Devens, a site that in its early years has focused solely on large-scale, bulk biologics manufacturing.\n<br><br>\nThis position will be part of a newly established group in Devens, MA that is responsible for manufacturing process development of microbial and new modality assets, which are mostly non-platform. Additionally, this group will be overseeing the technical aspect of the externalization of our portfolio work, including both microbial- and mammalian-based. Furthermore, this position will provide technical oversight to the new modality asset?s manufacturing process development in our pipeline, such as non-platform viral products (gene therapy, CAR-T, etc.) and clinical manufacturing at various third-party vendors. This role is within the Biologics Development organization at Devens, MA.\n<br><br>\nSpecifically, this person will be part of a team to develop downstream processes in partnership with upstream development groups for both early and late stage non-mammalian products. Functional responsibilities here include experimental work for process development and characterization. This role will also include tech transfer and monitoring activities with third party organizations for a growing pipeline of new modality assets including non-platform viral products (gene therapy, CAR-T), etc. Thus, this might necessitate travel up to 10%. The candidate will actively partner with the overall downstream team, Manufacturing, MS&amp;T, Analytics, Project Management, and R&amp;D groups in a matrix, team organization to achieve a seamless and platform purification process approach.. The candidate will also present and report results to senior leadership within the Biologics Process Development organization.\n\n\n<ul>\n<li>*Key Responsibilities**</li>\n</ul>\n\n+ Certain amount of hands-on operation needed for downstream process development.\n<br><br>\n+ Design, execution and data interpretation of laboratory experiments as well as providing guidance to team members\n<br><br>\n+ Support process development, process characterization and scale up activities to both CRO and CMO sites.\n<br><br>\n+ Prepare/review technical documents including development /tech transfer reports, batch records, SOPs and CMC regulatory submissions.\n<br><br>\n+ Participate on cross-functional teams to progress both early and late stage drug candidates.\n<br><br>\n+ Train junior team members in lab operations.\n<br><br>\n+ Recommend innovative new technologies and perform the necessary experiments for evaluation and implementation.\n\n\n<ul>\n<li>*Qualifications:**</li>\n</ul>\n\n+ Ph.D.: Chemical/Biochemical Engineering, Biochemistry, Biophysics, or equivalent with a minimum of 5+ years of industry and/or academic experience or a MS/BS with a minimum of 10+ years of industry and/or academic experience\n<br><br>\n+ In depth understanding and hands on experience in downstream process development, preferably for virus and microbial products other than mAbs\n<br><br>\n+ Knowledge of virus purification for gene therapy is highly preferred.\n<br><br>\n+ Managerial ability to lead matrix teams\n<br><br>\n+ Knowledge of statistical experimental design and data analysis.\n<br><br>\n+ Knowledge of cGMPs as applied to process development and scale up.\n<br><br>\n+ Knowledge of mammalian cell culture and downstream processing\n<br><br>\n+ Ability to work collaboratively in a team and matrix environment\n<br><br>\n+ Excellent oral and written communication skills\n<br><br>\n+ Ability for travel of approximately 10%\n<br><br>\nBristol-Myers Squibb is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status."}