{"job title": "Social Scientist", "company": "Department Of The Interior", "city state": "– Anchorage, AK", "rating": "3.4", "job description": "<ul>\n<li>Videos</li>\n<li>Duties</li>\n</ul>\n\nHelpDuties Summary\n<br><br>\nThe Bureau of Ocean Energy Management (BOEM) manages the exploration and development of the nation's offshore resources. It seeks to appropriately balance economic development, energy independence, and environmental protection through oil and gas leases, renewable energy development and environmental reviews and studies. For information about our bureau go to: http://www.boem.gov/\n<br><br>\nThis vacancy may be used to fill additional positions as vacancies become available.\n<br><br>\nLearn more about this agency\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nThis position is located within the Department of the Interior, Bureau of Ocean Energy Management, Alaska Outer Continental Shelf (OCS) Region, Environmental Sciences Management Section, in Anchorage, AK.\n<br><br>\nSalary Information\n<br><br>\nGS-11: $67,930-$88,312 per annum, GS-12: $81,421-$105,847 per annum, GS-13: $96,819-$125,865 per annum. First time hires to the Federal government normally start at the lower salary range of the grade level.\n<br><br>\nThis vacancy is also announced as BOEM-MMJJ-18-RD-086(DEU) for those applicants who wish to apply and be considered under Competitive Examining procedures.\n<br><br>\nAt the full performance level GS-13 the major duties of this position include, but are not limited to the following:\n\n\n<ul>\n<li>Serves as a technical authority on social science studies (economics, sociology, anthropology, archaeology, and/or public administration) in the Alaska region office with an emphasis on issues pertaining to the economy, fisheries, subsistence, sociocultural systems, community health, historic and prehistoric resources, tourism and recreation, visual resources, land use and environmental justice.</li>\n<li>Works with Federal, State, and local agencies, as well as elected officials from Tribes, Alaska Native Regional Corporations (ANCSA Corporations), and Alaska communities regarding the development and review of environmental studies.</li>\n<li>Provides scientific advice and oversees coordination, planning, budgeting, and initiation of important scientific investigations (i.e. research, studies, and projects) which are categorized under the subjects of social science research.</li>\n<li>Reviews and assists in the development of Statements of Work (SOW); requests for proposals (RFPs) developed from the SOWs; proposals submitted in response to RFPs; draft and final reports resulting from the technical work conducted for BOEM and other project deliverables.</li>\n<li>Makes inspections of contracted research facilities and OCS development activities in the field to assess the effectiveness of the existing policies and/or techniques are deficient or inadequate and require additional study or revision.</li>\n<li>Serves as the Region's Historic Preservation Officer and, as such, conducts National Historic Preservation Act Section 106 consultations and coordinates the Alaska Region's participation in BOEM's historic preservation program.</li>\n<li>Reviews, comments, or provides information or support to the BOEM National ESP and Alaska Region Environmental Sciences Management Section (i.e. Studies Plans, SOWs, proposals, etc.), the Alaska Region Environmental Analysis Sections- (review of Environmental Impact Statements, Environmental Assessments, Cumulative Impacts etc.), and other BOEM offices and divisions, and the Directorate.</li>\n<li>Participates in both the conceptualization and preparation of Environmental Impact Statements (EIS) and Environmental Assessments (EA) concerning archeological and cultural resources. Reviews technical quality of environmental analyses performed and reported by others.</li>\n</ul>\n\nTravel Required\n<br><br>\nOccasional travel - Occasional travel of 1-5 nights per month may be required.\n<br><br>\nSupervisory status\n<br><br>\nNo\n<br><br>\nPromotion Potential\n<br><br>\n<strong>13</strong>\n\n\n<ul>\n<li>Job family (Series)</li>\n</ul>\n\n0101 Social Science\n\n\n<ul>\n<li>Requirements</li>\n</ul>\n\nHelpRequirements Conditions of Employment\n\n\n<ul>\n<li>You must be a U.S. Citizen.</li>\n<li>You will be subject to a background/suitability investigation/determination</li>\n<li>You will be required to have federal payments made by Direct Deposit.</li>\n<li>You must submit ALL required documents and a completed questionnaire.</li>\n</ul>\n\nSelective Service: If you are a male applicant born after December 31, 1959, you must certify that you have registered with the Selective Service system, or are exempt from having to do so under the Selective Service Law. See http://www.sss.gov/.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n<strong>Minimum Qualification Requirements:</strong>\n<br><br>\nTo qualify for this position you must meet the (1) Basic Educational Requirements AND (2) Specialized Experience for the series/grade to which you are applying.\n<br><br>\n<strong>(1) Basic Educational Requirements:</strong>\n<br><br>\nIn addition to the specialized experience requirements for this position, applicants must meet the Education Requirements described below:\n<br><br>\nA. Degree: behavioral or social science; or related disciplines appropriate to the position.\n\n\n<ul>\n<li>OR-</li>\n</ul>\n\nB. Combination of education and experience that provided the applicant with knowledge of one or more of the behavioral or social sciences equivalent to a major in the field.\n\n\n<ul>\n<li>OR-</li>\n</ul>\n\nC. Four years of appropriate experience that demonstrated that the applicant has acquired knowledge of one or more of the behavioral or social sciences equivalent to a major in the field.\n<br><br>\n<strong>(2) Specialized Experience:</strong>\n<br><br>\n<strong>GS-11</strong>\n<br><br>\nTo qualify for the GS-11, you must possess at least one full year of specialized experience equivalent to the GS-09 level in the Federal service, or comparable experience not gained through Federal service. Specialized experience is experience that equipped the applicant with the particular knowledge, skills, and abilities to perform successfully the duties of the position, and that is typically in or related to the work of the position to be filled. Specialized experience is defined as demonstrated experience: 1) planning and executing social science studies; and 2) analyzing and evaluating scientific data in order to make recommendations for improvement in processes.\n\n\n<ul>\n<li>OR-</li>\n</ul>\n\nEducation: 3 years of progressively higher level graduate education leading to a Ph.D. degree or Ph.D. or equivalent doctoral degree\n\n\n<ul>\n<li>OR-</li>\n</ul>\n\nCombination of education and experience: appropriate combination of education and experience that totals 100%. Note: Only graduate level education in excess of 36 semester hours may be applied toward the combination at this grade level.\n\n\n<ul>\n<li>Note: You may not substitute education for experience at the GS-12 and GS-13 levels.*</li>\n</ul>\n\n<strong>GS-12</strong>\n<br><br>\nTo qualify for the GS-12, you must possess at least one full year of specialized experience equivalent to the GS-11 level in the Federal service, or comparable experience not gained through Federal service. Specialized experience is experience that equipped the applicant with the particular knowledge, skills, and abilities to perform successfully the duties of the position, and that is typically in or related to the work of the position to be filled. Specialized experience is defined as demonstrated experience: 1) planning and executing social science studies; 2) analyzing and evaluating scientific data in order to make recommendations for improvement in processes; and 3) drafting reports resulting from research conducted on marine resource management and/or ocean energy development.\n<br><br>\n<strong>GS-13</strong>\n<br><br>\nTo qualify for the GS-13, you must possess at least one full year of specialized experience equivalent to the GS-12 level in the Federal service, or comparable experience not gained through Federal service. Specialized experience is experience that equipped the applicant with the particular knowledge, skills, and abilities to perform successfully the duties of the position, and that is typically in or related to the work of the position to be filled. Specialized experience is defined as demonstrated experience: 1) planning and executing social science studies; 2) analyzing and evaluating scientific data in order to make recommendations for improvement in processes; 3) drafting reports resulting from research conducted on marine resource management and/or ocean energy development; and 4) executing and leading major studies/projects to measure the impacts of conventional or renewable energy development and/or sand/gravel mining activities.\n<br><br>\nAdditional information on the qualification requirements is outlined in the OPM Qualification Standards Handbook of General Schedule Positions and is available at OPM's website: https://www.opm.gov/qualifications/standards/indexes/num-ndx.asp\n<br><br>\nAll qualification requirements must be met by the closing date of this announcement.\n<br><br>\nMerit Promotion candidates must also meet Time-in-Grade requirements by the closing date of the announcement.\n<br><br>\n<strong>Education</strong>\n<br><br>\nEducation: If this position requires specific educational course work to qualify, or you are qualifying based in whole or part on education, you are required to provide transcripts as proof of meeting the requirements.\n<br><br>\nForeign Education: Education completed in colleges or universities outside the United States may be used to meet the specific educational requirements as stated above. You must provide acceptable documentation that the foreign education is comparable to that received in an accredited educational institution in the United States. For more information on how foreign education is evaluated, visit: http://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-policies/#url=e4"}