{"job title": "Clinical Scientist - Contract to Hire", "company": "Halozyme", "city state": "– San Diego", "rating": "3.1", "job description": "<p>Save time and apply through your LinkedIn account. Click the Apply with LinkedIn button and your LinkedIn profile will be imported into our site. </p><p></p><p>In order to move forward, you will need to create an account. Your password must be eight characters long, contain at least one special character, one capital letter and a number. </p><p></p><p>We look forward to discovering your talents.</p><p></p><p></p><p></p><p><b>Note: This is a contract to hire position</b></p><p></p><p><b>POSITION SUMMARY:</b></p><p>The Clinical Scientist is responsible for supporting activities related to ongoing conduct and planned interim/final analyses for an ongoing global Phase 3 registration study. Specifically, the position will focus on ongoing data review, coding, review of protocol deviations, and review of blinded study data, with regards to ongoing preparation for data monitoring committee meetings, and review of safety and patient data.</p><p></p><p><b>ESSENTIAL FUNCTIONS AND RESPONSIBILITIES:</b></p><p>These may include but are not limited to:</p><ul><li>Work with Clinical Operations and Data Management in database review, query and clean-up activities in real-time and prior to database lock</li><li>Support interim response determination of patients on study</li><li>Assist with study site training/oversight, and data analyses</li><li>Author, develop, and amend clinical study protocols, consent forms, case report forms and regulatory submission documents</li><li>Deliver enhanced efficiencies and quality around tactical deliverables, IND or BLA and other regulatory submissions, protocol development, amendments and all supporting documents, PK/PD and clinical data collection and analysis, investigator and site communications, study reports and publications in cross-functional sub-team</li></ul><p></p><p><b>ADDITIONAL FUNCTIONS AND RESPONSIBILITIES:</b></p><ul><li>Other duties as assigned</li></ul><p></p><p><b>EDUCATION, EXPERIENCE, KNOWLEDGE, SKILLS AND ABILITIES:</b></p><ul><li>A minimum of a Bachelor’s degree in life sciences (advanced degree preferred) with at least 10 years of industry experience (an equivalent combination of education and relevant experience may be considered)</li><li>Prior experience working on clinical studies in either a clinical scientist or clinical operational role </li><li>Demonstrated effective oral and written communication skills and excellent interpersonal skills with demonstrated ability to work with a team</li><li>Proven ability to work independently, proactively and efficiently in a fast-paced dynamic environment </li><li>Outstanding academic achievement (e.g. RN, PharmD or MD) preferred</li><li>Hands-on clinical background and experience with Phase 3 biopharmaceutical trials preferred</li></ul><p></p><p><b>TECHNICAL KNOWLEDGE REQUIRED:</b></p><p><u>Equipment:</u> PC, scanners, facsimile machine, voice mail and e-mail systems, and common office machines, or ability to be trained. </p><p></p><p><u>Software Knowledge</u>: Windows, MS Office (Outlook, Word, Excel). Knowledge of other software required: able to navigate and use different study EDC and IRT systems.</p><p></p><p><b><u>INTERNAL AND EXTERNAL RELATIONSHIPS:</u></b></p><ul><li>Internally interface with all the disciplines necessary for successful drug development: pre-clinical, manufacturing, quality assurance, regulatory, medical affairs, marketing, legal, biostatistics and data management, pharmacovigilance, and clinical operations</li><li>External relationships may include IRBs, Investigators, KOLs, and collaborators </li></ul><p></p><p><b><u>EFFORT REQUIRED/ENVIRONMENTAL CONDITIONS:</u></b></p><p><u>Physical Activities</u>: On a continuous basis, sit at desk for a long period of time; intermittently answer telephone and write or use a keyboard to communicate through written means. Some walking and lifting up to 20 lbs. may be required. The noise level in the work environment is usually low to moderate. The physical demands described above are representative of those that must be met by an employee to successfully perform the essential functions and responsibilities of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions and responsibilities.</p><p></p><p><b>TRAVEL:</b></p><p>Travel may be required up to 15% of your time</p>"}