{"job title": "Clinical Scientist", "company": "Halozyme Therapeutics, Inc.", "city state": "– San Diego, CA", "rating": "3.1", "job description": "POSITION SUMMARY:\n<br><br>\nThe Clinical Scientist integrates scientific drug development knowledge to ensure excellence in development and translation of clinical research plans into efficiently implemented clinical trial protocols. The Clinical Scientist is responsible for working collaboratively with the study Medical Director and other members of the SET (Study Execution Team) to establish efficient trial data review, trial document review and trial execution for one or more protocols in Phase I-III oncology clinical trials.\n<br><br>\nESSENTIAL FUNCTIONS AND RESPONSIBILITIES:\n<br><br>\nThese may include but are not limited to:\n<br><br>\nProvide supportive for the scientific conduct of protocols and assist the study Medical Director with the scientific conduct of clinical studies for a single trial or across multiple phase I-III clinical trials\n<br>\nSupport initial review of clinical data in the clinical database by conducting clinical data review, analysis and interpretation\n<br>\nWork with Clinical Operations and Data Management in database review, query and clean-up activities in real-time and prior to database lock\n<br>\nSupport the study Medical Director in developing, amending clinical study protocols and actively participates in defining the key clinical components and elements of the clinical protocols\n<br>\nSupport the Medical Director in updating clinical development essential documents like (but not limited to) clinical sections in: IB, IND, ICF, Annual Reports, CSR, patient narratives and other clinical documents, and maintaining those documents, in accordance to GCP, and to highest levels of quality and accuracy.\n<br>\nWork in collaboration with the Medical Director to help address questions and queries from sites and CROs\n<br>\nProvide the Medical Director and SET with relevant clinical data, key developments and updates from the national, international and academic symposia and conferences for one or more indications and/or clinical trials\n<br>\nProvide literature based clinical data, and epidemiology-based data that support study design, study execution and study results analysis for one or more clinical protocols\n<br>\nWork in collaboration with Medical Director in preparation of meeting materials needed for strategy decisions at relevant teams, governance, external consultants, KOLs and potentially regulatory meetings\n<br>\nSupport SIVs, and site training activities, in close collaboration with Clinical Operations, CROs and MSLs\n<br>\nADDITIONAL FUNCTIONS AND RESPONSIBILITIES:\n<br><br>\nSupport Halozyme’s SET, Medical Director and Clinical Operations in identifying and managing critical path activities such as selection of countries and sites\n<br>\nSupport the Medical Director and Data Management in CRF development, EDC system development, study portal setup, and study monitoring activities\n<br>\nReview ongoing PK, PD, safety and efficacy real-time data in electronic databases.\n<br>\nResponds and contributes to novel study designs\n<br>\nOther duties as assigned\n<br>\nEDUCATION, EXPERIENCE, KNOWLEDGE, SKILLS AND ABILITIES:\n<br><br>\nMinimum Masters’ degree in Nursing (MSN) or PharmD with at least 8 years’ experience in clinical research in biotechnology or pharmaceutical settings and 2+ years’ as a clinical scientist (equivalent combination of clinical experience and education may be considered)\n<br>\nDemonstrated ability to review and summarize clinical trial data, including experience in preparing and presenting data\n<br>\nHands-on experience performing systematic literature search, summarizing the search results and presenting the conclusions to wide spectrum of audience\n<br>\nSuccessful track record interpreting clinical data for individual patients and aggregate data, making conclusions and presenting the results\n<br>\nDemonstrated effective oral and written communication skills and excellent interpersonal skills\n<br>\nProven ability to perform the essential role duties with key cross functional team members within Halozyme (e.g. Biostatistics, Clinical Operations, Data Management) and with Halozyme service providers (i.e. CROs)\n<br>\nSelf-directed desire and ability to work independently, proactively and efficiently in a fast-paced dynamic environment\n<br>\nDemonstrated ability to work collaboratively in a matrixed environment with wide spectrum of cross functional team members\n<br>\nWorking knowledge and experience in clinical trial design is preferred\n<br>\nHem/Oncology experience preferred but not required\n<br>\nTECHNICAL KNOWLEDGE REQUIRED:\n<br><br>\nEquipment: PC, scanners, facsimile machine, voice mail and e-mail systems, and common office machines, or ability to be trained. Knowledge of other equipment required: N/A\n<br><br>\nSoftware Knowledge: Windows, MS Office (Outlook, Word, Excel). Knowledge of other software required: N/A\n<br><br>\nINTERNAL AND EXTERNAL RELATIONSHIPS:\n<br><br>\nData Management and Statistics, Safety and Pharmacovigilance, Clinical Operations, and Medical Writing groups Vendor, CRO and external partnerships"}