{"job title": "Senior Environmental Scientists", "company": "Jacobs", "city state": "– Yakima, WA", "rating": "3.4", "job description": "Job Summary:\n<br><br>\nJacobs is hiring three part-time temporary positions that are Senior Environmental Scientist(s) providing technical, scientific support and evaluation of engineering design concepts on natural systems. These evaluations may be focused on hydraulic modeling, preliminary to advanced designs, environmental resources, and may involve input during phases of planning, policy development, habitat and/or hydrologic characterization, data analysis, work planning and report writing.\n<br><br>\nThese positions will aid Jacobs in working within an interagency team to develop solutions to problems of unusual complexity that require a high degree of innovation and ingenuity. Work performed under the direction of the Jacobs management and/or directly with clients or their representative(s). This direction will focus on the long-range goals and objectives of projects in the Yakima and Kittitas Valley and may have substantial client interaction. This position is based out of our Yakima, WA office. It requires knowledge and understanding of:\n<br>\nPolicy development/implementation\n<br>\nHydraulic/hydrologic processes\n<br>\nBiological processes\n<br>\nReview procedures for compliance with environmental regulations\n<br>\nUnderstanding and coordination of project concepts that effect fish, aquatic life, and the aquatic environment/habitat\n<br>\nPreparing technical memorandum(s) and/or report(s) based on information and concepts provided by others and assisting in the preparation of cost estimates related to these concepts\n<br>\nPerforming technical tasks and assisting with the execution of scientific programs under the supervision of a project manager and/or government agency staff\n<br>\nInteract with project managers project controls, administrative and safety staff; as well as subcontractors and agency staff\n<br><br>\nQualifications\n<br>\nA Bachelors degree in Hydraulics, Biology, Geosciences, or Environmental Sciences is preferred\n<br>\nA minimum of 20 years of experience in a field related to the degrees listed is required\n<br>\nComputer literacy in software typical of discipline is preferred\n<br>\nStrong technical writing, interpersonal, and client relation skills are preferred\n<br>\nFamiliarity with government and public sector projects are preferred\n<br>\nUnderstanding and familiarity related to the policy, habitat, riverine systems, and water issues in the Kittitas and Yakima Valleys is required"}