{"job title": "Regulatory Scientist", "company": "Kerry", "city state": "– US-WI-Beloit", "rating": "3.3", "job description": "<div><div>\n<div>We all want a career we can feel good about. Leading to better encompasses everything we do at Kerry, it's how we've become the world's leading taste and nutrition company. Whether it's building sustainable solutions for consumers or building benefits and opportunities for employees, the main thread of the Kerry fabric is #LeadingToBetter. With focus on a sustainable future, a career with Kerry is something you can feel good about.\n<br><br>\n<strong>Leading to better.</strong>\n<br><br>\nThrough sensory science and technology, Kerry develops and manufactures food and beverage solutions for popular brands throughout the world. In fact, you've most likely experienced Kerry in the food or beverages you've consumed in the past few days!\n<br><br>\n<strong>Leading to better, together.</strong>\n<br><br>\nTogether, we shape how the world views food and beverage. Leading to better, together means we do this in a culture that nurtures agility, speed, quality and safety and we do this through:\n<ul>\n<li>Celebrating curiosity that leads to action</li><li>Empowering our people</li><li>Promoting diverse thinking</li><li>Investing in innovation</li><li>Acting on sustainability</li><li>Embracing our differences</li>\n</ul>\nKerry is an equal opportunity employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age disability, protected veteran status or other characteristics protected by law. Kerry will only employ those who are legally authorized to work in the United States for this opening. Any offer of employment is conditional upon the successful completion of a background investigation and drug screen.</div>\n</div>\n</div>\n\n<br>Description and Responsibilities<br>\n\n<div>\n<div>\n<div>The Regulatory Specialist works under the direction of a manager and is responsible for the creation, handling, storage and retrieval of various documents related to Kerry finished products.\n<br><br>\nReports to Regulatory Affairs Manager within the corporate Regulatory Affairs group or within an assigned SBU. In addition, the Regulatory Specialist must have a day-to-day working relationship with plant, R&amp;D, QA, Customer Service, Purchasing, and IS personnel.\n<br><br>\nMaintain product information systems for Technical Data System (TDS), Nutrition program, labeling programs, percentage range program, Allergen program, Kosher Certificate program, customer specification program and any product related research programs.\n<ul>\n<li>Manage and enter product data into the MAPICS databases for finished product and raw materials.</li><li>Review labeling and labels for compliance with regulatory requirements.</li><li>Review changes to existing products and SOPs to define the requirements for regulatory submissions.</li><li>Maintain current knowledge of FDA and international regulation, guidance and standards.</li><li>Process customer requests for product documentation.</li><li>Assist in the development of customer and product related information.</li><li>Secure confidentiality agreements with customers and prepare formula disclosures</li></ul></div>\n</div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li>Bachelor’s Degree (or Advanced Degree) in Food Science or another scientific discipline or Associated Degree in Food Science with five years of experience in laboratory (QA or R&amp;D) or Pharmaceutical background would be very helpful.</li><li>2+ years’ experience in the food industry, or associated industries (pharmaceutical, consumer products, nutritional supplements, etc.) primarily in product safety regulatory affairs, regulatory compliance.</li><li>Must have knowledge of biological and chemical nomenclature.</li><li>Must be able to demonstrate drive and a commitment for high quality and accurate results in a timely and thorough manner</li><li>Must be able to prioritize, analyze, evaluate and determine workloads to achieve extremely tight time schedules.</li><li>Must have effective and professional written and oral communication skills.</li><li>Ability to work autonomously as well as part of a cross function team.</li><li>Excellent attention to detail.</li><li>Ability to critically appraise data.</li><li>Ability to work in a high paced environment.</li><li>Proficiency for Microsoft Office (Word, Excel, PowerPoint).</li></ul></div>\n</div>\n</div>\n<br>"}