{"job title": "Data Governance Specialist", "company": "KSM Consulting", "city state": "– Indianapolis, Indiana", "rating": "4.5", "job description": "Company Description<br><br>At KSM Consulting our mission is simple: help our clients and each other succeed.\n<br><br>\nWe are an Indianapolis-based technology, data, cybersecurity, and management consulting firm with a team of over 100 amazing people working passionately to help organizations achieve their mission. We are fearless problem solvers, dedicated to providing outstanding client service. Across multiple industries, geographies, situations, and sizes, we are critical to our clients success.\n<br><br>\nAt KSMC, you can count on being exposed to the latest technology, industry trends, and some of the most challenging problems that businesses face. You will be expected to provide thought leadership and transformative advice, while simultaneously acting to make it a reality in our clients businesses. You will also work collaboratively with a cross-disciplinary team of dedicated KSMC consultants, client personnel, and third-party teammates to make it all happen.<br><br>Job Description<br><br>As a Data Governance Specialist, you will work closely with many teams across our company on complex, advanced data projects, leading implementation and oversight of enterprise data governance goals, standards, practices, processes and technologies.\n<br><br>\nIf you love to solve problems and add value, please consider what your typical day might look like:\n<ul>\n<li>Work closely with a team comprised of data architects, data engineers, data scientists, business analysts, project managers, and solution architects.</li><li>Understand clients strategic enterprise data needs.</li><li>Establish data governance and stewardship organizations.</li><li>Collaborate with business data stewards to advance and optimize the adoption of enterprise data governance.</li><li>Institute and facilitate governance on the organization's business and technical metadata as well as data quality routines and frameworks.</li><li>Govern the processes associated with metadata management, data quality, and data exchange.</li>\n</ul>\n\nQualifications<br><br>Some of the qualifications and skills we are expecting include the following:\n<ul>\n<li>Bachelors Degree required.</li><li>Five plus years of data governance and data management required.</li><li>Extensive experience in establishing and executing data governance or data stewardship programs.</li><li>Demonstrated knowledge and skills in enterprise data management, data governance, and data quality principles and methodologies.</li><li>Demonstrated experience in cross collaborating with multiple teams.</li><li>Ability to effectively challenge all levels of an organization and offer value-add solutions to meet data governance objectives.</li><li>Experience with sensitive data including healthcare data is desirable.</li><li>Experience developing project plans or roadmaps is desirable.</li><li>Risk Management/Business Continuity experience is a plus.</li><li>Collaborative team player who is detailed oriented and focused on solution quality and execution.</li><li>Progressive mindset particularly around deployment models and emerging technologies.</li><li>Comfortable working across a wide range of project sizes and industries.</li>\n</ul>\n\nAdditional Information<br><br>What you should know about KSMC:\n<ul>\n<li>Our people work hard. We solve big problems, serve lots of clients, and are generally engaged throughout the entire workday and beyond.</li><li>We compensate well and show our appreciation in lots of ways including Thursday Throwdowns, quarterly employee events, Community Day, and family events.</li><li>Were are an employee-owned company as part of the Katz, Sapper &amp; Miller Network.</li><li>We have a great benefits package including four weeks of paid vacation.</li><li>Our snack room is well stocked with healthy drinks and food to keep you going during your work day.</li><li>We have a comprehensive wellness program that includes onsite flu shots, team recreation activities, and a wellness rewards program.</li><li><strong>We pride ourselves in having the best talent in the industry and hope that youre up for the challenge!</strong></li>\n</ul>\nMust have current authorization to be employed in the U.S. without employer sponsorship\n<br><br>\nAll qualified applicants will receive consideration for employment without regard to age, color, sex, disability, national origin, race, religion, or veteran status.\n<br><br>\n<strong>Sponsorship is not available for this position.</strong>\n<br>\nKSM Consulting generally does not sponsor foreign national candidates for work authorization except for positions that in KSMCs determination require highly specialized knowledge and for which candidate sponsorship is appropriate.\n<br><br>\nEqual Opportunity Employer"}