{"job title": "Senior Applied Scientist", "company": "Microsoft Corporation", "city state": "– Bellevue, WA", "rating": "4.1", "job description": "Microsoft's AI and Research Group (AIR) brings together a world-class research organization alongside all Microsoft's AI product efforts to provide greater opportunity to accelerate Microsoft's innovation in AI, and to enable Microsoft to create intelligent systems and products for our customers.\n<br><br>\nFUSE Labs is an agile cross-disciplinary lab within Microsoft AIR. FUSE most recently has been at the forefront of Microsoft's focus on Conversation as a Platform (CaaP), developing and delivering Microsoft Bot Framework which enables developers to build and connect intelligent bots to users wherever they are from Skype to Office 365 mail to Facebook Messenger, Slack, Kik, Telegram and more.\n<br><br>\nWe build solutions that unleash the new user experiences with embedded active AI functionality. We seek a hands-on developer/applied scientist who is excited to tackle complicated technology problems, build, improve and design solutions engaging with the software and AI/ML communities. As part of the FUSE Labs team, you will work closely with our partner teams across Microsoft to provide the next generation solutions. You'll also have opportunities to get to know our customers and get in a tight feedback loop ensuring we're meeting their needs. Our team culture promotes creativity and innovation and we want your unique ideas. We use engineering best practices shipping rapidly addressing customer needs.\n<br><br>\nIf you're looking to innovate, design and implement solutions for deep technical problems in a fast-paced, agile environment using the newest technologies, this is the opportunity for you.\n<br><br>\n<strong>Minimum Qualifications:</strong>\n\n\n<ul>\n<li>BS in computer science or engineering</li>\n<li>4+ years of software, services development and/or product delivery experience</li>\n<li>3+ years of experience in ML model development and/or engineering solutions for hosting, evaluation and retraining.</li>\n<li>3 years of experience in C# .NET, C++, Python, or ML toolkits (e.g. CNTK, TensorFlow, Caffe, scikit-learn, Apache Spark ML)</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Solid critical thinking, software and ML solutions debugging and problem solving skills</li>\n<li>Proven ability to quickly learn new technologies and efficiently collaborate with others to deliver outstanding results.</li>\n<li>Ability to create and assess solutions based on user goals and key scenarios</li>\n<li>Attention to details and passion for high quality software and ML solutions</li>\n<li>Problem solving, creative, and communication skills</li>\n<li>Demonstrated ability to work effectively cross functionally with other teams (Engineering, Data Science, Research, Program Management)</li>\n<li>Strong collaboration skills</li>\n<li>An ability to work through ambiguity and multiple priorities</li>\n<li>Havea passion for quality, innovation, and world-class design</li>\n</ul>\n\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n<br><br>\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.\n<br><br>\n<strong>Responsibilities Include:</strong>\n\n\n<ul>\n<li>Designing and build solutions used across a variety of platforms and ML toolkits</li>\n<li>Contribute technical expertise throughout all stages of product design and development, conceptual design, and tools maturity, prototyping and production</li>\n<li>Bring a multi-disciplinary point of view of product design to the AI enabled solutions</li>\n</ul>"}