{"job title": "Senior Scientist", "company": "Mission Support and Test Services, LLC", "city state": "– Andrews AFB, MD", "rating": "2.0", "job description": "<ul>\n<li>PhD in Physics, Nuclear Engineering, Applied Mathematics, or in a calculus-based Science, Technology, Engineering, and Mathematics (STEM) field.</li><li>Experience in one or more of the following is desirable: radiation spectroscopy/imaging, numerical analysis, health physics, computational physics, computational modeling with MNCP, software/hardware interfaces, radiation detector development, machine learning, or data science.</li><li>Must have good written and oral communication skills and be able to deal with a technically diverse audience.</li><li>Ability to interface effectively with technical personnel from other Mission Support and Test Services (MSTS) organizations, outside organizations, and government agencies.</li> <li>Must be willing and able to work non-standard hours in various environments, including at sea and aboard aircraft, stand on-call duty, and deploy worldwide on short notice.</li> <li>Must be capable of performing moderate lifting and be able to meet Company requirements for worldwide travel.</li> <li>Must submit to immunizations for worldwide travel.</li> <li>Frequent domestic and occasional international travel will be required (20-40%).</li><li>Applicant must possess a valid driver’s license.</li> <li>Pre-placement physical examination, which includes a drug screen is required. MSTS maintains a substance abuse policy that includes random drug testing.</li>\n</ul>\nDepartment of Energy Q Clearance (position will be cleared to this level). Reviews and tests for the absence of any illegal drug as defined in 10 CFR Part 707.4, “Workplace Substance Abuse Programs at DOE Sites,” will be conducted. Applicant selected will be subject to a Federal background investigation, and subsequent reinvestigations, and must meet the eligibility requirements for access to classified matter. Successful completion of a counterintelligence evaluation, which may include a counterintelligence-scope polygraph examination, may also be required. Reference 10 CFR Part 709, “Counterintelligence Evaluation Program.” Eligibility Requirements – To obtain a clearance, an individual must be a U.S. citizen at least 18 years of age. Reference DOE Order 472.2, “Personnel Security.”\n<br><br>\nMSTS is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status or other characteristics protected by law. MSTS is a background screening, drug-free workplace.\n<ul>\n<li>Serve as an emergency response team member (based at the Remote Sensing Laboratory at Joint Base Andrews in Suitland, Maryland) and will deploy in support of the Department of Energy (DOE) in the case of radiological/nuclear emergencies; ability to stand duty to be ready to deploy worldwide within a few hours of notification.</li><li>Expected to collect and analyze radiological data in field operations, in addition to presenting the results to a technical or non-technical audience.</li> <li>Develop expertise in a broad range of topics to include radiation transport, gamma-ray spectroscopy, nuclear reactor operations, nuclear weapons design, health physics, and design and analysis of radiation sensors and technologies.</li> <li>Provide input into the development and testing of all aspects of operations and equipment for use in emergency response activities.</li> <li>Engage with a team of scientists, engineers, and technicians, when called upon to do so at RSL-Andrews Air Force Base, and other NNSS locations, or in the field.</li> <li>Collaborate within the organization and with outside groups to produce white papers to solicit funding for Research and Development (R&amp;D) projects.</li> <li>Participate in and develop internal R&amp;D proposals. Collect, analyze, and write reports about results of experiments and technology developments.</li><li>Ability to travel worldwide, sometimes under severe conditions, as a member of the National Nuclear Security Administration (NNSA) emergency response teams</li><li>Ability to serve as crewmember on board rotary or fixed wing aircraft operating equipment while in flight is essential.</li><li>Perform related work as assigned by manager.</li>\n</ul>\n<strong>If you’re looking for an interesting, fulfilling career, you’ve come to the right place!</strong>\n<br><br>\nAt Mission Support and Test Services, LLC (MSTS), we’re a dynamic team of employees who manage and operate the Nevada National Security Site (NNSS), formerly known as the Nevada Test Site. A premier outdoor, indoor and underground national laboratory for unique, high-level experiments, the NNSS has offices across the country, including Southern Nevada; Santa Barbara and Livermore, California; Washington, D.C.; and Albuquerque and Los Alamos, New Mexico. We’re dedicated to working together as a team to keep our nation safe. Join us!\n<br><br>\nMSTS is a limited liability company consisting of Honeywell International Inc. (Honeywell), Jacobs Engineering Group Inc. (Jacobs), and Stoller Newport News Nuclear, Inc. (SN3).\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}