{"job title": "Quantitative Researcher - Data Quality", "company": "Monsanto", "city state": "– Seattle, WA", "rating": "4.0", "job description": "<ul>\n<li>*Position Overview:**</li>\n</ul>\n\nWe are seeking a motivated data scientist to explore scalable methods that can enhance equipment-generated data (harvest yield per acre, for example) that we use to derive insight for the growers that use our systems. ?A successful candidate should be willing to leverage diverse data sources and develop robust, scalable models that operate within various constraints in our data and infrastructure.\n<br><br>\nThis position will be under the Data Quality team within our Science organization but will have significant exposure to various data, backend engineering and product teams. If you want exposure to real world problems in tech that could have a significant impact in agriculture, The Climate Corporation would love to talk to you!\n\n\n<ul>\n<li>*What You Will Do:**</li>\n<li>Independently develop scalable models and making conscious trade-offs that can meet constraints from Data, Engineering and Product.</li>\n<li>3. Discover and communicate various constraints issues from various agronomic data sources and how they could impact engineering, product, and science.</li>\n<li>5. Work across teams and expertises to assess data science products when ground truth data is limited</li>\n<li>**Basic Qualifications:**</li>\n<li>Candidates should be capable of independent research: one year of industry experience in data science with a PhD degree program in Applied Math, Statistics, Biostatistics, Computer Science, Physics or a related quantitative discipline or 3 years of data science experience with a Masters degree in similar fields</li>\n<li>9. Experience collaborating and compromising with the backend engineering (software development) teams and product teams</li>\n<li>11. Familiarity with statistical software (R Python) or Scala</li>\n<li>**Preferred Qualifications:**</li>\n<li>Experience with Kalman Filters, Hidden Markov Model, or similar latent space models</li>\n<li>15. Experience with complex data formats and data of varying quality</li>\n<li>17. Ability to modify existing methods given constraints from the problem rather than building a ?universal hammer?</li>\n<li>19. Strong communication skills to solicit information from domain experts and present results back to different audiences</li>\n<li>21. Ability to inform the limits and trade-offs to stakeholders as well as peers</li>\n<li>23. Curiosity and an open-mind towards unfamiliar data sources and unfamiliar quantitative domains</li>\n<li>25. Knowing when a frequency count can be the best answer to a problem</li>\n<li>**What We Offer: ?**</li>\n</ul>\n\nOur teams are composed of industry experts, top scientists, and talented engineers. The environment is extremely engaging and fast-paced, with dozens of specialties coming together to provide the best possible products and experiences for our customers.\n<br><br>\nWe provide competitive salaries and some of the best perks in the industry, including:\n\n\n<ul>\n<li>Superb medical, dental, vision, life, disability benefits, and a 401k matching program</li>\n<li>29. A stocked kitchen with a large assortment of snacks &amp; drinks to get you through the day</li>\n<li>31. Encouragement to get out of the office and into the field with agents and farmers to see first-hand how our products are being used</li>\n<li>33. We take part and offer various workshops, conferences, meet-up groups, tech-talks, and hackathons to encourage participation and growth in both community involvement and career development</li>\n<li>We also hinge our cultural DNA on these five values:</li>\n<li>Inspire one another</li>\n<li>37. Innovate in all we do</li>\n<li>39. Leave a mark on the world</li>\n<li>41. Find the possible in the impossible</li>\n<li>43. Be direct and transparent</li>\n<li>Learn more about our team and our mission:</li>\n</ul>\n\nThe Climate Corporation - The Technology Behind Making A Difference\n<br><br>\nhttps: youtu.be c5TgbpE9UBI or visit https: climate.com careers\n<br><br>\n<strong>#LI-TD1</strong>\n<br><br>\nAt Monsanto, we value a diverse combination of ideas, perspectives and cultures. All qualified applicants will receive consideration for employment without regard to, among other things, race, religion, color, national origin, age, sex, sexual orientation, gender identity, gender expression, status as a protected veteran, or status as a qualified individual with a disability. If you need a reasonable accommodation to access the information provided on this website, please access our disability accommodations process for further assistance.\n<br><br>\nU.S. Employment Law (applicable for U.S. jobs ONLY):\n<br>\nEEO Employer Minorities/Females/Protected Veterans/Disabled. For information about equal employment opportunity rights, please refer to this information from the U.S. federal government: EEOC Poster; EEOC Supplement."}