{"job title": "Data Analyst", "company": "NYU Langone Health", "city state": "– New York", "rating": "3.8", "job description": "<strong>NYU School of Medicine</strong> is one of the nation's top-ranked medical schools. For 175 years, NYU School of Medicine has trained thousands of physicians and scientists who have helped to shape the course of medical history and enrich the lives of countless people. An integral part of NYU Langone Health, the School of Medicine at its core is committed to improving the human condition through medical education, scientific research, and direct patient care. For more information, go to med.nyu.edu, and interact with us on Facebook, Twitter and Instagram.\n<br><br>\n<strong>Position Summary:</strong>\n<br>\nWe have an exciting opportunity to join our team as a Data Analyst.\n<br><br>\nIn this role, the successful candidate The Department of Population Health at NYU School of Medicine seeks a Data Analyst for 2 projects:\n<br>\n1) The Data Analyst will set up a comprehensive database of policies, laws, health services, morbidity and mortality related to opioid overdoses. This project will involve compiling and reviewing state laws and policies related to opioids, creating and managing a database linking data on opioids at the state, county and zip code levels, and using the database to conduct descriptive and inferential analyses about the trends in opioid overdoses across the United States.\n<br>\n2) The Data Analyst will also conduct analyses related to the impact that state and local policies and laws have on opioid overdoses in the United States. This study will use spatiotemporal approaches to examine the impact that state and county-level drug policies and laws have on county- and zipcode-level rates of prescription opioid and heroin overdoses. The Analyst will coordinate the data acquisition, management, will lead data analyses, and will prepare reports, manuscripts and proposals related to this study.\n<br><br>\n<strong>Job Responsibilities:</strong>\n\n<ul>\n<li>Conduct a review of selected state drug policies that can affect opioid overdoses. Compile county-level data on substance abuse treatments services</li>\n\n<li>Integrate data from multiple sources, including hospital discharge records, emergency department admissions records, death certificate data, prescribing data, demographic and socio-economic characteristics of zip codes, counties and states, and state policies. Set up a column-oriented database in Access or MonetDB to house linked data at the state, county and zip code levels</li>\n\n<li>Map state and county data elements in a project GIS system, and characterize spatial typologies for statistical analyses</li>\n\n<li>Carry out complicated, in-depth statistical analyses using primary and secondary data, including analyses for longitudinal studies and multi-level data structures</li>\n\n<li>Create text, tables, figures, and charts for presentations and publications. Prepare results of analyses for review.</li>\n\n<li>Prepare results of analyses for review. Participate in discussion and interpretation of findings. Lead and participate in manuscript development.</li>\n\n<li>Contribute to the development of analytic plans in consultation with investigators; recommends solutions to analytical challenges.</li>\n\n<li>Innovate and streamline ways to visualize and analyze data</li>\n\n<li>Maintain regular communication with project team members. Assist with the development of grant applications for future funding.</li>\n</ul>\n<strong>Minimum Qualifications:</strong>\n<br>\nTo qualify you must have a Masters degree in epidemiology, data science, economics, public health or related quantitative field\n<br>\nExperience applying GIS methods to geocode administrative, healthcare, and survey data, to create maps, and to examine-spatio-temporal patterns of a variety of health outcomes\n<br>\nExperience creating, managing and analyzing large databases of linked health data across multiple levels\n<br>\nExperience with hypothesis-driven data analysis, including linear and logistic regression and non-parametric regression\n<br>\nAbility to gather, organize, analyze, and report findings from analyses.\n<br>\nAble to program proficiently in software such as SAS, R, or STATA\n<br>\nDetail-oriented and able to prioritize and alter priorities as circumstances require\n<br>\nAble to work both independently and collaboratively\n<br>\nKnowledge and application of project management principles and concepts.\n<br>\nProven ability to design complex data management and analysis projects, working with professionals with a variety of skills and backgrounds.\n<br><br>\n<em>Qualified candidates must be able to effectively communicate with all levels of the organization.</em>\n<br><br>\nNYU School of Medicine provides its staff with far more than just a place to work. Rather, we are an institution you can be proud of, an institution where you'll feel good about devoting your time and your talents.\n<br><br>\nNYU School of Medicine is an equal opportunity and affirmative action employer committed to diversity and inclusion in all aspects of recruiting and employment. All qualified individuals are encouraged to apply and will receive consideration without regard to race, color, gender, gender identity or expression, sex, sexual orientation, transgender status, gender dysphoria, national origin, age, religion, disability, military and veteran status, marital or parental status, citizenship status, genetic information or any other factor which cannot lawfully be used as a basis for an employment decision. We require applications to be completed online.\n<br>\nIf you wish to view NYU School of Medicine's EEO policies, please click here. Please click here to view the Federal \"EEO is the law\" poster or visit https://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm for more information. To view the Pay Transparency Notice, please click here.<br><br>Required Skills\n<br><br>\n<strong>Required Experience</strong>\n<br><br>\nJob Location\n<br>\nNew York,\n<br>"}