{"job title": "Machine Learning Scientist", "company": "Pandora", "city state": "– Oakland, California", "rating": "3.2", "job description": "Oakland, CA<br>\n\n<div>Description<br><br>At Pandora, we're a unique collection of engineers, musicians, designers, marketers, and world-class sellers with a common goal: to enrich lives by delivering effortless personalized music enjoyment and discovery. People-the listeners, the artists, and our employees-are at the center of our mission and everything we do. Actually, employees at Pandora are a lot like the service itself: bright, eclectic, and innovative. Collaboration is the foundation of our workforce, and we're looking for smart individuals who are self-motivated and passionate to join us. Be a part of the engine that creates the soundtrack to life. Discover your future at Pandora!\n<br><br>\nWant to work on retaining, engaging and growing our listener base?\n<br><br>\nPandora has a great opportunity for a seasoned software engineer with several years of diverse experience who will help deliver Pandora to millions of music fans. We are looking for someone who will own, lead, and execute projects. You should have outstanding analytical and programming skills with a deep understanding and proven track record of building robust, scalable, multithreaded applications. As a member of our highly motivated team, you should be dedicated to excellence and have a strong sense of personalresponsibility.We hold ourselves to high standards and take pride in our work.\n<br><br>\n<strong>Requirements</strong><strong>:</strong>\n<ul>\n<li>Minimum five years of professional engineering experience</li><li>Expert level experience developing object oriented software</li><li>Team player with excellent communication and interpersonal skills</li><li>Significant experience with API development ( REST, JSON, XML )</li><li>Significant experience developing scalable, multithreaded server side software for deployment on Unix based systems</li><li>Significant experience working with database systems ( PostgreSQL, Redis )</li><li>Significant experience unit testing with frameworks and a dedication to thorough testing to create high quality software</li><li>Experience with data science, machine/deep learning algorithms and/or statistical modeling.</li>\n</ul>\n<strong>Plus Requirements</strong><strong>:</strong>\n<ul>\n<li>Experience developing high quality software in Python</li><li>Experience with recommender systems.</li><li>Experience with NoSQL architectures and map-reduce concepts atop Hadoop, HDFS, and Hive</li><li>Experience with distributed messages systems ( Apache Kafka )</li><li>Experience with production operational issues</li><li>BA/BS or better in Computer Science or related field</li>\n</ul>\n<em>Pandora is committed to diversity in its workforce. Pandora is an equal employment opportunity employer and considers qualified applicants without regard to gender, sexual orientation, gender identity, race, veteran or disability status. Women and people of color are encouraged to apply.</em></div>\n<br>PI104183098"}