{"job title": "Computational Scientist", "company": "Princeton Plasma Physics Laboratory", "city state": "– US-NJ-Princeton", "rating": "3.2", "job description": "<div><div>\n<div>Princeton Plasma Physics Laboratory seeks to fill a computational scientist position in the Theory Department, who has interest in developing his/her career into extreme and exascale computing. The job will involve performance engineering and/or algorithm optimization/development in gyrokinetic fusion plasma codes on leadership class computers, starting with Summit at OLCF, Theta at ALCF and Cori at NERSC, and Aurora exscale computer later.</div>\n</div>\n</div>\n\n<br>Responsibilities<br>\n\n<div>\n<div>\n<div>Knowledge in hybrid or many-core parallel programming with MPI, OpenMP, Cuda, OpenACC, or vectorization will be beneficial. Knowledge on FORTRAN-90 or higher languages will be required to perform the described job. Successful candidate is expected to collaborate not only with physicists, but also with computational scientists from applied mathematics, data management, and performance engineering areas in the multi-institutional XGC team. Starting rank will be determined in accordance with the qualification of the applicant.</div>\n</div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div>Qualified applicants should apply at jobs.princeton.edu with a curriculum vita and list of publications, and at the same time send them to C-S Chang (cschang@pppl.gov). Three or more letters of recommendation letters will be requested at a later time for full consideration.\n<br><br>\nPrinceton University is an Equal Opportunity/Affirmative Action Employer and all qualified applicants will receive consideration for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity or expression, national origin, disability status, protected veteran status, or any other characteristic protected by law. EEO IS THE LAW</div>\n</div>\n</div>\n\n<br>Salary Grade<br>\n\n<div>\n<div>\n<div>\nENG, 05</div>\n</div>\n</div>\n\n<br>Standard Weekly Hours<br>\n\n<div>\n<div>\n<div>\n\n\n<ul>\n<li>00</li></ul></div>\n\n\n</div>\n</div>\n\n<br>Eligible for Overtime<br>\n\n<div>\n<div>\n<div>\nNo</div>\n</div>\n</div>\n\n<br>Benefits Eligible<br>\n\n<div>\n<div>\n<div>\nYes</div>\n</div>\n</div>\n\n<br>Essential Services Personnel (see policy for detail)<br>\n\n<div>\n<div>\n<div>\nNo</div>\n</div>\n</div>\n\n<br>Estimated Appointment End Date<br>\n\n<div>\n<div>\n<div>\n8/6/2018</div>\n</div>\n</div>\n\n<br>Physical Capacity Exam Required<br>\n\n<div>\n<div>\n<div>\nNo</div>\n</div>\n</div>\n\n<br>Valid Driver's License Required<br>\n\n<div>\n<div>\n<div>\nYes</div>\n</div>\n</div>\n<br>"}