{"job title": "Research Scientist", "company": "Stride Search", "city state": "– California, United States", "rating": "NA", "job description": "We are looking for outstanding<br><br>machine learning research scientists whose skills span the entire<br>spectrum of<br><br>Machine Learning/DataScience research, i.e.<br>data-gathering/cleaning, modeling,<br><br>implementation, publication and presentation.<br>In particular we are seeking<br><br>researchers with the following skills and experience to<br>contribute<br>in driving<br><br>the future of ad targeting, personalization, content extraction,<br>content<br><br>matching and other<br>prediction problems.<br><br>Your mission:<br>•Click prediction: How do you accurately predict if the<br><br>user will click on an ad in less than a millisecond?<br>Thankfully, you have<br><br>billions of datapoints to help you.<br>•Recommender systems: A standard SVD<br><br>works well. But what happens when you have to choose the<br>top products amongst<br><br>hundreds of thousands for every user, 2 billion times per day, in<br>less than<br><br>50ms?<br>•Auction theory: In a second-price auction, the theoretical<br>optimal is<br><br>to bid the expected value. But<br>what happens when you run 15 billion auctions<br><br>per day against the same competitors?<br>•Explore/exploit: It's easy, UCB and<br><br>Thomson sampling have low regret. But what happens when new<br>products come and<br><br>go and when each ad displayed changes the reward of each arm?<br>•Offline<br><br>testing: You can always compute the classification error on model<br>predicting the<br><br>probability of a<br>click. But is this really related to the online performance<br><br>of a new model?<br>•Optimization: Stochastic gradient descent is great when you<br><br>have lots of data. But what do you do<br>when all data are not equal and you<br><br>must distribute the learning over several hundred nodes?<br>Are you interested<br><br>in tackling such problems in an environment where your algorithms<br>are deployed<br><br>by<br>a team that sits next to you?<br><br>Role:<br>•Gather and analyze data, identify key prediction/classification<br><br>problems, devise solutions and build<br>prototypes<br>•Contribute to the<br><br>exploration and creation of new scientific understanding<br>•Initiate and<br><br>propose unique and promising modeling projects, develop new and<br>innovative<br><br>algorithms<br>and technologies, pursuing patents where appropriate<br>•Stay<br><br>current on published state-of-the-art algorithms and competing<br><br>technologies<br>•Maintain world-class academic credentials through publications,<br><br>presentations, external collaborations<br>and service to the research<br><br>community<br>•Develop high-performance algorithms for precision targeting,<br>test<br><br>and implement the algorithms in<br>scalable, product-ready code<br>•Research and<br><br>investigate academic and industrial data mining, machine learning<br>and<br><br>modeling<br>techniques to apply to our specific business cases<br>•Interact with<br><br>other teams to define interfaces and understand and resolve<br><br>dependencies<br>•Oversee the creation of detailed technical documents,<br><br>participate in academic conference, publish<br>research papers<br>•Understand<br><br>and mold the product direction by contributing innovative ideas,<br>specifically as<br><br>a result of<br>data mining and experimental data modeling<br><br>Preferred Skills:<br>•Experience in the optimization of online<br><br>advertising<br>•Experience working directly with Hadoop data platforms.<br><br>Qualifications:<br>•PhD in Statistics, Machine Learning or a related<br><br>field, with a previous major in Computer Science.<br>•Coding experience in<br><br>Python, C# or Java.<br>•Great oral and written communication and presentation<br><br>skills.<br>•A track record and interest in contributing to publications,<br><br>presentations, external collaborations and<br>service to the research<br><br>community."}