{"job title": "Associate Scientist", "company": "The Fountain Group", "city state": "– Morrisville, NC", "rating": "4.0", "job description": "Job Description<div>Hello,\n<br><br>\nMy name is Crystal Valdez and I represent <strong>The Fountain Group.</strong> We are a national staffing firm and are currently seeking an <strong>­­­­­­­­Associate Scientist</strong> for a prominent client of ours. This position is located in <strong>­­Research Triangle Park, NC.</strong> Details for the position are as follows:\n<br><br>\n<strong>Job Description:</strong>\n<ul>\n<li>The preferred candidate will have experience in molecular biology, protein expression, purification and ELISA assays.</li><li>Experience with data analytics a plus.</li><li>Ability to work on a multi-functional team under strict time lines is also required candidate should have worked in research laboratory and have in depth understanding of molecular biology and protein expression, purification and analysis.</li><li>Experience with HPLC and ICP-MS instrumentation a plus.</li><li>Good communication and computer literacy are a must.</li></ul></div>\n<br>\n<strong>Company Description</strong><div><strong>About The Fountain Group:</strong>\n<br>\nHeadquartered in Tampa, FL, with operations in all 5 regions, The Fountain Group is a Contingent Labor Resource Provider. The Fountain Group services clients directly, clients with an internal contingent labor program, and clients with an external managed service program.\n<br><br>\nAt The Fountain Group, we know that searching for a new career can be stressful, which is why we take time to understand your skills and personal goals. We understand the importance of job flexibility and professional growth, and offer top-notch positions with leading employers. In fact, the majority of our clients are well known Fortune 100-500 companies. We also offer a variety of benefits to our associates to ensure their overall happiness.\n<br><br>\nIn addition to assisting with your job search, we will help you through every step of the process offering online tutorials and additional resources to enhance your industry knowledge and skills. As your employment agent, we are dedicated to providing career counseling and job advice, knowing precisely what established companies want.\n<br><br>\nAt The Fountain Group, we treat you like family, regardless of your proximity to our office. We are dedicated to providing you with an exciting, challenging and highly rewarding place to work. Become a part of our team today and let us put your talents to work.\n<br><br>\nIf you are interested in hearing more about the position please respond to this email with a copy of your resume in word form with the best contact info Please forward this email to any friends or colleagues</div>"}