{"job title": "Senior Scientist", "company": "ADC Management Services, Inc", "city state": "– San Antonio, TX", "rating": "NA", "job description": "Job Description<div><p> </p><p>Performs services in support of the technical activities of the extraction and confirmation laboratory by developing and modifying analytical procedures related to testing drugs of abuse, and other investigational drugs. This position requires in-depth knowledge of analytical method validation, drug testing procedures, use of liquid chromatography mass spectrometry analyzers and associated equipment, forensic principles and concepts, and laboratory safety procedures</p><p><strong>Minimum Requirements: </strong></p><p><strong>Education: Doctor of Philosophy (PhD) program in one of the following areas:</strong></p><p><strong>· </strong><strong>Chemistry</strong></p><p><strong>· </strong><strong>Biochemistry</strong></p><p><strong>· </strong><strong>Toxicology</strong></p><p><strong>· </strong><strong>Pharmacology</strong></p><p><strong>· </strong><strong>Medical Technology</strong></p><p><strong>Required Experience:</strong></p><p>· <strong>Minimum three (3) years’ experience in:</strong></p><p>· Operating liquid chromatography/mass spectrometry (LC-MS/MS) for data analysis and testing support for project-based MS data processing for chemical extraction and derivatization.</p><p>· <strong>Minimum one (1) year experience in:</strong></p><p>· Develop LC-MS/MS analytical methods and procedures by performing extractions on biological specimens.</p><p><strong>Skills Required:</strong></p><ul><li> Professional knowledge of either (1) the various chemistry disciplines to include analytical, organic, and forensic chemistry or (2) medical technology principles,</li><li>Theories, practices, and methodologies to perform the full range of duties connected with the technical activities of the confirmation section which includes mathematics and statistics as related to quality control, quality assurance, and confirmation procedures.</li><li>Knowledge of the types of surveillance needed to monitor variables that affect the quality of services, and skill in evaluating and interpreting results of quality control procedures and implementing corrective action where indicated.</li><li>Practical knowledge of computer operations to insure proper control of specimens and to produce scientific charts and data presentations in written and graphic forms.</li><li>Knowledge of accrediting and regulatory agency requirements to ensure that quality assurance procedures are compliant with such requirements.</li><li>Knowledge and understanding of recognized reference standards, medico-legal requirements, regulatory and accrediting agency requirements and pertinent statutes when performing tests (e.g. maintaining chain of custody so as not to affect the forensic integrity of the sample and the result, use and storage of controlled substances in an appropriate manner).</li></ul><p><strong>Duties:</strong></p><ul><li>Analyzes service member specimens for drugs of abuse, and investigational drugs within the Extraction and Confirmation laboratory by using chemical extraction, derivatization, LC-MS/MS analysis and special tests, when required under strict chain-of-custody requirements.</li><li>Maintains compliance with SOPs and chain of custody requirements when receiving and reporting documentation before release of results. Verifies that all work complies with applicable DoD directives, Air Force Instructions and established HQ AFDTL operating instructions.</li><li>Recommends corrective action when errors in a procedure or process are identified, ensuring no false positive results are reported to laboratory customers.</li><li>Validates results by reviewing analytical procedures and data; providing technical advice and forensic corrections in accordance to SOPs so results can be legally defensible in a court of law.</li><li>Assists other AFDTL staff in developing extraction methods and techniques when isolating drugs; Provides scientific evaluation / interpretation of drug testing results and analytical methods to section and/or branch chief.</li><li> Assist in development and implementation of improved analytical methods or processes when troubleshooting any forensic/analytical problems on a day-to-day basis to increase the efficiency and quality of laboratory operations.</li><li> Operates and maintains scientific instrumentation to include Liquid Chromatography/Tandem Mass Spectrometry (LC-MS/MS) analyzers, and other analytical and developmental technologies (e.g. Agilent Rapid Fire and Hamilton STAR) within different data systems.</li><li> Responsible for projecting and reporting the utilization levels for supply orders to the confirmation supervisor; ensuring all reagents and chemicals are certified before use.</li><li>Conducts and oversees the performance of daily and routine preventive maintenance on all instruments; reporting all necessary manufacturer maintenance support to supervisor and properly documenting maintenance.</li><li> Complies and adheres to all policies and procedures on safety, computer security, laboratory security, forensic integrity, and test result confidentiality. Stays abreast with current laboratory practices, regulations and policies dictated by laboratory and regulatory agencies.</li></ul></div>Company Description<div>ADC Management Services, Inc. was established in 2004. It is a small minority-woman owned 8(a) company certified with the US Small Business Administration. ADC specializes in technical, administrative, and managerial services. We provide outsourcing solutions to government and commercial clients.<br><br>Our Staff has over 40 years experience in the Government contracting, and commercial outsourcing industries. We know how to work with procurement and acquisitions teams to provide experienced personnel to meet the various needs of our clients.</div>"}