{"job title": "Sr. Machine Learning Scientist", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nThe AWS Capacity Forecasting and Planning team is responsible for growing the world's largest Cloud. We forecast customer demand, build inventory replenishment system, and drive utilization improvement for all AWS services.<br><br>What we own:<br><ul><li>Building a world-class forecasting platform that scales to handling billions of time series data in real time.</li><li>Expanding inventory replenishment models and systems for each AWS service in the fast-growing AWS product portfolio.</li><li>Finding out the optimal tradeoff between AWS service availability and fleet utilization.</li><li>Driving fleet utilization improvement where each 1% means tens of millions of additional free cash flow.</li><li>Automating tactical and strategic capacity planning tools to optimize for service availability and infrastructure cost.</li></ul>What you will learn:<br><ul><li>Inventory management and supply chain management for the Cloud.</li><li>Resource management and admission control for the Cloud.</li><li>The internals of all AWS services.</li></ul><br>Keywords:<br>Forecasting, Statistics, Machine Learning, Optimization, Inventory Management, Supply Chain Management, AWS, Cloud, Cloud Computing, EC2, S3, EBS, DynamoDB, CloudFront, Java, C++, Object Oriented, R, Distributed Systems, High Availability, Scalability, Concurrent<br> <br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n- Ph.D. degree <br>- 5+ years industry experience in a comparable role with progressively increasing responsibility<br>- 8+ years of experience in data mining/predictive modeling <br>- 8+ years of experience with Linux/Unix tools<br>- 8+ years of experience in at least one major programming language (C++, Java, Python, C#, C, FORTRAN, Perl/Ruby, etc.)<br>- 8+ years of experience in mathematical programming libraries (such as R, Weka, Matlab, SAS)<br><br><br><br><br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n- Ph.D. in an analytical area such as Mathematics, Statistics, Computer Science, Physics, Engineering or similar<br>- Ability to communicate effectively across multiple organizations in the company<br>- Experience with time-series forecasting<br>- Strong knowledge of statistics and probability<br>- Strong knowledge of model design, selection, and hypothesis testing<br>- Programming experience in C++ or Java<br>- Experience with SQL/noSQL databases to manage and analyze large data sets<br><br><br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}