{"job title": "Pharmaceutical Application Development Scientist", "company": "balchem", "city state": "– Roy, Utah", "rating": "3.1", "job description": "<strong>Job Summary:</strong>\n<br><br>\nCandidate executes laboratory and pilot scale projects related to the application of Balchem products in the pharmaceutical market, becoming an in-house expert in how customers use Balchams products. The pharmaceutical and allied markets (oral solid dose forms, OTC, nutraceutical) demand data when purchasing ingredients and excipients. The candidate will work closely the commercial team to identify gaps in our application knowledge and work to fill them. The candidate will report to the R&amp;D Manager for HNP. This position brings value by applying knowledge of pharmaceutical science as it relates to the use of Balchem products (choline, chelated minerals, encapsulated ingredients) in oral solid dose forms. This is both a customer facing and laboratory focused position, the candidate will be required to travel to customer locations to assist in customer visits and customer scale up trials.\n\n<ul>\n<li> Execute application development projects to support customers in the pharmaceutical and allied markets (OTC, nutraceutical). The purpose of the work will be to demonstrate the utility of Balchem products and assist customers in formulation and scale up of new products.</li> \n\n<li> Develop technical application data to support commercial / regulatory strategy for the Business Platform.</li> \n\n<li> Communicate the functionality and technical benefits of Balchem ingredients in support of defined commercial strategy.</li> \n\n<li> Identify white space in the Balchem product line and actively participate in the generation of ideas for new products.</li>\n\n<li> Work with other R&amp;D team members on new product development projects.</li>\n\n<li> Deliver a professional, high level of service and technical support to internal and external customers.</li>\n</ul>\n\n<div><strong>Duties and Responsibilities</strong>\n\n<ul>\n<li>Follows all safety policies and procedures including use of safety equipment (PPE) and equipment safeguards; Maintains integrity of R&amp;D laboratory environment through accurate test design and set up, good sanitary practices and maintenance of equipment in good working order</li>\n\n<li>Technical validation of Balchem products, Designs and conducts appropriate qualitative and analytical evaluations of ingredients via internal assays and external collaborative projects</li>\n\n<li>Contributes to customer formula development programs and demonstrate functionality of Balchem ingredients in a variety of product categories</li>\n\n<li>Supports the business platform related external activities by attending events such as trade shows, sales calls, demonstrations, etc. Develop relationships with key individuals at critical customers</li>\n\n<li>Assessments of competitive product lines</li>\n\n<li>Stays current with new technology and developments and maintain professional contacts with individuals and organizations. Build and maintain relationships with current and potential customers. Collaborate fully with internal cross-functional team members</li>\n\n<li>Performs tests on new samples produced in the pilot plant to evaluate actual results compared to predicted results; Completes formulation and application testing in the laboratory</li>\n\n<li>As necessary, provide technical support to the sales organization, customers and prospective customers; Interfaces with customers to manage projects</li>\n\n<li>Provides periodic written and/or oral reports on assignment/projects status to management and the commercial organization</li>\n\n<li>Sources equipment and ingredients for the laboratory to support define projects</li>\n\n<li>Maintains accurate files of all R&amp;D work completed. Maintain all project files and Lab Notebooks as required</li>\n\n<li>Completes project updates and communicate project status. Participate in scheduled meetings and keep team members informed at all times</li>\n</ul>\n\n<div><strong>Education and Experience</strong>\n\n<ul>\n<li> BS in Pharmaceutical Science, Chemistry, Material Science or related discipline; Advanced degree (Masters/Ph.D.) degree preferred</li>\n\n<li> At least 3 years experience in an R&amp;D or Application Development role in the Pharmaceutical or allied industry (OTC, nutraceutical, excipients, API)</li>\n\n<li>Demonstrated knowledge of oral solid dose development required</li>\n</ul>\n<strong>Physical Demands and Work Enviroment</strong>\n\n<ul>\n<li>Work involves the use of typical food science lab equipment. Some business travel in automobile, bus, train, and plane is required</li>\n\n<li>Occasionally, must be able to work on their feet for extended periods of time in lab and pilot plant</li>\n\n<li>May be required to lift and carry large boxes/bags. Work environment may be noisy, wet, and slippery and hot or cold at times</li>\n</ul>\n\n</div><br>\n\n<div> 749124-jb-1014@balchem.hrmdirect.com</div></div>\n<br>PI104207807"}