{"job title": "Data Engineer", "company": "Booz Allen Hamilton Inc.", "city state": "– Washington, DC", "rating": "3.7", "job description": "<b>Job Number: R0036660</b><br><br>Data Engineer<p>Key Role:</p><p>Serve as a data analytics or data scientist subject matter expert in collecting, analyzing, and interpreting qualitative and quantitative data from multiple sources for the purposes of documenting results and analyzing findings to provide service improvement recommendations. Operate in a fast-paced work environment, multi-task, and thrive with truncated delivery deadlines and open-ended questions. Lead data collection and requirements gathering efforts for parsing, sorting, and analyzing data from various sources. Assist with data ingestion, data warehouse architecture, tuning, and the development of Structured Query Language (SQL) queries and perform data conversion in support of automated data ingestion and analysis. Create custom analytic and data mining algorithms to help extract knowledge and meaning from vast stores of data. Refine a data processing pipeline focused on structured, unstructured, and semi-structured data refinement. Support quick turn and rapid implementations and larger-scale and longer-duration analytic capability implementations.</p>\n<p>Basic Qualifications:</p><p>-3+ years of experience with data analytics, parsing, sorting, and analyzing data from various sources</p><p>-Experience with complex data processing pipelines, including Extract Transform Load (ETL) and data ingestion dealing with unstructured and semi-structured data sets</p><p>-Experience with data warehouse architectures or MySQL</p><p>-Experience with troubleshooting and developing using PowerShell, MariaDB, MySQL, or Microsoft SQL Server for automating data ingestions from Microsoft Excel, SQL, CSV file, Web-service, and AWS data sources</p><p>-Experience with Scripting</p><p>-Knowledge of Linux and Windows</p><p>-Knowledge of data ingest and database architecture, including the design and composition of database tables, columns, data types, and database layouts, such as data warehouse concepts, design and data integration workflows, and NoSQL database architecture</p><p>-Ability to leverage and maintain data dictionary</p><p>-TS/SCI clearance with a polygraph</p><p>-BA or BS degree</p>\n<p>Additional Qualifications:</p><p>-Experience with using SED, R, TERR, or Python, preferred</p><p>-Security+ Certification</p>\n<p>Clearance:</p><p>Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; TS/SCI clearance with polygraph is required.</p><p></p><p></p><p>Were an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change.</p><p></p><p></p>DMI<br><br> <br><br>"}