{"job title": "Scientist II", "company": "Charles River Laboratories", "city state": "– Shrewsbury, MA", "rating": "3.0", "job description": "Scientist II\n<br><br>\nReq ID #: 38591\n<br><br>\n<strong>Location:</strong>\n<br><br>\nShrewsbury, MA, US, 01545\n<br><br>\nFor 70 years, Charles River employees have worked together to assist in the discovery, development and safe manufacture of new drug therapies. When you join our family, you will have a significant impact on the health and well-being of people across the globe. Whether your background is in life sciences, finance, IT, sales or another area, your skills will play an important role in the work we perform. In return, we?ll help you build a career that you can feel passionate about.\n<br><br>\nWe are seeking an experiencedScientist II ? Analytical Developmentfor ourBiologics grouplocated inShrewsbury, MA.\n<br><br>\nIn this position, the Scientist II will serve as a Research Scientist responsible for the development and execution of moderately complex research studies related to the characterization and analysis of biotherapeutics. Manage projects, perform experiments, interpret and report data and ensure regulatory compliance (cGMP) of assigned research. Techniques include, but not limited to, electrophoresis (CE, IEF, PAGE), chromatography (HPLC, UPLC), spectrometry (UV/Vis, Fluorescence), ELISA. Implement techniques to improve productivity, increase efficiencies and maintain laboratory state-of-the-art practices. Reviews and interprets study data, communicates results to clients and writes final reports. Provides advisory functions to clients designing a program or experiment, dealing with specific dataset interpretation, or when appropriate answering questions from regulatory authorities.\n<br><br>\nThe following are minimum requirements related to the Scientist II ? Analytical Development position.\n<br><br>\n+ Bachelor?s degree (B.A. /B.S.) or equivalent in a related scientific discipline. M.S. or Ph.D. preferred\n<br><br>\n+ At least five years of relevant experience within a contract research, academic or pharmaceutical industry, including experience in the core competencies of characterization and analysis of biotherapeutics. Also requires a full understanding of GLPs (cGMP preferred), and departmental/company SOPs.\n<br><br>\n+ An equivalent combination of education and experience may be accepted as a satisfactory substitute for the specific education and experience listed above.\n<br><br>\n+ Experience with characterization and analysis of biotherapeutics (proteins and peptides) is required. Exceptional analytical and problem solving capabilities. Experience with Sponsor interaction and business development. Effective written and verbal communication skills. Ability to manage multiple moderately complex projects, prioritize work, and meet deadlines. Capable of anticipating and recognizing potential problems within programs and effectively communicate alternatives to client?s in a meaningful fashion. Must have proven record of delivering quality service to customers on time and on budget.\n<br><br>\nAbout Biologics Testing Solutions\n<br><br>\nWith more than 50 years of experience and proven regulatory expertise, the Charles River Biologics group can address challenging projects for biotechnology and pharmaceutical companies worldwide. Offering a variety of services such as contamination and impurity testing, protein characterization, bioassays, viral clearance studies and stability and lot release programs, we support clients throughout the biologic development cycle, from the establishment and characterization of cell banks through preclinical and clinical studies to marketed products. Whether clients need stand-alone services, a unique package of testing, or insourced support, our Biologics group can create a custom solution to suit their needs. Each year more than 20,000 biologic testing reports are sent each and over 200 licenses products are supported by our biologics testing solutions team.\n<br><br>\nAbout Charles River\n<br><br>\nCharles River is an early-stage contract research organization (CRO). We have built upon our foundation of laboratory animal medicine and science to develop a diverse portfolio of discovery and safety assessment services, both Good Laboratory Practice (GLP) and non-GLP, to support clients from target identification through preclinical development. Charles River also provides a suite of products and services to support our clients? clinical laboratory testing needs and manufacturing activities. Utilizing this broad portfolio of products and services enables our clients to create a more flexible drug development model, which reduces their costs, enhances their productivity and effectiveness to increase speed to market.\n<br><br>\nWith over 13,000 employees within 80 facilities in 23 countries around the globe, we are strategically positioned to coordinate worldwide resources and apply multidisciplinary perspectives in resolving our client?s unique challenges. Our client base includes global pharmaceutical companies, biotechnology companies, government agencies and hospitals and academic institutions around the world.\n<br><br>\nAt Charles River, we are passionate about our role in improving the quality of people?s lives. Our mission, our excellent science and our strong sense of purpose guide us in all that we do, and we approach each day with the knowledge that our work helps to improve the health and well-being of many across the globe. We have proudly supported the development of 80% of the drugs approved by the FDA in 2017.\n<br><br>\nFor more information, please visitwww.criver.com.\n<br><br>\nEqual Employment Opportunity\n<br><br>\nCharles River Laboratories, Inc. is an Equal Opportunity Employer M/F/Disabled/Vet"}