{"job title": "Formulations Scientist", "company": "Charles River Laboratories", "city state": "– Ashland, OH", "rating": "3.0", "job description": "Formulations Scientist\n<br><br>\nReq ID #: 36721\n<br><br>\nLocation: Ashland, OH, US, 44805\n<br><br>\nFor nearly 70 years, Charles River employees have worked together to assist in the discovery, development and safe manufacture of new drug therapies. When you join our family, you will have a significant impact on the health and well-being of people across the globe. Whether your background is in life sciences, finance, IT, sales or another area, your skills will play an important role in the work we perform. In return, we?ll help you build a career that you can feel passionate about.\n<br><br>\nJob Summary\n<br><br>\nPerforms technical laboratory activities in support of client studies or procedures. Performs analysis of data for quality and completeness and determines if results are as expected. Records data in compliance with company and regulatory policies and standards to meet quality and accuracy requirements.\n<br><br>\nWe are seeking an experienced Formulations Technician for our Safety Assessment site located in Ashland, Ohio.\n<br><br>\nResponsible for the performance of assigned test article formulations in accordance with Good Laboratory PracticeRegulations and Standard Operating Procedures with moderate supervision/instruction. Responsibilities includeformulating test articles for dose administration, collection and packaging of test article and samples for shipment,maintenance and calibration of laboratory equipment, the maintenance and review of study records and other routinelaboratory tasks as assigned. Function as lead technician for individual studies.\n<br><br>\nThe following are minimum requirements related to the Formulations Technician position\n<br><br>\n+ Education: High school diploma or General Equivalent Degree (G.E.D.). Bachelor?s preferred (B.S) or equivalent in animal or life science or related discipline.\n<br><br>\n+ Experience: 6 months to 1 year related experience in animal research and/or husbandry or must have fully satisfied technical and experience requirements for the previous level.\n<br><br>\n+ An equivalent combination of education and experience may be accepted as a satisfactory substitute for the specific education and experience listed above.\n<br><br>\nAbout Corporate Functions\n<br><br>\nThe Corporate Functions provide operational support across Charles River in areas such as Human Resources, Finance, IT, Legal, Sales, Quality Assurance, Marketing, and Corporate Development. They partner with their colleagues across the company to develop and drive strategies and to set global standards. The functions are essential to providing a bridge between strategic vision and operational readiness, to ensure ongoing functional innovation and capability improvement\n<br><br>\nAbout Charles River\n<br><br>\nCharles River is an early-stage contract research organization (CRO). We have built upon our foundation of laboratory animal medicine and science to develop a diverse portfolio of discovery and safety assessment services, both Good Laboratory Practice (GLP) and non-GLP, to support clients from target identification through preclinical development. Charles River also provides a suite of products and services to support our clients? clinical laboratory testing needs and manufacturing activities. Utilizing this broad portfolio of products and services enables our clients to create a more flexible drug development model, which reduces their costs, enhances their productivity and effectiveness to increase speed to market.\n<br><br>\nWith over 11,000 employees within 70 facilities in 18 countries around the globe, we are strategically positioned to coordinate worldwide resources and apply multidisciplinary perspectives in resolving our client?s unique challenges. Our client base includes global pharmaceutical companies, biotechnology companies, government agencies and hospitals and academic institutions around the world. And in 2016, revenue increased by 23.3% to $1.68 billion from $1.36 billion in 2015.\n<br><br>\nAt Charles River, we are passionate about our role in improving the quality of people?s lives. Our mission, our excellent science and our strong sense of purpose guide us in all that we do, and we approach each day with the knowledge that our work helps to improve the health and well-being of many across the globe. We have proudly supported the development of ~70% of the drugs approved by the FDA in 2016.\n<br><br>\nFor more information, please visitwww.criver.com.\n<br><br>\nEqual Employment OpportunityCharles River Laboratories, Inc. is an Equal Opportunity Employer M/F/Disabled/Vet"}