{"job title": "Scientist - Econometrician", "company": "Go Daddy", "city state": "– San Francisco, California", "rating": "3.5", "job description": "About GoDaddy\n<br><br>\nGoDaddy powers the world's largest cloud platform dedicated to small, independent ventures. With nearly 17 million customers worldwide and over 75 million domain names under management, GoDaddy is the place people come to name their idea, build a professional website, attract customers and manage their work. Our mission is to give our customers the tools, insights and the people to transform their ideas and personal initiative into success. To learn more about the company visit ***************.\n<br><br>\nThe GoDaddy customer base is a global portfolio comprised of millions of small businesses all at different stages of growth. In order to provide the highest level of service to these small businesses, this requires us to understand the measures that drive their success. As a GoDaddy economist your job is to isolate the drivers that impact small business growth and to estimate how our product, pricing and marketing decisions enable this growth and how customer success is associated to our own key performance indicators. In this position you will use your significant knowledge of statistics and mathematics to apply economic analysis to business problems that help mitigate the risk of making important business decisions.\n<br><br>\n<strong>In this Role You Will:</strong>\n<br>\nBe responsible for analyzing complex datasets to isolate and interpret the drivers of customer value.\n<br>\nAnalyze competitor product offerings and prices to determine how they impact our ability to acquire and retain customers.\n<br>\nApply statistical methods to extrapolate the economic impact driven by varying levels and types of customer engagement.\n<br>\nIteratively work towards establishing and predicting key performance indicators that describe the factors associated with driving customer value and success.\n<br>\nUnderstand the end-goal of data and models to provide your own insights and recommendations for improving customer value.\n<br>\nEstimate and deploy production forecasts with high predictive value to be used in ongoing budgeting decisions.\n<br>\nWork with internal teams to present technical analyses that describe the impact of business decisions.\n<br>\nPractice good coding standards and work well within an analytics team to collaborate and share knowledge with other analysts and data scientists.\n<br>\nPractice good judgement when applying technical problem-solving by breaking large problems into small ones and iteratively providing interim results.\n<br>\n<strong>#LI-JA1</strong>\n<br><br>\nGoDaddy is proud to be an equal opportunity employer. We will not discriminate against any applicant or employee on the basis of age, race, color, creed, religion, sex, sexual orientation, gender, gender identity or expression, medical condition, national origin, ancestry, citizenship, marital status or civil partnership/union status, physical or mental disability, pregnancy, childbirth, genetic information, military and veteran status, or any other basis prohibited by applicable federal, state or local law. GoDaddy will consider for employment qualified applicants with criminal histories in a manner consistent with local and federal requirements.\n<br><br>\nIf you need assistance completing an application for a position with us, please reach out to our Recruiting Team at **********************\n<br><br>\nTo submit your application to this position, please click Apply . On the next screen, after you click Apply, click Create to establish your candidate account. If you have previously created a candidate account, please slick Sign-In and use that account to complete your application."}