{"job title": "Staff Scientist", "company": "Golder Associates", "city state": "– Victoria, TX", "rating": "3.1", "job description": "**At Golder, we thrive on challenges.**<br> <br><br> <br><br><br> <br><br> <br><br><br> <br>**Golder is not just a place to work, it is a promise of a living, dynamic environment where people collaborate, innovate, build enduring relationships, excel, and grow professionally in a strong culture of ownership.**<br> <br><br> <br><br><br> <br><br> <br>Do you have the desire to learn? The drive to excel and thrive in an engaged, collaborative environment?<br> <br><br> <br><br><br> <br><br> <br>The position will entail working with upper-level managers to complete engaging projects. Duties will include managing office- and field-based tasks, performing investigations and preparing technical reports. Specific duties may include:<br> <br><br> <br>+ Operating safely in the field (performing work safely is our highest priority);<br> <br>+ Performing field-based tasks such as multi-media sampling; soil boring and monitoring well installations; lithologic logging; and aquifer testing;<br> <br>+ Collecting and managing field and analytical data from investigations.<br> <br>+ Interpreting hydrogeological information and developing conceptual site models (CSMs) for assessment and remediation projects;<br> <br>+ Writing technical reports;<br> <br>+ Coordinating with contractors (e.g., drillers and analytical laboratories) to support project-specific objectives;<br> <br>+ Communicating with Project Managers, team members and clients.<br> <br><br> <br>+ BS in Geology, Environmental Science, or a related field.<br> <br>+ Experience with implementation of assessment, investigation, remediation and monitoring tasks related to environmental projects preferred.<br> <br>+ Ability to perform field-based tasks.<br> <br>+ Availability for overnight travel.<br> <br>+ Strong technical and communication skills.<br> <br>+ OSHA 40-Hour HAZWOPER training is a plus.<br> <br><br> <br><br><br> <br>**Preferred:**<br> <br><br> <br>+ MS in Geology, Environmental Science, or a related field<br> <br><br> <br>**Required education:**<br> <br><br> <br><br><br> <br><br> <br><br><br> <br><br><br> <br>+ Bachelor's degree<br> <br><br> <br><br><br> <br><br> <br><br><br> <br>**Your benefits at Golder will include:**<br> <br><br> <br>+ Competitive benefits and remuneration packages<br> <br>+ Option to purchase shares in Golder<br> <br>+ Employee owned structure - own the business, own the result<br> <br>+ Deepen your expertise in a dynamic work environment<br> <br>+ Innovative and collaborative multidisciplinary projects<br> <br>+ On the job training, mentoring and coaching<br> <br><br> <br><br><br> <br>Renowned for technical excellence, Golder is a leading, global employee-owned engineering and consulting firm with over a half century of successful service to its clients. With over 165 offices in over 40 countries, Golder?s 6,500 professionals are driven by a passion to deliver results, offering unique specialized skills to address the ever-evolving challenges that earth, environment and energy present to clients across the infrastructure, mining, oil and gas, manufacturing and power sectors.<br> <br><br> <br><br><br> <br><br> <br><br><br> <br>**Equal Opportunity Employment Statement**<br> <br><br> <br><br><br> <br><br> <br><br><br> <br>Golder is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status or other characteristics protected by law. Golder is a background screening, drug-free workplace.<br> <br><br> <br><br><br> <br><br> <br><br><br> <br>**To learn more about our company and culture click here to view The Promise of Golder video.**<br> <br><br> <br><br><br> <br><br> <br>**Title:** *Staff Scientist - Victoria*<br> <br><br> <br>**Location:** *TX-VICTORIA*<br> <br><br> <br>**Requisition ID:** *18001156*"}