{"job title": "Bioinformatics Scientist, BioPharma Collaborations", "company": "Guardant Health", "city state": "– Redwood City, California", "rating": "3.8", "job description": "Company Description<br><br>We believe conquering cancer is a big data problem. Thats why we built the worlds leading comprehensive liquid biopsy. This non-invasive tool for accessing and sequencing tumor DNA is used by thousands of oncologists to help tens of thousands of advanced cancer patients. We believe the boom in cancer data acquisition we helped launch will drive important discoveries and new products. Were working on some exciting ones, including in early detection, where the impact on patients can be profound. Weve raised more than $500 million from investors including Sequoia Capital, Khosla Ventures, OrbiMed, and SoftBank.<br><br>Job Description<br><br>The BioPharma team at Guardant Health is focused on partnerships with leading biotech and pharma companies who are at the forefront of cancer therapeutics and diagnostics. In this role, you will help support the bioinformatics and data analysis necessary to generate and maintain these partnerships.\n<br><br>\nYou will be responsible for the success of BioPharma pilot studies. You will help Guardant Health work with a variety of BioPharma customers, tailor personalized analyses for each company, and tackle some of the most interesting biological and technical questions related to cutting-edge research in the pharmaceutical industry.\n<br><br>\nYou will contribute to large BioPharma initiatives in-house, including development of novel assays, bioinformatics, and analytical methods. As a part of the Bioinformatics and BioPharma teams, you will have the opportunity to innovate and implement your ideas to constantly improve our product and analytics so that they are best suited for the changing landscape of BioPharma needs.\n<br><br>\nYou will work closely with multiple teams across Guardant Health, including Bioinformatics, Software, Business Development, Technology Development, Regulatory, and Operations. You will gain first-hand experience working with experts in each of these areas to accomplish projects related to Guardant Healths BioPharma business.\n<br><br>\nYou will work together with our collaborators in industry, hospitals and academia on high-impact translational research using Guardant Health tests and publish on your findings. You will have access to the unprecedented compendium of data collected at Guardant Health and you will be able to (and should be excited to!) leverage this data for tumor biology and technological insights.<br><br>Qualifications\n\n<ul>\n<li>PhD in bioinformatics, computational biology, cancer genomics or related fields, or M.S. plus 3+ years relevant experience</li><li>Extensive knowledge of cancer genomics and tumor biology</li><li>Experience working jointly with an assay development or automation team on experimental data analysis and panel design</li><li>Expertise in scripting language R and/or Python and linux shell environment\n\n<ul>\n<li>Knowledge of Matlab/Perl and/or Java/C++ is a plus.</li></ul></li>\n<li>Excellent data analysis skills, including development of novel / custom algorithms for interpretation of NGS data</li><li>Working knowledge of statistical methods</li><li>Awareness and experience with current landscape of bioinformatics tools</li><li>Experience with Next-Generation Sequencing assay development</li><li>Great communication and presentation skills, ability to present clearly and effectively to stakeholders across organizations.</li><li>Ability to work well in a fast-paced startup environment</li><li>Desire and ability to dig deeply through various data types to seek out answers</li><li>Self-starter: you can take a problem at hand and run with it independently, yet are comfortable asking for help when you need it</li><li>Strong team player: ability to work together with your team as well as cross-functionally and even across institutions, to accomplish your goals</li>\n</ul>\n#LI-LC1<br><br>Additional Information\n\n<ul>\n<li>ASQ CQE certification preferred</li><li>Industry Experience</li>\n</ul>"}