{"job title": "Scientist 2", "company": "Illumina", "city state": "– San Diego, CA", "rating": "4.2", "job description": "<p>Scientist2 (Process Development Scientist) Fundamentals </p><p></p><p><u>Position Summary:</u></p><p>We are looking for highly driven and talented Scientist (or Process Development Scientist to join our growing Life Cycle Management (LCM) group. The LCM group works as an integral part of our Reagents Manufacturing process and is tasked with increasing quality and yield within our high-volume production environments. These highly collaborative, flexible and dynamic individuals provide technical and operations leadership to new product introduction, production process development, improvement and sustaining efforts. Additionally, these teams will partner cross-functionally with R&amp;D, Quality, Production and other departments to develop processes for new products, as well as sustain and improve processes for existing products.</p><p></p><p><u>Responsibilities:</u></p><ul><li>Provide technical leadership in reagent production processes and in the making of consumable products used in genomic sequencing</li><li>Collaborate deeply with others to resolve production line issues related to yield, quality, and throughput.</li><li>Represent operational needs on product development teams.</li><li>Construct, execute, evaluate, and make recommendations on controlled experiments (including DOE's) to optimize processes to address yield and quality issues, reduce costs, define requirements/specs, and drive implementation of solutions to meet goals. </li><li>Utilize strong production and process change management practices to drive improved quality or production performance.</li><li>Author technical documents, such as engineering reports, test protocols, validation documents or changes to existing documentation, to support product manufacturing process documentation requirements.</li><li>Analyze, trend and monitor process test results, issue reports, and make technical recommendations</li><li>Perform root cause analysis investigation using RCA tools (such as 8D, 7-Step, 5 Why’s or model based problem solving, etc) together with sound science and data analysis to make technical and compliance-related recommendations and decisions.</li><li>Serve as subject matter expert on biochemical/chemical formulations reagent critical-to-quality and critical-to-performance characteristics</li><li>Assist manufacturing facilities in completing required technical documentation to enable successful product launches.</li><li>Utilize expertise in process engineering methodologies, such as FMEA, SPC, Gauge R&amp;R, Critical Parameter Management, to measure and improve process capability and robustness.</li><li>Facilitate and support product and process continuous improvement activities.</li><li>Lead the technical direction of a project team including driving execution to project deliverables and providing risk mitigation recommendations to meet project milestones.</li><li>Facilitate or support the transfer of manufacturing and QC processes from development through scale-up to volume production in a regulated manufacturing environment.</li></ul><p></p><p><u>Requirements:</u></p><p>Experience with biochemical/protein processes, including characterization and purification methods (chromatography, membrane separation, etc.)</p><p>Experience with biochemical/protein analytical procedures and enzyme assays (e.g: spectroscopic, HPLC, FPLC, IC/ICP, SDS-PAGE, FRET, etc.)</p><p>Previous work experience in a similar role in one or more of the biotech, diagnostic, pharmaceutical, or medical device industries.</p><p>High level problem solving and reasoning skills and ability to conduct investigations/resolve technical problems.</p><p>Ability to identify risks and strategize activities appropriately.</p><p>Ability to learn new technologies/processes quickly and determine impacts to multiple operations-related business areas (e.g. Supply Chain, Quality, Manufacturing)</p><p>High comfort level driving results in a fast-paced environment while still demonstrating full consideration of stakeholder inputs/impacts</p><p>Strong communication and negotiation skills, with ability to create process proposals with well-reasoned technical justification Experience in production support andprocess development is required.</p><p>Willingness to work outside your primary area of educational discipline or area of current expertise.</p><p>Ability to positively influence and be influenced by others and build relationships in a collaborative environment. </p><p>Able to manage external relationships (e.g. vendors, contractors, collaborators) and maintain confidentiality.</p><p>Well-developed documentation and technical report writing skills.</p><p>Comfortable working in areas of high ambiguity and complexity in a fast-paced environment.</p><p>Demonstrated ability to accomplish goals while working across departments is required.</p><p>High level of computer skills are required.</p><p></p><p><u>Highly Desired: </u></p><p>Experience with large data sets and data mining techniques would be a plus.</p><p>Experience/willingness to learn ERP and manufacturing information systems (e.g. SAP, MES, SCADA)</p><p>Experience in transferring products and processes from development to manufacturing.</p><p>Experience working in an ISO13485, GMP or FDA regulated environment.</p><p>Experience expanding production capacity and automating processes.</p><p>Experience with liquid handling and filling technologies.</p><p>Automated filling experience with Hamilton or Tecan is a plus.</p><p>Experience with fluorescence imaging technologies.</p><p>Experience with measure system analysis and specification setting</p><p>Experience applying statistics, Statistical Process Control, and Design of Experiments</p><p>Experience of Lean/Six Sigma/DFM/DMAIC/FTA/MSA</p><p></p><p><u>Education:</u></p><p>B.S./M.S./ PhD in Molecular Biology, Biochemistry, Biochemical Engineering, Bioengineering, Biotechnical Engineering, Chemistry, or Chemical Engineering, with at least 0-2 years of relevant experience. .</p><p>Experience/Education: </p><p>Typically requires a minimum of 5 years of related experience with a Bachelor’s degree; or 3 years and a Master’s degree; or a PhD without experience; or equivalent work experience</p><p></p><p></p>Illumina believes that everyone has the ability to make an impact, and we are proud to be an equal opportunity employer committed to providing employment opportunity regardless of sex, race, creed, color, gender, religion, marital status, domestic partner status, age, national origin or ancestry, physical or mental disability, medical condition, sexual orientation, pregnancy, military or veteran status, citizenship status, and genetic information. If you have a disability or special need that requires accommodation, please contact us at applications@illumina.com. To learn more, visit: https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf"}