{"job title": "Data Architect", "company": "Ironnet Cybersecurity Inc", "city state": "– Fulton, Maryland", "rating": "4.2", "job description": "The Detection Research Team is responsible for delivering products that will improve the detection capabilities of IronDefense and inform internal teams, customers, and the public about threats in the current landscape. The data architect focuses on planning, building, and maintaining the databases needed to store information collected by our global sensors. The data architect works with internal team members and cross-organizationally to ensure the data is accessible, usable, and expandable. The information produced will be used to improve the IronDefense platform.\n<br><br>\n<strong>Responsibilities</strong>\n<ul>\n<li>Define, design, and build databases used by a variety of research teams and data scientists</li><li>Lead the design and sustainment of data pipelines and data storage for data ingested from a geographically distributed network of sensors, open data sources, purchased data feeds, APIs...etc</li><li>Work with multiple groups to integrate data stores into existing data pipelines</li><li>Maintain the databases and make recommendations to improve the data infrastructure</li><li>Inform the architecture of data systems used by the detection research team</li><li>Review object and data models to ensure better management and quicker access</li><li>Process large data sets used for modeling, data mining, and research</li><li>Model data appropriately. Develop necessary schemas and interfaces for encapsulating and transferring the data.</li>\n</ul>\n<strong>Requirements</strong>\n<ul>\n<li>Experience, knowledge, and depth in the following on-prem and in the cloud: database architecture, ETL, data mining, and building and deploying databases</li><li>Software engineering experience with skills in data processing, data pipelines, and a several related components/technologies e.g, REST APIs, JSON, XML, microservice architecture, protobuf or equivalent data schemas, Kafka or equivalent messaging bus technologies</li><li>Hands-on programming/scripting experience and the ability and willingness to learn new languages as needed</li><li>3+ years of working experience performing a majority of the above responsibilities</li><li>Ability to adapt to new technologies and learn quickly</li>\n</ul>\n<strong>Desirable Qualifications</strong>\n<ul>\n<li>5+ years of working experience performing the majority of the above responsibilities</li><li>3+ years of programming experience</li><li>Experience working with data used to build analytics</li><li>Knowledge of network-based data or threat intelligence</li>\n</ul>"}