{"job title": "Principal NLP Scientist for Search", "company": "JD.com", "city state": "– Mountain View, CA", "rating": "3.8", "job description": "<strong>Responsibilities:</strong>\n<br><br>\nInclude but are not limited to the following three main areas:\n\n<ul>\n<li>Applying Deep Learning or traditional NLP algorithms such as RNN/DNN/CRF to improve <strong>Entity Recognition</strong> and Sequence Labeling</li>\n<li>Work with engineering team to implement these algorithms into search run-time system</li>\n</ul>\n<strong>Qualifications:</strong>\n\n<ul>\n<li>Master or Ph.D. in Computer Science, Electrical and Computer Engineering, Statistics, or equivalent;</li>\n<li>Research experience in Natural Language Processing, Machine learning or Information retrieval</li>\n<li>Research experience in Entity Recognition, Sequence Labeling, familiar with RNN/DNN/CRF/HMM</li>\n<li>Familiar with at least one of scripting languages such as Python/R/Shell</li>\n<li>Solid knowledge of Big Data concepts (Hadoop, Pig, Hive, etc.)</li>\n</ul>\n<strong>About JD Search Team</strong>\n<br><br>\nJD's search team is responsible for research and development of the search algorithms for all JD's search products. Search is the main entrance to JD's online retail business - the core business of JD.COM, and smart device business. The quality of search results plays a very important role to the online shopping experience of our customers, thus adding significant values to the success of the JD's online retail business. With the hundreds of millions of customers and items JD has, even a small improvement on the search algorithm may have great impact on the business and people's everyday life. By leveraging the state of the art machine learning/deep learning algorithms, we strive to understand the intent and behavior of our customers and to present the most relevant and personalized search results, allowing customers to make an informed purchase decision. We are recruiting talented experts to join our team to create the next generation of innovative and intelligent search products for JD.COM.\n<br><br>\n<em>JD.com is an Equal Opportunity Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class.</em>"}