{"job title": "Genome-Phenome Modeling Scientist", "company": "Monsanto", "city state": "– Saint Louis, MO", "rating": "4.0", "job description": "We are seeking an exceptionally talented individual with a passion for\n<br><br>\ninnovation to join our Enviroment and Phenome Modeling team within the Plant\n<br><br>\nBreeding Organization. The position will be based in St. Louis at our corporate\n<br><br>\nheadquarters.\n<br><br>\nAs part of our diverse, highly dynamic group,\n<br><br>\nthe successful candidate will be exposed to exciting research challenges and\n<br><br>\nwill have ample opportunity to work with interdisciplinary scientists to\n<br><br>\nfoster your career growth and development while delivering innovative\n<br><br>\nsolutions.\n\n\n<ul>\n<li>*Responsibilities:**</li>\n</ul>\n\n+ Collaborateclosely with data scientists, breeders, and data engineers to providedata-driven solutions to business problems.\n<br><br>\n+ Understandthe core scientific questions and develop methodology for the integrativeusage of genomic, phenomic and environment data.\n<br><br>\n+ Developnovel methods for integrated analysis of genotype by environment.\n<br><br>\n+ Buildeffective relationships and partnerships with internal customers andstakeholders.\n\n\n<ul>\n<li>*Minimum Qualifications:**</li>\n</ul>\n\n+ APhD with a track record of productivity in the areas of statisticalgenetics, statistics, bioinformatics, computational biology, appliedmathematics, or a relevant scientific field.\n<br><br>\n+ Demonstratedexperience using machine learning/AI, or statistical methodology to solveresearch problems.\n<br><br>\n+ Exposureto computational biology, bioinformatics, or genomics.\n<br><br>\n+ Astrong scientific track record, as evidenced by published or acceptedpapers.\n<br><br>\n+ Abilityto rapidly learn new problem domains, and good decision-making andjudgement skills.\n<br><br>\n+ Abilityto work in a large team as well as independently.\n\n\n<ul>\n<li>*Preferred Qualifications:**</li>\n</ul>\n\n+ Mathematicalor statistical modeling in biological data.\n<br><br>\n+ Knowledgeof crop production system\n<br><br>\n+ Provenability to communicate complex analytical problems in clear, precise andactionable manner.\n<br><br>\nBayer successfully completed the acquisition of\n<br><br>\nMonsanto in June 2018, bringing together Monsanto?s leadership in seeds and\n<br><br>\nplant traits with Bayer?s leadership in chemical and biological crop\n<br><br>\nprotection. By joining forces, we will create even more extensive career\n<br><br>\nopportunities for talent around the world. We?re a global team working to shape\n<br><br>\nagriculture through breakthrough innovation that will benefit farmers,\n<br><br>\nconsumers, and our planet.\n<br><br>\nWhile\n<br><br>\nwe are now Bayer, we will continue to hire using separate career sites until we\n<br><br>\ncan integrate our career platforms. We invite you to explore the career\n<br><br>\nopportunities available at the combined company by visiting advancingtogether.com/careers .\n\n\n<ul>\n<li>*Organization:** _GLB Breeding - Analytics &amp; Pipeline Des_51190876_</li>\n<li>*Title:** _Genome-Phenome Modeling Scientist_</li>\n<li>*Location:** _North America-USA-Missouri-St. Louis_</li>\n<li>*Requisition ID:** _01ROS_</li>\n<li>*Job:** _Research &amp; Development_</li>\n<li>*Schedule:** _Full-time_</li>\n</ul>\n\nAt Monsanto, we value a diverse combination of ideas, perspectives and cultures. All qualified applicants will receive consideration for employment without regard to, among other things, race, religion, color, national origin, age, sex, sexual orientation, gender identity, gender expression, status as a protected veteran, or status as a qualified individual with a disability. If you need a reasonable accommodation to access the information provided on this website, please for further assistance.access our disability accommodations process\n<br><br>\nU.S. Employment Law (applicable for U.S. jobs ONLY): EEO Employer Minorities/Females/Protected Veterans/Disabled. For information about equal employment opportunity rights, please refer to this information from the U.S. federal government: ; .\n<br><br>\nEEOC PosterEEOC Supplement"}