{"job title": "Clinical Research Scientist (On-Site", "company": "Philips", "city state": "– Phoenix, AZ", "rating": "3.4", "job description": "We are seeking a research scientist with a PhD in biomedical engineering, electrical engineering, computer science, or a related field to support our research activities in one of our clinical sites in Phoenix, AR. This position gives you a unique opportunity to conduct research in a clinical setting.\n\n\n<ul>\n<li>*In this role, you have the opportunity to**</li>\n</ul>\n\nWe are seeking a research scientist with data engineering experience and a PhD in biomedical engineering, electrical engineering, computer science, or a related field to support our research activities in one of our clinical sites in Phoenix, AZ (Banner Health). This position gives you a unique opportunity to conduct healthcare analytics research in a clinical setting.\n<br><br>\nThe idea candidate will be a researcher with strong data engineering skills to build pipelines that feed data scientists with data and can work independently as well as part of a highly collaborative team. You will work with large rich clinical datasets alongside clinicians and in the environment where data is collected. We are seeking a candidate with a passion to identify and solve healthcare challenges and strong communication skills needed to build strong collaborative relationships with the clinical community, Philips researchers and business stakeholders.\n\n\n<ul>\n<li>*You are responsible for**</li>\n</ul>\n\n+ Maintain and develop data pipelines that feed data scientists and researchers.\n<br><br>\n+ Correct, transform and enrich multiple sources of data.\n<br><br>\n+ Interact with large-scale data structures using SQL.\n<br><br>\n+ Ability to write Python and SQL code\n<br><br>\n+ Implement and validate machine learning algorithms for clinical applications\n<br><br>\n+ Interact with clinical partners and research teams\n<br><br>\n+ Apply machine learning and data mining techniques to healthcare data\n<br><br>\n+ Govern research agreement process, ensure compliance, monitor project progress and value extraction\n<br><br>\n+ Publish papers and present in scientific conferences\n\n\n<ul>\n<li>*You are a part of**</li>\n</ul>\n\nPhilips Research is at the forefront of healthcare research. Existing now for 100 years, Philips Research has been one of the world's premier research labs and now has more than 1000 research scientists and engineers around the world. Our agenda includes discovering fundamental principles and developing scientific and engineering innovations to enhance health and well-being. Philips is a pioneer and leader in the healthcare industry.\n\n\n<ul>\n<li>*To succeed in this role, you should have the following skills and experience**</li>\n</ul>\n\n+ PhD in biomedical engineering, electrical engineering, computer science, or a related field\n<br><br>\n+ Experience with clinical study design, and data collection\n<br><br>\n+ Experience with EMR, clinical trials, clinical workflow\n<br><br>\n+ High performance computing using Hadoop, cloud infrastructure, or related technology\n<br><br>\n+ Experience in computer programming (Python)\n<br><br>\n+ Experience with databases, data extraction, quality assurance (SQL)\n<br><br>\n+ Skills in project management\n<br><br>\n+ Ability to publish papers and present in scientific conferences\n<br><br>\n+ Excellent oral and written communication skills\n\n\n<ul>\n<li>*In return, we offer you**</li>\n</ul>\n\nAn opportunity to work with one of the strongest research labs in the world and deliver solutions will have a direct impact on patient care. You will be part of flexible team of highly skilled professionals that are able to find a great work-life balance; just think the solutions you develop will give a better balance to the healthcare professionals and patients they are treating.\n\n\n<ul>\n<li>*Why should you join Philips?**</li>\n</ul>\n\nWorking at Philips is more than a job. It?s a calling to create a healthier society through meaningful work, focused on improving 3 billion lives a year by delivering innovative solutions across the health continuum at http://www.philips.com/b-dam/corporate/corporateblog/2016/Philips_Chronic_Disease_5.jpg . Our people experience a variety of unexpected moments when their lives and careers come together in meaningful ways.\n<br><br>\nTo find out more about what it?s like working for Philips at a personal level, visit the Working at Philips page at http://www.philips.com/a-w/careers/healthtech/working-at-philips/working-at-philips.html on our career website, where you can read stories from our employee blog at http://www.usa.philips.com/a-w/our-people/life-at-philips.html . Once there, you can also learn about our recruitment process at http://www.philips.com/a-w/careers/healthtech.html , or find answers to some of the frequently asked questions at http://www.philips.com/a-w/careers/healthtech/faq.html .\n<br><br>\nPhilips is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex (including pregnancy), sexual orientation, gender identity, national origin, genetic information, creed, citizenship, disability, protected veteran or marital status.\n<br><br>\nAs an equal opportunity employer, Philips is committed to a diverse workforce. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants that require accommodation in the job application process may contact 888-367-7223, option 5, for assistance.\n<br><br>\n<strong>\\#LI-PH1</strong>"}