{"job title": "Project Wetlands Scientist", "company": "Terracon", "city state": "– North /A, N/A", "rating": "3.4", "job description": "<strong>Terracon s multidisciplinary consulting team of natural and cultural resource professionals develop innovative solutions for diverse clients.\n<br>\nWe are looking for an energetic, enthusiastic and highly self-motivated individual looking to build his or her career in providing and leading the growth of Terracon s natural resource consulting services.\n<br>\nDuties include but are not limited to locating wetland in the field, utilizing a submeter global positioning (GPS) unit for surveying, collecting appropriate field data form information, and preparing wetland delineation reports summarizing findings.\n<br>\nAssessing project sites for threatened and endangered (T&amp;E) species habitat also comprises a portion of job responsibilities.\n<br>\nEnvironmental Biologists at this level work under general direction with limited to moderate supervision and are expected to apply limited to moderate experience and increase proficiency in the application of scientific principles, theories, practices, and company standards.\n<br>\nYou will be expected to work autonomously and meet the required scope, schedule, and budget of any given project as well as consult with other technical professionals and/or your supervisor on routine and moderately complex projects.\n<br>\nProficiency in basic computer software, and approximately 25 to 40 percent travel, with occasional overnight travel, is required.\n<br>\nMust have the ability and willingness to work near or in aquatic environments and sometimes hilly terrainLouisiana experience is preferred.Be familiar with what could go wrong on a project and how to protect the Company.\n<br>\nBe familiar with company risk policies.\n<br>\nResponsible for creating and modeling a safe work environment; demonstrate safety practices.\n<br>\nPromote pre-task planning for all projects.\n<br><br>\n<strong>\n<br>\nSince 1965, Terracon has evolved into a successful multi-discipline firm specializing in environmental, facilities, geotechnical, and materials services.\n<br>\nTerracon currently has more than 3,500 employees in 130 offices with services available in all 50 states.\n<br>\nTerracon s growth is due to valued employees exceeding expectations in client service and growing their careers with new and exciting opportunities in the marketplace.<strong>We encourage qualified minority, female, veteran and disabled candidates to apply and be considered for open positions.\n<br>\nWe do not discriminate against any applicant for employment, or any employee because of race, color, religion, national origin, age, sex, sexual orientation, gender identity, gender, disability, age, or military status.</strong></strong></strong>"}