{"job title": "ASSISTANT RESEARCH SCIENTIST", "company": "The University of Texas Rio Grande Valley", "city state": "– Edinburg, Texas", "rating": "4.0", "job description": "<div>\nPosting Details\n<br>\n <div>\n<div>\nPosition Information\n<br>\n <div>Posting Number SRGV3545</div> <div>Working Title ASSISTANT RESEARCH SCIENTIST (TEMPORARY POSITION)</div> <div>Number of Vacancies 1</div> <div>Location Edinburg, Texas</div> <div>Department School of Medicine / Biomedical Sciences</div> <div>FLSA Exempt</div> <div>Scope of Job<br><br>Under limited supervision and with moderate latitude for the use of initiative and independent judgment, performs complex research work by assisting in the development, implementation, and monitoring of specialized research projects. Manages the upkeep, training, and supervision of specialized research equipment within area of assigned responsibility.</div> <div>Description of Duties<br><br>•\tPlans, conducts, monitors, and analyzes research projects to include interpreting results, developing nonstandard tests, recommending technology-based solutions, or determining computational strategies; formulates and monitors long-range research objectives, programs, and priorities; reviews, analyzes, and evaluates the impact of legislation, regulations, and policies affecting current research.\n\n\n<ul>\n<li>May assist in formulation of research objectives and programs and determine the scope of methodologies of research projects and areas to be evaluated; provides consultation relating to research design, planning, instrumentation, statistical analysis, and reporting; works with researchers on the development of experiments and interpretation of results for research and teaching.</li>\n<li>Assists in developing policies and procedures used in conducting and administering research, demonstration, and evaluation activities; assists with conducting data quality assurance procedures; develops, improves, or customizes products, equipment, formulas, processes, or analytical methods; prepares research data sets and documents data structure and definitions; may develop new software applications or customize existing applications to meet specific scientific project needs.</li>\n<li>Writes technical papers or summary of findings and prepares standards and specifications for processes, facilities, products, or tests; coordinates or advises personnel in test procedures.</li>\n<li>Collects, compiles, and analyzes research data to include the use of statistical methods and relational databases to analyze data sets; prepares and provides presentations for professional organizations, governmental entities, and the public; communicates research results through conference presentations, scientific publications, or project reports.</li>\n<li>Ensures adherence to laboratory standards and practices to maximize safety and operational effectiveness; prepares and schedules equipment use during laboratory/research sessions; may diagnose equipment malfunctions, dismantle, and repair equipment; maintains laboratory instruments to ensure proper working order and troubleshoots malfunctions when needed; compiles and analyzes test information to determine process or equipment operating efficiency or to diagnose malfunctions.</li>\n<li>Trains users on the operation and data management of research equipment.</li>\n<li>Handles all issues relating to laboratory supplies, including ordering materials, maintaining inventory, and proper storage.</li>\n<li>Participates in proposal writing and coordination for external funds for equipment acquisitions; may be a Principle Investigator or Co-Principle Investigator.</li>\n<li>Knowledge of all Microsoft Office software and able to learn and use institutional software systems.</li>\n<li>Complies with all State and University policies.</li>\n<li>Other duties may be assigned.</li></ul></div> <div>Supervision Received<br><br>Specific supervision from assigned supervisor.</div> <div>Supervision Given<br><br>May train and supervise the work of others.</div> <div>Required Education<br><br>Ph.D.</div> <div>Preferred Education<br><br>N/A</div> <div>Licenses/Certifications<br><br>None.</div> <div>Required Experience<br><br>Knowledge of statistical concepts and methods and their application to research analysis; of measurement, testing, and evaluation; and of research methods, principles, techniques, and philosophies.</div> <div>Preferred Experience<br><br>Experience in a relevant area.</div> <div>Equipment<br><br>Skilled in conducting qualitative and quantitative research and in using computers, software, and statistical tools and programs.</div> <div>Working Conditions<br><br>Needs to be able to successfully perform all required duties. The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. While performing the duties of this job, the employee may occasionally be exposed to fumes or airborne particles; toxic or caustic chemicals; risk of electrical shock; and risk of radiation. The noise level in the work environment is usually moderate.</div> <div>Other<br><br>Ability to establish and maintain effective working relationships with co-workers and the public. May work some evenings and/or weekends. Ability to plan, organize, and oversee research projects, evaluate research data, ensure the development of measuring instruments with respect to reliability, relevance, and validity, interpret and publish research findings, and communicate effectively.</div> <div>Physical Capabilities</div> <div>Employment Category Full-Time</div> <div>Minimum Salary Commensurate with Experience</div> <div>Posted Salary Commensurate with Experience</div> <div>Position Available Date 09/05/2018</div> <div>Grant Funded Position No</div> <div>If Yes, Provide Grant Expiration Date</div> </div>\n\n<br>\n\n\n<div>\nPosting Detail Information\n<br>\n <div>EEO Statement<br><br>UTRGV is an Affirmative Action/Equal Opportunity Employer that strives to hire without regard to race, color, national origin, sex, age, religion, disability, sexual orientation, gender identity or expression, genetic information or veteran status. UTRGV takes affirmative action to hire and advance women, minorities, protected veterans and individuals with disabilities.</div> <div>Special Instructions to Applicants<br><br>Dear Applicant,\n<br><br>\nHuman Resources will not be held responsible for redacting any confidential information from the documents you attach with your application. The confidential information includes the following:\n<br><br>\n*Date of Birth\n\n\n<ul>\n<li>Gender</li>\n<li>Ethnicity/Race\n<br><br>\nPlease make sure that you omit this information prior to submission. We are advising that Human Resources will be forwarding your application to the department as per your submission. The University of Texas Rio Grande Valley reserves the right to discontinue accepting applications prior to the stated close date of this position, after meeting the posting requirement of three (3) calendar days.\n<br><br>\nIf you have any questions, please do not hesitate to contact us at (956) 665-2451 and/or careers@utrgv.edu.</li></ul></div> <div>Additional Information<br><br>UTRGV is a distributed location institution and working location is subject to change based on need.\n<br><br>\nAll UTRGV employees are required to have a criminal background check (CBC). Incomplete applications will not be considered.\n<br><br>\nSubstitutions to the above requirements must have prior approval from the Chief Human Resources Officer.</div> </div>\n\n\n\n</div>\n </div>\n<br>"}