{"job title": "Scientist III", "company": "Volt Workforce Solutions", "city state": "– Carlsbad, CA", "rating": "3.1", "job description": "<ul>\n<li>*Scientist III in Carlsbad, CA at Volt**</li>\n</ul>\n\n# Date Posted: _8/28/2018_\n<br><br>\n# Job Snapshot\n<br><br>\n+ **Employee Type:** Contingent\n<br><br>\n+ **Location:** Carlsbad, CA\n<br><br>\n+ **Job Type:** Engineering Disciplines\n<br><br>\n+ **Duration:** 24 weeks\n<br><br>\n+ **Date Posted:** 8/28/2018\n<br><br>\n+ **Job ID:** 129182\n<br><br>\n+ **Contact Name** Volt Branch\n<br><br>\n+ **Phone** 714-921-7460\n<br><br>\n# Job Description\n<br><br>\nVolt Workforce Solutions is seeking a Scientist lll, Molecular Biology in the Carlsbad CA area\n<br><br>\nCandidates will work with the Genome Engineering team. The candidate will be responsible for developing new products and will work closely with cross-functional teams including Bioinformatics, Marketing, Technical Service and/or Operations.\n<br><br>\n# Candidate responsibilities\n<br><br>\nCandidates will have a strong molecular biology experience with a background in protein engineering applications including hands-on experience in protein purification, protein expression, and functional protein activity screens.\n<br><br>\n+ Troubleshoots and solves difficult problems in the design/execution of development projects\n<br><br>\n+ Investigates, creates, and incorporates new methods and technologies to improve the effectiveness of development workflows\n<br><br>\n+ Independently designs experimental plans, analyzes experimental data, generates laboratory protocols, and writes technical reports, quantitative analyses, and product summaries\n<br><br>\n# Job Requirements\n<br><br>\nA PhD with 1 plus years of relevant experience or a Master's degree in Molecular Biology, Biochemistry, Genetics, or a related discipline and 3 plus years of lab experience is required. Protein evolution/characterization experience is preferred. Prior industrial experience is desirable\n<br><br>\n+ Strong cloning experience (standard cloning, PCR, mutagenesis, sequencing)\n<br><br>\n+ Experience with cell culture (sterile technique, maintaining cell lines, transfecting mammalian cell lines)\n<br><br>\n+ Experience with protein functional analysis (Activity assays, western blots, immunocytochemistry)\n<br><br>\n+ Protein evolution (screens, library design, analysis)\n<br><br>\n# Knowledge, Skills, Abilities\n<br><br>\n+ Experience with bacterial screening systems\n<br><br>\n+ Background in genome engineering or protein characterization\n<br><br>\n+ Proven proficiency in data analysis, research design, troubleshooting, and the evaluation of new techniques and procedures for manufacturing reagents, systems, products or techno\n<br><br>\n# Volt is an equal opportunity Employer\n<br><br>\nIn order to promote this harmony in the workplace and to obey the laws related to employment, Volt maintains a strong commitment to equal employment opportunity without unlawful regard to race, color, national origin, citizenship status, ancestry, religion (including religious dress and grooming practices), creed, sex (including pregnancy, childbirth, breastfeeding and related medical conditions), sexual orientation, gender identity, gender expression, marital or parental status, age, mental or physical disability, medical condition, genetic information, military or veteran status or any other category protected by applicable law."}