{"job title": "Analytic Consultant 3", "company": "Wells Fargo", "city state": "– Minneapolis, MN", "rating": "3.5", "job description": "<strong>Job Description</strong><br><br>At Wells Fargo, we want to satisfy our customers financial needs and help them succeed financially. Were looking for talented people who will put our customers at the center of everything we do. Join our diverse and inclusive team where youll feel valued and inspired to contribute your unique skills and experience.\n<br><br>\nHelp us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you.\n<br><br>\n<strong>Corporate Risk</strong> helps all Wells Fargo businesses identify and manage risk. We focus on three key risk areas: credit risk, operational risk and market risk. We help our management and Board of Directors identify and monitor risks that may affect multiple lines of business, and take appropriate action when business activities exceed the risk tolerance of the company.\n<br><br>\nThis exciting position is part of the Human Capital Risk Management Team and will play a significant role in the analysis of risk information for management reporting.\n<br><br>\nThis individual will need to be comfortable leveraging imperfect data from multiple sources, both internal and external, be comfortable executing a vision with loosely defined business requirements and proactively anticipate business needs that may or may not be explicitly articulated. The team requires an expert at distilling vast information into succinct, actionable insights and presenting that information in a polished format relevant to end users.\n<br><br>\n<strong>Key Responsibilities</strong>\n<ul>\n <li>Support the effective delivery of reporting and analytics by ensuring a governed, consistent, and common view of businesses exist within systems;</li>  <li>Act as a champion for information quality within all platforms;</li>  <li>Collaborate with other Risk Management team members to ensure integrity of information within systems;</li>  <li>Drive information quality improvements, surface underlying process issues, exert influence on change management, process engineering and functions that result in data remediation;</li>  <li>Collect and summarize feedback as it relates to systems of record to highlight common information quality and data challenges;</li>  <li>Isolate common themes and drive near-term solutions;</li> <li>Analyze emerging risks, control findings, risk metrics and trends related to Human Capital, and drive corrective action when needed.</li> <li>Provide reporting related to Human Capital metrics and trends, and incidents and issues, as required.</li> <li>Ensure data integrity of business information reported in operational risk management systems and reports.</li> <li>Work with business management to resolve issues and address deficiencies to mitigate risk.</li>\n</ul>\n<strong>Location</strong>: Charlotte, NC; Minneapolis, MN or Des Moines, IA Preferred. Other applicants within Wells Fargo footprint will also be considered.<br><br><strong>Required Qualifications</strong>\n<ul>\n<li>5+ years of reporting experience, analytics experience, or a combination of both; or a BS/BA degree or higher in a quantitative field such as applied math, statistics, engineering, physics, accounting, finance, economics, econometrics, computer sciences, or business/social and behavioral sciences with a quantitative emphasis and 3+ years of reporting experience, analytics experience, or a combination of both</li>\n</ul>\n<strong>Desired Qualifications</strong>\n<ul>\n<li>Extensive knowledge and understanding of research and analysis</li><li>Strong analytical skills with high attention to detail and accuracy</li><li>Excellent verbal, written, and interpersonal communication skills</li><li>Strong analytical skills with high attention to detail and accuracy</li><li>Strong, clear and concise written and oral communication skills</li><li>Tableau experience</li><li>Knowledge and understanding of data: importing, exporting, and report generation</li><li>Knowledge and understanding of report creation: researching, interpreting, and summarizing data</li><li>Microsoft Excel spreadsheets experience importing, exporting, and manipulating data</li><li>Microsoft Visio experience</li><li>Ability to analyze metrics and articulate data trends both visually and verbally</li><li>Ability to research, analyze, document, and present organizational metrics that drive business decisions</li><li>Outstanding problem solving and analytical skills with ability to turn findings into strategic imperatives</li>\n</ul>\n<strong>Other Desired Qualifications</strong>\n\n<ul>\n <li>Experience researching and compiling data to present in an executive summaries</li> <li>Experience in Human Resources Systems (PeopleSoft, Workforce Analytics) for report building and data analysis</li> <li>Experience working with risk governance and reporting tool: SHRP</li> <li>Ability to identify inefficiencies and/or opportunities to improve upon information quality processes;</li>\n</ul>\n\n<strong>Disclaimer</strong><br><br>All offers for employment with Wells Fargo are contingent upon the candidate having successfully completed a criminal background check. Wells Fargo will consider qualified candidates with criminal histories in a manner consistent with the requirements of applicable local, state and Federal law, including Section 19 of the Federal Deposit Insurance Act.\n<br><br>\nRelevant military experience is considered for veterans and transitioning service men and women.\n<br><br>\nWells Fargo is an Affirmative Action and Equal Opportunity Employer, Minority/Female/Disabled/Veteran/Gender Identity/Sexual Orientation."}