{"job title": "Provider Scheduling Coordinator and Data Analyst", "company": "Children's Hospital of Philadelphia", "city state": "– New Jersey, New Jersey", "rating": "4.0", "job description": "Req ID: 16225\n<br><br>\nShift: Days\n<br><br>\nEmployment Status: AF - Active - Regular - Full Time\n<br><br>\nJob Summary\n<br><br>\nUnder the direction of the Inpatient Medical Directors and Business Manager II, will manage several General Pediatrics Inpatient provider tracking systems and maintain availability schedules for approximately 80 providers. Responsibilities include day-to-day management, updating and ensuring the accuracy of systems and provider away time and service requests. Generate numerous schedules for provider vacation/conference time, and On-call Inpatient Service. Act as an analytical resource to collaborate with medical directors and Inpatient Section Chief to maintain their service schedules for clinics and optimize patient care. Utilize system to manage physician availability and coordinate availability where needed. Maintain on-going changes with provider scheduling rules to ensure systems are seamless. Act as leadership and instructional resource to providers and implement system updates where needed. Independently manage moonlighting and auxiliary schedules. Act as lead to pro-actively evaluate system efficiency and implement changes when needed. Train new physician staff on usage of the system.\n<br><br>\nJob Responsibilities\n\n\n<ul>\n<li>Manage any/all changes made for all provider schedules and services. Proactively identifies operational opportunities and problems related to the daily management of the Provider Scheduling System:</li>\n<li>Assume primary responsibility maintaining effective communication with all providers (physicians and nurse practitioners) regarding scheduling needs.</li>\n<li>Pro-actively collaborate with providers to create new and maintain current schedules on an ongoing basis.</li>\n<li>Work independently to process all correspondence with providers and/or administrative support.</li>\n<li>Work independently to recognize any conflicts within schedule and work with providers appropriately to problem solve.</li>\n<li>Work independently to ensure seamless communication and accuracy of all provider schedules.</li>\n<li>Regularly ensure that all internal scheduling systems are linked and accurately updated.</li>\n<li>Collaborate with Inpatient section chief and medical directors to maintain accuracy of provider and service scheduling.</li>\n<li>Develop and maintain a supportive relationship with other departments in order to promote teamwork, emphasize quality and extraordinary service and promote learning.</li>\n<li>Manage all General Pediatrics Provider Tracking Systems (routinely monitor and accurately update as needed):</li>\n<li>Complete and process any/all vacation requests for providers and update tracking system(s) accordingly.</li>\n<li>Perform independent analysis of all tracking systems (X-Tend, IMS, Provider Scheduling Tool, EPIC and OR Manager etc.) and accurately update where needed to ensure all are in sync.</li>\n<li>Work independently to identify any variance between provider away time and annual compensation letters.</li>\n<li>Create and distribute available moonlighting to the appropriate provider lists.</li>\n<li>Provide Administrative Support for the Inpatient Section Chief, which includes calendar management, meeting arrangements, travel arrangements, expense reimbursement, and basic day to day needs.</li>\n<li>Calendar Management</li>\n<li>Meeting arrangements</li>\n<li>Travel arrangements</li>\n<li>Expense reimbursement</li>\n<li>All other needs</li>\n<li>Provide Administrative Support services to the Division of General Pediatrics</li>\n<li>Performs routine clerical tasks: answer phones, open and distribute mail, prepare copies and faxes, etc.,</li>\n<li>Communicate with office staff to order, receives and distributes office supplies to assure there is an adequate inventory of necessary supplies.</li>\n<li>Maintains physician scheduling for various sections and coordinates with EPIC and provider scheduling systems.</li>\n<li>Provide back up for other staff in the Division of General Pediatrics</li>\n<li>Process Moonlighting for payment for General Pediatrics Residency Service, Integrated Care Service, Medical Hospitalist Team, Sedation Team, and House Physician Team.</li>\n<li>Maintain an excel database of moonlighting paid out of the MHT, Sedation, General Pediatrics, and Hospitalist Physician budget.</li>\n</ul>\n\nRequired Licenses, Certifications, Registrations\n<br><br>\nRequired Education and Experience\n\n\n<ul>\n<li>Minimum of 5 years of related healthcare access experience required</li>\n</ul>\n\nPreferred Education, Experience &amp; Cert/Lic\n\n\n<ul>\n<li>Bachelor's degree preferred.</li>\n<li>Customer service background in an academic medical setting preferred.</li>\n</ul>\n\nAdditional Technical Requirements\n\n\n<ul>\n<li>Must be technologically savvy with Microsoft Office applications and Electronic Health Records and scheduling systems</li>\n<li>Proficient with Microsoft Word and Excel</li>\n<li>Knowledge of PowerPoint.</li>\n<li>Ability to work independently with minimal supervision.</li>\n<li>Ability to be pro-active in following up on projects and tasks.</li>\n<li>Excellent phone etiquette.</li>\n<li>Ability to handle confidential materials.</li>\n<li>Ability to use Dictaphone equipment.</li>\n<li>Ability to handle multiple tasks.</li>\n<li>Excellent organizational skills.</li>\n<li>Knowledge of medical terminology and protocol.</li>\n</ul>\n\nAll CHOP employees who work in a patient building or who provide patient care are required to receive an annual influenza vaccine unless they are granted a medical or religious exemption.\n<br><br>\nChildren's Hospital of Philadelphia is committed to providing a safe and healthy environment for its patients, family members, visitors and employees. In an effort to achieve this goal, employment at Children's Hospital of Philadelphia, other than for positions with regularly scheduled hours in New Jersey, is contingent upon an attestation that the job applicant does not use tobacco products or nicotine in any form and a negative nicotine screen (the latter occurs after a job offer).\n<br><br>\nChildren's Hospital of Philadelphia is an equal opportunity employer. We do not discriminate on the basis of race, color, gender, gender identity, sexual orientation, age, religion, national or ethnic origin, disability or protected veteran status.\n<br><br>\nVEVRAA Federal Contractor/Seeking priority referrals for protected veterans. Please contact our hiring official with any referrals or questions.\n<br><br>\nCHOP Careers Contact\n<br><br>\nTalent Acquisition\n<br><br>\n2716 South Street, 6th Floor\n<br><br>\nPhiladelphia, PA 19146\n<br><br>\nPhone: ************\n<br><br>\nEmail:[Click Here to Email Your Resum]\n<br><br>\non Company Website\n<br><br>\nJob ID: US*213_*********\n<br><br>\nHelp us improve CareerBuilder by providing feedback about this job: .\n<br><br>\n<strong>CAREERBUILDER TIP</strong>\n<br>\nFor your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.\n<br>\nBy applying to a job using CareerBuilder you are agreeing to comply with and be subject to the CareerBuilder Terms and Conditions for use of our website. To use our website, you must agree with the Terms and Conditions and both meet and comply with their provisions.\n<br><br>\nChildren's Hospital of Philadelphia\n<br><br>\nSince its start in 1855 as the nation's first hospital devoted exclusively to caring for children, The Children's Hospital of Philadelphia has been the birthplace for many dramatic firsts in pediatric medicine. The Hospital has fostered medical discoveries and innovations that have improved pediatric healthcare and saved countless children's lives. Contact Info\n\n\n<ul>\n<li>Philadelphia, PA 19104</li>\n</ul>\n\nView Company Profile\n<br><br>\nDon't miss out on new jobs like this\n<br><br>\nGet the latest jobs delivered to your inbox. Unsubscribe at any time.\n<br><br>\nCreate Job Alert\n<br><br>\nSaving Your Job Alert\n<br><br>\nJob Alert Created\n<br><br>\nWell, this is embarrassing. We are having trouble saving your search. You can try again or come back at a later time.\n<br><br>\nMaximum Email Alerts\n<br><br>\nThis email address has reached the maximum of 5 email alerts. To create a new alert, you will need to log into your email and unsubscribe from at least one."}