{"job title": "Data Analyst - Heart Source", "company": "Columbia University", "city state": "– New York, NY", "rating": "4.0", "job description": "<strong>Job summary:</strong>\n<br><br>\nCandidate will work with a multidisciplinary team in the Department to provide standing quarterly and ad hoc cardiology and cardiac surgery reports. The Data Analyst will work in multiple clinical databases to create and develop algorithms for analyzing clinical data both inside the databases themselves and outside in excel/tableau. Together with senior members of the HeartSource team, s/he will analyze output from these databases, draw conclusions, and create presentations for affiliate clinical and administrative staff.\n<br><br>\n<strong>Duties and responsibilities:</strong>\n\n\n<ul>\n<li>Clean, verify and analyze data from multiple data bases.</li>\n<li>Work closely with data managers and abstractors, both within HeartSource and, as appropriate, at affiliate sites to verify data accuracy, completeness and timeliness.</li>\n<li>Provide efficient, accurate customized and timely reports to support clinical quality improvement as well as other compelling institutional needs.</li>\n<li>Support HeartSource team with creating and maintaining reporting system from a clinical and administrative perspective.</li>\n<li>Set up systems and/or develop queries that will allow HeartSource team to do performance monitoring and reporting.</li>\n<li>Performs simple statistical analyses as needed.</li>\n<li>-indicates duty is \"essential\" as defined by the Americans with Disabilities Act (ADA) Minimum Qualifications for Grade</li>\n</ul>\n\nApplicant MUST meet these minimum qualifications to be considered an applicant Bachelor's degree required\n<br><br>\n<strong>Minimum related experience:</strong>\n<br><br>\n2 years. Master's degree in public health may substitute in part for experience. Additional Position-Specific Minimum Qualifications\n<br><br>\nApplicant MUST meet these minimum qualifications to be considered an applicant Qualifications for Candidates include but are not limited to the following:\n<br><br>\n?Advanced level MS Office skills\n<br><br>\n?Proficiency with database management\n<br><br>\n?Experience with healthcare data analysis\n<br><br>\n?Effective interpersonal and communication skills required Special Instructions Preferred Qualifications Essential Functions Additional Essential Functions (Limit to 3950 characters.) Special Indications\n<br><br>\n<strong>This position works with:</strong>"}