{"job title": "Senior Data Analyst Quality Services", "company": "Dignity Health", "city state": "– US-CA-SANTA CRUZ", "rating": "3.7", "job description": "<div><div>\n<div><strong>About Us</strong>\n<br><br>\n<strong>Dominican Hospital</strong> (a member of Dignity Health) is a 222-bed facility that offers a wide range of services to residents of California’s Central Coast. With 24/7 emergency care, comprehensive care in cardiac, orthopedics, oncology, women’s and children’s services, we continue to lead the region in medical innovation and excellence in healthcare.\n<br><br>\n<strong>Comprehensive Care</strong>\n<br><br>\nDominican offers emergency services and is a Certified Stroke Center and Chest Pain Center. Dominican’s services include the only comprehensive Cancer Center in Santa Cruz County, a Total Joint Replacement program, and advanced neurological and endoscopic services. Dominican regularly receives ‘A’ grades for hospital safety from Leapfrog Group, and has received national recognition for superior patient safety, cardiac care, and stroke treatment from Healthgrades, a leading provider of comprehensive information about physicians and hospitals.\n<br><br>\nAs Santa Cruz County’s heart attack (STEMI) receiving center, Dominican Hospital provides cutting edge cardiac care. The hospital’s heart attack treatment times consistently beat the national average, and the hospital offers two cardiac catheterization labs available 24 hours a day, 7 days a week. Groundbreaking cardiac procedures at Dominican include the Transcatheter Aortic Valve Replacement (TAVR) procedure, which allows for heart valve replacement without opening a patient’s chest.\n<br><br>\nDominican Hospital has forged significant partnerships with area hospitals to bring exceptional care to Santa Cruz County. The hospital offers a level III Neonatal Intensive Care Unit (NICU) through a partnership with Lucile Packard Children’s Hospital Stanford. Neurosurgery at Dominican is also offered through a partnership with Stanford Health Care.\n<br><br>\n<strong>In The Community</strong>\n<br><br>\nBeyond care inside the hospital, Dominican is dedicated to the health and wellness of the Santa Cruz community.\n<br><br>\nCommunity programs include a Mobile Wellness Clinic, a tattoo removal program, and support groups for patients and new mothers. In addition, and in accordance with our mission, Dominican Hospital supports programs for the underserved in our community, including children and adults, students, seniors, and the homeless population. Dominican also has received several awards for environmental excellence.</div>\n</div>\n</div>\n\n<br>Responsibilities<br>\n\n<div>\n<div>\n<div>\n<div><strong>Position Summary:</strong></div><div>Supports Dignity Health system analytic leaders to drive efficient, accurate analysis of data and reporting for hospital operational and clinical needs and performance improvement initiatives across the Dignity Health system. Leads system-wide analytic projects, and analytic pieces of cross functional projects. Serves as a technical lead for analysts and senior analysts on the team and as a key technical resource for analysts across the system. Uses advanced business analysis techniques such as statistical and predictive modelling to understand data and predict outcomes. Works independently to analyze performance data and metrics to identify trends and root cause for performance gaps. Creates clean data extracts for data analysts within and outside of the analytics team to use for analysis. Communicates complex data/information in an understandable and compelling manner to a variety of end users at many levels of the organization.</div>\n<br>\n<div><strong>Principal Duties and Accountabilities:</strong></div><ul><li><div>Independently analyzes and combines data from a variety of disparate data sources to create meaningful analyses for system leaders. Researches and recommends targets for key metrics and performance indicators using external benchmarks and internal data.</div> </li><li><div>Creates complex statistical analyses and predictive models of hospital and clinical operational functions. Independently analyzes and communicates the cost-benefit of performance improvement projects across the organization. Independently creates analytical products based on business requirements. Develops complex programming code in SQL, SAS, R, or similar to extract, merge, combine datasets; clean data and create complex metrics based on customer specifications, company or national standards.</div></li><li><div>Communicates results of data analyses and data definitions to customers in a clear and compelling manner, using written, verbal, and other mediums. Collaborates with customers to understand the operational processes and clinical documentation practices which result in the data to be analyzed. Makes recommendations about how to improve performance based on that understanding. Skillful use of data storytelling to communicate the “takeaways” for customers. Independently gathers business requirements for analytics projects and products.</div></li><li><div>Acts as a change agent for advancing analytics and data-driven decision making within the organization. Develops and executes analytic training plans. Participates in high level system-wide projects as a data or analytic subject matter expert. Mentors and advises data analysts and senior data analysts in understanding source and meaning of data and to create effective analyses.</div></li></ul></div>\n</div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div>\n<div><strong>Education and Experience:</strong></div><ul><li>Master’s degree in Business, Healthcare, Statistics, or other related field; a combination of education and/or additional job related experience may be substituted in lieu of the degree.</li> <li>Minimum of seven (7) years of experience in analyzing, reporting, and communicating data.</li> \n</ul>\n\n<div><strong>Special Skills:</strong></div><ul><li>Proficiency with Microsoft Office suite. Proficiency in data programming software such as SQL, SAS, or R.</li></ul></div>\n</div>\n</div>\n<br>"}