{"job title": "Data Analyst Professional", "company": "Freddie Mac", "city state": "– McLean, VA", "rating": "3.7", "job description": "<div>The Finance Change Management team is seeking a Data Analtyics Professional to join the team. The hired individual will be responsible with developing requirements, performing complex data analysis, and user acceptance testing for finance and accounting applications. The incumbent will coordinate with project teams across divisions and may asked to resolve application and data issues during financial close.\n<br><br>\n<strong>Responsibilities include:</strong>\n\n\n<ul>\n<li>Develop key project artifacts such as project scope, business requirements, risk and controls assessment, issues and risks, user acceptance testing, documentation, and SOX testing.</li>\n<li>Perform complex financial data analysis to research issues, document data derivation and data movement requirements.</li>\n<li>Support the team in multiple projects ensuring adherence to Methodology, Controls and Quality Standards.</li>\n<li>Manage production application support duties which involve on-call support for troubleshooting critical data and system issues of supported applications, logging issues, working with IT to determine root cause.</li>\n<li>Support business operational risk controls, Internal/External audit activities.</li></ul></div><br>\n<div>* 2-4 years of relevant experience\n<li>Bachelor's Degree in business, accounting or related field</li>\n<li>Proficiency with advanced Microsoft Excel, Access, SQL and Visio</li>\n<li>Expertise in querying, analyzing, reconciling and testing complex relational data</li>\n<li>Experience with planning and executing data conversion, data mapping and data reconciliation activities</li>\n<li>Strong data and financial analytical skills; Ability to quickly understand complex financial concepts</li>\n<li>Demonstrated business analysis experience with the project lifecycle using waterfall and agile project methodology</li></div>\n<li>Accounting, Finance or Information System background with mortgage market experience desired</li>\n<div>Today, Freddie Mac makes home possible for one in four home borrowers and is one of the largest sources of financing for multifamily housing. Join our smart, creative and dedicated team and you'll do important work for the housing finance system and make a difference in the lives of others. Freddie Mac is an equal opportunity and top diversity employer. EOE, M/F/D/V.</div>\n\n"}