{"job title": "Industrial Data Analyst", "company": "GUCCI", "city state": "– Florence (Italy)", "rating": "3.4", "job description": "<strong>Role Mission</strong>\n<br><br>\nData analyst responsibilities include conducting full lifecycle analysis to include requirements, activities and design. Data analysts will develop analysis and reporting capabilities. They will also monitor performance and quality control plans to identify improvements.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n\n<li>Interpret data, analyze results using statistical techniques and provide ongoing reports</li>\n<li>Develop and implement databases, data collection systems, data analytics and other strategies that optimize statistical efficiency and quality</li>\n<li>Acquire data from primary or secondary data sources and maintain databases/data systems</li>\n<li>Identify, analyze, and interpret trends or patterns in complex data sets</li>\n<li>Filter and “clean” data by reviewing computer reports, printouts, and performance indicators to locate and correct code problems</li>\n<li>Work with management to prioritize business and information needs</li>\n<li>Locate and define new process improvement opportunities</li>\n\n</ul>\n<strong>Key Requirements</strong>\n\n<ul>\n\n<li>Proven working experience as a data analyst or business data Analyst</li>\n<li>Technical expertise regarding data models, database design development, data mining and segmentation techniques</li>\n<li>Strong knowledge of and experience with reporting packages (Microstrategy etc), databases (SQL etc), programming (XML, Javascript, or ETL frameworks)</li>\n<li>Knowledge of statistics and experience using statistical packages for analyzing datasets (Tableau in particular)</li>\n<li>Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy</li>\n<li>Adept at queries, report writing and presenting findings</li>\n<li>Experience performing/support Big Data analytics</li>\n<li>Bachelor in Statistics, Mathematics, Economics or Computer Science or specialized training/certification.</li>\n<li>Fluent in Italian and English</li>\n<li>Strong interpersonal, communication and relational skills</li>\n\n</ul>"}