{"job title": "Statistical Analyst for Social Interaction Data", "company": "Humanyze", "city state": "– Palo Alto, CA", "rating": "5.0", "job description": "Humanyze helps companies make more informed people decisions. Born out of the MIT Media Lab, Humanyze uncovers the hidden patterns of digital and face-to-face communication to quantify the people factor in the workplace. Humanyze is committed to helping teams work better together and has the data and science to prove it.\n<br><br>\nHumanyze’s world-leading People Analytics Platform delivers advanced insights and is used by top Fortune 500 companies to answer specific business questions around diversity and inclusion, collaboration and delivery, space planning, workload, teamwork and engagement, and regulatory and compliance risk.\n<br><br>\n<strong>Role Description:</strong>\n<br>\nWe’re looking for a <strong>Statistical Analyst</strong> to join our Analytics Team. Your main responsibility will be conducting statistical analysis of multiple customer projects analyzing social interaction data collected from real-world organizations. You will also work with data scientists and computational social scientists on the research and development of sensor data processing and social network metrics benchmarking.\n<br><br>\nThis is a full-time role based in Palo Alto, CA\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\n- Conduct statistical analysis analyzing multi-source communication and social network data to generate actionable insights\n<br>\nExamples include:\n\n<ul>\n<li>Recognizing interaction patterns across teams and levels of an organization</li>\n\n<li>Identifying key network characteristics in high-performing teams</li> \n\n<li>A/B testing for pre- vs post- intervention data</li>\n</ul>\n- Provide guidance to experimental design based on customer learning goals\n\n\n<ul>\n<li>Communicate with customer delivery team to quantify questions and hypotheses from the customer. Help the data analysts verify the validity of their analysis.</li>\n<li>Research and implement predictive/descriptive models to identify new social patterns.\n<br><br>\n<strong>Requirements:</strong></li>\n\n</ul>\n\n\n\n<ul>\n<li>MS degree in statistics</li>\n\n<li>Experience with statistical modeling techniques such as generalized linear models, mixed effect models, non-parametric models, etc</li>\n\n<li>Proficient in Python to analyze large datasets using packages such as numpy, networkx, pandas</li>\n\n<li>Proficient in R for conducting advanced statistical analysis</li>\n\n<li>Knowledge and experience in experimental design</li>\n\n<li>Familiar with relational database management system (RDBMS) e.g. PostgreSQL</li>\n\n<li>Experience in social network analysis preferred</li>\n\n<li>Experience in organizational science is a plus</li>\n\n<li>Process oriented and detail oriented</li>\n</ul>\n<strong>We Offer:</strong>\n\n<ul>\n<li>Competitive salary and bonus</li>\n\n<li>Flexible work environment</li>\n\n<li>Fully paid medical, dental and long-term disability insurance</li>\n\n<li>SIMPLE IRA matching</li>\n\n<li>3 Weeks of vacation, a holiday week, and 11 other company holidays</li>\n</ul>"}