{"job title": "HEALTHCARE QUALITY DATA ANALYST", "company": "Iredell Memorial Hospital", "city state": "– Statesville, NC", "rating": "3.5", "job description": "<div><div>\nApply</div><br>\n\n <div>Description</div>\n<br>\n <div>The Healthcare Quality Data Analyst is responsible for producing reports on clinical performance measures, focused clinical studies, and resource utilization in a manner which translates most effectively into information for decision-making toward improved clinical care processes and clinical, service, and financial outcomes. The data analyst will gather and analyze healthcare data from a variety of internal and external sources to create dashboards, extract trends, and provide clinical insights for quality improvement. Will verify accuracy of data and combine data elements into well-arranged and formatted reports which are easy for users to understand and which focus attention on key information while providing necessary explanations. The Healthcare Quality Data Analyst will work with internal and external teams to improve clinical quality, improve patient safety, and streamline healthcare operations.\n<br><br>\nSchedule: Basically days, Monday - Friday.\n</div>\n<br>\n <div>Requirements</div>\n<br>\n <div>\n\n<ul>\n<li>Minimum Associate’s Degree in healthcare field or equivalent preferably in Health Information Management, a clinical field or healthcare informatics required.</li><li>Bachelor of Science Degree in information technology, statistics, mathematics, health sciences, or related field preferred. Relevant experience may be substituted in lieu of degree.</li><li>Minimum 2 years’ experience in data processes and standards, preferably in a healthcare setting.</li><li>Experience with Microsoft Office suite, particularly Excel and Access, and database reporting applications such as Crystal reports.</li> <li>Experience with MIDAS and Premier data bases preferred.</li><li>Ability to work in a collaborative environment and communicate effectively in both written and oral format.</li><li>Strong analytical skills and ability to think critically about data for creative problem-solving.</li>\n</ul>\n</div></div>\n<br>"}