{"job title": "Senior Analyst, Post Market Surveillance (Data Science)", "company": "Johnson &amp; Johnson", "city state": "– Cincinnati, Ohio", "rating": "4.0", "job description": "<div>The Ethicon business is a member of Johnson &amp; Johnsons Family of Companies and is currently recruiting for a <strong>Senior Post Market Surveillance (PMS) Analyst</strong> to be located in <strong>Cincinnati, OH</strong>.</div><br>\n<div>The Ethicon business offers a broad range of products, platforms and technologies-including sutures, surgical staplers, clip appliers, trocars and synthetic mesh devices-that are used in a wide variety of minimally invasive and open surgical procedures. Specialties include support for treatment of colorectal and thoracic conditions, women's health conditions, hernias, cancer and obesity. The Ethicon business combines products and services of two market leading legacy companies, both with long histories of medical innovation. Ethicon, Inc. based in Somerville, New Jersey, was founded more than 80 years ago as a pioneer in suture development and manufacturing, helping to transform the safety and electiveness of open surgery. Ethicon Endo-Surgery, Inc. was created 20 years ago in Cincinnati, Ohio, developing innovative devices that have driven the revolutionary shift from open to minimally invasive surgery that continues to lead the industry today.</div><br>\n<div>You, the <strong>Senior Post Market Surveillance Analyst</strong> will collaborate with a team of statisticians, engineers and analysts in support of signal detection, trending, and post market quality surveillance. Ensures the adequacy of the documentation of the post market surveillance activities in terms of regulatory compliance and technical/statistical soundness. Presents results, facilitates discussion during data review meetings, proposes escalations, corrective, and preventative actions as required. Leads projects to improve and develop the sensitivity and specificity of surveillance processes for medical device performance. Completes data analysis and develops automation of the complex post market data analysis requirements and processes using robust software such as Advanced Excel techniques, Python and/or R. Collaborates and interact with internal teams, including Manufacturing, R&amp;D, Product Quality Engineering, Customer Quality and Supplier Quality. Regularly interacts with upper management. Provides input and develops new and existing post market surveillance processes.</div> <br>\n<div>The post market surveillance data set is large and includes reported product complaints, malfunctions, and adverse patient events, as well as capital equipment service records, clinical reviews, company-sponsored funded registries, post-market studies, and literature reviews. The Senior Analyst is responsible for monitoring trends of specific complaint rates over time, part usage, and adverse event rates using data analysis techniques and softwares. Applies, proposes and develops appropriate surveillance techniques and processes for various portfolios of medical devices (long term implantable, re-sterilized, capital equipment, consumable products etc.) Coordinates, leads, develops, executes and delivers the presentation of the post market quality data surveillance results on regular and frequent intervals. Responsible for the documentation and coordination of follow up activities from data review meetings (i.e.: meeting minutes and action items). Regularly communicates data analysis findings to lay audiences including members of upper management using visualization and customized formatting.</div> <br>\n<div>You, the<strong> Senior Post Market Surveillance Analyst</strong> will:</div><br>\n<div>\n\n<ul>\n<li>Under limited supervision, review and continuously execute the global post market surveillance process;</li> <li>Perform data analysis and automation on the post market data set to deliver outputs per procedure and stakeholder requirements;</li><li>Extracts monthly post market quality data from databases and maintains compliant records;</li> <li>Follows and develop procedures and processes to investigate and analyze post market data to resolve significant issues;</li><li>Monitor changes in post market quality signals, propose and/or lead appropriate next steps and document appropriately;</li><li>Determine and implement data driven solutions to monitoring customer and product quality issues through the application of statistical software and data analysis;</li><li>Provide guidance on post market surveillance processes and projects to stakeholders and junior team members;</li><li>Remain informed of new or revised regulations and/or guidelines and assesses impact on company post market surveillance processes;</li><li>Create presentations summarizing major product quality issues and complaint trends;</li><li>Ensure verification and validation activities of post market surveillance reports and data script outputs;</li><li>Support cross functional teams and stakeholder groups on ad-hoc data analysis, data mining, data queries in support of product performance, regulatory, compliance and other product and safety focused deliverables/requirements;</li><li>Complete projects/other duties as assigned;</li> <li>Provides support during external and internal audits of the customer quality process.</li> </ul></div>\n\n<br><strong>Qualifications</strong>\n<br>\n<div>\n\n<ul>\n<li>A minimum of a bachelors degree is required a concentration in a technical field (for example, Data Science, Biostatistics, Epidemiology, Public Health, Quality Engineering, Biomedical Engineering, Computer Science, Biology, etc.) or a related field is preferred; a minimum of 3 years of related business experience is required.</li> <li>An understanding of statistical analysis is required.</li><li>Experience with data analysis in a large data set is required.</li> <li>Experience with signal detection in a large data set is preferred.</li> <li>Demonstrated analytical capabilities with the ability to perform and automate data analysis (graphs, charts, pivot, statistics etc.) using Excel or R software is required.</li> <li>Working understanding of a statistical software language (R, Python) is preferred.</li> <li>Strong quantitative and critical thinking skills are required.</li><li>Strong organizational skills, time management skills and ability to self-manage in a complex/ time sensitive environment is required.</li><li>Ability to write and communicate in a professional manner, including generating and presenting well-written reports and presentations is required.</li> <li>Ability to work effectively with cross-functional teams is required.</li> <li>Ability to effectively prioritize and manage multiple activities and responsibilities is required.</li> <li>Experience and competency with basic office software tools (e.g. Microsoft Word, PowerPoint, Excel, Outlook) and internet browsers (e.g. Internet Explorer, Chrome) are required.</li> <li>Prior experience in the medical device industry or a highly regulated industry is preferred</li><li>This position is located in Cincinnati, Ohio and may require up to 5% travel.</li></ul></div>\n<br>\n<div>Do you strive to join an outstanding team that is dynamic and ever-changing? Is career growth and opportunity appealing to you? Apply to this opportunity today.</div> <br>\n<div>Johnson &amp; Johnson Family of Companies are equal opportunity employers, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, protected veteran status, disability status, or any other characteristic protected by law.</div>\n<br>\n<strong>Primary Location</strong>\n<br>\nUnited States-Ohio-Cincinnati\n<br>\n<strong>Organization</strong>\n<br>\nEthicon Endo Surgery Inc (6041)\n<br>\n<strong>Job Function</strong>\n<br>\nQuality (Eng)\n<br>\n<strong>Requisition ID</strong>\n<br>\n<strong>7008180801</strong>\n<br>"}