{"job title": "QA Data Analyst pharmaceutical manufacturing", "company": "Kelly Services", "city state": "– Largo, FL", "rating": "3.5", "job description": "<strong>QC Data Analyst – Largo, FL</strong>\n<br><br>\nKelly Scientific is seeking a QA Data Analyst for a supplement manufacturer in the Largo, FL area. This is a direct hire opportunity. Monday-Friday on the 1st shift.\n<br><br>\nThe ideal candidate will have strong experience with SAP software and experience with raw material tracking in a pharmaceutical setting.\n<br><br>\n<strong>GENERAL PURPOSE</strong>\n<br><br>\nTo assist the QC team day to day activities in the testing and data processes within SAP systems.<br>\n<div><strong>POSITION RESPONSIBILITIES</strong></div><br>\n\n \n<div>\n \n\n\n<ul>\n\n <li>Manage QC request and maintain and/or develop tracking matrices</li>\n\n<li>Manage and maintain databases to communicate specific QC process(i.e. sample process, testing status, lot status and overall batch release process)</li>\n\n<li>Participate SAP program -\n\n\n<ul>\n\n <li>Data collection</li>\n\n<li>Database maintenance</li>\n\n<li>Analysis</li>\n\n<li>Protocols</li>\n</ul>\n\n </li>\n<li>Quality Assurance – Reviewer on key documentation and contributor to Quality systems. Ensuring quality and correctness through-out the processes below. \n\n\n<ul>\n\n <li>Lot Status</li>\n\n<li>Raw Material CofA approval</li>\n\n<li>Raw Material Tracking through SAP</li>\n\n<li>Raw Material Profile</li> \n\n<li>SOPs</li>\n\n<li>Change Controls</li>\n</ul>\n\n </li>\n<li>Participate in Continuous Improvement initiatives</li>\n\n<li>Provide Operations support on processing specifications, working together on solutions to production challenges.</li>\n\n<li>Assist in the productivity of QC processes\n\n\n<ul>\n\n <li>Complete all internal departmental documentation accurately.</li>\n\n<li>Reviewing documentation</li>\n</ul>\n\n </li>\n<li>Computer skills are a must; Microsoft Office Suite knowledge; Batch Master implementation</li>\n\n<li>Perform other duties as required.</li>\n\n<li>Willing to work overtime, holidays and weekends as requested by supervisor.</li>\n</ul>\n\n </div><br>\n\n<div><strong>MINIMUM QUALIFICATIONS</strong></div><br>\n\n \n<div><strong>Education:</strong>\n<br><br>\nBachelor’s Degree in Chemistry, Biology or related field.</div><br>\n\n \n<div><strong>Experience:</strong>\n<br><br>\nSome experience with SAP in a related, regulated industry (Food, Nutritional, Drug, Cosmetic, or Medical Device).</div><br>\n\n \n<div><strong>Knowledge, Skills and Abilities:</strong>\n\n<ul>\n\n <li>Self-starter and capable of managing own activities</li>\n\n<li>Work independently as well as in team environments</li>\n\n<li>Problem solving</li>\n\n<li>Ability to operate computer software, e.g. Word, Excel, Outlook.- advanced Excel capabilities</li>\n\n<li>Must have a good interpersonal and communication skill in English, understand both oral and written instructions and be detail oriented.</li>\n\n<li>Excellent attention to detail</li>\n</ul>\n\n </div>\n<br>\n\n<div><strong>Certification or License:</strong>\n<br><br>\nNone</div><br>\n<div>Why Kelly®?</div>\n<br><br>\nWith Kelly, youll have access to some of the worlds highest-regarded scientific organizations\n<br><br>\nproviding you with opportunities to work on todays most challenging, research-intensive, and relevant \n<br><br>\nprojects. Our connections can lead you to innovative scientific pursuits youll be proud to help \n<br><br>\nadvance. We work with 95 of the Fortune 100 companies, and found opportunities for more than 9,000 \n<br><br>\nscientific professionals last year.<br><br>You pursued a career in science to fuel your quest for knowledge and your desire to make the world \n<br><br>\na better place. Let Kelly fuel your careerconnect with us today.<br>\n\n<div>About\n<br>\nKelly Services®</div>\n<br><br>\nAs a workforce advocate for over 70 years, we are proud to directly employ nearly 500,000 people around the world and have a role in connecting thousands more with work through our global network of talent suppliers and partners. Revenue in 2017 was $5.4 billion. Visit <u>kellyservices.com</u> and connect \n<br><br>\nwith us on <u>Facebook</u>, <u>LinkedIn</u> and <u>Twitter</u>.<br><br>Kelly Services is an equal opportunity employer including, but not limited to, Minorities, Females, \n<br><br>\nIndividuals with Disabilities, Protected Veterans, Sexual Orientation, Gender Identity and is \n<br><br>\ncommitted to employing a diverse workforce. <u>Equal Employment Opportunity \n<br><br>\nis The Law.</u>"}