{"job title": "Bilingual Data Analyst", "company": "Linium Recruiting", "city state": "– Miami, Florida", "rating": "3.7", "job description": "<div> <strong>Our client, a Global Investment Bank, is seeking a Bilingual Data Analyst in their Miami location. </strong><br>\n<br>\n<strong><u>The primary day-to-day responsibilities will include:</u></strong><br>\n• Sending written communications to client advisors regarding various remediation projects<br>\n• Analyze account documentation<br>\n• Review/input client data into Private Bank client management system<br>\n<br>\n<strong><u>Qualities we are looking for:</u></strong><br>\n• Good Verbal / Written Communication<br>\n• Initiative / Self-Motivation and self-starter<br>\n• Very organized<br>\n• College-educated<br>\n<br>\n<strong><u>Academic experience, degrees, or certifications:</u></strong><br>\n• College-educated or entry level experience in banking<br>\n <br>\n<strong>Why Work With Linium?</strong><br>\n<strong>Why Consider a Contract/Temp Role?</strong>\n\n<ul>\n\t<li>Find jobs with companies that may rely <strong><u>only</u> </strong>on Firms for hiring</li>\n\t<li>Get a foot in the door with an amazing company, while earning a paycheck</li>\n\t<li>Use your assignment to evaluate your future employer and make sure it is a good fit for you</li>\n\t<li>Use the positions to <strong>fill in the \"gap</strong>” while you're looking for a permanent role</li>\n\t<li>Develop <strong>new skills, experiences &amp; references </strong>–build your resume</li>\n\t<li><strong>Linium's services are FREE to all job seekers!</strong></li>\n</ul>\n <br>\n<strong> Visit us online at: </strong><strong>www.liniumrecruiting.com</strong><br>\n <br>\n <br>\n<strong>What to expect once you've applied:</strong><br>\nOnce your resume has been received, The Linium team will review your credentials to match your qualifications against all of the open positions, including the one you applied for. If you are qualified for any of the current job openings, a member of the Linium team will contact you. <br>\n <br>\n<strong> We Care!</strong><br>\nWe understand job searching is stressful! We know that finding a better job to advance your career and your income is important. We will be there every step of the way helping you navigate through the complexities of job searching in today's economy.<br>\n <br>\n<strong><em>As an Equal Opportunity / Affirmative Action Employer, by choice, Linium will not discriminate in its employment practices due to an applicant's race, color, creed, religion, sex (including pregnancy, childbirth or related medical conditions), sexual orientation, gender identity or expression, age, national origin, marital status, citizenship, physical and mental disability, criminal record, genetic information, predisposition or carrier status, status with respect to receiving public assistance, domestic violence victim status, a disabled, special, recently separated, active duty wartime, campaign badge, Armed Forces service medal veteran, or any other characteristics protected under applicable law. </em></strong><br></div><br><br>"}