{"job title": "Data Governance Analyst", "company": "Northern Westchester Hospital", "city state": "– New Hyde Park, NY", "rating": "4.0", "job description": "<strong>Job Description</strong>\n<br><br>\nParticipates in providing data management support to Data Governance Program and Enterprise Data Steward. Collaborates with leadership, assesses and defines data governance and data quality needs to support data improvement practices. Identifies, analyzes and reports/resolves data issues, ensures the availability and quality of data needed for decision making, as prioritized to address department goals and business strategy.\n\n\n<ul>\n<li>Works with leadership and provides analytics to support Data Governance Program Office and Enterprise Data Steward's data needs.</li>\n<li>Retrieves and characterizes data including data profiling, and descriptive statistics.</li>\n<li>Works with departments/ sites to ensure metrics and goals for assigned projects.</li>\n<li>Performs and supports Six Sigma root cause analytics.</li>\n<li>Creates and maintains data quality dashboards. Gathers data, analyzes and reports on results.</li>\n<li>Provides data analysis and/or preparation of analytic requirements to support leadership.</li>\n<li>Collaborates with Data Governance leadership on prioritization and scheduling.</li>\n<li>Performs related duties, as required.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Master's Degree in Statistics, Biostatistics, Business Administration, or related field, preferred.</li>\n<li>Minimum of seven (7) years progressively responsible experience in data management, data quality and data analysis, required. Healthcare experience, preferred.</li>\n<li>Six Sigma Green Belt Certification, preferred.</li>\n<li>Experience with data profiling tools and practices, SQL and statistical software packages including SAS and SSPS, preferred.</li>\n<li>Familiarity with health care data types and data structures, preferred.</li>\n<li>Experience in data governance and stewardship standards and practices, preferred.</li>\n</ul>"}