{"job title": "Sr. Data Link Analyst", "company": "SAIC", "city state": "– Atlantic City, NJ", "rating": "3.6", "job description": "<p><b>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</b></p><div>Sr. Data Link Analyst (Job Number:438861)<br><br><b>Description:</b><br><br><br>JOB DESCRIPTION:<br><br>SAIC has an upcoming need for a Systems Engineer. The successful candidate will apply systems analysis and operational procedures to complex scientific or operational systems in a broad area such as requirements development, engineering, interface design, training, routine operations, and interoperability. Position requires competence in operational techniques and familiarity with management practices in one or more subject-matter areas specifically as it relates to the AEGIS Combat and Weapons Systems. The body of work includes Combat System Test and Evaluation for AEGIS and AEGIS BMD host combat systems in support of computer program development, maintenance and fielded combat systems fleet support. Performs Combat System Performance Assessments and assess System Capabilities in order to demonstrate System Capability and Identify System Limitations in Support of Combat System Mission Readiness assessments and Certification Decisions. Combat System Test and Evaluation includes Performance Verification associated with AEGIS Weapon System (AWS) development and AEGIS Combat System (ACS) Integration/development to include Fleet event reconstruction for Fleet reported problems and to ensure systems meet specification, do not regress in capability and are safe and stable in use. Weapons Systems/Combat Systems for Naval programs activities related to Test and Evaluation (T&amp;E) including: Weapon Systems Engineering and Integration (V) Department Test and Evaluation (T&amp;E) of Weapons Systems/Combat Systems for Naval programs. Examples of Weapons Systems include; the AEGIS Weapon System (AWS) which includes Ballistic Missile Defense (BMD) Capability, SPY, Weapons Control System (WCS), AEGIS Display System (ADS), Combat Direction System (CDS), AEGIS Combat Training System (ACTS), and Operational Readiness Test System (ORTS); Littoral Combat System (LCS) which includes the Core Weapon System and all applicable mission packages, Fast Frigate (FF), Ship Self Defense System (SSDS) and DDG 1000 Combat System which includes Total Ship Computing Environment (TSCE).<br><br>The successful candidate will be required to:<br><br>- Understand the operations and integration requirements of complex Naval Surface weapons and combat systems or systems of systems. Assist in formulating requirements; advise on alternatives and on the implications of new or revised systems; identify omissions and errors in requirements. Assist in the development of system design for approved projects. Interpret information and informally arbitrate between system users when conflicts exist.<br>- Provide engineering assessments of the impact and implications of integrating new or revised components into existing combat systems baselines using standard analysis tools for compliance and/or deviation from published specifications. Be familiar with combat systems operation and performance specifications to recognize deviations.<br>- Provide tracking, fielding, and documentation for the Aegis Integration project to support successful completion of AEGIS Combat System Certification process for US Navy AEGIS Cruisers and Destroyers.<br>- Good interpersonal and communications required! Applicant will be working closely with persons from many Branches and Disciplines and will be required to make his findings clear to all<br>- Review existing or planned integration test initiatives and determine if the current plans can satisfy operational requirements as defined by the product manufactures identified integration plans and if not, provide an assessment of the deltas (differences), the risks associated with the deltas, and recommend a path for resolution.<br>- Evaluate and develop new concepts, or processes.<br>- Prepare or review technical reports for use by engineering, operational, or management personnel for long and short range planning or for use by personnel in technical services activities.<br>- Development of plans.<br>- Generate briefs and tracking metrics.<br>- Assessment of integration options.<br>- Support for analysis and testing efforts.<br>- Support for Aegis Ship Configuration and Planning.<br><br><b>Qualifications:</b><br><br> EDUCATION:<br><br>- Bachelors degree from accredited institution or four years experience in lieu of degree.<br><br>CLEARANCE REQUIREMENT:<br><br>- Clearance Level Must Currently Possess: Secret<br>- Clearance Level To Obtain: Secret<br><br>REQUIRED EDUCATION AND EXPERIENCE:<br><br>Position Specific Experience/Skills<br><br>- Two (2) yrs analysis experience involving Data Analysis and subsequent reporting for Naval Combat Systems and Subsystems in general, and Aegis Combat and Weapons systems specifically.<br>- Minimum Two (2) yrs Windows and Microsoft Office experience.<br>- Must be able to create, modify, review and report Spreadsheets, Documents and Presentations.<br><br>SAIC Overview:SAIC is a premier technology integrator providing full life cycle services and solutions in the technical, engineering, intelligence, and enterprise information technology markets. SAIC is Redefining Ingenuity through its deep customer and domain knowledge to enable the delivery of systems engineering and integration offerings for large, complex projects. SAIC's approximately 15,000 employees are driven by integrity and mission focus to serve customers in the U.S. federal government. Headquartered in Reston, Virginia, SAIC has annual revenues of approximately $4.5 billion. For more information, visit saic.com. For information on the benefits SAIC offers, see My SAIC Benefits. EOE AA M/F/Vet/Disability<br><br><b>Job Posting:</b> Aug 9, 2018, 10:08:09 PM<br><b>Primary Location:</b> United States-NJ-ATLANTIC CITY<br><b>Clearance Level Must Currently Possess:</b> Secret<br><b>Clearance Level Must Be Able to Obtain:</b> Secret<br><b>Potential for Teleworking:</b> No<br><b>Travel:</b> Yes, 10% of the time<br><b>Shift:</b> Day Job<br><b>Schedule:</b> Full-time</div>"}