{"job title": "Wholesale Data Management Analyst", "company": "SunTrust", "city state": "– SunTrust Plaza Tower (GA00116) 303 Peachtree Street Atlanta, 30308", "rating": "3.2", "job description": "<p>Career level position in Wholesale’s Data Management\norganization and member of a team primarily focused on Corporate Investment\nBanking and Capital Markets data. Possesses in-depth knowledge of\nData Management practice and other related data disciplines. Applies\nknowledge of best practices, derived from experience, to solve a range of complex\ndata-related technical, operational, and business problems. \nPartners with Team Lead and plays a significant role in large complex projects\nor initiatives. May lead smaller projects with manageable risks and\nresource requirements. Develops and fosters relationships with business\nowners and stakeholders involved with Data Governance initiatives. Serves\nas a liaison between business and technical teammates. Works\nindependently and receives minimal guidance.</p>\n<p>Minimum Requirements:</p>\n\n<p>Bachelor’s degree and 5 years of related experience or an\nequivalent combination of education and experience. Advanced knowledge of Data Governance principles and\nstandards with experience in providing related guidance to business and technology\nteammates. Demonstrated problem solving and analytical skills; creative\nthinker, always looking for a “better way” to deliver value, not stopped or\ndiscouraged by adversity. Understanding of basic Data Modeling concepts. Proficient in creating SQL queries and applying various data\nmanipulation techniques for data analysis. Capable of performing mapping activities\nin support of data projects, capturing data flow and process to maintain data\nlineage. Ability to identify potential data remediation options to\nresolve data integrity, quality, confidentially, availability, and consistency\nissues</p>\n\n<p>Independent, yet collaborative, respected by peers and\nothers; decisive, assertive, with the ability to achieve results quickly. Responsible and accountable – someone who takes ownership\nand initiative. Passionate about working with data. Excellent written and verbal communication skills to\ninteract with matrix teams and influence outcomes</p>\n\n<p> </p>\n\n<p>Preferred Requirements:</p>\n\n<p>Master's degree or MBA and 6 years of related experience. Previous experience in the banking industry. Corporate Investment Banking\\Capital Markets Experience. Expert MS Excel and/or TOAD skills for data analysis. High level of proficiency with PowerPoint</p><p></p>"}