{"job title": "Business/ Data Analyst", "company": "The Royak Group", "city state": "– FL - Tampa", "rating": "1.6", "job description": "Category : Management/Operations\n<br>\nLocation/City : FL - Tampa\n<br>\nJob Type : Permanent\n<br><br>\nBusiness AnalystOverview:Qualified candidates will work closely, internally and externally, with cross-functional teams and clients to turn data into critical information and knowledge that can be used to make sound business decisions. They will gain an in-depth understanding of the co-managed cybersecurity business environment; will conduct analyses of cybersecurity data generated by a diverse set of security tools and from across many industry verticals; and will create, maintain and enhance existing data analysis output in the form of reports, dashboards, papers. Reports directly to the VP of SOC Analytics and Business Intelligence.Responsibilities: Developing, refining, enhancing, analyzing, interpreting and producing comprehensive weekly, monthly, quarterly reports that demonstrate ROI to various stakeholders within the company and externally to our clients Conduct on-demand ad hoc queries and provide analysis in a timely manner. Develop, analyze and interpret performance metrics to assist decision making requirements and to extract learnings, drive insights, and answer the â?'so what' question. Work with internal and external stakeholders to determine business requirements, priorities, define key performance indicators (KPI). Contribute to the design, development, and maintenance of ongoing metrics, reports, analyses, dashboards, etc. to drive key business decisions Develop and apply an understanding of cyber-security co-managed service delivery. Develop and apply an understanding of cyber-security requirements within various industry verticals. May travel up to 20-25% of the work year. May work after hours to complete business objectives if required Required Qualifications: Bachelor's degree in Computer Science, Engineering, Math, Finance, Statistics or related discipline -- highly quantitative/technical field. Excellent written and oral communication skills including an ability to communicate with internal and external cross functional teams (technical and business). 1-3 years of Business Analysis or related technical experience.Qualifications: Bachelors Degree required A Graduate degree (MS, MBA, PhD, etc.) in a similar field will be highly valued but is not required. Prior experience with business intelligence and visualization tools, such as ServiceNow- Performance Analytics, Tableau, Domo, SiSense, Microsoft Power BI, Qlik. Retrieving and analyzing data using SQL, Excel, and other data management systems. Experience as a Business Analyst in the cybersecurity or related field. Knowledge of the industry verticals such as Banking/Finance, Healthcare, Telecommunications, &amp; Energy. Great attitude, energy, and effort.About the Company:For the past 10 years, ReliaQuest has pushed the boundaries of IT security â past allegiance to any one technology, the challenges of workforce limitations, or the definitions of the managed services category. Today, ReliaQuest custom-architects and scales individualized security environments that get smarter over time. By combining existing tools and technologies with the reliability of co-management and the speed and agility of Managed Detection and Response (MDR) services, ReliaQuest transforms organizations into their own security platforms â providing unmatched visibility while normalizing the security spend.\n<br><br>\nReliaQuest operates 24 hours a day, 365 days a year from Security Operations Centers in Tampa, FL, Las Vegas, NV, and Dublin, Ireland. ReliaQuest's model is recognized by industry experts as the emerging standard for large and complex organizations. The company has received numerous accolades for its commitment to maintaining a positive company culture, including being named a Great Place to WorkÂ• and being listed as one of Fortune Magazine's Top 100 Medium Workplaces in 2017. ReliaQuest was also ranked No. 171 on Deloitte's Technology Fast 500â?¢, a ranking of the 500 fastest growing technology companies in North America. Also in 2017, ReliaQuest CEO Brian Murphy was named EY Entrepreneur of the Year for Florida.Equal Opportunity Employer\n<br><br>"}