{"job title": "Health Data Analyst", "company": "University of Colorado", "city state": "– Aurora, CO", "rating": "4.1", "job description": "<div><b>University of Colorado Denver l Anschutz Medical Campus</b></div><div><b>Division of Bioinformatics and Personalized Medicine</b></div><div><b>Health Data Analyst</b></div><div><b>Position # 00747588 – Requisition 13927</b></div><div><b><br></b></div><div><b>* Applications are accepted electronically ONLY at www.cu.edu/cu-careers *</b></div><div><b><br></b></div><div><b>The Division of Bioinformatics and Personalized Medicine has an opening for a full-time University Staff (unclassified) Health Data Analyst position.</b></div><div><br></div><div>The University of Colorado Denver | Anschutz Medical Campus is a public research university serving more than 18,000 students. We award nearly 4,000 degrees each year, including more graduate and professional degrees than any other Colorado institution. With our solid academic reputation, award-winning faculty and renowned researchers, we offer more than 140 highly rated degree programs through 13 schools and colleges. The university receives over $400 million in research awards each year. In addition to the wide array of health-related programs and facilities offered at CU Anschutz in Aurora, Colo. a significant number of undergraduate and graduate degree programs are taught at CU Denver, our comprehensive campus in the heart of downtown Denver—one of America’s most vibrant urban centers. CU Denver is located steps from the Denver Center for Performing Arts and the LoDo District affording our students, faculty and staff access to a broad array of academic, professional, community, recreational and cultural outlets.</div><div><br></div><div>A national leader in health care and life sciences, CU Anschutz is the only comprehensive academic health sciences center in Colorado and the largest in the Rocky Mountain region. Located in Aurora, Colo., it is one of the newest education, research and patient care facilities in the world. With six schools and colleges, CU Anschutz trains the health sciences workforce of the future by blending education, research and clinical care all in one place. This strategic collaboration among diverse health care fields allows knowledge to travel directly from the research bench to the patient’s bedside. </div><div><br></div><div>The University of Colorado Anschutz Medical Campus ranks among the top institutions nationally in clinical care, education and research. Its 230-acre campus, designed to enhance collaboration and interprofessional education, hosts the College of Nursing; the Schools of Dental Medicine, Medicine, Pharmacy, and Public Health; the Graduate School; a Health Sciences Library; and two hospitals. Strategically located contiguous to the campus are a biosciences research park and the soon-to-be-completed Veterans Hospital. CU Anschutz offers two undergraduate degrees, 35 graduate degrees, and five first-professional programs. More than 4,000 students learn alongside faculty members who also make meaningful medical discoveries and provide expert clinical care through 1.5 million patient-visits annually. A hub for research and innovation, CU Anschutz receives over $400 million in research awards each year and has filed 1,300 patent applications and formed 53 new companies since 2002</div><div><br></div><div><b><u>Nature of Work</u></b></div><div>Health Data Compass is the enterprise health data warehouse on the Anschutz Medical Campus of the University of Colorado Denver in Aurora, CO. Our team runs the data integration and analytics platform to support clinical and translational healthcare research across the CU research enterprise, to promote operational excellence within our partner hospitals, and to drive innovation and discovery in the field of personalized medicine. We are jointly sponsored by the University of Colorado Denver, CU Medicine, UCHealth, and Children’s Hospital Colorado. The Data Analyst position will work with End Users (e.g. Physicians, Researchers, Hospital Administrators), healthcare analysts, developers, and other technical personnel throughout all phases of the software development lifecycle and serve as a critical contact on data through the data warehouse integration process. In addition, this role is responsible for documenting and implementing data definitions, business, and technical rules, and monitoring and auditing data quality for data sets that are created. This position requires a highly motivated individual that can work in a self-directed manner in a team-oriented environment with a high-degree of health or clinical information management expertise, customer service expertise, and experience with healthcare data. Attention to detail and excellent documentation and interpersonal skills are necessary to succeed in this role.</div><div><br></div><div>This description is a summary only and is describing the general level of work being performed, it is not intended to be all-inclusive. The duties of this position may change from time to time and/or based on business need. We reserve the right to add or delete duties and responsibilities at the discretion of the supervisor and/or hiring authority.</div><div><br></div><div><b><u>Salary and Benefits</u></b></div><div>The hiring salary for this position is negotiable and commensurate with skills and experience. This position is not eligible for overtime compensation.</div><div><br></div><div>The University of Colorado offers a full benefits package. Information on University benefits programs, including eligibility, is located at https://www.cu.edu/employee-services.</div>\n<div><b><u>Minimum Qualifications</u></b></div><div><ul><li>A Bachelor’s degree in a research or healthcare related field.</li><li>2 years of professional level experience with healthcare data, such as data profiling, data quality, data analysis/reporting (e.g. Clinical Research Coordinator, clinical trial data analyst, data analyst, etc.).</li><li>·Strong skills with clinical data,\nknowledge of clinical health care data and practice.</li><li>Demonstrated success working in an\nintegrated environment and working within a cross-functional team, including\noutstanding written and verbal communication, documentation, and presentation.</li><li>Strong analytical skills, critical\nthinking, attention to detail and accuracy, and strong inter-personal skills.</li><li>Strong ability to communicate with development\nteams throughout SDLC lifecycle, ability to support development of BI\ndashboards and reports, and data analytic initiatives</li><li>Experience with healthcare data warehouses.</li><li>Experienced in querying data and data quality analysis.</li></ul></div><div><b><u>Preferred Qualifications</u></b></div><div><ul><li>Master’s degree in clinical/health care informatics or related healthcare/clinical field from an accredited institution.</li><li>Experience working with a healthcare electronic medical record (EMR) system’s data model, minimum of 1 year.</li><li>Experience writing reports using healthcare data against data warehouse like Epic Clarity or Caboodle, minimum of 1 year.</li><li>Training in standardized clinical code systems (e.g. SNOMED CT, LOINC, RxNorm), and experience in mapping between code systems, minimum of 1 year.</li><li>Manage terminology mapping documentation, data profiling and data mapping documentation, experience of minimum 1 year</li><li>SQL skills for querying data, experience of minimum 1 year.</li></ul></div><div><b><u>Knowledge, Skills, and Abilities</u></b></div><div><ul><li>Ability to communicate effectively, both in writing and orally. </li><li>Ability to establish and maintain effective working relationships with employees at all levels throughout the institution.</li><li>Outstanding customer service skills.</li><li>Demonstrated commitment and leadership ability to advance diversity and inclusion.</li></ul></div><div><b><u>Diversity and Equity</u></b></div><div>The University will provide reasonable accommodations to applicants with disabilities throughout the employment application process. To request an accommodation pursuant to the Americans with Disabilities Act, please contact the Office of Equity by email at equity_ada@ucdenver.edu or by phone at (303) 315-2567.</div><div><br></div><div>The University of Colorado Denver | Anschutz Medical Campus is committed to recruiting and supporting a diverse student body, faculty and administrative staff. The university strives to promote a culture of inclusiveness, respect, communication and understanding. We encourage applications from women, ethnic minorities, persons with disabilities and all veterans. The University of Colorado is committed to diversity and equality in education and employment.</div><div><br></div><div>The University of Colorado Denver | Anschutz Medical Campus is dedicated to ensuring a safe and secure environment for our faculty, staff, students and visitors. To assist in achieving that goal, we conduct background investigations for all prospective employees. </div>"}