{"job title": "Senior Software Engineer", "company": "Abacus Technology", "city state": "– US-VA-Alexandria", "rating": "3.2", "job description": "<div><div>\n<div>Abacus Technology is seeking a Senior Software Engineer to support a modernization effort for the Customs and Border Protection (CBP). This is a full-time position.</div>\n</div>\n</div>\n\n<br>Responsibilities<br>\n\n<div>\n<div>\n<div>Act in the role of Java Developer to build the backend and communications architecture within a complex application. Design and implement efficient integration APIs between system components. Develop Portal common framework code, develop enhancements and assign technical support team staff members to software development initiatives.</div>\n</div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div>10+ years experience with developing software in a team environment. Bachelor’s degree in a related field. Proficient understanding of code versioning tools. Experience with full stack environment including designing, development and unit testing. General understanding of Agile/Scrum development methodology. Expertise in object oriented development, languages and products including Java/J2EE and Oracle. Experience in Spring Board, Docker, Liquid Base, Angular, Containers, and Cloud Native Development. Experience with writing and setting up Ant or Maven to build, package and deploy application code to WebLogic, JBOSS, and Tomcat. Experience with the development, testing, and CM support tools including the IDE (E.g., Eclipse) Bamboo, Confluence, FishEye, SonarQube, JMeter, JProfiler, Load Runner, and Splunk desired. Expertise developing the framework, scripts and configurations for automated testing, CI, and automated deployment (Selenium, SoapUI, QTP/ALM) preferred. Experience using JIRA to manage, organize, and track the workflow for development and maintenance projects a plus. Organized, self-motivated and able to work under minimal supervision. Exhibit strong troubleshooting and problem resolution skills. Must have good communication skills, be a team player, and work in collaboration with team members. Able to work independently or as part of a team and interact professionally within all levels of an organization. Must be a US citizen.\n<br><br>\n<em><strong>Applicants selected will be subject to a U.S. government security investigation and must meet eligibility requirements for access to classified information.</strong></em>\n<br><br>\n<em><strong>EOE/M/F/Vet/Disabled</strong></em></div>\n</div>\n</div>\n<br>"}