{"job title": "Software Engineer II - Protocol Optimization", "company": "Akamai", "city state": "– Pasadena, United States", "rating": "3.7", "job description": "<div><div><div><div><div>Overview\n<br>\nAre you looking to join a talented engineering team to tackle Akamai’s next generation Media products? Are you a self-driven individual that can help Akamai develop technology used by many of the world’s largest media companies for large-scale distribution of video, music, and software? Do you have a passion for networking and being part of a team of like-minded individuals? If so, this position is for you!\n<br><br>\nAs a Software Engineer II you will:\n\n\n<ul>\n<li>Understanding Akamai’s network protocols, applications and how system operates. Optimizing and enhancing Akamai’s network platform performance.</li>\n<li>Aware of current technologies, designing and developing highly scalable and secure software from conception through deployment.</li>\n<li>Working with a team of experienced engineers on a variety of client and server-side software projects.</li>\n<li>Analyzing performance and stability issues on large-scale networks with Big Data skills.</li>\n</ul>\n\nAbout the Team\n<br>\nYou will be part of Akamai's Protocol Optimization engineering organization within the Media Division. The Media Division is responsible for the development of products related to the large-scale distribution of video, music, and software that are deployed by many of the largest media companies. This team supports customers with their over-the-top (OTT) video, live events, and streaming video optimization requirements through the operation of a global, highly-scalable platform for content ingestion and transformation, storage, and high-quality media delivery.<br>\n\n<div>Required Education and Experience\n\n\n<ul>\n<li>2 years of relevant experience and a Bachelors degree or</li>\n<li>Masters degree or PhD</li>\n</ul>\n\nBasic Qualifications\n\n\n<ul>\n<li>2+ years of work experience in engineering or related field.</li>\n<li>2+ years of work experience with network configuration and software development in a Linux environment.</li>\n<li>2+ years of work experience with at least one the following languages: C/C++, Bash, SQL, Perl, or Python.</li>\n<li>2+ years of experience with software control systems such as GIT, Perforce or SVN.</li>\n</ul>\n\n<strong>Desired Qualifications</strong>\n\n\n<ul>\n<li>Master's Degree in Computer Science or equivalent.</li>\n<li>Excellent verbal and written communication.</li>\n<li>Experience with SQL and/or Big Data analysis (Hadoop, Hive, etc). A statistical background is a plus.</li>\n<li>Familiarity with computer networks.</li>\n<li>C and Linux kernel programming experience.</li>\n<li>Self-motivated, communicates well, and learns quickly.</li></ul></div>\n\n\n\n</div>\n</div>\n </div>\n </div>\n</div>\n<br>"}