{"job title": "Software engineer", "company": "Amadeus IT Group SA", "city state": "– United States", "rating": "3.8", "job description": "If you could change one thing about travel, what would it be? At Amadeus, you can make that happen!\n<br>\nTravel makes the world a better place and we are fully dedicated to improving it and making it even more rewarding. We are one of the world's top 15 software companies: we provide technology solutions and services within the travel industry.\n<br>\nDo you have ideas on how to improve travel for everyone? Do you find the idea of working in a diverse, multicultural environment exciting? Are you ready to make an impact across the world? Great, then join us! Let's shape the future of travel together. #shapethefutureoftravel@Amadeus\n<br><br>\nI. Summary of the Role\n<br><br>\nAmadeus is where the innovative solutions of tomorrow's travel are being imagined, designed and developed.\n<br>\nAmadeus is the leading provider of IT solutions to the worldwide travel and tourism industry. We are seeking highly motivated and talented professionals who enjoy technical challenges and are eager to design and deliver IT solutions that impact the business, social, and human facets of the travel industry.\n<br>\nAt Amadeus, you will grow your career alongside some of the best technical minds in the world, delivering mission-critical high-availability systems and creating innovative features by tackling problems requiring massive computation, instant response time, highly effective interaction design and personalized user experience, and big data analytics. Our teams work regularly with colleagues of different cultures in international markets, creating solutions that shape the travel industry.\n<br><br>\nAs part of the Boston (Waltham) Ticketing Documents and Fulfillments team, you will be working in close relationship with the developers and product management and provide solutions to airlines, travel agents and beyond (airports) in the Americas. In particular, you will be at the heart of exciting projects aimed at distributing airlines and travel agencies data (flights, services) of via various models and protocols.\n<br>\nOur team is responsible for delivering in real time critical data to several big airlines on any updates done on a tickets.\n<br><br>\nAmadeus is the leading provider of IT solutions to the worldwide travel and tourism industry. We are seeking highly motivated and talented professionals who enjoy technical challenges and are eager to design and deliver IT solutions that impact the business, social, and human facets of the travel industry.\n<br><br>\nWe are looking for a software engineer to join our R&amp;D team! Our highly skilled development teams collaborate with our regional customers and with our global R&amp;D and Operations centers to define, design, and deliver high-quality, innovative solutions. As software engineer, you will be responsible of:\n\n\n<ul>\n<li>Software design, documentation, development, implementation and unit test of software modules for new functionality and enhancements</li>\n<li>Architecture design, innovation, technology forecasting</li>\n<li>Performance analysis, optimization, delivery of quality software</li>\n<li>Hardware capacity analysis if applicable</li>\n</ul>\n\nWe work in Agile and are looking for experienced developers able to propose technical and functional solutions and able to look at the big picture.\n<br><br>\nII. Main Responsibilities\n\n\n<ul>\n<li>Software design, documentation, development, implementation and unit test of software modules for new functionality and enhancements</li>\n<li>Delivery of quality software (unit tests, regression tests, performance tests, )</li>\n<li>Performance analysis, optimization</li>\n<li>Architecture design, innovation, technology forecasting</li>\n</ul>\n\nIII. Requirements\n<br><br>\n<strong>Education</strong>\n<br><br>\nMinimum requirement: BS/BA degree in computer science or related field or relevant experience\n<br><br>\nRelevant work experience\n<br><br>\n1-5 years' experience as software engineer on larger scale system or in the payment area.\n<br><br>\n<strong>Computing:</strong>\n\n\n<ul>\n<li>Unix/Linux</li>\n<li>Design Patterns</li>\n<li>C++/Object Oriented languages</li>\n<li>XML/Edifact/JSON/Protobuf</li>\n<li>SQL/Oracle/NoSQL Databases</li>\n<li>Webservices</li>\n<li>Distributed environments</li>\n<li>Python</li>\n</ul>\n\nLanguages: English\n<br><br>\n<strong>Specific knowledge:</strong>\n\n\n<ul>\n<li>Strong analytical, troubleshooting and problem solving skills, very detail oriented</li>\n<li>Ability to manage multiple tasks simultaneously, identify, resolve project issues quickly and effectively within a fast-paced environment</li>\n</ul>\n\n<strong>Other:</strong>\n\n\n<ul>\n<li>Enjoys working with a top-notch development team with a solid track record of innovation, quality, and timely deliverables</li>\n<li>Thrives in a professional, team-empowered environment</li>\n<li>Good written and oral communication skills</li>\n</ul>\n\nBusiness understanding\n<br><br>\nKnowledge of travel industry and/or related technologies is required\n<br><br>\nTo apply: https://amadeus.contactrh.com/jobs/9064/27736593"}