{"job title": "Data Engineer, Amazon Devices", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nThe Amazon Devices team designs and engineers high-profile consumer electronics, including the best-selling Kindle family of products. We have also produced groundbreaking devices like Fire tablets, Fire TV, Amazon Dash, and Amazon Echo. Our team is serious about great scalable design and redefining best practices with a cloud-based approach to scalability and automation. What will you help us create?<br><br>Amazon's Devices Technology team is looking for a talented Data Engineer with a strong background in ETL, Data warehousing and interest in linking data to key business trends. You will work closely with the business and technical teams to analyze many non-standard and unique business problems and use creative-problem solving to deliver actionable output. Your work will have a direct impact on the day-to-day decision making in the Amazon Devices Sales &amp; Operations Technology. <br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Bachelor’s degree or higher in an engineering or technical field such as Computer Science, Physics, Mathematics, Statistics, Engineering or similar.</li><li>5+ years of experience with data warehouse technical architectures, ETL/ ELT, reporting/analytic tools and, scripting.</li><li>3+ years of demonstrated quantitative and qualitative data experience with data modeling, ETL development, and the desire to create and maintain data warehouse systems.</li><li>Experience managing competing priorities simultaneously and driving projects to completion</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Advanced knowledge and expertise with Data modelling skills, Advanced SQL with Redshift, Oracle, MySQL, and Columnar Databases</li><li>Knowledge of OBIEE, QuickSight, Tableau or similar reporting tools<br></li><li>Experience with AWS services including S3, Lambda, EMR, RDS, Data-pipeline and other big data technologies</li><li>Experience with scripting (Python experience is a strong plus).</li><li>Proficient in the composition of Advanced SQL (analytical functions) and query performance tuning skills</li><li>Proven track record of identifying metric variances and delivering solutions to address the changes</li><li>Ability to interact, communicate, present and influence with both business and technical teams</li><li>A self-starter who loves data and who enjoys spotting the trends in it!</li></ul><br>Amazon.com is an Equal Opportunity-Affirmative Action Employer – Minority / Women / Disability / Veteran / Gender Identity / Sexual Orientation<br><br><br>#d2ctech tag\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}