{"job title": "Statistician (A/B Testing)", "company": "HomeAway", "city state": "– Austin, TX, United States", "rating": "3.7", "job description": "<strong>HomeAway</strong>, a world leader in the vacation rental industry, is the place to book beach houses, cabins, and condos with more than two million places to stay in 190 countries. The site makes it easy to find and book the perfect vacation rental for any getaway, often for less than the cost of traditional hotel accommodations. HomeAway is part of the Expedia Group family of brands.\n<br><br>\nAre you passionate about product innovation through testing? Does the word Bayesian excite you more than Frequentist? Do you love vacations and want to help a product oriented company continuously improve their platform to facilitate travel? If so, read on!\n<br><br>\nHomeAway is seeking an intellectually curious, collaborative and experienced data expert to join the Global Analytics &amp; Data Insights (ADI) team in Austin as the head statistician, data miner and leader of A/B testing standard methodologies. The ADI team fuels data-informed decisions, proactively seeks data-driven solutions to enhance web products and improve customer experience.\n<br><br>\n<strong>What is the opportunity?:</strong>\n<ul>\n<li>Function as the head statistician for the organization</li><li>Make sure a testing program has been developed to meet business objectives across the organization</li><li>Help the company identify and measure high value opportunities</li><li>Identify systematic biases within big data</li><li>Communicate statistical and machine learning modeling procedures and results to variety of partners (experts, non-experts, product managers, marketers and senior leaders)</li>\n</ul>\n<strong>What youll do?:</strong>\n<ul>\n<li>Build self-service tools and provide the training to empower individuals to make their own decisions on test design and analysis</li><li>Build complex statistical models that predict behavior and improve over time with additional data and insights.</li><li>Build methods and metrics to measure impact of testing on company performance</li><li>Use business and technical knowledge to influence a variety of partners on test design and outcome (validation of hypothesis, size and configuration of test variances, test length, winner acceptance criteria, validation of test results and calculation of annualized revenue impact)</li><li>Collaborate with the experimentation platform team and contribute to building and improvement of standardized testing platform</li><li>Check on the quality and use of information coming from experiments for business decisions</li><li>Provide general statistical consulting across the organization</li><li>Act as an authority in building models in languages such as R, Python, Julia etc.</li>\n</ul>\n<strong>Required qualifications:</strong>\n<ul>\n<li>Masters or PhD in Economics, Math, or Statistics</li><li>Masters must include 2+ years of experience in statistical consulting</li><li>Authority in Bayesian statistics and experimental design</li><li>Meaningful consulting experience especially with data that violate typical assumptions</li><li>Ability to clearly communicate technical information to non-technical audiences</li><li>Strong statistical modeling background</li><li>Strong statistical computing experience with R or Python</li>\n</ul>\n<strong>Preferred qualifications:</strong>\n<ul>\n<li>Experience with SQL or Apache Spark</li><li>Experience with time-series or spatial statistics</li><li>Experience building Shiny or Flask web apps</li><li>Experience writing quality code</li>\n</ul>\n<strong>Benefits &amp; Perks:</strong>\n<ul>\n<li>Competitive health and insurance benefits</li><li>Competitive salary</li><li>Annual target bonus or commission</li><li>Paid vacation and sick time</li><li>Vacation rental on a yearly basis (taxable benefit)</li><li>Employee Stock Purchase Program</li><li>Free snacks and beverages</li><li>Frequent company update talks with our leadership team</li><li>Free listing on HomeAway.com</li><li>Electronic, adjustable stand-up desk</li><li>Discounted Metro &amp; Rail pass</li><li>Casual dress</li>\n</ul>\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}