{"job title": "Firmware Engineer, Senior Staff", "company": "Inphi Corporation", "city state": "– Santa Clara, CA, United States", "rating": "3.7", "job description": "About Inphi\n<br><br>\nInphi Corporation, a high-speed analog semiconductor company, is the market leader in data transport and signal integrity solutions from fiber to memory. We address the bandwidth, capacity and power issues faced by cloud computing, mega data center, and 40G/100G network environments. By leveraging our core competencies in advanced analog circuit design, signal integrity, power management, packaging and process technologies, Inphi has taken a leadership role in the markets we serve. Founded in 2001, Inphi went through a successful initial public offering in November 2010 and is publicly traded on NYSE under the symbol “IPHI.”\n<br><br>\nOur innovative approaches have resulted in the company’s products being first to market in a number of key areas, including 40G/100G drivers and TiAs, as well as 100G Ethernet CMOS SERDES. We are seeking talented individuals to work on demanding technical challenges with the most outstanding group of collaborators in the industry. Join our team of experts and make a difference in an exciting career opportunity.\n<br><br>\nThe Senior Staff Firmware Engineer will be part of a team developing embedded firmware for systems and sub-systems. You will also collaborate with internal developers to help drive design of future ASICs to match system requirements. The Senior Staff Firmware Engineer will work alongside product marketing, test engineers and production engineers to deliver a robust product meeting the customers’ requirements.\n<br><br>\nJob Responsibilities:\n<ul>\n<li>Translate system requirements into functional designs</li><li>Gather specifications for ASICs (internal and external), and implement appropriate device drivers</li><li>Design and implement feed-forward and feed-back control systems</li><li>Design and implement system calibration mechanisms</li><li>Create documentation (functional specifications, design documents, test specifications)</li><li>Design and implement code unit testing processes</li><li>Design and execute automated regression testing systems</li><li>Drive specifications for ASIC development based on system level requirements</li>\n</ul>\nQualifications:\n<ul>\n<li>9+ years professional experience in embedded FW development</li><li>5+ years optical systems embedded FW experience</li><li>Experience with Coherent Optical Systems</li><li>Experience with CFP module development</li><li>BS in computer science, engineering or related discipline</li><li>Expert in C, python</li><li>Various microprocessor architectures (at least ARM)</li><li>RTOS, queuing, memory management, interrupt processing</li><li>Embedded device driver experience in communications protocols (including SPI, I2C, MDIO, UART)</li><li>Experience writing control firmware for: CDR, Flash/EEPROM, Laser Driver, TEC Controller</li><li>Experience designing digital control systems (e.g., PID controllers)</li><li>Understanding of parameter calibration techniques (e.g., interpolation, splines).</li><li>Hardware laboratory debugging capabilities (logic analyzer, oscilloscope)</li><li>Working knowledge of version control systems (e.g., git), build environments (Eclipse, gmake), and code auto-documenting systems (e.g., Doxygen)</li><li>Excellent team and communications skills</li><li>Excellent multitasking skills</li>\n</ul>\nPreferred Experience In\n<ul>\n<li>Digital signal processing (vector and matrix math, IIR/FIR filtering, FFT and related transforms)</li><li>Simulation (Matlab)</li> \n</ul>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}