{"job title": "Engineer, Information Security", "company": "ManTech", "city state": "– USA ARIZONA Sierra Vista", "rating": "3.5", "job description": "<div>Req ID 100543BR</div> <div> Business Title Engineer, Information Security</div> <div> Group MSS</div> <div> Location USA ARIZONA Sierra Vista</div> <div> Clearance Level Needed TS/SCI</div> <div> Category Technical Analysis</div> <div> Job Duties and Responsibilities<br><br>Become an integral part of a diverse team that leads the world in Mission, Cyber, and Intelligence Solutions. At ManTech International Corporation, you will help protect our national security while working on innovative projects that offer opportunities for advancement and providing optimal support to our primary Government customers.\n<br><br>\n<strong>General Responsibilities:</strong>\n<br><br>\n• Provides customer support in solving all phases of complex INFOSEC - related technical problems\n\n\n<ul>\n<li>Reviews and recommends INFOSEC solutions to customer problems based on an understanding of products/systems test results</li>\n<li>Conducts systems security analysis and implementation, system engineering, electrical design, design assurance, testing, software engineering, program design, configuration management, integration and testing of INFOSEC products and techniques</li>\n<li>Solutions are based on a firm understanding of government/industry policy, practices, procedures, and customer requirements</li>\n<li>Ensures INFOSEC solutions are fully compatible with or engineered into the customer’s network design</li>\n<li>Review and updated Information Security documentation, POAM, Scans, STIGs, SSAA, SRTM, etc.</li>\n<li>Implementation and operation of the system or component of a Government customer’s information systems.</li>\n<li>Ensures all information systems are functional and secure in operations and poly knowledge of IA policy, procedures and structure to develop, implement, and maintain a secure information system.</li>\n<li>Develop, implement, and integrate information security standards and procedures through the IA process as required.</li>\n<li>Write comprehensive security analysis reports including assessment-based findings, outcomes and enter this data into DoD Information Assurance Management databases for evaluation by Authorizing Officials to support the receipt of an Authority to Operate (ATO) for the systems</li>\n<li>Describes, tests and validates security measures active on security infrastructure devices for the protection of computer systems, networks and information system</li>\n<li>Identifies and defines system security requirements and correlates/documents them by analysis of organizational standard security operating procedures (SOP) and protocols</li>\n<li>Determines security violations and inefficiencies through security tests, evaluations and audits</li>\n<li>Prepares and completes action plans; defines production, quality, and military unit standards; resolves problems; completes security audits; identifies security and threat trends; determines system improvements; defines system security change requests</li>\n<li>Recommends improvements by assessing current security implementations and anticipating new security requirements.</li>\n<li>Maintains system security by implementing and maintaining security control\n<br><br>\n<strong>Mandatory Skills Requirements:</strong></li>\n<li>Must meet 8570 certification criteria</li>\n<li>JWICS, SIPR, and/or CENTRIXS accreditation experience and Risk Management Framework (RMF) knowledge</li>\n<li>Experience in heterogeneous computer networking technology and work in protocol and/or interface standards specification</li>\n<li>Experience analyzing and resolving INFOSEC technical problems</li>\n<li>Familiarity with network and information system security principles and test practices</li>\n<li>Familiarity with applicable NRO, IC, DoD policies, procedures and operating instructions related to IT, IA and IM</li>\n<li>Experience developing security accreditation/certification documentation, and creating and maintaining security policy and procedures</li>\n<li>Vast knowledge of Government security policies and familiarity with security-related technologies and auditing tools</li>\n<li>Experience providing security engineering analysis on a variety of information systems</li>\n<li>Advance skills at developing security accreditation/certification documentation, and creating and maintaining security policy and procedures</li>\n<li>Experience performing security certification engineering analysis, vulnerability assessments, and risk assessments</li>\n<li>Must be capable of designing and configuring security tools</li>\n<li>Experience developing test procedures, establishing test environments, executing security certification test/demonstrations/evaluations, documenting results, and developing reports, conclusions, and recommendations</li>\n<li>Must be capable of conceptualizing and implementing security systems and architectures</li>\n<li>Must be willing to travel up to 25 - 50%, both statewide and overseas\n<br><br>\n<strong>Other Skills Preferred:</strong></li>\n<li>Experience in DAMI certification policies and procedures</li></ul></div> <div> Qualifications Requires Bachelor's degree (in field mathematics, telecommunications, electrical engineering, computer engineering, computer science) or equivalent and five to seven years experience with information networks and the security aspects.</div> <div> Degrees Equivalent Experience/Education\n\n\nBachelor's Degree</div>\n<br>\n<div> Years of Experience 11-13 years w/High School Diploma\n<br>\n05-07 years w/Bachelors Degree\n<br>\n02-04 years w/Masters Degree</div>\n<br>\n<div> Position Type Full-Time</div> <div> Shift Day</div> <div> Overview ManTech International Corporation is comprised of approximately 7,300 talented employees who use advanced technology to help government and industry meet some of their greatest challenges around the world. We adhere to the simple, no-nonsense values on which ManTech was founded more than four decades ago, aligning squarely with the mission objectives of our customers. As our customer base continues to expand and diversify, we continue to diversify our workforce and solutions. Nearly half our employees have a military background, and approximately 70 percent hold a government security clearance. As a leading provider of innovative technology services and solutions for the nation's defense, security, health, space, and intelligence communities; we hold nearly 1,100 active contracts with more than 50 different government agencies.</div>"}