{"job title": "GW Network Engineering and Installation", "company": "ManTech", "city state": "– USA TEXAS San Antonio", "rating": "3.5", "job description": "<div>Req ID 99125BR</div> <div> Business Title GW Network Engineering and Installation San Antonio</div> <div> Group MCIS</div> <div> Location USA TEXAS San Antonio</div> <div> Clearance Level Needed TS/SCI</div> <div> Category Networks &amp; Telecommunication Services</div> <div> Job Duties and Responsibilities<br><br>At ManTech International Corporation, you'll help protect our national security while working on innovative projects that offer opportunities for advancement.\n<br><br>\nCurrently, ManTech is seeking a motivated, career and customer oriented Network Installation Technician to join our team in the San Antonio TX area to provide unparalleled support to our customer and to begin an exciting and rewarding career within ManTech.\n<br><br>\n<strong>Responsibilities include, but are not limited to:</strong>\n<br><br>\nProvides technical, operations, and training support to users of network installation, either by telephone or on site relative to micro hardware and software packages\n<br>\nPerforms hardware diagnostics and coordinates repairs\n<br>\nAssists in planning and designing PC support systems\n<br>\nActs as liaison for data transfer systems design and implementation\n<br>\nInstalls, tests, and documents applications software programs\n<br>\nDevelops reports and databases\n<br>\nProvides technical support for personal computers\n<br>\nPerforms other duties as assigned\n<br><br>\n<strong>Position Requirements:</strong>\n<br><br>\nBachelor's Degree or equivalent\n<br>\nTwo or more years of related experience in Land Mobile Radio\n<br>\nExperience providing technical support to users of company's personal computers\n<br>\nExperience pulling cables and installing PC's\n<br>\nShould have some of the following - End User Framework Service Delivery, Land Mobile Radio Service, Video Teleconference Service, Hardware Desktop Break Fix, Desktop Phone, Thin Client Break Fix, Time and Frequency Distribution, Cell Phone - Unclass Break Fix, Access Control\n<br><br>\n<strong>Security Requirements:</strong>\n<br><br>\nMust possess an active TS/SCI to be considered and must obtain and maintain a poly.</div> <div> Qualifications Requires Bachelor’s degree or equivalent, and two to four years of related experience.</div> <div> Degrees Equivalent Experience/Education\n<br>\nBachelor's Degree</div>\n<br>\n<div> Years of Experience 02-04 years w/Bachelors Degree</div> <div> Position Type Full-Time</div> <div> Shift Day</div> <div> Overview ManTech International Corporation is comprised of approximately 7,300 talented employees who use advanced technology to help government and industry meet some of their greatest challenges around the world. We adhere to the simple, no-nonsense values on which ManTech was founded more than four decades ago, aligning squarely with the mission objectives of our customers. As our customer base continues to expand and diversify, we continue to diversify our workforce and solutions. Nearly half our employees have a military background, and approximately 70 percent hold a government security clearance. As a leading provider of innovative technology services and solutions for the nation's defense, security, health, space, and intelligence communities; we hold nearly 1,100 active contracts with more than 50 different government agencies.</div>"}