{"job title": "Lead Cyber Threat Engineer", "company": "MITRE", "city state": "– &amp;#128269; Chantilly, Virginia", "rating": "3.2", "job description": "<div><div><div><div><div>Do you believe in the missions of Federal Law Enforcement and the Intelligence Community? Can you work in a demanding Task Force environment? Are you interested in being a member of a team solving complex programmatic and technical issues? Then look no further! As a Cyber Threat Engineer for MITRE, you will provide support to a variety of programs related to Law Enforcement, National Intelligence, and Government Information Systems. You will work on some of the most challenging technical and programmatic issues faced by our sponsor. You will serve as a trusted Technical Subject Matter Expert working within the sponsor’s cyber-focused organization. The job is not routine – there are always new challenges and you will help the sponsor implement those with the greatest impact for the nation. If this sounds motivating to you, please submit your application for this position.\n<br>\n\n<br>\nThis position is located on-site with the sponsor in Chantilly, VA. (FJ07-M)\n<br>\n<strong>Key Functions:</strong>\n<br>\nKey functions include\n\n\n<ul>\n<li>analyzing cyber threat data and intrusion activity to develop tools to aid cyber investigations;</li>\n<li>working closely with cyber threat intelligence analysts, intrusion analysts, and incident responders to develop unique ways to present data that helps them effectively and efficiently meet their mission objectives; and</li>\n<li>development of prototypes, interfaces, or other solutions in support of sponsor initiatives.</li>\n<li>ability to communicate with both technical and non-technical individuals to shape requirements and identify the best solution</li>\n<br><br>\n</ul>\n\n<strong></strong><div><strong>\nRequired Qualifications:</strong>\n\n\n<ul>\n<li>Solid foundation in performing cyber threat and cyber intrusion analysis leveraging security tools, such as packet/protocol analyzers, password crackers, and packet sniffers</li>\n<li>Experience working in a heterogeneous operating environment (i.e., one comprised of Linux, Unix, Mac, and Windows operating systems)</li>\n<li>Passion for developing solutions to support investigations and cyber intrusions affecting national security</li>\n<li>Broad knowledge of the Intelligence Community and each agency's roles and authorities.</li>\n<li>Knowledge of the different needs and requirements that drive intelligence, law enforcement, and operational missions</li>\n<li>Experience translating analyst needs in to technical requirements</li>\n<li>Preference will be given to candidates with cyber domain knowledge and an understanding of the national cyber landscape</li>\n<li>Ability to perform hands-on development, test and evaluation, and demonstration of proof-of-concept and prototype systems</li>\n<li>Strong understanding of network traffic analysis</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Ability to develop signatures to detect malware/intrusion activity</li>\n<li>Experience with collaborative development environments</li>\n<li>Experience with law enforcement investigative activities, especially those related to cyber intrusions</li>\n<li>Experience regularly briefing and advising senior executives</li>\n<li>Demonstrated proficiency in one or more scripting languages (e.g., Python, Perl, shell)</li>\n<li>Ability to work closely with, and help facilitate consensus across, a wide range of leaders at the GS-15 and SES levels from multiple agencies.Multi-agency background or interagency experience a plus.</li>\n</ul>\n\n<strong>Minimum Qualifications:</strong>\n<br>\nBS and 8 years related experience.</div>\n </div>\n</div>\n </div>\n </div>\n</div>\n<br>"}