{"job title": "Lead Cyber Operations Engineer", "company": "MITRE", "city state": "– Bedford, Massachusetts", "rating": "3.2", "job description": "<div><div><div><div><div>Why choose between doing meaningful work and having a fulfilling life? At MITRE, you can have both. That's because MITRE people are committed to tackling our nation's toughest challenges—and we're committed to the long-term well-being of our employees. MITRE is different from most technology companies. We are a not-for-profit corporation chartered to work for the public interest, with no commercial conflicts to influence what we do. The R&amp;D centers we operate for the government create lasting impact in fields as diverse as cybersecurity, healthcare, aviation, defense, and enterprise transformation. We're making a difference every day—working for a safer, healthier, and more secure nation and world. Our workplace reflects our values. We offer competitive benefits, exceptional professional development opportunities, and a culture of innovation that embraces diversity, inclusion, flexibility, collaboration, and career growth. If this sounds like the choice you want to make, then choose MITRE—and make a difference with us.<br><div><br></div><div><p></p><p></p><p>MITRE's Cyber Infrastructure Department is seeking a Lead Cyber Operations Engineer to support United States Air Force (AF) and Joint Cyber missions. This position will involve working with cyber domain stakeholders to guide strategic and tactical efforts that enhance AF/DoD missions. Additionally, the successful candidate will influence the deployment of cyber resilient systems.</p><p></p><p><br></p><p></p><p></p><p><b>Key Functions:</b></p><p></p><ul><li>Guide the acquisition of capabilities that augment ongoing Defensive Cyber Operations (DCO).</li><li>Team with AF operators to rapidly develop and deliver Situational Awareness (SA) capabilities to defend both missions and weapon systems and enable integration into Multi-Domain Command and Control (MDC2).</li><li>Architect the automation of cyber defense actions with the goal of improving the ability to fight “at the speed of cyber”, leveraging existing cyber weapon system (ACD, AFINC, and CSCS) defenses as well as emerging advanced capabilities.</li><li>Define dynamic techniques that rearrange the cyber battle space based on indicators and warnings of adversary activities.</li><li>Develop roadmaps to implement cyber resilient techniques that subvert adversary attack vectors while allowing reliable delivery of C2, intel, and logistics data to the warfighter.</li></ul><p></p></div>\n \n \n \n\n \n \n \n \n \n <div>\n <p><b>Desired Skills:</b></p><p></p><ul><li>An understanding\nof advanced cyber threats targeting enterprises, along with the tools, tactics,\nand procedures used by those threats</li><li>Knowledge\nof Computer Network Exploitation, Computer Network Attack and Computer Network\nDefense tools and techniques</li><li>Experience with the use of machine learning to\ndetect malicious cyber threat behavior</li><li>Ability to obtain and maintain a security\nclearance</li><li>Familiarity with NIST SP\n800-37 and NIST SP 800-53 r4</li><li>OSCP, CEH, GCIH, CISSP or\nequivalent certification.</li></ul><p></p><p></p><p> </p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n</p><p><b>Minimum Qualifications:</b><br></p><ul><li>BS and 8 years of related experience. </li></ul><p></p><br>\n </div>\n \n \n\n \n <div>\n \n </div>\n \n\n \n </div>\n </div>\n </div>\n\n \n </div>\n\t</div>"}