{"job title": "Data Engineer", "company": "Narvar", "city state": "– San Francisco, CA", "rating": "4.0", "job description": "More than 60% of Americans have interacted with Narvar's consumer facing SaaS platform, generating billions of events per month. More than 400 leading retailers worldwideincluding Walmart, Home Depot, Nordstrom, and Sephora use Narvar's shipment tracking, returns, customer care, bidirectional multi-channel communication, and analytics products to transform their customers' post-purchase experiences. This means Narvar handles transactional data for a huge percentage of e-commerce. We're also integrated with most all delivery carriers in North America (and ever-growing worldwide; we're the largest consumer of UPS's API by quite a margin), so we observe the majority of consumer-oriented package flows.\n<br><br>\nIf you're interested in marshaling this diversity and volume of data to power the most important data platform in commerce technology, Narvar Data Engineering might be the place for you! We're built entirely on cloud infrastructure, and have a mix of managed services (redshift, S3, RDS, etc.), self-deployed open source systems (airflow, kafka, etc.), and house-built systems. Data is at the core of Narvar's competitive advantage, so the work we do has a large impact across the company, for our business partners, and in the lives of our end users.<br><br><strong>Qualifications</strong>\n\n\n<ul>\n<li>7-10 years of industry experience in data engineering or data intensive software development</li>\n<li>Complex ETL experience in a business environment with large-scale, complex datasets, and knowledge of data warehousing concepts at consumer scale</li>\n<li>An expert level understanding of relational databases (columnar and row-based), and NoSQL including dynamo, Cassandra or similar</li>\n<li>Experience with processing data at scale streaming and batch with e.g. pyspark and lambda functions</li>\n<li>Expert SQL skills and sound consumer-scale data architecture judgment</li>\n<li>Scripting experience in python and bash shell required</li>\n<li>Excellent attention to detail and understanding of error handling and data validation</li>\n<li>Experience working in AWS or other cloud-based environments (on-premises great if you've gotten your hands dirty with deployment and execution)</li>\n<li>Capable of planning and executing on both short-term and long-term goals individually and with the team</li>\n<li>A Bachelor's Degree in CS, or a related field</li>\n</ul>\n\n<strong>Bonus Points</strong>\n\n\n<ul>\n<li>An understanding kafka, kinesis, and/or pub-sub queues a plus</li>\n<li>Understanding of Machine Learning a plus</li>\n</ul>"}