{"job title": "Data Engineer", "company": "Rose International", "city state": "– Menlo Park, CA", "rating": "4.4", "job description": "<div>Position Title: Data Engineer</div>\n<br>\n<div>Position Number: 295305</div>\n<br>\n<div>Location: Menlo Park, CA</div><br>\n\n<div><strong>Desired Skill Set:</strong></div><div>Python, Java, SQL, MySQL</div><br>\n\n<div><strong>Position Description:</strong></div><div> **C2C and STEM-OPT are not available**\n\n\n<ul>\n<li>*Only U.S. Citizens and those authorized to work in the U.S. can be considered as W2 candidates.**</li>\n</ul>\n\nTitle: Data Engineer III\n<br>\nLocation: Menlo Park , CA 94025\n<br>\nDuration: 6 months\n<br><br>\n<strong>Duties:</strong>\n\n\n<ul>\n<li>Apply proven expertise and build high-performance, scalable data warehouse application.</li>\n<li>Securely source external data from numerous global partners.</li>\n<li>Intelligently design data models for optimal storage and retrieval.</li>\n<li>Deploy inclusive data quality checks to ensure high quality of data.</li>\n<li>Optimize existing pipelines and implement new ones, maintenance of all domain-related data pipelines.</li>\n<li>Ownership of the end-to-end data engineering component of the solution.</li>\n<li>Collaboration with the program’s SMEs, data scientists.</li>\n</ul>\n\nSkills: proficiency in LAMP and the Big Data stack environments (Hadoop, Map Reduce, Hive).\n\n\n<ul>\n<li>competence with relational databases (Oracle, MySQL, Vertica).</li>\n<li>experience working with enterprise DE tools (Informatica), ability to learn in-house DE tools.</li>\n<li>coding and scripting experience with Python, Java, PHP, SQL, CLI.</li>\n</ul>\n\n<strong>Education:</strong>\n<br>\nBS/MS in Computer Science or a related technical field.\n<br><br>\n<strong>Languages:</strong>\n<br>\nEnglish Read Write Speak.</div><br>\n\n<div> \n<div>\nSend me a reminder to complete this application</div>\n </div><br>\n\n<div>\n<strong>Rose International is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender (expression or identity), national origin, arrest and conviction records, disability, veteran status or any other characteristic protected by law. Positions located in San Francisco and Los Angeles, California will be administered in accordance with their respective Fair Chance Ordinances.\n<br><br>\nRose International has an official agreement (ID #132522), effective June 30, 2008, with the U.S. Department of Homeland Security, U.S. Citizenship and Immigration Services, Employment Verification Program (E-Verify).\n<br><br>\n(Posting required by OCGA 13/10-91.)</strong></div>\n<br>"}