{"job title": "Sr. HVAC Mechanical Engineer (Mechanical Engineering)", "company": "Syska Hennessy", "city state": "– Washington D.C.", "rating": "3.7", "job description": "<div><div> <p>Watch your engineering work come to life in landmark projects around the world when you partner with Syska Hennessy Group! As a global leader in consulting, engineering, and commissioning services, we specialize in highly technical buildings and the systems that bring them to life. We are seeking an experienced <strong>HVAC Mechanical Engineer</strong> to join our <strong>Washington D.C.</strong> office. This senior role is an exceptional opportunity! Not only will you work on challenging projects, but you will also have opportunities to provide high level consulting services. </p>\n\n<p>Our dynamic work environment provides the optimal setting to take your engineering career to the next level. From our supportive culture, diverse workforce, and competitive compensation, to our flexible work schedules and fun social events, it’s everything you’ll need for an exciting, challenging, and rewarding career. Apply today! </p>\n\n<div>\n<p><strong>Sr. HVAC Mechanical Engineer (Mechanical Engineering)</strong></p>\n</div>\n\n<p><strong>Job Responsibilities</strong></p>\n\n<p>As a Senior HVAC Mechanical Engineer, you will provide consulting services throughout the project lifecycle, helping to plan, design, build, and operate technically superior facilities. This involves working directly with owners to provide technical expertise and guidance on assessments, feasibility studies, cost benefit analysis, and project programming. You will be responsible for leading HVAC designs on projects, preparing reports and specifications, and providing a very high level of technical leadership.</p>\n\n<p>Mechanical Engineer responsibilities:</p>\n\n<ul>\n<li>Representing Firm in all interactions with clients, contractors, architects, and other project team members</li>\n<li>Performing calculations, equipment selection, equipment specification, system design, system layout, field investigation, and construction administration</li>\n<li>Providing consulting engineering services, including preparation of due diligence reports, gap analyses, and feasibility reports</li>\n<li>Producing drawings consistent with client requirements and standards</li>\n<li>Conducting due diligence reports that comply with group and company standards and procedures</li>\n<li>Establishing design standards, specifications, and criteria for projects</li>\n<li>Taking responsible charge for the project for your discipline, addressing any E &amp; O issues</li>\n<li>Conducting business development activities and participating in various trade organizations and preparing presentations</li>\n<li>Establishing project budgets and schedules</li>\n<li>Participating in QA/QC process of completed work by staff</li>\n<li>Performing staff resource management and review</li>\n<li>Assuming responsible charge for the overall economic wellbeing of assigned projects</li>\n</ul>\n\n<div>\n<p><strong>Sr. HVAC Mechanical Engineer (Mechanical Engineering)</strong></p>\n</div>\n\n<p><strong>Job Requirements</strong></p>\n\n<p>This senior position requires Commercial, Institutional, and Large Infrastructure Design experience, with data center, or healthcare design and consulting experience being a huge plus. If you are a highly skilled Mechanical Engineer with strong leadership skills, good client facing skills, and the ability to mentor and train our junior staff in the DC office, we want to hear from you! </p>\n\n<p>Mechanical Engineer requirements:</p>\n\n<ul>\n<li>Bachelor’s degree from accredited university in Mechanical discipline </li>\n<li>10-15+ years of relevant experience in mechanical engineering </li>\n<li>Commercial, Institutional, and Large Infrastructure Design experience</li>\n<li>Proficiency with the latest version of AutoCAD </li>\n<li>P.E., <em>strongly preferred</em> (E.I.T. will be accepted in lieu of P.E. for exceptional candidates) </li>\n<li>LEED accreditation, <em>highly preferred</em></li>\n<li>Healthcare, government and data center design experience,<em> a huge plus</em></li>\n<li>REVIT experience,<em> a plus </em></li>\n</ul>\n\n<div>\n<p><strong>Sr. HVAC Mechanical Engineer (Mechanical Engineering)</strong></p>\n</div>\n\n<p><strong>Benefits</strong></p>\n\n<p>As a Mechanical Engineer with Syska Hennessy, you will be part of a global firm with an amazing history! We are committed to being the best, to advancing engineering design practice, and to supporting our clients with integrity. To make all of that happen, we rely on the talent, drive, enthusiasm, and the total job satisfaction of the great people who work here. </p>\n\n<p>As a member of our highly collaborative team, we provide you with a flexible benefits package that reflects our respect for your workplace contributions, professional goals, and personal priorities. The personal benefits program at Syska Hennessy includes:</p>\n\n<ul>\n<li>Medical, Dental, Vision insurance</li>\n<li>401(k) retirement plan</li>\n<li>Roth 401(k) Option</li>\n<li>Individual and Dependent Life Insurance</li>\n<li>Short- and Long-Term Disability</li>\n<li>Health wellness programs including flu shots, and biometric screenings</li>\n<li>Training and professional development courses</li>\n<li>Professional development incentive bonuses</li>\n<li>Opportunities for community outreach through internal networks</li>\n<li>Tuition Reimbursement</li>\n<li>Training and professional development programs and incentives</li>\n<li>A generous Paid Time Off Program (PTO)</li>\n<li>Transit/parking program</li>\n<li>Monthly business phone stipend </li>\n<li>Flexible summer work schedules</li>\n<li>Much More!</li>\n</ul>\n\n<p><strong>Syska Hennessy – Creating Exceptional Environments</strong></p>\n\n<p><strong><em>Let’s Work Together!</em></strong></p>\n\n<p> </p> </div></div><div><div> <br></div></div>"}