{"job title": "Senior Software Engineer - Android", "company": "The Meet Group", "city state": "– Philadelphia, PA", "rating": "2.6", "job description": "<div>As a Sr. Software Engineer - Android at The Meet Group, you will be part of a team that creates mobile applications for one of the fastest growing social networks with over 90 million users internationally. Our Android implementation is fully native and focuses on performance, usability, and code quality.</div><br>\n<div>If you have Android programming experience and are passionate about building great products, we want to talk with you! We are very interested in what you have already created, so please include links to applications you have developed and published. If you have experience with Social Networking, thats a plus but we wont hold it against you if you dont. Take a look at our app in the Play Store see what we are all about!</div>Required Skills and Relevant Work Experiences\n\n<ul>\n<li>Experience creating and publishing successful app(s) to a prominent Android app store (such as Google Play Store or Amazon App Store)</li><li>Thorough understanding of core Android concepts</li><li>Experience building apps compatible with Android OS versions 14.1 (Jelly Bean) through 6.0 (Marshmallow)</li><li>Experience optimizing, refactoring, and debugging views and layout hierarchies</li><li>Experience in creating UIs using custom themes, styles, attributes, and resources</li><li>Understanding of RESTful API interaction and JSON</li><li>Git or other source control management</li><li>Excellent communication and documentation skills</li><li>Ability to work iteratively with Product, Design, Back-End and QA teams</li><li>Ability to discuss and debate, as well as give and take support and challenges in a team environment</li><li>Working understanding of agile development process</li><li>B.S. or M.S. in Computer Science, equivalent work experience, or just be really awesome</li> \n</ul>\n\n<div><strong>About The Meet Group</strong></div><br>\n<div>The Meet Group, Inc. | NASDAQ: MEET | As the leading social network for meeting new people in the US, and the public market leader for social discovery, our mission is to improve our members lives by introducing them to fun and interesting people who share their passions, interests, and ideals. The Meet Group's products include MeetMe, Skout, Tagged, and hi5. The Meet Group is based in New Hope, PA with offices in Philadelphia and San Francisco.</div><br>\n<div>The Meet Group is an equal opportunity employer. We value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, or marital, veteran, or disability status.</div><br>\n<div>#052118 ifwe meetme skout tagged hi5 ind123</div>"}