{"job title": "Data Engineer", "company": "Trialspark", "city state": "– New York, NY", "rating": "5.0", "job description": "<strong>Background</strong><br><br>Before new medical treatments can be administered to the public, they must demonstrate safety and efficacy in a clinical trial. These trials protect consumers from ineffective and dangerous products, but the clinical trial process also presents a tremendous bottleneck in delivering life-saving treatments to patients.\n<br><br>\nA typical trial involves coordinating between numerous parties and data formats to gather, store, analyse, and audit clinical data. Mistakes and delays are common, and fewer than 10% of trials finish on time. At Trialspark, we are reimagining the clinical trial process from first principles, and building the technology platform for the trial of the future.\n<br><br>\nOur reach is growing rapidly, and building a world class data engineering team is core to achieving our mission.<br><br><strong>Job Description</strong><br><br>As a data engineer at Trialspark, you will take ownership for building infrastructure to support data needs across the company. You will have exposure to and impact on operations, product, and data problems that are critical to Trialspark's mission.\n<br><br>\nCore responsibilities will include building data infrastructure, revamping ETL processes, aggregating and structuring data, integrating both internal and external data sources, monitoring the performance and quality of data feeds (taking a lead role in any necessary infrastructure changes), defining data retention policies and building out real time feeds to support model development and implementation. You will also design and automate necessary processes to maintain availability and accuracy in data systems.\n<br><br>\nYour work will impact and drive many of the following projects:\n\n<ul>\n<li>A state-of-the-art clinical data capture platform to power end-to-end trials</li>\n<li>Growth tools to support and guide our trial site expansion</li>\n<li>Medical protocol data ingestion and management tool to support a growing number of trials</li>\n<li>Mobile and web applications that provide a seamless clinical trial experience for our patients</li>\n</ul>\n\n<strong>What we're looking for</strong>\n\n\n<ul>\n<li>4+ years of experience work in a platform, data, or backend engineering role</li>\n<li>Experience with dynamic programming languages, relational databases, and distributed systems. Proficiency in Python and SQL.</li>\n<li>Experience in building data infrastructure from scratch, including ETL pipelines. Familiarity with Airflow, Luigi or similar scheduling platforms a plus.</li>\n<li>Experience in designing and maintaining data warehouses. You should know the difference between OLTP and OLAP.</li> \n\n<li>Ability to communicate effectively and work cross functionally to understand data requirements</li>\n<li>Passion for our mission and alignment with our values</li>\n<li>Scrappy, get-things-done mentality</li>\n</ul>\nYou will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status."}