{"job title": "Senior Design Engineer", "company": "Xilinx", "city state": "– San Jose, CA", "rating": "3.8", "job description": "<strong>Description</strong>\n<br><br>\nXilinx develops highly flexible and adaptive processing platforms that enable rapid innovation across a variety of technologies - from the endpoint to the edge to the cloud. Xilinx is the inventor of the FPGA, hardware programmable SoCs and the ACAP (Adaptive Compute Acceleration Platform), designed to deliver the most dynamic processor technology in the industry and enable the adaptable, intelligent and connected world of the future in a multitude of markets including Data Center (Compute, Storage and Networking); Wireless/5G and Wired Communications; Automotive/ADAS; Emulation &amp; Prototyping; Aerospace &amp; Defense; Industrial Scientific &amp; Medical, and others. Xilinx's core strengths simultaneously address major industry trends including the explosion of data, heterogeneous computing after Moore's Law, and the dawn of artificial intelligence (AI).\n<br><br>\nOur global team is growing and we are looking for bold, collaborative and creative people to help us lead the industry\n<br>\nOur global team is growing and we are looking for bold, collaborative and creative people to help us lead the industry\n<br>\ntransformation to build an adaptable intelligent world. We believe that by embracing diverse ideas, striving for excellence in all that we do, and working together as a unified team, we can accomplish anything. Come do your best work and live your best life as part of the ONEXILINX team!\n<br>\n<strong>Job Description</strong>\n<br>\nThis exciting position in the Xilinx Data Center and IP Solutions Engineering group as a Senior Design Engineer will provide the individual with an opportunity to demonstrate strong technical skills across all aspects of the flow from defining the architecture to customer delivery of the IP. As a Senior Engineer you will be expected to participate in many aspects of technical projects including: new product exploration working closely with Product marketing managers and end customers, IP Architectural definition\n<br>\nand road map creation, Micro-Architecture development for individual IPs or IP subsystems, working with cross-functional IP/software teams from front-end development through Productization. This position requires an individual to be creative, team-oriented, technology savvy, able to work with multi-site\n<br>\ncross-functional teams, comfortable and willing to directly work with customers on any issues and driven to produce results.\n<br>\nEssential Functions\n<br>\nA major part of your responsibility will be to participate in technical role in all phases of the product development cycle from new product exploration, architecture through implementation, prototyping, validation, productization and\n<br>\nsupport including but not limited to Architecture, design, documentation, prototyping for IPs .Working on the specification, development, validation, and support for products through the product life.Assist engineering management and marketing to specify future IP products and future product enhancements\n<br>\nDevelop comprehensive testing plans including Compliance and Interop testing\n<br>\nCritically Review and provide feedback on the Design Implementations and Verification plans.Coordinate IP block delivery with software and IC design teams\n<br><br>\nMinimum of a BS with 5+ years or MS with 3+ years or PhD\n<br>\nProgramming languages: Verilog/VHDL/SV and C/C++\n<br>\nScripting: TCL and Perl/Python\n<br>\nExperience with simulation tools like Mentor/IUS/VCS\n<br>\nArchitectural/design experience in PCIe/Serial Protocols/Serdes/Bus Interfaces (AXI) desired\n<br>\nExperience in Firmware/Device driver is a plus\n<br>\nExperience with FPGA based prototyping and validation\n<br>\nExperience with post-silicon validation, debug, performance and power\n<br>\ncharacterization, high speed interface characterization and compliance/interoperability\n<br>\nDevelop scripts to automate regression tests and execute test plans"}