{"job title": "Data Scientist", "company": "Athena Global Solutions, LLC.", "city state": "– Vienna, VA", "rating": "NA", "job description": "MULTIPLE LOCATIONS<br> <br> SECURITY CLEARANCE:<br> <br> * Must be a U.S. Citizen with either a DoD Secret or Top Secret (TS) security clearance, TS with SCI access preferred.<br> <br> POSITION SUMMARY:<br> <br> As a key member of the team, you will work with engineers to analyze and interpret data, develop metrics to measure results and integrate new methodologies into existing systems. Your key role is to help engineers, analysts, and decision maker gain insight from massive data sets.<br> <br> ESSENTIAL JOB DUTIES AND RESPONSIBILITIES:<br> <br> * You will use a variety of disciplines and skills based a robust background in science, technology, engineering, or mathematics (STEM) related fields.<br> <br> * Your skills in computational social science, data analytics, economics, engineering, geospatial analysis, and statistics will enable you to explore a variety of data to derive information and drive actions.<br> <br> * We are looking for professionals with real-world experience in advanced data analytics.<br> <br> * You will work in dynamic environments with diverse team expertise.<br> <br> * Your advanced degree in a data science equivalent field or sub-field will enable you to quickly integrate into a variety of teams to accelerate data-enabled decision-making, visualization of large data trends and patterns, and data rich problem-solving.<br> <br> * We need experienced designers who can quickly and successfully complete projects with large or incomplete data. You will use these skills to produce written, verbal, and computer-aided presentations.<br> <br> EDUCATION/EXPERIENCE/SPECIALIZED KNOWLEDGE AND COMPETENCY REQUIREMENTS:<br> <br> * Master's Degree in Computer Science, Statistics, Applied Math, or related field.<br> <br> * 7+ years' practical experience with SAS, ETL, data processing, database programming and data analytics.<br> <br> * Extensive background in data mining and statistical analysis.<br> <br> * Able to understand various data structures and common methods in data transformation.<br> <br> * Excellent pattern recognition and predictive modeling skills.<br> <br> * Experience with programming languages such as Java/Python.<br> <br> * Critical thinking.<br> <br> PHYSICAL REQUIREMENTS/EFFORT:<br> <br> * May require long periods of sitting at a desk, working on a computer.<br> <br> WORKING CONDITIONS:<br> <br> * Office environment.<br> <br> * Flexibility to work evenings and weekends as needed.<p>SDL2017</p>"}