{"job title": "Data Scientist", "company": "Avid Technology Professionals", "city state": "– Reston, VA", "rating": "3.2", "job description": "Open\n\n\n<ul>\n<li>Demonstrated experience using analytic methods and methodological tools.</li>\n<li>Demonstrated experience identifying and leveraging algorithmic models and manipulating structured and unstructured data to answer intelligence questions.</li>\n<li>Demonstrated experience translating complex, technical findings into an easily understood narrative (i.e., tell a story with the data) in graphical, verbal, and/or written forms.</li>\n<li>Demonstrated experience using programming languages such as Python, R, or Javascript to develop, test, and deploy algorithms in an analytic production environment.</li>\n</ul>\n\n<strong>OPTIONAL SKILLS: 10/5/18</strong>\n<br><br>\nAbout Avid Technology Professionals\n<br><br>\nAvid Technology Professionals, LLC (ATP) is a premiere provider of software and systems engineering, and acquisition program management services for the community. ATP is actively seeking to pursue contract opportunities with other departments and agencies in the federal government, in state governments, and in the commercial sectors. Delivered by seasoned experts in the IT field, ATP solutions adeptly address the IT concerns manifesting in both the federal and commercial sectors.\n<br><br>\nEmployee Benefits\n<br><br>\n<strong>The ATP Employee Benefits package includes:</strong>\n\n\n<ul>\n<li>A Supportive and Equitable Working Environment that is both Stimulating and Challenging</li>\n<li>Competitive Hourly Salary</li>\n<li>Unique Employee Success Sharing Program that allows ATP employees to Share in Company's Successes</li>\n<li>Automatic Approved Overtime (as long as contract permits)</li>\n<li>Retirement Pay (401K); 100% company paid, immediately vested with Profit-Sharing Component</li>\n<li>Company Medical Coverage Plans - HMO, Open Access, PPO plans</li>\n<li>Company Dental Plan - widely accepted, comprehensive, and flexible</li>\n<li>Progressive Overtime Policy</li>\n<li>Flexible Spending Account benefit</li>\n<li>Lucrative Referral Bonus Policy</li>\n<li>Holiday Scheduling that Coincides with Government Holidays</li>\n<li>Robust Professional Expenses&amp;Training Program</li>\n<li>Computer Allowance</li>\n<li>Internet Allowance</li>\n<li>Short and Long Term Disability</li>\n<li>Life Insurance</li>\n</ul>\n\nOn TWITTER\n<br><br>\nhttp://ja.twitter.com/AvidTecPros"}