{"job title": "Data Scientist", "company": "Cognizant Technology Solutions", "city state": "– Las Vegas, NV", "rating": "3.6", "job description": "Sr. Functional Architect\n<br><br>\n<strong>Qualification:</strong>\n<br><br>\nBE/ B Tech, MCA, MS, MBA\n<br><br>\n<strong>Responsibility:</strong>\n<br><br>\n<strong>Business Planning:</strong>\n\n\n<ul>\n<li>Bring knowledge, understand trends in existing engagements.</li>\n<li>evaluate options in defined functional area (solution architecture domain/technology/product/ infrastructure) and contribute to the annual business planning process.</li>\n<li>Support activities related to strategic choices in defined scenarios (related to domain/technology/product/infrastructure) and provide inputs on enhancing/rationalization of existing capabilities and services.</li>\n</ul>\n\n<strong>Solution Conceptualization:</strong>\n\n\n<ul>\n<li>Keep track of industry trends and build/ Provide support in business cases for new solutions in AIM for new solution development in defined functional areas (domain/technology/product/ infrastructure).</li>\n<li>Review/Lead new solution offerings development by identifying use cases, participate in process blueprinting and walkthrough.</li>\n<li>Present the business case to concerned stakeholders/business leadership and seek approval.</li>\n<li>Serve as POC for both client and delivery team assuring projects are effectively governed in terms of solution adequacy.</li>\n<li>take corrective steps to prevent client escalation.</li>\n</ul>\n\n<strong>Solution Definition:</strong>\n\n\n<ul>\n<li>Understand the customer domain and his/ her requirements.</li>\n<li>Interact with Business Analysts / Senior Business analysts for requirement analysis.</li>\n<li>Analyze CTS capabilities from a domain perspective and identify the operational nuances in meeting customer's requirements.</li>\n<li>Develop tools and templates.</li>\n<li>Share analysis inputs with other architects.</li>\n<li>Recommend best solution.</li>\n<li>Interact with customer and provide support in finalizing the scope.</li>\n<li>Clarify queries other architects/teams have on the proposed solution.</li>\n<li>Monitor progress on project delivery on an ongoing basis and provide support as and when required.</li>\n<li>Execute maturity assessment and other process improvement initiatives.</li>\n<li>Execute CBA and create business case.</li>\n<li>Create business process architecture and related process flows.</li>\n<li>Create Process Hierarchies and align KPIs to different process levels.</li>\n<li>Define Business and Operations KPIs and align with strategic and tactical objectives of engagement.</li>\n<li>Apply BRM on specific customer problem areas and devise BRM enabled solutions.</li>\n</ul>\n\n<strong>Project Support/Delivery:</strong>\n\n\n<ul>\n<li>Responsible for client satisfaction, risk and escalation management Understands client stakeholder expectations and guide delivery team to successful implementation.</li>\n<li>Review, finalize, and manage overall delivery of solution including business blueprint and design audits, supporting SMEs and consultants form a solution point of view.</li>\n<li>Support operations in on boarding and enablement.</li>\n<li>Asset Development and Governance (Cognizant H1,H2,H3).</li>\n<li>Create assets in H1/H2, Build and finalize implementation plan with client and internal stakeholders.</li>\n<li>Identify re usable assets and track utilization of assets across projects.</li>\n<li>Assist in analyzing metrics and feedback from project teams adopting designed assets.</li>\n<li>Monitor asset effectiveness during realtime implementation.</li>\n<li>Identify areas for improvement / customization and redesign asset based on analysis.</li>\n<li>Develop and ensure promotion/adoption of assets in H1/H2.</li>\n</ul>\n\n<strong>Sales Support:</strong>\n\n\n<ul>\n<li>Support collateral creation for seminars and industry forums.</li>\n<li>Provides handson, ontheground management of medium engagements to assure that growth opportunities are appropriately identified and existing opportunities are mined.</li>\n<li>Identify new needs in existing clients and share suggestions with Principal/Sr Architects.</li>\n<li>Participate in discussions, presentations with customers at a strategic level versus execution or tactical level.</li>\n<li>Lead RFP response actively in terms of solution architecture and design, effort estimations, risks and mitigation.</li>\n<li>Lead oral presentation to the customer in area of domain/product expertise.</li>\n</ul>\n\n<strong>Client Management/Relationship Management:</strong>\n\n\n<ul>\n<li>Proactively build relationships with functional owners in client organization to build long term partnerships.</li>\n<li>Create and own connect with the right sponsors/business leaders for a given solution.</li>\n<li>Drive alignment, connects with third party vendor in an engagement wherever applicable.</li>\n<li>Own Expectation Management, Client Satisfaction Management, and Risk Management in area of domain/solution expertise.</li>\n<li>Deliver and measure value pre, during, and post engagement and communicate to stakeholders.</li>\n</ul>\n\n<strong>Market Scan&amp;Brand Branding and Opportunity Identification:</strong>\n\n\n<ul>\n<li>Bring deep knowledge of customer business domain/industry within given vertical or domain.</li>\n<li>Conduct secondary research on domain//industry specific solutions.</li>\n<li>Bring an understanding of competitive landscape.</li>\n<li>Identify key trends and forecasts in the domain/industry.</li>\n<li>Participate/Contribute to conferences with partners, analysts / vendors in area of domain/technology expertise through active mindshare gain Webinars, White papers, speaking events etc.</li>\n<li>Prepare/review collateral, publications, technology papers etc for distribution.</li>\n<li>Contribute to opportunity qualification and provide inputs on enhancing/rationalization of existing capabilities and services.</li>\n</ul>\n\n<strong>Knowledge Management:</strong>\n\n\n<ul>\n<li>Contribute TL, Design, PoVs, tools, templates, case studies etc artifacts into the knowledge management repository.</li>\n<li>Conduct and facilitate knowledge sharing and learning sessions across the team.</li>\n<li>Build awareness of the knowledge repository among teams.</li>\n</ul>\n\n<strong>People Management:</strong>\n\n\n<ul>\n<li>Participate in junior to middle management level talent selection.</li>\n<li>Set goals for team members and monitor performance.</li>\n<li>Guide the employee in setting career paths.</li>\n<li>Coordinate with the project/program manager in understanding how the employee can better contribute to the project, seek feedback, and address concerns.</li>\n<li>Conduct performance appraisal for team members.</li>\n<li>Organize team initiatives on a periodic basis.</li>\n</ul>"}