{"job title": "Data Scientist", "company": "EMD Millipore", "city state": "– Saint Louis, MO", "rating": "3.2", "job description": "Bioinformatics IT in MilliporeSigma is currently seeking a Data Scientist at our headquarters located in St. Louis, MO. This role will work with our internal and external customers to develop algorithms, pipelines and applications utilizing computational, statistical and informatics skills. The individual will also participates in product design, data mining, data analysis, process improvement and other bio/chemoinformatics projects to support R&amp;D, production, marketing/sales and other groups. Serve as a project lead or co-champion on major development projects including direct customer interface and mentor other scientists or colleague in the organization.\n<br><br>\nYour role\n\n\n<ul>\n<li>Creating valuable, transformative business strategies through the measurement, manipulation, reporting, and dissemination of broad sets of data.</li>\n<li>Developing and planning required analytic projects in response to business needs.</li>\n<li>Executing analytical projects as an individual contributor.</li>\n<li>Developing new predictive/analytical modeling methodsas required.</li>\n<li>Proficiency with at least one programming language such as java, R or python, and advanced knowledge of Unix-like systems is must.</li>\n<li>Previous experiences with bio/chemoinformatics software or packages such as Primer3, Blast, Openbabel, NGS and others are desired.</li>\n<li>Have experience dealing with large-scale data set with intensive hand-on code development.</li>\n<li>Experience with Hadoop framework (HDFS, MapReduce, Spark, Hbase, Hive) is a plus.</li>\n<li>Strong organizational and problem solving skills are required.</li>\n<li>Highly motivated, creative and self-assertive starter. Proven written and verbal communication skills, and excellent team skills are a must.</li>\n</ul>\n\nWho you are\n\n\n<ul>\n<li>MS or Ph.D. degree in biochemistry, biostatistics, computer science or equivalent relevant experience.</li>\n</ul>\n\nJob Requisition ID: 171699\n<br><br>\nLocation: St. Louis\n<br><br>\nCareer Level: D - Professional (4-9 years)\n<br><br>\nWorking time model: full-time\n<br><br>\nNearest Major Market: St Louis\n<br><br>\nJob Segment: Chemistry, Database, Scientist, Biochemistry, Biotech, Science, Technology"}