{"job title": "Data Scientist", "company": "Loveland Innovations", "city state": "– Pleasant Grove, UT", "rating": "5.0", "job description": "Loveland Innovations\n<br><br>\nJob Title: Data Scientist\n<br><br>\nJob Type: Full-time\n<br><br>\nSalary: $90k - $140K Depending on Experience\n<br><br>\nJoin our growing development team and make a real contribution as we create innovative solutions around drone imagery. Improve our industry leading AI and explore new and effective applications of the latest literature to solve real world challenges.\n<br><br>\nWe're looking for an experienced data scientist that has previously worked on delivering solutions for complex problems around deep learning and computer vision for large-scale distributed systems. Possible projects include damage detection, classification, instance segmentation and GANs for data augmentation.\n<br><br>\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>MS/PhD or related experience with specialization in machine learning</li>\n<li>Broad machine learning knowledge regarding AI, Deep Learning, Clustering, GANs, etc.</li>\n<li>Knowledge of Python, NumPy, TensorFlow or similar libraries and toolkits</li>\n<li>Strong programming skills and experience writing performance optimized production-level code</li>\n<li>Development experience with the ability to define and implement software development best practices including domain-driven and test-driven development</li>\n</ul>\n\n<strong>Benefits:</strong>\n\n\n<ul>\n<li>Medical and dental insurance (80% of premiums paid by Loveland Innovations)</li>\n<li>Generous PTO allocation</li>\n<li>Choose your hardware we're really flexible</li>\n<li>Stocked fridge</li>\n<li>Stock options</li>\n<li>Startup with a soul we work hard and are passionate about what we are doing, but also have families and lives outside of work. This is a unique opportunity to work at a well-funded startup with a proven management team with a long history of success working together.</li>\n</ul>\n\nThis position will reside in Utah. No relocation assistance is available. All job offers are contingent on a background check that complies with the law."}