{"job title": "Data Scientist", "company": "Research Foundation for Mental Hygiene, Inc.", "city state": "– Albany, NY", "rating": "3.3", "job description": "The Research Foundation for Mental Hygiene, Inc. is seeking a qualified candidate to fill the full-time, salaried position of Children's Data Scientist at the New York State Office of Mental Health, Office of Performance Measurement and Evaluation.\n<br><br>\n<strong>FUNCTION AND SCOPE</strong>\n<br><br>\nNew York is transitioning more than $2 billion in Medicaid behavioral health services for adults and children from fee-for-service to Medicaid managed care. This is a major transformation in the way care is delivered to individuals with serious mental health and/or substance use issues. A major element of the NYS health care transformation involves The development of high-fidelity wrap services for children.\n<br><br>\nThe candidate will join a team of NYS OMH staff and will have primary responsibilities for conducting data analyses using Medicaid claims and other administrative databases that will support the Evaluation of the pilot implementation of high fidelity wrap around services in NYS.\n<br><br>\n<strong>QUALIFICATIONS</strong>\n<br><br>\nCandidate must have a Bachelor's degree from an accredited college in public health, statistics, biostatistics, computer science, economics or related field and one years of related professional work experience or a Master's degree from same educational backround as listed above. Minimum qualifications include:\n\n\n<ul>\n<li>Knowledge of Data Science Algorithms</li>\n<li>Experience with statistical software (e.g., SAS, R), data analytic programming (e.g. Python, Java) and database languages (e.g., SQL, PL/SQL)</li>\n<li>Experience with team work to develop Tableau or other visual analytic presentaitons</li>\n<li>Experience working with a team to solving analytical problems using statistical approaches</li>\n<li>Ability to work cooperatively with a wide variety of professional staff</li>\n<li>Fluency in the English language</li>\n<li>The ability to work independently</li>\n</ul>\n\nThe preferred candidate will have experience in both data analytics and mental health care systems as well as course backround in data science and statistics.\n<br><br>\n<strong>RESPONSIBILITIES INCLUDE BUT ARE NOT LIMITED TO:</strong>\n\n\n<ul>\n<li>Develop comparison sample using Medicaid and OMH administrative data for High-Fidelity Wrap Pilot</li>\n<li>Liaison with SUNY research partners on ongoing SAMHSA evaluation of High Fidelity Wrap.</li>\n</ul>\n\nWork Location: The position will be located at the NYS OMH Office of Performance Measurement at the NYS Office of Mental Health Central Office, 44 Holland Avenue, Albany, NY 12229.\n<br><br>\nSalary: G 18\n<br><br>\nTo Apply: Submit an application by September 11th, 2018 on our website at http://corporate.rfmh.org. Click on Employment Opportunities. Please note only applications submitted through our website will be considered.\n<br><br>\nThe Research Foundation is a private not-for-profit corporation and is not an agency or instrumentality of the State of New York. Employees of the Research Foundation are not state employees, do not participate in any state retirement system, and do not receive state fringe benefits. Excellent Benefits Package. Employer/Minority/Women/Disabled/Veteran Employer. VEVRAA 41 CFR 60-300.5(a) compliant."}