{"job title": "Data Scientist", "company": "SAIC", "city state": "– Reston, VA", "rating": "3.6", "job description": "Data Scientist (Job Number:439962)\n<br><br>\n<strong>Description:</strong>\n<br><br>\nSAIC is hiring two Data Scientists in Reston, VA\n<br><br>\n<strong>JOB DESCRIPTION:</strong>\n\n\n<ul>\n<li>Works in cross-functional teams with data at all stages of the analysis lifecycle to derive actionable insight.</li>\n<li>Translates mission needs into an end-to-end analytical approach to achieve results.</li>\n<li>Performs the pre-analytics areas of data collection and understanding, data cleansing and integration, and data storage and retrieval.</li>\n<li>Determines the appropriate analytics based on the data and the desired outcomes, using techniques including feature detection, statistics, data mining, predictive modeling, machine learning, natural language processing, and business intelligence.</li>\n<li>Interprets the validity of results and communicates the meaning of those results.</li>\n<li>Has familiarity with data wrangling, analytics, and visualization software and programming languages, including analytics methods for big data.</li>\n<li>Follows a scientific approach to generate value from data, verifying results at each step.</li>\n<li>Provides solutions to a variety of technical problems of moderate scope and complexity where analysis of situations or data requires a review of the variety of factors.</li>\n<li>Frequent use and application of technical standards, principles, theories, concepts and techniques.</li>\n<li>Receives assignments in the form of objectives and establishes goals to meet outlined objectives.</li>\n<li>Directs established guidelines, procedures and policies.</li>\n<li>Work will be performed primarily with internal company contacts.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n<br><br>\n<strong>QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>Experience in Data Mining, predictive analysis, and/or machine learning.</li>\n<li>Able to work under general direction on routine work and follow established procedures.</li>\n<li>Able to exercise judgement within defined procedures and practices to determine appropriate action.</li>\n</ul>\n\n<strong>EDUCATION AND EXPERIENCE:</strong>\n<br><br>\nBachelors Degree and 2+ years of experience or H.S. Degree with 5-6 years of experience can be substituted for a Degree.\n<br><br>\n<strong>SECURITY CLEARANCE:</strong>\n<br><br>\nUS Citizen\n<br><br>\nAbility to obtain a Top Secret Clearance\n<br><br>\nSAIC Overview:SAIC is a premier technology integrator providing full life cycle services and solutions in the technical, engineering, intelligence, and enterprise information technology markets. SAIC is Redefining Ingenuity through its deep customer and domain knowledge to enable the delivery of systems engineering and integration offerings for large, complex projects. SAIC's approximately 15,000 employees are driven by integrity and mission focus to serve customers in the U.S. federal government. Headquartered in Reston, Virginia, SAIC has annual revenues of approximately $4.5 billion. For more information, visit saic.com. For information on the benefits SAIC offers, see My SAIC Benefits. EOE AA M/F/Vet/Disability\n<br><br>\nJob Posting: Sep 7, 2018, 6:39:56 PM\n<br><br>\nPrimary Location: United States-VA-RESTON\n<br><br>\nClearance Level Must Currently Possess: None\n<br><br>\nClearance Level Must Be Able to Obtain: Top Secret\n<br><br>\nPotential for Teleworking: No\n<br><br>\nTravel: Yes, 50% of the time\n<br><br>\nShift: Day Job\n<br><br>\nSchedule: Full-time<br><br>SDL2017"}