{"job title": "Scientist - Virologist", "company": "Alnylam", "city state": "– US-MA-Cambridge", "rating": "4.1", "job description": "<div><strong>Overview</strong></div>\n<br>Alnylam was founded in 2002 on a\n<br>\nrevolutionary vision and bold mission which remain firmly in place today. We\n<br>\nare leading the translation of RNAi as a new class of medicines with a core\n<br>\nfocus on RNAi therapeutics toward genetically defined targets for the treatment\n<br>\nof serious, life-threatening diseases with limited treatment options for\n<br>\npatients and their caregivers. In January 2015, we announced our “Alnylam 2020”\n<br>\nguidance that reflects our expected transition from a late-stage clinical\n<br>\ndevelopment company to a multi-product commercial-stage company with a\n<br>\nsustainable development pipeline. Alnylam is proud to have been recognized as\n<br>\none of The Boston Globe’s Top Places to Work in 2015, 2016 and 2017.\n<br><br>\nThe Research department at Alnylam\n<br>\nis seeking a passionate, creative scientist to join our interdisciplinary team\n<br>\nto help advance antiviral programs in collaboration with our external partner.\n<br>\nThe successful candidate will have a strong experimental background in hepatic\n<br>\nviruses and immunology through hands on experience of cell/molecular biology\n<br>\ntechniques, animal models and bring a rigorous, analytical approach to problem\n<br>\nsolving and experimental design.<br>\n<div><strong>Summary of Key Responsibilities</strong></div>\n\n<ul>\n<li>Develop and apply cell/molecular biology assays to\n<br>\n characterize anti-viral activity</li><li>Establish appropriate animal models in-house to\n<br>\n characterize anti-viral activity</li><li>Prepare clearly articulated experimental reports and\n<br>\n data presentations</li><li>Clearly communicate the results with external partner\n<br>\n and drive the project in collaborative manner</li> \n</ul>\n\n<div><strong>Qualifications</strong></div>\n\n<ul>\n<li>PhD in virology field with focus on hepatic viruses is\n<br>\n preferred</li> <li>Expertise in the field of interplay between immune\n<br>\n system and viruses</li><li>Experience in animal models to evaluate anti-viral\n<br>\n activity and associated in vitro assays are required</li><li>Must be flexible to be able to apply her/his knowledge\n<br>\n to new areas of study, thrive in a team environment, and possess excellent\n<br>\n communication skills (both written and oral)</li>\n</ul>\n<strong>Alnylam Pharmaceuticals is an EEO employer committed to an\n<br>\nexciting, diverse, and enriching work environment.</strong><br>\n<div></div><br>\n\n<div><strong>#LI-LM1</strong></div>\n<br>"}