{"job title": "Machine Learning Scientist", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAmazon AI is looking for world class scientists and engineers to join its AI Lab. This group is entrusted with building new machine learning algorithms for AWS and our customers. At the AI Lab and at Amazon AI you will invent, implement, and deploy state of the art machine learning algorithms and systems. You will build prototypes and explore new solutions. You will interact closely with our customers and with the academic community. You will be at the heart of a growing and exciting focus area for AWS and work with other acclaimed engineers and world famous scientists.<br> <br><br> Excited by using massive amounts of data to develop Machine Learning (ML) and Deep Learning (DL) models? Want to help innovative education research institutions and enterprises derive business value and new insights through the adoption of Artificial Intelligence (AI)? Eager to learn from the many different institution’s use cases of AWS ML and DL? Thrilled to be key part of Amazon, who has been investing in Machine Learning for decades, pioneering and shaping the world’s AI technology?<br> <br> <br> A successful candidate will be a person who enjoys diving deep into data, doing analysis, discovering root causes, and designing long-term solutions. It will be a person who likes to have fun, loves to learn, and wants to innovate in the world of AI. Major responsibilities include:<br> · Understand the customer’s business need and guide them to a solution using our AWS AI Services, AWS AI Platforms, AWS AI Frameworks, and AWS AI EC2 Instances.<br> · Being able to deliver a ML / DL project from beginning to end, including understanding the business need, aggregating data, exploring data, building &amp; validating predictive models, and deploying completed models to deliver business impact to the organization.<br> · Use Deep Learning frameworks like MXNet, Caffe 2, Tensorflow, Theano, CNTK, and Keras to help our customers build DL models.<br> · Use SparkML and Amazon Machine Learning (AML) to help our customers build ML models.<br> · Work with Data Engineers to analyze, extract, normalize, and label relevant data.<br> · Work with Engineers to help our customers operationalize models after they are built.<br> · Assist customers with identifying model drift and retraining models.<br> · Research and implement novel ML and DL approaches<br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· A Bachelor or Masters Degree in a highly quantitative field (Computer Science, Machine Learning, Infomatics, Operational Research, Statistics, Mathematics, etc.) or equivalent experience<br> · 4+ years of industry experience in predictive modeling, data science and analysis<br> · Previous experience in a ML or data scientist role and a track record of building ML or DL models<br> · Experience using Python and/or R<br> · Knowledge of SparkML<br> · Able to write production level code, which is well-written and explainable<br> · Experience using ML libraries, such as scikit-learn, caret, mlr, mllib<br> · Experience working with GPUs to develop models<br> · Experience handling terabyte size datasets<br> · Track record of diving into data to discover hidden patterns<br> · Familiarity with using data visualization tools<br> · Knowledge and experience of writing and tuning SQL<br> · Past and current experience writing and speaking about complex technical concepts to broad audiences in a simplified format<br> · Experience giving data presentations<br> · Extended travel to customer locations may be required to deliver professional services, as needed<br> · Strong written and verbal communication skills<br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· PhD in a highly quantitative field (Computer Science, Machine Learning, Infomatics, Operational Research, Statistics, Mathematics, etc.)<br> · 6+ years of industry experience in predictive modeling and analysis<br> · Good skills with programming languages, such as Java or C/C++<br> · Ability to develop experimental and analytic plans for data modeling processes, use of strong baselines, ability to accurately determine cause and effect relations<br> · Consulting experience and track record of helping customers with their AI needs<br> · Publications or presentation in recognized Machine Learning, Deep Learning and Data Mining journals/conferences<br> · Experience with AWS technologies like Redshift, S3, EC2, Data Pipeline, &amp; EMR<br> · Combination of deep technical skills and business savvy enough to interface with all levels and disciplines within our customer’s organization<br> · Demonstrable track record of dealing well with ambiguity, prioritizing needs, and delivering results in a dynamic environment<br><br>Amazon.com is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation.<br> <br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}