{"job title": "Learning and Education Scientist", "company": "Apple Inc.", "city state": "– Cupertino", "rating": "4.0", "job description": "<p>At Apple, we strive to achieve surprise and delight for every one of our millions of customers around the world. The Technology Investigation Team is currently looking for a neuroscientist who is an expert in learning, memory, and behavior. The ideal candidate will have a strong research background and have made innovative contributions to both neuroscience and to the development of education technology. This person is passionate about creating transformative learning experiences that are enabled by new technology and inspired by cognitive science. We are looking for a great teammate with excellent interpersonal skills and who has a dedication to conducting impactful research in support of technology development.</p>\n\n <p>Key Qualifications:<br> •The ideal candidate will have at least some of the following:<br> •5+ years investigating the neural and behavioral correlates of learning and memory.<br> •Fluent in experimental design and quantitative analysis of physiological and behavioral data.<br> •Experience investigating sensorimotor and multi-sensory representations, reward and decision-making processes, attention, and performance a plus.<br> •Experience building novel educational experiences that enhance learning a plus.<br> •Experience working with a diverse population of learners in various educational settings preferred.<br> •Knowledge of learning theory in biological and artificial systems a plus (e.g., operant conditioning, reinforcement learning, optimization).<br> •Experience collecting/analyzing multimodal datasets desired.<br> •Excellent creative thinking and problem solving skills.</p>\n\n <p>Description:<br> This is a multi-faceted scientific role that will require you to be versatile across a variety of tasks in a highly collaborative environment. You will work closely with other scientists and engineers to rapidly carry out studies that help drive research and development. You will have the following responsibilities:<br><br> - Design and carry out user studies.<br><br> - Perform extensive data analysis to pull out actionable insights from complex multimodal datasets.<br><br> - Work cross-functionally with other teams to translate these insights into transformative educational technology prototypes.<br><br> - Conduct literature reviews and survey technology trends and share insights cross-functionally.<br><br> - Present your findings to key partners.</p>\n\n <p>Education:<br> Doctorate in Neuroscience, Psychology, Biomedical Engineering, or related expertise. 1-3 years postdoctoral and/or industry experience.<br><br><br><br><br> Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.</p>"}