{"job title": "Scientist II, In Vitro Pharmacology - Oncology", "company": "Atreca", "city state": "– Redwood City, CA", "rating": "4.7", "job description": "Atreca is an early stage biotechnology company, located in Redwood, California, whose Immune Repertoire Capture technology enables the discovery and development of better therapeutics, vaccines, diagnostics, and research reagents. Atreca is looking for talented, entrepreneurial people who would like to be part of a progressive team and see their work have a positive impact on human health<strong>.</strong>\n<br><br>\n<strong>Description</strong>\n<br><br>\nAtreca's IRC technology identifies anti-tumor human antibodies in a highly accurate and precise fashion. Our goal is to apply this technology to elucidate and characterize novel tumor targets and associated biologic processes that were selected for attack by the patient's immune system. In this position, the successful candidate will apply her/his deep, intense knowledge of immunology and experimental expertise to uncover the cellular and molecular mechanism(s) of action of our lead antibodies and advance our pipeline.\n<br><br>\nThis is a unique opportunity for a highly motivated individual to become a key member of a growing biotechnology company while being embedded in a very dynamic and motivated team dedicated to the discovery of novel, antibody-based cancer therapies.\n<br><br>\n<strong>PRIMARY DUTIES &amp; RESPONSIBILITIES</strong>\n\n<ul>\n<li> Participate in Lead development by investigating antibody mechanism of action using established in vitro assays (e.g. ADCC, ADCP, CDC, DC/macrophage/T-cell activation assays)</li> \n\n<li> Utilize expertise in immunology to design, optimize and execute novel cell-based assays to characterize MoA for Atreca antibody Leads</li>\n\n<li> Work with histology, in vivo pharmacology and target identification teams in a cross functional fashion to develop experimental strategies to define antibody mechanism of action</li> \n\n<li> Participate in in-vitro antibody screening campaigns</li> \n\n<li> Analyze, organize and summarize data</li>\n\n<li> Manage reports</li> \n\n<li> Prepare and summarize data for presentation in group meetings, publications and conferences</li>\n</ul>\n<strong>REQUIREMENTS</strong>\n\n<ul>\n<li> PhD with at least two years post-graduate experience with a focus on Immuno-Oncology or Immunology</li> \n\n<li> Industry experience highly desirable</li> \n\n<li> <strong>Absolutely Required</strong>: Experienced and skilled in cell-based assays</li>\n\n<li> Experience managing research associates preferred</li> \n\n<li> Experienced in multicolor flow cytometry</li>\n\n<li> Experience with molecular/cell biological techniques preferred (e.g. transfection, cell culture, microscopy, tissue dissociation)</li>\n\n<li> Must have excellent organization, planning skills, and the ability to work under timeline in a fast-paced environment.</li>\n\n<li> Excellent written and oral communication skills.</li>\n</ul>\n<strong>PHYSICAL POSITION REQUIREMENTS</strong>\n\n<ul>\n<li> Sitting, standing, walking</li>\n</ul>"}