{"job title": "Associate Scientist", "company": "Bristol-Myers Squibb", "city state": "– ", "rating": "3.6", "job description": "<div>The Associate Scientist will be responsible supporting downstream process development of recombinant protein therapeutics. This role will support process development, process characterization, scale-up and technology transfer.\n<br><br>\nThe successful candidate will be highly proficient in performing chromatography, filtration unit operations as well as conducting necessary analytical assays. In order to be successful in a highly dynamic environment, the candidate should be a highly motivated self-starter with excellent interpersonal, communication and organizational skills.\n<br><br>\nResponsibilities:\n\n\n<ul>\n<li>Design and develop purification processes for recombinant protein therapeutics.</li>\n<li>Conduct experiments, organize and summarize data.</li>\n<li>Perform virus clearance evaluation of downstream processes.</li>\n<li>Perform / oversee process characterization of downstream unit operations.</li>\n<li>Work closely in collaboration with other Process Development Functional Areas.</li>\n<li>Author and review technical documents and protocols; follow written scientific methods and experimental protocols, documents results, authors and reviews summary reports.</li>\n<li>Support manufacturing and scale up laboratory activities as required</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>A degree in Chemical Engineering, Chemistry, Biology or a related discipline.</li>\n<li>Minimum bachelor's degree with 3 to 5 years relevant experience; Masters preferred.</li>\n<li>Highly proficient with operation, maintenance, etc. of downstream laboratory equipment. In particular expertise with automated chromatography workstations such as AKTA Avant, etc. is highly desirable.</li>\n<li>General experience with purification unit operations such as chromatography (various modes), tangential and normal flow filtration, etc.</li>\n<li>Hands on experience with UV/Vis spectroscopy, HPLC and other analytical techniques is highly desirable.</li>\n<li>Basic understanding of downstream process development activities.</li>\n<li>Development experience for both early- and late-stage molecules is highly desired.</li>\n<li>Excellent organizational skills and highly Methodical.</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Work independently and collaborate with other groups. Deliver results in line with project and team objectives.</li></ul></div>\n\n"}