{"job title": "Scientist - HPLC Method Development", "company": "Can-Am Consultants, Inc.", "city state": "– Ridgefield, CT", "rating": "5.0", "job description": "Major pharmaceutical R&amp;D and manufacturing organization seeks Scientist with knowledge and experience in HPLC method development and validation for assay, impurities for active ingredients and intermediates. <br>Responsibilities:<br><br>-Performs routine lab duties without supervision.<br>-Design and executes non-routine experiments on the basis of literature analyses with minimal supervision.<br>-Initiates and completes routine procedures in an independent and efficient manner.<br>-Troubleshoots effectively and solves scientific problems independently.<br>-Operates lab equipment and is independently responsible for maintenance.<br>-Designs and executes non-routine experiments on a basis of literature analyses with minimal supervision.<br>-Performs literature searches, attends scientific presentations, and keeps abreast of literature in own field.<br>-Proposes new experiments/technologies based on science as well as overall understanding of drug discovery/development process.<br>-Demonstrates expertise in field and contributes to junior level scientists as needed.<br>-Reports and treats data with a high level of integrity and ethics.<br>-Write protocols, procedures, and technical reports.<br>-Provide input for scientific reports.<br><br>Skills: <br><br>-Knowledge and experience in HPLC method development and validation for assay, impurities for active ingredients and intermediates.<br>-Good understanding of established SOPs and cGMP/GLP regulations.<br>-Knowledge and experience in Empower software and LIMS is a plus.<br>-Has knowledge of commonly-used concepts, practices, and procedures within a particular field.<br><br>Education: <br><br>-Master’s Degree with 3+ years’ experience in a related scientific discipline or<br>-Bachelor’s Degree with 7 + years’ experience in a related field orEquivalent experience in a related field."}