{"job title": "Research Scientist", "company": "Cardiac Pacemakers", "city state": "– Indianapolis, Indiana", "rating": "3.0", "job description": "<br><b></b><br>Research Scientist<br><br><b></b><br>11-Sep-2018<br><br><b></b><br>09-Jan-2019<br><br><b>Responsibilities</b><br>The Computational Absorption, Distribution, Metabolism and Excretion (cADME) group within the multidisciplinary Drug Disposition organization is seeking a top notch scientist to utilize in silico approaches to facilitate the extraction, sharing, and application of ADME structure-property relationship (SPR) knowledge. You will be actively engaged with portfolio project teams and innovative design of rational, hypothesis-driven experiments to maximize the probability of achieving proof of concept in the clinic. You will also be responsible for maintaining the existing in silico ADME toolbox while actively innovating and implementing new techniques.<br><strong>Other Responsibilities:</strong><ul><li>Independently research, develop and apply cheminformatics tools to design and guide in vitro/in vivo experiments for optimal gain of scientific, decision-level knowledge.</li><li>Serve as a liaison to colleagues in Discovery Informatics and Computational Chemistry for seamless integration of ADME tools across the discovery research organization.</li><li>Conduct concerted data analysis to understand the connectivity across in silico, in vitro, and in vivo ADME data for project teams.</li><li>Share and effectively communicate computational perspective within project teams to design rational, hypothesis-driven experiments and facilitate a multi-property optimization strategy.</li><li>Use physiologically based pharmacokinetics (PBPK) principles for preclinical and clinical PK prediction to effectively drive projects toward successful proof of concept in the clinic.</li></ul><br><br><b>Req ID</b><br>44260BR<br><br><b>Additional Skills/Preferences</b><br><ul><li>Demonstrated results/experience in working with interdisciplinary teams.</li><li>Solid understanding of organic/medicinal chemistry</li><li>Experience in scripting/programming in one or more of the following languages: JAVA, Python, Perl, C/C++, R, Matlab</li><li>Experience in applying advanced machine learning and statistical methodologies including QSAR for large scale data mining and modeling</li><li>Familiarity in working with web based applications, databases and automated workflow tools such as Knime</li><li>Proficiency in visualizing multi-dimensional scientific data using tools like Spotfire</li><li>Familiarity with principles of drug metabolism and/or pharmacokinetics</li><li>Demonstrated ability to influence without authority</li><li>Strong communication skills</li></ul><br><br><b>Additional Information</b><br><ul><li>Lilly is an EEO/Affirmative Action Employer and does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status. </li></ul><br><br><b>Location Details</b><br>Indianapolis<br><br><b>Title</b><br>Research Scientist-ChemInformatics<br><br><b>Job Category</b><br>Science<br><br><b>Basic Qualifications</b><br><ul><li>Ph.D. level scientist with degree in computational chemistry, cheminformatics, statistics, computational biology or a related discipline with experience in developing and applying cheminformatics tools for application in drug discovery</li></ul><br><br><b>Company Overview</b><br>At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 39,000 employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We’re looking for people who are determined to make life better for people around the world.<br> <br><br><b>City</b><br>Indianapolis<br><br><b>Country</b><br>USA <br><br><b>State / Province</b><br>Indiana <br><br><b>Region</b><br>North America<br>"}