{"job title": "Sr Scientist", "company": "Carolinas HealthCare System", "city state": "– Charlotte, NC", "rating": "3.3", "job description": "<strong>Job Req ID:</strong> 159584\n<br><br>\n<strong>Position Number:</strong> 00162982\n<br><br>\n<strong>Employment Type:</strong> Full Time\n<br><br>\n<strong>Shift:</strong> Variable/On Call\n<br><br>\n<strong>Shift Details</strong>: M-F, Days\n<br><br>\n<strong>Standard Hours:</strong>&nbsp;40.00\n<br><br>\n<strong>Department Name:</strong> OPR Orthopaedic Surgery\n<br><br>\n<strong>Location:</strong> Therapeutic Research and Devel\n<br><br>\n<strong>Location Details:</strong> CMC Main\n<br><br>\n<em>Carolinas HealthCare System is Atrium Health. Our mission remains the same: to improve health, elevate hope and advance healing - for all. The name Atrium Health allows us to grow beyond our current walls and geographical borders to impact as many lives as possible and deliver solutions that help communities thrive. For more information, please visit carolinashealthcare.org/AtriumHealth</em>\n<br><br>\n&nbsp;\n<br><br>\n&nbsp;\n<br><br>\n<strong>Job Summary</strong>\n<br>\nConducts independent research and performs research experiments. Researches databases, analyzes data using appropriate statistical and other programs, and prepares presentations, papers, progress reports, and grant and contract applications. Manages all aspects of research from planning and securing funding to publication and presentation at meetings. Oversees, directs, supervises, instructs, and mentors team members, students, residents, and fellows.\n<br><br>\n<strong>Essential Functions</strong>\n<br><br>\n&nbsp;\n<br><br>\n&nbsp;\n\n<ul>\n<li>Participates in the planning, development, and conduct of a variety of research projects.</li><li>Collaborates on appropriate departmental and facility projects as assigned by leadership.</li><li>Collaborates and interacts with investigators at other local, regional, national, and international institutions.</li><li>Fosters and maintains collegial interactions with and supervision of residents, fellows, technical team members, physicians, faculty, students, research fellows, and visiting scientists.</li><li>Produces and analyzes experimental data, writes progress reports, writes manuscripts for publication in peer-reviewed journals, and prepares abstracts for presentation of results at local, national, and international scientific meetings.</li><li>Develops, writes, and submits grant proposals for intra- and extra-mural funding. Develops and maintains a vigorous, cutting-edge, externally-funded program in relevant research.</li><li>Manages and coordinates the activities of a laboratory and its team members. Performs performance reviews of lab team members.</li><li>Participates in safety and quality assurance activities and maintenance of compliance with others.</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>Physical Requirements</strong>\n<br>\nLong periods of sitting or standing and some walking. Occasional lifting of supplies and equipment necessary. Must be able to work with mice, rats, and other small mammals.\n<br><br>\n<strong>Education, Experience and Certifications</strong>\n<br>\nPhD or MD or both from an accredited institution required. A distinguished record of publications required. Experience investigating cardiovascular physiology, pharmacology or myocardial metabolism preferred.\n<br><br>\n&nbsp;<br><br>&nbsp;<br><br>&nbsp;\n<br><br>\n&nbsp;\n<br><br>\n<em>At Carolinas HealthCare System, our patients, communities and teammates are at the center of everything we do. Our commitment to diversity and inclusion allows us to deliver care that is superior in quality and compassion across our network of more than 900 care locations.</em>\n<br><br>\n&nbsp;\n<br><br>\n<em>As a leading, innovative health system, we promote an environment where differences are valued and integrated into our workforce. Our culture of inclusion and cultural competence allows us to achieve our goals and deliver the best possible experience to patients and the communities we serve.</em>\n<br><br>\n&nbsp;\n<br><br>\n<strong>Posting Notes:</strong> Not Applicable\n<br><br>\n<strong><em>Carolinas HealthCare System is an EOE/AA Employer</em></strong>"}