{"job title": "Research Scientist - Chemistry", "company": "Novo Nordisk", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong><br>\n<div><strong>About the department</strong>\n<br>\nImagine transforming the face of biomedical research and building world-class technology platforms in a state-of-the art facility. That’s what we do at Novo Nordisk Research Center Seattle, Inc. (NNRCSI). Our scientists apply cutting-edge technologies and multiple modalities to early discovery projects within the diabetes and obesity areas, with the goal of bringing molecules to market. At the NNRCSI, your skills, dedication and ambition will help us change lives for the better. In exchange, we’ll offer you an opportunity to work with extraordinary talent, continuously learn and develop, and drive change to defeat diabetes, obesity, and other serious chronic conditions. The team is comprised of collaborative, diverse and passionate people who have a true sense of pride in their work and are committed to helping others grow and develop in their careers. You’ll also have a platform to engage with key stakeholders on a global scale throughout the entire pipeline process. And while changing the future of diabetes treatment is no easy task, we also recognize the importance of an enjoyable workplace, which is why we’ve cultivated a culture of fun, ingenuity and innovation. And our competitive compensation package, generous benefits, and support of a healthy work-life balance all add to a best-in-class employee experience. We are changing lives for a living. Are you ready to make a difference?\n<br><br>\n<strong>PURPOSE:</strong>\n<br>\nThe Chemistry Department in NNRCSI is engaged in early target discovery and validation for the development of novel therapies for the treatment of obesity and type 1 diabetes. The Research Scientist will lead peptide engineering, small molecule medicinal chemistry, or protein modification efforts, to deliver lead and candidate molecules for various research projects.\n<br><br>\n<strong>RELATIONSHIPS:</strong>\n<br><br>\nReports to the Director of Chemistry. Internal relationships include the project teams and research colleagues at NNRCSI and globally. Communicates data and collaborates externally when required.\n<br><br>\n<strong>ESSENTIAL FUNCTIONS:</strong>\n\n<ul>\n<li>Optimizes peptides, small molecules and proteins to clinical candidates meeting the desired pharmacological, chemical and biophysical criteria</li><li>Integrates synthetic organic chemistry, medicinal chemistry, peptide/protein chemistry, and oligonucleotide chemistry to the discovery of novel therapeutics</li> <li>Leads the design, synthesis, purification and characterization of above-mentioned molecule formats</li><li>Additional background in oligonucleotide chemistry is highly desired</li> <li>Effectively communicate with supervisor and colleagues to promote a world-class research environment.</li><li>Track novel chemistry and relevant technologies that can be employed at Novo Nordisk to drive molecular innovation</li> <li>Contribute to external community by publishing and presenting, as deemed corporately appropriate</li>\n</ul>\n\n<strong>PHYSICAL REQUIREMENTS:</strong>\n\n<ul>\n<li>Approximately 0-10% overnight travel</li>\n</ul>\n\n<strong>KEY SUCCESS FACTORS: EDUCATION, EXPERIENCE, KNOWLEDGE AND SKILLS</strong>\n\n<ul>\n<li>A PhD in organic, medicinal or bio-organic chemistry with a minimum of 3 years post-doctoral experience or equivalent</li> <li>Strong analytical skills for interpreting and integrating interdisciplinary data</li><li>Strong synthetic skills for generating peptides, small molecules, modified proteins and oligonucleotides</li><li>Scholarly excellence in research as documented by strong publications and patents</li> <li>Effective written and oral communication skills, and strong commitment to research in a team environment focused on cutting-edge drug discovery</li>\n</ul>\n\n<strong>Requisition ID:</strong> 58507BR\n<br>\n<strong>State/Provinces:</strong> Seattle\n<br>\n<strong>Job Category:</strong> Research</div>\n\n<br>"}