{"job title": "Bioinformatics Scientist", "company": "Personalis", "city state": "– Menlo Park, CA", "rating": "4.0", "job description": "<div><div>Personalis, Inc. is a dynamic venture-backed company founded out of Stanford pioneering precision medicine by developing, cutting-edge NGS genomic solutions for immuno-oncology, cancer, and inherited disease. Based in Menlo Park, CA, Personalis' patented ACE platform (Accuracy and Content Enhanced) provides an integrated, innovative, high accuracy technological solution from NGS sequencing to interpretation for precision medicine applications. The ACE Platform forms the technological basis for enabling Personalis' leading products for immuno-oncology, cancer diagnostics, and inherited disease.\n<br><br>\nYou will work with a world-class, dynamic team of bioinformatics scientists, software engineers, laboratory scientists, assay developers, product managers, and clinicians applying our cutting-edge cancer and immuno-oncology solutions to plan, manage, analyze, and interpret impactful collaborative R&amp;D projects. You will be part of a team focused on development of the latest methods for analyzing genomics data, building analysis pipelines and algorithms, and validating tools for immuno-oncology, neoantigens, and cancer. Your work will contribute to a new generation of genomics based precision medicine products in immuno-oncology and cancer clinical trials, diagnostics, and therapeutics being used by pharma, biotech, hospitals and clinicians.\n<br><br>\nResponsibilities\n\n<ul>\n<li>Develop components of innovative cancer and immuno-oncology products, including development of novel approaches to neoantigen detection</li>\n\n<li>Develop methods for genomics based characterization of immuno-modulators and biomarkers for immuno-therapy</li>\n\n<li>Plan, develop, and manage scientific collaborations, applying internally developed cancer and immuno-oncology pipelines to detect somatic variants, neoantigens, and tumor escape mechanisms within high-profile and impactful partnerships</li>\n\n<li>Extrapolate collaborative findings, identifying new product applications, new product opportunities, and biomarkers for cancer treatment that will influence product development</li>\n\n<li>Work cross-functionally to translate collaborative findings into actively developed cutting-edge products</li>\n\n<li>Design and develop tools for high accuracy, comprehensive somatic variant detection from DNA and RNA sequence</li>\n\n<li>Design and implement validation strategies for both newly developed and existing genomics analysis tools and pipelines</li>\n\n<li>Publish results and present at conferences in the area of cancer and immuno-oncology</li>\n</ul>\nQualifications\n\n<ul>\n<li>Advanced degree (PhD) in bioinformatics, genomics, or a related field.</li>\n\n<li>Extensive experience in cancer genomics especially in immuno-oncology</li>\n\n<li>Extensive knowledge of neoantigens, immune checkpoints, tumor microenvironment, and tumor escape mechanisms.</li>\n\n<li>Experience developing bioinformatics pipelines and tools for NGS</li>\n\n<li>Extensive biostatistics and study design expertise</li>\n\n<li>Experience managing, analyzing, and interpreting impactful collaborations</li>\n\n<li>Experience with cancer genomics software: Mutect, Varscan2, etc.</li>\n\n<li>Familiarity with cancer databases: Cosmic, TCGA, etc.</li>\n\n<li>Experience of cancer variant detection – Small variants, fusions, CNAs, etc.</li>\n\n<li>Experience with standard genomics software: BWA, GATK, SAMTools, etc</li>\n\n<li>Familiarity with different assays, modes of sequencing, and analysis approaches (WGS vs. Exome, RNA-seq)</li>\n\n<li>Fluency in at least one common programming language (e.g., Python, R)</li>\n\n<li>Experience with BASH scripting and Unix/Linux command line tools</li>\n\n<li>Familiarity with version control systems, preferably Git a plus</li>\n\n<li>Familiarity with grid computing systems such as SGE a plus.</li>\n</ul>\nPersonalis is an equal opportunity employer. Personalis offers a competitive compensation package.</div>\n</div><div></div>"}