{"job title": "Research Scientist", "company": "Randstad Life Sciences", "city state": "– San Diego, CA", "rating": "NA", "job description": "Job Title: Associate Research Scientist\n<br><br>\nPosition Description\n\n\n<ul>\n<li>Seeking a mid-level and well-trained laboratory technician, who will assist the projects directed by Company employees. Candidates should have general laboratory skills in molecular biology, histology, and animal handling in the field of neuroscience.</li>\n</ul>\n\nPosition Responsibilities\n\n\n<ul>\n<li>General techniques in molecular biology and biochemical techniques including quantitative PCR and ELISA.</li>\n<li>Experience in histological tissue processing (brain sectioning, immunohistochemistry, fluorescence/confocal microscopy, imaging analysis).</li>\n<li>Experience in mouse handling.</li>\n<li>Excellent communication skills</li>\n<li>Ability to maintain experimental records, and collect and analyze data.</li>\n<li>Summarize and present data at internal meetings.</li>\n<li>Proficiency in stereotaxic surgery would be plus.</li>\n<li>Proficiency in primary neuronal cultures would be plus.</li>\n</ul>\n\nPosition Requirements\n\n\n<ul>\n<li>Bachelor degree in science</li>\n<li>At least 1 year experience in a research setting</li>\n<li>Ability to work independently while function within a team environment</li>\n</ul>\n\n<strong>Benefits</strong>\n\n\n<ul>\n<li>Medical, Dental, and Vision Insurance</li>\n<li>401K Plan with Company Match</li>\n<li>Life and AD&amp;D Insurance</li>\n</ul>\n\nEqual Opportunity Employer: Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.\n<br><br>\nQualified applicants in San Francisco with criminal histories will be considered for employment in accordance with the San Francisco Fair Chance Ordinance.\n<br><br>\nWe will consider for employment all qualified Applicants, including those with criminal histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles' Fair Chance Initiative for Hiring Ordinance.\n<br><br>\n<strong>Company Description:</strong>\n<br><br>\nRandstad is a $22.5 billion global provider of HR services and the second largest staffing organization in the world. From temporary staffing to permanent placement to in-house, professionals, search &amp; selection, and HR Solutions, Randstad holds top positions around the world and has approximately 31,100 corporate employees working from its nearly 4,700 branches and in-house locations in 40 countries.\n<br><br>\nWe are a company built on a deep network of expertise that crosses industries and geographies. We recognize that talent comes in different forms, that every business has its unique challenges and opportunities. And our recruiting experts are skilled at marrying talent and businessidentifying the ideal professionals for an organizations culture and its teams, its needs and its goals."}