{"job title": "Scientist I", "company": "Raytheon BBN Technologies", "city state": "– Albuquerque, New Mexico, United States", "rating": "3.4", "job description": "Raytheon Albuquerque is part of Raytheon Missile Systems’ (RMS’) Naval and Area Mission Defense (NAMD) product line, providing comprehensive expertise in high power electromagnetics (HPEM); pulsed power engineering, diagnostics and effects testing; radio frequency (RF) and particle code simulation; airborne flight test and satellite systems support and tracking; large facility operations, maintenance, and engineering; sensor development and diagnostics; control and data acquisition systems; software and automation; materials fabrication, assembly, processing and coating; quality engineering; and document production, imaging and management. Key growth opportunities include the integration of directed energy weapons with combat platforms. Raytheon Albuquerque is also a leader in development of linear accelerator technology for government and commercial applications.\n<br><br>\n<strong>Job Description:</strong> The successful candidate will develop technical solutions to a wide range of difficult problems related to the design, integration and test of sub-systems that will be integrated into directed energy products. The candidate will work under limited supervision while determining and developing independent solutions to meet overall design objectives. This position requires frequent interaction and coordination with electrical engineers, mechanical engineers, scientists, external customers, and a wide variety of support staff. The candidate will be expected to generate concepts, develop designs, test prototypes, and integrate subsystems into larger directed energy systems.\n<br><br>\n<strong>Principle Duties and Responsibilities:</strong>\n\n<ul>\n<li>Physics based simulation, design, and analysis of directed energy concepts, sub-systems and systems</li><li>Analysis of system performance and comparison with theoretical predictions</li><li>Collaborate and coordinate with a multi-disciplinary team of engineers, scientists, technicians, and support staff\n\n<ul>\n<li>Coordinate with physicists and engineers to determine mechanical system requirements</li><li>Coordinate with technicians to build and test mechanical designs</li><li>Coordinate with support staff to manage procurement, security and safety requirements</li><li>Coordinate with other mechanical engineers to develop and review designs and interface with other mechanical systems</li><li>Support and participate in team meetings, design reviews, engineering review boards, and configuration control boards</li><li>Coordinate with team leadership (program management, chief engineer, sub-team leads) to develop costs and schedules and to assess technical risks and opportunities</li></ul></li>\n</ul>\n\n<strong>Required Education/Experience</strong>\n<br><br>\nBachelor of Science Degree in Physics, Engineering, Mathematics, or equivalent experience\n<br><br>\n6+ years experience or equivalent advanced degree\n<br><br>\nActive DoD Top Secret Clearance or the ability to obtain a Top Secret Clearance\n<br><br>\n<strong>Desired Skills/Experience:</strong> \n<br>\nPh.D. in Physics, Engineering, or Mathematics\n<br>\n4+ years experience with directed energy systems (theory and experimentation)\n<br>\nExperience in physics based modeling, simulation, and analysis\n<br>\nSpecific experience in one or more of the following: charged particle beams, high power microwave systems, pulsed power, HPM systems, data analyses, radiation detectors, diagnostic instrumentation\n<br>\nAbility to work independently and be a self-starter\n<br>\nAbility to work in an interdisciplinary team setting\n<br>\nStrong written and oral communication skills including the ability to present material to customers\n<br>\nWorking knowledge of Microsoft Office (Word, Excel, Powerpoint)\n<br>\n<strong>123162</strong>"}