{"job title": "Environmental Scientist", "company": "Resource Management Concepts", "city state": "– Cincinnati, OH", "rating": "4.0", "job description": "Resource Management Concepts, Inc. (RMC) provides high-quality, professional services to government and commercial sectors. Our mission is to deliver exceptional management and technology solutions supporting the protection and preservation of the people and environment of the United States of America.\n<br><br>\nRMC has an Environmental Scientist position supporting the Environmental Management Program within the Transportation Security Administration's (TSA) Occupational Safety, Health, and Environment (OSHE) Division. TSA's OSHE Division ensures that TSA Headquarters, airport operations, and other TSA facilities comply with all relevant environmental laws and regulations. Responsibilities include interpreting various federal and state environmental laws, conducting compliance audits, developing audit report findings, conducting environmental training, and supporting outreach initiatives. This position has the ability to work remotely, in one of the following locations: PA, OH, and NC.\n<br><br>\nA bachelor's degree in environmental science, chemistry, or related field is required, plus three to five (3-5) years of relevant work experience is required. The candidate must have a thorough understanding of the local, State and Federal laws governing hazardous waste generators, including RCRA, CERCLA, CAA and CWA. The successful candidate will have experience with hazardous materials/hazardous waste management, and regulatory compliance analysis. Certified Hazardous Material Manager certification and ISO 14001 auditing experience are desired. Position requires air travel and significant walking during audits. The selected candidate should also have:\n\n\n<ul>\n<li>Experience supporting federal program managers and excellent customer engagement skills</li>\n<li>Ability to monitor and track program performance and support reporting requirements</li>\n<li>Ability to analyze and present technical data to technical and non-technical audiences</li>\n<li>Ability to balance multiple tasks, projects, and priorities</li>\n<li>Excellent writing, oral communication, and presentation skills.</li>\n</ul>\n\nSecurity Clearance: Applicant selected will be required to successfully complete a DHS/TSA background investigation and must meet eligibility requirements to be adjudicated for a security clearance.\n<br><br>\nRMC is an equal opportunity employer. All qualified women, minorities, individuals with disabilities and veterans are encouraged to apply for RMC job vacancies. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability status, protected veteran status, or any other characteristic protected by law."}