{"job title": "Soil Scientist", "company": "State of North Carolina", "city state": "– Raleigh, NC", "rating": "3.4", "job description": "Description of Work\n<br><br>\n<strong>THIS POSITION IS OPEN TO ALL APPLICANTS</strong>\n<br><br>\n(For current State employees, please note that as of June 1, 2018, promotional and RIF priority and salary administration will be made based on the new Statewide NC Classification System.)\n<br><br>\nGN Salary Grade: GN11\n<br><br>\nRecruitment Range: $42,780 - $55,000\n<br><br>\nLocation: Raleigh, NC\n<br><br>\n<strong>Division Summary:</strong>\n<br><br>\nThe Division of Water Resources' (DWR) mission is to protect the state's water supplies and foster stewardship of this natural resource for use by current and future generations of citizens. The Division comprises five Sections: Water Quality Regional Operations, Water Sciences, Public Water Supply, Water Quality Permitting, and Water Planning. This goal is achieved through providing technical assistance, consultative services, permitting of regulated entities, certification of water treatment plant operators and wastewater operators, inspection and compliance activities, laboratory analysis and testing, and educational outreach and training.\n<br><br>\n<strong>Branch Information:</strong>\n<br><br>\nThis position is part of the Animal Feeding Operations and Groundwater Protection Branch (AFOGPB) of the Water Quality Regional Operations Section. WQROS primarily focuses on the following program areas: animal feeding operations; underground injection control rules and well construction rules; oversight of groundwater incident management activities; and the provision of customer service and technical assistance to the general public, industry, and government agencies. Staff is responsible for permit actions for these program areas to include development of general permits or permit template language; permit application reviews and permit issuance; certification and/or authorizations; determination of the compliance status of permitted and regulated activities; the initiation of enforcement actions and legal orders; the evaluation of groundwater and surface water impacts and emergencies; and the implementation of new programs.\n<br><br>\n<strong>Position Information:</strong>\n<br><br>\nThis position is physically located at 512 N. Salisbury St., Raleigh, North Carolina. This position reviews land based operations and provides technical soils expertise to the AFOGPB supervisor in the review, development and management of the animal waste permitting program. This position is responsible for review of all animal waste applications with respect to the adequacy of the site and soils proposed to be used for land application of animal waste. This position is responsible for follow-up compliance and enforcement activities for animal operations in the State. This position is also responsible to review sites associated with non-compliant facilities that have caused environmental harm or facilities that currently have certified plans which are inadequate to meet state requirements. This position will serve as technical resource to Section staff and will assist the Section with special assignments.\n<br><br>\n<strong>Other Requirements:</strong>\n\n\n<ul>\n<li>Travel throughout the state, including some overnight travel</li>\n<li>Valid driver's license</li>\n<li>Limited physical effort will be required except for field inspections, which may require extensive walking</li>\n<li>Work in all types of inclement weather, heat, cold, rain during field inspections or training, and could be exposed to insects such as ticks, small rodents</li>\n</ul>\n\nKnowledge, Skills and Abilities / Competencies\n<br><br>\nTo receive credit for your work history and credentials, you must list the information on the application. Any information omitted from the application, listed under the text resume section, or on an attachment will not be considered for qualifying credit\n<br><br>\nQualified applicants must possess, and the application must clearly reflect, the minimum education and experience requirements and work experience that demonstrates the following Knowledge, Skills, and Abilities:\n\n\n<ul>\n<li>Considerable knowledge of soils, hydrology and hydraulics</li>\n<li>Considerable knowledge of agriculture processes and operations</li>\n<li>Working knowledge of chemistry and biology as it applies to water quality and wastewater treatment facilities</li>\n<li>Ability to review and critique site information, soil reports submitted, and soil data evaluations</li>\n<li>Ability to analyze, manipulate, and evaluate geographical information systems (GIS) to produce reports and/or maps</li>\n<li>Considerable experience in verbal, written and interpersonal skills in difficult or unfamiliar situations dealing with the general public, applicants, local governments, engineers, and consultants</li>\n<li>Considerable skills and knowledge with Microsoft Office suite, databases, data management, and spreadsheets</li>\n</ul>\n\nInterviewed candidates may be required to complete a skills assessment. Minimum Education and Experience Requirements\n<br><br>\nBachelor's degree in one of the agricultural, biological, engineering, environmental or natural resource sciences or a closely related curriculum from an appropriately accredited institution and two (2) years of experience related to the area of assignment; or an equivalent combination of education and experience.\n<br><br>\nSupplemental and Contact Information\n<br><br>\nTo apply for this position, please click the APPLY button. All relevant experience must be included on the application to receive proper credit. Resumes may be uploaded with your application, but will not be accepted in lieu of a fully completed application and will not be considered for qualifying credit. \"See Resume\" or \"See Attachment\" will NOT be accepted.\n<br><br>\nIf multiple applications are submitted by an applicant to an individual position, only the most recent application received prior to the posting closing date will be accepted. Applications must be submitted by 5:00 PM on the closing date.\n<br><br>\nApplicants requesting and / or receiving an accommodation via the Americans with Disabilities Act (ADA) are eligible to submit paper applications via mail or by fax but must be received by 5:00 PM on the closing date.\n<br><br>\nPersons eligible for veteran's preference must upload a copy of Form DD-214 and attach to the application.\n<br><br>\nPersons eligible for RIF priority must upload their letter of notification and attach to the application. This applies to those employees that are subject to Articles 1, 2, 5, 6, 7, 8, 13 and 14 of G.S. 126. This does not include employees of the legislative and judicial branches, the public school and community college systems, or other employees that are exempt from these Articles of the Human Resources Act.\n<br><br>\nThe Department of Environmental Quality (DEQ) uses the Merit-Based Recruitment and Selection Plan to fill positions subject to the State Personnel Act with the most qualified applicants. When a hiring range is posted, the actual salary will be based on relevant competencies, knowledge, skills and abilities, internal equity and budgetary considerations pertinent to the advertised position.\n<br><br>\nThe State of North Carolina is an Equal Opportunity Employer.\n<br><br>\nLearn more about Division of Water Resources by visiting http://www.ncwater.org\n<br><br>\nTo create an account please follow this link for instructions: https://www.government jobs.com/Home/ApplicationGuide If you are having technical issues logging into your account or applying for a position, please review the Get Help/FAQs information on the website. If you are still experiencing technical issues with your application, please call the NeoGov Help Line at 855-524-5627.\n<br><br>\n<strong>Contact Person:</strong>\n<br><br>\nTaSheba Dukes\n<br><br>\n<strong>919-707-9195</strong>\n<br><br>\ntasheba.dukes@ncdenr.gov"}