{"job title": "Assistant Scientist", "company": "Terracon", "city state": "– Las Vegas, Nevada", "rating": "3.4", "job description": "<p></p><p><strong>Job Description</strong></p><div><strong>General Responsibilities:</strong><br>Conduct environmental site investigations, assessments and surveys to sample, measure and analyze air, water, material, and soil. Identify, evaluate and recommend risk and remediation strategies/designs to ensure compliance with federal, state and local regulations. Prepare applicable permit applications, risk assessments and technical documents including proposals, reports and regulatory agency correspondence. Design systems and environmental protection plans. Projects may include Phase I/II environmental site assessments, ecological and natural resource field surveys, tank closure assessments, asbestos abatement, storm water management, and site planning and permitting.<br><br><strong>Essential Roles and Responsibilities:</strong><ul><li>Follow safety rules, guidelines and standards for all projects. Participate in pre-task planning. Report any safety issues or concerns to management.</li><li>Be responsible for maintaining quality standards on all projects.</li><li>Entry level scientific professional responsible for gathering data and information to be evaluated by other team members. </li><li>Performs testing and sampling of environmental materials including soil, air, groundwater, building materials, and noise.</li><li>Tabulate and prepare data for written reports. </li><li>May assist with report preparation by summarizing data and information within reports.</li><li>Operates field monitoring equipment. </li><li>Assists with operation and maintenance of remediation systems. </li><li>May assist with asbestos surveys, abatement projects and Phase I site assessments. </li><li>Transport material samples or documents to the lab for further testing and analysis. </li><li>Maintains and calibrates field monitoring equipment. </li></ul><strong>Requirements:</strong><ul><li>Bachelors degree in Environmental Science or related science field. Or, in lieu of a degree, a minimum of 4 years related experience.</li><li>Valid drivers license with acceptable violation history.</li></ul><div><strong>Preferred Certification: </strong><ul><li>Certification in field of expertise.</li></ul></div></div><p></p><p><strong>About Terracon</strong></p>Terracon is a 100 percent employee-owned consulting engineering firm providing quality services to clients. Since 1965, Terracon has evolved into a successful multi-discipline firm specializing in environmental, facilities, geotechnical, and materials services. Terracon currently has more than 4,000 employees in over 140 offices with services available in all 50 states. Terracons growth is due to valued employees exceeding expectations in client service and growing their careers with new and exciting opportunities in the marketplace.<br><br>Terracon offers an excellent compensation and benefits package including: medical, dental, vision, life insurance, 401(k) plan, and paid holidays.<p></p><p><strong>EEO Statement</strong></p>Terracon is an EEO employer. We encourage qualified minority, female, veteran and disabled candidates to apply and be considered for open positions. We do not discriminate against any applicant for employment, or any employee because of race, color, religion, national origin, age, sex, sexual orientation, gender identity, gender, disability, age, or military status."}