{"job title": "Research Scientist, Immunology", "company": "The Broad Institute", "city state": "– Cambridge, MA", "rating": "4.2", "job description": "<strong>Job Description</strong>\n<br><br>\n<strong>GENERAL SUMMARY/ OVERVIEW STATEMENT:</strong>\n<br><br>\nThe Xavier Lab, led by Dr. Ramnik Xavier, is inviting applications for a Research Scientist position in immunology to study the molecular pathogenesis of inflammatory bowel disease (IBD) and autoimmunity. Research projects aim to translate genetic leads into clinical insights by (1) placing IBD-risk genes into biological pathways, (2) identifying molecular mechanisms of action for candidate genes, (3) defining cell type-specific functions for these genes in vivo, and (4) prioritizing therapeutic targets. Positions offer training in functional genomics, opportunities for multidisciplinary collaboration, and access to an expansive technology infrastructure.\n<br><br>\nThe successful candidate will be a results-focused, team-oriented, creative, bench scientist, able to excel in a fast-track environment. He or she must be self-motivated, detail-oriented and exhibit strong problem-solving skills. In addition, the successful candidate should be a clear and effective communicator, demonstrating strong interpersonal skills to enable collaboration with project teams, peers, and management in identifying and achieving research goals.\n<br><br>\n<strong>PRINCIPAL DUTIES AND RESPONSIBILITIES:</strong>\n<ul>\n<li>Design, execute and interpret cell-based, biochemical, and in vivo experiments necessary to validate target genes for therapeutic discovery.</li><li>Maintain cell lines and isolate primary cells for use in cell-based assays.</li><li>Work with informatics and computational scientists to integrate and interpret screening and functional genomic data sets.</li><li>Perform detailed characterization and cellular mechanism of action studies of chemically optimized compounds.</li><li>Work with team to design and execute research plans to ensure that critical project requirements, timelines, and deliverables are met.</li><li>Troubleshoot and solve scientific problems independently.</li><li>Identify, investigate and implement new methods and technologies based on scientific needs.</li><li>Train investigators in techniques relating to molecular biology, tissue culture and mouse models.</li> <li>Contribute to scientific literature and present research at scientific forums.</li><li>Effectively present results to cross-functional project teams.</li><li>Assist in laboratory management.</li>\n</ul>\n<strong>SKILLS/ABILITIES/COMPETENCIES REQUIRED:</strong>\n<ul>\n<li>Excellent publication record</li><li>Demonstrated ability to work independently and productively.</li> <li>Strong research design and analytical skills, with demonstrated ability to problem solve.</li> <li>Strong teaching skills and ability to supervise trainees and students.</li><li>In depth knowledge of field of research.</li><li>A proven record of successful interactions within multidisciplinary teams.</li><li>Cell-based assay development experience with special emphasis on functional genomic methods for target validation (e.g. shRNA, CRISPR).</li><li>Significant experience in cell culture techniques including use of mammalian cell lines and primary human cells. Experience working with mouse models is a plus.</li>\n</ul>\n<strong>QUALIFICATIONS:</strong>\n<br><br>\nEducation:\n<ul>\n<li>Ph.D. and 5 years of experience in immunology or cellular and molecular biology or a related life science field</li>\n</ul>\nExperience:\n<ul>\n<li>Experience working with mouse models is preferred</li>\n</ul>\nSupervisory responsibility:\n<ul>\n<li>May provide oversight to students and research trainees.</li>\n</ul>\nEOE / Minorities / Females / Protected Veterans / Disabilities\n<br><br>\n<strong>EEO is The Law - click here for more information</strong>\n<br><br>\n<strong>Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled</strong>"}