{"job title": "Data Architect", "company": "The University of Kansas", "city state": "– Lawrence, KS", "rating": "4.0", "job description": "<strong>Job Title</strong>\n<br>\nData Architect\n<br><br>\n11-Sep-2018\n<br><br>\n<strong>Department</strong>\n<br>\nBusiness Intelligence Center\n<br><br>\n<strong>Work Location</strong>\n<br>\nUniversity of Kansas - Lawrence\n<br><br>\n<strong>Job Description</strong>\n<br>\n<strong>Data Modeling (45%)</strong>: Build, oversee and design the Oracle repository with all data models to support reporting in Oracle Analytics Cloud BI application. Design Dimensional Fact data models (i.e. STAR Schema) for the various subject areas of the university according to the priorities established by the Director. Work with BI analysts, functional users, and data scientists to develop and further enhance data models. Ensure all data modeled in the warehouse has appropriate documentation. Coordinate metadata generation related to primary data in the warehouse and ensure it is stored/managed in a format that can be analyzed, used in future development, and supports university retention policy enforcement. Ensure data in the warehouse is appropriately and routinely reconciled with source systems (in an automated fashion whenever possible).\n<br><br>\n<strong>Leadership (45%)</strong>: Oversee a technical team of ETL and Essbase developers that extract and model data from various source systems. Provide leadership, analytical, technical, and web-based support using a variety of tools to support the reporting and analytical needs of units reporting to the Vice Provost for Administration and Finance. Serve as a key member representing the BIC with university data governance. Ensure teams are adhering to basic development principles (e.g. change control and separation of duties). Communicate frequently with campus leadership providing status updates on projects. Help promote the concept and importance of data warehousing and business intelligence, educating the campus on available data and toolsets to meet end user needs.\n<br><br>\n<strong>Infrastructure Planning and Support (5%)</strong>: Ensure the data warehouse, ETL tools, etc. are maintained by Information Technology and/or Data Modelers. Take a lead role in developing a university data warehousing strategy and infrastructure. Work with the Network Operations Center (NOC) to ensure extract jobs are monitored and that issues are appropriately escalated, communicated, and ultimately resolved.\n<br><br>\n<strong>Development (5%)</strong>: Develop and maintain ETL processes and/or SOL from various source systems. Participate in an Agile environment and complete assigned sprint tasks. Adhere to basic development principles (e.g., change control, separation of duties, etc.). Provide feedback from a technical perspective on requirements documents. Additionally, create data flows, and process models to help document the technical approach to meeting end user needs.\n<br><br>\n<strong>Req ID (Ex: 10567BR)</strong> \n<br>\n<strong>12832BR</strong>\n<br><br>\n<strong>Disclaimer</strong>\n<br>\nThe University of Kansas prohibits discrimination on the basis of race, color, ethnicity, religion, sex, national origin, age, ancestry, disability, status as a veteran, sexual orientation, marital status, parental status, gender identity, gender expression, genetic information and retaliation in the University's programs and activities. Access to information regarding equal opportunity and diversity worksite posters is available at http://www.humanresources.ku.edu/policies_procedures/category_details/index.aspx?category=8 or you may contact 785-864-4946 or employ@ku.edu for alternate access options. Any inquiries regarding the non-discrimination policies should be directed to: Executive Director of the Office of Institutional Opportunity and Access, IOA@ku.edu, 1246 W. Campus Road, Room 153A, Lawrence, KS, 66045, (785)864-6414, 711 TTY.\n<br><br>\n<strong>Work Schedule</strong>\n<br>\nMonday - Friday 8am - 5pm\n<br><br>\n<strong>FLSA Status</strong>\n<br>\nComputer (Salaried)\n<br><br>\n<strong>Contact Information to Applicants</strong>\n<br>\nNick Stevens, nickstevens@ku.edu\n<br><br>\n<strong>Required Qualifications</strong>\n\n<ul>\n<li>Bachelor's degree in Computer Science, Mathematics, Statistics, Business Administration with a concentration in Finance or related field.</li><li>3 years of data modeling and analytics, including 2 years in a university environment, including experience with Oracle Business Intelligence tools (OBIEE, BICS, or OAC), Oracle Data Integrator and SAS DI Studio Extract-Transform-Load (ETL) tools, SAS and Tableau server administration, security, Oracle database and SQL programming experience.</li>\n</ul>\n\n<strong>Employee Class</strong>\n<br>\nU-Unclassified Professional Staff\n<br><br>\n<strong>Advertised Salary Range</strong>\n<br>\n$104,450 - $115,000/yr.\n<br><br>\n<strong>FTE</strong>\n\n\n<ul>\n<li>0</li>\n</ul>\n\n<strong>Position Overview</strong>\n<br>\nServes as the lead architect in Business Intelligence Center to conceptualize, design, create, prototype, and implement data models to support the administrative, research, instruction, and service needs of the university. Assists the Office of Institutional Research and Planning (OIRP) with supporting the current data marts and works with OIRP staff to design a migration strategy for those data sets to the new data warehouse. The position does this by overseeing a team of Data Modelers and working closely with BI Analysts, Information Technology, and ERP/system subject matter experts (SMEs) to extract data from source systems, transform data as necessary, and ultimately load data into the university's Data Warehouse. The Data Architect takes a lead role in helping to design the technical infrastructure and subject area data models to support the strategic objectives of the BIC and ultimately the university from a data management perspective. The position ensures data modelers are following industry best practices in terms of code development and data modeling, successfully extracting data from various source systems using agile methodologies. Finally, the incumbent serves as an expert on university data availability within and overall architecture of the data warehouse. Performs other projects as assigned.\n<br><br>\n<strong>Reg/Temp</strong>\n<br>\nRegular\n<br><br>\n<strong>Application Review Begins</strong>\n<br>\n15-Oct-2018\n<br><br>\n<strong>Anticipated Start Date</strong>\n<br>\n04-Nov-2018\n<br><br>\n<strong>Additional Candidate Instruction</strong>\n<br>\nA complete application consists of a cover letter, resume, and three professional references. Please use your cover letter to address how you meet the required qualifications. Incomplete applications will not be considered. An online University of Kansas application must be completed to be considered for this position.\n<br><br>\n<strong>Applicant review will begin October 15 and continue until filled.</strong>\n<br><br>\n<strong>Job Family</strong>\n<br>\nInformation Technology-KUL\n<br>"}