{"job title": "Engineer (Scientist 3)", "company": "Trace Systems", "city state": "– US-FL-Tampa", "rating": "4.0", "job description": "<div><div>\n<div><strong><em>Trace Systems</em></strong>, headquartered in Vienna, Virginia, was founded in 1999 to support and defend our nation's security interests at home and abroad–– <em>whenever and wherever</em>. We provide cybersecurity, intelligence, communications, networking and information technology services, systems, and solutions to the United States Department of Defense, Intelligence Community and Department of Homeland Security.\n<br><br>\n<strong>Job Title:</strong> Engineer (Scientist 3)\n<br><br>\n<strong>Job Location</strong>: Tampa, Florida\n<br><br>\n<strong>Security Clearance:</strong> Secret</div>\n</div>\n</div>\n\n<br>Job Responsibilities<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li>Systems/Software Engineer</li><li>Functional Responsibility: Analyzes, develops, tests and modifies hardware and/or software solutions to meet the user’s systems analysis and/or systems integration requirements.</li> <li>Coordinates with user to identify data availability, report requirements, and systems design problems.</li> <li>Defines system objectives and prepares system design specifications to meet user requirements and satisfy interface problems.</li> <li>Reviews work products for correctness, adherence to the design concept and user standards, and progress in accordance with schedules.</li> <li>Prepares status reports and presentations on task performance to clients.</li> <li>May provide daily supervision and direction to support staff.</li><li>Perform additional duties as required.</li></ul></div>\n</div>\n</div>\n\n<br>Minimum Qualifications<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li> Six (6) years of experience in design and development, to include: Systems Analysis, Systems Architecture, Systems/Equipment Support, Test and Evaluation, and Logistics support of C4ISR requirements.</li> <li>Three (3) years of technical experience in support of C4ISR and information management systems.</li><li>Must be a US Citizen with an Active Secret Clearance.</li></ul></div>\n</div>\n</div>\n\n<br>Desired Qualifications<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li>Working towards the following certifications within one and a half year of assuming duties: Certified Software Development Professional (CSDP), or with COR approval complete a vendor/platform specific certification (e.g., Microsoft Certified Solutions Developer (MCSD), Microsoft Certified Applications Developer (MCAD), Microsoft Certified Database Administrator (MCDBA), Sun Certified Professional (SCP), Red Hat Certification Program (RHCP), CISCO Certified Network Professional (CCNP), Oracle Certified Professional (OCP), other)</li></ul></div>\n</div>\n</div>\n\n<br>Education<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li>BS degree in Engineering, Computer Science, or IT</li></ul></div>\n</div>\n</div>\n\n<br>Security Clearance<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li>Secret</li>\n</ul>\n<strong><em>To Apply:</em></strong><em> We invite you to put your talents to work by joining a growing team of dynamic professionals here at <strong>Trace Systems</strong>! Be part of a culture at our leading edge company where you can achieve great things while fostering a satisfying and rewarding career progression. Please apply directly through the website at:</em> <em>www.tracesystems.com</em><em>.</em> #jointracesystems\n<br><br>\n<em>For any additional questions or to submit any referrals, please contact</em> <em>dclement@tracesystems.com</em>\n<br><br>\n<strong><em>Trace Systems</em></strong><em> is an Equal Opportunity and Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.</em></div>\n</div>\n</div>\n<br>"}