{"job title": "Data Analyst", "company": "Travelers Companies", "city state": "– Hartford, CT", "rating": "3.8", "job description": "<strong>Company Information</strong>\n<br>\nSolid reputation, passionate people and endless opportunities. That's Travelers. Our superior financial strength and consistent record of strong operating returns mean security for our customers - and opportunities for our employees. You will find Travelers to be full of energy and a workplace in which you truly can make a difference.\n<br><br>\n<strong>Job Summary</strong>\n<br>\nPositions within this family design and develop information for strategic, planning, operational and analytical purposes in support of decision making by the business. This position performs accountabilities under general supervision. Position is an intermediate level role, requiring some previous Information Delivery experience. Position accountable for performing core tasks of Information Delivery under general supervision. Responsible for the development, automating, compiling, and preparing reports, etc., under general supervision. Collection of data. Integration of that data. Development (prototyping and production build). Unit test. This job does not lead others. General Supervision: incumbents are told what to do, but not how to do it. Incumbents have some discretion to perform work accountabilities.\n<br><br>\n<strong>Marketing Description</strong>\n<br>\nThis is a great opportunity to join the Enterprise TPA Management team which is part of the Claim organization. In this position you will be part of a team responsible for keeping our Third Party Administrator claim database accurate and up-to-date. This role requires in-depth handling and analysis of data from multiple sources in various electronic formats. Effective phone and email skills are needed for effectively communicating with contractors and vendors as well as internal partners. Hands-on position where you will be working directly with the data and the external TPAs and accounts who provide it.\n<br><br>\n<strong>Primary Job Duties &amp; Responsibilities</strong>\n<br>\nResponsible for the development, automating, compiling, and preparing reports, etc. (Completed with initial direction but actual tasks completed independently). Understands solution design satisfying the business requirements and uses knowledge within assigned tasks. Contributes to development of unit and integration plans and executes those plans them for assigned tasks; complete system testing working with Quality Assurance specialists as needed. Unit tests are written to verity that pieces of code are doing what it is intended to do. Integration tests are done to demonstrate that different pieces of the system work together. These tests cover whole applications and require more extensive analytic skills to complete. Provide input into the development of system testing strategy and plans. Validates that developed solutions align with defined business requirements. Support the transition and production process; develops documentation (Knowledge Acquisitions Process document) for all deliverables before moving to production so that it can be supported on ongoing basis. Responsible for overseeing and consulting with IT to develop solutions on assignments. Provides input on root cause analysis of production defects and schedule for correction as needed, under general supervision. Participates with team members in developing training and providing user groups with aspects of their technical training as needed. Contributes to implementation of strategic plan for Information Delivery. Continues to expand knowledge of broader range of Business Intelligence products and tools. Other duties as assigned.\n<br><br>\n<strong>Minimum Qualifications</strong>\n<br>\nBachelors degree in MIS, Mathematics, Finance, Statistics, Electrical Engineering, Technology, Computer Science, or Computer Engineering or the equivalent education or 2 years experience in information delivery or related field required.\n<br><br>\n<strong>Education, Work Experience &amp; Knowledge</strong>\n<br>\nBachelors degree in STEM (Science, Technology, Engineering, Mathematics), or related field or equivalent experience preferred. 2+ years working with programming languages specific to function supported preferred. 2+ years working with analytic tools/models preferred. Working knowledge of Information Delivery practices and processes. Working Knowledge: Understands basic principles and terminology in order to understand and solve simple problems.\n<br><br>\n<strong>Job Specific &amp; Technical Skills &amp; Competencies</strong>\n<br>\nDemonstrated intermediate analytic and diagnostic skills. Demonstrated intermediate interpersonal skills. Demonstrated intermediate communication and presentation skills. Ability to work independently and as part of a team. Demonstrated ability to influence others. Intermediate project management skills. Working understanding of the business functions, processes, and overall business strategies. Demonstrated ability to see results to completion. Intermediate business acumen. Seeks opportunities to learn. Intermediate problem solving and decision making skills. Definition of Intermediate skill/competency level: demonstrates solid knowledge and ability; can apply the competency with minimal or no guidance, in the full range of typical situations. Requires guidance handling novel or more complex situations.\n<br><br>\n<strong>Physical Requirements</strong>\n<br>\nRequires extended periods of computer use. Requires extended periods of sitting.\n<br><br>\n<strong>Equal Employment Opportunity Statement</strong>\n<br>\nTravelers is an equal opportunity employer."}