{"job title": "Wetland Scientist", "company": "TRC Companies, Inc.", "city state": "– Cleveland, OH", "rating": "3.5", "job description": "A pioneer in groundbreaking scientific and engineering developments since the 1960s, TRC is a global consulting, engineering and construction management firm that provides technology-enabled solutions to the power, oil and gas, environmental and infrastructure markets. We serve a broad range of public and private clients, steering complex projects from concept to completion to help solve the toughest challenges.\n<br><br>\nTRC has more than 4,000 employees located in 120 offices throughout the United States, the UK and China. TRC is ranked #19 on ENR's list of the Top 500 Design Firms in the United States.\n<br><br>\n<strong>Job Overview:</strong>\n<br><br>\nWe are seeking a Wetland Scientist / Field Ecologist to join our Permitting, Planning and Licensing team. The successful candidate will report to our Cleveland, OH office and will be involved in a wide variety of energy-related projects (including electric transmission, natural gas pipeline, renewable energy (wind/solar), as well as transportation and other development projects.\n\n\n<ul>\n<li>Preference will be given to applicants with the ability to conduct wetland delineations and functional assessments, wildlife surveys, rare plant surveys, as well as other diverse biological field work.</li>\n<li>The applicant should also have an ability to identify plant species commonly found in the northeastern U.S. and should be able to collect accurate data in the field and produce professional reports in the office.</li>\n<li>The successful candidate will also be able to perform well with minimal supervision and have familiarity with reviewing site plans, and GPS and GIS technologies.</li>\n</ul>\n\n<strong>Basic Requirements:</strong>\n\n\n<ul>\n<li>Bachelor's Degree in Environmental Science, Biology, Natural Resources or related field.</li>\n<li>4 -- 8 years of post-degree experience wetlands permitting, delineation, permit compliance monitoring and inspections for construction projects.</li>\n<li>Excellent data collection, technical writing and communication skills are mandatory.</li>\n<li>The ability to maintain a positive attitude during year-round field work in a variety of weather conditions.</li>\n<li>Knowledge of plant species, soil types, and hydrology is mandatory.</li>\n<li>Solid understanding of erosion and sediment control, best management practices commonly implemented during construction, and familiarity with construction of energy and/or transportation-related projects is preferred.</li>\n</ul>\n\nTRC offers career advancement potential and a competitive compensation package including a 401k plan with a company match. For more information about TRC or to apply for this position please visit our website at www.trcsolutions.com.\n<br><br>\nEOE/Minorities/Female/Protected Veterans/Disabled"}