{"job title": "Research Scientist/engineer - Assistant", "company": "University of Washington", "city state": "– Seattle, WA", "rating": "4.1", "job description": "As a UW employee, you will enjoy generous benefits and work/life programs. For a complete description of our benefits for this position, please visit our website, click here. As a UW employee, you have a unique opportunity to change lives on our campuses, in our state and around the world. UW employees offer their boundless energy, creative problem solving skills and dedication to build stronger minds and a healthier world.\n<br><br>\nUW faculty and staff also enjoy outstanding benefits, professional growth opportunities and unique resources in an environment noted for diversity, intellectual excitement, artistic pursuits and natural beauty. All of which has allowed the UW to be nationally recognized as a \"Great College to Work For\" for four consecutive years.\n<br><br>\nThe Department of Microbiology is one of the premier biological science departments in the country. The department has a national reputation for high quality teaching and an international reputation for excellence in research. Because of the revolution in biology that began in the 1970s, rapid advances in microbiology and the development of biotechnology have increased our understanding of all living systems. This has in large part been determined by studies of microorganisms. The research programs of the faculty in the Department of Microbiology at the University of Washington reflect exciting areas of modern microbiology. Our faculty span a broad range of interests including microbial ecology, physiology, virology, and microbial pathogenesis in both animal and plant systems. The members of our department are largely concerned with understanding the mechanisms by which organisms interact with one another and with their environment at the cellular and molecular levels. Because of the strong interdisciplinary nature of these interests, numerous collaborative efforts between our faculty and those in other science and medicine departments have developed.\n<br><br>\nThe Department of Microbiology currently has an outstanding opportunity for a Research Scientist/Engineer Assistant.\n<br><br>\nThe primary job functions are to perform laboratory procedures toward goals of specific research projects. Perform research aimed at understanding the mechanisms and phenotypic traits of Pseudomonas aeruginosa and other bacterial pathogens using cultures from patients with Cystic Fibrosis.\n<br><br>\nExperimental techniques to be performed are primarily with small animal models of infection and will include:\n\n\n<ul>\n<li>15% Processing samples from sputum.</li>\n<li>20% Basic molecular biology, including DNA preparation and qPCR.</li>\n<li>10% Molecular manipulation of bacteria including cloning, mutant construction, and preparing samples for genomic sequencing.</li>\n<li>5% Isolate and characterize bacteria and prepare DNA from clinical samples.</li>\n<li>10% Organize and analyze clinical samples and research data.</li>\n<li>20% Assist laboratory members with experiments.</li>\n<li>5% Prepare laboratory reagents.</li>\n<li>5% Restock laboratory supplies.</li>\n<li>5% Participate in laboratory meetings and establish ownership of research projects.</li>\n<li>5% Perform related duties as required.</li>\n</ul>\n\n<strong>Minimum Requirements:</strong>\n\n\n<ul>\n<li>Bachelor's Degree in Biology, Microbiology or other pertinent science field.</li>\n<li>2+ years of experience working in a research setting.</li>\n<li>Experience with research in the field of Cystic Fibrosis.</li>\n<li>Working knowledge of mechanisms for correcting genetic defects in the CFTR.</li>\n<li>Working knowledge of sterile microbiological handling techniques.</li>\n<li>Experience with culture of primary respiratory cells.</li>\n<li>Experience with standard molecular biological techniques.</li>\n<li>Ability to perform basic bioinformatic analysis.</li>\n<li>Excellent communication and record keeping skills.</li>\n</ul>\n\n<strong>Desired knowledge, skills and experience:</strong>\n\n\n<ul>\n<li>Interest in chronic infections and antibiotic resistance.</li>\n<li>Completion of an independent research project under the supervision of senior lab members.</li>\n<li>Prior attendance at national research conferences and experience with presenting posters at regional scientific conferences.</li>\n<li>Experience with DNA preparation, PCR, sterile procedure, media preparation, chemical transformation and use/evaluation of antibiotic effectiveness.</li>\n<li>Demonstrates scientific writing skills.</li>\n</ul>\n\n<strong>Application Process:</strong>\n<br><br>\nThe application process for UW positions may include completion of a variety of online assessments to obtain additional information that will be used in the evaluation process. These assessments may include Work Authorization, Cover Letter and/or others. Any assessments that you need to complete will appear on your screen as soon as you select \"Apply to this position\". Once you begin an assessment, it must be completed at that time; if you do not complete the assessment you will be prompted to do so the next time you access your \"My Jobs\" page. If you select to take it later, it will appear on your \"My Jobs\" page to take when you are ready. Please note that your application will not be reviewed, and you will not be considered for this position until all required assessments have been completed.REQUIREMENTS:Bachelor's - Microbiology"}