{"job title": "Senior Applied Scientist - Personalization", "company": "Zillow", "city state": "– Seattle", "rating": "4.2", "job description": "About the teamZillow’s Personalization team is focused on all things related to personalized search and recommendation. We are always looking for the best model for the job, whether it is a random forest, deep neural nets, matrix factorization, or GLM. If we cannot find one, we will invent it. The work we do is at the core of Zillow’s mission to empower the consumer and provide them with the tools to make informed decisions. Learn more at https://www.zillow.com/data-science and https://www.zillow.com/engineeringAbout the role<br><br>Zillow is looking for a Senior Applied Scientist to join our Personalization team. This is a high-impact role as Personalization, Recommendation Systems, and related products are some of the most influential features on the Zillow site and are critical to the company’s mission to create the largest, most-trusted, and vibrant home-related market in the world. You will:\n<ul>\n\n<li>Collaborate with other Applied Scientists and Machine Learning Engineers to conduct cutting-edge applied research contributing to Personalization related products, like our home and rental recommendation engine</li>\n</ul>\n\n<ul>\n\n<li>Find insights in diverse data sets and leverage those signals by applying and developing state of the art machine learning or statistical techniques</li>\n<li>Work closely with machine learning engineers to productionize and ship those models</li>\n<li>Help build a better real estate experience for consumers, and a deeper understanding of our business and customers</li>\n<li>Develop new techniques, author papers, and present at conferences to show off your novel work, giving back to the larger Machine Learning community</li>\n\n</ul>\n\nWho you are\n\n<ul>\n<li>Have demonstrated project or team leadership (preferred)</li>\n<li>Have experience building recommendation systems through methodologies like collaborative filtering, content modelling, and deep learning.</li>\n<li>Expert in algorithms for supervised or unsupervised learning with an interest in contributing to and extending open source libraries</li>\n<li>Completed a Master’s degree or PhD in Computer Science, Statistics, Applied Mathematics, Operations Research, Econometrics, or related scientific discipline involving mathematical modelling (preferred)</li>\n<li>2+ years industry experience with machine learning applied to big data</li>\n<li>Proven ability to conduct research, assimilate state-of-the-art methods from research papers, and turn product requirements in to algorithmic solutions.</li>\n<li>Looking to work on a team to solve challenging problems</li>\n<li>Regularly working in at least one of Python or R</li>\n\n</ul>\n\nGet to know usZillow is the leading real estate and rental marketplace dedicated to empowering consumers with data, inspiration and knowledge around the place they call home, and connecting them with the best local professionals who can help. Zillow is part of Zillow Group, whose mission is to build the largest, most trusted and vibrant home-related marketplace in the world.<br><br>Zillow Group is owned, fueled and grown by innovators who help people make better, smarter decisions around all things home. We encourage one another at every level, and our efforts are supported by employee-driven, world-class benefits that enable us to enjoy our lives outside the office while building fulfilling careers that impact millions of individuals every day.\n<br><br>\nZillow Group is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. Therefore, we provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, or any other protected status in accordance with applicable law. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know."}