{"job title": "Applied Scientist, Personalization - Intern", "company": "Zillow", "city state": "– Seattle", "rating": "4.2", "job description": "About the teamThe mission of the Zillow AI division is to create unique content and features powered by sophisticated analytics and machine learning technologies atop our unparalleled living database of all homes and hundreds of millions of customers.\n<br><br>\nWe're a fast-moving, developer-driven organization full of brilliant and ambitious people. Zillow product development is highly decentralized in order to create the small team speed and autonomy of a start-up environment while backed by big company resources.\n<br><br>\nWe are responsible for building distributed, big data, machine-learning applications in the cloud. These consumer-facing products power Zillow’s industry-leading online marketplace and puts the team and this role at the core of Zillow’s mission to empower the consumer.\n<br><br>\nLearn more about what we are doing at https://www.zillow.com/data-science.About the role<br><br>The Zillow AI, Personalization team is hiring Applied Scientist Interns to conduct research and contribute to the production of personalized intelligent systems. This is a high-impact role as Personalization, Recommender Systems, and related products are some of the most influential features on the Zillow site and are critical to the company’s mission to create the largest, most-trusted, and vibrant home-related market in the world.\n<br><br>\n<strong>You will:</strong>\n<ul>\n\n<li><strong>Collaborate with other Applied Scientists and Machine Learning Engineers to conduct cutting-edge applied research contributing to Personalization related products, such as our home and rental recommendation engine.</strong></li>\n<li><strong>Find insights in diverse data sets and leverage those signals by applying and developing state of the art machine learning and statistical techniques.</strong></li>\n<li><strong>Work closely with machine learning engineers to learn how to productionize and ship those models.</strong></li>\n<li><strong>Help build a better, more personal real estate experience for consumers, and a deeper understanding of our business and customers.</strong></li>\n<li><strong>Develop new techniques, contribute to writing papers and or blog posts to show off your novel work, giving back to the larger Machine Learning community.</strong></li>\n\n</ul>\n\nWho you are\n\n<ul>\n\n<li><strong>Excited to look for insights in data and conduct feature engineering to leverage those signals in new ML and statistical models</strong></li>\n<li><strong>Able to build explanatory models to better understand our customers and business.</strong></li>\n<li><strong>Have a desire to build new ML models using state-of-the-art techniques and tools.</strong></li>\n<li><strong>Want to develop novel ML methods.</strong></li>\n<li><strong>Would like to utilize modern open-source Big Data technologies such as Apache Hadoop and Spark, the foundation of our ML platform.</strong></li>\n<li><strong>Able to write code and working regularly in Python, R, or Scala.</strong></li>\n<li><strong>Willing to contribute shipping ML models into production for a direct impact on people.</strong></li>\n<li><strong>In the process of completing a PhD in a quantitative field (e.g., Computer Science, Statistics, Mathematics, Operations Research, or related discipline).</strong></li>\n<li><strong>Expert in algorithms for supervised/unsupervised modeling.</strong></li>\n<li><strong>Looking to work on a team to solve challenging problems.</strong></li>\n\n</ul>\n\nGet to know usZillow Group houses a portfolio of the largest and most vibrant real estate and home-related brands on the web and mobile. Our mission is to build the largest, most trusted and vibrant home-related marketplace in the world.<br><br>Zillow Group is owned, fueled and grown by innovators who help people make better, smarter decisions around all things home. We encourage one another at every level, and our efforts are supported by employee-driven, world-class benefits that enable us to enjoy our lives outside the office while building fulfilling careers that impact millions of individuals every day.\n<br><br>\nZillow Group is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. Therefore, we provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, or any other protected status in accordance with applicable law. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know."}