{"job title": "Data Reporting Analyst", "company": "APEX Systems", "city state": "– McLean, Virginia", "rating": "3.2", "job description": "Job DescriptionJob #: 876039\n<br><br>\nApex Systems has an immediate contract opportunity for a Data Reporting Analyst to support executive level clients in Mclean, VA. The Service Delivery Management (SDM) team has a need for a Data Analyst with experience in data analytics and metrics optimization. We are interested in furthering our reporting and metrics capabilities in support of our Single Family Servicing and Common Services (SFSCS) customers. Key Responsibilities: Assist in the fulfillment of complex and long-term projects from planning through implementation, as requested.\n<br>\nCollaborate with business owners to understand their needs and make recommendations as to the best way to visually display metrics and data to support decision making and provide additional insight.\n<br>\nUse discretion and experience to build customized dashboards in a data visualization tool to meet the needs of the business owner.\n<br>\nDevelop, maintain and follow standard processes surrounding the design and implementation of dashboards.\n<br>\nPrepare weekly SDM reports.\n<br>\nReview trending on reports and make recommendations.\n<br>\nAssist with project analyses by designing analytical and modeling methods to evaluate performance following implementation.\n<br>\nRecognize opportunities to automate processes for optimization and increased efficiency.\n<br><br>\nSkills: More than 3-5 years professional experience and managerial experience in Data Analysis and Business Intelligence.\n<br>\nExperience in championing change.\n<br>\nAdvanced skill in communications and working in a matrix team environment.\n<br>\nInfrastructure architecture experience is preferred\n<br>\nBS degree preferred.\n<br>\nIf you are interested in this opportunity, please send an updated resume to lward@apexsystems.com Thank you, Apex Systems EEO Employer Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at 844-463-6178"}