{"job title": "Senior Data Analyst", "company": "Brady Corporation", "city state": "– Valencia, CA", "rating": "3.5", "job description": "Job Description<div>!*!<br><br><strong>CompanyOverview\\:</strong>\n<br><br>\nBradyCorporation is an international manufacturer and marketer of complete solutionsthat identify and protect people, products and places. Brady’s productshelp customers increase safety, security, productivity and performance and includehigh-performance labels, signs, safety devices, printing systems and software.Founded in 1914, the Company has a diverse customer base in electronics,telecommunications, manufacturing, electrical, construction, medical, aerospaceand a variety of other industries. Brady is headquartered in Milwaukee,Wisconsin and as of July 31, 2017, employed approximately 6,300 people in itsworldwide businesses. Brady’s fiscal 2017 sales were approximately $1.11billion. Brady stock trades on the New York Stock Exchange under the symbolBRC. More information is available on the Internet at www.bradycorp.com.<br>\n<div></div><div><strong>Position Summary\\:</strong></div>\n<br>TheSenior Data Analyst will work with the senior management team that includes thePresident, VPs and Directors of the company to provide analysis to explainsales performances and trends, identify sales growth opportunities and risks,built business cases and models, develop strategic plans, and develop annual budgetingplans. The Senior Data Analyst must have demonstrated ability to workindependently, lead projects, think strategically, effectively work with andcommunicate with senior management team, and proactively review, integrate andinterpret disparate data sources into actionable plans.<br>\n<div><strong>Essential Duties and Responsibilities\\:</strong></div>\n\n<ul>\n<li>Perform complex analysis to explain sales performances and trends, and identify opportunities and risks</li><li>Built models to explain and support business cases</li><li>Summarize information (into powerpoints, tables, charts, graphs, etc) from reports and analysis; and present findings to stakeholders</li><li>Prepare daily, weekly and monthly reports that include MOR (monthly operating review) reports, sales activity and performance dashboards, sales/booking report, pipeline report, retention report, NPD report, sales campaign report, sales rep dollar sheet and Daily Flash report</li><li>Run ad-hoc report requested by internal customers and in the Report Queue</li><li>Independently design, develop and create reports</li><li>Update and enhance existing reports that usually involve writing codes and Excel formulas/macros</li><li>Define business rules and governance for data and processes</li><li>Document and maintain department data definition, processes and business rules</li><li>Document and maintain datamart definition and rules</li><li>Review, cleanse and maintain data in database</li><li>Process external data source (that includes validating its accuracy and determining its value) and incorporate into internal database</li><li>Troubleshoot and resolve data, reporting and system issues</li><li>Perform internal and external audits</li><li>Built and maintain dashboards to dissimilate information used by internal customers to measure/track results, identify and target sales opportunities, plan work activities, and make business decisions</li><li>Review, identify, recommend, implement, test and document data/reporting/process improvements</li><li>Work with IT and key stakeholders to recommend, define and test new data fields/datamarts</li><li>Work with IT and key stakeholders to define, write up request, test and document system enhancements</li><li>Liaison to Finance to reconcile budget and sales variances</li><li>Participate in strategic planning</li><li>Prepare files for annual budgeting process</li><li>Work with VP Sales, Sales Directors and HR to develop and model sales commission plans to appropriately incentivize sales reps to drive sales growth</li><li>Assigned accounts to reps according to rules defined by Sales Team</li><li>Audit account assignments for accuracy</li><li>Calculate commission and prepare commission statements</li><li>Review and resolve commission issues</li><li>Perform monthly commission projection/accruals for Finance</li><li>Provide training and assist with developing team members</li><li>Backup to defining and preparing email/mail list for marketing and sales campaigns</li><li>Lead project</li><li>Special projects as assigned</li>\n</ul>\n\n<div></div><div><strong>Required Knowledge, Skills &amp; Abilities\\:</strong> </div>\n<br>Toperform this job successfully, an individual must be able to perform eachessential duty satisfactorily. The requirements listed below arerepresentative of the knowledge, skill, and/or ability required. Reasonableaccommodations may be made to enable individuals with disabilities to performthe essential functions.\n<ul>\n<li>5or more years of work experience (preferably in the healthcare industry)working on data reporting/analysis with increasing responsibilities.</li><li>Bachelordegree is required (preferably in a business, computer or math-related field).</li><li>Englishfluency. Ability to read and interpret documents, instructions, andprocedure manuals. Ability to write routine reports and correspondence. Ability to speak effectively.</li><li>Abilityto apply concepts of Algebra, Statistics and Probability.</li><li>Abilityto interpret a variety of instructions furnished in written, oral, diagram, orschedule form. Ability to define problems, collect data, establish facts,and draw valid conclusions.</li><li>Proficientin data reporting/analysis software with strong preference for Alteryx, Tableauand SAS</li><li>Demonstratedability to effectively work with and communicate with senior management teamthat includes the President, VPs and Directors of the company</li><li>Demonstratedability to lead complex analysis that involves integrating data from disparatesources both internally and externally</li><li>Demonstratedability to think strategically and interpret strategic plans</li><li>Excellentcomputer skills in Word, Powerpoint and Excel</li><li>Abilityto organize complex data into comprehensible reports</li><li>Abilityto interpret complex data into actionable information</li><li>Excellentresearch skills</li><li>Excellentcommunication skills, including interpersonal, written, and oral presentation</li><li>Strongquantitative and analytical skills</li><li>Stronginitiative and self-motivated</li><li>Strongwork ethics</li><li>Mustbe detailed oriented</li><li>Abilityto work independently and in a team environment</li><li>Abilityto meet deadlines</li><li>Abilityto multi-task</li><li>Abilityto solve problems and think outside the box</li><li>Strongattendance record</li>\n</ul>\n\n<div><strong>Physical Demands\\:</strong> </div>\n<br>Thephysical demands described here are representative of those that must be met byan employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilitiesto perform the essential functions.\n<br><br>\nWhileperforming the duties of this job, the employee is regularly required to sit;use hands to finger, handle, or feel objects, tools, or controls; reach withhands and arms; stoop, kneel, or crouch; and talk or hear. The employeeis occasionally required to stand and walk. The employee mustoccasionally lift and/or move up to 35 pounds. Specific vision abilitiesrequired by this job include close vision, distance vision, color vision, andthe ability to adjust focus.<br>\n<div><strong>Work Environment\\:</strong> </div>\n<br>The workenvironment characteristics described here are representative of those anemployee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilitiesto perform the essential functions.\n<br><br>\nWhileperforming the duties of this job, the employee is occasionally exposed tofumes or airborne particles that do not exceed the permissible exposurelimits. The noise level in the work environment is usually moderate.<br><br>Our company is anequal opportunity/affirmative action employer. Applicants can learn more aboutthe company's status as an equal opportunity employer by viewing the federal\"EEO is the Law</div>\n<br>\nCompany Description<div>Brady Corporation is an international manufacturer and marketer of complete solutions that identify and protect people, products and places. Brady products help customers increase safety, security, productivity and performance and include high-performance labels, signs, safety devices, printing systems and software. Founded in 1914, the Company has a diverse customer base in electronics, telecommunications, manufacturing, electrical, construction, medical, aerospace and a variety of other industries. Brady is headquartered in Milwaukee, Wisconsin and as of July 31, 2016, employed approximately 6,400 people in its worldwide businesses. Brady fiscal 2016 sales were approximately $1.12 billion. Brady stock trades on the New York Stock Exchange under the symbol BRC.\n<br>\nOur company is an equal opportunity/affirmative action employer. Applicants can learn more about the company's status as an equal opportunity employer by viewing the federal \"EEO is the Law\" poster at EEOPost.pdf</div>"}