{"job title": "Data Analyst I", "company": "Centene Corporation", "city state": "– Albuquerque, New Mexico", "rating": "3.1", "job description": "ProfessionalPosition Purpose: Responsible for analytic data needs of the business unit.\n\n<li>Manage multiple, variable tasks and data review processes, as well as mass data entry, maintenance, and update projects</li>\n<li>Complete data audits and evaluations within core systems</li>\n<li>Identify and resolve complex issues, including mass change updates, reconciliation projects, and the operationalization of data from various sources</li>\n<li>Analyze and advise management of workflow issues and data integrity problems and offer recommendations on resolution</li>\n<li>Develop and submit internal and external status reports</li>\n<li>Create report and data reconciliation through Access, Excel, Business Objects and other reporting tools, to include provider data, claims data, membership data</li>\n\nEducation/Experience: Bachelors degree in related field or equivalent experience. 0-2 years of statistical analysis or data analysis experience. Advanced knowledge of Microsoft Applications, including Excel and Access. Experience with Business Intelligence and SQL tools preferred.\n<br><br>\n<strong>HEDIS:</strong>\n<br>\nBachelors degree related field or equivalent experience. 0-2 years of statistical analysis or data analysis experience or 0-1 years of HEDIS data analysis experience including measurement and rates impacted. Advanced knowledge of Business Intelligence , SQL, and Microsoft Applications, including Excel and Access.\n<br><br>\n<strong>BUSINESS ANALYTIC:</strong>\n<br>\nBachelors degree related field or equivalent experience. 0-2 years of statistical analysis or data analysis experience or 0-1 years of related IT experience, including data warehouse, coding or ETL experience. Advanced knowledge of Business Intelligence , SQL, and Microsoft Applications, including Excel and Access.\n<br><br>\n<strong>PHARMACY UNDERWRITING:</strong>\n<br>\nBachelors degree related field or equivalent experience. 0-2 years of statistical analysis or data analysis experience or 0-1 years of related financial or IT experience, including data warehouse, SQL, coding, financial reporting / auditing, client reporting or predictive analytic experience. Basic knowledge of Business Intelligence , SQL, and Microsoft applications, including Excel and Access.\n<br><br>\nCentene is an equal opportunity employer that is committed to diversity, and values the ways in which we are different. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other characteristic protected by applicable law."}