{"job title": "Jr. Data Developer/Data Analyst Hollywood", "company": "Create Music Group", "city state": "– Los Angeles, California", "rating": "4.7", "job description": "Business Intelligence Team\n<br><br>\n<strong>WHO WE ARE:</strong>\n<br><br>\nWe are Create Music Group, one of the most rapidly growing music technology companies in the entertainment industry. We monetize over 5 billion monthly music streams and are currently one of the largest music rights holders in the world. We also operate a number of different services out of our 22,000 sq ft HQ in the heart of Hollywood: music distribution, music publishing, YouTube monetization, artist development, brand development, and production. Check us out at createmusicgroup.com.\n<br><br>\nWe collaborate with some of the most influential personalities and musicians including Future, Migos, Marshmello, Porter Robinson, Dillon Francis, Don Diablo, Young Thug, Trippie Redd, Post Malone and others. We are at the forefront of the entertainment industry and looking for someone to join us and to become a part of Create.\n<br><br>\n<strong>WHO YOU ARE:</strong>\n<ul>\n<li>An appreciator of music and the digital age of tech/entertainment.</li><li>Passionate about working with and analyzing data - especially Big Data.</li><li>Innovative and loves having fun.</li><li>Well versed in Agile methodology.</li><li>Able to communicate effectively whether in-person or electronically.</li><li>Willing to learn new programs and apps as needed.</li>\n</ul>\n<strong>REQUIRED SKILLS:</strong>\n<ul>\n<li>3+ years experience with SQL.</li><li>Familiarity with business intelligence and data visualization tools such as Tableau and Google Data Studio.</li><li>Experienced with Python, PHP or Node.js.</li><li>Experience with building and consuming APIs, PHP or Python, Node.js and MVC Frameworks.</li>\n</ul>\n<strong>BONUS POINTS:</strong>\n<ul>\n<li>Google Cloud or AWS Cloud Platform</li><li>BigQuery, ElasticSearch, Google Cloud Storage or AWS S3</li><li>Experience with data warehousing</li><li>Proficient with version control (Git)</li>\n</ul>\n<strong>WHAT YOULL BE DOING:</strong>\n<ul>\n<li>Assisting our lead Data Scientist with analyzing data and turning data into actionable insights.</li><li>Liaise between our LA HQ and data team of Create Music Groups Canada branch tech team.</li><li>Prepare the \"Big Data\" infrastructure and process the data to be analyzed by our Data Scientist.</li><li>Assist in building data products for our data-driven decision support system and Business Intelligence portal.</li><li>Using cloud solutions of AWS Cloud and Google Cloud Platform. We use technologies such as Tableau, Google Data Studio, Google BigQuery, Google Cloud Storage, ElasticSearch, Mysql, MongoDB and Neo4j etc.</li>\n</ul>\n<strong>PERKS:</strong>\n<ul>\n<li>Free coffee</li><li>Ping pong table</li><li>Weekly team lunch</li><li>Relaxed &amp; collaborative work environment</li>\n</ul>\n<strong>TO APPLY:</strong>\n<br><br>\nSend us your resume and cover letter telling us why you think you would be the perfect fit for this position - and for our team. Link us anything else you want - your portfolio, website, socials, etc. NOTE: Applications without a cover letter will not be accepted.\n<br><br>\nJob Type: Full-time\n<br><br>\nExperience:\n<ul>\n<li>data developer: 1 year (Required)</li><li>data analysis: 1 year (Required)</li>\n</ul>\nWork authorization:\n<ul>\n<li>United States (Required)</li>\n</ul>"}