{"job title": "Business Intelligence (BI) Data Analyst", "company": "Dairy Farmers of America, Inc", "city state": "– Kansas City, KS", "rating": "2.9", "job description": "<strong><br><br><strong>Business Intelligence (BI) Data Analyst</strong>\n<br><br>\nLocation:</strong>\n<br>\n1405 N. 98th St\n<br>\nKansas City, Kansas, 66111\n<br>\nUnited States\n<br>\nCompany:\tDairy Farmers of America, Inc\n<br>\nReq Num:\treq7131\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nExpand DFA’s enterprise data access architecture and information delivery systems. Analyze, design, develop, and provide operational support skills to deliver business intelligence, data warehousing, reporting, and visualization solutions for a wide range of business functions and user communities.\n<br><br>\n<strong>Job Duties and Responsibilities:</strong>\n\n\n<ul>\n<li>Design, develop, and deploy logical or physical data models that support information delivery and data visualization needs</li>\n<li>Acquire data from multiple sources and transform in to reporting ready data marts</li>\n<li>Create technical specifications for data flows and transformation</li>\n<li>Develop content using established standards</li>\n<li>Create and execute test scripts with business reporting analysts</li>\n<li>Ensure data quality with user and regression testing</li>\n<li>Deliver data models using agile development releases</li>\n<li>Coordinate change management with ETL Specialist</li>\n<li>Maintain outbound interfaces using API, FTP, email, etc.</li>\n<li>Test new technologies to assist the company in becoming a data driven organization</li>\n<li>The requirements herein are intended to describe the general nature and level of work performed by employee, but is not a complete list of responsibilities, duties, and skills required. Other duties may be assigned as required.\n<br><br>\n<strong>Requirements</strong>\n<br><br>\nEducation and Experience</li>\n<li>Bachelor’s degree in Computer or Data Science</li>\n<li>4-6 years of experience as a Data Warehouse/BI developer, which includes experience with SQL and data profiling using MS Sql Server; Microsoft reporting tools such as SSAS, SSRS, and SSIS; and Master Data Management</li>\n<li>Certifications and/or Licenses – N/A</li>\n</ul>\n\nKnowledge, Skills and Abilities\n\n\n<ul>\n<li>Dimensional data modeling and design expertise in an enterprise data warehousing environment</li>\n<li>Knowledge of data warehousing concepts and dimensional data modeling</li>\n<li>Ability to work in agile development process</li>\n<li>Ability to use data to create models that depict trends</li>\n<li>Understanding of analytical concepts for reporting and troubleshooting</li>\n<li>Ability to co-ordinate data modeling, ETL development, and testing activities</li>\n<li>Ability to quickly learn and apply new processes and technologies</li>\n<li>Excellent organizational and problem-solving skills</li>\n<li>Ability to balance multiple tasks with high attention to details</li>\n<li>Excellent written and oral communication skills with the ability to articulate and document processes and workflows</li>\n</ul>\n\nEEO/AA/Female/Minority/Disabled/Veteran\n<br><br>\nEEO/AA/Female/Minority/Disabled/Veteran"}