{"job title": "SQL Data Reporting Analyst", "company": "Digital Prospectors", "city state": "– Boston, Massachusetts", "rating": "4.9", "job description": "<strong>Find your job at</strong> <strong>www.LoveYourJob.com</strong>\n<br><br>\n<strong>Job Title:</strong> Data Reporting Analyst/Power Bl Report and Dashboard Developer\n<br><br>\n<strong>Location</strong>: Boston, MA 02116\n<br><br>\n<strong>Duration:</strong> 6+ Months\n<br><br>\n<strong>Code:</strong> ITS63\n<br><br>\n<strong>JOB DESCRIPTION:</strong>\n<br><br>\nOur client is seeking an experienced SOL Server Data Reporting Analyst to utilize program development series or other technical tools (SOL; business objects) for agency reporting purposes.\n<br><br>\n<strong>Duties include:</strong>\n<br><br>\nWorking with stakeholders to understand reporting needs, identifying and querying data sources to get the required data, cleansing and massaging data into the shape required, creating Power Bl datasets, reports, and dashboards to meet requirements, presenting and gathering feedback from stakeholders on the finished product, and deploying data, reports, and dashboards to Power BI; developing reports according to analyst-defined specifications; conduct technical training; work as the architect and development lead to improve performance and extend functionality; maintain and document operational environment.\n<br><br>\n<strong>General Qualifications:</strong>\n<br><br>\n• Experience in SOL developing and maintaining stored procedures and triggers.\n<br><br>\n• Experience with Data Warehousing and ETL (SS\\S)\n<br><br>\n• Experience with SOL Server Reporting Services and reporting technologies\n<br><br>\n• Experience with developing Business Intelligence dashboards using Microsoft technologies, specifically Power 81\n<br><br>\n• Experience in application level problem diagnosis and troubleshooting, resolution and testing.\n<br><br>\n<strong>Mandatory Requirements:</strong>\n<br><br>\n• Minimum of 4-6 years' experience in SOL Server Reporting Services and development with SOL technologies\n<br><br>\n• Knowledge of SOL Server database architecture (components and processes of the database) for SOL Server 2014, 2016\n<br><br>\n• Knowledge of API Web Services\n<br><br>\n• At least 3 years' experience developing Business Intelligence dashboards and reports (at least 1 year experience using Microsoft Power 81), analyzing, and visualizing data with Microsoft technologies such as Excel, Power Bl Power Query, Performance Point, and SOL Server Reporting Services\n<br><br>\n• An understanding of Power Bi administration, licensing, security, and deployment\n<br><br>\n• A solid understanding of the concepts involved in modeling relational data\n<br><br>\n• Experience with ETL of data from a variety of sources using SSIS, Excel Power Query, or similar technologies\n<br><br>\n• Strong analytic skills\n<br><br>\n• Superior organizational skills, with a disciplined approach to implementation, support and documentation\n<br><br>\n• Hands-on approach with ability to deliver to commitments\n<br><br>\n• Self-motivated and highly professional with ability to take on responsibility and work independently\n<br><br>\n• Ability to work under pressure and tight deadlines.\n<br><br>\n• Excellent client (internal &amp; external) communication and liaison skills.\n<br><br>\n<strong>Other Desired Skills:</strong>\n<br><br>\n• Experience with creating tabular data models in SOL Server Analysis Service with DAX\n<br><br>\n• Development experience using SOL Server Analysis Services\n<br><br>\n• Experience with Power Bl Administration a plus.\n<br><br>\nPOST-OFFER BACKGROUND CHECK IS REQUIRED. An essential function of this job is physical attendance. Digital Prospectors is an Equal Opportunity Employer which includes providing equal employment opportunity for all protected classes including veterans and individuals with disabilities.\n<br><br>\n<strong>Make this your next career move as one of our many long-term contractors or employees!</strong>\n<br><br>\n<strong>ABOUT DIGITAL PROSPECTORS:</strong>\n<br><br>\nFounded in 1999, Digital Prospectors is an award-winning recruiting and consulting firm that specializes in placing contract, contract-to-hire and direct hire engineers into rewarding opportunities with our impressive and ever-growing client base. We believe that all people should love their jobs.\n<br><br>\nCome see why Digital Prospectors has been voted “<strong>Best Staffing Firm to Temp For</strong>” by Staffing Industry Analysts, \"<strong>Best of Staffing</strong>\" for candidate satisfaction by Inavero / CareerBuilder.com, \"<strong>Top Temporary Placement Firm</strong>\" by Boston Business Journal, \"<strong>Best Company To Work For</strong>\" by Business NH magazine, \"<strong>Excellence in IT and Engineering Staffing</strong>” by TechServe Alliance, \"<strong>Top IT Services Company</strong>\" by Inc. Magazine, \"<strong>Most Reliable Staffing Agency</strong>\" in Forbes Magazine and \"<strong>Top Ranked Staffing Firm</strong>\" by Staffing Industry Analysts.\n<br><br>\nwww.LoveYourJob.com\n<br><br>\nPhone: 603-772-2700"}