{"job title": "Business Data Analyst", "company": "eBay Inc.", "city state": "– Draper, UT", "rating": "3.6", "job description": "eBay is the worlds leading online marketplace for the trade of goods and services by a diverse community of individuals and businesses. The Risk Policy Management team is responsible for creating and implementing risk policies to identify, assess, and manage exposures and undesirable outcomes.\n<br><br>\nWe are currently looking for a Data Analyst to lead Risk and Payment analytics initiatives supporting various Risk teams. Candidates should provide a strategic perspective, sound business judgement, strong analytic capabilities, and a collaborative partnership. Candidates should make an impact in our fast-paced work environment with multiple complex projects to balance on a regular basis. Successful candidates will bring passion to do what is right for the business and work effectively with the business unit partners to collaborate and build out winning solutions together.\n<br><br>\n<strong>Key Responsibilities:</strong>\n<ul>\n<li>Design, plan, and execute analyses and A/B tests as necessary</li><li>Create and maintain dashboards providing visibility into business/team performance</li><li>Extract, analyze and collate data from a variety of sources to create both regular and ad hoc reporting</li><li>Perform analytics on data to generate business/team insights</li><li>Lead analytics planning, execution and engagement on multiple initiatives</li><li>Monitor and measure team performance against key metrics</li>\n</ul>\n<strong>Job Requirements</strong>\n<ul>\n<li>Demonstrate critical thinking and problem solving skills. Creative thinker; able to develop unique methods of analysis where traditional methods do not yield results</li><li>Excellent reporting and business analysis skills</li><li>Ability to adapt and learn new technologies/methodologies</li><li>Ability to identify, collect and organize data from a variety of sources and formats</li><li>Expert with Excel (pivot tables, advance functions, statistics)</li><li>Superior skills with database query tools (e.g., SQL); Teradata experience a plus.</li><li>Experience with SAS, UNIX and Tableau will be advantageous</li><li>Ability to thrive in a cross-functional environment while juggling multiple responsibilities</li><li>Trust, initiative, integrity and exceptional communication skills are a must</li><li>Ability to translate advanced analytics approaches for non-technical audiences</li>\n</ul>\n<strong>Education</strong>\n<br><br>\nBachelors degree in Mathematics/Statistics, Engineering/Computer Science, Economics or equivalent.\n<br><br>\nThis website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies\n<br><br>\nView our privacy policy\n<br><br>\nView our <u>accessibility info</u>\n<br><br>\neBay Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at talent@ebay.com. We will make every effort to respond to your request for disability assistance as soon as possible.\n<br><br>\nFor more information see:\n<br><br>\nEEO is the Law Poster\n<br><br>\nEEO is the Law Poster Supplement"}