{"job title": "Business Data Analyst", "company": "EY", "city state": "– United States", "rating": "3.7", "job description": "<div><div><div><div><div><p>.</p>\n \n \n \n\n \n \n \n \n \n <div>\n <div>\n<div><b>Position Summary:</b></div>\n<div> </div>\n<div>We’re seeking a Senior Business Analyst with expertise in Data Analysis and Data Requirements Management to join our Global Tax Platform (GTP) team. Data is the core asset of GTP, and the work of our Data Mapping and Modeling team is crucial to the success of the overall platform. You will partner comprehensive data analysis with structure business analysis techniques to enable the effective design and implementation of a global data model. EY is on a journey to leverage its success as a leader in the industry and bring best in class service and offerings to its tax practice. GTP is at the forefront of this effort, and you will play a critical role bringing technology and automation to a traditional practice.</div>\n<div> </div>\n<div><b>Essential Functions of the Job:</b></div>\n<ul>\n<li>Lead BA accountable for elicitation, analysis and documentation of business, stakeholder, solution and transition requirements driving data models for the assigned program(s).</li>\n<li>Responsible for leveraging appropriate techniques such as data flow diagrams, data mining and data modeling techniques to gather, analyze, and report Tax and Finance data requirements as a member of a data modeling delivery team.</li>\n<li>Work closely with product owners and other subject matter experts to understand business and technology strategies affecting and affected by their Tax and Finance data.</li>\n<li>Plan and actively manage the BA requirements management strategy; communicating, driving and managing the business analysis effort for each project in the Program throughout all phases of the ATTG project lifecycle</li>\n<li>Actively manage requirements traceability for impact and coverage analysis throughout the program</li>\n<li>Provide guidance and oversight on effective utilization of Business Analysis techniques in compliance with organizational standards </li></ul>\n<div><b> </b></div>\n<div><b>Analytical/Decision Making Responsibilities:</b> </div>\n<ul>\n<li>Ability to clearly articulate both problems and propose solutions</li>\n<li>Proactive approach to identifying issues and presenting solutions and options, and where appropriate, leading to resolution</li></ul>\n<div> </div>\n<div><b>Knowledge and Skills Requirements:</b></div>\n<ul>\n<li>Excellent verbal and written communication skills</li>\n<li>Experience working effectively and building relationships with and between teams, external vendors and internal clients at varying executive levels</li>\n<li>TAX or Finance domain knowledge with a strong understanding of databases and data analysis.</li>\n<li>Experience leading other BAs to provide analysis and requirements, ensure consistency, accuracy and quality of BA deliverables on larger initiatives </li>\n<li>Application of project management techniques to develop, execute and manage BA efforts across multiple initiatives</li>\n<li>Proficient application of industry-standard, structured business analysis techniques (i.e., user stories, use cases, UML/logical modeling, BABOK, etc.) to govern and control projects under various software development methodologies (i.e., Waterfall, Agile, RUP, etc.)</li>\n<li>Hands on experience with requirements management, modeling, and change control software(s)</li></ul>\n<div> </div>\n<div><b>Supervision Responsibilities:</b></div>\n<ul>\n<li>Works with limited direction and oversight</li>\n<li>Provide supervision and direction to team members and staff</li></ul>\n<div> </div>\n<div><b>Other Requirements:</b></div>\n<ul>\n<li>Occasional overnight travel may be required</li></ul>\n<div> </div>\n<div><b>Job Requirements:</b></div>\n<ul>\n<li>A bachelor's degree (computer science, engineering, accounting, finance preferred) or equivalent work experience.</li>\n<li>Master's degree preferred</li>\n<li>5-7 years of relevant experience</li>\n<li>Management experience a plus</li>\n<li>CBAP certification preferred</li></ul></div>\n<div> </div>\n<div>EY, an equal employment opportunity employer (Females/Minorities/Protected Veterans/Disabled), values the diversity of our workforce and the knowledge of our people.</div>\n<div> </div>\n </div>\n \n \n\n \n\n \n </div>\n </div>\n </div>\n\n \n </div>\n\t</div>"}