{"job title": "Business Data Analyst", "company": "Intel Corp.", "city state": "– Hillsboro, OR", "rating": "3.8", "job description": "Business Data AnalystJob Description\n<br><br>\nProvide expertise on database management/design to drive integration of business data, functions, and systems. Establish standards, guidelines, procedures, and other infrastructure necessary to support the objective of integration of data. Resolve performance problems. Plans and schedules daily tasks, uses judgement on a variety of problems requiring deviation from standard practices. Inadequacies and erroneous decisions would cause moderate inconvenience and expense.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n<strong>Minimum Qualifications</strong>\n\n\n<ul>\n<li>BA/BS degree in Business, Management, Operations or a related discipline.</li>\n<li>Minimum 3 years' experience managing data and advanced analytics.</li>\n</ul>\n\nAdditional Profile Characteristics Preferred\n\n\n<ul>\n<li>Experience with technical systems.</li>\n<li>Understanding of Consumer Sales reporting processes and KPIs.</li>\n<li>Able to compile complex data sets, analyze and tell compelling narrative</li>\n</ul>\n\nInside this Business Group\n<br><br>\nIntel's Sales and Marketing (SMG) organization works with global customers and partners to solve critical business problems with Intel based technology solutions. SMG works across business units to amplify the customers voice and deliver solutions that accelerate their business. Our teams work across the entire sales cycle, pushing ingredient products to our \"billings\" customers while also pulling end solutions through to \"consumption\". We work across numerous industries, including retail, enterprise and government, cloud services and healthcare as examples. The operations team focuses on forecasting, driving alignment with factory production and delivering efficiency tools and our marketing capability drives demand and localized marketing in locations around the globe. Our sales force navigates a complex partner and customer ecosystem while shaping product roadmaps, driving value for our customers, and collaborating to harness emerging technology trends to deliver comprehensive solutions.\n<br><br>\nPosting Statement\n<br><br>\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance."}