{"job title": "Data Analyst / BA", "company": "Kforce", "city state": "– Groton, CT", "rating": "3.7", "job description": "<strong>RESPONSIBILITIES:</strong><br><br>Kforce has a client in search of a Data Analyst/BA in Groton, Connecticut (CT).\n<br><br>\nSummary:\n<br>\nThe client needs a strong BA to contribute to ongoing small &amp; medium sized projects. The client needs heads down contributions in mapping workflows, making updates with new software in place &amp; documentation of the SDLC. Former client experience is required. There will be Small Project work for the Comparative medicine organization. Medium level BA - Data Analyst skills required.\n<br><br>\nProjects:\n\n\n<ul>\n<li> Project 1 - coordinating activities between vendor &amp; business while creating and maintaining SDLC documentation from a Baseline document and will need experience documenting requirements after the fact; Solid Baseline Client SDLC Documentation is required</li>\n\n<li> Project 2 - design &amp; storage; More of the Data Analysis skill set &amp; engineering skills; File types, storage types, work with storage teams to SDC - scientific data cloud - open lab solution; Image archive solution</li>\n\n<li> Project 3 - Internal Tool being upgraded, work with SharePoint team, test it, or understand where testing/remediation needs improvement; small aount of remediation, data sync, knowledge transfer; Baseline SDLC Documentation updates; Internal system &amp; sustain updates work- met by system, met by Client - remediation type work; Updates for system; Data Analyst - Reporting Type activity; Work with the business, what do you need from the business, the requirements, do the reporting</li>\n</ul>\n<strong>REQUIREMENTS:</strong>\n\n<ul>\n<li> Business Analysis experience</li>\n\n<li> Data Analysis</li>\n\n<li> BA/Spotfire - Excel - SharePoint required</li>\n</ul>\n\nKforce is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status."}