{"job title": "Senior Data Analyst", "company": "Optomi", "city state": "– Chicago", "rating": "4.3", "job description": "Optomi in partnership with a national Medical Device company, is seeking an Data/Product Analyst to support required data analytics and data integration support of financial analysis and creation of profit improvement and cost saving models. This includes \"hands on\" work on analysis / data including collaboration with marketing, sales, supply chain, distribution, operations and R&amp;D.\n<br><br>\n<strong>What the right person will enjoy</strong>:\n\n<ul>\n<li>Supporting global organization with enterprise initiatives- 1 Day work from home option (After ramp up period)- Working for one of America's Best Employers- Forbes 2017- Great company perks including an on-site ,cafeteria, barista, and walking paths\n<br>\n<strong>Apply today if your background includes</strong>:</li>\n\n\n\n<li>Bachelors with equivalent plus 3-5 years medical industrial experience</li>\n<li>Knowledge about healthcare industry sustaining cost driver (Regulatory, Quality Assurance, etc.)- Past management consulting experience is a plus- Master level excel skills as well as experience in business analytics software such as Tableau- Strong PowerPoint skills- Demonstrated competencies in data analytics and/or financial analysis- Proven success partnering with cross functional team members in a matrix organization\n<br>\n<strong>Key responsibilities</strong>:</li>\n\n\n\n<li>Assists in gathering and integration of cross functional data (marketing/sales, supply chain / distribution, operations, and R&amp;D) to support financial quantification of portfolio simplification programs- Generates business cases to support portfolio simplification programs\n<br>\nActively partners with and collects feedback from cross functional team members, including marketing leads, to dive into details of data sets, analyses, and business cases.</li>\n<li>Dives into detail of functional datasets (e.g. sales, supply chain, manufacturing) from various IT systems to understand linkages to key financial analyses helping to enable reproducibility of analyses in the future- In a hands on fashion, works to establish connection points and reconciliation needs between functional datasets as needed- Conducts analyses in excel and in business analytics software such as Tableau</li>\n</ul>\n<strong>Job Type</strong>: Contract\n<br><br>\n<strong>Education</strong>:\n\n<ul>\n<li>Bachelor's (Required)\n<br>\n<strong>Work authorization:</strong></li><strong>\n\n</strong>\n\n<li>United States (Required)</li>\n</ul>"}