{"job title": "Customer Experience Data Analyst", "company": "Skipio", "city state": "– Lehi, UT", "rating": "4.6", "job description": "<div>The Customer Experience Data Analyst will consolidate all of the Skipio data sources to manage the success of Customer Engagement, Product Usability and Value, and lower the churn rate. The Analyst will manage data from Pendo, Stripe, Matomo, Salesforce, the Application, and all 3rd party applications. The Analyst will give data driven recommendations to new feature development, validate all product development hypotheses, improve effectiveness of all customer onboarding and support practices. Will be the internal administrator and product owner for Pendo and MetaBase related to product development and usability. Also will be the manager of a cross dimensional team of managers and team leads from our Mobile, Customer Success, Data, Development, and Operations teams. The biggest responsibility is to develop the user experience, boost revenue, and build customer retention through engagement.<br><br>Apply for this opening</div>\n<br>\n<div><div>Benefits Competitive salary\n<br>\nPaid time off\n<br>\nMedical, dental, &amp; vision insurance\n<br>\nApple laptop &amp; dual 27″ 4k monitors\n<br>\nSmaller/Tight-knit company and teams\n<br>\nStrong Company Culture\n<br>\nCatered lunch twice per week\n<br>\nBest office in Utah, the restored historic American Fork Star Mill</div></div><div><div>What you’ll be doing\n\n<ul>\n<li>Must be able to write complex SQL queries, build charts and reports and analyse data to derive insights, answer existing questions and validate tests and hypothesis</li><li>Extensive experience with operating systems like Salesforce, Pendo, Stripe, Matomo, Etc.</li><li>Mastery of the following to query normalized relationship data and dimensional warehouse data: MS Excel, SQL, and MySQL.</li><li>Ability to thrive in a fast-paced, entrepreneurial, high-energy environment that requires the ability to multi-task and implement high priority initiatives</li><li>Exceptional analytical and quantitative skills with the ability to interpret and summarize complex data that drive actionable plans that add value to the business</li><li>Proven ability to translate business problems into executable analyses</li></ul></div><br>\n\n<div>What we’re looking for\n\n<ul>\n<li>Must be able to write complex SQL queries, build charts and reports and analyse data to derive insights, answer existing questions and validate tests and hypothesis</li><li>Extensive experience with operating systems like Salesforce, Pendo, Stripe, Matomo, Etc.</li><li>Mastery of the following to query normalized relationship data and dimensional warehouse data: MS Excel, SQL, and MySQL.</li><li>Ability to thrive in a fast-paced, entrepreneurial, high-energy environment that requires the ability to multi-task and implement high priority initiatives</li><li>Exceptional analytical and quantitative skills with the ability to interpret and summarize complex data that drive actionable plans that add value to the business</li><li>Proven ability to translate business problems into executable analyses</li></ul></div>\n</div>\n<br>"}