{"job title": "Scientist - Hybridomas", "company": "Alpha Consulting", "city state": "– CA - Redwood City", "rating": "4.0", "job description": "<div><strong>SCIENTIST - HYBRIDOMAS</strong>\n<br>\n<strong>REDWOOD CITY, CA</strong></div>\n\n<br><strong>Project Description:</strong>\n<br>\nWe are seeking an RA with hands-on experience in antibody discovery using hybridoma and/or B-cell approaches to support therapeutic biologics programs and reagent antibody generation. Responsibilities will include executing on all steps of the antibody generation process. This includes preparing immunizations, hybridoma fusions, screening for antibodies, including developing and executing binding assays (ELISA, flow cytometry, HTRF) and subcloning and scale-up for antibody purification. A strong background in cell culture is required, experience with PCR and mammalian cell transfection is a plus. This position will require the ability to multi-task and work on several projects simultaneously. Detailed record-keeping and strong skills in data analysis are required. This position will collaborate with multiple functional areas including Automation, Protein Sciences, and project teams. \n\n\n<ul>\n\n\t<li>Contribute to antibody discovery goals utilizing hybridoma and molecular biology approaches.</li>\n\n<li>Participate in designing antibody generation strategies including immunogen design and screening cascades.</li>\n\n<li>Execute on all stages of antibody generation, including scheduling and preparing immunizations, hybridoma fusion and culture, screening of antibodies, subcloning and hybridoma expansion for sequencing and antibody purification.</li>\n\n<li>Execute binding screens using ELISA, flow cytometry, or HTRF assays. Experience in high-throughput approaches and/or automation is a plus.</li>\n\n<li>Execute antibody characterization assays including epitope binning and functional assays.</li>\n\n<li>Maintain detailed records of all experiments in ELN and using in-house databases and tracking systems.</li>\n\n<li>Prepare detailed and thorough analysis of data and present updates to managers and project teams.</li> \n\n<li>Responsible for delivering both data analysis packages as well as purified antibodies to project teams and collaborators.</li> \n\n<li>Trouble-shoot and optimize protocols and propose creative solutions to improve efficiency to existing processes.</li>\n\n<li>Communicate with multiple functional areas (e.g. Automation, Protein Sciences) as well as project teams to coordinate antibody generation efforts.</li>\n\n<li>Keep up to date on current protocols and methods for antibody generation and propose new ideas to improve in-house processes.</li>\n</ul>\n\n<strong>Required Skills:</strong>\n\n\n<ul>\n\n\t<li>BA/BS in Biology, Immunology, or related field with 1-4+ years' experience.</li>\n\n<li>Experience with antibody generation using hybridoma approaches and/or B-cell approaches is required.</li>\n\n<li>Experience with mammalian cell culture and sterile techniques is required.</li>\n\n<li>Experience with antibody binding assays, especially ELISA and flow cytometry, experience with multi-color flow cytometry is a plus.</li>\n\n<li>Experience using Excel, Graphpad Prism, and flow cytometry analysis software.</li>\n\n<li>Strong focus, motivation, and commitment to hands-on lab work is required.</li>\n\n<li>Excellent organization and communication skills.</li>\n\n<li>Previous experience with PCR and mammalian cell transfection is a plus.</li>\n\n<li>Ability to multi-task in a fast-paced environment.</li>\n\n<li>Ability to work and thrive in a collaborative, cross-functional team-oriented.</li>\n</ul>\n\nThis 6+ month position starts ASAP.\n<br><br>\n<strong>ALPHA'S REQUIREMENT #18-01245</strong>\n<br>\n<strong>MUST BE ELIGIBLE TO WORK IN THE U.S. AS AN HOURLY W2 EMPLOYEE</strong>"}