{"job title": "Associate Scientist", "company": "CooperVision", "city state": "– United States-California-Pleasanton", "rating": "3.9", "job description": "<div>CooperVision, a unit of The Cooper Companies, Inc. (NYSE:COO), is one of the world’s leading manufacturers of soft contact lenses and related products and services. The Company produces a full array of monthly, two-week and 1-day lenses, all featuring advanced materials and optics. CooperVision has a strong heritage of solving the toughest vision challenges such as astigmatism and presbyopia; and offers the most complete collection of spherical, toric and multifocal products available. Through a combination of innovative products and focused practitioner support, the company brings a refreshing perspective to the marketplace, creating real advantages for customers and wearers. For more information, visit www.coopervision.com.</div>\n<div> </div>\n<div><b>JOB TITLE: </b>Associate Scientist<b><br></b> </div>\n<div><b>DEPARTMENT</b>: R&amp;D Chemistry</div>\n<div><b> </b></div>\n<div><b>JOB SUMMARY<br></b>Perform research and development in collaboration with others to support contact lens and ophthalmic materials development projects. Design, fabricate and test materials for contact lens products. <br><br><b>ESSENTIAL FUNCTIONS<br></b></div>\n<ul>\n<li>\n<div>Assist Scientists in designing and performing lab experiments, formulations and testing.</div></li>\n<li>\n<div>Work independently when operating lab machinery and equipment while following Standard Operating Procedures (SOPs). </div></li>\n<li>\n<div>Plan, schedule, and implement work assignments.</div></li>\n<li>\n<div>Make detailed observations, accurately record data in lab notebooks and interpret data and results.</div></li>\n<li>\n<div>Prepare technical reports, summaries and protocols. </div></li>\n<li>\n<div>Assist with investigating, creating and developing new methods and technologies for project advancement.</div></li>\n<li>\n<div>Interact with suppliers for chemical sourcing and releasing following relevant SOPs.</div></li>\n<li>\n<div>Work closely with cross functional teams.</div></li></ul>\n<div> </div>\n<div><b>POSITION QUALIFICATIONS</b></div>\n<ul>\n<li>\n<div>KNOWLEDGE, SKILLS AND ABILITIES<br><br>Ability to work in a team environment and follow company safety procedures.</div></li>\n<li>\n<div>Excellent communication skills, effectively and clearly communicate verbally and in writing.</div></li>\n<li>\n<div>Hands-on chemistry lab bench work experience required.</div></li>\n<li>\n<div>Ability to ensure GMP compliance when required.</div></li>\n<li>\n<div>Experience in organic or polymer chemistry is required.</div></li>\n<li>\n<div>Experience in supplier qualification, chemical raw material sourcing and releasing under GMP is a plus.</div></li></ul>\n<div><br>WORK ENVIRONMENT</div>\n<div>Work in both chemistry laboratory environment and cubicle setting.<br><br><br>EDUCATION<br><br>Master of Science in chemistry or related field.</div>\n<div><br>EXPERIENCE<br><br>5 years industry experience depending on level of education</div>"}