{"job title": "Research Scientist", "company": "Danaher Corporation", "city state": "– Orange, CA", "rating": "3.3", "job description": "<ul>\n<li>*Danaher Company Description**</li>\n</ul>\n\nKaVo Kerr is a cohesive organization comprised of two global leaders, united to provide dental excellence and serve as a single premier partner for the dental community. KaVo Kerr operates with a common vision inspiring and helping our customers, their patients and our own associates realize their potential. KaVo Kerr offers solutions for endodontics, restoratives, treatment units, infection prevention, imaging, rotary and instruments\n\n\n<ul>\n<li>*Description**</li>\n</ul>\n\n<strong>MAJOR RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>Independently plans and executes research in support of assigned development projects.</li>\n<li>Identifies gaps in laboratory capabilities and safety matters. Independently develops solutions.</li>\n<li>Organizes and presents data of a complex nature and draws sound scientific conclusions.</li>\n<li>Independently conducts work in agreement with supervisor. Designs and carries out experimental work using appropriate methods and instrumentation.</li>\n<li>Able to lead NPD projects with minimal supervision; is accountable for achievement of project plan for NPD and Sustaining projects. Can lead Sustaining projects of moderate to high complexity independently.</li>\n<li>Suggest experimental approaches to complex problems and carry out investigations independently.</li>\n<li>Design and carry out experiments that scientifically confirm performance, reliability, and shelf life.</li>\n<li>Collaborate on plan for design verification studies, carry out design verification studies.</li>\n<li>Independently plan schedule of research according to company?s timetable, and establish daily or weekly routines necessary to meet project timetable.</li>\n<li>Develop research plan and design experiments of a complex nature.</li>\n<li>Records experimental data according to established procedures, makes calculations, evaluates results, makes recommendations and maintains accurate records of work.</li>\n<li>Prepare standard technical reports and memos. Summarizes and communicates data of a complex nature as required.</li>\n<li>Identifies deficiencies and modifies/improves existing procedures. Authors operating procedures as needed.</li>\n<li>Develops solutions to problems of intermediate and advanced scope. Skilled in problem solving and root cause analysis.</li>\n<li>Independently conducts PSP investigations, identified root causes. Can supervise CAPA at basic and intermediate level.</li>\n<li>Regularly applies scientific theory to reach conclusions based upon data analysis.</li>\n<li>Contributes to design of experiments at an intermediate and advanced level, can design simple to complex experiments.</li>\n<li>Collect and analyze information on competitor product performance.</li>\n<li>Provides training to research associates.</li>\n<li>Develop in-depth knowledge of new and existing products.</li>\n<li>Evaluation of ideas, competition products and new technologies.</li>\n<li>Perform other duties as responsibilities necessitate.</li>\n<li>*Qualification**</li>\n</ul>\n\n<strong>EDUCATION/EXPERIENCE:</strong>\n\n\n<ul>\n<li>Ph.D. degree in chemistry, biochemistry or chemical engineering or related fields and 0-3 years of experience in industry or post-doctoral/start-up environments.</li>\n<li>Understanding of good laboratory practices.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Good organizational/time management skills.</li>\n<li>Ability to prioritize.</li>\n</ul>\n\nMetrex Research Inc. is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, national origin, religion, gender, age, marital status, disability, veteran status, sexual orientation, gender identity, or any other characteristic protected by law. We maintain a drug-free workplace and perform pre-employment substance abuse testing.\n<br><br>\n<strong>#LI-RE1</strong>\n<br><br>\n<strong>IND-KAVO</strong>\n\n\n<ul>\n<li>*Danaher Corporation Overview**</li>\n</ul>\n\nDanaher is a global science &amp; technology innovator committed to helping our customers solve complex challenges and improve quality of life worldwide. Our world class brands are leaders in some of the most demanding and attractive industries, including life sciences, medical diagnostics, dental, environmental and applied solutions. Our globally diverse team of 67,000 associates is united by a common culture and operating system, the Danaher Business System, which serves as our competitive advantage. We generated $18.3B in revenue last year. We are ranked #162 on the Fortune 500 and our stock has outperformed the S&amp;P 500 by more than 1,200% over 20 years.\n<br>\nAt Danaher, you can build a career in a way no other company can duplicate. Our brands allow us to offer dynamic careers across multiple industries. We?re innovative, fast-paced, results-oriented, and we win. We need talented people to keep winning. Here you?ll learn how DBS is used to shape strategy, focus execution, align our people, and create value for customers and shareholders. Come join our winning team.\n\n\n<ul>\n<li>*Organization:** KaVo Kerr</li>\n<li>*Job Function:** Science</li>\n<li>*Primary Location:** North America-North America-United States-CA-Orange</li>\n<li>*Schedule:** Full-time</li>\n<li>*Req ID:** KAV002322</li>\n</ul>"}