{"job title": "Systems Data Analyst", "company": "Eliassen Group", "city state": "– Boston, MA", "rating": "4.5", "job description": "Our client is a Boston-based financial investment firm that serves over twenty million customers. They employ tens of thousands of individuals and manage trillions of dollars in assets. With almost a century of experience, this financial services company is an industry leader, both nationally and globally. Our client is known for being a great place to work, and they are looking for a Systems Data Analyst to join their team. In this role, you will join the database team to work on Business Intelligence capability.<br><br>Contract Length: 6+ Months\n<br><br>\n<strong>Who You Are:</strong>\n<ul>\n <li>Bachelor's degree preferred; or equivalent work experience</li> <li>At least 5 years of experience as a Systems Analyst in a database group</li> <li>Financial industry experience preferred</li> <li>Experience with SDLC and developing associated artifacts</li> <li>Proven experience working at the macro and micro level</li> <li>SQL and database concepts and interpretations</li> <li>Experience designing and analyzing data solutions as a systems analyst</li> <li>Ability to formulate and articulate/present data findings to business/technology stakeholders</li> <li>Excellent communication and interpersonal skills</li>\n</ul>\nJob ID: 304170\n<br><br>\n<strong>About Eliassen Group:</strong>\n<br><br>\nEliassen Group provides strategic talent solutions to drive our clients innovation and business results. Leveraging nearly 30 years of success, our expertise in IT staffing, Agile consulting, creative services, managed services, and life sciences enables us to partner with our clients to execute their business strategy and scale effectively. Headquartered in Reading, MA and with offices from coast to coast, Eliassen Group offers local community presence, deep networks, as well as national reach. For more information, visit http://www.eliassen.com.\n<br><br>\nEliassen Group is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.\n<br><br>\nDont miss out on our referral program! If we hire a candidate that you refer us to then you can be eligible for a <strong><em>$1,000 referral check!</em></strong>"}