{"job title": "Scientist, Molecular Engineering", "company": "Fate Therapeutics, Inc.", "city state": "– San Diego, California", "rating": "4.6", "job description": "Fate Therapeutics is currently seeking a talented and highly motivated molecular biologist with strong genetic engineering background to join a multidisciplinary R&amp;D team for developing stem cell derived off-the-shelf immunotherapies. The candidate will play a key role in developing and optimizing strategies for engineering multiple cell types including induced pluripotent stem cell (iPSC) lines used for derivation of cell therapy products. The candidate will also be involved in developing/validating novel gene editing techniques compatible with Fates proprietary state-of-the-art iPSC platform. The successful candidate must demonstrate broad and in-depth knowledge of cutting-edge genomic engineering techniques as well as strong expertise in generation and characterization of genetically modified cell lines. The position will require innovative thinking, strong independent and collaborative research abilities, and excellent oral and written communication skills. This is a full-time hands-on research position that reports to the Associate Director, Molecular Biology and is located at Fates corporate headquarters in San Diego, CA.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Drive research projects with timely delivery of conclusions backed by solid data and methodical analyses</li>\n<li>Develop molecular strategies for genomic engineering by applying the latest genetic manipulation technologies for optimized efficiency and specificity scalable for manufacturing process</li>\n<li>Propose and test innovative engineering methods to advance Fates technology platform</li>\n<li>Establish assays to characterize genetically engineered iPSCs to support early product characterization</li>\n<li>Design and generate constructs using standard cloning techniques including ligation and assembly</li>\n<li>Generate stable/clonal genetically modified iPSC lines with comprehensive molecular and phenotypic characterization</li>\n<li>Communicate research and development findings in cross-disciplinary team meetings as well as with external partners</li>\n<li>Manage and mentor a team of scientists to complete tasks as defined by corporate and department objectives</li>\n</ul>\nQualifications\n\n<ul>\n<li>Requires Ph.D. degree and minimum 2 years postdoctoral training in molecular biology, synthetic biology, cell biology, or related discipline. Industry experience preferred.</li>\n<li>Demonstrated expertise in cutting edge gene editing technologies, including gRNA design, donor template building, genome cleavage assays, off-target editing evaluation, genomic integration analysis, etc.</li>\n<li>Extensive experience in molecular cloning, vector construction, transfection and viral infection, and transgene expression</li>\n<li>Prior stem cell experience including iPSC is preferred</li>\n<li>Prior immunology experience including T cell and NK cell biology and chimeric antigen receptors is preferred</li>\n<li>Experience in working with cGMP compliant/quality controlled procedures is a plus</li>\n<li>Excellent creativity, technical decision-making, and trouble shooting skills</li>\n<li>Excellent communication and presentation skills</li>\n</ul>\n<strong>Working Conditions and Physical Requirements</strong>\n\n<ul>\n<li>Will require working with blood and cell lines of human and animal origin</li>\n<li>Will require working with hazardous materials</li>\n<li>100% on-site work at corporate headquarters in San Diego, CA</li>\n<li>Occasional evening and weekend work will be required</li>\n</ul>\nThe preceding job description indicates the general nature and level of work performed by employees within this classification. Additional and incidental duties related to the primary duties may be required from time to time.\n<br><br>\nFor consideration send cover letter and resume to: careers@fatetherapeutics.com and reference job code 204TL.\n<br><br>\n<strong>About Fate Therapeutics, Inc.</strong>\n<br><br>\nFate Therapeutics is a clinical-stage biopharmaceutical company dedicated to the development of first-in-class cellular immunotherapies for cancer and immune disorders. The Company is pioneering the development of off-the-shelf cell products using its proprietary induced pluripotent stem cell (iPSC) product platform. The Companys immuno-oncology pipeline is comprised of FATE-NK100, a donor-derived natural killer (NK) cell cancer immunotherapy that is currently being evaluated in three Phase 1 clinical trials, as well as iPSC-derived NK cell and T-cell immunotherapies, with a focus on developing augmented cell products intended to synergize with checkpoint inhibitor and monoclonal antibody therapies and to target tumor-specific antigens. The Companys immuno-regulatory pipeline includes ProTmune, a next-generation donor cell graft that is currently being evaluated in a Phase 2 clinical trial for the prevention of graft-versus-host disease, and a myeloid-derived suppressor cell immunotherapy for promoting immune tolerance in patients with immune disorders. Fate Therapeutics is headquartered in San Diego, CA. For more information, please visit www.fatetherapeutics.com."}