{"job title": "Senior Scientist", "company": "GlaxoSmithKline", "city state": "– Philadelphia, PA", "rating": "3.7", "job description": "Position Title: Senior Scientist\n<br><br>\n Working Location: Pennsylvania\n<br><br>\n Employment Status: Full time\n<br><br>\n Required Experience: 5 years\n<br><br>\n Required Education: Bachelors\n<br><br>\n Travel Required: 0%\n<br><br>\n Job Description:\n<br>\nThe Advanced Technologies and Development group is part of Biopharmaceutical Analytical Sciences and is responsible for development of new product quality assays, novel methodologies, and platform methods to support GSKs biopharmaceutical product pipeline. The group uses a wide variety of state of the art methodologies including UPLC, cIEF, and CGE from development through validation, and is responsible for investigation and qualification of new separation modalities to further streamline the biopharma development process. The group also focuses on advances in automation and implementation/maintenance of open access systems.<br><br><strong>Major Accountabilities:</strong>\n\n\n<ul>\n<li>Develop and qualify analytical methods for the analysis of recombinant proteins and biotherapeutics.</li>\n<li>Perform HPLC/uHPLC and troubleshoot methods and equipment.</li>\n<li>Perfom capillary gel electrophoresis (PA800+, or LabChip) and cIEF (Protein Simple). Troubleshoot methods and equipment.</li>\n<li>Draft and review analytical methods, qualification reports and method development/characterization reports.</li>\n<li>Generate, collate, critically analyze/review and draw conclusions from complex experimental data.</li>\n<li>Evaluate and apply new techniques/technologies in relevant work areas and to adhere to and influence GxP policies and procedures.</li>\n<li>Anticipate and identify problems, and execute corrective actions with minimal supervision.</li>\n<li>Potential for managing project analytical sub teams and authoring relevant CMC sections of regulatory submissions.</li>\n\n</ul>\n\n<strong>Essential Skills:</strong>\n\n\n<ul>\n<li>Bachelors or Masters degree in a biotechnology/analytical chemistry/biochemistry related discipline, with a minimum of 5 years of experience in biopharmaceutical product development in the industrial environment.</li>\n<li>Experience in working with separation and analysis of proteins and peptides.</li>\n<li>Strong skills in HPLC/uHPLC separations using a variety of modalities (RPLC, SEC, IEX).</li>\n<li>Experience in cIEF and capillary gel electrophoresis separation techniques such as Protein Simple, PA800+, or LabChip.</li>\n</ul>\n\nWe are an Equal Opportunity Employer and do not discriminate against\n<br>\nany employee or applicant for employment because of race, color, sex,\n<br>\nage, national origin, religion, sexual orientation, gender identity,\n<br>\nstatus as a veteran, and basis of disability or any other federal,\n<br>\nstate or local protected class.\n<br><br>\n<strong> .</strong>"}