{"job title": "HPE Labs Research Scientist", "company": "Hewlett Packard Enterprise", "city state": "– Fort Collins", "rating": "3.4", "job description": "The Hewlett Packard Labs research group is unique in the world, in that it focuses on all levels of the stack from core technologies to applications, and many layers in between. We offer the opportunity to do cutting edge research and see it become real. If you join Hewlett Packard Labs you will have an opportunity to work with top researchers working on diverse levels of a common vision, which is to develop all aspects that will result in the enterprise data center of the future. Your primary focus initially will be on the design, modeling, and analysis of a novel interconnection fabric that will serve as the communication backbone of these future systems. Specific activities will include:\n<br><br>\n- Using and expanding the capabilities of our interconnect-specific simulation infrastructure.\n<br><br>\n- Participate in the micro-architecture design of the fabric switches.\n<br><br>\n- Participate in the design and analysis of system topologies that are best suited for certain customer driven requirements\n<br><br>\n- Interact with other teams who are developing other hardware, firmware, software, mechanical, and thermal aspects of the systems research and development that target these future data center systems.\n<br><br>\nWe are looking for candidates with a PhD (or equivalent) in computer science or engineering, who are interested in a research engineer and or advanced development position. We expect candidates to have demonstrated the ability to frame, execute, and communicate research, for example, via papers published in top-tier conferences or journals.\n<br><br>\nWe value the ability to work independently and in teams, excellent verbal and written communication skills, strong mathematical and computer engineering background, and the desire to learn new techniques to solve problems. Excellent building skills for complex software and hardware systems are a significant plus.\n<br><br>\n<strong>Job Responsibilities</strong>\n<ul>\n<li>Participates as a member of a research team focused on the design of future high-performance, energy efficient interconnect fabric architectures which includes the design and analysis of switches and topologies for scale-out and scale-up systems focused on the development of new products and intellectual property.</li><li>Help in the creation of research plans, investigative procedures, and collection and analysis guidelines for the target investigation. Collaborate with internal and external partners to perform experiments and validations in accordance with the overall research plan.</li><li>Participate in the development and/or extension of modeling tools that will provide higher levels of analytic capability for the research agenda.</li><li>Develop and carry processes for collecting, recording, and analyzing data.</li><li>Communicate results and conclusions to team members for review and feedback.</li><li>Prepare literature and presentations for peer review, publication, and delivery at industry and scientific events and conferences.</li><li>Create patent applications and supporting documentation.</li><li>Drive innovation and integration of new technologies and practices into research and product development organizations</li><li>Provide guidance and mentoring to less experienced staff members</li>\n</ul>\n<strong>Education and Experience</strong>\n<ul>\n<li>PhD degree (or foreign equivalent) in Computer Science or Engineering</li><li>A minimum 4 years of proven academic or industrial research experience involving the design, analysis, and simulation of high-performance interconnection fabrics.</li> <li>Proven capability to define and execute a research agenda.</li> <li>Proven capability to effectively work in a team based environment.</li>\n</ul>\n<strong>Knowledge and Skills</strong>\n<ul>\n<li>A very high level of coding and debugging skills in both conventional languages such as C++ or Java, as well as scripting languages such as Python or Perl. Fluency in C++ is a plus.</li><li>Strong background in algorithms, performance analysis and tuning.</li><li>Demonstrated expertise in both the use and creation of interconnect specific simulation tools.</li> <li>Excellent written and verbal English communication skills.</li><li>Ability to effectively communicate research plans, proposals, and results, and negotiate options at management levels.</li><li>Strong background in high-performance interconnect fabric architecture.</li><li>Broad familiarity with system software is a plus.</li> <li>Familiarity with hardware design and VLSI processes, hardware description languages (Verilog, VHDL), and EDA tools are a plus.</li><li>Ability to understand the impact of architectural design decisions on performance, VLSI area, and power is a plus.</li>\n</ul>\n\nHewlett Packard Enterprise is EEO F/M/Protected Veteran/ Individual with Disabilities. HPE will comply with all applicable laws related to the use of arrest and conviction records, including the San Francisco Fair Chance Ordinance and similar laws and will consider for employment qualified applicants with criminal histories."}