{"job title": "Scientist, Immunobiology", "company": "Johnson &amp; Johnson", "city state": "– South San Francisco, California", "rating": "4.0", "job description": "Janssen\n<br>\nResearch &amp; Development, LLC., a Johnson and Johnson Company is hiring a Scientist,\n<br>\nImmunobiologist within the Infectious Diseases Early Discovery team, to be\n<br>\nlocated in South San Francisco, CA.\n<br><br>\nAt\n<br>\nthe Janssen Pharmaceutical Companies of Johnson &amp; Johnson, what matters\n<br>\nmost is helping people live full and healthy lives. We focus on treating,\n<br>\ncuring and preventing some of the most devastating and complex diseases of our\n<br>\ntime. And we pursue the most promising science, wherever it might be found.\n<br><br>\nJanssen\n<br>\nResearch &amp; Development, LLC discovers and develops innovative medical\n<br>\nsolutions to address important unmet medical needs in oncology, immunology,\n<br>\nneuroscience, infectious diseases and vaccines, and cardiovascular and\n<br>\nmetabolic diseases. Please visit http://www.janssenrnd.com/ for more information.\n<br><br>\nWe are Janssen. Our mission drives us. Our\n<br>\npatients inspire us. We collaborate with the world for the health of everyone\n<br>\nin it.\n<br><br>\nWe are seeking a highly motivated and\n<br>\nproductive Scientist, Immunobiologist with a strong background in cellular\n<br>\nimmunology and immunotherapeutic approaches to join our drug discovery efforts\n<br>\nfor treating infectious diseases.\n<br><br>\nThe ideal candidate will have experience in T-cell\n<br>\nbiology and therapeutic vaccinology applied to chronic infectious diseases or\n<br>\noncology. The candidate should be a well-organized,\n<br>\nteam-orientated individual who\n<br>\ncan work efficiently with limited oversight. He will design and execute projects\n<br>\nwith significant hands-on involvement, and manage interactions with internal\n<br>\nand external partners.<br>\n\n<div><strong>Key responsibilities will be:</strong></div><ul><li>Establishes\n<br>\nin vivo mouse models to assess cellular responses elicited by various vaccine\n<br>\nstrategies</li><li>Applies expertise to drive research projects</li><li>Design and development of appropriate ex vivo immunogenicity\n<br>\nassays</li><li>Identifies\n<br>\nnew areas of research consistent with strategic direction</li><li>Reviews\n<br>\nscientific work in project-related fields and areas of expertise</li><li>Drive collaborative research interactions across\n<br>\nteams</li><li>Work productively as a team member as well as\n<br>\nindependently</li><li>Ensures\n<br>\nthe availability of adequate laboratory materials and justifies the purchase of\n<br>\nnew equipment</li>\n</ul>\n<strong>Qualifications</strong>\n\n<ul>\n<li>PhD in immunology with at least 1 year of\n<br>\npostdoctoral research experience preferably in an industry setting is required</li><li>Presents\n<br>\ndata at in-house research forums, and at outside professional meetings, where\n<br>\napplicable is preferred</li><li>Extensive experience in working with in vivo studies in vaccine, tumor\n<br>\nimmunotherapy or chronic infection models to evaluate cellular immune responses\n<br>\nincluding: tissue collection/preparation and immune cell phenotyping/functional\n<br>\nstudies is preferred</li><li>Experience in flow cytometry (phenotypic\n<br>\nprofiling and intracellular cytokine staining) is required</li><li>Experience in basic cellular immunology assays\n<br>\nsuch as ELISPOT, cytotoxicity and proliferation is required</li><li>Design/application of multiplex assays (MSD or\n<br>\nLuminex) is preferred</li><li>Proficiency in data analysis and presentation\n<br>\ntools such as GraphPad Prism, Excel. FlowJo is required</li>\n</ul>\n\n<strong>Primary Location</strong>\n<br>\nUnited States-California-South San Francisco\n<br>\n<strong>Organization</strong>\n<br>\nAlios BioPharma, Inc. (6224)\n<br>\n<strong>Job Function</strong>\n<br>\nBiology\n<br>\n<strong>Requisition ID</strong>\n<br>\n<strong>0695180830</strong>\n<br>"}