{"job title": "Research Scientist V", "company": "Kelly Services", "city state": "– Sugar Land, TX", "rating": "3.5", "job description": "<strong>Research Scientist V - Sugar Land, TX</strong>\n<br><br>\n<em>\"Use this link to chat with a recruiter now: https://flashrecruit.com/user/RachitaSaxena “</em>\n<br><br>\n<strong>Pay: $75.00-$90.00/hour</strong>\n<br><br>\n<strong>Length: 12 months</strong>\n<br><br>\nSummary:\n<br>\nThe main function of a research scientist is to conduct logical analyses of business, scientific, engineering, and other technical problems, formulating mathematical models of problems for solution.\n<br><br>\n<strong>Job Responsibilities:</strong>\n\n\n<ul>\n<li>Analyze findings to check the accuracy of the results.</li>\n<li>Resolves problems in input, storage, and retrieval of information, and develops alternate designs.</li>\n<li>Monitor clinical trials for research organizations or internal research.</li>\n<li>Apply theoretical expertise and innovation to create or apply new technology, such as adapting principles for applying computers to new uses.</li>\n<li>Consult with users, management, vendors, and technicians to determine computing needs and system requirements</li>\n<li>Plan and develop methods and procedures for collecting, organizing, interpreting, and classifying information for input and retrieval to and from computer.</li>\n<li>Operate, calibrate and maintain equipment used in quantitative and qualitative analysis.</li>\n<li>Designs computer information systems to provide management or clients with specific data</li>\n<li>Utilizes knowledge of electronic data processing principles, system and computer capabilities, mathematics, symbolic language, and optical or pattern recognition principles</li>\n<li>Establish and monitor quality assurance programs and activities to ensure the accuracy of laboratory results.</li>\n<li>Supervise, train, and direct lab assistants, laboratory technicians and technologists, and other laboratory workers engaged in laboratory testing.</li>\n</ul>\n\n<strong>Skills:</strong>\n\n\n<ul>\n<li>Verbal and written communication skills, attention to detail, and problem solving skills.• Expert ability to work independently and manage one’s time.• Expert leadership and mentoring skills necessary to provide support and constructive performance feedback.• Expert knowledge of Good Clinical Practice (international quality standard for human clinical trials) and local regulations.• Expert knowledge of the information and techniques needed to diagnose and treat human injuries and diseases.• Expert ability to analyze data and accurately document and record results.</li>\n</ul>\n\n<strong>Education/Experience:</strong>\n\n\n<ul>\n<li>Bachelor's degree in life sciences or related field required.</li>\n<li>10+ years experience required.\n<br><br>\n<strong>APPLY NOW!! Also, feel free to follow up via email to RACS113@KELLYSERVICES.COM</strong>\n<br><br>\n<strong>OR \"Use this link to chat with a recruiter now: https://flashrecruit.com/user/RachitaSaxena “</strong><br>\n\n<div>Why Kelly®?</div>\n<br><br>\nWith Kelly, youll have access to some of the worlds highest-regarded scientific organizations</li>\n</ul>\n\nproviding you with opportunities to work on todays most challenging, research-intensive, and relevant \n<br><br>\nprojects. Our connections can lead you to innovative scientific pursuits youll be proud to help \n<br><br>\nadvance. We work with 95 of the Fortune 100 companies, and found opportunities for more than 9,000 \n<br><br>\nscientific professionals last year.<br><br>You pursued a career in science to fuel your quest for knowledge and your desire to make the world \n<br><br>\na better place. Let Kelly fuel your careerconnect with us today.<br>\n\n<div>About\n<br>\nKelly Services®</div>\n<br><br>\nAs a workforce advocate for over 70 years, we are proud to directly employ nearly 500,000 people around the world and have a role in connecting thousands more with work through our global network of talent suppliers and partners. Revenue in 2017 was $5.4 billion. Visit <u>kellyservices.com</u> and connect \n<br><br>\nwith us on <u>Facebook</u>, <u>LinkedIn</u> and <u>Twitter</u>.<br><br>Kelly Services is an equal opportunity employer including, but not limited to, Minorities, Females, \n<br><br>\nIndividuals with Disabilities, Protected Veterans, Sexual Orientation, Gender Identity and is \n<br><br>\ncommitted to employing a diverse workforce. <u>Equal Employment Opportunity \n<br><br>\nis The Law.</u>"}