{"job title": "Bioinformatics Scientist", "company": "Merck USA", "city state": "– West Point, PA", "rating": "3.7", "job description": "<b>Requisition ID: </b>INF004835<br><br><div><div><div>Merck &amp; Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified itslegacy for over a century. Mercks success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.</div></div></div><div>We are seeking a highly motivated bioinformatics scientist to join our Global Research IT team at Merck. As a scientist in Research IT organization, the successful candidate will partner with biologists and data analysts in Merck Research Labs to manage the acquisition, QC, storage, and access of large volumes of genomics and other scientific data in support of global MRL clinical and discovery programs.<br><b><br>Job responsibilities</b><br><ul><li>Work with team members, business stakeholders, and a global network of vendors, collaborators, and business partners to coordinate data acquisition and management</li><li>Support existing data QC/analysis pipelines</li><li>Manage existing database/applications for genomics data management and anlaysis</li><li>Participate in NGS data analysis pipeline development</li><li>Contribute to team's continuous improvement efforts to enhance operations efficiency</li><li>Support team's initiatives to identify, evaluate, adopt fit-for-purpose large data storage/analysis environments/platforms/applications</li></ul><br></div><div></div><b>Qualifications</b><br><br><div><b>Education Minimum Requirement: </b><br><ul><li>A Bachelor's or Master's degree with a focus on computational biology, bioinformatics, or computer science or related fields</li></ul><b>Required Experience and Skills: </b><br><ul><li>At least two years experience with NGS data</li><li>Proficiency in programming languages (Python, Perl, C++), and mathematical and statistical package, such as R and MatLab, in a Unix/Linux environment</li><li>Experience with high-performance Linux cluster and cloud computing</li><li>Excellent interpersonal and team skills</li><li>Demonstrated ability to collaborate with cross-functional project teams</li><li>Excellent oral and written communication skills in English</li></ul><b>Preferred Experience and Skills</b>:<br><ul><li>Knowledge of next-generation sequencing technology</li></ul></div><div>Your role at Merck is integral to helping the world meet new breakthroughs that affect generations to come, and were counting on your skills and inventiveness to help make meaningful contributions to global medical advancement. At Merck, were inventing for life.</div><div><br>If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request to (e-mail removed).</div> <div><b>Search Firm Representatives Please Read Carefully: </b></div><div>Merck &amp; Co., Inc. is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any employee at Merck via email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Merck. No fee will be paid in the event the candidate is hired by Merck as a result of the referral or through other means.</div><div></div><div><div></div><div>For more information about personal rights under Equal Employment Opportunity, visit: </div><div></div><div> </div></div>"}