{"job title": "Associate Principal Scientist, Computational Scientist", "company": "Merck and Co.", "city state": "– Boston, MA", "rating": "3.7", "job description": "We are seeking a highly motivated and enthusiastic computational scientist to join a team dedicated to advancing Merck’s Oncology and Immuno-Oncology pipelines. The successful candidate will:\n<br><br>\n· Analyze, visualize and summarize NGS and other molecular data from oncology clinical trials and proprietary and public large molecular databases.\n<br><br>\n· Use oncology molecular data to identify biomarkers and molecularly defined groups of patients most likely to benefit from individual therapies, with a focus on translating biomarker-driven strategies into the clinic.\n<br><br>\n· Effectively present data analyses to inform and interact with stakeholders representing a wide span of internal organizations, including Therapeutic Area Biology, Pharmacology, Statistics, Translational Medicine, Clinical Development, Commercial and Medical Affairs.\n<br><br>\nQualifications\n<br><br>\nRequired:\n<br><br>\n· A Phd in Engineering, Applied Mathematics, Bioinformatics, Computational Biology or related field with a significant computational and statistical component.\n<br><br>\n· A minimum of 5 years of post-PhD experience applying computational methods, in cancer biology, in a pharma, biotech or academic setting, by using scientific computation environments (Matlab and/or R highly preferred).\n<br><br>\n· Hands-on analysis experience with large genetic, genomic, and clinical datasets , with proven record of impact on the drug development process.\n<br><br>\n· Hands-on experience with key NGS bioinformatics tools (BWA, GATK etc) and with linux high performance environment (shell scripting, python).\n<br><br>\n· Experience with a matrix environment and ability to effectively collaborate with colleagues from a wide range of disciplines.\n<br><br>\nPreferred:\n<br><br>\n· Understanding of the major concepts of immuno-oncology biology and of the interaction between tumor and the immune system as represented in molecular data.\n<br><br>\n· Experience with analysis of data originating from clinical trials.\n<br><br>\n· Working knowledge of methods of statistical learning and application to biological problems.\n<br><br>\n· Experience with modern data mining techniques including ANNs.\n<br><br>\n· Record of publishing in high profile scientific journals"}