{"job title": "Principal Scientist", "company": "Merck and Co.", "city state": "– San Francisco, CA", "rating": "3.7", "job description": "This position will support Mercks drug discovery efforts in the Department of Pharmacokinetics, Pharmacodynamics and Drug Metabolism (PPDM) and specifically within the Early Absorption, Distribution, Metabolism and Excretion (eADME) group where the scientific focus is aimed at leveraging in silico, in vitro and in vivo tools to rapidly progress compounds primarily in discovery.\n<br><br>\nResponsibilities include and are not limited to the following:\n<br>\nGuide the application of in silico approaches to inform decision making and compound follow up related to the characterization of metabolism, transporter interactions, exposure-response relationships and variability. Work with other computational chemists and cheminformaticians to discover new computational methodology, create workflows and share successful methods for novel ADME applications.\n<br>\nDesign and execute studies utilizing in silico, in vitro and in vivo approaches to predict, understand, and optimize ADME properties of our therapeutics entering development\n<br>\nRepresent PPDM and ADME on Discovery Teams throughout all stages of discovery to build key structure-property relationships across multiple drug modalities;present analyses to teams and to senior management\n<br>\nSeek out opportunities to improve Merck’s global R&amp;D capabilities through collaboration with Chemistry, Pharmacology, Safety Assessment, and other groups.\n<br>\nMust excel in a team environment, where they will also collaborate with development functions (eg, medicinal and computational chemistry, translational pharmacology, pharmaceutics, and toxicology) in order to prepare early data sets that can be translated to early compound prioritization for clinical development\n<br>\nExpected to effectively present their work at team meetings as well as promote Merck science through publications and presentations/lectures\n<br>\nThis position reports to the eADME Team Lead based at our Kenilworth, NJ site with a dotted line into the local ADME manager in South San Francisco\n<br><br>\n<strong>Qualifications\n<br><br>\nEducation and Work Experience Requirements:</strong>\n<br>\nMaster’s degree with a minimum of (10) years Industry experience\n<br>\nPh.D. with a minimum of (8) years Industry experience in a Pharmaceutical Preclinical Development or Discovery organization\n<br><br>\n<strong>Required Experience:</strong>\n<br>\nStrong leadership, interpersonal, communication, problem solving, and collaboration skills along with strengths in delivering results on firm deadlines in support of discovery/early development programs.\n<br>\nExperience of providing ADME support to drug discovery teams and guiding the optimization of small molecule therapeutics towards development candidates.\n<br>\nDemonstrated disposition towards recognition in the field, creativity and innovation via a strong publication/presentation record.\n<br>\n<strong>Preferred Experience:</strong>\n<br><br>\nKnowledge of the state-of-the-art for computational chemistry and its application in drug discovery and ADME.\n<br>\nExperience in the prediction of one or more aspects of human pharmacokinetics and/or safety related endpoints as it relates to human therapeutics.\n<br>\nHigh learning agility and a willingness to contribute at all levels of the eADME group, including areas outside of the individual’s expertise.\n<br>\nExperience in collaborating on multidisciplinary project teams that span cardio-renal, metabolic, and/or ophthalmic areas"}