{"job title": "Earth Scientist", "company": "Pacific Northwest National Laboratory", "city state": "– Richland, WA", "rating": "3.7", "job description": "<ul>\n<li>*Organization and Job ID**</li>\n</ul>\n\nJob ID: 308226\n<br><br>\nDirectorate: Energy &amp; Environment\n<br><br>\nDivision: Earth Systems Science\n<br><br>\nGroup: Environmental Assessment &amp; Engineering\n\n\n<ul>\n<li>*Job Description**</li>\n</ul>\n\nPacific Northwest National Laboratory?s Environmental Assessment and Engineering Group is seeking a candidate with demonstrated knowledge and experience in the development of customized analytic and knowledge management capabilities used in natural resource and environmental assessments; programmatic planning and analysis addressing the implementation of environmental policies and regulations (such as NEPA); and complex stakeholder elicitation and engagement strategies. The preferred candidate will have experience working with integrated, multi-disciplinary teams of scientists and engineers, and excel in written and oral written communications.\n<br><br>\nResponsibilities: The incumbent will work under the guidance of senior scientists and project managers, and will be accountable for performing the following technical tasks with the level of quality, timeliness, and cost to effectively complete their assigned responsibilities and project expectations:\n\n\n<ul>\n<li>Lead or contribute to the design, development, and use of public (or stakeholder) facing web or software-based tools and workspaces for data collection, processing, and management.</li>\n<li>Lead or contribute to technical proposals, project reports, and scientific and technical products.</li>\n<li>Contribute to the development and growth of new opportunities and capabilities for project and program teams.</li>\n<li>*Minimum Qualifications**</li>\n<li>Bachelor's degree with 2 years of experience, or an advanced degree.</li>\n<li>*Preferred Qualifications**</li>\n</ul>\n\nPreference will be given to candidates with demonstrated knowledge and professional experience in the following areas:\n\n\n<ul>\n<li>Combination of knowledge and experience with the development and use of online tools and workspaces for stakeholder engagement, and data/knowledge management.</li>\n<li>Ability to identify and improve implementation of approaches and processes to streamline development of documents by large multi-disciplinary teams.</li>\n<li>Familiarity with agencies, stakeholders, and challenges associated with storage, transportation, and disposition of nuclear materials and waste forms; nuclear energy production, and remediation of nuclear sites.</li>\n<li>*Equal Employment Opportunity**</li>\n</ul>\n\nBattelle Memorial Institute (BMI) at Pacific Northwest National Laboratory (PNNL) is an Affirmative Action/Equal Opportunity Employer and supports diversity in the workplace. All employment decisions are made without regard to race, color, religion, sex, national origin, age, disability, veteran status, marital or family status, sexual orientation, gender identity, or genetic information. All BMI staff must be able to demonstrate the legal right to work in the United States. BMI is an E-Verify employer. Learn more at jobs.pnnl.gov.\n<br><br>\n_Directorate:_ _Energy &amp; Environment_\n<br><br>\n_Job Category:_ _Scientists/Scientific Support_\n<br><br>\n_Group:_ _Environmental Assmt &amp; Engrg_\n<br><br>\n_Opening Date:_ _2018-08-17_\n<br><br>\n_Closing Date:_ _2018-09-16_"}