{"job title": "Earth Scientist, Cloud-Aerosol Interactions via Data Analysis &amp; Modeling", "company": "Pacific Northwest National Laboratory", "city state": "– Richland, WA", "rating": "3.7", "job description": "<ul>\n<li>*Organization and Job ID**</li>\n</ul>\n\nJob ID: 308191\n<br><br>\nDirectorate: Earth &amp; Biological Sciences\n<br><br>\nDivision: Atmospheric Sciences &amp; Global Change\n<br><br>\nGroup: Atmospheric Measurement &amp; Data Sciences\n\n\n<ul>\n<li>*Job Description**</li>\n</ul>\n\nPacific Northwest National Laboratory (PNNL) is recruiting an innovative early career scientist interested in inter-disciplinary research associated with developing new scientific insights into the lifecycle of organic aerosols and their impact on cloud properties using data analysis and modeling tools. This involves having a deep understanding of microphysical processes of liquid, ice, and mixed-phase clouds and how those processes are perturbed by aerosols. The candidate is also expected to be familiar with organic gas- and particle-phase chemistry associated with the formation, growth, and aging of secondary organic aerosol (SOA) since and their effect on cloud condensation and ice nuclei (CCN &amp; IN). You will be expected to have an understanding of how aerosol properties affect cloud formation and lifetimes, absorption and scattering of light, and how meteorological processes influence the aerosol lifecycle. A strong grasp of aerosol mixing state, transport over multiple scales, and fate via wet removal and dry deposition of particles is desirable. Hypotheses regarding new process-level understanding of cloud-aerosol interactions will be evaluated within a multi-scale modeling context and rigorously evaluated using a wide range meteorological, chemical, and aerosol field campaign measurements. Knowledge of measurement uncertainty and its effect on the interpretation of model predictions is important.\n<br><br>\nYou will be expected to work as part of a team of scientists at PNNL with experience in both measuring and modeling aerosols. Ultimately, you will be expected to develop your own hypotheses and execute a research plan that addresses those hypotheses.\n\n\n<ul>\n<li>*Minimum Qualifications**</li>\n</ul>\n\nMinimum Education Requirement: BS/BA 2 years? experience, MS 0 years? experience, PhD 0 years? experience\n<br><br>\nTechnical Expertise: Contributing professional who is building a professional reputation for technical expertise. Fully applies and interprets standard theories, principles, methods, tools and technologies within specialty.\n<br><br>\nLevel of Responsibility: Independently completes recurring assignments. Exercises limited judgment on work details. Makes preliminary selections and adaptations of technical alternatives.\n<br><br>\nBreadth of Technical Knowledge: Continues developing technical expertise and knowledge. Develops new skills.\n\n\n<ul>\n<li>*Preferred Qualifications**</li>\n</ul>\n\nPhD 2 years? experience.\n<br><br>\nPreference will be given to candidates with:\n<br><br>\n? Understanding of cloud microphysical processes, including those influenced by aerosols\n<br><br>\n? Understanding of gas- and particle-phase aerosol atmospheric chemistry, particularly with respect to SOA\n<br><br>\n? Experience analyzing a wide range meteorological, chemical, and aerosol measurements and in using these measurements to evaluate model output\n<br><br>\n? Experience running and modifying code in chemical transport models, preferably WRF-Chem\n<br><br>\n? Track record of high-quality publications in peer-reviewed journals\n<br><br>\n? Strong communication skills\n<br><br>\n? Experience with computational environments (Linux/Unix), computer languages (Fortran, Python, etc.), and analysis tools (R, NCL, Matlab, IDL, etc.) usually used for atmospheric modeling\n\n\n<ul>\n<li>*Equal Employment Opportunity**</li>\n</ul>\n\nBattelle Memorial Institute (BMI) at Pacific Northwest National Laboratory (PNNL) is an Affirmative Action/Equal Opportunity Employer and supports diversity in the workplace. All employment decisions are made without regard to race, color, religion, sex, national origin, age, disability, veteran status, marital or family status, sexual orientation, gender identity, or genetic information. All BMI staff must be able to demonstrate the legal right to work in the United States. BMI is an E-Verify employer. Learn more at jobs.pnnl.gov.\n<br><br>\n_Directorate:_ _Earth &amp; Biological Sciences_\n<br><br>\n_Job Category:_ _Scientists/Scientific Support_\n<br><br>\n_Group:_ _Atmospheric Measur &amp; Data Sci_\n<br><br>\n_Opening Date:_ _2018-08-06_\n<br><br>\n_Closing Date:_ _2018-10-02_"}