{"job title": "Principal Bioinformatics Scientist", "company": "Personal Genome Diagnostics", "city state": "– Baltimore, MD", "rating": "3.7", "job description": "<div>\n<div>\nPrincipal Bioinformatics Scientist<br>\n\n <div>\n<div>\nPosted in\n<br><br>\non \n<br><br>\n March 15, 2018\n<br><br>\n by \n<br><br>\n Nakera Lee</div>\n</div><br>\n\n<div><div>\n<ul>\n\n<br>\n<li>Full Time</li>\n\n<li>Baltimore, MD</li>\n<li>Posted 6 months ago</li>\n</ul><br>\n\n<div>Website\n<br>\n <strong>Personal Genome Diagnostics</strong></div><br>\n\n <div><strong>JOB DESCRIPTION:</strong>\n<br><br>\nDevelop and apply innovative solutions in bioinformatics, including new algorithms and software, to all aspects of the business, including research, development, and operations. Participate in the design, development, and maintenance of software, databases, pipelines, web sites, or other solutions, using appropriate programming languages and tools, to deliver company products and services.\n<br><br>\n<strong>KEY RESPONSIBILITIES:</strong>\n\n<ul>\n<li>Develop and apply innovative methods, algorithms, and software to support company products and services</li>\n<li>Analyze sequencing data using established and newly developed workflows</li>\n<li>Assist, collaborate, and consult with teams on analysis of genomic data</li>\n<li>Interpret and present analysis results to business units and/or collaborators</li>\n<li>Advise management on strategic systems conversions and integrations in support of business goals and objects.</li>\n<li>Interact with company managers on internal and external operations that are impacted by the capture, storage, processing and dissemination of information.</li>\n<li>Advise on major contracts for computing and information technology services, software, and equipment.</li>\n<li>Provide technical leadership and expertise for staff, including desktop hardware and software support.</li>\n</ul>\n<strong>REQUIRED EDUCATION AND EXPERIENCE:</strong>\n\n<ul>\n<li>PhD in bioinformatics, computational biology, genetics, computer science or similar</li>\n<li>7+ years of professional experience in Bioinformatics, Software development, or related sciences</li>\n<li>Demonstrated ability to make significant contributions to software projects</li>\n<li>Demonstrated ability to lead a project from inception to delivery</li>\n<li>Demonstrated ability to deliver cross-functional project milestones on-time and on-spec</li>\n<li>Proficiency developing and/or using bioinformatics tools</li>\n<li>Proficiency in utilizing data from public resources</li>\n<li>Proficiency in scripting languages (Python/Perl) and/or R/Matlab</li>\n<li>Experience working in Linux and running tasks in a cluster environment</li>\n<li>Experience in cancer genomics preferred</li>\n<li>Experience or training in statistics, algorithm development, or machine learning preferred</li>\n<li>Excellent written and verbal communication skills</li>\n</ul>\n<strong>ABOUT PERSONAL GENOME DIAGNOSTICS</strong>\n<br><br>\nEmpowering the Fight Against Cancer by Unlocking Actionable Information from the Genome. We are committed to developing a portfolio of regulated tissue-based and liquid biopsy genomic products for laboratories worldwide.\n<br><br>\nPGDx is located in Baltimore MD and offers competitive salaries, vacation/holiday pay, medical benefits and a stimulating work environment.\n<br><br>\nPlease submit applications (cover letter and resume) to HR@personalgenome.com\n<br>\nSpecial consideration will be given to internal PGDx employees who apply.</div><br>\n\n<div>\n<div>To apply for this job <strong>email your details to</strong> hr@personalgenome.com</div>\n </div>\n </div>\n </div><br>\n\n<div>\n<div>\nPosted in\n<br><br>\non \n<br><br>\n March 15, 2018\n<br><br>\n by \n<br><br>\n Nakera Lee</div>\n</div>\n</div>\n</div>\n\n<br>"}