{"job title": "Automation Scientist, Microscopy", "company": "Recursion Pharmaceuticals", "city state": "– Salt Lake City, UT", "rating": "4.6", "job description": "At Recursion, we combine experimental biology, automation, and artificial intelligence to quickly and efficiently identify treatments for human diseases. We are hiring an Automation Scientist to focus on the implementation, qualification, and improvement of our automated microscopy systems.\n<br><br>\n<strong>THE PROBLEMS YOU'LL SOLVE</strong>\n<br><br>\nEach week, we image millions of cells using our growing fleet of automated high throughput microscopes, generating terabytes of data per day. Image-acquisition is the essential final step in our assays, and can have a significant effect on the quality and speed of our drug discovery pipeline. As the number of microscopes increases, the complexity of managing them increases. To overcome this challenge, we created this new position, which will report to the Director of HTS Operations and offers an opportunity for professional growth.\n<br><br>\n<strong>You will:</strong>\n\n<ul>\n<li><strong>Implement</strong> new automated microscopy systems and imaging protocols across a fleet of scopes. You will oversee the implementation and optimization of our high-content imaging systems.</li>\n<li><strong>Collaborate</strong> with Data Scientists and Biologists to ensure that new instrumentation and functionality is implemented and producing class-leading cellular microscopy images.</li>\n<li><strong>Troubleshoot</strong> resolve, and/or escalate problems identified during image-acquisition, and experiment analysis to the vendor.</li>\n<li><strong>Identify</strong> lead, and contribute to optimization projects to improve image quality, increase acquisition speed, reduce failure rates and help guide our imaging systems to the next level of quality and performance.</li>\n</ul>\n<strong>THE EXPERIENCE YOU'LL NEED</strong>\n\n<ul>\n<li>A Bachelor's or Master's Degree in a scientific field</li>\n<li>Experience developing protocols for computer-controlled laboratory automation and an appreciation for the importance of eliminating machine variability</li>\n<li>An understanding of optics and the physics that underpin microscopy and/or the desire/ability to learn</li>\n<li>Practice reviewing configuration, data, and log files from instrumentation in order to detect trends and gain insight into instrument performance over time</li>\n<li>Experience communicating issues to instrument vendors and holding them accountable for the timely repair of instrumentation</li>\n<li>Fluently and openly communicate with Biologists, Data Scientists, and Software Engineers</li>\n<li>Experience performing statistical analysis and/or using programming languages such as C#, Python, and R</li>\n</ul>\n<strong>THE PERKS YOU'LL ENJOY</strong>\n\n<ul>\n<li>Coverage of health, vision, and dental insurance premiums (in most cases 100%)</li>\n<li>401(k) with generous matching (immediate vesting)</li>\n<li>Stock option grants</li>\n<li>Two one-week paid company closures (summer and winter) in addition to flexible, generous vacation/sick leave</li>\n<li>Commuter benefit and vehicle parking to ease your commute</li>\n<li>Complimentary chef-prepared lunches and well-stocked snack bars</li>\n<li>Generous paid parental leave (including adoptive)</li>\n<li>Fully-paid gym membership to Metro Fitness, located just feet away from our new headquarters</li>\n<li>Gleaming new 100,000 square foot headquarters complete with a 70-foot climbing wall, showers, lockers, and bike parking</li>\n</ul>\n<strong>WHAT WE DO</strong>\n<br><br>\nWe start with various human cell types in our automated laboratory, where we perturb biology 100k different ways each week (e.g. model a disease of interest, add a chemical compound, or some combination of those). We image the resulting cells using high throughput microscopy, resulting in about 2 million new images or greater than 20 terabytes of data each week. These data are analyzed using computer vision and machine learning methods that help us measure how cell morphology changes in subtle ways in each biological context. We can answer direct questions (e.g. are there compounds that rescues a disease-specific set of morphological changes), and over time as our dataset has increased, we can ask more complex questions across biology. From the outset, our approach is agnostic to preconceived notions and dogma in biology, enabling Recursion to operate in novel target space. Potential treatments from this platform are then evaluated by our discovery biology team, who develop a literature-based understanding of the disease and use traditional wet-lab approaches to confirm and prioritize the hits.\n<br><br>\n<em>Recursion is an equal opportunity employer and complies with all applicable federal, state, and local fair employment practices laws. Recursion strictly prohibits and does not tolerate discrimination against applicants because of race, color, religion, creed, national origin or ancestry, ethnicity, sex, pregnancy, gender (including gender nonconformity and status as a transgender individual), age, physical or mental disability, citizenship, past, current, or prospective service in the uniformed services, or any other characteristic protected under applicable federal, state, or local law.</em>"}