{"job title": "Medical Lab Scientist (MLS)", "company": "St. Vincent Health, IN", "city state": "– Indianapolis, IN", "rating": "3.2", "job description": "<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong><br><br>Job ID: 274832\n<br>\n Medical Lab Scientist (MLS)\n<br>\n Indianapolis, Indiana\n<br>\n<br>\n Regular\n<br>\n<strong> / </strong>\n<br>\n Rotating\n<br><br>\n<strong>Additional Job Information</strong>\n<br><br>\n<strong>Title:</strong> Medical Lab Scientist (MLS)\n<br><br>\n<strong>City, State:</strong> Indianapolis, IN\n<br><br>\n<strong>Location:</strong> Indianapolis-8333 Naab Rd\n<br><br>\n<strong>Department:</strong> SVMG Clinical Lab\n<br><br>\n<strong>Additional Job Details:</strong> Part-Time, Rotating, 24 hours Weekly\n<br><br>\nVarying times: 630-3pm, 7-330 pm, 830-5pm- Monday through Thursday, Friday 130-11pm shift- and on call tech once every 4-5 weeks.\n<br><br>\n<strong>About Us</strong><br>\n<div><div><div>St. Vincent, part of Ascension, is a nonprofit, faith-based health system that is guided by our mission to provide compassionate, personalized care, especially for those who are vulnerable. St. Vincent is one of Indianas largest employers with 22 ministries serving 57 counties in central and southern Indiana. Our 134-year-old health system includes a wide range of services including cardiovascular care, womens and childrens health, neurosciences, cancer care, orthopedics, bariatrics, primary care, emergency medicine, imaging, general surgery and long-term acute care.</div></div></div>\n<br><strong>Job Description</strong>\n<br><br>\n<strong>Job Summary:</strong>\n<br><br>\nThe Medical Lab Scientist performs routine diagnostic/analytic testing of laboratory specimens, and interprets, documents and reports test results in compliance with department procedures and applicable regulations.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n<li>Implements, validates, and reports laboratory test results.</li>\n<li>Performs instrument maintenance and troubleshooting.</li>\n<li>Conducts quality control and quality assurance testings.</li>\n<li>Maintains supplies needed for performance of tests.</li>\n<li>Assists with data collection or special projects as assigned.</li>\n<li>Assists in documentation and submission of all required laboratory, departmental and staff statistics/reports.</li>\n</ul>\n\n<strong>Qualifications</strong><br><br><strong>Licenses/Certifications/Registration:</strong>\n<br><br>\n<strong></strong><ul><strong>\n</strong><li><strong>\nRequired Credential(s):</strong>\n<br>\n<strong></strong><ul><strong></strong><li><strong>One or more of the following:</strong>\n\n\n<ul>\n<li>Medical Technologist (ASCP) credentialed from the American Society for Clinical Pathology Board of Certification (ASCP-BOC) obtained prior to hire date or job transfer date.</li> \n\n<li>Medical Lab Scientist (ASCP) credentialed from the American Society for Clinical Pathology Board of Certification (ASCP-BOC) obtained prior to hire date or job transfer date.</li> \n\n<li>Medical Tech credentialed from the American Medical Technologists (AMT) obtained prior to hire date or job transfer date.</li> \n</ul>\n\n</li>\n</ul>\n</li>\n</ul>\n<strong>Education:</strong>\n<ul>\n\n\n\n<ul>\n<li>High school diploma/GED with 2 years of experience, or Associate's degree, or Technical degree required</li>\n<li>Bachelor degree in Med Technology with minimum of 1 yr lab experience in clinical lab setting with certification from ASCP or equivalent.</li></ul>\n\n\n</ul>\n<strong>Work Experience:</strong>\n<ul>\n<li>Applicant must be able to perform lab testing analysis on blood and body fluids in a Clinical lab setting.\n<br>\nPerform Routine lab testing in the following depts.- Clinical Chemistry, Hematology, Urinalysis, Immunochemistry, Immunology, Coagulation on patient sample with accuracy and precision.\n<br>\nYou must be able to perform calibrations and maintenance on a variety of instruments and follow lab procedure protocols.\n<br>\nQualification requirements: Requirement listed above are representative of the knowledge, skills and abilities required.\n<br>\nBachelor degree in Med Technology with minimum of 1 yr lab experience in clinical lab setting is required with certification from ASCP or equivalent.</li>\n</ul>\n<strong>How To Apply</strong>\n<br><br>\nService of the Poor. Reverence. Integrity. Wisdom. Creativity. Dedication.\n<br>\nThese are the Core Values we uphold at St.Vincent.\n<br><br>\nIf they describe you, you may be a good candidate to join our nationally-recognized team at one of our many Indiana ministries.\n<br><br>\nTo view our job openings, visit www.stvincent.org/jobs\n<br><br>\nTo apply for a position online, click the \"Apply Now\" button.\n<br><br>\nOur online application system may not be compatible with non-Windows based operating systems (iPhones, iPads, or Mac computers) or non-Internet Explorer browsers. To optimize your user experience, we recommend utilizing a personal computer with Window Internet Explorer 8 to search and apply for career opportunities.\n<br><br>\nThe Spirit of Caring\n<br><br>\n<strong>Equal Employment Opportunity</strong><br>\n<div>St.Vincent is an EEO/AA Employer M/F/Disability/Vet. Please click the link below for more information.</div>\n<br>\n<div>\n<div>EEO is the Law Poster Supplement</div></div><br>\n\n<div>Please note that Ascension will make an offer of employment only to individuals who have applied for a position using our official application. Be on alert for possible fraudulent offers of employment. Ascension will not solicit money or banking information from applicants.</div>\n<br><strong>E-Verify Statement</strong>\n<br><br>\nSt. Vincent, a member of Ascension Health, participates in the Electronic Employment Verification Program. Please click the E-Verify link below for more information.<br>\n<div>\n<div>\n<div>\n<strong><div>Share:</div></strong></div><strong>\n </strong></div><strong>\n<br>\n</strong>\n </div>\n<br>"}