{"job title": "Credit Risk Analytics Consultant 3 - WFREIC Stress Testing", "company": "Wells Fargo", "city state": "– Des Moines, IA", "rating": "3.5", "job description": "<strong>Job Description</strong><br><br>At Wells Fargo, we want to satisfy our customers financial needs and help them succeed financially. Were looking for talented people who will put our customers at the center of everything we do. Join our diverse and inclusive team where youll feel valued and inspired to contribute your unique skills and experience.\n<br><br>\nHelp us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you!\n<br><br>\n<strong>Corporate Risk</strong> helps all Wells Fargo businesses identify and manage risk. We focus on three key risk areas: credit risk, operational risk and market risk. We help our management and Board of Directors identify and monitor risks that may affect multiple lines of business, and take appropriate action when business activities exceed the risk tolerance of the company.\n<br><br>\nThe <strong>Corporate Credit &amp; Market Risk</strong> group is responsible for independently overseeing the management of credit risk exposures (including monitoring and reporting on aggregate credit exposures across groups, legal entities, geographies, and jurisdictions) and the quality of credit risk management practices across the company. This oversight extends to all phases of a loans life cycle, including origination, underwriting, risk analysis, approval, documentation, boarding, monitoring, loss recognition, modification, and collection activities. Corporate Credit &amp; Market Risk is responsible for delegating and/or removing credit and investment approval authorities to the lines of business.\n<br><br>\nMore specifically, Corporate Credit &amp; Market Risk develops, maintains and ensures adherence to enterprise-wide credit risk frameworks, policies, and procedures that are aligned with the Board-approved risk appetite.\n<br><br>\n<strong>Credit Capital, Allowance and Stress Testing</strong> (CCAST) is a component of Corporate Credit &amp; Market Risk. CCAST engages with senior leaders in Credit Risk, Finance, Controllers and Treasury to support the $960B+ loan portfolio. The team is also responsible for maintaining strong relationships with regulators, external auditors, internal auditors and other examiners. CCAST has teams that are responsible for:\n<ul>\n <li>Consolidation, coordination, documentation and oversight of the allowance for credit losses (ACL) and related external disclosures in compliance with US GAAP and the COSO Internal Control Framework</li> <li>Oversight, modeling and estimation of risk weighted assets (RWA) in compliance with Basel regulations and Basel Risk Reporting requirements (BCBS 239)</li> <li>Coordination, oversight, documentation, and submission of the credit-related risks in the company-wide stress testing exercises in compliance with Dodd-Frank/Comprehensive Capital Analysis and Review (CCAR) requirements.</li>\n</ul>\nThe <strong>Allowance</strong> team is responsible for the consolidation and reporting of the Companys quarterly allowance for credit losses and semi-annual stress tests for the enterprise. The team is seeking an experienced accountant and/or credit risk consultant to assist with the quarterly allowance consolidation for the Wells Fargo Real Estate Investment Corporation (WFREIC) and CCAR processes.\n<br><br>\nThe position requires an individual who possesses the following:\n<ul>\n <li>An understanding of commercial and/or consumer lending transactions and credit risk attributes</li> <li>Business acumen, enabling positive interactions with various business, risk and finance groups across the Company</li> <li>Data query and analytical skills</li> <li>Ability to develop and maintain project planning materials including executive summaries, key roles and responsibilities of project team members, timelines and key milestones</li> <li>Problem solving skills in order to respond to and overcome challenges presented within the context of a complex credit risk data environment</li> <li>Ability to partner closely with other team members across the organization, maintaining a commitment to excellence in a fast paced environment</li> <li>Ability to develop effective solutions with the best information available within a rapidly evolving program</li> <li>Strong documentation and understanding of systems, data, process and controls</li>\n</ul>\nThis is a highly visible position that will partner closely with senior business and corporate function managers to achieve the following:\n<ul>\n <li>Coordinate with the Allowance team and the lines of business to compile, support, and document the quarterly reserve for the publicly-held Wells Fargo Real Estate Investment Corporation (WFREIC)</li> <li>Prepare ACL reports, presentations and associated documentation for senior management, SEC reporting, Regulatory reporting, Corporate Tax, Corporate Treasury, auditors, and regulators</li> <li>Work with SEC and regulatory reporting to ensure accuracy and completeness of disclosures</li> <li>Assist with ACL process walkthroughs with various internal and external groups (KPMG, OCC, Fed, WF Audit Services) and respond to audit inquiries</li> <li>Coordinate with the Allowance team and the lines of business contacts to compile, support, and document the quarterly Allowance binder</li> <li>Assess and manage upstream and downstream impacts of changes to ACL process, controls, communication, training, reporting, and presentations</li> <li>Support Allowance stress test credit submissions</li> <li>Support transition of the quarterly consolidation process, Stress Testing process and other Allowance related processes to the Current Expected Credit Losses process. (CECL)</li> <li>Support the implementation of new accounting standards for the Allowance for Credit Losses in partnership with project team members in the Risk, Finance and Controllership areas</li> \n</ul>\nOpen to any location in the Wells Fargo footprint<br><br><strong>Required Qualifications</strong>\n<ul>\n<li>7+ years of risk reporting experience, risk analytics experience, or a combination of both</li>\n</ul>\n<strong>Desired Qualifications</strong>\n<ul>\n<li>A BS/BA degree or higher in accounting, finance, or economics</li><li>Credit and risk analysis experience</li><li>Experience in gathering, analyzing and interpreting large datasets</li> <li>Excellent verbal, written, and interpersonal communication skills</li><li>Strong analytical skills with high attention to detail and accuracy</li><li>Ability to interact with integrity and a high level of professionalism with all levels of team members and management</li><li>Ability to prioritize work, meet deadlines, achieve goals, and work under pressure in a dynamic and complex environment</li><li>Ability to research and report on a variety of issues using problem solving skills</li><li>Advanced Microsoft Office (Word, Excel, Outlook, PowerPoint, and Access) skills</li>\n</ul>\n<strong>Other Desired Qualifications</strong>\n\n<ul>\n <li>7 years of audit, finance and/or risk-related analytics experience within the financial services industry</li> <li>CPA, MBA, CFA, and/or CIA certification</li> <li>Process mapping and data lineage documentation and related software (Visio, MS Project)</li> <li>Big 4 experience</li> <li>Knowledge of commercial and/or consumer lending portfolios</li> <li>Knowledge and understanding of credit risk</li> <li>Essbase and/or SmartView experience</li> \n</ul>\n\n<strong>Disclaimer</strong><br><br>All offers for employment with Wells Fargo are contingent upon the candidate having successfully completed a criminal background check. Wells Fargo will consider qualified candidates with criminal histories in a manner consistent with the requirements of applicable local, state and Federal law, including Section 19 of the Federal Deposit Insurance Act.\n<br><br>\nRelevant military experience is considered for veterans and transitioning service men and women.\n<br><br>\nWells Fargo is an Affirmative Action and Equal Opportunity Employer, Minority/Female/Disabled/Veteran/Gender Identity/Sexual Orientation."}