{"job title": "Credit Risk Analytics Consultant 3 - Data Quality", "company": "Wells Fargo", "city state": "– Irving, TX", "rating": "3.5", "job description": "<strong>Job Description</strong><br><br>At Wells Fargo, we want to satisfy our customers financial needs and help them succeed financially. Were looking for talented people who will put our customers at the center of everything we do. Join our diverse and inclusive team where youll feel valued and inspired to contribute your unique skills and experience.\n<br><br>\nHelp us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you.\n<br><br>\n<strong>Wells Fargos Chief Administrative Office</strong> (CAO) consists of enterprise functions that work together to promote and protect the Wells Fargo culture and brand, and support our team members. Groups within CAO work to protect our reputation, tell our story, bolster team member engagement, connect with our customers, and bring new and innovative solutions to life. CAO functions include Commitment to Customer, Corporate Responsibility &amp; Community Relations, Data Management &amp; Insights, Human Resources, Marketing, Stakeholder Relations, and the CAO Integration and Planning Office.\n<br><br>\nThe eONE initiative seeks to build a one number instrument data foundation that is complete, reliable and aligned to the general ledger. The initiative will also establish the authoritative data source for corporate finance and corporate risk management data for in-scope risk and regulatory reporting. eONE will create a federated, coordinated set of applications and databases to support Risk and Finance, which will allow for agile and accurate risk and regulatory reporting and analytics that complies with BCBS239, and internal data governance polices.\n<br><br>\nThis position will play a key role in the delivery of this eONE enterprise initiative. The successful candidate will perform complex analysis and research on risk data and systems, with an initial focus on credit risk data. They will work with risk and technology groups throughout the company to define information needs and translate those needs into detailed requirements for the eONE data repository. The technology environments include Oracle, Teradata, OFSAA FSDF, Hadoop, Exadata, OBIEE, Ab Initio, Collibra, and others.\n<br><br>\nThis position will be focusing primarily on Data Quality and Reporting. This team partners and works with several technology groups within Wells Fargo and Oracle to use the conformed source data from FSDF (Oracles conformed data model). The position will collaborate with operational data quality team members to provide feedback and direction to fine tune out of the box data quality engine rules to ensure business acceptance, value and accuracy. The position will also require the development of advanced data quality testing methodologies such as statistical approaches and trending that are not enabled within the Oracle engine rules. The use of OBIEE, Tableau, SAS and other tools will enable the approach to alternative Data Quality monitoring and also supporting the eONE business teams with ongoing testing, reporting and other essential analytical needs of the group.\n<br><br>\nKey Responsibilities Include:\n<ul>\n <li>Performing complex analysis to support understanding of systems of records, the OFSAA data model, load processes, etc.</li> <li>Partnering with multiple line of business teams and communicate release requirements, issues and testing results</li> <li>Strong attention to detail to ensure all communications are accurate, well-written and in the right voice for the intended audience</li> <li>Strong analytical capabilities both from the use of business experience but also practical tool integration to isolate underlying data quality issues hidden in big data environments</li> <li>Partnering with the different eONE groups, develop and proactively grow the data quality framework</li>\n</ul>\n\n<strong>Required Qualifications</strong>\n<ul>\n<li>7+ years of risk reporting experience, risk analytics experience, or a combination of both</li>\n</ul>\n<strong>Desired Qualifications</strong>\n<ul>\n<li>1+ year of Oracle Financial Services Analytical Applications (OFSAA) experience</li><li>Experience designing and developing learning for complex technology systems and processes including Agile development methodology environments</li><li>SQL experience</li><li>Strong organizational, multi-tasking, and prioritizing skills</li><li>Ability to work effectively in a virtual team environment</li><li>Ability to work and influence successfully within a matrix environment and build effective business partnerships with all levels of team members</li><li>Excellent verbal, written, and interpersonal communication skills</li><li>Strong analytical skills with high attention to detail and accuracy</li>\n</ul>\n<strong>Other Desired Qualifications</strong>\n\n<ul>\n <li>SAS experience in a Unix environment</li> <li>Tableau report development</li> <li>Previous experience with Wells Fargo data marts and provisioning platforms</li> <li>OFSAA IDQ Experience preferred</li>\n</ul>\n\n<strong>Street Address</strong><br><br><strong>MN-Minneapolis:</strong> 600 S 4th St - Minneapolis, MN\n<br>\n<strong>NC-Charlotte:</strong> 301 S Tryon St - Charlotte, NC\n<br>\n<strong>IA-Des Moines:</strong> 800 Walnut St - Des Moines, IA\n<br>\n<strong>CO-Colorado Springs:</strong> 2335 Briargate Parkway - Colorado Springs, CO\n<br>\n<strong>AZ-PHX-Northwest Phoenix:</strong> 11601 N Black Canyon Hwy - Phoenix, AZ\n<br>\n<strong>TX-Irving:</strong> 5000 Riverside Drive - Irving, TX<br><br><strong>Disclaimer</strong><br><br>All offers for employment with Wells Fargo are contingent upon the candidate having successfully completed a criminal background check. Wells Fargo will consider qualified candidates with criminal histories in a manner consistent with the requirements of applicable local, state and Federal law, including Section 19 of the Federal Deposit Insurance Act.\n<br><br>\nRelevant military experience is considered for veterans and transitioning service men and women.\n<br><br>\nWells Fargo is an Affirmative Action and Equal Opportunity Employer, Minority/Female/Disabled/Veteran/Gender Identity/Sexual Orientation."}