{"job title": "Data Engineer Intern", "company": "AgilOne", "city state": "– Sunnyvale, CA", "rating": "3.8", "job description": "<div>AgilOne looking for a Data Engineer Intern to join us as we design and build the cutting edge, enterprise-grade customer data platform that processes hundreds of millions of records from these customer sources daily, and processes through billions of records in a horizontally scalable platform using modern technologies like Kafka, Hadoop, Parquet, Impala, Hive and Spark.</div><br>\n<div><strong>Internship Description:</strong></div><br>\n<div>This is an opportunity for</div> <div>(a) a gap year internship of one year (no 6 months internships)</div><div>OR</div> <div>(b) an end-of-studies internship of one year followed by a potential job offer based on performance</div><br>\n<div>You would be joining AgilOne in our Engineering department starting summer 2018 in one of our offices in California (Sunnyvale/San Francisco).</div>Responsibilities:\n\n<ul>\n<li>Design, build, install, test and maintain a highly scalable data platform.</li><li>Ensure that said platform meets business requirements and industry practices.</li><li>Write queries/jobs/functions to feed and enhance the pipeline.</li><li>Develop efficient, testable and well-documented code.</li><li>Recommend ways to improve data reliability, efficiency and quality.</li><li>Integrate new technologies and software engineering tools into existing platform.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n<ul>\n<li>Bachelor's Degree in Engineering, Information Technology, Computer Science, Mathematics or similar technical/analytical degree</li><li>Proficient in SQL, data analysis/exploration</li><li> Intellectual curiosity, along with excellent problem-solving and quantitative skills, including the ability to disaggregate issues, identify root causes and recommend solutions</li><li>Self-motivated and good sense of ownership - comfortable working with limited direction</li>\n</ul>\n\n<strong>Nice to have:</strong>\n\n<ul>\n<li>Experience with distributed databases or SQL engine on Hadoop - (Hive, SparkSQL, Impala, etc)</li><li>Experience with Spark/Hadoop ecosystem</li><li>Experience in query performance optimization involving large datasets</li><li>Experience in Java, Scala or similar language* Data Visualization/Reporting - e.g. Tableau, Excel PivotTables</li><li>OLAP design and implementation and knowledge of MDX</li><li>NoSQL databases (HBase, MongoDB, CouchDB, Cassandra, etc)</li><li>Experience extending Hive (user-defined functions)</li><li>Experience in data governance (access, retention etc)</li><li> Experience with data workflow management tools (Oozie, Airflow etc)</li><li>Experience with streaming data pipelines (Kafka, Spark, Kinesis etc)</li>\n</ul>\n\n<div>AgilOne, the Customer Data Platform provides enterprise consumer marketers the power to integrate customer data across digital, physical, and mobile channels, deliver customer analytics with predictive insights and 360-degree profiles, and engage customers at every touch point in order to maximize lifetime value. Currently, the AgilOne solution supports more than 150 brands worldwide.</div><br>\n<div>We leverage the latest technologies in big data, machine learning and data quality management to deliver an enterprise-grade, scalable and high performance tool for customers such as Tumi, Lululemon, Lilly Pulitzer and Davids Tea. AgilOne is funded by the best in the Valley - Sequoia Capital, Tenaya, and Mayfield.</div><br>\n\n<div><strong>This position does not fit your skillset or your career plans?! Please check all our internship offers :</strong></div>\n\n<li>Data Scientist Intern</li>\n<li>Solutions Consultant Intern</li>\n<li>Java Engineer Intern</li>"}