{"job title": "Data Scientist III - (B3)", "company": "Applied Materials", "city state": "– United States-California-CA,Santa Clara", "rating": "3.8", "job description": "Requires in-depth knowledge and experience. Uses best practices and knowledge of internal or external business issues to improve products or services. Solves complex problems; takes a new perspective using existing solutions. Works independently, receives minimal guidance. Acts as a resource for colleagues with less experience.<br><br><strong>Key Responsibilities:</strong>\n\n<ul>\n<li>Works in project teams as subject matter expert to design and develop program methods to consolidate and analyze structured and unstructured, diverse 'big data' sources</li>\n<li>Performs ad-hoc statistical and data-mining analysis , using statistical tools like R, SAS and MATlab; input and design of data acquisition systems, data structure and database design.</li>\n<li>Interfaces with internal customers for requirements analysis and compiles data for scheduled or special reports and analysis</li>\n<li>Works in project teams to develop analytical models, algorithms and automated processes, applying SQL understanding and PHP or Python programming, to cleanse, integrate and evaluate large datasets.</li>\n<li>Supports the timely development of products for manufacturing and process information by applying sophisticated data analytics, understands the business data gathering processes of the business</li>\n</ul>\n<strong>Functional Knowledge</strong>\n\n<ul>\n<li>Demonstrates conceptual and practical expertise in own discipline and basic knowledge of related disciplines</li>\n</ul>\n<strong>Business Expertise</strong>\n\n<ul>\n<li>Has knowledge of best practices and how own area integrates with others; is aware of the competition and the factors that differentiate them in the market</li>\n</ul>\n<strong>Leadership</strong>\n\n<ul>\n<li>Acts as a resource for colleagues with less experience; may lead small projects with manageable risks and resource requirements</li>\n</ul>\n<strong>Problem Solving</strong>\n\n<ul>\n<li>Solves complex problems; takes a new perspective on existing solutions; exercises judgment based on the analysis of multiple sources of information</li>\n</ul>\n<strong>Impact</strong>\n\n<ul>\n<li>Impacts a range of customer, operational, project or service activities within own team and other related teams; works within broad guidelines and policies</li>\n</ul>\n<strong>Interpersonal Skills</strong>\n\n<ul>\n<li>Explains difficult or sensitive information; works to build consensus</li>\n</ul>\n<strong>Education</strong>\n\n<ul>\n\n<strong><br>\n<div>Bachelor's Degree</div>\n\n<strong><br>\n<div>4 - 7 Years of Experience</div>\n</strong></strong></ul><strong><strong>\nApplied Materials is committed to diversity in its workforce including Equal Employment Opportunity for Minorities, Females, Protected Veterans and Individuals with Disabilities.</strong></strong>"}