{"job title": "Scientist – Downstream PD", "company": "Brammer Bio", "city state": "– Alachua, FL", "rating": "3.1", "job description": "<strong>Job Description:</strong><br><br><strong>Position Description/Summary:</strong><br><br><em>Brammer Bio, LLC is a dynamic gene and cell therapy contract development and manufacturing organization that is looking for leaders to bring the highest quality processes, products and testing to our clients. Our staff members; are committed to making a difference in our organization, for our client partners and the patients we serve. We seek individuals with proven competencies and strong character to help lead our organization now and into the future.</em><br><br><em>The Scientist will provide biologics process development support to ensure that the Brammer Bio Downstream Process Development (DSPD) unit operates to provide clients with new purification methods and investigational materials for pre-clinical and clinical use. The incumbent will assist in the design and execution of experiments under the supervision of the technical project lead. This will involve researching and sourcing reagents, equipment, and materials; preparing columns; purifying viral vectors utilizing working knowledge in filtration technologies, column chromatography (SEC, affinity, HIC, AEX), ultracentrifugation and scale up principles. This position will also be expected to technically review data, prepare experiments/data for presentation, participate in laboratory investigations, interpret this data and work with the project lead to trouble-shoot technical problems. The incumbent will participate in the optimization of purification methods and the writing and troubleshooting of protocols. The incumbent is expected to prepare and modify documents (SOPs, Batch Records, Raw Material Specifications, etc), maintain a GLP culture, and assist in maintaining the process development laboratory. This position will also work closely with the Manufacturing, Quality Assurance/Control, Analytical Development and Tech Transfer units. This position assists in technology/process transfer to the GMP manufacturing unit.</em><br><br><strong>Essential Responsibilities:</strong><br><br><em>Technical transfer of processes and procedures from clients into Brammer BIo. Design and optimize experiments. Write and revise procedures and protocols (PDPRs, SOPs, production batch records, etc) for projects and equipment. Assist project leads in the development of new processes and procedures, and/or optimization of (make more time efficient, cost efficient, etc) existing purification processes and procedures.</em><br><br><em>Execute downstream processes per written protocols and/or production batch records, ensuring GLP compliance. Buffer formulation and preparation. Generate/analyze data and write reports when required, including deviation and/or investigational reports.</em><br><br><em>Ensure that the Downstream Process development laboratory operates efficiently. This may include reagent and raw materials sourcing and maintenance of inventory; experiment and equipment use scheduling, calibration and maintenance of downstream PD equipment including scheduled calibration. Cleaning and general upkeep of the lab areas.</em><br><br><strong>Benefits:</strong><br><br>Brammer Bio offers an attractive benefit package to all full time employees which includes; medical, dental, and vision coverage, company paid Disability and Life Insurance benefits, and a 401(k) Plan with a generous company match. All full time employees are also provided with paid time off, paid company holidays, share appreciation rights, and an incentive bonus plan.<br><br>Brammer Bio is an Equal Opportunity Employer and participates in eVerify.<br><br>Required Experience:<br><br><em>Required:</em><br><br><em>A bachelor’s degree or higher in an appropriate area of specialization</em><br><br><em>Outstanding planning, organization, multi-tasking and communication skills</em><br><br><em>Preferred:</em><br><br><em>One year of appropriate industry experience highly desired.</em><br><br><em>Hands-on experience and knowledge of separation processes including filtration and chromatography is highly desirable. Experience with purification process development of viral vectors highly desirable. Proven experience with technical writing, critical thinking/troubleshooting, and data compilation and interpretation.</em><br><br><em>Hands-on experience in operating AKTA chromatography purification, ultracentrifuges, TFF/UFDF skids, and filtration assemblies desired.</em><br><br><em>Working knowledge of modern laboratory procedures and large scale separation and purification techniques, as well as, experience in tangential flow filtration is required. An in-depth understanding of downstream processing is desirable</em><br><br><em>Familiarity with MAb, recombinant proteins, small molecules, viral vectors and knowledge of local, state and national regulations for working with BSL-1 and BSL-2 material.</em><br><br><em>Work experience in a cGLP environment is a plus.</em>\n<br>\nKeyword: Scientist Downstream PD\n<br>\nFrom: Brammer Bio"}