{"job title": "Associate Director Neuroscience Scientist", "company": "CyberCoders", "city state": "– Cambridge, MA", "rating": "3.9", "job description": "Associate Director Neuroscience Scientist <div>\nClinical-stage, public biotech company in north Cambridge impacting life-altering diseases through novel immunology therapeutics is hiring an Associate Director of Neuroscience / CNS to lead us into new CNS-related, neuroscientific and/or neurodegenerative disease therapeutics through research-driven strategy around target validation. This is a new, direct-hire position created due to company growth.</div>\n<br>\nWhat You Need for this Position<div>\n\n\n<ul>\n<li>Ph.D. in Neuroscience or closely related subject</li>\n<li>5+ years' overall academic or industry experience after completing a Ph.D.</li>\n<li>Proven experience leading neuro-related research projects, ideally in target validation for preclinical programs</li>\n<li>Expertise in establishing and executing in vitro and in vivo studies</li>\n<li>Expertise in cell biology, biochemical and/or cellular assay development, and/or establishment of primary and/or iPSC-derived neuronal cultures.</li></ul></div>\n\n\nWhat You Will Be Doing<div>\nWe have had great success in multiple therapeutic indications (hematology, autoimmune neuromuscular, renal, and more) through our complement system-focused programs, and we would like to expand into more neuroscientific and/or neurodegenerative diseases. That's where you come in!\n\n\n<ul>\n<li>Approx. 70% bench work (or bench-related work while our CROs implement the experiments)</li>\n<li>Create a research strategy to generate foundational data supporting target validation</li>\n<li>Design and help execute in vitro and in vivo studies</li>\n<li>Coordinate experiments and analysis with CROs as needed</li>\n<li>Present findings to executive-level staff</li>\n<li>Develop collaborative networks</li>\n<li>Lead one or more bench scientists as the company expands</li>\n</ul>\n\nReports to: Head of Discovery Biology</div>\n<br>\nTop Reasons to Work with Us<div>\n\n\n<ul>\n<li>5 diverse programs in our pipeline with 2 already in phase II!</li>\n<li>Research-focused management \"willing to use never before seen technology\"</li>\n<li>Patient-focused company valuing regulatory and quality compliance in order to best serve patients</li></ul></div>\n\n\nWhat's In It for You<div>\n\n\n<ul>\n<li>Paid parking in Cambridge</li>\n<li>Public transit assistance</li>\n<li>Relocation Assistance</li>\n<li>Competitive Salary</li>\n<li>Stock Options</li>\n<li>Great Benefits</li>\n<li>Generous PTO/Vacation</li>\n<li>Advancement Opportunities</li>\n<li>Paid Holidays</li>\n<li>Summer Schedule</li>\n<li>Company Luncheons</li>\n<li>Top-Rated Office Culture with Very Low Turnover</li></ul></div>\n\n\n<div>\nDon't miss out, please apply today!</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}