{"job title": "Associate Scientist Discovery Biology", "company": "CyberCoders", "city state": "– Cambridge, MA", "rating": "3.9", "job description": "Associate Scientist Discovery Biology <div>\nEmerging, clinical-stage, public biotech company in north Cambridge impacting life-altering diseases through novel immunology therapeutics is hiring an Associate Scientist or Research Associate who has 2 years' discovery biology experience working with proteins. This is a new, direct-hire position created due to company growth!</div>\n<br>\nWhat You Need for this Position<div>\nM.S. or Ph.D. in related discipline with 2+ years' experience with:\n\n\n<ul>\n<li>Biophysical assay and/or biochemical development for proteins and protein-ligand interactions</li></ul></div>\n\n\nWhat You Will Be Doing<div>\nReporting to the Associate Director, Discovery Biology, your primary responsibilities will revolve around designing and executing biochemical and biophysical assays. With\n<br>\n<strong>Additional duties:</strong>\n\n\n<ul>\n<li>Data analysis and documentation</li>\n<li>Present project results to scientific teams</li>\n<li>Coordinate with CRO as needed</li>\n<li>Support of target identification and hit/lead molecule characterization</li>\n</ul>\n\n<strong>Working with:</strong>\n<br>\nSDS/Native-PAGE, Western blot, Pull-down, ELISA, fluorescence, luminescence, and SPR-based formats</div>\n<br>\nTop Reasons to Work with Us<div>\n\n\n<ul>\n<li>5 diverse programs in our pipeline with 2 already in phase II!</li>\n<li>Research-focused management \"willing to use never before seen technology\"</li>\n<li>Patient-focused company valuing regulatory and quality compliance in order to best serve patients</li></ul></div>\n\n\nWhat's In It for You<div>\n\n\n<ul>\n<li>Paid parking in Cambridge</li>\n<li>Public transit assistance</li>\n<li>Relocation Assistance</li>\n<li>Competitive Salary</li>\n<li>Stock Options</li>\n<li>Great Benefits</li>\n<li>Generous PTO/Vacation</li>\n<li>Advancement Opportunities</li>\n<li>Paid Holidays</li>\n<li>Summer Schedule</li>\n<li>Company Luncheons</li>\n<li>Top-Rated Office Culture with Very Low Turnover</li></ul></div>\n\n\n<div>\nSo, if you are interested and qualified for this Associate Scientist Discovery Biology position, please apply today!</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}