{"job title": "Scientist / Senior Scientist, Immunology", "company": "eGenesis", "city state": "– ", "rating": "5.0", "job description": "<strong>POSITION SUMMARY</strong>\n<br><br>\neGenesis is seeking an innovative immunologist who has a high degree of creativity and independence, and is used to working in a fast-paced, dynamic environment. By focusing on the molecular, cellular and immune signaling aspects of next generation xenotransplantation you will develop novel solutions to tackle the worldwide organ shortage crisis. We anticipate that our cutting-edge research will continue to lead to publication of impactful papers.\n<br><br>\n<strong>RESPONSIBILITIES</strong>\n<br><br>\nThe successful candidate will be responsible for performing innovative translational research in immunology and xenotransplantation immunology. The qualified candidate will be a highly motivated, interactive, and creative individual that possesses substantial in vitro and in vivo experience in studying innate immunology, biology of T cells and/or myeloid cells, preferably in the xenotransplantation context. The position requires innovative and comprehensive ideas, and practical project design and execution to solve the immune rejection issue in xenotransplantion. The candidate should also be able to work independently and have excellent interpersonal communication skills.\n<br><br>\n<strong>QUALIFICATIONS</strong>\n<br><br>\nPh.D in Immunology or related discipline.\n<br>\nExperience: Scientist (4-7 yrs); Senior Scientist (7-10 yrs).\n<br>\nFamiliarity with human translational research in xenotransplantation immunology is preferred but not required.\n<br>\nRelevant Industry and/or post-doctoral experience is highly preferred.\n<br>\nThe successful candidate will have outstanding experimental design, troubleshooting, and data analysis skills.\n<br>\nA proven track record in the field of immunology, as evidenced by publication record.\n<br>\nExtensive experience with primary immune cells of rodent and/or human origin, immunological and functional assays, as well as a comprehensive knowledge of cellular immunology.\n<br>\nDemonstrated creativity and novel approaches to solving scientific problems.\n<br>\nExcellent oral and written communication skills.\n<br>\nExperience managing external collaborations desired.\n<br>\nIndustry experience desired.\n<br>\nCompensation: commensurate with role and experience.\n<br><br>\neGenesis is an Equal Opportunity Employer, and offers a comprehensive benefits package.\n<br><br>\nIf interested in learning more about this fantastic opportunity, please submit your CV for consideration."}