{"job title": "Senior Scientist / Scientist,", "company": "Fate Therapeutics, Inc.", "city state": "– San Diego, CA", "rating": "4.6", "job description": "<p>Fate Therapeutics is seeking an experienced and highly motivated cell and molecular biologist<br>with expertise in induced pluripotent stem cells (iPSC), genetic engineering and hematopoietic<br>cell differentiation to join a multidisciplinary team dedicated to the discovery of novel cellular<br>therapeutics for the treatment of cancer and immune disorders. The successful candidate will<br>be responsible for overseeing the generation of genetically engineered iPSC lines to support<br>internal programs and external collaborations. The candidate must have in depth knowledge<br>of iPSC derivation, characterization and differentiation in addition to extensive experience in<br>genetic engineering. The position will require individual, independent research as well as<br>coordination with internal groups and collaborators. This is a full-time position reporting to the<br>Associate Director, R&amp;D, and is located at our corporate headquarters in San Diego, CA.<br>Responsibilities<br>• Derive, characterize and genetically modify human induced pluripotent stem cells<br>• Develop, optimize and oversee a platform for iPSC generation and engineering to<br>support internal programs and collaborators<br>• Oversee, train and support junior staff<br>• Present data to project group and larger multidisciplinary teams<br>• Execute research timelines to meet program and corporate objectives<br>Qualifications<br>• PhD in cell biology or related field<br>• Minimally 5+ years of post-doctoral or research experience in academia or extensive<br>(minimum 3 years) research experience in biotech or pharma<br>• Extensive experience with iPSC derivation, characterization and differentiation<br>• In depth knowledge and practice with genetic engineering<br>• Demonstrated ability to work both independently and within a goal-oriented team<br>• Track record of collaborative work and mentoring of junior scientists<br>• Excellent communication (both written and oral), time management, record keeping<br>and data analysis skills<br>Working Conditions and physical requirements<br>• Will require working with cells and cell lines of human and/or animal origin<br>• Occasional weekend and/or evening hours required<br>• 100% on site work at corporate headquarters in San Diego, CA</p>"}