{"job title": "Division Director Clinical Data Scientist", "company": "HealthOne System Support", "city state": "– Denver, CO", "rating": "NA", "job description": "Leading hospitals. Trusted care.\n<br><br>\nHealthONE® is the largest healthcare system in the metro Denver area with more than 10,000 employees. As part of the HealthONE family, The Medical Center of Aurora, North Suburban Medical Center, Presbyterian/St. Luke's Medical Center, Rocky Mountain Hospital for Children, Rose Medical Center, Sky Ridge Medical Center, Swedish Medical Center, and Spalding Rehabilitation Hospital work together to provide a higher level of care.\n<br><br>\nIn addition, our family of services includes six hospital free-standing emergency departments and numerous ambulatory surgery centers, occupational medicine clinics, physician practices, imaging centers, and AIRLIFE-DENVER, which provides critical care air and ground transportation across a 10-state region.\n<br><br>\nAt HealthONE, you'll find that caring extends to both our patients and our people.\n<br><br>\nWe are committed to each other because when we join together, our patients are cared for in the safest and most compassionate way. Are you looking for an employer with many different career options and a people-focused culture? You've come to the right place.\n<br><br>\nGENERAL SUMMARY OF DUTIES: The Senior Director of Clinical Data Scientist is responsible for the development and implementation of Clinical Quality Programs, as well as the expansion of processes and performance related to Clinical Data Management (CDM) strategy. The Director will focus on utilizing data resources to improve the clinical and operating performance. The Director and Division Leadership team is focused on identifying such opportunities and working with the wider organization to operationalize them. The Senior Director will manage division clinical analytic projects to assure best use of facility resources and to avoid duplication of projects.\n<br><br>\nThe Senior Director will use mathematics, programming big data management and visualization to discover clinical opportunities and insights arising from HCA data systems. This role is firmly customer facing, with an expectation of constant contact, communication and iteration with both clinical and business customers to define questions, explore solutions and present results. As such the data scientist must be comfortable and capable of understanding and clearly communicating the nature and results of complex analytics within a clinical context to non-technical users in written, spoken and visual means.\n<br><br>\nThe Senior Director must have working knowledge of regression and classification techniques such as logistic regression, boosting, SVM and neural networks. Moreover, the Senior Director must understand the scientific process of hypothesis generation and testing within a healthcare setting, in particular data oriented discovery methodologies such as cross validation. Typically, these functions are performed in a mathematical environment, including but not limited to, R, MATLAB, SPSS, SQL or SAS, proficiency with which is assumed.\n<br><br>\nSUPERVISOR: Division Chief Medical Officer\n<br><br>\nSUPERVISES: Senior Data Scientists\n<br><br>\n<strong>DUTIES INCLUDE BUT ARE NOT LIMITED TO:</strong>\n\n\n<ul>\n<li>Development of data-driven clinical products to improve care provision through collaboration with providers across the spectrum of healthcare; from bedside to clinical leadership. This can be inclusive of, but not limited to, dashboards, scorecards, etc.</li>\n<li>Drive implementation and adoption of developed tools and new learning across the clinical spectrum.</li>\n<li>Support dissemination of developed clinical products and ideas using expected avenues; i.e. patent applications and/or scholarly publications.</li>\n<li>Ensure a standardized and consistent approach relating to CDM participation and implementation in all phases of the data science life cycle.</li>\n<li>Influence, persuade, or convince others to achieve meaningful discussions regarding data outputs and feedback on usage activities to improve CDM output.</li>\n<li>Extract data from primary sources as well as external sources. Considered expert in at least one HCA data architecture.</li>\n<li>Apply expert analytics and technical interpretation to provide highly creative solutions.</li>\n<li>Understanding of the operational and software aspects of data science.</li>\n<li>Develop deeper expertise in working with clinical, operational, and financial data.</li>\n<li>Participate in team code reviews and testing.</li>\n<li>Works on unique and complex problems.</li>\n<li>Consults across functional and departmental lines; particularly frontline clinical leaders and innovators.</li>\n<li>Lift other members of the team through mentoring and teaching.</li>\n<li>Generates collaboration between clinical and analytical teams. Knows appropriate partners and brings them into conversation and decision making.</li>\n<li>Anticipates likely adverse events and problems. Facilitates conversation and solution amongst peers and partners across enterprise.</li>\n<li>Quickly modifies behavior to deal effectively with changes in the work environment.</li>\n<li>Readily tries new approaches appropriate for new or changed situations.</li>\n<li>Actively seeks information about new work situations so they can share with peers and manager.</li>\n<li>Leads and deploys others in sourcing and creating information and reports.</li>\n<li>Escalate to and collaborate with Division clinical leadership on program issues and risks to identify solutions.</li>\n<li>Assists DCMO/DVPQ to assure efficient project management for division wide initiatives</li>\n<li>Assists DCMO/DVPQ in prioritization of analytics projects across the division</li>\n<li>Assists DCMO/DVPQ in assigning appropriate resources for project development</li>\n<li>Works closely with Division CMO and VP of Quality to assure projects are completed in a timely fashion</li>\n<li>Coordinated monthly meetings of clinical data analyst group to assure facility and division needs are met.</li>\n<li>Practice and adhere to the \"\"Code of Conduct\"\" philosophy and \"\"Mission and Value Statement.\"\"</li>\n<li>Other duties assigned as necessary, to support the Division Chief Medical Officer and clinical quality agenda.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n<br>\n<strong>EDUCATION</strong>\n\n\n<ul>\n<li>PhD or MD degree required.</li>\n</ul>\n\n<strong>EXPERIENCE</strong>\n\n\n<ul>\n<li>Minimum 5 years of relevant work experience required.</li>\n<li>3-5 years of previous management experience preferred.</li>\n<li>Experience with large healthcare data systems required.</li>\n</ul>\n\n<strong>KNOWLEDGE, SKILLS &amp; ABILITIES:</strong>\n\n\n<ul>\n<li>Understanding of the provision of healthcare on a large scale, including the creation of capture of clinical data.</li>\n<li>Technical expertise in the realms of statistics, machine learning, model fitting and optimization.</li>\n<li>Ability to identify the technical and statistical framework in which clinical problems can be phrased.</li>\n<li>Extensive experience in statistical modeling, machine learning, and deployment of statistical insights within a clinical setting.</li>\n<li>Understanding of performing statistics at a large scale.</li>\n<li>Experience teaching or mentoring.</li>\n<li>Ability to work with all levels of management, clinical and IT&amp;S staff.</li>\n<li>Ability to think strategically and act tactically.</li>\n<li>Ability to work independently and handle multiple priorities.</li>\n<li>Creates formal networks involving coordination among clinical and analytical groups. Serves as departmental spokesperson on specialized deliverables.</li>\n<li>Contributes to the development of the organization's goals and objectives.</li>\n<li>Works independently and as a team lead, receiving minimal guidance.</li>\n<li>Acts as a mentor and provides direction to colleagues with less experience; particularly amongst matrixed analytical staff.</li>\n<li>Possesses the ability to make decisions quickly, which may deviate from established policy due to special circumstances.</li>\n<li>Possesses interpersonal skills to work in a high profile and fast paced team.</li>\n<li>Technical aptitude to learn and adapt to new industry applications and tools.</li>\n<li>Some travel required.</li>\n<li>Typical work week hours can vary depending on workload and project deliverables.</li>\n</ul>\n\n<strong>Company Description:</strong>\n<br><br>\nAt its founding in 1968, Nashville-based HCA was one of the nation's first hospital companies. Today, we are the nation's leading provider of healthcare services, a company comprised of locally managed facilities that includes about 165 hospitals and 115 freestanding surgery centers in 20 states and England and employing approximately 204,000 people. Approximately four to five percent of all inpatient care delivered in the country today is provided by HCA facilities. Milton Johnson serves as Chairman and Chief Executive Officer of HCA."}