{"job title": "Associate Scientist", "company": "Hired by Matrix, Inc.", "city state": "– Del Mar, California", "rating": "4.5", "job description": "Job Summary\n<br>\nOur Client, a leading chemical company, is seeking an Associate Scientist for the Expression &amp; Technology Development group.\n<br>\nThe Associate Scientist will be working under the direction of Scientists and will be responsible for supporting projects related to gene cloning, gene modification, protein expression optimization, strain optimization and associated microbiological support for novel enzyme products.\n<br>\nThe successful candidate is expected to complete assigned tasks independently, with minimal supervision.\n<br>\nWork Schedule is Monday through Friday - Typical core hours such as 8:00 AM to 5:00 PM\n<br><br>\n<strong>Responsibilities</strong>\n<br>\nHigh throughput enzyme screening and enzyme activity characterization assays.\n<br>\nActivity and inhibition kinetics analysis, protein quantitation.\n<br>\nCoordinate technical activities with minimal supervision.\n<br>\nSummarize, analyze and interpret moderately complex analytical data.\n<br>\nAchieve successful completion of deliverables with efficiency and adherence to time constraints.\n<br><br>\n<strong>Qualifications</strong>\n<br>\nEducation/Experience\n<br>\nBS (preferred + 3 years relevant experience) or MS (preferred + 1 year relevant experience or Ph.D with no experience) in Chemical or Biological Engineering, Molecular Biology, Microbiology, Biochemistry, Cellular Biology or related field\n<br>\nMust have experience with aseptic technique and manipulation of microorganisms\n<br>\nMust have experience with PCR, protein gel electrophoresis and other standard molecular biology techniques\n<br>\nExperience with small scale (96-well, 24-well) protein expression, enzymatic assays and DNA/RNA manipulation including extraction/quantitation experience desired\n<br>\nExperience with protein expression and production in bacterial, yeast, or fungal systems is a plus\n<br>\nExperience with protein purification, liquid handling and starch based applications a plus.\n<br>\nExperience with enzyme liquid handling is a plus\n<br>\nExperience with biochemical and enzyme assays and analysis. Experience with HPLC, SDS-PAGE and analysis.\n<br><br>\n<strong>Skills</strong>\n<br>\nExcellent attention to detail, organization, communication and time management skills\n<br>\nMust be highly self-motivated and enjoy working in a team-oriented environment\n<br>\nAbility to work in a multidisciplinary and fast paced environment, both independently and in a team setting.\n<br><br>\nPlease submit your resume for consideration. Once submitted, feel free to contact Sanka at 646-856-8903 for additional information.\n<br><br>\nApprox. Duration: 6 months\n<br><br>\nAbout Hired By Matrix\n<br><br>\nHired by Matrix, Inc. founded in 1986, is a certified Woman-Owned Business Enterprise (WBE) dedicated to providing the highest quality of job opportunities to our candidates and staffing services to our clients. We are a full service staffing firm with experience recruiting and delivering for IT, Accounting &amp; Finance, Administrative &amp; Clerical, Clinical &amp; Scientific, and Marketing disciplines. Our long history in the staffing industry and dedication to excellence are the key differentiators that have fueled our success for over 30 years.\n<br><br>\nHired by Matrix offers our contract professionals competitive salaries, benefits after 60 days and a 401k option after one year.\n<br>\nEqual Opportunity Employer\n<br>\nWBENC Certified\n<br>\nWOSB Certified\n\n\n<ul>\n<li>CEO Sharon Olzerowicz serves on the WBENC Board and is a long-standing member of the Forum Governing Group.</li>\n</ul>\n\nWe work hard to match our candidates with the right career opportunities. Let us find you a #MatrixMatch so you can reach your career goals!\n<br><br>\nConnect with us on LinkedIn and see how we can impact your career!\n<br><br>\nHired by Matrix Career Center: https://www.hiredbymatrix.com/find-work/open-positions/"}