{"job title": "Lead Data Engineer", "company": "Horizontal Integration", "city state": "– Eden Prairie, Minnesota", "rating": "4.3", "job description": "<div>\n<div>\nDescription<br><br>The Senior Data Engineer role is focused on leading and developing data solutions for the business that answer critical strategic questions and enhance our trading partner reporting platforms. They partner with the Architect in setting standards and designing solutions and partner with the business to define solutions and KPIs for the business. The Senior Data Engineer is expected to mentor and help junior developers grow.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n\n\t<li>Build strong relationships with customers and internal partners</li>\n<li>Execute day-to-day transportation needs, including scheduling, tracking and tracing shipments, and communicating status updates with the broader team</li>\n<li>Identify issues, utilize resources to determine the best course of action, and implement solutions</li>\n<li>Partner with Account Managers to understand customer processes and identify areas for improvement</li>\n<li>Respond to customer inquiries and provide updates in a timely manner</li>\n<li>Maintain daily reporting schedule utilizing internal systems</li> \n\n<li>Generate and maintain up-to-date and accurate customer records and shipment documentation</li>\n</ul>\n<strong>Required</strong>\n\n<ul>\n\n\t<li>5 years of experience with SQL Server</li>\n<li>4 years of experience in the collection and organization of data.</li>\n<li>4 years of experience coding an ETL tool to load a data warehouse or create a data store.</li>\n<li>4 years of experience in performance tuning in a SQL environment.</li>\n<li>4 years of experience with Microsoft SSIS</li>\n<li>3 years of experience working with database objects</li>\n<li>3 years of experience with Analysis Services</li>\n<li>Experience in Dimensional, Entity-Relationship, Tabular models and OLAP data modeling.</li>\n<li>Proven track record in delivering in an agile environment, while managing multiple priorities</li> \n\n<li>Practical Experience with test driven development (TDD) and Continuous Integration/ContinuousDeployment (CI/CD)</li>\n<li>Skilled with GIT and GITHub or comparable distributed version control system</li>\n<li>Strong analytical and problem-solving skills</li>\n<li>Travel up to 10%</li>\n</ul>\n<strong>Education</strong>\n\n<ul>\n\n\t<li>Undergraduate degree in Computer Science, Information Systems or other related field or 4 years of equivalent work experience</li>\n</ul>\n#KRT\n<br><br>\n<em>Horizontal Integration is proud to be an Equal Opportunity and Affirmative Action Employer. We seek to provide employment opportunities to talented, qualified candidates regardless of race, color, sex/gender including gender identity and/or expression, national origin, religion, sexual orientation, disability, marital status, citizen status, veteran status, or any other protected classification under federal, state or local law.</em>\n<br><br>\n<em>\n<br>\nIn addition, Horizontal Integration will provide reasonable accommodations for qualified individuals with disabilities. If you need to request a reasonable accommodation in order to complete the application or interview process, please contact hr@horizontalintegration.com.</em>\n<br><br>\n<em>\n<br>\nAll applicants applying must be legally authorized to work in the country of employment.</em></div>\n</div>\n<br>"}