{"job title": "CIB-Quantitative Data Scientist - Engineer-VP", "company": "J.P. Morgan", "city state": "– New York, NY", "rating": "3.8", "job description": "<div><div><strong><br>\n<div>J.P. Morgan's Corporate &amp; Investment Bank is a global leader across banking, markets and investor services. The world's most important corporations, governments and institutions entrust us with their business in more than 100 countries. With $24trillion of assets under custody and $393 billion in deposits, the Corporate &amp; Investment Bank provides strategic advice, raises capital, manages risk and extends liquidity in markets around the world.</div><br>\n\n<div><strong>Overview:</strong></div><div>We have a great opportunity to join our Global Investment Banking Data Analytics in NY as a VP, with a focus on pricing and risk management models for Global Capital Markets.</div>\n<br>\n<div>The role will provide the successful applicant with the opportunity to shape the future of models and analytics for the #1 Global Investment Banking franchise (IBD, M&amp;A &amp; Corporate Finance).</div><br>\n\n<div><strong>The successful quant/engineer will partner closely with bankers to explore multiple scenarios:</strong></div>\n<ul>\n<li>Enhance Models/ Analytics in Banking</li>\n<li>Expand Quantitative Research platform into Banking</li>\n<li>Bespoke models working closely with senior business sponsors e.g. Corporate Finance Advisory, Mergers &amp; Acquisitions</li>\n<li>Advanced modelling (rethinking traditional workflows and existing methods)</li>\n</ul>\n\n<div><strong>This will be achieved by:</strong></div><div></div>\n\n\n<ul>\n<li>Working to build, investigate, test and develop models using traditional and alternative data sources</li>\n<li>Partnering closely with teams cross JP Morgans Quantitative Research on platform and analytics</li>\n<li>Engage with Banking on commercial opportunities and deliverables for JP Morgans clients</li>\n<li>Partnering with data science team as well as client-relationship management teams to drive analytics alerts advanced techniques appropriately</li> </ul></strong></div><strong>\n\n<br><strong><ul>\n<li>Master degree in a quantitative subject</li> \n\n<li>Strong communication skills</li>\n<li>5+ Experience in a Quantitative Research or Banking Quantitative role</li>\n<li>Very strong coding / code design</li> </ul></strong></strong></div><strong><strong>\n<br></strong></strong>"}