{"job title": "Research Scientist 3/4", "company": "Promega", "city state": "– US-WI-Madison", "rating": "4.2", "job description": "<div><div>\n<div>Promega seeks a Research Scientist to contribute to the development of new products for life sciences research and applied applications.\n<br><br>\nThe position requires working knowledge and experience with the techniques of cellular biology, molecular biology, and biochemistry. Experience in the use of molecular detection and amplification platforms and related techniques is a plus.\n<br><br>\nIdeal candidates will demonstrate an ability to design and implement experimental protocols and to analyze and interpret results. Candidates should have excellent communications skills and the ability to work within multidisciplinary team.\n<br><br>\n<strong>JOB OBJECTIVE:</strong> Principally involved with the execution and analysis of laboratory experiments. Designs, executes, analyzes and interprets experiments and may assume leadership to achieve project goals when appropriate.\n<br><br>\n<strong>ESSENTIAL DUTIES:</strong>\n\n\n<ul>\n<li>Work independently and with a team to create novel product concepts, experimental strategies and applications.\n<br><br>\n2. Analyze data, draw conclusions and take actions based on these conclusions.\n<br><br>\n3. Generate clear and concise technical documentation and contribute to internal and/or external literature.\n<br><br>\n4. Read and understand peer reviewed scientific literature.\n<br><br>\n5. Derive information from multiple sources to design plans.\n<br><br>\n6. Work with team to establish customer requirements and product specifications.\n<br><br>\n7. Work at the bench.\n<br><br>\n8. Understand and comply with ethical, legal and regulatory requirements applicable to our business.</li>\n</ul>\n\n<strong>MANDATORY QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>B.S. degree in scientific discipline or equivalent with 4+ years postgraduate lab experience.</li>\n</ul>\n\nOR\n<br><br>\n2. M.S. degree in scientific discipline or equivalent with 0+ years postgraduate lab experience.\n<br><br>\n3. Demonstrated competence in the design and execution of complex experimental strategies.\n<br><br>\n<strong>PHYSICAL REQUIREMENTS:</strong>\n\n\n<ul>\n<li>Ability to work at lab bench or fume hood for extended period of time.\n<br><br>\n2. Ability to wear protection gear (gloves, lab coat, safety glasses, etc.).\n<br><br>\n3. Ability to operate a computer.\n<br><br>\nDiversity is important at Promega. We are proud to be an Equal Opportunity Employer, and make employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran status, disability, or any other protected class.</li></ul></div>\n\n\n</div>\n</div>\n<br>"}