{"job title": "Senior Data Scientist", "company": "Social Sentinel", "city state": "– Burlington, VT", "rating": "NA", "job description": "We are looking for an experienced Data Scientist responsible for creating, maintaining, and deploying the advanced analytics and statistical models vital to the success of Social Sentinel’s proprietary products. The Senior Data Scientist will be an integral member of the Product Team, responsible for ingraining data-driven culture into the product process.\n<br><br>\nThe Data Science team is small; values open discussion and curiosity while encouraging people to challenge the status quo. Thus, a commitment to collaborative problem solving, product quality, and adaptability are essential.\n<br><br>\n<strong>Key Responsibilities:</strong>\n\n<ul>\n<li>Properly apply advanced statistical and predictive modeling techniques in order to improve the product offering continually</li>\n\n<li>Develop innovative approaches to extract insights and advance product intelligence</li>\n\n<li>Translate business requirements and use-cases into effective work plans</li>\n\n<li>Design, build and maintain efficient, reusable, and reliable statistical code</li>\n\n<li>Communicate results and insights, including prototyping visualizations for eventual use in product</li>\n\n<li>Process, cleanse, and verify the integrity of data used for analysis and modeling</li>\n\n<li>Identify which data are available and relevant, including internal and external data sources</li>\n\n<li>Proactively mine and analyze data to find meaningful signals</li>\n\n<li>Help define the data model and infrastructure to ensure the ease of downstream analysis</li>\n\n<li>Help define priorities for Data Science Interns</li>\n\n<li>Broaden analytical knowledge across the company using strong communication skills across a wide range of audiences</li>\n\n<li>Adapt to new technologies and situations</li>\n</ul>\n<strong>Skills:</strong>\n\n<ul>\n<li>Excellent understanding of a wide range of statistical models (classification, regression, and clustering)</li>\n\n<li>Experience creating and maintaining complex networks</li>\n\n<li>Experience with Natural Language Processing (NLP) desired</li>\n\n<li>Expertise in SQL-based query languages</li>\n\n<li>Proven ability to write clean, readable, and reproducible code</li>\n\n<li>Organization and version control (e.g., Github)</li>\n\n<li>Experience with infrastructure tools, including working closely with computer engineers</li>\n\n<li>Amazon Web Services experience preferred (EC2, S3, Athena, SageMaker)</li>\n</ul>\nWhat You Will Bring to the Team:\n\n<ul>\n<li>Advanced Degree (MS, Ph.D.) in Mathematics, Statistics or related field</li>\n\n<li>5+ years of Data Science experience</li>\n\n<li>Expert coding skills in the statistical language of your choice (e.g., R, Python, SAS)</li>\n\n<li>Excellent oral and written communication skills</li>\n\n<li>Ability to quickly learn new technologies</li>\n\n<li>Ability to communicate and collaborate cross-functionally, and work well with a team-oriented environment</li>\n\n<li>Strong work ethic and impeccable attention to detail</li>\n</ul>\nQualified individuals should apply by submitting a cover letter, resume, and 3 references.\n<br><br>\nSocial Sentinel, Inc. is an equal opportunity employer."}