{"job title": "Senior Data Scientist, Games Economy Optimization", "company": "Unity Technologies", "city state": "– San Francisco, CA", "rating": "3.8", "job description": "The Unity Monetization Team builds advertising and In-App Purchasing solutions and technologies used in hundreds of thousands of apps. Our Monetization team creates the technology infrastructure and systems that manages the delivery of relevant content to hundreds of millions of users every day, making tens of thousands of decisions every second. Our data systems process massive data sets to develop machine-learning models and analytics that maximize the effectiveness and profitability of unified in-app purchase and advertisement solution. We are continuously striving to build disruptive and powerful solutions to enable game developers to be more successful.\n<br><br>\nThat's where where we need you to partner with us to create the future. We are looking for an experienced data scientist to drive the development of personalized in-game monetization solutions for our developers. You need to be able to define how the next phase of in-app monetization will interface machine-learning-based decision making with the requirements of business and game developers. You need to be well-versed in state-of-the-art machine learning methods (e.g., reinforcement learning) and know what to use and when. You will work cross functionally with business development, game developers, engineers, product, and your colleagues on the data science team.\n<br><br>\nWe ask a lot, but we also offer a lot. You will collaborate on defining how game economies will work in the future. You will utilize your machine learning expertise in a setting that is cutting edge and ahead of the game. No more humans looking at numbers and going with their gut feeling. Your colleagues are those who do cool stuff and make magic happen.\n<br><br>\nThis position is based in San Francisco but involves traveling to conferences and our other monetization office in Helsinki, Finland.\n<br><br>\n<strong> Responsibilities</strong>\n\n<ul>\n<li>Influence key stakeholders across the organization and drive alignment on data science and machine learning initiatives</li>\n<li>Spearhead and drive the implementation of new solutions, architectures, data science and machine learning paradigms</li>\n<li>Lead, define and develop creative and new business opportunities and products while communicating findings and results with leadership and product teams</li>\n<li>Drive and implement various data and machine learning methodologies based on online decision making systems on a large scale</li>\n</ul>\n<strong>Qualifications</strong>\n\n<ul>\n<li>PhD or MSc Computer Science, Mathematics/Physics or equivalent with 5+ years experience designing and implementing Machine Learning models and algorithms</li>\n<li>Expertise in Python, Scala, Tensorflow/Caffe and Spark with experience in data structures, data distribution and storage.</li>\n<li>Knowledgeable about the machine learning trade-offs and model evaluation</li>\n<li>Exceptional grasp of virtual economy management with solid understanding of insights in the gaming especially F2P game economics</li>\n<li>Excellent communication and collaboration skills</li>\n</ul>\n<strong>Who We Are // About Unity</strong>\n<br><br>\nUnity is the creator of the world's most widely-used real-time 3D (RT3D) development platform, providing content creators around the world with the tools they need to build rich, interactive 2D, 3D, VR and AR experiences. In fact, apps made with Unity reach 2.7 billion devices worldwide, and were installed more than 24 billion times in the last 12 months.\n<br><br>\nThe global engineering team keeps Unity at the forefront of technology and working alongside partners like Magic Leap, Google, Facebook, Oculus and Microsoft ensures optimized support for the latest technology and platforms. Unity is powering the real-time revolution, expanding beyond games and breaking into other industries including automotive, film, architecture, engineering, construction and more.\n<br><br>\n<em>Unity is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. Therefore, we provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, or any other protected status in accordance with applicable law. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know.</em>\n<br><br>\n<em>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</em>\n<br><br>\n<em>Headhunters and recruitment agencies may not submit resumes/CVs through this Web site or directly to managers. Unity does not accept unsolicited headhunter and agency resumes. Unity will not pay fees to any third-party agency or company that does not have a signed agreement with Unity.</em>\n<br><br>\n<em> #LI-MH1</em>"}