{"job title": "Data Scientist - Pricing &amp; Revenue Management", "company": "Waste Management", "city state": "– Texas, USA", "rating": "3.3", "job description": "Equal Opportunity Employer: Minority/Female/Disability/Veteran\n<br><br>\nWaste Management (WM), a Fortune 250 company, is the leading provider of comprehensive waste and environmental services in North America. We are strongly committed to a foundation of operating excellence, professionalism and financial strength. WM serves nearly 25 million customers in residential, commercial, industrial and municipal markets throughout North America through a network of collection operations, transfer stations, landfills, recycling facilities and waste-based energy production projects.\n<br><br>\nTo enable our business to expand our lead in a market increasingly enhanced by technology, Waste Management is undertaking a substantial technology transformation. We are seeking talented Information Technology professionals to join the Waste Management team who are motivated to help us transform the way we design, build and use technology. With your skills and experience, we look for you to combine your technical expertise with industry best practices in an effort to align information technology solutions with Waste Management business strategy.\n<br><br>\nI. Job Summary Performs advanced data analysis, utilizes data mining techniques and designs and produces complex statistical models to address a variety of business opportunities for the Revenue Management Department. Develops complicated algorithms and uses advanced analytic tool to develop and evaluate a broad spectrum of analytics for large data sets. Works as part of the leadership team to identify and analyze business problems and document, implement, and present the technical information to various internal customers.\n<br><br>\nII. Duties and Responsibilities include the following. To perform this job successfully, an individual must be able to perform each duty satisfactorily. Other ancillary duties may be assigned.\n\n<ul>\n <li>Develops advanced statistical and econometric models to predict, quantify or forecast various operational and performance metrics.</li> <li>Performs high level data analysis; develops complex algorithms and computational solutions as necessary to support pricing execution and customer modeling.</li> <li>Provides technical expertise and guidance to less experienced employees when developing and implementing model results in Waste Management's ongoing business processes.</li> <li>Ensures data quality and reliability and provides feedback to business process owners, leadership, and to the Revenue Management department.</li> <li>Serves as project owner driving development of clear specifications, data acquisition and analysis, as well as assuming accountability for the deployment of analytic solutions.</li> <li>Observes current systems/processes and interacts with the appropriate personnel. Utilizing a variety of sources, collects and analyzes information to support the modeling and analysis.</li> <li>Collaborates with and as part of leadership to identify, define, and solve a variety of problems and support various Revenue Management initiatives. Present and communicates information to all levels of the organization (including technical and non-technical audiences, Senior Leadership and Executive Leadership).</li> <li>Prepares management reports defining the problem; documenting the analysis and recommending courses of action in order to determine the best outcomes.</li> <li>Actively researches analytic methodologies form varying sources (refereed journals, technical publications, white papers, etc.) to guide development and delivery of analytical solutions.</li>\n</ul>\n\n<strong> III. Supervisory Responsibilities</strong> \n<br>\nMay coach and mentor less-experienced personnel and act as team leader on systems projects, possibly requiring up to 40% of time spend performing duties and responsibilities.\n<br><br>\n<strong>IV. Qualifications</strong>\n<br>\nThe requirements listed below are representative of the qualifications necessary to perform the job.\n<br><br>\nA. Education and Experience\n<br>\nRequired: Master's Degree in Economics, Applied Mathematics, Statistics, Industrial Engineering, or similar area of study. At least five years of related analytic work experience applying several data mining methods, developing algorithms, statistical analysis, and developing predictive models related to pricing and/or customer behavior.\n<br><br>\nB. Certificates, Licenses, Registrations or Other Requirements\n<br><br>\nNone required.\n<br><br>\nC. Other Knowledge, Skills or Abilities Required\n<br><br>\nAdvanced knowledge and skills in one or more of the following is required:\n\n<ul>\n <li> Knowledge and understanding in how to identify root causes of problems, create effective practical solution approaches, and implement solutions under the tactical demands of business operations.</li>  <li> Demonstrated experience leading an integrated solutions development team to provide value to systems engineering and development for specific decision support application.</li>\n<li> Applied experience working with large-scale data sets in an advanced data mining analytic role.</li>\n<li> Practical knowledge and demonstrated experience of statistical models and methods.</li>\n<li> Knowledge of large relational databases, and SQL programming.</li>\n<li> Knowledge and working experience in statistical software: Stata, R, SAS (SAS preferred)</li>\n<li> Knowledge and working experience in mathematical optimization software (preferably Gurobi, or ILOG/CPLEX)</li>\n<li> Familiarity with computer simulation techniques (Monte Carlo, discrete event and continuous modeling)</li>\n<li> Programming experience (preferably in Visual Basic and Python)</li>\n<li> Problem solving and analytical skills.</li>\n<li> Excellent verbal and written communication skills (necessary to communicate and articulate complex information to all levels of the organization including technical and non-technical audiences).</li>\n<li> Committed and highly motivated team player.</li>\n<li> Ability to demonstrate a customer service and customer focused mindset</li>\n</ul>\n\nD. Other Knowledge, Skills or Abilities that Contribute to Success\n<br><br>\nNone required.\n<br><br>\n<strong> V. Work Environment and Essential Functions</strong> \n<br>\n<br>\nListed below are key points regarding environmental demands and work environment of the job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions of the job. [Note: the following is defaulted for office setting position]\n\n<ul>\n <li>Required to use motor coordination with finger dexterity (such as keyboarding, machine operation, etc) most of the work day ;</li> <li>Required to exert physical effort in handling objects less than 30 pounds rarely ;</li> <li>Required to be exposed to physical occupational risks (such as cuts, burns, exposure to toxic chemicals, etc) rarely ;</li> <li>Required to be exposed to physical environment which involves dirt, odors, noise, weather extremes or similar elements rarely ;</li> <li>Normal setting for this job is: office setting.</li> </ul>\n\n\n<ul>\n<li>MSJA*</li>\n</ul>"}