{"job title": "Senior Data Engineer", "company": "CyberCoders", "city state": "– Malvern, PA", "rating": "3.8", "job description": "Senior Data Engineer <div>\nIf you are a Senior Data Engineer with Machine Learning and AI experience, please read on!</div>\n<br>\nTop Reasons to Work with Us<div>\nIf you enjoy providing expert level IT technical lead services, including the direction, evaluation, selection, configuration, implementation, and integration of new and existing technologies and tools while working closely with IT team members, data scientists, and data engineers to build AI and Data products.</div>\n<br>\nWhat You Will Be Doing<div>\n\n\n<ul>\n<li>Data engineering and exciting stuff with big data</li>\n<li>Showing off your Linux and shell scripting expertise</li>\n<li>SQL and NoSQL databases</li>\n<li>Working with scalable data extraction tools (e.g. Cassandra, MongoDB)</li>\n<li>Working with Scala, Spark, Java and/or SAS</li>\n<li>Use AI/ML platforms, technologies, techniques (e.g. TensorFlow, Apache MXnet, Theano, Keras, CNTK, scikit-learn, H2O, Spark MLlib, etc).</li>\n<li>Developing, testing and deploying APIs</li>\n<li>Building applications based on Microservices Architecture</li>\n<li>AWS</li>\n<li>Familiar with techniques such as continuous delivery and continuous integration</li>\n<li>Deploying and managing infrastructures based on Docker, Kubernetes, or OpenStack, and public Clouds such as Azure, AWS or Google Cloud Platform.</li></ul></div>\n\n\nWhat You Need for this Position<div>\n\n\n<ul>\n<li>5+ years in designing, developing, integrating and running business, big data and/or data science applications</li>\n<li>5+ years of software engineering processes and software development life cycles</li>\n<li>Background in Big Data, Distributed Computing, Analytics</li>\n<li>Must be proficient with Python and/or R.</li>\n<li>Experience with design patterns and implementation and deployment AI and/or data science products.</li>\n<li>Experience using Agile/Scrum methodologies</li>\n<li>Expert level of experience building, deploying and scaling applications in AWS</li>\n<li>Strong problem solving skills and capability to understand and set direction for complex technology integration</li>\n<li>Understanding and focus on business outcomes</li>\n<li>Strong teamwork skills</li>\n<li>Proficient with Atlassian and AWS</li>\n<li>Passionate about the application of Data Science to solve problems</li>\n<li>Proficient in full stack development</li>\n<li>Resourceful, able to drive towards results in a start-up style environment</li>\n<li>Is enthusiastic about sharing knowledge and collaborating with other teams</li>\n<li>An enthusiastic self-starter and team player</li>\n<li>An excellent analytical and problem-solver</li></ul></div>\n\n\nWhat's In It for You<div>\n\n\n<ul>\n<li>Top Compensation Package</li>\n<li>Strong 401(K)</li>\n<li>Elite Medical/Dental/Vision/Life Coverage</li>\n<li>Work with the brightest!</li></ul></div>\n\n\n<div>\nSo, if you are a Senior Data Engineer with Machine Learning and AI experience, please apply today!</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}