{"job title": "Business Intelligence Data Analyst", "company": "Fisher Investments", "city state": "– Vancouver, WA", "rating": "3.5", "job description": "Job Description<br><br><strong>Overview</strong>\n<br><br>\n<strong>The Opportunity:</strong>\n<br><br>\nThe 401k Solutions Team (4S) is a seeking a Business Intelligence Data Analyst to support their analysis needs and the use of the group’s business intelligence tool. This includes the creation of new graphs (“cards”) and card collections, system administration, creation of new data flows and data sets to support our growing business needs, guidance, support, and certifications on internally built cards, and the evaluation of system enhancements and new data sources. Your day will vary depending on team priorities and projects, but will generally be a mix of longer-term projects, research efforts, and ongoing daily responsibilities tied to the work of the team.\n<br><br>\n<strong>The Day-to-Day:</strong>\n<ul>\n<li>Oversee the creation, calculation, and internal certification of cards related to key performance indicators</li><li>Turn business ideas, and questions into sound and repeatable analysis to understand team operations and support the future growth of the business</li><li>Provide internal Domo analytics, and calculation logic assistance</li><li>Card building and card certifications</li><li>Analyze built cards and help articulate the meaning to 4S management</li><li>Assist in the data architecture, the creation of flows, and the evaluation of new functionality to support the enterprise use of Domo</li><li>Help in defining tech business requirements related to Domo</li><li>Oversee 3rd party analytics vendors, including review of built cards and card methodology</li>\n</ul>\n<strong>Qualifications:</strong>\n<ul>\n<li>Bachelor’s degree from a four-year college or university or equivalent combination of education/experience</li><li>Minimum of five years of professional work experience, with at least three years in a data analytics capacity</li><li>Experience working with business intelligence tools (Domo is preferred, but others acceptable as well)</li> <li>Strong quantitative, data analysis, and analytical thinking skills is required</li><li>Good communicator and comfortable working with senior leadership within the group</li><li>Demonstrated excellence at presenting complex development topics to both executive and technical personnel</li><li>Ability to work independently and manage multiple task assignments</li><li>Strong knowledge and application of data literacy</li><li>Strong problem solving and troubleshooting skills with the ability to exercise mature judgment.</li><li>Experience in recognizing business problems and recommending/developing solutions</li>\n</ul>\n<strong>Why Fisher Investments:</strong>\n<br><br>\nFisher Investments is a different kind of investment firm. We don’t come from Wall Street, nor do we believe we fit in with most of the finance industry, and we’re proud of that. We work for a bigger purpose: bettering the investment universe. From unmatched service to innovative perspectives on investing, it’s the people that make the Fisher purpose possible. After all, it’s our people that enable us to offer the level of service that we do. And we invest in them accordingly, offering exceptional benefits like:\n<ul>\n<li>100% coverage of premiums for health, vision and dental insurance</li><li>A 50% 401(k) match, up to the IRS maximum</li><li>20 days of PTO*, plus 9 paid holidays</li><li>And much, much more</li>\n</ul>\nWe also provide a cumulative, continuous learning and development framework customized for every employee. This emphasis on personal and professional growth has yielded an award-winning work environment; we’re Great Place to Work Certified, and The Oregonian named us as a 2017 Top Workplace with the best benefits!\n<br><br>\nBut in the end, it’s not the perks that keep people here. They stay because they believe in our mission of service—our employees want to make a difference in an industry that can do better.\n<br><br>\n* California employees accrue up to 17 days of PTO and 3 days of sick time per year.\n<br><br>\nFISHER INVESTMENTS IS AN EQUAL OPPORTUNITY EMPLOYER"}