{"job title": "Data Science Program Manager", "company": "Fisher Investments", "city state": "– San Mateo, CA", "rating": "3.5", "job description": "Job Description<br><br><strong>Overview</strong>\n<br><br>\nAre you highly analytical and look to drive data based decision making? Do you enjoy using statistics and building predictive models to solve business problems? If so, apply today to be a part of the Data Analytics Team as a Data Science Program Manager.\n<br><br>\nYour work will include providing quantitative analysis and statistical methods to understand business drivers, improve business processes, and lead new data driven tests and initiatives within Fisher Investments.\n<br><br>\n<strong>The Day-to-Day:</strong>\n<ul>\n<li>Focus on deep dives into data to find problems or trends, reduce unnecessary cost and/or increase ROI, and drive better business decisions</li><li>Manage the deployment of data driven tests and initiatives within the organization</li><li>Use rigorous statistical methods to create test designs and build out data infrastructure to monitor test and initiative success</li><li>Present findings and recommendations to senior managers and executives with quantitatively driven analysis</li><li>Research and develop predictive models, statistical analyses and optimization algorithms, to drive business results and understand business drivers</li><li>Develop proof of concept solutions, and work with application developers to implement and maintain scalable products</li><li>Consult with different business leaders and teams on spreading best analytical practices</li><li>Mentor group members on practical applications of statistics and probability</li>\n</ul>\n<br><br>\n<strong>Your Qualifications:</strong>\n<ul>\n<li>4+ years of experience in analytics: data stores, data architecture, and related analytical tools</li><li>Developed and deployed several high impact analytical projects</li><li>Experience presenting to and liaising with executive stakeholders</li><li>Experience with machine learning techniques, experimental design, and large data sets</li><li>Demonstrable proficiency in the following software packages: MS Excel, MS SQL Server, R</li><li>A Bachelor's degree in Mathematics, Statistics, Economics, Computer Science, Engineering, or Physics</li><li>Master’s degree is a plus</li>\n</ul>\n<strong>Why Fisher Investments?</strong>\n<br><br>\nFisher Investments is a different kind of investment firm. We don't come from Wall Street, nor do we believe we fit in with most of the finance industry, and we're proud of that. We work for a bigger purpose: bettering the investment universe. From unmatched service to innovative perspectives on investing, it's the people that make the Fisher purpose possible. After all, it's our people that enable us to offer the level of service that we do. And we invest in them accordingly, offering exceptional benefits like:\n<ul>\n<li>100% coverage of premiums for health, vision and dental insurance</li><li>A 50% 401(k) match, up to the IRS maximum</li><li>20 days of PTO*, plus 9 paid holidays</li><li>And much, much more</li>\n</ul>\nWe also provide a cumulative, continuous learning and development framework customized for every employee. This emphasis on personal and professional growth has yielded an award-winning work environment; we're Great Place to Work Certified, and The Oregonian named us as a 2017 Top Workplace with the best benefits!\n<br><br>\nBut in the end, it's not the perks that keep people here. They stay because they believe in our mission of service--our employees want to make a difference in an industry that can do better.\n<br><br>\n*California employees accrue up to 17 days of PTO and 3 days of sick time per year.\n<br><br>\nFISHER INVESTMENTS IS AN EQUAL OPPORTUNITY EMPLOYER\n<br><br>\n#LI-FI1"}