{"job title": "Data Scientist, Engineering Support Analytics, Google Cloud", "company": "Google", "city state": "– Sunnyvale, CA, United States", "rating": "4.4", "job description": "<div><div>The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.\n<br><br>\nAs an Engineering Support Analytics Data Scientist, you will work on a variety of exciting projects in a fast growing organization with a lot of opportunities to handle complex problems that will require you to come up with creative solutions and models. You will be working on bringing together different data sets from across Google Cloud Platform and model data to unlock actionable insights and help stakeholders formulate and answer various business questions. You will collaborate closely with stakeholders from technical solutions engineering, product programs, vendor operations, support operations and support experience teams.\n<br><br>\nGoogle Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</div><div><div> Responsibilities  <div>\n\n<ul>\n <li>Create, design and maintain reusable datasets with appropriate architecture to deal with high level of data input complexity.</li> <li>Provide analytical decision making support for key projects. Proactively research new ways of modeling data to unlock actionable insights or improve processes.</li> <li>Employ predictive analytics and/or machine learning to facilitate forecasting for a fast growing, global, 24/7 support operation.</li> <li>Partner with non-technical stakeholders to understand their analytical needs, help frame the problem by asking the right questions, document and prioritize requirements. Clearly communicate results of complex technical work.</li> <li>Contribute to the development of the analytical frameworks, tools, skills and culture for the team and the wider organization.</li></ul> </div>\n<br>\n<div> Qualifications  <div>Minimum qualifications:\n\n<ul>\n <li>3 years of experience as an analyst or in an analytical role.</li> <li>Experience designing data models and building data structures (e.g. PRDs on collecting data, cross functional work with engineers).</li> <li>Experience working with SQL and multiple datasets.</li> <li>Experience with statistical data analysis (a/b tests, hypothesis testing, experiment setting, etc).</li>\n</ul>\n\n<strong>Preferred qualifications:</strong>\n\n<ul>\n <li>MBA/MS/MA/PhD degree with a quantitative focus (Economics, Computer Science, Mathematics, Physics, Engineering, Statistics, or Accounting).</li> <li>Experience with advanced analytical modeling and statistical forecasting techniques.</li> <li>Ability to communicate complex findings in a structured and clear manner to a non-technical audience.</li> <li>Excellent written and verbal communication skills.</li></ul> </div>\n</div></div></div><div><div>At Google, we don’t just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a disability or special need that requires accommodation, please let us know.</div></div><div><div><strong>To all recruitment agencies:</strong> Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees or any other company location. Google is not responsible for any fees related to unsolicited resumes.</div></div></div>"}