{"job title": "Data Scientist Intern (PhD Students) - Summer", "company": "Lubrizol", "city state": "– Wickliffe, OH", "rating": "3.5", "job description": "<ul>\n<li>*Data Scientist Intern (PhD Students) - Summer 2019**</li>\n</ul>\n\nLubrizol Additives is a pioneering global supplier of chemical additives technologies including additives for engine oils, driveline applications, gasoline and diesel fuel, other transportation related fluids and industrial lubricants. We are committed to providing value to our customers, and we understand that success comes from working together. The Lubrizol Additives team is passionate about what we do. Our customers count on us for trusted expertise, testing confidence, supply assurance and independent strength. We are looking for top talent to help inspire new ideas, create opportunities and enable the advancement of innovative technologies. We offer abundant opportunities for career growth in a challenging, collaborative environment. Learn more about how we are achieving Success Together\n\n\n<ul>\n<li>*Data Scientist Intern (PhD Students)**</li>\n<li>*Who are we?**</li>\n</ul>\n\nLubrizol, a Berkshire Hathaway company, is a technology-driven global company that combines complex specialty chemicals to optimize the quality, performance and value of customers? products while reducing their environmental impact. Lubrizol produces and supplies technologies to customers in the global transportation, industrial and consumer markets. Lubrizol?s products and technologies are in things you use every day - quite likely on surfaces and in fluids in the vehicles you drive, in the shampoos and soaps you use, in a medicine you take, in the clothes you wear and in electronic devices and plumbing systems in your home.\n\n\n<ul>\n<li>*The Statistics &amp; Data Analytics Team**</li>\n</ul>\n\nOperating like a start-up company, but with the backing of a large corporation, the Statistics &amp; Data Analytics team is charged with creating systems that enable highly effective product development via virtual experimentation, optimization and knowledge discovery. In addition, the team provides data science consulting services to the Lubrizol technical community throughout the world. The project work depends on the skills/interests of the intern and the current needs of the department.\n\n\n<ul>\n<li>*Some past projects:**</li>\n</ul>\n\n+ Application of coregionalized Gaussian processes for transfer learning\n<br><br>\n+ Development of an optimization approach utilizing genetic algorithms\n<br><br>\n+ Evaluation of the effectiveness of various machine learning algorithms when applied to Lubrizol problems\n<br><br>\n+ Mining complex data for critical formulating or testing insights\n<br><br>\n+ Assisting members of the department with data science and statistical consulting tasks\n\n\n<ul>\n<li>*What tools do you need for success?**</li>\n</ul>\n\n+ Enrolled in PhD program such as statistics, data analytics, machine learning\n<br><br>\n+ Good statistical and programming skills with the ability to work effectively with complex data\n<br><br>\n+ Interest and experience in advanced statistical modeling/machine learning methods\n<br><br>\n+ Curiosity and creativity\n<br><br>\n+ Ability to interact effectively with a wide variety of people including scientists and engineers\n<br><br>\nThis summer internship is located in Wickliffe, Ohio, a suburb of Cleveland. Housing assistance is available for out of town candidates.\n<br><br>\nWith multiple facilities in and around Cleveland, Ohio at http://www.thisiscleveland.com/ , Lubrizol is located in one of the largest economic regions in the United States. For the last seven years Lubrizol has been named one of the top workplaces in Northeast Ohio, and in 2016 was judged as the number one workplace by Northeast Ohio?s annual Top Workplaces survey at http://www.cleveland.com/business/index.ssf/2016/06/lubrizol_top_large_company_win.html#incart . Buzzing with business, culture, knowledge and entertainment, Northeast Ohio at http://www.globalcleveland.org/ is a vibrant place for people of all ages and walks of life to live, learn, work and play. This region offers a little bit of everything for everyone - ethnically-diverse communities, affordable housing, award-winning schools and universities, world-class healthcare, indoor waterparks and zoos, ski resorts, museums, halls of fame, one of the longest water-fronts in the country, and the most concentrated square mile of art, cultural, education and health institutions in the nation. From making your heart race at Cedar Point, to attending a professional sporting event or biking or hiking through over the 100,000 acres of state parks, to catching a Broadway show at Playhouse Square - the second largest performing arts center in the country, you can make it happen right here in Cleveland, Ohio .\n<br><br>\n_Lubrizol is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status._\n\n\n<ul>\n<li>*Nearest Major Market:** Cleveland</li>\n<li>*Nearest Secondary Market:** Akron</li>\n<li>*Job Segment:** Chemistry, Database, Genetics, Scientific, Intern, Science, Technology, Engineering, Entry Level</li>\n</ul>"}