{"job title": "Senior Research Scientist", "company": "ObjectVideo Labs", "city state": "– Tysons, VA", "rating": "5.0", "job description": "<div>\n<div>\n<div>\nTysons, VA</div>\n </div>\n\n<br><div>\n<div>\nSenior Research Scientist</div>\n </div>\n\n<br><div>\n<div>\nContribute to exciting and high visibility projects that will push the state-of-the-art in image/video understanding, computer vision, machine learning, deep learning, and data mining and reasoning. This will involve generation and evaluation of novel ideas, presentation of these ideas to peers and customers, and participation in engineering these ideas for real-world systems. The successful candidate will also have ample opportunities to lead projects based on their generated ideas. Our research group offers a dynamic, fun, and intellectually stimulating environment for cutting-edge research.\n<br><br>\nAreas of interest include but are not limited to: context-sensitive scene analysis; geometric scene modeling, sensor modeling and calibration; 3D scene reconstruction; moving target detection and tracking; object classification/recognition/identification; event detection and classification; image/video retrieval and mining; and image/video geolocalization. Candidate should be conversant with the latest development in deep learning frameworks for scene understanding and object and action identification. The ideal candidate possesses an impressive educational background in related fields with a strong publication record, and can demonstrate both the breadth and the depth of knowledge that is required to solve challenging problems in real-world scenarios.</div>\n</div>\n\n<br><div>\n<div>\nCandidate Profile</div>\n </div>\n\n<br><div>\n<div>\n<div>\nPhD in Computer Engineering, Computer Science, Computer Vision, Robotics, related field or equivalent experience.</div>\n</div>\n </div>\n<br>\n<div>\n<div>\n<div>\nSolid research background and experience in computer vision, machine learning, and image/video analysis algorithms.</div>\n</div>\n </div>\n<br>\n<div>\n<div>\n<div>\n6+ years work experience in a relevant field.</div>\n</div>\n </div>\n<br>\n<div>\n<div>\n<div>\nExcellent written and oral communication skills also required.</div>\n</div>\n </div>\n<br>\n<div>\n<div>\nObjectVideo Labs offers competitive pay and a generous benefits package including health and welfare benefits, 401(k) with employer match, paid holidays, paid time off, and paid maternity/paternity leave. We offer a casual work environment, gym subsidy, education assistance program, and in-suite bike racks and showers.\n<br><br>\nObjectVideo Labs is an equal employment opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, status as a protected veteran, or any other status protected by law.\n<br><br>\nEEO is the Law.\n<br><br>\nApplicants to and employees of this company are protected under Federal law from discrimination. Follow the link above to find out more.</div>\n</div>\n\n<br><div>\n<div>\nEmail resume and cover letter to careers@objectvideo.com.</div>\n</div>\n\t</div>"}