{"job title": "Principal Scientist, Immunology", "company": "Oncorus", "city state": "– Cambridge, MA", "rating": "5.0", "job description": "<strong>Company Overview</strong>\n<br><br>\nOncorus is a pre-clinical stage biotechnology company developing innovative and impactful, next-generation oncolytic virus products with unprecedented potential to recruit all arms of immune system to treat solid tumors. The Oncorus family is dedicated to bringing hope and impactful therapies to cancer patients everywhere. As part of our commitment, we have taken a pledge to donate a portion of product sales to fund promising cancer research and to support cancer care in the developing world. We are located in Kendall Square, Cambridge, MA.\n<br><br>\n<strong>Job Summary</strong>\n<br><br>\nWe are seeking a highly motivated and experienced immunologist to lead immunology efforts within our Pharmacology-Toxicology group. The successful candidate will serve as a group leader and point of accountability for in vitro and ex vivo immune assay development and implementation and MOA studies to progress Oncorus novel oncolytic virus therapies. They will thus play a vital role in progressing Oncorus programs towards IND filing and beyond.\n<br><br>\n<strong>Responsibilities and Duties</strong>\n\n<ul>\n<li>Contribute both intellectually and at the bench to the inception and characterization of the next generation viral vectors. This includes the development, validation, and/or implementation of assays that assess the identity and functional activity of immune active transgenes (payloads) for both human and mouse.</li> \n\n<li>Development, validation, and/or implementation of in vitro and ex-vivo assays to evaluate immune cell function; in particular, T cell, NK cell, and dendritic cell function, for both human and mouse. Proficiency for cellular (flow), molecular, and histological profiling techniques to investigate MOA will be an essential part of this role.</li>\n<li>Working knowledge of assays to assess oncolytic activity and to quantitate viral copy number and expression in biodistribution studies is preferred.</li> \n\n<li>Provide direct managerial supervision of scientists, including coordinating day to day duties, prioritizing experiments and mentorship and guidance for career development</li>\n<li>Excellent scientific and personal communication skills and flexibility in working on multiple projects in close cross-functional collaboration, both within the company and with CRO partners.</li> \n\n<li>Contribute to the authorship of technical reports for patent applications, IND reports, and scientific publications; generate and manage method protocols, data, and reports. Present results to team, management, external conferences, and in peer-reviewed scientific publications.</li>\n<li>Possess and remain updated on relevant scientific literature, applying external knowledge to internal drug discovery programs as appropriate.</li> \n</ul>\n<strong>Qualifications and Skills</strong>\n\n<ul>\n<li>Ph.D. in Immunology, Cancer Immunology, or a closely related field.</li> \n\n<li>At least 5 years of academic or industrial research experience after completion of post-doctoral training.</li>\n<li>Strong academic credentials demonstrating expertise in immunology and/or cancer immunology research</li>\n<li>Working knowledge of how to conduct in vivo studies with mouse syngeneic tumor models. Experience in translational oncology (biomarkers, mechanisms of resistance), bioinformatics, and contributions to regulatory filings is preferred.</li>\n<li>Ability to work independently and lead a cross-functional team to support corporate goals.</li>\n<li>Ability to adapt to frequent change and thrive in a dynamic and entrepreneurial early-stage environment</li>\n<li>Displays a high degree of maturity, honesty, trust, and integrity</li>\n</ul>\n<strong>Benefits and Perks</strong>\n<br><br>\nOncorus, Inc. is an Equal Opportunity Employer, and offers a comprehensive benefits package including health, dental, life insurance, 401K, unlimited vacation and much more."}