{"job title": "Data Scientist in Salt Lake City, UT at Radian Group Inc", "company": "Radian Group", "city state": "– Salt Lake City, UT", "rating": "3.6", "job description": "<div>\n<div>\nJob Description\n<br>\n The Data Scientist proactively participates in designing, developing and evolving high quality, extensible modeling solutions and interpretation of results using a variety of techniques ranging from simple data aggregation to complex data mining, algorithm development, and statistical analysis. This individual will be responsible for creating complex reporting and analytics processes to support Radian Mortgage and Real Estate Services analytical needs interfacing with both internal and external clients.<br><br><u><strong>Primary Duties and Responsibilities</strong></u>\n<br><br>\n&nbsp;Create, design, develop, test, calibrate, deploy, and support predictive models to support Radian MRES customer facing products and services. Models should incrementally improve specific business and product KPI’s.\n<br><br>\n&nbsp;Plan, track, and report on work progress including accurate estimate of work tasks considering their level-of-effort, complexity, and uncertainty.\n<br>\n&nbsp;Participate in agile methodologies (SCRUM) and the SDLC Life cycle, using code versioning systems, prodution deployments leveraging dev ops, and data architecture reviews.\n<br>\n&nbsp;Provide solutions on application performance improvement ideas/suggestions and implementation to enhance delivery of analytical solutions.\n<br>\n&nbsp;Generates new code and corrects, converts, and/or modifies existing code to meet specifications.\n<br>\n&nbsp;Conduct review meetings to discuss findings, risks &amp; challenges and recommends the solutions.\n<br>\n&nbsp;Actively supports colleagues by sharing information about the department, business unit and organization\n<br>\nPerforms other related duties as assigned\n<br><br>\n<u><strong>Job Specifications</strong></u>\n<br><br>\n<strong>Knowledge:</strong>\n\n\n<ul>\n<li>At least 3-5 years as a professional data scientist, preferably in a growth company</li>\n<li>Professional experience building predictive models through techniques such as machine learning, collaborative filtering, logistic regression, etc.</li>\n<li>Professional experience building predictive models to support consumer facing products and business process needs (bonus for direct mortgage data experience)</li>\n<li>Professional experience designing, executing and evaluating statistical tests</li>\n<li>Hands-on experience in one or more of the following technologies: Spark, Python, R, SAS (including NumPy, SciPy, Pandas, or StatsModels, etc.)</li>\n<li>Hands-on experience with SQL on relational and NoSQL data stores</li>\n<li>Proven ability to collaboratively and maturely work on a team</li>\n<li>Curious with an aptitude to quickly learn</li>\n</ul>\n\n<strong>Skills and Abilities:</strong>\n<br>\nMust be a team player with effective interpersonal, written and verbal communication skills to clearly and professionally interact with internal and external parties.\n<br>\nUnderstanding of query driven applications and reporting, and logical and physical data models.\n<br>\nAbility to work independently or in a team environment\n<br>\nStrong creative thinking, problem solving and analytical skills.\n<br>\nHigh commitment to excellent service levels and satisfaction with partners.\n<br>\nStrong organizational skills with the ability to multi-task are necessary.\n<br>\nDetail-oriented outlook coupled with ability to manage time effectively, plan ahead and meet deadlines.\n<br>\nGood business writing and presentation skills.\n<br><br>\n<strong>Other Position Parameters:</strong>\n\n\n<ul>\n<li>Guide/ Mentor other team members in terms of technical concepts and cooperate with them in meeting project deadlines and deliverables.</li>\n<li>Should be able to guide the team to automate the testing process (Performance, Regression testing) which enables faster time to market.</li>\n<li>Supports customer satisfaction process by taking accountability and addressing their concerns/ issues.</li>\n<li>Builds data pipelines with API’s, SQL, NoSQL and by any other means needed</li>\n<li>Creates data cleansing routines</li>\n<li>Uses Big Data algorithms to improve process performance</li>\n<li>Crafts testable hypotheses based on business problems</li>\n<li>Advanced ability to understand business processes</li>\n<li>Conduct analyses, design and create information products using various development tools</li>\n<li>Investigate problems with data query programs and timely assist customers in correcting problems</li>\n<li>Learn new software tools and other skills independently and as directed by manager to ensure best products are created for customer</li>\n<li>Establish and maintain strong relations with customers to ensure understanding of customer’s needs</li>\n</ul>\n\n<strong><u>Prior Work Experience</u></strong>\n<br><br>\nTechnical: 3 - 5 years\n<br>\nSupervisory: None\n<br><br>\n<u><strong>Education and Credentials</strong></u>\n<br><br>\nRequired:&nbsp;Master’s Degree, Concentration in Math, Statistics, Physics, Engineering, Computer Science, Econometrics\n<br><br>\nPHD or 3 to 5 years equivalent experience\n<br><br>\n<strong>EEO Statement</strong>\n<br><br>\nRadian complies with all applicable federal, state, and local laws prohibiting discrimination in employment. All qualified applicants will receive consideration for employment without regard to gender, age, race, color, religious creed, marital status, sexual orientation, national origin, ethnicity, ancestry, citizenship, genetic information, disability, protected veteran status or any other characteristic protected by applicable federal, state, or local law.\n<br><br>\nIf you are a person with a disability and need assistance in the application process please send an e-mail message to recruitment@radian.biz.</div>\n</div>\n\n<br>"}