{"job title": "Data Analyst", "company": "Roman Health", "city state": "– New York, NY", "rating": "5.0", "job description": "<div><div><strong>You:</strong></div><br>\n<div>You’re a talented <strong>Data Analyst</strong> who enjoys partnering with stakeholders to make highly impactful decisions using data. You recognize that the data culture we’ve built here requires relentless effort and iteration on the part of the data team to sustain itself. You have an intuitive grasp of business problems and modes of thinking across departments, and you are comfortable with basic coding as it pertains to analytics. You thrive within a small team, and you actively seek out responsibility and ownership.</div><br>\n<div><strong>Data at Roman:</strong></div><br>\n<div>Every single business unit evaluates its efforts on a weekly basis using our BI tool (Looker). Quarterly goals are all defined using data-based results. Any decision to be made takes into account all data that exists.</div><div>All data at the company - including production data, all third party data, all clinical data, all customer care data, all digital/out-of-home attribution sequence data, and all productionized analysis data - is centralized in our data warehouse and fully interconnected. The vast majority is accessible via our BI tool.</div><br>\n<div>Our stack is rooted in AWS, and we’ve carefully engineered our setup to require minimal ETL maintenance.</div><div>Our core data models are constantly growing and changing as our product/engineering teams iterate at lightning speed and the company’s offerings grow.</div> <br>\n<div><strong>Transparency:</strong> </div><br>\n<div>Roman’s financial headlines are displayed weekly at the all-hands meeting. Major initiatives and changes are similarly announced, well in advance of their implementation. Each department at the company has a clear lens into every other department’s quarterly objectives and current endeavors.</div>\n</div><div><div>Responsibilities\n\n<ul>\n\n\n<ul>\n<li>Partner with all departments at Roman to make data-driven decisions critical to Roman’s success</li><li>Develop core analytic frameworks that shape the way the company thinks</li></ul>\n</ul>\n\n</div>\n<br>\n<div><div>Requirements:\n\n<ul>\n\n\n<ul>\n<li>2-5 years of experience as an analyst with demonstrated ownership of framework areas</li><li>SQL</li><li>A deep understanding of numbers and business drivers</li><li>Demonstrated ability to manipulate code, especially BI tool backend code (like LookML)</li><li>Demonstrated ability to balance many different types of analytics problems within a given week</li><li>Clear communication</li><li>Empathy with stakeholders</li><li>A well-organized mind with excellent foresight; everything you produce is cleanly laid out, robust, easily understood by others, and anticipates what will come next</li></ul>\n</ul>\n\n</div>\n<br>\n<div><div>Bonus Points:\n\n<ul>\n\n\n<ul>\n<li>Python</li><li>Demonstrated experience with advanced analytic frameworks</li><li>Familiarity with AWS, Redshift</li></ul>\n</ul>\n\n</div>\n</div><div><div>Perks\n\n<ul>\n\n\n<ul>\n<li>Full medical, dental, and vision insurance</li><li>A never-ending supply of office snacks + coffee</li><li>Health FSA</li><li>401(k)</li><li>Commuter benefits</li><li>Unlimited PTO</li><li>Gym benefits</li><li>Maternity / paternity policy</li> <li>The cutest office dog you’ve ever seen</li><li>One high-five per quarter</li></ul>\n</ul>\n\n</div>\n</div><div><div>We welcome qualified candidates of all races, creeds, genders and sexuality to apply.</div><br>\n<div><strong>WE ARE ROMAN</strong></div><br>\n<div>Roman is a group of doctors, pharmacists, and problem solvers dedicated to transforming men’s health. We believe that by repairing the broken relationship between men and their health, we enable them to be better fathers, husbands, brothers, grandpas, boyfriends, and friends.</div><br>\n<div>Roman owns every step of the process–from diagnosis to delivery. We tackle one issue at a time because we believe focus leads to the best patient experience and the best outcome.</div><br>\n<div>Roman is backed some of the best investors in world. Our investors have also backed Warby Parker, Harry’s, Stripe, Oscar, and PillPack.</div>\n</div></div></div>"}