{"job title": "LCMS Scientist", "company": "Synectics Inc.", "city state": "– Andover, MA", "rating": "3.4", "job description": "Job Description<div><p><strong>Description:</strong><br>Focus on the development of sensitive quantitative assays against protein targets in various human tissues.<br>Participate in all phases of mass spec laboratory operations including the development of sample preparation methods, assay execution, instrument maintenance and data analysis/reporting.<br>Apply existing protein quantitation workflows using bead and column based immunoaffinity enrichment including the use of liquid handling robotics.<br>Sample preparation, run bioanalytical assays under minimal supervision; initiative in method development<br>Independent daily operation, calibration, maintenance, and trouble shooting of multi-dimensional nanoflow liquid chromatography and nanospray triple quadrupole mass spectrometry instrumentation.<br>Support analysis of quantitative LC-MS/MS data using relevant bioinformatics and quantitation software.</p><p><strong>Qualifications:</strong><br>Experience in sample handling, sample prep, and liquid handling<br>Expertise in bioanalytical procedures including working with biological serum samples and immunoanalytical workflows<br>Solid background in protein biochemistry<br>Expertise in triple quadrupole quantitative mass spectrometry.<br>Academic or industry experience<br>BA or above<br>ELISA and quantitation experience</p><p> </p><p> </p></div>Company Description<div>Synectics is one of the nation's foremost IT consulting firms, working with a client base that includes some of the leading institutions and Fortune 500 corporations in the United States. We seek to bring the most highly qualified professionals to assignments that they will find challenging and fulfilling. We also seek to justify our clients’ expectations that every Synectics consultant will bring the highest possible effort to their endeavors every day. Our success has depended on our consistent ability to achieve both of these goals.<br><br>Synectics serves an extremely diverse client base which represents an equally diverse range of industries and institutions. The technologies we support have always been responsive to this extremely broad spectrum. In order to fully engage with this continually changing commercial and technological landscape, our employees must draw on their own varying interests, skills and backgrounds. This insight, reflected in our daily practices, has always been our fundamental strength as a company, and it continues to serve us well in all our efforts.</div>"}