{"job title": "Research Scientist", "company": "Synectics Inc.", "city state": "– Redwood City, CA", "rating": "3.4", "job description": "Job Description<div>We are seeking an RA with hands-on experience in antibody discovery using hybridoma and/or B-cell approaches to\n<br><br>\nsupport therapeutic biologics programs and reagent antibody generation. Responsibilities will include executing on all steps of the antibody generation process. This includes preparing immunizations, hybridoma fusions, screening for antibodies, including developing and executing binding assays (ELISA, flow cytometry, HTRF) and subcloning and scale-up for antibody purification. <strong>A strong background in cell culture is required, experience with PCR and mammalian cell transfection is a plus.</strong> This position will require the ability to multi-task and work on several projects simultaneously. Detailed record-keeping and strong skills in data analysis are required. This position will collaborate with multiple functional areas including Automation, Protein Sciences, and project teams.</div>Company Description<div>Synectics is one of the nation's foremost IT consulting firms, working with a client base that includes some of the leading institutions and Fortune 500 corporations in the United States. We seek to bring the most highly qualified professionals to assignments that they will find challenging and fulfilling. We also seek to justify our clients’ expectations that every Synectics consultant will bring the highest possible effort to their endeavors every day. Our success has depended on our consistent ability to achieve both of these goals.\n<br><br>\nSynectics serves an extremely diverse client base which represents an equally diverse range of industries and institutions. The technologies we support have always been responsive to this extremely broad spectrum. In order to fully engage with this continually changing commercial and technological landscape, our employees must draw on their own varying interests, skills and backgrounds. This insight, reflected in our daily practices, has always been our fundamental strength as a company, and it continues to serve us well in all our efforts.</div>"}