{"job title": "Application Scientist", "company": "Transcriptic", "city state": "– Menlo Park, CA", "rating": "3.7", "job description": "<div><strong>We are:</strong></div> <div>Transcriptic is the programmable robotic cloud laboratory for the life sciences. We design, build, own, and operate automated molecular biology infrastructure to empower scientists to perform experiments remotely. We bring \"cloud computing\" to experimental biology to enable labless biotech, rapid drug discovery, and frictionless production-scale workflows. We care deeply about science and work to advance scientific access and capability.\n<br><br>\nAt Transcriptic, individuals are empowered to think creatively to solve problems and answer hard questions with well researched data. We work in an collaborative environment where everyone is encouraged to do their best work supported by a team of peers.</div> <div><strong>We want:</strong></div> <div>Transcriptic is looking for an experienced Application Scientist to join our Applications team. In this position you will interact with clients both pre and post-sales to onboard their assays onto our automated workcells. This entails translating customers' \"paper protocols\" into a python-based software script for onboarding and execution on our robotic platform, as well as optimizing assays for automation and pre-defined biological success parameters. Other responsibilities of the role include, but are not limited to: debugging biology, project management, contributing to infrastructure and internal tooling development, and coordinating assay transfer within the organization. The ideal candidate possesses both biological assay and lab automation experience in translating discovery biology workflows (ELISA, MSD, IC50, qPCR etc.) from manual benchtop execution to full automation. Knowledge of Python or another scripting language also required.</div> <div><strong>You are:</strong></div> <div>\n\n\n<ul>\n<li>Proficient in python with a basic understanding of a few other programming languages</li>\n<li>Prior experience onboarding and debugging discovery bioassays onto automation</li>\n<li>A Masters or PhD with 2-3 years of industry experience in high-throughput screening, biomarker characterization and/or discovery biology workflows (ELISA, MSD, IC50, EC50 qPCR etc.)</li>\n<li>Interested in automation and onboarding new applications</li>\n<li>A problem-solver with strong analytical skills</li>\n<li>Excited to use programming to troubleshoot biology</li>\n<li>Organized with excellent communication skills</li>\n<li>Able to translate a high-level goal into action with minimal further guidance</li>\n<li>Comfortable in a fast-paced and autonomous environment</li>\n</ul>\n\n</div>\n<br>\n<div><strong>You might have:</strong></div> <div>\n\n\n<ul>\n<li>Project management experience</li>\n<li>Some previous experience in engineering</li>\n<li>Experience in a customer facing role</li>\n<li>Working experience and knowledge of lab automation</li>\n</ul>\n\n</div>\n<br>\n<div><strong>You want:</strong></div> <div>\n\n\n<ul>\n<li>A challenging environment that will push you to grow and improve professionally, every day</li>\n<li>Opportunities to learn new technologies and fields, along with contributing to changing the future of science and research</li>\n<li>Competitive salary and meaningful equity</li>\n<li>Flexible and generous vacation whenever you need a day (or three) off</li>\n<li>100% covered health, dental, and vision insurance for you and subsidized coverage for your family</li>\n<li>A monthly CalTrain pass and cellular tethering</li>\n<li>Free membership to a gym of your choice</li>\n<li>Delivered lunch, catered dinner, and unlimited snacks</li>\n</ul>\n\n</div>\n<br><strong>Transcriptic is an equal opportunity employer</strong>"}