{"job title": "Healthcare Data Analyst", "company": "Alnylam Pharmaceuticals, Inc.", "city state": "– Cambridge, MA", "rating": "4.1", "job description": "Healthcare Data Analyst\n<br><br>\nOverview\n<br><br>\nAlnylam was founded in 2002 on a revolutionary vision and bold mission which remain firmly in place today. We are leading the translation of RNA interference (RNAi) into a new class of innovative medicines with the potential to transform the lives of people with rare genetic, cardio-metabolic, hepatic infectious, and central nervous system diseases with unmet need. ONPATTRO (patisiran), for the treatment of the polyneuropathy of hereditary transthyretin-mediated amyloidosis in adults, is Alnylam's first U.S. FDA-approved RNAi therapeutic. In addition, Alnylam has three investigational medicines in late-stage development. Alnylam is proud to have been recognized as one of The Boston Globe's Top Places to Work in 2015, 2016, and 2017.\n<br><br>\nAlnylam Pharmaceuticals, one of Cambridge's most innovative, publicly traded biotech companies, focused on translating the science of siRNA into human therapies, is looking for a full time Healthcare Data Analyst to support commercial business initiatives and field operations.\n<br><br>\nThe ideal candidate will be a detail-oriented, highly motivated professional with strong data, analysis and Excel skills, preferably with experience in cloud-based CRM and reporting applications.\n<br><br>\nSummary of Key Responsibilities\n\n\n<ul>\n<li>Administration of an innovative custom application managing healthcare data from multiple sources</li>\n<li>Reviewing system data to ensure proper functionality, processing results and managing exceptions</li>\n<li>Analysis of application data to identify opportunities and recommend actions</li>\n<li>Creation and execution of queries on healthcare data to drive better understanding and value</li>\n<li>Managing automated and manual data transfer between systems</li>\n<li>Support data inquiries from users in field</li>\n<li>Collaborate with management and technical teams to track and resolve issues and enhancement requests</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Bachelor's degree in Business Analytics, Computer Science or Information Systems</li>\n<li>1-3 years relevant experience, preferably as a CRM or reporting Analyst</li>\n<li>Experience in the biotech or pharmaceutical industry helpful</li>\n<li>Proficient in working with data in various formats including MS Excel and text files</li>\n<li>Experience with cloud-based CRM and reporting systems</li>\n<li>Ability to quickly interpret data and make judgment on meaning and quality</li>\n</ul>\n\nAlnylam Pharmaceuticals is an EEO employer committed to an exciting, diverse, and enriching work environment. #LI-BS1"}