{"job title": "Data Engineer/Analyst", "company": "BB&amp;T", "city state": "– Raleigh, NC", "rating": "3.3", "job description": "Specific information related to the position is outlined below. To apply, click on the button above. You will be required to create an account (or sign in with an existing account). Your account will provide you access to your application information.<br><br>Should you have a disability and need assistance with the application process, please request a reasonable accommodation by emailing or by calling 866-362-6451. This email inbox is monitored for reasonable accommodation requests only. Any other correspondence will not receive a response.\n<br><br>\n<strong>Regular or Temporary:</strong><br><br>Regular<br><br><strong>Language Fluency:</strong> English (Required)\n<br><br>\n<strong>Work Shift:</strong><br><br>1st shift (United States of America)<br><br><strong>Please review the following job description:</strong>\n<br><br>\nThe Enterprise Data Office within the Data and Technology Services area of BB&amp;T is creating a culture of technical excellence in order to empower our business units and customers. We are looking for a senior level data engineer who is a passionate technologist with a talent for interpreting business needs into logical solutions and services that scale. For you to be successful in this role: you will have exceptional technical leadership abilities, a very strong background in working with \"Big Data\", strong software and data persistence design and development experience, deep knowledge across broad technologies and frameworks, an exceptional ability to communicate effectively, and are highly motivated to grow your skills and career path.\n<br><br>\n<strong>Primary Purpose:</strong>\n<br><br>\nPrimary job responsibilities involve preparing data for analytical or operational uses across broad line of business needs areas and enterprise data domains. The data engineer often works as a dedicated member of delivery teams, focused on providing data in a ready-to-use services form for analytics groups and data scientists who are interrogating information for predictive analytics, machine learning and data mining purposes. In many cases, the data engineer also works with business units and departments integrating, consolidating and cleansing data, and structuring aggregations for use in individual analytics applications for business analysts, leadership groups, and other end users to aid in ongoing operational insights.\n<br><br>\nAn independent &amp; self-motivated lead Data Engineer must be versed in broad approaches to data architecture and applications, and will develop components/applications by studying operations and designing, and developing, reusable services and solutions that support the automated ingesting, profiling, and analysis of structured and unstructured data.\n<br><br>\n<strong>Essential Duties and Responsibilities:</strong>\n<br><br>\nFollowing is a summary of the essential functions for this job. Other duties may be performed, both m or and minor, which are not mentioned below. Specific activities may change from time to time.\n<ul>\n<li>2-4 years software development/ programming experience in enterprise/ web/ cloud applications</li><li>2+ years of experience in Data Modeling, data warehousing and data design</li><li>Experience with functional, imperative and object-oriented languages and methodologies.</li></ul>\n\n<ul>\n<li>Exposed to BIG DATA and Hadoop.</li><li>Experience with SQL (MySQL, Postgres) and NoSQL(MongoDB/HBase/ReDis) database is expected.</li><li>Experience with various operating systems (Linux/ Windows)</li></ul>\n\n<ul>\n<li>Working knowledge of programming languages/tools including: C#, Java, Python, Ruby, Scala, SQL and scripting (Java, Python, Spark, SQL, Hive, JavaScript, Shell). Scripts</li><li>Knowledge of Big Data approaches and technologies including: Hadoop, Cloudera utilities, Spark, Kafka, Hive, Oozie (experience with Angular JS/HTML5/Node JS are big plus).</li><li>Experience implementing and consuming large-scale web services (RESTful APIs)</li></ul>\n\n<ul>\n<li>Has been directly involved with, the investigation and resolution of complex data, system, and software systems requiring solutioning.</li><li>Experience working in an agile environment.</li></ul>\n\n<ul>\n<li>Explores, examines and interprets large volumes of data in various forms and recommends additional sources of data for improvements.</li><li>Experience with design patterns; logical, physical and dimensional (3NF modeling skills are a plus).</li><li>Experience in data management best practices, real-time and batch data integration, and data rationalization.</li> <li>Ability to prioritize well, communicate clearly, have a consistent track record of commitment and accountability for delivery, as well as excellent software engineering and troubleshooting skills.</li><li>Must be able to work across multiple phases of the project (e.g. initiation, planning, requirements, design, etc.) and manage assigned priorities and deliverables.</li><li>Creates and evaluates the data needs of assigned projects and assures the integrity of the data.</li></ul>\n\n<ul>\n<li>Translates business and data requirements into data models in support of enterprise data modellings, data definition and warehousing, and analytical systems.</li><li>Understand the relationships across business information and units of data; collaborate with business and other departments to identify data usage patterns and to formulate business names, definitions and data quality rules for data elements.</li><li>Maintain data mappings documents, business matrix and other data design artifacts that define technical data specifications and transformation rules.</li><li>Effectively communicate data design to other members of the team to ensure proper implementation and utilization of the data structures; support development team during process design and performance tuning.</li><li>Adopt quality assurance practices to include: following an appropriate modeling methodology, helping to establish department standards and procedures, reviewing and critiquing data models produced by others, participating in walkthroughs and audits, ensuring appropriate documentation is produced at all points in the process.</li><li>Pursue continuous improvements based on lessons learned and industry best practices.</li><li>Understand the goals and risks associated with the business and technical requirements, and offer counsel on risk mitigation and the alignment of data solution with objectives.</li><li>Demonstrate a team orientation by working closely and effectively with business partners, development teams and outside services.</li></ul>\n\n<ul>\n<li>Ability to apply systems thinking for solutions by considering broad potential alternatives and impact areas.</li><li>Ability to travel as needed, occasionally overnight.</li>\n</ul>\n<strong>Desired Skills:</strong>\n<br><br>\nKnowledge of, and experience working in, DevOps environments is desirable. Previous experience in the financial services industry is a plus. Experience with performance tuning and documenting changes. Exposure to container technologies (Docker or similar) and orchestration is a plus. Experience with metadata capture, management, and platforms.\n<br><br>\n<strong>BB&amp;T is an Equal Opportunity Employer and considers all qualified applicants regardless of race, gender, color, religion, national origin, age, sexual orientation, gender identity, disability, veteran status or other classification protected by law.</strong>\n<br><br>\nEEO is the Law Pay Transparency Nondiscrimination Provision"}