{"job title": "Senior Data Analyst", "company": "BlueOptima", "city state": "– Dallas, TX", "rating": "4.6", "job description": "<div><div>Job Description</div><div><div>BlueOptima is the only company providing reliable, objective software development productivity metrics. The technology has been implemented by some of the worlds largest organisations including insurance companies, asset managers, telecoms and nine of the worlds top twelve Universal Banks. This successful product uptake has led to rapid expansion of the company.\n<br><br>\nBlueOptima Inc is the US subsidiary of BlueOptima Ltd. Our US offices are in Midtown, NYC and the HQ is in London, UK.\n<br><br>\nWhom are we looking for?\n<br><br>\nWe are looking for individuals with 5+ years experience in Consulting with strong data analytics expertise. You will join as a manger in our growing consultancy team to work closely with stakeholders within client companies and BlueOptima.\n<br><br>\nGiven that our product measures the effort teams make as they write software, it would be hypocritical of us not to pay a lot of attention to the work we are putting into our jobs so the work you do will be highly visible to the whole team.\n<br><br>\nThe role includes comprehensive product training and ongoing development. You can expect to be heavily involved in client projects and managing the team in delivering ad hoc work some examples are below as well as working with the sales team as they deliver executive presentations\n<br><br>\nLocation\n<br><br>\nYour home office will be at BlueOptimas New York office, in Midtown and the role will require flexibility to temporarily relocate to BlueOptima's client sites in the other US states.\n<br><br>\nKey Responsibilities\n<br><br>\nLiaison between client technical team and BlueOptima development team\n<br>\nDesigning internal reports for use by management team and client at various tiers\n<br>\nSupporting product rollout with front end development\n<br>\nConsult with clients on the underlying Coding Effort metric and evangelise its use\n<br>\nData Quality checks / Deep Dives\n<br>\nLiaising with backend team on future developments\n<br>\nLinking data sets to generate reports\n<br>\nCreating / maintaining BI dashboards\n<br>\nProducing ad hoc reports\n<br>\nDeveloping new applications / uses for the existing data\n<br>\nProduce reports based on BlueOptima Coding Effort data and explain the insight they reveal to senior managers to support decision-making\n<br>\nDevelop additional applications for the BlueOptima product and data predominantly using R and/or similar statistical tools\n<br><br>\nQualifications &amp; Experience\n<br>\nYou will have experience in a consultancy/analytical function.\n<br>\nMasters degree or equivalent in Data Analytical/Mathematical Degree or equivalent expertise in an analytical role.\n<br><br>\nKey Skills\n<br>\nRequired\n<br>\nStrong people skills demonstrated through consultancy or similar experience, e.g. engaging with stakeholders for client companies\n<br>\nExperience of project management and designing processes to deliver successful outcomes is desirable\n<br>\nData Analysis &amp; Data Visualisation (via Tableau, Qlikview, SAS BI or similar)\n<br><br>\nDesirable\n<br>\nStrong fundamentals in Statistical Analysis\n<br>\nR or similar programming experience (e.g. Matlab)\n<br><br>\nBenefits\n<br>\nHealth insurance provided.\n<br>\nAnnual Bonus\n<br>\nFormal and informal training is included and there may be opportunities for international travel to support our global client base.\n<br><br>\nBlueOptima is rapidly acquiring new clients, thus our consultancy team needs to grow. Joining the team at the stage means a strong likelihood of opportunities to manage future consultants as well as contribute your own ideas to the development of the company.</div></div></div>"}