{"job title": "Senior Data Analyst", "company": "DigitalOcean", "city state": "– New York, NY", "rating": "4.3", "job description": "<strong>Do you ever wonder what happens inside the cloud?</strong><br><br>Based in New York and Cambridge, DigitalOcean is a dynamic, high-growth technology company that serves a robust and passionate community of developers around the world. Our mission is to simplify cloud computing for every developer. We are working on solving some of the most challenging and interesting technology projects around, on a scale unmatched by most.\n<br><br>\n<strong>We want people who are passionate about creating experiences that our customers will love</strong><strong>.</strong><br><br>\nWe are looking for a Senior Data Analyst to drive data decisions for DigitalOcean's Infrastructure organization. Reporting to the Engineering Manager of Observability Applications, the Analyst will partner with multiple teams throughout the wider Infrastructure organization to help build data pipelines, provide in-depth analyses, and serve as an in-house data expert on the overlaps between data and business decisions.<br><br><strong>What You'll Be Doing:</strong>\n\n\n<ul>\n<li>Partner with peer Infrastructure teams [Capacity Planning, Project Management, Network, Infrastructure Engineering, Tools &amp; Platforms] to prioritize and help implement pipelines on established and to-be-defined data pipelines necessary for those teams to perform their respective day-to-day operations</li>\n<li>Develop data pipeline requirements with Capacity Planning and Infrastructure teams to support historical data tracking, dashboards &amp; reporting, key metrics, and daily demand analysis across product lines</li>\n<li>Build dashboards/visualizations of pertinent data in Looker (in-house BI platform)</li>\n<li>Advise on appropriate use of data source tables, attributes and metrics for variable business problems</li>\n<li>Bring analytical insights from multiple facets of the business to Infrastructure decisions</li>\n<li>Provide occasional QA on the data living throughout the Infrastructure organization</li>\n</ul>\nSome Example Projects Include:\n\n<ul>\n<li><strong>Define + partner with an engineer to implement and validate a data pipeline for a new product line to support Capacity Planning and Infrastructure analysis &amp; reporting</strong></li>\n<li>Providing business context/motivation to engineering teams for building a new API</li>\n<li>Deliver ad hoc canonical reporting analysis for leadership and management</li>\n<li>Build an environment for data analysis that other analysts can tap into to explore canonical Infrastructure data</li>\n<li>Construct real-time actionable dashboards</li>\n</ul>\n\n<strong>What We'll Expect From You:\n<br><br>\n</strong>\n\n\n<ul>\n<li>Ability to spot anomalies in data and trends</li>\n<li>Interest in server technology and architecture</li> \n\n<li>An understanding of how hypervisors work and knowledge of the difference between SSD's and Spinners</li>\n<li>Strong analytical and interpersonal skills, a risk mitigation mindset and exhibit appropriate levels of urgency</li>\n<li>Working knowledge of corporate financial planning cycles, terminologies and interdependencies between supply chain and accounting</li>\n<li>You are well versed with data structures, fluent with SQL, and are excited by using scripting languages to automate your analyses if the need arises.</li>\n</ul>\n\n<strong>Why You'll Like Working for DigitalOcean</strong>:\n<br><br>\n\n\n\n<ul>\n<li><strong>We have amazing people</strong>. We can promise you will work with some of the smartest and most interesting people in the industry. We work hard but we always have fun doing it. We care deeply about each other and take our \"no jerks\" rule very seriously.</li>\n<li><strong>We value development</strong>. We are a high-performance organization that is always challenging ourselves to continuously grow. That means we maintain a growth mindset in everything we do and invest deeply in employee development. You'll need to be great to get hired here and we promise you'll get even better.</li>\n<li><strong>We care about you</strong>. We offer competitive health, dental, and vision benefits for employees and their dependents, a monthly gym reimbursement to support your physical health, and a monthly commute allowance to make your trips to and from work easier.</li>\n<li><strong>We invest in your future</strong>. We offer competitive compensation and a 401k plan with up to a 4% employer match. We also provide all employees with Kindles and reimbursement for relevant conferences, training, and education.</li>\n<li><strong>We want you to love where you work</strong>. We have great office spaces located in the heart of SoHo NYC and Cambridge, and offer daily catered lunches to keep your hunger at bay. We're also very remote-friendlywe use Slack to communicate across the companyand all remote employees have the opportunity to take an all-expense-paid trip to our office to get quality in-person time with the team at least once a year. We also allow employees to customize their workstations to meet their needswhether remote or in office.</li>\n<li><strong>We value diversity and inclusivity</strong>. We are an equal opportunity employer and we do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</li>\n</ul>"}