{"job title": "University Relations - Data Analyst Intern", "company": "HCSC", "city state": "– Chicago, IL", "rating": "3.2", "job description": "<strong>Job ID: SM-1027743 Description:</strong>\n<br><br>\nWhy Intern at Health Care Service Corporation?\n<br><br>\nHealth Care Service Corporation (HCSC), a Mutual Legal Reserve Company and an Independent Licensee of the Blue Cross and Blue Shield Association, is the largest customer-owned health insurer in the United States and fourth largest overall, operating through our Blue Cross and Blue Shield® Plans in Illinois, Montana, New Mexico, Oklahoma and Texas. HCSC affiliates and subsidiaries such as Dearborn National®, TMG Health and Medecision, offer group life, disability and dental solutions, as well as a range of other individual solutions. The company, founded in 1936, serves nearly 15 million members across five states and employs more than 21,000 people in over 60 local offices. HCSC is dedicated to expanding access to high quality, cost effective health care and equipping our members with information and tools so they can make the best health care decisions for themselves and their families. Our health plans were pioneers in their states, as they were the first to provide coverage for a number of procedures ranging from heart and bone marrow transplants, to cancer and leukemia treatments. Today, we are leaders in the development of value-based care models to spur greater collaboration and accountability among various stakeholders to improve the health care experience for patients and consumers and enable them lead healthier lives.\n<br><br>\nThis 10-week internship will be located in Chicago\n<br><br>\nWhat Are We Looking For?\n<br><br>\nThis position is responsible for assisting the Delivery Assurance and Performance Metrics organizations a) in the analysis of data and development of reports; b) revamping current Delivery Assurance Share Point site to enable publication and sharing of information and c) improving the quality and structure of data supporting the HealthTech Leadership performance dashboard. The position offers the opportunity to:\n\n\n<ul>\n<li>Working closely with HCSC HealthTech (IT) leadership in assessing current needs and developing value-add reports</li>\n<li>Leveraging skills in MS Excel and similar tools to analyze data</li>\n<li>Migrating current Share Point Teamsite for Delivery Assurance to a Publishing site</li>\n<li>Gather and analyze data, evaluate scenarios to make predictions on future outcomes and support decision making</li>\n<li>Drive the collection of new data and the refinement of existing data</li>\n<li>Identify gaps and contribute to process improvements</li>\n<li>Work with the Tableau data visualization tool</li>\n<li>Gain experience with IT performance metrics, dashboard development and data management</li>\n<li>Develop understanding of information technology performance metrics and HealthTech Performance Management tools and processes</li>\n</ul>\n\nWhat Do You Need To Be Successful?\n\n\n<ul>\n<li>Pursuing Bachelor Degree in Information Systems, Computer Science or Computer Engineering</li>\n<li>Knowledge of advanced MS Excel skills such as pivot tables, charts and creating complicated formulas,</li>\n<li>Strong analytical skills to help interpret data, analyze results using statistical techniques and provide ongoing reports</li>\n<li>Ability to multitask, prioritize and follow through with projects from start to finish</li>\n<li>Proficient in MS Office applications such as MS Visio, MS Word and MS Power Point</li>\n<li>Comfortable in using advanced statistical data modeling techniques and tools</li>\n<li>A strong passion for empirical research and for answering hard questions with data</li>\n<li>Ability to communicate complex quantitative analysis in a clear, precise, and actionable manner.</li>\n</ul>\n\nWhat Are the Requirements You Must Meet?\n\n\n<ul>\n<li>Pursuing a Bachelor's Degree in a Business related field majoring in Computer Science, Information Technology, STEM or related field</li>\n<li>Graduation date between December 2019 June 2020</li>\n<li>A minimum GPA of 3.0/4.0</li>\n<li>Availability to work 10 weeks during the summer</li>\n<li>Unrestricted authorization to work in the United States</li>\n</ul>\n\nWhat Does the Internship Program Entail?\n\n\n<ul>\n<li>Formal Intern Orientation to build business and industry acumen</li>\n<li>Challenging real world hands on project</li>\n<li>Weekly networking opportunities among interns and company leaders</li>\n<li>Professional development workshops</li>\n<li>Business Resource Group involvement</li>\n<li>Volunteer activities</li>\n<li>Team Building</li>\n<li>City-specific outing</li>\n<li>CA</li>\n</ul>\n\nHCSC is committed to diversity in the workplace and to providing equal opportunity and affirmative action to employees and applicants. We are an Equal Opportunity Employment / Affirmative Action employer dedicated to workforce diversity and a drug-free and smoke-free workplace. Drug screening and background investigation are required, as allowed by law. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status.\n<br><br>\nRequirements: Expertise Information Technology Job Type Intern Location IL - Chicago"}