{"job title": "Intern - Data Analyst", "company": "Healthstream", "city state": "– Nashville, TN", "rating": "3.1", "job description": "<strong>POSITION SUMMARY:</strong>\n<br><br>\nThe primary responsibilities of this position are to participate in the development and maintenance support of in-house developed applications. This includes data analysis, manipulation and extraction and creation of simple to moderately complex SQL queries and stored procedures. Will also include analyzing application performance and making recommendation for improvements, testing and evaluating existing application features.\n<br><br>\n<strong>ESSENTIAL DUTIES OR RESPONSIBILITIES:</strong>\n<br><br>\n<strong>Developmental and Operational</strong>\n<br><br>\nDevelop new and tune existing SQL queries as needed\n<br>\nMaintain and improve existing applications.\n<br>\nInvestigate and resolve data issues as needed.\n<br>\nMust be methodical and able to establish priorities\n<br>\nMust be able to recognize confidential data issues and maintain this confidentiality.\n<br><br>\n<strong>Team</strong>\n<br><br>\nMust be able to work in a strong team-oriented environment\n<br>\nAbility to handle high volumes of work without error\n<br>\nMentor to, learn from, and backup other team members as necessary\n<br><br>\n<strong>JOB SPECIFICATIONS:</strong>\n<br><br>\n<strong>A. KNOWLEDGE/EDUCATION AND EXPERIENCE REQUIRED:</strong>\n<br><br>\n4 year degree in Computer Science, Information Systems, Engineering or related field (required)\n<br>\nTwo (2) or more years experience in relational database design and development using SQL Server is required\n<br>\nSeasoned in the full development life cycle including requirements gathering\n<br>\nExperience developing and supporting mission critical applications that function 24 hours a day, 7 days a week\n<br>\nHigh motivation and commitment to quality and customer service\n<br>\nStrong debugging, performance tuning and troubleshooting skills\n<br><br>\n<strong>B. SKILLS REQUIRED:</strong>\n<br><br>\nTreats customers with respect-commitment to service\n<br>\nPromotes the mission and vision-performance excellence\n<br>\nExcellent written and oral communication skills\n<br>\nWorks collaboratively with others-teamwork\n<br>\nHelps others accomplish objectives-teamwork\n<br>\nDemonstrates a friendly approach\n<br>\nAccurately and effectively communicates\n<br>\nResponds to customer needs-commitment to service\n<br><br>\n<strong>C. ABILITIES REQUIRED:</strong>\n<br><br>\nResponds to work demands\n<br>\nMaintains confidentiality\n<br>\nAssumes accountability\n<br>\nDemonstrates acceptance of diverse populations\n<br><br>\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.<br><br>Please refer to the job description for details."}