{"job title": "Sr. Analyst, Data Management (Revenue Management/Sales and Call Center Domains)", "company": "Hilton", "city state": "– McLean, VA", "rating": "4.0", "job description": "<strong>Job Description</strong><br><br>Hilton is creating a best-in-class data &amp; analytics department that will lead a connected ecosystem of data, technology, tools, techniques, people and processes. This innovative data &amp; analytics function will drive advanced analytics and actionable insights to help drive Hiltons performance.<br><br><strong>What will I be doing?</strong><br><br>The newly formed Data Strategy and Governance Team supports key functions across the business by utilizing creative solutions to provide frictionless and timely access to high-quality, integrated data. The team consists of specialists in data governance, data quality, data integration, data modeling, and data channeling, reporting and dashboards.\n<br><br>\nWorking with the Director, Master Data Management, you will support core enterprise Master Data Management. You will also support all Revenue Management, Sales and Call Center related data domains at Hilton. This includes your coordination of all aspects of strategy, planning, management, technology solutions, matching capability and overall delivery. You will have close ties and overlapping responsibilities with Reporting functions.\n<br><br>\nYou should be creative, innovative and a trusted partner with Business Data Owners, the Analytics Center of Excellence and Information Technology (IT). Your strong collaboration skills will ensure that fact-data and master data are professionally organized and handled with business questions and analytics projects met with highly agile data models or APIs. This includes successful overall data modelling structures to support Hiltons strategies.\n<br><br>\nMore specifically, you will:\n<ul>\n <li>Understand the business strategy, objectives and goals while effectively engaging in the discussion to provide meaningful content</li> <li>Enable the consumption layer for frictionless reporting and analytics</li> <li>Guide the lifecycle of data to support complex business problems</li> <li>Plan in advance and understand the needs ahead of business requirements</li> <li>Ensure all technology components within the data environment operate in line with requirements of the organization</li> <li>Integrate with other functions within the Data Strategy &amp; Governance tower</li> <li>Build property and account centric data models that facilitate the understanding of property performance and accounts production in line with overall commercial strategy</li> <li>Execute key activities motivated by data governance, integration, quality and master data management initiatives</li> <li>Support the design and implementation of data management plans to enhance data analysis and reporting capabilities</li> <li>Execute processes for building reporting solutions, such as data mapping, data lineage and requirements analysis</li> <li>Support the development of data quality standards for reference, master and transactional datasets</li> <li>Support the creation of a process of pre-emptive problem detection, testing and remediation of data issues</li> <li>Document and manage definitions of reference/master data hierarchies and groupings</li> <li>Produce data profiling and exploratory analysis as part of active data management by domain</li>\n</ul>\n\n<strong>What are we looking for?</strong><br><br>The success in this role will demonstrate itself through the following attributes and skills:\n<ul>\n <li>Collaboration with IT to design and help model applications in accordance with enterprise-wide architecture standards and processes</li> <li>Coordination with data owners and stewards to ensure the right data is sourced for reporting needs</li> <li>Excellent analytical, quantitative and problem solving skills</li> <li>Understanding of basic database and SQL concepts, such as database table design and relationships, and analyzing data using SQL queries</li> <li>Effective communicator, collaborator, influencer and solution seeker across a variety of opinions</li> <li>Self-starter, well organized, thorough and assertive with a willingness to take ownership of responsibilities</li> <li>Excellent time management and organizational skills with a high level of positive energy and drive</li> <li>Project management skills to handle multiple priorities, work well under time constraints and effectively handle concurrent demands to prioritize responsibilities</li>\n</ul>\nTo fulfill this role successfully, you must possess the following minimum qualifications and experience:\n<ul>\n <li>Associate's Degree, College Diploma or Cepeg</li> <li>Two (2) years of professional experience</li> <li>One (1) year of experience in data management</li> <li>One (1) year of experience working with data integration, data governance, data life cycle management and data quality</li> <li>Experience with surrounding and supporting disciplines (data quality, data operations, Business Intelligence (BI)/Data WH/Data Lake)</li> <li>Proficiency in Microsoft Excel that includes advanced formulas and pivot tables</li> <li>End-to-end understanding of the data flow process (from ingestion to consumption layer)</li>\n</ul>\nIt would be advantageous in this position for you to demonstrate the following capabilities and distinctions:\n<ul>\n <li>One (1) year of experience working with Metadata Management tools such as Informatica, Talend, Alteryx, Apache Atlas or other data management systems</li> <li>Functional experience in hospitality Sales</li> <li>Functional experience with hospitality Sales software such as Delphi or SalesPro</li> <li>Experience using Business Intelligence Tools including Tableau, MicroStrategy and SAS</li>\n</ul>\n\n<strong>What will it be like to work for Hilton?</strong><br><br>Hilton is the leading global hospitality company, spanning the lodging sector from luxurious full-service hotels and resorts to extended-stay suites and mid-priced hotels. For nearly a century, Hilton has offered business and leisure travelers the finest in accommodations, service, amenities and value. Hilton is dedicated to continuing its tradition of providing exceptional guest experiences across its global brands. Our vision to fill the earth with the light and warmth of hospitality unites us as a team to create remarkable hospitality experiences around the world every day. And, our amazing Team Members are at the heart of it all!"}