{"job title": "Regional Marketing Data Analyst", "company": "Red Hat Inc.", "city state": "– Raleigh, NC", "rating": "4.0", "job description": "Company description\n<br><br>\nAt Red Hat, we connect an innovative community of customers, partners, and contributors to deliver an open source stack of trusted, high-performing solutions. We offer cloud, Linux, middleware, storage, and virtualization technologies, together with award-winning global customer support, consulting, and implementation services. Red Hat is a rapidly growing company supporting more than 90% of Fortune 500 companies.\n<br><br>\nJob summary\n<br><br>\nSupport the budget and technical reporting and visualization and data infrastructure for North America (NA) Field Marketing team. The Red Hat Strategy, Insights, and Operations team is looking for a Regional Marketing Data Analyst to join us in Raleigh, NC. In this role, you will build an infrastructure to connect, query, and manage relational databases using SQL. You'll need to have technical reporting and data visualization skills for supporting business analysts on the team. You'll create and automate reporting for the regional campaign, discretionary, and market development funds (MDF) budgets managed in Allocadia, Red Hat's marketing budget management platform. As a Regional Marketing Data Analyst, you will collaborate closely with Red Hat's Procurement, Financial Planning, and Analysis teams and the global Allocadia team to resolve discrepancies between Allocadia and Oracle purchasing systems, or actual spend-to-budget forecast and target variances. You'll also need to have the ability to clearly communicate budget management practices and expectations, monthly Finance team's reporting deadlines, and relevant changes to Finance and Procurement teams' systems and processes.\n<br><br>\nPrimary job responsibilities\n\n\n<ul>\n<li>Build infrastructure to connect and manage relational databases using SQL</li>\n<li>Support business analysts by sourcing raw data for manipulation, technical reporting, and data visualization</li>\n<li>Work with cross-functional stakeholders to ensure that fiscal year and quarterly budget targets are allocated correctly in Allocadia</li>\n<li>Build and automate regular reports to monitor actual spend and expenses to budget forecasts</li>\n<li>Work with managers and budget owners to ensure achievement within +/-5% of fiscal quarter and year targets</li>\n<li>Work with Procurement, Financial Planning, and Analysis teams and global Allocadia teams to resolve discrepancies between Allocadia and Oracle purchasing systems or expenses to forecast and target variances</li>\n<li>Keep managers and budget owners apprised of budget planning milestones, requirements, and deadlines, as well as relevant changes to Finance or Procurement teams' systems and processes</li>\n</ul>\n\nRequired skills\n\n\n<ul>\n<li>Bachelor's degree in business or a related discipline; MBA is a plus</li>\n<li>SQL proficiency</li>\n<li>Experience building and managing an infrastructure to connect relational databases</li>\n<li>Solid technical reporting skills and insight; ability to recognize discrepancies across data sets</li>\n<li>Data visualization experience, including the use of Tableau or similar tools</li>\n<li>Experience building and automating reports</li>\n<li>Proficient with Microsoft Office Excel and Google Sheets</li>\n<li>Highly motivated problem-solver who excels in a fast-paced, dynamic environment</li>\n<li>Ability to work effectively as part of a team across geographically distributed teams and stakeholders</li>\n<li>Excellent written and verbal communication skills</li>\n</ul>\n\nRed Hat is proud to be an equal opportunity workplace and an affirmative action employer. We review applications for employment without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, ancestry, citizenship, age, uniformed services, genetic information, physical or mental disability, medical condition, marital status, or any other basis prohibited by law.\n<br><br>\nRed Hat does not seek or accept unsolicited resumes or CVs from recruitment agencies. We are not responsible for, and will not pay, any fees, commissions, or any other payment related to unsolicited resumes or CVs except as required in a written contract between Red Hat and the recruitment agency or party requesting payment of a fee."}