{"job title": "Data Analyst (State Client)", "company": "SmallArc", "city state": "– Madison, WI", "rating": "4.5", "job description": "This position is for a dedicated IT Business Analyst; please do not submit ETL developers for this role. DCF is looking for a strong practitioner with 5 or more years of business requirements elicitation, documentation, stakeholder communication, requirements verification and testing as a primary job responsibilities. Preference will be given for candidates will experience in gathering requirements for data warehouse/business intelligence projects. Responsible for leading and facilitating the communication with IT staff, business customers and other stakeholders, implementation services, and support services to assist in the development, implementation and support of business intelligence. Understands business objectives and problems, identifies alternative solutions, performs feasibility studies and cost/benefit analysis of alternatives in support of enterprise wide business intelligence. Manages the balance between business requirements and user expectations. Uses extensive experience as a liaison between users and technologists to drive requirements into design. Analyzes user requirements, procedures, and problems to automate processing or to improve existing processes: Confers with personnel of organization unites involved to analyze current business procedures, identify issues, and learn specific business requirements, such as how data is to be summarized, and formats for reports. Works with the team lead and manager to determine a detailed and prioritized list of objectives and activities for current and future projects. Experience with Human Services business intelligence is desirable. Responsibilities with include project work enhancing existing/new processes through data sharing, configuration, report writing and metrics. Troubleshoot and resolve issues efficiently. Identify potential technology improvements to be leveraged in support of the business. Assist in the creation and maintenance of test plans. Participate in special projects as required. Business Analyst with 5 or more years of experience, relies on experience and judgment to plan and accomplish goals, independently performs a variety of complicated tasks. - provided by Dice Data warehouse, Data Analyst, Business Analyst, requirements gathering\n<br>\nAssociated topics: data analytic, data center, data integration, data management, data scientist, data warehouse, hbase, mongo database administrator, sybase, teradata"}