{"job title": "CRM Analyst - Data Analyst", "company": "Software Resources", "city state": "– Burbank, CALIFORNIA", "rating": "4.7", "job description": "Software Resources has an immediate job opportunity for a CRM Analyst - Data Analyst in Burbank, CA. \n<br>\n<br>\n12+ month contract \n<br>\n<br>\nDescription/Comment: \n<br>\nCustomer Relationship Management (CRM) Data Analyst: \n<br>\n<br>\nSeeking a Business/Data/Social Analyst to join the Studio Consumer Insights &amp; Analytics team. This team is a highly visible department that plays an integral part in key business decisions across the Studio organization and the company. The goal of the Analytic Insights team is to create a competitive advantage for us by leveraging data and advanced analytics. This position requires passion, curiosity, analytical, and story-telling skills. This position also requires the ability to work closely with business segments to gain perspective and a strong understanding of objectives. A curious, proactive, independent, high-energy, positive attitude is a must. The Business/Data/Social Analyst is responsible for segmentation and personalization of the contact strategies for Movie Rewards and home entertainment CRM efforts. As an integrated member of the team, the CRM Data Analyst leverages the Studio consumer database to provide comprehensive analysis and reporting on campaign performance across promotions &amp; email campaigns. \n<br>\n<br>\n Responsibilities: \n\n\n<ul>\n\n <li>Manage day to day operation of email execution including scheduling, segmentation, and analysis</li> \n\n<li>Leverage both known and unknown user data to delivery personalized and dynamic content</li> \n\n<li>Collaborate with CRM marketing leads on strategizing the development of both targeted and triggered based life-cycle campaigns</li> \n\n<li>Understanding client requirements in regards to business intelligence, reporting, and analytics</li> \n\n<li>Design and analyze surveys to measure impact of marketing tactics &amp; understand consumer behavior</li> \n\n<li>Development of prototype solutions, reports and dashboards, and robust analytics to support analytic insights and visualization of complex data sets</li> \n\n<li>Provide optimization recommendations that drive KPIs established by CRM team</li> \n\n<li>Deliver timely analytics and dashboards to support decision-making including website, product, and marketing efforts</li> \n\n<li>Leverage analytical tools (Omniture and Google Analytics) to understand onsite behavior, e.g. click through rates, golden pathways, conversion analysis, marketing effectiveness</li> \n\n<li>Develop and deploy testing hypotheses and analyze test results, providing the necessary analytical rigor to ensure data quality, consistency, repeatability, and accuracy of insights</li> \n\n<li>Ask and answer the next question(s) after gathering and analyzing the data to make insights more powerful not just delivering what was asked for!</li> \n\n<li>Apply data science skills to develop more advanced solutions that drive action in the business</li> \n\n<li>Desire to participate in an \"Open Source learning environment where sharing, documenting, teaching, and collaborating with others is the culture</li> \n\n<li>Advocate compliance based on best practice knowledge around permission-based marketing, privacy, SPAM/CASL regulation, deliverability, corporate guidelines and email browser compatibility</li> \n</ul>\n\n<br>\n<div> Basic Qualifications Basic Qualifications \n<br>\n<br>\n 1-3 years of experience in CRM Analytics including CPA, LTV, Attribution Modeling, Reward Redemptions &amp; ROI analysis \n<br>\n 1 -3 years of experience with SQL and/or Spark SQL \n<br>\n 1-3 years of experience as a data analyst with experience in Adobe Analytics \n<br>\n Experienced with maintaining a loyalty/rewards programs and its disciplines (acquisition, retention &amp; win back strategies) \n<br>\n Solid capabilities for analyzing email marketing &amp; other digital marketing channels \n<br>\n Proficiency with social media analytics provided by Facebook, Twitter, YouTube, and Instagram \n<br>\n Ability to extract data and combine with other data sources to develop a rich, complete picture for the business \n<br>\n Ability to tell a story with data What does the analysis tell you? What do you think the business should do next? Why do you think what is happening, is happening? Ability to influence others with the story of what you're seeing in the data to make business recommendations \n<br>\n Ability to communicate complex and technical concepts to non-technical users and translate insights into actionable business recommendations \n<br>\n Ability and desire to lead projects independently from start to finish, working with internal and external teams to make decisions and maintain momentum \n<br>\n Excellent time and project management skills, with the ability to manage detail work and communicate project status effectively to all levels \n<br>\n Proven track record in meeting aggressive deadlines \n<br>\n Strong proficiency in MS Excel &amp; PowerPoint/Keynote \n<br>\n Proficiency in SQL, Tableau, Omniture</div> <div> Preferred Qualifications Preferred Qualifications \n<br>\n<br>\n Google Optimize, Databricks experience \n<br>\n Machine learning experience \n<br>\n Experience with any common BI tools such as Cognos, Business Objects, Microstrategy, desired \n<br>\n Previous experience with a major media company (film/TV/digital), particularly on the content distribution/acquisition side \n<br>\n Knowledge of integrated marketing and D2C disciplines (including email, push notifications, SMS, and custom audience)</div> <div> Required Education Bachelor degree in a field of analytic study</div> \n\n<br>Don't delay. Join the Software Resources team today! \n<br>\n Software Resources specializes in connecting talented IT professionals with challenging job opportunities that transform jobs into careers. \n<br>\nTo meet our clients hiring needs, we continuously source talented IT Professionals with all levels of expertise and in all disciplines. We offer world class major medical, dental and vision benefits, 401(k) with match, short term disability, Life Insurance and AD&amp;D. You, our future employees, can make a tremendous difference to our company and our clients. Please apply to this job and experience the Software Resources difference. You can view all of our jobs at http://www.softwareresources.com/it-careers/it-job-search/ \n<br>\n Company Overview \n<br>\n Software Resources specializes in IT talent recruitment services and workforce staffing solutions. Founded in 1992 as an IT staffing services firm, we are a privately held women-owned business enterprise (WBE), celebrating our 25th year in business. We are headquartered in Lake Mary, Florida, just outside of Orlando. With branches and sales professionals throughout the U.S., Software Resources is the staffing agency of choice for clients and consultants. \n<br>\nWe specialize in IT. It's what we do and what we know, every day. We provide contract, contract to hire and direct hire placement IT staffing solutions for Energy, Entertainment/Gaming/New Media, Financial Services, Government, Healthcare, Hospitality, Professional Services, and Security."}