{"job title": "Healthcare Quality Data Analyst", "company": "Tri-County Medical Associates", "city state": "– Milford, MA", "rating": "3.8", "job description": "<div>\n\t<div>\n <div>\n <p>\n <strong>Statement of Purpose:</strong><br>\n <br>\n The Healthcare Data Analyst is responsible for supporting and facilitating the reporting needs of the quality, risk, nursing, physician and other business teams within Milford Regional Medical Center. Supports the Director and other stakeholders to measure, report, summarize and communicate MRMC performance on key quality and safety indicators, including measurement development. Works with stakeholders to define populations and metrics, conduct appropriate analysis, revise analysis based on stakeholder feedback and develops final presentation/report for customers. Critically evaluates, interprets and displays data utilizing benchmarks and developing data visualization in a meaningful way. Works collaboratively with the Physician lead quality improvement teams, quality staff, IT staff, and hospital wide quality improvement teams to support measurement development and reporting</p>\n <p>\n <strong>Qualifications:</strong></p>\n <p>\n <strong>Education: </strong>Bachelor of Science Degree in Health Policy, Public Health, Business or other related field required; Master’s degree strongly preferred.<br>\n <br>\n <strong>Certification / License:</strong> none</p>\n <p>\n <strong>Experience: </strong> Three to five years of healthcare experience.</p>\n <p>\n Experience analyzing and reporting clinical or EMR data<br>\n Demonstrated knowledge of the principles of quality improvement<br>\n Demonstrates understanding of wide range of interpretive analysis tools such as trend analysis, spreadsheets, graphs, correlations. <br>\n Knowledge of healthcare quality metrics, datasets and methodologies required<br>\n Expertise in data management and reporting tools such as MS Excel, SAS, SQL server databases, and relational databases<br>\n Knowledge of statistical analysis strongly preferred<br>\n Proficient in manipulating and interpreting data using clinical, hospital-based, ambulatory, and claims-based databases<br>\n Demonstrated ability to work as a team member<br>\n Effective presentation skills. <br>\n Able to communicate in a concise, calm manner<br>\n Ability to prioritize and manage multiple projects, meeting deadlines/schedules<br>\n Able to quickly adapt and learn in an ever-changing technical, contractual, and regulatory environment.<br>\n High degree of professionalism, discretion, and confidentiality </p>\n </div>\n\t</div>\n</div>"}