{"job title": "Business Data Analyst", "company": "Triumph Enterprises", "city state": "– US-DC-Washington", "rating": "4.1", "job description": "Job Description<br><br><strong>Triumph Enterprises is currently looking for a Business Data Analyst.</strong>\n<br><br>\n<strong>Beyond your technical expertise (outlined below), you must be resourceful, detail-oriented, and 100% client focused, with a continuing passion for your profession. The rewards of joining Triumph Enterprises will include competitive compensation, exceptional benefits, matching 401K, and professional/training development allowances that exceed many companies of larger size and stature.</strong>\n<br><br>\n<strong>This position will support our valued client at the Department of Commerce.</strong>\n<br><br>\nResponsibilities<br><br>Under the supervision of a Triumph Client Solutions Project Lead, the Business Analyst will be responsible for:\n\n<ul>\n\n <li>Providing strong analytical and program support with a focus on high-performance work</li>\n<li>Assisting in the planning and standup of a new program by supporting the definition of program requirements, schedules, and objectives</li>\n<li>Supporting the development of strategic concepts and documentation to institutionalize a complex technical program</li>\n<li>Communicating the program’s strategic value to a wide-range of stakeholders by synthesizing complex technical concepts into easily digestible briefings and visuals</li>\n<li>Assisting in the monitoring of system architecture projects by developing and using project management tools and resources</li>\n<li>Working with the client to develop and maintain a program plan, and to define program scope, milestones, timelines, and budgets</li>\n<li>Utilizing the Microsoft office suite of tools to develop processes and tools in collaboration with executive and technical stakeholders to streamline ongoing efforts</li>\n<li>Developing materials to help organize and facilitate meetings, including facilitation plans, agendas, and materials for use during meetings</li>\n<li>Assisting with the development and/or modification of briefings</li>\n<li>Supporting presentation development for industry engagement, including strategic off-sites</li>\n<li>Assisting in the development of a process to standardize the implementation of system architecture requirements</li>\n<li>Assisting in the development of training materials, including leading training sessions</li> \n\n<li>Must be able to:</li>\n\n\n<ul>\n\n <li>Evaluate processes</li>\n<li>Prepare appropriate documentation for clients</li>\n<li>Run efficient meetings with team members and clients</li>\n<li>Communicate with technical and non-technical clients and team members</li>\n<li>Translate technical subject matter into non-technical terms</li>\n<li>Complete assigned tasks within scope and budget</li>\n<li>Lead projects and tasks as assigned</li></ul>\n\n\n</ul>\n\nQualifications / Requirements\n\n\n<ul>\n\n <li>Bachelor’s Degree</li>\n<li>Ability to analyze project data and develop appropriate deliverables</li>\n<li>Knowledge and proficiency with Microsoft Office Suite (Excel, Access, Word, PowerPoint, Visio and Project)</li>\n<li>Basic understanding of systems architecture</li>\n<li>Ability to make sound, well-informed, objective decisions</li>\n<li>Ability to adapt behavior or work methods in response to new information, changing conditions, or unexpected obstacles--must be able to deal with ambiguity</li>\n<li>Ability to develop and maintain relationships with people from varied backgrounds--must be able to show understanding, courtesy, tact, and empathy</li>\n<li>Excellent communication skills, both written and oral--must be able to express information and make convincing arguments to groups and individuals effectively, taking into account the audience and nature of the information</li>\n<li>Demonstrated problem-solving ability as it relates to: anticipating, identifying, and diagnosing problems, determining accuracy and relevance of information, using sound judgment to generate and evaluate alternatives, make recommendations, and take action from developed contingency plans</li>\n<li>Proven experience working with customers to assess needs, provide recommendations, implement solutions, and satisfy expectations</li>\n<li>Consistently develop and sustain cooperative working relationships and facilitate cooperation within the organization, with peers, supervisors and most importantly with the client group</li>\n<li>Ability to foster an environment of commitment, team spirit, pride, and trust</li>\n<li>Ability to organize work, set priorities, and determine resource requirements as it relates to determining short- or long-term goals and strategies to achieve them</li>\n<li>Ability to coordinate with external stakeholders to accomplish goals, monitor progress, and evaluating outcomes</li>\n</ul>\n<strong>Preferred Qualifications:</strong>\n\n<ul>\n\n <li>Experience as a government contractor</li>\n<li>Experience developing PowerPoint leadership briefings</li>\n<li>Experience in project management</li>\n<li>Experience developing strategic documents at the program level</li>\n<li>Ability to understand complex technical concept</li>\n<li>Ability to obtain a DHS Public Trust clearance or Secret clearance (if necessary)</li>\n<li>Experience with SharePoint</li>\n</ul>\n\nCompany Overview<br><br><strong>Our pursuit of excellence is driven by an emphasis on Client Focus, Integrity, Imagination, and Employee Engagement – the Core Values that motivate and inspire our leadership, business practices, and company culture.</strong>\n<br><br>\n<strong>Triumph participates in e-Verify. We provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS) with information from each new employee’s I-9 Form to confirm work authorization. Triumph is an equal opportunity employer and gives consideration for employment to qualified applicants without regard to race, color, religion, sex, national origin, disability, protected veteran status or any other status defined by law. Go to</strong> <strong>www.triumph-enterprises.com</strong><strong> to learn more about Triumph.</strong>"}