{"job title": "Electronic Data Interchange (EDI) Analyst", "company": "WellCare", "city state": "– Tampa, FL", "rating": "3.6", "job description": "<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong><br>\n<div>Analyzes, designs, and develops specifications for enhancements and extensions with EDI application interfaces, formats and maps. Reviews programming requests and works with business users and technical staff to identify, gather, analyze, and document business system requirements. Develops requirements traceability matrix to be used in software development and QA testing. Documents work flow processes and collaborates with users in identifying, defining, and documenting process improvement options and alternatives. Performs assignments under the mentoring and guidance of the team's senior and lead EDI Analysts when appropriate.</div>\n<br>\n<div><strong>Essential Functions:</strong></div><ul><li>Participates EDI testing with state or trading partner's implementation initiatives.</li> <li>Monitors EDI related production activities and new state initiatives.</li><li>Identifies required information fields and develops data dictionary.</li><li>Evaluates and escalates risks and impacts to the overall EDI process for project and production activities.</li><li>Prepares EDI data for re-submission when needed.</li><li>Participates in systems development.</li><li>Participates in testing, acceptance testing and implementation of information systems.</li><li>Participates in documentation of SNIP Level edits, EDI processing flows and procedures.</li><li>Collaborates with other IT and business departments</li><li>Participates in the identification and implementation of EDI process improvement activities.</li> \n</ul>\n\n<div><strong>Education:</strong> Bachelor's degree from an accredited college or university is required, preferably in information systems or a healthcare-related field, OR equivalent directly related experience.</div><div><strong>Experience:</strong> 2-4 years of previously related work experience required; EDI required, Healthcare preferred</div><div><strong>Licenses/Certifications:</strong></div> <div><strong>Special Skills (e.g. 2nd language):</strong>  Ability to handle multiple tasks concurrently</div><div><strong>Technical Skills/Requirements:</strong></div>\n\n<ul>\n<li>Outstanding verbal and written communication skills required. Must be able to document utilizing standard formats. Documentation must be grammatically correct, factually accurate, and appropriate to target audience.</li><li>Working knowledge of EDI translators</li><li>Knowledge of EDIFECS Transaction Manager suite of products preferred</li><li>Knowledge of Systems Development Life Cycle methodologies is preferred.</li><li>Proficient in MS Office including Word, Excel, Outlook, Visio, PowerPoint and Project.</li><li>Proficient in database analysis and SQL.</li>\n</ul>"}