{"job title": "Business Intelligence Analyst", "company": "AKRAYA Inc", "city state": "– Foster City, California", "rating": "3.5", "job description": "Business Intelligence Analyst: 18-03616\n<br>\nRef No.: 18-03616\n<br><br>\nCategory: Business Intelligence &amp; Data Warehousing\n<br><br>\nLocation: Foster City, California\n<br>\nAkraya is looking\n<br>\nBusiness Intelligence Analyst for one of our clients. If the job description below is a fit, please apply directly or call\n<br>\nRahul Shribas at ************. If this position is not quite what you're looking for, visit ********** and submit a copy of your resume. Our recruiters will get to work finding you a job that is a better match at one of our many clients.\n<br><br>\n<strong>Primary Skills:</strong>\n<br>\nBusiness Intelligence / Data Virtualization Analyst, SQL, Denodo, Microstrategy or Tableau, SSOT\n<br><br>\nDuration: 12+ Months contract with possible extension or Conversion\n<br>\nContract Term: W2\n<br><br>\n<strong>Job Description:</strong>\n<br>\n7-10+ years of relevant business intelligence experience. Excellent communication skills (presenting, training, collaborating).Solid experience with SQL, relational databases - experience with BI tools such as Microstrategy and or Tableau. Bachelor's in CS or related field. Experience with Denodo and or data governance would be ideal. NOT looking for a technical/data heavy individual.\n<br><br>\n<strong>Main Function:</strong>\n<br>\nIn this role, the Business Intelligence / Data Virtualization Analyst will provide user support to business users and drive adoption of the Single Source of Truth Semantic layer developed on Denodo. You will successfully employ a combination of business intelligence and data expertise with internal customer management skills. Within the Global Business Intelligence team, provide support to product management and adoption by internal staff of Single Source of Truth Semantic Layer built on Denodo Data Virtualization\n<br><br>\n<strong>Responsibilities:</strong>\n<br>\nDrive adoption through collaboration and education with internal users and potential business users; and help them realize productive use of our SSOT Semantic Layer product\n<br>\nManage and fulfill user access requests to Denodo. Develop and maintain product and training documentation. Provide support to internal users of SSOT Semantic Layer\n<br>\nProvide day to day user support, education, tracking and resolution of issues. Conduct overviews and formal training to various user profiles: data discovery, BI report development, Denodo report view developers. Be able to clearly communicate key and advanced features, benefits, and product offerings\n<br>\nDenodo view development; specifically reporting views to support BI reporting solutions. Develop Denodo report\n<br>\nSupport User Acceptance Testing as new features are implemented\n<br>\nGather and provide timely user/stakeholder feedback and communicate to product development team regarding user's business cases, requirements, and issues\n<br>\n<strong>Required skills / Qualification:</strong>\n<br>\nBachelor's Degree in Computer Science, Information Systems or similar educational background preferred with 7-10 years applicable business intelligence work experience required\n<br>\nVerbal and written communication skills, problem solving skills, attention to detail and interpersonal skills\n<br>\nReport development experience with Business Intelligence tools such MicroStrategy and Tableau\n<br>\nAbility to work collaboratively with various levels of team members, business users and IT department resolve business and system issues in timely manner\n<br>\nCreative problem solver and critical thinker; able to bring a solution to bear without having to be asked. Combination of technical savviness and customer management skills\n<br>\nSolid practical experience with SQL and data analysis. Experience with Denodo is a plus. Experience with Data Governance is a plus\n<br>\nPlease apply directly with your updated resume or call\n<br>\nRahul Shribas at ************\n<br><br>\nAbout Akraya\n<br>\nAkraya, Inc. is an award-winning staffing firm that works with many of the leading, technology-based companies around the world. We have been ranked as one of the Best Staffing Firms to Temp for by Staffing Industry Analysts on multiple occasions and are a preferred staffing vendor within numerous staffing programs. Please visit ********** to search through all of our current openings or to submit your resume to our recruiting team."}