{"job title": "PROGRAM MANAGER AND DATA ANALYST, University Research", "company": "Boston University", "city state": "– BOSTON, US-MA", "rating": "4.1", "job description": "The Program Manager and Data Analyst is responsible for the creation and distribution of data analysis tools for research administration, research support offices, and interdisciplinary University-wide Centers/Institutes reporting to the Vice President and Associate Provost for Research to support measurement of success and decision making by key stakeholders and senior leadership (including Research Compliance, Sponsored Programs, Technology Development, Industry Engagement, PDPA, reporting Centers/Institutes). These offices are in various stages of developing metrics, analysis and reports. Compiles, creates and distributes both regularly scheduled monthly, quarterly, and annual reports of activity and routine operational metrics (as appropriate to each area) to ensure the research and senior leadership have timely and accurate information. Develop new reports and reporting instruments in response to ad-hoc requests or emerging needs. Analyze data to discover trends to drive operational improvement, where appropriate. Additionally, manage and coordinate the University's processes for limited grant submission and faculty awards/prizes for high priority federal and foundation funding and faculty award opportunities, as well as identify other key funding opportunities and organize appropriate faculty to submit proposals. Includes generating reports of faculty research and identifying faculty by research topics. Additionally, develop and disseminate surveys and collate responses. Other special projects as needed.<br><br>Required Skills<br><br>Strong written and verbal communication skills, Masters degree, and 3-5 years experience.\n<br><br>\nA cover letter is required.\n<br><br>\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. We are a VEVRAA Federal Contractor.<br><br>Required Experience\n<br><br>\nJob Location\n<br>\n<strong>BOSTON, US-MA</strong>\n<br>"}