{"job title": "Tableau Data Analyst", "company": "CSpring", "city state": "– Indianapolis, IN", "rating": "3.5", "job description": "CSpring is seeking a Tableau Data Analyst to join our team in Indianapolis, IN. At CSpring, you truly do make a difference. Be heard, work on challenging assignments, improve your community, and join a growing team that will both challenge you and value your contributions. When you join CSpring, you become part of our Ohana or extended family and our most valuable asset. You are NOT just another \"resource\" as is the case with many other consulting or staffing firms.\n<br><br>\nIf you possess the qualifications listed below, please apply for this position and a member of our recruiting team will contact you directly. Your information will remain confidential and you will never be submitted for a position without your approval.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Drive the definition of metrics across all areas / aspects of the agency.</li>\n<li>Develop sufficient knowledge in all data analytics technologies available within the client to provide expertise on the most effective methods to make data available and visible.</li>\n<li>Own action items and resulting projects coming out of the Data Strategy project.</li>\n<li>Develop a data governance team representing each unit within the agency to regularly review metric performance, collection, and distribution. This team's function will:</li>\n<li>Ensure consistency of message and impact.</li>\n<li>Ensure data is in the hands of the right people at the right time internally and externally.</li>\n<li>Work closely with the office of communications to ensure data is distributed to stakeholders, and considers the varying user groups.</li>\n<li>Build Data Dashboard that displays regular data outcomes on internal website banner.</li>\n<li>Assist with development and execution of testing activities of tableau other software development deliverables</li>\n<li>Build Data Dashboard that displays regular data outcomes on internal website banner</li>\n<li>Analyze data in Excel and determine how to use the data to calculate and display metrics</li>\n<li>Ability to, using SQL, pull data from large databases as needed using methodology as defined</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>Great communication skills with ability to work across various groups of people (project team, business partners within the agency, business partners outside the agency, etc.).</li>\n<li>Previous experience with large data projects is preferred.</li>\n<li>Provide technical guidance or support for the development or troubleshooting of systems.</li>\n<li>Evaluate existing systems to determine effectiveness and suggest changes to meet organizational requirements.</li>\n<li>Develop dashboards using various data visualization products.</li>\n</ul>\n\nCSpring offers a comprehensive compensation, training, and benefits package; including Paid Time Off, PPO and HSA Medical Insurance Options, Dental, Vision, STD, LTD, Life Insurance, and IRA Match. For more information about CSpring, please visit our website at<br><br>SDL2017"}