{"job title": "Computer Scientist", "company": "Department Of The Treasury", "city state": "– Atlanta, GA", "rating": "3.7", "job description": "<ul>\n<li>Videos</li>\n<li>Duties</li>\n</ul>\n\nHelpDuties Summary\n<br><br>\nWHAT IS THE INFORMATION TECHNOLOGY DIVISION? The mission of IRS Information Technology is to provide leadership in the delivery of information technology solutions that anticipate and meet enterprise-wide needs by empowering employees to deliver customer centered, value-creating systems, products, services, and support.\n<br><br>\nLearn more about this agency\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nWHAT DOES A COMPUTER SCIENTIST DO? As a Computer Scientist you perform in the role of a technical expert on the research, acquisition, design, development, maintenance and securing of information systems. In this role, you will lead projects to acquire major systems or to make extensive changes to existing systems, taking into account changing requirements and interfaces, technology advances and evolving Federal and industry standards. You will also be called upon to develop complex operational policies, standards, and guidance.\n<br><br>\n<strong>As a Computer Scientist, you will:</strong>\n\n\n<ul>\n<li>Develop complex Information Systems (IS) design and operations guidance documents and policies.</li>\n<li>Initiate, direct and conduct IS studies utilizing broad expertise across several engineering/information systems disciplines.</li>\n<li>Lead projects to design, acquire, and implement major prototype and developmental systems or to make extensive modifications and upgrades to existing systems.</li>\n<li>Initiate and develop models, operational studies and tests of comparability among a wide variety of information systems and IS component.</li>\n<li>Coordinate with IS architects, other systems developers, and functional areas within IRS to ensure information systems are properly integrated into the target architecture and transition plans.</li>\n<li>Provide advice and counsel to executive level managers on major IS technical issues.</li>\n</ul>\n\n<strong>WHERE CAN I FIND OUT MORE ABOUT OTHER IRS CAREERS?</strong>\n<br><br>\nIf you want to find out more about IRS careers, visit us on the web at http://www.treasury.gov/careers/Pages/resume_tips.aspx#Work_Experience\n<br><br>\nDHIRSJobs\n<br><br>\nTravel Required\n<br><br>\n25% or less - Travel may be required\n<br><br>\nSupervisory status\n<br><br>\nNo\n<br><br>\nPromotion Potential\n<br><br>\n<strong>14</strong>\n\n\n<ul>\n<li>Job family (Series)</li>\n</ul>\n\n1550 Computer Science\n<br><br>\nSimilar jobs\n\n\n<ul>\n<li>Computer And Information Research Scientists</li>\n<li>Computer Research Scientists</li>\n<li>Information Research Scientists</li>\n<li>Scientists, Computer Research</li>\n<li>Scientists, Information Research</li>\n<li>Requirements</li>\n</ul>\n\nHelpRequirements Conditions of Employment\n\n\n<ul>\n<li>Refer to other information.</li>\n<li>Click \"Print Preview\" to review the entire announcement before applying.</li>\n</ul>\n\n<strong>.</strong>\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nYou must meet the following requirements when your application is reviewed and/or by the closing date of this announcement:\n<br><br>\nBASIC REQUIREMENTS: (All grade levels)\n<br><br>\nYou must have a Bachelor's degree in computer science or bachelor's degree with 30 semester hours in a combination of mathematics, statistics, and computer science. At least 15 of the 30 semester hours must have included any combination of statistics and mathematics that included differential and integral calculus. All academic degrees and course work must be from accredited or pre-accredited institutions.\n<br><br>\nIn addition to meeting the basic requirements described above, you must meet the following:\n<br><br>\nGRADE 14: You must have one year of specialized experience at a level of difficulty and responsibility equivalent to the GS-13 grade level in the Federal service. Specialized experience for this position includes demonstrated professional competence in applying the theoretical foundations of computer science, including computer system architecture and system software organization, the representation and transformation of information structures, and the theoretical models for such representation and transformations; Specialized knowledge of the design characteristics, limitations, and potential applications of systems having the ability to transform information, and of broad areas of applications of computing which have common structures, processes, and techniques; and Knowledge of relevant mathematical and statistical sciences. Qualifying experience would include: working complex assignments in research, acquisition, design, development and maintenance of information systems, and leading projects to design, acquire, and implement major prototype and developmental systems or make extensive modifications and upgrades to existing systems, taking into account changing requirements and interfaces, advances in technology, and revolving standards.\n\n\n<ul>\n<li>The experience may have been gained in the public sector, private sector or Volunteer Service. One year of experience refers to full-time work; part-time work is considered on a prorated basis.</li>\n<li>To ensure full credit for your work experience, please indicate dates of employment by month/year, and indicate number of hours worked per week, on your resume.</li>\n</ul>\n\nEducation<br><br>SDL2017"}