{"job title": "Senior Director, Data Science", "company": "Hilton", "city state": "– McLean, VA", "rating": "4.0", "job description": "<strong>Job Description</strong><br><br>Employer is creating a best-in-class data and analytics department that will lead a connected ecosystem of data, technology, tools, techniques, people and processes. This innovative data and analytics function will drive advanced analytics and actionable insights to help drive Employers performance.\n<br><br>\nReporting to the Vice President of Data Science, you will be responsible for working closely with senior business leaders to strategize and prioritize a pipeline of signature data science projects.<br><br><strong>What will I be doing?</strong>\n\n<ul>\n <li>Directly accountable for analytics project ownership within the Center of Excellence (CoE)</li> <li>Leading the prioritization of the analytics signature projects portfolio</li> <li>Building rapport with business area leads to understand their business problems and analytical needs</li> <li>Identifying new analytics trends and opportunities to drive and improve the innovation agenda</li> <li>Collaborating with customers to connect model outputs with business implications, applicability and delivery of insights</li> <li>Identifying new internal and external data source opportunities to improve analytics insights</li> <li>Establishing requirements for analytic architecture to support delivery</li> <li>Leading advanced analytic models, demonstrating optimization, forecasting, multivariate regression and time series techniques</li> <li>Networking externally to seek innovation while developing and improving tools and techniques used to produce analytics insights</li> <li>Overseeing new insight demands with currently in process signature projects</li> <li>Enabling a connected CoE strategy and improving priorities in collaboration with the other CoE Leads</li>\n</ul>\n\n<strong>What are we looking for?</strong><br><br>To fulfill this role successfully, you must possess the following minimum qualifications and experience:\n<ul>\n <li>BA/BS Bachelors Degree in Statistics, Computer Science, Data Science, Engineering or Mathematics</li> <li>Seven (7) years of professional experience</li> <li>Five (5) years of experience in the digital and/or marketing field</li> <li>Three (3) years of Director level experience</li> <li>Previous experience leading large analytics teams</li> <li>Strong knowledge of data structures, systems, and BI tools related to big data</li>\n</ul>\nIt would be advantageous in this position for you to demonstrate the following capabilities and distinctions:\n<ul>\n <li>MA/MS Master's Degree in a related field</li> <li>Ten (10) years of related experience</li> <li>Five (5) years of Executive level expertise</li> <li>Computation and programming experience with Python, R, or SAS, SQL, Natural Language Processing and Support vector machines</li> <li>Machine Learning and Stats experience with Neural Networks and Deep Learning, Bayesian Statistics, Logistic Regression, Linear Regression, CHAID and decision tree</li>\n</ul>\n\n<strong>What will it be like to work for Employer?</strong><br><br>Employer is the leading global hospitality company, spanning the lodging sector from luxurious full-service hotels and resorts to extended-stay suites and mid-priced hotels. For nearly a century, Employer has offered business and leisure travelers the finest in accommodations, service, amenities and value. Employer is dedicated to continuing its tradition of providing exceptional guest experiences across its global brands. Our vision to fill the earth with the light and warmth of hospitality unites us as a team to create remarkable hospitality experiences around the world every day. And, our amazing Team Members are at the heart of it all!"}