{"job title": "Data Analyst", "company": "Iconma", "city state": "– Syracuse, New York", "rating": "3.4", "job description": "<strong>Description:</strong>\n\n\n<ul>\n<li>Analyze data and activities related to Contractor invoices to provide relevant and up to date information to support decision-making and the effective working of client.</li>\n<li>Manage the day to day relationship with contract or external service providers, including interpretation and application of established contractual agreements and/or service level agreements to ensure adherence to standards and best outcomes for client.</li>\n<li>Manage the day to day relationship with relevant internal parties or employees in order to understand their requirements, deliver appropriate, customized solutions and advice, and build cross-functional working in line with client policies and processes.</li>\n<li>Proactively research, produce, monitor and analyze cost, policy or other information to enable analysis of key themes and trends.</li>\n<li>Develop and maintain analytical systems, models and procedures in order to support design solutions and enhance time/consistency/safety/efficiency and operability.</li>\n<li>A Bachelor's degree in a related area and up to 5 years of related experience, or equivalent work experience.</li>\n<li>Proficient in relevant software e.g. Microsoft Office products (Excel, Word, PowerPoint).</li>\n<li>Knowledge of budgeting and operational planning.</li>\n<li>Analytical Thinking (3): Sees multiple relationships between different sources of data, identifying several likely causes or consequences of a situation</li>\n<li>Conceptual Thinking (2): Sees patterns or trends in data or situations, notices when something is similar to a past situation</li>\n<li>Analytical Thinking (3): After analyzing data, has ability to see multiple relationships, identifying several likely causes or consequences of a situation</li>\n<li>Information Seeking (3): Establishes the facts by digging deeper, asking probing questions and challenging initial responses from different sources</li>\n</ul>"}