{"job title": "Sr. Research Data Analyst", "company": "Johns Hopkins University", "city state": "– ", "rating": "4.1", "job description": "<p> <b> Specific duties &amp; responsibilities:</b> </p> <li> Generate project presentations</li> <li> Perform data analysis and data management</li> <li> Generate data outputs and deliverables</li> <li> Assist in writing manuscripts for publication</li> <li> Interact with the larger International Vaccine Access Center team on progress towards goals and realign team members and priorities to meet goals</li> <p> <b> Minimum qualifications:</b> </p> <li> MHS, MPH or Masters degree in biostatistics, epidemiology or related field with 1 year of related experience</li> <li> Project management skills and ability to work in a project milestone framework.</li> <li> Data management and analytic skills, including experience with computer software packages</li> <p> <b> Preferred qualifications:</b> </p> <li> 5 years experience</li> <li> Highly organized and deadline-oriented</li> <li> Self-directed and self-motivated</li> <li> Ability to communicate and ask for assistance as needed</li> <li> Excellent oral and written communication and mature interpersonal skills.</li> <li> Experience with systematic reviews and literature database software preferred.</li> <li> Ability to work successfully in a small team environment.</li> <p> The successful candidate(s) for this position will be subject to a pre-employment background check.</p> <p> If you are interested in applying for employment with The Johns Hopkins University and require special assistance or accommodation during any part of the pre-employment process, please contact the HR Business Services Office at jhurecruitment@jhu.edu. For TTY users, call via Maryland Relay or dial 711.</p> <p> <b> The following additional provisions may apply depending on which campus you will work. Your recruiter will advise accordingly.</b> </p> <p> During the Influenza (\"the flu\") season, as a condition of employment, The Johns Hopkins Institutions require all employees who provide ongoing services to patients or work in patient care or clinical care areas to have an annual influenza vaccination or possess an approved medical or religious exception. Failure to meet this requirement may result in termination of employment.</p> <p> The pre-employment physical for positions in clinical areas, laboratories, working with research subjects, or involving community contact requires documentation of immune status against Rubella (German measles), Rubeola (Measles), Mumps, Varicella (chickenpox), Hepatitis B and documentation of having received the Tdap (Tetanus, diphtheria, pertussis) vaccination. This may include documentation of having two (2) MMR vaccines; two (2) Varicella vaccines; or antibody status to these diseases from laboratory testing. Blood tests for immunities to these diseases are ordinarily included in the pre-employment physical exam except for those employees who provide results of blood tests or immunization documentation from their own health care providers. Any vaccinations required for these diseases will be given at no cost in our Occupational Health office.</p>"}