{"job title": "DevOps Data Engineer", "company": "JPMorgan Chase&amp;Co.", "city state": "– Columbus, OH", "rating": "3.7", "job description": "Apply Now\n<br><br>\nDevOps Data Engineer\n<br><br>\nReq #: 180086260\n<br><br>\nLocation: Columbus, OH,US\n<br><br>\nJob Category: Technology\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nAs an experienced Software Engineer, your mission is to help lead our team of innovators and technologists toward creating next-level solutions that improve the way our business is run. Your deep knowledge of design, analytics, development, coding, testing and application programming will help your team raise their game, meeting your standards, as well as satisfying both business and functional requirements. Your expertise in various technology domains will be counted on to set strategic direction and solve complex and mission critical problems, internally and externally. Your quest to embracing leading-edge technologies and methodologies inspires your team to follow suit. And best of all, you'll be able to harness massive amounts of brainpower through our global network of technologists from around the world.\n<br><br>\nRecognized as an expert in agile, lean and DevOps. Experienced in data management and DevOps related technology, including ETL tools, Hadoop, Spark, Java, Continuous Integration / Continuous Delivery technology solutions, and test automation solutions. The individual filling this role will be able to develop DevOps solution frameworks for data management applications, provide subject matter expertise in creating education and learning material for Agile / DevOps teams, as well as coach Agile / DevOps teams to adopt associated practices.\n<br><br>\nThis role requires a wide variety of strengths and capabilities, including:\n\n\n<ul>\n<li>Team member of Scrum Team dedicated to coding DevOps solutions such as integrating AbInitio ETL tool with CI/CD tool chain</li>\n<li>Provide subject matter expertise in support of developing learning material for agile teams related to DevOps solutions, such as CBTs, videos and FAQs</li>\n<li>Coach engineers on Agile / DevOps practices related to adoption of DevOps, such as test automation / TDD / ATDD, effective code management practices that support CI pipeline, and application telemetry appropriate for data management solutions.</li>\n<li>Strong engineering skills across data management technology and DevOps toolchain</li>\n<li>High technical learning aptitude</li>\n<li>Coaching&amp;Development skills</li>\n<li>Strong communication skills</li>\n<li>Willingness to learn and adapt</li>\n<li>Collaborative style</li>\n<li>Continuous improvement mindset and problem solving skills</li>\n<li>Influencing ability</li>\n</ul>\n\nOur Consumer&amp;Community Banking Group depends on innovators like you to serve nearly 66 million consumers and over 4 million small businesses, municipalities and non-profits. You'll support the delivery of award winning tools and services that cover everything from personal and small business banking as well as lending, mortgages, credit cards, payments, auto finance and investment advice. This group is also focused on developing and delivering cutting edged mobile applications, digital experiences and next generation banking technology solutions to better serve our clients and customers.\n<br><br>\nChase&amp;Company, you're not just working at a global financial institution. You're an integral part of one of the world's biggest tech companies. In 14 technology hubs worldwide, our team of 40,000 technologists design, build and deploy everything from enterprise technology initiatives to big data and mobile solutions, as well as innovations in electronic payments, cybersecurity, machine learning, and cloud development. Our $9.5B+ annual investment in technology enables us to hire people to create innovative solutions that will not only transform the financial services industry, but also change the world.\n<br><br>\nAt JPMorgan Chase&amp;Company we value the unique skills of every employee, and we're building a technology organization that thrives on diversity. We encourage professional growth and career development, and offer competitive benefits and compensation. If you're looking to build your career as part of a global technology team tackling big challenges that impact the lives of people and companies around the world, we want to meet you."}