{"job title": "Senior Associate, Federal Data Engineer", "company": "KPMG", "city state": "– Washington, DC", "rating": "3.8", "job description": "Known for being a great place to work and build a career, KPMG provides audit, tax and advisory services for organizations in today's most important industries. Our growth is driven by delivering real results for our clients. It's also enabled by our culture, which encourages individual development, embraces an inclusive environment, rewards innovative excellence and supports our communities. With qualities like those, it's no wonder we're consistently ranked among the best companies to work for by Fortune Magazine, Consulting Magazine, Working Mother Magazine, Diversity Inc. and others. If you're as passionate about your future as we are, join our team.\n<br><br>\nKPMG is currently seeking a Senior Associate to join our Federal Advisory practice.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Lead system design efforts for various client projects: Multi-faceted role includes architecture, design, and development</li>\n<li>Develop logical and physical data models for systems being implemented that include a variety of technologies such as web, service-oriented architecture, integration/middleware, and legacy system mainframes</li>\n<li>Develop data strategies for ETL, MDM, Data Warehousing, Data Governance and Security</li>\n<li>Define and document standards, frameworks and reference architectures</li>\n<li>Evaluate technologies and relevant fit in established and/or new design patterns</li>\n<li>Prototype/POC development to enable client specific an general go-to market solutions</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>A minimum of three years' experience across Agile and/or SAFe SDLC environment with a focus on data architecture, data modeling, system design, development, and implementation</li>\n<li>Hands-on data modeling, batch and stream processing experience</li>\n<li>Experience with open source platforms and technologies such as: Cassandra, CouchDB, Hadoop, HBase, Hive, Kafka, MongoDB, Neo4J, NiFi, Pig, Spark</li>\n<li>Understanding of cloud technologies - AWS: EMR, Athena, Redshift, Kinesis, Glue. AZURE: HDInsight, ADLS, Data Lake Analytics, Event Hubs, SQL Data Warehouse. GCP: BigQuery, BigTable, Dataflow, DataProc</li>\n<li>U.S. citizenship required and an active U.S. Federal government TS/SCI security clearance</li>\n</ul>\n\nKPMG LLP (the U.S. member firm of KPMG International) offers a comprehensive compensation and benefits package. KPMG is an equal opportunity employer. All qualified applicants are considered for employment without regard to race, color, creed, religion, age, sex/gender, national origin, ancestry, citizenship status, marital status, sexual orientation, gender identity or expression, disability, physical or mental handicap unrelated to ability, pregnancy, veteran status, unfavorable discharge from military service or military status, genetic information, genetic disposition and or carrier status, domestic violence status, personal appearance, family responsibility, matriculation or political affiliation, status with regard to public assistance, or other legally protected status. KPMG maintains a drug-free workplace. KPMG will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of applicable local, state or federal law (including San Francisco Ordinance number 131192). No phone calls or agencies please.<br><br>SDL2017"}