{"job title": "Business Intelligence Analyst", "company": "Latham&amp;Watkins LLP", "city state": "– Los Angeles, CA", "rating": "4.0", "job description": "Latham&amp;Watkins, a global law firm consistently ranked among the top firms in the world, is currently seeking a Business Intelligence Analyst to join our winning team, located in our Global Services Office in downtown Los Angeles. The success of our firm is largely determined by our commitment to hire and develop the very best and brightest, creating a team that provides our clients with the highest quality of work and service. We are driven by our core values: respect, innovation and collaboration.\n<br><br>\nThe Business Intelligence Analyst will receive a generous total compensation package. Bonuses are awarded in recognition of individual and firm performance. Eligible employees can participate in Latham's comprehensive benefit program including healthcare, life and disability insurance, flexible spending accounts, a 401k plan, and more! In addition, employees receive 10 paid holidays per year, and a PTO program that accrues 23 days during the first year of employment and grows with tenure.\n<br><br>\nAs a Business Intelligence Analyst at Latham, you will be responsible for developing, researching and implementing data analysis projects including but not limited to data reporting, data visualizations, and ad-hoc research projects. You will work closely with the Technology Development management team on planning, design, installation, configuration and maintenance of said systems. The Business Intelligence Analyst will be responsible for ensuring that our data systems are engineered for greater flexibility and reuse. You will work with various department to ensure that their future data needs are met with our current and future designs while accomplishing these and other critical functions:\n\n\n<ul>\n<li>Working with Firm Management to further Enterprise Analytics and Business Intelligence reporting and visualization capabilities.</li>\n<li>Administering the Business Objects reporting environments including server side administration and user / security administration through CMC and design universes/reports</li>\n<li>Working with Senior Management on research projects to design, develop and deploy new universes / reports.</li>\n<li>Analyzing and verifying internal consistency, completeness and accuracy of data systems and makes required adjustments.</li>\n<li>Actnig as a resource to the firm on various data related questions for staff and other users. Responding to user questions and issues in a timely manner and assists with solutions.</li>\n<li>Working with vendors in order to resolve complex issues.</li>\n<li>Staying abreast of current and new development processes, tools, technologies, and market trends as they relate to systems development and implementation in support of the legal industry.</li>\n<li>Working with various firm department and practice group attorney leadership or designees to provide guidance and support for development projects as they relate to more specific areas in the practice of Law at the Firm.</li>\n</ul>\n\nAs a Business Intelligence Analyst, you will be expected to apply your organizational and communication skills while displaying a positive, high-energy attitude. The successful Business Intelligence Analyst must have strong administration experience with SAP Business Objects, including installing, upgrading, troubleshooting, and auditing the environment; strong skills in Business Objects universe and report development; strong SQL skills, including data profiling skills to identify and understand anomalies; the ability to comprehend and accurately perform advanced data analysis and communicate data findings. Experience with Tableau or other data visualization tools is preferred, along with experience with R, Python, NoSQL technologies such as Hadoop, Cassandra, Apache Storm, MongoDB andBasho a plus.\n<br><br>\nA Bachelor's degree in Computer Science, Data Science, Math, Economics or a related field is preferred. Four (4) years of experience with Business Objects, (Server Administration, CMC, Universe Designer, Web Intelligence) and experience with data analysis and working with users is required, along with one (1) to two (2) years' experience with data visualization, Tableau preferred.\n<br><br>\nQualified candidates are encouraged to apply by clicking the 'Apply Now' link.\n<br><br>\nLatham&amp;Watkins is an Equal Opportunity Employer. Our commitment to diversity, equal opportunity and sustainability enables Latham&amp;Watkins to draw from a remarkable wealth of talent to create one of the world's leading law firms.\n<br><br>\nLatham&amp;Watkins LLP will consider qualified applicants with criminal histories in a manner consistent with the City of Los Angeles Fair Chance Ordinance.\n<br><br>\nFor information regarding family care and medical leave (CFRA), click here."}