{"job title": "Senior Data Engineer", "company": "Marriott", "city state": "– Bethesda, MD", "rating": "3.8", "job description": "<ul>\n<li>*Job Number** 180014P4</li>\n<li>*Job Category** Information Technology</li>\n<li>*Location** Marriott International HQ, Bethesda, Maryland VIEW ON MAP</li>\n<li>*Brand** Corporate</li>\n<li>*Schedule** Full-time</li>\n<li>*Relocation?** No</li>\n<li>*Position Type** Management</li>\n<li>*Start Your Journey With Us**</li>\n</ul>\n\nMarriott International is the world?s largest hotel company, with more brands, more hotels and more opportunities for associates to grow and succeed. We believe a great career is a journey of discovery and exploration. So, we ask, where will your journey take you?\n\n\n<ul>\n<li>*JOB SUMMARY**</li>\n</ul>\n\nThis Software Engineer will enable and create solutions using advanced computational techniques for business solutions to data-intensive problems in the hospitality industry. This rewarding position provides a career on a team of mathematical modelers that makes a direct revenue impact on Marriott hotels, globally, by creating tools that facilitate data-driven decision making in the disciplines of pricing, revenue management, sales and reservations. This software engineer will be part of a team that supports computationally-intensive data analysis and modeling efforts, provides analytics and technical expertise; performs undirected research on large volumes of data to reach business conclusions and recommendations; contributes complex programming and analysis in revenue management and sales systems; analyzes data and builds innovative models to deliver business solutions; functions as a subject matter expert in all phases of the project lifecycle ? inception, prototyping, design, testing, rollout and support. The Operations Research team seeks a flexible candidate with an interest in software development and a willingness to learn that brings unique perspectives to enable creative data-driven solutions to the challenges at Marriott.\n\n\n<ul>\n<li>*CANDIDATE PROFILE**</li>\n<li>*Education and Experience**</li>\n<li>*Required:**</li>\n</ul>\n\n+ Graduate degree in a rigorous quantitative, technical or scientific subject, including Computer Science / Engineering, Data Science / Engineering, Mathematics, Operations Research, Statistics or Engineering\n<br><br>\n+ 1-2 years? industry or research experience; applying analytical and programming skills against data-intensive and complex modeling or systems development\n<br><br>\n+ 3 years? experience in software development, with extensive knowledge and experience in one of the following languages: Spark, Scala, Python (pandas / Numpy / SciPy), Java or C/C++, SQL at an advanced level with an understanding of complexity theory\n<br><br>\n+ Software engineering skills (e.g. distributed computing, object-oriented development, data cleansing, algorithms and data structures)\n<br><br>\n+ Experience working with data platforms, either structured (Oracle/DB2/Postgres) and unstructured (Couchbase/Cassandra/MongoDB/redis)\n<br><br>\n+ Experience with designing or supporting analytical systems, focusing on model quality and code efficiency\n<br><br>\n+ An inherent curiosity in researching and developing solutions to complex and often open-ended business problems with an interest in continually learning new techniques and technologies to solve modeling challenges\n<br><br>\n+ Ability to work within a team with strong communication skills, including an ability to explain and present technical concepts to technical and non-technical audiences\n\n\n<ul>\n<li>*Preferred:**</li>\n</ul>\n\n+ Experience performing predictive modeling, forecasting, or statistical analysis on large scale datasets.\n<br><br>\n+ Experience with Big Data platforms (i.e. Hadoop)\n<br><br>\n+ Experience with Machine learning tools and techniques (e.g. k-nearest neighbors, random forests, ensemble methods, etc.)\n<br><br>\n+ Experience in developing analytic driven solutions to business problems\n<br><br>\n+ Understands complex, discrete data sets with subtle underlying biases\n<br><br>\n+ SAS programming (including SAS/HPF, SAS/ETS, and macros).\n<br><br>\n+ Readiness to debug existing codes to identify source of reported application issues\n\n\n<ul>\n<li>*CORE WORK ACTIVITIES**</li>\n<li>*Technical Leadership**</li>\n</ul>\n\n+ Trains and/or mentors other team members, and peers as appropriate\n<br><br>\n+ Provides leadership on solution structure, tasks, timeline and estimates for revenue management deliverables\n<br><br>\n+ Partners with planning teams to articulate possible solutions to business problems and to develop requirements for new models\n\n\n<ul>\n<li>*Delivering Technology**</li>\n</ul>\n\n+ Formulates methods for measuring the effectiveness of pricing and revenue management activities.\n<br><br>\n+ Prepares detailed specifications for translation of complex business processes into models and prototypes\n<br><br>\n+ Develops and implements efficient, scalable algorithms using appropriate technologies/software/architectures\n<br><br>\n+ Writes software and utility software tools to create and test new models\n<br><br>\n+ Assists the Application Delivery teams in support of operations\n<br><br>\n+ Assists the Application Delivery team in the maintenance of existing models\n<br><br>\n+ Provides work/cost estimates for client requests\n<br><br>\n+ Prepares documentation for client review.\n<br><br>\n+ Conducts reviews, discusses findings, risks and challenges and establishes courses of action\n\n\n<ul>\n<li>*IT Governance**</li>\n</ul>\n\n+ Follows all defined IT standards and processes and provides input for improvements to the appropriate process owners as needed\n<br><br>\n+ Maintains a proper balance between business and operational risk\n<br><br>\n+ Follows the defined project management standards and processes\n\n\n<ul>\n<li>*Service Provider Management**</li>\n</ul>\n\nTo the extent that this role interacts with service providers:\n<br><br>\n+ Validates that Service Providers develop and manage respective aspects of a project plan, including schedules, deliverables, and appropriate metrics.\n<br><br>\n+ Makes short term plans for the team to effectively utilize resources\n<br><br>\n+ Monitors Service Provider outcomes\n<br><br>\n+ Reviews estimates of work effort for client project provided by Service Providers for accuracy\n<br><br>\n+ Facilitates timely resolution of service delivery problems and minimizes the impact to clients\n\n\n<ul>\n<li>*MANAGEMENT COMPETENCIES**</li>\n<li>*Leadership**</li>\n</ul>\n\n+ **Communication** - Conveys information and ideas to others in a convincing and engaging manner through a variety of methods.\n<br><br>\n+ **Leading Through Vision and Values** - Keeps the organization's vision and values at the forefront of employee decision making and action.\n<br><br>\n+ **Managing Change** - Initiates and/or manages the change process and energizes it on an ongoing basis, taking steps to remove barriers or accelerate its pace; serves as role model for how to handle change by maintaining composure and performance level under pressure or when experiencing challenges.\n<br><br>\n+ **Problem Solving and Decision Making** - Identifies and understands issues, problems, and opportunities; obtains and compares information from different sources to draw conclusions, develops and evaluates alternatives and solutions, solves problems, and chooses a course of action.\n<br><br>\n+ **Professional Demeanor** - Exhibits behavioral styles that convey confidence and command respect from others; makes a good first impression and represents the company in alignment with its values.\n<br><br>\n+ **Strategy Development** - Develops business plans by exploring and systematically evaluating opportunities with the greatest potential for producing positive results; ensures successful preparation and execution of business plans through effective planning, organizing, and on-going evaluation processes.\n\n\n<ul>\n<li>*Managing Execution**</li>\n</ul>\n\n+ **Building a Successful Team** - Uses an effective interpersonal style to build a cohesive team; inspires and sustains team cohesion and engagement by focusing the team on its mission and importance to the organization.\n<br><br>\n+ **Strategy Execution** ? Ensures successful execution across of business plans designed to maximize customer satisfaction, profitability, and market share through effective planning, organizing, and on-going evaluation processes.\n<br><br>\n+ **Driving for Results** - Sets high standards of performance for self and/or others; assumes responsibility for work objectives; initiates, focuses, and monitors the efforts of self and/or others toward the accomplishment goals; proactively takes action and goes beyond what is required.\n\n\n<ul>\n<li>*Building Relationships**</li>\n</ul>\n\n+ **Customer Relationships** - Develops and sustains relationships based on an understanding of customer/stakeholder needs and actions consistent with the company?s service standards.\n<br><br>\n+ Global Mindset - Supports employees and business partners with diverse styles, abilities, motivations, and/or cultural perspectives; utilizes differences to drive innovation, engagement and enhance business results; and ensures employees are given the opportunity to contribute to their full potential.\n<br><br>\n+ **Strategic Partnerships** - Develops collaborative relationships with fellow employees and business partners by making them feel valued, appreciated, and included; explores partnership opportunities with other people in and outside the organization; influences and leverages corporate and continental shared services and/or discipline leaders (e.g., HR, Sales &amp; Marketing, Finance, Revenue Management) to achieve objectives; maintains effective external relations with government, business and industry in respective countries; performs effectively as a liaison between locations, disciplines, and corporate to ensure needed resources are received and corporate strategies are understood and executed.\n\n\n<ul>\n<li>*Generating Talent and Organizational Capability**</li>\n</ul>\n\n+ **Developing Others** - Supports the development of other?s skills and capabilities so that they can fulfill current or future job/role responsibilities more effectively.\n<br><br>\n+ **Organizational Capability** - Evaluates and adapts the structure of assignments and work processes to best fit the needs and/or support the goals of an organizational unit.\n\n\n<ul>\n<li>*Learning and Applying Professional Expertise**</li>\n</ul>\n\n+ **Continuous Learning** - Actively identifies new areas for learning; regularly creates and takes advantage of learning opportunities; uses newly gained knowledge and skill on the job and learns through their application.\n<br><br>\n+ **Technical Acumen** - Understanding and utilizing professional skills and knowledge in a specific functional area to conduct and manage everyday business operations and generate innovative solutions to approach function-specific work challenges\n<br><br>\n+ **Technical Intelligence:** Knowledge and ability to define and apply appropriate technology to enhance business process\n<br><br>\n+ **Development Methodologies:** Knowledge of general stages of SDLC framework and the application tiers within the development space.\n<br><br>\n+ **Information Security:** Knowledge of the security considerations relevant within the development space, including industry best practices related to information security\n<br><br>\n+ **Business Acumen** - Understands and utilizes business information to manage everyday operations and generate innovative solutions to approach business and administrative challenges.\n<br><br>\n+ **Basic Competencies** - Fundamental competencies required for accomplishing basic work activities.\n<br><br>\n+ **Basic Computer Skills** - Using basic computer hardware and software (e.g., personal computers, word processing software, Internet browsers, etc.).\n<br><br>\n+ **Mathematical Reasoning** - The ability to add, subtract, multiply, or divide quickly, correctly, and in a way that allows one to solve work-related issues.\n<br><br>\n+ **Oral Comprehension** - The ability to listen to and understand information and ideas presented through spoken words and sentences.\n<br><br>\n+ **Reading Comprehension** - Understanding written sentences and paragraphs in work related documents.\n<br><br>\n+ **Writing** - Communicating effectively in writing as appropriate for the needs of the audience.\n<br><br>\n_Marriott International is an equal opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture. Marriott International does not discriminate on the basis of disability, veteran status or any other basis protected under federal, state or local laws._"}