{"job title": "Vice President, Data Science Partner - Digital &amp; Distribution", "company": "Marriott", "city state": "– Bethesda, MD", "rating": "3.8", "job description": "<ul>\n<li>*Job Number** 18001PRX</li>\n<li>*Job Category** Sales and Marketing</li>\n<li>*Location** Marriott International HQ, Bethesda, Maryland VIEW ON MAP</li>\n<li>*Brand** Corporate</li>\n<li>*Schedule** Full-time</li>\n<li>*Relocation?** Yes</li>\n<li>*Position Type** Management</li>\n<li>*Start Your Journey With Us**</li>\n</ul>\n\nMarriott International is the world?s largest hotel company, with more brands, more hotels and more opportunities for associates to grow and succeed. We believe a great career is a journey of discovery and exploration. So, we ask, where will your journey take you?\n<br><br>\nThe Vice President Data Science Partner plays an integral role leading a team of analytics experts charged with driving data driven insights for Marriott. The Data Science Partner will also evangelize data driven culture with key business stakeholders within the organization. The Data Science Partner role is uniquely positioned to take in business needs and requirements, translate those to analyses for the team to deliver, and then provide proper context and insight for key business stakeholders to drive action and generate value. Marriott is seeking talent with a strong passion for translating Big Data to real customer value and to help shape Data Science and analytics practice at Marriott.\n\n\n<ul>\n<li>*CANDIDATE PROFILE**</li>\n<li>*EDUCATION AND EXPERIENCE PREFERRED**</li>\n</ul>\n\n+ Bachelor?s degree required; advanced degree in data science, mathematics, statistics, or any quantitative field preferred.\n<br><br>\n+ Twelve or more years of work experience in Analytics and Data Science, or a related discipline, demonstrating progressive career growth and a pattern of exceptional performance.\n<br><br>\n+ Experience leading analytics and reporting teams with a spectrum of skills all the way from data visualization, exploratory analysis and advanced statistical models\n<br><br>\n+ Diverse and up-to-date experience using data science methodologies and technologies to generate practical business solutions.\n\n\n<ul>\n<li>*KEY SKILLS**</li>\n</ul>\n\n+ Exceptional skill in problem solving and leveraging resources to optimize capabilities\n<br><br>\n+ Ability to influence change and develop strong interpersonal relationships with team members, and key stakeholders to serve as a true thought partner\n<br><br>\n+ Ability to work across data and analytics to triage and holistically prioritize requests across all data domains\n<br><br>\n+ Track record of leading teams as well as keeping associates engaged, curious and learning\n<br><br>\n+ Proven ability to lead cross functional teams in support of specific business priorities\n<br><br>\n+ Skill and experience distilling massive data sets and translating findings into innovative, profitable, executable, and operationally feasible solutions\n<br><br>\n+ Experience leading projects to deliver against major initiatives in a highly matrixed and relationship-based organization\n<br><br>\n+ Experience presenting analysis and recommendations to senior level executives, with a demonstrated track record of generating insight through analysis and presenting the information in a manner which impacts key strategy or investment decisions\n<br><br>\n+ Team player that works well with counterparts from various functions/departments and has the ability to influence the work of counterparts without direct reporting accountability (Strong ability to manage multiple stakeholders)\n<br><br>\n+ Demonstrated experience in Digital &amp; Channel Analytics with extensive experience in AB Testing and Optimization\n<br><br>\nTools knowledge you need\n<br><br>\n+ SQL, R, Python\n<br><br>\n+ Hive, Spark\n<br><br>\n+ Tableau, R Shiny, D3\n<br><br>\n+ Git, Jira\n\n\n<ul>\n<li>*CORE WORK ACTIVITIES**</li>\n<li>*Collaborate with key leaders of areas critical to the development of transformative customer experiences**</li>\n</ul>\n\n+ Establish a network of internal partners to gain cross-functional leadership perspectives.\n<br><br>\n+ Establish a trusting relationship with key business stakeholders such as but not limited to Brand, Marketing, Digital, IT, Operations, and Global Design.\n<br><br>\n+ Effectively capture business requirements, questions, problems, and needs from business stakeholders to help drive analytically based insights and solutions.\n<br><br>\n+ Serve as a trusted thought partner to provide insight and context to analysis and reports provided to ensure effective use in strategy creation and measurement.\n<br><br>\n+ Seamless end to end process Transparency **Facilitate new initiative intake and prioritization**\n<br><br>\n+ Serve as the single point of contact for new data and or analytics requests from assigned business stakeholder groups.\n<br><br>\n+ Provide accurate assessments of level of effort of work to be undertaken by the team of business and data analysts on the team.\n<br><br>\n+ Coordinate with business stakeholders and peers to establish prioritization of key initiatives. **Lead a team of analysts to develop business insights**\n<br><br>\n+ Ensure all stakeholder requirements have been effectively captured and shared with team to maximize value output\n<br><br>\n+ Partner with team leads and other analysts on the team to create approach and plan for analytical projects taken on by the team.\n<br><br>\n+ Provide coaching, guidance, and technical advice to teams during solution build out.\n<br><br>\n+ Serve as a sounding board during solution development. **Elevate the use of data &amp; analytics within Marriott**\n<br><br>\n+ Champion the use of state of the art data science and analytical techniques for solution creation within the team and to external business stakeholders.\n<br><br>\n+ Ensure high quality output by the team.\n<br><br>\n+ Communicate results with the appropriate context and explanation to ensure work is actionable and valued.\n\n\n<ul>\n<li>*Steward excellence in talent management and organizational capability**</li>\n</ul>\n\n+ Hire, retain, and continually develop diverse, high caliber talent that makes a strong, positive impact on the organization.\n<br><br>\n+ Setting and maintaining high standards for team and individual performance.\n<br><br>\n+ Develop effective organization structures and operational processes\n<br><br>\n+ Providing timely coaching and feedback.\n<br><br>\n+ Making and rewarding distinctions in performance.\n<br><br>\n_Marriott International is an equal opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture. Marriott International does not discriminate on the basis of disability, veteran status or any other basis protected under federal, state or local laws._"}