{"job title": "2019 Summer IDP-Sales Data Analyst Intern (Carillon Tower Advisors) - Req", "company": "Raymond James", "city state": "– Saint Petersburg, FL", "rating": "3.8", "job description": "Description\n<br><br>\n<strong>Job Summary:</strong>\n<br><br>\nUnder management supervision, uses knowledge and skills obtained through education and experience to develop and implement sales data analytics, projects and initiatives. Serves as a liaison between Sales channel management and Technology organization by analyzing business issues that require CRM/technology enhancements and providing requirements. Demonstrates attention to detail and professional judgement when making judgements and recommendations based on the analysis of information.\n<br><br>\n<strong>Essential Duties and Responsibilities:</strong>\n\n\n<ul>\n<li>Understands the structure and general business needs of the organization and recommends data driven solutions that enable the business to achieve goals and improve processes.</li>\n<li>Creates business requirements documents for implementation of solutions.</li>\n<li>Assists in building out CRM user interface including form design. Is responsible for some of the creation and maintenance of system views, charts and dashboards.</li>\n<li>Creates segmentation frameworks to organize sales prospects and clients into groups for more precise and targeted marketing.</li>\n<li>Utilizes data mining and implements thoughtful segmentation rules to help meaningfully slice target audience.</li>\n<li>Partners with data analysts to collaborate with sales channel managers and marketing department to provide meaningful data for marketing campaign planning, execution and reporting documents.</li>\n<li>Develops analysis/reports on the effectiveness of sales and marketing campaigns.</li>\n<li>Manages deadlines and expectations for projects through regular communication.</li>\n<li>Performs other duties and responsibilities as assigned.</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\n<strong>Knowledge, Skills, and Abilities:</strong>\n<br><br>\n<strong>Knowledge of:</strong>\n\n\n<ul>\n<li>Business knowledge and industry trends with the ability to determine their potential impact upon various clients.</li>\n<li>Comfort learning basic SQL to support CRM reporting.</li>\n</ul>\n\n<strong>Skill in:</strong>\n\n\n<ul>\n<li>Organizational, planning and time management skills as well as a \"roll up the sleeves\" mentality.</li>\n<li>Strong written, oral communication and interpersonal skills.</li>\n</ul>\n\n<strong>Ability to:</strong>\n\n\n<ul>\n<li>Interact with management at all levels.</li>\n<li>Manage time and project work effectively and efficiently.</li>\n<li>Work in a client-focused and team-based environment.</li>\n<li>Be a creative thinker and have an entrepreneurial mindset.</li>\n<li>Work in a dynamic, growing environment.</li>\n<li>Able to proactively problem-solve; foresees and resolves challenges under pressure</li>\n<li>Able to identify areas of opportunity and recommend change</li>\n</ul>\n\n<strong>Educational/Previous Experience Requirements:</strong>\n\n\n<ul>\n<li>Junior or senior standing candidate pursuing Bachelor's or Master's Degree in a business or information systems field.</li>\n</ul>\n\n~or~\n\n\n<ul>\n<li>Any equivalent combination of experience, education and/or training approved by Human Resources.</li>\n</ul>\n\n<strong>Licenses/Certifications:</strong>\n\n\n<ul>\n<li>None required.<br><br>SDL2017</li>\n\n</ul>"}