{"job title": "Data Engineer I (Contract)", "company": "Techshed", "city state": "– Foster City, CA", "rating": "4.1", "job description": "Hybrid (noun) hy•brid \\hī-brd\\\n<br><br>\nSomething that is formed by combining two or more things.\n<br><br>\nWe believe that fewer words define Techshed more accurately than <em>hybrid</em>. A start-up environment powered by the stability of The Home Depot has helped us create a company populated by a team of talented players who work endlessly to solve real problems for real people, every single day. Our cutting-edge products are the result of lofty goals, deep research, healthy debates, boundless innovation, and most importantly, cross-functional collaboration. Everything we create, we create as a team.\n<br><br>\nIn fact, our team <em>is</em> our company; they bring passion to everything they do. They're friendly, outgoing, focused, and are some of the best and brightest that Silicon Valley has to offer. So come join the Techshed team and see what it's like to create real products that actually improve our customers' lives.\n<br><br>\n<strong>Our Perks</strong>\n\n<ul>\n\n\t<li>Shuttle Options</li>\n\n<li>Paid Clipper Pass</li>\n\n<li>Toll Reimbursement</li>\n\n<li>401K &amp; ESPP</li>\n\n<li>Medical, Vision, &amp; Dental</li>\n\n<li>Bicycle Friendly</li>\n\n<li>Free Lunch</li>\n\n<li>Tuition Reimbursement</li>\n\n<li>Gym Reimbursement</li>\n</ul>\n<strong>About Us</strong>\n<br><br>\nTechshed, a Home Depot company, creates and develops interactive, user-friendly products that help improve how homeowners find and connect with qualified home service professionals in their neighborhood. Our product offerings currently include Pro Referral, Service Connect, as well as The Home Depot's Home Services.\n<br><br>\n<strong>Job Duties and Responsibilities</strong>\n\n<ul>\n\n\t<li>(70%) Database Development: design and develop database stored procedures, triggers and functions</li>\n\n<li>(10%) Data Integration: design and implementation of data pipelines allowing for near real time data consumption</li>\n\n<li>(10%) Data Modeling: extend existing and create new data models as are required to support the various applications</li>\n\n<li>(5%) Creates self-documenting designs and/or clearly communicates intent via comments in code, on specifications, documentation and during code reviews.</li>\n\n<li>(5%) Writes unit and integration tests for each deliverable, fix bugs.</li>\n\n<li>Requires minimal support from senior engineers during development.</li>\n</ul>\n<strong>Minimum Qualification</strong>\n\n<ul>\n\n\t<li>Strong expertise with database technology (5+ years)</li>\n\n<li>Strong performance tuning skills</li>\n\n<li>Experience with PostgreSQL (9+) and MySQL (5.5+)</li>\n\n<li>Experience with columnar data stores such as Vertica, Redshift or Infobright</li>\n\n<li>An ability to write complex and efficient SQL statements and stored procedures</li>\n\n<li>2+ years production experience building batch data pipelines: data management, ETL processes, data mapping, data validation, testing, and documenting data definitions</li>\n\n<li>Working knowledge of at least one of the following: Python, Shell scripting</li>\n\n<li>Experience developing against 3rd party API</li>\n\n<li>Bachelor's Degree in CS/EE or equivalent experience</li>\n\n<li>Strong communication skills, enabling transparency and coordination across multiple business and service units</li>\n\n<li>Experience collaborating with distributed teams</li>\n\n<li>Experience with Git</li>\n</ul>\n<strong>Skills and Abilities Required</strong>\n\n<ul>\n\n\t<li>Strong expertise with database technology (RDBMS)</li>\n\n<li>Working knowledge of at least one of the following: Python, Shell scripting, Golang</li>\n</ul>\nKnowledge\n\n<ul>\n\n\t<li>RDBMS</li>\n\n<li>Software Engineering</li>\n</ul>\n<strong>Competencies</strong>\n\n<ul>\n\n\t<li>Data Modeling</li>\n\n<li>Understanding of Data Volume in a large enterprise and building scalable data pipelines.</li>\n</ul>"}