{"job title": "Machine Learning Engineer", "company": "TEKsystems, Inc", "city state": "– Herndon, Virginia", "rating": "3.4", "job description": "We are looking for an expert or up an coming professional in the Machine Learning, NLP and AI space who has a background in programming with Java. This team works with cutting edge technologies and is looking for a strong engineer to join their team for a long term contract.\n<br><br>\nProfessional software development experience including all phases of SDLC\n<br><br>\no Development experience using Java/JEE technologies\n<br><br>\no Development and Devops experience using AWS\n<br><br>\no Continuous Integration / Continuous Deployment (CI/CD)\n<br><br>\no Expertise in various flavors of Unix, specifically Linux\n<br><br>\no Strong SQL, PL/SQL skills in RDBMS, Oracle, SQLServer, AWS Aurora\n<br><br>\no Anticipate product development team needs for specialized tools and frameworks\n<br><br>\n<strong>Required experience must include:</strong>\n<br><br>\no 4-7+ years of professional software development experience\n<br><br>\no 4+ years of Java/JEE experience\n<br><br>\no 4+ years Continuous Integration / Continuous Deployment (CI/CD)\n<br><br>\no 2+ years of AWS Development/ Devops Experience\n<br><br>\no Strong AWS Development and DevOps Experience including\n<br><br>\no AWS CodeBuild, AWS CodeCommit, AWS CodePipeline\n<br><br>\no AWS Lambda\n<br><br>\no API Gateway\n<br><br>\no AWS CLI/Yaml/CloudFormation\n<br><br>\no Serverless Deployment\n<br><br>\n<strong>Must Have:</strong>\n<br><br>\no Excellent problem solving, analytical skills and technical troubleshooting skills\n<br><br>\no Strong verbal and written communication skills\n<br><br>\no Ability to work independently as well as part of a team\n<br><br>\no Hands-on experience with AI, Machine learning or NLP, mining of structured, semi-structured, and unstructured data\n<br><br>\n<strong>About TEKsystems:</strong>\n<br><br>\n<strong> We're partners in transformation. We help clients activate ideas and solutions to take advantage of a new world of opportunity. We are a team of 80,000 strong, working with over 6,000 clients, including 80% of the Fortune 500, across North America, Europe and Asia. As an industry leader in Full-Stack Technology Services, Talent Services, and real-world application, we work with progressive leaders to drive change. That's the power of true partnership. TEKsystems is an Allegis Group company.</strong>\n<br><br>\n<strong> The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.</strong>\n<br><br>\n<strong> If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please call 888 472-3411 or email accommodation@teksystems.com for other accommodation options.</strong>"}