{"job title": "Online Data Science Bootcamp Program Director", "company": "The Flatiron School", "city state": "– Remote, OR", "rating": "3.7", "job description": "The Flatiron School is seeking an Operations Associate, Career Coaching to join our rapidly growing team!\n<br><br>\nAt Flatiron School, we're changing education. For more than five years, we've been teaching amazing people how to code, and helping them find jobs.\n<br><br>\nThe Career Coaching team is responsible for ensuring our graduates have the support necessary to be successful in the job search process after graduation. Getting a job can be hard, so our Career Coaches support students every step of the way. Career Coaches counsel students one-on-one to set career goals and provide guidance in the process, and also educate students on important job search topics like networking and interviewing best practices. That's how we support the school's overall 97% job placement rate.\n<br><br>\nThe Operations Associate, Career Coaching will use his/her dedication to process improvement, attention to detail, and analytical skills to support a team of Career Coaches to ensure an excellent student experience, and achieve outstanding student outcomes. In order to ensure a consistent, high-quality student experience, the Career Coaching team follows a significant number of high-stakes, complex operational processes from data collection to student interventions. The Operations Associate has experience in, and enjoys, ensuring operational processes are executed with fidelity, while being nimble enough to accommodate non-standard scenarios.\n<br><br>\nThe team is growing quickly and the Operations Associate will be excited about building processes that will work well for our current size and scope as well as a future with many more coaches, campuses, and programs. As we scale, the Operations Associate will know when to plug a hole in our existing ship, and when to build a new ship altogether.\n<br><br>\n<strong>The Operations Associate, Career Coaching will:</strong>\n\n\n<ul>\n<li>Manage data collection and documentation procedures, ensuring the integrity of our outcomes reporting, and properly communicating student progress with a variety of stakeholders</li>\n<li>Maintain an error-free CRM of our graduates and placements data</li>\n<li>Create reports on performance and progress towards goals, including placement rates, time to placement, and student satisfaction</li>\n<li>Design processes that support coaches, and their students, in adhering to Career Services policies</li>\n<li>Execute processes that enable information exchange between systems</li>\n<li>Project-manage our twice-yearly outcomes reports, collaborating with internal and external stakeholders</li>\n<li>Monitor student compliance with the requirements for our Money-Back Guarantee</li>\n<li>Analyze data on financial performance and capacity planning, and make recommendations based on the analysis</li>\n<li>Work with our Product &amp; Engineering teams to determine requirements for software that can support the team's business rules and workflows</li>\n</ul>\n\nA successful Operations Associate, Career Coaching has/is:\n\n\n<ul>\n<li>2-4 years of work experience</li>\n<li>Strong fluency in Microsoft Excel, including experience cleaning and analyzing large data sets</li>\n<li>Experience with CRMs</li>\n<li>Process design and/or process-mapping experience</li>\n<li>Excellent organizational skills and attention to detail</li>\n<li>Ability to project manage cross-functionally</li>\n<li>Tenacious and flexible and can pursue the goal in front of them, pivoting quickly as needed</li>\n<li>Tactical and knows how to get things done quickly and efficiently</li>\n<li>Good judgment contextualizes decisions using frameworks, precedents, and goals, and determines the most appropriate path forward based on this information</li>\n<li>Bias for action analyzes what works and what doesn't and takes action based on findings</li>\n<li>A role model for Flatiron values: Be Scrappy, Make No Little Plans, Work Together, Radiate Positivity, Pursue Mastery<br><br>SDL2017</li>\n\n</ul>"}