{"job title": "Healthcare Data Analyst", "company": "Titus Regional Medical Center", "city state": "– ", "rating": "3.6", "job description": "<div><div><div><div><div><div>Titus Regional Medical Center · Accounting</div><div>Mount Pleasant, TX</div> </div><div><div>Professional/Technical</div><div>, M-F</div></div><div><div>Posted 07/03/2018</div><div>Req # 180262</div></div><div><div><div>\n<div>\nThe Healthcare Data Analyst will work with internal and external stakeholders to provide routine monthly reports and ad hoc analyses related to business and clinical initiatives and produce decision-support information. The analyst will assist leadership in identifying trends and areas for improvement for cost and quality at the health system, practice and provider level. This role requires working with multiple sources of healthcare data (ex: claims, financial, and clinical data) to meet both internal and external reporting requirements and support new initiatives. Projects range from simple programming and basic data manipulation/analysis to more advanced techniques. The Healthcare Data Analyst will report directly to the Director of Business Intelligence and Analytics. The analyst will conduct analyses using Crystal Reports, Business Objects, Excel and other visualization tools. The position will require solid communication skills to present findings provide updates, and assist in the planning and preparation for new initiatives. This role requires a familiarity with medical terminology, medical classification systems (ICD-10, DRG's, NDC or GPI Codes), relational databases, and dashboard presentations.</div><br>\n\n\t<div>\nBachelor’s degree in math, statistics computer science, information management, finance or economics preferred. Advanced education or certification in detailed analytics, statistical analysis and data programming preferred. 2+ years of experience in detailed analytics and reporting, preferably in healthcare</div></div>\n\t</div>\n</div></div></div></div></div>"}