{"job title": "Machine Learning Engineer - Core Consumer Product", "company": "Twitter", "city state": "– San Francisco, CA", "rating": "4.0", "job description": "Machine Learning Engineer - Core Consumer Product\n<br><br>\nSan Francisco, CA\n<br><br>\nTwitter's Consumer Product Teams are responsible for core features of twitter.com, which includes Timelines, Tweets, Search, Trends, Recommendations, Notifications, Tweet details/permalink, and more! Our code operates at massive scale and speed, serving billions of requests per day, connecting hundreds of millions of active Twitter users to real-time information about their lives and the world we live in.\n<br><br>\n<strong>Who We Are:</strong>\n<br><br>\nAt Twitter, our mission is to instantly connect users to the information most meaningful to them. Realizing this involves work in areas such as machine learning, applied data science, recommendation systems, information retrieval systems, naturallanguage processing, large graph analysis, spam, etc.\n<br><br>\nDo you want to make a huge impact while working with large data sets at a really big scale? If so, this might be a good fit for you! Consumer Product teams are hiring Machine Learning Engineers in the following areas:\n\n\n<ul>\n<li>Timelines Quality - Applying ranking, relevancy, and machine learning to the home timeline. Finding and choosing the best and most relevant Tweets to show to users.</li>\n<li>Recommendations - Combining real time relevance, richer timelines, and recommendations, to put the most interesting and relevant content in front of our users at all times.</li>\n<li>Onboarding - Enabling new users to discover the value of Twitter.</li>\n<li>Event Recommendations - Detecting the pulse of conversations on Twitter while surfacing the most relevant Events&amp;Topics to users, based on real-time engagement on the platform.</li>\n<li>Search Quality - responsible for all search on Twitter whether that's for tweets, users, news, or videos.</li>\n</ul>\n\n<strong>What You'll Do:</strong>\n\n\n<ul>\n<li>You'll apply machine learning and/or data science techniques to a variety of modeling and relevance problems involving users, their relationships, their tweets and their interests.</li>\n<li>You will participate in the engineering life-cycle at Twitter, including designing distributed systems, writing production code, conducting code reviews and working alongside our infrastructure and reliability teams.</li>\n<li>Although you will work on cutting-edge problems, this position is not a research position.</li>\n</ul>\n\n<strong>Who You Are:</strong>\n<br><br>\nYou have a passion for machine learning and improving the ways people consume the world, live. You're a relevance engineer, applied data scientist or machine-learning engineer who wants to work on exciting algorithmic and deep infrastructure issues. You're experienced solving large scale relevance problems and comfortable building brand new systems to enable future quality improvements.\n\n\n<ul>\n<li>Knowledgeable in one or more of the following: machine-learning, information retrieval, recommendation systems, social network analysis</li>\n<li>Designed and evaluated approaches for handling high-volume real-time data streams.</li>\n<li>A strong technical advocate with a background in Java, C++, or Scala, and Python.</li>\n<li>Comfortable conducting design and code reviews.</li>\n<li>Experienced in operating Linux-based systems.</li>\n<li>Knowledgeable of core CS concepts such as: common data structures and algorithms, profiling/optimization.</li>\n<li>Passionate about working with large unstructured and structured data sets ( for example multi-terabyte+, 100MM+ daily transaction volumes).</li>\n<li>Experienced in collaborating across multiple teams including analytics, product management, and operations.</li>\n</ul>\n\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>B.S., M.S. or Ph.D. in Computer Science or equivalent degree and work experience.</li>\n</ul>\n\nWe are committed to an inclusive and diverse Twitter. Twitter is an equal opportunity employer. We do not discriminate based on race, color, ethnicity, ancestry, national origin, religion, sex, gender, gender identity, gender expression, sexual orientation, age, disability, veteran status, genetic information, marital status or any legally protected status.\n<br><br>\nSan Francisco applicants: Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records."}