{"job title": "MEDICAL TECHNOLOGIST- MEDICAL LAB SCIENTIST, SRC CHEMISTRY LAB (PER DIEM)", "company": "Yale New Haven Health System", "city state": "– New Haven, CT", "rating": "3.5", "job description": "To be part of our organization, every employee should understand and share in the YNHHS Vision, support our Mission, and live our Values. These values—integrity, patient-centered, respect, accountability, and compassion—must guide what we do, as individuals and professionals, every day.\n<br><br>\nUnder the direction of the Core Laboratory Manager demonstrates ability to perform a wide variety of routine and some special technical procedures. Demonstrates good time management and organizational skills. Interprets data based on knowledge and experience. Evaluates, troubleshoots and solves routine problems. Participates in quality control, quality assurance, and equipment maintenance programs in the laboratory.\n<br><br>\nEEO/AA/Disability/Veteran\n<ul>\n<li>1. Technical Competency: demonstrates technical competency in the performance of routine and complex testing, quality control, component selection and component preparation.</li>\n\n<ul>\n<li>1.1 Determines acceptability of samples and enters patient information correctly into the computer system.Competency is evaluated through direct observation, and record review.</li>\n</ul>\n\n<li>2. Recordkeeping, Documentation, Computer Skills: Provides for accurate documentation and reporting of results to ensure quality of patient care by demonstrating good computer and recordkeeping skills.</li>\n\n<ul>\n<li>2.1 Clearly, legibly, and accurately completes any hand written record. Corrects handwriting mistakes according to standards.</li>\n</ul>\n\n<li>3. Independence/Initiative: Demonstrates independent thinking and action. Demonstrates ability to evaluate, troubleshoot, and problem solve.</li>\n\n<ul>\n<li>3.1 Recognizes situations that are inconsistent with policy/ procedure or quality patient care. Documents all occurrences on the Variance Report form and performs immediate corrective action as necessary. Makes recommendations for improvements that can be made as a result of the occurrence.</li>\n</ul>\n\n<li>4. Professionalism: Demonstrates professionalism at all times both in attitude and in approach to all work activities. Demonstrates a commitment to personal career growth in the field of Laboratory Medicine/ Blood Banking.</li>\n\n<ul>\n<li>4.1 Ensures continued expertise and knowledge by attaining a minimum of 5 continuing education points each year, as defined in the Laboratory Continuing Education SOP.</li></ul>\n</ul>\nEDUCATION\n<br><br>\nBachelor of Science Degree in Medical Technology or equivalent with MLS/ MT (ASCP) certification or equivalent or eligibility.\n<br><br>\nEXPERIENCE\n<br><br>\nOne (1) to two (2) years' experience in an accredited Clinical Laboratory preferred.\n<br><br>\nLICENSURE\n<br><br>\nMLS/MT (ASCP) certification or equivalent or eligibility\n<br><br>\nSPECIAL SKILLS\n<br><br>\nWorking knowledge of equipment, instrumentation, and materials used in a Clinical Laboratory. Efficiency in word processing applications, spreadsheet design/utilization, and use web based resources. Basic knowledge of laboratory information systems. Must possess excellent communication skills and ability to communicate in an effective and professional manner with hospital staff. Excellent customer service and interpersonal skills. The ability to work as a member of a team is essential.\n<br><br>\nPHYSICAL DEMAND\n<br><br>\nThis job does require some standing, walking and light lifting.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}