{"job title": "Sr. Process Scientist", "company": "Abbott Laboratories", "city state": "– North Chicago, IL", "rating": "3.6", "job description": "At Abbott, we're committed to helping people live their best possible life through the power of health. For more than 125 years, we've brought new products and technologies to the world -- in nutrition, diagnostics, medical devices and branded generic pharmaceuticals -- that create more possibilities for more people at all stages of life. Today, 99,000 of us are working to help people live not just longer, but better, in the more than 150 countries we serve.\n<br><br>\n<strong>JOB DESCRIPTION:</strong>\n<br><br>\n<strong>Summary:</strong>\n<br><br>\nWill lead and consult on multiple complex projects defined for process investigations; design changes; resolving production issues and improving product availability and profitability. Leads a cross functional team with the required product/process knowledge to assess impact and develop plan. Focus will be in protein purification with one or more of fermentation, cell culture or recombinant protein experience.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nResponsible for implementing and maintaining the effectiveness of the quality system.\n<br><br>\na. Quality/Safety: Demonstrate an understanding of the application of the Quality Policy through daily activities. Maintain vigilance to ensure adherence to the Quality Policy and system procedures by promptly reporting noncompliance issues to management.\n<br><br>\nSafety: Work in a safe and environmentally responsible manner.\n<br><br>\nb. Technical knowledge: Develop and apply operations and process knowledge to area of support. Use sound judgment; appropriate scientific methods and thorough data analysis. Accurately documents work\n<br><br>\nc. Planning/Project Management: Conceive; plan; design; execute; and document projects/activities efficiently and in conformance with applicable OPs.\n<br><br>\nd. Process and Patient Focus: Anticipates; identifies and resolves internal and external customer issues through understanding of production processes and its impact on process yield; product performance and clinical utility.\n<br><br>\ne. Communication/Leadership: Demonstrates effective verbal and written communication skills within and outside immediate area. Shares and enhances own knowledge by mentoring and training others.\n<br><br>\nf. Business Focus/Alignment: Demonstrates fiscal responsibility through actionable recommendations and accomplishments such as improving production process yields; decreasing production costs and maintaining product availability. Aligns resources with strategic business priorities.\n<br><br>\nMay perform other duties as assigned\n<br><br>\n<strong>Scope:</strong>\n<br><br>\na. Achieves team and individual performance goals. Generates and manages multiple project timelines and resources.\n<br><br>\nb. Mentors others in the areas of experimental design; production process analysis and improvement; technical writing skills for data analysis; investigation documentation and change control.\n<br><br>\nc. Proactively identifies opportunities to improve compliance with QSR / ISO requirements. Confronts issues; motivates and influences others; negotiates and manages crisis to attain desired results.\n<br><br>\nd. Listens actively; fosters information exchange; provides scientific and operational information effectively; establishes networks; and presents/defends positions.\n<br><br>\ne. Develops strong networks throughout the Division. Inspires others toward the achievement of team/project objectives. Operates with integrity and respect; actively resolves conflicts.\n<br><br>\nf. Participates in assessing and responding to internal and external changes. Recognizes and promotes acceptance of changes in internal/external environment. Makes timely scientific; operational; and business decisions; appropriately elevates high-risk decisions.\n<br><br>\n<strong>Requirements:</strong>\n<br><br>\nM.S. required in a scientific discipline (chemical engineering; chemistry; biology or biochemistry) plus 1-5 years' experience in a related field. Additional years of experience may offset degree requirements.\n<br><br>\n<strong>Experience:</strong>\n<br><br>\nPreferred: Expertise in the following disciplines at an industrial scale: protein purification with one or more of fermentation, cell culture or recombinant protein production. Demonstrated ability to apply operations knowledge in timely resolution of product / process technical issues. Experience with GMP. Experience with technical problem prevention / resolution. Experience with leading project teams and/or mentoring / teaching others. Knowledge of chemical process modeling and/or experimental design and/or statistical tools. Understanding change control impact on design / validation of products and/or processes. Experience in operations (manufacturing/quality). Experience with data management. Experience working in project teams for multiple complex projects. Experience with change control and/or investigation processes and/or laboratory skills. Experience with acquiring, analyzing and interpreting data from a variety of sources.\n<br><br>\nJOB FAMILY:Product Development\n<br><br>\nDIVISION:ADD Diagnostics\n<br><br>\nLOCATION:United States&gt;Abbott Park : AP08B Floor-3\n<br><br>\n<strong>ADDITIONAL LOCATIONS:</strong>\n<br><br>\nWORK SHIFT:Standard\n<br><br>\nTRAVEL:Yes, 5 % of the Time\n<br><br>\nMEDICAL SURVEILLANCE:No\n<br><br>\nSIGNIFICANT WORK ACTIVITIES:Continuous sitting for prolonged periods (more than 2 consecutive hours in an 8 hour day)\n<br><br>\nAbbott is an Equal Opportunity Employer of Minorities/Women/Individuals with Disabilities/Protected Veterans.\n<br><br>\nEEO is the Law link - English: http://webstorage.abbott.com/common/External/EEO_English.pdf\n<br><br>\nEEO is the Law link - Espanol: http://webstorage.abbott.com/common/External/EEO_Spanish.pdf"}