{"job title": "Bioinformatics Scientist I", "company": "Children's Hospital of Philadelphia", "city state": "– Philadelphia, PA", "rating": "4.0", "job description": "<strong>\"</strong>\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nReq ID: 21793\n<br><br>\nShift: Days\n<br><br>\nEmployment Status: AF - Active - Regular - Full Time\n<br><br>\nJob Summary\n<br><br>\nThe Tan research group (http://tanlab4generegulation.org) is interdisciplinary and highly collaborative, utilizing both computational and experimental approaches to study gene regulation in normal and disease development. We have pioneered multiple computational algorithms for regulatory genomics, epigenomics, and network biology. We are seeking an enthusiastic candidate for a Research Scientist position. Key areas of responsibilities include developing and maintaining interactive bioinformatics database, collecting and analyzing genomics datasets, bioinformatics data analysis, summarizing results and preparing reports, contributing to manuscripts/publications.\n<br><br>\nThe desired candidate should have a PhD in bioinformatics or related fields such as computer science and statistics. Strong statistical and computer programming (R, Perl/python, JavaScript, C/C++) skills are essential. Previous research and publications in bioinformatics is required.\n<br><br>\nJob Responsibilities\n<br><br>\nPre-Analysis (40%): Contributes to the maintenance and development of bioinformatics tool portfolio by developing knowledge of internally developed systems, open-source programs, and commercial applications. Provides efficient data management support.\n\n\n<ul>\n<li>Works with bioinformatics group members to develop functioning pipelines upstream of customized analysis workflows.</li>\n<li>Maintains pipelines by staying current with evolving algorithms and standards and incorporating into pipeline.</li>\n<li>Executes robust development testing for commonly used applications such as data processing pipelines.</li>\n<li>Optimizes performance of applications by working with scientific computing and information systems groups to optimize hardware/software parameters.</li>\n<li>Defines and prioritizes requirements for pipeline development over time to incorporate new technologies and platforms via functional communication with bioinformatics group members and bioinformatics end users.</li>\n<li>Identifies appropriate open-source and commercial products that serve needs of pipeline and/or customized analyses of end users.</li>\n<li>Implements and maintains commercial and open-source software for common bioinformatics and genomics data analysis.</li>\n<li>Implements, updates and maintains locally stored data resources required for various analysis tasks.</li>\n<li>Provides ad hoc support and one-on-one and group-based training on key bioinformatics software, features, and workflows.</li>\n<li>Provides efficient data management support including file transfers, data formatting and manipulation, and basic integration of data from a variety of experimental and reference resources.</li>\n<li>Develops and maintains working relationship with data providers such as sequencing cores within CHOP and infrastructure groups such as information systems.</li>\n<li>Continually keeps abreast of evolving data generation platform fundamentals, file-specific information representation, and strategic application of code base to optimize value of data.</li>\n<li>Maintains working knowledge of available commercial and openly accessible knowledge bases as they apply to bioinformatics analysis.</li>\n</ul>\n\nJob Responsibilities (Continued)\n<br><br>\nCoding (30%): Codes and generally supports both ad hoc, single task applications and larger pipeline applications that may combine multiple 3rd party and internally developed applications for genomics/proteomics/other complex data types and projects.\n\n\n<ul>\n<li>Implements, maintains, and regularly contributes to formal and bioinformatics group-centralized code management system.</li>\n<li>Adopts appropriate forking and other strategies for robust code development. Apply to general bioinformatics group code base.</li>\n<li>Adopts best practices for code development consistent with larger bioinformatics group. This includes choice of language based on the type of solution being developed, the likely life cycle and downstream usage of the resulting application, and integration with other systems.</li>\n<li>Ensures that all routinely used tools (e.g. those included in shared analysis pipelines) are versioned and managed through a source control system.</li>\n<li>Ensures that configuration files that provide parameters to algorithms and analysis software are versioned and managed through a source control system.</li>\n<li>Develops and implements automated data-driven testing processes that test reproducibility of results between versions of pipeline software.</li>\n<li>Develops and implements automated deployment processes that build and configure systems from source control repositories, eliminating the need to manually modify configuration files.</li>\n<li>Regularly documents code, troubleshoot, and provide training when necessary.</li>\n</ul>\n\nData Analysis (10%): Analyzes data of high complexity by applying sound statistical and commonly accepted bioinformatics methods to -omics data under supervision from mentors and peers.\n\n\n<ul>\n<li>Develops robust analysis plans under supervision.</li>\n<li>Incorporates QA/QC in analysis workflows.</li>\n<li>Delivers analytical endpoints such as feature identification, annotation, characterization, prioritization, etc.</li>\n<li>Reports results using, primarily, spreadsheets and, secondarily, abstracted materials such as slides and visuals.</li>\n</ul>\n\nCollaboration (10%): Works with both bioinformatics group members and end users/clients to understand specific needs in bioinformatics and end user-specific domains.\n\n\n<ul>\n<li>Attends group and team meetings and contributes primarily factual information regarding processes and approach.</li>\n<li>Defers to mentors and peers in establishing relationships, but works within boundaries to accomplish analytical goals.</li>\n</ul>\n\nAcademic Output (10%): Contributes to presentations, grants, and manuscripts under supervision by mentors and peers.\n<br><br>\nRequired Education and Experience\n<br><br>\nRequired Education: Bachelor's Degree in biological or computational discipline.\n<br><br>\nPreferred Education, Experience&amp;Cert/Lic\n<br><br>\nThe desired candidate should have a PhD in bioinformatics or related fields such as computer science and statistics. Strong statistical and computer programming (R, Perl/python, JavaScript, C/C++) skills are essential. Previous research and publications in bioinformatics is required.\n<br><br>\nAdditional Technical Requirements\n\n\n<ul>\n<li>Strong UNIX/LINUX expertise required.</li>\n<li>Experience with R strongly preferred.</li>\n<li>Experience with Python, Perl, or other languages preferred.</li>\n<li>Experience with pipeline or workflow development frameworks preferred.</li>\n<li>Experience with data management preferred.</li>\n<li>Familiarity with open source and commercial bioinformatics resources and software preferred.</li>\n<li>Experience with genomic data analysis preferred.</li>\n<li>Experience or knowledge of technologies commonly used in biological labs, such as PCR, cloning, electrophoresis gels, and cell culture preferred.</li>\n<li>Knowledge of the working mechanism of microarray, NGS, mass spectrometry, or other high-throughput technologies and awareness of their strengths and weaknesses, as well as applicability to a specific biological problem is preferred.</li>\n<li>Familiarity with resources of genomic data sets and analysis tools, such as UCSC Genome Browser, Bioconductor, ENCODE, and NCBI databases is preferred.</li>\n<li>Accountability and attention to timelines.</li>\n<li>Excellent organization and communication skills with an emphasis on strong presentation skills.</li>\n<li>Ability to work in a team environment.</li>\n</ul>\n\nAll CHOP employees who work in a patient building or who provide patient care are required to receive an annual influenza vaccine unless they are granted a medical or religious exemption.\n<br><br>\nChildren's Hospital of Philadelphia is committed to providing a safe and healthy environment for its patients, family members, visitors and employees. In an effort to achieve this goal, employment at Children's Hospital of Philadelphia, other than for positions with regularly scheduled hours in New Jersey, is contingent upon an attestation that the job applicant does not use tobacco products or nicotine in any form and a negative nicotine screen (the latter occurs after a job offer).\n<br><br>\nChildren's Hospital of Philadelphia is an equal opportunity employer. We do not discriminate on the basis of race, color, gender, gender identity, sexual orientation, age, religion, national or ethnic origin, disability or protected veteran status.\n<br><br>\nVEVRAA Federal Contractor/Seeking priority referrals for protected veterans. Please contact our hiring official with any referrals or questions.\n<br><br>\nCHOP Careers Contact\n<br><br>\nTalent Acquisition\n<br><br>\n2716 South Street, 6th Floor\n<br><br>\nPhiladelphia, PA 19146\n<br><br>\nPhone: 866-820-9288\n<br><br>\nEmail:TalentAcquisition@email.chop.edu\n<br><br>\nNearest Major Market: Philadelphia\n<br><br>\nJob Segment: Medical, Computer Science, Information Systems, Patient Care, Testing, Healthcare, Technology"}