{"job title": "Data Engineer", "company": "CSpring", "city state": "– Indianapolis, IN", "rating": "3.5", "job description": "CSpring is seeking a Data Engineer to join our team in Indianapolis, IN. At CSpring, you truly do make a difference. Be heard, work on challenging assignments, improve your community, and join a growing team that will both challenge you and value your contributions. When you join CSpring, you become part of our Ohana or extended family and our most valuable asset. You are NOT just another \"resource\" as is the case with many other consulting or staffing firms.\n<br><br>\nIf you possess the qualifications listed below, please apply for this position and a member of our recruiting team will contact you directly. Your information will remain confidential and you will never be submitted for a position without your approval.\n<br><br>\nYou will be a member of the Data team responsible for delivering high-value BI solutions to support strategic business needs. This person will be working on new development creating a new Data &amp; Insight Platform for our client to enable insight based decisions. This is a highly innovative and dynamic environment.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Implement a high-performance, next generation data platform.</li>\n<li>Work with a team to identify, design and build appropriate dataset and linkages for complex data.</li>\n<li>Refactor legacy data platforms to integrate with the next generation data platform.</li>\n<li>Implement data quality infrastructure and processes.</li>\n<li>Implement data infrastructure for emerging data classes.</li>\n<li>Contribute to the team's growing set of development platforms, tools, processes and promote industry standard best practices.</li>\n<li>Identify analytics tool guidelines and standards for performing required data preparation, analysis, visualization, and reporting.</li>\n<li>Provide business and architectural context to show how the analytics tools fit within the overall infrastructure and high-performance data architecture.</li>\n<li>Organize, deliver, and ensure data integration support of a corporate computing capability.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>3-5 years of experience with large scale data technologies such as Hadoop, Spark, machine learning, etc.</li>\n<li>Knowledge of informatics, analytics, computational science, service management, delivery.</li>\n<li>Knowledge of toolsets and capabilities utilized by expert data scientists and modelers.</li>\n<li>Java, C++</li>\n<li>Knowledge of Perl/Python and Unix scripting.</li>\n<li>NoSQL and RDBMS databases</li>\n<li>Hadoop-based tools (Hive, Hbase, MapReduce, MongoDB, Cassandra)</li>\n<li>Data modeling and ELT / ETL</li>\n<li>Data analytics and visualization</li>\n<li>Solid communication skills and team player</li>\n</ul>\n\nCSpring offers a comprehensive compensation, training, and benefits package; including Paid Time Off, PPO and HSA Medical Insurance Options, Dental, Vision, STD, LTD, Life Insurance, and IRA Match. For more information about CSpring, please visit our website at<br><br>SDL2017"}