{"job title": "Environmental Scientist", "company": "Golder", "city state": "– Richmond, VA", "rating": "3.2", "job description": "At Golder, we thrive on challenges.\n<br><br>\n<strong> Golder is not just a place to work, it is a promise of a living, dynamic environment where people collaborate, innovate, build enduring relationships, excel, and grow professionally in a strong culture of ownership.</strong> \n<br><br>\nDo you have the desire to learn? The drive to excel and thrive in an engaged, collaborative environment?\n<br><br>\nGolder has a new opportunity for an <strong>Entry-level Environmental Scientist</strong>  to join the <strong>Richmond, VA</strong> office on a <strong>fulltime</strong> basis. In this role, you will support a variety of civil and environmental projects as part of a multi-disciplinary team.\n<br><br>\n<strong> Responsibilities of the role will include:</strong> \n\n<ul>\n<li>Perform field activities either individually or as part of a team that may include the collection of water samples, preparation of chain of custody and other documentation, implementing health and safety procedures, and oversight of related subcontractor services, and other water quality measurements;</li> Perform field activities related to environmental compliance coordination for active environmental projects; Assist with as needed data review and compilation, technical writing, and meeting internal Company quality control objectives. Assist with the development and distribution of field notes, meeting minutes, project action item lists, internal tracking of projects activities, and general project coordination activities in support of project managers; Assist in preparing and presenting to clients permit requirements and compliance schedules for environmental projects; Assist with the development and delivery of specific environmental permits relating to stormwater and surface water discharges, erosion and sediment control, wetlands, and other construction related permits; Assist in preparing studies, plans, specifications, response to regulatory comments, and other communications for civil and environmental engineering projects, and; Perform regulatory permit reviews and research, and; Attend regular client project meetings and participate in discussions relating to the requirements and compliance deadlines associated with regulatory permits.\n</ul>\n\n<strong> The successful candidate will have a background in:</strong> \n\n<ul>\n<li>B.S in Environmental Science or equivalent preferred</li><li>0-3 yearsâ experience</li><li>Water testing experience and analytical data skills a plus</li>\n</ul>\n\n<strong> Your benefits at Golder will include:</strong> \n\n<ul>\n<li>Employee owned structure - own the business, own the result</li><li>Competitive benefits and remuneration packages</li><li>Opportunity to deepen your expertise in a dynamic work environment</li><li>Innovative and collaborative multidisciplinary projects</li><li>On the job training, mentoring and coaching</li>\n</ul>\n\nRenowned for technical excellence, Golder is a leading, global employee-owned engineering and consulting firm with over a half century of successful service to its clients. With over 165 offices in over 40 countries, Golderâs 6,500 professionals are driven by a passion to deliver results, offering unique specialized skills to address the ever-evolving challenges that earth, environment and energy present to clients across the infrastructure, mining, oil and gas, manufacturing and power sectors.\n<br><br>\n<strong> Equal Opportunity Employment Statement</strong> \n<br><br>\nGolder is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status or other characteristics protected by law. Golder is a background screening, drug-free workplace.\n<br><br>\n<strong> To learn more about our company and culture click here to view The Promise of Golder video.</strong> \n<br><br>"}