{"job title": "Visiting Research Scientist", "company": "Intel Corp.", "city state": "– Hillsboro, OR", "rating": "3.8", "job description": "Visiting Research ScientistJob Description\n<br><br>\nThe mission of the Intel Labs is to drive Intel's technology leadership. This includes coordinating research and development among external academia and several business groups and aligning Intel's strategies and technologies with industry needs. The goal is to accelerate the convergence of computing and communications.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nAs a Networking, System and Machine Learning Research Scientist you will be part of Intel Lab's System and Software Lab for leading and contributing to research in the areas of in-networking computing, and networking/system/architecture support for machine learning algorithms. The scope includes (but not limited to): understanding and optimizing application performance, particularly communication centric applications, via ML enhanced software, hardware and hardware-software co-optimization approaches; and accelerating ML workloads via system and networking optimization. The successful candidate will have demonstrated ability to conduct leading edge research in ML, architecture, system and networking. Research work includes research proposal, data analysis, simulations, development of protocols and algorithms, and research paper writing.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nProficient in C/C++ development on Linux environment and strong skills in the following areas: ML, networking, computer architecture and system.\n<br><br>\n<strong>Education/Experience:</strong>\n\n\n<ul>\n<li>PhD candidate in CS/CE required</li>\n<li>Independent research capability and strong publication record.</li>\n</ul>\n\nInside this Business Group\n<br><br>\nIntel Labs is the company's world-class, industry leading research organization, responsible for driving Intel's technology pipeline and creating new opportunities. The mission of Intel Labs is to deliver breakthrough technologies to fuel Intel's growth. This includes identifying and exploring compelling new technologies and high risk opportunities ahead of business unit investment and demonstrating first-to-market technologies and innovative new usages for computing technology. Intel Labs engages the leading thinkers in academia and industry in addition to partnering closely with Intel business units.\n<br><br>\nPosting Statement\n<br><br>\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance."}