{"job title": "Staff Research Scientist", "company": "Massachusetts General Hospital(MGH)", "city state": "– Boston, Massachusetts", "rating": "3.9", "job description": "A staff scientist position is available at the Athinoula A. Martinos Center for Biomedical Imaging to develop pulse sequence and image reconstruction software for new MRI techniques that can improve the speed, sensitivity and specificity of in vivo brain imaging. This work will be performed jointly in close collaboration with Siemens Healthineers. The techniques to be develop will include advanced acquisition/reconstruction methods in combination with novel machine learning approaches. The work will be carried out using state-of-the-art hardware systems available at the Martinos Center, which include multiple 3 Tesla MRI scanners as well as a 7 Tesla system, the \"Connectom\" MRI scanner with ultra high gradient performance, and large-channel-count receive arrays.The technologies being developed should enable highly detailed brain data at unprecedented temporal and spatial resolutions, with a wealth of quantitative information about brain structure and physiology.\n<br><br>\nThe Athinoula A. Martinos Center for Biomedical Imaging is a world-renowned brain-imaging center, home to more than 200 research faculty, post-doctoral fellows and graduate students. This position provides a valuable opportunity to work and collaborate with a diverse group of researchers developing cutting edge technology that will be impact both the neuroscience and clinical research communities. This role will involve a strong academic-industrial partnership with Siemens Healthineers in translating new technologies into commercial products. An example of technology that has been successfully translated is in the Simultaneous Multi-Slice (SMS) imaging technique, which we have developed and distributed to a large number of research and clinical sites worldwide (http://www.nmr.mgh.harvard.edu/software/c2p/sms), and is now an FDA-approved Siemens clinical product on their MRI scanners. Such technology is now changing how diffusion and functional MRI are being performed today. A couple of more recent software packages that we are starting to distribute include: Wave-CAIPI (https://www.nmr.mgh.harvard.edu/software/c2p/wave) and 3D-MRF (https://www.nmr.mgh.harvard.edu/~berkin/mrf_3d.html).\n<br><br>\n<strong>Qualifications</strong>\n<br>\nSalary for the position will be based on qualification and experience. A Ph.D. in electrical engineering, physics, biomedical, or a related field is required. The candidate should have first-hand experience in MR physics, pulse sequence programming and image reconstruction algorithms. It is expected that the candidate has had experience with the Siemens IDEA/ICE environment or equivalent on other platforms, and a strong proficiency with C/C++. Experience with the MATLAB programming environment is also desired. Candidates should be highly motivated and interested in working in an interdisciplinary environment is also desired. Candidates should be highly motivated and interested in working in an interdisciplinary environment.\n<br><br>\nInterested candidates should send a full CV, cover letter and contact information of three referees.\n<br><br>\n<strong>EEO Statement</strong>\n<br>\nMassachusetts General Hospital is an Equal Opportunity Employer. By embracing diverse skills, perspectives and ideas, we choose to lead. Applications from protected veterans and individuals with disabilities are strongly encouraged.\n<br>\nPartner's Healthcare is acting as an Employment Agency in relation to this vacancy."}