{"job title": "RESEARCH SCIENTIST , Immunology", "company": "Massachusetts General Hospital(MGH)", "city state": "– Boston, Massachusetts", "rating": "3.9", "job description": "<strong> Job description</strong> \n<br>\nThe Xavier group is in search of a highly motivated and capable Research Scientist to join our multidisciplinary team working on targeting the regulatory networks governing gut mucosal immune responses for therapeutic impact. The primary role involves a combination of cellular pharmacology and target validation studies. This includes the development and implementation of critical experiments for target validation of autophagy genes linked to inflammation by genetic studies, cell-based assay development and implementation, and the development of approaches to assess mechanism of action.\n<br><br>\n<strong> Characteristic duties</strong> \n\n\n<ul>\n<li>Design, plan, and execute cell-based, biochemical, and in vivo experiments necessary to validate target genes for therapeutic discovery.</li>\n<li>Maintain cell lines and isolate primary cells for use in cell-based assays.</li>\n<li>Work with informatics and computational scientists to integrate and interpret screening and functional genomic data sets.</li>\n<li>Perform detailed characterization and cellular mechanism of action studies of chemically optimized compounds.</li>\n<li>Work with team to design and execute research plans to ensure that critical project requirements, timelines, and deliverables are met.</li>\n<li>Troubleshoot and solve scientific problems independently.</li>\n<li>Identify, investigate and implement new technologies based on scientific needs.</li>\n<li>Effectively present results in cross-functional project teams.</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br>\n<strong> Requirements</strong> \n<br>\n· Ph.D. in Biology, Molecular and Cell Biology, Biochemistry, Microbiology, Immunology or a related life science field with at least 5 years of research experience in an academic setting focusing on autophagy, innate immunity, or host-pathogen interactions .\n<br>\n· Excellent publication record\n<br>\n· A proven record of successful interactions within multidisciplinary teams.\n<br>\n· Cell-based assay development experience is required with special emphasis on functional genomic methods for target validation (e.g. shRNA, CRISPR).\n<br>\n· Significant experience in cell culture techniques including use of mammalian cell lines and primary human cells. Experience working with mouse models is a plus.\n<br><br>\nThe successful candidate will be a results-focused, team-oriented, creative, bench scientist, able to excel in a fast-track environment. He or she must be self-motivated, detail-oriented and exhibit strong problem solving skills. In addition, the successful candidate should be a clear and effective communicator, demonstrating strong interpersonal skills to enable collaboration with project teams, peers, and management in identifying and achieving research goals.\n<br><br>\n<strong>EEO Statement</strong>\n<br>\nMassachusetts General Hospital is an Equal Opportunity Employer. By embracing diverse skills, perspectives and ideas, we choose to lead. Applications from protected veterans and individuals with disabilities are strongly encouraged.\n<br>\nPartner's Healthcare is acting as an Employment Agency in relation to this vacancy."}