{"job title": "Chief Data Strategist And Director", "company": "National Institutes of Health", "city state": "– Bethesda, MD", "rating": "4.2", "job description": "As Director of the new Office of Data Science Strategy, the Chief Data Strategist will be responsible for supervising its staff and planning and managing use of its resources. In concert with, and as a member of, the trans-NIH Scientific Data Council (SDC), the CDS will play a seminal role orchestrating the development and implementation of cutting edge approaches and platforms for initiatives that support the vision expressed in the NIH’s Strategic Plan for Data Science. This leadership position must also develop the strategic planning processes (and an ongoing strategic plan) that keep NIH and its awardees at the forefront of biomedical data science and new data types that will scale up in the near future (omics, imaging, biosensing, consumer devices, etc.).\n<br><br>\nPlatform Leadership\n<br>\nThe Chief Data Strategist will lead the cross-NIH effort to deliver a next-generation technology platform that can accelerate scientific discovery and weave existing data science efforts into a highly innovative data ecosystem to maximize the utilization and extraction of knowledge from the data generated by, and relevant to, NIH research. This will entail engaging with exciting data intensive research programs such as the All of Us Program, BRAIN Initiative, Cancer Moonshot, and Opioid Initiative as well as the NIH intramural research program to promote the coordination and harmonization of data, methods, and technologies being sensitive to the unique programs and goals of the individual NIH Institutes and Centers. The incumbent should position NIH as a cutting-edge leader within the biomedical data science field and in advanced computing environments, ensuring that the NIH benefits from and contributes to effective and proper use of data for discovery, innovation, care and commerce.\n<br><br>\nExternal &amp; Internal Advocacy\n<br>\nThe Chief Data Strategist will serve as the NIH’s advocate and representative in national and global data strategy matters, including other Federal agencies, the Congress, industry, academic and scientific societies, the biomedical research community, international partners, the media, and the public. This will include extensive interactions with external advisors and stakeholders in the research community and experts in the private sector.\n<br><br>\nGrowing Workforce Competency\n<br>\nThe Chief Data Strategist will be responsible for creating and implementing innovative new approaches to increase the capabilities and knowledge of NIH staff and researchers and the broader research community in data science and state-of-the-art technology platforms and tools. In collaboration with the Principal Deputy Director of NIH, the CDS will be responsible for guiding a new NIH Data and Technology Advancement (DATA) Fellowship to attract leading data scientists who are early in their career to tackle large-scale, data-intensive projects designed to overcome a current obstacle or create a new capability that will yield transformational changes to biomedical research.\n<br><br>\nLocation\n<br>\nBethesda, MD (NIH Main Campus)\n<br><br>\nAbout NIH\n<br>\nAs the worlds largest medical research facility, NIH consists of 27 Institutes/ Centers, including the Clinical Center (an on-site research hospital), the Fogarty International Center, and the National Library of Medicine. NIHs national program of health research and research training is currently funded at more than $29 billion annually. NIH has over 18,000 employees. NIH supports the generation and analysis of substantial quantities of biomedical research data, including genomics, text and images. The Agency is also responsible for a myriad of disparate data sets emanating from fundamental research using model organisms (such as mice, fruit flies, and zebrafish), clinical trials including medical images and data extracted from electronic medical records), the ever-growing world’s literature on biomedical research.\n<br><br>\nQualifications Required\n<br>\nThe Chief Data Strategist will be a recognized leader who is able to perform the duties and responsibilities of this position within the framework of agency policies, mission, objectives, and resources. S/he is required to have expert knowledge of scientific data management and analysis, in addition to established abilities to negotiate complex and sensitive data-management issues, to formulate policies, and to present and defend polices, programs, and activities. Successful candidates will have extensive experience in data science platforms and data management disciplines and demonstrated success in full life cycle development processes from planning to delivery and management of enterprise-level data and service platforms and solutions – i.e., a proven track record of delivering large-scale data science platforms and services. Outstanding executive leadership skills and the ability to maintain excellent working relationships with all stakeholders are required. Must have excellent communication and speaking skills appropriate for diverse audiences and ability to work across diverse groups and develop solutions to challenges in a highly partnered and matrixed environment. Strong program management and relationship building skills are essential to deliver multiple, interdependent initiatives that span many stakeholders.\n<br><br>\nIt is envisioned that s/he will have sufficient knowledge to secure the key expertise that NIH requires to develop the data ecosystem required to accelerate discovery. Candidates with industry experience are welcome. Women and members of underrepresented groups are particularly encouraged to apply.\n<br><br>\nSummary of Key Requirements\n<br>\nDemonstrated success in inventing, developing, and/or deploying advanced data platforms, systems, and tools that come from—or could be applied to—biomedical research\n<br>\nDeep expertise on “Big Data” technologies, systems, and trends, including cloud-based computing, Platform as a Service (PaaS) and Software as a Service (SaaS) architectures, distributed analytics, privacy-enhancing technologies, etc.\n<br>\nAbility to carefully identify and prioritize information/reporting/analysis needs and translate/summarize key findings to provide strategy recommendations.\n<br>\nAbility to apply advanced analytics to help NIH gain insights into patterns, trends, and other metrics, to accomplish NIH’s biomedical objectives and goals.\n<br>\nAbility to expertly negotiate complex and sensitive data-management issues, formulate policies, and to present and defend polices, programs, and activities.\n<br>\nOutstanding ability to execute complex plans and programs, meeting interim milestones and long-term objectives.\n<br>\nAbility to build consensus among complex groups of stakeholders.\n<br>\nAbility to handle confidential information with the upmost care and integrity.\n<br>\nDemonstrated success in leading a diverse team of experts, managing multiple deadlines, providing exceptional customer service and interpersonal skills.\n<br>\nExcellent communication skills appropriate for diverse audiences and the ability to maintain excellent working relationships with all stakeholders.\n<br>\nExceptional preparation for this complex position, based on a combination of education and demonstrated experience in engineering/computer science."}