{"job title": "Scientist, Tech Transfer (Drug Substance)", "company": "Pfenex Inc.", "city state": "– San Diego, CA", "rating": "3.3", "job description": "Position Summary\n<br><br>\nThe Tech Transfer Scientist is responsible for the development transfer and manufacturing process oversight of our products to cGMP Clinical/Commercial Drug Substance, Device Assembly, and Process Characterization at Contract Service Provider's (CSP).\n<br><br>\nPrimary Responsibilities\n<ul>\n<li>Work with the process development group throughout development (early development, consistency runs, and scale-up) to define process based on the CSP capabilities.</li><li>Assist process development group in the completion of consistency and scale-up runs in the lab and compile data to provide documentation for the technology transfer package.</li><li>Provide process development oversight and technical support for Pfenex products at cGMP Clinical/ Commercial Drug Substance, Drug Product, Device Assembly, Process Characterization, and Packaging CSP's through the end of the technology transfer phase of the project, as well as cGMP batches and process validation if required.</li><li>Prepare a Technology Transfer protocol outlining the approach for the transfer of process and analytical methods developed at the Pfenex site to the CSP site, following a sequence of preparation of Technology Transfer Document Package, shakedown, engineering, and cGMP manufacturing runs.</li><li>Generate protocols and reports governing applicable CSP product manufacturing stage gates supporting technology transfer.</li><li>Manage the Technology Transfer Process and/ or knowledge process, planning, and requirements from a transferring site to a receiving site. Specify in detail the information being transferred, scope and related activities - e.g. formulation, process and process parameters, package, testing methods, specifications, method validations, etc.</li><li>Coordinate the execution of Technology Transfer process utilizing specific protocols where appropriate, with each protocol clearly defining scope, activities, responsibilities and references appropriate to the stage of the product's lifecycle.</li><li>Ensure cross-functional participation on the Tech Transfer teams and coordinate team activities at the CSP sites.</li> <li>Facilitate and schedule meetings with CSP and Pfenex personnel as required.</li> <li>Provide guidance and oversight for the execution of the Extractable and Leachable studies and regulatory documentation.</li><li>Lead the facility fit evaluation of the CSP and assist in the request for proposal (RFP) and contracting process.</li> <li>Align with QA PIP and MFG SME in the remediation of CSP process related deviations.</li> <li>Support the CSP audit prior to cGMP manufacturing/testing activities occur including addition of CSP to the Approved CSP list and implementing a quality agreement, as required.</li><li>Support the regulatory and quality assessment of the CSP process development, manufacturing, and testing processes as applicable.</li> <li>Provide the technical evaluation and approval for manufacturing change controls, and support the documentation required to justify the change.</li> <li>Lead the technical demonstration that the product manufactured at the CSP is consistent with Process Development Consistency Runs.</li> <li>Lead in the execution of process risk assessments that support the process development and Technology Transfer process.</li><li>Provide technical support of scale-up activities from process development to CSP manufacturing.</li><li>Ensure compliance with cGMP, regulatory, and industry standards.</li> \n</ul>\nQualifications\n<ul>\n<li>A Bachelor's degree in Engineering or Life Science preferred or specific biopharmaceutical experience required.</li><li>6 - 10+ years pharmaceutical CMC, process development, and MFG / scale-up experience required.</li><li>Possess pharmaceutical manufacturing and/ or engineering knowledge</li><li>Must possess strong ability to negotiate and influence others internally and externally.</li><li>Excellent computer, verbal, and written communication skills</li><li>Innovative approach to problem-solving and integrated view of business/scientific issues</li><li>Work independently in a matrix environment and manage multiple tasks simultaneously.</li><li>Significant experience with MS Office Suite; Project, Visio, LIMS, and EDMS.</li><li>Experience with cGMP Manufacturing and Quality Systems within a FDA regulated manufacturing environment.</li><li>Experience in regulatory submissions, as it pertains to Validation, Manufacturing and Controls.</li><li>Remains current on pharmaceutical regulations, industry standards, current practices, and new technology.</li><li>Other skills and abilities as required.</li><li>Ability to travel up to 50%</li>\n</ul>\nAdditional Information\n<ul>\n<li>Affirmative Action and Equal Opportunity Employer (EOE).</li><li>Pfenex celebrates the diversity of life and welcomes all individuals to apply.</li><li>Must be legally authorized to work in the US without sponsorship.</li>\n</ul>\n\n<strong>Job Posted by ApplicantPro</strong>\n<br>"}