{"job title": "Senior Principal Scientist, Precision Medicine", "company": "Pfizer", "city state": "– Groton, CT", "rating": "3.9", "job description": "Pfizer's Precision Medicine group within Early Clinical Development drives strategic generation and application of quality biomarker data to inform Pfizer's discovery and development portfolio. To support this mission, the Clinical Genetics &amp; Biospecimens (CGB) team enables the collection and management of human biospecimens, and data generated, from clinical trials across therapeutic areas, for use in regulatory, translational and exploratory research.\n<br><br>\nThe key purpose of the Senior Principal Scientist, Precision Medicine position is as a scientific resource to assess disease area and project needs and opportunities, and champion biospecimen collection and retrospective exploratory biomarker strategies including, as applicable, patient-derived genetic and biochemical biomarker data. The candidate will serve as an internal champion for maximizing the scientific benefit of the Pfizer biospecimen resources, and will drive compliance through adherence to robust collection and management practices.\n<br><br>\nThis role will be a subject-matter expert on biofluid collection and high-dimensional biomarker technologies, including but not limited to genomic and proteomic technologies. This role will support the Head of CGB, working to build cross-functional teams in Worldwide Research &amp; Development (WRD) and Global Product Development (GPD) to implement exploratory biomarker strategies and address complex research questions utilizing clinical samples. The Senior Principal Scientist, Precision Medicine will also be responsible for day to day BioBank operations, leading a small team focused on long-term sample storage logistics, sample processing, and oversight of sample requests from researchers.\n\n\n<ul>\n<li>*ROLE RESPONSIBILITIES**</li>\n</ul>\n\n+ Provide scientific and operational leadership in areas of biospecimen management, biomarker research and development, and translational sciences\n<br><br>\n+ Identify and establish partnerships with internal Research Unit scientists, Business Unit scientists, and external groups to align the appropriate technology, clinical samples, and strategy with the clinical questions for the project\n<br><br>\n+ Manage and mentor a team of biospecimen scientists, and work collaboratively with other CGB colleagues, to deliver biospecimen collections, including oversight of projects and management of budget\n<br><br>\n+ Serve on multi-site committees focused on biomarker research application and technology development\n<br><br>\n+ Identify and develop scientific strategies to support longer term goals and independently conduct the work to achieve these goals\n<br><br>\n+ Uphold adherence to Pfizer's policy on the use of human biological specimens, including compliance with the terms of sample collection, sample management, and order for use\n<br><br>\n+ Assess and champion communication of the business value generated through biomarker research across disease areas.\n<br><br>\n+ Define and report on key metrics related to biospecimen management performance and capacity\n\n\n<ul>\n<li>*QUALIFICATIONS**</li>\n</ul>\n\n+ PhD with 7 years of experience in the areas of biological sciences, clinical trials, biospecimen repository management strongly preferred; Masters with 8 years\n<br><br>\n+ Multidisciplinary scientist with leading-edge knowledge of principles, concepts and practices of biospecimen processing, biomarker strategy and assay development in the areas of genomics, flow cytometry, and protein sciences including understanding of basic principles and theory of immunoanalytical techniques, polymerase chain reaction, and mass spectrometry\n<br><br>\n+ Track record of innovation in the field of biomarkers and precision medicine and in driving effective change\n<br><br>\n+ Excellent oral/written communication skills, providing proactive communications\n<br><br>\n+ Demonstrated ability to successfully build and influence internal and external cross-functional teams by promoting problem solving, clear decision-making and accountability with a strong desire to work with others\n<br><br>\n+ Demonstrated ability to produce high-quality work products within established timelines while managing resolution of competing needs\n<br><br>\n+ Experience leading a team of scientists, developing and coaching others.\n<br><br>\n+ Demonstrated strong interpersonal and negotiating skills and leveraging of those competencies to ensure continuous progress\n\n\n<ul>\n<li>*EEO &amp; Employment Eligibility**</li>\n</ul>\n\nPfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.\n\n\n<ul>\n<li>*Sunshine Act**</li>\n</ul>\n\nPfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider's name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.\n\n\n<ul>\n<li>*Other Job Details:**</li>\n</ul>\n\n+ **Last Date to Apply for Job:** October 15, 2018\n<br><br>\n+ Eligible for Relocation Package: yes\n<br><br>\n+ Eligible for Employee Referral Bonus: yes\n<br><br>\nPfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates."}