{"job title": "Senior Scientist, Vaccines R&amp;D", "company": "Pfizer", "city state": "– Pearl River, NY", "rating": "3.9", "job description": "<ul>\n<li>*ROLE SUMMARY**</li>\n</ul>\n\nThis is a laboratory-based position. The candidate should have a strong background in bioassay development using ICH guidelines for both antibody based and molecular biology assays and have a working knowledge of cellular biology techniques such as in vitro protein expression by Western blotting . The candidate will primarily develop, qualify and transfer assays in support of Vaccine materials release and stability for early phase vaccine programs using ELISA, Bioplex, qPCR, RT-PCR, NA extraction, or gel electrophoresis.\n\n\n<ul>\n<li>*ROLE RESPONSIBILITIES**</li>\n</ul>\n\n+ The individual should be familiar with the specific requirements and the associated guidelines for bioassays, as well as be familiar with the ICH guidelines for method qualification.\n<br><br>\n+ Contribute to the selection of the methodology and techniques to be used.\n<br><br>\n+ Independently design, plan, and execute assay development, qualification and transfer studies to support the release, stability and characterization of vaccine candidates\n<br><br>\n+ Independently analyze, interpret, provide conclusions and present experimental data internally\n<br><br>\n+ Perform routine sample analysis\n<br><br>\n+ Collaborate with colleagues within Vaccine Research and Development - Bioprocess, Analytical, and Formulation Development and appropriate partner lines\n<br><br>\n+ Author and review laboratory methods and reports\n<br><br>\n+ Keep abreast of scientific/ technological development by participating in scientific meetings/ seminars and through regular scientific review\n<br><br>\n+ Where applicable, perform job responsibilities in compliance with GLP and all other regulatory agency requirements\n<br><br>\n+ Perform timely notebook entries and review for completed experiments.\n<br><br>\n+ Perform other duties as assigned\n\n\n<ul>\n<li>*QUALIFICATIONS**</li>\n</ul>\n\n+ PhD in Molecular biology, Biochemistry, Immunology or related discipline with at least 2 years of industrial experience or an MS plus 7 years of industrial experience is required.\n<br><br>\n+ Experience in vaccine analytical assay development is essential.\n<br><br>\n+ Background in nucleic acid structure, function and characterization and/or antibody-antigen interactions is a major plus.\n<br><br>\n+ A strong background in biochemical, immunological and molecular biology techniques and qualification using ICH guidelines is essential. Experience with applying these methodologies to biomolecules, such as polysaccharides, proteins, DNA and RNA is preferred. Proficiency and ability to utilize techniques such as ELISA, Nephelometry, Luminex, qPCR, RT-PCR, NA sequencing, and gel electrophoresis to develop methods to analyze potential vaccine antigens and other vaccine components.\n<br><br>\n+ Proficiency with personal computers including word processing, spreadsheets, PowerPoint and relevant scientific software is desirable. Strong verbal and written communication skills are required.\n<br><br>\n<strong>EEO</strong>\n<br><br>\nPfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.\n\n\n<ul>\n<li>*Sunshine Act**</li>\n</ul>\n\nPfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider's name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.\n\n\n<ul>\n<li>*Other Job Details:**</li>\n</ul>\n\n+ Eligible for Employee Referral Bonus: yes\n<br><br>\nPfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates."}