{"job title": "PRINCIPAL SCIENTIST I", "company": "Roche", "city state": "– United States, California, Santa Clara", "rating": "3.8", "job description": "<strong><u>WHO WE ARE:</u></strong>\n<br><br>\nRoche Sequencing Solutions (Santa Clara) is a nanopore based sequencing group of Roche dedicated to making clinical genetic testing easy and affordable. We are developing a revolutionary, low cost single-molecule DNA sequencer that can potentially improve the lives of people in a wide variety of ways including timely screening for diseases and diagnosis of various cancers.\n<br><br>\n<strong><u>ESSENTIAL FUNCTIONS:</u></strong>\n<br><br>\n<strong>Manages consumable device EOL test team:</strong>\n<ul>\n<li>Responsible for establishing plans for areas of responsibility with input from senior management.</li><li>Focusing on deliverables of own distinct areas and ensuring its objectives are aligned with company-wide objectives.</li><li>Conceiving and conducting advanced independent research/development experiments from project inception through product launch and field support.</li><li>Recommending new or creative approaches, and expansion or curtailment of investigation based on scientific information.</li><li>Assuming responsibility for timely completion of projects, consistent with project critical path, and responding appropriately to changing priories.</li><li>Ensuring technical activities under delegated supervision are conducted within internal and external guidelines and regulations.</li><li>Interacting with other departments and function teams to further the project goals</li><li>Guide the development staff through the various phases of product development with highly productive interactions, with core R&amp;D teams, engineering, document control and manufacturing \u2028</li><li>Accountable for the NGS consumable device development and validation plans and execution, system design, readiness and transition from Development to Commercial and Lab Operations.</li> \n</ul>\n<strong>Manages, records, and presents data:</strong>\n<ul>\n<li>Accurately and consistently recording experimental method, materials, and results.</li> <li>Analyzing data, forming conclusions, and determining future experiments.</li><li>Presenting findings or comprehensive project status reviews at internal meetings.</li><li>Applying advanced technical writing skills to produce reports and documents such as summaries, SOPs, DHFs, presentations and manuscripts.</li>\n</ul>\n<strong>Additional Responsibilities for Principal Scientist I:</strong>\n<ul>\n<li>Frequent contact with external resources and contacts at various management levels concerning operations or scheduling of specific phases of projects.</li><li>Provides input to budget and helps to allocate expenditures efficiently for activities individual manages. Forecasts resource needs. Identifies opportunities to reduce costs.</li><li>People leadership responsibility have full HR responsibility for direct reports and/or indirect reports</li><li>Sets goals that have short-term (0-3) years positive impact on team members and the organization.</li>\n</ul>\n<strong><u>MINIMUM REQUIREMENTS:</u></strong>\n<ul>\n<li>BS in Science or Engineering and 5+ years experience in product development OR MS/PhD in Science or Engineering and 3+ years experience in product development</li><li>Strong large data set manipulation and visualization (using JMP, R, and/or Python) skills.</li><li>Demonstrated people leadership capability</li><li>Strong technical writing skills</li><li>Experience in experimental design (DOE)</li>\n</ul>\n<strong>Roche is an equal opportunity employer.</strong><br><br>Research &amp; Development, Research &amp; Development &gt; Research"}