{"job title": "Sr Research Scientist 1", "company": "University Of New Mexico", "city state": "– Albuquerque, NM", "rating": "3.8", "job description": "The Department of Pediatrics is seeking a Sr. Research Scientist 1 to be responsible for finding appropriate funding opportunities (e.g., state contracts, foundation funding, NIH funding) planning and designing multiyear/multisite projects, proposal writing, data management and analysis of all various forms of data collected to support all mission areas (e.g., behavioral and biomedical research, quality improvement, clinical) in the Division of Adolescent Medicine.. The Sr. Research Scientist 1 will provide scientific expertise in methodology, data collection, quality control, data management and statistics to support multiple projects and programs in the Division of Adolescent Medicine; this includes assistance in the establishment of data collection instruments and protocols, data analysis plans, computer systems/applications analysis, and reporting. The Sr. Research Scientist 1 will be expected to establish and implement short- and long-term goals and objectives to ensure that projects are successfully completed in a timely and cost-effective manner, and that the final products are consistent with initial requirements. This person will oversee the analysis, interpretation, and reporting of both process data and research findings. Additionally, this position will participate in the design, development, and reporting of quality improvement projects and research studies, and respond to a broad range of statistical issues arising from various settings. The Sr. Research Scientist 1 will be responsible for supervising statistical support/data entry personnel, as appropriate, to meet objectives of the various projects and programs.\n<br><br>\nWe are looking for someone who is a team player and has excellent communication and organizational skills with ability to establish priorities, work on several projects concurrently, and follow through. The successful candidate should be detailed oriented with a vision on long-term goals. This position will work hands on with all Division staff to accomplish the stated duties and responsibilities. The successful candidate should have extensive experience analyzing large datasets as well as experience working closely with state and federal health care agencies in the areas of data collection and reporting. Familiarity with NIH Research will be a strength. The successful candidate should also have experience creating quality indicator measures and be able to use such skills to advance the Division of Adolescent Medicine's research in children, adolescent and young adult health and quality improvement work with pediatric providers.\n<br><br>\nDuties for the position include but are not limited to:\n\n\n<ul>\n<li>Design research and quality improvement (QI) protocols for the Division of Adolescent Medicine, includes planning, and designing of multiyear, multi-site projects. Advise management on research principles and practices as they relate to ongoing division projects. Utilizes advanced analytical techniques in statistics to evaluate various health outcomes including the ability to evaluate mediators and moderators of main outcomes; and has the ability to modify and extend established theories and practices in furthering innovative research, implementation science and improvement science in field of children, adolescent and young adult health.</li>\n<li>Provides support to investigators and managers in the Division of Adolescent Medicine to formalize analysis plans and reporting specifications for all research and quality improvement projects within the Division; advises as to choice of statistical analysis strategies, reliability/validity of measurements, models, and interpretation and presentation of statistical results.</li>\n<li>Uses a variety of advanced statistical software, methods, and techniques to gather, analyze, and interpret data to derive useful information for research data and quality improvement data; advises and assists in the development of inferences and conclusions, as appropriate.</li>\n<li>Lead Division of Adolescent Medicine research and evaluation team in data collection and reporting, standardize and evaluate the quality of data, and analyze large and complex data sets. Provide technical leadership and consultation to statistical support staff, data entry staff, principal investigators and program managers. Acts as liaison with managers in the implementation of project plans to ensure compliance with overall strategic plans, goals and unit objectives.</li>\n<li>Develops surveys, clinical tools, and tool validation activities. Evaluate clinical quality indicator measures for use in research and improvement projects.</li>\n<li>Grant writing: oversees grant applications for research and operations; evaluates appropriateness of RFAs and develops proposals for funding in support of the Division's research and QI activities.</li>\n<li>Maintains current and learns new state-of-the-art knowledge to further the fields of children, adolescent and young adult health. May manage research and QI projects.</li>\n</ul>\n\nSee the Position Description for additional information.\n<br><br>\nConditions of Employment\n\n\n<ul>\n<li>Successful candidate must submit to a post-offer, pre-employment physical examination and medical history check. Additional health screenings may be required, dependent on the nature of the research conducted, as determined by Employee Occupational Health Services.</li>\n</ul>\n\n<strong>Minimum Qualifications</strong>\n<br><br>\nMaster's degree; at least 5 years of experience directly related to the duties and responsibilities specified.\n<br><br>\nCompleted degree(s) from an accredited institution that are above the minimum education requirement may be substituted for experience on a year for year basis.\n<br><br>\nPreferred QualificationsKnowledge of current and emerging trends in technologies, techniques, issues, and approaches in area of Adolescent Health;Ability to provide technical guidance and leadership to professional personnel in Research and Quality Improvement;Comprehensive knowledge of scientific concepts and theories in adolescent research and Quality Improvement;Working knowledge of and with healthcare assessment toolsSuccessful development and submission of project budgets and grant proposals;Authorship and/or co authorship of published research manuscripts in peer reviewed journals;Previous 1st author presentations of research to the scientific community in Adolescent Health;Advanced Skills and knowledge in the development of broadly based statistical and observational models and research concepts;Experience in technical leadership and/or supervision of other scientists and technical support staff;Previous NIH funded research experience.Additional RequirementsCampusHealth Sciences Center (HSC) - Albuquerque, NMDepartmentPediatrics Adolescent Medicine (997C)Employment TypeStaffStaff TypeTerm - Full-TimeTerm End Date06/30/2019StatusExemptPay$3,956.33 to $5,924.53 MonthlyBenefits EligibleThis is a benefits eligible position. The University of New Mexico provides a comprehensive package of benefits including medical, dental, vision, and life insurance. In addition, UNM offers educational benefits through the tuition remission and dependent education programs. See the Benefits home page for a more information.ERB StatementTemporary and on-call employees working an appointment percentage of 26 (.26 FTE) or greater, per quarter, will be eligible to earn retirement service credits and thus are required to make New Mexico Educational Retirement Board (NMERB) contributions. More information pertaining to your FTE and NMERB contributions can be reviewed on the NMERB Guidelines Clarified webpage.Background Check RequiredNoFor Best Consideration Date9/3/2018Application InstructionsA complete application will consist of current resume, cover letter and reference. Please describe in your cover letter how you meet the preferred qualifications for the position. Include three references in your resume. The references must be former supervisors. Finalists should be prepared to provide official educational transcripts if selected for hire. If selected for an interview, be prepared to submit a writing sample or 1st author paper/grant for review.\n<br><br>\nPositions posted with a Staff Type of Regular or Term are eligible for the Veteran Preference Program. See the Veteran Preference Program webpage for additional details.\n<br><br>\nThe University of New Mexico is committed to hiring and retaining a diverse workforce. We are an Equal Opportunity Employer, making decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, veteran status, disability, or any other protected class."}