{"job title": "Staff Scientist - Radiology", "company": "Washington University In St. Louis", "city state": "– Saint Louis, Missouri", "rating": "4.2", "job description": "Job Type/Schedule<br><br>This position is full-time and works approximately 40 hours per week.<br><br>Department Name/Job Location<br><br>This position is in the Department of Radiology. This position is for the Medical School Campus.<br><br>Essential Functions<br><br><strong> POSITION SUMMARY:</strong>\n<br><br>\nAssists in developing and conducting research projects, including experimental design, data analysis and documentation of experimental results.\n<br><br>\n<strong> PRIMARY DUTIES AND RESPONSIBILITIES:</strong>\n<li> Following instructions and discussions with principal investigator, designs research protocols, including developing procedures for the collection, verification and management of data.</li> <li> Assists with grant preparation and reporting.</li> <li> Performs complex statistical analysis of data collected and writes interpretative reports. Verifies the correctness of the data submitted and makes recommendations based on these analyses.</li> <li> Documents research topics and prepares and submits papers based on research work to publications and committees for publication or presentation to peers.</li> <li> Solves practical problems relating to difficulties with equipment or test subjects. Suggests technical or procedural improvements in testing methods.</li> <li> Conducts literature searches related to research project.</li> <li> Conducts immunohistochemistry staining with antibodies and small molecular probes to analyze genetic changes using the animal models of central nervous disease or the human postmortem samples.</li> <li> Performs in-situ hybridization studies to analyze the gene expression, and correlate gene expression with protein expression, and the small molecular tracers.</li> <li> Conducts fluorescence microscopy and confocal microscopy imaging studies and performs quantitative analysis of target and non-target biomarkers.</li>  <li> Conducts quantitative assays for presynaptic and postsynaptic neurotransmitter biomarkers, oxidative DNA damage, and neuroinflammation.</li> <li> Conducts enzymatic assays and receptor-ligand assays using genetically cloned proteins or human and rodent tissues.</li> <li> Performs real-time PCR and fluorescence-based high-throughput assays to identify the potential probes for translation to human studies.</li> <li> Designs, supports and performs biochemical and molecular biological experiments.</li> <li> Trains and supervises other junior research technician or trainees to conduct routine biological assays.</li> <li> Troubleshoots protocols as needed.</li>\n\nRequired Qualifications<br><br>Masters degree with 4 years of experience in research lab operations or equivalent combination of education and experience equaling 9 years required.<br><br>Preferred Qualifications\n\n<li> Prior experience with molecular biology techniques (DNA and RNA extraction, PCR, RT-PCR and Western blot), enzymatic activity analysis, general microscopy, and fluorescence microscopy.</li> <li> Strong troubleshooting and data interpretation skills.</li> <li> Software, database and online library utilization (Microsoft Word, Excel, SAS statistical software, Vector NTI, BLAST, PubMed search, Springer, etc.).</li> <li> Motivation for learning new techniques.</li> <li> Analytical, reasoning and problem solving skills.</li> <li> Ability to analyze and interpret statistical data and to communicate data in a clear, concise manner.</li>  <li> Computer literacy including the ability to use a variety of software packages to analyze data.</li>\n\nSalary Range<br><br>The hiring range for this position is $45,864 - $61,921 annually.<br><br>Benefits<br><br>This position is eligible for full-time benefits. Please visit our website at http://hr.wustl.edu to view a summary of benefits.<br><br>Applicant Special Instructions<br><br>Works in laboratory environment with potential exposure to biological, chemical and radioactive hazards. Must be physically able to wear protective equipment. Must be able to provide standard care to research animals.<br><br>EOE Statement<br><br>Washington University is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity or expression, national origin, genetic information, disability, or protected veteran status."}