{"job title": "Senior Software Engineer", "company": "Akamai", "city state": "– Cambridge, United States", "rating": "3.7", "job description": "<div><div><div><div><div>Overview\n<br><br>\nAkamai is seeking a Senior Software Engineer to design and develop components of its next generation mapping system. The day-to-day work of the team encompasses the full engineering cycle: problem formulation, data collection, analysis, algorithm design, code specification, implementation, and evaluation for performance and correctness. The Internet is a complex and noisy environment, and there are no simple answers to the problems the team tackles. This is precisely what makes the job fun and rewarding to anyone seeking a challenge. The job requires someone who is self-reliant, has an excellent work ethic, and a combination of strong coding and design skills.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nAs part of this team, you will analyze, design and implement system software that brings new functionality, better accuracy, increased reliability, and enhanced scalability to Akamai's mapping system. The team relies on the abilities of all its members to develop innovative and elegant solutions in a highly dynamic environment. You must be able to work collaboratively within your small team and with other teams at Akamai, placing an emphasis on excellent written and verbal communication.\n<br><br>\nAbout the Team\n<br>\nThe Mapping Engineering group is responsible for the software that measures and models the global internet and directs traffic for Akamai's globally distributed network of servers. This code represents Akamai's 'secret sauce', allowing us to manage our customers' Internet information flows with industry-leading performance and reliability.<br><br><br>\n\n<div>\nQualifications\n<br><br>\nApplicants should have a solid background in software engineering. This might consist of:\n\n\n<ul>\n<li>Bachelor’s degree in Computer Science or related field and five years of experience\n<br><br>\n• Master’s and three years of experience, or\n<br><br>\n• PhD\n<br><br>\nRequired Skills\n<br><br>\n•\tMinimum of 5 years of experience working in C/C++ or similar object-oriented language</li>\n</ul>\n\n<strong>Desired Skills</strong>\n<br><br>\nDesired skills for the applicant include at least two, and preferably more of:\n\n\n<ul>\n<li>Experience building scalable servers or distributed systems</li>\n<li>Familiarity with Linux operating system</li>\n<li>Knowledge of scripting (e.g. perl, python, shell)</li>\n<li>Familiarity with Internet protocols such as TCP/IP, HTTP, SSL</li>\n<li>Knowledge of Objective C</li>\n<li>Comfort learning any of the above (this is key!)</li></ul></div>\n\n\n\n</div>\n</div>\n </div>\n </div>\n</div>\n<br>"}