{"job title": "Software Engineer (API) - Ancestry (Lehi, UT)", "company": "Ancestry", "city state": "– Lehi, Utah", "rating": "3.1", "job description": "Company Description<br><br>Were a cutting-edge tech company with a very human missionto help every person discover, preserve, and share the story of what led to them. Combining the rich information in family trees and historical records with the genetic details revealed in DNA, we create unique experiences that give people a new understanding of their lives, because connecting all the pieces of our family story can give us the deepest sense of who we are.\n<br><br>\nFor more information on what we do and why you would want to work at Ancestry, visit our careers page:www.workforancestry.com<br><br>Job Description<br><br>Ancestry is seeking a Senior Software Engineer to join our search API platforms team. In this role, you will deliver innovative solutions by building out our Ancestry search services functionality. You will be design and writing APIs that will interact with our Search Engine and Content Management systems. You will define the experiences in engineering a search platform by using a variety of technologies such as Java, Kubernetes and Docker.\n<br><br>\n<strong>The Opportunity</strong>\n<br><br>\nEver wondered what it takes to build and deliver a highly available, global scale enterprise-wide search platform that continuously delivers fascinating and relevant search results. Further, ever imagined yourself to deliver API capabilities to evaluate search relevancy in real-time. And lastly ever envisioned yourself to build out an API framework that enables the seamless, highly available, performant and scalable content retrieval to our end users. Then join our search platforms team if you have the talent and desire to do so!<br><br>Qualifications<br><br><strong>What you will do</strong>\n<ul>\n<li>Be a key player in designing and writing APIs enabling the retrieval of search results.</li><li>Owns technical aspects of software framework development.</li><li>Performs design and development of test cases for integration, load and performance tests.</li><li>Develops a deep understanding of tie-ins with our systems and platforms</li><li>Identifies opportunities to adopt innovative technologies</li><li>Works closely with product owners on quality aspects that impact search platform, services, and frameworks</li>\n</ul>\n<strong>Qualifications / Who You Are:</strong>\n<ul>\n<li>5+ years of experience in software development, preferably in Java</li><li>3+ years of experience with design and implementation of APIs</li><li>3+ years of experience of distributed applications</li><li>3+ years of Linux experience ideally contributed to open source projects</li><li>Bachelor's in CS required. Master's degree in computer science, computer engineering, or other technical discipline, or equivalent work experience, is preferred</li><li>Ability to effectively interpret technical and business objectives and to articulate solutions, to think abstractly and deal with problems</li><li>Demonstrated willingness to learn new technologies, and takes pride in how fast they develop working software</li>\n</ul>\n\nAdditional Information<br><br>Ancestry is a profitable, growing company with a positive, high-energy environment. Together, our dedicated teams are harnessing the power of technology and using it to simplify the way people connect with their families and their unique legacies. Our work environment is fast-paced and challenging, but also extremely exciting. Youll work with a team of passionate, engaged individuals. We offer excellent benefits and a competitive compensation package. For additional information, regarding our benefits and career information, please visit our website at http://ancestry.com/careers\n<br><br>\nAncestry is not accepting unsolicited assistance from search firms for this employment opportunity. All resumes submitted by search firms to any employee at Ancestry via-email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Ancestry. No fee will be paid in the event the candidate is hired by Ancestry as a result of the referral or through other means.\n<br><br>\nAncestry is an Equal Opportunity Employer that makes employment decisions without regard to race, color, religious creed (including religious dress and grooming practices), national origin, ancestry, sex (including pregnancy, childbirth, breastfeeding, and medical conditions related thereto), sexual orientation, gender, gender identity and expression, age (40 and older), mental or physical disability (including HIV and AIDS), medical condition (cancer and genetic characteristics), veteran status, citizenship, marital status, genetic information, or any other basis that is prohibited by applicable law. The Company also makes reasonable accommodations to applicants or employees with qualifying disabilities who request them and who otherwise meet the requirements of applicable law. If you would like to request an accommodation during the application process, please contact our Director of Recruiting.\n<br><br>\nAll job offers are contingent on a background check screen that complies with applicable law. For San Francisco office candidates, Ancestry will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of San Francisco's Fair Chance Ordinance.\n<br><br>\nIND1\n<br><br>\n#LI-Post\n<br><br>\n#GDSponsored\n<br><br>\n#APIEngineer"}