{"job title": "Staff Software Engineer (Network Visibility)", "company": "AppDynamics", "city state": "– San Francisco, CA, United States", "rating": "4.6", "job description": "<p><b>About Us<br></b></p><p>AppDynamics is the Application Intelligence company. With AppDynamics, enterprises have real-time insights into application performance, user performance and business performance so they can move faster in an increasingly sophisticated, software-driven world. Our integrated suite of products is built on our innovative, enterprise-grade App iQ Platform that enables our customers to make faster decisions that enhance customer engagement and improve operational and business performance. AppDynamics is uniquely positioned to enable enterprises to accelerate their digital transformations by actively monitoring, analyzing, and optimizing complex application environments at scale which has led to proven success and trust with the Global 2000.<br><strong><br>About You<br></strong></p><p>You are the kind of engineer who is passionate about programming, have a good understanding of distributed systems and are keen to solve challenging problems.<br><br>You also have:</p><ul><li>8+ years of strong product development experience.</li><li>Strong experience in full-stack development using Java.</li><li>Strong foundation in data structures, algorithms, concurrent programming</li><li>Experience in building scalable distributed systems with low operational overhead. </li><li>Working knowledge of Gradle and UNIX Shell Scripting</li><li>Familiarity with contemporary open source frameworks/libraries used in building RESTful services and distributed systems.</li><li>Ability to drive innovations around new features as well as improve current design/architecture.</li><li>Good communication, interpersonal and collaboration skills.</li><li>Have a track record of collaborating effectively in a distributed team spread across time zones.</li></ul><p>It is a plus if you have,</p><ul><li>Network / Application Performance Monitoring, Server / Container monitoring</li><li>J2EE, Micro services, Databases </li><li>Machine learning and analytics</li><li>SDN, Network protocols, Network Proxies, Firewalls, and Load Balancers</li><li>Python, Scripting, Docker</li></ul><p><strong>About the Role <br></strong></p><p>As a Staff Software Engineer at AppDynamics, you will be responsible for building everything from proof-of-concepts and usability prototypes to deployment-quality code. As part of the role, you will have the opportunity to work on building Microservices to be deployed on our SaaS and on-premise products.<br><b><br>Perks<br></b></p><p>We know that the award-winning culture at AppDynamics is something to brag about, but here are more reasons that make you excited to get out of bed to come in the morning, like:</p><ul><li>Medical, dental, vision coverage</li><li>401k match (4.5%)</li><li>Wellness perks (gym, hobbies, education, store discounts, personal finance)</li><li>4 weeks PTO, 5 days VTO, 14 holidays (including 1 birthday PTO and 1 floating holiday)</li><li>Mandatory company shut down between Christmas and New Years</li><li>Weekly catered breakfast and lunch, and all the snacks, fruits and drinks your heart desires, monthly happy hour events, and weekly massages</li><li>Brand new state of the art office in downtown San Francisco, centrally located near BART, Caltrain, Muni, the ferry, and a bike share station</li><li>Free shuttle service and pre-tax commuter benefits</li></ul><b>Just a note</b><br><p>Note to Recruiters and Placement Agencies: AppDynamics does not accept unsolicited agency resumes. Please do not forward unsolicited agency resumes to our website or to any AppDynamics employee. AppDynamics will not pay fees to any third party agency or firm and will not be responsible for any agency fees associated with unsolicited resumes. Unsolicited resumes received will be considered property of AppDynamics.<br></p><p>AppDynamics is an equal opportunity employer and considers all qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, protected veteran status, or any other unlawful factor. AppDynamics complies with all applicable laws, including those regarding consideration of qualified applicants with criminal histories (such as the San Francisco Fair Chance Ordinance). If your disability makes it difficult for you to use this site, please contact talent@appdynamics.com. AppDynamics participates in E-Verify.<br><br>#CC-1</p><p><b>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</b></p>"}