{"job title": "Engineer 3, Software Development &amp; Engineering", "company": "Comcast", "city state": "– Mount Laurel, NJ", "rating": "3.5", "job description": "Comcast brings together the best in media and technology. We drive innovation to create the world's best entertainment and online experiences. As a Fortune 50 leader, we set the pace in a variety of innovative and fascinating businesses and create career opportunities across a wide range of locations and disciplines. We are at the forefront of change and move at an amazing pace, thanks to our remarkable people, who bring cutting-edge products and services to life for millions of customers every day. If you share in our passion for teamwork, our vision to revolutionize industries and our goal to lead the future in media and technology, we want you to fast-forward your career at Comcast.\n<br><br>\nDUTIES: Contribute within teams responsible for providing infrastructures and custom applications that support the provisioning, monitoring, troubleshooting, and reporting of cable modems and Customer Premises Equipment over DOCSIS, DHCP, and TR-069 based protocols; perform critical systems analysis, functional design and development of software components, including the specification, implementation, and validation of Java/J2EE-based applications in a Big Data environment; build applications and solutions within the network infrastructure, using DHCP, TFTP, SNMP, TR-069 and DOCSIS protocols; utilize knowledge of Java/J2EE technologies (Spring, Spring Boot, Hibernate, Web Services) to describe high-level implementation details with respect to design patterns and open source framework; utilize Hadoop, Apache Kafka, Spark and Zookeeper to develop Big Data applications, develop applications/schema/ models to store and retrieve data using NoSQL databases and Cassandra; define data pipelines and develop plugins with Fluentd; define and build pipelines for application integration and deployment, using GoCD and Ansible; provide production support through troubleshooting applications in production, developing automation framework for application build and monitoring, and performance tuning, utilizing the following DevOps tools in a Linux environment: Ansible, GitHub, AppDynamics, Kibana, ElasticSearch, and Unix commands; develop Proof of Concept for current key technological concepts within the Big Data space; evaluate monitoring frameworks and APIs pertinent to the application space; and participate in Agile planning, forecasting project scope and schedule and documenting detailed user stories.\n<br><br>\nREQUIREMENTS: Bachelor's degree (or foreign equivalent) in Computer Science, Engineering, or a related technical field, and two (2) years of software development experience using Java/J2EE, and Big Data technologies (Hadoop, Kafka, Spark and Zookeeper); of which one (1) year must include software development experience using Cassandra, and DevOps tools, specifically: Ansible, GoCD, GitHub, Kibana, ElasticSearch, Unix Shell scripting, and of which one (1) year experience must include experience with DHCP, DOCSIS and TR-069 protocols.\n<br><br>\nComcast is an EOE/Veterans/Disabled/LGBT employer"}