{"job title": "Engineer 3, SW Development and Engineering", "company": "Comcast", "city state": "– Philadelphia, PA", "rating": "3.5", "job description": "Comcast brings together the best in media and technology. We drive innovation to create the world's best entertainment and online experiences. As a Fortune 50 leader, we set the pace in a variety of innovative and fascinating businesses and create career opportunities across a wide range of locations and disciplines. We are at the forefront of change and move at an amazing pace, thanks to our remarkable people, who bring cutting-edge products and services to life for millions of customers every day. If you share in our passion for teamwork, our vision to revolutionize industries and our goal to lead the future in media and technology, we want you to fast-forward your career at Comcast.\n<br><br>\nDUTIES: Contribute to teams responsible for developing and supporting the Xfinity Home and Xfinity xFi platforms, along with their attendant client applications, which allow customers to access their home security and broadband systems; develop, monitor, and support Enterprise Scala applications within Play framework and NoSQL Cassandra data stores; develop and support software and the data platforms that underlie the Xfinity Home Continuous Video Recording platform using Agile methodologies; conduct integration and unit testing to ensure that code and behavior are correct across systems; utilize Hashicorp tool suite to manage immutable infrastructures; analyze and support message-based systems; analyze, build, and support distributed systems on platforms such as Cassandra; develop and document software artifacts and new platform features; develop and support the Xfinity platform topology; write Enterprise Scala code that is able to interact with NoSQL databases such as Apache Cassandra within Play framework; interface with Engineering, QA, and Product divisions across the company to develop and implement technical requirements; and build dashboards, tools, and processes to monitor the company's national systems.\n<br><br>\nREQUIREMENTS: Bachelor's degree (or foreign equivalent) in Engineering, Computer Science, or a related technical field, and two (2) years of experience developing Enterprise Scala applications within Play framework and NoSQL Cassandra data stores using Agile methodologies; conducting unit and integration testing for software systems; and analyzing and supporting message-based systems; of which one (1) year must include utilizing the Hashicorp tool suite to manage immutable software infrastructures; and supporting message-based and distributed software systems.\n<br><br>\nComcast is an EOE/Veterans/Disabled/LGBT employer"}