{"job title": "Manager, Engineering", "company": "Comcast", "city state": "– Philadelphia, PA", "rating": "3.5", "job description": "Comcast brings together the best in media and technology. We drive innovation to create the world's best entertainment and online experiences. As a Fortune 50 leader, we set the pace in a variety of innovative and fascinating businesses and create career opportunities across a wide range of locations and disciplines. We are at the forefront of change and move at an amazing pace, thanks to our remarkable people, who bring cutting-edge products and services to life for millions of customers every day. If you share in our passion for teamwork, our vision to revolutionize industries and our goal to lead the future in media and technology, we want you to fast-forward your career at Comcast.\n<br><br>\nDUTIES: Manage a team, consisting of 8 software developers and test engineers, within the Digital Home Client Engineering organization, responsible for the development of customer-facing client applications, including Xfinity Home mobile, web, X1, and touchscreen applications; collaborate with cross-functional teams, including management, web, mobile and API developers, UX (user-experience) designers, test engineers, operations engineers, and product and business managers, to manage the development of features, testing, and quality improvements for Xfinity Home Video &amp; Camera applications in an Agile environment; oversee planning and design of iOS mobile applications written in Objective-C and Swift programming languages; utilize knowledge of algorithms, design patterns, and data structures to review software code and design decisions, and provide feedback and guidance to project teams; provide guidance to Software Engineering team and other departments in identifying product and technical requirements; lead teams in planning, prioritizing, and coordinating tasks, and managing backlog of prioritized work; ensure all engineers keep current with technological developments within the industry, and evaluate competitive applications and products; direct implementation initiatives for new software products and applications; organize software update processes for existing applications and coordinate the roll-out of software releases; manage the entire Software Development Lifecycle (SDLC), including development, testing, code promotion, and production support; manage all deliverables to ensure adherence to deadlines, specifications, and budgets; implement performance metrics and prepare periodic reports, tracking project progress and reporting findings to the leadership team; raise any issues or concerns to high-level Engineering Managers, troubleshooting and triaging issues as they arise; plan future projects with Product Management; participate in daily Agile scrum meetings, ensuring engineering best practices and team goals are met; conduct performance reviews of subordinate employees and ensure performance adheres to company standards; and recruit, train, and guide staff members.\n<br><br>\nREQUIREMENTS: Bachelor's degree (or foreign equivalent) in Computer Science, Engineering, or a related technical field, and six (6) years of experience developing enterprise-level applications, including mobile application development (iOS or Android) utilizing Objective-C programming language; two (2) years of which must include experience writing algorithms, using data structures and design patterns; and project management experience in an Agile environment; and one (1) year of which must include experience utilizing Swift programming language\n<br><br>\nComcast is an EOE/Veterans/Disabled/LGBT employer"}