{"job title": "Engineer 3", "company": "Comcast", "city state": "– West Chester, PA", "rating": "3.5", "job description": "Comcast brings together the best in media and technology. We drive innovation to create the world's best entertainment and online experiences. As a Fortune 50 leader, we set the pace in a variety of innovative and fascinating businesses and create career opportunities across a wide range of locations and disciplines. We are at the forefront of change and move at an amazing pace, thanks to our remarkable people, who bring cutting-edge products and services to life for millions of customers every day. If you share in our passion for teamwork, our vision to revolutionize industries and our goal to lead the future in media and technology, we want you to fast-forward your career at Comcast.\n<br><br>\nDUTIES: Contribute to team responsible for operating, deploying, managing, and continuously improving Comcast's Voice, Video, Commercial, Data, Home Security, Systems and Network services and associated infrastructure such as routers, CMTS (cable modem termination systems), switches, optical and TDM (time division multiplexing) transport, applications, servers, IP (internet protocol) scopes, and databases; participate in managing a 24x7 operations service for network applications, receiving and addressing tickets from internal and external customers reporting outage conditions, troubleshooting the network to identify the source, and implementing fixes for network-related issues; monitor, isolate, triage, and resolve outages and impairments, and develop automated scripts to identify and mitigate outage conditions more quickly; configure networks using Cisco and Juniper equipment and OSPF, BGP, EIGRP and MPLS protocols; administer Juniper, Cisco and Arista routers and switches, along with F5 Load Balancers, implementing upgrades when needed; perform load balancing; work with firewalls, routers, CMTS, and associated protocols; utilize knowledge of load balancing, routing, and layers 1-3 of the protocol stack to maintain and enhance the network infrastructure and network topology; investigate alarms and create appropriate documentation, such as trouble tickets, in the company's internal system; design, code, test, deploy and evaluate highly reliable programs and scripts; analyze system needs, determine prioritization and provide resolution of break/fix scenarios; study, evaluate, analyze and monitor the network and services to determine problem areas; implement code changes and suggest improvements to ensure the availability of networking services; work with external vendors, third parties, and associated agencies to address PSTN (public switched telephone network) issues; and provide after-hours support for code deployments, changes, and general support/troubleshooting by serving as a highly available point of escalation on a 24x7 basis.\n<br><br>\nREQUIREMENTS: Bachelor's degree (or foreign equivalent) in Computer Science, Engineering, or a related technical field; and two (2) years of experience in network administration including administering Juniper, Cisco, and Arista routers and switches along with F5 Load Balancers; developing automation scripts to mitigate outage conditions; and of which one (1) year must include performing load balancing within an enterprise-scale network environment.\n<br><br>\nComcast is an EOE/Veterans/Disabled/LGBT employer"}