{"job title": "Order Management Data Analyst", "company": "Curriculum Associates", "city state": "– Littleton, MA, United States", "rating": "4.5", "job description": "<div><div>Curriculum Associates is a rapidly growing educational technology and publishing company committed to making classrooms better places for teachers and students. Located just outside of Boston, we are an innovative, collaborative, and mission-driven company that has been recognized as a Boston Globe Top Workplace and Boston Business Journal Best Place to Work. We believe that all children have the ability to succeed, and this idea inspires our engineering, product development, and service teams every day. Our award-winning products include both traditional published material and EdTech products such as our cloud-based i-Ready®. Our programs provide flexible resources for teachers and administrators, as well as meaningful assessments and data-driven, differentiated instruction for millions of students.\n<br><br>\nOrder Management Data Analyst\n<br><br>\nWe are looking for a talented individual to join our Customer Sales and Service World Award Winning team. As an Order Management Data Analyst, you will be responsible for the report creation and auditing to monitor the accuracy and timely processing of sales/sample orders and returns. In particular, this role will be responsible for documenting and understanding the downstream impact of returns processing and ensuring all returns and or credits/voids are processed accurately.\n<br><br>\nThis role will also be responsible for managing the weekly files from 3rd party depositories, including preparing the data sets to meet our order entry requirements. This role will assist in the data processing/preparation via excel for large complex orders. You will hone your analytical and data-driven problem-solving skills while gaining an understanding of the K-8 educational industry. In addition to working with the sales team, you will interact with a variety of other departments, including Sales Operations and Finance.\n<br><br>\nThe impact youll have:\n<br><br>\n• Support the technology, tools, resources and processes required to create / maintain consistent order entry processes/data.\n<br><br>\n• Ensure data quality and accuracy, understand end-to-end data flows and downstream impact.\n<br><br>\n• Create and maintain Returns Process documentation and weekly reporting for auditing.\n<br><br>\n• Create weekly metric reporting around order and call volumes.\n<br><br>\n• Prepare data for sales order entry from book depositories for state contracts to ensure order process compliance.\n<br><br>\n• Participate in the improvement, documentation, and review of all work procedures pertaining to Order management.\n<br><br>\n• Leverage your advanced Excel skills to create efficiencies within the team.\n<br><br>\n• Help to further develop internal tools and processes by providing feedback regarding their performance, efficacy, and efficiency.\n<br><br>\n• Ad Hoc support for order entry during busy season.\n<br><br>\nWhat we are looking for:\n<br><br>\n• Bachelors degree and 2 5 years of work experience\n<br><br>\n• Tech savvy with advanced Excel skills\n<br><br>\n• Very strong attention to accuracy and detail\n<br><br>\n• Proven organizational skills and superior time management\n<br><br>\n• Demonstrated problem solving and analytical capabilities\n<br><br>\n• A team player who works productively and cooperatively with a wide range of people\n<br><br>\n• Excellent written and verbal communication skills\n<br><br>\n• Ability to work independently\n<br><br>\n• Someone who thrives in a fast-paced environment\n<br><br>\n• Growth mindset with a commitment to ongoing learning\n<br><br>\n• Willingness to adjust to and enforce changing processes\n<br><br>\n• Salesforce.com experience preferred\n<br><br>\n• SQL and/or Domo experience preferred\n<br><br>\nLocation:\n<br>\nThis role is in our Littleton, MA office located just minutes from The Point, a mixed-use destination combining shops, restaurants, and entertainment. Home to our Sales and Service, Warehouse, and award-winning Customer Service teams, this group enjoys monthly lunches, birthday celebrations, and complimentary round-trip shuttle service from the Gallagher Commuter Rail Station in Lowell.</div></div>\n<br><strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}