{"job title": "Senior Systems Engineer", "company": "DDN Storage", "city state": "– US-CO-Colorado Springs", "rating": "3.7", "job description": "<div><div>\n<div><strong>DataDirect Networks (DDN.com</strong><strong>)</strong> is a world leader in massively scalable storage. We are the leading provider of data storage and processing solutions and professional services that enable content-rich and high-growth IT environments to achieve the highest levels of systems scalability, efficiency and simplicity. DDN enables enterprises to extract value and deliver results from their information. Our customers include the world's leading online content and social networking providers, high performance cloud and grid computing, life sciences, media production organizations and security &amp; intelligence organizations.</div>\n</div>\n</div>\n\n<br>Job Description<br>\n\n<div>\n<div>\n<div><strong>We are currently seeking a Senior Systems Engineer to work in Colorado Springs, CO.</strong>\n<br><br>\nThe Senior Systems Engineer is responsible for many facets of the local IT infrastructure in support of day to day productivity as well as maintaining and improving the automated and manual test infrastructure. This includes designing, organizing, modifying, and supporting the local computer systems (LANs, WANs, Internet and intranet systems, network segments) as well as contributing to the local Continuous Integration development team through infrastructure improvements, PXE boot upgrades and test development. Close coordination with the corporate IT team as well as the local and remote development and test teams will occur on a daily basis.\n<br><br>\n<strong>Responsibilities for this role include but are not limited to:</strong>\n<ul>\n<li>Manage installation, configuration, setup, testing, troubleshooting, documentation, and decommissioning of storage, servers and associated equipment and hardware.</li><li>Drive infrastructure changes in support of global Continuous Integration environment across programs.</li><li>Script tests as part of the Automation Infrastructure team</li><li>Perform system backups and restoration of systems as required in accordance with DDN policies and procedures.</li><li>Perform configuration management, testing and troubleshooting of systems.</li><li>Position will require the full range of architecture, engineering, and process experience in the migration of linux or windows systems</li><li>Perform storage administration</li><li>Support LANs, WANs, network segments, Internet, and intranet systems.</li><li>Monitor networks to ensure security and availability to specific users.</li><li>Assign routing protocols and routing table configuration.</li><li>Maintain local network facilities including network servers such as file servers, VPN gateways, etc..</li><li>Administer local servers, printers, routers, switches, firewalls, phones, security updates and patches.</li>\n</ul>\n<strong>Qualifications for this role are</strong><strong>:</strong>\n<ul>\n<li>Bachelors Degree in Computer Science or a related Technical Degree with 8+ years of overall equivalent relevant experience.</li> <li>10+ Years of on the job experience in a related field</li><li>Experience in managing Microsoft Windows Environment(Vista/Window 7): Windows Server 2003/2008, Microsoft Exchange, ISA, Sharepoint, SQL Server.</li><li>Extensive knowledge of LANs and PC hardware set up and support, network printers, and storage technology.</li><li>Active Directory</li><li>Unix programming experience is a plus</li><li>Experience with Perl, Python or other scripting languages</li><li>Positive attitude and a desire to learn new skills</li><li>Ability to adapt and learn quickly</li><li>Self-starter with a strong drive to perform at a high level</li><li>Team player with the ability to communicate well with others</li><li>Excellent written communication skills</li></ul></div>\n</div>\n</div>\n\n<br>DDN Core Characteristics<br>\n\n<div>\n<div>\n<div>DDN has a very strong orientation towards these 4 characteristics and any successful employee will demonstrate these capabilities:\n<br><br>\n<strong>Self-Starter -</strong> Takes independent action to identify and solve problems. Seeks out relevant information needed to make decisions. Gets involved with new initiatives.\n<br><br>\n<strong>Success/Achievement Orientation -</strong> Delivers quality results consistently. Targets, achieves (or exceeds) measurable results. Sets challenging goals, focuses on critical priorities, and is accountable.\n<br><br>\n<strong>Problem Solving -</strong> Recognizes problems and responds with a systematic assessment that identifies and addresses cause of issue. Practical, realistic, and resourceful.\n<br><br>\n<strong>Innovative -</strong> Builds and improves key business processes that enhance the effectiveness of DDN. Generates new ideas, challenges the status quo, and solves problems creatively.\n<br><br>\n<strong>DataDirect Networks, Inc. is an Equal Opportunity/Affirmative Action employer.</strong> All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity, gender expression, transgender, sex stereotyping, sexual orientation, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law.</div>\n</div>\n</div>\n<br>"}