{"job title": "Operational Test Engineer - CBP BI, DHS Clearance or TS/SCI required", "company": "General Dynamics Information Technology", "city state": "– USA VA Crystal City", "rating": "3.3", "job description": "<u><strong>Clearance Level Must Currently Possess:</strong></u><br><br>Top Secret<br><br><u><strong>Clearance Level Must Be Able to Obtain:</strong></u><br><br>Top Secret<br><br><u><strong>Suitability:</strong></u><br><br>Agency Specific<br><br><u><strong>Job Family:</strong></u><br><br>Engineering &amp; Sciences<br><br><u><strong>Job Description:</strong></u>\n<br><br>\nGDIT provides technical support services to the Office of Acquisition (OA) of the U.S. Customs and Border Protection (CBP), the nation’s largest law enforcement agency. Experienced GDIT personnel enhance CBP’s proficiencies in Systems Engineering, Logistics &amp; Sustainment, and Capabilities and Requirements Development to provide CBP’s agents along our borders with the most capable systems which can affordably be procured. The team provides engineering and analytical expertise across a wide range of disciplines, meeting all DHS Systems Engineering Life Cycle mandated planning analysis and documentation; provide a full spectrum of Integrated Logistics Support; development of Operational Requirements; and conduct Operational Test &amp; Evaluation activities. We help CBP procure the equipment and technology needed to keep the border safe and secure.\n<br><br>\nCurrently, we are seeking an Operational Tester in <strong>Crystal City, VA.</strong> The selected candidate must currently hold or be able to obtain a CBP Background Investigation Suitability clearance, per contract requirements.\n<br><br>\nSo what is required of a on an Operational Tester’s day to day basis? There are quite a myriad of tasks and responsibilities, such as:\n<ul>\n<li>Assists with the planning, execution and reporting of test and evaluation events.Operational Test Engineers plan, conduct, lead and advise CBP (and sub-components) on operational test and evaluation methods, test designs, test sufficiency and data analysis.</li><li>Operational Test Engineers support the generation of test and evaluation documents, to include Test and Evaluation Master Plans, Test Plans, Test Reports and briefing materials in support of a CBP test campaign, as well as providing review of Operational Requirements Documents, Concepts of Operation and Standard Operating Procedures.</li><li>Operational test engineers also counsel CBP on the development of test scenarios, methodologies to obtain in-field observations, statistical analysis of test results and presentation of test findings to operational and senior decision makers.</li>\n</ul>\nIs this job the next step in your career? Are you ready to help keep America’s border safe?\n<br><br>\nTo qualify, you must meet these basic qualifications:\n<ul>\n<li>Must be a US citizen.</li><li>US Customs and Border Protection (CBP) suitability clearance (or ability to obtain).</li><li>Possess a current U.S. Secret clearance based on a current in-scope background investigation.</li><li>BA/BS in Engineering or relevant technical discipline</li><li>3-5 years’ experience as a test and evaluation engineer within the federal government or industry.</li><li>Good communication skills and ability to present analytical results (written or oral) to senior leadership (Military, DHS, Industry).</li><li>Proficient in Microsoft Office Suite (2013).</li>\n</ul>\nOther qualifications include:\n<ul>\n<li>Experience as an operational test and evaluation engineer within the Department of Homeland Security (DHS) or Department of Defense (DoD).</li><li>Experience working with or under the oversight of the DoD or DHS Director of Test and Evaluation (DOT&amp;E).</li> <li>Possess a current U.S. Top Secret clearance based on a current in-scope background investigation with SCI eligibility.</li><li>Proficient with test and evaluation planning, execution and reporting processes</li><li>Experience creating test and evaluation artifacts, to include: Test and Evaluation Master Plans (TEMP), test and analysis plans and test reports.</li>\n</ul>\n#cjobs #dicepost #cjobs\n<br><br>\n<u><strong># of Openings:</strong></u><br><br>1<br><br><u><strong>Scheduled Weekly Hours:</strong></u><br><br>40<br><br><u>T<strong>elecommuting Options:</strong></u><br><br>Telecommuting Not Allowed<br><br><u><strong>Work Location:</strong></u><br><br>USA VA Crystal City - 1901 S Bell St (VAC064)<br><br><u><strong>Additional Work Locations:</strong></u>\n<br><br>\n<strong>CSRA is committed to creating a diverse environment and is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</strong>"}