{"job title": "Senior HPC / Scientific Systems Engineer (Unix/Linux)", "company": "General Dynamics Information Technology", "city state": "– Rockville, MD", "rating": "3.3", "job description": "<u><strong>Clearance Level Must Currently Possess:</strong></u><br><br>No Active Clearance Required<br><br><u><strong>Clearance Level Must Be Able to Obtain:</strong></u><br><br>No Active Clearance Required<br><br><u><strong>Suitability:</strong></u><br><br>Public Trust<br><br><u><strong>Job Family:</strong></u><br><br>Engineering &amp; Sciences<br><br><u><strong>Job Description:</strong></u>\n<br><br>\nThe Scientific Systems High Performance Computing [HPC] Engineer [SSE] will support the Linux/Unix-based gene sequencing and bioinformatics needs of the National Human Genome Research Institute (NHGRI) within the National Institutes of Health (NIH).\n<br><br>\nThis role requires regular, close collaboration with Data Center, VMware, Oracle, Storage, Backup, and SQL Administrators, as well scientific investigators. This is a customer-service focused environment with the associated business needs of an advanced research environment, requiring high reliability and 24 x 7 uptime.\n<br><br>\nThe candidate will need extensive experience with large high performance supercomputers, as well an intimate, in-depth knowledge of the myriad applications that run on them; conformably, a demonstrated competency in the design, build, and configuration of services necessary for research computing, and underlying scripting capability, is necessary.\n<br><br>\nJob Responsibilities and Duties:\n<ul>\n<li>Diagnose hardware and software problems and replace defective components</li><li>Perform data backups and disaster recovery operations.</li> <li>Maintain and administer computer networks and related computing environments, including computer hardware, systems software, applications software, and all configurations.</li> <li>Plan, coordinate, and implement information security measures to protect data, software, and hardware.</li> <li>Utilize monitoring systems to assess the performance of computer systems and networks.</li><li>Perform routine system startup and shutdown procedures and maintain change records.</li><li>Build and maintain high performance clusters [HPC]; design, configure, and test computer hardware, networking software and operating system software.</li> <li>Recommend changes to improve systems and network configurations’ to determine hardware or software requirements related to such changes</li><li>Monitor network performance to determine whether adjustments need to be made, and where changes may be required in the future.</li><li>Design and implement disaster recovery plans; implement backups with tools like NetWorker.</li><li>Actively monitor IT maintained systems with monitoring tools, such as Nagios</li><li>Participate and adhere to change management processes</li><li>Resolve escalated issues from Tier 2 and Tier 3 to assist desktop support team</li>\n<li>Create and Maintain documentation, including change and configuration management principles</li>\n<li>Conduct briefings and participate in technical cross-functional meetings</li>\n\n</ul>\nRequired Qualifications and Skills:\n<ul>\n<li>BS and nine years experience or MS and seven years experience or the equivalent experience and education</li><li>Minimum of three years experience with UNIX/Linux HPC systems, system administration tools, methodologies, and security practices; CentOS and Red Hat Knowledge.</li><li>Domain knowledge in HPC and system software, such as cluster management/provisioning tools, job schedulers, MPI, etc.</li><li>In-depth understanding of one or more of the technology fields in HPC, such as storage (FC, SAS, iSCSI, FCoE), high speed interconnects (InfiniBand, 10GigE, etc), cluster file systems (GPFS, pNFS, Lustre, PVFS), provisioning tools.</li><li>Three years Versioning experience in code and packages, including use of Git, \\\"diff,” and patch files</li><li>Experience writing shell scripts in a production Unix environment</li><li>Three years experience with programming languages (Python, C, Ruby, Perl, or R)</li><li>Two years Application experience (Ansible, SaltStack, CFEngine or Puppet)</li><li>Ability to Rack and stack servers and network equipment</li><li>Experience with RPM / Package building</li><li>RedHat Certified Engineer (RHEL 7 Enterprise Linux preferred)</li>\n</ul>\nAttributes for Success:\n<ul>\n<li>Excellent verbal and written communication skills</li><li>Good analytical skills</li>\n</ul>\nSummary:\n<ul>\n<li>Provide coverage during normal business hours; pre-scheduled after hours maintenance windows; occasional “best effort” support during after hours emergencies</li><li>Ability to obtain Public Trust Clearance</li><li>Customer service focus</li>\n</ul>\n<u><strong># of Openings:</strong></u><br><br>1<br><br><u><strong>Scheduled Weekly Hours:</strong></u><br><br>40<br><br><u>T<strong>elecommuting Options:</strong></u><br><br>Telecommuting Not Allowed<br><br><u><strong>Work Location:</strong></u><br><br>USA MD Rockville - 5635 Fishers Ln, Ste 1400 (MDC145)<br><br><u><strong>Additional Work Locations:</strong></u>\n<br><br>\n<strong>CSRA is committed to creating a diverse environment and is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</strong>"}