{"job title": "Senior Software Engineer", "company": "Investor Management Services", "city state": "– Raleigh, NC", "rating": "4.4", "job description": "<strong>Summary/Objective of Position:</strong><br>\n<p>Investor Management Services (IMS), the leading Software-as-a-Service (SaaS) company targeting the commercial real estate industry, is looking for a proven, superstar Senior Engineer (Front- or Back-End). You will play a key senior role on our front end team, architecting and implementing the user interfaces in AngularJS/React or Ruby On Rails. You will work both within our development team as well as IN other roles to ensure we are implementing market-first software.</p>\n<p>We are a well-funded startup that is growing fast with a team that has a history of building successful companies. We need to continue to build out new features and ensure customers are on-boarded smoothly all while seamlessly scaling to support our growth.</p>\n<p>Our platform enables commercial real estate investment sponsors to proactively manage their investors, investments, and properties. It is a game changer for their businesses! The platform has both a heavy front end - investor dashboards, CRM, etc. - and back end - complex financial calculations and data models.</p>\n<p>Our software is complex - but you thrive in simplifying complexity. If you have the technical chops and are ready to build a successful software startup that does things the right way, keep reading.</p>\n<br><strong> <br> Responsibilities:</strong>\n<ul>\n<li>Play a significant role in the architecture and implementation (including implementing automated test cases for your code) of the front end or back end of our software.</li>\n<li>Work with a team of software engineers to provide mentorship and growth.</li>\n<li>Feel like an owner. You will be empowered to solve hard technical problems and ensure we are executing on our roadmap while not missing a step in uptime, scalability, and security.</li>\n<li>Provide input to our roadmap ensuring it is a balance of what we need to lead the market and what we need to deliver a well-architected, reliable, high-quality platform.</li>\n<li>Help align the development team with the entire organization and customers. Work collaboratively with other teams including product management, UX, customer success, data and analytics, sales, and marketing. You must thrive in a transparent, high-growth, non-siloed culture.</li>\n<li>Learn every day. We are a startup. Every day we learn and improve.</li>\n</ul>\n<strong> <br> Competencies for Success in This Role:</strong>\n<ul>\n<li>You are A level talent – an exceptional front or back end engineer and architect that works well with others.</li>\n<li>You are a self-starter with strong work ethic, common sense, and a positive attitude. You thrive in a transparent, high-growth startup environment including constantly looking at ways to make your team and whole company more effective.</li>\n<li>You have excellent written and oral communication skills.</li>\n<li>You work well with other teams in the organization.</li>\n<li>You have great attention to detail. You take a results-driven approach to problem-solving.</li>\n</ul>\n<strong> <br> Required Education and Experience:</strong>\n<ul>\n<li>Bachelor’s degree in Computer Science, Computer Engineering, or equivalent required.</li>\n<li>For front end engineers: extensive production software experience with Javascript, AngularJs, or React.</li>\n<li>For back end engineers: extensive production software experience with Ruby On Rails or a similar framework like Grails, Django, Spring, etc. Experience with a successful transition to microservices architecture is a big plus.<br></li>\n<li>5+ years experience in a software engineering role in a successful, agile (scrum), SaaS software company that has served hundreds of customers and hundreds of thousands of end users.</li>\n</ul>\n<strong> <br> Location:</strong><br><br>This role is located in Raleigh, North Carolina."}