{"job title": "Usability Engineer", "company": "iRhythm", "city state": "– San Francisco, CA", "rating": "3.8", "job description": "<strong>About iRhythm:</strong>\n<br><br>\niRhythm is a leading digital healthcare company focused on the way cardiac arrhythmias are clinically diagnosed by combining our wearable biosensing technology with powerful cloud-based data analytics and machine- learning capabilities. Our goal is to be the leading provider of first-line ambulatory ECG monitoring for patients at risk for arrhythmias. iRhythm's continuous ambulatory monitoring has already put over 1 million patients and their doctors on a shorter path to what they both need answers.\n<br><br>\n<strong> iRhythm's Design &amp; Usability Team</strong>\n<br><br>\nWe're excited to bring beautifully crafted experiences both in form and function into the medical device space. Being part of the design team means bringing the voice of our patients and healthcare professionals to the forefront of conversations for new initiatives and improvements. We enjoy designing mobile apps, websites, hardware products, and packaging that embrace the challenges of our users and their environments whether that's a doctor having a busy day at the hospital or one of our more senior patients using our heart monitor at home. We believe that the best products are created through close knit collaboration with cross functional teams and we love facilitating that teamwork. Our focus on learning gets us out in the field and gathering feedback from our users a key part of our process.\n<br><br>\n<strong>About this Role:</strong>\n<br><br>\nIn this role, you will be responsible for coordinating usability efforts to formulate valuable insights into user workflows that drive design and development. You will define the usability requirements for products and features with customer needs, business needs, and research feedback as input. You will actively be setting the strategic direction of the experience through insights learned from research and be responsible for maintaining documentation for all usability efforts. You will establish usability guidelines and end-to-end user journeys across products and programs.\n<br><br>\nWhile your focus will be on understanding workflows and usability, you will pair closely with a product designer to develop concepts for testing and design experiences that incorporate research insights. You will have the opportunity to collaborate with several teams at the company and spearhead creating a shared vision around the experience.\n<br><br>\n<strong>Are you the Usability Engineer we're looking for?</strong>\n\n<ul>\n<li>You are a natural collaborator and enjoy the process of synthesizing feedback from multiple perspectives into actionable insights and workflow improvement suggestions</li>\n<li>You can develop a network within the company to support learning and feedback for new concepts and research</li>\n<li>You are an excellent communicator and maintain ongoing communication with project stakeholders</li>\n<li>You can visualize complex workflows and communicate those out to other teams. You can develop these and maintain them as tools for the design team and other teams at the company</li>\n<li>You have a deep understanding of usability strategy as it relates to medical devices and can adapt that as needed based on the product and risk evaluation</li>\n<li>You enjoy pairing on projects with a designer that has complementary skills</li>\n<li>You are looking for a role where you can make a significant impact to ensure the usability and safety of products used by patients and healthcare professionals.</li>\n</ul>\n<strong>About You:</strong>\n\n<ul>\n<li>Expert in usability strategy and best practices including defining usability evaluation plans, conducting testing, and ensuring that product requirements follow regulatory guidelines</li>\n<li>Experience defining protocols for summative and formative testing for hardware products and software experiences</li>\n<li>Conducting usability testing interacting directly with users (patients or healthcare professionals) in both contextual and test environments</li>\n<li>Generating usability reports based on regulatory requirements</li>\n<li>Strong communicator. Works well with cross functional teams to understand workflows and define strategy marketing, sales, quality, and engineering</li>\n<li>Ability to determine testing groups, testing method that works best for the task at hand and manage schedule for collecting feedback</li>\n<li>Understanding of relevant medical device usability regulations and standards</li>\n<li>Bachelor's/Master's in Human Factors, Biomedical Engineering, Cognitive Science, or related field. Minimum 5 years of experience of user research or usability engineering in medical device</li>\n</ul>\n<strong>Application Requirements:</strong>\n\n<ul>\n<li>Resume</li>\n<li>Cover Letter</li>\n<li>A sample of your technical writing and a portfolio that exhibits your creative and thoughtful approach to solving a usability challenge</li> \n</ul>\n<strong>What's in it for you:</strong>\n<br><br>\nThis is a full-time position with competitive salary package and excellent benefits including medical, dental and vision insurance, paid holidays and paid time off.\n<br><br>\nIRhythm also provides additional benefits including 401K (w/ company match), an Employee Stock Purchase Plan, annual organizational/cultural committee events and more!\n<br><br>\n<strong>FLSA Status</strong>: Exempt\n<br><br>\nAs a part of our core values, we ensure a diverse and inclusive workforce. We welcome and celebrate people of all backgrounds, experiences, skills and perspectives. iRhythm Technologies, Inc. is an Equal Opportunity Employer (M/F/V/D). Pursuant to San Francisco Fair Chance Ordinance, we will consider for employment all qualified applicants with arrest and conviction records.\n<br><br>\nMake iRhythm your path forward."}