{"job title": "Senior Software Engineer", "company": "Joya Communications, Inc.", "city state": "– Remote, OR", "rating": "5.0", "job description": "Senior Software Engineer (Mobile Features)\n<br><br>\nWe're looking for a thoughtful and creative client engineer to join our team. You are someone who feels pride from writing solid code, you enjoy creating new user experiences and solving fun technical problems. You delight in making a difference for millions of people in the world and you care about having a joyful work environment. (http://www.getjoya.com/job-senior-software-engineer-mobile-features.html)<br><br>You will:\n\n\n<ul>\n<li>Collaborate with teammates to implement and launch highly visible, user-facing features from start to finish</li>\n\n<li>Produce solid quality code, raising the bar for the whole team on quality and speed</li>\n\n<li>Work with one or more of Swift, ObjectiveC, Java, Kotlin, C++ and/or Python</li>\n</ul>\n\nYou may be a fit if you:\n\n\n<ul>\n<li>Have effective interpersonal, communication, and collaboration skills to work successfully in a 100% remote team environment</li>\n\n<li>Pride yourself on strong foundation in computer science, data structures, algorithms and software design</li>\n\n<li>Are looking for a joyful work environment where you and your teammates look forward to coming to work</li>\n\n<li>Are humble and intellectually curious</li>\n</ul>\nA bit about us... we're on the mission to help people feel close. Our app, Marco Polo® is already reaching millions of people — we're top of charts on iOS and Play Store. We're a distributed, small team, that cares about working joyfully and making a difference in the world.\n<br><br>\nDoes this sound interesting to you? If so, then we'd love to hear from you. We care deeply about diversity and inclusion at Joya. We are an equal opportunity employer and do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We can add teammates from anywhere in the US.\n<br><br>\nWe'd love to see what you might add to our team, please email your resume to jobs@getjoya.com"}