{"job title": "Threat Hunt Hadoop Engineer", "company": "Kingfisher Systems", "city state": "– Kansas City, MO", "rating": "4.3", "job description": "Kingfisher specializes in all aspects of technical and analytic support to cyber operations, including database administration for classified networks, software engineering, web support, and cyber, CI, and all-source analysis. Since 2005, Kingfisher has established itself as a recognized and trusted partner whose mission is safeguarding sensitive information, operations and programs for our Federal customers.\n<br><br>\nDescription:\n<br><br>\nKingfisher Systems, Inc. is seeking a Big Data Systems Engineer with a minimum of 5 years of operational experience with big data systems to include architecture, engineering, development, deployment, operational management, and support of Big Data systems. Expertise in tools and techniques used within Big Data systems, such as Hadoop and Elasticsearch/Logstash/Kibana (ELK) stack. Candidates will be responsible for requirements, documentation, engineering, and support of a government agencys systems. These systems include log collection and analysis, intrusion detection, malware prevention, data loss protection/prevention and other technologies, but will the candidate will specialize in Hadoop system engineering. Interact and team with government and contractor personnel responsible for administering the network and associated systems as well as various software and hardware vendors. Work location is Kansas City, MO, but position is eligible for telecomuting.\n<br><br>\nSkills and Requirements:\n<br><br>\nDesign, implement and support information systems to support USDA ASOC mission, especially Hadoop and its ecosystem. Position requires Enterprise Linux (CentOS and others) systems engineering and support experience as well as strong skills with Hadoop. Required skills and tasks include:\n\n<ul>\n<li>Development, maintenance, and updating scripts and programs in Scala/Java/Python</li>\n<li>Development, maintenance, and updating of Scala projects in Maven and SBT</li>\n<li>Development, maintenance and updating of Spark scripts and programs (author custom scripts/programs for log transformations and enrichment)</li>\n<li>Development and maintenance of Spark Internals to effectively troubleshoot Spark jobs</li>\n<li>Use of Regex, Grok, SQL</li>\n<li>Strong understanding of Hadoop internals, including HDFS, Cloudera Manager, Hive, Impala, Oozie, Yarn</li>\n<li>Provide input to the strategic and tactical planning process upon request.</li>\n<li>Proactively recommend changes and/or enhancements to the systems to provide better efficiency, productivity, stability, and/or cost savings</li>\n</ul>\nEnterprise skills required:\n\n<ul>\n<li>Deliver customized and standard solutions which meet policy compliance requirements</li>\n<li>Coordinate change management processes for testing and validating systems into production</li>\n<li>Ability to estimate the work and deliver the project on schedule within strict time and resource constraints</li>\n<li>Ability to work with project deployment team in a team environment</li>\n<li>Ability to learn the business and product quickly, and adapt to a dynamic development environment</li>\n<li>Ability to communicate with the customers to gather and define the requirements precisely</li>\n</ul>\nPreferred Experience Includes:\n\n<ul>\n<li>Experience with enterprise logging systems and/or SIEMS</li>\n<li>Experience with Enterprise security systems, such as IPS, SIEMs, firewalls, VPN devices, authentication systems</li>\n<li>Familiarity with log/data normalization (including CEF, SPOT, etc)</li>\n<li>Log correlation and event triggering, threat scoring</li>\n<li>Experience with ELK stack (Elasticsearch, Logstash, Kibana, Kafka, syslog) a plus</li>\n<li>Experience with Forescout, Splunk or RES a plus</li>\n<li>Candidate must be competent with processing of text files (XML, JSON, csv, etc)</li>\n<li>Candidate must be competent integrating/using system APIs, RESTful APIs, etc</li>\n<li>Experience with IT security</li>\n</ul>\nClearance:<strong> Minimum Secret level Security Clearance required</strong>\n<br><br>\nDegree: Bachelors Degree in Data Science, Statistics or Computer Science fields.\n<br><br>\nKingfisher Systems, Inc. is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, among other things, or status as a qualified individual with a disability.<br>\n<div>\n</div>\n<br>"}