{"job title": "Software Engineer", "company": "MiTek Industries", "city state": "– Greenwood Village, US-CO", "rating": "3.9", "job description": "MiTek® USA Inc., a subsidiary of Berkshire Hathaway, Inc. is the world's leading supplier of state-of-the-art, engineered connector products, engineering services, and computer-driven machinery for the building component industry. We provide the industry's most advanced, most comprehensive, and most innovative software for design and manufacturing. Our products and services are backed up by a team of industry professionals who are dedicated to one goal – making our customers successful. We are seeking a dynamic and motivated Software Engineer responsible for the design and development of enterprise web solutions targeted at the commercial construction industry. Be part of a team using the latest technologies to demonstrate innovation, learn, and engage our customers while creating amazing software.<br><br>Required Skills<br><br><strong>Duties and Responsibilities:</strong>\n\n<ul>\n<li>Code, test, document, configure, and debug responsive web and middle-tier solutions using C#, ASP.NET, JavaScript, jQuery, Angular, Entity Framework, SQL Server</li>\n\n<li>Report Generation (DevExpress Reporting), occasionally assist desktop software teams.</li>\n\n<li>Collaborate with Requirements, SQA and other development teams to ensure solutions are efficient, consistent and fulfill business needs</li>\n\n<li>Participate in analysis and design, design reviews, and code reviews.</li>\n\n<li>Work in Agile software development environment (using Scrum).</li>\n\n<li>Refactor existing software</li>\n\n<li>Applies generally accepted programming standards and techniques to assure efficient program logic and data manipulation</li>\n\n<li>Attendance during regular work hours and overtime as required.</li>\n</ul>\n<strong>Qualified Candidates Will Possess the Following:</strong>\n\n<ul>\n<li>Bachelor of Science degree in Computer Science or related field.</li>\n\n<li>Two or more years of design and development (web) experience.</li>\n\n<li>Required experience with C# (or C++/Java), JavaScript, HTML, and SQL</li>\n\n<li>Experience working in a service oriented architecture.</li>\n\n<li>Knowledge of data structures and strong understanding of object-oriented principles</li>\n</ul>\n\nRequired Experience<br><br>MiTek is an E-Verify and Drug and Tobacco-Free Workplace We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law.<br><br>Job Location\n<br>\nGreenwood Village, US-CO\n<br>"}