{"job title": "Software Engineer - High Performance Computing", "company": "MITRE", "city state": "– Bedford, Massachusetts", "rating": "3.2", "job description": "<div><div><div><div><div><p>Why choose between doing meaningful work and having a fulfilling life? At MITRE, you can have both. That's because MITRE people are committed to tackling our nation's toughest challenges—and we're committed to the long-term well-being of our employees. MITRE is different from most technology companies. We are a not-for-profit corporation chartered to work for the public interest, with no commercial conflicts to influence what we do. The R&amp;D centers we operate for the government create lasting impact in fields as diverse as cybersecurity, healthcare, aviation, defense, and enterprise transformation. We're making a difference every day—working for a safer, healthier, and more secure nation and world. Our workplace reflects our values. We offer competitive benefits, exceptional professional development opportunities, and a culture of innovation that embraces diversity, inclusion, flexibility, collaboration, and career growth. If this sounds like the choice you want to make, then choose MITRE—and make a difference with us.<br></p>\n<p>\n\n\n</p><p>\n\n</p>\n <p></p>\n<p>MITRE's Mission Oriented Information Systems department is seeking self-starters to work in a multi-disciplinary R&amp;D environment with similarly motivated electrical engineers, mathematicians, and computer scientists to create custom, high performance computing solutions for sensing and communication systems in support of national security and defense. This individual will work with small, distributed teams on software frameworks that support advanced hardware and software based signal processing systems. Being part of the software development team, you will have the opportunity to leverage and grow your software engineering expertise and provide.</p>\n<p> </p>\n<p>• Hands-on Software Design &amp; Development </p>\n<p>• Software Architecture &amp; Design</p>\n<p>• Software Analysis &amp; Assessments </p>\n<p>• User Engagement &amp; Experimentation </p>\n<p>• Software Systems Engineering</p>\n<p> </p>\n<p>Experience with reusable frameworks, library or software toolkit development, is highly desired. Skill in multi-threading and performance optimization is also important. </p>\n<p> </p>\n<p>In addition to understanding modern software engineering, the candidate will support core signal and image processing algorithms, hardware control, GUI design, and database development. </p>\n<p> </p>\n<p>The candidate will be expected to demonstrate disciplined work habits leading to products that are well-structured, documented, and carefully tested. </p>\n<p> </p>\n<p>This position includes frequent interaction with senior technical staff in mentoring relationships.</p>\n \n \n \n\n \n \n \n \n \n <div>\n <p>Minimum Qualifications: </p>\n<p><br>Bachelor's Degree in Electrical Engineering, Computer Science or Computer Engineering or similar field, and 0-3 years of experience. Candidate should understand the missions, domains and challenges of MITRE customers. </p>\n<p> </p>\n<p>• Strong math and analytical skills.</p>\n<p>• Have interest in/aptitude for numerical processing, signal processing, and/or communications processing</p>\n<p> </p>\n<p>• Aptitude in learning/using programming languages; C, C++, Python, Java, SCALA</p>\n<p>• Ability to develop well documented code</p>\n<p>• Interest in mechanisms for process control, signaling, and synchronization </p>\n<p>• Interest and/or experience coding graphics processing units</p>\n<p> </p>\n<p>• Interest and/or experience implementing FPGA firmware</p>\n<p>• Aptitude and interest for configuring small, embedded processors, including their operating systems</p>\n<p> </p>\n<p>• Comfortable with Unix/Linux command-line</p>\n<p> </p>\n<p>Desired Qualifications:</p>\n<p>• Demonstrated skills with C/C++ as well as Python/JVM</p>\n<p>• Understanding of GPU architecture</p>\n<p>• Ability to read algorithm descriptions and write code </p>\n<p> </p>\n<p>• Ability to write clear documents</p>\n<p> </p>\n<p>• Ability to flesh out details of a test plan</p>\n<p>• Understanding of problems and issues of parallelism and concurrency</p>\n<p> </p>\n<p>• Understanding of how to instrument code for performance monitoring</p>\n<p> </p>\n<p>• Ability to read MATLAB code and understand the algorithm </p>\n </div>\n \n \n\n \n <div>\n \n </div>\n \n\n \n </div>\n </div>\n </div>\n\n \n </div>\n\t</div>"}