{"job title": "Sr. Systems Software Engineer (Computer Vision)", "company": "NVIDIA", "city state": "– US, CA, Santa Clara", "rating": "4.4", "job description": "We are now looking for a <strong>Senior Systems Software Engineer (</strong><strong>Computer</strong> <strong>Vision)</strong>!\n<br><br>\nNvidia’s invention of the GPU 1999 sparked the growth of the PC gaming market, redefined modern computer graphics, and revolutionized parallel computing. More recently, GPU deep learning ignited modern AI — the next era of computing — with the GPU acting as the brain of computers, robots, and self-driving cars that can perceive and understand the world. Today, we are increasingly known as “the AI computing company”. We are looking to grow our company, and grow with the smartest people in the world. We are looking for you.<br><br><br><br><strong>What you’ll be doing:</strong>\n<ul>\n<li>You develop Computer Vision algorithms and APIs</li><li>You develop CV tests and validation of SoC features in emulators and simulators</li><li>You review hardware specifications and mapping Computer Vision algorithms to a variety of architectures</li></ul><br><br><strong>What we need to see:</strong>\n<ul>\n<li>BS or MS degree preferred in Computer Science, Computer Engineering or Electrical Engineering, with a minimum of 8+ years of relevant experience</li><li>Experience in embedded Computer Vision, SIMD and parallel computing, with a deep understanding of CV algorithms and multimedia image formats</li><li>Fluent in C &amp; C++, as well as experience in CUDA</li><li>Efficient in SW development in Linux, with a deep understanding about mobile operating system e.g. Linux, Android</li><li>Good knowledge in SoCs e.g. Tegra, with efficient use of Software development tools like debuggers</li><li>Outstanding written and verbal interpersonal skills in English, as well as dedication to the work</li><li>Good organization skills, with a logical approach to problem solving, good time management and task prioritization skills</li></ul><br><br><strong>Our Offer:</strong>\n<ul>\n<li>An international playground, everyday work requires teamwork with colleagues from the US headquarters to various locations across the globe.</li><li>Great teams, you'd be working with some of the top professionals within your field.</li><li>Big but small, we enjoy the resources of a big corporation while conserving a small office atmosphere and possibility to make a difference.</li>\n</ul>\nWith competitive salaries and a generous benefits package, NVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most brilliant and talented people in the world working for us and, due to unprecedented growth, our elite engineering teams are rapidly growing. If you're a creative and autonomous engineer with a real passion for technology, we want to hear from you.<br><br>NVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression , sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law."}