{"job title": "Senior System Software Engineer - CUDA Driver", "company": "NVIDIA", "city state": "– US, CA, Santa Clara", "rating": "4.4", "job description": "We are hiring software engineers to work on the CUDA driver, a core component of our platform for accelerating general purpose computation on the GPU. Our team delivers features and improvements to better realize the potential of NVIDIA hardware for a growing range of computational workloads, ranging from deep learning, scientific computation, and self-driving cars to video games and virtual reality.\n<br><br>\nCUDA defines a unified programming model across a range of system configurations and hardware capabilities. To accomplish this, the CUDA driver interacts with GPU hardware, kernel mode drivers, and the operating system.\n<br><br>\n<strong>What you'll be doing:</strong>\n<br><br>\nAs a member of our team, you will use your design abilities, coding expertise, and creativity to deliver the best compute platform in the world. You will craft elegant solutions to exciting problems and shape the future direction of CUDA as you collaborate with your peers across NVIDIA.\n<ul>\n\n<li>You will evangelize, architect, and implement new features</li>\n<li>Coordinate and drive development efforts across multiple teams</li>\n<li>Help define forward-looking improvements to the CUDA APIs and programming model</li>\n<li>You'll write effective, maintainable, and well-tested code</li>\n<li>Develop code for multiple operating systems</li>\n\n</ul>\n<strong>What we need to see:</strong>\n<ul>\n\n<li>BS or MS degree in Computer Science, Electrical Engineering​ or related field</li>\n<li>Strong C and C++ programming skills</li>\n<li>Minimum of 4+ years of related development experience</li>\n<li>Experience working with large codebases</li>\n<li>Experience with operating system interfaces for threads, process control, and virtual memory</li>\n<li>Experience writing and debugging multithreaded programs</li>\n<li>Good written communication</li>\n\n</ul>\n<strong>Ways to stand out from the crowd:</strong>\n<ul>\n<li>Understanding of system level architecture, such as interconnects, memory hierarchy, interrupts, and memory-mapped IO</li><li>Knowledge of memory coherence and consistency models</li><li>Experience with kernel mode development</li><li>Experience with Windows, Linux, or macOS driver development</li>\n</ul>\n\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression , sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.#deeplearning"}