{"job title": "Salesforce Engineer", "company": "OppLoans", "city state": "– Chicago, IL, US", "rating": "4.8", "job description": "<div>\n<strong>Why OppLoans?</strong></div>\n\n<ul>\n\n<li>\nOppLoans is a socially responsible, profitable FinTech company that has grown 2000% over the last 3 years, and is backed by a global investment firm with $100M+ in AUMs.</li>\n<li>\nRecent accolades include being named one of the fastest-growing companies in the USA by Inc. Magazines list of 500, 3rd fastest-growing startup by Built In Chicago, and 6th best company to work for nationally by Glassdoor.</li>\n<li>\nCustomers love our product! We have been widely recognized as having the best customer experience in the industry. See what our borrowers are saying on Google and the BBB!</li> \n<li>\nEmployees love working here. We have an entrepreneurial and dynamic startup culture that also cares for our employees. Check out our Glassdoor reviews!</li> \n</ul><br>\n\n<div><strong>What you get to do:</strong></div><div>\nAs a Salesforce Engineer, you will support a rapidly growing Fintech environment. Preferred experience using the force.com platform in either administrator, developer or consulting roles. In addition, you will get to</div>\n\n<ul>\n\n<li>\nDesign/develop software on our Salesforce org</li> \n<li>\nWork with business operations to turn requirements into technical solutions</li>\n<li>\nWriting unit tests and integration tests for max test coverage</li>\n<li>\nImprove the design of the code as the product evolves</li>\n<li>\nDeploy and test code to ensure no defects</li>\n<li>\nConsume 3rd party APIs and integrations</li>\n<li>\nCode efficiently, make sure code is being an good actor within Salesforce transaction limits</li>\n<li>\nHandle changing priorities, manage multiple tasks and work within tight timeframes and deadlines</li>\n<li>\nBe a team player / laugh and have fun / strive to get better</li>\n</ul><br>\n\n<div><strong>What you will bring to the team:</strong></div><br>\n\n<div><strong>As a Salesforce Engineer, we are seeking someone who can effectively collaborate with various teams and work independently. A successful member of our Engineering team will learn and understand the overall business objectives. The Engineering team is a key contributor to the overall health of the services/products we provide for our customers. Preferred experience using the force.com platform in either developer or consulting roles. Ideal candidates will have:</strong></div><ul>\n\n<li>\nClear understanding of Service Cloud, and force.com platform functionality</li>\n<li>\nExpertise using Apex, SOQL, JSON, JavaScript, GIT (Source Control)</li>\n<li>\nKnowledge of Salesforce.com developer toolkit including Apex Classes, Controllers, Triggers, Visualforce, Migration Tools (Ant &amp; Salesforce CLI), and Lightning Components</li>\n<li>\nKnowledge in Data Mocking a plus</li>\n<li>\nPlatform Developer I certification</li>\n<li>\nADM201 certification preferred</li> \n</ul>"}