{"job title": "Sr. Software Engineering Manager", "company": "realtor.com", "city state": "– Santa Clara, CA", "rating": "3.7", "job description": "Realtor.com®. is 2nd biggest destination in the nation to discover and create your perfect home. We have more than 60 million users leveraging our products every month and are growing at a hectic pace. We have the most comprehensive and accurate coverage of real estate listing, and the most engaged consumers across all real estate online portals, and top-rated mobile applications at the cutting edge of mobile revolution.\n<br><br>\n<strong>The Role</strong>\n<br><br>\nHousing is one of the most important emotional and financial decisions for most consumers. You will create services to personalize their journey on Realtor.com. This includes user's identity, authorization, profile, explicit and implicit preferences, recommendations &amp; alerts, retargeting our consumers on other sites via ads, and enabling marketing campaigns for both acquisition and retention.\n<br><br>\nYou will also create new advertisement products to enable various housing-related professionals &amp; service providers (mortgage brokers, agents, insurance providers etc.) connect with consumers on our site, and make all advertisements on the site more relevant to consumers and increase monetization by behavioral segmentation and targeting.\n<br><br>\n<strong>Job Responsibilities</strong>\n\n<ul>\n<li>Own &amp; operate our online services to the highest level of operational excellence meeting availability, reliability, performance, and scale in a cost-effective way.</li>\n<li>Work with product &amp; business counterparts to own &amp; manage roadmap that delivers on short-term goals and sets the team for longer-term success. Manage stakeholder expectations.</li>\n<li>Stay current with industry and technology trends, and calibrate roadmap accordingly.</li>\n<li>Hire, coach and mentor team members, and regularly provide feedback.</li>\n<li>Oversee architectural choices and ensure the team follows best practices for software development.</li>\n<li>Drive a culture of continuous improvement, innovation and customer focus.</li>\n<li>Strengthen culture of sharing and collaboration within and across teams.</li>\n</ul>\n<strong>Skills</strong>\n<br><br>\n<strong>Domain</strong>\n\n<ul>\n<li>Experience in delivering secure, highly available (&gt;99.9% availability) services serving to scale to millions of daily active users per day.</li>\n<li>Experience in launching data science-driven products to fruition. Good understanding of life-cycle of data science-driven product development, and ability to work closely with data scientists &amp; data engineers. Experience in data-pipelines that can scale to analyze clickstream data from millions of daily consumers to produce near real-time insights</li>\n<li>Understanding of unique needs for web &amp; mobile clients from services</li>\n<li>Previous experience with personalization, recommendation, and Ad technology</li>\n</ul>\n<strong>Leadership</strong>\n\n<ul>\n<li>Ability to drive projects that require alignment with multiple engineering teams in a matrix organization</li>\n<li>A reputation for unquestioned integrity and a highly developed sense of ethics. Candid, direct, and non-political.</li>\n<li>An undying curiosity and passion to stay current with the latest technology coupled with a passion for customer-focused innovation. While a technologist at heart, you think customer-in vs. technology-out. Ability to convert broad business goals into engineering strategy and execution</li>\n<li>A strong believer in data-driven innovation: ship, measure, improve, repeat. You relish looking at technical, business and consumer experience metrics to guide your path. You know how to deliver huge market-changing innovations, in bite-size pieces.</li>\n<li>High energy, confidence, and ambition--someone who can consistently perform at the highest level in an extremely fast-paced, dynamic and high growth environment.</li>\n<li>A crisp and passionate communicator with the ability to simplify, communicate, and sell his or her vision/ideas up, down, and across the organization. Highly developed interpersonal skillssomeone who can be as effective through influence as through direct control.</li>\n<li>An effective delegator/doersomeone who can rally the troops and yet is not afraid to roll up his or her sleeves when needed.</li>\n</ul>\n<strong>Experience</strong>\n\n<ul>\n<li>10+ years of experience in software development.</li>\n<li>5+ years of people management experience. 2+ years as a 2nd level manager.</li>\n<li>Experience with 24x7 available consumer-facing online services serving millions of consumers on a daily basis</li>\n</ul>\n<strong>Education</strong>\n<br><br>\nBSCS or higher. Higher professional degrees preferred.\n<br><br>\n<strong>Culture</strong>\n<br><br>\nWe offer a fast-moving culture of a start-up, coupled with the financial stability of a big company.\n<br><br>\nYou will engage with some of the best and the brightest coworkers and leaders, learn and contribute, and have a great time. We work hard, play hard, and we recognize achievement. We reward passion for innovation, creativity, and quality. If you enjoy working in a fast-paced, dynamic, cutting-edge work environment and desire to make a meaningful contribution to the business, then make the move!\n<br><br>\n#LI-IH1"}