{"job title": "Electrical Test Engineer", "company": "SSL", "city state": "– Palo Alto, CA", "rating": "2.7", "job description": "<strong>Job Title:</strong>\n<br>\nElectrical Test Engineer\n<br><br>\n<strong>Requisition Number:</strong>\n<br>\n<strong>7532</strong>\n<br><br>\n<strong>Location:</strong>\n<br>\nPalo Alto, CA-046\n<br><br>\n<strong>Position Type:</strong>\n<br>\nFull-time\n<br><br>\n<strong>Job Type:</strong>\n<br>\nRegular\n<br><br>\n<strong>Education Required:</strong>\n<br>\nBachelor's Degree\n<br><br>\n<strong>Experience Required:</strong>\n<br>\n3-5 Years\n<br><br>\n<strong>About US:</strong>\n<br>\n<div>SSL is a leading provider of commercial satellites and spacecraft systems, with broad expertise to support satellite operators and innovative space related missions. The company designs and manufactures spacecraft for services such as direct-to-home television, video content distribution, broadband internet, mobile communications, and Earth observation. Based in the heart of the Silicon Valley, SSL's advanced product line also includes state-of-the art small satellites, and sophisticated robotics and automation solutions for remote operations. A career with SSL could shape your future in ways that you've never imagined.\n<br><br>\nDue to the nature of our business, SSL has export control and security sensitivities that require all of our employees to be a United States Citizen, Permanent Resident of the United States, an Asylee, or a Refugee. SSL is an Equal Opportunity Employer.</div>\n\n<br><strong>Job Description:</strong><br>\n\n<div><strong>SSL designs and manufactures the majority of the power and data handling electronics used on our satellites. The qualification and manufacturing of the latest generation of our power system has created a need for additional, experience electronics test engineers who can:</strong></div><div>-Troubleshoot flight hardware when problems occur.\n\n\n<ul>\n<li>Evaluate test results and provide detailed troubleshooting reports.</li>\n<li>Isolate problems to lowest level possible (Unit, Tray, Component).</li>\n<li>Provide recommendations based on findings.</li>\n<li>Identify, analyze, and resolve technical problems and test failures.</li>\n<li>Perform data trending, failure analysis, and overstress analysis.</li>\n<li>Participate in design activities for all new products.</li>\n<li>Participate in hardware reviews (PDR, CDR, MRR and TRR).</li>\n<li>Develop and implement test process improvements</li>\n<li>Redline, generate, update, review and release test procedures as required.</li></ul></div>\n\n\n<strong>Requirements:</strong>\n<br>\n<strong><ul>\n<li>- Degree is Electrical Engineering, Physics, or related field with 3-5 years of experience in the manufacturing and test of electronics.</li>\n</ul>\n\n</strong>\n\n<li>Must be able to write clearly and prepare documentation in English.</li>\n<li>Must be able to perform circuit analysis and overstress analysis for complex electronic components.</li>"}