{"job title": "Data Engineer", "company": "Sullivan and Cogliano", "city state": "– New York, NY", "rating": "3.7", "job description": "Job Description<div><strong>Data Engineer needed ASAP in New York, NY!\n<br><br>\nJob Description:</strong>\n<br><br>\nWe’re looking for engineers with broad and deep skill sets and experiences to help move us forward. We want self-starters who will bring distinctive expertise but who are excited to step outside their comfort zone and learn new skills.\n<br><br>\nAs a Senior Data Engineer, you might work to improve our optimization algorithms, write code using Apache Spark, participate in architectural decisions for new components, or improve performance in collaboration with DevOps. In the same week, you could work on user-facing interfaces and reports with frontend developers, write code to import, process and QC terabytes of new data, and work with analysts and statisticians to ensure the validity of our processes.\n<br><br>\n<strong>Required Skills</strong>\n<ul>\n<li>Bachelor’s degree in Computer Science or a related field (or 4 additional years of relevant work experience)</li><li>A strong understanding of data structures, algorithms, and effective software design</li><li>Significant development experience with a major modern language (e.g. Java, Scala, Python, Ruby, C/C++, etc.)</li><li>Experience with a distributed/parallel computing engine such as Apache Spark or Hadoop</li><li>Experience wrangling terabytes of big, complicated, imperfect data</li><li>Significant experience working with structured and unstructured data at scale and comfort with a variety of different stores (key-value, document, columnar, etc.) as well as traditional RDBMSes and data warehouses</li><li>Comfort with version control systems (e.g. Git, SVN)</li><li>Excellent verbal and written communication skills; must work well in an agile, collaborative team environment</li><li>Master’s in Computer Science or a related field</li><li>Experience with big data technologies such as Cassandra, Kafka, HBase</li><li>Basic understanding of statistics and experience with statistical packages such as R, Matlab, SPSS, etc.</li><li>Practical experience with supervised machine learning techniques</li><li>Experience with AWS products (Redshift, EMR, S3, IAM, RDS, etc)</li><li>Experience writing unit and functional tests</li><li>Experience with front-end languages, especially Javascript, HTML5, and CSS3</li><li>Strong background with test-driven development???????</li></ul></div>\n<br>\nCompany Description<div>Sullivan and Cogliano is a 50 year old North American provider of IT contract, contract to hire, and direct hire staffing services. Our recruiters average 10+ years of experience and seek to help find the best match both for you and our customer.\n<br><br>\n<strong>Areas of Expertise:</strong>\n<br><br>\nInfrastructure and Network\n<br><br>\nSecurity, Identity &amp; Access Management and Firewalls\n<br>\nSystem / Network Administrators and Engineers\n<br>\nNetwork Architects and Managers\n<br>\nProject Managers\n<br>\nCloud and Office 365\n<br>\nCisco and Microsoft Professionals\n<br>\nLync, Exchange and Active Directory\n<br>\nUnified Communications and VoIP\n<br>\nData Center and Disaster Recovery\n<br>\nStorage (SAN / NAS) and Virtualization\n<br>\nUNIX / Linux / AIX Specialists\n<br>\nSCCM and SCOM\n<br>\nMobility\n<br>\nVPN and Wireless\n<br>\nA+ Field Service Technicians\n<br>\nOnsite Break/Fix, Deskside and Remote Technicians\n<br>\nIMAC / Roll-Out Technicians\n<br>\nHelp Desk and NOC Analysts\n<br><br>\nApplication Development, Integration and all stages of the SDLC\n<br><br>\nMobile Developers\n<br>\nDevOps\n<br>\nServiceNow\n<br>\nERP Functional and Technical (SAP, Oracle, PeopleSoft)\n<br>\nApplication Architects and Developers\n<br>\nApplication Packagers\n<br>\nBusiness and Systems Analysts\n<br>\nProject and Change Management\n<br>\nBizTalk and SharePoint\n<br>\nWeb Developers\n<br>\nSoftware Q/A Engineers – Analysts\n<br>\nQ/A Testers: Manual – Automated\n<br>\n.NET, C#, SQL, Java, and J2EE\n<br>\nData Warehousing and Business Intelligence\n<br>\nDatabase Developers and Administrators</div>"}