{"job title": "Application Engineer II", "company": "Superior Technical Ceramics", "city state": "– Saint Albans, VT", "rating": "1.6", "job description": "<p><strong>Application Engineer II</strong></p>\n<p><strong>JOB SUMMARY: </strong></p>\n<p>A fast paced sales and market development role that provides a bridge between customers, and the production floor. Understands customer performance and cost requirements, analyzes current product margin &amp; cost, recommends improvements and prepares accurate new product cost estimates. Supports new product application development understands production methods, and coordinates improvement programs with Production Engineering. Participates on cost reduction teams with analytical support of current margins, costs, methods and analytical support for the Business Development team. Analyzes metrics to gage performance of growth and profitability.</p>\n<p><strong>ESSENTIAL FUNCTIONS: </strong></p>\n<ol>\n<li>General</li>\n</ol>\n<ul>\n<li>Works closely with Market Applications Engineers on new products and current programs</li>\n<li>Leads analysis of product cost and works with Production to recommend improvement</li>\n<li>Participates in continuous improvement of estimation and costing processes</li>\n<li>Provide and model exemplary customer service</li>\n</ul>\n<p> </p>\n<ol>\n<li>Cost Analysis and Reduction</li>\n</ol>\n<ul>\n<li>Works closely with Sales and Applications Engineers to identify cost reduction targets</li>\n<li>Leads and coordinates product margin &amp; cost reduction efforts working with Production</li>\n<li>Reviews and reports on product margin &amp; cost data to determine trends / improvement areas</li>\n<li>Investigates costing issues on the shop floor, including setup, run time and material issues.</li>\n<li>Develops and maintains cost reporting and improvement metrics</li>\n</ul>\n<p> </p>\n<ol>\n<li>Estimation development</li>\n</ol>\n<ul>\n<li>Prepare new product cost estimates based on customer requests targeting a 24 hour turn</li>\n<li>Work to develop and understand profit margin, margin targets and improvement plans</li>\n<li>Ensure accuracy of estimates on the basis of manufacturability and margin</li>\n<li>Read and interpret engineering drawings to understand all aspects of the part being estimated</li>\n<li>Consult Production on machine run times, sequencing, and shop flow as necessary</li>\n</ul>\n<p> </p>\n<ol>\n<li>Estimation Process Ownership</li>\n</ol>\n<ul>\n<li>Identifies and leads implementation of new estimating tools</li>\n<li>Establish and maintain estimate performance metrics</li>\n<li>Provide weekly reports on estimate activity and performance</li>\n<li>Routinely review estimation process results against actual performance results</li>\n</ul>\n<p> </p>\n<ol>\n<li>Other related duties as required</li>\n</ol>\n<p><strong>KNOWLEDGE AND EXPERIENCE: </strong></p>\n<ol>\n<li>BS in Engineering, Production Technology, Business, or equivalent experience</li>\n<li>Minimum 3 years of work experience in a production environment including machining operations</li>\n<li>In depth understanding of production &amp; inspection methods</li>\n<li>Strong math skills</li>\n<li>Ability to work independently and lead small multidisciplinary teams</li>\n<li>Ability to work with multiple projects simultaneously and completing them on time</li>\n<li>Ability to read &amp; interpret engineering drawings, standards and specifications</li>\n<li>Ability to work well under pressure from deadlines</li>\n<li>Excellent written, verbal, and non-verbal communication skills</li>\n<li>Able to build strong relationships with customers, employees and management</li>\n<li>Strong organizational skills and attention to detail is required</li>\n<li>Demonstrated proficient in Word, Excel, PowerPoint, Outlook and the Internet</li>\n<li>Occasionally travel to customers, suppliers or trade shows</li>\n</ol>"}