{"job title": "Senior Data Engineer", "company": "AbilTo", "city state": "– New York, NY", "rating": "3.8", "job description": "Overview\n<br><br>\nAbleTo, Inc. combines best-in-class patient engagement with behavior change treatment programs that allow health plans and plan sponsors to improve health outcomes, while lowering overall spending, for high-cost medical populations. Benefitting groups include heart patients and diabetics, as well as those suffering from depression/anxiety and chronic pain. All sixteen of our programs utilize best-practice protocols and are delivered nationally by teams of licensed therapists and behavior coaches. Program participants experience improved health, better recovery and in the case of heart patients, fewer hospitalizations.\n<br><br>\nThe Data &amp; Analytics team plays a key role at AbleTo. Data is part of nearly everything that we do. The Data &amp; Analytics team is responsible for storing and organizing data, building algorithms used for patient identification / engagement / treatment, and making useful and actionable reporting for business managers.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Collaborate with Data Analytics team to ensure the confidentiality, integrity and availability of data necessary for business analytics and reporting</li>\n<li>Collaborate with client and partner data management teams to defines data transfer requirements and logistics</li>\n<li>Build and validate large-scale batch and real-time healthcare data ingestion pipelines with tools on the Google Cloud Platform (BigQuery, Dataproc, Dataflow)</li>\n<li>Manage the overall quality and security of enterprise data assets</li>\n<li>Manage the day-to-day operational data management needs</li>\n<li>Collaborate with data scientists and other engineers and to develop new data-driven product features and deploy machine learning models</li>\n<li>Collaborate with DevOps team to design and manage data architecture for structured (SQL) and unstructured (NoSQL) data sources</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>2+ year experience working in a healthcare payer data operations role strongly preferred</li>\n<li>Strong experience required in Python and Linux</li>\n<li>Strong experience with SQL preferred</li>\n<li>Strong experience with commercial and/or open-source ETL tool like Airflow</li>\n<li>Experience designing canonical enterprise analytic &amp; reporting schemas</li>\n<li>Experience working on GCP and/or AWS platforms is a plus</li>\n<li>BA in Computer Science, Mathematics, Operations Research, or other related discipline</li>\n<li>4+ years work experience is strongly preferred</li>\n</ul>\n\nAbleTo is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status. AbleTo is an E-Verify company.\n<br><br>\nUpon the acceptance of an offer to enter into this agreement, AbleTo requires the satisfactory completion of reference and background checks and successful completion of drug testing in accordance with local, state and federal laws.<br><br>SDL2017"}