{"job title": "Inhalation Scientist", "company": "Aerotek, An Allegis Group Company", "city state": "– Columbus, Ohio", "rating": "NA", "job description": "<strong>For this project, special aerosol testing:</strong>\n\n\n<ul>\n<li>NGI</li>\n<li>Admitted dose</li>\n</ul>\n\nWill be testing a new inhalation powder that will be going to market.\n<br><br>\nConducts chemical and physical analyses in support of the development of a manufacturable multisource pharmaceutical product. Provides analytical support for the release of registration materials in support of regulatory submissions. Assists analytical method validation and transfer activities.\n<br><br>\nPerforms the assigned analytical tasks in support of product development, registration lot release, pre and post regulatory submission activities. Performs activities within the assigned timelines and in compliance with cGXP's, and company practices and procedures.\n<br><br>\nFollows work instructions, SOPs and company practices. Documents analytical activities and results accurately, in a timely manner and right-first time and maintains integrity of data.\n<br><br>\nFollows written analytical procedures. Identifies execution challenges of analytical methods and support trouble shooting activities.\n<br><br>\n<strong>Experience with the following is preferred:</strong>\n\n\n<ul>\n<li>Sample prep</li>\n<li>Standard weighs</li>\n<li>Dilutions</li>\n<li>HPLC</li>\n<li>*Must have Bachelors (BS) in a scientific field, Chemistry/Biochemistry is preferred.**</li>\n</ul>\n\n<strong>About Aerotek:</strong>\n<br><br>\n<strong> We know that a company's success starts with its employees. We also know that an individual's success starts with the right career opportunity. As a Best of Staffing® Client and Talent leader, Aerotek's people-focused approach yields competitive advantage for our clients and rewarding careers for our contract employees. Since 1983, Aerotek has grown to become a leader in recruiting and staffing services. With more than 250 non-franchised offices, Aerotek's 8,000 internal employees serve more than 300,000 contract employees and 18,000 clients every year. Aerotek is an Allegis Group company, the global leader in talent solutions. Learn more at Aerotek.com.</strong>\n<br><br>\n<strong> The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.</strong>\n<br><br>\n<strong> If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please call 888-237-6835 or email accommodation@aerotek.com for other accommodation options. However, if you have questions about this position, please contact the Recruiter located at the bottom of the job posting. The Recruiter is the sole point of contact for questions about this position.</strong>"}