{"job title": "Scientist - Protein Technologies Group", "company": "Amgen", "city state": "– Cambridge, Massachusetts", "rating": "3.7", "job description": "Job Description\n<br>\nAmgen is a leading global biotechnology company, with a mission to serve patients around the world. As a science-based, patient-focused organization, we discover and develop innovative therapies to treat serious illnesses. Our medicines have made a dramatic difference in the lives of millions.\n<br><br>\nTo underpin our commitment to serve patients, Amgen is hiring in the Department of Protein Technologies, Biologics, at our Research and Development facility in Cambridge, MA (AMA).\n<br><br>\nWe are looking for a highly motivated and talented biochemist to join the AMA Protein Technologies group. This laboratory provides comprehensive molecular cloning, protein expression, purification and analytics support for the early stage pipeline of projects including both protein and small molecule therapeutics.\n<br><br>\nThe successful candidate will have the opportunity to contribute directly to the exciting drug discovery process on a wide variety of important biological systems.\n<br><br>\nThe candidate's responsibilities include (but not limited to) protein expression in mammalian cells, protein purification, and biochemical characterization. The successful candidate will work in teams to design expression constructs, optimize expression conditions, develop and perform protein purification protocols for a variety of protein classes, including secreted as well as integral membrane proteins. Additional responsibilities include planning detailed procedures for research projects including timelines, methodological approaches, and necessary resources; analyzing and interpreting scientific data and results; providing regular updates and communication on project results; and documenting experiments in lab notebooks.\n<br><br>\nThe scientist will work closely with other molecular biologists and protein biochemists in the Protein Technologies group as well as colleagues in Therapeutic Discovery and therapeutic areas.\n<br><br>\n<strong>Basic Qualifications</strong>\n<br><br>\nDoctorate degree\n<br><br>\n<strong>OR</strong>\n<br><br>\nMaster's degree and 4 years of scientific experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nBachelor's degree and 6 years of scientific expereince\n<br><br>\n<strong>Preferred Qualifications</strong>\n<br><br>\nDoctorate degree with a focus on Biochemistry or Mammalian Cell Biology\n<br><br>\nPh.D. and postdoc from a leading institution or biotechnology company\n<br><br>\nProven track record of academic accomplishments (i.e., peer-reviewed publications and/or patents)\n<br><br>\nKnowledge of state-of-the-art mammalian cell culture and protein biochemistry techniques\n<br><br>\nProficient with AKTA chromatography hardware and software\n<br><br>\nProficient with a range of chromatography methods (affinity, ion-exchange, HIC, gel-filtration)\n<br><br>\nExcellent communication skills (both written and oral) and the ability to work well in teams\n<br><br>\n<strong> Join Us</strong> \n<br><br>\n<strong>If you're seeking a career where you can truly make a difference in the lives of others, a career where you can work at the absolute forefront of biotechnology with the top minds in the field, you'll find it at Amgen.</strong>\n<br><br>\n<strong>Amgen, a biotechnology pioneer, discovers, develops and delivers innovative human therapeutics. Our medicines have helped millions of patients in the fight against cancer, kidney disease, rheumatoid arthritis and other serious illnesses.</strong>\n<br><br>\n<strong>As an organization dedicated to improving the quality of life for people around the world, Amgen fosters an inclusive environment of diverse, ethical, committed and highly accomplished people who respect each other but compete intensely to win. Together, we live the Amgen values as we continue advancing science to serve patients.</strong>\n<br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n<br><br>\n<strong>.</strong>"}