{"job title": "Product Manager, Data Modernization", "company": "Capital One", "city state": "– McLean, Virginia", "rating": "3.8", "job description": "West Creek 8 (12080), United States of America, Richmond, Virginia\n<br><br>\nAt Capital One, were building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Capital One is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding.\n<br><br>\nGuided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good.\n<br><br>\nProduct Manager, Data Modernization\n<br><br>\nWhen you look around in the world, do you see opportunities to change customers lives? Imagine a place where every customer is an advocate because we are easily able to predict and adapt to their evolving needs. Sound exciting? We think so!\n<br><br>\nAt Capital One, we think big and do big things. We were the first company to develop and offer mass customization and personalization of credit card products, and we have been innovating relentlessly ever since. Today we are a high-tech company, a scientific laboratory, and a nationally recognized brand all in one that reaches tens of millions of consumers. We are a passionate and entrepreneurial team that embraces bold ideas, fosters collaboration and delivers great experiences for our customers.\n<br><br>\nIf you have the drive to build amazing consumer products which are customer backed, data and insights driven, and impact the lives of millions daily, we want you!\n<br><br>\nOur Card.AI (Analytics &amp; Infrastructure) team is selectively recruiting a high energy, forward-thinking Digital Product Manager to lead Data Modernization, a critical part of the Card Business, with a deep focus on our customers and our technology.\n<br><br>\nWe look for people who obsess over removing friction from the overall consumer experience and thrive in an entrepreneurial environment driven by both analysis and creativity. You are a strong Product leader who is selfless and invests in the success of your peers, managers and direct reports with a deep understanding of products, analytics, technology and operations.\n<br><br>\nAs a Product Manager, youll lead nimble cross-functional teams of data scientists and business analysts who share your passion and drive for solving human and business problems with data. In this role, you will:\n<ul>\n<li>Seek to understand customers financial needs and deliver new technology and experiences that improve our customers ability to manage their money</li></ul>\n\n<ul>\n<li>Understand our producer and consumer needs to modernize our data infrastructure</li></ul>\n\n<ul>\n<li>Improve our customers ability to access great financial products to meet their day to day needs</li></ul>\n\n<ul>\n<li>Drive vision and strategy by leading product/tech discussions and developing customer UX with Card product teams</li></ul>\n\n<ul>\n<li>Drive product objectives with business cases, product success metrics, design thinking, customer feedback, market research, marketing strategy and competitive analysis</li></ul>\n\n<ul>\n<li>You should have knowledge of and passion for emerging technologies (AI, Machine Learning, NLP, RPA, APIs, Big Data, Native UIs) and how they are used to empower business and technology to deliver great products.</li></ul>\n\n<ul>\n<li>Ground assumptions in human centered design with a natural empathy for customers</li></ul>\n\n<ul>\n<li>Lead the design and build of new automation and machine learning solutions that simplify processes for clients and associates.</li></ul>\n\n<ul>\n<li>Stay abreast of new AI technologies that are driving business process simplification across the industry and be the leader in driving that change by partnering and piloting across various business areas.</li></ul>\n\n<ul>\n<li>Partner with the Technology team to bring Product Vision to life and inspire the team by driving design thinking mindset for Product Owners, developers and designers.</li></ul>\n\n<ul>\n<li>Have a bias to action and a proven track record of delivering minimum viable products and business models to market at rapid speed</li></ul>\n\n<ul>\n<li>Demonstrate a high level of intellectual curiosity and comfort with ambiguity.</li></ul>\n\n<ul>\n<li>Experience working with Agile Methodologies will be critical</li></ul>\n\n<ul>\n<li>Previous experience with startups and or fintechs is helpful</li>\n</ul>\n<strong>Basic Qualifications:</strong>\n<ul>\n<li>Bachelors degree or military experience</li><li>At least 3 years experience leading cross functional product teams</li><li>At least 1 years of experience building digital data products</li>\n</ul>\n<strong>Preferred Qualifications:</strong>\n<ul>\n<li>MBA focused on entrepreneurship, product development, corporate innovation or design thinking</li><li>3+ years experience building and launching consumer data applications on web and mobile platforms</li><li>3+ years experience building and managing a roadmap</li><li>5+ years experience with agile product development</li><li>At least 3 years of experience with external microservices architecture</li><li>At least 3 years of experience with cloud- based technology</li></ul>\n\n<ul>\n<li>At least 3 years of experience building features for cloud-based Products</li><li>At least 3 years of experience applying analytical rigor to support technology investment decisions</li>\n</ul>\n<strong>At this time, Capital One will not sponsor a new applicant for employment authorization for this position.</strong>"}