{"job title": "Data Manager - Master", "company": "Envision", "city state": "– Saint Louis, MO", "rating": "3.4", "job description": "<strong>C2C is ok, but must already be located in the St. Louis area.</strong>\n<br><br>\n<strong>Description:</strong>\n<br><br>\nThe goal of this position is to support business intelligence report developers in the development and automation of processes to integrate the data needed to support reporting and business data capture processes. It requires an understanding of reporting and data warehouse data systems and tools and is enabled by understanding of customer, order and logistics, supply chain planning data and processes. This role must be able to deliver both as an individual and as part of a small team.\n<ul>\n <li>Evaluates current reporting processes to identify ways to simplify and improve, and implements improvements directly or by working with team members or IT</li> <li>Develops and/or maintains non-IT data systems to support informational needs for leadership</li> <li>Contributes to discussions on the best technology &amp; data structure needed to address business requests</li> <li>Delivers data to users through both ad hoc and scheduled reporting and dashboards using SQL, Webi, Spotfire, and Qlik</li> <li>Required Technical Knowledge:</li> <li>Traditional data warehouse Data Architecture and Dimensional Modeling</li> <li>Querying data in an Oracle Relational Database</li>\n</ul>\n<strong>Desired Technical Knowledge:</strong>\n<ul>\n <li>Oracle Application DBA skills, ODBC Driver Configuration</li> <li>Microsoft Access macros, modules, database links, Windows task scheduling</li> <li>Querying data in a Teradata environment</li> <li>Report development using data visualization and reporting tools e.g, Webi, Spotfire, Qlikview, MS*Access, Cognos, Tableau</li> <li>Tool development experience (Webi Universes or equivalent)</li> <li>Familiarity with internal data SAP, SalesForce, CDW, IRD, DSM_Prod</li>\n</ul>\n<strong>Required Education &amp; Experience:</strong>\n<ul>\n <li>Bachelor's degree, or its equivalent, required</li> <li>Minimum of 3 years related experience required</li> <li>Knowledge of the Ag Business is desired but not required</li> <li>Knowledge of Supply Chain business processes are desired but not required</li>\n</ul>\n\nAssociated topics: data architect, data integration, data integrity, data manager, data quality, data scientist, erp, sql, sybase, teradata"}