{"job title": "Data Analyst (Threat Analytics)", "company": "F5 Networks", "city state": "– ", "rating": "3.8", "job description": "<strong>POSITION SUMMARY:</strong>\n<br><br>\nWe are looking for talented people to join our Web analyst team. You will join a leading team fighting cyber web attacks.\n<br><br>\nYou’ll be in charge of analysing customers’ traffic, looking for undetected threats, improving the product detections and actively shutdown any malicious activities. The position includes also running data researches and reviewing the data science results.\n<br><br>\nThe analyst will be responsible for research and analysis of different types of attacks, monitoring and handling security incidents and preventing them.\n<br><br>\n<strong>ATTRACTIONS OF THE JOB:</strong>\n<br><br>\nThreat Analytics group work as a part of a dynamic, highly technical team on a number of F5’s technologies. Our analysts handle traffic of many top companies across the globe in a variety of industries.\n<br><br>\n<strong>PRIMARY RESPONSIBILITIES:</strong>\n<ul>\n<li>Analyse F5 customers’ traffic. Provides F5 customers with outstanding &amp; rapid reaction to attacks.</li><li>Look for undetected threats and false positive</li><li>Improve the product detections</li><li>Lead data-oriented research</li><li>Generating “incidents” reports to F5 customers</li><li>Working closely with the data scientist and software engineering</li>\n</ul>\n<strong>ESSENTIAL KNOWLEDGE, SKILLS AND ABILITIES:</strong>\n<ul>\n<li>In-depth knowledge of web architecture and protocols (CDN, HTML, DOM, JS, HTTP, HTTPS, TLS/SSH, IPv4/v6 etc.)</li><li>Hands on technical experience with and very knowledgeable on security operations, scripts reading and understanding, basic knowledge in different languages: JS, PHP, HTML, HTML 5</li><li>SQL Proficiency</li><li>Advantage - knowledge of software’s such as WireShark, VMware, Burp Suite</li><li>Analytical thinker with strong attention to detail</li><li>Must be able to read, write and speak English fluently, including technical concepts and terminology.</li><li>Must be able to relay technical information to customers with varying skill levels</li>\n</ul>\n<strong>QUALIFICATIONS:</strong>\n<ul>\n<li>Strong background in customer service and incident management</li><li>Ability to excel in a face paced, challenging, operations environment with 24/7 shifts</li><li>Investigation of customer traffic</li><li>Prior experience in Information Security a HUGE advantage</li><li>Computer Science and/or graduate degree a big advantage</li><li>Ability to speak English extremely well</li><li>Ability to work in shifts</li>\n</ul>\n<strong>PHYSICAL DEMANDS AND WORK ENVIRONMENT:</strong>\n<ul>\n<li>Duties are performed in a normal office environment while sitting at a desk or computer table. Duties require the ability to utilize a computer, communicate over the telephone and read printed material.</li><li>Working in an environment where work hours are scheduled shifts. This role may be required to work outside of core business hours including early morning, late evening, overnight, weekends, and holidays.</li>\n</ul>\nF5 Networks. is an equal opportunity employer and strongly supports diversity in the workplace."}