{"job title": "Associate Scientist, Analytical Methods Transfer", "company": "Fuji Film", "city state": "– Morrisville, NC", "rating": "3.6", "job description": "Overview\n<br><br>\nThe Analytical Methods Transfer group is seeking an energetic Associate Scientist with protein chemistry experience to become an integral member of a high performing method transfer team supporting protocol based activities including technical transfer of methods from donor labs as well as training of colleagues for internal transfer, and qualification, validation and verification of methods. The successful candidate will primarily execute biochemistry based techniques such as UPLC/HPLC (SEC, IEX, RP, glycan, affinity, etc), capillary electrophoresis (icIEF, CE-SDS), gel electrophoresis, western blot, plate based assays and spectrophotometry (SoloVPE) for the characterization and testing of recombinant protein pharmaceuticals.\n<br><br>\nExternal US\n<br><br>\nThe position requires the following knowledge, skills and abilities:\n\n\n<ul>\n<li>One year of applicable hands-on experience in one or more of the following fields: UPLC/HPLC (preferably using Empower 3), capillary electrophoresis, gel electrophoresis, western blot, plate based assays and spectrophotometry, preferably in the analysis of proteins</li>\n<li>Independent use and application of instrumentation and associated software for data acquisition and analysis</li>\n<li>Basic math and software skills (MS Excel, Word, PowerPoint, Google sheets)</li>\n<li>Good interpersonal skills, independent drive, willingness to contribute to the success of a team with shared goals, strong problem solving capabilities as well as excellent oral and written communication skills</li>\n<li>Experience working in a regulated GMP environment is desirable (GMP testing will be required for this position)</li>\n<li>In addition, the successful candidate must be comfortable multi-tasking in a fast-paced environment with defined deliverables and deadlines</li>\n</ul>\n\n<strong>Required education and experience include:</strong>\n\n\n<ul>\n<li>BS and 1+ years of experience</li>\n</ul>\n\nFDBU works with technical data, technology and materials that are subject to U.S. export laws and regulations. This position will require access to technical data, technology and source code that is controlled under U.S. export laws and regulations, including but not limited to the International Traffic in Arms Regulations at 22 C.F.R. Parts 120 130 and Export Administration Regulations in 15 C.F.R. Part 730 774, as may be amended. To conform to these laws and regulations, applicants must be U.S. citizens, lawful permanent residents of the U.S., protected individuals as defined by 8 USC 1324(b)(a)(3) (i.e., asylees and refugees) or otherwise eligible for an export authorization from the U.S. Department of State or U.S. Department of Commerce. Offers of employment will be contingent on the Company's ability to secure an export authorization. FDBU is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, sexual orientation, gender identify or any other protected class.\n<br><br>\nFDBU is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, sexual orientation, gender identify or any other protected class.<br><br>SDL2017"}