{"job title": "Big Data Systems Data Architect - IRES - SAFB", "company": "Jacobs", "city state": "– Colorado", "rating": "3.4", "job description": "<strong><br><br>Description</strong>\n<br><br>\nThe Big Data Systems Data Architect will work on the IRES Program supporting the Missile Defense Agency. The work location can be at Schriever AFB, Colorado, Redstone Arsenal, Huntsville, Alabama, or Ft Belvoir, Virginia. The data architect develops and maintains an information architecture and collaborates with business units and endusers to create complex data structures that are used in the design, prototyping, creation and improvement of the data ingestion, cleaning, curation, and stage and retrieval of data as well as supporting analytic, statistical modeling, dissemination and presentation efforts of the Data Analytics and Reporting Network Services. The architect shall be able to demonstrate expertise and experience in problem solving, data modeling, strategic planning, and will use that expertise to guide data scientists, programmers, engineers and data analysts from GARNET to build and maintain a data management and governance lifecycle based on business functional and performance requirements.\n<br><br>\n#cjpost\n<br><br>\n<strong><br><br>Qualifications</strong><br><br><strong> Requirements</strong> : High School Diploma and 20 years general experience or an Associates degree and 18 years general experience or a Bachelors degree and 16 years general experience or Masters degree and 14 years general experience. Requires 14 years related experience in one or more of the following: Java, Microsoft Certified Solutions Developer (MCSD), Elasticsearch ELK Stack ecosystem, Cloudera, Linux (Redhat), SQL, JSON, C++, Python, R, C#, Ruby, Agile methodologies, Adobe Certified Expert (ACE). Candidate must possess a CompTIA Security+ with CE or higher or able to obtain certification within 30 days. Must be a US citizen and have an active DoD Secret clearance. <strong> Desired</strong> : Experience developing processes and training and cloud based system architectures and related tools. Excellent interpersonal skills and ability to work both independently and in a fast-paced team environment. Excellent written and verbal communications skills required. Highly self-motivated and directed, with keen attention to detail. Creative problem-solving abilities. Ability to prioritize and execute tasks in a high-pressure environment. Ability to work with minimal oversight. Willing to work in a team-oriented, collaborative environment. Experience in large development initiatives, developing high volume database applications, data warehousing, complex shell scripting, Agile methodology and public or private cloud experience.Jacobs is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status or other characteristics protected by law. Jacobs is a background screening, drug-free workplace."}