{"job title": "Data Engineer", "company": "MDA Corporation", "city state": "– Gaithersburg, MD", "rating": "NA", "job description": "ResponsibilitiesGeneral Summary\n<br><br>\nRadiant Solutions has an immediate opening for a Data Engineer in our Gaithersburg, MD location. This position will serve an integral role in Radiant's commercial business group ingesting, organizing, storing and disseminating data for a vast array of internal and external information consumers. The data engineer will serve as the subject matter expert (SME) to the software engineering, weather and imagery analysis operations, research science, and business management teams. This position requires someone who has the passion, organization, and vision to not only take ownership of their own technology stacks but to also work with various teams to create cutting edge products and services. If you have a passion for the atmospheric and geospatial sciences plus the background to handle complex data workflows in a fast-paced dynamic environment, we have an exciting opportunity for you.\n\n\n<ul>\n<li>Fluency in a variety of programming languages including Python, Perl, C/C++, JavaScript, and shell scripting</li>\n<li>Extensive experience designing relational databases with MySQL and/or PostgreSQL</li>\n<li>Experience developing in a Linux environment</li>\n<li>Experience with commercial and open source GIS software/libraries including ESRI ArcGIS, Erdas Imagine, QGIS, GeoServer, and GDAL</li>\n<li>Experience with version control software (Git)</li>\n<li>Degree in physical science (preferably meteorology), computer science or equivalent experience</li>\n<li>Excellent written and oral communication skills</li>\n</ul>\n\nQualificationsDesired Qualifications\n\n\n<ul>\n<li>10+ years of relevant professional experience</li>\n<li>Experience with atmospheric model data formats such as GRIB and NetCDF</li>\n<li>Experience creating graphics with GrADS and various Python data science libraries</li>\n<li>Experience managing NOAAPort and other vendor data streams with LDM</li>\n<li>Ability to leverage database administration expertise to serve as a technical liaison with our database administration team</li>\n<li>Familiar with API development in Python/Flask and/or Perl/Plack</li>\n<li>Experience with Amazon Web Services (EC2, S3, EBS, RDS, Lambda)</li>\n<li>Experience creating raster and vector data sets</li>\n<li>Familiarity with distributed processing in a clustered environment</li>\n<li>Experience working with customers and strategic partners to understand their needsTravel Requirements</li>\n</ul>\n\n<strong>Periodic travel to attend:</strong>\n\n\n<ul>\n<li>Industry conferences</li>\n<li>Meetings with partners</li>\n<li>Meetings with customers</li>\n</ul>\n\nTo be qualified you must be a US Citizen\n<br><br>\n# cjpost\n<br><br>\nOverview\n<br><br>\nJoin our company whose purpose is to help national security and commercial organizations understand and navigate our changing planet. Radiant Solutions provides multi-source data collection, enrichment, and analytic capabilities that reveal unique geospatial information and insights where and when it matters most.\n<br><br>\nNo other company has such strong roots in geospatial with our level of scale and a strong commercial mindset. We are well known for delivering innovative capabilities across the entire geospatial intelligence value chain. Our combined team of over 1,000 aerospace engineers, geospatial analysts, weather and ocean experts, software developers, data scientists, and DevOps engineers apply disruptive technologies and our unique intellectual property to both national security and commercial problems.\n<br><br>\nWe offer an excellent comprehensive benefits package including medical, dental, life, and short/long-term disability insurance, vacation and sick leave, 401(k) retirement plan, flexible spending account, and tuition assistance.\n<br><br>\nRadiant Solutions values diversity in the workplace and is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected veteran status, age, or any other characteristic protected by law.<br><br>SDL2017"}