{"job title": "Staff Scientist, Structural And Cellular Biology - DNA Damage Responses", "company": "National Institutes of Health", "city state": "– Research Triangle Park, NC", "rating": "4.2", "job description": "A Staff Scientist position is available in the Structural Cell Biology group of the National Institute of Environmental Health Sciences (NIEHS/NIH), Research Triangle Park, North Carolina. We are seeking a scientist with a strong track record in molecular biology, biochemistry, and/or structural biology. The selected individual will help to creatively lead our progressive research program and will synergize with our multidisciplinary team that employs cell biology, structural biology (e.g. X-ray crystallography electron microscopy), and biochemical methods to investigate mechanisms of the maintenance of genome stability. The laboratory is also fully equipped molecular biology, cell culture, and protein chemistry laboratory, and has direct access to confocal microscopy, flow cytometry, mass-spectrometry, X-ray crystallographic data collection, crystallization, and Cryo-EM facilities.\n<br><br>\nThe Williams group is in the Laboratory (i.e. Department) of Genome Integrity and Structural Biology (GISBL) in the Division of Intramural Research, with investigators renowned for their contributions to the area of genome stability, protein-DNA, protein-RNA biology, structural biology and biochemistry. The exceptional research and training environment is coupled to the strong NIEHS/NIH infrastructure, and offers a highly supportive and interactive scientific atmosphere with many diverse areas of expertise. NIEHS is located in an especially attractive part of North Carolina that is central to prominent research institutions, and within driving distance of the North Carolina coast to the East and the Appalachian Mountains to the West.\n<br><br>\nQUALIFICATIONS\n<br>\nThe ideal candidate will possess a Ph.D., with 4-5+ years of significant postdoctoral experience, and have a proven track record of leadership and accomplishment in either: 1) cellular and molecular biology of DNA damage responses, or 2) biochemistry and structural biology (X-ray crystallography and cryo-EM)."}