{"job title": "Research Scientist, Machine Perception and Learning (PhD University Grad)", "company": "Oculus VR", "city state": "– Redmond, WA", "rating": "4.5", "job description": "Research Scientist, Machine Perception and Learning (PhD University Grad)Facebook Reality Labs | Redmond, WA\n<br><br>\nFacebook Reality Labs (FRL) brings together a world-class, cross-discipline R&amp;D team with the shared goal of developing the next generation of AR and VR technologies. The Surreal Vision research group at FRL is seeking exceptional Research Scientists to achieve great strides in general scene understanding at our research location in Redmond, WA.\n<br><br>\nThe focus of this role lies in formulating a new generation of end-to-end real-time 3D scene understanding systems working across novel mobile sensor design, state estimation, computer vision, reconstruction, and large-scale online inference and optimization. In this role, there are opportunities to work closely with the Facebook AI research and applied machine learning groups, in addition to the leveraging the exciting team here at FRL, working across cutting edge device technologies in sensing and computational platforms. The successful candidate will be able to obtain and maintain work authorization in the US at the time of hire.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Looking at the limit of always-on ML within the context of consumer AR devices powered by AI</li>\n<li>Research across Machine Perception at the intersections of Deep Learning, reconstruction and state estimation</li>\n<li>Large-scale distribution of consumer devices operating within a cloud to client computing infrastructure</li>\n<li>Analysis of computing data hierarchy from cloud to mobile device client</li>\n<li>Understanding size, weight, cost, power, and bandwidth constraints of future consumer devices</li>\n<li>Formulation of new ML and data analysis approaches that harness always on device technology</li>\n</ul>\n\n<strong>Minimum Qualifications</strong>\n\n\n<ul>\n<li>Currently has or is in the process of obtaining a PhD degree or completing a postdoctoral assignment in the field of computer vision, machine learning or related field</li>\n<li>2+ years experience with statistical analysis of data and mathematical modeling</li>\n<li>2+ years experience with developing machine learning, Bayesian filtering, information theory, 3D geometry, optimization, system building, and physics based simulation</li>\n<li>3+ years experience in C++, Java or other related language such as Torch and TensorFlow</li>\n<li>Interpersonal experience: cross-group and cross-culture collaboration</li>\n<li>Must be available to start employment on or after September 1, 2018</li>\n</ul>\n\nPreferred Qualifications\n\n\n<ul>\n<li>Demonstrated software engineer experience via an internship, work experience, coding competitions, or widely used contributions in open source repositories (e.g. GitHub)</li>\n<li>Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as first-authored publications at leading workshops or conferences such as CVPR, ECCV/ICCV, SIGGRAPH, NIPS, etc.<br><br>SDL2017</li>\n\n</ul>"}