{"job title": "Senior Scientist (PhD), Bioassay and Impurity Testing", "company": "Pfizer", "city state": "– Saint Louis, MO", "rating": "3.9", "job description": "<strong>ROLE SUMMARY</strong>\n<br><br>\nBioassay and Impurity Testing Group: We are seeking candidates to join us in building capabilities to lead the industry in the advancement of novel products to the market through innovation and execution of analytical testing. This position will provide laboratory support and contribute data and knowledge to the development of primarily gene therapies (e.g., adeno-associated virus) with emphasis on mammalian cell-based bioassays, a range of immunoassays and PCR technologies. Working within a team setting, the qualified candidate will be responsible for developing analytical methods to monitor the intended mechanism of action of drug candidates and to confirm residual host impurities are controlled. This data is required to elucidate structure-function and to confirm suitable quality of clinical supplies in a broad biologics portfolio, but primarily focused on gene therapy (viral vectors) for this position. The candidate will work across analytical functions and projects and will also provide technical counsel to other scientists, organizations and senior leadership.\n<br><br>\n<strong>ROLE RESPONSIBILITIES</strong>\n\n\n<ul>\n<li>Responsible for performing and troubleshooting cell-based and immunoassays, while applying these methods to a broad range of biotherapeutics for early and late stage products in a GMP environment.</li>\n<li>Responsible for designing and performing qPCR experiments. Take lead role in advancing new DNA technologies to support robust assay development and product understanding.</li>\n<li>Documenting and reporting lab work according to GMP practices</li>\n<li>The candidate must be able to interact effectively with multi-disciplinary project teams.</li>\n<li>The candidate is expected to tabulate data, provide data interpretation to their teams and to their customers.</li>\n<li>Learn quickly both independently and from others</li>\n<li>Revise/review/author test methods, technical reports and regulatory content.</li>\n<li>Mentor other colleagues on scientific and strategic directions.</li>\n</ul>\n\n<strong>BASIC QUALIFICATIONS</strong>\n\n\n<ul>\n<li>Ph.D. in immunology, cell biology, virology or closely-related field with 0-5 years of experience, but B.S./M.S. with significant years of experience will also be considered.</li>\n<li>Previous experience developing and performing cell-based assays (e,g, viral infectivity, clotting), immunoassays (e.g., ELISA, Flow Cytometry) and qPCR methods for biotherapeutic drug candidates, for example gene therapies.</li>\n<li>Proficiency in DNA technologies such as primer/probe design, digital droplet PCR and sequencing data interpretation.</li>\n</ul>\n\n<strong>PREFERRED QUALIFICATIONS</strong>\n\n\n<ul>\n<li>Proven record of delivering results in a fast-paced environment and effective communication to project teams.</li>\n<li>Excellent technical writing and verbal presentation skills.</li>\n<li>Outstanding leader behaviors and the ability to collaborate and mentor others is a must.</li>\n<li>Experience in GxP (GLP, GMP) environment and implementation of continuous improvement practices.</li>\n<li>Method validation experience is a plus.</li>\n</ul>\n\nEEO&amp;Employment Eligibility\n<br><br>\nPfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.\n<br><br>\nSunshine Act\n<br><br>\nPfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider's name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. Ifyou have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.\n<br><br>\n<strong>Other Job Details:</strong>\n\n\n<ul>\n<li>Last Date to Apply for Job: September 14, 2018</li>\n<li>Eligible for Relocation Package: yes</li>\n<li>Eligible for Employee Referral Bonus: yes</li>\n</ul>\n\nPfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates."}