{"job title": "Associate Scientist, Formulation Development (non PhD)", "company": "Pfizer", "city state": "– Saint Louis, MO", "rating": "3.9", "job description": "This position will be part of Pharmaceutical Research and Development. The incumbent will participate in the formulation and process development, scale-up and transfer of protein therapeutics formulations and manufacturing processes. This position will be responsible for performing analytical characterization of candidate molecules by using various\n<br><br>\nbiophysical and biochemical characterization techniques. This is a laboratory based position performing formulation and process development activities specifically for protein therapeutics products from pre-clinical and Ph I clinical trials through manufacturing process performance qualification, license application and commercialization. Furthermore this position will assist in developing processes for drug product manufacturing, responsible for data compilation, data presentations and report writing.\n<br><br>\n<strong>RESPONSIBILITIES</strong>\n<br><br>\nThe responsibilities of Associate Scientist position include but are not limited to :\n\n\n<ul>\n<li>Participate in developing parenteral formulations for biotherapeutic modalities such as monoclonal antibodies, antibody drug conjugates, proteins and vaccines. Participate in developing and defining novel formulations for protein therapeutics products. This position will be responsible to assist in developing manufacturing processes (under general supervision).</li>\n<li>Perform rapid, comprehensive characterization of candidate molecules to determine the stability profile and applying this information to develop an appropriate dosage form to meet clinical needs. This will be achieved by applying various biophysical and biochemical techniques such as HPLC (SE-HPLC, IEX, RP-HPLC), SDS-PAGE, Capillary Gel electrophoresis (CGE),imaged Capillary Electrophoresis (iCE), Spectroscopy techniques such as UV and Fluorescence spectroscopy, Circular Dichroism and FTIR.</li>\n<li>The incumbent will assist in the development and scale-up of processes from bench top to pilot scale and, as required, technology transfer to commercial plants.</li>\n<li>The Associate Scientist must be able to interact effectively with a multi-disciplinary team of scientists for formulation optimization and overall candidate progression.</li>\n<li>This position will be responsible for preparing data summary presentation, compiling data and authoring technical reports.</li>\n<li>Effective communication skills are desirable for interactions with laboratory scientists, project managers and colleagues from numerous functions, serving on multi-disciplinary project teams.</li>\n</ul>\n\n<strong>BASIC QUALIFICATIONS</strong>\n\n\n<ul>\n<li>B.S. in Pharmaceutics, Chemistry, Chemical/Biochemical Engineering, Pharmacy, Biochemistry, Bioengineering, Biotechnology, Biology with 0-3 years' experience in parenteral formulation and process development of protein therapeutics.</li>\n<li>Familiarity with proteins and analytical techniques required.</li>\n</ul>\n\n<strong>PREFERRED QUALIFICATIONS</strong>\n\n\n<ul>\n<li>Working knowledge of formulation and process considerations for protein therapeutics.</li>\n<li>Prior Industrial experience is preferred.</li>\n<li>Familiarity with GLP/GMP requirements.</li>\n<li>Familiarity in scale-up and technology transfer to pilot/commercial scale.</li>\n<li>Knowledge of considerations for protein structure and stability considerations.</li>\n</ul>\n\nEEO&amp;Employment Eligibility\n<br><br>\nPfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.\n<br><br>\nSunshine Act\n<br><br>\nPfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider's name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.\n<br><br>\n<strong>Other Job Details:</strong>\n\n\n<ul>\n<li>Last Date to Apply for Job: September 14, 2018</li>\n<li>Eligible for Relocation Package: yes</li>\n<li>Eligible for Employee Referral Bonus: yes</li>\n</ul>\n\nPfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates."}