{"job title": "18024 Senior Social Scientist - Intel Support", "company": "S4 Inc.", "city state": "– San Antonio, TX", "rating": "4.3", "job description": "<strong>Job Title:</strong> 18024 Senior Social Scientist - Intel Support\n<br><br>\n<strong>Work Location:</strong> Lackland AFB, TX\n<br><br>\n<strong>Clearance:</strong> Current/Active TS+\n<br><br>\n<strong>Education:</strong> Doctorate (preferred) or Master's Degree in required field of knowledge\n<br><br>\n<strong>Experience:</strong> 12 years\n<br><br>\n<strong>Travel:</strong> Occasional\n<br><br>\n<strong>Job Listing Number:</strong> TX18016\n<br><br>\n<strong>LCAT:</strong> Senior Social Scientist - Intel Support\n<br><br>\n<strong>Overview:</strong> The JIOWC assists the Joint Staff in integrating Informational Power; improving Department of Defense ability to meet combatant command (CCMD) information-related requirements, improve development of information-related capabilities, and ensure integration and coherence across the DOD. The JIOWC provides strategic, operational and trans-regional intelligence expertise supporting the JIOWC mission areas of IO assessment, planning and execution, advocacy, and force development. This effort includes integration of current information technologies, identifying and using information operations applicable databases and information sources and operational IO intelligence support. The JIOWC Intelligence Branch (IB) provides Information Operations Intelligence Integration (IOII) to the JIOWC and advocates for joint IOII. In executing this function, IB maintains situational awareness; has both a trans-regional/geographic and functional focus; leverages the Intelligence Community (IC) for collection and production; and works to characterize key aspects of the Information Environment (IE).\n<br><br>\n<strong>Specific Duties:</strong> Provide human influence/factors support at JIOWC Headquarters in order to accomplish the following tasks:\n<ul>\n<li>Research, analyze, and develop JIOWC Intelligence Branch (IB) Information Environment products in support of internal and Joint Staff projects/tasking/planning efforts. (CDRL A003)</li> <li>Develop human influence/factors products utilizing psychological, social, cultural, human factors disciplines, and knowledge of strategic communication and public diplomacy to identify and effectively influence individuals or groups of interest.</li><li>Assess social science methodology and recommend new approaches for product development. Adapt methodologies of the respective team member disciplines and incorporate their expertise into human influence involving individuals, groups, and their operational environments.</li> <li>Support IO planning/plan reviews as needed.</li> <li>Train and mentor assigned personnel in advanced analytic techniques, requests for information processes, general intelligence methodology, and all other subjects/tasks as required.</li><li>Provide administrative and SME support to meetings.</li><li>Review and recommend capabilities, tools, and technologies to support the JIOWC intelligence mission set. Provide the expertise to assess the capabilities necessary for fulfillment of emerging mission requirements and recommend strategies for resource planning.</li><li>Participate in briefings, meetings, working groups, conferences, site visits, and reviews to assess and maintain current and future programs and projects.</li><li>Create, update, and maintain web-based products according to customer's request.</li><li>Meeting/Weekly Update Support: The contractor shall provide weekly activity reports and attend meetings as required.</li><li>Perform detailed analysis and research utilizing all source information.</li><li>Logically assimilate and de-conflict intelligence data</li> <li>Support the coordination of best practices, results and conclusions with relevant organizations.</li>\n</ul>\n<strong>Skills:</strong>\n<ul>\n<li>Critical thinking skills, both qualitatively and quantitatively</li><li>Ability to prepare a well-grounded, defensible argument</li><li>Ability to communicate effectively, both written and verbal</li><li>Strong organizational skills and ability to multi-task</li><li>Strong technical and analytical skills</li><li>Ability to work independently and as part of a team</li><li>Familiarity with USSTRATCOM and JIOWC organization desired</li><li>Familiarity with Joint processes, operations, and commands.</li>\n</ul>\n<strong>Qualifications:</strong>\n<ul>\n<li>Active current TS+ clearance</li><li>Experience with standard intelligence search tools, analytic tools, and dissemination tools and ability to demonstrate various analytical methodologies to support analysis.</li><li>Must possess minimum of eight (8) years of experience, demonstrated knowledge, understanding, and expertise in at least two (2) of the following standard intelligence automation applications (TAC, CRATE, COLISEUM, INTELINK, I-SPACE, CIA Wire, Open Source Center, PALANTIR).</li><li>Possess a minimum of ten (10) years' experience with Joint Operation Planning and Execution System (JOPES)/Joint Operation Planning Process (JOPP), Adaptive Planning and Execution (APEX), Joint and Service operational and intelligence structures, the elements of the intelligence community (IC), and intelligence equipment capabilities and as necessary service manpower systems.</li><li>Possess a minimum of ten (10) years' experience or familiarity with the targeting cycle, Military Intelligence Database (MIDB), Computer Network Operations Database (CNODB), target audience analysis, and entity characteristics (ref: JP 3-60 and CJCSM 3370.01).</li><li>Possess a minimum of ten (10) years of experience or familiarity with the Information Operations Community, IC, Department of Defense, and the Army, Navy, Marine Corps and Air Force. Experience or familiarity includes how each views, supports, or conducts information environment analysis and integrates intelligence in support of information operations.</li><li>Possess a minimum of ten (10) years of in-depth technical writing and editorial support in intelligence production at the strategic level for DOD or the USIC (U.S. Intelligence Community)... Strong background in product visualization options is a plus</li><li>Preferred to have at least twelve (12) years of experience, but must have a minimum of ten (10) years of experience conducting all-source intelligence and assessments, and demonstrate the ability to analyze/characterize, assess, and describe changes in the information environment baseline. Candidates without the preferred 12 years of experience must have at a minimum a BA/BS in a relevant field of study, though a MA/MS or doctorate is preferred</li><li>Possess proven staffing skills and strategic level writing experience; practical experience and expertise with high level organizations within the DOD (Joint Staff, CCMDs and other US Government agencies ex. Combat Support Agencies are highly desirable.)</li><li>Possess twelve (12) plus years of Senior Social Scientist experience, with the ability to conduct social science analysis and human influence analysis with emphasis in Information Operations. Must have in-depth knowledge in psychology, social psychology, behavioral science, and/or cultural anthropology; a doctorate (preferred) or master's degree with applied human influence experience is required. Expertise and understanding of Human Influence, including Military Information Support Operations (MISO).</li>\n</ul>\nTo apply to this position please go to www.s4inc.com and click on Careers to complete and an employment application and to upload your resume.\n<br><br>\nS4 Inc. offers competitive salaries and a comprehensive benefits package with 401(k), and universal time off. We are an Equal Opportunity Employerminorities/females/veterans/individuals with disabilities/sexual orientation/gender identity. S4 participates in the E-Verify employment verification program. If you are looking for a challenging and rewarding position, then we invite you to submit your resume including salary history/requirements. Candidate selected must be able to obtain and maintain the security clearance required by the contract at all times.\n<br><br>\nIf you are an individual with a disability or a disabled veteran, and need a reasonable accommodation to apply to a position, please contact Michelle Sweeney, HR Manager, by phone at (781) 273-1600 or by email at accommodation@s4inc.com.<br><br>0"}