{"job title": "Technical Services Scientist", "company": "SOLGAR VITAMIN", "city state": "– Bayport, NY", "rating": "3.2", "job description": "<strong>Job Description</strong>\n<br><br>\n<strong>Company Description</strong>\n<br><br>\nThe Nature's Bounty Co. has a history of championing health and wellness tracing back 145 years. Putting science and the highest quality standards at the heart of our business, the brands of The Nature's Bounty Co. are some of the most trusted in the world. Always motivated by nature's bountiful effects on people's health, our vision for health and wellness has inspired leading brands such as Nature's Bounty®, Sundown Naturals®, Solgar®, Holland &amp; Barrett®, Osteo Bi-Flex®, Ester-C®, MET-Rx®, Pure Protein®, Balance®, Body Fortress®, Puritan's Pride® and Organic Dr.®, among others. As a leading global manufacturer, marketer, distributor and retailer of vitamins, nutritional supplements, sports &amp; active nutrition and ethical beauty products, The Nature's Bounty Co. is committed to supporting wellness in all its forms.\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nTechnical Services Scientist sought by The Nature's Bounty Co., in Bayport, New York, 40 hrs./wk.\n<br><br>\nDuties: Under the direction of the Tech Services Manager, the Tech Services Scientist will work closely with multifunctional teams to help improve current products, address manufacturing issues, evaluate new technologies and/or ingredients, seek cost savings and maintain networks of external partners. Specifically, the position: Formulates nutritional supplement products in various forms in support of manufacturing. Assists with creating and approving new raw material specifications, master batch records, change controls, deviations or other required documentation in support of manufacturing existing in-line products. Assists in scale up, validating and transferring technologies/processes to other internal manufacturing sites, or externally. Defines and implements solutions for routine tasks, balancing achievement of milestones with high quality standards. Provides technical support to manufacturing including but not limited to formulation or process improvement, formulation globalization, cost savings initiatives, and trouble shooting. Interacts with multifunctional teams (including Quality, Procurement, Product Development and Manufacturing) and the Technical Design Council to resolve issues as may arise in the course of new product development or existing product improvement. Negotiates timeline commitments among other team members such that agreed objectives and timings for completion of activities are achieved. Rapidly communicates major changes to project plans to manager/director. Sets and refines individual priorities as necessary to remain focused on objectives and project milestones under rapidly changing circumstances. Looks for innovative and better ways of doing things. Actively looks to eliminate non-value added steps of processes and procedures. Explores and shares new scientific information, technologies, products and processes with the Science and Technology community. Builds awareness of developments outside of NBTY through attendance/presentations at trade associations or scientific meetings. Maintains external collaborations with suppliers, academia and other professional bodies. Performs comprehensive, sophisticated and critical evaluation of own data. Ensures that all internal and external work activities are conducted to appropriated standards, in accordance with Company policies, laws, quality standards, SOPs, etc. Min. Requirements: Bachelor's Degree or higher in Chemistry, Chemical Engineering, Pharmaceutical Science, or related discipline; and 12 months of experience working as a Scientist or in Research &amp; Development in the Pharmaceutical or Nutritional Industry. 12 months of Laboratory and experimental skills, data analysis and experience preparing written and verbal reports. Successful track record in the development of solid dosage products. Working knowledge of tablet presses, encapsulation, granulation and blending equipment. Experience with product development using Stage/Gate methodology, and in fostering a team approach to achieving project goals. Adherence to Standard Operating Procedures (SOP's) and current Good Manufacturing Practices (cGMP's) is required. Job located in Bayport, New York; 40 hours per week. $62,100 to $90,000 per year.\n<br><br>\nMin. Requirements: Bachelor's Degree or higher in Chemistry, Chemical Engineering, Pharmaceutical Science, or related discipline; and 12 months of experience working as a Scientist or in Research &amp; Development in the Pharmaceutical or Nutritional Industry. 12 months of Laboratory and experimental skills, data analysis and experience preparing written and verbal reports. Successful track record in the development of solid dosage products. Working knowledge of tablet presses, encapsulation, granulation and blending equipment. Experience with product development using Stage/Gate methodology, and in fostering a team approach to achieving project goals. Adherence to Standard Operating Procedures (SOP's) and current Good Manufacturing Practices (cGMP's) is required. Please reply with resume to: Jaime Cranor, The Nature's Bounty Co., 2100 Smithtown Ave. Ronkonkoma, NY, 11779.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nMin. Requirements: Bachelor's Degree or higher in Chemistry, Chemical Engineering, Pharmaceutical Science, or related discipline; and 12 months of experience working as a Scientist or in Research &amp; Development in the Pharmaceutical or Nutritional Industry. 12 months of Laboratory and experimental skills, data analysis and experience preparing written and verbal reports. Successful track record in the development of solid dosage products. Working knowledge of tablet presses, encapsulation, granulation and blending equipment. Experience with product development using Stage/Gate methodology, and in fostering a team approach to achieving project goals. Adherence to Standard Operating Procedures (SOP's) and current Good Manufacturing Practices (cGMP's) is required. Please reply with resume to: Jaime Cranor, The Nature's Bounty Co., 2100 Smithtown Ave. Ronkonkoma, NY, 11779.\n<br><br>\n<strong>Additional Information</strong>\n<br><br>\nPlease reply with resume to: Jaime Cranor, The Nature's Bounty Co., 2100 Smithtown Ave. Ronkonkoma, NY, 11779.\n<br><br>\nThe Nature's Bounty Co. is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n<br><br>\nThe Nature's Bounty Co. offers a competitive salary and a comprehensive benefits package, which includes health and dental plans, voluntary short-term and long-term disability, life insurance, flexible spending accounts, 401(k), tuition reimbursement, generous associate discounts and more!\n<br><br>\nPlease contact Human Resources at 631-244-2120 if you should need a reasonable accommodation to submit your information for our on-line job postings.<br><br>SDL2017"}