{"job title": "Geologist, Scientist or Environmental Engineer", "company": "Stantec Inc.", "city state": "– Lombard, IL", "rating": "3.2", "job description": "Grounded in safety, quality, and ethics, our experts lead their fields and guide our work with rigor, a creative spirit, and vision for growth. We draw from more than 20 technical specialties around the globe and are committed to fostering an inclusive community of diverse talents, backgrounds, and expertise. We're a place to apply your passion and collaborate with top environmental talents on work that's critical to our clients and the communities they support. Join a team that has the environment down to a science.\n<br><br>\nYour Opportunity\n<br><br>\nStantec is seeking a Geologist/Hydrogeologist to support our team of environmental professionals. The position will support the completion of environmental site investigation and remediation projects. Primary responsibilities will be related to performing key tasks to support hydrogeologic investigations, conceptual site model development, groundwater flow and contaminant transport modeling, remediation system evaluation, remedial system design, monitoring and maintenance, and statistical analysis of geologic and groundwater chemistry data. Responsibilities are anticipated to include but are not limited to the following:\n<br><br>\nYour Key Responsibilities\n\n\n<ul>\n<li>Task management for environmental sites undergoing assessment and/or active remediation</li>\n<li>Scheduling, scoping, reporting, budgeting and staff oversight</li>\n<li>Coordinating with and directing subcontractors</li>\n<li>Field work will be required, including drilling and construction oversight</li>\n<li>Design and implement environmental assessments</li>\n<li>Perform and document field data collection activities</li>\n<li>Conduct multi-media sampling (soil, groundwater, surface water, sediment, soil gas, indoor air)</li>\n<li>Oversee advancement of soil and rock borings, installation of groundwater monitoring wells, and soil excavation projects</li>\n<li>Prepare soil boring log and well construction diagrams</li>\n<li>Conduct aquifer testing and data analysis</li>\n<li>Development of conceptual site models</li>\n<li>Model groundwater flow and contaminant transport</li>\n<li>Interpret analytical laboratory results</li>\n<li>Collaborate with other scientific and engineering professionals within the practice</li>\n<li>Prepare technical reports</li>\n<li>Perform data analysis and data visualization through the use of GIS software</li>\n<li>Assist in the completion of project level work on environmental remediation/management projects for commercial/industrial clients</li>\n<li>Work will be conducted under the supervision of a project manager.</li>\n</ul>\n\nTravel may be required for the purpose of leading field crews, performing environmental monitoring, or off-site meetings with clients or regulatory agencies.\n<br><br>\nYour Capabilities and Credentials\n\n\n<ul>\n<li>40-hour OSHA Hazwoper training</li>\n<li>Direct experience including due diligence, site assessment, remediation, engineering, design, regulatory compliance, and environmental monitoring/sampling, and hazardous waste management</li>\n<li>Field experience is mandatory, with preference for environmental, health and safety oversight experience</li>\n<li>Practical ability to analyze field and technical data, perform research, demonstrate technical knowledge, and solve problems</li>\n<li>Strong technical writing skills</li>\n<li>Strong organizational and communications skills (able to communicate solutions in writing, verbally and graphically)</li>\n<li>Strong technical aptitude. Solid computer skills are a must. Knowledge of groundwater flow and contaminant transport modeling software, GIS, Excel, database software, etc., is preferred, but not necessary</li>\n<li>Working knowledge of Microsoft Excel, Word, and PowerPoint</li>\n<li>Valid driver's license</li>\n<li>Ability to pass drug test, background check, physical, and must have a satisfactory driving record in accordance with the Company's driving policy</li>\n<li>Must be an advocate for company and client's health and safety programs.</li>\n<li>Professional licensure is a plus.</li>\n</ul>\n\nEducation and Experience\n<br><br>\nA BS/MS Degree in Geology/Hydrogeology\n<br><br>\nMinimum of 3-5 years of experience\n<br><br>\nMajority of time spent in office environment with prolonged sitting and computer work, or combination of office and field.\n<br><br>\nAbility to lift and move items and equipment up to 50 lbs.\n<br><br>\nThis description is not a comprehensive listing of activities, duties or responsibilities that may be required of the employee and other duties, responsibilities and activities may be assigned or may be changed at any time with or without notice.\n<br><br>\nStantec is a place where the best and brightest come to build on each other's talents, do exciting work, and make an impact on the world around us. Join us and redefine your personal best.\n<br><br>\nJob: Geologist\n<br><br>\nPrimary Location: United States-Illinois-Lombard\n<br><br>\nEmployee Status: Regular\n<br><br>\nJob Level: Individual Contributor\n<br><br>\nTravel: Yes, 25 % of the Time\n<br><br>\nSchedule: Full-time\n<br><br>\nJob Posting: Aug 9, 2018, 1:42:49 PM\n<br><br>\nReq ID: 180001CT"}