{"job title": "Computer Scientist", "company": "The KEYW Holding Corporation", "city state": "– Hanover, MD", "rating": "NA", "job description": "<strong>Responsibilities</strong>\n<br><br>\nThe Computer Scientist shall have an expertise and knowledge and be able to apply this knowledge in the design, development, test and documentation of software code. The Computer Scientist shall apply sound planning, analysis and programming and coding practices.All developers on this task shall be familiar with the following technologies:Software driver developmentSoftware application developmentDigital signal processing applicationsClient/server applicationsLegacy and current processor technologyOperating systems, architectures, and interfacesAssembly and high-level programming languages Software/code reverse engineeringEmbedded software development Moderate and participate in software peer reviewsProvide technical management using project management best practicesLead a small team of contractor technical personnelEffectively communicate, both written and verbally, to the technical team, management, and customer so as to inform them of progress, plans and potential problems and viable solutionsApply sound planning, analysis, and programming and coding practices\n<br><br>\nAdditional requirements may apply.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nEight (8) years of experience in software and firmware design, development and test to include writing clear, concise, functioning and fully commented code that follow applicable Government standards\n<br><br>\nMaster's degree in Engineering, Physical Science, Computer Science, or Systems Engineering from an accredited college or university is required OR Ten (10) years of experience in software and firmware design, development and test to include writing clear, concise, functioning and fully commented code that follow applicable Government standards and a Bachelor's degree in Engineering, Physical Science, Computer Science, or Systems Engineering from an accredited college or university is required.• Programming experience for embedded Linux both user-space and kernel-mode software in C and ideally C++ as well.• Low-level development experience - e.g. interrupt handlers, device drivers, controlling peripherals, reading/writing Flash memory, etc.• Experience porting the Linux kernel to other hardware platforms, especially ARM-based platforms.• Experience with OpenWRT/LEDE distribution highly preferred.• Experience with the creation of Linux packages, ideally OpenWRT/LEDE, but also RPM packages for Fedora/Red Hat.• Experience standing up cross-compilers and build environments for bootstrapping a cross-development environment.• Understanding of GNU Make.• USB protocol and driver experience is a plus.• Experience with automake/autoconf suite is a plus.• Experiencesupporting patches for projects is a plus.• Python experience is a plus.\n<br><br>\nGov't Software Framework-experience, available in the reading room, is a plus.\n<br><br>\nAbout the Organization\n<br><br>\nKeyW is a pure-play national security solutions provider for the Intelligence, Cyber and Counterterrorism Communities' toughest challenges. We support the collection, processing, analysis and dissemination of information across the full spectrum of their missions. We employ and challenge more than 2,000 of the most talented professionals in the industry with solving such complex problems as preventing cyber threats, transforming data into intelligence and combating global terrorism.\n<br><br>\nKeyW, together with its direct and indirect subsidiaries, encourages and actively supports a policy of Equal Employment Opportunity and commits to provide equal opportunity to each individual, regardless of race, color, religion, gender, sexual orientation, age, national origin or ancestry, marital status, veteran status, disability or any other classifications protected by Federal, State or local law. In fact, we foster an environment that promotes diversity, balance and funbecause we believe in the importance of having a workplace as unique as the challenges we solve.\n<br><br>\nClearance\n<br><br>\nPositions require a Top Secret security clearance, based on current background investigation (SBI), as well as the favorable completion of polygraph. Clearance and polygraph processing will be completed by the U.S. Government."}