{"job title": "Bioinformatics Scientist", "company": "The Kemtah Group", "city state": "– West Sacramento, CA", "rating": "2.4", "job description": "<strong>DEPARTMENT/TEAM DESCRIPTION:</strong>\n<br><br>\nComputational Life Sciences is a team of bioinformatics scientists, data scientists, and data engineers who support the discovery, research, and development of microbial-based crop protection products through microbial genomics analysis, bioinformatics analysis, bio-statistics and modelling, and data management strategies.\n<br><br>\n<strong>POSITION SUMMARY:</strong>\n<br><br>\nWe are seeking an enthusiastic candidate with a strong interest in microbial genomics. Individuals with bioinformatics skills that would like to apply their knowledge to identifying microbial genes that are linked to plant pest/disease management and plant growth promotion are highly encouraged to apply. The candidate will assist bioinformatics scientists in the development of a fungal genome assembly and annotation workflow, and will coordinate with bioinformatics and data scientists, and biologists. A successful candidate will show a willingness to learn and must be self-motivated.\n<br><br>\n<strong>Requirements: POSITION DUTIES&amp;RESPONSIBILITIES:</strong>\n<br><br>\nAssist and collaborate in the development of a microbial genome assembly and annotation workflow.\n<br><br>\nUse bioinformatics techniques to analyze fungal genomes, helping to identify genetic features that facilitate plant-microbe interactions, control plant pests/diseases, and promote healthy plant growth.\n<br><br>\nUse statistics and machine learning to analyze microbial genomes.\n<br><br>\nCollaborate with biologists by providing bioinformatics analysis of individual microbial genomes and/or genes.\n<br><br>\nProvide verbal updates to his/her supervisor.\n<br><br>\nMaintain good documentation.\n<br><br>\n<strong>REQUIREMENTS/PREFERENCES:</strong>\n<br><br>\n<strong>Education Requirements:</strong>\n<br><br>\nAt minimum, Bachelors degree in Bioinformatics, Genetics, Genomics, Microbiology, Biochemistry, or a related scientific discipline with 2-5 years industrial biotechnology experience.\n<br><br>\nPreferred, Masters degree in same with 0-2 years industrial biotechnology experience.\n<br><br>\n<strong>Skill&amp;Competency Requirements:</strong>\n<br><br>\nPrevious experience with genome assembly and annotation, especially fungi\n<br><br>\nProficiency in standard bioinformatics analytical techniques\n<br><br>\nProficiency in searching and mining the scientific literature\n<br><br>\nFamiliarity with next generation sequencing data sets\n<br><br>\nProgramming and scripting in any of combination of Python, Perl, SQL, and/or R\n<br><br>\n<strong>Preferences:</strong>\n<br><br>\nPrevious experience in fungal biochemistry is highly desired\n<br><br>\nGood understanding of the genetics and molecular biology of microbes, especially fungi\n<br><br>\nStrong organizational, problem solving, and time-management skills\n<br><br>\nGood oral and written communication skills\n<br><br>\nQuick and self-motivated learner\n<br><br>\nWorks independently"}