{"job title": "Senior Medical Data Scientist", "company": "Atlas", "city state": "– NJ - Woodcliff lake", "rating": "3.4", "job description": "<div> Reference # : 18-01004 Title : Senior Medical Data Scientist</div> <div> Location : Woodcliff lake, NJ</div> <div> Position Type : Contract</div> <div> Experience Level : Start Date / End Date : 09/10/2018 / 09/09/2019</div> <div> Description</div> <div> <div>\nSenior Medical Data Scientist\n<br><br>\nMust have at least 5 years of clinical data review experience in Clinical Research, review protocol and CRF designs. Adequate knowledge of FDA requirements in narrative writing.\n<br><br>\nAbstracts all necessary information from CIOMS and recognize data discrepancies in Clinical Database. Performs reconciliation of safety report and clinical patient profile. Post queries for relevant information from safety report to be added in the clinical database. May require narrative writing for clinical data review profile.\n<br><br>\nQuantitative analysis ? Performs a comprehensive review for the all SAE data but not limited to reported and coded terms. Completes brief description of clinical cases for clinical data review utilizing the autogenerated narratives.\n<br><br>\nQualitative analysis ? Ensures all relevant information is captured in clinical database and provides quality , clinically meaningful narratives.\n<br><br>\nPerforms all duties according to company policy and regulations and guidance. Performs other duties assigned by the Director or Sr. Manager. No travel required.\n<br><br>\n<strong>QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>Graduate of adequate health care related course with commensurate experience in use of dictionaries in Clinical trial setting and have performed clinical data review.</li>\n<li>Minimum of 5 years of AE/SAE data review in Clinical Research.</li>\n<li>Strong knowledge of ICH guideline, or adequate background of pathogenesis of disease</li>\n<li>Knowledge of INFORM, J -review is a plus and/or other Clinical trial Systems</li>\n<li>Proficiency on all related regulations, GCP, and Good Clinical DM Practice</li>\n<li>Computer proficiency and knowledge of medical terminology</li>\n<li>Expertise on use of Microsoft applications, e.g word document, power point, excel</li>\n<li>Strong oral and written communication skills</li></ul></div></div>\n\n"}