{"job title": "Senior Machine Learning Engineer", "company": "Bose", "city state": "– US, MA - Framingham", "rating": "3.6", "job description": "<u><strong>Job Description</strong></u><br><br>Develops and programs integrated software algorithms to structure, analyze and leverage data in product and systems applications in both structured and unstructured environments. Develops and communicates descriptive, diagnostic, predictive and prescriptive insights/algorithms. In product/systems improvement projects: uses machine language and statistical modeling techniques such as decision trees, logistic regression, Bayesian analysis and others to develop and evaluate algorithms to improve product/system performance, quality, data management and accuracy. In both theoretical development environments and specific product design, implementation and improvement environments, uses current programming language and technologies to translate algorithms and technical specifications into code. Completes programming and implements efficiencies, performs testing and debugging. Completes documentation and procedures for installation and maintenance. May interact with users to define system requirements and/or necessary modifications.<br><br>Bose is an equal opportunity employer that is committed to inclusion and diversity. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, age, disability, veteran status, or any other legally protected characteristics. For additional information, please review: (1) the EEO is the Law Poster (http://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf); and (2) its Supplements (http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm). Please note, the company's pay transparency is available at http://www.dol.gov/ofccp/pdf/.pdf. Bose is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the application or employment process, please send an e-mail to Wellbeing@bose.com and let us know the nature of your request and your contact information."}