{"job title": "Lead Business Intelligence Data Analyst - BI Team Manager", "company": "CDK Global", "city state": "– Seattle, WA", "rating": "2.3", "job description": "<strong>Accelerate Your Career</strong>\n<br><br>\n<em>Drive global technology</em>\n<br><br>\n&nbsp;\n<br><br>\nWith more than $2 billion in revenues, CDK Global is a leading global provider of integrated information technology and digital marketing solutions to the automotive retail and adjacent industries.&nbsp;Focused on enabling end-to-end automotive commerce, CDK provides solutions to dealers in more than 100 countries around the world, serving approximately 28,000&nbsp;retail locations and most automotive&nbsp;manufacturers. CDK Global solutions automate and integrate critical processes from pre-sale targeted advertising to the sale, financing, insurance, parts&nbsp;supply, repair and maintenance of vehicles, with an increasing focus on utilizing data analytics and predictive intelligence.\n<br><br>\n&nbsp;\n<br><br>\nWe’re large enough to make a difference but small enough for your voice to be heard. This means that we are an organization where every person matters. You can make an impact on the success of our business and that of our customers regardless of what career you decide to pursue.\n<br><br>\n&nbsp;\n<br><br>\nFrom data scientists to sales and client service experts, we’re hiring to support your growth and ours -&nbsp;Green&nbsp;light your career.\n<br><br>\nCDK Global is hiring a <strong>Lead Business Intelligence Data Analyst</strong>!\n<br><br>\nThe <strong>Lead Business Intelligence Data Analyst</strong>, known in CDK as the BI Analytics Managing Lead, is responsible for managing technical analytics activities related to CDK’s Digital Marketing Services Platform. The Managing Lead will oversee a team of 8-10 Business Intelligence Analysts with the primary role of building the group’s business intelligence capabilities and increasing client facing value-add outputs without reducing quality or service.\n<br><br>\n<strong>The Ideal Candidate will possess:</strong>\n<br><br>\n. Extensive experience directly managing a team of Data Analysts\n<br><br>\n. Exceptional experience analyzing website and digital marketing performance, integrating multiple quantitative and qualitative data sources, reconciling conflicts, and distinguishing user requests from underlying true needs\n<br><br>\n. The ability to define and solve problems by creatively using available data and making reasonable assumptions\n<br><br>\n. Client management, and strategic and tactical consultation experience, building actionable, data-driven analytics and optimization solutions across multiple platforms and channels\n<br><br>\n. Excellent communication and relationship building skills from stakeholders up to executive level\n<br><br>\n. Experience guiding a team of employees to operate and execute on larger goals\n<br><br>\n<strong>Requirements and Skill Sets:</strong>\n<br><br>\n. 2+ years of people management experience (hands-on, supervisory background)\n<br><br>\n. 5+ years of data and analytics experience\n<br><br>\n. Prior project management background\n<br><br>\n. Understanding of and experience with SQL\n<br><br>\n. Experience with other various analytics tools and technologies (i.e. Tableau, Python, etc.)\n<br><br>\n. Digital advertising experience a plus\n<br><br>\n. Automotive industry experience a plus\n<br><br>\nCDK Global knows you have passions outside of work. You have family, friends, sporting events, and lots of things going on. That’s why we offer a comprehensive benefits package to not only take care of you but your family as well. All of our benefits are effective the first day of employment including 401K matching, paid time off to re-energize, donate your time to volunteer in your community, and tuition reimbursement to name a few.\n<br><br>\nAt CDK, we pride ourselves on having a diverse workforce. We value and celebrate the uniqueness of individuals and the different perspectives they provide. We offer equal opportunity employment regardless of race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, or protected veteran status."}