{"job title": "Quantitative Data Analyst (Uplift Financial)", "company": "Cogo Labs", "city state": "– Cambridge, MA", "rating": "4.2", "job description": "Interested in transforming the consumer finance industry? Uplift Financial is looking for you!\n<br><br>\nAs a Quantitative Data Analyst, you'll run and grow a new revenue line. You'll design and implement marketing programs, manage performance, and use the insights you gain to drive growth in user engagement and revenue.\n<br>\nThe Uplift Financial environment is very experiment driven and you will be encouraged to explore and test new ideas. The combination of your expertise and ideas will have a direct and immediate impact on the Uplift Financial business.\n<br><br>\nDay to day work will include devising new algorithms to better target consumers, profiling consumers utilizing consumer and business intelligence data, testing new campaign designs, managing marketing infrastructure, and developing growth and engagement forecasts.\n<br><br>\n<strong>Benefits of Uplif</strong>t:\n\n<ul>\n<li>Unmatched opportunity for growth: We believe in letting people grow as quickly as they can.</li> \n\n<li>A fun, supportive culture.</li> \n\n<li>An ability to make an immediate impact.</li> \n</ul>\n<strong>Other comps:</strong>\n\n<ul>\n<li>Catered lunches and a fully stocked kitchen.</li> \n\n<li>Commuting benefits like parking and T.</li> \n\n<li>Equity compensation.</li>\n</ul>\n<strong>Qualifications we are seeking:</strong>\n\n<ul>\n<li>A bachelor's in Mathematics, Economics, Statistics.</li> \n\n<li>Experience with Python &amp; SQL.</li> \n\n<li>The flexibility &amp; self-motivation to thrive in a dynamic, entrepreneurial culture.</li> \n\n<li>The ability to make a strong case when presenting findings &amp; recommendations, while remaining receptive to feedback.</li> \n\n<li>Demonstrated ability to work effectively as part of a team.</li> \n\n<li>Passions and interests outside of work - you aren't just your resume.</li>\n<li>Bonus points for previous experience with online marketing analytics.</li>\n</ul>\n\n<div>\nWhat We're Building</div><br>\n\n<div>\n<div>Uplift Financial is simplifying the complicated world of credit and helping users strengthen their financial health. Uplift's online marketplace identifies and connects consumers with financial tools and products that are appropriate for their specific financial needs. Consumers are able to access information about their credit, as well as tools to help with their financial decisions including budgeting, credit card selection, and savings simulation. Uplift Financial is incubating within the Cogo Labs venture accelerator.</div>\n</div>\n<br>"}