{"job title": "Engineering Data Scientist", "company": "DAL Global Services", "city state": "– Atlanta, GA", "rating": "2.8", "job description": "<ul>\n<li>*Overview**</li>\n</ul>\n\nDelta Global Services, a wholly owned subsidiary of Delta Air Lines, Inc., has a **Engineering** **Data Scientist** Job in Atlanta, GA through our Staffing Division. Client?s aircraft fleet of nearly 1700 gas turbine engines and 800 APUs constantly generate tremendous volumes of data. The equipment transmits real time operating parameters and fault codes. Plain text log files are created as a record of all maintenance activity while operational events and component removals are also recorded. In the **Engineering Data Scientist** job, the candidate will be responsible for integrating, analyzing and presenting this information such that Propulsion Engineering understands the overall reliability of these systems and is able to tactically direct maintenance action and recognizes opportunities to implement strategic reliability improvements.\n\n\n<ul>\n<li>*Responsibilities:**</li>\n</ul>\n\n+ Maintain Propulsion Engineering?s existing data collection and reporting infrastructure (SQL/Tableau/Alteryx) while leading Propulsion?s predictive analytics efforts forward.\n<br><br>\n+ Apply Machine Learning methods in concert with classical reliability statistics to provide insight into fleet reliability and operational event drivers.\n<br><br>\n+ Due to the generally high reliability of aviation gas turbines, they will be asked to draw predictive information from very low frequency events.\n<br><br>\n+ Be relied upon to extract information from existing, imperfect data sets and establish requirements to improve the structure of future data.\n<br><br>\n+ Practices safety-conscious behaviors in all operational processes and procedures.\n\n\n<ul>\n<li>*Qualifications:**</li>\n</ul>\n\n+ 8+ years? experience in data mining.\n<br><br>\n+ Bachelor?s degree in Reliability, Aerospace, Mechanical or Computer Engineering, Computer Science, Operations Research or related discipline required.\n<br><br>\n+ Advanced degree preferred.\n<br><br>\n+ A minimum of 5 years applied Predictive Analytics experience.\n<br><br>\n+ Familiarity with MS Access and exceptional MS Office skills Preferred.\n<br><br>\n+ Experience building end-to-end predictive analytic solutions such as\n<br><br>\n+ conditioning/cleansing raw unstructured data (e.g. plain text log files).\n<br><br>\n+ Statistical analysis: descriptive statistics and distribution fitting.\n<br><br>\n+ Modeling and simulation of rare events using state of the art techniques.\n<br><br>\n+ Visualizing results and presenting to stakeholders.\n<br><br>\n+ Experience in applying machine learning techniques and metrics with focus on Natural Language Processing in real world applications.\n<br><br>\n+ Experience in scripting programming languages (such as Python and R).\n<br><br>\n+ Experience in statistical analysis software (such as SAS and Minitab).\n\n\n<ul>\n<li>*Delta Global Services - Staffing Division (DGS)** has been ranked among Atlanta?s Top 25 Staffing Agencies by the Atlanta Business Chronicle for 14 consecutive years. DGS have over 170 locations in 49 states and we are the only staffing firm offering flight privileges to our employees, creating value for our clients and personnel. To be considered for the **Engineering Data Scientist** Job in Atlanta, GA, apply now. DGS is an Equal Opportunity Employer.</li>\n<li>*Job ID** _5044_</li>\n<li>*\\# of Openings** _1_</li>\n<li>*Category** _Information Technology_</li>\n</ul>"}