{"job title": "Data Scientist - 18", "company": "Global Technical Talent", "city state": "– ANDOVER, Massachusetts", "rating": "3.7", "job description": "<div>\n<div><strong>Job Summary:</strong><br>\nWe are looking for a Data Scientist to help our clients access large databases of information in order to help them make smarter decisions, so they can deliver better products and services. You will be applying data mining techniques, statistical analysis, and building high quality prediction systems.<br>\n<br>\n<strong>Key Responsibilities</strong>\n<ul>\n\t<li>Selecting features, building and optimizing classifiers using machine learning techniques</li>\n\t<li>Data mining using state-of-the-art methods</li>\n\t<li>Extending client's data with third party sources of information when needed</li>\n\t<li>Enhancing data collection procedures to include information that is relevant for building analytic systems</li>\n\t<li>Processing, cleansing, and verifying the integrity of data used for analysis</li>\n\t<li>Ad-hoc analysis and presenting results in a clear manner</li>\n\t<li>Creating automated anomaly detection systems and constant tracking of its performance</li>\n\t<li>Build quick Proof of Concepts (POC) and project ownership around projects that can demonstrate utilization, value and lead to scalable solutions</li>\n\t<li>Analyse a collection of raw data sets to create meaningful impact to large enterprise clients while maintaining a high degree of rigor and discipline</li>\n\t<li>Build data pipelines to aid analysis and/or reporting</li>\n\t<li>Demonstrates ability to extract meaning from and interpret data using a variety of tools and methods from statistics and machine learning</li>\n\t<li>Determines methods of statistical analysis and applies statistical techniques to determine measures of central tendency, correlation, sample size, significance of differences, etc.</li>\n\t<li>Communicate findings in an intuitive and visually compelling way</li>\n</ul>\n <br>\n<strong>Requirements:</strong>\n\n<ul>\n\t<li>Bachelors and at least four years of professional experience, or a Masters and a minimum of two years of experience, or PhD and one year or more of experience.</li>\n\t<li>Excellent understanding of machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Random Forests, etc.</li>\n\t<li>Experience (can execute data ingestion to insight) in programmatic language such as SQL, R, Python (Pandas, Scipy, Numpy)</li>\n\t<li>Experience with common data science toolkits, such as R, Weka, NumPy, MatLab, Tensorflow, etc.</li>\n\t<li>Understanding of cloud technologies, familiarity with AWS services a huge plus</li>\n\t<li>Conceptual understanding of NoSQL technologies including Hadoop, the map-reduce algorithm, HDFS, Hive, Impala, Pig, Accumulo, Apache ElasticSearch and data flow automation techniques such as Apache Camel or Nifi. AWS EMR, Spark, NiFi, Jupyter Notebooks a huge plus</li>\n\t<li>Experience with NoSQL databases, such as MongoDB, Cassandra, HBase is a plus</li>\n\t<li>Good applied statistics skills, such as distributions, statistical testing, regression, etc.</li>\n\t<li>Experience participating in Agile/SCRUM projects</li>\n\t<li>Experience of working in a client support role</li>\n</ul>\n <br>\n<strong>About the Company:</strong><br>\nOur client architects, designs and develops enterprise-class Mobile, Web, Social and Big Data solutions for some of the world’s most innovative start-up companies as well as for some of the world’s largest companies. Headquartered Cambridge, Massachusetts, they provide services and products to companies across the globe serviced by our nearly 200 professionals.<br>\n <br>\nThey have a 3.9-star rating on Glassdoor, with a 100% approval rating for the CEO and 93% of employees would recommend working for this company. Contact us to find out more!<br>\n <br>\n <br>\n </div>\n</div>"}