{"job title": "Research Scientist - R&amp;D Innovation", "company": "Leprino Foods", "city state": "– Denver, CO", "rating": "3.1", "job description": "<div><div>\n<div>\n<p> </p><p>For our Denver, CO corporate headquarters we are seeking either an <strong>entry level</strong> <strong>Scientist </strong>on our <strong>Innovation</strong> team at <strong>Leprino Foods</strong> to help us innovate and grow our nutrition business to larger levels around the globe!</p><p><br> <strong>We Ask Of You To:</strong></p><ul><li>Participate in and execute the Innovation strategic plan in alignment with the company’s strategy and goals.</li><li>Assist with innovative changes to existing and/or development of new dairy ingredients processes. </li><li>Provide troubleshooting and continuous improvement technical expertise in all matters regarding dairy ingredients production/processing operations.</li><li>Develop and implement procedures and methodology to improve efficiencies and quality.</li><li>Be scientific subject matter expert for dairy ingredients production and processes, and system development.</li><li>Provide support and expertise to many areas of the business to include production operations, engineering, and R&amp;D.</li><li>Maintain close contact with developments in the field, obtaining information from a variety of published and unpublished sources.</li><li>Develop the talent base for the organization through formal and informal coaching, teaching and mentoring. Raises the competency and capability of the entire Research &amp; Development organization.</li></ul><p><strong>We Offer You:</strong></p><ul><li>A competitive total compensation package including annual performance bonus eligibility and relocation (if applicable)!</li><li>401(k) along with enrollment in an annual Profit Sharing plan opportunity – we hire to retire!</li><li>Eligible for tuition reimbursement, award recognition, merit, and competitive health/dental/vision benefits.</li><li>Corporate office in the LoHi neighborhood just minutes from downtown Denver, including an on-site fast casual restaurant, constant pizza tastings, and a robust gym!</li><li>A chance to reside in sunny Denver, Colorado: 300 days of sunshine (average winter temperature is 47 degrees), the gateway to the Rocky Mountains and all its outdoor wonders, and home to eight professional sports teams including our very own former Super Bowl champs the Denver Broncos!</li></ul><p><strong>We Hope You Have (Mandatory Qualifications):</strong></p><ul><li>Bachelor’s degree in a Science discipline.</li><li>0-2 years of experience in food, pharmaceutical or biotechnology industry.</li><li>Experience in moderately complex lab or production equipment operations.</li><li>Proficient with MS Office (incl. Word, Excel, Outlook, PowerPoint).</li></ul><p><strong>We Hope You Also Have (Preferred Qualifications):</strong></p><ul><li>Bachelor’s Degree in Dairy Science, or Food Science/Technology.</li><li>2+ years of experience in dairy ingredients manufacturing as an engineer or scientist.</li><li>Experience with whey processing equipment such as membrane filtration, chromatography, lactose crystallizer, et al.</li><li>Experience in development of process such as separation, demineralization, decolorization, crystallization, et al.</li></ul>\n\n</div>\n</div>\n</div>"}