{"job title": "Senior Data Scientist - Innovation Engineering", "company": "Monsanto", "city state": "– Saint Louis, MO", "rating": "4.0", "job description": "Bayer is looking for a **Senior Data Scientist** . This position will be located in St. Louis, MO, reporting to Imaging and Detection Lead.\n<br><br>\nThe Senior Data Scientist is responsible for the development of novel software tools for multivariate modeling of high-content data centered on imaging and related detection technologies. Project stages include proof-of-concept code development, validation, refinement, hand-off for implementation, and continuous improvement phases. Expected knowledge will include proficiency with chemometric modeling of imaging data derived from image analysis and object classification based on spectral and feature analysis. All solutions will be deployable.\n<br><br>\nApplicants should have a clear demonstrated history of imaging-based data modeling using current modeling techniques and software. This role will also include developing a strategy for data modeling specific to our team?s needs, including harmonization of team efforts, coordinating internal and external collaborations, and working with diverse backgrounds to ensure the highest quality input data and modeling results. The individual will be expected to take an active role in project leadership or individual contribution, depending on specific applications and strategies.\n<br><br>\nWe are seeking a highly proactive individual who is willing to immerse in our project portfolio. In addition to focusing on existing deliverables, this individual should be seeking new opportunities to uncover hidden value in areas ranging from basic R&amp;D through current production processes. Applicants should be willing to become highly familiar with our techniques and interface regularly with lab researchers, key stakeholders, and leadership.\n<br><br>\n<strong>Key Responsibilities:</strong>\n<br><br>\n+ Work with key stakeholders to clearly define end objectives and deliverables.\n<br><br>\n+ Drive key decisions including whether to leverage existing technologies or develop new tools.\n<br><br>\n+ Attempt multiple approaches and use a data-driven approach towards method selection.\n<br><br>\n+ Interact frequently with R&amp;D personnel to define design of experiments approaches.\n<br><br>\n+ Participate in setup of prototypes and data collection process to identify problem areas early.\n<br><br>\n+ Acquire familiarity with all imaging and other techniques and identify pros and cons.\n<br><br>\n+ Understand limitations with some modeling methods due to practical throughput considerations.\n<br><br>\n+ Exhibit candor and constructive feedback to team members and stakeholders about problem areas.\n<br><br>\n+ Devise backup plans to ensure continued forward progress on projects.\n<br><br>\n+ Develop models are share preliminary findings, including failing fast on unproductive approaches.\n<br><br>\n+ Design and coordinate statistically significant large-scale validation studies.\n<br><br>\n+ Show a supportive approach towards existing modeling efforts and compare results and share ideas openly.\n<br><br>\n+ Delegate tasks when appropriate using existing tools and internal / external resources.\n<br><br>\n+ Work with the team to form a forward-thinking strategy and identify blind spots for innovation.\n<br><br>\n+ Work in a flexible innovation environment where priorities may shift.\n<br><br>\n+ Identify new opportunities that may be overlooked due to tunnel vision on workloads.\n<br><br>\n+ Become familiar with related efforts inside the company and identify potential collaborative opportunities.\n<br><br>\n+ Exhibit strong attention to best practices in data storage, method / code documentation, and IP capture.\n<br><br>\n+ Communicate effectively with peers, stakeholders, and leadership.\n\n\n<ul>\n<li>*Required Skills/Experience:**</li>\n</ul>\n\n+ Ph.D. and 5+ years industry experience OR Master?s degree and 10+ years industry experience in data modeling from imagery and/or related data sets.\n<br><br>\n+ Degree discipline in physical sciences, engineering, IT, or related field.\n<br><br>\n+ A proven track record of delivering multivariate data models centered on high-content imaging data and/or similar data sets, including data fusion from multiple techniques.\n<br><br>\n+ Significant hands-on experience with statistical analysis of spectral, imaging, and similar data using PCA, PLS, ANN, SVM, Na?ve Bayes, and similar methods.\n<br><br>\n+ Proficiency with scientific programming languages including MATLAB, Python, and/or related libraries.\n<br><br>\n+ Clear examples of taking initiative, identifying new methods and approaches, and challenging assumptions.\n<br><br>\n+ Clear examples of teamwork across broad disciplines with varied levels of familiarity of data modeling.\n<br><br>\n+ Willingness to travel 10% of time.\n\n\n<ul>\n<li>*Desired Skills/Experience:**</li>\n</ul>\n\n+ Experience with applying deep learning for object recognition, classification, and segmentation\n<br><br>\n+ Experience with major deep learning framework such as Keras, Tensorflow, and similar tools\n<br><br>\n+ Proficiency with building custom imaging systems, image data collection, and image processing\n<br><br>\n+ Experience with high-speed data processing including real-time prediction\n<br><br>\n+ Prior supervision of full time or temporary resources\n<br><br>\nBayer successfully completed the acquisition of Monsanto in June 2018, bringing together Monsanto?s leadership in seeds and plant traits with Bayer?s leadership in chemical and biological crop protection. By joining forces, we will create even more extensive career opportunities for talent around the world. We?re a global team working to shape agriculture through breakthrough innovation that will benefit farmers, consumers, and our planet.\n<br><br>\nWhile we are now Bayer, we will continue to hire using separate career sites until we can integrate our career platforms. We invite you to explore the career opportunities available at the combined company by visiting advancingtogether.com/careers .\n<br><br>\n<strong>\\#LI-POST</strong>\n\n\n<ul>\n<li>*Organization:** _GLB SC ProdTech Innovation &amp; Eng_51175506_</li>\n<li>*Title:** _Senior Data Scientist - Innovation Engineering_</li>\n<li>*Location:** _North America-USA-Missouri-St. Louis_</li>\n<li>*Requisition ID:** _01RUK_</li>\n<li>*Job:** _Research &amp; Development_</li>\n<li>*Schedule:** _Full-time_</li>\n</ul>\n\nAt Monsanto, we value a diverse combination of ideas, perspectives and cultures. All qualified applicants will receive consideration for employment without regard to, among other things, race, religion, color, national origin, age, sex, sexual orientation, gender identity, gender expression, status as a protected veteran, or status as a qualified individual with a disability. If you need a reasonable accommodation to access the information provided on this website, please for further assistance.access our disability accommodations process\n<br><br>\nU.S. Employment Law (applicable for U.S. jobs ONLY): EEO Employer Minorities/Females/Protected Veterans/Disabled. For information about equal employment opportunity rights, please refer to this information from the U.S. federal government: ; .\n<br><br>\nEEOC PosterEEOC Supplement"}