{"job title": "Senior Data Scientist", "company": "Rakuten", "city state": "– San Mateo", "rating": "2.5", "job description": "<div><div><div><div><div>Rakuten, Inc. is the largest ecommerce company in Japan,\n<br>\nand third largest ecommerce marketplace worldwide. Rakuten seeks to empower\n<br>\nmerchants to deliver Omotenashi, a hospitality mindset, which helps sellers\n<br>\ncreate lasting relationships with customers.\n<br><br>\nAt Rakuten, we offer competitive salaries, benefits,\n<br>\nannual bonuses, a stocked kitchen (including catered breakfast and lunch\n<br>\ndaily), and a dynamic office environment in San Mateo, CA. We love investing in\n<br>\nour people and when it comes down to it, we think our entire team is pretty\n<br>\nawesome. As a technology focused company, we understand the importance of an\n<br>\nenergizing atmosphere that promotes collaboration and innovation.<br>\n<div><strong>The Role</strong>:</div>\n<br>Working as part of the Global Data Office you will be\n<br>\npart of the team that provides data science solutions and data platform\n<br>\nservices at global scale. Leveraging diversity of data sources owned by Rakuten\n<br>\ngroup companies, you will deliver technology to effectively collect, manage,\n<br>\nand provide group-wide data. You will proactively identify business needs from\n<br>\nvarious companies and implement advanced analytics solutions to create business\n<br>\n<strong>value.<br>\n<div><strong>Responsibilities</strong>:</div>\n\n<br></strong>\n\n<ul>\n<li>Work with stakeholders throughout the organization to\n<br>\nidentify opportunities for leveraging company data to drive business solutions.</li><li>Retrieve data required for analyses from\n<br>\ninternal/external sources while ensuring data quality</li><li>Perform statistical analyses and build machine-learning\n<br>\nmodels to deliver insights</li><li>Prioritize data science solutions development opportunities\n<br>\nto create maximum business value</li><li>Build and test solution prototypes to demonstrate\n<br>\npotential value to management</li><li>Standardize and implement solutions across Rakuten group\n<br>\nin an efficient, scalable manner</li><li>Collaborate with business managers, engineers, and\n<br>\nR&amp;D teams to effectively identify new opportunities and systemize\n<br>\ndevelopment operations/process</li><li>Follow trends in modern technology (AI) and propose\n<br>\ninnovative approaches</li>\n</ul>\n\n<strong><div>Minimum Qualifications:</div>\n\n<br></strong>\n\n<ul>\n<li>Masters in Computer Science, Mathematics, Statistics, or\n<br>\nrelated field</li><li>2+ years of experience as a data scientist</li><li>Experience building end-to-end data pipeline solutions.</li><li>Solid background in SQL, and a statistical computer\n<br>\nlanguage (Python, R).</li><li>Knowledge of a variety of machine learning techniques\n<br>\n(GLM/regression, decision tree learning, boosting, deep neural networks, text\n<br>\nmining, etc.) and their advantages/drawbacks</li><li>Ability to identify, summarize, and visualize business\n<br>\nissues</li><li>Self-motivated, team-oriented, responsible, and reliable\n<br>\nwith a positive attitude and strong communication skills</li>\n</ul>\n\n<strong><div>Preferred Qualifications:</div>\n\n<br></strong>\n\n<ul>\n<li>PhD in Computer Science, Physics, Mathematics,\n<br>\nStatistics, Engineering, or relevant field</li><li>Vast experience in industry application of statistics for\n<br>\ndata analysis (hypothesis testing, Bayesian analysis, time series analysis,\n<br>\nexperimental design, power and sample sizes, etc.)</li><li>Experience with big data tools (Hadoop, Hive, etc.)</li>\n</ul>\nAny unsolicited resumes/candidate profiles submitted\n<br>\nthrough our website or to personal email accounts of employees of Rakuten and\n<br>\nany subsidiaries of Rakuten are considered property of Rakuten and any\n<br>\nsubsidiaries of Rakuten and are not subject to payment of agency fees.</div>\n</div>\n </div>\n </div>\n</div>\n<br>"}