{"job title": "Cyber Data Scientist", "company": "Vencore", "city state": "– Herndon, VA", "rating": "3.2", "job description": "<ul>\n<li>*Overview**</li>\n</ul>\n\nEvery day at Perspecta, we enable hundreds of thousands of people to take on our nation?s most important work. We?re a company founded on a diverse set of capabilities and skills, bound together by a single promise: we never stop solving our nation?s most complex challenges. Our team of engineers, analysts, developers, investigators, integrators and architects work tirelessly to create innovative solutions. We continually push ourselves?to respond, to adapt, to go further. To look ahead to the changing landscape and develop new and innovative ways to serve our customers.\n<br><br>\nPerspecta works with U.S. government customers in defense, intelligence, civilian, health care, and state and local markets. Our high-caliber employees are rewarded in many ways?not only through competitive salaries and benefits packages, but the opportunity to create a meaningful impact in jobs and on projects that matter.\n<br><br>\nPerspecta?s talented and robust workforce?14,000 strong?stands ready to welcome you to the team. Let?s make an impact together.\n<br><br>\nPerspecta is an AA/EEO Employer - Minorities/Women/Veterans/Disabled and other protected categories\n\n\n<ul>\n<li>*Responsibilities**</li>\n</ul>\n\nJoin Perspecta in support of a future contract to provide network security services to protect against the outside threat for an Intelligence Community customer. Security event correlation was yesterday. Cyber data analytics is today. As part of the cyber analytics team, you will help tackle the ETL of structured and unstructured event and threat data from multiple, disparate sources. Duties include: - Responsible for working with CIRT to develop platforms and capabilities that support analytic requirements for detecting malicious cyber activity on the network, on virtualization platforms, and specific network devices, on endpoints, in databases, at the application tier, in cloud environments, and more. - Determine how to best leverage existing data sets for the purposes of enhancing CIRT?s cyber analytic capabilities. Create software capabilities to best leverage data sets to benefit CIRT analytic capabilities. These capabilities may include software that allows for visualization of large data sets, with the purpose of finding outliers and anomalies. These capabilities may also include creating regular expressions to normalize or filter incoming data streams. These capabilities may include working with the SIEM team to allow for ingestion of data sets. - Work with management to interface with cyber data providers to provide requirements for log ingestion to systems and Enterprise data. The Senior Software Developer will work with CIRT analysts and SIEM engineers to determine which log types have the most value for CIRT analytics and detection.\n\n\n<ul>\n<li>*Qualifications**</li>\n</ul>\n\nRequired - BS degree in computer engineering or computer science or related discipline. - Minimum of 5 years of progressively responsible experience in IT software development. - Demonstrated knowledge and 5-10 years? hands-on experience with Software Development Lifecycle methodologies, including tactical software development, Agile, Kanban, and related methodologies - Demonstrated knowledge minimum 5 years? hands-on experience with IT infrastructure, which includes the following disciplines: network, backup, platforms, middleware, application, monitoring, and security. - Experience with software development, either an open-source enterprise software development stack (Java/Linux/Ruby/Python) or a Windows development stack (.NET, C#, C++). - Experience with data transport and transformation APIs and technologies such as JSON, XML, XSLT, JDBC, SOAP and REST. - Top Secret/SCI w/Poly Desired - MS degree in computer science or data science. - Experience with Cloud-based data analysis tools including Hadoop and Mahout, Acumulo, Hive, Impala, Pig, and similar. - Experience with visual analytic tools like Microsoft Pivot, Palantir, or Visual Analytics. Experience with open source textual processing such as Lucene, Sphinx, Nutch or Solr. - Experience with entity extraction and conceptual search technologies such as LSI, LDA, etc. Experience with machine learning, algorithm analysis, and data clustering.\n<br><br>\nSubmit employee referral\n<br><br>\nSorry the Share function is not working properly at this moment. Please refresh the page and try again later.\n\n\n<ul>\n<li>*Connect With Us!**</li>\n</ul>\n\nNot ready to apply?for general consideration.\n\n\n<ul>\n<li>*Req #** _2017-49052_</li>\n<li>*Category** _Information Technology_</li>\n<li>*\\# of Openings** _2_</li>\n<li>*Job Location** _US-Herndon-VA_</li>\n<li>*Clearance** _Top Secret/SCI w/Poly_</li>\n</ul>"}