{"job title": "R&amp;D Scientist 3", "company": "AECOM", "city state": "– Morgantown, WV", "rating": "3.2", "job description": "<ul>\n<li>*Business Line** Energy</li>\n<li>*Position Title** R&amp;D Scientist 3</li>\n</ul>\n\nUnited States of America - West Virginia\n<br><br>\nMorgantown\n\n\n<ul>\n<li>*Job Summary**</li>\n</ul>\n\nAECOM is seeking a Research and Development Scientist 3 for our Morgantown, WV location.\n<br><br>\n<strong>Responsibilities include:</strong>\n\n\n<ul>\n<li>Developing test plans and implementing them on laboratory power equipment to demonstrate the dynamic performance of agent-based controllers on integrated laboratory power equipment.</li>\n<li>Analyzing laboratory test data to evaluate results pertaining to agent-based and more traditional control systems.</li>\n<li>Maintaining real-time modeling capability and enhancing capabilities to conduct experiments using cyber-physical systems that are relevant towards optimizing process performance in terms of dynamic stability, robustness to change load, and improvements in the efficiency of the power system.</li>\n<li>Acting as a technical resource to meet task requirements of NETL and AECOM research managers in attaining goals established for the NETL team and NETL Research and Innovation Center programs</li>\n<li>Participation in group meetings with the NETL Innovative Energy &amp; Water Processes Team as well as other task related meetings</li>\n<li>Preparation of technical papers, reports, conference papers, and annual and quarterly administrative reports</li>\n<li>Presenting the results of the research at technical conferences and publishing in archival journals</li>\n<li>*Minimum Requirements**</li>\n</ul>\n\nBachelors degree and 5 years of job-related experience in biology, chemistry, economics, geology, physics, mathematic or related scientific field or a Masters degree or equivalent. Excellent communications and analytical skills, working knowledge of computer systems and integrated software application programs. Position may require travel. Position may require the ability to pass and maintain a security clearance.\n\n\n<ul>\n<li>*Preferred Qualifications**</li>\n</ul>\n\nPhD in physics, mechanical engineering, control systems engineering, or a closely related field with significant expertise in agent-based and traditional control systems.\n<br><br>\nThe researcher needs to be proficient with dSpace hardware and software\n<br><br>\nExperience with test operations in a national laboratory environment preferred\n\n\n<ul>\n<li>*What We Offer**</li>\n</ul>\n\nAECOM is a place where you can put your innovative thinking and business skills into high gear and work alongside other highly intelligent and motivated people. It's a place where you can apply your skills to some of the world's most challenging, interesting, and meaningful projects worldwide. It's a place that values the diversity of our areas of practice and our people. It's what makes AECOM a great place to work and grow.\n<br><br>\nAECOM is an equal opportunity employer and Minorities, Females, Veterans, and Disabled persons are encouraged to apply. For further information, please click here to view the EEO Is The Law poster.\n<br><br>\n<strong>_NOTICE TO THIRD PARTY AGENCIES:_</strong>\n<br><br>\n_Please note that AECOM does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed Recruitment Fee Agreement, AECOM will not consider or agree to payment of any referral compensation or recruiter fee. In the event a recruiter or agency submits a resume or candidate without a previously signed agreement, AECOM explicitly reserves the right to pursue and hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of AECOM._\n\n\n<ul>\n<li>*_Job Category_** _Sciences_</li>\n<li>*_Business Group_** _Management Services Group (MS)_</li>\n<li>*_Country_** _United States of America_</li>\n<li>*_Position Status_** _Full-Time_</li>\n<li>*_Requisition/Vacancy No._** _193424BR_</li>\n</ul>\n\n_Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status._"}