{"job title": "Scientist - Molecular Biology", "company": "Amgen", "city state": "– Thousand Oaks, CA", "rating": "3.7", "job description": "Amgen is seeking a highly motivated Scientist to join the molecular biology group in Biologics Optimization at our state-of-the-art research facility at Amgen headquarters in Thousand Oaks, CA.\n<br><br>\nThe Biologics Optimization group is a multidisciplinary team with capabilities in protein engineering, cloning, expression, purification, and analysis of therapeutic proteins. The group is responsible for the optimization, production, assessment, and selection of large molecule drug candidates.\n<br><br>\nThe Scientist in molecular biology will be responsible for the design and creation of genetic constructs for recombinant protein production, including vector design for recombinant protein expression and cloning of complex multi-domain proteins.\n\n\n<ul>\n<li>*Responsibilities:**</li>\n</ul>\n\nDesign, engineer, and assemble expression constructs and expression vectors for diverse protein classes and expression hosts.\n<br><br>\nDevelop and implement innovative technologies to improve efficiency and speed of the molecular biology processes in the Biologics Optimization organization.\n<br><br>\nWork with large data sets and modern informatics tools.\n<br><br>\nDesign high throughput work streams and carry out work using automated equipment.\n<br><br>\nProvide scientific results that support the generation of publications, patents, or regulatory submissions, and participate in internal and external scientific meetings.\n<br><br>\nAct as a scientific leader with the ability to drive innovation, solve technical problems, and work independently.\n\n\n<ul>\n<li>*Basic Qualifications**</li>\n</ul>\n\nDoctorate degree\n<br><br>\n<strong>OR</strong>\n<br><br>\nMaster's degree and 4 years of scientific experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nBachelor's degree and 6 years of scientific experience\n\n\n<ul>\n<li>*Preferred Qualifications**</li>\n</ul>\n\nKnowledge of successful design strategies for mammalian and prokaryotic recombinant protein expression\n<br><br>\nKnowledge of antibody structure and function\n<br><br>\nStrong communication and interpersonal skills, and the ability to work flexibly in a cross-functional team environment\n<br><br>\nDemonstrated track record of independent critical thinking and scientific achievement in research, exemplified by a strong publication and/or patent record\n<br><br>\nExpertise in sequence and structure-based protein engineering\n<br><br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n<br><br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status."}