{"job title": "Scientist Vascular Progenitors", "company": "Astellas Pharma US", "city state": "– MA, Marlborough", "rating": "3.2", "job description": "The Astellas Institute of Regenerative Medicine (AIRM) is a wholly-owned subsidiary of Astellas Pharma and focused on the development and commercialization of stem cell and regenerative medicine therapies. Astellas is an R&amp;D-driven global pharmaceutical company whose philosophy is to contribute to the improvement of people's heath around the world through the provision of innovative and reliable pharmaceutical products.\n<br><br>\nDeveloping innovative therapies is one of the most challenging, most essential and personally rewarding fields in science. This is the most exciting time to be a part of Astellas, a company with a uniquely collaborative and patient-focused culture. There's something special about working at Astellas. It's reflected in our focus on the people we serve, the way we treat each other and the results we achieve together as a company.\n<br><br>\nAIRM has a world-class R&amp;D team, and is pursuing a diverse range of disease indications, ranging from macular degeneration (currently in clinical trials) and other ocular indications to vascular and autoimmune disease. AIRM's intellectual property portfolio includes pluripotent stem cell platforms -- both embryonic and induced pluripotent stem cells as well as other cell based therapy research programs. AIRM is headquartered in Marlborough, Massachusetts.\n<br><br>\n<strong>Purpose &amp; Scope:</strong>\n<br><br>\nWe are seeking highly motivated individuals with a demonstrated potential for creativity and excellence. The successful applicant will design and conduct novel cell biology and molecular laboratory research and will play a key role in developing our current and new research programs.\n<br><br>\n<strong>Essential Job Responsibilities:</strong>\n\n\n<ul>\n<li>Performs research and/or development in collaboration with others.</li>\n<li>Makes detailed observations, analyzes data and interprets results.</li>\n<li>Exercises technical discretion in the design, execution and interpretation of experiments that contribute to project goals.</li>\n<li>Prepares technical reports, summaries, protocols, and quantitative analyses. Investigates, creates and develops new methods and technologies for project advancement.</li>\n<li>Maintains high level of professional expertise through familiarity with scientific literature and novel technologies.</li>\n<li>Uses professional concepts in accordance with company objectives to solve complex problems in creative and effective ways.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n<br><br>\nRequired\n\n\n<ul>\n<li>PhD or MS level scientist with strong vascular progenitor cell biology and differentiation experience</li>\n<li>Previous hands-on experience with pluripotent stem cells</li>\n<li>Hand on experience with cell lineage characterization using flow cytometry immunofluorescence (ICC/IHC), confocal microscopy and RNA analysis</li>\n<li>Expertise on cell characterization through new technologies such as microfluidic device, Single cell RNA analysis, Transcriptomics etc.</li>\n</ul>\n\nPreferred\n\n\n<ul>\n<li>Post-doctoral experience is a plus but not required</li>\n<li>Working knowledge of pre-clinical animal models of human ischemic diseases such as hind limb ischemia (HLI)</li>\n<li>Experience with exosome research</li>\n</ul>\n\n<strong>Disclaimer:</strong>\n<br><br>\nThe statements above are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified. All personnel may be required to perform duties outside of their normal responsibilities from time to time.\n<br><br>\n<strong>#LI-JA1</strong>\n<br><br>\nEqual Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}