{"job title": "Senior PK Scientist", "company": "Bristol-Myers Squibb Company", "city state": "– Hopewell, New Jersey", "rating": "3.7", "job description": "Bristol-Myers Squibb is a global biopharmaceutical company whose mission is to discover, develop and deliver innovative medicines that help patients prevail over serious diseases.\n<br><br>\nOne shared journey is moving us forward at Bristol-Myers Squibb. Around the world, we are passionate about making an impact on the lives of patients with serious disease. Empowered to apply our individual talents and ideas so that we can learn and grow together. Driven to make a difference, from innovative research to hands-on community support. Bristol-Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees the resources to pursue their goals, both at work and in their personal lives.\n<br><br>\n<strong>Job Description</strong>:\n<li>In this role, the individual will have the responsibility to review the pharmacokinetic section of a clinical protocol, ensure the pharmacokinetic components of the clinical case report form and the spec document match the protocol requirements and then create the pharmacokinetic database according the specifications dictated in the protocol and the expectations of departmental guidelines.</li><li>This individual would also be responsible to review the pharmacokinetic concentration data for potential errors and coordinate the cleaning and tracking of PK metadata according to provided specifications.</li><li>This individual would then transfer the cleaned data to the analysis program and conduct the expected non-compartmental pharmacokinetic analysis according to protocol and departmental specifications.</li><li>From the analysis program, this individual would then create tables, listings, and figures according to the statistical analysis plan for the study and, when final, upload them to the proper document repository for access by the medical writer.</li><li>This individual may also be responsible for reviewing pharmacokinetic components of the statistical analysis plan and authoring some components of the clinical study report.</li><li>This individual will liaise with the Clinical Pharmacology Leads and protocol Study Directors in the Therapeutic Areas to understand the particular needs of the study and to keep them informed to the status of pharmacokinetic analysis.</li><li>This individual will need to work with external partners for non-compartmental analyses that are performed by our external partners.</li><li>The individual will provide the relevant reference documents, analysis expectations and timelines to the external partner and also QC their work.</li><li>This individual may also assist in conducting, compiling, and summarizing literature searches to support elements of the protocol, clinical study report, or as other needs arise.</li><li>This individual may also be asked to serve as a study director on certain outsourced studies and therefore must be able to understand all aspects of a clinical trial and be able to problem solve issues as they arise from protocol design to report completion.</li>\n<strong>Position Requirements</strong>:\n<li>Masters in pharmacology/pharmacokinetics/pharmaceutical sciences or a related field with at least 2 years of pharmaceutical industry experience</li><li>Knowledge of PK data flow process and experience with Phoenix WinNonlin is a plus</li><li>Experience working in a highly matrixed organization is desirable</li><li>Strong communication and multi-tasking skills are required. It is expected that the individual be highly self-motivated and likes to contribute toward problem solving</li>"}