{"job title": "Sr Clinical Biomarker Scientist", "company": "Bristol Myers Squibb", "city state": "– Princeton, NJ", "rating": "3.7", "job description": "Bristol-Myers Squibb is actively conducting translational medicine research to further our understanding of cancer biology and to identify which patient populations may be more likely to derive benefit from Immuno-Oncology (I-O). Bristol-Myers Squibb has long believed the future of cancer research is dependent on investments in science and partnerships. Collaboration is integrated into our organizational framework across translational medicine and R&amp;D. The Clinical Biomarker Scientist is responsible for developing and executing on translational strategies for the Oncology pipeline. This scientist works on various projects across all stages of drug development and will act as a key interface with the Translational Medicine group.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\n? Responsible for integrating translational research and clinical development, development a biomarker strategy in alignment with clinical development objectives, leading efforts for data generations, interpretation and communication to the development teams.\n<br><br>\n? Responsible for understanding external research environment, partnering with discovery biology and other functions both internally and externally to coordinate the execution of Translational R&amp;D deliverables\n<br><br>\n? Engages functional groups to develop, champion, implement and align biomarker strategies for development projects in support of the overall R&amp;D portfolio goals.\n<br><br>\n? Effectively engages with teams and utilizes advisory bodies (e.g., Biomarker technology matrix, translational R&amp;D core team) to define, revise and progress translational/biomarker plans.\n<br><br>\n? Continually analyzes progress, engages in critical thinking, and asserts strong problem-solving towards delivering key data and interpretation essential for decision making.\n<br><br>\n? Delivers high quality biomarker strategies for target engagement, pharmacodynamics endpoints and patient selection (where appropriate)\n<br><br>\n? Ensures the output of the biomarker plans meets established project standards.\n<br><br>\n? Engages team members to ensure alignment of biomarker strategies with clinical operational plans with functional area capabilities\n<br><br>\n? Builds productive relationships with team members that interact with the clinical biomarker group.\n<br><br>\n? Cooperates with functions to maximize resources for optimal portfolio prosecution.\n<br><br>\n? Effectively interfaces with functional areas to ensure strategic alignment and to obtain appropriate operational resources to deliver on biomarker goals.\n<br><br>\n? Ensures appropriate decisions are made in a timely manner at the appropriate levels to drive biomarker deliverables.\n<br><br>\n? Communicates key biomarker program information, risks, and milestones, and manages information flow across team members.\n<br><br>\n<strong>Qualifications:</strong>\n<br><br>\n? MD, PhD, or equivalent advanced biology degree.\n<br><br>\n? Experienced scientist with 3+ years of experience in the drug development process.\n<br><br>\n? Significant understanding of the role of translational research/medicine and clinical biomarkers in drug development\n<br><br>\n? Demonstrated knowledge of oncology and/or tumor-immunology disease biology\n<br><br>\nBristol-Myers Squibb is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status."}