{"job title": "BSM Data Specialist I", "company": "Central Business Solutions, Inc", "city state": "– Pleasanton, CA", "rating": "3.5", "job description": "<strong>Job Title :BSM Data Specialist I</strong>\n<br>\n<strong>Location:</strong><strong>Pleasanton , CA.</strong>\n<br><br>\n1) No Remote Work\n<br>\n2) No Data Analyst or Scientist\n<br>\n3) Meticulous, Detail Orientated, and can Over-see their Projects\n<br>\n4) Data Management Heavy\n<br>\n5) Vendor Coordiantor\n<br>\n6) One phone screening, two on sites\n<br><br>\n<strong>Position, Location and Scope</strong>\n<br>\nThe BioSpecimen Data Specialist position will facilitate the daily operation associated with the management of data within the BioSpecimen Management (BSM) function at Client Molecular Solutions (RMS).\n<br>\nThe BioSpecimen Management function at RMS leads the acquisition, characterization, and management of biological materials, associated data, and build of select panels designed to facilitate and advance RMD research and development activities. This position will be based at RMS campus located in Pleasanton, California.\n<br>\n<strong>Specific Responsibilities</strong>\n<br>\nUnder general supervision, the candidate conducts data management activities, such as, data file transfers from suppliers, tracking of source data files, data review, data transcription, data import, data quality and consistency checks, resolution of data discrepancies, and data export while working within a validated laboratory information management system.\n<br>\nWorks independently and assumes responsibility for the accuracy, quality, and timeliness of all assigned projects and related activities, and keeps supervisor informed of project status.\n<br>\nMaintains working relations with external partners and internal clients/project teams and trains them on data processes as needed\n<br>\nAssumes accountability for electronic records management and use of validated systems ensuring information is maintained according to established formats.\n<br>\nWith guidance, analyzes and brainstorms alternative approaches to solve complex problems or develop new perspectives on existing solutions.\n<br>\nAssists with computer system validation activities (testing, training, etc.), change management and data standardization, as required, in compliance with business and regulatory standards.\n<br>\nPosition Requirements &amp; Experience\n<br>\nBachelors degree in Biological Science or related field, or equivalent combination of education and work experience.\n<br>\n1-4 years of related experience required.\n<br>\nPrior data management experience in the diagnostics, pharmaceutical or medical device industry preferred.\n<br>\nAbility to handle data meticulously, in a well-organized manner, with understanding of Good Clinical Data Management Practices a must.\n<br>\nWorking knowledge of relational databases, regulatory requirements, project/program management, preferably related to clinical data management a plus.\n<br><br>\nCentral Business Solutions, Inc,\n<br>\n37600 Central Ct.\n<br>\nSuite #214\n<br>\nNewark, CA 94560."}