{"job title": "Software Engineer, Data", "company": "CircleUp", "city state": "– San Francisco, CA", "rating": "4.2", "job description": "<div><div>CircleUp harnesses the power of machine learning and predictive analytics to discover some of the fastest-growing companies in the consumer &amp; retail sector. We are building a predictive data system called \"Helio\" to bring the data-driven revolution that has occurred in the public markets to the private markets, starting with consumer &amp; retail.</div><br>\n<div>We are working on challenging problems in information retrieval, entity resolution, and developing an in-depth knowledge graph of all private companies. We are mining vast amounts of data to successfully rewrite the rules on how private companies are evaluated.</div> <br>\n<div>We are looking for Engineers who can help us scale a complex machine learning data pipeline. We currently lean heavily on technologies like Python, Spark, Scikit-Learn, Hive, and Airflow. We're looking for passionate software engineers who are comfortable working across the full stack &amp; lifecycle of predictive data products.</div> </div><div><div>Responsibilities\n\n<ul>\n\n\n<ul>\n<li>Building performant and reliable data pipelines in service of machine learning and predictive analytics</li><li>Build reliable services for gathering &amp; ingesting data from a wide variety of sources</li><li>Build automation tools to operate and configure production clusters and services</li><li>Work with data scientists to productionalize &amp; deploy machine learning models</li></ul>\n</ul>\n\n</div>\n</div><div><div>We're looking for teammates who have\n\n<ul>\n\n\n<ul>\n<li>Bachelors degree or higher in Computer Science or related field</li><li>3+ years of track record in building and delivering production quality software systems</li><li>Excellent coding skills and strong fundamentals in algorithms, data structures, predictive modeling and big data concepts</li><li>Broad knowledge of data challenges surrounding predictive modeling</li><li>2+ years of experience in building data pipelines and using \"BigData\" data processing frameworks such as Dask, Spark or Hadoop</li></ul>\n</ul>\n\n</div>\n</div>"}