{"job title": "Product &amp; Application Development Scientist-CET", "company": "Corning Incorporated", "city state": "– Painted Post, NY", "rating": "3.6", "job description": "Product &amp; Application Development Scientist-CET\n\n\n<ul>\n<li>*Date:** Aug 3, 2018</li>\n<li>*Location:** Painted Post, NY, US, 14870</li>\n<li>*Req #:** 32494</li>\n</ul>\n\nCorning is one of the world?s leading innovators in materials science. For more than 160 years, Corning has applied its unparalleled expertise inspecialty glass, ceramics, and optical physics to develop products that have created new industries and transformed people?s lives.\n<br><br>\nAt Corning, our growth is fueled by a commitment to innovation. We succeed through sustained investment in research &amp; development, a unique combination of material and process innovation, and close collaboration with customers to solve tough technology challenges. We are a four-time National Medal of Technology winner thanks to our technology leadership and R&amp;D environment, which attract and enable the best scientific minds in the world. This pipeline of talent has brought life-changing innovation to your fingertips for more than 160 years.\n<br><br>\nOdds are that the email you read this morning travelled over Optical Fiber built by Corning; the smartphone you used had a Corning cover lens; and the vehicle you took to work had cleaner emissions because of a catalytic substrate crafted and improved by Corning's inventive team.\n<br><br>\nTime and again Corning Research &amp; Development has cleaned our world, kept us informed, and strengthened our personal connections. We are committed to seeking out dedicated Scientists and Engineers who strive to see their research make a difference, and we empower and prepare them to pursue the breakthroughs that come from unexpected experimental outcomes and to take their discoveries across the chasm to commercialization.\n\n\n<ul>\n<li>*Scope of Position:** In this Engineering position you will develop and implement test methods and solutions for a dynamic, highly-technical engine exhaust after-treatment development. Primary responsibilities include experimental planning, test development, and data analysis supporting the development and application of engine exhaust after-treatment products in CET Development. Focus will be on fundamental product understanding, experimental planning through execution, results analysis, with understanding of emission regulations and use of engine/dyno test bed and related test equipment to produce data sets for the business. Advise and give direction to Test Cell Operations in test scheduling and daily experimental troubleshooting are additional responsibilities.</li>\n<li>*Day to Day Responsibilities:**</li>\n<li>Utilization of test cell teams and related areas to meet testing objectives.</li>\n<li>Hands-on testing support for test programs in test cell, lab, and vehicle to characterize new after-treatment product introductions for Corning Incorporated:</li>\n<li>Developing tests and test protocols to evaluate product attributes/fundamentals and performance focused on: gas and particulate emissions; regulated &amp; non-regulated emissions cycles; hydrodynamic, Thermo-Mechanical, and filtration performance; catalyst performance; and system application evaluation.</li>\n<li>Interpret data for program guidance and experimental troubleshooting. Ability to detect and trouble-shoot test bench performance variation, recognizing if problem is electrical, sensor, actuator, fuel, pre/post-combustion, or internal hardware components.</li>\n<li>Familiarity with computer development tools including INCA, CANape, PUMA, C#, PLC, and associated data formats.</li>\n<li>Execute data analysis at the raw data/root level. Craft analysis templates that can be used during testing to give results and determine overall quality of completed tests. Use results to determine next steps and communicate results back to project teams and CET management.</li>\n<li>Utilize internal and commercially available modeling code to normalize and predict mechanical and/or catalytic performance.</li>\n<li>Prepare, present, and publish technical documents in internal &amp; public forums to advance personal technical reputation and Corning Incorporated.</li>\n<li>Work with internal modeling teams such as SMI and CMI to provide representative data and guidance to modeling, based on experimental knowledge.</li>\n<li>*Travel Requirements:** Limited travel to regional conferences and 1-2 international trips per year.</li>\n<li>*Hours of work/work schedule/flex-time:** 40+ hours a week during normal business hours plus off-hour support when required based on 24/7 facility operating schedule.</li>\n<li>*Education and Experience**</li>\n<li>Master's Technical Degree (minimum, PhD Preferred) ? Mechanical / Electrical / Chemical Engineering or related discipline plus 4+ years experience in testing or related field</li>\n<li>Or a PhD with 2+ years of experience</li>\n<li>*Required Skills**</li>\n<li>Deep knowledge of after-treatment (substrate &amp; particulate filter) products and system application requirements.</li>\n<li>Knowledge of worldwide emission regulations and testing procedures with ability to implement within internal or external Test cell structures</li>\n<li>Able to make sound decisions by blending analytical thinking with practical judgment.</li>\n<li>Ability to independently tackle problems and craft solutions.</li>\n<li>Operational skills to execute hands-on mechanical, electrical solutions &amp; calibration procedures in an engine test cell environment.</li>\n<li>Organized, rigorous, independent.</li>\n<li>Strong experimental, instrumentation, and control skills insuring data is valid and traceable.</li>\n<li>Data analysis skills to insure integrity of data at the collection point.</li>\n<li>Ability to make data driven decisions in support of test development/direction.</li>\n<li>Technically well-rounded (fundamental, analytical, hands-on, and practical).</li>\n<li>Strong computer skills (MatLab, Excel, Power Point).</li>\n<li>*Desired Skills**</li>\n<li>Understanding of internal combustion engines, engine management, and engine after-treatment products/systems.</li>\n<li>Hands-on experimental skills and experience with engine/emissions systems.</li>\n<li>Familiarity with engine &amp; engine dynamometer calibration &amp; control.</li>\n<li>Familiarity with gaseous and particulate emissions analysis and associated equipment.</li>\n<li>Technical curiosity in the field of engine and emissions reduction technology.</li>\n<li>Rigor in experimental execution and analysis.</li>\n<li>Scheduling and test planning skills.</li>\n<li>Advanced programming, design, and/or programming skills (CAD, Axisuite, Fluent or other simulation programs)</li>\n<li>*Soft Skills** (Communication/Team/Leadership)</li>\n<li>Good teamwork skills including knowledge transfer and communication (oral and written).</li>\n<li>Work experience in a matrix organization.</li>\n</ul>\n\nWe prohibit discrimination on the basis of race, color, gender, age, religion, national origin, sexual orientation, gender identity or expression, disability, or veteran status or any other legally protected status.\n\n\n<ul>\n<li>*Nearest Major Market:** Corning</li>\n</ul>"}