{"job title": "Sr. Research Scientist, Software Development", "company": "Corning Incorporated", "city state": "– Painted Post, NY", "rating": "3.6", "job description": "Sr. Research Scientist, Software Development\n\n\n<ul>\n<li>*Date:** Aug 21, 2018</li>\n<li>*Location:** Painted Post, NY, US, 14870</li>\n<li>*Req #:** 32970</li>\n</ul>\n\nCorning is one of the world?s leading innovators in materials science. For more than 160 years, Corning has applied its unparalleled expertise inspecialty glass, ceramics, and optical physics to develop products that have created new industries and transformed people?s lives.\n<br><br>\nAt Corning, our growth is fueled by a commitment to innovation. We succeed through sustained investment in research &amp; development, a unique combination of material and process innovation, and close collaboration with customers to solve tough technology challenges. We are a four-time National Medal of Technology winner thanks to our technology leadership and R&amp;D environment, which attract and enable the best scientific minds in the world. This pipeline of talent has brought life-changing innovation to your fingertips for more than 160 years.\n<br><br>\nOdds are that the email you read this morning travelled over Corning Optical Fiber; the smartphone you used had a Corning cover lens; and the vehicle you took to work had cleaner emissions because of a Corning catalytic substrate. We are seeking out dedicated scientists who strive to see their research make a difference. If you have a passionate belief in the power of innovation to change the world and you rate your own success by how many people are touched by your research, then Corning is the place for you.\n<br><br>\nCorning is one of the world?s leading innovators in materials science. For more than 167 years, we have applied it our unparalleled expertise in specialty glass, ceramics, and optical physics to develop products that have created new industries and transformed people?s lives. At Corning, our growth is fueled by a commitment to innovation. We succeed through sustained investment in research &amp; development, a unique combination of material and process innovation, and close collaboration with customers to solve tough technology challenges.\n<br><br>\nScope of Position (i.e. projects involved with and role within group):\n<br><br>\nIf you are a motivated and high-energy Sr. SW engineer/developer participating in SciComp SW communication development group, this job will be of interest to you. Our mission is to provide software solutions for different kind of Corning technology projects and to enable effective innovation and competitive advantages of Corning products. Our business lies in design and development of software for such domains as wireless and wired data communication, IoT, LTE and 5G wireless products, network protocols implementation, support and adaptation of existing complex software applications and frameworks, etc.\n\n\n<ul>\n<li>*Day to Day Responsibilities:**</li>\n</ul>\n\n+ You will work independently or as part of the team on various aspects of software engineering such as new Corning product prototypes; professional support of internal RD&amp;E tools; Software development support of Corning products at R&amp;D stage; New Corning internal R&amp;D information products.\n<br><br>\n+ Co-lead research &amp; design software project portfolio and its projects execution.\n<br><br>\n+ Learning and improving of SW development skills.\n<br><br>\n+ Write and maintain meaningful support documentation.\n<br><br>\n+ Prepare and deliver relevant user training.\n\n\n<ul>\n<li>*Travel requirements (please note if international):**</li>\n</ul>\n\n+ Individual may travel 1-2 times per year for 2-5 days to other Corning locations (domestic and international) or to pursue training opportunities (conferences, classes).\n\n\n<ul>\n<li>*Hours of work/work schedule/flex-time:**</li>\n</ul>\n\n+ Mon-Fri, regular business hours 8h/5d.\n\n\n<ul>\n<li>*Education and Experience:**</li>\n</ul>\n\n+ BS/MS Computer Science, Software Engineering or other engineering majors with strong software skills. Ideally, you will have MS or commensurate experience.\n\n\n<ul>\n<li>*Required Skills:**</li>\n</ul>\n\n+ A foundation in software design principles and an ability to design and build code as necessary.\n<br><br>\n+ Strong functional and object-oriented programming skills in one or several mainstream languages such as C, Java, C++, C#.\n<br><br>\n+ Knowledge of scripting languages (e.g., Python) and any other programming languages (e.g., HTML, Java Script, and PHP).\n<br><br>\n+ Understanding of network protocols MAC, TCP/IP, Socket (wireless protocols knowledge is advantage)\n<br><br>\n+ Ability to communicate with and understand the complex requirements of scientists, engineers and professional staff in the deployment of software solutions.\n<br><br>\n+ Working knowledge of Linux and Windows operating systems.\n<br><br>\n+ Ability to analyze, optimize and debug codes.\n<br><br>\n+ Ability to support a wide variety of software needs (ISV, Open Source, Visualization centric programs).\n\n\n<ul>\n<li>*Desired Skills:**</li>\n</ul>\n\n+ Knowledge of mathematical and statistical computing programming languages (MATLAB, R).\n<br><br>\n+ Knowledge of additional languages for scientific computing in Windows and Linux environments (such as C/C++, Fortran, Java, VB).\n<br><br>\n+ Familiarity with Microsoft Visual Studio (and .NET or WPF).\n<br><br>\n+ Knowledge of embedded systems (Linux, VxWorks, ARM).\n<br><br>\n+ IDE working experience Eclipse, Android Studio, Arduino, Xilinx VIVADO.\n<br><br>\n+ Switches and routers programming.\n<br><br>\n+ Working knowledge of databases and SQL.\n<br><br>\n+ Experience providing user support or code development support in scientific computing environment.\n<br><br>\n+ Experience with revision control systems (e.g., Git).\n<br><br>\n+ Experience with agile development approaches, automated unit testing / test-first design.\n<br><br>\n+ Knowledge of Android, iOS mobile platforms and FPGA knowledge is a plus.\n\n\n<ul>\n<li>*Soft Skills:**</li>\n</ul>\n\n+ Strong interpersonal and communication skills and ability to work as a standout colleague are required.\n<br><br>\n+ Dedicated and solution-oriented problem solver.\n<br><br>\n+ Clear dedication to excellence and advancing beyond the current state.\n<br><br>\n+ Strong personal motivation.\n<br><br>\nWe prohibit discrimination on the basis of race, color, gender, age, religion, national origin, sexual orientation, gender identity or expression, disability, or veteran status or any other legally protected status.\n\n\n<ul>\n<li>*Nearest Major Market:** Corning</li>\n</ul>"}