{"job title": "Currency Development Scientist", "company": "Crane Currency", "city state": "– Dalton, MA", "rating": "3.4", "job description": "<strong>Crane Currency</strong>\n<br><br>\n<strong>ID</strong> 2018-1899\n<br>\n<strong># of Openings</strong> 1\n<br>\n<strong>Job Location</strong> US-MA-Dalton\n<br>\n<strong>Posted Date</strong> 2018-09-04\n<br>\n<strong>Category</strong> Research &amp; Development\n<br><br>\n<strong>Overview</strong>\n<br><br>\nDo you want to work alongside world-class engineers, scientists, and technologists developing highly secure banknotes that integrate cutting-edge security features? Are you interested in how a material's fundamental properties affect real world performance of a product? At Crane, outstanding opportunities exist for enthusiastic professionals with experience in product development, manufacturing and industrial Research &amp; Development. In this Currency Development position, you will use your unrelenting drive, highly-tuned analytical skills and data-centric decision making process to understand problems and find reproducible solutions that deliver reliable and trusted performance to banknote currencies around the world.\n<br><br>\nInvest your time in Currency! Crane Currency is a fully integrated supplier of banknotes for more than 50 central banks from all over the world, as well as a pioneer in advanced micro-optics technology. We are proud to have been named \"Banknote and Currency Services Provider of the Year\" for 2017 by Central Banking Publications, for our cutting-edge security features and state-of-the-art designs. We are a pioneer in advanced micro-optics and paper technology for securing banknotes, offering features that do not exist elsewhere. A dynamic culture, a team environment, exceptional people, best-in-class technology-all have contributed to the amazing success and vibrant growth at Crane.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\n<strong>Teamwork is Currency at Crane</strong>\n<br><br>\nCrane Currency is now looking for a dedicated Currency Development Engineer to be part of our R&amp;D Team in Dalton, MA. This position will serve as the first-line, technical resource working on research and development projects. A solid capability to plan and execute projects is critical. This position will be leading cross-functional teams through project completion while using stage-gate project processes to ensure that all deliverables are met in a safe, timely and cost effective manner with an emphasis on quality. This includes development, scale-up and commercialization efforts of new technologies in the areas of paper making and security features integration. The this position is expected to achieve this objective by contributing effectively on an individual basis as well as working as part of the project team, and can expect the following skills and abilities to be a critical part of the role;\n\n<ul>\n<li>Research and assist in identifying, evaluating new technologies in areas of currency paper, integration of security features in a fast-paced environment to meet deadlines for deliverables</li><li>Apply analytical skills and experience to efficiently develop and scale up robust new processes and products</li><li>Provide strong customer service response and technical support to marketing, sales, product management and other areas of the business where technical expertise is needed</li><li>Apply sound basic knowledge of safety and environmental related issues during the execution of projects</li><li>Coordinate with mill on development, scaleup and validation trials on new products and product modifications</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\n<strong>Education &amp; Experience:</strong>\n<br><br>\nRequired\n\n<ul>\n<li>An advanced degree in physical science or engineering (e.g., Paper Science &amp; Engineering, Materials Science and Engineering, Chemistry, or Chemical Engineering) with progressive industrial experience in R&amp;D, product development, process engineering or manufacturing with an emphasis in process/product development to meet or exceed at least one of the following requirements;</li>\n\n<ul>\n<li>Bachelor's Degree and a min. of 5 yrs. Exp.</li><li>Master's degree with a min. 3 yrs. Exp., <u>or</u></li> <li>PhD with at least 2 yrs. Exp.</li>\n</ul>\n\n<li>Must be an analytical, data-driven decision maker with a strong drive to understand materials and process interactions and a desire to tune them to produce robust products.</li><li>Demonstrated ability to effectively manage research projects as well as guide and influence multifunctional teams through thoughtful facilitation and creative idea exchange in a fast-paced, results-oriented environment.</li><li>Proven track record of providing data-centric technical recommendations that drive business growth through reliable processes that produce products reproducibly with minimized variation.</li><li>Proficient verbal &amp; written communication skills with the ability to explain complex scenarios clearly within cross-functional teams.</li><li>Experience with papermaking, physical and analytical property testing, Six Sigma, Lean principles and stage gate processes is a plus</li>\n</ul>\n\nPreferred\n\n<ul>\n<li>A Gradudate or Post Graduate degree from accredited college/university would be preferred. A PhD in the area of paper and pulp sciences/chemistry or chemical engineering</li> <li>Experience in Paper/pulp, Materials Development or Process Industry required, banknote industry</li> <li>Experience with papermaking, physical and analytical property testing, Six Sigma, Lean principles and stage gate processes</li><li>Six sigma certification or project mangement certifcation</li>\n</ul>\n\n<strong>Competences:</strong>\n\n<ul>\n<li>Be a creative, self-starter regularly applying your development experience, critical thinking, analytical skills, and statistical and project management tools to efficiently conceptualize, develop, and scale-up robust new processes and products.</li><li>Identify and evaluate new technologies in the currency substrate arena as well as security feature/substrate integration methodologies through data analysis of laboratory-based chemical and process manipulations and materials testing including new test method development.</li><li>Coordinate development, scale-up, and validation of new products and product modifications within highly-motivated multifunctional teams.</li><li>Provide strong customer service and technical support to marketing, sales, product management and other areas of the business where technical expertise is valued</li><li>Expert with analytical, trouble shooting skills and practical user of statistical tools</li><li>Ability to lead the processess like FMEA to mitigate product and process risk (Project risk)</li><li>Ability to design experiement and run trials to be efficient in the devlopment of process and products</li><li>Up to 20% travel may be required</li>\n</ul>\n\n<strong>Information and application</strong>\n<br><br>\nTo apply, please visit www.cranecurrency.com. Under the CAREERS page, select; Dalton, MA as the location and follow the instructions to apply online. We look forward to hearing from you!\n<br><br>\nThe person selected for this position will need to demonstrate US Citizenship and a suitability for employment in a position of Public Trust consistent with our US Government contract requirements.\n<br><br>\nCrane Currency is an Equal Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment.\n<br><br>\nCrane is a Drug Free Workplace.\n<br><br>\nCrane prizes its people as the most valuable asset, and is committed to hiring and retaining the best talent in the industry. We offer a competitive wage, benefits package and relocation assistance.<br><br>PI104218830"}