{"job title": "Architectural Formulation Scientist", "company": "Eastman Chemical", "city state": "– Kingsport, TN, TN", "rating": "3.9", "job description": "<p><b>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</b></p><div><p>Eastman is a global advanced materials and specialty additives company that produces a broad range of products found in items people use every day. With a portfolio of specialty businesses, Eastman works with customers to deliver innovative products and solutions while maintaining a commitment to safety and sustainability. Its market-driven approaches take advantage of world-class technology platforms and leading positions in attractive end-markets such as transportation, building and construction and consumables. Eastman focuses on creating consistent, superior value for all stakeholders. As a globally diverse company, Eastman serves customers in more than 100 countries and had 2017 revenues of approximately $9.5 billion. The company is headquartered in Kingsport, Tennessee, USA and employs approximately 14,500 people around the world. For more information, visit www.eastman.com.</p><p>Field Applied Coatings within AFP Coatings has an immediate need for an Architectural Formulation Scientist.</p><p> </p><p><u><strong>Job Responsibilities</strong></u>:</p><p> </p><p>• Apply deep understanding of architectural coatings and regulatory requirements to develop and test new additives and formulations that enable differentiated performance, reduced cost and increased efficiency</p><p>• Network with a cross functional team across R&amp;D, marketing, sales and manufacturing to develop products which can transition quickly from the lab to commercial scale</p><p>• Lead teams focused on new application development projects for architectural coatings</p><p>• Determine fitness-for-use criteria for specific architectural coatings applications and reduce these to formulation characteristics using knowledge of coatings structure-process-property relationships</p><p>• Select raw materials for starting point formulations to test developmental latexes, pigments, coalescents, and other additives</p><p>• Provide technical support to manufacturing, engineering, and QC organizations during product scale up and commercialization.</p><p>• Develop new technical literature to support new products or techniques</p><p>• Establish peer level connect with co-suppliers and customers to identify potential opportunities for synergies and joint development.</p><p>• Provide regular insights on new technologies and competitive solutions in the Architectural segment and play a key role in development of Eastman’s intellectual property strategy.</p><p>• Oversee testing of coatings to industry standards</p><p>• Support quality, health, and safety initiatives as they relate to formulation, material safety, and technical data sheets.</p><p>• Attend trade shows / technical conferences to align with market trends and establish/strengthen market connect</p><p>• Travel to customers to discover needs, match fitness for use characteristics with product offerings, and support the engagements through final commercialization.</p><p>• Mentor and support development of technicians.</p><p> </p><p><u><strong>Job Requirements / Qualifications</strong></u>:</p><p>• A Bachelor of Science in Polymer Science, Coatings Science, Chemistry, Engineering or a related field is required</p><p>• At least 8 years of relevant architectural coatings formulation experience, including materials selection, paint preparation, and paint testing is required</p><p>• Experience working with raw materials suppliers is required</p><p>• Experience formulating waterborne coatings is required</p><p>• Technical project leadership experience with a proven track record of successfully commercializing new products is preferred.</p><p>• A working knowledge of chemical synthesis and process as they relate to resins, polymers, additives, and pigments is preferred</p><p> </p><p> </p><p>Eastman Chemical Company is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status or any other characteristics protected by law.</p><p> </p><p>Eastman is committed to creating a powerfully diverse workforce and a broadly inclusive workplace, where everyone can contribute to their fullest potential each day.</p></div>"}