{"job title": "Bioinformatics Staff Scientist", "company": "Integrated DNA Technologies", "city state": "– Coralville, IA", "rating": "3.6", "job description": "<br><b>Integrated DNA Technologies</b><br><br><b>ID </b>2018-4055<br><b>Job Locations </b>US-IA-Coralville<b>Category </b>Research &amp; Development<br><b># of Openings </b>1<br><b>Posted Date </b>14 hours ago<br><b>Shift/Schedule </b>M-F 40 Hour Week (United States of America)<br><br><b>Overview</b> <br> <br><br>The Bioinformatics Staff Scientist will support a group of experienced scientists to develop novel NGS applications. This individual will need to develop novel algorithms and pipelines, provide data analysis support and be a key contributor to the product development team.<br><br><br><br><b>Responsibilities</b><br><br><br><strong><u>Essential Functions:</u></strong><br><ul><li>Develops algorithms for novel NGS and qPCR applications</li><li>Builds comprehensive NGS data analysis pipelines</li><li>Provides data analysis support for internal product development and external collaborations</li><li>Works closely with R&amp;D scientists to support their daily research activities</li><li>Participates in brainstorming sessions and contributes ideas in technology, algorithms and products</li><li>Works independently and also collaborates with other team members to meet project deadlines</li><li>Prepares and delivers presentations based on scientific and technical progress and achievements</li><li>Demonstrates and upholds behavior consistent with the Integrated DNA Technologies Core Values and delivers the Integrated DNA Technologies experience to customers and other business associates.</li></ul><br>Performs other duties as assigned<strong><u>Education:</u></strong><br><ul><li>Bachelor's degree (in Biology, Computer Science, Mathematics, Statistics or a related field) with ten or more years relevant work experience required</li><li>Master's degree (in Bioinformatics, Biostatistics, Computer Science, Applied Mathematics or a related field) with eight or more years relevant work experience required</li><li>PhD degree (in Bioinformatics, Biostatistics, Computer Science, Applied Mathematics or a related field) with six or more years relevant work experience required</li></ul><br><strong><u></u></strong><br><br><strong><u>Professional Experience:</u></strong><br><ul><li>Minimum of 3 years of experience in the field of NGS Bioinformatics is required</li><li>Knowledge and understanding of computational and biological issues and ability to communicate effectively with bench scientists is required</li><li>Previous experience working in a multidisciplinary, fast-paced and results-oriented environment is preferred</li><li>Strong publication record in peer-reviewed journals is preferred</li></ul><br> <br><br><strong><u>Preferred or Required Skills:</u></strong><br><ul><li>Previous experience in large-scale NGS data management and analysis required</li><li>Proficiency in Java and C/C++, and one of the scripting languages (Python, Perl and Shell) required</li><li>Proficiency in Linux/Unix OS required</li><li>Familiar with state of the art Bioinformatics tools, algorithms and methodologies required</li><li>Familiar with common genomic portals/databases (e.g. GenBank, EMBL, UCSC, etc) required</li><li>Strong scientific understanding of Genomics and Molecular Biology, esp. NGS and qPCR required</li><li>Previous experience with high performance computing in a distributed/cloud environment preferred</li></ul><br><br><strong><u>Other Job Qualifications:</u></strong><br><ul><li>Excellent oral and written communication skills</li><li>Ability to encourage and facilitate cooperation, teamwork and pride</li><li>Adaptability to perform under stress when confronted with critical, unusual, or dangerous situations, or situation in which working speed and sustained attention are make-or-break aspects of the job. </li><li>Adaptability to performing a variety of duties, often changing from one task to another without loss of efficiency or composure.</li><li>Ability to maintain both a high standard of courtesy and cooperation in dealing with co-workers. </li><li>Adaptability to accepting responsibility for the direction, control or planning of an activity. </li><li>Adaptability to situations requiring the precise attainment of set limits, tolerances or standards. </li></ul><br><br><strong><u>Physical Requirements:</u></strong><br><br>Exert up to 20 lbs. of force occasionally and/or up to 10 lbs. of force frequently<br><br><em>Frequent (34-66% of work day)</em><br><ul><li><strong>Sitting</strong>: to assume a position in which the weight is largely supported by the buttocks, usually with the body vertical and the thighs horizontal.</li><li><strong>Using Fingers/Grasping/Feeling</strong>: writing or otherwise working, primarily with fingers rather than with the whole hand or arm as in handling. Applying pressure to an object with the fingers or palm and perceiving attributes of objects such as size, shape, temperature or texture by touch. </li><li><strong>Talking</strong>: expressing or exchanging ideas by means of the spoken work- those activities in which they must convey detailed or important spoken instructions to other workers accurately, loudly, or quickly. </li><li><strong>Hearing</strong>: perceiving the nature of sounds at normal range; ability to receive detailed information through oral communication, and to make fine discriminations in sound, such as when auscultating and percussing.</li></ul><br><em>Occasional (33% or less of work day)</em><br><ul><li><strong>Reaching</strong>: extending hand(s) and arm(s) in any direction.</li><li><strong>Standing</strong>: maintaining an upright position. </li><li><strong>Walking</strong>: moving about on foot to accomplish tasks. </li><li><strong>Lifting</strong>: raising objects from a lower to a higher position or moving objects horizontally from position to position. </li><li><strong>Repetitive Motion:</strong> substantial movements (motion) of the wrists, hands, and/or fingers.</li><li><strong>Bending</strong>: bending body downward and forward by bending spine at the waist and/or bending leg; bending legs at knee to come to rest or kneel. </li><li><strong>Pushing/Pulling</strong>: using upper extremities to press against something with steady force in order to thrust forward, downward or outward/using upper extremities to exert force in order to drag, haul or tug objects in a sustained motion.</li><li><strong>Climbing</strong>: stairs, stools, ramps, ladders. </li></ul><br> <br><br><strong><u>Visual Acuity:</u></strong><br><ul><li>Ability to read pertinent printed material and distinguish colors.</li><li>Ability to accurately read measurements on equipment. </li><li>Ability to prepare and read written documentation; use of computer.</li></ul><br>Integrated DNA Technologies is an equal employment and affirmative action employer. Minorities, women, veterans and individuals with disabilities are encouraged to apply.<br><br><br><p>PI104220121</p>"}