{"job title": "Data Analyst I", "company": "Massachusetts General Hospital(MGH)", "city state": "– Boston, Massachusetts", "rating": "4.0", "job description": "<strong>GENERAL SUMMARY/ OVERVIEW STATEMENT:</strong>\n<br><br>\nThe Corrigan Minehan Heart Center at Massachusetts General Hospital is seeking exceptional candidates to join the lab of Dr. Steven Lubitz in the Cardiovascular Research Center. The candidate will join an interdisciplinary team of epidemiologists, senior statisticians, and clinicians, computational biologists, bioinformaticians, clinical informatics personnel, research coordinators, and research nurses who are working together to identify the causes of cardiac arrhythmias and identify methods to improve health outcomes.\n<br><br>\nProjects will focus on 1) identifying factors related to arrhythmias, 2) modeling strategies to improve health outcomes, and 3) implementing pragmatic interventions to diagnose arrhythmias and minimize morbidity. Current efforts include a large-scale randomized clinical trial focused on screening patients for atrial fibrillation, randomized implementation of atrial fibrillation risk prediction in clinical practice, and large-scale observational electronic health record research. The candidate will work with robust human health data derived from clinical data linked to electronic medical records from 7 academic hospitals spanning records for over 6 million individuals.\n<br><br>\nThe candidate will be a critical member of the lab organization. Primary roles will include the development and execution of statistical analysis plans, development of computational algorithms for database analysis, grant preparation, and manuscript writing. The candidate must thrive in an academic/professional atmosphere, where interdisciplinary teams are central to project success. A high level of maturity is essential, as the analyst is given access to personal and confidential medical information. Strong organizational and interpersonal skills, attention to detail, and the ability to prioritize multiple tasks are essential. The candidate must be self-motivated, independent in task completion, and comfortable accepting feedback and guidance from colleagues.\n<br><br>\nThis position is ideal for either individuals with a Masters degree in Biostatistics, Epidemiology, or Public Health with 1 to 2 years of real-world analytic experience, though exceptional candidates with less experience will be considered. Prior experience with electronic health records or claims data is preferred.\n<br><br>\n<strong>PRINCIPAL DUTIES AND RESPONSIBILITIES:</strong>\n\n<ul>\n <li> Take a leading role in study design for observational and interventional clinical projects.</li>\n</ul>\n\n\n<ul>\n <li> Lead the design and development of statistical analysis plans for projects.</li>\n</ul>\n\n\n<ul>\n <li> Apply traditional epidemiologic and statistical methods to analyze relations between risk factors and health outcomes, including prediction modeling and absolute risk modeling.</li>\n</ul>\n\n\n<ul>\n <li> Apply analytic techniques for high dimensional data, including machine learning and clustering analyses, to identify patterns and improve risk profiling using electronic health record data.</li>\n</ul>\n\n\n<ul>\n <li> Actively lead the development and refinement of computational scripts and algorithms for working with electronic health record data related to heart disease.</li>\n</ul>\n\n\n<ul>\n <li> Work with other team scientists in the development of computer-based decision analytic models to inform the optimal effectiveness of management approaches.</li>\n</ul>\n\n\n<ul>\n <li> Regularly communicate accomplishments and progress at project team meetings.</li>\n</ul>\n\n\n<ul>\n <li> Proactively communicate with data analysis groups to help ensure analytical goals are achieved.</li>\n</ul>\n\n\n<ul>\n <li> Coordinate and interact closely with other collaborating scientists on data quality and file management.</li>\n</ul>\n\n\n<ul>\n <li> Actively participate in the preparation of manuscripts for publication, scholarly reports and present at scientific conferences.</li>\n</ul>\n\n\n<ul>\n <li> Share expertise, provide training and guidance with other team members as needed.</li>\n</ul>\n\n\n<ul>\n <li> Participate within a team of scientists to foster a culture of scientific excellence.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n<ul>\n <li> Masters degree in Biostatistics, Epidemiology, or Public Health, or related discipline such as Computer Science, Engineering, Physics, Math, Bioinformatics.</li>\n<li> Experience with observational data analysis including prediction modeling and absolute risk estimation is strongly preferred.</li>\n<li> Experience with clinical trials is strongly preferred.</li>\n<li> Experience with electronic health records research or claims data is strongly encouraged.</li>\n</ul>\n\n\n<ul>\n <li> Experience computational methods relevant to high dimensional data analysis and disease classification algorithms.</li>\n<li> Must have demonstrated proficiency with at least one of the following computer languages/environments: SAS, SQL, R, Python, Unix, Java, HTML, Matlab, R, C, C++.</li>\n<li> Ability to work independently while making necessary connections with experts in various computational analysis groups.</li>\n<li> Willing to commit to a two-year position.</li>\n<li> Self-starter, highly motivated.</li>\n<li> Entrepreneurial spirit.</li>\n<li> Excellent communication skills.</li>\n<li> Excellent organization and time management skills.</li>\n</ul>\n\n<strong>EDUCATION:</strong>\n<br><br>\nMasters degree preferred. Coursework in advanced-level math or science.\n<br>\n<br>\n<strong>EXPERIENCE:</strong>\n<br><br>\nExperience 1 or 2 years working in an analytic environment preferred. <br><br>\n<strong>WORKING CONDITIONS:</strong>\n<br><br>\nRegular office conditions. Remote office work also possible.\n<br><br>\n<strong>EEO Statement</strong>\n<br>\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law\n<br>\nPartner's Healthcare is acting as an Employment Agency in relation to this vacancy."}