{"job title": "Senior Bioinformatics Scientist", "company": "Merck USA", "city state": "– Boston, MA", "rating": "3.7", "job description": "<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong><br>\n<div><strong>Requisition ID:</strong> INF004823<br>\n\n<div><div><div>Merck &amp; Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck’s success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.</div></div></div> <div>We are seeking a highly motivated bioinformatics scientist to join our Global Research IT team at Merck. As a scientist in Research IT organization, the successful candidate will partner with biologists and data analysts in Merck Research Labs and apply advanced computational methods and data analytics for genomic technology, target identification, target validation and biomarker discovery. The role will focus on developing computational genomic pipelines, machine learning applications and visual analytics and analyzing multi-dimensional data sets to support Merck’s drug discovery biology and translation medicine research.\n<br><br>\n<strong>Job responsibilities</strong>\n\n<ul>\n<li>Develop computational methods and perform analysis of datasets from next-generation sequencing applications</li> <li>Integrate internal and public available databases in omics, pathways and genetics and apply machine learning to identify novel drug targets and biomarkers</li><li>Proactively engage with biology, genetics, pharmacology and biomarker teams in Merck Research Labs to identify collaborative projects</li> <li>Contribute novel bioinformatics algorithms and data computing pipelines to the global Computational Biology network and support cross-site translational informatics projects</li></ul></div>\n<br>\n<strong>Qualifications</strong><br>\n\n<div><strong>Education Minimum Requirement:</strong> \n\n<ul>\n<li>A Master degree or a Ph.D. degree with a focus on computational biology, bioinformatics, or computer science or related fields</li>\n</ul>\n\n<strong>Required Experience and Skills:</strong>\n\n<ul>\n<li>At least five years research experience for Master degree or one year for Ph.D. degree in computational biology, bioinformatics, or machine learning</li><li>A demonstrated track record of developing computational methods and pipeline for genomic technology, translational research or biology discovery</li><li>Extensively experience in developing next-generation sequencing data analysis pipelines such as single cell RNA sequencing, exome sequencing and transcriptome sequencing</li><li>Hands-on experience by applying machine learnings</li> <li>Proficiency in programming languages (Python, Perl, C++), and mathematical and statistical package, such as R and MatLab, in a Unix/Linux environment</li><li>Experience with high-performance Linux cluster and cloud computing</li><li>Excellent interpersonal and team skills</li> <li>Demonstrated ability to collaborate with cross-functional project teams</li><li>A proven track record of scientific publications</li><li>Excellent oral and written communication skills in English</li>\n</ul>\n\n<strong>Preferred Experience and Skills:</strong>\n\n<ul>\n<li>Knowledge of next-generation sequencing technology</li><li>Knowledge of Oncology and Immuno-oncology</li></ul></div>\n<br>\n<div>Your role at Merck is integral to helping the world meet new breakthroughs that affect generations to come, and we’re counting on your skills and inventiveness to help make meaningful contributions to global medical advancement. At Merck, we’re inventing for life.</div> <div>\nIf you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request to staffingaadar@merck.com.</div> <div><strong>Search Firm Representatives Please Read Carefully:</strong> </div><div>Merck &amp; Co., Inc. is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any employee at Merck via email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Merck. No fee will be paid in the event the candidate is hired by Merck as a result of the referral or through other means.</div><div><div><strong>For more information about personal rights under Equal Employment Opportunity, visit:</strong></div><div> EEOC Poster</div> <div> EEOC GINA Supplement</div> </div>\n\n<br><strong>Job:</strong> Informatics &amp; Analytics\n<br>\n<strong>Other Locations:</strong> \n<br>\n<strong>Employee Status:</strong> Regular\n<br>\n<strong>Travel:</strong> Yes, 10 % of the Time\n<br>\n<strong>Number of Openings:</strong> 1\n<br>\n<strong>Shift (if applicable):</strong> \n<br>\n<strong>Hazardous Materials:</strong> No\n<br>\n<strong>Company Trade Name:</strong> Merck</div>"}