{"job title": "Senior Scientist, Upstream Senior Scientist, Biologics Process Development and Commercialization", "company": "Merck and Co.", "city state": "– Kenilworth, NJ", "rating": "3.7", "job description": "As part of the Merck Manufacturing Division, within Global Vaccines and Biologics Commercialization (GVBC), the Biologics Process Development and Commercialization (BPDC) department provides the technical process leadership and laboratory capabilities in support of late stage pipeline and commercial manufacturing processes for biologics (therapeutic proteins). For pipeline programs, BPDC supports various commercialization activities, including technology transfer to internal and external manufacturing sites, process validation, and authoring of regulatory submissions. For commercial programs, including but not limited to KEYTRUDA and ZINPLAVA, the scope includes site-to-site process transfers, manufacturing investigations and trend evaluations, process enhancements, next generation process (i.e., post approval) development and characterization, process validation, and regulatory submission authoring.\n<br><br>\nBPDC department is now seeking a talented individual supporting late stage and commercial biologics program activities, under the general scientific and administrative direction of the Director in Upstream Processing and working in conjunction with internal and external partners. The individual will demonstrate scientific, experimental and tech transfer skills focusing on uptream processing.\n<br><br>\nTechnical Scope:\n<br><br>\nServe as Subject Matter Expert on novel upstream processes including perfusion and continuous manufacturing.\n<br>\nSupport upstream teams on late stage process development, characterization, technology transfer, and validation with line-of-sight for licensure and commercialization.\n<br>\nCollaborate with downstream, process analytics, and other functional teams in both R&amp;D and manufacturing to advance biologics pipeline.\n<br>\nConduct laboratory-scale and/or manufacturing scale studies to support commercial process validation, characterization, and investigation evaluations, including studies performed either in-house or externally.\n<br>\nAuthor required regulatory and technical documentation. Ensure that process/product are developed and documented according to standard Merck practices.\n<br>\nQualifications\n<br><br>\nEducation Minimum Requirement:\n<br><br>\nPhD in Chemical Engineering, Biological Engineering, Biochemistry, Cell Biology, or related biological/engineering sciences or a MS with a minimum of 4 years of experience or a BS with a minimum of 6 years of experience.\n<br>\n<strong>Required Experience and Skills:</strong>\n<br>\nExcellent scientific understanding of cell biology and engineering principles for recombinant protein production with mammalian cell culture.\n<br>\nSolid hands-on experience in upstream process development and commercialization, including activities such as medium and process optimization, scale-down model qualification, process characterization, scale-up, and technology transfer.\n<br>\nSolid hands-on experience with advanced statistical and computational tools (e.g. Design of Experiments, multivariate data analysis, etc).\n<br>\n<strong>Preferred Experience and Skills:</strong>\n<br>\nExperience in development and commercialization of perfusion based processes and continuous manufacturing\n<br>\nHands-on experience in applying innovative tools such as PAT (Raman, NIR, capacitance probes etc), soft sensors, and process modelling for biologics manufacture and commercialization.\n<br>\nExperience with applying Systems Biology tools (e.g. transcriptomics, metabolomics, proteomics, and other -omics approaches) to understand cell biology and metabolism.\n<br>\nStrong communication and collaboration skills, passion for scientific excellence, and capability to deliver complex objectives under compressed timelines.\n<br>\nExperience authoring CMC sections of IND/BLA/MAA and other regulatory documents.\n<br>\nSolid track record of scientific contributions and project accomplishments, with ability to deliver high quality presentations/publications"}