{"job title": "Behavioral Scientist", "company": "MRY", "city state": "– New York, New York", "rating": "3.3", "job description": "<strong>Company Description</strong>\n<br><br>\nnull\n<br>\nJob Description<br><br>The<strong> Behavioral Scientist</strong> will work within the Intelligence department to influence strategy and creative on a key account through a synergy of psychology, behavioral economics, and neuro-marketing. By combining owned and 3rd party consumer data with behavioral economics, the Behavioral Scientist will build recommendations based on well-rounded understanding of consumers needs, motivations, and personalities. This role will be working with a larger Behavioral Science team across the Atlanta and New York offices.\n<br><br>\n<strong>Responsibilities</strong>\n<ul>\n<li>Analyzing a breadth of data points to uncover human truths</li><li>Apply learnings to tactical creative and strategy work on a weekly and monthly basis</li><li>Assist in biometric creative testing using a proprietary structure</li><li>Build testing recommendations and test studies</li><li>Proactively collaborate with Creative, Strategy, and Analytics teams to ensure agency partners comprehend and apply findings</li><li>Collaborate with the Analytics team to craft social media tests and strategies that drive consumers through business and engagement funnels</li>\n</ul>\n\nQualifications<br><br><strong>Required Knowledge/Skills/Experience</strong>\n<br><br>\nIn-depth knowledge of Behavioral Sciences:\n<ul>\n<li>Base understanding of psychology, social psychology, evolutionary psychology, and/or consumer neuroscience</li><li>Understanding of Behavioral Economics cognitive process including heuristics and biases</li><li>Understanding of cognitive motivations including explicit and implicit motivational territories.</li>\n</ul>\nDemonstrated knowledge of traditional and behavioral science research:\n<ul>\n<li>In-depth knowledge of traditional qualitative and quantitative marketing research techniques</li><li>In-depth knowledge of behavioral qualitative and quantitative marketing research techniques</li><li>In-depth understanding of the scientific method and Random Control Trials</li><li>In-depth understanding of Consumer Neuroscience techniques.</li>\n</ul>\n<strong>Demonstrated ability to discover what business questions internal and external stakeholders are trying to answer, and <u>formulate and execute a Behavioral Science Research Plan and provide actionable results.</u></strong>\n<br><br>\n<strong>Reporting and Succession</strong>\n<ul>\n<li>Reports to Director, Intelligence + VP, Behavioral Science</li>\n</ul>\n\nAdditional Information<br><br>All your information will be kept confidential according to EEO guidelines."}