{"job title": "Scientist, Product Development", "company": "Neurocrine Biosciences", "city state": "– SAN DIEGO, CA, US", "rating": "3.9", "job description": "Neurocrine Biosciences is a San Diego\n<br>\nbased biotechnology company focused on neurologic, psychiatric and endocrine\n<br>\nrelated disorders. The Company’s three late-stage clinical programs are:\n<br>\nelagolix, a gonadotropin-releasing hormone antagonist for women’s health that\n<br>\nis partnered with AbbVie Inc.; opicapone, a novel, once-daily,\n<br>\nperipherally-acting, highly-selective catechol-o-methyltransferase inhibitor\n<br>\nunder investigation as adjunct therapy to levodopa in Parkinson’s patients; and\n<br>\nINGREZZA™ (valbenazine), a novel, once-daily, selective VMAT2 inhibitor under\n<br>\ninvestigation for the treatment of Tourette Syndrome. INGREZZA (valbenazine)\n<br>\ncapsules was approved by the FDA on April 11, 2017 for the treatment of\n<br>\nadults with tardive dyskinesia and is currently commercialized by Neurocrine in\n<br>\nthe United States.\n<br><br>\n<strong>SUMMARY:</strong>\n<br><br>\nSupport the Product Development team’s mission of designing, developing &amp; delivering orally-delivered drug products for all stages of clinical development, through to commercial product launch.\n<br><br>\n<strong>PRIMARY DUTIES AND RESPONSIBILITIES (include, but are not limited to):</strong>\n<ul>\n<li>Evaluate, interpret and generate scientific data, while assisting in the phase appropriate design, development and optimization of robust drug product formulations and processes</li>\n<li>Cooperate across functional lines within CMC and with external partners to progress development objectives and strategies, summarizing and communicating orally and in written format as needed</li>\n<li>Understand and practice experimental design and statistical analysis</li>\n<li>Utilize models to understand and predict the impact of API properties on product biopharmaceutical performance</li>\n<li>Execute pharmaceutical unit operations used in the manufacture of solid oral small molecule formulations, including but not limited to: spray drying, homogenization, blending, milling/sizing, wet/dry granulation &amp; drying, encapsulation, tablet compaction and film-coating</li>\n<li>Manufacture and characterize samples from prototype batches to understand critical parameters &amp; attributes and address scale-up risks</li>\n<li>Serve as the NBI technical representative during external manufacturing campaigns at external vendors</li>\n<li>Source, procure, install, qualify, operate, and maintain instrumentation and equipment required for development activities, as needed</li>\n<li>Maintain laboratory documentation in accordance with required scientific, regulatory (cGMP) and intellectual property requirements.</li>\n</ul>\n<strong>QUALIFICATIONS:</strong>\n<ul>\n<li>Must be self-motivated, detail-oriented, possess familiarity of physical &amp; analytical techniques as they pertain to biopharmaceutical properties</li>\n<li>Exhibit strong scientific acumen.</li>\n<li>Ability to quickly learn and think independently.</li>\n<li>Hands-on experience executing and interpreting pharmaceutical analysis, and drug product unit operation processing is preferred.</li>\n<li>Familiarity with the development and execution of chemical and instrumental methods (e.g. Disintegration, Dissolution, Density, Flow, UV, HPLC, GC, TGA, DSC, PXRD, GVS, MS, FTIR, KF, PSD, PLM, SEM) of analyses for development compounds, drug substances, raw materials, intermediates, drug products, and packaging materials, as needed</li>\n</ul>\n<strong>EDUCATION and/or EXPERIENCE:</strong>\n<br><br>\nB.S. or M.S. in a relevant scientific discipline plus 5 or more years of relevant industrial experience, or Ph.D. with 1 year of relevant industry experience required.\n<br><br>"}