{"job title": "Data Steward", "company": "Nielsen", "city state": "– Oldsmar, FL", "rating": "3.6", "job description": "<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong><br>\n<div><strong>Data Steward - 23264</strong>\n<br><br>\nData Science - USA Oldsmar, Florida\n<br><br>\n<strong>The Lead Data Steward within the Data Science Watch Product organization will be accountable for the data model in our new data warehouse, project managing and troubleshooting data related issues. The person will learn and become an expert with all of the data sources and the existing data model, and design a new enhanced data model for efficient extraction to be used in custom analytics. The Lead Data Steward will essentially be a single point of contact within our team and with other teams when it comes to the complexities of understanding the data and using it properly for analytics and for requesting additional data from other teams.</strong>\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n\n<li><strong>Learn and become an expert in how big data flows through Nielsen systems in order to create reliable data views that will feed into client inquiry processes.</strong></li>\n<li><strong>Consult with internal clients to provide subject matter expertise on television audience measurement data sources</strong></li>\n<li><strong>Consulting with team members to ensure accuracy during data integration pipeline development for custom analytics projects</strong></li>\n<li><strong>Ensures Data Science services are delivered to the highest quality standards.</strong></li>\n<li><strong>Build requirements for a new data model, gather feedback from teams and stakeholders</strong></li>\n<li><strong>Ensure completeness, accuracy and integrity of data.</strong></li>\n<li><strong>Collaborate with others to define data model and develop related meta-data.</strong></li>\n<li><strong>Manages the inventory of data needs and outgoing data requests</strong></li>\n<li><strong>Set data standards and clearly define the range of acceptable values and attributes for data.</strong></li>\n<li><strong>Defines and executes data validation checks</strong></li>\n<li><strong>Expose clear and easy to use metadata</strong></li>\n<li><strong>Provide effective and accessible training and documentation on the use and appropriate handling of these data.</strong></li>\n<li><strong>Learn and become an expert in TV Nielsen knowledge, with a focus on the data model, weighting, computations, and enhanced methodologies.</strong></li>\n<li><strong>Work with cross-functional teams to implement and validate enhanced audience measurement methodologies.</strong></li>\n<li><strong>Work with AppDev teams to validate production implementations of complex methodology and engineer our internal data model.</strong></li>\n<li><strong>Independently query data in the data lake using Spark</strong></li>\n<li><strong>Independently write custom Python code.</strong></li>\n<li><strong>Define data quality checks and analytics that can be executed by other team members</strong></li>\n<li><strong>Provide mentorship, leadership and best practices in support of a team of 20+ data scientists and data engineers</strong></li>\n<li><strong>Review and improve existing data pipeline code and processes.</strong></li>\n<li><strong>Identify areas to optimize code and processes</strong></li>\n<li><strong>Detect and address quality escapes.</strong></li>\n<li><strong>Pro-actively gather information, as needed, to work independently as well as in a team environment.</strong></li>\n</ul>\n\n<ul>\n\n<li><strong>Key tasks include – but are not limited to – data integration, automation, examining large volumes of data, identifying trends and being able to explain said trends, building data model requirements, creatively identifying ways to work around gaps in our data model, problem solving, reporting, project management, data analysis</strong></li>\n<li><strong>Champion and facilitate the appropriate use of the data that fall within their domain.</strong></li>\n<li><strong>Develop and promote data quality standards for data entry and reporting of these data.</strong></li>\n<li><strong>Build collaborative relationships with other data stewards and with users of the data they steward.</strong></li>\n<li><strong>Work with others to perform data stewardship tasks on behalf of the steward.</strong></li>\n\n</ul>\n<strong>Qualifications:</strong>\n<ul>\n<li><strong>Bachelor’s or Master’s degree in Computer Science or a related field with outstanding analytical expertise.</strong> </li><li><strong>3 or more years of experience and demonstrated domain expertise with one or more of the following: data manipulation, data engineering, data integration, trend or pattern recognition, data aggregation, data fusion, process automation, operations management, project management, or quality assurance</strong></li><li><strong>Must be proficient with Python, Spark, and SQL. Excellent technical documentation skills are also expected.</strong></li><li><strong>Must have ability to autonomously manage simultaneous projects in a fast paced business environment</strong></li><li><strong>Must have experience working with big data, algorithms, and large-scale databases.</strong></li><li><strong>Accuracy and attention to detail.</strong></li><li><strong>Must have passion for data. Ability to manipulate, analyze, interpret large data sources, and tell a story from data through analyses</strong></li><li><strong>Must have strong and clear verbal and written communication skills.</strong></li><li><strong>Must have an aptitude for leadership.</strong></li><li><strong>Must have critical thinking skills necessary to evaluate results in order to make decisions</strong></li><li><strong>Must demonstrate intellectual curiosity and persistence to find answers. Learn quickly and explain complex data models and methodologies to a variety of audiences. Problem solving skills.</strong></li><li><strong>Demonstrate interest in Nielsen methodologies, data collection, platforms, research processes and operations</strong></li><li><strong>Preferred experience with data visualization tools (e.g. Tableau, Spotfire, Quicksight)</strong></li><li><strong>Preferred experience with Databricks, Scala.</strong></li>\n</ul>\n<strong>#LI-US</strong>\n<br><br>\n<strong>About Nielsen:</strong>\n<br><br>\nNielsen N.V. (NYSE: NLSN) is a global performance management company that provides a comprehensive understanding of what consumers Watch and Buy. Nielsen’s Watch segment provides media and advertising clients with Total Audience measurement services across all devices where content — video, audio, and text — is consumed. The Buy segment offers consumer packaged goods manufacturers and retailers the industry’s only global view of retail performance measurement.\n<br><br>\nBy integrating information from its Watch and Buy segments and other data sources, Nielsen provides its clients with both world-class measurement as well as analytics that help improve performance. Nielsen, an S&amp;P 500 company, has operations in over 100 countries that cover more than 90 percent of the world’s population. For more information, visit www.nielsen.com\n<br><br>\n<em>Nielsen is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class.</em>\n<br><br>\n<strong>Job Type:</strong> Regular\n<br><br>\n<strong>Primary Location</strong>: Oldsmar,Florida\n<br><br>\n<strong>Secondary Locations:</strong> IL - Chicago, , ,\n<br><br>\n<strong>Travel:</strong> Yes, 10% of the Time</div>"}