{"job title": "Research Scientist, Bioinformatics &amp; Biostatistics Core", "company": "Rush University Medical Center", "city state": "– Chicago, Illinois", "rating": "3.8", "job description": "Rush University Medical Center is invested in clinical, basic science and community-based research to advance our understanding of how diseases work and how best to treat them, improving care for patients at Rush and around the globe!<br><br>The department of Bioinformatics &amp; Biostatistics Core is looking for a highly motivated and accomplished Research Scientist. <br><br>Position Highlights: <br><br> <br><br>The Research Scientist provides necessary bioinformatics and data analysis support to the Rush University research community. The successful candidate should be able to work under very limited supervision, with an advanced degree of technical proficiency. The incumbent will exhibit the capability to design analytical methods/models, to analyze data such as RNA-Seq, CHIP-Seq, shot gun sequencing, metabolomics obtained by the basic science, translational and Clinical Scientists at Rush University. In addition the Research Scientist will have the ability to troubleshoot, evaluate data integrity, and participate in preparation of reports and manuscripts based on experimental results as well as preparation for grant application for submission to funding agencies such as the NIH. There is an opportunity to have academic appointment at the rank that is compatible with prior accomplishment- e.g. Instructor or assistant professor. Exemplifies the Rush mission, vision, and values and acts in accordance with Rush policies and procedures. <br><br> <br><br>Position Responsibilities: <br><br> • Responsible for planning data analytical methods/models for complex set of biological data like NA-Seq, CHIP-Seq, shot gun sequencing, metabolomics <br><br> • Perform the required analysis <br><br> • Supervise data analyst(s) <br><br> • Work with the PI of the research project to evaluates and interprets the analyzed data and provides documentation of research data to accomplish research objectives <br><br> • Participate in preparation of manuscripts, abstracts for presentation and/or publications and progress reports <br><br> • Participate in grant application preparation and agree to be part of the key personnel in the research grant applications as Co-I or consultant <br><br> • Ensures compliance with governmental and University policies, procedures, rules and regulations within his/her working unit. <br><br> • Performs other job related assignments as needed <br><br> • Develop methods for efficient data capture <br><br> • Database creation and management <br><br> • Algorithm development <br><br><br> <br> <br><br> <br><br>Position Qualifications Include: <br><br> • PhD in or equivalent in computational science, or biostatistics or bioinformatics <br><br> • Track record of successful publication <br><br> • Strong communication, data analysis, computer and organizational skills are highly desirable <br><br> • Must be able to work at a high level of independence <br><br> • Ability to understand relationships between multiple datasets and variables/ fields <br><br> • Background in genetic sequencing, particularly using technological approaches <br><br> • Expertise in bioinformatics pipelines required e.g. R or python tools <br><br> • HDFS/Spark expertise preferred, e.g. Using Scala or PySpark <br><br><br> <br>Company Highlights:<br><br> • Rush University Medical Center is one of the Nation's top-ranked in clinical and biomedical research. <br><br> • One of only five hospitals in the nation selected by American Hospital Association honored for Equity of Care.<br><br> • In 2016 U.S. News &amp; World Report ranked Rush University Medical Center as #2 in Illinois, #2 in Chicago metro area and one of the top hospitals in 9 different medical specialties.<br><br> • Rush is a center for basic and clinical research, with physicians and scientists involved in hundreds of research projects developing and testing the effectiveness and safety of new therapies and medical devices.<br><br> • Rush partners with other local hospital systems to help drive research breakthroughs and bring those discoveries into the real world to improve health.<br><br><br> <br><br>Rush is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics."}