{"job title": "Data Engineer", "company": "Spectraforce Technologies Inc", "city state": "– Chicago, Illinois", "rating": "3.1", "job description": "<strong>Qualifications:</strong>\n<br>\nKnowledge and Skills\n<br>\n\tKnowledge of data warehouse technical architectures and ETL/ELT processes\n<br>\n\tKnowledge of scripting languages\n<br>\n\tKnowledge and proven understanding of big data tools and software\n<br>\n\tCritical thinking and decision making abilities\n<br>\n\tPossesses strong written and verbal communication skills\n<br>\n\tDemonstrates excellent customer service skills\n<br>\n\tExcellent attention to detail\n<br><br>\nEducation and Experience\n<br>\n\tBachelor's degree in Computer Science, related field or equivalent experience\n<br>\n\tOne or more years of relevant work experience\n<br><br>\n<strong>Responsibilities:</strong>\n<br>\nJob Summary\n<br>\nThe Data Engineer creates and enhances data solutions enabling seamless delivery of data. This position is responsible for collecting, parsing, managing and analyzing large sets of data across different domains for analysis. This role designs and develops data pipelines (data ingestion and ETL processes) that are scalable, repeatable and secure for stakeholder needs. This role operates under minimal supervision and has no direct reports.\n<br><br>\nPrincipal Duties and Responsibilities\n<br>\nData Management\n<br>\n\tAssists in creating the data management strategies to support business intelligence efforts for various stakeholders\n<br>\n\tBuilds out data architecture to support data strategy\n<br>\n\tLeads the design of the logical data model and implements the physical database structure\n<br>\n\tConstructs and implements operational data stores and data marts\n<br>\n\tProvide support for deployed data applications and analytical models by being a trusted advisor to Data Scientists and other data consumers by identifying data problems and guiding issue resolution\n<br>\nData Pipeline Management\n<br>\n\tDevelops real-time and batch ETL data processes aligned with business needs\n<br>\n\tManages and augments the data pipeline from raw OLTP databases to data solution structures\n<br>\n\tDocuments data flow diagrams, security access, data quality and data availability across all business systems"}