{"job title": "Senior Research Scientist", "company": "The Nemours Foundation", "city state": "– Wilmington, DE", "rating": "3.5", "job description": "As one of the nations leading pediatric health care systems, Nemours is committed to providing all children with their best chance to grow up healthy. We offer integrated, family-centered care to more than 300,000 children each year in our pediatric hospitals, specialty clinics and primary care practices in Delaware, Florida, Maryland, New Jersey and Pennsylvania. Nemours strives to ensure a healthier tomorrow for all children even those who may never enter our doors through our world-changing research, education and advocacy efforts. At Nemours, our Associates help us deliver on the promise we make to every family we have the privilege of serving: to treat their child as if they were our own.\n<br><br>\n<strong>Senior Research Scientist</strong>\n<br><br>\n<strong>Nemours</strong> <strong>Center for Health Care Delivery Science</strong>\n<br><br>\nThe Nemours Center for Healthcare Delivery Science is seeking a Senior Research Scientist in Wilmington, Delaware. The Center for Health Care Delivery Science, led by Anne E. Kazak, Ph.D., ABPP and Tim Wysocki, Ph.D., ABPP, conducts research on variables and processes that affect the delivery, safety, outcomes, cost, quality, and value of pediatric health care. We seek an accomplished scientist who can add depth and breadth to our center by bringing an active program of research in such areas as family-centered care, comparative effectiveness research, decision science, health care disparities, health literacy, dissemination and implementation science, or qualitative and mixed methods research. Visit our website for more information: (http://www.nemours.org/pediatric-research/area/health-care-delivery-science.html).\n<br><br>\nNemours operates freestanding childrens hospitals in Wilmington, Delaware and Orlando, Florida, subspecialty pediatric outpatient clinics in Wilmington, DE, Philadelphia, PA and Jacksonville, Orlando and Pensacola, FL, and pediatric primary care clinic networks in the Delaware Valley and Central Florida. Nemours has been at the forefront of integrating information technology into its daily operations, having adopted a uniform electronic medical record system in 1997. All Nemours entities are connected by a Local Area Network, video-conference capabilities and shared research administration, accounting and regulatory functions. Nemours is one of eight major pediatric organizations within PedsNet, a Clinical Data Research Network funded by the Patient Centered Outcomes Research Institute, an excellent resource for pediatric health care delivery science (see www.PEDSnet.org).\n<br><br>\nSuccessful candidates must hold an MD, MD/PhD, PhD or other doctoral degree in a health related discipline and demonstrate evidence of collaborative academic productivity and success in obtaining funding for health care delivery research. We invite applications from qualified researchers in any pertinent discipline at the advanced assistant professor or associate professor rank. A portion of this position can be dedicated to clinical service in the candidates professional specialty.\n<br><br>\n<strong>Primary Responsibilities:</strong> 1. Develop a productive program of health care delivery science as defined above. 2. Acquire and maintain federal or national foundation funding for the candidates program of research. 3. Cultivate cross-campus research collaborations that capitalize on Nemours technological infrastructure, opportunities for collaborative research through PEDSnet, electronic medical record and data warehouse, large clinical populations, and growing professional staff of more than 700 health care providers. 4. Mentor junior researchers and trainees to develop competitive grant applications. 5. Collaborate effectively with others in Nemours research community, clinical services and administration. 6. Advocate for the translation of research findings into practice throughout Nemours. 7. Contribute to Nemours educational mission by presenting at conferences and continuing medical education courses.\n<br><br>\n<strong>Application process:</strong> All inquiries will be treated confidentially. Interested applicants should submit a curriculum vitae and cover letter to Dana Berger (dana.berger@nemours.org) and addressed to: Anne E. Kazak, Ph.D., ABPP and Tim Wysocki, Ph.D., ABPP, Co-Directors, Center for Health Care Delivery Science Applications will be considered until the position is filled. As an equal opportunity employer, Nemours is committed to focusing on the best-qualified applicants for our openings.\n<br><br>\nOur dedication to professionals who are dedicated to children frequently earns Nemours a spot on the list of top workplaces in the communities we serve. Our Associates enjoy comprehensive benefits, including our unique Bridge to a Healthy Future pediatric health plan, an integrated wellness program, opportunities for professional growth, and much more. As an equal opportunity employer, Nemours focuses on the best-qualified applicants for our openings."}