{"job title": "Sr. Scientist", "company": "Axalta Coating Systems", "city state": "– Jacksonville, TX", "rating": "2.8", "job description": "Axalta is a leading global company focused solely on coatings and providing customers with innovative, colorful, beautiful and sustainable solutions. From light OEM vehicles, commercial vehicles and refinish applications to electric motors, buildings and pipelines, our coatings are designed to prevent corrosion, increase productivity and enable the materials we coat to last longer. With 150 years of experience in the coatings industry, the 13,000 people of Axalta continue to find ways to serve our more than 120,000 customers in 130 countries better every day with the finest coatings, application systems and technology. For more information visit axaltacoatingsystems.com and follow us @axalta on Twitter and on LinkedIn\n<br><br>\nAxalta Coating Systems is seeking a Coatings Scientist to join our staff at our Jacksonville, TX facility. The candidate will join the Technology Organization supporting our liquid industrial coatings businesses and support the North America Technology Center located in Mt. Clemens, MI. Under the guidance of a senior professional, the successful candidate will plan, execute and interpret results from experiments in product development and technical service programs.\n<br><br>\n<strong>Primary Responsibilities</strong>\n<ul>\n<li>Development of coatings formulas using appropriate design of experiments and statistical tools to meet wet paint, film properties and application / appearance specifications as provided by the customer</li><li>Scale- up and support of the formulas in the manufacturing area including establishment of specifications and test methods, fine tuning of the formula to allow first time quality and problem solving to the area when appropriate</li><li>Customer field support of the products in the customer's facility. Specific areas include: participation in trials and extended launch programs to assure optimal performance of the products, problem solving as appropriate, and preparation of reports to assist in problem solving and communication throughout the customer organization.</li> <li>Ability to lead and / or be a significant contributor in cross-functional teams to support product development, scale-up, and manufacturing and customer technical service.</li> \n</ul>\n<strong>Desired Skills and Experience:</strong>\n<ul>\n<li>B.S/M.S. in Chemistry, Chemical Engineering, Materials Science or closely related discipline</li> <li>At least one (1) year of experience working in a lab environment is required. Experience working in the chemical or coatings industry is preferred.</li> </ul>\n\n<ul>\n<li>Knowledge of designed experimentation and statistical data analysis is a plus.</li><li>Demonstrated ability to work and contribute in a team environment.</li><li>Proven track record of positive customer interactions and providing rapid feedback in time-critical situations.</li><li>The ideal candidate must be able to apply data analysis tools to system development and problem solving.</li><li>Must have experience with data analysis in Excel, Minitab, or similar.</li><li>Candidate must have outstanding written and oral communication skills.</li><li>Candidate must be proficient in with MS Office.</li><li>As an Equal Opportunity Employer, Axalta is committed to a diverse workforce.</li>\n</ul>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}