{"job title": "Open Data Platforms Data Engineer", "company": "Booz Allen Hamilton Inc.", "city state": "– Herndon, VA", "rating": "3.7", "job description": "<b>Job Number: R0034579</b><br><br>Open Data Platforms Data Engineer<p>Key Role:</p><p>Integrate, manipulate, and manage vast amounts of data using the next generation of Big Data analytic solutions for clients and combine data management expertise with innovation to deliver robust solutions that serve clients and stands apart from competitors. Interact with a multi-disciplinary team of analysts, data scientists, developers, and users to comprehend data requirements and develop a robust data processing pipeline that will ingest, normalize, enrich, and expose potentially billions of records per day to support advanced analytics. Collaborate with and contribute to open source software communities and ensure quality delivery of software thorough testing and code reviews. Build and launch new data models that provide intuitive analytics to clients and design, build, and launch configurable data workflows to move both small and large data through a Big Data infrastructure. Design and develop new systems and tools to enable human users and software services to consume and process data faster. Identify new technologies to be injected into the platform to support advanced data integration and analysis.</p>\n<p>Basic Qualifications:</p><p>-5+ years of experience with data modeling, data analysis, or schema design in data warehouses<br>-Experience with data visualization<br>-Experience in working with Java, Python, R, SQL, and SCALA</p><p>-Experience with relational databases<br>-Experience with ETL tools, including NiFi and StreamSets<br>-Experience with using Cloud services, including AWS and Azure<br>-Knowledge of RESTful services design, development, and testing<br>-Ability to learn technical concepts quickly and communicate with multiple functional groups<br>-Top Secret clearance</p><p>-BS degree</p>\n<p>Additional Qualifications:</p><p>-Experience with Agile software development<br>-Possession of excellent oral and written communication skills<br>-BS degree in CS, Computer Information Systems, Information Systems, or a related field</p><p>-Security+ or CISSP Certification</p>\n<p>Clearance:</p><p>Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; Top Secret clearance is required.</p><p></p><p></p><p>Were an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change.</p><p></p><p></p><br><br> <br><br>"}