{"job title": "Senior Scientist – Biology", "company": "Constellation Pharmaceuticals", "city state": "– Cambridge, MA, US", "rating": "4.8", "job description": "<div>\n<div>Constellation Pharmaceuticals is a clinical-stage biopharmaceutical company developing novel tumor-targeted and immuno-oncology therapies based on its pioneering research in cancer epigenetics. Founded in 2008 by seasoned scientific, medical and business leaders, Constellation was the first biopharmaceutical company to target selective regulators of epigenetic function as a potential therapeutic approach. With a decade of experience and an unparalleled understanding of the field, Constellation is using its fully integrated drug discovery and development platform to create a robust pipeline of programs across epigenetic targets to develop small-molecule therapies for difficult-to-treat cancers.\n<br><br>\nThe Department of Discovery Biology at Constellation seeks a motivated and experienced Senior Scientist to conduct research to support drug discovery and target ID/validation in a highly collaborative, goal-oriented, fast-paced team environment. The position requires expertise in cancer cell biology and/or chromatin biology and a passion contribute to high quality scientific research to drive drug discovery programs forward. We are seeking a highly motivated, skilled and experienced candidate who will be responsible for planning, execution, interpretation and presentation of data to drive drug discovery projects.</div>\n</div><br>\n\n<div>\n<div>Key Responsibilities:\n\n<ul>\n<li>Be the key biologist on drug discovery program/s and present the science at the scientific team meetings and to the senior management</li>\n<li>Validate cancer biology targets to prioritize them for the drug discovery pipeline. This entails understanding the mechanism of action for diverse epigenetic targets in the context of disease-relevant molecular pathways.</li>\n<li>Enable drug discovery program/s by establishing cell based assays to triage chemical matter</li>\n<li>Contribute to advancing the expertise in the Discovery biology group through the implementation of new technologies, especially in the chromatin biology space and support the company’s infrastructure needs with regard to tools used in cancer research.</li>\n<li>Be part of a highly skilled cross-functional research team that shares a common goal of delivering successful candidates for clinical development.</li>\n</ul>\nRequirements:\n\n<ul>\n<li>Ph.D. in life sciences with emphasis on chromatin and/or cancer biology with 5-8 years of work experience, at least 3 years of which are at a biotech/pharmaceutical company</li></ul>\n\n\n<ul>\n<li>Broad knowledge and laboratory research experience in oncology and/or epigenetics space as demonstrated by peer-reviewed publications</li>\n<li>Flexibility to work across diverse areas, develop and evaluate novel assays for a wide variety of biological/phenotypic endpoints, utilization of sequencing technologies and familiarity with using pathway analysis and bioinformatics data analysis software</li>\n<li>Previous experience on being a part of drug discovery project team/s and having worked closely with chemistry, biochemistry, structural biology and other drug discovery functionalities</li>\n<li>Strong oral and written communication skills, writing reports and giving updates at team meetings is required. The ability and desire to work in a challenging dynamic environment under tight deadlines is required</li>\n<li>Experience as a biology team lead/ project team lead</li>\n</ul>\n\n</div>\n</div>\n<br>"}