{"job title": "Senior Computational Scientist", "company": "Decibel Therapeutics", "city state": "– Boston, MA, US", "rating": "5.0", "job description": "The Senior Computational Scientist, reporting to the Director of Computational Biology, will work as part of cross-functional project teams to drive research focused on the elucidation of hearing biology and the discovery and development of therapeutics for hearing loss. Responsibilities will include:\n<br><br>\nHelp develop a robust platform for genomics-based target discovery, including single-cell RNAseq data, population genetic data, and genetic screen data.\n<br>\nApply and/or develop data-mining techniques for target identification and validation.\n<br>\nApply machine learning and statistical approaches to establish and benchmark predictive models of biological data.\n<br>\nHelp guide design of gene therapies, including computational aspects of promoter and capsid optimization.\n<br>\nEnhance the scientific reputation of the company through publishing and/or or presenting technical papers to internal and external audiences, and/or contributing to patent applications.\n<br>\nDesign and develop innovative, robust, analysis pipelines that can be applied in a research and clinical setting.\n<br>\nDevelop and contribute to external collaborations and partnerships.\n<br><br>\n<strong>Requirements:</strong>\n<br><br>\nM.S./Ph.D. in bioinformatics, computational biology, genetics or a related discipline.\n<br>\nStrong understanding of cellular and molecular biology. Understanding of hearing biology is a plus.\n<br>\nExpertise in computational biology, genomics and other high throughput data platforms including scRNAseq. Aptitude to apply experimental methods to understand disease biology and drug discovery.\n<br>\nProficiency in programming and computational analysis. Experience with R, Python and SQL are desirable.\n<br>\nAbility to apply and develop tools for integrative analysis and visualization of multi-dimensional datasets, integrating biochemical, cellular and genomic data using appropriate statistical methods to drive drug discovery projects.\n<br>\nAbility to work effectively with internal and external collaborators to funnel emerging genomics discoveries to guide internal programs and identify partners/consultants to complement internal bioinformatics efforts.\n<br>\n<strong>Other ideal areas of scientific expertise:</strong>\n<br>\nFundamental statistics and machine learning applications to life sciences\n<br>\nPredictive modeling, benchmarking\n<br>\nExperience with mining public data sets\n<br>\n<strong>Technical proficiencies should include:</strong>\n<br>\nLinux in a grid or cloud environment.\n<br>\nOne or more scripting and statistical languages\n<br>\nDistributed computing\n<br>\nExcellent written and verbal communication skills, particularly of complex information and concepts."}