{"job title": "Bioinformatics Scientist, BioPharma Collaborations", "company": "EdgeCast Networks", "city state": "– Redwood City, CA", "rating": "4.1", "job description": "Bioinformatics Scientist, BioPharma Collaborations\n\n<ul>\n<li>505 Penobscot Dr, Redwood City, CA 94063, USA</li><li>Full-time</li>\n</ul>\n\n<div>Company Description<div>ABOUT OUR COMPANY\n<br><br>\nWe believe conquering cancer is a big data problem. That’s why we built the world’s leading comprehensive liquid biopsy. This non-invasive tool for accessing and sequencing tumor DNA is used by thousands of oncologists to help tens of thousands of advanced cancer patients. We believe the boom in cancer data acquisition we helped launch will drive important discoveries and new products. We’re working on some exciting ones, including in early detection, where the impact on patients can be profound. We’ve raised more than $500 million from investors including Sequoia Capital, Khosla Ventures, OrbiMed, and SoftBank.</div>Job Description<div>BIOINFORMATICS SCIENTIST, BIOPHARMA COLLABORATIONS. Requires Master’s degree in Biology or Bioinformatics plus 2 years of experience in the position or as Bioinformatics Scientist or Research Scientist. The candidate must have minimum one year of experience leading the analytical and clinical validation of cancer pipelines for somatic variant calling; one year of experience developing, evaluating and testing tools for somatic variant calling pipelines (including single nucleotide, copy number and fusion variants) for targeted sequencing assays; one year of experience in somatic and germline variant interpretation for reporting clinical cases of cancer and inherited disease; six months of experience analyzing, curating or parsing public clinical variant database content including ClinVar (public archive of clinically relevant variants), catalogue of somatic mutations in cancer (COSMIC) and exome aggregation consortium (ExAC); and two years of experience of data-analysis and programming in R and Python.</div>Additional Information<div>All your information will be kept confidential according to EEO guidelines.</div>Job LocationI'm interested</div>"}