{"job title": "Principal Scientist Formulations", "company": "Endo International", "city state": "– Spring Valley, NY", "rating": "3.2", "job description": "Job Summary - a concise overview of the job\n<br><br>\nThe Principal Scientist, Formulations will lead and manage all project related activities and apply scientific/technical expertise to address complex R&amp;D issues for the preparation and timely delivery of drug substances (DS), drug products (DP), processes and procedures; coach team members, participate in teams and contribute to overall product development strategies and goals. Will assist with implementation of systems necessary for product development in a regulated environment. This role is also responsible for developing and tracking project timelines and assumes departmental responsibilities for projects.\n<br><br>\nAll incumbents are responsible for following applicable Division &amp; Company policies and procedures.\n<br><br>\nScope of Authority - span of control (work unit, site, department, division, etc.), monetary value of budget/spend authority ( capital, operating, etc.), P&amp;L responsibility, etc.\n<br><br>\n? Scientific Formulations responsibilities within a single site.\n<br><br>\n? Work under consultative direction towards pre-determined long-range goals and objectives. Assignments are often self-initiated. Work is reviewed through consultation and agreement with others rather than formal review by superior.\n<br><br>\nKey Accountabilities - key outcomes/deliverables, the major responsibilities, and % of time\n<br><br>\nAccountability\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\n% of Time\n<br><br>\nFormulation Scientific Services\n<br><br>\n? As an individual contributor, Provide technical and project leadership to various product development projects in a consistent, creative and innovative manner.\n<br><br>\n? Independently design experimental plans; perform pre-formulation and formulation development work on immediate and controlled release dosage forms.\n<br><br>\n? Provide training/coaching to junior scientists and technicians.\n<br><br>\n? In collaboration with other disciplines, design studies related to pre-formulation and formulation of various dosage form products that may impact the stability and delivery of the product.\n<br><br>\n? Responsible for batch production from pilot scale to submission batches and de-formulation activities to support generic dosage forms.\n<br><br>\n? Responsible for the development and evaluation of proposed formulations, processing procedures, including selection of container/closure systems.\n<br><br>\n? Generate and review analytical data to support the product development work.\n<br><br>\n? Develop highly innovative technical solutions to complex problems that require the regular use of ingenuity and creativity to solve or address customer problems or opportunities.\n<br><br>\n? Use novel experimental approaches to advance innovation and contribute to the overall direction of a project.\n<br><br>\n? May serve as organization spokesperson on advanced topics and/or programs.\n<br><br>\n<strong>60%</strong>\n<br><br>\nRegulatory Submissions\n<br><br>\n? Write experimental designs to carry out process development and evaluation work, limited scale-up in support of Abbreviated New Drug Applications (ANDA's) and New Drug Applications (NDA's) submission to regulatory agency. Plan appropriate analytical testing and stability studies on experimental batches\n<br><br>\n? Generate documents in support of Regulatory submissions and may author portions of CMC section of submissions.\n<br><br>\n<strong>20%</strong>\n<br><br>\nProject Teams\n<br><br>\n? Develop and track project timelines and assumes departmental responsibilities for projects. Deliver updates to senior level management in context of overall project goals.\n<br><br>\n? Effectively communicates own work, orally and in writing, at team meetings, in technical documents, and to external partners. Participate in cross departmental project teams as required.\n<br><br>\n? Encourage creativity in others and foster a continuous improvement mindset. Drive iterations to existing technologies.\n<br><br>\n<strong>10%</strong>\n<br><br>\nIndustry Trends\n<br><br>\n? Perform literature searches, attend scientific meetings, and keep abreast of literature relevant to oral, ocular, and nasal formulation development.\n<br><br>\n<strong>10%</strong>\n<br><br>\nTotal\n<br><br>\n<strong>100%</strong>\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nEducation &amp; Experience\n<br><br>\nMinimal acceptable level of education, work experience and certifications required for the job\n<br><br>\n? BS in Pharmacy and/or Chemistry with 10+ years of related experience in formulation/product development OR\n<br><br>\n? MS with 8+ years? experience in areas noted above OR\n<br><br>\n? Ph.D with 5+ years? experience in areas noted above.\n<br><br>\nKnowledge\n<br><br>\nProficiency in a body of information required for the job\n<br><br>\ne.g. knowledge of FDA regulations, GMP/GLP/GCP, Lean Manufacturing, Six-Sigma, etc.\n<br><br>\n? In depth knowledge in drug product formulation/process development, regulatory guidance and deficiency responses.\n<br><br>\n? Hands on experience in formulation development, formulation optimization, robustness studies and process optimization studies.\n<br><br>\n? Positive engaging personality, excellent technical leadership, communication and collaborative skills to work in multidisciplinary teams.\n<br><br>\n<strong>Skills</strong>\n<br><br>\n<strong>&amp;</strong>\n<br><br>\nAbilities\n<br><br>\nOften referred to as ?competencies?, leadership attributes, skills, abilities or behaviors that may be enterprise, functional or job specific e.g. coaching, negotiation, calibration, technical writing etc.\n<br><br>\n? Contributes on multi-disciplinary teams and may lead cross-functional project teams.\n<br><br>\n? Influences at the discipline level and provides formal and informal mentoring, creating opportunities to teach others in area of specialization.\n<br><br>\n? Builds extensive relationships across the organization and leverages these to advance departmental goals.\n<br><br>\n? Understands the developmental needs of the technical talent within the department and works to close those gaps.\n<br><br>\n? Able to independently manage multiple projects and perform independent research.\n<br><br>\n? Advanced MS Office Suite skills.\n<br><br>\nPhysical Requirements\n<br><br>\nPhysical &amp; mental requirements e.g. lift 40 pounds, walk across plant/warehouse, business travel (% of time), driving as part of work responsibilities, etc.\n<br><br>\n? Use of respirator, lab coat and safety glasses required. Ability to work with potent substances using glove-box.\n<br><br>\n? The work environment is representative of a group laboratory environment.\n<br><br>\n? Extended periods of sitting, standing and walking; use hands to handle, or feel objects, tools, or controls; reach with hands and arms; climb or balance; stoop, kneel, crouch, or crawl; talk or hear or smell; looking at monitor, moderate noise levels.\n<br><br>\n? Work is performed in FDA and DEA-regulated pharma lab environment with risk of exposure to various chemicals.\n<br><br>\nDisclaimer: The above statements are intended to describe the general nature and level of work performed by employees assigned to this job. They are not intended to be an exhaustive list of all duties, responsibilities, and qualifications. Management reserves the right to change or modify such duties as required."}