{"job title": "Bioanalytical Scientist", "company": "Eurofins Scientific, Inc.", "city state": "– Kenilworth, New Jersey", "rating": "2.8", "job description": "Eurofins Lancaster Laboratories, a nationally recognized laboratory, is searching for a Bioanalytical Scientist to support our Professional Scientific Services group in Kenilworth, NJ.\n<br><br>\n<strong>Bioanalytical Scientist responsibilities include, but are not limited to, the following</strong>:\n\n\n<ul>\n<li>Test serum samples from clinical drug development studies to determine drug level &amp; anti-drug antibodies (ADA) in immunoassays to support high priority biological and vaccine programs</li>\n<li>Analyze samples using electrochemiluminescent (ECL) methods on the Meso Scale Discovery platform and/or neutralizing anti-drug antibody (NAb) using a cell based assay</li>\n<li>Assess analytical result data on acceptability using Watson LIMS system or other computer software and maintain documentation according to guidelines similar to GLP</li>\n<li>Work according to established Standard Operating Procedures (SOPs) and regulatory guidance</li>\n<li>Maintain accurate records of ongoing projects in adherence with documentation standards</li>\n<li>Assist in generation and review of reports and contribute to trouble shooting efforts</li>\n<li>Collaborate and communicate within and across the work group</li>\n<li>Work in a structured environment under direct to moderate supervision</li>\n</ul>\n\n<strong>The ideal candidate would possess:</strong>\n\n\n<ul>\n<li>At least 1 year related laboratory experience</li>\n<li>Previous working experience in a regulated environment (GxP, preferably GLP)</li>\n<li>Previous experience in cell culture and cell based assays</li>\n<li>Previous experience with electrochemiluminescent methods on the Meso Scale Delivery platform and neutralizing anti-drug antibody assays</li>\n<li>Familiarity with Laboratory Information Management System (preferably Watson LIMS)</li>\n<li>Strong computer, scientific, and organizational skills</li>\n<li>Excellent communication (oral and written) and attention to detail</li>\n<li>Ability to work independently and as part of a team, self-motivation, adaptability, and a positive attitude</li>\n<li>Ability to learn new techniques, perform multiple tasks simultaneously, keep accurate records, follow instructions, and comply with company policies</li>\n<li>Ability to manage multiple projects under tight timeline and problem solving skills</li>\n<li>High sense of responsibility, accountability, and professional integrity</li>\n</ul>\n\n<strong>Basic Minimum Qualifications:</strong>\n\n\n<ul>\n<li>B.S./B.A. in Molecular Biology, Immunology, Cell Biology, Biology, Biochemistry, Biology, or related biological science discipline</li>\n<li>Authorization to work in the United States indefinitely without restriction or sponsorship</li>\n</ul>\n\nPosition is full-time, Monday-Friday, generally 8 a.m. - 5 p.m., but may vary to meet the assay needs; overtime as needed. Candidates currently living within a commutable distance of Kenilworth, New Jersey are encouraged to apply.\n<br><br>\nAs a Eurofins Lancaster Labs employee, you will become part of a company that has received national recognition as a great place to work. We offer excellent full-time benefits including comprehensive medical coverage, life and disability insurance, 401(k) with company match, paid holidays and vacation, personal days, and dental and vision options.<strong>To learn more about Eurofins, please explore our website www.eurofinsus.com.</strong><strong>Eurofins is a M/F, Disabled, and Veteran Equal Employment Opportunity and Affirmative Action employer.</strong>"}