{"job title": "Project Manager, Clinical Scientist", "company": "iRhythm", "city state": "– Lincolnshire, IL", "rating": "3.8", "job description": "<strong>About iRhythm:</strong>\n<br><br>\niRhythm is a leading digital healthcare company focused on the way cardiac arrhythmias are clinically diagnosed by combining our wearable biosensing technology with powerful cloud-based data analytics and machine- learning capabilities. Our goal is to be the leading provider of first-line ambulatory ECG monitoring for patients at risk for arrhythmias. iRhythm's continuous ambulatory monitoring has already put over 1 million patients and their doctors on a shorter path to what they both need answers.\n<br><br>\n<strong>About this role:</strong>\n<br><br>\nThe Clinical Project Manager is responsible for the management of all aspects of clinical research for assigned project(s). The CPM, in concert with the clinical director, is accountable for achieving successful delivery of clinical team activities at the project level by meeting company and regulatory requirements according to time, quality/scope and budget constraints.\n<br><br>\nResponsibilities include:\n\n<ul>\n<li>Proactively manage project level scientific and operational aspects of clinical research projects and clinical trials including management of trial timeline, budget, and resources.</li>\n<li>Lead development of all clinical study documents from trial design to protocol development including endpoint selection.</li>\n<li>Provide efficient updates on trial progress, with respect to project plan, contracts, trial budget and timeline management, quality standards and risk mitigation.</li>\n<li>Lead study startup process, including but not limited to conduct of the trial kick-off meeting and training, the set-up of trial materials, and finalization of clinical trial agreements and budgets.</li>\n<li>Ensure effective project plans are in place and operational for each trial and work proactively to set priorities in accordance with applicable project plans, company standard operational procedures (SOPs), guidelines and regulatory requirements.</li>\n<li>Ensure potential study risks are escalated to the attention of the senior management when appropriate.</li>\n</ul>\n<strong>About you:</strong>\n\n<ul>\n<li>Advanced Degree in Life Sciences (MD, PhD preferred)</li>\n<li>Four or more years of clinical science and clinical operations experience</li>\n<li>Five or more years of clinical project management experience at a sponsor or CRO company is preferred</li>\n<li>Therapeutic experience in cardiology or cardiovascular field</li>\n<li>Read, write and speak fluent English; excellent verbal and written communication skills</li>\n<li>Must have a thorough knowledge of clinical research concepts, practices, and FDA regulations and guidelines</li>\n<li>Willingness and ability to travel domestically and internationally is required, it is anticipated that this will be less than 30 % of work time.</li>\n</ul>\n<strong>What's in it for you:</strong>\n<br><br>\nThis is a full-time position with competitive salary package and excellent benefits including medical, dental and vision insurance, paid holidays and paid time off.\n<br><br>\nIRhythm also provides additional benefits including 401K (w/ company match), an Employee Stock Purchase Plan, annual organizational/cultural committee events and more!\n<br><br>\n<strong>FLSA Status</strong>: Exempt\n<br><br>\nAs a part of our core values, we ensure a diverse and inclusive workforce. We welcome and celebrate people of all backgrounds, experiences, skills and perspectives. iRhythm Technologies, Inc. is an Equal Opportunity Employer (M/F/V/D). Pursuant to San Francisco Fair Chance Ordinance, we will consider for employment all qualified applicants with arrest and conviction records.\n<br><br>\nMake iRhythm your path forward."}