{"job title": "Data Engineer", "company": "Mayfield", "city state": "– United States", "rating": "NA", "job description": "The Role\n<br><br>\nCome help us and our customers learn about the world through data. With industry leading companies using insights gleaned from our data to understand how purchase and travel behavior is changing in America, the ability to marshall the volume and complexity of our data is paramount.\n<br><br>\nAs the data science team's first data engineering hire, you will be responsible for scaling our operations for deep internal analysis and customer deliveries to handle the next stage of growth while prioritizing data security and user privacy. You will design, implement and maintain the infrastructure on which our data move. You will develop predictive modeling pipelines for scientists and data models that enable non-technical colleagues to ask questions of our data. You identify and vet new technologies that will help us ingest and transform data.\n<br><br>\nYou\n<br><br>\nYou are deeply curious and are passionate about building tools that become vital. You creatively work through problems and have the natural itch to follow obstacles to their root cause. You are expert at building data products that empower users. You think deeply about the problems ahead and are comfortable moving between tools in your toolbelt. And you are quick to learn, implementing new approaches when facing questions that demand it.\n<br><br>\nYou are comfortable being the decision maker and relish the opportunity to take ownership of challenges. You are passionate about helping others make sense of data and are excited to shape our long term data strategy. You are a strong advocate for data best practices within the company.\n<br><br>\n<strong>Requirements</strong>\n\n\n<ul>\n<li>Expertise in designing and building pipelines in a distributed environment (spark, hadoop), managing data flow (kafka), loading data into warehouse platforms (redshift, snowflake) and traditional data stores (sql)</li>\n<li>Strong experience in a scripting language (python, scala)</li>\n<li>Familiar with working in a cloud environment (aws)</li>\n<li>Bachelors in Computer Science, related discipline or equivalent experience</li>\n<li>3+ years of experience managing and manipulating large data sets</li>\n<li>Excited by a high learning curve</li>\n<li>Excellent written and oral communicator</li>\n</ul>\n\nCompensation and Benefits\n\n\n<ul>\n<li>Highly competitive salary and benefits</li> \n\n<li>Stock grants pre-IPO at a company backed by top investors</li>\n<li>Take unlimited, responsible vacation</li>\n</ul>"}