{"job title": "Associate Principal Scientist", "company": "Merck and Co.", "city state": "– Rahway, NJ", "rating": "3.7", "job description": "The Associate Principal Scientist within the Merck Animal Health Formulation Group is responsible for the development of a variety of different dosage forms (oral, topical, injectable, implant, etc) and related processes across all stages of development. The successful candidate will be a self-motivated scientist with an outstanding scientific track-record and passion for pharmaceutical product development. This individual will use innovative approaches to support both early and late stage development candidates including screening, design and development of formulations defined by robust drug product compositions and processes.\n<br><br>\nIn addition, the individual will lead pipeline and innovation teams. Other responsibilities include statistical experimental design &amp; data analysis, authoring of technical reports, regulatory submissions and patent applications. Active participation on formulation development teams while interfacing with other functional areas (e.g. project management, manufacturing, quality, regulatory affairs) and external partners to drive project milestones will be required. The candidate should have strong communication skills, good interpersonal and collaboration skills, an ability to multitask and a strong desire to learn and contribute.\n<br><br>\nQualifications\n<br><br>\nRequirements:\n<br><br>\nA PhD. in Chemical Engineering, Pharmaceutics, Material Science or a related discipline with a minimum of four (4) years of pharmaceutical formulation development experience, OR a Masters Degree in Chemical Engineering, Pharmaceutics, Material Science or a related discipline with a minimum of eight (8) years of pharmaceutical formulation development experience.\n<br>\nExperience developing a variety of formulations and processes.\n<br>\nProven ability to author regulatory filings.\n<br>\nDemonstrated excellence in independently designing and conducting experiments and analyzing data through use of QbD principles, DOEs, and statistical evaluation.\n<br><br>\nPreferred Experience and Skills:\n<br><br>\nExperience in Animal Health.\n<br>\nEvidence of external influence demonstrated through contributions to the scientific literature (patents, publications, presentations).\n<br>\nProven ability to identify and develop innovative ideas.\n<br>\nStrong verbal and written communication skills.\n<br>\nHands-on experience in pharmaceutical pilot plants"}