{"job title": "Physical Scientist, AST, Science Program Management", "company": "National Aeronautics and Space Administration", "city state": "– Baltimore, MD", "rating": "4.4", "job description": "<div>\n <ul>\n <li>\n \n Videos\n \n </li>\n </ul>\n </div>\n <div>\n <ul>\n <li>\n \n Duties\n \n <div>\n \n Help\n Help\n \n Duties\n Summary\n <div>\n <p>The Office of Safety and Mission Assurance (SMA), Safety and Assurance Requirements Division (Code GD000), is looking for a highly skilled individual with contamination-control expertise to provide day-to-day leadership of the Office of Planetary Protection, flight program and project oversight, and support to the Planetary Protection Officer in the implementation of planetary protection policy.<br><br>This position may be filled in Washington, DC or Pasadena, CA. </p>\n \n Learn more about this agency\n \n </div>\n Responsibilities\n <div>\n <p>\n As a Physical Scientist, specializing in Science Project Management, you will support the NASA Planetary Protection Officer (PPO) with the maintenance of planetary protection policies and standards and oversight of their implementation by space flight missions. In this capacity, you also serve as the Deputy Planetary Protection Officer by providing day-to-day leadership of the Office of Planetary Protection within NASA's Office of Safety and Mission Assurance. You will provide flight program and project oversight technical assessments and reviews of the implementation of NASA's planetary protection policy and guidelines by spaceflight missions of national or international significance on behalf of the Office of Safety and Mission Assurance. <br><br>You will identify and propose solutions to management problems which are of major importance to planning program direction and compliance with international treaty obligations. You will evaluate the acceptability of planetary protection plans and reports. You will ensure the coordination of mission oversight activities and reporting with relevant Technical Authority personnel. You will facilitate collaborative projects involving planetary protection personnel from multiple NASA centers and commercial spaceflight industries in order to advance biological cleanliness technology and share best practices for spacecraft assembly and launch. <br><br>You will serve as an expert consultant providing technical engineering advice on planetary protection policies and practices regarding flight projects with NASA involvement and commercial space activities. You will offer expert technical advice and serves as an authoritative source of information for decisions and guidance concerning the management of the total PPO program effort. You will publish and present on lessons learned and technical advances in the field planetary protection. You will plan, organize, and carry out analytical studies involving the planning, development, and implementation of major agency programs of national scope and impact. <br><br>You will foster the development and implementation of Agency policy and training matters concerning planetary protection. In collaboration with NASA and external stakeholders, you will lead or support the development of planetary protection policy, technical standards and protocols, ensuring that NASA keeps pace with current scientific methods, emerging technologies and mission objectives. You will identify and document responsibilities and requirements for issuance as part of Agency-level directives and standards. \n </p>\n </div>\n\n <div>\n Travel Required\n <p>25% or less - Travel may be required for training or other work-related duties</p>\n </div>\n <div>\n <div>\n \n \n Supervisory status\n \n \n <p>\n No\n </p> </div>\n <div>\n \n \n Promotion Potential\n \n <p>\n 15\n </p> </div>\n </div>\n </div>\n </li>\n <li>\n <div>\n Job family (Series)\n <p>\n \n 1301 General Physical Science\n \n </p>\n </div>\n </li>\n <li>\n \n Requirements\n \n <div>\n \n Help\n Help\n \n Requirements\n Conditions of Employment\n <ul>\n <li>This is a drug-testing designated position</li>\n <li>Selectee must complete a financial disclosure statement</li>\n <li>Occasional travel may be required</li>\n <li>Position subject to pre-employment background investigation</li>\n <li>Successful completion of a security investigation will be required</li>\n </ul>\n <p>\n You must meet qualifications requirements by the closing date of this announcement.\n </p>\n <div>\n Qualifications\n\n <div>\n In addition to the Basic Education Requirement, you must have one year of specialized experience equivalent to the next lower grade level (GS-14), which has equipped you with the particular competencies needed to successfully perform the duties of the position described above.<br><br>Skills Set 1): Experience leading and/or conducting technical assessments, reviews, and verification activities related to bioburden contamination control for spaceflight missions to destinations such as Mars and the icy moons of Jupiter and Saturn.<br><br>Skills Set 2): Experience as an expert consultant and/or advisor on developing and implementing policies, guidelines and practices for spaceflight projects.\n </div>\n </div>\n\n <div>\n Education\n <p>\n To receive consideration, your resume MUST contain your complete degree information (i.e., type of degree-received, year degree received, and major area of study). If you have received a degree in Computer Science, you MUST list all courses you have taken which meet the education requirements as stated in the qualification requirements section as well as the semester hours awarded. You MUST include the descriptive title, course code, and number of semester/quarter hours. (i.e., CMSC-435-Software Engineering, 3 Semester hours) If this information is not provided, your education may not be appropriately evaluated and you may lose consideration for this position. <br><br>Basic Education Requirement: A bachelor's degree from an accredited college or university with major study in Aeronautical Engineering, Aeronautics, Aerospace Engineering, Architecture, Astronautical Engineering, Astronautics, Astronomy, Astrophysics, Biomedical Engineering, Ceramic Engineering, Ceramics, Chemical Engineering, Chemistry, Civil Engineering, Computer Engineering, Computer Science*, Earth and Planetary Science, Electrical Engineering, Electronics Engineering, Geology, Geophysics, Industrial Engineering, Materials Engineering, Materials Science, Mathematics (Pure or Applied), Applied Mechanics, Engineering Mechanics, Mechanical Engineering, Metallurgical Engineering, Metallurgy, Meteorology, Nuclear Engineering, Nuclear Engineering Physics, Oceanography, Optical Engineering, Physics, Applied Physics, Engineering Physics, Space Science, Structural Engineering, Welding Engineering or other appropriate physical science or engineering field. Degrees in engineering technology are not considered to be qualifying for this position. <br><br>*Note: Curriculum must include 30 semester hours of course work in a combination of mathematics, statistics and computer science. Of the 30 semester hours, 15 must be in any combination of statistics and mathematics which includes differential and integral calculus. \n </p>\n </div>\n\n\n <div>\n Additional information\n <div>\n <p>The locality range at the GS-15 grade level for the Washington, DC area is $134,789 - $164,200. <br><br>The locality range at the GS-15 grade level for the Pasadena, CA area is $137,259 - $164,200. <br><br>This position is announced in conjunction with vacancy announcement number HQ18D0042 open to all U.S. citizens. Only one position will be filled as a result of these two vacancy announcements<br><br>Please list your General Schedule (GS) equivalency on your resume for every federal position you have held.<br><br>As identical vacancies are identified, additional selections may be made.<br><br>Individuals who have special priority selection rights under the Agency Career Transition Assistance Program (CTAP) or the Interagency Career Transition Assistance Program (ICTAP) must be well qualified for the position to receive consideration for special priority selection. See 'How You Will Be Evaluated' for definition of well qualified. Federal employees seeking CTAP/ICTAP consideration must indicate their eligibility when applying for a position. The USAJOBS resume asks you to identify your ICTAP eligibility; the NASA Supplemental Information asks you to identify your CTAP eligibility. If you are selected for the position, you must be prepared to submit proof that you meet the requirements for CTAP/ICTAP. This includes a copy of the agency notice, a copy of their most recent Performance Rating and a copy of their most recent SF-50 noting current position, grade level, and duty location.<br><br>Qualified NASA term employees who have term conversion eligibility under the NASA Flexibility Act of 2004 will be referred and considered equally with other NASA permanent employees under internal competitive placement procedures.<br><br>Your USAJOBS account asks you to assign a name to each of your resumes. When you apply to a NASA position, we will show you the text of the resume you have submitted, but we do not maintain the name you have assigned to that resume. If you wish to keep track of that information, we recommend you make note of it at the time you apply.<br><br>Fair Employment Opportunities for Applicants<br>NASA Credit for National Service<br><br>Applicants must possess at least a Bachelor's Degree or equivalent. <br><br>Current Federal employees must meet time in grade and three months after competitive appointment restrictions by the closing date of the announcement.<br><br>Relocation expenses may be paid consistent with NASA's policy.<br></p>\n </div>Read more\n \n </div>\n\n <div>\n How You Will Be Evaluated\n <div>\n <p>You will be evaluated for this job based on how well you meet the qualifications above.</p>\n <p>\n Resumes will be rated by an automated system (Resumix) that matches the competencies extracted from the candidate's resume to the competencies identified by the selecting official for the position. Candidates will be evaluated on the competencies they possess that are directly related to the duties of the job, as described in the announcement. Candidates should refer to NASA's Applicant Guide for assistance in developing a complete resume, as NASA will not accept separate KSA statements.<br><br>Qualified candidates will be assigned to one of three quality levels based on the degree to which their competencies meet the duties required. A human resources specialist will validate the qualifications of those candidates eligible to be referred to the selecting official. For the purpose of the Career Transition Assistance Program (CTAP) and the Interagency Career Transition Assistance Program (ICTAP), candidates rated in the top quality level are considered well-qualified.\n </p>\n <p></p>\n </div>Read more\n\n <div>\n Background checks and security clearance\n <div>\n <div>\n Security clearance\n <p>\n \n Secret\n \n </p>\n </div>\n\n <div>\n Drug test required\n <p>\n No\n </p>\n </div>\n </div>\n </div>\n </div>\n </div>\n </li>\n <li>\n \n Required Documents\n \n <div>\n \n Help\n Help\n \n Required Documents\n <div>\n <p>\n NASA's application process has been specifically developed to ensure that we only ask you for the information we absolutely need to evaluate your qualifications and eligibility. In order to apply for this position, you only need to submit your resume and answer the screening questions and supplemental information. No additional documentation is accepted at the time of application. (For example you need not submit narrative 'KSA' statements; they are not required and will not be evaluated.) In this way we allow you to focus on preparing a resume that best describes your background and abilities. For assistance in preparing your resume, consult the Applicant Guide. Nothing further is required until requested by the Human Resources Office. At that point, we may ask you to submit documentation to support statements made in your resume. For example, we may ask you to provide academic transcripts or proof of Federal employment status. If you are claiming veterans' preference, we may ask you to submit proof of veterans preference (DD-214, and, if claiming 10-point preference, SF-15 plus proof required by that form). If you fail to provide the required documents within the stated time period, we may withdraw a job offer and/or remove you from further consideration.<br>Please be sure to review your resume on the 'Review tab' by clicking on 'Your Resume.' Ensure that the correct copy of the resume you have selected has been transferred from your USAJOBS account. If you fail to validate the information in your resume, you may not be appropriately evaluated for this position. Also, please be sure to review and complete the Supplemental Information questions. <br><br>To receive consideration, you must submit a resume and answer NASA-specific questions. The NASA questions appear after you submit your resume and are transferred to the NASA web site. If you successfully apply, USAJOBS will show your application status as 'resume received - complete.' If your status is 'Application Started,' you have not successfully applied. Do not rely on a USAJOBS email to confirm successful application. Only an email from NASA confirms a successful application.<br><br>\n </p>\n <div>\n \n If you are relying on your education to meet qualification requirements:\n \n <p>\n Education must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and/or degrees from\n schools accredited by accrediting institutions recognized by the U.S. Department of Education.\n </p>\n <p>\n Failure to provide all of the required information as stated in this vacancy announcement may result in an ineligible rating or may affect the overall rating.\n </p>\n </div>\n </div>\n </div>\n </li>\n <li>\n \n Benefits\n \n <div>\n \n Help\n Help\n \n Benefits\n <div>\n <p>\n A career with the U.S. Government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Learn more about federal benefits.\n </p>\n <p></p>\n <p>\n Review our benefits\n </p>\n <div>\n <p>Eligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time, or intermittent. Contact the hiring agency for more information on the specific benefits offered.</p>\n </div>\n </div>\n </div>\n </li>\n <li>\n \n How to Apply\n \n <div>\n \n Help\n Help\n \n How to Apply\n <div>\n <p>This vacancy is being filled through NASA STARS, an automated Staffing and Recruitment System. NASA partners with USAJOBS in providing a seamless application process. Before you begin the application process, please read the vacancy announcement carefully and have all required information available. You may begin the process of submitting your resume by clicking on the 'Apply Online' link. In order to be considered, you must submit a resume completed on the USAJOBS site. When completing your USAJOBS resume, please remember that NASA limits resumes to approximately 32,000 characters including spaces. NASA does not accept resumes uploaded to USAJOBS from a second source or documents attached through USAJOBS' document attachment feature. Once you submit your resume to NASA, you will be asked to complete a short series of additional questions. You must finish the entire process in order to have a complete application package and receive consideration. Your answers will not be saved unless you finish the entire application. You may edit a previously-submitted application, if the announcement is still open. If you are unable to apply electronically for this position, submit your resume and supplemental questions to:<br>National Aeronautics and Space Administration (NASA)<br>4200 Rideout Road<br>Resume Operations Center/Mailstop: HS50<br>Marshall Space Flight Center, AL 35812.<br><br>DO NOT submit your resume directly to the Center advertising this vacancy. Mailed resumes must be received by the close of business on the closing date of the announcement. Hard copy resumes requirements are provided at: Hard Copy Resume Requirements. If you are a first time applicant, we recommend that you review NASA's Applicant Guide to ensure that you are providing a complete resume. Failure to submit the supplemental data and a resume that contains all of the required information may result in loss of consideration for positions in which you are interested. All applications must be received no later than midnight Eastern Time on the closing date of the announcement.<br><br>This position may be filled either in Washington, DC and Pasadena CA. Upon selection, the duty location will be determined. </p>\n </div>Read more\n \n <div>\n Agency contact information\n \n Human Resources Management Division, HR Consulting Branch\n\n Human Resources Management Division, HR Consulting Branch\n \n\n <div>\n <div>\n Phone\n <p>\n 202-358-0180\n </p>\n\n\n Email\n <p>\n \n HQ-NASA-jobs@mail.nasa.gov\n \n </p>\n </div>\n <div>\n Address\n <p>\n </p>\n NASA's Resume Operations Center<br>\n 4200 Rideout Road, Mailstop HS50<br>\n Marshall Space Flight Center,\n AL \n 35812<br>\n US\n \n </div>\n </div>\n \n Learn more about this agency\n \n </div>\n\n Next steps\n <div>\n <p>\n Candidates for NASA positions are evaluated using our automated staffing and recruitment system, NASA STARS, which compares your skills and experience as described in your resume with the requirements of the position. If you are found to be a highly qualified candidate, you will be referred to the selecting official for further consideration. (In some cases, individuals with priority for special consideration must be considered and selected before other candidates.) Whether or not you are contacted for an interview depends upon the location of the position and the judgment of the selecting official. If you are a current federal employee and are contacted for an interview, you may be asked to provide a copy of your most recent performance appraisal narrative summary. At NASA, we pride ourselves on efficient and timely recruitment actions, and you can normally expect to learn the outcome of the selection process in a fairly short period of time. In addition, to ensure that you can measure progress for yourself, NASA provides you with regularly updated information on the status of the vacancy announcement.\n </p>\n </div>Read more\n </div>\n </li>\n <li>\n \n Fair &amp; Transparent\n \n <div>\n Fair &amp; Transparent\n <p>\n The Federal hiring process is setup to be fair and transparent. Please read the following guidance.\n </p>\n Equal Employment Opportunity Policy\n <div>\n <p>\n The United States Government does not discriminate in employment on the basis of race, color, religion, sex (including pregnancy and gender identity), national origin, political affiliation, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service, or other non-merit factor.\n </p>\n <ul>\n <li>\n \n Equal Employment Opportunity (EEO) for federal employees &amp; job applicants\n \n </li>\n </ul>\n </div>Read more\n Reasonable Accommodation Policy\n <div>\n <p>\n Federal agencies must provide reasonable accommodation to applicants with disabilities where appropriate. Applicants requiring reasonable accommodation for any part of the application process should follow the instructions in the job opportunity announcement. For any part of the remaining hiring process, applicants should contact the hiring agency directly. Determinations on requests for reasonable accommodation will be made on a case-by-case basis.\n </p>\n <p>\n A reasonable accommodation is any change to a job, the work environment, or the way things are usually done that enables an individual with a disability to apply for a job, perform job duties or receive equal access to job benefits.\n </p>\n <p>\n Under the Rehabilitation Act of 1973, federal agencies must provide reasonable accommodations when:\n\n </p><ul>\n <li>An applicant with a disabi</li></ul></div></div></li></ul></div>"}