{"job title": "Production Scientist 3 - Genetic Identity", "company": "Promega", "city state": "– US-Madison-WI", "rating": "4.2", "job description": "<strong>Job Description</strong>\n<br>\n\n<br>\n<strong>JOB OBJECTIVE:</strong>  Independently manufactures, quality tests components/kits and supports new product transfers within the product area using understanding of manufacturing technologies.\n<br><br>\n<strong>ESSENTIAL DUTIES:</strong>\n\n\n<ul>\n<li>Independently manufacture a variety of biologics and/or biochemical products so as to meet product specifications. Follow schedules and plan production batches to assure on-time delivery of finished product. Must be able to respond to changing needs or priorities of the business.</li>\n<li>Perform assays to assure that products meet existing requirements for purity, activity and functionality. When necessary, evaluate raw materials to assure they meet requirements for quality. Performs technical troubleshooting by conducting technical assessment of products and makes recommendations to appropriate person/team/area/etc.</li>\n<li>Design experiments to problem-solve and improve existing manufacturing protocols and QC methods. Implement experimental design and perform data analysis. Use all available scientific and technical resources to recommend solutions and solve problems.</li>\n<li>Demonstrated understanding of quality requirements that relate to both business needs and regulatory standards. Demonstrates strong documentation practices and consistently produces high quality products and documentation.</li>\n<li>Write, review and revise as necessary, manufacturing, material specifications, QC protocols, and many other documents for clarity, appropriate technical content, process improvements, scale-up and/or raw material changes as prescribed by policies and procedures.</li>\n<li>Participating on multidisciplinary product improvement and development teams as needed. Provide information and technical support to meet team goals. May help develop project plans for area of responsibility and analyze operational and cost impacts of process/product improvements. Communicate project updates and issues to supervisor. Interact as needed with Marketing, QA and R&amp;D personnel to identify customer requirements for new products and process improvements.</li>\n<li>Understands and complies with ethical, legal and regulatory requirements applicable to our business.</li>\n</ul>\n\n<strong>MANDATORY QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>A.D. or B.S. or M.S. degree in a scientific discipline (e.g., Biochemistry, Biotechnology, Molecular Biology, Microbiology). Degree and years of experience as reflected in a proven record of accomplishment in the Essential Duties of this position are used to determine qualification for Production Scientist 3.</li>\n<li>Significant experience 5 – 10+ years with production equipment, biochemical separations, compounding, and testing methods. Proven technical skills and documented ability and effectiveness in carrying out the Essential Duties of this position.</li>\n<li>Documented successful record of accomplishment in experimental design and problem solving relevant to this position.</li>\n<li>Outstanding organizational and multi-tasking skills; able to effectively and successfully work on several projects and/or products.</li>\n<li>Proven ability to effectively work as part of a team and has the ability to independently solve interpersonal conflicts. Contributes to achievement and success of a team.</li>\n<li>Strong computer skills including Microsoft Office, ERP systems, etc.</li>\n<li>Excellent written and verbal communication skills. Ability to interpret and communicate scientific results and to interact productively with scientists in the team.</li>\n</ul>\n\n<strong>PREFERRED QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>Demonstrated experience in preparative protein purification and/or expertise in assay methods for biochemical activity, contaminant testing and product applications as required for the specific position.</li>\n<li>Experience or familiarity with ISO or cGMP environments.</li>\n<li>Prior industry experience strongly preferred.</li>\n<li>Demonstrated experience with use of analytical software for collection and analysis of experimental data.</li>\n</ul>\n\n<strong>PHYSICAL REQUIREMENTS:</strong>\n\n\n<ul>\n<li>Ability to work at a laboratory bench for extended periods of time.</li>\n<li>Ability to work with hazardous materials (e.g. chemicals, radioactivity, electrical equipment) so as not to endanger oneself or others.</li>\n<li>Ability to use computers in an interactive manner for extended periods of time.</li>\n<li>Ability to use standard laboratory protective equipment (e.g. goggles, lab coat, protective gloves).</li>\n<li>Ability to lift 50 lb. occasionally.</li>\n</ul>\n\nDiversity is important at Promega. We are proud to be an Equal Opportunity Employer, and make employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran status, disability, or any other protected class."}