{"job title": "Principal Scientist, Cambridge, MA", "company": "Sanofi", "city state": "– Cambridge, Massachusetts, United States", "rating": "3.5", "job description": "Sanofi is a global health care leader that is transforming the oncology research and development paradigm. Our goal is to create a dynamic and exciting environment that is dedicated to cutting-edge science and delivering novel life-saving therapies to cancer patients. As a part of our team, you will have an opportunity to work with talented and passionate colleagues in Sanofi Molecular Oncology Research which is a global organization located in Cambridge, USA and Vitry-sur-Seine, France\n<br><br>\nSanofi Molecular Oncology is seeking an experienced and motivated senior scientist to discover and develop new therapeutics for the treatment of human malignancies. The position is based in Cambridge, Massachusetts, USA. The successful candidate will have the opportunity to develop new projects, as well as contribute to the progression of existing portfolio in molecular oncology and cancer dependency.\n<br><br>\n<strong><strong>Position Overview/Key Responsibilities</strong></strong>:\n<ul>\n<li>Works as part of a research team to elucidate novel biology to discover and develop new therapeutic for cancer dependency</li><li>Follows directives of supervisor in an expeditious manner to aggressively complete prescribed timelines and goals. Able to complete tasks/experiments with no supervision</li><li>Independently designs and implements laboratory experiments. Makes complex analysis of data, and details experimental design/protocol for every laboratory experiment. Summarizes/reports the data and generates presentation materials</li><li>Contributes expertise and knowledge to the evaluation of external opportunities in Molecular Oncology</li><li>Expected to present at lab and group meetings, global project team meetings, and to provide materials/slides for other scientists at project or unit presentations</li><li>Demonstrates the ability to manage 1-2 direct reports in a professional manner</li><li>Demonstrates the ability to lead a project team of low-to-moderate complexity and to independently lead project team meetings and scientific discussions</li><li>Demonstrates innovation in research/planning and expected to be able to make intellectual property or publication submissions</li>\n</ul>\n<strong><strong>Basic Qualifications</strong></strong>:\n<ul>\n<li>Ph.D. in cancer biology, cancer dependency, cancer resistance or related discipline</li><li>Minimum of 7 years of industry or post-doctoral academic experience with a working knowledge of cancer biology</li>\n</ul>\n<strong><strong>Preferred Qualifications</strong></strong>\n<ul>\n<li>Prior experience in pharma or biotech (minimum 2-3 years) is preferred</li><li>Strong experience in targeting protein degradation is desirable</li><li>Good experience in cell biology, molecular biology and translation from basic research to patient</li><li>Experience in target identification and validation</li><li>Strong experience in gene knockout/in using crisper technology (including functional genomic crisper screens)</li><li>Ability to work with bioinformatics experts to establish hypothesis for cancer dependencies and mining of patient molecular profiling data to identify new targets</li></ul>\n\n<ul>\n<li>Solid track record of independent research accomplishments in cancer dependency, targeted protein degradation and oncogenic drivers, as evidenced by publications in peer-reviewed journals</li><li>The ability to effectively communicate, collaborate and lead others</li><li>Must be highly collaborative and able to work effectively in a matrix environment</li>\n</ul>\nSanofi Inc. and its U.S. affiliates are Equal Opportunity and Affirmative Action employers committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race; color; creed; religion; national origin; age; ancestry; nationality; marital, domestic partnership or civil union status; sex, gender, gender identity or expression; affectional or sexual orientation; disability; veteran or military status or liability for military status; domestic violence victim status; atypical cellular or blood trait; genetic information (including the refusal to submit to genetic testing) or any other characteristic protected by law.\n<br><br>\n#GD-SA\n<br><br>\n#LI-SA\n<br><br>\nSanofi is dedicated to supporting people through their health challenges. We are a global biopharmaceutical company focused on human health. We prevent illness with vaccines, provide innovative treatments to fight pain and ease suffering. We stand by the few who suffer from rare diseases and the millions with long-term chronic conditions.\n<br><br>\nWith more than 100,000 people in 100 countries, Sanofi is transforming scientific innovation into healthcare solutions around the globe.\n<br><br>\nSanofi, Empowering Life"}