{"job title": "INTERVENTIONAL SYSTEMS SCIENTIST", "company": "Toshiba Medical Research Institute", "city state": "– Vernon HIlls, IL, US", "rating": "3.6", "job description": "<p><b>Canon Medical\nResearch USA, Inc. (CMRU) </b>is a multi-modality R&amp;D center that\ncreates the next generation medical imaging systems. For those who like to research new\ntechnologies and develop new ways of using them, Canon is a rewarding place\nto work owing to its focus on innovation as the lifeblood of new products. It’s the challenge of helping our customer do\nthings they couldn’t do before, and accomplish their current jobs with greater\nspeed, efficiency and confidence. Allow\nyourself time to explore the opportunities at CMRU to learn where you can join\nus in Imaging for a Healthier Future.</p>\n\n<p> </p>\n\n<p><b>SUMMARY</b></p>\n\n<p>Canon Medical Research Institute USA, Inc. (CMRU) has\nan immediate opening for Interventional Systems Scientist to participate in addressing\nproblems related to interventional imaging systems and x-ray image formation. </p>\n\n<p> </p>\n\n<p><b>RESPONSIBILITIES</b></p>\n\n<ul>\n <li>Develop and validate advanced data correction algorithms, such as\n beam hardening correction, scatter correction, artifact correction, etc.</li>\n <li>Evaluate and develop advanced reconstruction algorithms, including\n both analytical and statistical methods.</li>\n <li>Develop advanced image processing techniques to refine image\n quality.</li>\n <li>Evaluate x-ray system performance and perform quantitative image\n assessment.</li>\n <li>Collaborate with academic and industrial partners in various\n research projects.</li>\n <li>Contribute to corporate intellectual property portfolio.</li>\n</ul>\n\n<p> </p>\n\n<p><b>QUALIFICATIONS</b></p>\n\n<p> </p>\n\n<p><b><u>Education</u></b></p>\n\n<ul>\n <li>Ph.D. or equivalent in Physics, Electrical Engineering, Biomedical\n Engineering, Computer Science in Image and Signal processing or\n equivalent.<br>\n <br>\n </li>\n</ul>\n\n<p><b><u>Experience</u></b></p>\n\n<ul>\n <li>The ideal candidate will have minimum four (4) years related\n experience and/or training, preferably in a product development\n environment; academic or research settings will be considered as well.\n Competitive salary based on level of experience. </li>\n</ul>\n\n<p> </p>\n\n<p><b><u></u></b></p>\n\n<p><b><u>Competencies</u></b></p>\n\n<p> </p>\n\n<p>Language\nSkills </p>\n\n<ul>\n <li>Ability to read, analyze, and interpret common scientific and\n technical journals. </li>\n <li>Ability to write presentations and articles for publication that\n conform to prescribed style and format. </li>\n <li>Ability to effectively present information to supervisor, groups,\n and/or senior management.</li>\n</ul>\n\n<p> </p>\n\n<p>Mathematical/Physics\nSkills</p>\n\n<ul>\n <li>X-ray physics</li>\n <li>Understanding of the image formation process, including corrections\n and various techniques to manage noise and spatial resolution</li>\n <li>Understanding of tomographic reconstruction</li>\n <li>Basic understanding of machine learning is a plus</li>\n</ul>\n\n<p> </p>\n\n<p>Reasoning\nAbility</p>\n\n<ul>\n <li>Ability to define problems, collect data, analyze data, establish\n facts, and draw valid conclusions. </li>\n <li>Ability to interpret an extensive variety of technical instructions\n in mathematical or diagram form and deal with several abstract and\n concrete variables.</li>\n</ul>\n\n<p> </p>\n\n<p>Computer\nSkills</p>\n\n<ul>\n <li>Knowledge of Programming language (C/C++), Scientific Programming\n (Matlab), and software for creating documents, spreadsheets, and\n presentations.</li>\n</ul>\n\n<p> </p>\n\n<p><b><u>Other </u></b></p>\n\n<ul>\n <li>Some national and international travel may be required.</li>\n</ul>\n\n<p> </p>\n\n<p>Our facility is\nlocated in Vernon Hills, IL – a northern suburb of Chicago. </p>\n\n<p><br></p><p>CMRU prides\nitself on creating an atmosphere that is conducive to creativity and promotes\nan effective work/life balance. As a CMRU employee, you will enjoy a\ncompetitive compensation and benefits package. </p>\n\n<p> </p>\n\n<p>We are an equal opportunity employer (EOE). </p><p></p>"}