{"job title": "CT Reconstruction Scientist", "company": "Toshiba Medical Research Institute", "city state": "– Vernon Hills, Vernon HIlls, IL, US", "rating": "3.6", "job description": "<strong>TITLE: CT RECONSTRUCTION SCIENTIST</strong>\n<br><br>\n<em>Vernon Hills, IL</em>\n<br><br>\nhttps://www.research.us.medical.canon\n<br><br>\n<strong>Canon Medical Research USA, Inc. (CMRU)</strong> is a multi-modality R&amp;D center that creates the next generation medical imaging systems. For those who like to research new technologies and develop new ways of using them, Canon is a rewarding place to work owing to its focus on innovation as the lifeblood of new products. It’s the challenge of helping our customer do things they couldn’t do before, and accomplish their current jobs with greater speed, efficiency and confidence.\n<br><br>\nAllow yourself time to explore the opportunities at CMRU to learn where you can join us in Imaging for a healthier future.\n<br><br>\n<strong>SUMMARY</strong>\n<br><br>\n<strong>Canon Medical Research USA, Inc. (CMRU)</strong>has an immediate opening for a CT Reconstruction Scientist to participate in addressing problems related to CT imaging technologies and image formation.\n<br><br>\n<strong>RESPONSIBILITIES</strong>\n<ul>\n<li>Develop and validate advanced CT data correction algorithms, such as beam hardening correction, scatter correction, artifact correction, etc.</li><li>Develop advanced CT reconstruction algorithms, including both analytical and statistical methods.</li><li>Develop advanced image processing techniques to refine image quality.</li><li>Evaluate CT system performance and perform quantitative image assessment.</li><li>Collaborate with academic and industrial partners in various research projects.</li><li>Contribute to corporate intellectual property portfolio.</li> \n</ul>\n<strong>QUALIFICATIONS</strong>\n<br><br>\n<strong><em><u>Education</u></em></strong>\n<ul>\n<li>Ph.D. or equivalent in Electrical Engineering, Physics/Engineering Physics, Mathematics, Biomedical Engineering, Computer Science in Image and Signal processing or equivalent.</li> \n</ul>\n<strong><em><u>Experience</u></em></strong>\n<ul>\n<li>The ideal candidate will have minimum four (4) years related experience and/or training, preferably in a product development environment; academic or research settings will be considered as well.</li>\n</ul>\n<strong><em><u>Competencies</u></em></strong>\n<br><br>\nLanguage Skills\n<ul>\n<li>Ability to read, analyze, and interpret common scientific and technical journals.</li> <li>Ability to write presentations and articles for publication that conform to prescribed style and format.</li> <li>Ability to effectively present information to supervisor, groups, and/or senior management.</li> \n</ul>\nMathematics/Physics Skills\n<ul>\n<li>Ability to apply concepts from the following fields:</li><li>Mathematical analysis: differentiation and integration</li><li>Linear algebra</li><li>Numerical analysis</li><li>Statistics</li><li>Digital signal processing</li><li>Radiation physics</li> \n</ul>\nReasoning Ability\n<ul>\n<li>Ability to define problems, collect data, analyze data, establish facts, and draw valid conclusions.</li> <li>Ability to interpret an extensive variety of technical instructions in mathematical or diagram form and deal with several abstract and concrete variables.</li> \n</ul>\nComputer Skills\n<ul>\n<li>Knowledge of Programming language (C/C++), Scientific Programming (Matlab), and software for creating documents, spreadsheets, and presentations.</li> \n</ul>\n<strong><em><u>Other</u> </em></strong>\n<ul>\n<li>Some national and international travel may be required.</li> \n</ul>\nOur facility is located in Vernon Hills, a northern suburb of Chicago.\n<br><br>\nCMRU prides itself on creating an atmosphere that is conducive to creativity and promotes an effective work/life balance. As a CMRU employee, you will enjoy a competitive compensation and benefits package.\n<br><br>\nWe are an equal opportunity employer (EOE)."}