{"job title": "Molecular Research Scientist View", "company": "University of Toledo", "city state": "– Toledo, OH", "rating": "4.1", "job description": "Coordinate general laboratory activities and lead specimen/data harmonization efforts between department of pathology and cancer care team partners. Take lead role in implementing/maintenance/training clinical next generation sequencing efforts to support Molecular Registry of tumor genome data for Northwest Ohio. Works with lead molecular technologist to organize and perform experiments designed to develop, validate and perform clinical and research molecular assays. Infrequently, will be expected to perform general clinical molecular testing/resulting on an as needed basis.\n<br><br>\n<ul>\n<li>Masters, or PhD degree in biology, biochemistry, molecular biology, pathology, physiology, neuroscience, immunology, pharmacology, microbiology, cell biology, genetics, or bioengineering (molecular biology, pathology, or genetics preferred) required.</li>\n<li>At least 2 year (3 or more years preferred) basic science wet-lab research experience (with a significant component utilizing nucleic acid molecular techniques) designing, developing, and troubleshooting assays is required. Some informatics training or work-experience with emphasis on next-generation sequencing data analysis is required.</li>\n<br><br>\n</ul>\n\nInternal &amp; External\n<br><br>\n<strong> 09-04-2018</strong>\n<br><br>\n<strong> 09-10-2018</strong>\n<br><br>\n<strong> 40</strong>\n<br><br>\n<strong> 0800</strong>\n<br><br>\n<strong> 1700</strong>\n<br><br>\n<strong> 0800</strong>\n<br><br>\n<strong> 1700</strong>\n<br><br>\n<strong> N/A</strong>\n<br><br>\n<strong> N/A</strong>\n<br><br>\n<strong> N/A</strong>\n<br><br>\n<strong> N/A</strong>\n<br><br>\n<strong> N/A</strong>\n<br><br>\nNon-Union/BU Exempt\n<br><br>\n<strong> $45,000</strong>\n<br><br>\nResume\n<br>\nCover Letter\n<br>\nList of at least three references\n<br><br>\nThe University of Toledo is an equal access, equal opportunity, affirmative action employer and educator."}