{"job title": "Senior Threat Data Engineer", "company": "Carbon Black", "city state": "– Boulder, CO, United States", "rating": "4.4", "job description": "We’re looking for a Senior Threat Data Engineer who will contribute to the design, development and validation of our ETL processes and develop APIs and applications to expose that data to numerous stakeholders within our engineering organization. You’ll join a talented team of developers using a wide variety of new and cool technologies to solve Large scale distributed data related problems with a capital “L”. You’ll build solutions and enable features that our customers are clamoring for, and that may help our customers prevent the next front page security breach. You’ll make a difference and help us win a huge market.\n<br><br>\n<strong>What You’ll Do</strong>\n<ul>\n<li>Ensure data quality and availability for ongoing analytics projects through stable ETL processes</li><li>Build out resilient and scalable components for our stream processing machinery</li><li>Design, implement and validate the monitoring and alerting infrastructure as necessary to ensure uninterrupted and performant data flow</li><li>Develop large scale, performant, RESTful APIs and Streaming applications to expose and provide access to large and disparate data sources</li><li>Deliver high quality clean code along with the rest of the dev team</li><li>Analyze performance of services and optimize / refactor as needed</li><li>Investigate functional problems, finding and fixing defects as needed</li><li>Lead the development of new features, collaborating with other senior engineers and mentoring junior engineers</li><li>Design proof of concepts or working prototypes for software services</li><li>Ensure that software designs follow best-practices and architectural guidelines</li><li>Separate and secure country specific data across national boundaries utilizing AWS regions</li>\n</ul>\n<strong>What You’ll Bring</strong>\n<ul>\n<li>B.S. in Computer Science or equivalent experience</li><li>Experience with big data and machine learning is a plus</li><li>Demonstrated expertise programming in Python preferred, Go and/or Scala a plus</li> <li>Experience writing applications for Spark/Hadoop and AWS environments</li><li>Demonstrated knowledge of message queueing and stream processing.</li><li>Advanced knowledge and a demonstrated ability to work with structured and unstructured datasets across a variety of databases.</li><li>Demonstrated aptitude in quickly mastering new languages and technologies</li><li>Excellent communication and interpersonal skills</li><li>Excellent problem solving and troubleshooting skills</li><li>A devops mentality and an eagerness to take responsibility for portions of the ETL / stream processing for our backend analytic environment from end-to-end</li><li>Experience building and maintaining CI/CD pipelines</li><li>Experience with AWS EMR, Kinesis, s3 a big plus</li><li>Security experience a big plus</li>\n</ul>\n<strong>Why you should join us</strong>\n<br><br>\nCarbon Black is a leading provider of next-generation endpoint security, leveraging breakthrough prevention technology to instantly see and stop cyberattacks before they execute. With more than 13 million endpoints under management, and more than 4000 customers—including 30 of the Fortune 100—the opportunities are massive and exciting. With 1000+ employees, offices across the world, and the best-of-the best tools for collaboration from anywhere, now is an ideal time to become part of the Cb Team. See where you fit best at Lifeatcb.carbonblack.com.\n<br><br>\n<em>Carbon Black, Inc. is an EEO/AA employer. Carbon Black is an inclusive employer that believes in workplace equality, supports diversity, creates a welcoming environment, and respects the unique qualities each individual brings to the company.</em>\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}