{"job title": "Data Engineer", "company": "Chan Zuckerberg Initiative", "city state": "– Palo Alto, CA", "rating": "4.0", "job description": "<div>The Chan Zuckerberg Initiative is dedicated to advancing human potential and promoting equal opportunity through technology, grantmaking, impact investing, policy, and advocacy work. We look for bold ideas regardless of structure and stage and help them scale by pairing world-class engineers with subject matter experts to build tools that accelerate the pace of social progress.</div>\n<br><strong>WHAT WE BELIEVE</strong>\n<br><br>\nWe engage directly in the communities we serve because no one understands how to address our society's challenges better than those who live them everyday. These partners help us identify problems and opportunities, learn fast and iterate toward our audacious goals for the next century. We strive to be humble, empathetic and scrappy life-long learners who work collaboratively to develop community-centered solutions.\n<br><br>\nWe believe that high-performing teams include people from different backgrounds and experiences who can challenge each other's assumptions with fresh perspectives. To that end, the Chan Zuckerberg Initiative actively seeks a diverse pool of applicants including those from historically marginalized groups women, people with disabilities, people of color, formerly incarcerated people, people who are lesbian, gay, bisexual, transgender, and/or gender nonconforming, first and second generation immigrants, and people from low-income families.\n<br><br>\n<strong>THE ROLE</strong>\n<br><br>\nWe want to provide every student, and every teacher, the opportunity to reach his or her full potential. The Chan Zuckerberg Initiative supports and develops personalized learning experiences that are focused on and led by the learner - meeting them where they are cognitively, physically, socially and emotionally. We're looking for engineers to help bring a new personalized learning platform to the globe's generation of students and help advance the potential of humanity.<br>\n<div>\nRESPONSIBILITIES\n\n\n<ul>\n<li>Interface with engineers, product managers and data scientists to understand data needs</li>\n<li>Improve data usability and data quality in our data warehouse</li>\n<li>Launch new ETL (extract, transform, load) processes in production</li>\n<li>Identify impactful improvements to our data warehouse infrastructure</li>\n</ul>\n\n</div><br>\n\n<div>\nQUALIFICATIONS\n\n\n<ul>\n<li>1+ year experience in Software Engineering or Data Engineering</li>\n<li>Expertise writing efficient and optimized SQL</li>\n<li>Experience with dimensional data modeling and schema design in a database or data warehouse</li>\n<li>Expertise with scripting languages such as Python</li>\n</ul>\n\n</div><br>\n\n<div>\nBONUS POINTS\n\n\n<ul>\n<li>Experience working with large data sets</li>\n<li>Experience working with cloud-based data warehouses</li>\n</ul>\n\n</div>\n<br><strong>ABOUT THE CHAN ZUCKERBERG INITIATIVE</strong>\n<br><br>\nThe Chan Zuckerberg Initiative was launched in December 2015 by Mark Zuckerberg, founder and CEO of Facebook and Priscilla Chan, a pediatrician and founder and CEO of The Primary School in East Palo Alto. The Chan Zuckerberg Initiative is a new kind of philanthropic organization dedicated to advancing human potential and promoting equal opportunity through world-class engineering, grantmaking, impact investing, policy, and advocacy work. Initial areas of focus include supporting science through basic biomedical research and education through personalized learning. CZI is also exploring ways to build stronger, more equitable communities through affordable housing and criminal justice reform. To learn more, visit our Facebook page."}