{"job title": "Encounter Data Analyst", "company": "Clover Health", "city state": "– San Francisco, CA", "rating": "3.8", "job description": "<em>Clover is reinventing health insurance by working to keep people healthier.</em>\n<br><br>\nThe Encounter Submissions team is responsible for business-critical data submissions to the Center for Medicare and Medicaid Services, as well as error management around submissions. We are deeply cross-functional and combine knowledge of data pipelines and data analysis with operational expertise and up-to-date compliance rules. We work closely with claims and medical records operations, engineering and product (IT), compliance, and finance and actuary.\n<br><br>\nAs an Encounter Data Analyst, you will be responsible for ensuring files are submitted compliantly and timely; root cause analysis to reduce errors over time through cross-functional workflow optimization; monitoring error resolution; vendor management; and staying up to date on current compliance guidance and serving as an in-house resource and subject matter expert on the encounter submissions process.\n<br><br>\n<strong>As an Encounter Data Analyst, you will:</strong>\n\n<ul>\n<li>Ensure timely, complete, and compliant submission of all encounter data files to CMS.</li>\n<li>Diligently and reliably monitor return files for completeness.</li>\n<li>Correct rejected encounters or route rejected encounters to teams throughout the organization, monitor progress, and work with managers to ensure completion of work within existing queues.</li>\n<li>Analyze rejected encounter trends and conduct root cause analyses, then work closely with upstream teams to proactively reduce error volume.</li>\n<li>Where process or system changes are necessary, develop short and/or long-term resolutions by identifying root causes using data files, provider files, diagnosis files, etc.</li>\n<li>Maintain relationships with claims, medical records, and other departments and work to resolve upstream causes of high-impact errors.</li>\n<li>Manage SAS vendor.</li>\n<li>Stay up to date on current CMS guidance, and keep policies and procedures up to date (in collaboration with Clover's compliance team).</li>\n</ul>\n<strong>You will love this job if:</strong>\n\n<ul>\n<li>You enjoy digging deeply and thinking critically about <strong>data.</strong> You also have experience looking for and communicating outliers or unexpected data trends to management or supporting teams.</li>\n<li>You are <strong>passionate</strong> about bringing a cross-functional group along with you and being a patient, positive, and collaborative thought partner for others in the organization not as knowledgeable about your specialized area.</li>\n<li>You can <strong>distill your needs</strong> down to actionable improvements that can be made in Clover's procedures. And, you can do it while keeping Clover compliant to fiercely protect the privacy and rights of our customers.</li>\n<li>You are <strong>nimble</strong>, and comfortable working in a constantly evolving environment. You embrace ambiguity and speed and translate them into projects to maintain a bias towards action.</li>\n<li>You have demonstrated long-term responsibility for a <strong>business-critical</strong> function and have a track record of consistent and successful delivery in that function.</li>\n<li>You are able to relate the <strong>inputs</strong> and <strong>outputs</strong> of systems or processes to their overall business value and impact.</li>\n<li>You are interested in growing into a <strong>management</strong> role.</li>\n</ul>\n<strong>You should get in touch if:</strong>\n\n<ul>\n<li>You have 3-5 years experience with encounter data submission errors at a Medicare Advantage organization.</li>\n<li>You are a clear and concise communicator and know how to tailor your message to your audience.</li>\n<li>You have successfully worked closely with teams outside of your own.</li>\n<li>You have experience doing data analysis in Excel or SQL, with interest in expanding your SQL skills.</li>\n</ul>\n<em>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. We are an E-Verify company.</em>\n<br><br>\n<strong>About Clover:</strong> We are reinventing health insurance by combining the power of data with human empathy to keep our members healthier. We believe the healthcare system is broken, so we've created custom software and analytics to empower our clinical staff to intervene and provide personalized care to the people who need it most.\n<br>\nWe always put our members first, and our success as a team is measured by the quality of life of the people we serve. Those who work at Clover are passionate and mission-driven individuals with diverse areas of expertise, working together to solve the most complicated problem in the world: healthcare.<br><br>\n<br><br>"}