{"job title": "Data Scientist", "company": "Fearless", "city state": "– Baltimore, MD", "rating": "5.0", "job description": "Fearless is looking for a Data Scientist to analyze large amounts of raw information to find patterns that will help one of our premier clients. We will rely on you to build data products to extract valuable business insights.\n<br><br>\n<strong>The Mission:</strong>\n<br><br>\nIn this role, you should be highly analytical with a knack for analysis, math and statistics. Critical thinking and problem-solving skills are essential for interpreting data. We also want to see a passion for machine-learning and research.\n<br><br>\nYour goal will be to help analyze trends to make better decisions.\n<br><br>\n<strong>What you'll be doing:</strong>\n\n<ul>\n<li>Apply data mining techniques and procedures</li>\n<li>Use Power BI to generate reports. This includes writing code in python, javascript, or ruby to extract data from mission systems.</li>\n<li>Do statistical analysis and build high quality prediction systems integrated with products.</li>\n</ul>\n<strong><u>What we are looking for:</u></strong>\n\n<ul>\n<li>Establish a strategy and perform analysis of data to satisfy the following client requirements:</li>\n<li>Establish and execute a data archiving (backup) strategy for legacy system data</li>\n<li>Develop comprehensive data exports that are system agnostic</li>\n<li>Establish strategy that addresses reporting needs for the Program that are aligned with the client Program technological capabilities</li>\n<li>Save and export files to various forms</li>\n<li>Deliverable(s) are professionally prepared (free of clerical errors)</li>\n<li>Meets acceptable quality criteria</li>\n<li>Meets all specifications and requirements</li>\n<li>Use Power BI as the tool to generate the reports needed by the client</li>\n</ul>\n<strong>We are excited about you because you can:</strong>\n\n<ul>\n<li>Be a good coach</li>\n<li>Communicate and listen well</li>\n<li>Empower the team without micromanaging</li>\n<li>Appreciate and respect different values and points of view</li>\n<li>Have empathy toward and be supportive of one's colleagues</li>\n<li>Be a good critical thinker and problem solver</li> \n\n<li>Be able to make connections across complex ideas.</li>\n<li>Possess intellectual humility - be able to make mistakes and learn from them</li>\n<li>Challenge everything - push yourself and others by asking how we can be better in all aspects of our work</li>\n<li>Collaborate in a culture that promotes passion in technology</li>\n</ul>\n<strong>Why Fearless Solutions?</strong>\n<br><br>\nGreat people are the foundation of any great company. To attract and retain great people, we offer fulfilling work that stays in balance with the rest of life. Because everyone has different needs, desires, and goals, our benefits offer the choices and flexibility people need to live well and succeed. Here are a few benefit highlights:\n\n<ul>\n<li>Individual yearly tech budget</li>\n<li>Birthday off-we don't believe in working on your birthday</li>\n<li>Continuing education assistance</li>\n<li>Professional development allowance</li>\n<li>We cover 100% of employee-only premium for HMO medical/PPO HSA</li>\n<li>Free downtown parking</li>\n<li>Highly competitive 401(k) plan, with employer contributions</li>\n<li>Generous paid time-off plan: 15 days PTO plus 10 Federal Holidays plus 5 sick days-YES, 30 days total!</li>\n<li>All the purple swag you can wear!</li>\n</ul>\n<strong>About Fearless:</strong>\n<br><br>\nFearless is a rapidly growing software engineering company headquartered in the heart of Baltimore's Inner Harbor. We deliver innovative, leading-edge products, solutions, and services to customers worldwide. At Fearless, we are always learning, exploring, and looking for new ways to put our knowledge and experience to work. We are dedicated to advancing the discipline of software engineering through imagination, technical excellence, and unparalleled passion for our work. Fearless is also a pretty good place to work.\n<br><br>\nFearless is committed to breaking the mold of traditional employers to create a truly enriching professional environment, and a place where all employees can find the correct work/life balance. EOE/M/F/D/V."}