{"job title": "Quantitative Analyst", "company": "First Republic Bank", "city state": "– US-CA-San Francisco", "rating": "3.7", "job description": "<div><div>\n<div>The bank seeks a Quantitative Analyst with excellent R and SQL programming skills to join the Finance team. The ideal candidate should have at least 2 years of work experience in statistical modeling (e.g., linear and logistic regression) and have a strong desire to describe methodologies, insights, and recommendations to business stakeholders and senior management.</div>\n</div>\n</div>\n\n<br>Responsibilities<br>\n\n<div>\n<div>\n<div>We recognize that our competitive advantage starts with our people and our culture. At First Republic, we work hard and move quickly as a very coordinated team. If you are looking for an opportunity to grow and contribute in a fun, fast-paced environment, First Republic is the place for you. We have exceptional people focused on providing extraordinary service.\n<ul>\n<li>Develop statistical credit loss models using a large relational database of residential mortgages.</li><li>Apply statistical and programming knowledge, using R and SQL, for the purpose of credit loss forecasting: including writing code, estimating model parameters, and working with the model validation team.</li><li>Summarize insights and present key findings to business stakeholders and senior management.</li><li>Collaborate with programmers or analysts in Git and GitHub environments.</li><li>Test models for prediction accuracy, statistical soundness, and sensitivity to risk drivers.</li><li>Fully document the model development process, model tests performed, model assumptions, and processes for controls and governance.</li><li>Respond to model scrutiny and inquiries from both internal and external validators as well as federal regulators to ensure conceptual soundness, prediction accuracy, and robustness.</li><li>Perform regression diagnostics such as stationarity, residual correlation, heteroscedasticity, normality of residuals, multi-collinearity, highly influential observations, and overfitting.</li><li>Translate business problems into statistical problems, and develop statistical models to support business needs.</li><li>Assist in data collection, extraction, scrubbing, validity and sanity checks, transformation, and validation for a variety of projects that use data.</li><li>Perform other ad-hoc data analysis including business intelligence and reporting.</li><li>Proactively identify opportunities to improve processes and to adopt leading industry practices.</li></ul></div>\n</div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div>The candidate should have excellent programming skills in R and SQL. The person will develop credit loss models to meet the FASB ASU 2016-13 accounting standards, which is aka Current Expected Credit Loss (CECL) and fundamentally changes the way U.S. financial institutions calculate and hold allowance for loan and lease losses (ALLL). The candidate will be an integral member of the Finance department. Qualifications for the position include:\n<ul>\n<li>Graduate degree in analytics, computer science, statistics, applied math, or econometrics</li><li>Strong desire to describe methodologies, insights, and recommendations to business stakeholders and senior management</li><li>Two (2) years' experience: (a) working within a financial services-related institution creating credit risk models using a large database of loans; (b) applying statistical and programming knowledge using R and SQL; and (c) working with large relational databases, writing queries and stored procedures using T-SQL; and</li><li>One (1) year experience collaborating with other programmers or analysts in Git and GitHub environments. Experience can be concurrent.</li><li>Candidate must be team-oriented, able to juggle multiple tasks, and comfortably work and deliver high-quality results under tight deadlines</li>\n</ul>\nMental/Physical Requirements:\n<ul>\n<li>Vision must be sufficient to read data reports, manuals and computer screens.</li><li>Hearing must be sufficient to understand a conversation at a normal volume, including telephone calls and in person.</li><li>Speech must be coherent to clearly convey or exchange information, including the giving and receiving of assignments and/or directions.</li><li>Position involves sitting most of the time, but may involve walking or standing for brief periods of time.</li><li>Must be able to travel in a limited capacity.</li></ul></div>\n</div>\n</div>\n<br>"}