{"job title": "Data Architect", "company": "Metromile", "city state": "– San Francisco, CA", "rating": "3.9", "job description": "<strong>About us</strong>\n<br><br>\nMetromile is a start-up that is disrupting the $220 billion car insurance market by offering an entirely new model where the monthly bill is based on miles driven, paired with a smart driving app. Our product marries engineering and data science to deliver mobile technology, automotive telematics, and data-driven applications to make a car's data accessible and useful to modern drivers, including street sweeping alerts, trip stats, decoded check-engine lights, and car location. We aim to make car ownership as simple and affordable as it can be.\n<br><br>\nYou could think of us as the David to the auto insurance industry's Goliath. Buckle up and get ready to drive with Metromile.\n<br><br>\n<strong>We're proud to say that Metromile has been named on Glassdoor's Best Place to Work in their 2018 Employees' Choice Awards list for the second year in a row!</strong>\n<br><br>\n<strong>About the role</strong>\n<br><br>\nApplying for car insurance involves answering a lot of confusing questions, so our team is working tirelessly to implement a shorter, cleaner, more user-friendly workflow. This new workflow will have a huge impact on our conversion rate, so you would have real impact on both our product and our bottom line.\n<br><br>\nAs Data Architect, you'll fulfill the role of both player and coach. You'll own the data engineering team, scaling and developing it as the company grows.<br><br><strong>You</strong> <strong>will</strong>\n\n\n<ul>\n<li>Oversee our data engineers, providing technical oversight and mentoring</li>\n<li>Help recruit for and grow our current team</li>\n<li>Develop and promote data architecture best practices</li>\n<li>Work closely with the larger engineering team to provide production ready systems</li>\n<li>Lead the build out of a highly adaptable data architecture allowing our analysts and data scientists to build and iterate on new data sets quickly while optimizing our BI toolset to allow self-serve by business stakeholders</li>\n<li>Collaborate closely with data product management to understand the organization's data needs and build out meaningful data assets and tooling</li>\n</ul>\n\n<strong>About</strong> <strong>you</strong>\n\n\n<ul>\n<li>5-7+ years experience in data modeling, systems analysis, and design</li>\n<li>3+ years experience in tech leadership or team management</li>\n<li>Expert in developing data architecture design patterns, warehousing, modeling and analysis</li>\n<li>Experience with Amazon data toolset including Athena, Redshift, Lambda, Kinesis etc</li>\n<li>Experience in high-level programming languages such as Java, Scala or python</li>\n<li>Highly collaborative and passionate about mentorship and leadership</li>\n</ul>\n<strong>What's in it for you</strong>\n\n<ul>\n<li>Competitive salary plus equity</li>\n<li>Benefits (health, dental, vision)</li>\n<li>Transportation and gym benefits</li>\n<li>Catered lunches and a fully stocked kitchen</li>\n<li>In office happy hour every Friday</li>\n<li>Monthly social events (trivia nights, skeeball, ropes course, etc)</li>\n<li>Mac equipment and ergonomic workstation, customized to your specs</li>\n</ul>"}