{"job title": "Data Analyst", "company": "Starry, Inc.", "city state": "– New York, NY", "rating": "4.8", "job description": "Starry is seeking a Data Analyst to join the growing Data &amp; Analytics team. You will directly support various teams around the organization to analyze large data sets and provide reporting and insights for improved decision-making.\n<br><br>\nOur ideal candidate must be comfortable querying large data sets and have a proven track record of delivering actionable business insights to stakeholders.\n<br><br>\n<strong>What You’ll Do:</strong>\n<ul>\n <li>Analyze various data sets to optimize the business across marketing, operations, sales and engineering - providing recommendations and insights to key decision makers.</li> <li>Develop reports and dashboards to help operators stay nimble and make strategy recommendations to inform major decisions.</li> <li>Work with cross-functional teams to champion a data-driven culture that rapidly tests, measures and iterates. This might include testing new marketing channels and website design changes.</li> <li>Create output that tells the story behind the data to non-technical team members so they can execute more effectively.</li>\n</ul>\n<strong>Experience &amp; Skills Required:</strong>\n<ul>\n <li>2-3 years of experience as a Data Analyst, Data Scientist or Management Consultant, preferably at a company with a high volume of complex data</li> <li>Ability to write complex SQL queries and expert in Excel</li> <li>Experience with visualization tools (e.g. Looker, Tableau) and scripting languages (e.g. Python, R)</li> <li>Working knowledge of statistics a plus</li> <li>Highly motivated self-starter</li> <li>Flexible, adaptable, able to work in an entrepreneurial environment</li> <li>Real passion for Starry’s business</li>\n</ul>\nHappy Interneting!\n<br><br>\nQualified Applicants must be legally authorized for employment in the United States. Qualified Applicants will not require employer sponsored work authorization now or in the future for employment in the United States.\n<br><br>\nDisclaimer: This job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee.\n<br><br>\nStarry, Inc. is an equal employment opportunity employer and does not discriminate against any applicant because of race, creed, color, age, national origin, ancestry, religion, gender, sexual orientation, disability, genetic information, veteran status, military status, application for military service or any other class protected by state or federal law.\n<br><br>\nAugust 2018"}