{"job title": "Technical Applications Scientist II", "company": "Thermo Fisher Scientific", "city state": "– South San Francisco, CA", "rating": "3.3", "job description": "Job Description<br><br>When youre part of the team at Thermo Fisher Scientific, youll do important work, like helping customers in finding cures for cancer, protecting the environment or making sure our food is safe. Your work will have real-world impact, and youll be supported in achieving your career goals.\n<br><br>\n<strong>Location/Division Specific Information</strong>\n<br><br>\nThe Technical Application Specialist II is part of the Life Sciences Solutions Group (LSG) which is one of six groups within Thermo Fisher Scientific and is an important part of the companys total value proposition. With an innovative and broad life sciences portfolio, a strong presence at bench, best-in-class web and e-commerce channels, industry-leading on-site supply center coverage and one of the most technically experienced sales and support teams, LSG brings incredible core strength to the broader company.\n<br><br>\n<strong>How will you make an impact?</strong>\n<br><br>\nThe Technical Applications Scientist is responsible for providing remote pre and post sales technical support of Thermo Fisher Scientific products to customers and field personnel, as well as relaying customer feedback to the organization.\n<br><br>\n<strong>What will you do?</strong>\n<ul>\n<li>Provide technical support for Applied Biosystems CE and Ion Torrent NGS product lines and services by answering customer technical inquiries. Inquiries may be received via telephone, email or web chat.</li><li>Provide customer support on technical issues by utilizing all available resources, and escalate issues or problems when warranted.</li> <li>Participate in frequent training on products and continuing education on new applications and technologies to remain at the cutting edge of scientific knowledge.</li> <li>Accurately record pertinent information from customer contacts in Customer Relationship Management system.</li> <li>Summarize trends and technology as technical tips, FAQs and troubleshooting guides.</li> <li>Recommend changes to knowledge databases, website, and other company-managed databases of technical information.</li> <li>Present technical updates to colleagues and contribute to department meetings.</li> <li>May present technical and product information at trade shows and in customer field visits.</li> <li>Participate in additional special team or individual projects.</li> <li>May be required to perform other related duties as opportunities arise.</li> <li>The Technical Applications Scientist has contact with internal and external customers on a daily basis. It requires the capability to exercise judgment within broadly defined department procedures and policies, to evaluate individual situations and data, and select appropriate criteria and methods for solving complex customer issues.</li> <li>May be asked to determine new methods and procedures on special assignments and may be asked to provide guidance to other lower-level personnel.</li> <li>Over time, expected to perform routine work independently with only general direction given for new assignments.</li> <li>Job encounters typical recurring work situations, with occasional variations from the norm involving a moderate to high degree of complexity where decisions are made within policy constraints.</li><li>Occasionally, situations may warrant action outside of department guidelines, in which case representative is encouraged to share solution with Team Leader prior to action.</li> <li>May be asked to serve on cross-functional teams to provide expertise and to represent customer perspective and needs.</li> \n</ul>\n<strong>How will you get here?</strong>\n<br><br>\n<strong>Education</strong>\n<br><br>\nRequires a B.S., B.A. or M.S. in molecular biology or similar field.\n<br><br>\nA PhD. or a PhD. with post-doctoral experience preferred\n<br><br>\n<strong>Experience</strong>\n<ul>\n<li>3+ years of laboratory experience in molecular biology techniques required. Experience in Sanger Sequencing, Next Generation Sequencing, and/or fragment analysis is desired.</li><li>Prior experience in customer service a plus</li><li>Experience in an applied science area (i.e. food and animal health, clinical research, diagnostics, etc) preferred</li>\n</ul>\n<strong>Knowledge, Skills, Abilities</strong>\n<ul>\n<li>Proven technical writing capabilities</li><li>Proven ability to quickly learn large amounts of new, complex technical information</li><li>Demonstrated ability to effectively communicate, both orally and in writing, to customers and colleagues</li><li>Ability to manage multiple priorities</li><li>Problem-solving ability</li><li>Computer literacy, including spreadsheet, database, word processing and Internet applications</li>\n</ul>\nAt Thermo Fisher Scientific, each one of our 65,000 extraordinary minds has a unique story to tell. Join us and contribute to our singular missionenabling our customers to make the world healthier, cleaner and safer.\n<br><br>\nApply today! http://jobs.thermofisher.com<br><br>If you are an individual with a disability who requires reasonable accommodation to complete any part of our application process, click here for further assistance.<br><br>Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status."}