{"job title": "Principal Quality Engineer", "company": "Bausch Health", "city state": "– Bridgewater, NJ", "rating": "2.3", "job description": "Valeant Pharmaceuticals International, Inc. is a diverse pharmaceutical company that is committed to focusing on our key stakeholders while delivering consistently high performance. Our values provide the overall direction for our company, and provide us with the tools necessary to rise to any challenge by leveraging our collective hard work and effort along with our unwavering competitive spirit. These values help us set goals based on our organization’s potential and what we hope it will become.\n<br><br>\nProvide quality and technical guidance for pharmaceutical and medical device products undergoing tech transfer from site to site, and/or participate in significant investigations where product non-conformances are complex. Direct modern documentation packages for new validations and control and specification limits that are representative of shelf-life limiting measures and critical-to-quality attributes. Apply statistical process control and lean six-sigma practices to validation strategies and product knowledge.\n<ul>\n<li>Ensure project plans adequately address GMP and quality standards.</li> <li>Develop strategy for GMP activities at CMO sites to ensure compliant delivery of product and data.</li><li>Review/approve documents from a quality perspective to ensure materials and actions meet current compliance expectations. Documents may include validation strategy, method transfer protocols, specification rationale documents, etc.</li><li>Facilitate product readiness and launch activities with the commercial quality team, supply chain, commercial, etc.</li><li>Using tools such as Design of Experiments (DOE) and statistical evaluations of data, develop a strong portfolio of knowledge for product risk evaluations.</li><li>Act as the single point of contact for quality and perform quality project management activities.</li><li>Develop product trend analysis, in conjunction with other functional partners, to increase our ability to respond to adverse signals for commercial products.</li><li>Key Relationships: Regulatory Affairs, Technical Operations, Supply Chain, Commercial Quality, site quality leadership, and external manufacturing sites.</li></ul>\n\n<ul>\n<li>Bachelor’s degree BS in scientific discipline (Chemistry, Biology, Microbiology or related field) with 10 years relevant experience, graduate degree plus 5 years relevant experience.</li><li>Experience in a pharmaceutical manufacturing environment, knowledge of GMP regulations and guidelines.</li> <li>Manufacturing process validation experience required. Statistical analysis, Minitab knowledge a plus (QE tools).</li>\n</ul>\nJob Applicants should be aware of job offer scams perpetrated through the use of the Internet and social media platforms.\n<br><br>\nTo learn more please read Valeant’s Job Offer Fraud Statement.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}