{"job title": "Data Engineer", "company": "Booz Allen Hamilton Inc.", "city state": "– McLean, VA", "rating": "3.7", "job description": "<strong>Job Number: R0035100</strong>\n<br><br>\nData Engineer, Mid<br><br>Key Role:\n<br><br>\nApply expertise in quantitative analysis, data mining, and the presentation of data to see beyond the numbers and comprehend how users interact with core and business products. Analyze data and translate those into recommendations when working with various teams across the organization. Define all data used by the existing systems and establish gold standard data definitions for data shared between the applications. Work with data engineers to help define the DMI data sharing framework architecture.\n<br><br>\nBasic Qualifications:\n<br><br>\n-1+ years of experience with performing data analysis, including gathering, interpreting, concluding, and presenting findings\n<br><br>\n-Experience with performing data quality and accuracy assessments\n<br><br>\n-Experience with an analytical scripting language, including R or Python\n<br><br>\n-Knowledge of SQL and databases\n<br><br>\n-Ability to learn technical concepts quickly and communicate with multiple functional groups\n<br><br>\n-Ability to obtain a security clearance\n<br><br>\n-BS degree in Mathematics, Statistics, Economics, CS, Engineering, or Business\n<br><br>\nAdditional Qualifications:\n<br><br>\n-Experience with data governance\n<br><br>\n-Possession of excellent analytical and problem-solving skills\n<br><br>\n-Possession of excellent oral and written communication skills\n<br><br>\n-MA or MS degree\n<br><br>\nClearance:\n<br><br>\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information.\n<br><br>\nWere an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change.<br><br>SIG2017\n<br><br>"}