{"job title": "Software Engineer III", "company": "Envision RX", "city state": "– Twinsburg, OH", "rating": "2.8", "job description": "<div><strong><u>Software Engineer </u></strong><strong><u>III</u></strong></div><div>The Software Engineer III is responsible for supporting the application development functions of the company in accordance with the policies and practices of EnvisionRxOptions. This position has no direct reports.</div><div><br></div><div><strong> </strong><strong>ESSENTIAL </strong><strong>DUTIES AND RESPONSIBILIT</strong><strong>I</strong><strong>ES:</strong> </div><ul><li>Design, develop, maintain and support web applications, web services, APIs, and software modules in support of company operations </li><li>Lead design and development of complex software components</li><li>Lead design and development of advanced structured query language (SQL) queries and stored procedures to perform complex database tasks</li><li>Conduct and participate in peer reviews for designs, code, and other work products</li><li>Perform software quality assurance, including all types of testing of database designs to confirm functionality and performance</li><li>Advise management on product and process improvement</li><li>Analyze application performance and make improvement recommendations</li><li>Prepare test data and analyze program performance during testing</li><li>Respond to and resolve severity level one production issues in a timely manner</li><li>Participate in analysis of information systems problems and the development of applicable solutions</li><li>Provide coaching, support, and training for less experienced developers</li><li>Other duties as assigned</li></ul><div><strong>REQUIREMENTS:</strong></div><ul><li>Bachelor’s degree in computer science, information systems or related field; proven industry experience will be acceptable in lieu of degree</li><li>A knowledgeable individual with appropriate industry experience, preferably in the healthcare, insurance or PBM industry</li><li>Minimum of 7 years of experience in application development and/or tech lead capacity </li><li>High proficient development skills in the following: C++, C#, ASP, ASP.Net, HTML, JavaScript, Visual Studio, and SQL</li><li>Thorough knowledge of database technology, preferably SQL Server or Oracle</li><li>Strong object-oriented design and development skills, thorough understanding of design patterns and other object-oriented design best practices</li><li>Demonstrated experience with automated unit testing practices</li><li>Comprehensive understanding of agile software development methodology and industry best practices</li><li>Deep understanding of fundamental software engineering and computer science principles: object-oriented design, structured design, databases, algorithms, data structures, usability, refactoring, debugging, and configuration management</li><li>Demonstrated aptitude for learning new technologies</li><li>An intelligent and articulate individual who can relate to people at all levels of an organization and possesses excellent communication skills</li><li>Effective verbal and written communication skills</li><li>Strong data analysis and presentation skills</li><li>Demonstrated ability to independently identify, research, troubleshoot, and resolve issues</li><li>Sound technical skills, analytical ability, good judgment, and strong operational focus</li><li>Demonstrated ability to coach others, explain complex concepts in a clear way, and provide technical leadership</li><li>A well organized, detail-oriented individual who is able to work with peers in a team environment with appropriate guidance and supervision</li><li>Capability to efficiently complete tasks in a fast paced environment</li><li>Demonstrated ability to manage multiple priorities and deadlines</li><li>Ability to work extended hours, weekends, and holidays pursuant with company or industry demands</li><li>Proficient in Microsoft Office and industry related software programs </li></ul><div><strong>WORK ENVIRONMENT:</strong></div><div>Includes a typical office environment, with minimal exposure to excessive noise or adverse environmental issues. </div><div><br></div><div><strong>PHYSICAL REQUIREMENTS:</strong></div><div>Ability to sit for prolonged periods of time. </div><div><br></div><div>Pre-employment drug screening and background checks are required. The company offers a competitive salary and benefits package. EOE. All qualified applicants receive consideration for employment without regard to race, color, religion, sex, national origin, disability or veteran status.<br>EnvisionRxOptions is committed to maintaining a productive, drug-free workplace that keeps employees and customers safe from harm.</div><div> </div><div><br></div>"}