{"job title": "Software Quality Engineer III", "company": "Envision RX", "city state": "– Twinsburg, OH", "rating": "2.8", "job description": "<div><strong>Software Quality Engineer III</strong></div><br>\n<div>The Software Quality Engineer III is responsible for verifying that the software being released is of the utmost quality. This position has no direct reports.</div><div><strong>ESSENTIAL</strong> <strong>DUTIES AND RESPONSIBILIT</strong><strong>I</strong><strong>ES:</strong></div>\n\n<ul>\n<li>Assist with building and improving SQE artifacts and templates</li><li>Provide agile methodology and practice expertise</li><li>Participate in requirement and design reviews and perform testability assessments</li><li>Create test strategies, plans, cases, scenarios, scripts, procedures and other test deliverables based on assigned project requirements</li><li>Develop or specify standards, methods and procedures to determine product quality or release readiness</li><li>Develop testing plans that address areas such as database impacts, software scenarios, regression testing, negative testing, errors, defect retests and usability Ensure proper test cases, test data and regression test bed is created for assigned projects</li><li>Document test procedures to ensure compliance with standards</li><li>Document and execute test cases</li><li>Identify program deviance from standards and suggest modifications to ensure compliance</li><li>Identify, analyze and document problems with program function, output, online screen or content</li><li>Investigate referred customer problems as needed</li><li>Conduct software compatibility tests with programs, hardware, operating systems and network environments</li><li>Monitor program performance to ensure efficient and problem-free operations</li><li>Participate in product design reviews to provide input on functional requirements, product designs, schedules or potential problems</li><li>Perform initial debugging procedures by reviewing configuration files, logs and code pieces to determine breakdown source</li><li>Plan test schedules or strategies in accordance with project scope and delivery dates</li><li>Provide feedback and recommendations to developers on software usability and functionality</li><li>Test system modifications to prepare for implementation</li><li>Develop a plan and strategy for test automation, performance and security testing for assigned projects and applications</li> <li>Leverage automated test scripts for test execution</li><li>Update automated test scripts to ensure currency</li><li>Conduct historical analyses of test results</li><li>Act as back up Test/SQE Lead when situation demands</li><li>Capture and generate software quality metrics and status reports for assigned team to management</li><li>Utilize defect management tool to log and track all defects identified during testing</li><li>Review test results documentation to verify pass fail status</li><li>Prepare testing sign off documentation for release</li><li>Analyze root cause of issues reported from user acceptance testing</li><li>Remain current on relevant best practices to support offering</li><li>Other duties as assigned</li>\n</ul>\n\n<div><strong>REQUIREMENTS:</strong></div><ul><li>Bachelor’s degree in computer science, information systems or related field</li><li>Minimum 5 to 7 years’ experience providing quality services</li><li>Advanced knowledge of testing methods</li><li>Ability to exercise considerable judgment, maintain confidentiality and act in a diplomatic manner</li><li>An intelligent and articulate individual who can relate to people at all levels of an organization and possesses excellent communication skills</li><li>A decisive individual who possesses a strategic focus as well as an operational, implementation and detail oriented perspective</li><li>A strategic planner with sound technical skills, analytical ability, good judgment and strong operational focus</li><li>Ability to work with peers in a team effort</li><li>Demonstrated ability to manage multiple priorities and deadlines</li><li>A well-organized and self-directed individual who is able to work with minimal amount of supervision</li><li>Capability to efficiently complete tasks in a fast paced environment</li><li>Ability to work extended hours, weekends and holidays pursuant with industry demands</li><li>Available to work emergency services 24/7 if required</li><li>Proficient in Microsoft Office and industry related software programs</li>\n</ul>\n\n<strong></strong><div><strong>PREFERRED</strong> <strong>QUALIFICATIONS:</strong></div><strong>\n<br>\n</strong>\n\n<ul>\n<li>Ability to create update and maintain automated test scripts utilizing tools like Selenium</li> <li>Pharmacy benefit management (PBM) domain experience or appropriate healthcare experience</li> <li>Pharmacy claim analysis experience</li><li>Experience using JIRA testing tool</li><li>Experience writing queries using PL/SQL</li> \n</ul>\n\n<div><strong>WORK ENVIRONMENT:</strong></div><div>Includes a typical office environment, with minimal exposure to excessive noise or adverse environmental issues.</div> \n<br>\n<div><strong>PHYSICAL REQUIREMENTS:</strong></div><div>Ability to sit for prolonged periods of time.</div> <div><strong>Pre-employment drug screening and background checks are required. The company offers a competitive salary and benefits package. EOE.</strong> <strong>All qualified applicants receive consideration for employment without regard to race, color, religion, sex, national origin, disability or veteran status.</strong></div><div><strong>EnvisionRxOptions is committed to maintaining a productive, drug-free workplace that keeps employees and customers safe from harm.</strong></div>"}