{"job title": "Data Engineer", "company": "Farmers Fridge", "city state": "– Chicago, IL, United States", "rating": "3.9", "job description": "<strong>About the role:</strong>\n<br><br>\nWe are integrating multifaceted data streams such as real-time IoT data, purchase data at the fridge, engagement data from the mobile apps, production and logistics data so that we continuously improve and optimize our business and operations workflows. We are looking for a Data Engineer to join our tech team and this could be you.\n<br><br>\n<strong>In a typical week, you will...</strong>\n<ul>\n<li>Grow our existing cloud and data infrastructure, democratize access to data,</li> <li>Champion the use of data and analytics at the company; be the pioneer of a data-driven culture.</li><li>Work with tech, marketing, sales, operations, finance and other business functions to scope, design and implement their data needs.</li><li>Help identify significant data sources and key variables for various business functions.</li><li>Lead the design and development of the data pipelines to productionize and ingest meaningful business data into a unified data model.</li><li>Develop machine learning and predictive analysis tools to identify new growth opportunities and personalize our services</li>\n</ul>\n<strong>Minimum qualifications:</strong>\n<ul>\n<li>Bachelor’s degree in Computer Science/Computer Engineering or relevant industry experience</li><li>Proficiency in multiple programming languages, particularly Python, R or Javascript, with minimum two years full time professional experience</li><li>You are proficient with SQL and are rarely satisfied with the current query performance</li> <li>You have developed data ingestion, data warehouse and integration pipelines</li><li>You are comfortable with both batch and stream data processing.</li><li>You know what it takes to build scalable and performant data models.</li><li>You understand the differences between relational and columnar databases and when to use them.</li><li>You are familiar with web development.</li><li>You value writing tests and people who write tests.</li><li>You have worked with one of the major public clouds (preferably AWS).</li><li>Ideally, you have experience with data visualization.</li>\n</ul>\n<strong>Benefits:</strong>\n<ul>\n<li>Traditional Benefits -- Health, Dental, Vision, Life, Short Term Disability, LTD</li><li>10 paid holidays</li><li>Generous PTO policy</li><li>Daily Fridge Credits</li><li>Monthly cell phone credit</li><li>Spontaneous company events and community service activities</li><li>Work with a phenomenal team of individuals that are constantly pushing the market boundaries to offer healthy food at the utmost convenience.</li>\n</ul>\n<strong>About Farmer’s Fridge:</strong>\n<br><br>\nAt Farmer’s Fridge, we’re committed to making wholesome, delicious food simply accessible, so people can live a little happier. We aim to remove the roadblocks to eating well on the go. That means sourcing top-notch ingredients, handcrafting meals in our kitchen, packing &amp; delivering fresh to our network of Fridges and ensuring the best possible customer experience. Unpurchased items are regularly donated to local food depositories, providing responsibly sourced nutrition to community members in need. If you’re passionate about our mission to change the food system for the better, our team just may be the right fit for you.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}