{"job title": "Data Engineer", "company": "GlaxoSmithKline", "city state": "– Harrisburg, PA (US)", "rating": "3.7", "job description": "<strong></strong><div><strong>Your Responsibilities</strong>:\n<br>\nAn ideal candidate will possess strong problem solving and conceptual thinking abilities in addition to communication, interpersonal, and leadership skills. This position will be in a fast-paced and entrepreneurial environment where you will be handling multiple concurrent projects while working independently and in teams.\n\n\n<ul>\n<li>You yearn to be part of cutting edge, high profile projects and are motivated by delivering world-class solutions on an aggressive schedule</li>\n<li>You are not intimidated by challenges, thrive under pressure, are passionate about your craft, and are focused on delivering exceptional results</li>\n<li>You love to learn new technologies and to help others to raise the bar on your team</li>\n<li>Passionate about intuitive and engaging user interfaces, as well as new/emerging concepts and techniques</li>\n</ul>\n\nOn Any Given Day You’ll\n\n\n<ul>\n<li>Build sustainable data driven solutions with new data technologies to meet the needs of our organization and business customers</li>\n<li>Design robust end-to-end systems with an eye on the long term maintenance and support of the application (DevOps)</li>\n<li>Look to leverage reusable code modules to solve problems across the team and organization</li>\n<li>Exhibit mastery over multiple domains</li>\n<li>Handle multiple functions / roles for the projects / Agile teams</li>\n<li>Have an intrinsic knowledge of standards and languages</li>\n<li>Look to leverage and establish standards across the team and organization</li>\n<li>Understand complex multi-tier, multi-platform, distributed systems</li>\n<li>Develop frameworks of significant complexity\n<br><br>\n<strong>Why You?</strong></li>\n</ul>\n\n<strong>Basic qualifications:</strong>\n\n\n<ul>\n<li>Bachelor’s Degree or military experience</li>\n<li>Desire to develop distributed systems and build data pipelines</li>\n<li>Exposure to big data technologies (Cassandra, Accumulo, HBase, Spark, Hadoop, HDFS, AVRO, MongoDB, Zookeeper, or similar)</li>\n<li>Exposure to cloud technologies (Azure, AWS, Google Cloud)\n<br><br>\nPreferred qualifications:</li>\n<li>Experience with Agile engineering practices</li>\n<li>1+ years experience with NoSQL implementation (Mongo, Cassandra, etc. a plus)</li>\n<li>2+ years experience developing Java based software solutions</li>\n<li>2+ years experience in at least one scripting language (Python, Perl, JavaScript, Shell)</li>\n<li>2+ years experience developing software solutions to solve complex business problems</li>\n<li>2+ years experience with Relational Database Systems and SQL</li>\n<li>2+ years experience designing, developing, and implementing ETL</li>\n<li>2+ years experience with UNIX/Linux including basic commands and shell scripting</li>\n<li>Familiarity with data science tools and concepts\n<br><br>\n<strong>Why GSK?</strong>:</li>\n</ul>\n\nAt GSK, our mission is to improve the quality of human life by enabling people to do more, feel better and live longer. Our three world-leading businesses research and deliver innovative medicines, vaccines and consumer healthcare products. We need a talented and motivated workforce to deliver against our strategy. To achieve this, we strive to attract the best people and to create an environment that empowers and inspires\n<br><br>\nContact information:\n<br>\nYou may apply for this position online by selecting the Apply now button.<br>\n\n<div>\nIf you require an accommodation or other assistance to apply for a job at GSK, please contact the GSK HR Service Centre at 1-877-694-7547 (US Toll Free) or +1 801 567 5155 (outside US).\n<br><br>\nGSK is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive equal consideration for employment without regard to race, color, national origin, religion, sex, pregnancy, marital status, sexual orientation, gender identity/expression, age, disability, genetic information, military service, covered/protected veteran status or any other federal, state or local protected class.</div><br>\n\n<div>\nImportant notice to Employment businesses/ Agencies\n<br><br>\nGSK does not accept referrals from employment businesses and/or employment agencies in respect of the vacancies posted on this site. All employment businesses/agencies are required to contact GSK's commercial and general procurement/human resources department to obtain prior written authorization before referring any candidates to GSK. The obtaining of prior written authorization is a condition precedent to any agreement (verbal or written) between the employment business/ agency and GSK. In the absence of such written authorization being obtained any actions undertaken by the employment business/agency shall be deemed to have been performed without the consent or contractual agreement of GSK. GSK shall therefore not be liable for any fees arising from such actions or any fees arising from any referrals by employment businesses/agencies in respect of the vacancies posted on this site.</div>\n\n<br>Please note that if you are a US Licensed Healthcare Professional or Healthcare Professional as defined by the laws of the state issuing your license, GSK may be required to capture and report expenses GSK incurs, on your behalf, in the event you are afforded an interview for employment. This capture of applicable transfers of value is necessary to ensure GSK’s compliance to all federal and state US Transparency requirements. For more information, please visit GSK’s Transparency Reporting For the Record site.</div>\n<br>"}