{"job title": "Structural Analysis Engineer IV - Technology Engineering", "company": "MD Helicopters", "city state": "– Mesa, AZ", "rating": "2.7", "job description": "<div><div><div>Job Details</div></div><div><div><div>Level <div><div>Experienced</div></div></div><div>Job Location <div><div>Mesa HQ - AZ - Mesa, AZ</div></div></div><div>Position Type <div><div>Full Time</div></div></div><div>Education Level <div><div>4 Year Degree</div></div></div></div><div><div>Salary Range <div><div>Undisclosed</div></div></div><div>Travel Percentage <div><div>Negligible</div></div></div><div>Job Shift <div><div>Day</div></div></div><div>Job Category <div><div>Engineering</div></div></div></div></div><div><div>Description</div></div><div><div> <div><strong>SUMMARY</strong>\n<br><br>\nAnalyze and document the structural integrity of detail, assembly, and installation drawings along with design alterations and repairs for commercial helicopter systems.\n<br><br>\n<strong>DUTIES AND RESPONSIBILITIES</strong> include the following:\n<ul>\n<li>Performs structural analysis of both metallic and composite structures used in aerospace applications.</li>\n\n<li>Analyze new and existing designs for all components of the helicopter including metallic/composite structure and mechanical subsystems.</li>\n\n<li>Analysis includes hand, computer aided calculations and FEA.</li>\n\n<li>Flight Strain Survey Instrumentation Definition, Pre-/Post-Flight Data Processing and Analysis.</li>\n\n<li>Define bench testing, design test fixtures and instrumentation requirements of components and assemblies.</li>\n\n<li>Perform analysis to substantiate alterations, repair and rework of rotorcraft structures.</li>\n\n<li>Perform mechanical vibration analysis and interpret results of dynamic systems.</li>\n\n<li>Other duties may be assigned</li>\n</ul>\n<strong>SUPERVISORY RESPONSIBILITIES</strong>\n<br><br>\nNone</div></div></div><div><div>Qualifications</div></div><div><div> <div><strong>SKILLS AND ABILITIES REQUIRED</strong>\n<ul>\n<li>Must have working knowledge of structural analysis concepts and applications.</li>\n\n<li>Must have working knowledge of static, dynamic and fatigue analysis of rotorcraft.</li>\n\n<li>Must have working knowledge of statistical tools utilized for failure analysis.</li>\n\n<li>Must have knowledge of composite structures analysis and metallic structures analysis.</li>\n\n<li>Familiarity with Helicopter airframe and flight loads required.</li>\n\n<li>Ability to write test plans and reports.</li>\n\n<li>Ability to work in a team environment to support engineering goals and objectives.</li>\n\n<li>Knowledgeable in MATHCAD, UG NX, PV-WAVE, NASTRAN/FEMAP, UG Scenario (or equivalent).</li>\n\n<li>Requires strong team-orientation and the ability to work several assignments concurrently.</li>\n\n<li>Proficient with Microsoft Office Suite to include Word, Excel, PowerPoint, Access.</li>\n\n<li>The ability to understand and follow instructions and the ability to concentrate.</li>\n\n<li>Excellent written, verbal, communication and interpersonal skills.</li>\n\n<li>The ability to get along with others or to be part of a team.</li>\n\n<li>FAA Structures DER, DER experience or ability to achieve designation is preferred.</li>\n\n<li>Access to Export Control Information required.</li>\n\n<li>Regular attendance at the work-site required..</li>\n</ul>\n<strong>EDUCATION and/or EXPERIENCE</strong>\n<ul>\n<li>Bachelor's degree (B. S.) from an accredited four-year college or university, and 10-14 years related experience and/or training; or equivalent combination of education and experience.</li> \n\n<li>Advanced Engineering degree (M.S.E) preferred.</li>\n\n<li>This job description in no way states or implies that these are the only duties to be performed by the employee(s) incumbent in this position. Employee(s) will be required to follow any other job –related instructions and to perform any other job-relat4ed duties requested by any person authorized to give instructions or assignments.</li>\n</ul>\nThis document does not create an employment contracts, implied or otherwise, other than an “at will” relationship.\n<br><br>\n<strong>CERTIFICATES, LICENSES, REGISTRATIONS</strong>\n<br><br>\n<strong>WORK ENVIRONMENT/PHYSICAL DEMANDS</strong>\n<br><br>\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<ul>\n<li>Work performed in an office or factory settings.</li>\n\n<li>Exposure to shop environment such as noise, dust, odors and fumes.</li>\n\n<li>Occasionally required to lift up to 20 lbs.</li>\n\n<li>Regularly required to sit, stand, bend, reach and move about facilities.</li>\n</ul>\n<em>A review of this position has excluded the marginal functions of the position that are incidental to the performance of fundamental job duties. All duties and responsibilities are essential job functions and requirements and are subject to possible modification to reasonably accommodate individuals with disabilities. To perform this job successfully, the incumbent(s) will possess the skills, aptitudes, and abilities to perform each duty proficiently. The requirements listed in this document are the minimum levels of knowledge, skills, or abilities.</em>\n<br><br>\n<em>MD Helicopters, Inc. is an equal employment employer and is committed to providing employment opportunities to minorities, females, veterans, and disabled individuals.</em></div></div></div></div>"}