{"job title": "Senior Security DevOps Engineer", "company": "MuleSoft", "city state": "– California - San Francisco", "rating": "4.2", "job description": "<p></p><p></p><br><p>MuleSoft is looking for a Security DevOps Engineer to work side-by-side with Cloud Operations to ensure the trusted operation of the MuleSoft Cloud Environment and be responsible for developing and implementing security solutions in concert with Operations, Product, and Engineering. As a MuleSoft Security DevOps Engineer, you are a creative self-starter who can work autonomously to develop creative solutions to ensure the confidentiality, integrity, and availability of all MuleSoft environments. You will design, develop, and implement secure automation practices in a unified secure framework to support cloud infrastructure at scale.</p><p></p><p>Our DevOps Engineer has the burning desire to secure infrastructure and applications at scale with the ability to seamlessly interweave compliance controls and security frameworks into the fabric of our Infrastructure. Furthermore, you will have a keen understanding of agile software delivery methods, and the ability to invisibly “build-in” the security measures required to support a continuous delivery model. </p><p></p><p><b>What you’ll achieve:</b></p><p></p><p><b>3 Months</b></p><ul><li>Automate everything to minimize manual work and meet security and compliance objectives in all aspects of the secure cloud ecosystem</li><li>Partner with DevOps and Engineering teams to integrate security controls into continuous integration and delivery processes, baking security into the infrastructure</li><li>Align with DevOps and Engineering to build sustainable security processes across a global multi-cloud production network</li><li>Work with Development and Operations teams to ensure proper key management and encryption are used according to security best practices</li></ul><p><br><b>12 Months</b></p><ul><li>Provide best practices for securing systems hosted in public clouds, especially AWS</li><li>Support compliance programs, including SSAE 16, PCI-DSS, FEDRAMP, HIPAA, and ISO</li><li>Identify, build, and maintain a broad range of solutions to protect MuleSoft’s cloud services and enterprise networks, supporting threat management, identity, and access management</li><li>Expert in automated configuration management (Puppet, Chef, Salt, Ansible, etc.) </li><li>Help architect, build, and deploy secure infrastructure and security solutions in support of Cloud Operations – including standards for hosts, firewalls, load balancers, and all parts of the infrastructure</li> </ul><p><b>What you’ll need to be successful:</b></p><ul><li>Background as an operations expert and the hands-on ability to demonstrate how security can be an enabler in infrastructure functionality, scalability, performance, and reliability</li><li>You love the challenge of making systems and processes both secure and easy to use</li><li>Have a track record for embedding security into the fabric of an organization and infrastructure</li><li>A strategic thinker who can translate vision into tactical execution</li><li>Strong decision making and project management skills</li><li>Innate ability to effectively prioritize work in a highly dynamic work environment</li><li>Experience with operational monitoring tools</li><li>High personal credibility and integrity and natural ability to influence and persuade others through collaboration</li><li>Demonstrated expertise with security, audit, and protection tools</li><li>Exemplary track record in developing security standards for cloud and virtual infrastructure, host, network and other devices</li><li>Amazing ability to create scalable security solutions in a fast-paced production environment</li><li>Track record of leading other technical teams to create solutions greater than the sum of its parts</li><li>A proactive nature to make data-driven decisions and manage complex initiatives from conception to deployment</li><li>Can anticipate threats and address security incidents across any and all MuleSoft environments </li></ul><p><br><b>About MuleSoft, a Salesforce company</b></p><p></p><p>Our mission is to help organizations change and innovate faster by making it easy to connect the world’s applications, data, and devices. Companies like Spotify, McDonald’s, and Unilever rely on MuleSoft to stay agile, deliver faster, and make the most of their IT investment with API-led connectivity. Hiring exceptional people who want to build a great company together is our number one priority, and we’re committed to providing an equal opportunity workplace where everyone is supported and inspired to do their best work. We work tirelessly to build this culture, and we’re proud to have been named the #1 Top Workplace in the Bay Area and a best place to work 6 years in a row.</p><p></p><p></p><p></p><p></p>Posting Statement<p></p><p>Salesforce.com and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Headhunters and recruitment agencies may not submit resumes/CVs through this Web site or directly to managers. Salesforce.com and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce.com and Salesforce.org will not pay fees to any third-party agency or company that does not have a signed agreement with Salesforce.com or Salesforce.org.</p>Pursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, Salesforce will consider for employment qualified applicants with arrest and conviction records.<p></p><p></p>"}