{"job title": "Data Engineer", "company": "Omaze", "city state": "– Los Angeles, CA", "rating": "3.3", "job description": "<div>\n<div>\n<div><strong>Who We Are:</strong>\n<br><br>\nOmaze's mission is to transform lives by leveraging the power of storytelling and technology. Our model democratizes traditional auction-giving by offering people everywhere the chance to have a once-in-a-lifetime experience for as little as a $10 donation. To continue raising money for hundreds of nonprofits around the world, we're growing our team of smart, dedicated and passionate world changers! That's where you come in.\n<br><br>\n<strong>Who We're Seeking:</strong>\n<br><br>\nOmaze's engineering team is looking for a Data Engineer to help us grow in 2018 and beyond. We have a unique product, passionate customers, and global reach. We need a great engineer to help us marshall and wrangle data. If you are comfortable working with SQL, Spark, Redshift, Parquet, Python, Scala, Big Data and AWS, we want to talk to you!\n<br><br>\n<strong>Key Responsibilities:</strong>\n\n<ul>\n<li>Work on our existing data pipeline which is SQL, Bash, Python, Spark, Scala, S3, Redshift and Cron</li>\n<li>Develop our new data pipeline using things like Alooma, SQL, S3, Redshift</li>\n<li>Help consolidate our media spend across social, ad networks, affiliates into a holistic dashboard. This may require API integration work with third party companies or working with companies like Funnel.io</li>\n<li>Help manage and administer our data warehouse</li>\n<li>Support Business Intelligence and database administration</li>\n<li>ETL performance optimization</li> \n\n<li>Build aggregates</li> \n</ul>\n<strong>Our Ideal Candidate:</strong>\n\n<ul>\n<li>You have 5+ years of professional software experience; have worked with several programming languages, and deep knowledge of at least one object-oriented language</li>\n<li>You do (or would) enjoy working in Bash, Golang, Python, and/or Scala</li>\n<li>You're comfortable working with ad spend data from Facebook, Instagram, Twitter, Ad Networks and Affiliates</li>\n<li>You have experience building and managing data pipelines, and with writing ETL jobs</li>\n<li>You have designed and implemented optimized, scalable data warehouses</li>\n<li>You are great at query optimization and have DBA experience</li>\n<li>You have experience with cloud infrastructure</li>\n<li>You have experience working with data marts and the star scheme</li>\n<li>You're familiar with Tableau, Looker or Microstrategy</li>\n<li>You take your work seriously, but not yourself</li>\n</ul>\n<strong>To Apply:</strong>\n<br><br>\nTell us a little bit about yourself and why you would be an ideal fit.</div>\n</div>\n</div>\n<br>"}