{"job title": "Data Engineer", "company": "Petal", "city state": "– New York, NY", "rating": "5.0", "job description": "<div><strong>The Petal mission</strong></div><br>\n<div>At Petal, were using fresh thinking and cutting-edge technology to make credit honest, simple and accessible. We use machine learning to analyze more data in our credit decisions, which means more people qualify, even if theyve never had credit before. And we use behavioral science and smart, intuitive design to offer a simple, customer-centric product thats engineered to achieve better financial outcomes -- with straightforward terms and no fees whatsoever. The result is an exciting new approach to credit that has the potential to radically expand credit access and improve the lives of millions of consumers, shaking up a trillion dollar industry in the process.</div><br>\n<div>To do this, were bringing together exceptional talent from across disciplines and industries to shape the future of financial services and improve the lives of our customers in a meaningful way.</div> <br>\n<div><strong>The Data Engineer role</strong></div><br>\n<div>Petal is at its heart a data company. And as Petal grows, we are looking for a data engineer to join us and help to continue building out and iterating on our existing data infrastructure and tools. You will have to tackle challenging data problems using cutting edge tools within the complex data landscape of a financial services company. You will be working closely with Product, Risk, Ops, and other stakeholders to develop data-driven, pragmatic software solutions to meet real business needs. As a member of a team that is still growing within Petal, you will have the opportunity to help shape the Data Engineering teams identity and footprint. The ideal candidate possesses strong technical skills, is comfortable working on ever-changing problems, works well cross-functionally, has a sharp eye for details, proactively owns and solves problems, and is always excited to learn.</div>Key responsibilities\n\n<ul>\n<li>Manage, extend, and augment large-scale batch and real-time data pipelines their production performance.</li><li>Develop robust data workflows/frameworks that convert data into powerful reports and views that enable powerful analytics.</li><li>Develop tools to monitor, debug, and analyze data pipelines.</li><li>Manage the data warehouse and develop/maintain best practices and processes. Build data expertise and own data quality.</li><li>Leverage best practices in continuous integration and delivery.</li><li>Help drive optimization, testing and tooling to improve data quality.</li><li>Collaborate with other engineers, product managers and stakeholders, to understand data needs and build business driven solutions</li>\n</ul>\n\nCharacteristics of a successful candidate\n\n<ul>\n<li><strong>1-3 years of experience</strong> working with data warehouses (we use Redshift and Postgres), building out ETL pipelines (ideally in Python), and writing SQL.</li><li><strong>Strong software development skills.</strong> You can write clean, scalable, testable code to solve data problems.</li><li><strong>Be a proponent of agile, data-driven development.</strong> You understand agile best practices, and care about reliability, and responsible experimentation.</li><li><strong>Value collaboration both within and outside of the team.</strong> You understand the value of collaboration within teams and the power of extending that collaboration across the company.</li><li><strong>Strong self-management, drive, and organization</strong>. Ability to multi-task in a fast-paced environment is essential.</li><li><strong>Be a quick, eager learner.</strong> Deep domain expertise in every aspect of Data Engineering isnt expected, but be willing to learn and approach the learning with excitement.</li> <li><strong>Flexibility.</strong> Petal is a startup and with that comes changing business needs, and changing priorities; you should be able to take on these changes in stride.</li><li><strong>Positivity, kindness, and humility</strong>. Be an awesome team member within a company already filled with awesome people.</li>\n</ul>\n\n<div><strong>What Petal offers</strong></div><br>\n<div>&gt;&gt; Welcoming, diverse, and interesting colleagues from all walks of life</div><div>&gt;&gt; Competitive compensation packages, including equity</div><div>&gt;&gt; Comprehensive benefits package -- medical, dental, vision</div> <div>&gt;&gt; 401(k) plan</div><div>&gt;&gt; Plenty of opportunities to get to know the team -- twice-weekly team lunches; monthly happy hours; monthly company dinners; fully-stocked kitchen</div><div>&gt;&gt; Generous PTO policy</div><div>&gt;&gt; Beautifully-designed office, located at the fashionable and fun intersection of Soho and Greenwich Village</div><div>&gt;&gt; Opportunities to attend learning programs and conferences (more to come!)</div><br>\n<div>Petal is an equal opportunity employer, and we are committed to building a team culture that celebrates diversity and inclusion. Were proud to be different, together.</div>"}