{"job title": "Senior Data Engineer", "company": "QuantumBlack", "city state": "– Chicago, IL", "rating": "5.0", "job description": "<strong>Who we are</strong>\n<br><br>\nQuantumBlack teams work in multi-disciplinary environments harnessing data to provide real-world impact. We bring together the brightest data scientists, engineers and designers to take on the biggest problems facing the world’s most influential organisations. Our projects range from helping pharmaceutical companies bring lifesaving drugs to market quicker to optimising a Formula1 car’s performance. At QuantumBlack you have the best of both worlds; all the benefits of being part of one of the leading management consultancies globally and the autonomy to thrive in a fast growth tech culture.\n<ul>\n <li> <strong>No project is ever the same -</strong> we work across multiple sectors, providing unique learning and development opportunities internationally.</li> <li> <strong>Fusing Tech &amp; Leadership</strong> – We work with the latest technologies and methodologies and offer first class learning programmes at all levels</li> <li> <strong>Multidisciplinary Teamwork</strong> - Our teams include data scientists, engineers, project managers, UX and visual designers who work collaboratively to enhance performance.</li>  <li> <strong>Innovative Work Culture</strong> - Creativity, insight and passion come from being balanced. We cultivate a modern work environment through an emphasis on wellness, insightful talks and training sessions.</li>  <li> <strong>Striving for Diversity –</strong> With colleagues from over 40 nationalities, we recognise the benefits of working with people from all walks of life.</li>\n</ul>\n<strong>What we do</strong>\n<br><br>\nWe guide global companies through data science solutions to transform their businesses and enhance performance across industries including healthcare, automotive, energy and elite sport.\n<ul>\n <li> <strong>Healthcare Efficiency -</strong> We helped a healthcare provider improve their clinical trial practices by identifying congestion in diagnostic testing as a key indicator of admissions breaches.</li>  <li> <strong>Environmental Impact</strong> – We designed and built the first data-driven application for a state of the art centre of excellence in urban innovation by collecting real-time data from environmental sensors across London and deploying proprietary analytics to find unexpected patterns in air pollution.</li>  <li> <strong>Product Development</strong> - We worked with the CEO of an elite automotive organisation to reduce the 18-month car development timeframe by improving processes, designs and team structures.</li>\n</ul>\n<strong>Who you are</strong>\n<br><br>\nA core value at QuantumBlack is fusion and at the heart of our multi-disciplinary teams is the belief that the sum of individual parts will always be less than the impact of the entire team. You are a highly collaborative individual who is capable of laying aside your own agenda, listening to and learning from colleagues, challenging thoughtfully and prioritising impact. You search for ways to improve things and work collaboratively with colleagues. You believe in iterative change, experimenting with new approaches, learning and improving to move forward quickly. Trust between colleagues is paramount here – you are an individual who can always be trusted to work in the best interests of all colleagues and to achieve the best outcome for QuantumBlack and our clients. You are naturally enthusiastic and enjoy sharing your passion with others.\n<br><br>\n<strong>What you’ll learn</strong>\n<br><br>\nAs part of a team at QuantumBlack, you will be working on the frameworks and libraries that our teams of Data Scientists and Data Engineers use to progress from data to impact. We are passionate about life-long learning and professional development individual to each of our employees. Whilst here, you will have the opportunity to:\n<ul>\n <li>Influence, develop and master best-practice around modern tools that support rapid development of analytics solutions like Python, Spark, Airflow and others.</li></ul> \n\n<ul>\n <li>Apply cutting edge data solutions to real world problems</li>  <li>Learn to deeply understand the data science and data engineering process and develop impactful and reusable patterns and abstractions</li> <li>Collaboratively advance the state of art in QuantumBlack’s practice and for our clients</li> <li>Build products alongside the core engineering team and evolve the engineering process to handle more users, resolutions for complex problems and advanced client situations.</li>  <li>Work with an extensive range of technologies around big data tools.</li> <li>Work with clear objectives for your Data Engineering expertise while collaborating with the Data Science, Machine Learning Engineer and Design teams</li>\n</ul>\n<strong>Responsibilities</strong>\n<ul>\n <li>Work with clients to model their data landscape, obtain data extracts, and define secure data exchange approaches</li> <li>Plan and deliver secure, good practice data integration strategies and approaches</li> <li>Acquire, ingest, and process data from multiple sources and systems into Big Data platforms</li> <li>Create and manage data environments in the Cloud</li> <li>Collaborate with our data scientists to map data fields to hypotheses and curate, wrangle, and prepare data for use in their advanced analytical models</li> <li>Have a strong understanding of Information Security principles to ensure compliant handling and management of client data</li> <li>This is a fantastic opportunity to be involved in end-to-end data management for bleeding edge Advanced Analytics and Data Science</li>\n</ul>\n<strong>Requirements</strong>\n<ul>\n <li>Strong experience with at least two of the following technologies: Python, Scala, SQL, Java</li> <li>Commercial client-facing project experience is beneficial, including working in close-knit teams</li> <li>The ability to work across structured, semi-structured, and unstructured data, extracting information and identifying linkages across disparate data sets</li> <li>Good experience in multiple database technologies such as: Distributed Processing (Spark, Hadoop, EMR) Traditional RDBMS (MS SQL Server, Oracle, MySQL, PostgreSQL) MPP (AWS Redshift, Teradata) NoSQL (MongoDB, DynamoDB, Cassandra, Neo4J, Titan)</li> <li>A proven ability in clearly communicating complex solutions</li> <li>Have a strong understanding of Information Security principles to ensure compliant handling and management of client data</li> <li>Experience and interest in Cloud platforms such as: AWS, Azure, Goole Platform or Databricks</li> <li>Strong experience in traditional data warehousing / ETL tools (Informatica, Talend, Pentaho, DataStage)</li>\n</ul>\n<strong>Requirements</strong>\n<ul>\n <li>Strong experience with at least two of the following technologies: Python, Scala, SQL, Java</li> <li>Commercial client-facing project experience is beneficial, including working in close-knit teams</li> <li>The ability to work across structured, semi-structured, and unstructured data, extracting information and identifying linkages across disparate data sets</li> <li>Good experience in multiple database technologies such as: Distributed Processing (Spark, Hadoop, EMR) Traditional RDBMS (MS SQL Server, Oracle, MySQL, PostgreSQL) MPP (AWS Redshift, Teradata) NoSQL (MongoDB, DynamoDB, Cassandra, Neo4J, Titan)</li> <li>A proven ability in clearly communicating complex solutions</li> <li>Have a strong understanding of Information Security principles to ensure compliant handling and management of client data</li> <li>Experience and interest in Cloud platforms such as: AWS, Azure, Goole Platform or Databricks</li> <li>Strong experience in traditional data warehousing / ETL tools (Informatica, Talend, Pentaho, DataStage)</li>\n<strong>Interview process</strong>\n</ul>\n \n\n<ul>\n <li>Recruiter screen</li> <li>Online technical test</li> <li>Technical case study interview</li> <li>Final technical discussion and interview</li>\n</ul>\nAs an equal opportunity employer, QuantumBlack encourages applications from all backgrounds regardless of gender, race, disability, pregnancy, marital status, age, sexual orientation, gender reassignment, religion or belief. We maintain a sense of community rooted in respect and consideration for all employees where any evaluation is based simply upon individual work and team performance.\n<br><br>\nWatch our Careers Video\n<br><br>\n<strong>Benefits</strong>\n<ul>\n <li>Technical and non-technical training courses</li> <li>Attendance at conferences</li> <li>McKinsey benefits (competitive salary, annual bonus, generous pension scheme etc.)</li> <li>Free lunches daily</li> <li>Free art pass</li> <li>Gym membership and yoga classes</li>\n</ul>"}