{"job title": "Data Engineer", "company": "Red Circle", "city state": "– Chicago, IL, US", "rating": "4.2", "job description": "<div><div>\nFetch Rewards is a fast growing technology company that is innovating and changing how consumers fulfill their grocery needs. We are headquartered in the heart of downtown Madison with another office in the Chicago Loop area. Our company currently provides two mobile applications in the mobile grocery market - Shop Fetch and Fetch Rewards - in both the Android and iOS platforms. The mission of Fetch is to provide easy access to the information and technology necessary for people to enjoy every stage in the life of food (inspiration, planning, purchasing, preparation, and of course ... eating). We are looking for a Data Engineer to help us change the grocery shopping experience.</div> \n<br>\n<div><strong>This Data Engineer position will be a unique opportunity to gain experience with end to end spectrum of Data &amp; Analytics, ranging from:</strong></div><div>\n\n\n<ul>\n<li>Manage and augment the entire data pipeline, from Raw database to relevant structures in Data Warehouse</li></ul></div> <li>Partner with the Client Service teams to help create Analytical Solutions that help our clients get rich insights from our unique data repositories that include Fetch app usage data, shopper transaction data and other shopper / product dimensions</li></div>\n\n\n<div>\nThis person will be a key member of the analytics team and report to the VP of Analytics.</div> <div>\n<strong>Responsibilities</strong></div>\n\n<ul>\n\n<li>\nMaintain and implement systems that ingest, transform, organize, and expose data insights</li> \n<li>\nAutomate database processes to reduce admin time and human error ensure structures that are relevant for analytics purposes</li> \n<li>\nContribute to upgrading/deploying/building of reliable database solutions</li> \n<li>\nIntegrate and clean multiple data sources; backup, restore, recovery, troubleshooting and configuration management;</li> \n<li>\nIntegrate security best practices</li> \n<li>\nWrite complex stored procedures and optimize execution efficiency</li> \n<li>\nParticipate in code and design reviews</li> \n<li>\nDeploy releases to multiple environments and support other teams during releases</li> \n<li>\nWork closely with application teams and business owners and develop a strong understanding of business logic and processes</li> \n<li>\nResearch and evaluate third-party tools to increase efficiency</li> \n</ul>\n\n<div>\n</div><div>\n<strong>Requirements</strong></div>\n\n<ul>\n\n<li>\nExperience with Big Data Platforms like Spark, AWS</li>\n<li>\nExperience with PostgreSQL / Redshift</li> \n<li>\nUnderstanding of database design/architecture and operations</li> \n<li>\nExpertise in data modeling, query design and optimization, stored procedures</li> \n<li>\nExperience with a major BI technology set like Tableau, PowerBI etc.</li> \n<li>\nExperience with very large databases and distributed database environments</li> \n<li>\nAbility to work with and provide technical leadership to other team members</li> \n<li>\nInnovative thinker who is positive, proactive and readily embraces change</li> \n<li>\nSuperior conceptual and analytical abilities, identifying opportunities for improvement through analysis and creative thinking</li> \n<li>\nExperience with Python a plus</li> \n<li>\nExperience with Java a plus</li> \n</ul>"}