{"job title": "Site Reliability Engineering (SRE) Surveillance Analyst Network Operations", "company": "RingCentral", "city state": "– Denver, CO, United States", "rating": "4.1", "job description": "<strong>Site Reliability Engineering (SRE) Surveillance Analyst – Network Operations</strong><br><br><strong>\n<br>\nJob Type:</strong> Full-Tme<strong>\n<br>\nLocation:</strong> Denver, CO<strong>\n<br>\nDepartment:</strong> SRE NOC\n<br><br>\nThe <strong>RingCentral</strong> environment is dynamic, success-driven, team-oriented and committed to providing world class service for its customers. Do you have the ability to thrive in a fast-paced environment? We are looking for candidates with an entrepreneurial spark!\n<br><br>\nWe’re not a phone company; we’re a cloud business-solutions provider. We've thrown out the old PBX along with its rigid rules and eliminated the complexity and unnecessary expense of managing business communications the old way.\n<br><br>\nRingCentral is a leading Unified Communications as a Service (UCaaS) provider, offering an innovating suite of telephony, contact center, video conferencing, and collaboration products for enterprise, mid-size companies, and small businesses.\n<br><br>\n<strong><u>Summary</u></strong><strong>:</strong>\n<br><br>\nOur <strong>SRE Surveillance Analysts</strong> are responsible for providing day to day system surveillance and simple trouble-shooting of issues and alarms in a 24x7 Global Network Operations Center, maximizing system performance and availability. You must be able to work in a 24X7 shift environment, with the flexibility to work diverse schedules, including weekends and holidays.\n<br><br>\n<strong><u>\n<br>\nEssential Duties and Responsibilities</u></strong><strong>:</strong>\n<ul>\n<li>Monitors network to detect system issues and/or alarms.</li><li>Investigates alerts and issues and accordingly based on Standard Operating Procedures.</li> <li>Swiftly resolves issues or escalates to the appropriate business partner when requiring further attention.</li><li>Provides analysis and support in escalating complex VOIP/voice, data issues or system issues.</li><li>Implements disaster recovery procedures to prevent data and VOIP/voice processing troubles.</li><li>Professionally interacts with business partners, vendors and customers to facilitate swift resolution of issues.</li><li>Promptly enters new data and updates for tracking purposes into multiple trouble ticketing systems, ensuring accurate and up-to-date information.</li><li>Effectively documents all steps taken to resolve identified and/or reported issues.</li><li>Promptly responds to incoming communications (telephone calls, emails, instant messaging, etc.) and directs reports and information requests appropriately.</li><li>Assists in the tracking of scheduled network maintenance procedures.</li><li>Ability to act independently with little or no supervision.</li>\n</ul>\n<strong><u>Competencies:</u></strong>\n<ul>\n<li>Technical capacity and the ability to troubleshoot, triage and resolve problems related to hardware, software or protocol issues. Basic understanding of cloud computing.</li><li>Works with a sense of urgency responding to active alerts and demonstrates the ability to adapt to changing priorities and circumstances.</li><li>Exceptional analytical and problems solving skills.</li><li>Ability to operate independent of direction balanced with the ability to work effectively in a team environment.</li><li>Excellent written and verbal communication skills. The ability to effectively and professionally communicate with peers, escalation points, partners and vendors.</li><li>Ability to correlate existing alerts/issues with new alerts as part of problem management.</li>\n</ul>\n<strong><u>Education and Experience:</u></strong>\n<ul>\n<li>Working knowledge of internet protocols.</li><li>Experience maintaining Linux servers and/or Telnet/SSH in a production environment is a plus</li><li>Experience or understanding of SIP, SoftSwitch, IP, LINUX, VoIP, ticketing systems, related process and procedures is a plus</li><li>Experience with a Monitoring System such as HP Open View, Solar Winds, NET Cool, Zabbix and BMC is a plus.</li><li>Experience working in MS Office including Word, Excel, PowerPoint, Visio and Outlook.</li><li>Related technical certifications are a plus</li>\n</ul>\n<strong><u>Qualification and Skills:</u></strong>\n<ul>\n<li>2 or more years of work experience</li><li>College degree or equivalent experience is a plus.</li><li>Previous experience working in a network operations environment or call center or help desk environment.</li><li>Telecommunications industry experience is a plus.</li><li>At least one year of experience in telephony and Data IP technology.</li> <li>1-3 years technical training preferred.</li><li>Experience with VOIP/Voice or Data network troubleshooting is a plus.</li><li>Previous work on a telecom surveillance system desired.</li><li>previous work in customer facing role desired as related to telecom.</li><li>Moderate proficiency with Microsoft products preferred.</li> \n</ul>\n<strong><u>\n<br>\nSupervisory Responsibility:</u></strong>\n<br><br>\nThis position has no supervisory responsibilities.\n<br><br>\n<strong><u>\n<br>\nWork Environment:</u></strong>\n<br><br>\nThis job operates in a professional office environment. This role routinely uses standard office equipment such as computers, phones and photocopiers.\n<br><br>\n<strong><u>\n<br>\nPhysical Demands:</u></strong>\n<br><br>\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. The employee may occasionally lift and/or move up to 10 pounds. The employee is regularly required to talk or hear. The employee is frequently required to sit, use hands and fingers to handle or feel, and reach with hands and arms. The employee is occasionally required to stand or walk.\n<br><br>\n<strong><u>\n<br>\nPosition Type/Expected Hours of Work:</u></strong>\n<br><br>\nThis is a full-time position. Must be able to work in a 24X7 shift environment with the flexibility to work diverse schedules, including weekends and holidays. Current shifts include:\n<ul>\n<li>1st5:00 am to 3:00 pm</li><li>2nd1:00 pm to 11:00 pm</li><li>3rd9:00 pm to 7:00 am</li>\n</ul>\n<strong>\n<br><br>\nAbout RingCentral</strong>\n<br><br>\nRingCentral, Inc. (NYSE: RNG) is a global provider of cloud unified communications and collaboration solutions. More flexible and cost-effective than legacy on-premise systems, RingCentral empowers today’s mobile and distributed workforces to be connected anywhere and on any device through voice, video, team messaging, collaboration, SMS, conferencing, online meetings, contact center, and fax. RingCentral provides an open platform that integrates with today’s leading business apps while giving customers the flexibility to customize their own workflows. RingCentral is a leader in the 2016 Gartner Magic Quadrant for Unified Communications as a Service Worldwide for the second consecutive year. RingCentral is headquartered in Belmont, Calif.\n<br><br>\nRingCentral is an EEO/AA employer.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}