{"job title": "Data Engineer", "company": "SmartDrive Systems", "city state": "– San Diego, CA", "rating": "3.8", "job description": "We are looking for an experienced data-focused engineer to join our team, participating in design, development, and delivery of our scalable and reliable analytics engines for solving computer vision, machine learning, sensor fusion problems for a proprietary device running in vehicle or systems in the cloud at high throughput. High accuracy vehicle event analysis engines (in vehicle and in the cloud), and robust and flexible coaching workflow, reporting, and alert management engines.\n<br><br>\nWith business nearly doubling every year, strong teams and platforms are the foundation and enabler of that growth. We are significantly expanding our team, and are looking for technologists with a passion for high performance software development, and a drive to deliver software products that make a meaningful difference in the lives of others.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Data Engineering to the core - analysis, modelling, transformation and visualization of datasets, data models for online products and analytics platform.</li>\n<li>Implement data engineering codebase using server-side Java/Scala and scripting using Python or Javascript</li>\n<li>Design and develop API for data pipelining frameworks on data collection, validation, processing and storage across data stores.</li>\n<li>Well versed with TSQL programming, ER Models, OLAP Cubes, Data-warehousing (SSIS, SSAS) to support operational data marts.</li>\n<li>Familiar with no SQL API paradigm for scalable data processing using ACID/BASE transaction processing models for microservices</li>\n<li>Familiarity with Business reporting using Tableau and SQL Server.</li>\n<li>Algorithmic and Software background to build data solutions for fast, large scale data.</li>\n<li>Function as a data steward for enterprise data processing across the organization.</li>\n</ul>\n<strong>Preferred Qualifications</strong>\n\n<ul>\n<li>Bachelor's Degree in Computer Science or related discipline</li>\n<li>5+ years of software development experience, with 2+ years of experience designing, coding and deploying production grade application specifications.</li>\n<li>Extensive knowledge of RDBMS (Microsoft SQL Server or similar) with handson TSQL/PLSQL experience.</li>\n<li>Data-warehousing using Ralph Kimball approach using SSIS/SSAS or similar Fact/Dimension modelling.</li>\n<li>Experience of ETL commercial software products (any of Informatica, Talend, Nifi or SSIS) with hands-on experience designing, implementing, and delivering solutions.</li>\n<li>Understanding business reporting and dashboard analytics using Tableau, Qlikview or other reporting technologies.</li>\n<li>Understand distributed filesystems such as HDFS, S3 and/or GlusterFS and distributed file processing using Spark.</li>\n<li>Proven experience with NoSQL stores (one or more of Cassandra, MongoDB, Influx DB, HBase, Elastic Search)</li>\n<li>Experience in a distributed microservices and/or serverless (Lambda) cloud software architecture</li>\n<li>An organized individual who is very detail oriented and can document and develop plans necessary for deliverables towards specific product or platform goals.</li>\n<li>A team player committed to achieve, works hard, admits his/her strengths and weaknesses, and has the flexibility and attitude to improve by learning new and fast.</li>\n</ul>\n<strong>Desired Qualifications</strong>\n\n<ul>\n<li>Expertise with integration of complex and large data from multiple data sources, data and sensor fusion, and migration to newer methodologies</li>\n<li>Prior experience as part of a large group working on massive data engineering pipelines and analytics for machine learning, computer vision</li>\n<li>An aggressive problem solver who can provide creative solutions to complex situations and obtain buy-in from those affected</li>\n<li>An independent worker who can take the initiative to define and prioritize specific goals and objectives, and to do the same for others</li>\n<li>Strong people skills - able to communicate with colleagues while building credibility and rapport, modifying behavioral style to respond to the needs of others while maintaining objectives</li>\n</ul>\n<strong>About SmartDrive</strong>\n<br><br>\nSmartDrive Systems, the recipient of Frost &amp; Sullivan's Customer Value Leadership Award for Video Safety Solutions, gives fleets and drivers unprecedented driving performance insight and analysis, helping save fuel, expenses and lives. Its video analysis, predictive analytics and personalized performance program help fleets improve driving skills, lower operating costs and deliver significant ROI. With an easy-to-use managed service, fleets and drivers can access and self-manage driving performance anytime, anywhere. The company, which is ranked as one of the fastest growing companies by Deloitte's Technology Fast 500, has compiled the world's largest storehouse of more than 200 million analyzed risky-driving events. SmartDrive Systems is based in San Diego, and employs over 725 people\n<br><br>\nSmartDrive Systems, Inc., is proud to be an Equal Opportunity Employer M/F/Veteran/Disability. We are committed to attracting, retaining, and maximizing the performance of a diverse and inclusive workforce."}