{"job title": "Quality Assurance Software Engineer - Server", "company": "Stamps.com", "city state": "– El Segundo, CA", "rating": "3.8", "job description": "<strong>Are you a Developer that thinks like a Test Engineer?</strong>\n<br><br>\nWe need Quality Assurance (QA) Engineering warriors that will relentlessly work to develop test automation that will not only ensure the products developed are of the highest level of quality but with limited human intervention. The things you develop will give the rest of the QA organization the tools they need to combat software defects throughout our systems. You will champion these things from requirements to design to finally implementation. This position reports to the Manager, Quality Assurance.\n<br><br>\nInternally we refer to this position as a QA Enginner - Server.\n<br><br>\n<strong>**We are currently not offering visa spopnsorship for this opening.**</strong>\n<br><br>\nHere at Stamps.com we are focused on delivering a world class internet-based postage solutions and services to our customers. We accomplish that through the quality of our applications and services. This is where you come in. You will be able to see how impactful your creations have on the whole software development lifecycle. You become a key component to the success of Stamps.com.\n<br><br>\n<strong>Perks</strong>\n<br><br>\n<strong>Competitive pay, 401k with company match, Medical, Dental and Vision Insurance, Employee Stock Purchase Plan, Educational Reimbursement, Commuter benefits, Discount programs, Inventor patent bonuses</strong>\n<br><br>\n<strong>Stamps.com Company Overview:</strong>\n<br><br>\nStamps.com (NASDAQ: STMP) is the leading provider of postage online and shipping software solutions to over 725 thousand customers, including consumers, small businesses, e-commerce shippers, enterprises, and high volume shippers. Stamps.com offers solutions that help businesses run their shipping operations more smoothly and function more successfully under the brand names Stamps.com, Endicia®, ShipStation®, ShippingEasy® and ShipWorks®. Stamps.com’s family of brands provides seamless access to mailing and shipping services through integrations with more than 475 unique partner applications.\n<br><br>\n<strong>Primary Position Goals:</strong>\n<ul>\n<li>Collaborate with QA Server team to help design, implement and execute test automation for the backend stamps.com services. Web services not Web applications</li><li>Own existing automation tools and suites.</li><li>Define automation and test strategies.</li><li>Create detail documentation for existing and new automation endeavors.</li><li>Diagnose, troubleshoot determine root cause of issues that may come up through the normal production escalation channel.</li>\n</ul>\n<strong>Essential Position Duties:</strong>\n<ul>\n<li>Collaborate with QA Server team to help design, implement and execute test automation for the backend stamps.com services (web services).</li></ul>\n\n<ul>\n\n\n<ul>\n<li>Develop test automation tools in C#.</li><li>Design, develop, execute and analyze results from existing functional / load / performance automation.</li><li>Identify gaps in the current automation test coverage and future implementation.</li></ul></ul>\n\n<ul>\n<li>Own existing automation tools and suites.</li> </ul>\n\n<ul>\n\n\n<ul>\n<li>Support SoapUI automation needs from the QA Analysts.</li><li>Analyze and debug issues / gaps with existing automation tools.</li><li>Create documentation for new and existing automation tools.</li> </ul></ul>\n\n<ul>\n<li>Define automation and test strategies.</li></ul>\n\n<ul>\n\n\n<ul>\n<li>Ensure a clear understanding of requirements.</li><li>Analyze new automation requests.</li><li>Develop an automation strategy including effort scope and timeline</li> </ul></ul>\n\n<ul>\n<li>Create details documentation for existing and new automation endeavors.</li> </ul>\n\n<ul>\n\n\n<ul>\n<li>Allow for a broader audience to use the tools.</li><li>Articulate/share information about the automation tools.</li></ul></ul>\n\n<ul>\n<li>Diagnose, troubleshoot determine root cause of issues that may come up through the normal production escalation channel.</li> </ul>\n\n<ul>\n\n\n<ul>\n<li>Pick up tickets for production escalations to support any testing that may be needed.</li><li>Create detailed bug reports.</li></ul>\n</ul>\n<strong>Education and/or Experience</strong>\n<ul>\n<li>BS in Computer Science or equivalent years of relevant work experience.</li><li>Five or more (5+) years of Back-end (web services) testing experience.</li><li>Automated testing experience preferred.</li><li>Version control experience preferred.</li>\n</ul>\n<strong>Skills and Knowledge</strong>\n<br><br>\nLoad / Performance testing, Development test automation tools, Back-end test automation, Familiarity with AWS, Work in an agile development model\n<br><br>\n<strong>Computer/Software/Application Proficiency</strong>\n<ul>\n<li>Windows Server</li><li>SQL Server</li><li>IIS</li><li>Visual Studio</li><li>SoapUI</li><li>Perforce</li><li>Jenkins</li><li>C#</li><li>JMeter scripting</li><li>Groovy scripting</li>\n</ul>\n<strong>EOE / M / F / Vet / Disability</strong>\n<br><br>\n#LI-KD1\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}