{"job title": "Field Application Engineer", "company": "Teradyne", "city state": "– USA - CA - San Jose", "rating": "4.0", "job description": "<br><b></b><br>Field Application Engineer<br><br><b></b><br>09/11/2018<br><br><b>Requisition ID</b><br>13371BR<br><br><b>Duties &amp; Responsibilities</b><br><p>If being part of a global team that is both exciting and dynamic excites you, then Teradyne may be the place for you! Here you will get the chance to work on cutting edge technology. Teradyne’s engineering teams are characterized by deep technical skills working with both software &amp; hardware. Our engineers thrive on a dynamic, customer-driven, global work environment. We succeed through teamwork. To better understand why we are a global leader in the ATE Industry, check this out!<br><br>Teradyne is currently seeking a <strong>Field Application Engineer</strong> to join our San Jose, CA office <br> <br> </p><ul><li>Develop innovative techniques for testing and characterizing leading edge digital, analog, mixed signal and <strong>power management (PMIC) devices</strong></li><li>Design sophisticated test interface hardware to connect tester resources to the device under test (DUT). Working with customers and hardware designers to implement signal conditioning, filtering, switching, to accommodate device test requirements.</li><li>Create and debug test programs in C/Visual Basic to perform digital, and mixed-signal test functions. </li><li>Create characterization test programs, collect data and perform data analysis.</li><li>Perform test correlation and release for production.</li><li>Create demonstration programs &amp; presentations, and present to internal team and external customer.</li><li>Report customer bugs/problems to engineering and follow up. Verify bug fixes that will meet customer requirements. </li><li>Develop competitive test methodology and supporting tools to differentiate from competition </li><li>Travel to customer sites to support design engineers, test engineers, product engineers. Travel requirements may be 25% or greater.</li><li>Identify trends in customer technology development to help guide the development of new Teradyne ATE instrumentation </li><li>Work with Sales and Marketing to develop sales and support strategies </li><li>Project management to maintain and oversee the delivery of critical project milestones</li></ul><p></p><br><br><b>Employment Category</b><br>Regular Full Time <br><br><b>Shift</b><br>1st<br><br><b>Position Subject to ITAR controls</b><br>No<br><br><b>Basic Qualifications, Experience, Skills &amp; Education Required</b><br><ul><li><p>Bachelor or Master in Electrical Engineering or equivalent.</p></li><li><p>2+ years ATE test development experience</p></li><li><p>Test experience of digital, mixed-signal, power management, RF</p></li><li><p>Travel both domestic &amp; international as needed.</p></li><li><p>Knowledge and experience on script programming is a plus (Python, Perl, etc).</p></li><li><p>Strong team player and goal oriented. </p></li><li>Able to handle dynamic work environment with pressure and quick changes.</li></ul><br><br><div><br>Teradyne is a leading supplier of automation equipment for test and industrial applications. Teradyne Automated Test Equipment (ATE) is used to test semiconductors, wireless products, data storage and complex electronic systems, which serve consumer, communications, industrial and government customers. Our Industrial Automation products include Collaborative Robots used by global manufacturing and light industrial customers to improve quality and increase manufacturing efficiency. In 2017, Teradyne had revenue of $2.14 billion and currently employs approximately 4,500 people worldwide.<br>Our stock is listed on the New York Stock Exchange under the symbol TER.<br> <br><br><br> </div><br><br><b>Job Title</b><br>Field Application Engineer<br><br><b>Relocation Available (Some relocation assistance has been approved for this role)</b><br>Yes<br><br><b>Job Categories</b><br>Engineering<br><br><b>Location</b><br>USA - CA - San Jose <br><br><b>EEO Statement:</b><br><p>The above listed position may involve access to export controlled technology and may be subject to export licensing requirements prior to employment.<br><br><b>ATTENTION APPLICANTS WITH DISABILITIES:</b> If you’re unable to access our on-line application due to a disability you may visit one of our locations or our Corporate Office at 600 Riverpark Drive, North Reading, MA and request a paper application form. In addition, you may also contact the HR Service Center at 978-370- 3041 or contact them at HR.Service.Center@teradyne.com for additional assistance. <br></p><p>Teradyne is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, age, disability status, protected veteran status, or any other characteristic protected by law.</p>We are a VEVRAA Federal Contractor.<br>"}