{"job title": "Data Analyst - Provider Services", "company": "Aetna Inc.", "city state": "– Atlanta, Georgia", "rating": "3.3", "job description": "POSITION SUMMARY\n<br><br>\nEstablish/maintain and align contracted provider demographic data and negotiated reimbursement arrangements across provider systems. Partner with Core to manage contract administration process by providing implementation and ongoing maintenance support and direction on technical and business processes.\n<br><br>\nFundamental Components:\n<br><br>\nEstablish/maintain and align contracted provider demographic data and negotiated reimbursement arrangements across provider systems (35%) * Provide ongoing business and technical direction relative to provider data structures that are national or regional in scope in support of claim adjudication and directory production (10%) * Analyze, identify, and report on significant changes to network configuration and market information (20%) * Partner with Core to manage contract administration process by providing implementation and ongoing maintenance support and direction on technical and business processes (15%) * Work with Contracts Administration to ensure appropriate contract implementation requirements are met (e.g. Provider Groups are set up as required by a Group contract vs. a Vendor contract) (10%) * Review new and existing contract reimbursement arrangements for compliance with standards and determine most appropriate system input methodology that facilitates accurate and consistent claim adjudication (10%)\n<br><br>\nBACKGROUND/EXPERIENCE desired:\n\n<li>Intermediate skill level in Microsoft Excel preferred* Ability to retain information related to multiple processes and job functions * Minimum of 3 years experience in a field involving customer service skills * Knowledge of basic healthcare industry terminology * Experience building and using basic queries in Access preferred * Associate or Bachelor's degree preferred\n<br><br>\nEDUCATION\n<br><br>\nThe highest level of education desired for candidates in this position is a Associate's degree or equivalent experience.\n<br><br>\nFUNCTIONAL EXPERIENCES\n<br><br>\nFunctional - Customer Service/Customer Service - Outbound calls - survey administration/1-3 Years\n<br><br>\nFunctional - Network Management/Provider data services/1-3 Years\n<br><br>\nTECHNOLOGY EXPERIENCES\n<br><br>\nTechnical - Desktop Tools/Microsoft Outlook/4-6 Years/End User\n<br><br>\nTechnical - Desktop Tools/Microsoft Word/4-6 Years/End User\n<br><br>\nADDITIONAL JOB INFORMATION\n<br><br>\nPosition with exposure to multiple career paths and promotions within the organization. This position offers critical thinking opportunities and the chance to build project management skills.\n<br><br>\nAetna is about more than just doing a job. This is our opportunity to re-shape healthcare for America and across the globe. We are developing solutions to improve the quality and affordability of healthcare. What we do will benefit generations to come.\n<br><br>\nWe care about each other, our customers and our communities. We are inspired to make a difference, and we are committed to integrity and excellence.\n<br><br>\nTogether we will empower people to live healthier lives.\n<br><br>\nAetna is an equal opportunity &amp; affirmative action employer. All qualified applicants will receive consideration for employment regardless of personal characteristics or status. We take affirmative action to recruit, select and develop women, people of color, veterans and individuals with disabilities.\n<br><br>\nWe are a company built on excellence. We have a culture that values growth, achievement and diversity and a workplace where your voice can be heard.\n<br><br>\nBenefit eligibility may vary by position. Click here to review the benefits associated with this position.\n<br><br>\nAetna takes our candidates's data privacy seriously. At no time will any Aetna recruiter or employee request any financial or personal information (Social Security Number, Credit card information for direct deposit, etc.) from you via e-mail. Any requests for information will be discussed prior and will be conducted through a secure website provided by the recruiter. Should you be asked for such information, please notify us immediately.</li>\nJob Function: Health Care"}