{"job title": "Senior Business Intelligence Analyst - Web Analytics", "company": "Bank of the West", "city state": "– San Francisco, CA", "rating": "2.8", "job description": "Responsible for providing highly complex analytical and project oversight by conducting financial and website analyses, assisting with internal strategy and ad-hoc projects, and performing competitor and industry benchmarking analysis for a designated Business Line.\n<br>\nEssential Job Functions\n<br>\nCreate, test and analyze A/B testing activities in Adobe Target.\n<br>\nAnalyze web analytics and digital reports to derive business insights.\n<br>\nManages data gathering efforts with internal and external business partners.\n<br>\nParticipates in the management of complex projects.\n<br>\nInterprets complex analysis and develops presentations for senior management.\n<br>\nPartners with members of other groups and functions within the bank to drive results.\n<br>\nOther Job Duties\n<br>\nPerforms other duties as assigned.\n<br>\n<strong>Qualifications</strong>\n<br>\n<strong>Required Experience</strong>\n<br>\n· Requires deep knowledge of job area typically obtained through advanced education combined with experience.\n<br>\n· Typically viewed as a specialist within the discipline of A/B testing and web analytics.\n<br>\n· May have broad knowledge of project management.\n<br>\n· Requires 7 years minimum prior relevant experience.\n<br>\n· At least 3 years’ relevant experience:\n\n\n<ul>\n<li>Experience with A/B testing using Adobe Target or other tools.</li>\n<li>Experience using Adobe Analytics (preferred) or Google Analytics to create and interpreting reports.</li>\n<li>Experience with documenting web analytics requirements and testing plans</li>\n<li>Able to understand what the data is saying and communicate insights to nontechnical business partners</li>\n</ul>\n\n<strong>· Nice-to-Have experience:</strong>\n\n\n<ul>\n<li>Digital marketing experience</li>\n<li>Experience with using data to identify business insights</li>\n<li>Experience creating systems development lifecycle deliverables (such as business requirements documents, user acceptance test plans and scripts)</li>\n<li>Basic-to-mid level SQL skills (preferably Oracle)</li>\n</ul>\n\n<strong>Education</strong>\n<br>\nBachelors Degree Economics, Math, Accounting, or applicable field\n<br>\n<strong>Skills</strong>\n<br>\nStrong data collection, research and quantitative skills\n<br>\nKnowledge of the banking and financial services industries\n<br>\nAbility to summarize complex information into simple to understand information\n<br>\nAbility to develop relationships with multiple stakeholders throughout an organization\n<br>\nExceptional MS Excel, PowerPoint and Word skills; experience with other data analysis tools a plus\n<br>\nAbility to self-motivate and a desire to work independently in a relatively unstructured environment.\n<br>\n· Strong written and verbal communication skills. Will be responsible for discerning client’s explicit and implicit needs. Will be responsible for writing standard systems development lifecycle business deliverables.\n<br>\n· Problem solving skills. Examples: Must be able to understand a business problem from the client’s perspective and propose potential solutions. The ability to visualize how existing technology solutions could be changed / leveraged to meet future needs would be a plus.\n<br>\n· Attention to detail, as well as the ability to see the “big picture”\n<br>\n· Organized\n<br>\n· Flexibility/ Adaptability"}