{"job title": "Sr Business Intelligence Analyst - Cash Management", "company": "Bank of the West", "city state": "– San Ramon, CA", "rating": "2.8", "job description": "Responsible for providing highly complex analytical and project oversight by conducting financial analyses, assisting with internal strategy and ad-hoc projects, and performing competitor and industry benchmarking analysis for a designated Business Line.\n<br>\nEssential Job Functions\n<br>\nManages data gathering efforts with internal and external business partners. Builds complex financial models related to current and future business, product and/or customer economics.\n<br>\nConducts competitive, industry and bank research.\n<br>\nParticipates in the management of complex projects.\n<br>\nInterprets complex analysis and develops presentations for senior management.\n<br>\nPartners with members of other groups and functions within the bank to drive results.\n<br>\nOther Job Duties\n<br>\nPerforms other duties as assigned.\n<br>\n<strong>#LI-JA1</strong>\n<br>\n<strong>Qualifications</strong>\n<br>\n<strong>Required Experience</strong>\n<br>\nRequires deep knowledge of job area typically obtained through advanced education combined with experience.\n<br>\nTypically viewed as a specialist within discipline.\n<br>\nMay have broad knowledge of project management.\n<br>\nRequires 7 years minimum prior relevant experience.\n<br>\nModerate to expert level SQL skills (both SQL Server and Oracle)\n<br>\n<strong>Education</strong>\n<br>\nBachelors Degree Economics, Math, Accounting, or applicable field\n<br>\n<strong>Skills</strong>\n<br>\nExcellent financial modeling skills\n<br>\nStrong data collection, research and quantitative skills (esp. finance, accounting, statistics)\n<br>\nKnowledge of the banking and financial services industries\n<br>\nKnowledge of accounting and financial concepts, experience with bank accounting and financial statement analysis\n<br>\nAbility to summarize complex information into simple to understand information\n<br>\nAbility to develop relationships with multiple stakeholders throughout an organization\n<br>\nExceptional MS Excel, PowerPoint and Word skills; experience with other data analysis tools a plus\n<br>\nAbility to self motivate and a desire to work independently in a relatively unstructured environment."}