{"job title": "Data Analyst IV", "company": "Centene Corporation", "city state": "– Sacramento, California", "rating": "3.0", "job description": "ProfessionalPosition Purpose: Responsible for analytic data needs of the business unit. Handle complex data projects and acts as a lead for other Data Analysts.\n\n<li>Provide advanced analytical support for business operations in all or some of the following areas: claims, provider data, member data, clinical data, HEDIS, pharmacy, external reporting</li>\n<li>Extract, load, model, and reconcile large amounts of data across multiple system platforms and sources</li>\n<li>Review data to determine operational impacts and needed actions; elevate issues, trends, areas for improvement and opportunities to management.</li>\n<li>Develop reports and deliverables and make recommendations to management</li>\n<li>Model data using MS Excel, Access, SQL, and/or other data ware house analytical tools</li>\n<li>Assist management in driving business decisions based on data</li>\n<li>Ensure compliance with federal and state deliverable reporting requirements by performing data quality audits and analysis.</li>\n<li>Assist with training and mentoring other Data Analysts.</li>\n<li>Assist with determining work load and related activities for other Data Analysts</li>\n\nEducation/Experience: Bachelors degree in related field or equivalent experience. 6+ years of statistical analysis or data analysis experience. Healthcare experience preferred. Advanced knowledge of Enterprise Reporting and Analysis tools, SQL, and Microsoft Office applications, including Excel and Access. Experience managing projects or heavy involvement in project implementation.\n<br><br>\nCentene is an equal opportunity employer that is committed to diversity, and values the ways in which we are different. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other characteristic protected by applicable law."}