{"job title": "Big Data Engineer Associate", "company": "Deutsche Bank", "city state": "– New York, NY", "rating": "3.4", "job description": "Big Data Engineer Associate\n<br><br>\nJob ID: 3175642 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2018-08-29 Location: New York, United States of America\n<br><br>\nTechnology\n<br><br>\nOur technology teams are responsible for the bank's entire information technology infrastructure. They develop and maintain the software required to support the bank's business. The teams work closely with the businesses and other infrastructure units to modernise the bank's IT systems to reduce complexity, risk and enable business growth.\n<br><br>\nWith award-winning mobile banking apps and trading systems, our technology helps Deutsche Bank deliver high-quality products to clients. We make sure that the phones and computers work and that emails are delivered but we also develop solutions that help our people share their knowledge, expertise and passion for our business.\n<br><br>\nDeutsche Bank sees itself as a technology-driven company that can gain market share with new, cutting-edge ideas. The ambition is to be a leader in the area of digitalisation.\n<br><br>\nWe are making investments into digital technology across all businesses to enhance the client experience, harness the power of data, and strengthen efficiency and controls by increasing automation. We are also collaborating with external partners such as start-ups, FinTechs, and technology specialists worldwide to discover and implement innovative solutions for our clients.\n<br><br>\nDeutsche Bank has become one of the first financial institutions to establish a professional research and development department, including capabilities such as four innovation labs and the digital factory in Frankfurt.\n<br><br>\nJoin us here, and you'll constantly be looking ahead. We'll look to you to capitalise on new technological trends that can reshape our business and deliver value for our clients, whilst still meeting the demands of customers, regulators and the markets.\n<br><br>\nPosition Overview\n<br><br>\nJob Title: Big Data Engineer\n<br><br>\nCorporate Title: Associate\n<br><br>\nLocation: New York, New York\n<br><br>\nAbout Deutsche Bank\n<br><br>\nWe are Germany's leading bank with strong positions in Europe and significant presence in the Americas and Asia Pacific. We're driving growth through our strong client franchise, investing heavily in digital technologies, prioritizing long-term success over short-term gains, and serving society with ambition and integrity. We serve our clients' real economic needs in commercial and investment banking, retail banking and transaction banking, and provide ground-breaking products and services in asset and wealth management. That means a career packed with opportunities to grow and the chance to shape the future of our clients.\n<br><br>\nRole Summary\n<br><br>\nThe Big Data Engineer designs and develops application code, implements technical solutions, and configures applications in different environments in response to business problems.\n<br><br>\nTo meet the requirements of the Anti-Financial Crime business, the Senior Engineer proposes the design and architecture of the application or its components, investigates and proposes appropriate technologies to be used, creates re-usable frameworks and drives standardization where possible. Leads delivery of other members of the team and controls their work where applicable.\n<br><br>\nRole Responsibilities\n<br><br>\n<strong>Strategy&amp;Architecture:</strong>\n\n\n<ul>\n<li>Technical: Practical experience in developing and supporting Big Data technologies and tools, including Hadoop, Tableau, and Datameer</li>\n<li>Experienced in both Waterfall and Agile development methodologies</li>\n<li>Database: Translates and implements simple development project requirements into physical database structures. Assesses proposed changes to object and data structures and implements these changes in physical databases. Assists in database management system support activities for operational database systems</li>\n<li>Systems design: Recommends/designs structures and tools for systems which meet business needs and takes into account target environment, performance, security requirements and existing systems. Delivers technical visualization of proposed applications for approval by customer and execution by system developers. Translates logical designs into physical designs, and produces detailed design documentation</li>\n<li>Data analysis: Investigates corporate data requirements, and applies data analysis, data modelling and quality assurance techniques, to establish, modify or maintain data structures and their associated</li>\n<li>Programming/software development: Designs, codes, tests, corrects, and documents moderately complex programs and scripts from agreed specifications and subsequent iterations, using agreed standards and tools. Collaborates in reviews of specifications, with others as appropriate</li>\n<li>Application support: Maintains application support processes, and checks that all requests for support are dealt with according to agreed procedures. Uses application management software and tools to investigate issues, collect performance statistics and create reports</li>\n</ul>\n\n<strong>Experience/Exposure:</strong>\n\n\n<ul>\n<li>Preferably experience in the Regulatory and/or anti-financial crime space</li>\n<li>Experience with data warehousing and/or Big Data is essential</li>\n<li>Experience with RDBMS and SQL is mandatory</li>\n<li>Experience with Hadoop, Oracle, Hive, Spark, Impala, HDFS, Pentaho and Java desired</li>\n<li>Experience with C or C++ is beneficial</li>\n<li>Demonstrable hands-on programming skills and experience</li>\n<li>Ability to work in a fast paced environment with competing and alternating priorities with a constant focus on delivery</li>\n<li>Ability to balance business demands and IT fulfilment in terms of standardization, reducing risk and increasing IT flexibility</li>\n<li>Experience in IT delivery and architecture, application design and programming in a large enterprise working on mission-critical IT systems</li>\n<li>Proven history of implementing technology roadmaps and providing subject matter expertise in Big Data technologies</li>\n</ul>\n\n<strong>Education/Certification:</strong>\n\n\n<ul>\n<li>Bachelor of Science degree from an accredited college or university with a concentration in Computer Science or Software Engineering (or equivalent) with a minor in Finance, Mathematics or Engineering</li>\n</ul>\n\nFor candidates applying for positions in the US:\n<br><br>\nDeutsche Bank is an Equal Opportunity Employer - Veterans/Disabled and other protected categories. Click these links to view the \"EEO is the Law\" poster and pay transparency statement."}