{"job title": "Principal Clinical Data Engineer PSJH", "company": "Providence Health &amp; Services", "city state": "– Renton, Washington", "rating": "3.4", "job description": "<strong> Description:</strong>\n<br><br>\n<strong> Providence is calling a Principal Clinical Data Engineer PSJH to Providence Health &amp; Services in either Renton, WA or Irvine, CA.</strong>\n<br><br>\nWe are seeking a Prinicpal Clinical Data Engineer PSJH to collect, analyze, create visualizations and storytelling using clinical data. He/She will have the opportunity to work with diverse data types from many millions of clinical encounters in acute and non-acute settings. Using analytical methods including visualization science, predictive modeling and biostatistics, they will serve as a key member of a team that engineers novel reporting platforms and brings data to bear on hard problems in healthcare. The audience for the Engineer work is the entire Providence St. Joseph Health system, from members of the Board of Directors to front line caregivers. Areas of particular focus include the measurement of Quality and Value of Care (i.e. good outcomes per unit cost). To succeed, the Engineer will interact comfortably and independently with Clinical and Administrative Leaders, subject matter experts and other data engineers, as they evaluate new measures, identify impactful findings in large clinical data stores, and design novel and strong data visualizations communicating key information across the organization. The Engineer will also help ensure that all work produced by the Clinical Analytics team is conducted with thoughtful analytical discipline, and they will support other members of the team through experience with computational methods.\n<br><br>\n<strong> In this position you will have the following responsibilities:</strong>\n\n<li>Clinical Data Expertise: Expert analytic resource in multiple clinical subject areas with a very strong understanding of the characteristics of data in sources including the EDW and the Data Lake; is sought for this expertise by clients.</li>\n  \n<li>Data Acquisition: Utilizes expert coding skills in SQL and/or other languages needed for data acquisition; executes complex projects accurately and independently.</li>\n  \n<li>Data Architecture: Expert in the creation of data sources, views and summaries; design and implement complex views independently; can translate the needs of analysts creating reports and data visualizations into a very functional data architecture; partners with Healthcare Intelligence.</li>\n  \n<li>Data Validation / Accuracy: Develops quality checks to ensure data accuracy and integrity; recommends process improvements that enhance data integrity; ensures ongoing data integrity and performs skillful data validation; works with clinical validators.</li>\n  \n<li>Reporting / Analysis: Work independently with senior leaders to tackle complex problems by developing sophisticated, testable hypotheses; presents findings formally to diverse stakeholders and committees; meaningfully identifies opportunities for improvement that result in change.</li>\n  \n<li>Display / Visualization: Expert with data visualization tools; develops visualization concepts; delivers excellent visual storytelling; solves complex technical challenges.</li>\n<strong> Qualifications:</strong>\n<br><br>\n<strong> Required qualifications for this position include:</strong>\n\n<li>Masters Degree or the equivalent of MA/MS degree in Health Information Management, Computer Science, Mathematics, business administration, healthcare or a related clinical or analytic discipline.</li>\n  \n<li>6 years experience or the equivalent of a minimum of six years of relevant data analysis.</li>\n  \n<li>Experience with database query and analysis languages (e.g. SQL, R, SAS, Python) and data visualization tools (e.g. Tableau, D3).</li>\n  \n<li>Strong knowledge of statistics, data analysis and data bases.</li>\n  \n<li>Demonstrated ability to elicit, analyze and communicate business requirements from multiple customers across disparate functions.</li>\n  \n<li>Ability to exercise sound judgment and making decisions based on a accurate and timely analysis.</li>\n  \n<li>Demonstrated ability to define, develop, and analyze performance measures and metrics.</li>\n  \n<li>Demonstrated planning and project oversight/management skills.</li>\n  \n<li>Possesses knowledge of healthcare including: Clinical terms and concepts, Administrative Coding, including DRG, ICD, CPT</li>\n  \n<li>Displays a record of self-motivated discovery, intense intellectual curiosity, and a passion for working with data to answer important questions.</li>\n  \n<li>Has a strong aesthetic sensibility that supports clear visual communication of quantitative information.</li>\n  \n<li>Familiarity with database structures, data definitions, and data relationships sufficient to understand and utilize complex data models with multifaceted record relationships, key structures, and record identification schemas.</li>\n  \n<li>Understanding of common statistical and epidemiological concepts that include: • Statistical Process Control (SPC); LEAN principles; Measures of central tendency, frequencies; Concepts of correlation and comparison; Data preparation and data transformation; Central Limit Theorem; Normal and other types of probability distributions.</li>\n<strong> Preferred qualifications for this position include:</strong>\n\n<li>PHD or The equivalent of a PhD degree in Health Information Management, Computer Science, Mathematics, business administration, healthcare or a related clinical or analytic discipline.</li>\n  \n<li>Experience in a biomedical setting.</li>\n  \n<li>Upon Hire - Certification in an IT discipline, application, or tool.</li>\n  \n<li>Upon Hire - Certification in Lean or Green/Black Belt.</li>\n<strong> About the department you will serve.</strong>\n<br><br>\nProvidence Strategic and Management Services provides a variety of functional and system support services for all eight regions of Providence Health &amp; Services from Alaska to California. We are focused on supporting our Mission by delivering a robust foundation of services and sharing of specialized expertise.\n<br><br>\n<strong> We offer a full comprehensive range of benefits - see our website for details</strong>\n<br><br>\nhttp://www.providenceiscalling.jobs/rewards-benefits/\n<br><br>\n<strong> Our Mission</strong>\n<br><br>\nAs expressions of Gods healing love, witnessed through the ministry of Jesus, we are steadfast in serving all, especially those who are poor and vulnerable.\n<br><br>\n<strong> About Us</strong>\n<br><br>\nProvidence Health &amp; Services is a not-for-profit Catholic network of hospitals, care centers, health plans, physicians, clinics, home health care and services guided by a Mission of caring the Sisters of Providence began over 160 years ago. Providence is proud to be an Equal Opportunity Employer. Providence does not discriminate on the basis of race, color, gender, disability, veteran, military status, religion, age, creed, national origin, sexual identity or expression, sexual orientation, marital status, genetic information, or any other basis prohibited by local, state, or federal law.\n<br><br>\n<strong> Schedule:</strong> Full-time\n<br><br>\n<strong> Shift:</strong> Day\n<br><br>\n<strong> Job Category:</strong> Support Services\n<br><br>\n<strong> Location:</strong> Washington-Renton\n<br><br>\n<strong> Other Location(s):</strong> California-Irvine\n<br><br>\n<strong> Req ID:</strong> 191714"}