{"job title": "Principal Data Modeler Specialist PSJH", "company": "Providence Health &amp; Services", "city state": "– Renton, Washington", "rating": "3.4", "job description": "<strong> Description:</strong>\n<br><br>\n<strong> Providence is calling a Principal Data Modeler Specialist PSJH to Providence Health &amp; Services in one of the following locations: Anaheim CA, Portland OR, Seattle WA or Renton WA.</strong>\n<br><br>\nWe are seeking a Principal Data Modeler Specialist PSJH to be responsible for managing and organizing the data by analyzing, developing and implementing data models, policies and standards. Develops Data Models on different data organization platforms like relational databases, big data etc. that support the integration and organization of data/information across systems.\n<br><br>\n<strong> In this position you will have the following responsibilities:</strong>\n\n<li>Work with Business, Architects and System Analysts to fully understand the business requirements and translate them into Conceptual, Logical and Physical models</li>\n  \n<li>Uses a variety of information gathering techniques (e.g., interviews, facilitation, diagrams) to gather complex business data requirements from business teams</li>\n  \n<li>Coordinate data models, data dictionaries, and other database documentation across multiple applications</li>\n  \n<li>Leads design reviews of data deliverables such as models, data flows, and data quality assessments</li>\n  \n<li>Partner with development and QA teams to communicate the business rules, data models and ensure test cases target the quality and integrity of the data model</li>\n  \n<li>Partner with DBAs to transform logical data models into physical database designs while optimizing the performance and maintainability of the physical database</li>\n<strong> Qualifications:</strong>\n<br><br>\n<strong> Required qualifications for this position include:</strong>\n\n<li>Bachelors Degree in Computer Science or Engineering Or equivalent educ/experience.</li>\n  \n<li>10 years demonstrable data modeling experience.</li>\n  \n<li>Demonstrated ability to effectively produce business results, while working under time pressures</li>\n  \n<li>Sets aggressive goals and is accountable for continuously driving improved outcomes, leading change and ensuring highest quality work product</li>\n  \n<li>Strong understanding of data modeling principals</li>\n  \n<li>Technical understanding of healthcare applications, data systems, data warehouses, and other reporting environments</li>\n  \n<li>Provides expert-level knowledge of data definitions, data relationships, business rules, data flows, data usage, and data quality indicators. Facilitates improved enterprise understanding of the data.</li>\n  \n<li>Experience developing data models on multiple platforms</li>\n  \n<li>Demonstrated ability to adapt to new technologies and learn quickly</li>\n  \n<li>Java, Scala, C#, Python, shell scripting and/or similar languages</li>\n  \n<li>APIs, JSON, REST and other relevant W3C open standards</li>\n  \n<li>Modern application development frameworks</li>\n<strong> Preferred qualifications for this position include:</strong>\n\n<li>Masters Degree in Computer Science or Engineering.</li>\n  \n<li>3 years Experience with Cloud strategy, architecture, migration and implementation using Azure / AWS / Hadoop.</li>\n  \n<li>1 year Demonstrable experience in data architecting on relational and big data platforms.</li>\n<strong> About the department you will serve.</strong>\n<br><br>\nProvidence Strategic and Management Services provides a variety of functional and system support services for all eight regions of Providence Health &amp; Services from Alaska to California. We are focused on supporting our Mission by delivering a robust foundation of services and sharing of specialized expertise.\n<br><br>\n<strong> We offer a full comprehensive range of benefits - see our website for details</strong>\n<br><br>\nhttp://www.providenceiscalling.jobs/rewards-benefits/\n<br><br>\n<strong> Our Mission</strong>\n<br><br>\nAs expressions of Gods healing love, witnessed through the ministry of Jesus, we are steadfast in serving all, especially those who are poor and vulnerable.\n<br><br>\n<strong> About Us</strong>\n<br><br>\nProvidence Health &amp; Services is a not-for-profit Catholic network of hospitals, care centers, health plans, physicians, clinics, home health care and services guided by a Mission of caring the Sisters of Providence began over 160 years ago. Providence is proud to be an Equal Opportunity Employer. Providence does not discriminate on the basis of race, color, gender, disability, veteran, military status, religion, age, creed, national origin, sexual identity or expression, sexual orientation, marital status, genetic information, or any other basis prohibited by local, state, or federal law.\n<br><br>\n<strong> Schedule:</strong> Full-time\n<br><br>\n<strong> Shift:</strong> Day\n<br><br>\n<strong> Job Category:</strong> Information Technology\n<br><br>\n<strong> Location:</strong> California-Anaheim\n<br><br>\n<strong> Other Location(s):</strong> Washington-Seattle, Oregon-Portland, Washington-Renton\n<br><br>\n<strong> Req ID:</strong> 198240"}