{"job title": "Lead Business Data Analyst", "company": "TEKsystems, Inc", "city state": "– New York, New York", "rating": "3.4", "job description": "<strong>!!!!!!!!******* NO THIRD PARTY VENDORS ******!!!!!!</strong>\n<br><br>\n<strong> Job Description:</strong> \n<br><br>\nSearching for a Lead Business Data Analyst within Compliance Trade Surveillance Technology to actively participates in all of the software development cycle and coordinate work across various applications, operations or LOBs as necessary to maintain or deliver the business solution.\n<br><br>\n<strong> Job Requirements:</strong> <li> 5-7 years experience in business analysis with expertise in different technologies, business areas, application wide analysis, and proposal of solutions.</li> <li> Responsibilities include requirement gathering, writing Business Requirement Documents (BRD), Scoping &amp; Assessment and High Level Designs (HLD), Perform feasibility analysis, scope projects, prioritize deliverables, recommend alternative solutions and project strategies, and engage in negotiations.</li> <li> Participate in daily scrum calls in agile environment along with sprint planning every 2 weeks.</li> <li> Senior Business Analysts should also be able to perform as team leaders when necessary</li> <li> Technologies include Microsoft Office, Microsoft Visio, Toad, XML, SQL, Autosys, JIRA</li>\n\n<strong>Top Skills:</strong>\n\n<li> <strong> Good Financial Product Knowledge (Decent knowledge with trading. They specialize in FX and Equities. Financial a must)</strong></li>  <li> <strong> Excellent Communication</strong></li>  <li> <strong> Strong Scripting skills (UNIX/Windows)</strong></li>  <li> <strong> Good SQL Skills</strong></li>  <li> <strong> Strong Presentation Skills (Flow Diagrams, Mock-ups, Spreadsheet Processing)</strong></li>  <li> <strong> Project Coordination</strong></li>\n\n<strong>About TEKsystems:</strong>\n<br><br>\n<strong> We're partners in transformation. We help clients activate ideas and solutions to take advantage of a new world of opportunity. We are a team of 80,000 strong, working with over 6,000 clients, including 80% of the Fortune 500, across North America, Europe and Asia. As an industry leader in Full-Stack Technology Services, Talent Services, and real-world application, we work with progressive leaders to drive change. That's the power of true partnership. TEKsystems is an Allegis Group company.</strong>\n<br><br>\n<strong> The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.</strong>\n<br><br>\n<strong> If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please call 888 472-3411 or email accommodation@teksystems.com for other accommodation options.</strong>"}