{"job title": "Business (Data) Analyst", "company": "TEKsystems, Inc", "city state": "– New York, New York", "rating": "3.4", "job description": "<strong>Description:</strong>\n<br>\nThe Business Analyst will work with customers and engineers to capture new customer demand, document their requirements, validate assumptions and acceptance criteria, look at sample data, and derive technical requirements. The goal of the business analyst is to enable the development team to quickly pick up new requirements and move quickly to implement them without having to ask many additional questions or go back to the original customer for clarification.\n<br><br>\nThis team is ingesting, centralizing, and transporting global data from around the world into the cyber data lake. This team will comprise of one Project Manager, 3-4 Data Schema BAs (\"Business Data Analysts\"), and 5-6 Python/Spark developers (\"Pipeline Developers\"). The developers will be developing new ETL libraries or applications on top of the data lake platform that will perform machine learning functions. They need to have experience with ETL and parsing systems, as well as parsing and transforming data. The BAs will work with developers and various teams to extrapolate the value out of the data that's being ingested into the data lake. They will be translating machine data that can be used for multiple purposes.\n<br><br>\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>10+ years working as a business analyst, data analyst, systems engineer or systems architect</li>\n<li>5+ years working in a big data or data warehouse context, ideally using a Hadoop cluster</li>\n<li>5+ years working with ETL tools like Informatica</li>\n<li>5+ years working with an Agile tracking tool, ideally Jira</li>\n<li>5+ years working with a Wiki tool, ideally Confluence</li>\n</ul>\n\n<strong>About TEKsystems:</strong>\n<br><br>\n<strong> We're partners in transformation. We help clients activate ideas and solutions to take advantage of a new world of opportunity. We are a team of 80,000 strong, working with over 6,000 clients, including 80% of the Fortune 500, across North America, Europe and Asia. As an industry leader in Full-Stack Technology Services, Talent Services, and real-world application, we work with progressive leaders to drive change. That's the power of true partnership. TEKsystems is an Allegis Group company.</strong>\n<br><br>\n<strong> The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.</strong>\n<br><br>\n<strong> If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please call 888 472-3411 or email accommodation@teksystems.com for other accommodation options.</strong>"}