{"job title": "Big Data Engineer", "company": "TEKsystems, Inc", "city state": "– Minneapolis, Minnesota", "rating": "3.4", "job description": "TEKsystems has partnered with a large customer in Minneapolis looking to add 3 Hadoop/Big Data Developer to their team. This project will involve migrating all online marketing data to their big data platform. Below are the core skills they are looking for.\n\n<li> Strong conceptual knowledge with Apache Spark and Scala. Must be able to articulate concepts within Spark</li> <li> Experience with Hive, Map Reduce, HDFS, Oozie, Squoop, etc.</li>\n\nThese positions are starting as 6+ month contracts with an opportunity to extend based on the needs of the project. Must sit on-site in Minneapolis. If you are interested in learning more about this opportunity, please apply with your updated resume!\n<br><br>\n<strong>About TEKsystems:</strong>\n<br><br>\n<strong> We're partners in transformation. We help clients activate ideas and solutions to take advantage of a new world of opportunity. We are a team of 80,000 strong, working with over 6,000 clients, including 80% of the Fortune 500, across North America, Europe and Asia. As an industry leader in Full-Stack Technology Services, Talent Services, and real-world application, we work with progressive leaders to drive change. That's the power of true partnership. TEKsystems is an Allegis Group company.</strong>\n<br><br>\n<strong> The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.</strong>\n<br><br>\n<strong> If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please call 888 472-3411 or email accommodation@teksystems.com for other accommodation options.</strong>"}