{"job title": "Principal Research Scientist", "company": "Tokyo Electron Ltd", "city state": "– Austin, TX", "rating": "3.9", "job description": "<strong>Job Description</strong>\n<br><br>\nDriving success happens daily here. Tokyo Electron America, Inc. employees foster strong partnerships with TEL's US customer base. We market a wide range of semiconductor production equipment (SPE) products and provide outstanding service and support to U.S. semiconductor device manufacturers. TEL's world-renowned products and technologies support diverse customer needs for the manufacture of increasingly sophisticated semiconductors.\n<br><br>\n<strong>Position Summary:</strong>\n<br><br>\nTokyo Electron America, Inc., a subsidiary of Tokyo Electron Limited, a global, multi-billion dollar corporation and a leader in the semiconductor equipment industry, is currently seeking a Product Development Engineer to join our Advanced Software Applications Group focused on developing leading edge software solutions for process control and equipment product enhancement, located in Austin, Texas.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>The primary responsibility is to create and drive product strategies for new software technologies that bring effective solutions for early circuit design optimizations, electronic design-automation (EDA) capabilities, and IC device yield-enhancements based on wafer fab equipment and process capabilities.</li>\n<li>Manage cross-functional projects (across business units) for our Corporate Innovation Division</li>\n<li>Lead and mentor junior members of our engineering teams (across multiple TEL sites around the globe) in the area of chip circuit design and process technology considerations to enable our teams produce effective software and process solutions</li>\n<li>Provide strategic vision and recommendations to increase market share for existing or new products to our Corporate Innovation Division management team (TEL headquarters)</li>\n<li>Support our technology marketing teams by establishing customer interactions and seeking feedback (voice-of-customer) about our customer's IC manufacturing needs and challenges pertaining to HVM and device yield</li>\n<li>Participate in strategy setting for TEL's APC product strategy by working closely with engineering and management teams across business units/factory liaisons</li>\n<li>Travel is required</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>The candidate must possess a M.S.or higher degree in engineering, physics or equivalent field.</li>\n<li>Candidate must have strongunderstanding of device patterning (lithography, etch, deposition) methods,experience in working as an interface person between process integration anddesign ground rule engineering teams.</li>\n<li>10 years or more experiencein working/interfacing with semiconductor manufacturing fabs</li>\n<li>At least 5 years ofexperience in working with circuit design and technology ground rule generation</li>\n<li>Advanced understanding of EDAmarket and strong understanding of EDA software tools usability</li>\n<li>Must have strongcommunication skills (seasoned oral presenter)</li>\n<li>Must be able to establish andmaintain strong relationships with external parties such as customers andpartners</li>\n<li>Candidate must have strongpresentation skills in front of a technical audience.</li>\n</ul>\n\nEqual Opportunity Employer/Minorities/Females/Disabled/Veterans"}