{"job title": "Clinical Data Analyst", "company": "UnitedHealth Group Inc.", "city state": "– Schaumburg, IL", "rating": "3.3", "job description": "When you're setting the pace for change, it's not only challenging, it's exhilarating. We're building new health care solutions right and left and shaping the system as we go to help millions live healthier lives. That's why we need Business Analysts who can keep up and dig deep. When you join us, you'll drive processes and improvement initiatives that have an impact on healing the health system. Sound like your kind of challenge? Join a Fortune 6, industry leader and find out how you can be a part of something life changing for millions.\n<br><br>\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<br><br>\n<strong>Primary Responsibilities:</strong>\n\n\n<ul>\n<li>Develop and maintain all clinical databases (e.g., Utilization Management, Specialty / Non-Specialty Pipeline, Generic Pipeline, Drug List Management databases)Assist with development and maintenance of Medicare Part D, formularies</li>\n<li>Communicate with clinical account managers to facilitate updates to client custom formularies</li>\n<li>Participate in all formulary management activities</li>\n<li>Produce required reports to internal partners and clients in required formats in an accurate and timely fashion</li>\n<li>Facilitate or assist with the member communications process</li>\n<li>Assist with all aspects of formulary - related clinical programs</li>\n<li>Continuously look for ways to streamline and improve the quality of the formulary management process</li>\n<li>Perform other duties as necessary to meet the objectives of Optum and supporting clients and/or COE objectives</li>\n</ul>\n\n<strong>Required Qualifications:</strong>\n\n\n<ul>\n<li>2 years of experience in Pharmacy Benefits Management or managed care settings</li>\n<li>Working knowledge of MediSpan data system including GPI drug classification system (First Data Bank experience accepted)</li>\n<li>Familiarity with prescription benefit, formulary and clinical program design</li>\n<li>Intermediate ability in Excel (v look ups, pivot tables)</li>\n<li>Working knowledge of Medicare Part D regulations and experience</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Bachelor's degree</li>\n<li>Knowledge of MS Access, SQL and SAS</li>\n</ul>\n\nCareers with OptumRx. We're one of the largest and most innovative pharmacy benefits managers in the US, serving more than 12 million people nationwide. Here you'll fill far more than prescriptions. As a member of one of our pharmacy teams, you're empowered to be your best and do whatever it takes to help each customer. You'll find unrivaled support and training as well as a wealth of growth and development opportunities driven by your performance and limited only by your imagination. Join us. There's no better place to help people live healthier lives while doing your life's best work.(sm)\n<br><br>\nDiversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.\n<br><br>\nUnitedHealth Group is a drug - free workplace. Candidates are required to pass a drug test before beginning employment.\n<br><br>\nJob Keywords: Clinical Data Analyst, Medicare Part D, Excel, PBM, Pharmacy Benefits Management, Schaumburg, IL, Illinois"}