{"job title": "Principal Data Analyst - Big Data Engineering - Minnetonka, MN or Boston, MA", "company": "UnitedHealth Group Inc.", "city state": "– Minnetonka, MN", "rating": "3.3", "job description": "UnitedHealth Group is a company that's on the rise. We're expanding in multiple directions, across borders and, most of all, in the way we think. Here, innovation isn't about another gadget, it's about transforming the health care industry. Ready to make a difference? Make yourself at home with us and start doing your life's best work.(sm)\n<br><br>\nPositions in this function are involved in the development, communication and implementation of the organization's technology architecture and applications plan, including the components required to support it and in the integration of corporate and business architectures and applications. Responsible for coordinating, administering and supporting activities related to data planning, data recovery and development and related projects.\n<br><br>\nAs a Data Analyst within the Big Data engineering team, managing our master data set, developing reports, and troubleshooting data issues. To do well in this role you need a very fine eye for detail, deep experience as a Healthcare data analyst, and deep understanding of the popular data analysis tools and databases. You will be accountable for driving Design and development of data driven applications. We are building brand new, data - intensive software products that are focused on bringing the healthcare data together. These products are mostly analytical in nature and we use advanced technologies in big data space to provide a cutting - edge solution to solve business opportunities.\n<br><br>\nhttp://youtu.be/7iNvN3d3HNA\n<br><br>\n<strong>Primary Responsibilities:</strong>\n\n\n<ul>\n<li>Mapping of different sources, managing master data, including creation, updates, and deletion</li>\n<li>Data profiling and provide quality assurance of imported data</li>\n<li>Helping develop reports and analysis</li>\n<li>Managing and designing the reporting environment, including data sources, security, and metadata</li>\n<li>Supporting the Big Data development team in identifying and revising reporting requirements</li>\n<li>Supporting initiatives for data integrity and normalization</li>\n<li>Training end users on new reports and dashboards</li>\n<li>Providing technical expertise on data storage structures, data mining, and data cleansing</li>\n<li>Working very closely with Architecture group and driving technical solutions towards providing data products for business teams</li>\n<li>Interpreting data, analyzing results using statistical techniques</li>\n<li>Developing and implementing data analyses, data collection systems and other strategies that optimize statistical efficiency and quality</li>\n<li>Mentor junior analysts within the team for development and delivery</li>\n</ul>\n\n<strong>Required Qualifications:</strong>\n\n\n<ul>\n<li>Bachelor's degree with 10 years of Data Analysis work</li>\n<li>10 years experienced in Healthcare industry on domains like Claims, provider, Member, Eligibility, Prior Authorizations, Payments</li>\n<li>10 years of experience with X12 EDI transactions in Healthcare industry</li>\n<li>8 years of experience working with databases like Oracle, MySQL, MS SQL Server or related technologies</li>\n<li>5 experience working as a Business Analyst</li>\n<li>2 years of experience with data profiling tools and data visualization tools</li>\n<li>2 years of experience working with Rules engine&amp;APIs</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Experience in Healthcare</li>\n<li>Knowledge in Big Data Technologies including Python</li>\n<li>Strong experience with enterprise application architecture and enterprise integration patterns</li>\n</ul>\n\nTechnology Careers with Optum. Information and technology have amazing power to transform the health care industry and improve people's lives. This is where it's happening. This is where you'll help solve the problems that have never been solved. We're freeing information so it can be used safely and securely wherever it's needed. We're creating the very best ideas that can most easily be put into action to help our clients improve the quality of care and lower costs for millions. This is where the best and the brightest work together to make positive change a reality. This is the place to do your life's best work.(sm)\n<br><br>\nDiversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.\n<br><br>\nUnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment.\n<br><br>\nJob Keywords: data analyst, Claims, provider, Member, Eligibility, Prior Authorizations, Payments, EDI, X12 EDI, Oracle, MySQL, MS SQL Server, business analyst, data profiling tools, data visualization tools, Rules engine, API, healthcare, big data, python, enterprise application architecture, enterprise integration patterns, Minnesota, Minnetonka"}