{"job title": "Data Analyst - Treasury Data Management Capital", "company": "Bank of America", "city state": "– Charlotte, NC", "rating": "3.6", "job description": "<strong>Job Description:</strong>\n<br><br>\nThe Capital Management Data Analyst is responsible for:\n<br><br>\n(1) Research &amp; Analysis Supporting Traded, Market Risk or Asset Securitization products, as well as, understanding the overall flow and usage of information from upstream sources and consolidation points used for capital modeling, calculation and reporting processes\n<br><br>\n(2) Subject Matter Expertise - Learning and understanding how regulations, policy interpretation, product mix, transformations and risk drivers impact capital reporting processes\n<br><br>\n(3) Operational Excellence Improving Treasury Data Management functions for production, data governance, data change and regulatory/audit activities\n<br><br>\n(4) Data Controls - Ensuring process controls, data validation activities, DQ scripts and measurement processes remain timely and relevant\n<br><br>\n(5) Data Remediation - Meeting SLA timelines for Data Incident analysis, Defect or Enhancement classification, Action Plan creation and Target Date delivery for Monthly Data Governance Process compliance.\n<br><br>\nEnterprise Role Overview\n<br><br>\nResponsible for more complex finance activities around capital calculation, reporting and/or analysis to support the Bank's Capital Initiatives. Must have a thorough understanding of Basel III. Can work independently. May provide supervision to a small staff. Supports achievement of business goals by working on more complex activities or projects within the unit and with partners.\n<br><br>\n<strong>Required Skills and Experience:</strong>\n<ul>\n<li>Minimum 2 years of experience within a financial institution with experience as a Data Analyst</li><li>Ability to understand and explain Traded, Market Risk or Asset Securitization products and their representation in data.</li><li>Data management and analysis experience, preferably supporting production</li><li>Ability to access data from Teradata, Netezza, SQL Server and other data sources to independently research problems, analyze data, determine root causes, and propose, as well as, document solutions.</li><li>Ability to use SQL and perform complex data profiling functions of multiple, large datasets for analysis, testing and other efforts. Ability to do multiple/multi-type table joins, multiple keys, nested queries and other complex SQL function for advanced data analysis.</li><li>Ability to use advanced Excel functions such as pivot tables, VLookup, macros, Visual Basic and more to supplement advanced SQL skills in data analysis exercises.</li><li>Ability to provide clear oral and written communication to a variety of business and technical audiences.</li><li>Bachelor degree in quantitative finance, financial engineering, computer science, economics, or business administration.</li>\n</ul>\n<strong>Desired Skills and Experience:</strong>\n<ul>\n<li>Bachelors Degree</li><li>Working knowledge of SAS, Python, Tableau, and UNIX</li><li>Subject Matter Expertise knowledge and experience with data projects in Bank system of records and authorized data sources for Traded, Market Risk and Asset Securitization products.</li><li>Subject Matter Expertise knowledge and experience with General Ledger data and reconciliation.</li><li>Ability to reconcile work stream data to the General Ledger and other definitive sources.</li>\n</ul>\n<strong>Shift:</strong><br><br>1st shift (United States of America)<br><br><strong>Hours Per Week:</strong><br><br>40"}