{"job title": "Project Data Analyst", "company": "Baylor College of Medicine", "city state": "– Houston, TX", "rating": "3.6", "job description": "A Project Data Analyst in the Baylor Improvement Group will facilitate performance improvement initiatives (projects) by turning data into information, information into insight and insight into business decisions. This Data Project Analyst will also assist project managers in managing performance improvement initiatives for BCM utilizing DMAIC/Lean Six Sigma tools. The Data Project Analyst role will report to Project Managers in the Baylor Improvement Group.\n\n\n<ul>\n<li>Collaborate with project managers to define, measure, analyze, implement, and control all performance improvements.</li>\n<li>Assist project managers with defining project plans to include charters, scope, milestones and timelines for performance improvements.</li>\n<li>Assist project managers with understanding and documenting current and future state processes.</li>\n<li>Attend project meetings and capture decisions, issues, and action items.</li>\n<li>Utilize data analysis and reporting of data to enable and control change through establishing and reporting on project KPIs.</li>\n<li>Interpret data, analyze results using statistical techniques and provide ongoing reports.</li>\n<li>Develop and implement databases, data collection systems, data analytics and other strategies that optimize statistical efficiency and quality.</li>\n<li>Acquire data from primary or secondary data sources and maintain databases/data systems. Identify, analyze, and interpret trends or patterns in complex data sets.</li>\n<li>Filter and 'clean' data by reviewing computer reports, printouts, and performance indicators to locate and correct code problems.</li>\n<li>Work with management to prioritize business and information needs.</li>\n<li>Locate and define new process improvement opportunities.</li>\n</ul>\n\nRequired: Bachelor degree in Mathematics, Economics, Computer Science, Information Management, Statistics or other related fields.\n<br><br>\nPreferred: Master degree in Mathematics, Economics, Computer Science, Information Management, Statistics or other related fields.\n<br><br>\nRequired: One year of relevant analytical experience.\n<br><br>\nPreferred: Lean Six Sigma"}