{"job title": "Government Contracting Data Analyst", "company": "Bloomberg BNA", "city state": "– Washington, DC (US)", "rating": "3.4", "job description": "Full timeResponsible for the acquisition of data, content and information to support the Government Contracting business.<br><br><strong><strong>POSITION OVERVIEW:</strong></strong>\n<br><br>\nRedefine How Washington Works\n<br><br>\nWhen government is at its best, diverse ideas are at work. The same is true of Bloomberg Government. Our ability to innovate and serve our clients means diversity and inclusion are essential. If you’re eager to join a multi-dimensional team that celebrates and leverages difference, if you have the vision to see how information can transform “business as usual” and if you are hungry to create-to build a service transforming how things get done—then stop reading this and join our team.\n<br><br>\nWho Thrives Here?\n<br>\nIndividuals who embrace hard work, act with urgency and collaborate without reserve thrive at Bloomberg Government. You are on the front lines of revolutionizing the information services industry in Washington-as high as our expectations will be of you, yours must be higher. If you are dogged, innovative and interested in work that contributes to causes greater than yourself, you belong at Bloomberg Government.\n<br><br>\nBloomberg BNA also provides legal, tax and compliance professionals with critical information, practical guidance and workflow solutions. We leverage leading technology and a global network of experts to deliver a unique combination of news and authoritative analysis, comprehensive research solutions, innovative practice tools, and proprietary business data and analytics. Bloomberg BNA is an affiliate of Bloomberg L.P., the global business, financial information and news leader.\n<br><br>\nBloomberg Government provides congressional, regulatory and legal news to government affairs and government relations professionals\n<br><br>\nWe are seeking a Research Analyst, Government Contracting to be responsible for the acquisition of data, content and information to support the Government Contracting business.\n<br><br>\n<strong><strong>RESPONSIBILITIES:</strong></strong>\n<ul>\n<li>Collect, review and summarizes data from multiple sources.</li><li>Identify and track major federal contracting programs.</li><li>Analyze and add value to open federal contracting solicitations.</li><li>Maintain hierarchical data on relationships among U.S. federal agencies.</li><li>Create innovative ways to enhance our systems and make our data-related processes more efficient, accurate and timely.</li><li>Participate in time-sensitive projects, and collaborates with colleagues to deliver new initiatives.</li><li>Act as a liaison with technology teams to enhance relevant product databases.</li><li>Provide a platinum level of service to customers.</li><li>Participate in special projects and perform other duties as assigned.</li>\n</ul>\nRE<strong>QUIREMENTS</strong>\n<br><br>\n1-2+ years’ experience in research, writing comprehensive reports and summary documents; experience summarizing federal contracts desired; prior experience or strong knowledge and understanding of the U.S. federal procurement process; ability to identify, understand, and summarize complex information from a variety of sources; excellent numerical skills; excellent verbal and written communication skills; high proficiency in Microsoft Excel required; strong knowledge and understanding of the U.S federal procurement process; keen interest in information management, technology and product development; ability to work quickly, accurately, and efficiently in a fast paced with shifting priorities; effective project management skills and ability to prioritize tasks; knowledge in information technology and statistical analysis or computer programming (i.e. VBA, SQL, MATLAB, Python, Regex) desirable; works effectively as a member of a team, including helping others as needed; ability to deal with internal and external customers in a professional manner; excellent organizational skills; ability to work independently; ability to conduct research with guidance from supervisor or higher-level analyst; experience using database software and/or desktop publishing systems desired. Bachelor’s degree or equivalent experience.\n<br><br>\n<strong>Candidates may be required to pass a test for this position.</strong>\n<br><br>\nBloomberg <strong>BNA IS AN EQUAL OPPORTUNITY EMPLOYER</strong> and fully subscribes to the principles of Equal Employment Opportunity. Bloomberg BNA has adopted an Affirmative Action Program to ensure that all applicants and employees are considered for hire, promotion, and job status without regard to race, color, religion, sex, national origin, age, disability, sexual orientation, marital or familial status, genetic information, disabled veteran, veteran, veteran of the Vietnam Era, or any other classification protected by law.<br><br>Apply Now!"}