{"job title": "Data Management Analyst", "company": "Cubic Corporation", "city state": "– San Diego, CA", "rating": "3.6", "job description": "<strong>Business Unit:</strong>\n<br><br>\n<strong>Cubic Transportation SystemsCompany Details:</strong>\n<br><br>\nCubic offers an opportunity to provide innovative technology for government and commercial customers around the globe, helping to solve their future problems today. We're the leading integrator of payment and information technology and services for intelligent travel solutions worldwide, and the leading provider of realistic combat training systems, secure communications and networking and highly specialized support services for military and security forces of the U.S. and allied nations. If you have an entrepreneurial spirit and thrive in an innovative environment, we want to talk to you about your next role at Cubic! We are seeking employees inspired by technology, and motivated by the rewards of hard work, commitment, teamwork, quality, integrity, and respect. We invite you to explore opportunities with Cubic.Job Details:\n<br><br>\n<strong>Job Summary:</strong>\n<br><br>\nPerforms contract and administrative tasks, in compliance with Cubic's policies and processes, to assist with the coordination and submittal of data items to Customers, principal subcontractors, and Cubic subsidiaries. As a collateral assignment, performs assigned administrative duties. This position typically works under close supervision and direction.\n<br><br>\n<strong>Essential Job Duties and Responsibilities:</strong>\n\n\n<ul>\n<li>Assists with Reviewing contracts, statements of work and specifications to determine data submission requirements</li>\n<li>Package and ship materials and products from Cubic to designated locations.</li>\n<li>Coordinates customer and subcontractor access to external SharePoint sites; resets passwords as requested.</li>\n<li>Assists with the creation of new SharePoint file exchanges; Ensures compliance with U.S. export license statutes and regulations.</li>\n<li>Maintain SharePoint user database.</li>\n<li>Stores and retrieves documents by electronic media to maintain control of documents.</li>\n<li>Supports requests to provide data for configuration audits.</li>\n<li>Assists with the preparation of estimates for completion of assigned programs.</li>\n<li>Uses developed database programs to run monthly schedules for data submittals.</li>\n<li>Runs on-time reports for programs and product lines.</li>\n<li>Maintain records and files.</li>\n<li>Maintains regular communication with customers, sub-contractors and supporting personnel.</li>\n<li>Compiles source data and prepares reports and summaries.</li>\n<li>Performs a variety of administrative duties involving all levels of complexity to support department management and staff; Takes initiative to resolve administrative issues and problems.</li>\n<li>Supports department travel actions which includes completion of expense authorizations and reports.</li>\n<li>In accordance with the Contracts Department Desk Guide, ensures compliance with departmental and company-wide contract policies and procedures so that work performed meets legal, regulatory, and contractual and company requirements.</li>\n</ul>\n\n<strong>Minimum Job Requirements:</strong>\n<br><br>\nFour year college degree in Business Administration or related field. Proficient in the use of PC and associated software. Ability to follow written and verbal direction, and effectively interface with technical employees, management, and customers. Must communicate effectively, both verbally and in written form. Ability to prioritize projects and work under tight deadlines. Good reasoning, problem solving and excellent organizational skills. Must be capable of working at a computer terminal (workstation) up to nine hours per day. Must be capable of lifting and transporting 30-pound boxes of various types of documentation.\n<br><br>\nThe description provided above is not intended to be an exhaustive list of all job duties, responsibilities and requirements. Duties, responsibilities and requirements may change over time and according to business need.\n<br><br>\n<strong>Worker Type:</strong>\n<br><br>\nEmployee"}