{"job title": "Admin Assistant / Data Analyst", "company": "EvergreenHealth", "city state": "– Monroe, WA", "rating": "3.7", "job description": "MISSION:\n<div>\n\tEvergreenHealth Monroe will advance the health of the community it serves through our dedication to high quality, safe, compassionate, and cost-effective health care.<br>\n\t<br>\n\tAdministrative Assistant / Data Analyst<br>\n\t<br>\n\tPOSITION SUMMARY:<br>\n\tThis is a unique role that provides support to the Quality department by assisting in organizing and coordinating schedules, activities, classes, and meetings. Will support committees, by preparing agendas, background material, attending meetings, taking notes and creating/distributing minutes. <br>\n <br>\n\tAssist in data collection and analysis, by collecting, preparing and analyzing all data and information for safety and operations improvement initiatives. The Admin Assistant/Data Quality Analyst will maintain reports for all data collected and manage data bases to obtain information. Responsible for data collection deadlines as set forth from various regulatory, accreditation, and national agencies. <br>\n\t<br>\n\tEXPERIENCE:<br>\n\tMinimum of two years of clerical experience in healthcare. BS or BA preferred with strong Microsoft Office application skills, specifically managing a database, report generation, and statistical compilation. Requires above average computer skills and preferred medical terminology knowledge. <br>\n\t<br>\n\tSKILLS:<br>\n\tExcellent written and verbal communication skills; interpersonal and organizational skills. Efficiently and effectively organize, plan, document, and assist in facilitation and evaluation of various teams, projects, and committees. Gather and track data and information, analyze and present data. Communicate effectively verbally and in writing. Must be versatile, cooperative, self-motivated and have good customer service skills. Adapt to a flexible work schedule to include early morning, or later in the day meetings and/or activities, to include an occasional weekend. Demonstrated ability to handle confidential information and conduct job functions in a professional manner. <br>\n\t<br>\n\t<br>\n </div>"}