{"job title": "Sr Data Analyst", "company": "IGT", "city state": "– Tallahassee, Florida", "rating": "3.2", "job description": "Sr Data Analyst\n<br><br>\nObjective: Provide expertise to acquire, manage, manipulate, and analyze data and report results. This position should have expert level understanding of lottery data and advanced analytics. The ideal candidate for this position should have performed as a Systems Analyst or Market Research Analyst in the past. The candidate should also have experience with campaign management systems, CRM analytical solutions and ability to create the best analytical and trend analysis with measurable impact. Interacts directly with Lottery Marketing, Sales and IT and supports analytical functions.\n<br><br>\n<strong>Job Responsibilities:</strong>\n\n\n<ul>\n<li>Identify, analyze, and interpret trends or patterns in complex data sets.</li>\n<li>Perform data entry, either manually or using scanning technology, when needed or required.</li>\n<li>In collaboration with others, interpret data and develop recommendations based on findings.</li>\n<li>Develop graphs, reports, and presentations of extracted results or data sets.</li>\n<li>Perform basic statistical analyses for data sets and reports.</li>\n<li>Analyze the data quality and critical dashboards.</li>\n<li>Generate routine and adhoc reports based on requests from business team(s).</li>\n<li>Responsibilities may also include: sales forecasting, business case development for new products, game content projects, developing future e-commerce strategies, and tracking of marketing campaigns to evaluate results and provide recommendations for future marketing promotions.</li>\n<li>Collaborate with cross functional teams like business, marketing and technology and deliver the required data analysis.</li>\n</ul>\n\n<strong>Knowledge/Skills:</strong>\n\n\n<ul>\n<li>Experience using Business Objects reporting using WEBI and Crystal Reports.</li>\n<li>Extensive experience in creating Tableau Dashboards with multiple data sets.</li>\n<li>Very good understanding of business work flows with the ability to align information with data analytics and reports.</li>\n<li>Understanding of data models and relational databases.</li>\n<li>Understanding of XML and SQL.</li>\n<li>Proficient in MS Word, Excel, Access and PowerPoint.</li>\n<li>Knowledge on VB Macros.</li>\n<li>Experience using SAS, SPSS, or other statistical packages are desirable for analyzing large datasets.</li>\n<li>Programming skills preferred. Adept at queries and report writing.</li>\n<li>Knowledge of statistics, at least to the degree necessary to communicate easily with statisticians.</li>\n<li>Experience in data mining techniques and procedures and knowing when their use is appropriate.</li>\n<li>Ability to present complex information in an understandable and compelling manner.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>Bachelor's Degree in Engineering, Mathematics, Statistics or other quantitative field, Master Degree preferred.</li>\n<li>4-6 years related experience.</li>\n<li>Lottery or Gaming industry experience, preferred.</li>\n<li>Ability to work with limited direction to determine and develop soluttions.</li>\n</ul>\n\n<strong>#LI-CS1</strong>\n<br><br>\n#di\n<br><br>\nApply on Company Website\n<br><br>\nJob ID: 58059\n<br><br>\nHelp us improve CareerBuilder by providing feedback about this job: .\n<br><br>\n<strong>CAREERBUILDER TIP</strong>\n<br>\nFor your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.\n<br>\nBy applying to a job using CareerBuilder you are agreeing to comply with and be subject to the CareerBuilder Terms and Conditions for use of our website. To use our website, you must agree with the Terms and Conditions and both meet and comply with their provisions.\n<br><br>\n<strong>IGT</strong>\n<br><br>\nWe enable players to experience their favorite games across all channels and regulated segments, from Gaming Machines and Lotteries to Interactive. Leveraging a wealth of premium content, substantial investment in innovation, in-depth customer intelligence, operational expertise and leading-edge technology, our gaming solutions anticipate the demands of consumers wherever they decide to play. We have a well-established local presence and relationships with governments and regulators in more than 100 countries around the world, and create value by adhering to the highest standards of service, integrity, and responsibility. IGT has over 12,000 employees. Contact Info\n\n\n<ul>\n<li>Tallahassee, FL</li>\n</ul>\n\nDon't miss out on new jobs like this\n<br><br>\nGet the latest jobs delivered to your inbox. Unsubscribe at any time.\n<br><br>\nCreate Job Alert\n<br><br>\nSaving Your Job Alert\n<br><br>\nJob Alert Created\n<br><br>\nWell, this is embarrassing. We are having trouble saving your search. You can try again or come back at a later time.\n<br><br>\nMaximum Email Alerts\n<br><br>\nThis email address has reached the maximum of 5 email alerts. To create a new alert, you will need to log into your email and unsubscribe from at least one."}