{"job title": "Marketing and Data Analyst", "company": "M&amp;T Bank", "city state": "– Buffalo, NY", "rating": "3.3", "job description": "Title: Marketing and Data Analyst\n<br><br>\nLocation: M&amp;T Center, Buffalo NY\n<br><br>\n<strong>Function:</strong>\n<br><br>\nResponsible for providing complex, non-routine analytical, technical and operational support at the business or department level. May act as project leader on less complex but highly visible projects.\n<br><br>\n<strong>Position Responsibilities:</strong>\n<br><br>\nThe position is responsible for support in a variety of functions to include but not limited to the following:\n<br><br>\nReporting\n\n\n<ul>\n<li>Quarterly prospect meeting (e.g. manage meeting, communications and prospect database)</li>\n<li>Pipeline reporting (e.g. ERM sales opportunities via Tableau)</li>\n<li>Key lead reporting for Business Partners</li>\n<li>Preparation of periodic and ad hoc reporting requested by the Area Executive or Regional President</li>\n<li>Weekly Market Update Reporting</li>\n<li>Monthly projected new loan closing/payoff reporting for Finance</li>\n<li>Work with Commercial Marketing, Finance, etc. on the preparation of Board and/or Management Group presentations</li>\n<li>Market disruption tracking and reporting</li>\n<li>Quarterly Department Newsletter (e.g. outlining personal and professional achievements)</li>\n</ul>\n\nMarketing\n\n\n<ul>\n<li>Prepare and disseminate marketing materials to customers and prospects (e.g. thought leadership)</li>\n<li>Prepare marketing materials for distribution on customer/prospect calls</li>\n<li>Utilize SAVO to prepare ad hoc presentations for customer/prospect calls</li>\n<li>Utilize social media to promote employees of Department and Bank in general (e.g. 40 Under 40)</li>\n<li>Collaborates with compliance when preparing any new external communications</li>\n</ul>\n\nEvent Planning\n\n\n<ul>\n<li>Create and maintain upcoming event list. Assigns table captains and performs necessary follow-up</li>\n<li>Department event management. Management of event from start to finish. Responsibilities will include confirming contact information, sending invitations, tracking responses, perform necessary follow-up, etc.</li>\n<li>Schedule Business Partner department training</li>\n<li>Collaboration with other departments of the Bank when planning events with a broader scope of guests</li>\n<li>COI event management. Need an organized strategy for maintaining relationships with COI</li>\n</ul>\n\nResearch\n\n\n<ul>\n<li>Perform industry/market research as requested</li>\n<li>Disseminate pertinent news related to customers/prospects on a timely basis</li>\n</ul>\n\nDepartment Liaison\n\n\n<ul>\n<li>HR New employee onboarding</li>\n<li>IT (e.g. computers, SARs</li>\n<li>Facilities Department</li>\n</ul>\n\n<strong>Minimum Qualifications Required:</strong>\n\n\n<ul>\n<li>Bachelor's degree in an applicable field (i.e. Business, Finance, Statistics, Marketing, MIS) or the equivalent in work experience.</li>\n<li>Five to seven years' experience in field.</li>\n<li>Strong verbal and written communication skills</li>\n<li>Strong analytical ability and creative problem solving skills</li>\n<li>Ability to multitask, is organized and detail oriented</li>\n<li>Ability to interact with all levels of personnel (e.g. Area Executive, Regional President)</li>\n<li>Detail oriented</li>\n<li>Self-starter</li>\n</ul>\n\n<strong>Ideal Qualifications Preferred:</strong>\n\n\n<ul>\n<li>One to two years of relevant work experience, preferably in the financial services experience.</li>\n<li>Two years' prior departmental experience.</li>\n<li>Proficient in the use of spreadsheet (Excel), database management, presentation, and department specific software (ERM, CLAS, the HUB, etc.)</li>\n</ul>\n\n<strong>About M&amp;T:</strong>\n<br><br>\nAt M&amp;T, we strive to be the best place our employees ever work, the best bank our customers ever do business with and the best investment our shareholders ever make. So when looking to advance your career, look to M&amp;T. As a top 20 US bank holding company and one of the best performing regional banks in the country, we offer a wide range of performance based career development opportunities for talented professionals. And through our longstanding tradition of careful, conservative and consistent management and a strong commitment to the communities we serve, we continue to grow with a focus on the future.\n<br><br>\n#LI-LP1<br><br>SDL2017"}