{"job title": "Data Analyst II", "company": "Mapfre Insurance", "city state": "– Webster, MA", "rating": "2.6", "job description": "Data Analyst II (Webster, MA)<br><br>Location: Webster, MA<br><br>Online Advertisement<br><br>The Data Analyst II (MAPFRE U.S.A. Corp.; Webster, Massachusetts): Will be critical in achieving our vision of establishing predictive analytics as a competitive advantage of MAPFRE U.S.A. Corp. The Data Analyst II will have strategic impact on potentially all functional areas including marketing, product, actuary, operations, and claims. The Data Analyst II will be responsible for identifying both internal and external data sources, extracting and cleansing data elements, creating variables and datasets, and utilizing programming and analytical skills to conduct qualitative and quantitative analysis related to pure premiums, customer life time value, customer buying behaviors, retention and other topics. The qualified individual will also develop processes and applications to facilitate internal deployment of models and work as a liaison with IT for enterprise implementation. The Data Analyst II will additionally monitor the performance of models in production and maintain quality documentation on all data subjects. Specific Duties include: Develop internal programs and applications to expedite implementation of models, and work as the central liaison with IT to implement final models in production; utilize programming and analytical tools including SAS, SQL, Oracle or similar relational database tool to formulate mathematical or simulation models; monitor and maintain models in production; develop and maintain documentation on data systems, elements and processes; perform quantitative and qualitative analysis of insurance data, relating constants and variables, restrictions, alternatives, conflicting objectives, and their numerical parameters; identify and master both internal and external data sources for analysis; define data requirements and gather and validate information, applying judgment and statistical tests; develop data structures to support the generation of business insights and strategy; maintain data infrastructure and develop scripts for regular processes; communicate and present data to management by developing and automating reports; analyze data analysis requests obtained from management to determine operational problems and define data modeling requirements, validation of content, and problem-solving parameters; identify opportunities to use data to develop new strategies and improve business performance and utilize knowledge of mathematical modeling and other optimization methods to perform quantitative and qualitative data analysis; and participate in on-going training and serve as technical mentor for junior team members.<br><br>Minimum requirements: Master's degree or its equivalent in Computer Science, Information Systems, or related quantitative field. Alternatively, will accept Bachelor's degree or its equivalent in Computer Science, Information Systems, or related quantitative field; and 5 years of experience in insurance, banking, credit card or other financial industries, or comparable consulting experience.<br><br>Must have: Demonstrated understanding and in-depth knowledge of insurance, banking, credit card or other financial industries practices, standards, and concepts within field of work; demonstrated strong programming skills in SQL, SAS, VBA, Excel, Access; proven ability in data modeling, merge/purge, query, and reporting in SAS, DBMS (e.g. Oracle, DB2, Access), and other systems; demonstrated knowledge with quantitative and qualitative analysis; proven programming ability with at least one of the following: SQL Server, Teradata, UNIX, LINUX, MVS, R, SAS Enterprise Miner, Congos, C, C++, JAVA, or other relevant programming languages; proven ability to effectively communicate on the telephone and in person; proven ability to make decisions using broad management limits, applying guidelines and procedures; proven ability to work independently under general supervision; and proven ability to apply knowledge to determine solutions to complex problems with minimal direction, using research and analysis to develop innovative and practical solutions which are consistent with organizational objectives. (Unless otherwise indicated, MAPFRE U.S.A. CORP. is seeking the ability in the skills listed above with no specific amount of years of experience required. All experience can be gained concurrently.)<br><br>Apply online at https://jobs.mapfreinsurance.com. Job code: 2403. An EOE.<br><br>Online(2018)<br><br>If you require an accommodation for a disability so that you may participate in the selection process, you are encouraged to contact the MAPFRE Insurance Talent Acquisition team at talentacquisition@mapfreusa.com.<br><br>We are proud to be an equal opportunity employer."}