{"job title": "Senior Data Analyst, Medicine", "company": "Mount Sinai Health System", "city state": "– New York-New York", "rating": "3.5", "job description": "Strength Through\n<br>\nDiversity\n<br><br>\nGround breaking science.\n<br>\nAdvancing medicine. Healing made personal.\n<br><br>\n<strong>Senior Data Analyst -\n<br>\n2339628</strong><br>\n<div></div>\n<br><strong>Roles &amp;\n<br>\nResponsibilities:</strong>\n<br><br>\nThe Senior Data Analyst oversees activities\n<br>\nrelated to data integrity, security and enhancement of the value of data\n<br>\nincluding data cleaning, query tracking, and developing and implementing\n<br>\npolicies and procedures. The Senior Data Analyst may direct the movement of\n<br>\ndata across multiple systems; oversee its validation and organization and make\n<br>\nsure that data is available to appropriate people and systems within an\n<br>\norganization\n<ul>\n<li>Uses modeling techniques and tools in analyzing\n<br>\nand specifying data structure in large and/or complex data sets</li><li>Implements best practices in data management to\n<br>\nensure the integrity of the data, the quality of data processes and delivers analyzable\n<br>\nor analyzed data to a variety of internal and external clients of the Medical\n<br>\nCenter</li><li>Recommends best practices for data\n<br>\ntransformations to support the data movement. Defines data migration\n<br>\nrequirements, gathering, validating and documenting data requirements</li><li>Translates, merges, cleans up and/or maps data\n<br>\ninto conceptual, logical and physical data models</li><li>Oversees all activities related to data\n<br>\ncleansing, data quality and data consolidation using industry standards and\n<br>\nprocesses</li><li>Identifies, develops, and documents data\n<br>\nstandardization, data enrichment operations, data validations, data security\n<br>\nrequirements, and data exception handling processes</li><li>Documents, implements, maintains or recommends\n<br>\noperating methods to improve processing, distribution, data flow, collection,\n<br>\ndatabase editing procedures</li><li>May define parameters for file or space\n<br>\nutilization</li><li>Works closely with IT management and staff</li><li>May access data in the Data Warehouse, as\n<br>\nrequired</li><li>Assists faculty and staff with queries,\n<br>\nstatistical analyses, reports and technical difficulties related to data\n<br>\nretrieval</li><li>Designs and writes custom applications needed to\n<br>\nensure the database meets requirements for the entry, management and reporting\n<br>\nof data</li><li>Recognizes recurring issues and analyzes causes\n<br>\nin order to reach a solution. Generates plans and provides tools/techniques for\n<br>\nimprovement and to measure success</li><li>Trains staff with varying degrees of knowledge to\n<br>\neffectively use the database system</li><li>Maintains knowledge of the current regulations\n<br>\nand technologies related to data management</li><li>May write and prepare manuscripts and other\n<br>\nmaterials for internal and external audiences</li><li>Performs other related duties.</li>\n</ul>\n\n<strong><div> Requirements:</div>\n\n<br></strong>\n\n<ul>\n<li>Education: Bachelor’s degree in computer science, statistics and/or related field.\n<br>\nMaster’s degree in relevant field of study preferred</li> <li>Advanced knowledge of database applications /\n<br>\nmanagement, SQL and /or SAS</li><li>Intermediate MS Office (Word, Excel), Access,\n<br>\nOutlook</li><li>Experience with SQL relational database\n<br>\nmanagement systems (Oracle, SQL Server, MySQL, PostgreSQL) preferred</li> \n</ul>\n<strong><u>Strength\n<br>\nThrough Diversity</u></strong>\n<br><br>\nThe Mount Sinai Health\n<br>\nSystem believes that diversity and inclusion is a driver for excellence. We\n<br>\nshare a common devotion to delivering exceptional patient care. Yet we’re as\n<br>\ndiverse as the city we call home- culturally, ethically, in outlook and lifestyle.\n<br>\nWhen you join us, you become a part of Mount Sinai’s unrivaled record of\n<br>\nachievement, education and advancement as we revolutionize healthcare delivery\n<br>\ntogether.\n<br><br>\nWe work hard to recruit\n<br>\nand retain the best people, and to create a welcoming, nurturing work\n<br>\nenvironment where you have the opportunity and support to develop\n<br>\nprofessionally. We share the belief that all employees, regardless of job title\n<br>\nor expertise, have an impact on quality patient care.\n<br><br>\nExplore more about this\n<br>\nopportunity and how you can help us write a new chapter in our story!\n<br><br>\n<strong><u>Who\n<br>\nWe Are</u></strong>\n<br><br>\n<strong>Over 38,000 employees\n<br>\nstrong, the mission of the Mount Sinai Health System is to provide\n<br>\ncompassionate patient care with seamless coordination and to advance medicine\n<br>\nthrough unrivaled education, research, and outreach in the many diverse\n<br>\ncommunities we serve.</strong><br>\n<div></div>\n<br><strong>Formed in September\n<br>\n2013, The Mount Sinai Health System combines the excellence of the Icahn School\n<br>\nof Medicine at Mount Sinai with seven premier hospitals, including Mount Sinai\n<br>\nBeth Israel, Mount Sinai Brooklyn, The Mount Sinai Hospital, Mount Sinai\n<br>\nQueens, Mount Sinai West (formerly Mount Sinai Roosevelt), Mount Sinai St.\n<br>\nLuke’s, and New York Eye and Ear Infirmary of Mount Sinai.</strong>\n<br><br>\nThe Mount Sinai Health\n<br>\nSystem is an equal opportunity employer. We promote recognition and respect for\n<br>\nindividual and cultural differences, and we work to make our employees feel\n<br>\nvalued and appreciated, whatever their race, gender, background, or sexual orientation.\n<br><br>\n<strong>EOE\n<br>\nMinorities/Women/Disabled/Veterans</strong>"}