{"job title": "Sr. Data Analyst", "company": "Mr. Cooper", "city state": "– Irving, TX", "rating": "3.2", "job description": "When you click 'Apply', you will need to click on 'Create Account'. By creating an account, you will be able to view your applications and their statuses. Your password must contain 8 characters, 1 upper case letter, 1 number and 1 special character.<p></p><b>Check It Out!</b><p></p><p>Ready to be a Cooper too? This might just be right up your alley!</p><p></p><p>We’re here to keep the dream of home ownership alive. Oh, and while we’re at it, we’re determined to change the lending industry itself. It’s simple, but it won’t be easy. And we’ll need a great team behind us. (That’s where you come in.) We want to show the world that transparency, candor and collaboration aren’t just good values. They’re good business. Working here isn’t for people who want to punch a clock. It’s for people who want to punch a hole in the status quo. Come join us. And make a difference instead of just a living.</p><p></p><p><b>JOB SUMMARY</b><br>The Sr. Data Analyst position plays a key role in facilitating data requirement meetings with business and technical stakeholders and resolve conflicts to drive decisions. This person will participate in all IT and Business related discussions in understanding the data generation (upstream) and data consumption (downstream). <br><br>This position is critical to driving the strategic value in laying strong foundational models, providing clear directional path to Data Integration (ETL) team to develop jobs; in helping Database Administrators (DBA) in ease of maintenance and in operations such as loading and extracting data into those; and in providing inputs to the Architecture team for designing the solution.<br><br><b>ESSENTIAL JOB FUNCTIONS</b><br> </p><ul><li>Establish and maintain comprehensive data model documentation including detailed descriptions of business entities, attributes, and data relationships</li><li>Be able to perform analysis on data and access patterns to determine constraints.</li><li>Provide data mappings requirements, user interface specifications, processing logic as per business requirements to the ETL team.</li><li>Understands the flow of data, business processes/technical interfaces that would be created or impacted.</li><li>Document purpose and driver behind each of the models.</li><li>Document logical, physical models complete with business definitions.</li><li>Maintain the data dictionary, business data glossary, naming conventions, standards and abbreviations and their intended meanings in a central repository</li><li>Identifies and document sources of existing data as well as the new data. Understands use of master and reference data including sources and contributors</li><li>Consult, discussion with business partners, peer Data Architects, Engineers in understanding the requirements, setting and managing expectations in relation to deliverables</li><li>Ability to prioritize and handle multiple projects.</li><li>Have joint accountability with data stewards and data architects on the projects to ensure conformance to enterprise data governance policies around information risk and data protection guidelines. Data analysts should be familiar with common policies around data masking and protection schemes.</li><li>Be able to provide best approaches to data storage in terms of achieving separable Business data vs non-business data (Natural keys vs Surrogate keys)</li><li>Present the model, access path and lineage as needed (into such formats as excel, if required)</li><li>Be able to participate in Business discussion and prepare initial source-to-target mappings</li><li>Have working knowledge in Agile environments and adopt to multiple itineraries running in concurrency. Must be able to document user stories and take it forward with the development team to implement stories. </li><li>Other related duties as assigned (to data modeling, data access)</li><li>Maintains data dictionary by revising and entering definitions.<br><br><br><b>EDUCATION / EXPERIENCE REQUIREMENTS:</b></li><li>Graduation from a 4-year college or university with major course work in a discipline related to the requirements of the position is preferred. Will consider the equivalent combination of job experience &amp; education that demonstrates the ability to perform the essential functions of this job.</li><li>Minimum 5+ years of experience as a data analyst with modeling experience</li><li>Senior level knowledge in Core Competencies: Hands-on experience in developing data models, and data warehouses, development knowledge</li><li>At least 5 years experience with locating data sets and prepares data or defines the specifications to prepare data from multiple sources: scripting, database management and queries</li><li>Must have good knowledge and experience with industry leading Modeling tools </li><li>Good hands-on experience in working with relational databases (in creating DDLs and Access paths – DCL). Preferred knowledge in: SQL*Server, Netezza, Oracle, MySQL, ETL ,BI</li><li>Demonstrated superior competence in soft skills associated with core competencies such as documentation, communication, leadership, facilitation, team management &amp; customer relationships.</li><li>Ability to clearly communicate outcomes, technical artifacts and status to senior management team.</li><li>Must have familiarity and deep knowledge of modeling multi-source (Systems of Record – SOR) integration (into single ‘source of truth’) type data architecture</li><li>Must have knowledge of and working experiencing in modeling “SCD – type 2” for tracking historical changes</li><li>Highly skilled in managing all aspects of all sizes and complexities of multiple projects simultaneously across the software development life cycle phases (SDLC)</li><li>Knowledge of Finance industry – especially Mortgage industry is a plus</li><li>Strong track record of interviewing business partners, setting and managing expectations in relation to deliverables and requirements</li><li>Solid understanding of Agile development methodologies and software project life cycle and associated methodologies</li><li>Development experience in SQL / ETL / BI ( package , stored procedure ) is preferred.</li><li>Strong analytical skills with the ability to collect, organise, analyse, and disseminate significant amounts of information with attention to detail and accuracy</li><li>Knowledge of Finance-Mortgage industry is preferable</li><li>Experience with standard systems analysis tools and procedures</li><li>Excellent problem solving skills and analytical skills</li><li>Excellent verbal and written communication skills with the ability to establish deep understanding of clients’ business issues</li><li>Excellent customer servicing skills</li><li>When required, be able to lead teams and implementing measures and processes</li><li>Proven ability to confirm testing objectives, verify requirements are testable and trace testability back to requirements<br> </li></ul><p></p><p></p><p>Job Requisition ID:</p>4331<p></p><p>Job Category:</p>Information Technology<p></p><p>Primary Location City:</p>Irving<p></p><p>Primary Location Region:</p>Texas<p></p><p>Primary Location Postal Code:</p>75063<p></p><p>Primary Location Country:</p>United States of America<p></p><p>Posting Organization:</p>Mr. Cooper<p></p><p>Line of Business:</p>Corporate<p></p><p>Additional Posting Location(s):</p><p></p><p>Alternate Requisition:</p>No"}