{"job title": "Pharmacy Data Analyst", "company": "Providence Health&amp;Services", "city state": "– Portland, OR", "rating": "3.4", "job description": "Providence is calling a Pharmacy Data Analyst (1.0 FTE, Days) to Providence Home Services Building in Portland, OR.\n<br><br>\n<strong>In this position, you will:</strong>\n\n\n<ul>\n<li>Provide support and analysis of Specialty Pharmacy assigned computer systems, to include, but not limited to, product/inventory, procedure code, and related tables.</li>\n<li>Perform all duties in a manner which promotes team concept and reflects the Providence Health and Services mission and philosophy.</li>\n</ul>\n\n<strong>Required qualifications for this position include:</strong>\n\n\n<ul>\n<li>Associate Degree</li>\n<li>2 years Health Information Systems experience</li>\n<li>Ability to travel within the Providence Health&amp;Services (PHS) Oregon Service Area</li>\n<li>Demonstrated experience developing data standards</li>\n<li>Demonstrated experience using structured query languages (SQL) and stored procedures</li>\n<li>In compliance with the Providence Health&amp;Services policies, a criminal background check is required for this position, based on assigned duties</li>\n</ul>\n\n<strong>Preferred qualifications for this position include:</strong>\n\n\n<ul>\n<li>Experience in a health care environment involving medication distribution</li>\n</ul>\n\nAbout Providence in Oregon\n<br><br>\nAs the largest healthcare system and largest private employer in Oregon, Providence offers exceptional work environments and unparalleled career opportunities.\n<br><br>\nThe Providence Experience begins each time our patients or their families have an encounter with a Providence team member and continues throughout their visit or stay. Whether you provide direct or indirect patient care, we want our patients to feel that they are in a welcoming place where they can be comfortable and free from anxiety. Our employees create the Providence Experience through simple, caring behaviors such as acknowledging and welcoming each visitor, introducing ourselves and Providence, addressing people by name, providing the duration of estimated wait times and updating frequently if timelines change, explaining situations in a way that puts patients at ease, carefully listening to their concerns, and always thanking people for trusting Providence for their healthcare needs. At Providence, our quality vision is simple,\n<br><br>\n\"Providence will provide the best care and service to every person, every time.\"\n<br><br>\nProvidence is consistently ranked among the top 100 companies to work for in Oregon. It is also home to two of our award-winning Magnet medical centers. Providence hospitals and clinics are located in numerous areas, ranging from the Columbia Gorge to the wine country to sunny southern Oregon to charming coastal communities to the urban setting of Portland. If you want a vibrant lifestyle while working with a team highly committed to the art of healing, choose from our many options in Oregon."}