{"job title": "Quality Assurance Data Management Analyst", "company": "Saputo", "city state": "– Dallas, TX", "rating": "3.7", "job description": "The Quality Data Analyst is responsible for SAP quality support activities. Provide technical support specifically for SAP QM business processes/requirements, functional and technical specifications.\n<br><br>\n<strong>Duties and Responsibilities:</strong>\n\n\n<ul>\n<li>QA Data Producer for MDG Materials - produces the QM views for all appropriate material types within the process of maintaining material master in ECC/EWM.</li>\n<li>Provides business processes/requirements, functional and technical specification support to ensure system efficiency and integration with the overall solution.</li>\n<li>Actively monitor and optimize QM inspection setup to ensure accuracy.</li>\n<li>Supports existing system in plant QA lab operations.</li>\n<li>Assists in creating documents for newly implemented systems and/or processes - creates job aids and work instructions for end users.</li>\n<li>Exercises independent judgement and decision making, based on system and subject matter expertise.</li>\n<li>Approves QM security role adjustments to meet the changing business environment.</li>\n<li>Ability to design and create reports using data in relevant SAP modules (ECC, EWM, GBT, DMS).</li>\n<li>Comply with the Saputo Code of Ethics and Actively apply the Saputo Values.</li>\n<li>Other duties and responsibilities as assigned.</li>\n</ul>\n\nJob Requirements\n\n\n<ul>\n<li>Bachelor's Degree, with a concentration in Food Safety, Microbiology or equivalent.</li>\n<li>Practical lab experience preferred, include knowledge of current lab practices (Sampling, testing, and reporting, incoming inspection, production inspections, goods receipt inspections, distribution inspections, customer return inspections).</li>\n<li>Business experience that includes experience with QA/QC/QM systems, procurement, production execution, warehouse management is preferred.</li>\n<li>Previous experience in QM, Materials Management, Production Planning (PP) preferred.</li>\n</ul>\n\n<strong>Knowledge, Skills and Abilities:</strong>\n\n\n<ul>\n<li>Excellent presentation, documentation, and project management skills.</li>\n<li>Ability to work independently or within a team environment.</li>\n<li>Ability to communicate effectively (written, verbal) with all levels throughout the organization.</li>\n<li>Ability to adapt to changing organizational and operational needs; ability to lead others through change.</li>\n<li>Ability to handle multiple tasks simultaneously.</li>\n<li>Skill in organization and prioritization, and attention to detail.</li>\n<li>Strong team player and leader with the ability to work across multiple functions and disciplines.</li>\n<li>Ability to define problems, collect data, establish facts and draw valid conclusions.</li>\n<li>Ability to work flexible hours and provide after-hours support.</li>\n</ul>\n\nRelocation Offered\n<br><br>\nExemption Type\n<br><br>\nExempt\n<br><br>\nSaputo Cheese USA Inc. and Saputo Dairy Foods USA, LLC endeavors to make CareersUSA.Saputo.com accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact Human Resources at 214-863-2300 or Deltek.Support@Saputo.com. This contact information is for accommodation requests only and cannot be used to inquire about the status of applications. Saputo Cheese USA Inc. and Saputo Dairy Foods USA, LLC are equal opportunity employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran statusus. If you'd like more information on your EEO rights under law, please visit www.EEOC.gov."}