{"job title": "Tax Data Analyst/Project Coordinator", "company": "State of Indiana", "city state": "– Indianapolis, IN", "rating": "3.2", "job description": "Work for Indiana\n<br><br>\nJoin U.S News&amp;World Report's #1 state government! With more than 50 executive branch agencies, the State of Indiana is a diverse workforce offering applicants stimulating and challenging projects across a broad scope of career opportunities. As a State of Indiana employee, you impact the well-being of Indiana's communities every day.\n<br><br>\nIndiana Department of Local Government Finance\n<br><br>\nThe Department of Local Government Finance is responsible for ensuring property tax assessment and local government budgeting are carried out in accordance with Indiana law. The Department is charged with publishing property tax assessment rules and annually reviewing and approving the tax rates and levies of every political subdivision in the state, including all counties, cities, towns, townships, school corporations, libraries, and other entities with tax levy authority.\n<br><br>\nTax Data Analyst/Project Coordinator\n<br><br>\nThe Tax Data Analyst/Project Coordinator for the Department of Local Government Finance (DLGF) performs a dual role by both performing compliance reviews for the Data Analysis Division and serving in a support and advising capacity on projects relating to Gateway for Indiana Government. Gateway project support and data compliance have historically been separated into two distinct roles; consequently, the Tax Data Analyst/Project Coordinator will be expected to succeed performing a diverse set of tasks.\n<br><br>\nData compliance tasks will include reviewing data submissions from approximately half of Indiana's 92 counties for alignment with 50 IAC 26 and any future regulations. Gateway project support will include communications and outreach, local official training and customer service, and software development/testing, but may also extend to other types of projects. The Tax Data Analyst/Project Coordinator will work under the direction of the Director of Data Analysis and will work closely with other members of the Data Analysis Division. The Tax Data Analyst/Project Coordinator must have the ability to think and manage strategically, with an emphasis on analysis, planning and achieving measurable results.\n<br><br>\nA day in the life\n\n\n<ul>\n<li>Serve as a data compliance administrator, including completion of the data compliance checks for real property, personal property, annually assessed mobile home property, sales disclosure, and tax data for approximately half of Indiana's 92 counties.</li>\n<li>Manage, track, and assist in the fulfillment of public records requests that are relayed to the Data Analysis Division.</li>\n<li>Monitor a DLGF customer service inbox (data@dlgf.in.gov) and reply to questions related to data compliance and 50 IAC 26, along with any future regulations.</li>\n<li>Serve as a customer service coordinator for Gateway and related applications, including responding to inquiries that are sent to the Gateway inbox (gateway@dlgf.in.gov) and answering calls regarding the Gateway applications as necessary.</li>\n<li>Assist members of the Data Analysis Division with testing and implementation of updates to current Gateway applications, including Budget forms, Debt Management, and TIF Management, as well as with new Gateway applications that may be developed in the future.</li>\n<li>Represent the Department in the local community, including conveying Gateway information and training to officials through formal presentations, public appearances, and training sessions. These tasks will require in-state travel.</li>\n<li>Assist members of the Data Analysis Division with the preparation, conducting, and evaluation of property tax management system software vendor compliance testing per the requirements of 50 IAC 26.</li>\n<li>Assist in the preparation of presentations, training curriculum, training guides, and other documentation as needed.</li>\n</ul>\n\nWhat we're looking for\n\n\n<ul>\n<li>A Bachelor's degree or equivalent experience in Communications, Public Relations, Marketing, Public Affairs, Accounting, Information Systems, or a related field, plus a minimum of one to two years professional related work experience or internship experience is preferred.</li>\n<li>Strong creative, strategic, analytical, organizational and interpersonal skills.</li>\n<li>Demonstrated effectiveness as a communicator, both orally and in writing.</li>\n<li>Ability to work independently and as a member of a collaborative team.</li>\n<li>Ability to manage multiple projects and priorities simultaneously and to thrive in a fast-paced, high-profile work environment.</li>\n<li>Strong knowledge of current property tax and budgeting issues and policies.</li>\n<li>Strong computer literacy, especially in word processing, spreadsheet applications, and databases.</li>\n</ul>\n\n<strong>Benefits</strong>\n<br><br>\nThe State of Indiana offers a comprehensive benefit package which includes:\n\n\n<ul>\n<li>Choose from four medical plans (including RX coverage), vision and dental</li>\n<li>Wellness program that offers eligibility into a discounted medical plan</li>\n<li>Health savings account, offered for most medical plans, includes state contributions</li>\n<li>Deferred compensation account (similar to a private sector's 401 K plan) with employer match, as well as a choice between two fully funded pension plans</li>\n<li>Group life insurance</li>\n<li>Employee assistance program that allows for covered behavioral health visits</li>\n<li>Paid vacation, personal and sick time off</li>\n<li>The State of Indiana offers other generous leave policies covering a variety of employee needs</li>\n<li>New Parent Leave</li>\n<li>12 company paid holidays, 14 on election years</li>\n<li>Free Downtown Parking</li>\n<li>Qualified employer for the Public Service Loan Forgiveness Program</li>\n</ul>\n\n<strong>Equal Employment Opportunity:</strong>\n<br><br>\nThe State of Indiana is an Equal Opportunity Employer."}