{"job title": "Data Governance Analyst Sr.", "company": "UMB Financial", "city state": "– Kansas City, MO", "rating": "3.9", "job description": "Data Governance Analyst Sr.\n<br><br>\n<strong>09-17-2018</strong>\n<br><br>\n<strong>What You'll Do</strong>\n<br>\nThe Data Governance Analyst Sr. will be responsible for serving as a subject matter expert on data governance and records management. This person will report to the Director of Information Security Risk Management, who describes this role as \"making sure we have the right information in the right hands, at the right time. This role will bring that single point of focus to a number of different functions at UMB.\"\n<br>\nKey highlights of this role will include the following:\n\n\n<ul>\n<li>Showing ownership of job responsibilities, and indirectly managing business partner priorities</li>\n<li>Supporting the execution of a multi-year roadmap to enhance UMB's data governance and records management capabilities</li>\n<li>Maintaining great working relationships with key stakeholders (e.g. Record Coordinators, Data Stewards, etc.) to meet program objectives.</li>\n<li>Conducting periodic risk and gap assessments to evaluate existing controls</li>\n<li>Providing regular reporting on program objectives to senior leadership</li>\n<li>Promoting program objectives throughout the organization, providing input to UMB's Security Awareness Program</li>\n<li>Providing input on information security policies, along with standards and procedures owned by business partners</li>\n<li>Evaluating new regulatory developments or industry guidance, providing recommendations to mitigate potential gaps</li>\n<li>Leading special projects as assigned</li>\n</ul>\n\n<strong>Requisition Number</strong>\n<br>\n<strong>9384BR</strong>\n<br><br>\n<strong>At UMB</strong>\n<br>\nWe strive to deliver the unparalleled customer experience, and show customers they can count on more from UMB. The same is true for our associates. You can count on more benefits, more training, more support, and more opportunity!\n<br><br>\n<strong>What you'll get:</strong>\n<br>\n<strong>Unique Benefit Programs :</strong>  We offer a great benefits package including several unique programs like an incentive-based wellness program, parental leave, adoption assistance and health care for you, your spouse or domestic partner, your dependents and even your pets!!\n<br>\n<strong>Professional Development:</strong> We provide our associates with the tools they need to support their career goals - including training, tuition reimbursement and career guidance.\n<br>\n<strong>Community Involvement:</strong> Giving back is a big part of who we are! We support several great causes throughout the UMB footprint. We even offer Volunteer Time Off, which allows associates to dedicate 16 hours a year to a worthy cause of their choice.\n<br>\n<strong>Culture of Diversity and Inclusion:</strong> We are committed to building a strong UMB by hiring talented, high-performing associates with diverse backgrounds. Maybe you simply want to work at a company where you have a voice and an opportunity to share your unique ideas.\n<br><br>\nPlease visit us at careers.umb.com to view a list of all available opportunities. UMB is an Equal Opportunity Employer. Principals only. No 3rd parties or agencies, please.\n<br><br>\n<strong>Work Schedule</strong>\n<br>\nMonday-Friday: 8:00am-5:00pm\n<br><br>\n<strong>Division Name</strong>\n<br>\nCorporate Risk Services\n<br><br>\n<strong>City</strong>\n<br>\nKansas City\n<br><br>\n<strong>Preferred Requirements</strong>\n\n\n<ul>\n<li>Professional certification such as IGP, CRM, RMA, etc.</li>\n</ul>\n\n<strong>Job Title</strong>\n<br>\nSenior Data Governance Analyst\n<br><br>\n<strong>Address</strong>\n<br>\n1010 Grand Blvd\n<br><br>\n<strong>Shift</strong>\n<br>\nFull Time\n<br><br>\n<strong>State</strong>\n<br>\n<strong>MO</strong>\n<br><br>\n<strong>In this Role, You will Need</strong>\n\n\n<ul>\n<li>In-depth knowledge of data governance and records management best practices.</li>\n<li>Experience in conducting, assessing or governing data classification, records management or data disposal processes, along with risk assessments or compliance testing.</li>\n<li>Strong knowledge of risk and controls.</li>\n<li>Ability to think and plan strategically.</li>\n<li>Strong organizational and planning skills.</li>\n<li>Strong risk analysis skills.</li>\n</ul>\n\n<strong>Who You Are</strong>\n\n\n<ul>\n<li>Bachelor's degree in Business Administration, Computer Science, Engineering, or related discipline from an accredited college or university. Or equivalent work experience.</li>\n<li>Five (5) years of experience in audit, risk management, or compliance, with a focus on data governance or records management.</li>\n</ul>"}