{"job title": "Data Governance Analyst", "company": "US Bank", "city state": "– Minnesota-MN-Saint Paul", "rating": "3.5", "job description": "<div>U.S. Bank is seeking a detail-oriented Data Governance Analyst with proven communication and documentation experience to contribute toward the success of our business line in managing adherence to our Enterprise Data Governance policy. This individual will report directly to the Business Line Data Governance Lead and be responsible for the coordination and documentation of authorized data sources, coordinating and drafting of data flow documentation, updating data flows as applicable, participating in data quality initiatives, and ensuring adherence to all organizational policies as it relates to data flow and metadata management. He/she will have experience working with applications and databases as a technical or support owner, be familiar with business process modeling, and demonstrate an ability to architect a specified flow of activities using data flow tools. Additional responsibilities include: </div>\n<ul>\n<li>\n<div>Takes the lead in performing research, analysis, scheduling, review, implementation, and monitoring of existing and new authorized data sources that are suppliers into high-risk data flows;</div></li>\n<li>\n<div>Contributes to the development and maintenance of data flows for new and existing reports designated as high risk; </div></li>\n<li>\n<div>Partners with internal and external resources to ensure successful and timely completion of documentation in accordance with the Enterprise Data Governance policy;</div></li>\n<li>Holds others accountable for upholding ethics and values. </li>\n<li>Shows a commitment to learning through professional development and growth, continually expanding his/her knowledge base and expertise in his/her practice area;</li>\n<li>Practices effective risk management strategies, understanding and following firm risk policies;</li>\n<li>Begins to demonstrate a depth and breadth of technical, process, and professional knowledge, in order to use knowledge to analyze issues and provide solutions to meet department needs;</li>\n<li>Offers suggestions and/or takes action to implement new or more effective solutions for work procedures, issues, or to meet customer needs;</li>\n<li>Uses refined analytical and problem-solving skills and judgment to quickly identify problem areas and proactively resolve issues; and</li>\n<li>Demonstrates effective work habits and organizational skills by prioritizing and planning, with the ability to handle multiple tasks simultaneously and adapts to changing work priorities. </li></ul>\n<div>Basic Qualifications</div>\n<ul>\n<li>\n<div>Bachelor's degree, or equivalent work experience</div></li>\n<li>\n<div>One to two years of experience in technical or support ownership of applications or databases</div></li></ul>\n<div>Preferred Skills/Experience </div>\n<ul>\n<li>\n<div>Knowledge of PowerDesigner v16.5 or a similar tool including use of models and templates</div></li>\n<li>\n<div>Possesses exemplary oral and written communication skills, demonstrated through interactions with internal compliance and regulatory partners, TOS, and external business line colleagues throughout the organization</div></li>\n<li>\n<div>Understanding of business process modeling to create and build data flows</div></li>\n<li>\n<div>Ability to demonstrate ethics and integrity, adhering to U.S. Bank’s core values</div></li>\n<li>\n<div>Shows initiative, including eagerness to work on projects</div></li>\n<li>\n<div>Ability to produce high-quality work that is accurate and thorough, with attention to detail</div></li>\n<li>\n<div>Ability to handle multiple tasks simultaneously and adapt to changing work priorities</div></li>\n<li>\n<div>Team-oriented professional, interacting collaboratively with team members and others across the organization</div></li></ul>"}