{"job title": "Senior Scientist Real-World Evidence", "company": "Abbott AG", "city state": "– Los Angeles, California", "rating": "3.5", "job description": "At Abbott, we're committed to helping people live their best possible life through the power of health. For more than 125 years, we've brought new products and technologies to the world -- in nutrition, diagnostics, medical devices and branded generic pharmaceuticals -- that create more possibilities for more people at all stages of life. Today, 99,000 of us are working to help people live not just longer, but better, in the more than 150 countries we serve.\n<br><br>\n<strong> <strong> JOB DESCRIPTION:</strong></strong>\n<br><br>\nSummary:\n<br><br>\nYou will work within the Abbott Real-World Evidence and Digital Health team. You will lead projects that generate impactful evidence and insights related to medical device technology, relevant disease states, and healthcare economics. You will collaborate with peers within the function, across the organization, and thought leaders outside the company. You will work with different types of data, developing creative ways to analyze and present your results. You will prepare conference presentations and develop scientific manuscripts. You will also support digital health initiatives. Your work will support healthcare decisions by patients, physicians, health authorities, payers, and policy-makers.\n<br><br>\nMain responsibilities will include:\n<li> Lead and complete projects related to implantable medical devices, including but not limited to pacemakers, defibrillators, stents, heart valves, ventricular assist devices, and spinal cord stimulators</li> <li> Collaborate with peers within the function, across the organization and outside the company</li> <li> Identify evidence gaps and develop creative ways to fill them</li> <li> Design and execute clinically-relevant data analyses</li> <li> Prepare conference presentations and scientific manuscripts</li> <li> Work with varied data types, including clinical study data, electronic health records, remote device monitoring data, and insurance claims data</li> <li> Present to internal and external stakeholders with varied backgrounds</li> <li> Cultivate relationships with key opinion leaders in the industry</li> <li> Become a domain expert in data science and clinical landscape</li> <li> Maintain a scientific, analytical mindset on projects</li> <li> Investigate the patent implications of research outcomes and coordinate with intellectual property attorneys</li> <li> Support digital health initiatives</li>\nDesired skills:\n<li> Excellent written skills, with proven ability to prepare scientific manuscripts</li> <li> Excellent verbal communication skills and ability to speak with experts in the field</li> <li> Excellent data analysis skills</li> <li> Knowledge of statistical methods</li> <li> Experience with analytical software tools such as R, Matlab, SAS, Python</li> <li> Ability to come up with innovative data analysis and presentation strategies</li> <li> Ability to work independently but in a team environment</li>\nQualifications required:\n<li> + years of experience in biomedical engineering, health/biomedical sciences, epidemiology, or related field</li>\n<strong> <strong> JOB FAMILY:</strong></strong>\n<br><br>\nResearch and Discovery\n<br><br>\n<strong> <strong> DIVISION:</strong></strong>\n<br><br>\nMD Medical Devices\n<br><br>\n<strong> <strong> LOCATION:</strong></strong>\n<br><br>\nUnited States &gt; Sylmar : 15900 Valley View Court\n<br><br>\n<strong> <strong> ADDITIONAL LOCATIONS:</strong></strong>\n<br><br>\nUnited States &gt; Sunnyvale : 645 Almanor Ave\n<br><br>\n<strong> <strong> WORK SHIFT:</strong></strong>\n<br><br>\nStandard\n<br><br>\n<strong> <strong> TRAVEL:</strong></strong>\n<br><br>\nYes, 10 % of the Time\n<br><br>\n<strong> <strong> MEDICAL SURVEILLANCE:</strong></strong>\n<br><br>\nNot Applicable\n<br><br>\n<strong> <strong> SIGNIFICANT WORK ACTIVITIES:</strong></strong>\n<br><br>\nContinuous sitting for prolonged periods (more than 2 consecutive hours in an 8 hour day), Keyboard use (greater or equal to 50% of the workday)Abbott is an Equal Opportunity Employer of Minorities/Women/Individuals with Disabilities/Protected : :"}