{"job title": "Global Pharmacovigilance (PV) Senior Scientist", "company": "Amgen Inc.", "city state": "– Thousand Oaks, CA", "rating": "3.7", "job description": "Career CategorySafetyJob Description\n<br><br>\nThe Global Safety Therapeutic Area Teams serve as the safety experts for all Amgen products globally and are accountable for the safety strategy and major safety deliverables for each Amgen product. The Global PV Sr. Scientist works with the Therapeutic Safety Teams for safety assessment activities for medical/scientific operations. This person will also provide scientific and compliance expertise as needed to Global Patient Safety, in the establishment of a highly effective global safety organization in full compliance to worldwide regulations.\n<br><br>\nAmgen is seeking a Global Pharmacovigilance (PV) Senior Scientist to work out of their Thousand Oaks, CA facility.\n<br><br>\nThe Global (PV) Sr. Scientist works with the Therapeutic Safety Teams for safety assessment activities for medical/scientific operations. he Global PV\n<br><br>\nSenior Scientist is responsible for the following:\n\n\n<ul>\n<li>Directs the planning, preparation, writing and review of portions of aggregate reports</li>\n<li>Organizes and directs liaison activities with affiliates and other internal Amgen partners regarding product safety</li>\n<li>Supports and provides oversight to staff with regards to safety in clinical trials</li>\n<li>Reviews and provides input and support on study protocols, statistical analysis plans and other clinical study- related documents</li>\n<li>Reviews Adverse Event/Serious Adverse Event (AEs/SAEs) from clinical trials</li>\n<li>Reviews and provides input on standard design of tables, figures, and listings for safety data from clinical studies</li>\n<li>Participates in development of safety-related data collection forms for clinical studies</li>\n<li>Participates in study team meetings</li>\n<li>Performs data analysis to evaluate safety signals and writes up analysis results for signal detection, evaluation and management</li>\n<li>Authors Safety Assessment Reports and other safety documents and regulatory responses in collaboration with the Global Safety Officer (GSO)</li>\n<li>Prepares presentation of the Global Safety Team's recommendations on safety issues to the cross-functional decision-making body</li>\n<li>Provides content for risk management plans</li>\n<li>Develops or updates strategy and content for regional risk management plans</li>\n<li>Assists GSOs to oversee risk minimization including tracking of activities and developing a strategy for safety-related regulatory activities</li>\n<li>Prepares response to regulatory inquiries related to risk management plans under the guidance of GSO</li>\n<li>Undertakes activities delegated by the Qualified Person for Pharmacovigilance (QPPV) as detailed in the PV System Master File and maintain a state of inspection readiness</li>\n<li>Be a representative and a point of contact for Health Authority Inspections and Internal Process Audits within the remit of role and responsibility</li>\n</ul>\n\n<strong>Basic Qualifications:</strong>\n<br><br>\nDoctorate degree and 2 years of Scientific clinical experience or current Pharmacovigilance or Drug Safety experience or Biotech/Pharmaceutical experience.\n<br><br>\n<strong>OR</strong>\n<br><br>\nMaster's degree and 6 years of Scientific clinical experience or current Pharmacovigilance or Drug Safety\n<br><br>\nor Biotech/Pharmaceutical experience.\n<br><br>\n<strong>OR</strong>\n<br><br>\nBachelor's degree and 8 years of Scientific clinical experience or current Pharmacovigilance or Drug Safety or Biotech/Pharmaceutical experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nAssociate's degree and 10 years of Scientific clinical experience or current Pharmacovigilance or Drug Safety or Biotech/Pharmaceutical experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nHigh school diploma / GED and 12 years of Scientific clinical experience or current Pharmacovigilance or Drug Safety or Biotech/Pharmaceutical experience\n<br><br>\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>BS, RN or PharmD degree</li>\n<li>8+ years of Pharmacovigilance in a Pharmaceutical or Biotech industry</li>\n<li>Broad PV knowledge with expertise within defined subject area</li>\n<li>Applied knowledge and broad understanding of multiple disciplines</li>\n<li>Experience in signal detection, evaluation, aggregate data analysis, and interpretation</li>\n<li>Experience with document writing and source document review</li>\n<li>Ability to convey complex, scientific data in an understandable way</li>\n<li>Good clinical and scientific judgment</li>\n<li>Knowledge of Application of medical concepts and terminology</li>\n<li>Literature search, evaluation and assessment skills-ability to search literature databases to identify safety literature for signal evaluation and assessment, interpretation and synthesis skills</li>\n<li>Collaboration with cross-functional team settings</li>\n<li>Meeting management and time management skills</li>\n<li>Process and project management skills</li>\n<li>Critical scientific assessment and problem solving</li>\n<li>Strong Written and verbal communications skills, including medical/scientific writing</li>\n<li>Computer skills (e.g., MS Office Suite and safety systems)</li>\n<li>Presentation skills for conveying complex technical contents to non-expert audiences</li>\n</ul>\n\nJoin Us\n<br><br>\nIf you're seeking a career where you can truly make a difference in the lives of others, a career where you can work at the absolute forefront of biotechnology with the top minds in the field, you'll find it at Amgen.\n<br><br>\nAmgen, a biotechnology pioneer, discovers, develops and delivers innovative human therapeutics. Our medicines have helped millions of patients in the fight against cancer, kidney disease, rheumatoid arthritis and other serious illnesses.\n<br><br>\nAs an organization dedicated to improving the quality of life for people around the world, Amgen fosters an inclusive environment of diverse, ethical, committed and highly accomplished people who respect each other but compete intensely to win. Together, we live the Amgen values as we continue advancing science to serve patients.\n<br><br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n<br><br>\n<strong>.</strong>"}