{"job title": "Sr Research Scientist - Mechanics and Reliability Sciences", "company": "Corning", "city state": "– Painted Post, NY", "rating": "3.6", "job description": "Corning is one of the world's leading innovators in materials science. For more than 160 years, Corning has applied its unparalleled expertise in specialty glass, ceramics, and optical physics to develop products that have created new industries and transformed people's lives.<br><br>At Corning, our growth is fueled by a commitment to innovation. We succeed through sustained investment in research&amp;development, a unique combination of material and process innovation, and close collaboration with customers to solve tough technology challenges. We are a four-time National Medal of Technology winner thanks to our technology leadership and R&amp;D environment, which attract and enable the best scientific minds in the world. This pipeline of talent has brought life-changing innovation to your fingertips for more than 160 years.<br><br>Odds are that the email you read this morning travelled over Corning Optical Fiber; the smartphone you used had a Corning cover lens; and the vehicle you took to work had cleaner emissions because of a Corning catalytic substrate. We are seeking out dedicated scientists who strive to see their research make a difference. If you have a passionate belief in the power of innovation to change the world and you rate your own success by how many people are touched by your research, then Corning is the place for you.<br><br>Corning is one of the world's leading innovators in materials science. For more than 167 years, we have applied it our unparalleled expertise in specialty glass, ceramics, and optical physics to develop products that have created new industries and transformed people's lives. At Corning, our growth is fueled by a commitment to innovation. We succeed through sustained investment in research&amp;development, a unique combination of material and process innovation, and close collaboration with customers to solve tough technology challenges.<br><br>The Department of Mechanics and Reliability Sciences, in the Science and Technology Division at Corning Incorporated has multiple openings at various areas of mechanics of materials, reliability and failure analysis at entry and senior scientist levels. This department combines deep knowledge of the mechanics of materials, measurement expertise, and an understanding of reliability science to discover, characterize and explore material/process/design challenges and failure modes. Our projects are fast-paced, and we expect our engineers/scientists to develop and lead an experimental and characterization strategy that produces deeper knowledge from which programs can leverage to go to new places. We build reliability, mechanics of materials, and failure prevention understanding across a broad range of products. This involves you identifying reliability material/process/design failure risks, developing plans and characterization tools, executing mechanical and reliability testing, leading life modeling/prediction and engaging in computer FEA/modeling/simulation and overall problem solving while using other capabilities and expertise available across Corning Science and Technology.<br><br>Day to Day Responsibilities The scope and responsibilities will vary depending on the levels of positions and may include some or all of the following:<br><br>* Collaborating with research, development, commercial, and other teams to define the opportunity and implement characterization techniques that produce fundamental understanding leading to advancing performance<br><br>* Conducting material/process/design assessment for fundamental understanding or trade and commerce testing and evaluation of performance vs failure modes<br><br>* Iterating between developing FEA or other models and experimental validation.<br><br>* Performing fractographic and failure mode analysis including more eclectic forensic CSI-like post-failure assessment of component to system performance.<br><br>* Identifying, evaluating, and implementing potential improvements to product/material performance.<br><br>* Engaging in projects ranging from technical participation to leading the reliability grow program.<br><br>* Working with research teams and other internal resources to implement new characterization techniques based on customer requirements to improve product performance<br><br>* Compiling, analyzing and presenting results and recommendations to key project leadership supported by appropriate documentation.<br><br>* Identifying intellectual property opportunities and filing invention disclosures and patent applications<br><br>* Making recommendations to projects to improve functional performance and reliability<br><br>* Identifying and quantifying reliability risks<br><br>* Identifying applicable product standards and requirements •<br><br>Assigning tasks to and supervising technician(s)<br><br>* Developing and managing testing plans<br><br>Education of Interest<br><br>* MS or PhD in applied mechanics, reliability, materials sciences/engineering, micromechanics, mechanics of polymers and interfaces, including undergraduate education in information systems/complex problem solving, systems reliability, fractography, mechanical engineering or other related fields.<br><br>* Senior level positions require MS with 3-5 years of related working experience, Ph. D preferred.<br><br>Expected skills<br><br>* You will join a team of scientists as a scientist, a project leader or a team leader.<br><br>* We expect you to have general knowledge and training in the broad areas of: mechanics of materials, failure mechanisms of brittle materials, fracture mechanics, reliability science, and failure prevention, and should be specialized in at least one of these areas.<br><br>* You will serve as a specialist or domain expert in materials damage, failure prevention and reliability of Corning glass, ceramic, and mixed materials and systems.<br><br>Desired skills for these positions may include:<br><br>* Ability to define and deconstruct the problem, develop knowledge/methods/testing,interpreted results, report and present to programs including recommendations and next steps.<br><br>* Coach, facilitate or lead projects with a reliability approach to science methods of anticipating technical challenges and corrective actions.<br><br>* Understanding of the physics of failure<br><br>* Experience with characterization testing and analysis of materials<br><br>* Iterating between developing FEA and life modeling and experimentation<br><br>* Familiar w/ Reliability Systems Engineering and program planning, analysis<br><br>* Data analysis and statistical skills; can analyze, interpret, and draw conclusions based on results • Understanding of measurement techniques to conduct analysis<br><br>* Effective writing, presentation and problem-solving facilitation skills<br><br>* Able to utilize FMEA, FMA, Root Cause Analysis. TRIZ, Fault Tree, DOE tools Soft skills:<br><br>* Do you have the ability to operate effectively in a matrix environment?<br><br>* How comfortable are you with being open and engaging with the customer as well as developing technical clarity in the face of other ambiguities?<br><br>* Are you a great teammate with flexibility to work on projects of various topics at varying innovation stages?<br><br>* Ability to handle multiple priorities and an understanding of how to translate difficult technical concepts to a broader audience. Does this sound like you?<br><br>This position supports immigration sponsorship<br><br>We prohibit discrimination on the basis of race, color, gender, age, religion, national origin, sexual orientation, gender identity or expression, disability, or veteran status or any other legally protected status.<br><br>Nearest Major Market: Corning"}