{"job title": "Postdoctoral Research Scientist-Fixed Duration Employee", "company": "Eli Lilly and Company", "city state": "– San Diego, CA", "rating": "3.8", "job description": "Req ID 44220 Title Postdoctoral Research Scientist-Fixed Duration Employee City San Diego State / Province California Country United States Region North America Company Overview At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 39,000 employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We're looking for people who are determined to make life better for people around the world. Responsibilities Responsibilities:<br><br>You will operate in a dynamic and cross functional environment, working closely with discovery scientists, IT, and statisticians to enable research related to drug discovery and development with a specific focus on immunogenicity. You will share standard methodologies with others with the opportunity to adopt new methods. This entails using molecular profiles and multiple in-vitro and in-silico databases to help understand mechanisms of immunogenicity and then to use this information to help drug discovery progression and define risk patient population. Are you highly familiar with biological research related to innate or antigen-specific T cell response? We could use your expertise.<br><br>Key Objectives/Deliverables<br><br>* Analysis of antigen-specific and innate responses to biotherapeutics in human PBMCs with omics approaches.<br><br>* Analysis of data from a genomic perspective to support internal efforts, additional indications, and publications.<br><br>* Propose, conduct analysis, and provide interpretation supporting key project aims. Present results and provide scientific reports as needed or requested by the project teams as a component of project reviews, landmarks or governance in a manner fit for cross-functional team consumption.<br><br>* Use internal and external data sources such as but not limited to genome variation, genotype-phenotype association, molecularly characterized disease state databases, etc., to routinely deliver assimilated information and insights relating to target of interest or pathway of interest, appropriateness of pre-clinical models, mechanistic understanding in immunogenicity studies, biomarkers supporting immunogenicity risk assessment and possible identification of at-risk population.<br><br>* Apply expertise in IT Informatics and Statistics. Collaborate around data analysis methods and application. Engage IT capabilities and infrastructure team to help meet data storage and data processing needs. Work with the application development group to help develop and implement solutions for data access and visualization for the broader Lilly scientific community.<br><br>* Provide analysis or related support as needed in context of collaborations with cross functional teams. Facilitate bringing in data/knowhow or learning into the broader organization.<br><br>* Contribute to external scientific community through presentations, abstracts, publications and participation in appropriate scientific conferences.<br><br>44220BR Basic Qualifications<br><br>* PhD degree in medicine, biology, computational or statistical sciences or related discipline with relevant experience in one or more aspects of bioinformatics.<br><br>Additional Skills/Preferences<br><br>* Postdoctoral training in related areas with expertise in computational methods, tools and databases utilized in genomic and genetic data analysis preferred<br><br>* Hands-on experience of innate and antigen specific immune responses with in-vitro systems.<br><br>* Hands-on experience of analyzing data generated using many of the following a) Microarrays -- Expression / Genotyping, b) Next Generation Sequencing platforms.<br><br>* Experience in applying computational systems biology or integrative analysis approaches to facilitate interpretation and hypothesis generation from results of genetics, genomics and epigenetics studies. Ability to rapidly prototype novel methods for suitable scientific problems.<br><br>* Project experience in biomarker discovery, target discovery and validation, mechanisms of action of drugs, correlating genomic/genetics data with clinical and biochemical phenotypes.<br><br>* Expertise in a range of biological databases and use for translational or basic research. Experience with publicly and commercially available bioinformatics pathway/network analysis tools, genomics and genetics databases. Experience with high performance cluster computing queuing systems. Deep expertise in clustering algorithms, and ensemble methods.<br><br>Additional Information<br><br>* Lilly is an EEO/Affirmative Action Employer and does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.<br><br>* Lilly credits its exceptional employees for its successes, and knows the key to ongoing achievement lies in attracting and retaining the best people. A company rich in heritage, Lilly employs individuals, conducts research and markets products worldwide. By providing for the unmet needs of our customers through a continuous stream of innovation, we will outgrow all competitors.<br><br>* Lilly earns consistent and wide recognition for creating an exceptional work environment:<br><br>* •Business Week magazine 50 Best Places To Launch A Career<br><br>* •FORTUNE America's Most Admired Companies<br><br>* •FORTUNE 50 Best Companies for Minorities<br><br>* •Working Mother 100 Best Companies for Working Mothers<br><br>* •Industry Week magazine 100 Best-Managed Companies<br><br>* •Science magazine Best Companies for Scientists<br><br>* This position is not permanent. It is for a fixed duration of two years with potential to extend annually for up to 4 years."}