{"job title": "Molecular Analytical Capabilities Postdoctoral Scientist-FDE", "company": "Eli Lilly and Company", "city state": "– Indianapolis, IN", "rating": "3.8", "job description": "Req ID 43607 Title Molecular Analytical Capabilities Postdoctoral Scientist-FDE City Indianapolis State / Province Indiana Country United States Region North America Company Overview At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 39,000 employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We're looking for people who are determined to make life better for people around the world.\n<br><br>\nResponsibilities The Bioproduct Research and Development organization (BRD) strives to deliver creative medicines to patients through the development and commercialization of insulins, monoclonal antibodies, novel therapeutic proteins, and peptides. This organization is a multidisciplinary group that works collaboratively with our discovery and manufacturing colleagues. Located in Indianapolis, scientists have full access to our scientific excellence and engineering capabilities.\n<br><br>\nBR&amp;D is seeking a highly motivated and creative scientist with expertise in state-of-art molecular biology techniques to play a key role in establishing internal cutting-edge nucleic acid-based technical capabilities. The scientist will be an integral part of multidisciplinary teams that provide support for new therapeutic development, cell line generation, and process/bioproduct development\n\n\n<ul>\n<li>Develop cutting-edge molecular biology assays such as dPCR and NGS for the detection, quantification of DNA/RNA. The primary focus includes the characterization of the integrity and stability of in vitro derived RNA and transgenes encoding therapeutic candidates expressed in recombinant CHO cell lines/microbial strains.</li>\n<li>Use bioinformatics tools and genomic databases to aid the data analysis and assay development.</li>\n<li>Effectively collaborate with other functions in Bioprocess and Bioproduct Development as needs arise.</li>\n<li>Contribute to the general scientific community through external publications</li>\n<li>Keep abreast of relevant scientific literature/new technologies/capabilities</li>\n<li>Ensure work and team activities are aligned with all relevant Development Quality and safety requirements</li>\n</ul>\n\n43607BR Basic Qualifications Ph.D. in molecular biology, genetics, biochemistry, bio-engineering, or related field Additional Skills/Preferences\n\n\n<ul>\n<li>Deep knowledge of fundamental and cutting-edge DNA/RNA technologies.</li>\n<li>Hand-on experience in laboratory molecular techniques including DNA/RNA isolation and characterization such as PCR, RT- PCR, qPCR, dPCR, NGS and data analysis.</li>\n<li>Expertise in mammalian genomics and molecular analysis software for sequencing analysis and DNA/RNA characterization.</li>\n<li>Demonstrated competence in data analysis, research design, troubleshooting, and the evaluation of new techniques and procedures.</li>\n<li>General knowledge of CHO cell culture, molecular biology with an emphasis on recombinant protein expression and genome stability.</li>\n<li>Excellent verbal and written communication skills and the ability to interpret and summarize scientific results in a clear, concise, and accurate manner.</li>\n<li>Excellent in problem solving and decision-making and capable to efficiently evaluate and adapt to changing project priorities.</li>\n</ul>\n\nMust be able to work effectively in an interdisciplinary team environment\n<br><br>\n<strong>Additional Information</strong>\n\n\n<ul>\n<li>This position is not permanent. It is for a fixed duration of two years with potential to extend annually for up to 4 years.</li>\n<li>Lilly is an EEO/Affirmative Action Employer and does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status</li>\n</ul>"}