{"job title": "Scientist (Biology)", "company": "Insitro", "city state": "– South San Francisco, CA, US", "rating": "NA", "job description": "<strong>The Opportunity</strong><br>\n<div>Join insitro, an early-stage machine-learning based drug development company as a life scientist. You will work in a cross functional team with data scientist and bioengineers to design new experiments and develop large, innovative biological datasets using cutting edge, high throughput platforms and assays. You will collaborate in analyzing the data (internally generated, from external partnerships, or publicly available), make and validate predictions, allowing for the development of effective drugs. You will participate in presenting these results to internal and external stakeholders, and in disseminating your work via scientific publications. We believe that strong teams require diverse skill sets: we like biologists who know how to program, engineers who understand biology, and everything in between. Most importantly, we want motivated and talented candidates who are interested in being part of a unique, cross-disciplinary team.</div><br>\n\n<div>You will be joining as the founding team of a biotech startup that has long-term stability due to significant funding, yet is very much in formation providing many opportunities for significant impact. You will work closely with a very talented team, learn a broad range of skills, and help shape insitro’s culture, strategic direction, and outcomes. Join us and help make a difference to patients!</div>\n<br>\n<div>\n<strong>About You</strong></div>\n\n\n<ul>\n<li>PhD with in genetics, molecular biology, or related fields, or equivalent experience</li>\n<li>Proficient in a wide range of cellular, molecular and functional genomics approaches</li> \n\n<li>Knowledge of mammalian cell culture, primary human cells and iPSCs preferred</li> \n\n<li>Experience in gene editing and generation of genetically manipulated cells</li>\n<li>Familiarity with fluorescence microscopy and/or flow cytometry</li>\n<li>Demonstrated track record of successful scientific execution and communication</li>\n<li>Excellent communication skills, including with people from diverse backgrounds</li>\n<li>Passion for working in a team and making a difference in the world</li>\n</ul>\n\n<div>\n<strong> Nice to Have</strong></div>\n\n\n<ul>\n<li>Some experience (0-2 years) in an industry or academic setting post PhD</li> \n\n<li>High throughput screening experience (genomic, proteomic, small molecule)</li>\n<li>Comfortable with NGS methodologies and readouts</li> \n</ul>\n\n<div>\n<strong>Benefits at insitro</strong></div>\n\n\n<ul>\n<li>Excellent medical, dental, and vision coverage</li>\n<li>Open vacation policy</li>\n<li>Team lunches (catered daily)</li>\n<li>Commuter benefits</li>\n<li>Paid parental leave</li>\n</ul>\n\n<div><strong>About insitro</strong></div>\n<br>\n<div>insitro is an exciting startup company that aims to take a new approach to drug development: one with big data and machine learning at its core. We plan to build on the ground-breaking innovations that have occurred in life sciences to develop large data sets that are designed from the start to allow machine learning to address fundamental bottlenecks in the drug development process. Our goal is to cure more people, sooner, and at a much lower cost.</div><br>\n\n<div>We are fortunate to have the strong support from the top investors in both biotech and tech: ARCH Ventures, Foresite Capital, A16Z, GV, and Third Rock Ventures. We are building a remarkable team that embodies a new type of culture, one based on a true partnership between scientists, engineers, and data scientists. Together we are working to define the problems, design experiments, analyze the data, and derive the insights that will lead us to new therapeutics. Join us, and help make a difference to patients!</div>\n<br>"}