{"job title": "Certifying Scientist (2nd Shift)", "company": "LabCorp", "city state": "– Research Triangle Park, NC", "rating": "2.9", "job description": "Location Research Triangle Park, North Carolina Job ID 18-84662 Date posted 08/15/2018\n<br><br>\nThe Occupational Testing Services division is seeking a Certifying Scientist to join their team!\n<br><br>\nThe position for Certifying Scientist is needed to maintain quality and service in the high volume laboratory. Duties of the position include but are not limited to:\n\n\n<ul>\n<li>Review of GC/MS and LC/MS-MS analysis data to ensure clinical acceptability</li>\n<li>Identifying and resolving quality control issues</li>\n<li>Accurately entering and reporting test results</li>\n<li>Remaining current on lab standard operating procedures.</li>\n</ul>\n\nThe OTS Division is headquartered in Research Triangle Park, NC with satellite locations in Houston, TX, Raritan, NJ, St. Paul, MN, and Southaven, MS. With our high volume of patient service centers and contracted collection sites, we can provide any company with their forensic drug or wellness testing needs.\n<br><br>\nAbout LabCorp® With scientific expertise in esoteric testing, genomics, and clinical and anatomic pathology, LabCorp processes tests on approximately 470,000 specimens each day, applying advances in medicine and science to laboratory testing. LabCorp operates a sophisticated laboratory network, with corporate headquarters in Burlington, NC, and more than 48,000 employees worldwide. Our 220,000 clients include physician offices, hospitals, managed care organizations, and biotechnology and pharmaceutical companies. Laboratory Corporation of America Holdings is listed on the New York Stock Exchange (NYSE) under ticker symbol LH. To learn more about our organization, visit our website at: www.labcorp.com.\n<br><br>\n<strong>Requirements</strong>\n<br><br>\nLicense/Certification/Education: Requires a B.A. or B.S. in one of the following disciplines: chemistry, forensic science, toxicology, clinical chemistry, or a relatable life science at a minimum.\n<br><br>\nRequires at least 1 year of GC/MS or LC-MS/MS experience including review of analytical data and Quality Control; toxicology experience in a laboratory performing prescription drug monitoring or in a SAMHSA certified Laboratory is preferred.\n<br><br>\nShift2\n<br><br>\nScheduleFri-Mon, 12:00pm-10:30pm\n<br><br>\nApply Now\n<br><br>\nShare\n\n\n<ul>\n<li>Facebook</li>\n<li>Twitter</li>\n<li>LinkedIn</li>\n<li>Email</li>\n</ul>\n\nLocation\n<br><br>\nCheck out where you could be working if you apply.\n<br><br>\nView Map\n<br><br>\nRelated Jobs\n\n\n<ul>\n<li>Clinical Laboratory Operations Manager - Genomics&amp;Next Generation Sequencing Research Triangle Park, North Carolina</li>\n<li>Prenatal Genomic Screening Technologist Research Triangle Park, North Carolina</li>\n<li>Genomic Sequencing Technologist Research Triangle Park, North Carolina</li>\n</ul>\n\nJoin Our Talent Community\n<br><br>\n<strong>Email:</strong>\n<br><br>\nInterested In:Search for a category and select one from the list of suggestions. Search for a location and select one from the list of suggestions. Finally, click \"Add\" to create your job alert.\n<br><br>\n<strong>Category:</strong>\n<br><br>\n<strong>Location:</strong>\n<br><br>\nAdd +\n\n\n<ul>\n<li>Laboratory Support, Research Triangle Park, North Carolina, United StatesRemove</li>\n<li>Laboratory Technician, Research Triangle Park, North Carolina, United StatesRemove</li>\n<li>Specimen Processor, Research Triangle Park, North Carolina, United StatesRemove</li>\n<li>Remove</li>\n</ul>\n\nConfirm Email\n<br><br>\nExplore More\n<br><br>\nLabcorp Specialty Labs\n<br><br>\nLabCorp and its Specialty Testing Group, a fully integrated portfolio of specialty and esoteric testing laboratories.\n<br><br>\nLearn More\n<br><br>\nPhlebotomy\n<br><br>\nAn important link between our patients and our laboratory.\n<br><br>\nLearn More\n<br><br>\nCytogenetics\n<br><br>\nHelp contribute to health care decisions nationwide.\n<br><br>\nLearn More\n<br><br>\nApplication FAQs\n<br><br>\nWhat you need to know about applying at LabCorp.\n<br><br>\nLearn More"}