{"job title": "Data Engineer - Breast Imaging Research", "company": "Massachusetts General Hospital(MGH)", "city state": "– Boston, Massachusetts", "rating": "3.9", "job description": "The role of this position will be to help create tools, levering the latest in advances in data science, machine learning and deep learning, to impact healthcare across a spectrum of focus areas including medical imaging, diagnostics, clinical informatics and population health.\n<br><br>\nThe Data Engineer works both independently as well as part of a competitive and collaborative team. The incumbent demonstrates the ability to find solutions where others couldn't, has the drive, energy and determination to pull the team forward and persevere until the impossible is possible.\n<br><br>\n<strong>PRINCIPAL DUTIES AND RESPONSIBILITIES:</strong>\n<br><br>\nRelevant activities include, but are not limited to the following:\n\n\n<ul>\n<li>Write clean, maintainable performance code ensuring data is flowing smoothly between source and destination</li>\n<li>Comfortable transforming, normalizing and merging multiple sources of data in both batch and streaming environments.</li>\n<li>Build pipelines that feed data scientists with data: Develop and manage extraction tools, wrap the data, send it forward in the data pipeline. Correct, transform and enrich the data. Quickly and efficiently load bulk data</li>\n<li>Work tightly with the broader date science and software team to identify the path to a successful product</li>\n<li>Take responsibility for strengthening the team by facilitating the adoption of processes that will allow us to work faster and hire exceptional team-mates</li>\n<li>Use the MGH and Radiology values to govern decisions, actions and behaviors. These values guide how we get our work done: Patients, Affordability, Accountability &amp; Service Commitment, Decisiveness, Innovation &amp; Thoughtful Risk; and how we treat each other: Diversity &amp; Inclusion, Integrity &amp; Respect, Learning, Continuous Improvement &amp; Personal Growth, Teamwork &amp; Collaboration</li>\n</ul>\n\n<strong>SKILLS &amp; COMPETENCIES REQUIRED:</strong>\n\n\n<ul>\n<li>Strong sense of urgency and proactiveness</li>\n<li>Ability to function effectively and independently in a fast-paced environment, organize and prioritize work independently, and meet tight deadlines</li>\n<li>Self-motivated, with an entrepreneurial mindset and ability to learn quickly</li>\n<li>Strong analytical, planning, organization and time management skills with a strong attention to detail</li>\n<li>Excellent interpersonal skills to effectively communicate with technical teams, cross-functional teams, and staff at all levels of the organization including both technical and non-technical personnel</li>\n<li>Ability to successfully negotiate and collaborate with others of different skill sets, backgrounds and levels within and external to the organization</li>\n<li>Ability to effectively conduct meetings and lead and facilitate large working sessions with all levels of staff and across various stakeholder groups</li>\n<li>Demonstrates strong evidence of algorithmic and structured thinking, with an intuition for logic, pattern matching, what-if analysis, problem decomposition and synthesis.</li>\n<li>Demonstrated ability to organize and incorporate complex systems requirements into product features and prioritize features effectively</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br>\nField of Study/Additional Specialized Training: Bachelor's degree or equivalent combination of education and demonstrated front-end experience required. Computer science, engineering, or equivalent undergraduate and graduate degrees are preferred, though not strictly required necessary\n<br><br>\n<strong>EXPERIENCE:</strong>\n<br><br>\n<strong>Required:</strong>\n<br>\n· A minimum experience of 3+ years in ETL Data Engineering\n<br>\n· Clear, demonstrable evidence of exceptional productivity and performance in competitive environments\n<br><br>\n<strong>Preferred:</strong>\n<br>\n· Expert knowledge of Python. Expert knowledge of database software (SQL + variants, MongoDB) and distributed computing (i.e. Hadoop, Spark) are strongly preferred.\n<br>\n· Familiarity with Node.js, Flask, Express, micro services with containers, and .NET are strong pluses\n<br>\n· Familiarity with common tools for machine learning (i.e. Tensorflow, Theano, Torch) and general scientific computing are pluses\n<br>\n· Knowledge of software team management philosophies (e.g. Agile, Scrum) and various product management/software development tools (e.g., JIRA, Trello, etc.) are pluses\n<br>\n· Experience with software development for healthcare products as well as familiarity with common clinical scenarios, regulatory and quality standards, payer and provider considerations, are beneficial but not necessary\n<br><br>\n<strong>EEO Statement</strong>\n<br>\nMassachusetts General Hospital is an Equal Opportunity Employer. By embracing diverse skills, perspectives and ideas, we choose to lead. Applications from protected veterans and individuals with disabilities are strongly encouraged.\n<br><br>\nPartner's Healthcare is acting as an Employment Agency in relation to this vacancy."}