{"job title": "Clinical Data Analyst - CQE", "company": "NYU Langone Health", "city state": "– New York, NY", "rating": "3.8", "job description": "<strong>NYU Langone Health</strong> is a world-class, patient-centered, integrated academic medical center, known for its excellence in clinical care, research, and education. It comprises more than 200 locations throughout the New York area, including five inpatient locations, a children's hospital, three emergency rooms and a level 1 trauma center. Also part of NYU Langone Health is the Laura and Isaac Perlmutter Cancer Center, a National Cancer Institute¿designated cancer center, and NYU School of Medicine, which since 1841 has trained thousands of physicians and scientists who have helped to shape the course of medical history. For more information, go to nyulangone.org, and interact with us on Facebook, Twitter, YouTube and Instagram.\n<br><br>\n<strong>Position Summary:</strong>\n<br>\nWe have an exciting opportunity to join our team as a Clinical Data Analyst-CQE.\n<br><br>\nIn this role, the successful candidate Under the general supervision of the Director, the Clinical Analysts will oversee and assist with the transformation of data into information to support quality and safety initiatives throughout NYULMC.\n<br><br>\n<strong>Job Responsibilities:</strong>\n<ul>\n<li>Act as quality performance measurement and data management and analysis consultant for appropriate custom performance measurement and research projects throughout NYULMC.</li><li>Work with NYULMC Information Technology staff and others to facilitate automation of standard, recurrent data acquisition, management, analysis, and reporting, including development of a clinical data warehouse.</li><li>Design and conduct regular and thorough assessments of data quality.</li><li>Collaborate with various stakeholders within the department and organization, to design and construct clinical quality performance measures and electronic databases for custom recurrent and one-time data collection efforts, including custom research data requests.</li><li>Effectively justify methods selected and implements analysis plans.</li><li>Design and conduct analyses pertaining to quality and safety of clinical care at NYULMC, using a variety of clinical and non-clinical data sources.</li><li>Develop internal quality performance measures, to support departmental and organizational quality improvement goals.</li><li>Develop and produce on a regular basis standard to moderately advanced reports pertaining to NYULMC clinical quality and safety performance.</li>\n</ul>\n<strong>Minimum Qualifications:</strong>\n<br>\nTo qualify you must have a Bachelor's Degree in pertinent field (clinical informatics; information management; biostatistics; epidemiology; public health; health care administration; or similar field) with at least 1 year of relevant experience. Experience with RDBMS and SQL is required. Familiarity with clinical information, including diagnostic coding and clinical databases. Knowledge of statistical analysis and programs; research methods; epidemiologic study design; quality performance measurement; quality improvement. Proven ability to work independently on complex projects, working with professions with a variety of skills and backgrounds. Excellent written and oral communication skills, for a variety of audiences.\n<br><br>\n<strong>Preferred Qualifications:</strong>\n<br>\nMaster's or doctorate, and/or clinical degree (MD, RN). Experience with clinical research and knowledge of dimensional modeling\n<br><br>\n<em>Qualified candidates must be able to effectively communicate with all levels of the organization.</em>\n<br><br>\nNYU Langone Health provides its staff with far more than just a place to work. Rather, we are an institution you can be proud of, an institution where you'll feel good about devoting your time and your talents.\n<br><br>\nNYU Langone Health is an equal opportunity and affirmative action employer committed to diversity and inclusion in all aspects of recruiting and employment. All qualified individuals are encouraged to apply and will receive consideration without regard to race, color, gender, gender identity or expression, sex, sexual orientation, transgender status, gender dysphoria, national origin, age, religion, disability, military and veteran status, marital or parental status, citizenship status, genetic information or any other factor which cannot lawfully be used as a basis for an employment decision. We require applications to be completed online.\n<br>\nIf you wish to view NYU Langone Health's EEO policies, please click here. Please click here to view the Federal \"EEO is the law\" poster or visit https://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm for more information. To view the Pay Transparency Notice, please click here."}