{"job title": "R&amp;D Sr. Scientist", "company": "Park Electrochemical", "city state": "– Newton, KS", "rating": "1.8", "job description": "<strong> <strong><u>SUMMARY</u></strong></strong>\n<br><br>\nSenior Scientist is responsible for new product development, scale-up and technical support of existing products.\n<br><br>\n<strong><u>ESSENTIAL DUTIES AND RESPONSIBILITIES</u></strong>\n<br><br>\nInclude the following:\n<ul>\n<li>Assist in supervising and guiding the technicians on R&amp;D work assignments.</li><li>Helping in improving the R&amp;D formulation work efficiency.</li><li>Assisting in the specification/selection process for any new R&amp;D equipment.</li><li>Researching new methods and materials to develop new products and improve the existing products in reliability, quality and cost.</li><li>Characterization and testing of the new research materials.</li><li>Maintaining and building an FTIR data base.</li><li>Supporting the scale up process of developmental materials.</li><li>Assist in any customer product issues.</li><li>Working with our raw material suppliers on evaluating materials for our next generation R&amp;D products.</li><li>Creating new procedures and maintaining/updating old procedures in the R&amp;D lab</li><li>Working with Suppliers to assure understanding of the proper requirements and specifications through meetings, phone conversations, and ultimately through written agreements.</li><li>Writing Technical Reports for all developmental products and preparing and presenting the data in the monthly R&amp;D meetings.</li><li>Maintaining current MSDS files.</li>\n</ul>\n<strong><u>OTHER JOB DUTIES</u></strong>\n<ul>\n<li>Able to handle multiple tasks.</li><li>Good computer skills.</li><li>Be able to troubleshoot problems using FTIR, TMA, TGA and GCMS.</li><li>Some supervisory experience preferred.</li> </ul>\n\n<ul>\n<li>Performs other related duties as assignedAssists in the supervision of technicians for new product formulations and testing.</li><li><strong><u>SUPERVISORY RESPONSIBILITIES</u></strong></li>\n</ul>\n<strong><u>EDUCATION AND/OR EXPERIENCE</u></strong>\n<ul>\n<li>5-15 years industrial experience in a related field.</li><li>M.S. or Ph.D. in chemistry (analytical or inorganic/organic.), or Polymer/Material ScienceHazard Communication TrainingRespirator-Annual re-fit test</li><li>Chemical Handling/Basic RCRA-Initial and annual update</li><li><strong><u>TRAINING REQUIRED</u></strong></li>\n</ul>\n<strong><u>LANGUAGE SKILLS</u></strong>\n<br><br>\nThe ability to communicate effectively with employees at all levels. The candidate must possess effective speaking, writing and comprehension skills.\n<br><br>\n<strong><u>REASONING ABILITY</u></strong>\n<br><br>\nHigh reasoning capability required. Must be able to assess any situation quickly and make sound decisions based on limited information. Ability to apply common sense understanding to carry out detailed and involved written or oral instructions. Ability to effectively deal with problems in different situations.\n<br><br>\n<em>The environmental categories described below are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</em>\n<br><br>\n<strong><u>WORK ENVIRONMENT/PHYSICAL DEMANDS</u></strong>\n<br><br>\nThe noise level in the work environment is usually moderate. While performing the duties of this job, the employee is exposed to weather conditions prevalent at the time. The work environment is fast paced.\n<br><br>\nWhile performing the duties of this job, the employee is required to have the ability to stand; walk; sit; use hands to finger, handle, feel or grasp objects, tools or controls; reach with hands and arms; climb stairs; balance; stoop, kneel, crouch, talk or hear; and smell. The employee must occasionally lift and/or move/carry light to medium weights of up to 50 pounds. Specific vision abilities required by the job include close vision, distance vision, color vision, peripheral vision, depth perception, and the ability to adjust focus<strong>.</strong> The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.<br><br><strong>Job Posted by ApplicantPro</strong>\n<br>"}