{"job title": "Sr. Director, Clinical Scientist, Precision Medicine", "company": "Pfizer", "city state": "– Massachusetts, USA", "rating": "3.9", "job description": "The leader in this role is responsible for managing the Precision Medicine (PM) Clinical Scientist group within Precision Medicine in Early Clinical Development (ECD). The groups' responsibilities encompass all programs in the East Coast Research Units (RUs) including Internal Medicine, Inflammation and Immunology and Rare Disease. Precision Medicine Clinical Scientists work collaboratively across research, technical, and clinical teams to define and operationalize early clinical biomarker strategies.\n<br><br>\nThe individual in this position will also assume a single point of contact role for an individual research unit (RU). In this capacity, the individual would work closely with key RU stakeholders to understand the evolving project portfolio, identify knowledge gaps related to target diseases, advise on preclinical assets, and assist in prioritizing precision medicine resources needed to support natural history studies or specific assets on their way to the clinic. A successful candidate is able to communicate effectively with senior leaders, lead colleagues within a matrix organization, and leverage information from a variety of sources in order to effectively understand organizational and asset level strategy and to interpret biomarker results that can help drive program decisions.\n<br><br>\nThe leader in this role will demonstrate the ability to build high performance teams where technical excellence, empowerment, career development and leadership at all levels is expected and fostered. The person in this position will have a demonstrated record of developing partnerships in a matrix environment, and must have excellent interpersonal as well as oral and written communication skills. In addition the individual must have strategic insights to enable the development and evolution of the group to support the changing demands of the Pfizer portfolio.\n<br><br>\n<strong><strong>ROLE RESPONSIBILITIES</strong></strong>\n<br>\n<strong>Precision Medicine Clinical Scientist Group Leadership:</strong>\n\n<ul>\n<li>Provides leadership for approximately 7 staff at the Director and Senior Manager level, including responsibility for ensuring colleague training, performance management, workload management and prioritization, technical supervision, and ensuring conduct of compliance related activities of direct reports.</li> <li>Defines and evolves best practices across the group and partners with Oncology to ensure consistency of approach and practices across the enterprise.</li> <li>Leads and participates in cross site and global teams to drive processes, define, drive, and implement strategies to support evolving needs of the portfolio.</li>\n</ul>\n\n<strong>RU Clinical Scientist Point of contact:</strong>\n\n<ul>\n<li>Works closely with RU stakeholders to understand evolving project portfolio, identify knowledge gaps related to target diseases, and prioritize resources needed for natural history studies or for specific assets</li><li>Partners with RU colleagues on biomarker-related natural history studies, consortium work, or academic collaborations as needed</li><li>Consults with project teams on biomarker discovery, pre-strategic assessment of clinical samples and understanding of mechanism or disease related genetics</li><li>Collaborates with research and clinical colleagues to develop and defend scientifically rigorous translational and exploratory biomarker strategies that assess proof of mechanism, establish early signs of efficacy, enable proof of concept studies, and generate an understanding of the variability in patient response.</li> <li>Assembles and leads collaborative biomarker sub-teams, made up of colleagues with relevant technical, research, or clinical expertise, to operationalize biomarker strategy</li><li>Ensures timely biomarker assay development, fit for purpose validation and resourcing</li><li>Contributes clinical protocol, lab manual, and informed consent language specific to biomarkers</li><li>Leverages external contract research organizations and vendors along with appropriate internal laboratories to execute biomarker analyses</li><li>Responsible for compliance around clinical biospecimen management and vendor oversight</li><li>Ensures timely delivery of internally or externally generated biomarker data for analysis</li><li>Works with biomarker and clinical teams to interpret biomarker results in the context of the clinical study</li><li>Shares learnings with key stakeholders and the scientific community through presentations and peer-reviewed publications.</li>\n</ul>\n\n<strong>Precision Medicine Leadership Team:</strong>\n\n<ul>\n<li>Core member of the PM leadership team enabling cross discipline planning, colleague development and engagement.</li> <li>Coaches and mentors others in the organization and actively participates in development strategies to enable effective workforce and succession planning within PM.</li><li>Participates in and/or leads PM strategic, scientific and process initiatives to develop new or expanded capabilities in support of portfolio delivery and contributes to the development of the direction of PM.</li> \n</ul>\n\n<strong><strong>QUALIFICATIONS</strong></strong>\n\n<ul>\n<li>PhD, MD, or equivalent with minimum of 12 years of experience.</li><li> Deep understanding of clinical drug development and translational research. Experience in clinical protocol design, clinical trial operations, clinical trial biospecimen logistics, analytical and clinical validation of biomarker assays</li><li>Background in immunology, inflammation, cardiovascular, metabolic, neuroscience or genetic diseases preferred</li><li>Able to effectively lead matrix teams made up of research, technical, and clinical colleagues and to manage a diverse and dynamic workload</li><li>Highly effective verbal and written communication skills</li><li>Strong working knowledge of the application of various biomarker technologies (eg. flow cytometry, ligand binding assays, mass spectrometry) as well as various high dimensional exploratory platforms (eg. transcriptomic, proteomic, metabolomics)</li></ul>\n\n<ul>\n<li>Experience in vendor interactions including managing delivery to timelines and ensuring quality deliverables</li>\n<li>Knowledge of current and evolving regulatory and compliance expectations for biomarkers</li> <li>Demonstrated ability to develop, influence and champion biomarker strategies with scientific team audiences and management. Proven record of developing effective partnerships in a matrix environment</li><li>A record of managerial/supervisory and leadership excellence: proven success in talent identification and development, conflict management, effective team building, strategic agility and business acumen.</li> <li>Excellent interpersonal and communication skills; ability to clearly convey vision, establish strategic direction and set priorities. Experience presenting to external multi-disciplinary scientific audiences.</li>\n</ul>\n\n<strong><strong>EEO &amp; Employment Eligibility</strong></strong>\n<br>\nPfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.\n<br><br>\n<strong><strong>Sunshine Act</strong></strong>\n<br>\nPfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider's name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.\n<br><br>\n<strong><strong>Additional Offer Details:</strong></strong>\n\n<ul>\n<li><strong><strong>Last Date to Apply for Job: March</strong></strong> 1, 2017</li><li><strong><strong>Grade:</strong></strong>018</li><li>Relocation Package: yesEligible for Employee Referral: yes</li>\n</ul>\n\nPfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates.\n<br>"}