{"job title": "Engineering Scientist Associate - R and D User Interface Software Developer", "company": "University of Texas at Austin", "city state": "– Austin, TX (US)", "rating": "4.3", "job description": "<div>\nEngineering Scientist Associate - R and D User Interface Software Developer<br>\n\n <div>\nHiring department\n<br>\n<br>\n Applied Research Lab</div><br>\n\n<div>\nMonthly salary\n<br><br>\n$5,666 - $6,500+ depending on qualifications</div>\n</div><br>\n\n<div>\nHours per week\n<br>\n<ul>\n<li>00 Standard from 800AM to 500PM</li></ul></div>\n<br><br>\n\n\n<div>\nPosting number\n<br>\n<br>\n 18-08-31-03-4205</div><br>\n\n<div>\nJob Status\n<br>\n Open</div><br>\n\n<div>\nFLSA status\n<br>\n Exempt</div><br>\n\n<div>\nEarliest Start Date\n<br>\n Immediately</div><br>\n\n<div>\nPosition Duration\n<br>\n Funding expected to continue</div><br>\n\n<div>\nPosition open to\n<br>\n all applicants</div><br>\n\n<div>\nLocation\n<br>\n Austin - J. J. Pickle Research Campus (North Austin)</div><br>\n\n<div>\nNumber of vacancies\n<br>\n 1</div><br>\n\n<div>\nGeneral Notes<br><br>An agency designated by the federal government handles the investigation as to the requirement for eligibility for access to classified information. Factors considered during this investigation include but are not limited to allegiance to the U.S., foreign influence, foreign preference, criminal conduct, security violations, drug involvement, the likelihood of continuation of such conduct, etc.</div><br>\n\n<div>\nRequired Application Materials<br>\n\n<div>\n\n\n<ul>\n\n <li>A Resume is required in order to apply</li>\n\n<li>A Letter of Interest is required in order to apply.</li>\n\n<br>\n<li>A List of 3 References is required in order to apply.</li>\n</ul>\nNote:\n<br>\n The following additional materials are also required for consideration:\n<br>\n <strong>Transcripts.References must be former employers.</strong>\n<br>\n Instructions for submission of these materials will be provided at the\n<br>\n time the online application has been completed.</div>\n </div><br>\n\n<div>\nAdditional Information<br>\n\n <div>\nPurpose<br><br>Research and development of user interface software for interactive data analysis and decision support for applications including visualization of large data sets.</div><br>\n\n<div>\nEssential Functions<br><br>Design, develop, configure, test, and integrate software to meet user interface requirements of sponsored research projects. Prepare technical documentation and technical presentations. Communicate with project team members, supervisors and sponsors for timely implementation of project requirements.</div><br>\n\n<div>\nMarginal/Incidental functions<br><br>Other related functions as assigned.</div><br>\n\n<div>\nRequired qualifications<br><br>Bachelor's degree in computer/software engineering, computer science, or other applied sciences. Ability and desire to perform User Experience (UX) design. Ability and desire to develop decision support user interfaces from the ground up. Familiarity with developing web application user interfaces. Ability to work independently with sensitive and confidential information, maintain a professional demeanor, and effectively communicate with diverse groups. U.S. Citizen. Applicant selected will be subject to a government security investigation and must meet eligibility requirements for access to classified information at the level appropriate to the project requirements of the position.</div><br>\n\n<div>\nPreferred Qualifications<br><br>Demonstrated experience developing software in Python and JavaScript. Experience developing user interfaces with web application development and frameworks (Python/Django) and client side technologies (including JavaScript, jQuery, Knockout, Bootstrap, d3, etc.). Demonstrated experience in data visualization. Experience presenting the results of data analysis to technical and non-technical audiences in a variety of graphical formats (time series, entity-relation networks, animations, etc.). Experience designing, developing, debugging, and deploying interactive web-based user interfaces. Strong technical writing skills. Demonstrated experience applying software engineering principles of encapsulation, modularity, maintainability, testability, usability, etc. in software design and development. Experience with common data mining and data exploration tools, methods, and infrastructure (Hadoop, HBase, R, Spark, Solr, Elastic Search, etc.). Cumulative GPA of 3.0.</div><br>\n\n<div>\nWorking conditions<br><br>May work around standard office conditions\n<br>\n<br>\n Repetitive use of a keyboard at a workstation\n<br>\n<br>\n Use of manual dexterity\n<br><br>\nSome weekend, evening and holiday work. Frequent use of manuals and books. Work in shared, windowless office space. Some intrastate/interstate travel.</div>\n </div><br>\n\n<div>\n<div>A criminal history background check will be required\n<br>\n for finalist(s) under consideration for this position.\n<br><br>\nThe retirement plan for this position is Teacher Retirement\n<br>\n System of Texas (TRS), subject to the\n<br>\n position being at least 20 hours per week and at least\n<br>\n 135 days in length.\n<br><br>\nThe University of Texas at Austin, as an equal opportunity/affirmative action employer, complies with all applicable federal and state laws regarding nondiscrimination and affirmative action. The University is committed to a policy of equal opportunity for all persons and does not discriminate on the basis of race, color, national origin, age, marital status, sex, sexual orientation, gender identity, gender expression, disability, religion, or veteran status in employment, educational programs and activities, and admissions.\n<br><br>\nIf hired, you will be required to complete the federal Employment\n<br>\n Eligibility Verification form, I-9. You will be required to present\n<br>\n acceptable, original\n<br>\n documents\n<br>\n to prove your identity and\n<br>\n authorization to work in the United States. Information\n<br>\n from the documents will be submitted to the federal E-Verify\n<br>\n system for verification. Documents must be\n<br>\n presented no later than the third day of employment. Failure to do\n<br>\n so will result in dismissal.\n<br><br>\nUT Austin is a Tobacco-free Campus</div>\n </div>\n\n<br>"}