{"job title": "Pre-Sales Engineer", "company": "Abacus Data Systems", "city state": "– San Diego, CA", "rating": "3.6", "job description": "<strong>Pre-Sales Engineer</strong>\n<br><br>\n<strong>This Job is based out of the San Diego Corporate Office and cannot be worked remotely.</strong>\n<br><br>\nAbacusNext® helps businesses with stringent security and compliance needs grow by providing Compliance-Ready turnkey technology solutions, allowing our clients to leverage the power of cloud computing without the added challenges and expenses of managing complex IT infrastructures on their own.\n<br><br>\nWhat does that all mean? Think about the average SMBs IT environmentits a messy spaghetti of vendors, suppliers, and consultants, all with their own agenda, technology and support. We simplify that complexity with a single solution, taking full ownership of the clients technology outcomes so they can focus on their business.\n<br><br>\nWe are a 35 year old organization with offices in California, Utah, Virginia, Toronto and Scotland. Our user based is 1.5M users worldwide and includes the full spectrum, from solo proprietors to Fortune 100 clients.\n<br><br>\n<strong>Who We Are</strong>\n<br><br>\nAs an end-to-end solutions provider, our products and services portfolio includes virtual desktop (DaaS), private cloud, case management software (CMS), email hosting services, security endpoint protection, business continuity (BCP), and on premise solutions. Since 1983, we have delivered on-demand services to over 1.5 million users worldwide, and are recognized by Forbes as one of Americas fastest growing companies.\n<br><br>\nWe were founded on one simple concept: improving the lives of professionals through the use of technology. Our core competencies serve to simplify the adoption, implementation, and management of technology to quickly increase revenues, reduce costs, and maximize efficiencies, while keeping security and compliance at the forefront.\n<br><br>\n<strong>What We Do</strong>\n<br><br>\nWe serve clients at every level of their organization, in whatever capacity we can be most useful, whether as a trusted advisor to large firm executive management or as a hands-on coach for sole practitioners. Target verticals include lawyers, general counsel, accounting firms, CPAs, government, and other private professional service organizations. For every engagement, we propose a solution tailored to meet their unique business needs and provide the utmost care in the implementation process.\n<br><br>\nNo matter the challenge, we focus on delivering practical and enduring results, and equipping our clients to grow and lead. We partner with clients to put solution recommendations into practice and grow their businesses through the leverage of highly secure, compliant and functional business systems.\n<br><br>\n<strong>About the Position</strong>\n<br><br>\nThis individual will utilize a deep technical background, key analytics and integration skills to partner with Sales and function as the key technical point of contact for software deals and provides pre-sales support contributing towards the successful conversion of prospects to customers.\n<br><br>\nThis includes working with the customers and partners to gain an understanding of their business and its needs, mapping our offerings to those needs, and providing competitive analysis that assists with the successful positioning of our offerings. A significant portion of the Sales Engineer role includes scoping, defining, and executing Proof of Concepts by conducting data acquisition and transformation, data loading, conversion analysis and server/integration requirements.\n<br><br>\nThe Sales Engineer also shall keep up to date on market developments/trends and research new technologies, tools, and methodologies as they emerge that may be applicable.\n<br><br>\n<strong>Key Responsibilities</strong>\n\n<ul>\n<li> Working with the Sales Representative to find and close new business opportunities.</li>\n\n<li> Provide strategic pre-sales support for sales activities including needs analysis, technology review, requirements definition, and proof-of-concept scoping.</li>\n\n<li> Researching companies and prospects to identify business issues and needs, and providing results of that research to customers to support our recommendations.</li>\n\n<li> Working with customers and prospects to understand their business and technical needs, to move efforts such as Proof of Concept projects forward, and to help ensure that the customer is completely satisfied.</li>\n\n<li> Create and deliver world-class product presentations and demonstrations to meet prospect, customer, or internal needs.</li>\n\n<li> Conduct proof-of-concept projects in a competitive environment.</li>\n\n<li> Become an expert in our products features, benefits, and application to customer needs.</li>\n\n<li> Communicate via phone, email, and face-to-face meetings with prospects guiding them through the evaluation and selection process.</li>\n\n<li> Provide proactive support to customers and prospects with the goal of facilitating sales. Establish and maintain positive customer relationships, and follow-up on opportunities.</li>\n\n<li> Be the customer advocate and liaison for product management and development.</li>\n\n<li> Other related duties as assigned.</li>\n</ul>\n<strong>Essential Qualifications</strong>\n\n<ul>\n<li> 10+ year increasing professional experience</li>\n\n<li> 5 or more years of experience in a pre-sales engineering role.</li>\n\n<li> Strong technical skills across various database and analytics technologies &amp; impeccable business acumen.</li>\n\n<li> BS/MS in Engineering, Computer Science, Mathematics or other technical field.</li>\n\n<li> Within a pre-sales framework, experience deploying databases such as SQL Server.</li>\n\n<li> Strong knowledge on Data Integration and ETL tools.</li>\n\n<li> Strong/Expert knowledge of SQL and query-writing.</li>\n\n<li> Statistical and analytic experience is desired.</li>\n\n<li> Excellent interpersonal, verbal and written communication skills that traverse from executive to technical levels.</li>\n\n<li> Sound understanding of ETL Best Practices/Methodologies, relational structures, dimensional data modeling, structured query language (SQL) skills, data warehouse, and reporting techniques.</li> \n\n<li> High-level understanding of .NET programming using the Visual Basic and C# programming languages, as well web development using ASP.NET, HTML and JavaScript. Candidate should have an in-depth knowledge of .NET Framework 4.0+, ASP.NET development patterns (including MVC), and experience using common JavaScript frameworks (such as JQuery).</li>\n\n<li> Experience with custom reporting using SSRS</li> \n</ul>\n<strong>This Job is based out of the San Diego Corporate Office and cannot be worked remotely.</strong>\n<br><br>\n<strong>Perks:</strong>\n\n<ul>\n<li>Health/Dental/Life/Vision Insurance, 401(k)</li>\n\n<li>Unlimited PTO, Sick Days</li> \n\n<li>Free lunch</li>\n\n<li>Onsite Gym</li>\n\n<li>Social Events</li>\n\n<li>Job Training/Educational Assistance/Professional Development</li>\n\n<li>Flexible Spending Account</li>\n\n<li>Ocean Views, Game Room, Volleyball Court, Outdoor Zen Relaxation Area, BBQ &amp; Patio Area, Cafeteria</li>\n\n<li>Nursing Room</li>\n\n<li>Short-term Disability</li>\n\n<li>Covered Parking, Free Shuttle Service</li>\n\n<li>Weekly masseuse and chiropractor onsite</li>\n\n<li>Employee discount to 24-Hour Fitness</li> \n\n<li>50% Off Gunnar Optik Eyeware</li>\n\n<li>Close proximity to UTC mall (La Jolla/Miramar) and 805/5</li>\n</ul>\n<strong>Equal Employment Opportunity:</strong>\n<br><br>\nAbacusNext® is an Equal Opportunity, Affirmative Action Employer."}