{"job title": "Data Engineer", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "Amazon retail consumables DE team is looking for a technically skilled Data Engineer who can join our team and be at the forefront of revolutionizing the way we organize our data and look at our business. Consumables Data Engineering team manages the data systems addressing the needs data storage and compute requirements of global consumables org.\n<br><br>\nYou will work directly with stakeholders and technical partners to design and implement a robust data platform that will be the backbone of analytics, ML and provide actionable insights to the business. You will be leading the charge in developing the technical strategy and design decisions. You will work with a wide range of data technologies (e.g. Redshift, EMR, Hive,S3, Kinesis, Spark, Quicksight and Tableau etc) and stay abreast of emerging technologies, investigating and implementing where appropriate.\n<br><br>\nOur ideal candidate has outstanding technical skills, analytical and data modeling capabilities, business insight, excellent communication skills, and maintains a strong passion for technology. If you love to implement solutions to hard problems while working hard, having fun, and making history, this may be the opportunity for you.\n<br><br>\n<strong>Key Responsibilities:</strong>\n<br>\n· Design, implement, and support key datasets that provide structured and timely access to actionable business information with the needs of stakeholders always in view.\n<br>\n· Interface with other technology teams to extract, transform, and load data from a wide variety of data sources using SQL , AWS big data technologies and amazon internal tools.\n<br>\n· Interface directly with stakeholders, gathering requirements and owning automated end-to-end reporting solutions.\n<br>\n· Partner with analysts, research scientists, data engineers, business intelligence engineers, and software development engineers across Consumables org and Amazon to produce complete data solutions.\n<br>\n· Investigate and implement new big data technologies to solve business problems where appropriate.\n<br>\n· Participate in developing technical strategy for turning data into actionable information.\n<br><br>"}