{"job title": "Senior Product Development Engineer (Medical Devices)", "company": "Bausch Health", "city state": "– Rochester, NY", "rating": "2.3", "job description": "Valeant Pharmaceuticals International, Inc. is a diverse pharmaceutical company that is committed to focusing on our key stakeholders while delivering consistently high performance. Our values provide the overall direction for our company, and provide us with the tools necessary to rise to any challenge by leveraging our collective hard work and effort along with our unwavering competitive spirit. These values help us set goals based on our organization’s potential and what we hope it will become.\n<br><br>\nLeading product development &amp; process development activities, writing protocols, data gathering and analysis, report writing, communication of results and next steps.\n<br><br>\nMay involve occasional domestic or international travel to other internal sites or external vendors\n<ul>\n<li>This engineer will support new contact lens product &amp; process development activities</li><li>Will be responsible for leading project subteams and generating project plans for process development activities; will be interfacing with internal/external cross functional teams.</li><li>The candidate will be involved in writing protocols, data gathering and analysis, and report writing. Must be skilled in presentation of data analysis results and communication of next steps.</li><li>The candidate will lead structured problem solving using six sigma principles to determine root causes and implement solutions and corrective actions.</li><li>Candidate will perform data analysis and provide recommendations on trends, correlations, response variables, DOE’s etc. in an effort to better understand process interdependencies and establish a capable and robust mfg process, and product that meets customer requirements.</li><li>They will also lead process optimization and yield improvement activities and conduct technical transfer to manufacturing.</li><li>The candidate will coordinate requirement setting to define automation requirements. Will perform equipment qualifications.</li></ul>\n\n<ul>\n<li>Lead equipment qualifications and new product/process validations.</li><li>Design, execute, and analyze experiments. Teach others to use appropriate analytical tools and make data driven decisions.</li><li>Lead process optimization, yield improvement, capability assessments.</li><li>Develop and support new manufacturing processes and technologies.</li><li>Lead existing manufacturing process/product quality improvements and cost reductions.</li><li>Ensure product quality and all tasks are in accordance with established SOPs, GMPs, Divisional Specifications, design control, and EHS standards.</li><li>Mentor and train junior personnel in required operations and skills.</li><li>Key Relationships: Cross functional team members, lab technicians, technical project leaders.</li></ul>\n\n<ul>\n<li>Degree in Scientific or Engineering Discipline</li><li>Computer Literacy with skills in Microsoft Excel, Word, and PowerPoint, plus Minitab, JMP (or equivalent software).</li><li>Expertise in Statistical Analysis including experience with DOE and SPC. Communication, Organization, Report Writing, and Presentation skills a must.</li><li>Must be able to develop working relationships with various internal core competencies and lead team members.</li><li>Six Sigma Black Belt and DFSS experience preferred. Minitab/JMP Statistical software preferred.</li><li>Minimum of 5 years of experience in Engineering, Process Development, and/or Quality Engineering setting. Hands-on experience and technical expertise in a development environment a must.</li><li>ISO-9000, GMP, medical device manufacturing experience a plus.</li><li>Statistical analysis required within a development or manufacturing setting.</li><li>Experienced with high volume and/or high precision manufacturing a must.</li>\n</ul>\nJob Applicants should be aware of job offer scams perpetrated through the use of the Internet and social media platforms.\n<br><br>\nTo learn more please read Valeant’s Job Offer Fraud Statement.\n<br><br>\nValeant Pharmaceuticals International, Inc. is committed to leveraging the talent of a diverse workforce to create great opportunities for our business and our people. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}