{"job title": "DevOps Engineer", "company": "CollabraSpace, Inc.", "city state": "– College Park, MD, United States", "rating": "4.9", "job description": "<strong>About the job:</strong><br><br>Candidate will be part of a team supporting production, monitoring, and operations for a big data environment. The big data environment includes the use of Elastic Stack, Apache Spark and various cloud technologies. Day to day activities will include, but not limited to, the monitoring of ElasticSearch, Hadoop, and Spark development and production environments, troubleshooting data flow and storage issues, performing data searches and identifying data issues, providing technical support to data analysts to include responding to inquiries about job status and optimizations, automating manual tasks including enhancing currently automated tasks, etc. Candidate must be able to work in a dynamic work environment and possess strong communication skills.<br><br><strong>Requirements:</strong>\n\n<ul>\n<li>A minimum of 10 years of experience in the subject area</li><li>Must possess experience with the following technologies:\n\n<ul>\n<li>Elastic Stack</li><li>Hadoop</li><li>Apache Spark</li><li>Linux Operating System</li><li>Python</li><li>Atlassian Suite (Jira and Confluence)</li></ul></li>\n<li>A BS in Computer Science (or related technical discipline)</li><li><strong>Applicants must be U.S. Citizens.</strong></li>\n</ul>\n<strong>Additional Desired Experience</strong>\n<ul>\n<li>Amazon Web Services</li><li>Google Compute Platform</li><li>Azure</li><li>Programming language (C, C++, Java, etc)</li>\n</ul>\n<strong>Location:</strong> College Park, MD/Annapolis Junction, MD<br><br><strong>About us:</strong><br><br>Collaboration is the fusion of people and ideas toward a common goal; and at CollabraSpace it’s part of everything we do. It’s the foundation upon which Collabraspace was created, at the core of our corporate philosophy, and even represented in our logo where different pieces of one circle work together. As a technical services and product company, Collabraspace supports the critical mission of our nation’s security through ongoing collaboration with our team members, customers, and partners.\n<br><br>\nAcross our 20+ programs we provide enterprise software development solutions and real-time collaboration to both government and private industry. CollabraSpace is headquartered in Annapolis Junction, MD, close to the majority of our work and therefore, close to you.<br><br><strong>CollabraSpace Facts:</strong>\n\n<ul>\n<li><strong>Team</strong>. At CollabraSpace, we truly believe in the team. We’ll always do our best to find a position that makes you happy to go to work every day, support the charitable causes that are important to you, and encourage your involvement with the company by providing events for the whole family.</li><li><strong>Security.</strong> We offer competitive salaries but more than that, we make sure the salary we are offering you can be supported by multiple programs. Why is that important? See bullet #1; if you’re not happy we will do our best to find something that does make you happy.</li><li><strong>Benefits</strong>. Our comprehensive benefits package means you pay very little for a full suite of coverage.\n\n<ul>\n<li>100% company paid premiums for Health and Dental plans for employees and eligible dependents.</li><li>100% company paid Life &amp; Disability plans.</li><li>401(k) &amp; Roth plan with company contribution immediately vested.</li><li>Annual bonus plan, spot bonuses for a job well done, and referral bonuses.</li><li>Paid Time Off (PTO) allowing you to use your time off as you see fit.</li><li>Formal education and training benefits.</li></ul></li>\n<li><strong>Transparency</strong>. You have heard it before but here you’ll truly experience it. The management team “puts it all on the table” and always has an open door.</li><li><strong>Training and Education</strong>. It’s part of our collaborative environment. Besides the traditional off-site training which we pay for upfront, CollabraSpace offers in-house Technical Exchanges on a range of topics presented by our own technical staff or industry partners.</li><li><strong>Honors.</strong> We earned the Alliance for Workplace Excellence Award for 4 years running and have been named to the Baltimore Sun’s Top 100 Workplaces 2013, 2014, 2015, 2016, and 2017; an award given based on survey responses from our team members. We are consistently ranked as one of the Top IT Firms in Baltimore by the Baltimore Business Journal.</li>\n</ul>\nEqual Opportunity Employer/Veterans/Disabled\n<br><br>\nCollabraSpace is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, age, sexual orientation, gender identity, genetic information, marital status, physical or mental disability, medical condition, veteran status, or any other factor determined to be unlawful by federal, state, or local statutes.<br><br><strong>Make a life at CollabraSpace, not just a living!</strong><br><br><strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}