{"job title": "eBusiness &amp; Commerce Analytics and Big Data Strategist", "company": "Dell", "city state": "– Round Rock, Texas", "rating": "3.8", "job description": "Why Work at Dell?\n<br><br>\nEndless challenges and rewards. Opportunities on six continents. A team of colleagues fueled by collaboration. All this, and a company deeply committed to integrity and responsibility.\n<br><br>\nDells Online Engineering (Dell Commerce Services) organization is hiring an eBusiness &amp; Commerce Analytics and Big Data Strategist to be part of the Analytics team. This is a global team responsible for analytics and insights for our Multi Billion $ online B2B business. Work of this team influences actions of Run the Business Operations team and also features and roadmaps considered by our engineering development team.\n<br><br>\nOur B2B Analytics team is responsible for analytics and insights for our Buyer and Seller platform of applications regarding:\n<br><br>\n- Platform Health-Speed and stability of entire ecosystems of applications supporting business.\n<br><br>\n- UX Improvement- customer online experience Engineering Launches and ROI, program benefit analysis Optimization of Revenue/Unit/Margin Run the Business\n<br><br>\nIn this role, you will use state of the art analytics techniques such as Artificial Intelligence and machine learning, Algorithmic delivery, Graph data bases, Predictive Analytics, etc. to drive strategy and execution in areas impacting the entire business. Some examples of your work responsibilities include:\n<br><br>\n- Discover new trends and anomalies in customer behavior pattern resulting in increasing customer LTV through improving online experience\n<br><br>\n- Design Radical personalization to help Customers find what they want and what they may need\n<br><br>\n- Use predictive analytics to predict customer propensity to purchase and churn\n<br><br>\n- Price and product optimization to promote right product mix\n<br><br>\n- Resource allocation and optimization techniques to promote more online vs offline selling of increasingly complex hardware and cloud Dell-EMC product portfolio\n<br><br>\nTo accomplish these, you will be responsible for:\n<ul>\n<li>New Idea generation in collaboration with stakeholders</li><li>Working with Data science team to build solutions</li><li>Implementation with stakeholders</li><li>Ensuring that results match expectations</li><li>Collecting feedback and improving solution further</li>\n</ul>\nThe output of your work will play a critical role in DCSs prioritizations, enhancement ideation, and run-the-business optimization. All work is to be delivered with strong team and stakeholder partnership and maniacal focus on customer centric insights.\n<br><br>\n<strong>Preferred body of knowledge and direct experience in:</strong>\n<br><br>\nMultitude of analytics techniques including predictive modeling, Artificial intelligence and machine learning, Graph databases, customer segmentation, experimental design, pricing optimization and more.\n<br><br>\nThe candidate will have hands-on analytics capabilities, expertise in analytical problem-solving techniques and frameworks and the ability to deal with large volumes of data. He/she will have the experience of working on solving complex analytical problems and should be comfortable with analytical tools. The person will be responsible for operating within a dynamic, fast-paced, scalable &amp; agile IT development environment, which faces both internal and external customers.\n<br><br>\nThe team needs individuals with strong analytic knowledge to deliver high value insight and recommendations. We are looking for a senior candidate who has a strong background in analytics, with proven abilities to be innovative and creative, as well as strong collaborator and communicator enabling influence.\n<br><br>\n<strong>Qualifications:</strong>\n<br><br>\n8+ years of related experience plus a Bachelors degree, 6 years plus a Masters degree, or 3 years plus a PhD, or equivalent additional professional experience, to include the following:\n<br><br>\n- Strong comfort with data. Ability to collect, analyze and develop actionable insight from data. Strong Excel (pivot tables, etc.).\n<br><br>\n- Understanding of eCommerce buying process, pathing, etc. from lead generation to conversion\n<br><br>\n- Understanding of Sales and Channel processes (pre-purchase, purchase path, post purchase) is a plus\n<br><br>\n- Strong communication skills, including the ability to convey analytic insights effectively to both IT and business audiences\n<br><br>\n- Excellent problem solving skills, teamwork, business acumen, and customer advocacy skills\n<br><br>\n- Strong presentation, leadership, business influence, and project management skills\n<br><br>\n- Experience working within global teams\n<br><br>\n<strong>Preferences:</strong>\n<br><br>\n- Candidate may come from different strategy consulting backgrounds- management strategy, Digital strategy, eCommerce strategy or supply chain strategy. Ideally experience in a strategy consulting firm, such as McKinsey, Bain, BCG, etc., or equivalent experience.\n<br><br>\n- Knowledge of state of the analytics tools and techniques - Artificial intelligence, Machine learning, Graph databases, etc.\n<br><br>\nDell is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy), sexual orientation, gender identity and/or expression, national origin, protected veteran status, disability, genetics, or citizenship status (when otherwise legally authorized to work) and will not be discriminated against on the basis of such characteristics or any other status protected by the laws or regulations in the locations where we operate. Dell encourages applicants of all ages."}