{"job title": "Software Engineer III Application Development", "company": "Envision RX", "city state": "– Fort Lauderdale, FL", "rating": "2.8", "job description": "<div><strong>Software Engineer III</strong><strong> Application Development</strong></div><div><br></div><div>The Software Engineer III is responsible for supporting the application development functions of the company by designing, developing, and supporting innovative technical solutions. This position has no direct reports.</div><div> </div><div><strong>ESSENTIAL </strong><strong>DUTIES AND RESPONSIBILIT</strong><strong>I</strong><strong>ES:</strong> </div><ul><li>Analyze and define customer requirements</li><li>Design and develop software modules that meet customer requirements while upholding high standards, reliability, security, maintainability, and performance</li><li>Define product technical architecture</li><li>Design complex software components</li><li>Participate in peer reviews for designs, code, and other work products</li><li>Perform software quality assurance, including all types of testing of database designs to confirm functionality and performance</li><li>Write technical documentation</li><li>Advise management on product and process improvement</li><li>Enhance and maintain applications </li><li>Participate with and lead a team to carry out the full lifecycle of software development activities</li><li>Play a lead role in setting the architecture and design for our products</li><li>Perform code reviews in the appropriate technologies </li><li>Team leader who actively mentors staff to improve skillset and career potential</li><li>Other duties as assigned</li></ul><div><strong>REQUIREMENTS:</strong></div><ul><li>Bachelor’s degree in computer science, information systems or related field; proven industry experience will be acceptable in lieu of degree</li><li>Minimum 7+ years’ development experience </li><li>Thorough technical and platform knowledge, including Visual Studio,.NET, C++, Linux and HTML</li><li>Thorough knowledge of database technology, preferable Oracle or SQL</li><li>Knowledge relating to the area in which analysis and coding is performed</li><li>Understanding of agile software development methodology and industry best practices</li><li>Understanding of fundamental software engineering and computer science principles: object-oriented design, structured design, databases, algorithms, data structures, usability, refactoring, debugging, and configuration management</li><li>Demonstrated aptitude for learning new technologies</li><li>A good educator who is trustworthy and willing to share information and serve as a mentor</li><li>An intelligent and articulate individual who can relate to people at all levels of an organization and possesses excellent communication skills</li><li>A decisive individual who possesses a strategic focus as well as an operational, implementation and detail oriented perspective </li><li>A strategic planner with sound technical skills, analytical ability, good judgment and strong operational focus</li><li>Ability to work with peers in a team effort</li><li>Demonstrated ability to manage multiple priorities and deadlines</li><li>Ability to work extended hours, weekends and holidays pursuant with industry demands</li><li>Proficient in Microsoft Office and industry related software programs</li></ul><div><strong> </strong></div><div><strong>PREFERRED </strong><strong>QUALIFICATIONS:</strong></div><ul><li>Extensive Oracle database knowledge and experience</li></ul><div><strong>WORK ENVIRONMENT:</strong></div><div>Includes a typical office environment, with minimal exposure to excessive noise or adverse environmental issues. </div><div><strong>PHYSICAL REQUIREMENTS:</strong></div><div>Ability to sit for prolonged periods of time. </div><div> </div><div><strong>Pre-employment drug screening and background checks are required. The company offers a competitive salary and benefits package. EOE. </strong><strong>All qualified applicants receive consideration for employment without regard to race, color, religion, sex, national origin, disability or veteran status.</strong></div><div><strong>EnvisionRxOptions is committed to maintaining a productive, drug-free workplace that keeps employees and customers safe from harm.</strong></div><div><br></div>"}