{"job title": "Data Engineer", "company": "HSB Group", "city state": "– Hartford, Connecticut", "rating": "3.3", "job description": "<strong>Title</strong>\n<br>\nData Engineer\n<br><br>\n14-Aug-2018\n<br><br>\n<strong>Job Description</strong>\n<br>\nThis position will be responsible for data engineering related works within the data &amp; analytics governance office of HSB. This individual will create high quality modeling datasets and manage the technical environment for analytics model development. The successful candidate will work with IT &amp; data scientists to improve the data management capabilities of the analytics model development process and work to create modeling datasets by combining internal &amp; external data assets. This position will also be responsible for analytical model deployment work.\n<br><br>\n<strong>Requisition Number</strong>\n<br>\n<strong>2284BR</strong>\n<br><br>\n<strong>Qualifications</strong>\n<br>\n<strong>Required:</strong>\n\n<ul>\n<li>Bachelor's degree in Computer Science, Information Systems, Math or equivalent work experience</li><li>3+ years of experience as a data engineer within a modeling environment</li><li>3+ years of data &amp; analytics experience within P&amp;C industries preferred</li><li>Experience with Python, Informatica, Git, PySpark, Dockerized containers</li><li>Hands-on experience with Hadoop based technologies (MapReduce, Hive, Pig), SQL (MySQL, Oracle), NoSQL (MongoDB, HBASE, Cassandra), and Data Warehousing Solutions</li><li>Strong analytical and reasoning capabilities</li><li>Detail oriented with a commitment to documentation of work performed, assumptions and results</li><li>Well developed communication and presentation skills</li><li>Aptitude for performing multiple tasks and dealing with changing deadline requirements</li><li>Well organized with the ability to set and meet deadlines</li>\n</ul>\n\n<strong>Preferred:</strong>\n\n<ul>\n<li>Graduate degree</li><li>3+ years of Python, Java programming &amp; Informatica experience within an analytics environment</li><li>Strong data management experience</li><li>Some experience with analytics model deployment</li><li>Desire to learn new software, data sources and skills to improve data management and analytics model deployment</li>\n</ul>\n\n<strong>State</strong>\n<br>\nConnecticut\n<br><br>\n<strong>Employment Type</strong>\n<br>\nFull Time\n<br><br>\n<strong>Additional Information</strong>\n<br>\nWe are an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n<br><br>\nThe work environment characteristics, and any physical and mental requirements described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<br><br>\nThis job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee. Other duties, responsibilities and activities may change or be assigned at any time with or without notice.\n<br><br>\n<strong>City</strong>\n<br>\nHartford\n<br><br>\n<strong>Company Name</strong>\n<br>\nHartford Steam Boiler\n<br><br>\n<strong>Country</strong>\n<br>\nUnited States of America\n<br>"}