{"job title": "Senior Back End Engineer", "company": "IntraEdge", "city state": "– Calabasas, CA", "rating": "3.6", "job description": "Description: Sr. Back End Engineer <br>This position is for a Backend Engineer who has exceptional JavaScript and Node experience. Our ideal candidate has worked in a high velocity team building data APIs for consumption by both internal and external customers. We’re looking for someone who would take strong ownership of this part of the stack. A history of building distributed systems in a service oriented architecture is preferred.<br>About you<br><br>-You’re ready to be a key influencer in the full software development lifecycle: design, architect, engineer, and rollout.<br>-Primarily responsible for server-side JavaScript/Node development.<br>-Build performant APIs that expose all of our rich data easily and securely.<br>-Partner with front-end developers to build interface contracts and make it easy to fetch data. <br>-Support integration with multiple polyglot systems in order to aggregate and marshal data.<br>-Partner with data platform engineers to ensure data quality and apply business rules at the service level.<br>-Help lead projects and technical direction of the product.<br>-Manage your own time, and work well both independently and as part of a team<br><br>Qualifications<br><br>-3-5 years experience as JavaScript, Node, RESTful API’s on the server side<br>-Extensive experience designing scalable, high availability, high performance server systems<br>-Familiarity with at least one open source CMS such as Drupal<br>-Experience with backend technologies to interface with databases like PostGreSQL, SOLR and MySQL<br>-Experience with TDD/BDD<br>-Solid understanding of data structures and algorithms.<br>-Experience with Docker containers and immutable infrastructures is preferred. <br>-Microservice architecture and API gateway experience is preferred.<br><br>Benefits<br>A very generous and comprehensive salary and benefits package, including:<br><br>-Medical, Dental, and Vision Insurance<br>-Life &amp; Accident Insurance<br>-Short and Long Term Disability<br>-Paid Time Off<br>-401k plan<br>-Medical, Dependent Care, and Parking/Transit Flex Spending Plans<br>-Wellness Program<br>-Employee Assistance Program<br>-Casual dress<br>-Daily, company-provided coffee, tea, soda, and snacks<br>-Friendly, team-oriented, open environment"}