{"job title": "Sr. Systems Data Engineer with Polygraph", "company": "Leidos", "city state": "– CHANTILLY, VA", "rating": "3.4", "job description": "<strong>Description</strong>\n<br><br>\n• Provide assistance with dashboard design ideas to development team in support of client\n\n\n<ul>\n<li>Integrate multiple data streams and feeds from networks, infrastructure services, mission/business application into near, real-time dashboards for use in trouble shooting and the presentation of situational awareness briefings to leadership</li>\n<li>Utilize pre-built dashboards/add-ons within Splunk system and be able to create custom Splunk dashboards and search queries to meet the customer’s needs</li>\n<li>Provide recommendations/action plans for incorporating new data streams to present additional visualizations</li>\n<li>Perform software requirements, system integration activities, lead research, designs develops and test software and tools to include development of new work product or enhancing existing applications, system or embedded products</li>\n<li>Conduct appropriate investigation and support resolution and technical solution reporting</li>\n<li>Provide initial problem resolution where possible and reporting</li>\n<li>Assist customer with data interpretation for ETL ingestion and quality assurance</li>\n<li>Generate, monitor and track incidents/events through to resolution\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n• Bachelor’s degree in related discipline and 12+ years' experience. Additional experience in lieu of degree.</li>\n<li>10+ years’ experience in Cyber security</li>\n<li>Active/current TS/SCI clearance with polygraph</li>\n<li>Possess exceptional knowledge of customer data sets</li>\n<li>Experience working in Windows environment</li>\n</ul>\n\n<strong>Desired Qualifications</strong>\n\n\n<ul>\n<li>Advanced understanding of specific enterprise environments that direct the correlation of system data for mission impact</li>\n<li>IC experienced desired</li>\n<li>Experience with custom scripting desired: Python, JavaScript, HTML, CSS, SQL, D3</li>\n<li>Experience writing Splunk queries in Splunk Programming Language (SPL)</li>\n<li>Splunk Certified Power User Certificaiton</li>\n\n</ul>"}