{"job title": "Data Engineer", "company": "Lumiata", "city state": "– ", "rating": "3.3", "job description": "Reporting to the Sr. Director of Data Engineering, the Data Engineer will play a critical role in helping develop and maintain Lumiata’s core data science infrastructure. You will be working on and helping to develop automated pipelines for training and deploying machine learning models and building high performance systems to understand complex patient data.\n<br><br>\nIn the process you will learn in detail how medical information flows from patient all the way through to meaningful insights and the many intricacies involved along the way including but not limited to:\n\n<ul>\n\n<li>How AI and machine learning can transform healthcare.</li>\n<li>How medical information is stored and communicated between different actors in the healthcare system.</li>\n<li>What modern, open standards have been developed to better communicate and represent medical data.</li>\n<li>What specific standards must be respected and how to ensure compliance to handle sensitive healthcare data including HIPAA, SOC2 and HITRUST among others.</li>\n<li>How to apply TensorFlow, Apache Spark, and other cutting edge tools in a production environment.</li>\n\n</ul>\n<br><br>\nWe are a diverse, international, creative team; join us in building a better medical system for everyone by tackling looming health problems using large scale machine learning.\n<br><br>\n<strong>Key Responsibilities</strong>\n\n<ul>\n\n<li>Research and design of algorithms to solve problems using medical &amp; healthcare data.</li>\n<li>Building and developing pipelines to</li>\n<li>Handle large volumes of heterogeneous medical data.</li>\n<li>Train/update/version/maintain production machine learning systems</li>\n<li>Expose multilayer machine learning systems to customers while maintaining first class privacy and security standards.</li>\n<li>Extract and expose external public data sources to enhance medical machine learning models</li>\n\n</ul>\n<br><br>\n<strong>Qualifications</strong>\n\n<ul>\n\n<li>Strong developer skills building python infrastructure and applications</li>\n<li>Solid working experience building applications in Scala or other similar language</li>\n<li>Working experience with Hadoop, Apache Spark and distributed databases preferred</li>\n<li>Development of products using distributed computing &amp; big data products will be a huge plus</li>\n<li>Experience in high concurrency platforms, graph databases, applied mathematics - a plus.</li>\n<li>B.S. or MS degree in Computer Science or related fields.</li>\n\n</ul>\n<strong>Benefits</strong>\n\n<ul>\n\n<li>Competitive salary and equity</li>\n<li>Lunch provided daily</li>\n<li>Open vacation policy</li>\n<li>95% company paid health benefits</li>\n<li>401K</li>\n<li>Company-sponsored happy hours, parties, and offsite events</li>\n\n</ul>"}