{"job title": "Cyber Systems Engineer 3", "company": "Northrop Grumman", "city state": "– Fort Meade, MD", "rating": "3.7", "job description": "The Candidate shall identify and perform research, analysis, analysis of alternatives (AoA), evaluation, development and test of technologies from industry, academia, and other government organizations, to include Commercial Off-The-Shelf (COTS), Government Off-The-Shelf (GOTS), and open source technologies, for applicability to solving Cyberspace Operations deficiencies and capability gaps, improving existing Cyberspace Operations and enabling capabilities and/or generating new Cyberspace Operations capabilities.\n<br><br>\nThe candidate shall review and summarize commercial entities' cyber capabilities and their ability to meet mission needs.\n<br><br>\nThe candidate shall facilitate any industry days to help the command stay current with new and emerging technology.\n<br><br>\nThe candidate shall provide systems engineering recommendations and assist with the planning and execution of development efforts for complex software and hardware systems, and systems of systems in support of full-spectrum cyberspace operations. The candidate shall perform the following tasks:\n\n<ul>\n<li>Development and fielding of cyberspace operations capabilities by eliciting, analyzing, developing and managing requirements; performing functional analyses;</li> \n\n<li>Develop system functional and physical designs/architectures;</li> \n\n<li>Develop test and evaluation plans/procedures;</li> \n\n<li>Execute test plans and procedures;</li> \n\n<li>Analyze test data and developing reports;</li> \n\n<li>Conduct trade studies and/or structured analyses of alternatives;</li> \n\n<li>Develop and executing risk management plans;</li> \n\n<li>Develop and managing interface control documents;</li> \n\n<li>Conduct technology readiness assessments; and</li> \n\n<li>Develop system specification documents.</li> \n\n<li>Support development of Systems Engineering Management Plans (SEMPs), Test &amp; Evaluation Master Plans (TEMPs), Design Documents, and other Systems Engineering artifacts</li> \n\n<li>Lead requirements development efforts, including requirements elicitation, documentation, synthesis, refinement, and management</li> \n\n<li>Lead and/or participate in Technical Exchange Meetings (TEMs), including but not limited to formal and informal design reviews</li> \n\n<li>Balance trade space design considerations and provide engineering recommendations in support of the system development, and ensure the system's development aligns with respect to project schedule and performance (e.g. functional specifications, integration, and overall mission thread support)</li> \n\n<li>Lead test and evaluation efforts and ensure that the system meets all required certifications. Conduct analyses of alternatives and trade studies.</li> \n\n<li>Develop and present briefs to the government to gain program support, and obtain program decisions.</li> \n\n<li>Document data and results along with summary of findings</li> \n\n<li>Document technical discovery/research</li>\n</ul>\n\n<strong>Basic Qualifications:</strong><br><br>5or more years of experience working in a complex and highly technical IT systems engineering environment.\n<br><br>\n5 year experience in the following: the Joint Capability Integration &amp; Development System (JCIDS) process; requirements engineering; development of systems engineering artifacts such as trade studies, function trees, interface control diagrams and specifications.\n<br><br>\nKnowledge of Department of Defense Architecture Framework (DoDAF), Functional Flow Block Diagram (FFBD), Integration Definition (IDEF), Function Block Diagram (FBD), Unified Modeling Language (UML), Systems Modeling Language (SySML), and other system modeling languages.\n<br><br>\nBachelor of Science degree or higher in System Engineering, Electrical Engineering, Computer Engineering, or Computer. Science an accredited institution recognized by the U.S. Department of Education (\n<br><br>\nTS/SCI with CI Polygraph\n<br><br>\nUS Citizen<br><br><strong>Preferred Qualifications:</strong>\n<br><br>\nNorthrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit www.northropgrumman.com/EEO. U.S. Citizenship is required for most positions."}