{"job title": "Software Engineer 2", "company": "Northrop Grumman", "city state": "– Warner Robins, GA", "rating": "3.7", "job description": "<div>Northrop Grumman is a leading global security company providing innovative systems, products and solutions in autonomous systems, cyber, C4ISR, strike, and logistics and modernization to government and commercial customers worldwide. Northrop Grumman Technology Services Sector is seeking a <strong>Software Engineer 2</strong> to join our team of qualified, diverse individuals in <strong>Warner Robins, Georgia</strong>. Put your years of experience into a future of excellence as a Software Engineer to provide engineering support for Electronic Warfare programs.</div> \n<br>\n<div><strong>Responsibilities:</strong> </div>\n\n\n<ul>\n<li>Design, implement, document, test and debug embedded software.</li>\n\n<strong></strong><li><strong>Analyze electronic warfare system capabilities to:</strong>\n\n\n<ul>\n<li>Resolve problems</li> \n\n<li>Develop requirements</li> \n\n<li>Prepare operating instructions</li> \n\n<li>Simulate and test software designs</li> \n\n<li>Perform data analysis</li></ul></li>\n<li>Research and collaborate on new software algorithm designs.</li> \n\n<li>Execute, analyze, and evaluate embedded software applications on radar systems.</li> \n\n<li>Use various integrated development environment tools and applications to identify and troubleshoot software algorithms.</li> \n</ul>\n\n<strong><div>Basic Qualifications:</div>\n\n<br></strong>\n\n\n<ul>\n<li>2+ years of software engineering experience with a Bachelor's degree in Electrical Engineering, Computer Science/Engineering, or related field; or 0+ years' experience with a Master's degree.</li> \n\n<li>Proficient in a high order language (i.e. C, C++, or C#)</li> \n\n<li>Must have knowledge in object-oriented software development methodologies</li> \n\n<li>Must understand all phases of software development</li> \n\n<li>Must be able to work both independently and in a team environment with strong written, verbal, and interpersonal communication skills</li> \n\n<li>Possess interim or active Department of Defense (DoD) Secret clearance, or an inactive Secret clearance (active within the past 2 years)</li>\n</ul>\n\n<strong><div>Preferred Qualifications:</div> \n\n<br></strong>\n\n\n<ul>\n<li>Working knowledge of embedded real-time system development.</li>\n</ul>\n\n<div>Northrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit www.northropgrumman.com/EEO. U.S. Citizenship is required for most positions.</div>"}