{"job title": "Resident Engineer", "company": "Palo Alto Networks", "city state": "– Las Vegas, NV, United States", "rating": "3.7", "job description": "<strong>Palo Alto Networks®</strong> is the fastest-growing security company in history. We offer the chance to be part of an important mission: ending breaches and protecting our way of digital life. If you are a motivated, intelligent, creative, and hardworking individual, then this job is for you!\n<br><br>\nThe Resident Engineer (RE) will provide expert support, analysis and research into complex problems and processes relating to deployed Palo Alto Networks equipment. The RE will function as the Palo Alto Networks products Subject Matter Expert (SME) and will interact directly with the customer's personnel. The RE will serve as the technical expert on executive-level project teams within the customer providing technical direction, interpretation, and alternatives. The RE contributes to the development of new principles and concepts, works on unusually complex technical problems and provides solutions which are highly innovative and ingenious. This is a highly technical, hands-on role and the RE will be required to develop and maintain an expertise on the products and solutions deployed within the Customer's network.\n<br><br>\n<strong>\n<br>\nResponsibilities:</strong>\n<ul>\n<li>Work full-time at the customer site.</li><li>Migrate legacy Juniper SRX firewalls to Palo Alto NGFW.</li><li>Configure and implement NGFW and Panorama.</li><li>Analyze logs and events from the solution and provide threat analysis reports.</li><li>Build custom security policies and application signatures.</li> <li>Interact with the Palo Alto Networks TAC to troubleshoot and diagnose cases.</li><li>Mitigate web-based threats in a timely manner.</li><li>Maintain the Palo Alto Networks solution and provide guidance on code upgrades, etc.</li><li>Use PANW Migration Tool to migrate competitor to PANW.</li>\n</ul>\n<strong>Qualifications:</strong>\n<ul>\n<li>Juniper SRX to Palo Alto firewall migration experience</li><li>Hands on experience with Cisco ACI concepts with Palo Alto</li><li>Excellent written, listening and verbal communication skills.</li><li>Minimum 5 years experience with IDS/IPS solutions and technologies.</li><li>Minimum 5 years experience managing security solutions in large environments.</li><li>Extensive knowledge of different security threats.</li> <li>Strong understanding of core Internet protocols and applications.</li><li>Detailed technical experience in the installation, configuration and operation of high-end firewall appliances, ideally Palo Alto Networks products.</li><li>Strong TCP/IP networking skills.</li><li>Ability to effectively manage many different tasks simultaneously.</li><li>Extensive background in inter-networking, LAN, and WAN technologies required.</li> <li>Extensive experience in Palo Alto virtualization for cloud with configuration and implementation.</li>\n</ul>\n<strong>\n<br>\nCompetitive/Additional Skills:</strong>\n<br><br>\nShould exhibit some or most of these\n<ul>\n<li><u>Someone who has been at the forefront of a PRODUCTION Cisco ACI , Palo Alto implementation.</u></li><li>Hands on experience</li><li>Certified CCIE Data Center</li><li>Certified Palo Alto Engineer</li><li>Certified Juniper SRX</li><li>8 years experience production firewalls</li>\n</ul>\nLearn more about Palo Alto Networks <strong>here</strong> and check out our <strong>fast facts</strong>\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}