{"job title": "Software Engineer 2", "company": "PayPal", "city state": "– San Jose", "rating": "3.7", "job description": "Job Description Summary:<br><br>Software engineers at PayPal develop innovative solutions and high quality products that touch millions of people every day around the globe. Our engineers solve some of the most complex technical problems in the world of payments across all business units, including PayPal, Braintree, Venmo, and Paydient. We’re looking for the highest levels of technical talent and programming skills, as well as a keen desire to deeply understand our products and services to push our technology forward with respect to functionality, performance, reliability, and scalability.<br><br>Job Description:\n<br><br>\nYou’ll work alongside the best and the brightest engineering talent in the industry. The Global Professional Services Organization has opportunities in a wide range of areas including development, design, search, platform, test, quality, big data, front end, and back end. As a core participant of your team, you’ll estimate engineering efforts, prioritize projects, plan implementations, and triage production issues. You need to be dynamic, collaborative, and curious as we build new experiences, improve existing products, and develop distributed systems powering the world’s largest e-commerce and payments websites at a scale few companies can match.\n<br><br>\n• Excellent programming skills in Java, NodeJS, Spring, HTML, JavaScript, CSS\n<br><br>\n• Exposure to additional languages such as PHP, Python, Microsoft .NET (C#), iOS, Android, and related web technologies\n<br><br>\n• Experience writing unit/functional tests using Mocha, Nemo.js, JUnit, Selenium, etc.\n<br><br>\n• Experience debugging web applications using Developer Tools on the browser\n<br><br>\n• Familiarity working with SQL and noSQL datastores\n<br><br>\nBachelor's or Master’s Degree in Computer Science\n<br><br>\nSubsidiary:<br><br>PayPal<br><br>Travel Percent:<br><br>0<br><br>Primary Location:<br><br>San Jose, California, United States of America<br><br>Additional Locations:\n<br><br>\n<strong>We're a purpose-driven company whose beliefs are the foundation for how we conduct business every day. We hold ourselves to our One Team Behaviors which demand that we hold the highest ethical standards, to empower an open and diverse workplace, and strive to treat everyone who is touched by our business with dignity and respect. Our employees challenge the status quo, ask questions, and find solutions. We want to break down barriers to financial empowerment. Join us as we change the way the world defines financial freedom.</strong>\n<br><br>\n<strong>Paypal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities.</strong>"}