{"job title": "World-Ready Engineer", "company": "PayPal", "city state": "– San Jose", "rating": "3.7", "job description": "Job Description Summary:<p></p>Entry-level Full stack Java or Node engineer for World-Ready Engineering Team.<p></p><p>Job Description:</p><p>How would you like to be part of a team that helps every person fulfill their right to participate in the global economy?</p><p></p><p>At PayPal, we believe we have an obligation to empower people to exercise this right. To do this, the payment experience must be intuitive, simple, relevant, and secure no matter where you live, what currency you use or what language you speak.</p><p></p><p>The World-Ready Technology team creates the vision for infrastructure, platform and tools to enable PayPal products to work in any culture, any language, and any currency. This team focuses on developing state of the art solutions to enable PayPal's millions of customers to have an intuitive and meaningful experience as they interact in the global economy as merchants or consumers. As part of this awesome team you will be a core part of application development producing results that matter for both internal and external users.</p><p></p><p>The PayPal World-Ready Framework is a suite of libraries, services, and compiled metadata, which are used throughout the developer community to connect applications to economies and cultures across the planet. With the W-R Framework you will enables market-specific user experience and business-rules customization, internationalization (i18n), and localization (L10n) for countries, languages, and cultures everywhere PayPal does business.</p><p>As a contributor in the World-Ready Technology Team,</p><ul><li>You will be crafting and developing next generation customizable frameworks, services and tools</li><li>You will work with product leaders using agile methodologies to deliver high quality solutions</li><li>Working with operations leaders, you will design applications and services that are highly available and reliable</li><li>You will engage with team members to define World-Ready coding guidelines</li><li>Working with PayPal development teams, you will be integral in the adoption of World-Ready frameworks and coding guidelines</li><li>You will evaluate the latest software standards, tools and technologies then craft the plans and execution for PayPal adoption</li><li>You will evangelize the culture of enabling every person to participate fully in the global economy through PayPal.</li></ul><p></p><p><b>Job Requirements</b></p><ul><li>2 or more years experience with software projects</li><li>Understanding of concepts needed to design and develop personalized and modular or pluggable software and products</li><li>You should have a deep understanding of core software standards</li><li>Experience writing JavaScript code including experience with common libraries (JQuery and Angular/Ember/React), debugging tools (Chrome Dev Tools, etc.) and source control (GitHub).</li><li>You should be familiar and comfortable with command-line applications, source control, testing frameworks and other aspects of developing in large, distributed software teams.</li><li>Knowledge of object-oriented design patterns and programming</li><li>Understanding of design/implementation for reliability, availability, scalability and performance</li><li>Understanding of modern data structures and schemas such as JSON and XML</li><li>You should understand of agile development concepts - even better if you have previous experience on an Agile team</li><li>BS in Computer Science or related degree required. MS preferred</li></ul><p></p><p><b>Extra points for</b></p><ul><li>Experience in mobile application technologies (Objective-C, Android-Java, Swift)</li><li>Experience with SaaS architectures and REST or GraphQL</li><li>Experience with relational and/or OO databases (MySQL, CouchDB)</li><li>Knowledge of ICU and CLDR or Node-intl and globalize.js</li></ul><p></p><p>Subsidiary:</p>PayPal<p></p><p>Travel Percent:</p>0<p></p><p>Primary Location:</p>San Jose, California, United States of America<p></p><p></p><p></p><p>Additional Locations:</p><p></p><p></p>BSCS or BSEE or Other Related 4yr Technical Degree: Computer Science<p></p><p></p><p></p><p></p><p><b>We're a purpose-driven company whose beliefs are the foundation for how we conduct business every day. We hold ourselves to our One Team Behaviors which demand that we hold the highest ethical standards, to empower an open and diverse workplace, and strive to treat everyone who is touched by our business with dignity and respect. Our employees challenge the status quo, ask questions, and find solutions. We want to break down barriers to financial empowerment. Join us as we change the way the world defines financial freedom.</b></p><p></p><p></p><p><b>Paypal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities.</b></p>"}