{"job title": "Software Engineer I", "company": "PDI Software", "city state": "– Alpharetta, GA", "rating": "4.3", "job description": "<strong>Overview</strong>\n<br><br>\nPDI helps convenience store retailers and petroleum wholesale marketers worldwide thrive in a digital economy with enterprise management software. Over 1,200 customers operating more than 100,000 locations trust PDI to optimize their operations, whether they are a single site, multi-site, dealer or a franchise operator. PDIs enterprise software, wholesale and logistics management software solutions and retail back office systems have been designed around the evolving needs of customers for more than 35 years. We reimagine enterprise management to help our customers transform their business and deliver exceptional experiences. Backed by the investment of TA Associates and Genstar, PDI is embarking upon an aggressive expansion strategy through internal investment in development as well as intensive M&amp;A activity. The result will be a broader, more powerful, international company that serves customers across the entire supply chain, from wholesalers, to retailers, and every stop in between.\n<br><br>\n<strong>Department</strong>\n<br><br>\nSoftware Engineers are engaged in developing software for PDIs enterprise software products and solutions. Responsibilities include development and testing of various modules within the system. This role works with a range of technologies and requires a solid software application knowledge base to evaluate the requirements at hand and develop the best software solutions.\n<br><br>\nAs a Software Engineer I you will be contributing to the design and development of enterprise applications using software languages such as C#, .NET, Java and have some familiarity with SQL and web based applications. The ideal candidate will be highly motivated and have a passion for technology, customers, and problem solving. If you are self-driven, enjoy working in a team environment, have a pioneering spirit and enjoy helping others be successful, our team has a place for you.\n<br><br>\n<strong>Job Functions</strong>\n\n<ul>\n<li>Actively developing software solutions for PDIs retail solutions and products.</li>\n<li>Performs testing to ensure systems meet documented user requirements.</li>\n<li>Works closely with the team, and reports clearly and accurately to management.</li>\n<li>Prepares and provides project status and risk assessments to their manager with appropriate levels of detail to ensure that programs stay on schedule.</li>\n<li>Uses a disciplined approach in an Agile environment to assist in analysis and determination of preferred solutions to technical challenges.</li>\n<li>Troubleshoot, test and validate software issues; resolve issues with due urgency and maintain thorough documentation of all software solutions.</li>\n<li>Compiles test results to provide data for use in solving problems.</li>\n<li>Perform engineering level tests to find defects; troubleshoot and debug development and production issues, collaborating with QA Engineers to develop optimal product test plans.</li>\n</ul>\nRequired Skills &amp; Experience\n\n<ul>\n<li>0 - 2 years experience designing and developing new or maintaining existing software applications in a software product development environment.</li>\n<li>Familiarity of one or more of the following is required: .Net and C#, SQL, JavaScript, ASP.NET, MVC. Familiarity with the Visual Studio IDE and the use of Microsoft TFS would be an advantage.</li>\n<li>Knowledge of Agile/Scrum methodology is preferred.</li>\n<li>Demonstrable analytical and problem-solving skills.</li>\n<li>Ability to independently work as a contributing member in a high-paced and focused team.</li>\n<li>Strong communication skills with both verbal and written communication skills.</li>\n<li>Self-motivated and able to work under pressure to deliver high-quality solutions and receive constructive feedback.</li>\n</ul>\nEducational Requirements\n\n<ul>\n<li>Bachelors Degree in a related technical field, or equivalent work experience</li>\n</ul>\nPDIs employee-oriented culture provides a supportive and dynamic work environment for high achievers. PDI seeks individuals who value continuous learning, hold high ethical standards, and are top performers in their respective fields. We offer competitive wages, professional development, superb culture, and a highly competitive benefits package. For more information about PDI, please visit our website at https://www.pdisoftware.com/careers. PDI is an Equal Opportunity Employer. We verify employment eligibility for all new hires using e-Verify."}