{"job title": "PMTS, Data Converter Design Engineer", "company": "Quantenna Communications", "city state": "– Tempe", "rating": "4.4", "job description": "<div><strong>Quantenna</strong> (Nasdaq: QTNA) is a global leader and innovator of high performance Wi-Fi solutions. Founded in 2006, Quantenna has demonstrated its leadership in Wi-Fi technologies with many industry firsts into the market. Quantenna continues to innovate with the mission to perfect Wi-Fi by establishing benchmarks for speed, range, efficiency and reliability. Quantenna takes a multidimensional approach, from silicon, system to software, to assess Wi-Fi networks and provides total solutions for service providers worldwide. For more information, visit <strong>www.quantenna.com.</strong> </div>Key Responsibilities:\n\n<ul>\n<li>Candidate will be responsible to lead and design high speed data converters to support the WIFI line up. Covering from receiver side with high speed ADC and transmitter side with DAC</li><li>Candidate will be part of the system and architecture definition of the data converter. Working with the RF system team to guarantee best RF line up performance</li><li>Lead the top down macro development and interface with other designer and the backend team to drive successful layout integration</li><li>Responsible for post silicon characterization, performance evaluation and productization. Write architecture reports, present circuit design reviews, and measurement reports</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n<ul>\n<li>Minimum of 10+ years of experience in analog integrated circuit design related to data converters</li><li>A minimum of a BSEE degree or equivalent is required, MSEE preferred.</li><li>System analysis and simulation to define ADC/DAC architecture and subsystem specs. Theoretical knowledge of sampling theory and ADC/DAC non-idealities. Experience with one or more ADC/DAC architectures.</li><li>Transistor level circuit design of comparators, DAC arrays, reference generation, clock distribution and all other analog circuitry in ADC/DAC subsystem comprehending element matching and process variation.</li><li>RF and Wireless LAN Systems Designs is highly desirable</li><li>Experience with Mixed-signal integration and Mixed-mode (AMS) simulation is required</li><li>Using Industry-standard design, simulation, and verification tools such as Cadence Suite (Composer, Virtuoso), Calibre (DRC, LVS, PEX) is required</li><li>Layout proficiency and general floor planning is required</li><li>Able to drive physical designers that develop our full custom high-speed layout is required</li><li>Able to understand all process effects on designs and layout is required</li><li>Apply industry-standard best practices and methodology to minimize design risk is required</li><li>Debugging post-silicon circuit issues is required</li><li>Knowledge of Matlab or Mathcad</li> <li>Knowledge of ADC/DAC measurement circuits using lab equipment such as logic analyzer, spectrum analyzer, oscilloscope, etc</li><li>End to End Systems analysis, model and simulate circuit or system performance using analytical tools, Cascade analysis of up/down converters is a plus</li>\n</ul>\n\nWhy work for us?\n\n<ul>\n<li><strong>Leader in Wi-Fi:</strong> </li><li>Quantenna is the recognized leader in Wi-Fi technology. Our customers have recognized this and are working with us in defining their next generation products</li>\n</ul>\n\n<ul>\n<li><strong>Career Growth:</strong> </li><li>Gain exposure to a broader experience, opportunity to see more, learn more and do more</li><li>Endless opportunity for engineers from working on cutting edge wireless technology such as 8x8, MU-MIMO, beam-forming, 160 MHz, 10Gpbs, Multi-AP optimizations</li><li>Come learn our technology and help build it, we are not your typical Wi-Fi Mac + baseband chip company, we create solutions all the way from the antenna through the full network stack and to the cloud</li><li>Be a part of the team that is blazing the trail forward in the world of Wi-Fi</li>\n</ul>\n\n<ul>\n<li><strong>Company Growth:</strong></li><li>Gain exposure to the high growth phase of the company and partner with us to have the opportunity to be part of scaling our business</li><li>Endless opportunity to grow with us</li>\n</ul>\n\n<ul>\n<li><strong>Culture:</strong></li><li>Close collaboration between cross-functional teams from ASIC to SW to RF, etc.</li><li>Passionate teams that work together across the globe to create the best Wi-Fi experience for the users</li><li>Open door policy, real interaction with the CEO and Executive team members</li><li>Quantenna cares we care about our employees as a whole ranging from career growth to family events</li><li>Financial Growth:</li><li>Be a part of the upside to our RSUs as the company grows, its a great time to get in as we just went IPO on a strong growth trajectory</li>\n</ul>\n\n<ul>\n<li><strong>Benefits:</strong></li><li>Great benefits ranging from competitive salary packages, customized health plans, PTO, holidays, subsidized gym memberships, exclusive discounts, etc.</li>\n</ul>\n\n<ul>\n<li><strong>Tomorrow starts today. Join us now.</strong></li>\n</ul>"}