{"job title": "Data Engineer", "company": "Signature Consultants", "city state": "– Tamarac, FL", "rating": "3.8", "job description": "Data Engineer \n<br>\n<br>\n Job Description:<br><br><strong>Data Engineer Summary:</strong>\n<br><br>\nSignature Consultants is seeking a Data Engineer for an opportunity in Tamarac, FL. The Data Engineer will work on a small team assisting with process improvements and implementing best practices. He or she will create an ETL framework for the rest of the team to use, a SQL coding library, pulling in new data sets and providing analysis, this ability is a plus.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n<li>Design, develop, and support database objects required for reporting and integrations</li>\n<li>Design, develop, and support extraction and integration processes (ETL) from multiple types of data sources</li>\n<li>Perform data analysis and testing to ensure transformation covers all data possibilities and managing data anomalies</li>\n<li>Analyze data and develop reports for consumption by business</li>\n<li>Maintain a deep understanding of the integrated data and work with end users for how to best interpret</li>\n<li>Provide in-depth troubleshooting skills to assist in resolving errors and performance issues</li>\n<li>Engage in conversations with internal users to understand their line of business and data requirements</li>\n<li>Help train business users on tools and how to access data</li>\n<li>Focus on performance tuning, optimization and scalability to ensure efficiency in the environment</li>\n<li>Refactor existing jobs to improve performance and migrate to a new server</li>\n<li>Provide data analysis and report to the Product Development Organization</li>\n<li>Help to develop the appropriate solution ranging from providing analysis, reporting and/or data integrations</li>\n</ul>\n<strong>Qualifications:</strong>\n\n<ul>\n<li>SQL required</li>\n<li>Python is a huge plus, if not C# or Java</li>\n<li>SSIS &amp; SQL are both required</li>\n<li>4+ years writing T-SQL</li>\n<li>Advanced knowledge of relational database systems (ex. Postgres, Oracle)</li>\n<li>Experience using multiple versions of Microsoft SQL Server</li>\n<li>3 years using SQL Server Integration Services (SSIS) and Microsoft Visual Studio</li>\n<li>5 years’ experience using reporting tools (e.g. SSRS, Tableau, Qlik, etc.)</li>\n<li>Degree in Computer Science, Software Engineering, Information Technology or equivalent related experience</li>\n<li>Experience using version source control repositories</li>\n<li>Familiar with interacting with industry standard API technologies (REST, SOAP, WebSockets)</li>\n<li>2+ years programming experience (Python, C#, Java, etc.)</li>\n<li>Must have a diverse skill-set spanning each area of the database and analytics development lifecycle</li>\n<li>Ability to present data in a meaningful and intuitive way</li>\n</ul>\n<strong>About Signature Consultants, LLC</strong>\n<br><br>\n<em>Headquartered in Fort Lauderdale, Florida, Signature Consultants was established in 1997 with a singular focus: to provide clients and consultants with superior staffing solutions. For the eighth consecutive year, Signature was voted as one of the “Best Staffing Firms to Work For” and is now the 14th largest IT staffing firm in the United States (source: Staffing Industry Analysts). With 26 locations throughout North America, Signature annually deploys thousands of consultants to support, run, and manage their clients’ technology needs. Signature offers IT staffing, consulting, managed solutions, and direct placement services. For more information on the company, please visit www.sigconsult.com.</em>"}