{"job title": "RF Engineering Technician", "company": "Skyworks", "city state": "– Newbury Park", "rating": "3.6", "job description": "<p>&nbsp;</p><p><strong>Skyworks Solutions, Inc.</strong> is empowering the wireless networking revolution. Our highly innovative analog semiconductors are connecting people, places and things spanning a number of new and previously unimagined applications. We possess broad technology capabilities and one of the most complete product portfolios in the industry. Our customers are global industry leaders who are driving innovative platforms that are changing the way we all live, work and play. Our global team collaborates daily to create the semiconductors the world relies on. If you're looking for a challenging and exciting career in a fast-paced environment, Skyworks offers a variety of roles in an environment that promotes prompt decision making, uninhibited sharing of best practices and individual ownership. Here, you'll find minimal layers of management, open communication and mutual trust and respect.</p><p>Requisition ID:&nbsp;38002&nbsp;</p><p>Job Description:</p><p>The successful candidate will work closely with design engineers to develop cutting edge RF chips used in mobile devices. Responsibilities include operating automated testers, running automated calibration routines, perform basic manual RF tests, evaluating standard RF devices, including but not limited to couplers, filters, duplexers, amplifiers, isolator, building fixtures, building RF test setups, building harnesses, mounting RF chips on evaluation boards using soldering iron and hot plate. The candidate will works from schematics, diagrams, written and verbal descriptions, layouts or defined plans to perform testing, checkout and trouble-shooting functions. Performs operational test and fault isolation on systems and equipment. Assists in determining methods or actions to remedy malfunctions. Technician will review test results with engineers, make modification of prototypes and retest until performance meets specifications. Technician will take an active role in the development of products by making tuning decisions, participating in meetings, and being a team player. #LI-DB1</p><p>&nbsp;</p><p>Job Requirements:<br>•&nbsp;Associate Degree preferred<br>•&nbsp;Knowledge and hands on experience with test equipment: multi-meter,&nbsp;Oscilloscope, signal generators, power meter, power supplies<br>•&nbsp;Soldering skills, experienced in using soldering iron, hot plate<br>•&nbsp;Preferred - Proficiency in Bench level/trouble shooting electronic equipment<br>•&nbsp;Ability to understand schematics and diagrams<br>•&nbsp;Experience with MS-Office and Windows OS<br>•&nbsp;Ability to interpret data, basic understanding of voltage, current, power<br>•&nbsp;Excellent communication skills, ability to follow verbal and written instructions<br>•&nbsp;Excellent organizational skills<br>•&nbsp;Must have team-oriented attitude, accountability and ownership<br>• Prototyping/Assembly experience is a strong plus<br>•&nbsp;Preferably with some knowledge with C/C++ or similar</p><p>&nbsp;</p><p>The Advanced Mobile Solutions (AMS) team at Skyworks develops industry-leading, highly integrated solutions for next generation mobile platforms supporting many of the world’s leading smartphone manufacturers. Our design engineers have diverse expertise and utilize a broad range of technologies (SOI, silicon CMOS, GaAs, IPD, SAW/BAW, and pHEMT) to create differentiated products including high-efficiency power amplifiers, multi-gain LNAs, multi-throw switches, controllers and acoustic filters. Skyworks’ AMS team is an ideal place for motivated engineers who enjoy collaboration in a fast-paced environment and designing breakthrough solutions for the rapidly growing mobile market.</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>Skyworks is proud to be an equal opportunity employer supporting diversity in the workplace.</p>"}