{"job title": "Data Engineer", "company": "Splunk", "city state": "– San Francisco, CA", "rating": "3.8", "job description": "Join us as we pursue our disruptive new vision to make machine data accessible, usable and valuable to everyone. We are a company filled with people who are passionate about our product and strive to provide the best experience for our customers. At Splunk, we're committed to our work, customers, having fun, and most meaningfully to each other's success.\n<br><br>\nThe internal innovation team using and promoting the use of Splunk is looking for a Data Engineer to architect and build innovative use cases for Splunkers. This position is responsible to build and scale the data infrastructure that works in conjunction to Splunk to provide business analytics. The role involves ownership and technical delivery, working closely with other members of marketing, sales, sales engineering, product management, development engineering, and partners, leading the end to end experience. The position is based at Splunk's Bay Area offices in San Francisco or San Jose, California and is an excellent opportunity at a fast-growing and dynamic enterprise technology company. Strong technical experience within enterprise software is critical.\n<br><br>\nResponsibilities: I want to and can do that!\n\n\n<ul>\n<li>Insights: Enable Splunk's internal business users to make decisions based on data in a dynamic, fast-growing environment. Implement operational and analytical reporting use cases and dashboards for internal departments such as Finance.</li>\n<li>Agility: Closely collaborate with our Product Owners and Business Systems Analysts to align priorities and for verification of developed solutions. Ability to work on the development initiatives (multiple technologies) as part of a scrum team on sprint cycles.</li>\n<li>Innovation: Build a scalable data infrastructure with the structure and rigor of solving engineering problems. Build data pipelines that collect, process, and organize data from internal and third party data sources</li>\n<li>Able to develop visualization (preferably using Splunk) for the aggregated information by the pipeline and educate the business owner on the optimal use of the solution to answer business critical questions.</li>\n<li>Streamline: Define and follow coding standards, unit test framework and establish standard methodologies, as applicable. Work with business analysts and data engineers to enable self-service analysis for data analysts within business teams</li>\n<li>Operate: Provide operational&amp;production support for the data pipeline and the Visualizations.</li>\n</ul>\n\nBasic Qualifications\n\n\n<ul>\n<li>B.S. degree in computer science, mathematics, statistics or a similar quantitative field</li>\n<li>4+ years of work experience in a relevant field (Data Engineer, BI Engineer, DW Engineer, Software Engineer, etc.)</li>\n<li>4+ years of architecture, administration and operational experience working with Tableau (or similar tool)</li>\n<li>Experience with data warehouse technologies (Redshift, Vertica, or similar), visualizations tools (Tableau or similar) and relevant data modeling standard methodologies</li>\n<li>Experience building agile, loosely coupled and extensible data infrastructure</li>\n<li>Experience ingestion of data from internal and third party sources and familiarity with data design principles</li>\n<li>Excellent SQL skills and experience with relational databases, OLAP, MPP, Visualization tools (splunk dashboard is preferred but not mandatory)</li>\n<li>Experience with d3 graphing is a plus.</li>\n<li>Proficiency in a major programming language (e.g. Java) and/or a scripting language (Perl/Python) utilizing the REST APIs.</li>\n<li>Strong communication skills and ability to discuss the product with PMs and business owners</li>\n<li>Self-starter who truly enjoys a fast-paced, innovative software start-up environment. An innate desire to deliver and a strong sense of teamwork</li>\n<li>Passionate about groundbreaking technology, enjoys creativity, and has strong written and verbal communication skills.</li>\n<li>Experience with Splunk, SFDC are a plus.</li>\n<li>Experience with the Agile framework of implementation is a plus.</li>\n</ul>\n\nWe value diversity at our company. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which you are applying.\n<br><br>\nFor job positions in San Francisco, CA, and other locations where required, we will consider for employment qualified applicants with arrest and conviction records."}