{"job title": "Data Engineer", "company": "SpotXchange", "city state": "– Broomfield, CO", "rating": "3.6", "job description": "We're SpotX, one of the top-rated companies to work for in Colorado. If you would like to learn more about us, our team is inviting you to join us for one of our events:\n<br><br>\nSpotX Engineering Recruiting Open House\n<br><br>\nSustaining our Communities Hackathon\n<br><br>\nSpotX is seeking a talented Data Engineer who can contribute brilliantly to our Data Intelligence team located in Broomfield, CO. Our team solves problems important to the business giving the opportunity for high impact.\n<br><br>\nThe data engineer role will interface with business, product owners, and the Data Analytics team to deliver timely and quality data sources in support of reporting through software like Tableau and Superset.\n<br><br>\nWe don't believe in \"culture fit\". We believe in you being a genuine human being and pleasant to work with. Sure, we might share a beer at work or after work but you don't have to. You just need to be a contributing member of our team who is thoughtful and wants to do quality work.\n<br><br>\n<strong>Making an immediate impact:</strong>\n\n\n<ul>\n<li>Develop and maintain accurate and robust data sources from very large datasets</li>\n<li>Work closely with the data analyst team in development and support of reporting</li>\n<li>Root cause and corrective action assessments of data discrepancies, often with minimal information</li>\n<li>Support software creation, maintenance, and enhancements</li>\n<li>Work with management and product team in accurately planning and executing sprints</li>\n<li>Perform additional duties assigned by management</li>\n</ul>\n\n<strong>Needed SpotX'er talents:</strong>\n\n\n<ul>\n<li>Bachelor's Degree (BA) from four-year college or university</li>\n<li>2 to 3 years experience working in big data</li>\n<li>Strong knowledge in Python and MySQL/HQL/SQL</li>\n<li>Knowledge of Hive and Spark</li>\n<li>Comfortable working in a Linux/Mac development environment</li>\n<li>Possess strong analytical skills, withthe ability to analyze raw data</li>\n<li>Effectively manage multiple tasks, large and small, delivering accurate and timely data</li>\n<li>Work independently in a fast-paced environment, often without formal requirements and with minimal supervision</li>\n<li>Be a highly motivated self-learner</li>\n<li>Have excellent verbal and written communication skills</li>\n</ul>\n\n<strong>Bonus SpotX'er talents:</strong>\n\n\n<ul>\n<li>Ad Tech experience</li>\n<li>Druid ingestion experience</li>\n<li>Airflow DAG creation experience</li>\n<li>Scala experience</li>\n</ul>\n\n<strong>SpotX Perks:</strong>\n\n\n<ul>\n<li>Work-life balance</li>\n<li>Unlimited PTO(work it out with your team first!), company closed from Christmas to New Years</li>\n<li>Make a real difference - your code reaches millions of people as soon as you release it</li>\n<li>Work in a fun, casual, team environment flip flops OK</li>\n<li>Frisbees, foosball table and ping pong</li>\n<li>Benefits such as medical, dental, and 401(k)</li>\n</ul>\n\nSpotX is the leading global video advertising platform that enables media owners and publishers to monetize premium content across desktop, mobile and connected TV devices.\n<br><br>\nVisit our About Us page to learn more."}