{"job title": "Data Engineering Developer (Informatica)", "company": "Symantec", "city state": "– Mountain View, CA", "rating": "3.5", "job description": "Data Engineering Developer (Informatica)LOCAL CANDIDATES ONLY - TEMPE, AZ OR SF BAY AREASymantec Corporation (NASDAQ: SYMC) is the global leader in cyber security. Operating one of the world’s largest cyber intelligence networks, we see more threats, and protect more customers from the next generation of attacks. We help companies, governments and individuals secure their most important data wherever it lives.About the Role:This role is instrumental in the design and implementation of the technical architecture needed to support Business Intelligence and Analytics solutions as well as 3rd party systems which rely on data warehousing solutions. Must keep current on emerging technologies such as cloud solutions and encryption techniques of PII data. Partner with organizational business units, BI and Analytics personnel, Information Security, and Technology Operations to identify and establish requirements for projects involving data warehousing or BI/Analytics solutions. Included are the development and implementation of data warehousing strategies and/or systems to enhance the business or to solve business challenges. Administration of Informatica Power Center across multiple environments while managing the scheduling and dependencies of ETL jobs meeting SLA’s.Responsibilities:\n\n<ul>\n<li>Partner with external vendors to beta test new technologies for connecting to unconventional and emerging data sources.</li><li>Understand new platforms such as AWS and Azure and available encryption techniques.</li><li>Provide technical support and lead efforts with cross-functional teams including DBA’s, System Engineers and Network Engineers to ensure an effective operating environment including throughput, sizing, capacity planning, and maintenance of the data warehouse environment.</li><li>Advanced ability to write complex SQL. Proficient in logical and physical table design.</li><li>Knowledge in Azure SQL Data Warehouse, NoSQL, Databricks and Hadoop is a plus.</li><li>Develop, manage and validate new or existing data models specific to data warehouse, including assessment of data models in source systems</li><li>Advanced proficiency with shell scripting and API integration to source systems.</li><li>Advanced expertise with Informatica Powercenter, Administration and Cloud applications.</li><li>Partner with external vendor to maintain a compliant Informatica environment by applying hotfixes or software upgrades in a timely manner. Experience managing / scheduling multiple ETL jobs with dependencies and meeting SLA’s. Monitor server load and usage and have a strong understanding of what critical data needs to be available for business use.</li><li>Provides technical consulting and guidance to Software Engineers for the design and development of highly complex or critical ETL architecture.</li><li>Environment monitoring such as system level parameter checks, CPU spike, Memory utilization, Number of parallel loads (sessions) running on each node.</li></ul>\n<br>\n<strong>Qualifications:</strong>Required\n\n<ul>\n<li>Bachelor’s degree in Information Systems or related field or equivalent experience.</li><li>Minimum 2-3 years with data analysis, modeling and design specific to an Enterprise Data Warehouse</li><li>Minimum 3-5 years with data architecture, enterprise information integration and ETL</li><li>Minimum 3-4 years with understanding of business processes and activities that relate to data flows</li><li>Minimum 4-5 years’ experience with installs, upgrades, configuration and maintenance of Informatica PowerCenter.</li><li>Minimum 4-5 years’ experience with optimization and tuning of Informatica objects and environment, have hands on expertise working with Informatica support for patches and bug fixes.</li>\n</ul>\n\nPreferred\n\n<ul>\n<li>Minimum of 5-7 years in the design and development of EDW/BI Systems</li><li>Strong analytical, data analysis and problem solving skills with large amounts of data using complex SQL and analytical functions. Minimum 5-7 years.</li><li>Demonstrated experience with multiple source systems integrated with large scale data warehouses; Minimum 5-7 years.</li><li>Strong understanding of Finance, Sales, Marketing and/or Contact Center organizations. Minimum 2-3 years.</li>\n</ul>\n====================​====================​\n<br><br>\nSymantec is an equal opportunity employer. All candidates for employment will be considered without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, physical or mental disability, veteran status, or any other basis protected by applicable federal, state or local law.<br><br>Apply"}