{"job title": "Data Engineer", "company": "Volta Charging", "city state": "– San Francisco, CA", "rating": "4.3", "job description": "<div><strong>TL;DR</strong></div><div>Design and build services across the Volta Cloud and Web platforms using Postgres, Node, and React, which help us derive new insights from our network of geographically distributed electric-vehicle charging stations.</div><br>\n<div>At Volta were on a mission to accelerate the adoption of the electric vehicle. Volta creates city-wide free electric vehicle charging networks in major metropolitan areas. Our charging networks are free-to-use, free to our property partners, and monetized through brand sponsorships and digital media content.</div><br>\n<div><strong>DESCRIPTION</strong></div><div>Our company is small, but focused and ambitious. By joining our team, you will have the opportunity to contribute in a number of ways to our Software Engineering department and the evolution of the company itself. For this role, you will help own our data ingestion and exposure pipelines. You will use tools like Alooma, Snowflake, and Sigma, (similar to Tableau), to help us move our data around and understand it better so that other teams can use it more effectively.</div><br>\n<div>Week to week, all Software Engineers are responsible for breaking down new project requirements into epics and stories, planning out their approach to implementation, and presenting said approach to the team. From that point on we practice lower case agile in a flexible warehouse/office environment. Many different teams work at the office (Media Sales, Operations, etc), and cross-pollination of ideas and conversation is strongly encouraged. Some team members opt to work remotely occasionally to avoid distraction if they have a difficult or large problem to solve.</div><br>\n<div><strong>PATH FORWARD</strong></div><div>The Path Forward Return to Work program at Volta is for professionals returning to the workforce after taking time off for caregiving. If selected, youll receive 16 weeks of paid employment while doing work you love for the world's most influential free-to-use EV Charging company . Youll have the chance to update your skills, add new experience to your resume, and make new professional connections. Youll also receive support through Path Forward, a nonprofit organization on a mission to empower people whove been focused on caregiving transition back to the paid workforce.</div><br>\n<div>The program is open to anyone who has at least 4 years of professional experience and has been out of the paid workforce for several years to focus on caregiving. If you meet these criteria and your skills match our needs, we welcome you to apply.</div>RESPONSIBILITIES\n\n<ul>\n<li>Use tools like Sigma to analyze our data</li><li>Build migrations in PostgreSQL to help us resolve issues and anomalies in our data</li><li>Work closely with other members of the product team to define new requirements for our data pipeline</li><li>Help build a reliable and self-monitoring network, with minimal downtime</li><li>Hold architecture and design reviews with other team members</li><li>Manage the deployment and lifecycle of your code and tools</li>\n</ul>\n\n<strong>QUALIFICATIONS</strong>\n\n<ul>\n<li>Experience with Sigma or similar, (Tableau, Excel, etc.)</li><li>Exposure to PostgreSQL or other relational databases</li><li>Comfortable scripting in Node, Python, or Bash</li><li>Strong desire to work in a fast-paced startup environment - \"in the trenches\" of multiple development projects with high level of self-motivation and directness</li><li>Top-notch, demonstrable documentation and communication skills</li><li>Ability to balance multiple priorities and self manage goals</li>\n</ul>"}