{"job title": "Data Engineer", "company": "Zymergen", "city state": "– Emeryville, CA", "rating": "3.3", "job description": "Based in the San Francisco Bay Area, Zymergen is a technology company applying radical new methods to design and improve microbes by rewriting their DNA. This capability allows us to generate novel chemicals, advanced materials, and pharmaceuticals far faster and at lower costs. Our approach combines biology, robotic automation, and proprietary computational and analytic methods to industrialize what is otherwise a slow, risky process.\n<br><br>\nA key element of our success is our ability to apply the latest in software tools, Big Data technology, and machine learning techniques to advance solutions in chemistry and manufacturing. Zymergen's software engineering team plays a critical role in distinguishing our products and capabilities.\n<br><br>\nWorking at Zymergen offers software experts exposure to a field that makes a difference in the lives of millions of people: low-cost, scalable chemical manufacturing touches everything from how airplanes are built to the frontiers of life-saving medicines. In addition to working at a fast-growing company, you'll have the satisfaction of knowing you are building a future for our world that was the realm of science fiction just ten years ago.\n<br><br>\nJob Description and Specific Responsibilities\n<br><br>\nZymergen is looking for an additional data engineer for our growing team. Data engineers at Zymergen use state of the art tools and technologies to provide robust data services that empower all aspects of our business -- from strain design, to the process of building and evaluating new strains, to big-picture decision-making for the whole company.\n<br><br>\nAs a member of our data engineering team you will work with product management, engineering management, the data science, science and automation teams to implement data engineering initiatives that serve as a foundation for the entire company.\n<br><br>\n<strong>Specific responsibilities:</strong>\n\n\n<ul>\n<li>Participate in requirements discussions</li>\n<li>Scope data engineering solutions</li>\n<li>Effectively use Agile practices to plan and track your work</li>\n<li>Produce design documentation for your work</li>\n<li>Implement effective, scalable, maintainable, extensible data engineering solutions</li>\n<li>Implement automated tests for your work</li>\n<li>Work with the DevOps team to implement effective monitoring for your solutions and integrate your work into our CI and deployment systems.</li>\n</ul>\n\n<strong>Qualifications/Experience:</strong>\n\n\n<ul>\n<li>We are seeking data engineers at a range of experience levels. Two or more years of industry experience is a minimum.</li>\n<li>B.S. or higher in computer science or related field</li>\n<li>Strong Python skills</li>\n<li>Strong data modeling experience</li>\n<li>Demonstrated aptitude for thinking beyond immediate requirements</li>\n<li>Strong organizational skills and ability to prioritize</li>\n<li>Excellent written and oral communication skills</li>\n<li>Demonstrated expertise in problem-solving and technical innovation</li>\n<li>Understanding of software engineering best practices and tools: source control, code review, scrum/agile, continuous testing and integration, etc.</li>\n</ul>\n\n<strong>Highly Desired:</strong>\n\n\n<ul>\n<li>AWS experience</li>\n<li>Experience with stream data processing systems such as Kafka</li>\n<li>Experience with AirFlow</li>\n<li>Life science background</li>\n</ul>\n\nFounded in 2013 and based in the San Francisco Bay Area, Zymergen is a technology company unlocking the power of biology. We deliver better economics for products made from biology that are used across industries, bring new products to market faster, and develop novel products. Our proprietary platform uses robots and machine learning to engineer microbes faster, more predictably, and to a level of performance previously unattainable. These microbes, and the products they produce, have broad applications across industries such as chemicals and materials, agriculture, and healthcare. For more information visit www.zymergen.com.\n<br><br>\nA key element of our success is our ability to apply the latest in software tools, Big Data technology, and machine learning techniques to advance solutions in chemistry and manufacturing. Zymergen's software engineering team plays a critical role in distinguishing our products and capabilities.\n<br><br>\nWorking at Zymergen offers software experts exposure to a field that makes a difference in the lives of millions of people: low-cost, scalable chemical manufacturing touches everything from how airplanes are built to the frontiers of life-saving medicines. In addition to working at a fast-growing company, you'll have the satisfaction of knowing you are building a future for our world that was the realm of science fiction just ten years ago.\n<br><br>\nIndividuals seeking employment at Zymergen are considered without regards to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, gender identity, or sexual orientation."}