{"job title": "Data Scientist", "company": "COllabera", "city state": "– Colorado Springs, CO", "rating": "3.9", "job description": "6-12 Months onsite contract. - Responsible for developing strategies for effective data analysis and reporting. Selects, configures, and implements analytical solutions. Develops and implements data analytics, data collection systems, and other strategies that optimize statistical efficiency and quality. - Identifies, analyzes, and interprets trends or patterns in complex data sets. Monitors performance and quality control plans to identify performance. Works on problems of moderate and varied complexity where analysis of data may require adaptation of starndardized practices. - Works with management to prioritize business and information needs. - Ability to manage multiple assignments. Superior written and oral communication skills. - 6-10+ years of experience.- AI/Machine Learning/Data Science Experience 6+ Years - Skills: Python/SKLearn/NumPy, Apache Spark/Storm/Pnda, Splunk 6+ Years - Skills: Java / Oracle / SQL / Linux or Unix development experience 6+ years. - Experience delivering AI/ML End to End Integrated 6+ Years - Telecom Background desiredRupesh(973) ###-####- Responsible for developing strategies for effective data analysis and reporting. Selects, configures, and implements analytical solutions. Develops and implements data analytics, data collection systems, and other strategies that optimize statistical efficiency and quality. - Identifies, analyzes, and interprets trends or patterns in complex data sets. Monitors performance and quality control plans to identify performance. Works on problems of moderate and varied complexity where analysis of data may require adaptation of starndardized practices. - Works with management to prioritize business and information needs. - Ability to manage multiple assignments. Superior written and oral communication skills. - 6-10+ years of experience. - provided by Dice AI/Machine Learning/Data Science\n<br>\nAssociated topics: data analyst, data analytic, data architect, data center, data quality, data scientist, database, etl, sql, sybase"}