{"job title": "Data Scientist", "company": "Radiant Solutions", "city state": "– US-VA-Herndon", "rating": "4.6", "job description": "<div><div>\n<div>Got a head for numbers? Like turning real world problems into mathematical representations and checking to see if you did it right? If you like that, you’ll love developing algorithms with us! Our customers have some of the most interesting needs and hardest challenges to resolve. Our solutions require integrated models based on large and varied datasets, feeding analytic applications so that we can extract patterns and behaviors obscured within the data to augment the capabilities of human operators. We need data scientists/software engineers of all experience levels to staff positions supporting the defense and intelligence communities.\n<br><br>\nRadiant Solutions is currently staffing multiple projects with analysts who have diverse backgrounds and experiences from the open source, defense and intelligence communities, and commercial industry.\n<br><br>\n<strong><em>Note: US citizenship and an active TS/SCI clearance with ability to obtain polygraph are mandatory for this position and required for consideration.</em></strong>\n<br><br>\n<strong>Why us?</strong>\n\n\n<ul>\n<li>We build advanced algorithms to gain analytic insights from a large range of open source and government data</li>\n<li>We enable machine learning systems, automate workflow, and design and develop custom applications for unique national-security missions</li>\n<li>We provide training to expand your skills and challenges to develop them</li>\n<li>Our client’s missions are vital to national security, so we’re mission-first always</li>\n<li>Our work environment is relaxed business casual</li>\n<li>At our core we believe and practice social responsibility.</li>\n</ul>\n\n<strong>What would you be doing?</strong>\n\n\n<ul>\n<li>Extracting and transforming data using programming languages such as Java and Python and associated open source data analytics libraries</li>\n<li>Ascertaining unique ways to apply algorithms to derive specific customer specific data analytics results</li>\n<li>Applying big data analytics tools to large, diverse sets of collection data to assess risk of adverse threat activities</li>\n<li>Extending existing algorithms as required to support customer requirements</li></ul></div>\n\n\n</div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div><strong>Y</strong><strong>ou have to have these:</strong>\n<ul>\n<li> Active TS/SCI clearance and ability to obtain polygraph</li><li> US Citizenship</li> <li> Masters or PhD in Engineering, Math, Physics, or Computer Science discipline or equivalent and experience in government or industry</li><li> Experience using algorithms related to machine learning or data analytics</li><li> Experience developing and testing models</li><li> Exceptional oral and written communications</li><li> Organizational skills and excellent attention to detail</li><li> Development experience in a Linux/Unix/Windows environment</li><li>Experience in at least one of these languages: R, VBA, Java, C++, SQL, Python</li><li> Capability to work effectively in a geographically distributed development team</li>\n</ul>\n<strong>We’d really like it if you had:</strong>\n<ul>\n<li>Graduate experience working with probabilistic and stochastic statistical analysis or computational intelligence</li> <li>Experience conducting model feasibility research and algorithm development for machine learning</li><li> Experience with distributed datasets and experience analyzing both relational and NoSQL data structures</li><li> Leading and mentoring small teams from project inception through deployment</li><li> Experience working in an Agile environment, especially SAFe</li><li> Government procurement and requirements development experience</li><li> Knowledge of technical aspects of ISR systems</li>\n</ul>\n#cjpost</div>\n</div>\n</div>\n\n<br>Overview<br>\n\n<div>\n<div>\n<div>Join our company whose purpose is to help national security and commercial organizations understand and navigate our changing planet. Radiant Solutions provides multi-source data collection, enrichment, and analytic capabilities that reveal unique geospatial information and insights where and when it matters most.\n<br><br>\nWe are a new organization but no company has such strong roots in geospatial with our level of scale and a strong commercial mindset. Our heritage companies, MDA Information Systems, RadiantBlue, DigitalGlobe Intelligence Solutions, and HumanGeo are well known for delivering innovative capabilities across the entire geospatial intelligence value chain. Our combined team of over 1,000 aerospace engineers, geospatial analysts, weather and ocean experts, software developers, data scientists, and DevOps engineers apply disruptive technology and our unique intellectual property to both national security and commercial problems.\n<br><br>\nWe offer an excellent comprehensive benefits package including medical, dental, life, and short/long-term disability insurance, vacation and sick leave, 401(k) retirement plan, flexible spending account, and tuition assistance. Radiant Solutions values diversity in the work place and is an Equal Opportunity Employer.</div></div>\n</div>\n<br>"}