{"job title": "Sr. Machine Learning Scientist", "company": "Amazon", "city state": "– US, WA, Seattle", "rating": "3.8", "job description": "AWS Support is one of the largest and fastest growing business units within AWS. We are a highly technical, innovative organization revolutionizing the customer engagement processes and offers topnotch technical support for the portfolio of products and features of AWS. We are determined to redefine the word support and lead the industry with best in class technology.\n<br><br>\nAWS Support is building a world-class Machine Learning team to facilitate delivery of tools and metrics incorporating insights and predictions generated by mining large volumes of structured and unstructured data sources available within AWS Support using Machine Learning (ML) and Natural Language Processing (NLP). Our data sets include chat logs, call audio logs, email transcripts, feedback texts, agent data, case data, customer data, usage data, and knowledge docs. We are aiming to develop and implement predictive ML models to aid/improve Service Level, Agent Productivity, Customer Satisfaction, Dynamic Routing, Case Deflection, Knowledge Recommendation, Optimal Case Handling, Proactive Case Prediction/Resolution, Sentiment Analysis of Customer Correspondence, Customer Retention etc.\n<br><br>\nWere looking for Machine Learning Scientists with unfettered curiosity and drive to solve major challenges at the intersection customer engagement and technical support. You will be a key driver in taking an idea to experimentation to prototyping and then to implementation. You will perform machine learning at petabyte scale to identify patterns and anomalies.\n<br><br>\nMajor responsibilities\n<br><br>\n· Work closely with the business to understand the problem space, identify the opportunities and formulate the problems\n<br>\n· Use machine learning, data mining, statistical techniques and others to create actionable, meaningful, and scalable solutions for the business problems.\n<br>\n· Analyze and extract relevant information from large amounts of AWS Support data to help automate and optimize key processes\n<br>\n· Design, develop and evaluate highly innovative predictive ML models\n<br>\n· Interact with software engineering teams to build data platforms for large-scale data analysis and modeling\n<br>\n· Establish scalable, efficient, automated processes for large scale data analyses, model development, model validation and model implementation\n<br>\n· Research and implement novel machine learning and statistical approaches."}