{"job title": "Senior Scientist Upstream Development", "company": "Beacon Hill Staffing", "city state": "– Boston, Massachusetts", "rating": "4.5", "job description": "<div> </div>  <div> <div>Summary\n\n<ul>\n<li> Job Posting Title: Sr. Scientist - Upstream Development</li>\n<li> Open to Contract-to-perm or Perm\n\n\n<ul>\n<li> This is strictly a long-term position and not open to contract only.</li>\n</ul>\n\n</li>\n<li> Duration: likely 3-6 months before conversion</li>\n<li> Location: Woburn, MA</li>\n<li> Salary: $120,000-$125,000</li>\n<li> Start Date: ASAP</li>\n<li> Why Is this Open? - New role as they are building out their US operations. This person will play a key role in the leadership of the R&amp;D process in the US.</li>\n</ul>\n<strong> Senior Scientist Upstream Development</strong>\n<br><br>\nWe are looking for a<strong> Senior Scientist Upstream Development</strong> for our R&amp;D department in <strong> Woburn, MA - USA</strong> . We are seeking a highly motivated expert in cell culture, virus and viral vector process development and people management.\n<br><br>\nMost of the projects are related to viral vaccines and viral vectors development and are funded by biopharmaceutical companies or NGO's, such as the Bill and Melinda Gates Foundation, CEPI or IAVI. The team collaborates closely with the upstream processing and assay teams in a number of large process development projects which are executed according to aggressive timelines.\n<br><br>\nIn our startup culture, the ideal candidate will show entrepreneurial spirit, independence and ability to take strategic, calculated risks to guarantee efficient progression of the projects and build the team and the US operations. This innovator will be motivated by assessing and implementing new manufacturing technologies to keep Batavia ahead of the competition. Agility, flexibility and will to contribute to projects that have a strong impact on global health are key components of the culture of Batavia Biosciences.\n<br><br>\n<strong> RESPONSIBILITIES:</strong>\n\n<ul>\n<li> Responsible for technical leadership in the development of scalable, robust, high yielding, and economically viable cell culture processes using flasks and/or miniature, bench-scale, and larger disposable bioreactors in the laboratory setting for the production of virus vectors</li></ul>\n\n\n<ul>\n<li> Perform regular mammalian cell culture (adherent and suspension) and virus production activities</li></ul>\n\n\n<ul>\n<li> Perform hands-on experiments to develop feeding strategies using chemically defined medium, feeds</li>\n<li> Execute process monitoring and control strategies for robust process design</li>\n<li> Design scientifically rigorous experiments using statistical DoE where applicable and ensure scalability of unit operations during process development</li>\n<li> Execute experiments, collect, analyze and interpret data to make process improvements and further design next studies</li>\n<li> Apply process engineering/development knowledge to scale-up and scale-out of bioprocesses to enable multi-site process development and production of novel viral vaccines or viral vector products</li>\n<li> Collaborate and coordinate material needs with research, downstream, analytical, and formulation groups</li>\n<li> Author Standard Operating Procedures, technical reports, process descriptions, including data interpretation and procedures suitable for inclusion in pre-IND, IND, or equivalent regulatory submission</li></ul>\n\n\n<ul>\n<li> Manage, train, guide and coordinate activities of junior staff members</li>\n<li> Support the execution of start-up, commissioning, and maintenance of equipment and processes</li></ul>\n\n\n<ul>\n<li> Participate in multi-disciplinary projects with multi-cultural teams, and guide project and business strategies</li></ul>\n\n\n<ul>\n<li> Update group members on background and status of projects by giving oral updates or internal presentations</li></ul>\n\n\n<ul>\n<li> Maintains project timelines and actively participates in team meetings</li>\n<li> Actively seek opportunities for continuous improvement</li>\n<li> Assist other departments and performs all other duties as assigned</li>\n<li> The position may entail travel to other Batavia sites</li>\n</ul>\n<strong> EDUCATION AND EXPERIENCE:</strong>\n\n<ul>\n<li> B.S./M.S. or Ph.D. in chemical engineering biochemistry</li>\n<li> 10+ years (B.S./M.S.) or 6+ year (Ph.D.) of related experience working in a biopharmaceutical laboratory focusing on virus production</li>\n<li> Knowledge of biopharmaceutical upstream process development scale-up/scale-down principles and familiar with bioreactor set-up, and bioreactor control strategy</li>\n<li> Hands-on experience with mammalian cell culture, aseptic techniques with closed culture systems, understanding of biochemical engineering concepts and biochemical pathways</li>\n<li> Significant experience in developing and improving scalable fed-batch, infection, and perfusion upstream processes in Process Development setting in flasks or bioreactors</li>\n<li> Expertise in scaled aseptic bioprocess operations with closed culture systems and cell processing equipment and techniques, including cell culture, harvesting, cell washing and cryopreservation processes</li>\n<li> Demonstrated history of strong hands-on ability, problem solving, and independent experimental design and execution</li>\n<li> Demonstrated scientific creativity, technical proficiency and knowledge of scientific concepts</li>\n<li> Ability to adapt to change and effectively deliver under pressure and time constraints, while maintaining a high level of work quality</li>\n<li> Strong verbal and written communication skills and ability to communicate within the organization as well as externally</li>\n<li> Experience operating in early or late stage clinical process development, ideally with experience of contract development and manufacturing</li>\n<li> Ability to use DoE in Design Expert, or other for statistical experimental design, data analysis and knowledge of statistical process control, QbD, and PAT concepts preferred</li>\n<li> Familiarity with FDA guidance and quality systems preferred</li>\n<li> Must be familiar with BSL-II lab safety requirements</li>\n</ul>\nThe successful candidate will be involved in writing proposals, protocols and reports.\n<br><br>\nYou will join a stimulating group of internationals in a very collaborative environment. As part of this group, personal as well as scientific growth are encouraged and developed. In this position, you will report to the Head of Operations of the Woburn Facility.\n<br><br>\nBeacon Hill is an Equal Opportunity Employer that values the strength diversity brings to the workplace. Individuals with Disabilities and Protected Veterans are encouraged to apply.\n</div> </div>"}