{"job title": "Research Scientist", "company": "Cardiac Pacemakers", "city state": "– Indianapolis, Indiana", "rating": "3.0", "job description": "Research Scientist\n<br><br>\n04-Sep-2018\n<br><br>\n02-Jan-2019\n<br><br>\n<strong>Responsibilities</strong><br><br>Are you interested in providing the voice of the payer and patient to a growing portfolio of assets for autoimmune diseases?<br><br>As a scientist in Lilly’s Global Patient Outcomes and Real World Evidence (GPORWE) team, you will provide scientific expertise and effective project oversight to ensure the successful fulfillment of the health outcomes research strategy to deliver better patient outcomes that are valued by payers and providers. Projects may focus on disease and/or treatments that Lilly is developing and span the entire lifecycle of clinical development and drug commercialization. You will develop and ensure that appropriate health outcomes research strategies are in place to support Pricing, Reimbursement and Access activities for Lilly products. Responsibilities include the conduct, quality, and integrity of health outcomes studies. From these, you will ensure scientific disclosures, resulting from this research, demonstrate and apply in-depth knowledge, understanding, and evaluation of clinical, economic, and/or patient reported outcomes methodologies.\n<br><br>\nAn important role for the Research Scientist in the Immunology Development phase is to support data generation for Value Based Agreements (VBAs). The scientist will develop foundational approaches related to real world evidence (RWE) needs and capabilities, which support product registration and commercialization and provide voice of the payer for VBA.\n<br><br>\nA crucial part of this role is effective communication of health outcomes findings and concepts to internal and external business partners. Leadership in the dissemination to the scientific community is expected. In addition, your scientific leadership and effective collaboration in cross-functional initiatives, including collaborating with therapeutic area medical and commercial teams, RWE Strategic Scientists, FDAMA Scientists, and Outcomes Liaisons is key.\n<br><br>\n<strong>Req ID</strong>\n<br>\n<strong>44365BR</strong>\n<br><br>\n<strong>Additional Skills/Preferences</strong>\n\n<ul>\n<li>Knowledge of the US healthcare system</li><li>Experience in health technology assessment work, value demonstration</li><li>Development of research in support of FDAMA 114 claims</li><li>Experience in immunology or pain therapeutic areas</li><li>Knowledge of US real world data sources</li>\n</ul>\n\n<strong>Additional Information</strong>\n<br>\nLilly is an EEO/Affirmative Action Employer and does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.\n<br><br>\n<strong>Title</strong>\n<br>\nRWE Scientist-Autoimmune\n<br><br>\n<strong>Job Category</strong>\n<br>\nScience\n<br><br>\n<strong>Basic Qualifications</strong>\n\n<ul>\n<li>Doctoral degree in an appropriate discipline, such as epidemiology, public health, pharmacy, economics, education, psychology, statistics, etc.; or Master’s degree with 5 years of relevant experience</li>\n</ul>\n\n<strong>Company Overview</strong>\n<br>\nAt Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 39,000 employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We’re looking for people who are determined to make life better for people around the world.\n<br><br>\n<strong>City</strong>\n<br>\nIndianapolis\n<br><br>\n<strong>Country</strong>\n<br>\n<strong>USA</strong>\n<br><br>\n<strong>State / Province</strong>\n<br>\nIndiana\n<br><br>\n<strong>Region</strong>\n<br>\nNorth America\n<br>"}