{"job title": "Senior Scientist", "company": "Danaher", "city state": "– Pensacola", "rating": "3.3", "job description": "<div>Primary Responsibilities:</div><div><br></div><div>The Senior R&amp;D Scientist is charged with carrying out these duties and responsibilities:</div><div><ul><li>Designs and develops membrane products, , and/or processes without direct supervision. </li><li>Leads one or more projects without direct supervision. </li><li>Plans, organizes, executes, tracks, and communicates project tasks and progress.</li><li>Provides critical input and other contributions to project teams.</li><li>Evaluates, recommends, and implements well reasoned solutions to technical problems</li><li>Directs the work of junior scientists assigned to project team.</li><li>Identifies discoveries with potential to generate intellectual property.</li><li>Coaches’ junior staff to promote technical and professional growth.</li></ul></div><div><br></div><div>Skills and Knowledge:</div><div><br></div><div><ul><li>A Senior R&amp;D Scientist is expected to demonstrate mastery of polymeric materials science, and/or membrane science. This is usually attained through a M.S. degree and/or Ph.D. or a combination of experience and education equivalent to 5-7 years beyond a B.S. degree. A Senior Research Scientist is also expected to possess: </li><li>Project management skills.</li><li>Lead, plan, organize, and execute technical and/or development projects.</li><li>Design effective experiments. </li><li>Direct the work of technicians assigned to projects.</li><li>Keen observation and to make relevant inference from observation.</li><li>Data analysis and data relevance assessment skills. </li><li>Excellent problem-solving skills.</li><li>Demonstrated ability to clearly and effectively communicate project plans, status, progress, and results, both orally and in writing. </li><li>Demonstrated ability to work effectively with team members, manufacturing, and marketing in a positive, professional manner.</li><li>Demonstrated leadership in maintaining a clean, safe work environment</li></ul></div><div><br></div>\n<div>Qualifications:</div><div><ul><li>Masters or PhD in polymer chemistry, Polymer Science and/or Engineering, Material Science and/or Engineering,</li><li>Experience in polymer materials, morphology, rheology, molecular weight, polymer solubility or physical/mechanical properties of polymers</li></ul></div><div><br></div><div>US Citizenship or Resident Alien status required to support government programs and project and projects.</div><div><br></div><div><br></div><div><div><br></div><div>Pall is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, national origin, religion, gender, age, marital status, disability, veteran status, sexual orientation, gender identity, or any other characteristic protected by law.</div><div><br></div><div> PALLRSR </div></div>"}