{"job title": "Data Engineer", "company": "Dropbox", "city state": "– San Francisco, CA", "rating": "4.2", "job description": "Company Description<br><br>Dropbox is a leading global collaboration platform that's transforming the way people work together, from the smallest business to the largest enterprise. With more than 500 million registered users across more than 180 countries, our mission is to unleash the worlds creative energy by designing a more enlightened way of working. \n<br><br>\nHeadquartered in San Francisco, CA, Dropbox has more than 12 offices around the world.<br><br>Team Description<br><br>Our Business Strategy &amp; Operations team sets and drives key business initiatives across the company. We complement and support product, engineering, sales, and marketing teams across three critical areas: corporate and business unit strategy, business planning and sales operations, and business systems and tools development.<br>\n<div>\nRole Description </div><br>\n\n<div>The Data Engineer is responsible for designing and developing robust, scalable solutions for collecting, analyzing large data sets, creating and maintaining the data pipelines, structures and reports to be used by the revenue organization at Dropbox.</div>\n<br>\n<div>\nResponsibilities </div>\n\n<ul>\n<li>Understand business processes, applications and how data is gathered; and to tie application telemetry to transactional data model.</li><li>Develop and manage data pipelines at enterprise scale</li><li>Build data expertise and own data quality for various data flows</li><li>Launch and support new data models that provide intuitive analytics to your customers</li><li>Design and develop new framework and automation tools to enable folks to consume and understand data faster</li><li>Use your expert coding skills across a number of languages like SQL, Python and Java to support analysts and data scientists</li><li>Collaborate with multiple teams in high visibility roles and own the solution end-to-end</li>\n</ul>\n\n<div>\nRequirements</div>\n\n<ul>\n<li>5+ years of Python or Java development experience is necessary;</li><li>5+ years of SQL (Oracle, AWS Redshift, Hive, etc) experience is required, No-SQL experience is a plus;</li><li>5+ years of experience in custom or structured (ie. Informatica/Talend/Pentaho) ETL design, implementation and maintenance;</li><li>Nice to have: Experience working with either a Map Reduce or a MPP system on any size/scale</li><li>Nice to have: Experience working with visualization tools like Tableau or MicroStrategy</li><li>Communication skills including the ability to identify and communicate data driven insights</li><li>BS or MS degree in Computer Science or a related technical field</li>\n</ul>\nDropbox is an equal opportunity employer. We are a welcoming place for everyone, and we do our best to make sure all people feel supported and connected at work. A big part of that effort is our support for members and allies of internal groups like Asians at Dropbox, BlackDropboxers, Latinx, Pridebox (LGBTQ), Vets at Dropbox, Women at Dropbox, ATX Diversity (based in Austin, Texas) and the Dropbox Empowerment Network (based in Dublin, Ireland)."}