{"job title": "Lab Scientist", "company": "Dyno Nobel", "city state": "– Lehi, UT", "rating": "3.4", "job description": "Lab Scientist\n<br><br>\nLocation: **US - UT - Lehi**\n<br><br>\nJob Code: **30004903**\n<br><br>\n\\# of Openings: **1**\n\n\n<ul>\n<li>*Job Brief**</li>\n</ul>\n\nPerform routine and non routine chemical analysis, physical characterizations, and other scientific testing and development related to projects to support research and production activities in accordance with business objectives.\n\n\n<ul>\n<li>*About Dyno Nobel**</li>\n</ul>\n\n_Dyno Nobel, a wholly owned subsidiary of Incitec Pivot Limited, is a global leader in the commercial explosives industry. We provide blasting solutions and quality explosives products throughout North America and Australia, as well as selected customers in the Asia Pacific region. Due to continued results and world-leading innovation, customers in the mining, quarry, construction, pipeline and geophysical exploration industries choose Dyno Nobel._\n\n\n<ul>\n<li>*Laboratory Scientist I**</li>\n<li>*Position Summary:**</li>\n</ul>\n\nPerform routine and non routine chemical analysis, physical characterizations, and other scientific testing and development related to projects to support research and production activities in accordance with business objectives. Consult with R&amp;D scientists and engineering staff as well as field personnel, and perform testing as required to resolve technical issues and field problems.\n\n\n<ul>\n<li>*Reports to: Lehi Laboratory Supervisor**</li>\n<li>*Essential Functions:**</li>\n</ul>\n\n+ Supplying plants, customers and project team leaders with the necessary information to provide customers with explosives products safely, efficiently and in a timely manner.\n<br><br>\n+ Providing new and improved products, technology or processes within the Company?s objectives by participating in scientific experiments which are critical to corporate product and process developments.\n<br><br>\n+ Demonstrating and encouraging a disciplined approach to compliance in all elements of the Company's policies, processes and procedures.\n<br><br>\n+ Contributing to the research efforts of the Company as directed by the Laboratory supervisor, R&amp;D management and various project team leaders.\n\n\n<ul>\n<li>*Requirements:**</li>\n<li>*Education**</li>\n</ul>\n\n+ A Bachelor?s of Science (B.S.) degree in Chemistry is preferred; other degree levels or other disciplines /experience closely related to chemistry will be considered.\n\n\n<ul>\n<li>*Experience**</li>\n</ul>\n\nA minimum of 2 years laboratory or related industry experience in chemistry is preferred.\n\n\n<ul>\n<li>*Technical**</li>\n</ul>\n\n+ A sound working knowledge of basic chemistry and familiarity with typical chemical instrumentation, wet chemical methods etc.\n<br><br>\n+ Knowledge and understanding of best laboratory practices relevant to laboratory technique, data generation and analysis, etc.\n<br><br>\n+ Knowledge and understanding of chemical hazards.\n<br><br>\n+ Solid understanding of Microsoft Office and Lotus Notes applications.\n<br><br>\n+ Ability to learn and adapt to proprietary software utilized with analytical instrumentation.\n<br><br>\n+ Experience and understanding of equipment maintenance and trouble-shooting.\n<br><br>\n+ Must satisfy the requirements for a \"possessor of explosives\" as defined by the Bureau of Tobacco, Firearms and Explosives.\n\n\n<ul>\n<li>*Work Environment and Physical Conditions**</li>\n</ul>\n\nThe demands described here are representative of those that must be met by the employee to successfully perform the essential functions of this position. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<br><br>\n+ Ability to wear and care for applicable personal protective equipment (such as, safety glasses and shoes, respirator, hard hat and ear protection, safety harness) as required by site-specific requirements\n<br><br>\n+ Must be 21 years of age\n<br><br>\n+ While performing the duties of this job, the employee is frequently required to stand; walk; use hands to finger, handle, or feel; reach with hands and arms; climb or balance; stoop, kneel, crouch, or crawl, talk and hear. The employee is occasionally exposed to high, precarious places.\n<br><br>\n_Dyno Nobel is an equal employment opportunity employer and will give all qualified applicants consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national or ethnic origin, age, disability status, protected veteran status, genetic information or any other characteristic protected by law._\n<br><br>\nBeing a part of the Dyno Nobel team is a combination of everything that is unique about Dyno Nobel: our culture, our core values, our commitment to safety, but most importantly, it is our people. It is what sets us apart from your average employer, and is everything that makes Dyno Nobel a great place to work. At Dyno Nobel, we are committed to equal employment opportunity.\n<br><br>\nDyno Nobel does not accept resumes from headhunters, placement agencies, or other suppliers that have not signed a formal agreement with us. Our supplier base is restricted to specified hiring needs. Therefore, any resume received from an unapproved supplier will be considered unsolicited, and Dyno Nobel will not be obligated to pay a referral or placement fee.\n<br><br>\n\\#cb"}