{"job title": "Research Scientist", "company": "IBSS", "city state": "– Boulder, CO, United States", "rating": "4.5", "job description": "<p><strong>Job Title: Research Scientist </strong></p><p><strong>Location: </strong>Boulder, CO</p><p><strong>Job Description:</strong></p><p>IBSS is looking for a part-time Research Scientist specializing in Software Engineering<strong>. </strong>This position assists in developing new systems for display and interaction with real time weather data, supports research and development of weather data dissemination systems, including ingest and decoding surface meteorological datasets, enhancing MADIS to fill data gaps, improve understanding, usability and other factors relating to delivery of data to operational users. </p><p><strong>Key Responsibilities:</strong></p><ul><li>Significant participation in the design and development of interactive applications and improvements using Python, Java, Eclipse, C, C++, Fortran, Perl and Linux shells.</li><li>Develop agile frameworks allowing users to modify or extend the software features.</li><li>Frequent use of real-time data ingest and delivery systems using meteorological data and metadata.</li><li>Frequent communications with operational users to gather rapid feedback, make recommendations, and implement recommendations.</li><li>Prepares technical material and participates regularly in technical reviews and meetings.</li><li>Participation in teleconferences and use of a variety of technologies for collaborative, distributed development.</li><li>Researches, prepares and contributes to technical presentations or publications related to software development tasks.</li><li>Maintains liaison with individuals and units within and outside the project, with responsibility for acting independently on technical matters pertaining to own field.</li><li>Evaluates progress of the project and results obtained, and recommends major changes to achieve overall objectives.</li><li>Makes suggestions to government Task Manager -Principal Investigator on staffing needs, selection/assessment criteria, and hiring process for research/engineering staff.</li><li>As an individual researcher or staff specialist, may work in coordination on individual projects with Government staff scientists/engineers.</li></ul><p> <strong>Required Qualifications:</strong></p><ul><li>PhD or MS with exceptional qualifications</li><li>Minimum 8 years of experience in related area</li><li>Knowledge of these tools: Python, Java, Eclipse, C, C++, Fortran, Perl and Linux shells.</li></ul><p> <strong>General Qualifications:</strong> </p><ul><li>Experience on projects with full technical responsibility for interpreting, organizing, executing, and coordinating assignments. This includes planning, organizing, and monitoring the work of a staff of scientists, engineers, and technicians.</li><li>Experience planning and directing research projects that extend knowledge and understanding.</li><li>Ability to coordinate research and development activities between disciplines, including exploration of subject area, definition of scope and selection of problems for investigation, and development of novel concepts and approaches.</li><li>Experience working on extremely complex problems that impact the design success of current products or addresses broad design issues of future products or technologies.</li></ul><p><strong>About IBSS Corp:</strong></p><p>IBSS is a Woman-Owned, WBENC-certified and MBE/DBE-certified small business founded in 1992 that provides premier IT and Telecommunication services to Federal, state and local governments and commercial clients. We specialize in life cycle solutions for network engineering, information security/assurance, software engineering, help desk, data management/migration and project management services on the IT side, as well as RF engineering, microwave engineering, VOIP and a broad range of wireless and radio-frequency engineering services through our Telecom Division.</p><p>IBSS offers a competitive benefits package including paid vacation, medical, dental, vision and prescription drug coverage with company-paid deductible, matching 401K plan, tuition/training reimbursement, and Flex-Spending (FSA)/Dependent Care Account (DCA) options.</p><p>IBSS is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by applicable law.</p><p><b>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</b></p>"}