{"job title": "Environmental Scientist", "company": "Jacobs", "city state": "– Croydon, PA (US)", "rating": "3.4", "job description": "Jacobs is one of the world’s largest and most diverse\n<br>\nproviders of full-spectrum technical, professional and consultancy services for\n<br>\nindustrial, commercial and government organisations globally.\n<br><br>\nWith more than 74,000 people globally, our teams\n<br>\ncollaborate, innovate and create. Our people are proud to have been behind some\n<br>\nof the greatest consultancy and engineering feats over the past 70 years.\n<br><br>\nWe foster a collaborative and inclusive environment for\n<br>\nour people, and our partners, and we want you to be a part of our growing\n<br>\nbusiness.\n<br><br>\nOur Environment, Maritime and\n<br>\nResilience business\n<br>\nprovides a focus for advising our clients on sustainability issues including\n<br>\nrenewable energy, low carbon economies, impacts of climate change and waste and\n<br>\nresource management. Our environmental capabilities comprise of in excess of\n<br>\n1000 staff based predominantly in the UK, but with reach into the Middle\n<br>\nEast and in India.\n<br><br>\nTo meet\n<br>\nour growing UK business needs and future development aspirations we are seeking\n<br>\na number of Environmental Scientists.\n<br><br>\nThe\n<br>\npositions will ideally be based from Birmingham, Croydon and Edinburgh however\n<br>\nalternative office locations will be considered for suitably qualified\n<br>\ncandidates.\n<br><br>\nWe\n<br>\noffer flexible working patterns and welcome applications from candidates who\n<br>\nare seeking reduced hours’ contracts.\n<br><br>\nResponsibilities Include:\n<br><br>\n· Provision of technical input to environmental assessment projects including data collection, analysis and assessment\n<ul>\n<li>EIA coordination and management</li><li>Maintain an overview and ultimate responsibility for project tasks</li><li>Interpretative and factual report writing</li><li>Undertake environmental site work</li><li>Provide general environmental support to the wider team</li>\n</ul>\n<strong>Essential:</strong>\n\n<ul>\n\n <li>Recognised\n<br>\n degree level qualification with a Masters or 2nd degree preferable</li>\n<li>Relevant EIA\n<br>\n experience gained in a consulting environment</li>\n<li>Knowledge\n<br>\n of environmental legislation</li> \n</ul>\n<strong>Desirable:</strong>\n\n<ul>\n\n <li>Road\n<br>\n or Rail infrastructure experience particularly desirable</li>\n<li>Membership\n<br>\n of a chartered professional body</li>\n<li>Attained\n<br>\n chartership with professional body or on track to attain chartership\n<br>\n status</li>\n<li>Postgraduate\n<br>\n degree</li>\n<li>Knowledge\n<br>\n and use of GIS</li>\n</ul>\n<strong>Our Culture</strong><br>\n\n<div>At Jacobs we have recently celebrated 10 years of our culture of caring\n\n\n<ul>\n<li>‘<strong>BeyondZero</strong>’. We see safety differently - we strive to go</li>\n</ul>\n\nBeyondZero by putting the health, safety and well-being of our employees first\n<br>\nin everything we do.\n<br><br>\nWe are committed to equality across our business\n<br>\nand we promote <strong>STEM</strong> and <strong>WISE</strong> (Women in Science &amp; Engineering) initiatives. When you join\n<br>\nJacobs you will have access to a wide range of <strong>Global Networks,</strong> centred oninclusion\n<br>\nand diversity. To find out more about our networks, check out our website:\n<br><br>\nhttp://www.jacobs.com/join-us#grow-with-us</div><br>\n<div>Successful candidates will be asked to complete a Baseline Personnel\n<br>\nSecurity Standard Pre-Employment check and will be required to undergo various\n<br>\nchecks including: Identity, Right to Work; Employment/Education History and\n<br>\nCriminal Record. If you are unable to meet this and any associated criteria,\n<br>\nthen your employment may be delayed or rejected.\n<br><br>\nJACOBS is an Equal\n<br>\nOpportunity Employer who is committed to the safety and wellbeing of all.</div><br>\n\n<div>#LI-JB2</div>"}