{"job title": "Sr. Research Scientist", "company": "Johns Hopkins University", "city state": "– Baltimore, MD", "rating": "4.1", "job description": "Classified Title: Research Data Analyst ???????\n<br><br>\nWorking Title: Sr. Research Scientist ???????\n<br><br>\nRole/Level/Range: ACRP/04/MC\n<br><br>\nStarting Salary Range: $15.38 - $20.51\n<br><br>\nEmployee group: Casual / On Call\n<br><br>\nSchedule: M-F 8:30 am - 5 pm\n<br><br>\nEmployee subgroup: S1 Hrly Exmpt\n<br><br>\nLocation: 01-MD:Homewood Campus\n<br><br>\nDepartment name: 10001375-Political Science\n<br><br>\nPersonnel area: Johns Hopkins University\n\n\n<ul>\n<li>*General summary/purpose:**</li>\n</ul>\n\nSeeking a skilled researcher and methodologist to assemble, explore, and analyze quantitative economic and survey data with particular focus on the private nonprofit sector for a part-time position at the Johns Hopkins Center for Civil Society Studies.\n\n\n<ul>\n<li>*Specific duties &amp; responsibilities:**</li>\n</ul>\n\n+ Design, conduct, and evaluate quantitative research on economic and non-market dimensions and behavior of nonprofit organizations worldwide;\n<br><br>\n+ Develop methodologies for assembling data on economic dimensions of nonprofit organizations in the context of the UN System of National Accounts and national labor statistics guidelines;\n<br><br>\n+ Design and conduct survey-based research on nonprofit organizations in the U.S. and internationally;\n<br><br>\n+ Develop numerical indices to assess the capacity and macro-economic dimensions of nonprofit institutions;\n<br><br>\n+ Advise researchers and representatives of national statistical agencies abroad on research methodologies and theories pertaining to measurement of economic and non-market dimensions of nonprofit organizations in the context of the official System of National Accounts and national labor statistics;\n<br><br>\n+ Coordinate economic data assembly on nonprofit institutions worldwide;\n<br><br>\n+ Analyze and interpret macroeconomic and survey data on nonprofit organizations;\n\n\n<ul>\n<li>*Minimum qualifications (mandatory):**</li>\n</ul>\n\n+ Bachelor's degree in related discipline.\n<br><br>\n+ 3 years of proven experience in designing and implement complex research projects\n<br><br>\n+ Advanced degree may substitute for required experience, to the extent permitted by the JHU equivalency formula.\n\n\n<ul>\n<li>*Preferred qualifications:** 10+ years of proven experience in designing and implement complex research projects</li>\n<li>*Special knowledge, skills, and abilities:**</li>\n</ul>\n\n+ Interest and experience working with academic researchers, community organizations, and policy makers.\n<br><br>\n+ Superior writing and expository skills to facilitate the presentation of findings at academic conferences, in in academic and professional journals, and in training workshops for statistical officials from different countries\n<br><br>\nThe successful candidate(s) for this position will be subject to a pre-employment background check.\n<br><br>\nIf you are interested in applying for employment with The Johns Hopkins University and require special assistance or accommodation during any part of the pre-employment process, please contact the HR Business Services Office at jhurecruitment@jhu.edu . For TTY users, call via Maryland Relay or dial 711.\n\n\n<ul>\n<li>*The following additional provisions may apply depending on which campus you will work. Your recruiter will advise accordingly.**</li>\n</ul>\n\nDuring the Influenza (\"the flu\") season, as a condition of employment, The Johns Hopkins Institutions require all employees who provide ongoing services to patients or work in patient care or clinical care areas to have an annual influenza vaccination or possess an approved medical or religious exception. Failure to meet this requirement may result in termination of employment.\n<br><br>\nThe pre-employment physical for positions in clinical areas, laboratories, working with research subjects, or involving community contact requires documentation of immune status against Rubella (German measles), Rubeola (Measles), Mumps, Varicella (chickenpox), Hepatitis B and documentation of having received the Tdap (Tetanus, diphtheria, pertussis) vaccination. This may include documentation of having two (2) MMR vaccines; two (2) Varicella vaccines; or antibody status to these diseases from laboratory testing. Blood tests for immunities to these diseases are ordinarily included in the pre-employment physical exam except for those employees who provide results of blood tests or immunization documentation from their own health care providers. Any vaccinations required for these diseases will be given at no cost in our Occupational Health office.\n\n\n<ul>\n<li>*Equal Opportunity Employer**</li>\n</ul>\n\nNote: Job Postings are updated daily and remain online until filled.\n\n\n<ul>\n<li>*EEO is the Law**</li>\n</ul>\n\n<strong>Learn more:</strong>\n<br><br>\nhttps://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf\n<br><br>\nImportant legal information\n<br><br>\nhttp://hrnt.jhu.edu/legal.cfm\n<br><br>\n<strong>Equal Opportunity Employer:</strong>\n<br><br>\nJohns Hopkins University is an equal opportunity employer and does not discriminate on the basis of race, color, gender, religion, age, sexual orientation, national or ethnic origin, disability, marital status, veteran status, or any other occupationally irrelevant criteria. The university promotes affirmative action for minorities, women, disabled persons, and veterans."}