{"job title": "Senior Scientist", "company": "Kadmon Corporation", "city state": "– New York, NY", "rating": "1.8", "job description": "Kadmon Holdings, Inc. is a NYSE listed (KDMN), fully integrated biopharmaceutical company developing innovative product candidates for significant unmet medical needs.\n<br>\nCollaborating with academic centers and private enterprise at the forefront of innovation, we are focused on pioneering medicines in the areas of oncology, infectious diseases and immunology, building from its global commercial platform in the infectious and oncology market.\n<br>\n<strong>JOB SUMMARY</strong>\n<br>\nWe are looking for an intelligent, skilled, and highly motivated scientist with strong background in molecular biology, antibody expression and antibody/protein purification and characterization for the biologics department.\n<br>\nThe candidate is going to generate antibodies for different targets by using phage display technology and /or other technology.\n<br>\nDNA manipulation skills are essential for this position.\n<br>\nExperience with high-through put immune assay development and/or phage display technology would be a plus.\n<br>\nRESPONSIBILITIES The candidates will be a member of the Biologics Research team focused on supporting the discovery and optimization of monoclonal antibody (mAb) and protein therapeutics.\n<br>\nThe primary responsibilities of this position are identification of lead antibodies of therapeutic targets via phage display and optimization of these leads.\n<br>\nThe major responsibilities also include protein expression in both bacteria and mammalian systems, and protein purification.\n<br>\nCharacterization of antibody fragments such as Fab, scFv and mAb for binding and other functions by ELISA, FACS or other assays is a critical component of these responsibilities.\n<br>\nIt is strong recommend that candidate has experience to evaluate the immuno check point antibody or cytokine functions.\n<br>\nThis position is expected to provide comprehensive molecular biology support requisite in the display workflow as needed, such as constructing engineered-protein and antibody gene libraries.\n<br>\nCompiling and summarizing experimental data, preparing analyses and reports, interpreting results and presenting conclusions are critical functions of this position as is timely and thorough documentation of procedures and inventions in laboratory notebooks.\n<br>\nQUALIFICATIONS The qualified candidate will have a MS or PhD in molecular biology, biochemistry or related field.\n<br>\nCandidates with MS degree must have 8+ years relevance experience.\n<br>\nHands-on experience with phage display or alternative display technologies such as ribosome and yeast display, with utilizing current molecular biology technologies such as PCR, cloning and cDNA library construction, and with protein expression in both bacteria and mammalian systems and protein purification, and with characterization assays such as ELISA or FACS is preferred.\n<br>\nExpertise in phage biology, M13 in particular, or in protein engineering and design is highly desirable.\n<br>\nProficiency with cell based functional assays is a plus.\n<br>\nThe candidates will be required to work in a multidisciplinary team environment, simultaneously participate in several project teams, and communicate their progress against objectives effectively to scientists and management of all levels.\n<br>\nAs such, strong communication, organizational, presentation, and interpersonal skills are required.\n<br>\nThe ability to successfully work in a discovery research environment with rapidly changing priorities and to effectively manage, prioritize, and complete multiple diverse activities to meet timelines is critical.\n<br>\nFlexibility to expand job scope as needed and an aptitude for productively working with others within and outside the group on matrix style teams are expected.PandoLogic. Category: Science, Keywords: Senior Scientist"}