{"job title": "Computer Scientist - GS-CAD", "company": "Lawrence Livermore National Laboratory", "city state": "– Livermore, CA", "rating": "4.3", "job description": "<em><strong>Science and Technology on a Mission!</strong></em>\n<br><br>\nFor more than 60 years, the Lawrence Livermore National Laboratory (LLNL) has applied science and technology to make the world a safer place.\n<br><br>\nWe have openings for experienced computer scientists to work on projects that cover a range of systems, applications, technologies, and research in areas with critical national security interest. You will work independently, while contributing as a member of a dynamic, multidisciplinary team of independent computer scientists and engineers who research, develop, and integrate state-of-the-art algorithms, software, hardware, and computer systems solutions to challenging research and development problems. Team members have expertise in networking, operating systems, systems programming, computer security, high performance computing, and related technologies. This position is within the Global Security Computing Applications Division (GS-CAD) of the Computation Directorate.\n<br><br>\n<strong>Essential Duties</strong>\n\n\n<ul>\n<li>Collaborate with scientists and researchers in developing unique, world-class applications and solutions that strengthen LLNL science and technology mission areas.</li>\n<li>Work with other LLNL scientists and application developers to bring research results to practical use in one or more of the following LLNL Global Security program interest areas: Cyber Security, Critical Infrastructure &amp; Energy Security, High Performance Computing, Machine Learning, Big Data Systems, Data Analytics, Computational and Predictive Biology, Climate Modeling, Space Science, and other intelligence and security areas.</li>\n<li>Carry out development of algorithms to address program and sponsor requirements.</li>\n<li>Engage other developers frequently to share relevant knowledge, opinions, and recommendations, working to fulfill deliverables as a team.</li>\n<li>Design technical solutions independently, participate as a member of a multidisciplinary team to analyze sponsor requirements and designs, and implement software and perform analyses to address these requirements.</li>\n<li>Design, implement, deploy, and maintain software systems using object-oriented analysis, design, and programming techniques.</li>\n<li>Perform other duties as assigned.</li>\n</ul>\n\n<strong>In Addition at the SES.4 Level</strong>\n\n\n<ul>\n<li>Develop and implement improvements in advanced software development practices.</li>\n<li>Manage multiple parallel tasks and priorities of customers and stakeholders to ensure complex deadlines are met.</li>\n<li>Solve abstract complex problems/ideas and convert them into useable algorithms/software modules, as well as provide solutions that require in-depth analysis of multiple factors and the creative use of established methods.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Bachelor’s degree in computer science, computer engineering, or a related field, or equivalent combination of education and related experience.</li>\n<li>Advanced knowledge of one or more of the following: high performance computing, scientific data analysis, computer security, systems programming, large-scale data management, big data technologies, or other relevant areas.</li>\n<li>Significant experience developing software with Java, C++, C, Python, or other relevant high-level language.</li>\n<li>Significant experience developing software applications in Linux, UNIX, or Windows environments.</li>\n<li>Experience with data structures, algorithms, objected oriented design, data analysis, and/or databases.</li>\n<li>Demonstrated ability to effectively manage concurrent technical tasks with competing priorities, as well as demonstrated ability to approach difficult problems with enthusiasm and creativity and to change focus when necessary.</li>\n<li>Demonstrated ability to work independently and implement research concepts in a multi-disciplinary team environment, where commitments and deadlines are important to project success, as well as demonstrated advanced effective interpersonal skills necessary to interact with all levels of personnel.</li>\n<li>Advanced verbal and written communication skills necessary to effectively collaborate in a team environment and present and explain technical information.</li>\n</ul>\n\n<strong>In Addition at the SES.4 Level</strong>\n\n\n<ul>\n<li>Master’s degree in computer science, computer engineering, or a related field.</li>\n<li>Effective expert analytical, problem-solving, and decision-making skills to develop creative solutions to complex problems.</li>\n<li>Substantial experience with demonstrated expertise in the above technical languages, concepts, or constructs.\n<br><br>\n<strong>Pre-Employment Drug Test:</strong> External applicant(s) selected for this position will be required to pass a post-offer, pre-employment drug test.\n<br><br>\n<strong>Security Clearance:</strong>  This position requires a Department of Energy (DOE) Q-level clearance.\n<br><br>\nIf you are selected, we will initiate a Federal background investigation to determine if you meet eligibility requirements for access to classified information or matter. In addition, all L or Q cleared employees are subject to random drug testing. Q-level clearance requires U.S. citizenship. If you hold multiple citizenships (U.S. and another country), you may be required to renounce your non-U.S. citizenship before a DOE L or Q clearance will be processed/granted.\n<br><br>\n<strong>Note:</strong>  This listing has multiple openings; these are Career Indefinite positions. Lab employees and external candidates may be considered for these positions.\n<br><br>\n<strong>About Us</strong>\n<br><br>\nLawrence Livermore National Laboratory (LLNL), located in the San Francisco Bay Area (East Bay), is a premier applied science laboratory that is part of the National Nuclear Security Administration (NNSA) within the Department of Energy (DOE). LLNL's mission is strengthening national security by developing and applying cutting-edge science, technology, and engineering that respond with vision, quality, integrity, and technical excellence to scientific issues of national importance. The Laboratory has a current annual budget of about $1.8 billion, employing approximately 6,500 employees.\n<br><br>\nLLNL is an affirmative action/ equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, marital status, national origin, ancestry, sex, sexual orientation, gender identity, disability, medical condition, protected veteran status, age, citizenship, or any other characteristic protected by law.</li>\n\n</ul>"}