{"job title": "Acceptable Knowledge Scientist 2 (Scientist 2)", "company": "Los Alamos National Laboratory", "city state": "– Los Alamos, New Mexico", "rating": "3.9", "job description": "What You Will Do\n<br><br>\nThe selected candidate will support waste generators at TA-55, CMR, RLW, and RLUOB by serving as the scientific expert on transuranic radioactive waste, low level waste, chemical regulated and unregulated waste, or nuclear material accountability/management and apply scientific principles under the scientific method to address technical problems; develop novel techniques or principles; analyze data or outcomes as it relates to issues such as chemical compatibility of waste.\n<br><br>\nKey responsibilities include but not limited to:\n\n<ul>\n\n<li>Adheres to scientific policies, programs, procedures and practices.</li>\n<li>Participates in technical analyses and reviews of characterization data collected from a broad range of waste characterization techniques to develop, evaluate and/or support solutions to waste management or materials management problems.</li>\n<li>Utilizing scientific methods, participates in the investigation of the forensic origins of waste materials, researching historical records and information.</li>\n<li>Participates in formal networks involving coordination among groups and other key decision makers.</li>\n<li>Performs and participates in internal, programmatic and regulatory audits and assessments.</li>\n<li>Develops technical approach, using creativity in applying standard practices and procedures, and leads technical decisions, including selections of technical alternatives, for assigned work.</li>\n<li>Sets direction and goals for well-defined tasks involving more than one person. Scopes tasks within a project and defines deliverables at task level. Leads specific project tasks to meet scope, schedule and budget.</li>\n<li>Maintains state-of-the-art technical expertise and knowledge within discipline, and develops new skills in related disciplines. May attain additional certifications and/or qualifications, which may include more advanced educational degrees.</li>\n\n</ul>\nWhat You Need\n<br><br>\nMinimum Job Requirements:\n\n<ul>\n\n<li>Broad experience in a relevant technical discipline (chemistry, nuclear engineering, waste management or nuclear materials management) at a DOE waste-generating/processing site.</li>\n<li>Demonstrated scientific/engineering knowledge and successful experience to monitor and/or manage the accumulation, processing, movement, storage, or measurement of special nuclear material or regulated waste.</li>\n<li>Extensive knowledge of industry, and ability to interpret regulatory, or DOE/NNSA technical codes, standards, and criteria pertinent to waste management and/or nuclear materials management.</li>\n<li>Demonstrated ability to work across organizational lines and conduct extensive research to resolve difficult issues.</li>\n\n</ul>\nDesired Skills:\n\n<ul>\n\n<li>Demonstrated familiarity with maintaining genealogical relationship of a material or waste, to ensure accurate RCRA designation.</li>\n<li>Experience using waste and nuclear materials management databases such as the Waste Characterization and Tracking System (WCATS), LAMCAN and LANMASS or ability to become proficient within twelve months of hiring.</li>\n<li>Demonstrated familiarity with compliance with DOE (particularly the Carlsbad and the Los Alamos offices) waste requirements and New Mexico Environment Department (NMED) Orders.</li>\n<li>Working knowledge and experience of the latest version of TRAMPAC, TRUPACT II SARP, safety basis, and criticality or equivalent DOE, DoD, NRC documents.</li>\n<li>Demonstrated familiarity with packing, marking, and labeling hazardous materials or waste.</li>\n<li>Advanced knowledge of waste assay/characterization technology. Demonstrated familiarity with transuranic waste visual examination, non-destructive measurements neutron vs. gamma, flammability gas sampling and analysis, procedure writing, auditing and walk downs.</li>\n<li>Active Q clearance and ability to participate in the Human Reliability Program (HRP).</li>\n\n</ul>\nEducation: Bachelor’s degree in Physics, Chemistry, Biology, Chemical or Nuclear Engineering or related engineering/science discipline from an accredited college or university. Advanced degree preferred.\n<br><br>\nNotes to Applicants:For full consideration, applicants should submit a comprehensive cover letter that addresses the requirements and skills of the position as well as a resume or CV.\n<br><br>\nAdditional Details:\n<br><br>\nClearance: Q(Position will be cleared to this level). Applicants selected will be subject to a Federal background investigation and must meet eligibility requirements* for access to classified matter.\n<br><br>\n*Eligibility requirements: To obtain a clearance, an individual must be at least 18 years of age; U.S. citizenship is required except in very limited circumstances. See DOE Order 472.2 for additional information.\n<br><br>\nHRP: This position is subject to the requirements of the DOE Human Reliability Program as specified in 10 Code of Federal Regulation, Part 712, §712.11. These requirements include on going drug and alcohol testing, as well as periodic medical and psychological evaluations.\n<br><br>\n426.2:This position is subject to DOE Order 426.2, Personnel Selection, Training, and Qualification Requirements for DOE Nuclear Facilities, which establishes entry-level requirements to ensure candidates selected for specific positions can successfully perform the requirements of the job.\n<br><br>\nNew-Employment Drug Test: The Laboratory requires successful applicants to complete a new-employment drug test and maintains a substance abuse policy that includes random drug testing.\n<br><br>\nRegular position:Term status Laboratory employees applying for regular-status positions are converted to regular status.\n<br><br>\nInternal Applicants:Please refer to Laboratory policy P701 for applicant eligibility.\n<br><br>\nEqual Opportunity:Los Alamos National Laboratory is an equal opportunity employer and supports a diverse and inclusive workforce. All employment practices are based on qualification and merit, without regards to race, color, national origin, ancestry, religion, age, sex, gender identity, sexual orientation or preference, marital status or spousal affiliation, physical or mental disability, medical conditions, pregnancy, status as a protected veteran, genetic information, or citizenship within the limits imposed by federal laws and regulations. The Laboratory is also committed to making our workplace accessible to individuals with disabilities and will provide reasonable accommodations, upon request, for individuals to participate in the application and hiring process. To request such an accommodation, please send an email to applyhelp@lanl.gov or call 1-505-665-4444 option 1.<br><br>Where You Will Work<br><br>Located in northern New Mexico, Los Alamos National Laboratory (LANL) is a multidisciplinary research institution engaged in strategic science on behalf of national security. LANL enhances national security by ensuring the safety and reliability of the U.S. nuclear stockpile, developing technologies to reduce threats from weapons of mass destruction, and solving problems related to energy, environment, infrastructure, health, and global security concerns.\n<br><br>\nThe Hazardous Materials Management Group (NPI-7) ensures safe, efficient and compliant management of all radioactive and hazardous wastes generated at the TA-55 Plutonium Facility, the Chemistry and Metallurgy Research (CMR building, the TA-50 Radioactive Liquid Waste Treatment Facility (RLWTF) and the Radiological Laboratory Utility Office Building (RLUOB). The group also manages nuclear material shipments and provides other support to these facilities, including safeguards support. NPI-7 ensures that all activities in these facilities are conducted in compliance with applicable environmental regulations and Laboratory policies.\n<br><br>\n<em>Maximum Salary:</em> 144800\n<br><br>\n<em>Minimum Salary:</em> 87800\n<br><br>\n<em>Location:</em> Los Alamos, NM, US\n<br><br>\n<em>Contact Name:</em> Swoboda, Roseanne\n<br><br>\n<em>Organization Name:</em> NPI-7/Hazardous Materials Management\n<br><br>\n<em>Email:</em> rswoboda@lanl.gov\n<br><br>\n<em>Job Title:</em> Acceptable Knowledge Scientist 2 (Scientist 2)\n<br><br>\n<em>Appointment Type:</em> Regular\n<br><br>\n<em>Req ID:</em> IRC67102"}