{"job title": "Data Analyst and Algorithm Developer", "company": "MIT Lincoln Laboratory", "city state": "– Lexington, MA", "rating": "3.9", "job description": "<div>\nData Analyst and Algorithm Developer\n<br>\n Apply now »<br>\n\n <div>\nApply now \n\n\n<ul>\n\n \n<li>\n<br>\n<br>\n Start apply with LinkedIn</li>\n<br><br>\n<li>\n<br>\n<br>\n Start apply with Facebook</li>\n<br><br>\n<li>\n<br>\n Apply Now</li><br>\n\n<div>\n<div>\n<div>\nStart</div>\n </div>\n </div>\n\n<br><li>\n <div>\n<strong>Please wait...</strong></div>\n</li>\n\n</ul>\n\n </div>\n</div>\n<br><strong>Date:</strong> \n<br>\n Aug 8, 2018\n<br><br>\n<strong>Location:</strong>\n<br><br>\n MA, US<br><br>#job-location.job-location-inline {\n<br>\n display: inline;\n<br>\n }<br><br><strong>Company:</strong> \n<br>\n MIT Lincoln Laboratory<br>\n<div>The Homeland Protection Systems Group conducts systems analysis on a broad range of problems related to surface surveillance, force protection, and homeland defense. Activities include sensor and system modeling, mission requirements analysis, and architecture development. A variety of technologies are examined, including radar, optical, acoustic, biological, and chemical sensors. Modeling and the analysis of field measurements are used to quantify the ability of current and proposed technology to meet mission requirements. This work includes analysis, algorithm development, and field testing.\n<br><br>\nThe candidate will work with technical staff on a broad range of analysis problems related to sensor design and system performance assessment. The work will require an ability to understand a variety of sensing modalities (e.g. electro-optical, radar), platforms (e.g. airborne) and end-to-end data exploitation techniques (e.g. signal processing, signature detection, automatic tracking, pattern recognition). Activities involve systems analysis, data analysis, physics-based modeling, and simulation, while working as a member of a technical team. The work will involve new concept and algorithm development, sensor system modeling, experiment design, and data-driven analysis.\n<br><br>\nRequirements: B.S. in Physics, Engineering, Applied Mathematics, Aeronautics/Astronautics, Computer Science, or related field with a strong background in physical sciences. A minimum GPA of 3.5 is required.\n<br><br>\nDesired skills: MATLAB, Python, or C++ programming experience is strongly desired.\n<br><br>\nMIT Lincoln Laboratory is an Equal Employment Opportunity (EEO) employer. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, veteran status, disability status, or genetic information; U.S. citizenship is required.\n<br><br>\n<strong>Job Segment:</strong> \n<br>\n Database, Chemical Research, Engineer, Computer Science, Data Analyst, Technology, Engineering, Data</div><br>\n\n <div>\nApply now »<br>\n\n <div>\nApply now \n\n\n<ul>\n\n \n<li>\n<br>\n<br>\n Start apply with LinkedIn</li>\n<br><br>\n<li>\n<br>\n<br>\n Start apply with Facebook</li>\n<br><br>\n<li>\n<br>\n Apply Now</li><br>\n\n<div>\n<div>\n<div>\nStart</div>\n </div>\n </div>\n\n<br><li>\n <div>\n<strong>Please wait...</strong></div>\n</li>\n\n</ul>\n\n </div>\n</div>\n\n<br>"}