{"job title": "Analytics Data Engineer", "company": "Monsanto", "city state": "– Saint Louis, MO", "rating": "4.0", "job description": "We are currently seeking a talented **Analytics Data Engineer** . This role will be located in St. Louis, MO, reporting to the Data Science Implementation Lead.\n<br><br>\nIn this role, the candidate will work closely with the data science group to transition our predictive models into a production environment. In addition, the candidate will also invent and/or expand the impact of in-house innovations across geographies.\n\n\n<ul>\n<li>*Key Responsibilities:**</li>\n</ul>\n\n+ Work with data from diverse structured and unstructured data sources, and various formats.\n<br><br>\n+ Work on all aspects of the design, development, validation, scaling and delivery of analytical solutions.\n<br><br>\n+ Collaborate with interdisciplinary scientists, organize challenging problems, develop new solutions, and work with business &amp; development teams to ensure these solutions deliver value.\n<br><br>\n+ Use proficiency and experience with all aspects of the software development process (Agile planning, testing, development, performance optimization, refactoring, debugging, production support), and all components of software delivery (infrastructure, networking, operating systems, middleware, application runtimes, service integration, data and databases, production monitoring) to address complex problems.\n<br><br>\n+ Act as Subject Matter Expert in programming languages, algorithms and data structures, distributed computing and multi-threading, distributed databases, fault-tolerance, relational and non-relational data modeling and other advanced topics that power modern applications.\n\n\n<ul>\n<li>*Required Skills/Experience:**</li>\n</ul>\n\n+ Minimum of a Bachelor?s Degree in Computer Science, Electrical Engineering or a closely-related field\n<br><br>\n+ 5+ years of relevant software development experience using R, Python, Java and/or Scala\n<br><br>\n+ Proven ability to plan, schedule and deliver quality software\n<br><br>\n+ A passion for building highly automated systems\n<br><br>\n+ Strong business aptitude, the ability to rapidly learn new problem domains, and become conversant in the domain with subject matter experts\n<br><br>\n+ Experience working with large data sets\n<br><br>\n+ Experience working with distributed computing tools (Map/Reduce, Hadoop, Hive, HBase, Scala, Spark etc.)\n<br><br>\n+ Experience authoring workflows (using technology like Apache Airflow)\n<br><br>\n+ Experience provisioning and maintaining highly-available, fault-tolerant IT infrastructure including servers, storage, and data stores\n<br><br>\n+ Cloud operation experience: running real workloads in the cloud and diagnosing and fixing problems\n\n\n<ul>\n<li>*Desired Skills/Experience:**</li>\n</ul>\n\n+ Minimum of a Master?s Degree in Computer Science, Electrical Engineering, or a closely related field\n<br><br>\n+ Java programming experience\n<br><br>\n+ Creativity in validating and optimizing analytic solutions\n<br><br>\n+ Cloud Operation Experience with AWS\n\n\n<ul>\n<li>*About Us:**</li>\n</ul>\n\nBayer successfully completed the acquisition of Monsanto in June 2018, bringing together Monsanto?s leadership in seeds and plant traits with Bayer?s leadership in chemical and biological crop protection. By joining forces, we will create even more extensive career opportunities for talent around the world. We?re a global team working to shape agriculture through breakthrough innovation that will benefit farmers, consumers, and our planet.\n<br><br>\nWhile we are now Bayer, we will continue to hire using separate career sites until we can integrate our career platforms. We invite you to explore the career opportunities available at the combined company by visiting advancingtogether.com/careers.\n\n\n<ul>\n<li>*Organization:** _GLB Breeding - Analytics &amp; Pipeline Des_51190876_</li>\n<li>*Title:** _Analytics Data Engineer_</li>\n<li>*Location:** _North America-USA-Missouri-St. Louis_</li>\n<li>*Requisition ID:** _01RQD_</li>\n<li>*Job:** _Engineering_</li>\n<li>*Schedule:** _Full-time_</li>\n</ul>\n\nAt Monsanto, we value a diverse combination of ideas, perspectives and cultures. All qualified applicants will receive consideration for employment without regard to, among other things, race, religion, color, national origin, age, sex, sexual orientation, gender identity, gender expression, status as a protected veteran, or status as a qualified individual with a disability. If you need a reasonable accommodation to access the information provided on this website, please for further assistance.access our disability accommodations process\n<br><br>\nU.S. Employment Law (applicable for U.S. jobs ONLY): EEO Employer Minorities/Females/Protected Veterans/Disabled. For information about equal employment opportunity rights, please refer to this information from the U.S. federal government: ; .\n<br><br>\nEEOC PosterEEOC Supplement"}