{"job title": "Production Research Scientist", "company": "Monsanto", "city state": "– Woodland, CA", "rating": "4.0", "job description": "Production Research Scientist for Woodland, CA to lead all aspects of production research &amp; collaborate with production and crop teams to maximize vegetable seed yields, improve seed quality, reduce cost, minimize waste and solve seed production problems; conduct experiments, field trials &amp; statistical data analysis; report research findings to leadership; issue production recommendations; manage projects; process seed samples; validate new technologies under local conditions; support process control improvements &amp; quality audits; collect &amp; record data for existing and new genetics for the creation of producibility profiles.\n<br><br>\nRequires Master's in Agronomy, Plant Science, Biology, or closely-related field &amp; 2 yrs experience conducting vegetable plot research in field, net, and/or glass house for technical process improvements; leading experimental design &amp; execution for vegetable crop research; developing field research protocols; screening &amp; evaluating elite germplasm lines; processing seed samples; analyzing statistical data using Minitab, JMP and/or SPSS to improve vegetable crop production practices; identifying &amp; analyzing observational traits for new genetics; collaborating with cross-functional teams to implement &amp; execute projects; and managing project schedules across multiple crops. Will also accept Bachelor's in said fields &amp; 5 years progressive, post-Bachelor's stated experience. Up to 25% US travel &amp; 1-3 int'l trips per year req'd. Mail resume to Jill Martin, Monsanto Company, 800 N. Lindbergh Blvd. E1NH, St. Louis, MO 63167.\n\n\n<ul>\n<li>*Organization:** _GLB SC Production Research_51152828_</li>\n<li>*Title:** _Production Research Scientist_</li>\n<li>*Location:** _North America-USA-California-Woodland_</li>\n<li>*Requisition ID:** _01T0X_</li>\n<li>*Job:** _Research &amp; Development_</li>\n<li>*Schedule:** _Full-time_</li>\n</ul>\n\nAt Monsanto, we value a diverse combination of ideas, perspectives and cultures. All qualified applicants will receive consideration for employment without regard to, among other things, race, religion, color, national origin, age, sex, sexual orientation, gender identity, gender expression, status as a protected veteran, or status as a qualified individual with a disability. If you need a reasonable accommodation to access the information provided on this website, please for further assistance.access our disability accommodations process\n<br><br>\nU.S. Employment Law (applicable for U.S. jobs ONLY): EEO Employer Minorities/Females/Protected Veterans/Disabled. For information about equal employment opportunity rights, please refer to this information from the U.S. federal government: ; .\n<br><br>\nEEOC PosterEEOC Supplement"}