{"job title": "Lead Biological Scientist", "company": "PAE, Inc", "city state": "– Austin, TX", "rating": "4.4", "job description": "<ul>\n<li>*Supporting the Most Exciting and Meaningful Missions in the World**</li>\n</ul>\n\nLead Biological Scientist\n\n\n<ul>\n<li>*Lead Biological Scientist**</li>\n</ul>\n\nLocation: Various\n\n\n<ul>\n<li>*Austin**</li>\n<li>*Dallas**</li>\n<li>*Houston**</li>\n<li>*El Paso**</li>\n<li>*Baltimore**</li>\n<li>*Washington DC Metro**</li>\n<li>*Jacksonville**</li>\n<li>*Miami**</li>\n<li>*Tampa**</li>\n<li>*San Diego**</li>\n<li>*Seattle**</li>\n<li>*Phoenix**</li>\n</ul>\n\nAtlanta, GA\n<br><br>\nBoston, MA\n<br><br>\nChicago, IL\n<br><br>\nColumbus, OH\n<br><br>\nDenver, CO\n<br><br>\nDetroit, MI\n<br><br>\nIndianapolis, IN\n<br><br>\nLas Vevas, NV\n<br><br>\nLos Angeles, CA\n<br><br>\nRichmond, VA\n<br><br>\nMinneapolis-St Paul, MN\n<br><br>\nNew York, NY\n<br><br>\nSan Antonio, TX\n<br><br>\nSan Francisco, CA\n<br><br>\nSt Louis-Jefferson, MO\n<br><br>\nTrenton, NJ\n<br><br>\n<strong>POSITION DESCRIPTION:</strong>\n<br><br>\n+ Perform and/or supervise a variety of non-research biological science work utilizing microbiological and molecular techniques, including DNA extraction and real-time polymerase chain reaction (PCR) including handling, receipt, and processing of samples, containing potentially high hazard biological threat agents.\n<br><br>\n+ Handling, receipt, processing, interpreting and reporting of operational, Quality Assurance, and proficiency test samples potentially containing biological threat agents.\n<br><br>\n+ Assuring that incoming specimens are recorded, processed, and triaged appropriately while maintaining ?chain-of custody?.\n<br><br>\n+ Applying knowledge of these advanced molecular techniques and microbiological procedures to appropriately interpret and report the findings of the assays.\n<br><br>\n+ Perform and/or supervise quality control and quality assurance procedures including, but not limited to routine equipment maintenance and calibration, and documentation of quality control and quality assurance activities as needed. Ensuring that reagents, supplies and equipment are adequately maintained.\n<br><br>\n+ Perform and/or supervise the maintenance of documentation collection on findings and protocols.\n<br><br>\n+ Performing daily functions and internal proficiency tests as defined by state of LLD or designee and successfully pass external proficiency test and QAPP program audits and analyzing daily external QA samples in accordance with program SOP?s and QA program guidance for screening and confirmatory assays.\n<br><br>\n+ Responsible for reporting test results to appropriate individuals using established communication protocols with Local, State and Federal agencies.\n<br><br>\n+ Responsible for adhering to QA/QC requirements in accordance with quality management systems and laboratory Quality Assurance Program Plan (QAPP).\n<br><br>\n+ Develop and maintain personnel work schedules\n<br><br>\n+ Ensure training of new employees and competencies of all laboratorians by observing personnel on an annual basis. Conduct refresher training when as protocols are updated and as required.\n<br><br>\n+ Troubleshoot technical/laboratory issues in conjunction with the LLM, local Laboratory Director and/or their designee.\n<br><br>\n+ Support Local Laboratory Director in the generation and execution of corrective action plans in accordance with program QAPP to address any findings from program audits, proficiency tests or data trend analysis.\n<br><br>\n+ Being available 24 hours 7 days a week for laboratory coverage.\n<br><br>\n+ Routinely works approximately 2 weekends per month as directed.\n<br><br>\n+ Providing training and retraining, or arranging for the training of team members in protocols and procedures, methods and techniques of team building and working in teams to accomplish tasks or projects, and provide or arrange for specific administrative or technical training necessary for accomplishment of individual and team tasks.\n<br><br>\n+ Oversee identifying, distributing, and balancing workload and tasks among employees in accordance with established priorities to ensure timely accomplishment of assigned team tasks; and ensuring that each employee has an integral role in developing the final team product.\n\n\n<ul>\n<li>*REQUIRED QUALIFICATIONS:**</li>\n</ul>\n\n+ Knowledge of established scientific methods and techniques of microbiology to perform recurring assignment of moderate difficulty or discrete portions of the complex projects.\n<br><br>\n+ At least two years of full-time laboratory bench experience performing research or diagnostic PCR testing (includes nucleic acid extraction methodology, set up and analyses of real- time PCR assays, detection and determination of DNA contamination events) and two years of experience serving as a Senior Scientist or Team Leader of a laboratory team/project.\n<br><br>\n+ Knowledge of biohazard regulations in the proper and safe handling and transport of materials containing virulent and pathogenic disease agents and toxicants.\n<br><br>\n+ Knowledge of chain?of?custody regulations and procedures.\n<br><br>\n+ Knowledge of computer systems methods and applications, including word processing, statistical data management software packages.\n<br><br>\n+ Responsible for the use of, laboratory instrumentation related to cellular and molecular biology.\n<br><br>\n+ Responsible for maintaining Quality Assurance and Quality Control Documentation and organizational records to ensure adequate reagents and material for 24/7/365-day operation.\n<br><br>\n+ BSL-2/3 experience is highly desirable.\n\n\n<ul>\n<li>*EDUCATION:**</li>\n</ul>\n\n+ A Ph.D. or Master?s degree from an accredited University in Microbiology, Molecular Biology or related course work in biological sciences.\n<br><br>\n+ REQUIRES at least two years of laboratory bench experience, utilizing real-time PCR, aseptic techniques and biological assays, and at least one year of experience serving as a Senior Scientist or Team Leader of a laboratory team/project.\n<br><br>\n+ Alternatively, a Bachelor?s degree from an accredited University and REQUIRES at least five years of laboratory bench experience, utilizing real-time PCR, aseptic techniques and biological assays including at least two years of experience as a Team Leader/Senior Scientist.\n\n\n<ul>\n<li>*CLEARANCE LEVEL NEEDED:**</li>\n</ul>\n\n+ Requires passing a criminal background check.\n<br><br>\n+ Requires registration with the CDC Select Agent Program.\n<br><br>\n+ Individual selected will be subject to a background investigation and must meet eligibility requirements for access to sensitive information.\n<br><br>\n+ U.S. Citizenship or valid Green Card is required at time of application.\n<br><br>\nAn Equal Opportunity Employer. PAE?s hiring practices provide equal opportunity for employment without regard to race, religion, color, sex, gender, national origin, age, United States military veteran?s status, ancestry, sexual orientation, marital status, family structure, medical condition including genetic characteristics or information, veteran status, or mental or physical disability so long as the essential functions of the job can be performed with or without reasonable accommodation, or any other protected category under federal, state, or local law.\n<br><br>\nEEO is the Law Poster at http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf\n<br><br>\nJOIN OUR TALENT NETWORK at http://www.jobs.net/jobs/pae/join\n<br><br>\nPAE is a leading provider of enduring support for the essential missions of the U.S. government, its allied partners and international organizations. With over 60 years of experience, PAE supports the execution of complex and critical missions by providing global logistics and stability operations, technical services and national security solutions to customers around the world. PAE has a workforce of approximately 15,000 people in over 60 countries on all seven continents and is headquartered in Arlington, VA.\n<br><br>\nIf you need a reasonable accommodation for any part of the employment process, please contact us by email at jobs@pae.com and let us know the nature of your request and your contact information. Requests for accommodation will be considered on a case-by-case basis."}