{"job title": "Senior Scientist", "company": "The Fountain Group", "city state": "– Des Plaines, IL", "rating": "4.0", "job description": "Job Description<div>Hello,\n<br><br>\nMy name is Courtney, and I am a Recruiter with <strong>The Fountain Group.</strong> We are a national staffing firm and are currently seeking a <strong>­­­­­­­­</strong> <strong>Sr. Scientist</strong> for a prominent client of ours. This position is located in <strong>­­Des Plaines, IL.</strong> Details for the position are as follows:\n<br><br>\n<strong>Job Description:</strong>\n<ul>\n<li>This position requires a Masters or PhD.</li><li>This person will be playing a lead role in evaluating and documenting supporting evidence for IVDR directives for products in our Infectious Disease portfolio on the RealTime PCR instrument as well as our Oncology product line which employs FISH (Fluorescence In Situ Hybridization) technology.</li><li>This person will be evaluating design records and electronic lab notebook experimentation, documenting finding to support regulatory submissions.</li><li>Must be able to learn our design records system to route and approve any design records created as an output to evaluations performed.</li><li>We are looking for a scientist with design control experience, excellent technical writing skills, familiarity with working in a regulated environment and an ability to independently review data for applicability to regulations.</li><li>Person must work well in a cross functional team, be an effective communicator, have attention to detail and good organization and project management skills.</li></ul></div>\n<br>\n<strong>Company Description</strong><div><strong>About The Fountain Group:</strong>\n<br>\nHeadquartered in Tampa, FL, with operations in all 5 regions, The Fountain Group is a Contingent Labor Resource Provider. The Fountain Group services clients directly, clients with an internal contingent labor program, and clients with an external managed service program.\n<br><br>\nAt The Fountain Group, we know that searching for a new career can be stressful, which is why we take time to understand your skills and personal goals. We understand the importance of job flexibility and professional growth, and offer top-notch positions with leading employers. In fact, the majority of our clients are well known Fortune 100-500 companies. We also offer a variety of benefits to our associates to ensure their overall happiness.\n<br><br>\nIn addition to assisting with your job search, we will help you through every step of the process offering online tutorials and additional resources to enhance your industry knowledge and skills. As your employment agent, we are dedicated to providing career counseling and job advice, knowing precisely what established companies want.\n<br><br>\nAt The Fountain Group, we treat you like family, regardless of your proximity to our office. We are dedicated to providing you with an exciting, challenging and highly rewarding place to work. Become a part of our team today and let us put your talents to work.\n<br><br>\nIf you are interested in hearing more about the position please respond to this email with a copy of your resume in word form with the best contact info Please forward this email to any friends or colleagues</div>"}