{"job title": "Head of Data Science", "company": "Zendrive", "city state": "– San Francisco California", "rating": "4.9", "job description": "<div>Zendrive is looking for a seasoned data scientist with proven track record of building high performing teams to join us as the Head of Data Science for our San Francisco office. As our data guru, youll be responsible for analyzing massive driving behavior data sets to improve risk assessment and develop personalized driver coaching. Were looking for a proven technical leader that can excel in a fun, fast-moving startup environment and help us achieve our mission of making roads safer.</div>Responsibilities:\n\n<ul>\n<li>Grow the Data Science team in San Francisco by hiring talented candidates and developing leadership and deep expertise in the team</li><li>Provide hands-on technical guidance to challenging data science problems faced by the team on a day-to-day basis</li><li>Translate business requirements to data science problems and lead the team to deliver best in class solutions on startup timelines.</li> \n</ul>\n\n<strong>Skills/Requirements:</strong>\n\n<ul>\n<li>7+ years of data scientist experience, post PhD in statistics/machine learning.</li><li>Ability and experience growing and leading a Data Science team.</li><li>Excellent communication skills -- can articulate experiment goals and methodologies clearly and communicate insights in an easily accessible way to the team.</li> <li>Significant experience coding in R and/or Python.</li> <li>Experience handling massive data sets and expertise in big data technologies -- Hadoop, Spark.</li> <li>Excellent project management skills- ability to drive rapid execution without losing quality.</li><li>Ability to thrive in a fast-paced startup environment.</li>\n</ul>\n\n<strong>Preferred Skills:</strong>\n\n<ul>\n<li>Passion for answering difficult questions with and deriving insights from data.</li> <li>Ability to prototype algorithms and demonstrate gains on real data.</li> <li>Prior experience with driving, social and/or risk-related applications.</li> <li>Experience in building deep learning models in a plus.</li><li>Experience working with GIS/Maps data is a plus</li>\n</ul>\n\n<div><strong>Why join us?</strong> </div><div>We thought you'd never ask! We offer all the usual stuff: competitive salary, medical/dental insurance, meals on site, gym and Spotify membership, top of the line equipment and compelling early stage equity.</div> \n<br><strong><div>But the real perks are:</div>\n<br>\n</strong>\n\n<li>Challenging and fun work on meaningful problems - you'll never have a boring day at the office.</li>\n<li>World-class team of engineers and researchers who love solving tough problems.</li>\n<li>The opportunity to work on a problem that aims to improve the lives of everyone and will make a meaningful, positive impact on the world (while building a multi-billion dollar business).</li>\n\n<br>\n<div>When we say Zendrive is an Equal Opportunity Employer, we are not just adding a legal addendum. Of course, we do not discriminate on the basis of race, religion, color, national origin, gender identity, sexual orientation, age, marital status, veteran status, or disability, but we believe that is quite a low bar. In fact, we celebrate our differences as our strength and actively work to build an inclusive environment for all. If we can do anything to improve your application and interview process, please let us know!</div><br>\n<div><strong>To all recruitment agencies:</strong> Zendrive does not accept unsolicited resumes. Please do not forward resumes to Zendrive employees or any other company location. Zendrive is not responsible for any fees related to unsolicited resumes.</div>"}