{"job title": "Research Scientist Biomarker Sciences", "company": "AKRAYA Inc", "city state": "– Foster City, California", "rating": "3.5", "job description": "Research Scientist Biomarker Sciences : 18-03076\n<br>\nRef No.: 18-03076\n<br><br>\nCategory: Clinical Affairs\n<br><br>\nLocation: Foster City, California\n<br>\nAkraya is looking for a\n<br>\nResearch Scientist Biomarker Sciences for one of our clients. If the job description below is a fit, please apply directly or call\n<br>\nUtkarsh Audut at ************.\n<br>\nIf this position is not quite what you're looking for, visit ********** and submit a copy of your resume. Our recruiters will get to work finding you a job that is a better match at one of our many clients.\n<br><br>\nPrimary Skills: Biomarker, multi-color flow cytometric assays\n<br><br>\nDuration: 12 months\n<br><br>\nContract Type: W2 only\n<br><br>\n<strong>Description:</strong>\n<br>\nWe are seeking a research scientist to support ongoing and new efforts focused on biomarker development in the areas of inflammatory autoimmune diseases such as inflammatory bowel disease.\n<br>\nThis research scientist position is within a collaborative and dynamic biomarker research department with an established, integrated research effort in this area.\n<br>\nhe successful candidate will lead efforts to identify and implement biomarker analyses in clinical studies for IBD and inflammatory autoimmune disease therapeutic drug development.\n<br><br>\n<strong>Essential Duties and Job Responsibilities:</strong>\n<br>\nThe successful candidate will work within a project team-based research structure to collaboratively support projects in the Inflammation therapeutic area within Biomarker Sciences.\n<br>\nThe candidate will be expected to significantly participate in and lead biomarker assay development efforts.\n<br>\nThe position is within a larger group with efforts across a breadth of therapeutic areas and the successful candidate will also participate as an engaged member of this very interactive and collaborate group.\n<br><br>\n<strong>Knowledge, Experience and Skills:</strong>\n<br>\nApplicants must have a MS, PhD or equivalent degree and at least 3 to 5 years of relevant post graduate experience inclusive of either post-doctoral work or employment in the pharmaceutical/biotech industry.\n<br>\nThe candidate will have experience in the use and application of modern techniques to enable biomarker research including evaluation of intracellular signaling networks, and an understanding of basic immunology and inflammatory disease processes.\n<br>\nThe ideal candidate will have direct experience with the use of multi-color flow cytometric assays, including detection of phosphoproteins within leukocytes.\n<br>\nExperience with a broader range of platforms encompassing genomics, epigenetics, gene expression, multiplexed protein detection or other related emerging platforms is also desirable.\n<br>\nThis individual will have demonstrable skills and experience in hypothesis-driven biological/translational research and biomarker development.\n<br>\nThe ability and desire to work in a cross-functional and team-based environment is a key required attribute.\n<br>\nThe ability to communicate and scientifically engage individuals across a large breadth of levels and translate ideas and data into concise written communications is required.\n<br>\nPlease apply directly with your update resume or call Utkarsh at ************.\n<br><br>\nAbout Akraya\n<br>\nAkraya, Inc. is an award-winning staffing firm that works with many of the leading, technology-based companies around the world. We have been ranked as one of the Best Staffing Firms to Temp for by Staffing Industry Analysts on multiple occasions and are a preferred staffing vendor within numerous staffing programs. Please visit ********** to search through all of our current openings or to submit your resume to our recruiting team."}