{"job title": "Principal Scientist, AS&amp;T", "company": "Celgene Corporation", "city state": "– Summit, NJ", "rating": "3.6", "job description": "<div><strong>Other Locations:</strong>US- NJ- Summit West</div>\n<br>\nDescription<br><br>Celgene is a global biopharmaceutical company leading the way in medical innovation to help patients live longer, better lives. Our purpose as a company is to discover and develop therapies that will change the course of human health. We value our passion for patients, quest for innovation, spirit of independence and love of challenge. With a presence in more than 70 countries, and growing - we look for talented people to grow our business, advance our science and contribute to our unique culture.<br><br><strong>Principal Scientist, AS&amp;T</strong><strong>Summit, NJ</strong><br><br><strong><strong>SUPERVISOR</strong></strong>\n<br><br>\nAssociate Director, QC Systems &amp; Service\n<br><br>\n<strong>PREREQUISITES</strong>\n<br><br>\nBS minimum of 12 years; MS minimum of 7 years; or Ph.D. and minimum of 5 years in Cell\n<br><br>\n&amp; Molecular Biology (or relevant discipline) with pharmaceutical experience.\n<br><br>\n<strong><u><strong>Analytical Science &amp; Technology</strong></u></strong>\n<br><br>\nAS&amp;T is a science-driven organization dedicated to building in-depth and comprehensive knowledge of our commercial products and their processes. We work in the late phases of pharmaceutical development/Commercial manufacture to oversee the analytical processes for drug substance and drug product development both internally and with external contract service providers. Our goal is to enable the establishment of specifications and robust analytical procedures that allow control of our drug substance and drug product processes to provide safe, efficacious and high-quality products to the patients we serve.\n<br><br>\n<strong><u><strong>Responsibilities for a Principle Scientist include, but are not limited to, the following:</strong></u></strong>\n<br><br>\nThe Principle Scientist position will be responsible for the development and validation of analytical methodology for the characterization of our products and processes, the creation of fundamental product and process understanding, and the advancement of innovative approaches to drug manufacture. Support for drug candidates across late stages of development and within our commercial product portfolio.\n<br><br>\nThe Principle Scientist should work independently to carry out laboratory based analytical methods development and chemical stability evaluations as required. Activities will be performed in accordance with cGLP/cGMP regulations, established business processes and protocols, and applicable standard operating procedures.\n<ul>\n<li>Support drug product manufacture and process development.</li><li>Optimize, remediate and validate analytical methods.</li><li>Support drug substance and drug product impurity characterization and identification as required</li><li>Qualify/transfer analytical methodology internally and to contract laboratories.</li><li>Provide leadership and supervision to scientific staff.</li><li>Develop, coach and mentor others.</li><li>Assay control and reagent qualifications</li><li>Reagent and assay control stability determinations</li><li>Technical troubleshooting, real time assay &amp; investigation support.</li><li>Author and perform technical studies (bridging studies, new technology assessments, and validations)</li><li>Serve on and lead departmental, interdepartmental and project teams.</li><li>Report and discuss analytical results and conclusions both orally and in writing.</li><li>Write formal reports for inclusion in regulatory filings and support the generation of appropriate responses to questions from regulatory authorities.</li><li>Review analytical data for completeness and correctness.</li><li>Complies with Environmental Health and Safety Requirements.</li><li>Ensure that all facilities, equipment and personnel are and remain in compliance with cGLP / cGMP, FDA and EMA requirements, appropriate SOPs and corporate policies.</li><li>Contributes to the ownership and advancement of lab instrumentation, work processes, and procedures.</li>\n</ul>\n<strong><strong><u>Skills/Knowledge in the following areas are required</u></strong>:</strong>\n<ul>\n<li>Advanced hands on experience with various analytical techniques including: flow cytometry, PCR, and other immunoassays.</li><li>Advanced experience with Flow Cytometry software FCS Express and FlowJo.</li><li>Experienced in the development and performance of analytical tests for a variety of drug substances and products (cell therapies preferred).</li><li>Knowledge of dissolution method development, testing, biopharmaceutical classification system.</li><li>Understands drug development, CMC dossier for regulatory submissions as an author/reviewer.</li><li>Advanced ability to interact with regulatory auditors as Subject Matter Expert (SME).</li><li>Advanced skills in DOE, Lean and/or Six Sigma.</li><li>Familiar with modern laboratory equipment and automation</li>\n</ul>\n<strong><u><strong>Expectations of the Principle Scientist include:</strong></u></strong>\n<ul>\n<li>Exceptional verbal and written communication skills and interpersonal skills as a team member/leader in an environment where individual initiative, collaboration and accountability are valued.</li><li>A demonstrated record of scientific accomplishment, laboratory experimentation and presentation.</li><li>Direct impact on departmental performance. This impact is achieved through driving team efforts and being a member of cross-functional project teams.</li><li>An expert related to cGLP/cGMP and applicable FDA, EMA and ICH guidances.</li><li>Mastery of USP and other compendia and how they guide drug development decisions.</li><li>Strong problem-solving and troubleshooting skills.</li><li>Strong capabilities in experimental design and execution.</li><li>Works independently and through others to accomplish goals.</li><li>Ability to provide scientific guidance, leadership, and training to others within the department.</li><li>May supervise others directly and is a scientific leader/mentor within department.</li><li>Work as part of a cross site team on deviations assisting Manufacturing Science and Technology (MS&amp;T) as required.</li>\n</ul>\n\nCelgene is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Celgene complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must have authorization to work for Celgene in the U.S."}