{"job title": "Research Scientist - Material Science", "company": "Corning Incorporated", "city state": "– Painted Post, NY", "rating": "3.6", "job description": "Research Scientist - Material Science\n\n\n<ul>\n<li>*Date:** Aug 22, 2018</li>\n<li>*Location:** Painted Post, NY, US, 14870</li>\n<li>*Req #:** 32466</li>\n</ul>\n\nCorning is one of the world?s leading innovators in materials science. For more than 160 years, Corning has applied its unparalleled expertise inspecialty glass, ceramics, and optical physics to develop products that have created new industries and transformed people?s lives.\n<br><br>\nAt Corning, our growth is fueled by a commitment to innovation. We succeed through sustained investment in research &amp; development, a unique combination of material and process innovation, and close collaboration with customers to solve tough technology challenges. We are a four-time National Medal of Technology winner thanks to our technology leadership and R&amp;D environment, which attract and enable the best scientific minds in the world. This pipeline of talent has brought life-changing innovation to your fingertips for more than 160 years.\n<br><br>\nTime and again Corning Research has cleaned our world, kept us informed, and strengthened our personal connections. We are seeking out dedicated scientists who are creative and strive to see their research make a difference. We prepare our team of visionaries to pursue the breakthroughs that come from unexpected experimental outcomes and to take their discoveries across the chasm to commercialization.\n<br><br>\nDo you have a passionate belief in the power of innovation to change the world? Do you rate your own success by how many people are touched by your research? Are you up to the challenge of achieving world-class science to craft real, profitable advanced materials? If you answered yes to the above, then visit Corning?s R&amp;D website at http://www.corning.com/r_d/index.aspx\n\n\n<ul>\n<li>*Scope of Position:**</li>\n</ul>\n\n+ Multiscale Materials Modeling ? Develop and apply materials modeling techniques that span a range of scales and material systems. Understand the relationship between structure and properties for both atomistic systems such as glass as well as mesoscopic systems such as porous ceramics. Understand and characterize the impact of surface chemistry and topology.\n<br><br>\n+ Organics-on-Glass ? Develop and apply materials modeling to areas which include interfaces between organics such as polymer films and oxide glasses.\n<br><br>\nWithin the Material Science group, you will provide fundamental understanding of the physics and chemistry of materials and the relationships between composition, structure, and material properties. You will serve as consultant and mentor for less-experienced modelers. Our group engages with experimental scientists to develop a theoretical foundation and practical models of material properties and behaviors, including predictive modeling capabilities.\n\n\n<ul>\n<li>*Day to Day Responsibilities:**</li>\n</ul>\n\n+ Perform fundamental research into the physical and chemical origins of material properties and behaviors.\n<br><br>\n+ Development of models to predict material properties as functions of composition, temperature, thermal history, etc.\n<br><br>\n+ Validation of the models versus experimental data.\n<br><br>\n+ Application of these models to drive the research and development of new materials for Corning.\n<br><br>\n+ Communication of research activities through presentation at informal and formal meetings, internal and external reports, and conference presentations.\n\n\n<ul>\n<li>*Travel requirements:** In this position you will travel approximately 2 trips per year.</li>\n<li>*Hours of work/work schedule/flex-time:** We offer flexible hours with core hours between 9 am and 3 pm M-F.</li>\n<li>*Required skills:**</li>\n</ul>\n\n+ Strong background in Condensed Matter Physics and Computational Materials Science.\n<br><br>\n+ Expertise in Thermodynamics and Statistical Mechanics.\n<br><br>\n+ Scientific programming experience.\n<br><br>\n+ Proven abilities in both analytical and numerical approaches to mathematical problem solving.\n<br><br>\n+ Sustained track record of research publications in international peer-reviewed scientific journals.\n\n\n<ul>\n<li>*Education and Experience:** PhD in Material Science, Chemical Engineering, Chemistry or other appropriate technology</li>\n<li>*Desired Skills:**</li>\n</ul>\n\n+ Demonstrated, creative approach to modeling, such as the development of novel approaches for solving challenging problems.\n<br><br>\n+ Strong knowledge of glass physics and chemistry.\n<br><br>\n+ Experience and knowledge of surface science and characterization.\n<br><br>\n+ Experience with multiple computational modeling and simulation techniques related to material science including Computational Fluid Dynamics and reactions on surfaces.\n<br><br>\n+ Expertise in mesoscale techniques such as coarse graining or discrete element methods.\n<br><br>\n+ Expertise in polymer material science.\n<br><br>\n+ Basic laboratory experience and knowledge of on-line measurement techniques.\n<br><br>\n+ Diversity of interests with the ability and desire to work in several different areas.\n\n\n<ul>\n<li>*Soft Skills:**</li>\n</ul>\n\nWe seek someone to join our team who enjoys working in a diverse multi-functional team with people of different backgrounds, expertise, and approaches to problem solving. Do your colleagues look to you for technical leadership in the area of materials modeling and fundamental and applied research of material systems? If you also have very good written and oral communication skills plus good organizational skills, this might be an outstanding fit for your next career move!\n<br><br>\nThis position supports immigration sponsorship.\n<br><br>\nWe prohibit discrimination on the basis of race, color, gender, age, religion, national origin, sexual orientation, gender identity or expression, disability, or veteran status or any other legally protected status.\n\n\n<ul>\n<li>*Nearest Major Market:** Corning</li>\n</ul>"}