{"job title": "PhD Adhesive Scientist", "company": "CPS, Inc.", "city state": "– Asheville, NC", "rating": "3.9", "job description": "<strong>PhD Adhesives Scientist</strong>\n<br><br>\nThe PhD Adhesives Scientist will have responsibility for applications research and development supporting existing and developing businesses within company related to polymers, tackifier resins, and adhesives. This involves direct customer engagement in the development of new opportunities for company’s existing and developmental polymers, adhesives and tackifier resins product. The selected individual for this position will also be responsible to translate market needs into product concepts and subsequently develop the concepts into commercial products.\n<ul>\n <li>Develop a deep understanding of the functional attributes of a wide range of polymeric materials utilized in industrially important applications</li> <li>Apply theory and modeling techniques to explain experimentally based structure-property relationships for a variety of polymeric systems. The focus will be to relate polymer structure to the fundamental behavior of these systems, with an ultimate goal of predicting end-use performance</li> <li>Translate fundamental knowledge of polymer materials to the development of new applications and the identification of new market spaces</li> <li>Identify needs and opportunities through discussion with customers, sales and marketing personnel with the ability to translate those needs into innovative product solutions</li> <li>Propose a course of action based on data analysis</li> <li>Lead multidisciplinary new product development project teams</li> <li>Understand end-user requirements and testing procedures to determine how company product offerings can enhance adhesive applications and performance</li> <li>Translate ideas and concepts into detailed technical work plans that allow a Technician resource to safely and effectively execute process chemistry or applications development</li> <li>Protect intellectual property through patent applications and communicate relevant technical data through presentations at external customers’ sites</li> <li>Represent the company at industry events and other forums</li> <li>Lead multidisciplinary new product development project teams</li> <li>Travel (up to 10% of the time) to Domestic and International locations under short notice</li>\n</ul>\n**If you’d like to hear more about this opportunity and others we are currently working on, please contact Larry Riederer at 815.756.1221 / larry@cps4jobs.com.\n<br><br>\nJO: 346.18LR\n<br>\n#LI-LR1\n<br><br>\n<strong>Requirements:</strong>\n<ul>\n <li>PhD Polymer Science / Engineering, Materials Science, Chemical Engineering, Chemistry or related field from an accredited college or university</li> <li>5-10 years industry experience formulating a broad range of adhesives</li> <li>Strong working knowledge in a broad range of polymer science including: structure-property relationships, polymer physics, polymer characterization, mechanics of materials, and polymer melt processing</li> <li>General polymer application research and development experience, preferably in areas related to synthesis of low molecular weight polymers and resins, adhesion science, and polymer modification including but not limited to polymer processing, formulation and design</li> <li>Excellent judgment and relational abilities. Able to collaborate with peers of various technical backgrounds and fields of expertise to enable effective product development</li> <li>Must demonstrate excellence around professional follow-through and achieving timely closure on issues and assignments. Must be customer focused and have leadership potential</li> <li>Strong interpersonal and communication skills</li> <li>Previous project leadership in an industrial setting is preferred</li> <li>Quickly assimilates new information</li> <li>High level of motivation, initiative and sense of urgency</li> <li>Flexible to provide first-hand presence and effective support in multiple labs and facilities</li> <li>Complete fluency in English, including good verbal and written technical communications</li>\n</ul>\n**If you’d like to hear more about this opportunity and others we are currently working on, please contact Larry Riederer at 815.756.1221 / larry@cps4jobs.com.\n<br><br>\nJO: 346.18LR\n<br>\n#LI-LR1\n<br><br>\n<strong>Requirements:</strong>\n<ul>\n <li>PhD Polymer Science / Engineering, Materials Science, Chemical Engineering, Chemistry or related field from an accredited college or university</li> <li>5-10 years industry experience formulating a broad range of adhesives</li> <li>Strong working knowledge in a broad range of polymer science including: structure-property relationships, polymer physics, polymer characterization, mechanics of materials, and polymer melt processing</li> <li>General polymer application research and development experience, preferably in areas related to synthesis of low molecular weight polymers and resins, adhesion science, and polymer modification including but not limited to polymer processing, formulation and design</li> <li>Excellent judgment and relational abilities. Able to collaborate with peers of various technical backgrounds and fields of expertise to enable effective product development</li> <li>Must demonstrate excellence around professional follow-through and achieving timely closure on issues and assignments. Must be customer focused and have leadership potential</li> <li>Strong interpersonal and communication skills</li> <li>Previous project leadership in an industrial setting is preferred</li> <li>Quickly assimilates new information</li> <li>High level of motivation, initiative and sense of urgency</li> <li>Flexible to provide first-hand presence and effective support in multiple labs and facilities</li> <li>Complete fluency in English, including good verbal and written technical communications</li>\n</ul>\n**If you’d like to hear more about this opportunity and others we are currently working on, please contact Larry Riederer at 815.756.1221 / larry@cps4jobs.com.\n<br><br>\nJO: 346.18LR\n<br>\n#LI-LR1"}