{"job title": "Data Science Manager", "company": "Grand Rounds", "city state": "– San Francisco, CA", "rating": "4.8", "job description": "<div>Data Scientists at Grand Rounds work on problems that are core to the companys mission. Major challenges include developing systems and models to best match the Grand Rounds members to the highest quality clinical care for their individual needs. This requires patient-level modeling to understand the specific healthcare needs of every person as well as an in-depth understanding of physician clinical expertise and skill. With a high fidelity understanding of both patients and clinicians we are able to route patients to both appropriate and high quality care. In addition to developing the companys core technologies, the Data Science team provides decision support analysis for many teams across the organization including product development, sales, marketing, and strategy. Data scale ranges from small data sets to large multi-terabyte clinical information in distributed database systems.</div><br>\n<div>Were looking for an experienced Data Scientist with a strong technical background, leadership instincts, and managerial skills. You would be growing and leading a talented team of Data Scientists. This would entail helping to develop quarterly roadmaps, managing a number of simultaneous projects, mentoring and fostering individual career development, and coordinating closely with other stakeholders across the company.</div><br>\n<div>This position requires excellent communication skills, business instincts, and a get-it-done mentality to ensure that results are delivered while also encouraging creativity and innovation.</div> Example Projects:\n\n<ul>\n<li>Predict the specialty and subspecialty of providers</li><li>Predict the clinical expertise of providers</li><li>Predict whether a PCP is likely to prescribe harmful opioid doses</li><li>Predict if a member is likely to require a second opinion</li><li>Optimize between various provider and member dimensions for the best clinical match for a member</li>\n</ul>\n\n<strong>Responsibilities:</strong>\n\n<ul>\n<li>Mentor Data Scientists and provide technical direction</li><li>Work with Data Science and Product leadership to devise product and technical roadmaps</li><li>Manage scope and pace of execution across multiple projects for high quality and on time delivery</li><li>Remove obstacles and enable teams to work productively in a constructive environment</li><li>Develop creative solutions to diverse problems including engineering challenges, unstructured data messes, ontology development, and machine learning applications</li><li>Lead and develop major projects from end-to-end encompassing planning, design, technical implementation, debugging, roll-out to Product &amp; Engineering, testing, and iteration</li><li>Operate at level of sophistication in statistics, machine learning, or computer science that is publication-worthy</li><li>Regularly monitor pull requests, perform code reviews, and produce excellent peer reviews on projects prior to shipping to Product &amp; Engineering</li><li>Evaluate and experiment with new technologies and tools prior to wider adoption by the team</li><li>Work closely with Analysts, Data Scientists, Product Managers, and Engineers</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n<ul>\n<li>5+ years of industry experience in data science or similarly quantitative roles</li><li>2+ years of prior management experience</li><li>Strong project management skills</li><li>Strong business and product instincts</li><li>Excellent verbal communications, including the ability to clearly and concisely articulate complex concepts to both technical and non-technical collaborators</li><li>Experience effectively turning research results into applications and features that drive business impact</li><li>Passion for teaching and mentoring</li><li>Proficient with relational databases (e.g. SQL), Python, R, Linux Shell scripting</li><li>Experience with machine learning and computational statistics packages</li> <li>Experience with visualization tools</li> <li>Frequent user of cloud computing platforms such as Amazon Web Services, Microsoft Azure, or Google Cloud Platform</li><li>Bonus Points: previous work on medical applications and/or with claims data</li>\n</ul>\n\n<div>This is a full time position located in San Francisco, CA.</div><li>----</li>\n\n<br>\n<div>Grand Rounds is an Equal Opportunity Employer and considers applicants for employment without regard to race, color, religion, sex, orientation, national origin, age, disability, genetics or any other basis forbidden under federal, state, or local law. Grand Rounds considers all qualified applicants in accordance with the San Francisco Fair Chance Ordinance.</div>"}