{"job title": "Research Scientist II", "company": "ICF", "city state": "– Austin, TX", "rating": "3.6", "job description": "Working at ICF\n<br><br>\nWorking at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you?re seeking to make a difference in the world, visit www.icf.com/careers to find your next career. ICF?together for tomorrow.\n<br><br>\nHEALTH, ENVIRONMENT, ANALYTICS, RESILIENCE, AND SOCIALHealth, Research, Informatics and TechnologyPublic Health Informatics and Technology Line of BusinessSan Antonio, TXAre you passionate about improving quality of life through disease prevention, health promotion, and the care of chronic health conditions? Then consider ICF. We work at the forefront of today?s global health issues, helping clients understand the specific needs of diverse populations and address complex health challenges with behavior and disease surveillance and monitoring, research and surveys, training and technical assistance, and informatics and systems.Job Description:Our Public Health Informatics Group is growing and we?re currently seeking a Research Scientist II for our Health, Research, Informatics and Technology Division, in San Antonio, TX.We are seeking a Research Scientist II for an upcoming contract with the Naval Medical Research Unit ? San Antonio (NAMRU ? SA). NAMRU ? SA is a major research and development center conducting medical, dental, and directed energy biomedical research, which focuses on ways to enhance the health, safety, performance, and operational readiness of Navy and Marine Corps personnel and addresses their emergent medical problems in routine and combat operations. The purpose of this contract is to provide support to NAMRU-SA and its collaborating institutions in the conduct of the following research areas: expeditionary and trauma medicine, cellular and immune based adjuncts for casualty care, directed energy and bioeffects, systems engineering and evaluation, epidemiology and biostatistics, environmental surveillance and biomaterials, and maxillofacial injury and disease in consonance with the mission of the Combat Casualty Care and Operational Medicine and Craniofacial Health and Restorative Medicine directorates at the NAMRU-SA.Note: The position is contingent on contract award.Key Responsibilities: The Research Scientist II will be stationed at NAMRU ? SA. The duties include the following:\n<br><br>\n+ Develops, leads, and conducts protocol-driven scientific research addressing various aspects of military medicine, including, but not limited to: hemorrhage and resuscitation, immunomodulation, biomedical systems, bioassay development craniofacial, infectious diseases and directed energy bioeffects.\n<br><br>\n+ Provides support in writing protocol-driven research proposals, animal use protocols, human use protocols, technical reports, final reports, and peer-reviewed manuscripts.\n<br><br>\n+ Evaluates data sets (provided by the government and collected by the contractor).\n<br><br>\n+ Develops presentation materials, research Standard Operating Procedures, and present findings at technical and professional meetings.\n<br><br>\n+ Prepares experimental subjects, set up experimental equipment, and aid in training and development of experimental subjects for experimental procedures in accordance with approved animal or human use protocols.\n<br><br>\n+ Provides support in development of establishment of in vivo and in vitro model systems, data acquisition, and data analysis.\n<br><br>\n+ Oversees personnel associated with the projects and manage data.\n<br><br>\n+ Perform surgical procedures on animal models for both survival and non-survival.\n<br><br>\n<strong>Basic Qualifications:</strong>\n<br><br>\n+ A Masters in a relevant field and two years of post-academia experience.\n<br><br>\n+ Ability to work effectively independently or as a team.\n<br><br>\n+ Previous experience with the U.S. military is highly preferred.\n<br><br>\n<strong>Professional Skills:</strong>\n<br><br>\n+ Strong organization and interpersonal skills with the ability to work as part of a diverse team of mental health professionals.\n<br><br>\n+ Excellent presentation, oral and written communication skills; experience with written and oral presentation of data, ability to interact professionally active duty military staff and clients.\n<br><br>\n+ Excellent organizational skills, commitment to treating individuals with complex physiological and emotional conditions.\n<br><br>\n+ Detail-oriented, organized, fast learner, meticulous, and able to work at a fast-pace with tight deadlines.\n<br><br>\nICF offers an excellent benefits package, an award winning talent development program, and fosters a highly skilled, energized and empowered workforce.\n<br><br>\nICF is an equal opportunity employer that values diversity at all levels. (EOE ? Minorities/Females/ Protected Veterans Status/Disability Status/Sexual Orientation/Gender Identity)\n<br><br>\nPay Transparency Statement: For more information, please click here: https://www.dol.gov/ofccp/pdf/pay-transp_formattedESQA508c.pdf\n<br><br>\nWorking at ICF\n<br><br>\nWorking at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. ICF?together for tomorrow.\n<br><br>\nAbout ICF\n<br><br>\nICF (NASDAQ:ICFI) is a global consulting and technology services provider with more than 5,000 professionals focused on making big things possible for our clients. We are business analysts, policy specialists, technologists, researchers, digital strategists, social scientists and creatives. Since 1969, government and commercial clients have worked with ICF to overcome their toughest challenges on issues that matter profoundly to their success. Come engage with us at icf.com.\n<br><br>\nTexas Client Office (TX88)\n<br><br>\nAbout ICFICF (NASDAQ:ICFI) is a global consulting and technology services provider with more than 5,000 professionals focused on making big things possible for our clients. We are business analysts, policy specialists, technologists, researchers, digital strategists, social scientists and creatives. Since 1969, government and commercial clients have worked with ICF to overcome their toughest challenges on issues that matter profoundly to their success. Come engage with us at icf.com."}