{"job title": "Principal Scientist Metabolic Disease", "company": "Merck and Co.", "city state": "– San Francisco, CA", "rating": "3.7", "job description": "We are looking for an outstanding and highly motivated scientist with an expertise in research on metabolic diseases in general, and insulin resistance, obesity in particular. A successful candidate is expected to exhibit a combination of in vitro and in vivo research experience and have demonstrated productivity as evidenced by (including but not limited to) publications, oral presentations at conferences, patents and strong connections with academic thought leaders. The candidate would be expected to have deep knowledge of the disease area and be able to propose new targets, design and execute on preclinical target ID and validation independently, create a line of sight to the target patient population, keeping in mind the target product profile from a payer perspective. The candidate will also be expected to create and manage academic collaborations, lead projects, mentor colleagues within the organization in absence of a direct reporting structure. Consistent with a startup theme and culture of the site, the candidate must get into the lab to get the work done including but limited to, helping colleagues and/or generating data. The candidate must be enthusiastic, energetic, articulate and a team player.\n<br><br>\nResponsibilities include and are not limited to the following:\n<br>\nPropose novel targets and design experiments for target ID and validation\n<br>\nLead early discovery projects. Develop and execute research operation plans\n<br>\nPropose and set up appropriate technology and platform based on the need of programs\n<br>\nConduct experiments and generate data\n<br>\nPresent results to project team and senior management\n<br>\nSupervise and train associates\n<br><br>\n<strong>Qualifications\n<br><br>\nEducation / Work Experience Requirement:</strong>\n<br>\nPh.D. in Biology or relevant areas with a minimum of (7) years’ industry experience\n<br>\nRequired Experience:\n<br><br>\nMust have deep understanding and prior research experience in the field of metabolic diseases\n<br>\nMust have at least (1) of the following skill sets:\n<br>\nDevelopment of in vitro assays for target biology and HTS and/or\n<br>\nDevelopment of in-vivo models\n<br>\nIndependent and self-motivated scientist\n<br>\nStrong written and verbal communication skill"}