{"job title": "Hybrid Design Scientist", "company": "Monsanto", "city state": "– Saint Louis, MO", "rating": "4.0", "job description": "We are seeking a **Hybrid Design Scientist** to accelerate the impact of new technologies in our Global Breeding programs. As part of the Development and Deployment platform, this position will focus on deployment of new breeding analytics and methodologies through cross-collaborations with global pipelines and technical teams. The outcomes of this work should significantly influence and impact the future design of ongoing breeding programs. The Design Scientist will have access to state of the art analytics platforms and genomic and high throughput phenotyping tools. As part of the Analytics and Pipeline Design team, this role will collaborate extensively with data scientists and breeding teams across Technology. The position will learn from, participate in, and contribute to research and development across the Global Breeding organization on all row crops across geographies.\n\n\n<ul>\n<li>*Responsibilities include:**</li>\n</ul>\n\n+ Accelerating the implementation and optimization of advanced breeding models and workflows with breeding pipeline partners for hybrid crops across North America and globally\n<br><br>\n+ Partnering with technical domain experts and regional breeding pipelines to increase adoption of new tools and techniques to maximize breeding program design\n<br><br>\n+ Leading deployment projects, analyzing results, and reporting research findings and recommendations to key stakeholders and leadership teams\n<br><br>\n+ Coordinating and communicating with planning teams and enablement teams across global enabling functions to execute large scale validation experiments\n<br><br>\n+ Participating as a contributing member of global and regional initiative teams working on scaling enhancements towards genetic gain and operational efficiencies\n<br><br>\n+ Traveling to meet with breeding teams and field sites\n<br><br>\n+ Attending scientific conferences and networking with external thought leaders to continuously expand knowledge of new innovations in digital agriculture, plant breeding, and genetics\n\n\n<ul>\n<li>*Required Skills/Experience:**</li>\n</ul>\n\n+ Minimum of a PhD in Plant Breeding, Agronomy, Horticulture, Data Science, Genomics, Computational Biology or related life science field\n<br><br>\n+ Prior experience demonstrating success developing comprehensive plans and delivering results through effective project leadership\n<br><br>\n+ Experience in statistics and experimental design\n<br><br>\n+ Track-record of creatively defining key results and driving technical business solutions both independently and through cross-functional project teams\n<br><br>\n+ Demonstrated ability to communicate effectively (both written and oral) with proven ability to convey complex ideas in a clear, precise and actionable manner to diverse teams at all levels of the organization\n<br><br>\n+ Experience building consensus and leading teams through influence while working with strict deadlines in a highly demanding and agile environment\n<br><br>\n+ Ability to contingency plan and risk-adjust to meet timelines and deliver results\n<br><br>\n+ Ability to travel independently up to 25% (domestic and international) with overnight stays and extended assignments\n\n\n<ul>\n<li>*Desired Skills/Experience:**</li>\n</ul>\n\n+ Experience working with highly technical teams in computational statistics, computational mathematics, predictive analytics/machine learning, and/or process optimization and translating into workflows and insights\n<br><br>\n+ Five or more years of experience in genomics and/or quantitative genetics\n<br><br>\n+ Five or more years of experience conducting large scale field trials\n<br><br>\n+ Familiarity with Cloud computing platforms GitHub and/or AWS\n<br><br>\n+ Experience with R, Perl and/or Python\n<br><br>\nBayer successfully completed the acquisition of Monsanto in June 2018, bringing together Monsanto?s leadership in seeds and plant traits with Bayer?s leadership in chemical and biological crop protection. By joining forces, we will create even more extensive career opportunities for talent around the world. We?re a global team working to shape agriculture through breakthrough innovation that will benefit farmers, consumers, and our planet.\n<br><br>\nWhile we are now Bayer, we will continue to hire using separate career sites until we can integrate our career platforms. We invite you to explore the career opportunities available at the combined company by visiting advancingtogether.com/careers .\n\n\n<ul>\n<li>*Organization:** _GLB Breeding - Analytics &amp; Pipeline Des_51190876_</li>\n<li>*Title:** _Hybrid Design Scientist_</li>\n<li>*Location:** _North America-USA-Missouri-St. Louis_</li>\n<li>*Requisition ID:** _01QSU_</li>\n<li>*Job:** _Research &amp; Development_</li>\n<li>*Schedule:** _Full-time_</li>\n</ul>\n\nAt Monsanto, we value a diverse combination of ideas, perspectives and cultures. All qualified applicants will receive consideration for employment without regard to, among other things, race, religion, color, national origin, age, sex, sexual orientation, gender identity, gender expression, status as a protected veteran, or status as a qualified individual with a disability. If you need a reasonable accommodation to access the information provided on this website, please for further assistance.access our disability accommodations process\n<br><br>\nU.S. Employment Law (applicable for U.S. jobs ONLY): EEO Employer Minorities/Females/Protected Veterans/Disabled. For information about equal employment opportunity rights, please refer to this information from the U.S. federal government: ; .\n<br><br>\nEEOC PosterEEOC Supplement"}