{"job title": "Predictive Analytics Data Science Intern", "company": "Monsanto", "city state": "– Saint Louis, MO", "rating": "4.0", "job description": "The Plant Breeding Trait &amp; Product Delivery Organization is seeking a motivated Predictive Analytics Data Science Intern. This position will be located in Chesterfield, Missouri, reporting to our Agronomy and Automation Strategy Lead.\n<br><br>\nThis internship will play a key role in delivering innovative scientific breakthroughs. As part of our diverse, highly dynamic group, you will be exposed to exciting research challenges and will have ample opportunity to work with interdisciplinary scientists to foster career growth and development while delivering innovative analytical solutions.\n<br><br>\nDates for this internship are May-August of 2019.\n<br><br>\n<strong>Key Responsibilities:</strong>\n<br><br>\n+ Learn the decision-making process in our product pipeline\n<br><br>\n+ Develop methodologies of predictive modeling of phenomics and production data to drive decisions that are critical to our products? success\n<br><br>\n+ Present findings to an audience of peers and senior management\n<br><br>\n<strong>Required Skills/Experience:</strong>\n<br><br>\n+ Candidates must be currently enrolled in a Masters or PhD degree program in Statistics, Operations Research, Computational Biology, Biostatics, Statistical Genetics, Bioinformatics or a related field\n<br><br>\n+ Cumulative GPA of 3.0 or above\n<br><br>\n+ Thorough knowledge of machine learning and data mining\n<br><br>\n+ Demonstrated computational skills and experience with R, Python, MATLAB, Java or other programming packages\n<br><br>\n+ Creative, proactive, bold and out-of-box thinking\n<br><br>\n+ Strong problem solving and critical thinking skills\n<br><br>\n+ Strong business aptitude, the ability to rapidly learn new problem domains, and become conversant in the domain with subject matter experts\n<br><br>\n+ Ability to communicate complex ideas in a clear, precise and actionable manner\n<br><br>\n+ Detail and results-orientated with the ability to work independently\n<br><br>\n+ Ability to actively engage with internal partners &amp; external collaborators to align strategies &amp; success measures in analytics\n<br><br>\nBayer successfully completed the acquisition of Monsanto in June 2018, bringing together Monsanto?s leadership in seeds and plant traits with Bayer?s leadership in chemical and biological crop protection. By joining forces, we will create even more extensive career opportunities for talent around the world. We?re a global team working to shape agriculture through breakthrough innovation that will benefit farmers, consumers, and our planet.\n<br><br>\nWhile we are now Bayer, we will continue to hire using separate career sites until we can integrate our career platforms. We invite you to explore the career opportunities available at the combined company by visiting advancingtogether.com/careers.\n\n\n<ul>\n<li>*Organization:** _GLB Breeding - TPD Mgmt_51180393_</li>\n<li>*Title:** _Predictive Analytics Data Science Intern_</li>\n<li>*Location:** _North America-USA-Missouri-St. Louis_</li>\n<li>*Requisition ID:** _01RWW_</li>\n<li>*Job:** _Research &amp; Development_</li>\n<li>*Schedule:** _Full-time_</li>\n</ul>\n\nAt Monsanto, we value a diverse combination of ideas, perspectives and cultures. All qualified applicants will receive consideration for employment without regard to, among other things, race, religion, color, national origin, age, sex, sexual orientation, gender identity, gender expression, status as a protected veteran, or status as a qualified individual with a disability. If you need a reasonable accommodation to access the information provided on this website, please for further assistance.access our disability accommodations process\n<br><br>\nU.S. Employment Law (applicable for U.S. jobs ONLY): EEO Employer Minorities/Females/Protected Veterans/Disabled. For information about equal employment opportunity rights, please refer to this information from the U.S. federal government: ; .\n<br><br>\nEEOC PosterEEOC Supplement"}