{"job title": "Formulation Scientist", "company": "NCH Corporation", "city state": "– Irving, TX", "rating": "3.2", "job description": "&nbsp;\n<br><br>\n<strong>Established, Entrepreneurial, Empowered…Explore the Opportunities!</strong>\n<br><br>\n&nbsp;\n<br><br>\nThank you for exploring a career with NCH Corporation, an international company where we work in small teams that have a direct impact on success. We’re seeking a highly skilled Formulation Scientist who is responsible for formulating and testing water treatment products. This person will conduct experimental investigations and research to test products and develop new, unique formulations. If you’re seeking innovative freedom in a personable, stable yet thriving environment, our Water Treatment/Formulation Scientist opportunity could be a match for you!\n<br><br>\n&nbsp;\n<br><br>\n<strong>A little about us</strong>\n<br><br>\nApplying for a new job is a little like entering uncharted territory. We want you to feel 100% confident about the application process, the position and our company before committing your time to apply, so that none of the above comes as a surprise. Let’s start with some information about NCH so you can get to know us better.\n<br><br>\n&nbsp;\n<br><br>\nNCH Corporation is a privately held, family-owned, global business headquartered Irving, Texas, near Dallas. We have more than 7,500 employees, offices and facilities on six continents, and clients in more than 50 countries. This includes our corporate headquarters as well as subsidiary companies. We&nbsp;clean and conserve water, save energy, and deliver best-in-class maintenance solutions, with a focus on industrial and commercial businesses.\n<br><br>\n&nbsp;\n<ul>\n<li>About NCH and our history</li><li>Our products and solutions</li><li>NCH brands and divisions</li> \n</ul>\n&nbsp;\n<br><br>\n<strong>Culture and benefits</strong>\n<br><br>\n&nbsp;\n<br><br>\nWe’re a global company with a family feel, offering the same benefits of an international corporation with the personal relationships of a small business. Working in our small teams and close-knit environment, you’d never guess we had a 7,500+ employee head count. We realize a job is more than just a job – it’s an extension of your life and family – and we’re committed to maintaining just that. For us, culture is not just a perk; it’s essential to how we thrive. And that’s speaking for 100 years in the business!\n<ul>\n<li><strong>Employee-centric environment</strong> (regular corporate activities, personal relationships, small teams)</li><li><strong>Family-first attitude</strong> (work-life balance support, flexible hours)</li><li><strong>Approachable leadership</strong> (collaboration with top leaders, open-door policy)</li><li><strong>Growth-oriented mindset</strong> (autonomy, creative freedom to explore new ideas)</li><li><strong>Paid vacation and holiday leave</strong></li><li><strong>Wellness initiatives</strong> (on-site fitness facility and cafeteria, treadmill conference room, planned activities)</li><li><strong>Community involvement</strong> (volunteering, fundraisers, charity events, school sponsorships and donations)</li><li><strong>Employee recognition programs</strong> (appreciation week, awards and ceremonies)</li><li><strong>Personal and professional development and growth</strong></li><li><strong>Tuition reimbursement</strong></li><li><strong>Financial wellness</strong> (retirement options, 401K match, employee credit union)</li><li><strong>Benefits package</strong> (medical, dental, vision, life, long and short-term disability)</li>\n</ul>\n&nbsp;\n<br><br>\nIf this sounds like a fit for you so far, keep reading.\n<br><br>\n&nbsp;\n<br><br>\n<strong>A little about you</strong>\n<br><br>\n&nbsp;\n<br><br>\n<strong>You are a skilled scientist.</strong> You have a bachelor’s degree in chemistry, or chemical engineering. You have 1 – 3 years industrial experience, preferably in areas related to: water chemistry and treatment, formulations in liquid form. You are technically savvy in your field and have track record of new product development.\n<br><br>\n&nbsp;\n<br><br>\n<strong>You are a critical thinker and problem solver.</strong> New challenges motivate you. The more complex the problem, the better. You are not afraid to tackle an assignment in uncharted territory and are determined to find a solution rather than leaving a problem unsolved. You can assess and interpret scientific literature to develop desired or new formulation approaches.\n<br><br>\n&nbsp;\n<br><br>\n<strong>You are innovative.</strong> You’re a self-starter. You enjoy coming up with new solutions, and you leverage your knowledge in the field to develop new, unique solutions to problems, including formulation approaches not yet demonstrated. You have examples to show of your past work.\n<br><br>\n&nbsp;\n<br><br>\n<strong>You’re curious and investigative.</strong> Experimental evaluation and testing of new products is right up your alley. You enjoy researching to help you solve problems or to analyze the competition. Your work is thorough and in-depth.\n<br><br>\n&nbsp;\n<br><br>\n<strong>You have excellent organizational skills.</strong> You can handle multiple assignments, plan experiments, and prioritize tasks. You understand the value of safe and organized lab and proper record keeping.\n<br><br>\n&nbsp;\n<br><br>\n<strong>You are highly detail-oriented.</strong> You have the ability to catch the smallest of inconsistencies, especially when it comes to data. Your attention to detail goes hand-in-hand with your critical thinking and innovative skillset. You approach your work with a zero error mindset and are a reliable resource for quality.\n<br><br>\n&nbsp;\n<br><br>\n<strong>You’re a learner and a teacher.</strong> You are very knowledgeable in your field and stay up-to-speed through research and education. You enjoy knowledge transfer and are apt to train and teach those around you. You can train other employees in an effective, professional manner.\n<br><br>\n&nbsp;\n<br><br>\n<strong>You have strong written and verbal communication skills.</strong> You carry a very professional demeanor and are comfortable speaking and working with anyone. You are customer service-oriented and will work with others as needed – internally and externally – to resolve issues and provide technical support.\n<br><br>\n&nbsp;\n<br><br>\n<strong>Day-to-day work examples</strong>\n<br><br>\n&nbsp;\n<br><br>\nWe support growth, opportunity and variety, which means your day-to-day has the potential to adapt with you and your passions. If you’re not challenged and growing, neither are we. For starters, though, here are some day-to-day examples of what you will be doing:\n<ul>\n<li>Conduct investigations pertaining to the formulation, maintenance and technical support of the products within the water treatment areas.</li><li>Develop a new product formulation leveraging literature and research.</li><li>Conduct experimental evaluations of new product formulations, raw materials, competitive products in the lab and field environment.</li><li>Create and maintain all of the necessary documentation in order to develop and commercialize the products (i.e. lab notebooks, specifications, technical test methods/data, etc.).</li><li>Analyze and summarize research and development findings into technical documents; utilize statistical tools for data analysis as appropriate</li><li>Provide technical support to sales and marketing teams and raw material vendors.</li><li>Ensure that Corporate Safety and ISO procedures are followed in area of your responsibility</li><li>Train a new team member who will be working with you to develop a new product formulation.</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>Sound like a fit for you?</strong>\n<br><br>\n&nbsp;\n<br><br>\nIf yes, jump aboard, and apply today.\n<br><br>\n&nbsp;\n<br><br>\nFor next steps, expect a direct phone or email response once we are able to review your application. We are committed to responding to all applicants, no matter the outcome, so we appreciate your patience to allow time for this. In the meantime, learn more about NCH and our culture by checking out our LinkedIn or Facebook pages.\n<br><br>\n&nbsp;\n<br><br>\n&nbsp;\n<br><br>\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.\n<br><br>\n<strong>LI-137280436_NS1</strong>"}