{"job title": "Associate Scientist - Computational Biology", "company": "NeoGenomics Laboratories", "city state": "– Aliso Viejo, CA, United States", "rating": "4.0", "job description": "<div><div>Are you motivated to participate in a dynamic, multi-tasking environment? Do you want to become part of a company that invests in its employees? Are you seeking a position where you can use your skills while continuing to be challenged and learn? Then we encourage you to dive deeper into this opportunity.\n<br><br>\nNeoGenomics is looking for an Associate Scientist, Computational Biology in Aliso Viejo, CA who wants to continue to learn in order to allow our company to grow.\n<br><br>\nNow that you know what we're looking for in talent, let us tell you why you'd want to work at NeoGenomics:\n<br><br>\nNeoGenomics Laboratories is comprised of a national team of experts in developing and delivering laboratory diagnostic and clinical trial services with a focus in cancer. It is the common purpose of all NeoGenomics employees to save lives by improving patient CARE through Communication, Accuracy, Reliability, and Efficiency. Our staff physicians, scientists, laboratory professionals, client services representatives, and sales people team up with our clients. Together, we work to solve the medical, scientific, and logistical challenges of making precise diagnoses, aiding in bringing new therapies to market and finding the unusual hallmarks of each patients disease that point the way to proper treatment.\n<br><br>\nAs an employer, we promise to provide you with a purpose driven mission in which you have the opportunity to save lives by improving patient care through the extraordinary work you perform. Together, we will become the world's leading cancer reference laboratory.<br><br>Position Summary:<br><br>This role executes machine learning based analysis pipelines on microscopy images from MultiOmyx technology. The role mainly involves conducting analysis of data from service contracts leading to the successful completion of client projects. You will use your experience with machine learning and image analysis methods and apply these methods to analyze large datasets. You will provide support in solving complex bio-image informatics tasks, and work alongside Scientists and Senior Scientists to successfully complete data analysis tasks in the production environment.<br><br>Core Responsibilities\n\n<ul>\n<li>Execute image analysis pipelines for multiplexed immunofluorescence and IHC data to generate large number of features for interpretation.</li><li>Use the scale of NeoGenomics proprietary data and compute infrastructure to address meaningful bio-image analysis problems.</li><li>Develop methods and tools to support analysis &amp; visualization of large datasets.</li><li>Help with project design and feasibility studies.</li><li>Document processes and analyses, using reproducible methods and scripts.</li><li>Work with scientists to provide proof of concept testing and regression testing as needed</li><li>Analyze, present data and project updates to the management team.</li><li>Validate and test new analytics methods developed by the team.</li><li>Provide support to research collaborations, clinical trials and other department projects.</li><li>Prepare high quality technical reports and documentation including posters/papers, client presentations and technical content for marketing materials.</li>\n</ul>\n\n<strong>Additional Responsibilities (may be assigned):\n<br>\n</strong>\n\n<ul>\n<li>Attend additional training or educational opportunities as requested.</li><li>Attend and present at academic meetings.</li><li>May publish from R&amp;D activities.</li><li>Perform other duties as assigned by the Manager or Director of Operations as needed.</li><li>Achieves desired level of competency and accuracy for the main department processes and responsibilities of assigned position, as defined in established SOPs, within 6 months.</li><li>Completes project goals within established guidelines.</li><li>Reports quality results with limited errors.</li><li>Works productively and efficiently to achieve company and departmental goals.</li><li>Communicates effectively with all levels of staff.</li>\n</ul>\n\n<strong>Experience &amp; Required Qualifications:\n<br>\n</strong>\n\n<ul>\n<li>Education: M.S., B.S. in a Computer Science or any quantitative discipline with related experience</li> <li>Experience: Two or more years of related technical experience in data analysis or machine learning. Experience with biological image data preferred.</li> <li>Strong understanding of image analysis and machine learning techniques.</li><li>Experience with building end-to-end reusable pipelines from acquisition to output.</li><li>Shown programming skills, in at least one of the following languages: C, C++, Python, Java.</li><li>Familiarity with state-of-the-art machine learning algorithms and packages.</li><li>Familiarity with Deep Learning frameworks.</li><li>Experience working with large data sets, preferably large biological image datasets.</li><li>Passionate about staying on the cutting edge of data science technologies.</li><li>Must be able to work in a dynamic, multi-tasking laboratory environment, follow safety policies and standards, and maintain production and quality standards.</li><li>Excellent written and verbal presentation skills and the ability to use software tools to produce high impact presentations of data.</li><li>Ability to problem solve independently and escalate problems in a timely manner.</li><li>Ability to work independently and within a team environment.</li>\n</ul>\nAll qualified applicants will receive consideration for employment without regard to race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, or protected veteran status.</div></div>\n<br><strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}