{"job title": "Upstream Processing Scientist: Pharmaceuticals Industry", "company": "On-Board Companies", "city state": "– West Point, PA", "rating": "3.0", "job description": "Job Description<div><strong>*1 year contract position with additional opportunity based upon performance and continued business need*</strong>\n<br><br>\n<strong>Qualifications:</strong>\n<br>\n<strong>Qualifications: Basic Minimum Qualifications:</strong>\n\n\n<ul>\n<li>B.S. in Biology, Bio/chemistry, Bio/chemical Engineering, or related science</li>\n<li>laboratory experience in mammalian cell culture.</li>\n<li>General laboratory skills, experience with aseptic manipulations, pipettes</li>\n<li>Experience in culturing microbial cells (shake flasks, bioreactor work)</li>\n<li>Experience with bioreactors (Ambr250, stainless steel reactors, glass bioreactors, Single use bioreactors)</li>\n<li>Experience performing basic lab scale assays (pH, optical density, etc)</li>\n<li>Experience using formulas and linking spreadsheets in Excel</li>\n<li>Highly computer literate. Capable of quickly learning and adapting to new computer programs. Strong computer, scientific, and organizational skills</li>\n<li>Excellent communication (oral and written) and attention to detail</li>\n<li>Ability to work independently and as part of a team, self-motivated, adaptable, and displays a positive attitude</li>\n<li>Ability to learn new techniques, perform multiple tasks simultaneously, keep accurate records, follow instructions, and comply with company policies</li>\n<li>Engaged in work practices, scientific understanding, and excellence in execution</li>\n</ul>\n\n<strong>Responsibilities:</strong>\n<br>\nUpstream Process Scientist - Responsibilities: Scientist responsibilities include, but are not limited to, the following:\n\n\n<ul>\n<li>Prepare laboratory reagents, solutions and culture media</li>\n<li>Perform lab-scale upstream processing of vaccine products and process intermediates (including work with Biosafety Level-2 organisms)</li>\n<li>Setup process equipment for lab-scale experiments</li>\n<li>Perform in-process monitoring assays</li>\n<li>Analyze, collate, track, and report data back to client staff members</li>\n<li>Maintain records and test results following good laboratory practices (GLP)</li>\n<li>Work independently and efficiently</li>\n<li>Document work clearly and perform tests accurately</li>\n<li>Communicate effectively with client staff members</li>\n<li>Follow laboratory procedures as required to perform the above tasks, and escalate deviations/issues to client staff members in a timely fashion</li>\n</ul>\n\n<strong>Pay Rate: $45.00 per hour\n<br>\nDrug and background screenings required</strong>\n<br><br>\n<em>On-Board Services provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, religion, sex, national origin, age, disability or genetics.</em> </div>\n<br>\nCompany Description<div>On-Board was founded in 1976 by Robert L. Wilson to provide Engineering and Design services to the chemical manufacturing industry. Today, On-Board is a thriving privately held family of companies with services including: Consulting, Professional Engineering, Industrial Maintenance and Facility Management, Contracted Manufacturing and Production Services, as well as Temporary Staffing and Recruiting throughout North America.\n<br>\n<strong>​</strong>\n<br>\nOne of the unique aspects of On-Board is our ability to customize solutions with each of the complimentary business verticals to satisfy our partners goals including Total Solutions.</div>"}