{"job title": "Senior Scientist, Assay Development", "company": "Pfizer", "city state": "– Groton, CT", "rating": "3.9", "job description": "<ul>\n<li>*Position Purpose** The Regulated Clinical Biomarker/Flow Cytometry group works with clinical and translational teams across Pfizer research units to develop and implement complex flow cytometry-based biomarker assays and supportive translational/mechanistic studies for early phase clinical projects in a GCLP environment. The Senior Scientist will support novel clinical biomarker assay development and industry-leading technology evaluation. This scientist will act as a technical and scientific lead for biomarker assay development and execution, advance innovative new biomarker technologies and contribute to developing strategies for high content data visualization and analysis. This scientist will interact with inter-departmental colleagues, clinical and translational teams, research units, contract research organizations and clinical study sites in a matrixed environment.</li>\n<li>*Primary Responsibilities**</li>\n</ul>\n\n+ Responsible for clinical flow cytometry biomarker assay development and validation, data generation and analysis, QC, data interpretation and communication to project teams to enable appropriate decision making.\n<br><br>\n+ Provide scientific input into assay target selection, design and validation.\n<br><br>\n+ Serve as the primary point of contact with research units, translational medicine and clinical assay groups in a matrix environment and provide subject matter expertise for flow cytometry flow cytometry biomarker selection and assay development.\n<br><br>\n+ Identify and develop new technologies, techniques, and high content data visualization/analysis tools to influence clinical decision making.\n<br><br>\n+ Utilize GCLP guidance for assay validation and analysis of clinical study samples supporting Pfizer drug candidates in clinical development.\n<br><br>\n+ Demonstrate understanding of fit-for-purpose assay development and support; effectively balance assay rigor against resource needs and study goals.\n<br><br>\n+ Direct research projects, train and mentor junior colleagues and contracted staff.\n<br><br>\n+ Proactively gather input from colleagues, teams &amp; management to avoid/address issues at functional level.\n<br><br>\n+ Occasional weekend work for processing clinical samples should be anticipated.\n\n\n<ul>\n<li>*Experience, Education**</li>\n</ul>\n\n+ Ph.D. (&gt;5 years) in either Oncology or Inflammation and Immunology.\n<br><br>\n+ Extensive experience in immune cell function and phenotypic analysis using a variety of assays\n<br><br>\n+ Experience with high content flow cytometry instrumentation, data analysis concepts and tools.\n<br><br>\n+ Ability to coach and mentor junior colleagues, act decisively and influence in a matrix environment\n<br><br>\n+ Excellent oral and written communication skills\n<br><br>\n+ Ability to deal with project and organizational change while supporting the organization\n\n\n<ul>\n<li>*EEO &amp; Employment Eligibility**</li>\n</ul>\n\nPfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.\n\n\n<ul>\n<li>*Sunshine Act**</li>\n</ul>\n\nPfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider's name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.\n\n\n<ul>\n<li>*Other Job Details:**</li>\n</ul>\n\n+ **Last Date to Apply for Job:** October 15, 2018\n<br><br>\n+ Eligible for Employee Referral Bonus: yes\n<br><br>\nPfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates."}