{"job title": "Senior Scientist, Numerical Methods", "company": "Philips", "city state": "– Pleasanton, CA", "rating": "3.4", "job description": "As a Senior Scientist in the Clinical Science team, he or she will be accountable to lead clinical and research specialists, including researchers to acquire data at clinical sites, develop algorithms and numerical methods, carry out feasibility studies and help assure that activities are executed within expected scope, budget and timelines. The senior scientist in numerical methods will play a key role to establish the growth of Philips Neuro and assure best-in-class software tools and seemless clinical workflow. Specifically, the leader will work closely with colleagues in Philips research teams, development teams, commercial teams, operations, and regulatory.\n\n\n<ul>\n<li>*Senior Scientist, Computer Vision**</li>\n<li>*Your challenge**</li>\n</ul>\n\nTransform neurology as the world knows it by driving scientific innovation for computational neuro science. You will help shape the Philips Neuro Clinical Science team where our mission is to help patients suffering from some of the most challenging and impactful neurologic disorders. You will lead efforts in non-invasive technologies designed to deliver more precise diagnoses and better therapy guidance in Epilepsy, Stroke, TBI and more. Coupled with sophisticated computational modeling and artificial intelligence, existing diagnostic solutions will provide meaningful new insights that most likely will be the key to unlocking the potential of accurate patient-specific diagnosis and treatment.\n<br><br>\nAs a Senior Scientist in the Clinical Science team, he or she will be accountable to lead clinical and research specialists to acquire data at clinical sites, develop algorithms and numerical methods, carry out feasibility studies and help assure that activities are executed within expected scope, budget and timelines. The senior scientist in computer vision will play a key role to establish the growth of Philips Neuro and assure best-in-class software tools and seemless clinical workflow. Specifically, the leader will work closely with colleagues in Philips research teams, development teams, commercial teams, operations, and regulatory.\n\n\n<ul>\n<li>*Your responsibilities**</li>\n</ul>\n\nWithin this role you your responsibilities will include:\n<br><br>\n+ Create and validate meaningful innovation focused on forward and inverse modeling based on multi-modal data and state-of-the-art image processing and machine learning techniques aimed at improving accuracy, quality and efficiency of existing tools and clinical workflows.\n<br><br>\n+ Develop novel algorithms for functional mapping, connectivity analysis, and identification and localization of dynamic brain processes in HD EEG.\n<br><br>\n+ Develop and evaluate accuracy of finite difference, finite element, and boundary element methods with for source localization and characterization of electrophysiological activity in both cortical as well as subcortical structures in the human brain.\n<br><br>\n+ Design and implement solutions to facilitate intracranial EEG modeling and enable effective minimally invasive and non-invasive therapy.\n<br><br>\n+ Work with other cross functional teams, create functional policies and procedures to provide strong and efficient clinical feasibility analysis and development processes in the Philips environment.\n<br><br>\n+ Review, analyze, interpret and present clinical data both internally and externally.\n<br><br>\n+ Duties and responsibilities are not limited to the work listed above and may include other assignments as necessary.\n\n\n<ul>\n<li>*Your team**</li>\n</ul>\n\nPhilips Neuro was formed in 2017 within the Emerging Business group, which acts as a new business incubator inside of the larger Philips healthcare technology umbrella. We have a dedicated focus on driving innovation from scientific research. Our group has a separate product development team that will translate the research innovation work that Clinical Science delivers to meaningful product introductions, new market developments, and growth performance.\n<br><br>\nWe are a company that focuses on the people in the care cycle, patients, and care providers. We combine human insights and clinical expertise and we work to improve patient outcomes while lowering the burden on the healthcare system. Philips delivers advanced solutions for both health professionals, to meet the needs of patients, and empowered consumers for affordable healthcare whether in hospital or at home.\n\n\n<ul>\n<li>*We are looking for**</li>\n</ul>\n\nOur ideal candidate has extensive numerical methods and image processing experience combined with analytic and problem solving mindset, and has:\n<br><br>\n+ PhD in applied mathematics, biomedical engineering, computer science, applied physics, electrical engineering, machine learning, artificial intelligence, image analysis, or similar;\n<br><br>\n+ Flexible and open attitude, great communication skills in English\n<br><br>\n+ Self-starting capabilities and an entrepreneurial mindset\n<br><br>\n+ Preferably affinity with working in cross functional teams\n<br><br>\n<strong>+ Relevant experience with:</strong>\n<br><br>\n+ inverse problems, convex optimization, bayesian learning, graph signal processing, dynamic analysis, nonlinear dimensionality reduction, finite difference modeling, convolutional neural networks\n<br><br>\n+ imaging modalities including HD EEG, MRI (structural, dMRI, fMRI), CT, PET\n<br><br>\n+ computer vision, image processing, machine learning, object detection, feature extraction, pattern recognition, image registration and segmentation\n<br><br>\n+ statistical modeling and analysis\n<br><br>\n+ C++, ITK, VTK, Python, R, DICOM\n\n\n<ul>\n<li>*In return we offer you**</li>\n</ul>\n\nSharpen your talents with new challenges in our dynamic organization. As a market-driven company, we?re used to listening to our customers and apply the same thinking to our employees. We offer a competitive salary, outstanding benefits and flexibility in a career with a positive and supportive atmosphere in which to develop your talents further.\n<br><br>\nPhilips is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex (including pregnancy), sexual orientation, gender identity, national origin, genetic information, creed, citizenship, disability, protected veteran or marital status.\n<br><br>\nAs an equal opportunity employer, Philips is committed to a diverse workforce. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants that require accommodation in the job application process may contact 888-367-7223, option 5, for assistance.\n<br><br>\n<strong>\\#LI-PH1</strong>"}