{"job title": "Research Scientist", "company": "Rakuten", "city state": "– San Mateo", "rating": "2.5", "job description": "<div><div><div><div><div><p>Rakuten, Inc. is the largest ecommerce company\nin Japan, and third largest ecommerce marketplace worldwide. We seek to empower\nmerchants to deliver Omotenashi, a hospitality mindset, which helps sellers\ncreate lasting relationships with customers. Along with the global\nmarketplaces, Rakuten supports an ever expanding list of acquisitions and\nstrategic investments in disruptive industries and growing markets. </p>\n\n<div> </div>\n\n<p>Rakuten Institute of Technology is the R&amp;D\ndivision of the Rakuten group with locations in Tokyo, Boston, Paris,\nSingapore, and San Mateo. We provide critical solutions and develop exciting\nbusinesses or services by fundamental technologies such as machine learning,\nnatural language processing, computer vision, and information retrieval.</p>\n\n<div> </div>\n\n<p>As a <b>Research Scientist</b>, you will work closely\nwith engineers and the business team to improve various Rakuten services with\nmachine intelligence. You will utilize your experience in data mining, natural\nlanguage understanding, and computer vision to maximize customer satisfaction\nby implementing prototype solutions for existing products or launching new\nproducts. In addition, you will work closely with research communities by\njoining collaboration programs with universities, publishing papers, and\ncontributing open source release.</p>\n\n<div> </div>\n\n<div><b>Responsibilities: </b></div>\n\n<ul><li>Formulate a\nvision of the new internet services that would be realized in next 3 to 5 years\n</li><li>Work closely with\nbusiness team and engineers to create prototypes of new applications (or\nsolution) to contribute to Rakuten business</li><li>Participate in\ncutting edge research in machine intelligence and machine learning applications</li><li>Promote the\nresearch results and Rakuten brand by publishing papers, filing patents, and/or\ngiving presentations</li></ul>\n\n\n\n\n\n\n\n<div> </div>\n\n<div><b>Qualifications:</b></div>\n\n<ul><li>PhD degree in Computer Science or a\nrelated field, or at least one year of equivalent practical experience with a\nMaster degree (or PhD student for Internship positions) \u2028</li><li>Research experience in machine\nlearning or data mining</li><li>At least one academic publication at\npeer-reviewed international conferences or in journals </li><li>Solid programming experience in one or\nmore of the following: Java, Python, and/or C/C++ </li><li>Ability to work in a diverse team as\nwell as autonomously </li></ul>\n\n\n\n\n\n\n\n\n\n<div> </div>\n\n<p><b>Preferred\nSkills:</b></p>\n\n<ul><li>Experience with solving real-world\nmachine learning problems\u2028</li><li>Knowledge of Deep Learning, Neural\nNetworks, or related fields</li><li>Experience with large scale computing\nenvironment such as AWS, Hadoop, or Spark \u2028</li><li>Ability to pitch your work to business\npeople</li></ul><div><br></div>\n\n\n\n\n\n\n\n<div> </div>\n\n<p>Any\nunsolicited resumes/candidate profiles submitted through our website or to\npersonal email accounts of employees of Rakuten and any subsidiaries of Rakuten\nare considered property of Rakuten and any subsidiaries of Rakuten and are not\nsubject to payment of agency fees.</p>\n \n \n\n \n \n\n \n\n \n </div>\n </div>\n </div>\n\n \n </div>\n\t</div>"}