{"job title": "Environmental Scientist - Air Modeler", "company": "TerraGraphics", "city state": "– Pasco, WA", "rating": "4.0", "job description": "TerraGraphics Environmental Engineering, Inc. seeks qualified Environmental Scientist candidates for an air permitting and dispersion modeling position. The successful candidates will be self-motivated, organized, and detail-oriented individuals who can work well on a team and independently in a fast-paced environment. Qualified applicants to this position will be evaluated for full-time work based out of our Pasco office with work occurring at the DOE Hanford site.\n<br><br>\n<strong>Responsibilities Include:</strong>\n<br><br>\nProject work will involve providing environmental compliance and technical support as needed, in support of Hanford Site air operating permit requirements and a Hanford Site air emission program and modeling of near and far field air emissions.\n<br><br>\nOther potential tasks are:\n\n<ul>\n<li>Assist in development, revision, and review of Air Emission Permits</li>\n\n<li>Development and coordination of necessary information and data requested by regulatory agencies, and negotiation with agencies as needed</li>\n\n<li>Perform and document modeling of radioactive and non-radioactive air pollutants in the near field from vapor emissions resulting from the extension of stacks</li>\n\n<li>Develop, revise, and review calculations documenting radioactive air and vapor emissions and impacts in the near field</li>\n\n<li>Review and evaluate air emissions related data associated with stack sampling and monitoring, IH samples, near-facility air monitoring</li>\n</ul>\n<strong>Required Qualifications:</strong>\n\n<ul>\n<li> BS/BA in environmental science, engineering or closely related field</li>\n\n<li>1-10 years work experience relevant to federal and DOE air quality and permitting, RCRA, and waste management</li>\n\n<li>Effective written and verbal communication skills</li>\n\n<li>Strong technical writing skills</li>\n\n<li>Strong organizational skills and attention to detail</li>\n\n<li>Valid driver’s license with insurable driving record</li>\n</ul>\n<strong>Desired Qualifications:</strong>\n\n<ul>\n<li>Prior consulting experience</li>\n\n<li>Working experience with AERMOD dispersion modeling by Breeze software</li>\n\n<li>Strong working knowledge of Microsoft Office suite including Access, Excel, and Word</li>\n\n<li>Hanford Site experience</li>\n</ul>"}