{"job title": "Junior Software Engineer", "company": "BAE Systems", "city state": "– Wayne, New Jersey", "rating": "3.5", "job description": "<strong>Job Description</strong> \n<br><br>\nYou dont see it, but its there. Our employees work on the <strong>worlds most advanced electronics</strong>  from saving emissions in the City of Lights to powering the Mars Rover to protecting the F-35 fighter jet. At Electronic Systems, youll be among the brightest minds, working on the aerospace and defense industrys most difficult problems. <strong>Drawing strength from our differences</strong>, were innovating for the future. And you can, too.\n<br><br>\nOur <strong>flexible</strong> work environment provides you a chance to change the world without giving up your personal life. We put our customers first exemplified by our missions: We Protect Those Who Protect Us® and We Innovate For Those Who Move The WorldTM.\n<br><br>\nSound like a team you want to be a part of? Come build your career with us.\n<br><br>\nWe are looking for junior level candidates (December 2018 or May 2019 Masters Graduates) to join our ES Defense software engineering team here at BAE Systems, Inc. Junior level engineers are exposed to the full software life-cycle, from requirements development through integration and testing.\n<br><br>\nIn this exciting role, you will enjoy opportunities to take on diverse and challenging work assignments, flexible scheduling with every other Friday off, an inviting and supportive culture, competitive compensation, and an excellent benefits package that includes tuition reimbursement for advanced degrees.\n<br><br>\n<strong>Candidates will gain experience in:</strong>\n\n\n<ul>\n<li>Designing, developing and testing software solutions utilizing Agile methodologies and sound software engineering principles while conforming to existing code development strategies and processes</li>\n<li>Assisting in other software engineering activities such as integration testing, algorithm &amp; data analysis, software troubleshooting, and preparing documentation in accordance with established procedures.</li>\n<li>Utilizing either Windows PC or Linux based software development environment and either x86 or PowerPC target and test environment</li>\n</ul>\n\n<strong>Typical Education &amp; Experience</strong> \n<br><br>\nTypically a Bachelor's Degree and 2 years work experience or equivalent experience\n<br><br>\n<strong>Required Skills and Education</strong> \n\n<ul>\n<li>Masters degree in Computer Science, Computer Engineering, Electrical Engineering or similar</li><li>Must be proficient with C++ programming language</li> <li>Must be eligible for Secret security clearance</li>\n</ul>\n\n<strong>Preferred Skills and Education</strong> \n\n<ul>\n<li>Knowledge of hardware/software interfacing techniques</li><li>Familiarity with real time, concurrent programming techniques</li><li>Exposure to software design concepts including the use of the Unified Modeling Language (UML)</li><li>Secret security clearance is preferred, but can be obtained once started</li>\n</ul>\n\n<strong>About BAE Systems Electronic Systems</strong> \n<br><br>\nBAE Systems is a premier global defense and security company with approximately 90,000 employees delivering a full range of products and services for air, land and naval forces, as well as advanced electronics, security, information technology solutions and customer support and services.\n<br>\nThe Electronic Systems (ES) sector spans the commercial and defense electronics markets with a broad portfolio of mission-critical electronic systems, including flight and engine controls; electronic warfare and night vision systems; surveillance and reconnaissance sensors; secure networked communications equipment; geospatial imagery intelligence products and systems; mission management; and power-and energy-management systems. Headquartered in Nashua, New Hampshire, ES employs approximately 13,000 people globally, with engineering and manufacturing functions primarily in the United States, United Kingdom, and Israel. Equal Opportunity Employer/Females/Minorities/Veterans/Disabled/Sexual Orientation/Gender Identity/Gender Expression"}