{"job title": "Software Engineer Sr.", "company": "BAE Systems", "city state": "– Hill AFB, Utah", "rating": "3.5", "job description": "<strong>Job Description</strong><br><br>We are seeking a full time software engineer to support the design, development and review of software for the USAF Intercontinental Ballistic Missile (ICBM) Program in support of the ICBM Sustainment Construct (ISC). This contract will assist in the acquisition and technical sustainment engineering and help train and develop this capability in the government. This contract will augment organic resources by providing breadth and depth of capabilities for system engineering and integration, risk management, technical assessment, acquisition program management, strategy development, organization and change management, interface with operations and logistics, business analysis, mission effectiveness and ICBM demonstration/validation integrated applications programs.\n<br><br>\nPosition will be located at Hill AFB, UT.\n<br>\nThis role will provide software engineering services.\n<br>\n<strong>Responsibilities include:</strong>\n\n\n<ul>\n<li>Assists in the development and allocation of software requirements. May develop software requirements, evaluate the impact of requirements changes, lead others, and collaborate/support government customers in these tasks.</li>\n<li>May develop software design and design documentation.</li>\n<li>Reviews and prepares documentation for complex software designs in accordance with established software development processes and procedures. May run tests, evaluate results, debug defects, or lead others in these tasks. May participate in planning and conducting verification or validation activities.</li>\n<li>Verifies complex software designs to ensure conformance with functional specifications and customer requirements. May run or participate in work product reviews, inspections and tests.</li>\n<li>Estimates software level of effort and schedules by reviewing statements of work for new and revised projects.</li>\n<li>May assist in preparation/review of proposals, presentations, risks, technical order (TO) changes, safety review briefings, program protection plans and government engineering board briefings.<br><br><strong>Typical Education &amp; Experience</strong> </li>\n</ul>\n\nTypically a Bachelor's Degree and 2 years work experience or equivalent experience\n<br><br>\n<strong>Required Skills and Education</strong><br><br>Required Education: BS/MS in Software Engineering, Computer Science, Information Technologies, Data Processing, Electrical Engineering, Electronic Engineering, Physics, or Mathematics. 3yrs of directly related experience (2 years with an MS Degree).\n<br><br>\nCandidate must possess strong oral/written communications skills. The successful candidate will have the ability to work independently or as a member of a group effort and will be able to work well in Government/contractor teams.\n<br><br>\nEligible candidates must be able to acquire a security clearance.<br><br><strong>Preferred Skills and Education</strong><br><br>Understanding of several areas of ICBM system software programs and/or sustainment efforts. Familiarity with software nuclear safety cross check analysis (NSSCA), performance analysis and technical evaluation (PATE) and independent verification and validation (IV&amp;V) analysis processes. This includes the detailed analysis and testing of software to verify that program and safety requirements are correctly implemented. This job requires skills in test plan development, requirements analysis, system testing and identifying and troubleshooting of discrepancies. Knowledge of computer software architecture and design practices and experience with embedded software will be required.\n<br><br>\nExperience with embedded weapon systems, particularly ICBM missiles or programs. Previously provided level of effort, scheduling, code conversion and/or rehost estimates. Experience in Systems Engineering. Knowledge of PC based software support tools in JAVA, JAVASCRIPT, PHP, Visual Basic, Python, FORTRAN, and/or C/C++ is desirable.\n<br><br>\nThe ideal candidate will possess or be able to obtain a Top Secret clearance.<br><br><strong>About BAE Systems Intelligence &amp; Security</strong> \n<br><br>\nBAE Systems is a premier global defense and security company with approximately 90,000 employees delivering a full range of products and services for air, land and naval forces, as well as advanced electronics, security, information technology solutions and customer support and services. Information Solutions, based in Reston, Virginia, is among the 10 largest IT providers to the U.S. government, serving most of the federal defense and civilian marketplace. It provides network-centric command, control, computing, and intelligence (C3I) solutions; wideband networking radio systems; information systems for the U.S. intelligence community; geospatial information services; and information technology services. Leveraging its knowledge of signals and data derived from signals, Information Solutions has attained a market-leading position in advanced information technology research, intelligence analysis and production, and geospatial exploitation software. People are the greatest asset in any Company ... BAE Systems is committed to a high performance culture and provides an environment that challenges our employees to be remarkable and obtain their full potential. Equal Opportunity Employer. Females. Minorities. Veterans. Disabled."}