{"job title": "Associate DevOps Engineer", "company": "Boomtown (South Carolina)", "city state": "– Charleston, SC", "rating": "4.3", "job description": "<div><div>BoomTown is looking for an Associate DevOps Engineer with a passion for cloud computing, infrastructure as code and maintaining highly available web applications. The DevOps Engineer will work closely with our software development team in Charleston, SC to ensure developers have the deployment tools needed to ship code with ease.</div><br>\n<div>The DevOps Engineer will be responsible for helping further the automation of the building, deployment, and monitoring of all production systems and applications as well as supporting the software development environment.</div> <br>\n<div>We are looking for an individual who is comfortable working in a 24/7 production environment. The DevOps Engineer will be a member of a small and critical technical operations team.</div></div><div><div>You will:\n\n<ul>\n\n\n<ul>\n<li>Assist in designing, provisioning, maintaining, and scaling custom solutions for deployments, monitoring, orchestration, and provisioning.</li> <li>Work closely with Amazon Web Services and Rackspace cloud environments.</li><li>Analyze and resolve problems associated with key infrastructure components including servers, databases, CI tools, applications, and software.</li><li>Partner with dev teams to provide operational environment expertise.</li><li>Be responsible for maintaining highly performant, stable, and scalable environments.</li></ul>\n</ul>\n\n</div>\n<br>\n<div><div>You have:\n\n<ul>\n\n\n<ul>\n<li>Intermediate programming/scripting language skills (Bash, Ruby, Python, Go, Powershell, etc.).</li><li>Some knowledge of Linux/Unix (RHEL, Ubuntu, Amazon Linux) or Windows Server.</li><li>Working knowledge of Subversion, BitBucket, Git or other version control tools.</li><li>The ability to independently research solutions to technical issues.</li><li>The ability to document technical solutions.</li></ul>\n</ul>\n\n</div>\n<br>\n<div><div>We'd be impressed if you had:\n\n<ul>\n\n\n<ul>\n<li>Experience with orchestration and configuration management tools like Jenkins, Ansible Tower, Chef, Puppet.</li><li>Experience with SQL (especially MS SQL Server), MongoDB, DynamoDB, Redshift, Cassandra.</li><li>Experience with monitoring tools (New Relic, Data Dog, Cloud Watch)</li><li>Experience with Microsoft .Net programming.</li><li>Experience with networking, DNS, subnetting, load balancing.</li><li>Knowledge of one or more hypervisor products (VMware ESX, Xen, HyperV, etc.).</li></ul>\n</ul>\n\n</div>\n</div><div><div><strong>What is BoomTown, you ask?</strong></div><br>\n<div>The top real estate brokerages trust us to help them close more deals and grow their business. They love helping people find their way home and we love helping them do it.</div><br>\n<div>You can't expect different results if you work like every other company. At BoomTown we’re not driven by projects, we’re driven by solutions. We share a hunger to do something that matters and we imagine, develop, design, and create exceptional products that solve our clients’ problems and help them grow their businesses.</div><br>\n<div><strong>Life at BoomTown</strong></div><br>\n<div>Our philosophy can be summed up fairly succinctly - we create powerful, yet simple software to drive our clients’ business outcomes. We’re truly passionate about our clients; and we’re focused on designing innovative solutions for their complex needs that make a difference in their lives. Simply put, we work hard to create inspired solutions that people love to use.</div><br>\n<div><strong>BoomTown offers you:</strong></div><br>\n<div>Growth potential and ability to lead change</div><div>Company leadership that believes in flexibility, freedom, and innovation</div><div>Challenging, motivating, fun and dog-friendly work environment</div><div>Company culture that is guided by our core values that thrives on passion and innovation</div><div>Agile product management methodologies with minimal process overhead</div></div><div>Apply for this job</div></div></div>"}