{"job title": "Manager of Digital Data &amp; Analytics", "company": "Chattem", "city state": "– Chattanooga, TN", "rating": "3.7", "job description": "<strong>Job Title:</strong> Manager of Digital Data &amp; Analytics\n<br><br>\n<strong>Reports To:</strong> CHC Head of Digital Marketing\n<br><br>\n<strong>Department:</strong> Marketing\n<br><br>\n<strong>Location:</strong> Headquarters, Chattanooga TN\n<br><br>\n<strong>Job Summary</strong>\n<br><br>\nThis role sits within the CHC Country Marketing function and reports into the CHC Head of Digital Marketing Transformation.\n<br><br>\nThe mission of the Manager of Digital Data &amp; Analytics is to bring rigorous analytical measurement to digital marketing campaigns to enable:\n\n<ul>\n<li> Development of best-in-class digital consumer insights to inform cross-brand digital marketing strategy, design, and execution</li>\n\n<li> Understanding of campaign performance against key KPIs, development of sustainable learnings</li>\n\n<li> Ongoing optimization of in-flight digital marketing campaigns to maximize business impact</li> \n</ul>\nThe Manager Digital Data &amp; Analytics is responsible for setting and managing the measurement of key KPIs for media execution across digital campaigns. Working closely with internal and external stakeholders, this role will play a critical role in engaging with internal brand marketing teams to enable the selection and execution of measurement methodologies aligned with brand marketing objectives and strategies.\n<br><br>\n<strong>Role Specific Responsibilities</strong><ul>\n<li>Provide measurement and analytical support to brand marketing teams for digital marketing campaigns, across assigned categories and brands</li>\n\n<li>Document learnings and educate broader organization as a player coach on precision marketing tactics to reinforce data-driven culture</li>\n\n<li>Partner with agency stakeholders to gain access to key reporting systems, define analytical approaches, and share insights as inputs to drive best in class media planning and campaign development </li>\n</ul>\nData\n\n<ul>\n<li>Assess performance of audience targeting approaches to inform development of an analytically driven data strategy to maximize campaign performance</li>\n\n<li>Establish data partnerships with high-value vendors to grow data pool aligned with high value targets</li>\n\n<li>Work hand-in-hand with brand marketing teams to translate existing consumer segmentation into a playbook of proven digital data sources to activate data-driven channels</li>\n\n<li>Manage performance keywords on search to grow and refine search strategy</li>\n</ul>\nMeasurement\n\n<ul>\n<li>Work alongside internal, external stakeholders to define key success KPIs for digital marketing campaigns</li>\n\n<li>Analyze data performance across campaigns and support their optimization to drive performance</li>\n\n<li>Support measurement design &amp; analytics on test and learn pilots</li>\n\n<li>Analyze sales and media data to connect performance of media campaigns to sales input</li>\n\n<li>Utilize digital analytic platforms to generate actionable marketing insights</li>\n</ul>\nInsight\n\n<ul>\n<li>Utilize digital learnings to refine consumer digital strategy and consumer segmentation, working closely with brand marketing teams to activate these insights on future campaigns</li>\n\n<li>Utilize analysis and consumer insight to help brand marketing teams define best-in-class digital journeys / touchpoints across brands / categories</li>\n\n<li>Generate data-based insights to inform asset and content creation/ management</li>\n\n<li> Document learnings and educate broader organization on data tactics to reinforce data-driven culture</li>\n</ul>\n<strong>Behavioral Competencies</strong>\n\n<ul>\n<li> Act for Change</li>\n\n<li> Commit to Customers</li>\n\n<li> Think Strategically</li>\n\n<li> Strive for Results</li>\n\n<li> Make Decisions</li>\n\n<li> Drive Results</li>\n\n<li> Collaborate Transversally</li> \n</ul>\nThis description is representative but not inclusive of all position responsibilities. Associate may be asked from time to time to complete tasks not listed within the contents of this document, but that are relative to the goals of the business.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n<strong>Education</strong>: Bachelors degree in Quantitative Field (e.g. statistics, engineering, quantitative finance, or computer science) from an accredited college required.\n<br><br>\n<strong>Experience</strong><strong>:</strong> The ideal candidate will have 3-5 years of experience in one of the below functions/companies\n\n<ul>\n<li> Analytical function for an ad-tech company (e.g. Google Double Click, Turn, TubeMogul, FaceBook, TheTradeDesk)</li>\n\n<li> Digital consultancy (e.g. Accenture Digital, Deloitte Digital, PwC Digital)</li>\n\n<li> Digital specialists from a prominent boutique performance agency (e.g. performance digital marketing agency)</li>\n</ul>\nDirect experience with key Ad Tech platforms such as Adwords, Google Analytics, Google DoubleClick, Facebook Power Editor, Demand Side Platforms (DSPs), and DMPs; and view ability platforms (e.g. MOAT).\n<br><br>\n<strong>Professional Skills:</strong> Knowledge of digital lead generation and brand building techniques using Search, Social and Programmatic (e.g. Targeting, content and creatives for programmatic and Social, SEO and SEM). Certification in or extensive hands-n experience with Direct experience with key Ad Tech platforms such as AdWords, Google Analytics, Demand Side Platforms (DSP), and DMPs. Must have a demonstrated proficiency in Microsoft business software to include Excel, PowerPoint, Word, and Outlook. Strong written and verbal communication skills.\n<br><br>\n<strong>Role Specific Competencies:</strong> Deep expertise optimizing programmatic campaigns (strong command of mix, site, pacing, bid, view ability optimization methodologies). Deep expertise in ad targeting methodologies across digital platforms. Ability to form and test hypotheses and continuously iterate to drive efficiencies, effectiveness. Modeling expertise measuring the business impact of digital (e.g. MMM, closed loop studies, geographic and pacing variability modeling). Proficiency with data analytics tools such as Alteryx, SQL. Special Requirements: Position is based in Chattanooga, Tennessee at Sanofi CHCs corporate office. This position requires the ability to travel.\n<br><br>\n<strong>Regulatory Compliance</strong>\n<br><br>\n<strong>American with Disabilities Act</strong>\n<br><br>\nThe company recognizes its responsibility to ensure that all qualified candidates (defined as individuals who can perform all essential job functions), are considered equally for employment and is prepared to make reasonable accommodations to ensure that disabled employees or candidates are not disadvantaged in the candidate selection process.\n<br><br>\n<strong>Civil Rights Act of 1964 Title VII</strong>\n<br><br>\nThe company recognizes its responsibility to ensure that all qualified candidates receive equal employment opportunity in the role regardless of race, color, religion, gender, sexual orientation, age or national origin.\n<br><br>\n<strong>Fair Labor Standards Act (as amended in 2004)</strong>\n<br><br>\nThis role has been classified as exempt from consideration under current FLSA overtime requirements.\n<br><br>\n<strong>Relocation</strong>\n<br><br>\nRelocation assistance is provided"}