{"job title": "Commodity Engineer", "company": "General Dynamics Mission Systems", "city state": "– USA--AZ-Scottsdale", "rating": "3.6", "job description": "<div><div>\n<div>\n<p>Bachelor's degree in Electrical Engineering, a related specialized area or field in the area of passive component design, processes and fabrication from a manufacturer's perspective is required (or equivalent experience) plus a minimum of 5 years of relevant experience; or Master's degree plus a minimum of 3 years of relevant experience.</p><p> </p><p> </p>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\nResponsibilities for this Position\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<p>GDMS has an immediate opening for a Component Engineer with Passives Commodity Engineering Specialty. This position provides an opportunity to further advance the cutting-edge technology that supports some of our nation’s core defense/intelligence services and systems. GDMS employees work closely with esteemed customers to develop solutions that allow them to carry out high-stakes national security missions.</p><p> </p><p><strong>REPRESENTATIVE DUTIES AND TASKS:</strong><br>Seeking an experienced engineer with experience in the design, fabrication, processes inspection and testing processes for passive components (including resistors, capacitors, inductive devices). The candidate will perform inspection and auditing/surveillance services to monitor manufacturing and quality processes at our various commercial passives electronics and contract manufacturers and to approve manufactured items completed and presented for General Dynamics for buyoff. Involves working closely with project eCAD design teams to review schematic drawings/files with the expectation to provide technical feedback and design guideline rules to meet the space and military parts control plan requirements. The candidate will work closely with Supply Chain Buyers, QA and Suppliers to manage suppliers from a technical perspective and to ensure compliance of the passives components to the flow down requirements through supplier visits, audits and technical interchanges. Job requires travel to suppliers and possibly customer facilities. Candidate will need strong communications skills as well as technical experience and knowledge. <br><br><strong>KNOWLEDGE SKILLS AND ABILITIES:</strong><br>• As a Commodity Engineer you will use your formal experience to help designers select passive components to meet the electrical design requirements, derating analysis, test recommendations, quality level, foot print restraints, and</p><p> general workmanship to the requirements<br>• As you take direction from General Dynamic’s quality assurance department, you will interface with designated points of contact at manufacturers of passives components and 3rd party contract manufacturers and suppliers for</p><p> custom magnetics and sub-assemblies. Utilizing your expertise, you will compare the products with released engineering drawings, purchase orders and other contractual requirements as specified by operations<br>• Participates in supplier quality and capability audits and works closely with suppliers to identify and resolve technical issues that adversely impact quality and reliability of supplier products, along with certifying of new and existing</p><p> suppliers<br>• Provides Supply Chain Management organization technical guidance to ensure that parts being procured match supplier capability and ensures that supplier quoted costs are reasonable based on technology, customization and </p><p> required screening/testing <br>• Initiate and address corrective and preventive actions when non-conformances are noted in General Dynamics products or the processes used to produce General Dynamics products<br>• Analyzes engineering-design concepts of product to recommend part-level quality and test methods for attaining customer-specified system-level operational requirements, using knowledge of component construction and</p><p> manufacturing/test processes<br>• Reviews New Part Requests and creates/validates part information using product life-cycle tools such as Part Database Management Link<br>• Supports part-level failure analysis and root cause analysis and working with suppliers/projects to identify corrective action and recovery plans<br>• Participates in the development of Parts Procurement Drawings<br>• Participates in a Failure Review Board as a team member and technical expert on part construction and failure modes<br>• Participates in parts stress analysis/worst case analysis efforts<br>• Supports Incoming Inspection by performing data reviews for high reliability parts to in accordance with Part Control and Quality Management Plans<br>• Estimate support by developing parametric cost models for various methods of manufacturing. This requires a thorough understanding of the steps required to manufacture various types of passive parts<br>• Reviews Government-Industry Data Exchange Program documentation and provides recommendations to programs<br>• Work closely with Project Leaders, Electrical/Mechanical Engineers and with other professionals within the project teams <br>• Occasional contact with business development functions including proposal estimating support<br>• Travel may be required<br><br><br><strong>PREFERRED DEGREE TYPES AND EXPERIENCE:</strong></p><p><br>PREFERRED DEGREE TYPES AND EXPERIENCE:</p><p>Bachelor's degree in Electrical Engineering, a related specialized area or field in the area of passive component design, processes and fabrication from a manufacturer's perspective is required (or equivalent experience) plus a minimum of 8 years of relevant experience; or Master's degree plus a minimum of 6 years of relevant experience</p><p> </p><p>CLEARANCE REQUIREMENTS:</p><p>Department of Defense security clearance is not required at time of hire, but may be required at a later date. Applicants selected will be subject to a U.S. Government security investigation and must meet eligibility requirements for access to classified information. Due to the nature of work performed within our facilities, U.S. citizenship is required.</p><p> </p>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\nCompany Overview\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<p>General Dynamics Mission Systems (GDMS) engineers a diverse portfolio of high technology solutions, products and services that enable customers to successfully execute missions across all domains of operation. With a global team of 13,000+ top professionals, we partner with the best in industry to expand the bounds of innovation in the defense and scientific arenas. Given the nature of our work and who we are, we value trust, honesty, alignment and transparency. We offer highly competitive benefits and pride ourselves in being a great place to work with a shared sense of purpose. You will also enjoy a flexible work environment where contributions are recognized and rewarded. If who we are and what we do resonates with you, we invite you to join our high performance team!</p><p> </p><p>General Dynamics is an Equal Opportunity/Affirmative Action Employer that is committed to hiring a diverse and talented workforce. EOE/Disability/Veteran</p>\n\n</div>\n</div>\n</div><b><br></b>"}