{"job title": "Waterfront Engineer/Project Manager", "company": "GZA GeoEnvironmental", "city state": "– Providence, RI", "rating": "3.8", "job description": "GZA GeoEnvironmental, Inc. (GZA) is currently seeking a motivated <strong>Marine Structural Engineer/Project Manager</strong> to support our marine/waterfront practice in <strong>Providence, Rhode Island</strong> and other New England offices. The successful candidate will be versatile, having an interest in both the structural and geotechnical aspects of waterfront facility design. They will also have a desire to become involved in project management and the advancement of client relationships. A strong technical background and a professional demeanor will be required. Starting position will be based upon the candidate’s education and experience. Advancement will be dependent only upon the candidate’s abilities, initiative and ambition.\n<br><br>\nAs a <strong>Marine Structural Engineer/Project Manager</strong>, you will work on a wide variety of civil and marine geo-structural engineering projects, assisted by a dedicated team of engineers, managers and principals. Our close-knit culture here at GZA will allow you to apply your expertise and diversify your skill set by participating in challenging projects. You will be mentored by seasoned professional engineers, who in turn will look to you to mentor other members of the design team by sharing your technical knowledge and ideas. Our success relies on this collaborative environment.\n<br><br>\nInitially, your prime responsibilities will be technical. Secondary responsibilities will include assisting senior project managers with team coordination and client communication. As you gain experience, your responsibility for representing GZA with clients throughout proposal, contract, and project performance phases will increase. In time, you will be responsible for day to day execution of all technical and financial aspects of each project and will be involved with marketing activities and networking events as well as the development and mentoring of staff.\n<br>\n<strong><u>Primary Responsibilities</u></strong>\n\n\n<ul>\n\n\t<li>Performing engineering analyses/calculations in connection with the design and construction of piers, bulkheads, mooring structures, and deep and shallow foundations</li>\n\n<li>Performing condition surveys and assessments of existing waterfront structures</li>\n\n<li>Evaluating field data and writing and organizing field and engineering reports, technical specifications, and other technical documents</li> \n\n<li>Conducting technical analyses/calculations including berthing and mooring analyses, slope stability, and seismic analyses</li>\n\n<li>Supporting production of construction drawings and preparation of bid documents</li>\n\n<li>Monitoring in-situ and foundation tests in connection with waterfront, building and infrastructure projects</li>\n\n<li>Monitoring and documenting geotechnical and structural aspects of construction projects</li> \n\n<li>Working on multidisciplinary project teams</li>\n\n<li>Communicating effectively and efficiently with contractors, clients and team members</li>\n\n<li>Completion of 10-hour Construction Course, 40-hour OSHA HAZWOPER training, and obtaining a TSA TWIC card will be required</li> \n</ul>\n\n<strong><div><u>Goals:</u></div>\n\n<br></strong>\n\n\n<ul>\n\n\t<li>Completing various Marine/Structural Analyses and Design</li>\n\n<li>Managing project team, delegating to office and field staff, and executing day to day activities of projects</li>\n\n<li>Conducting internal and client communications</li>\n\n<li>Monitoring team performance for compliance with contractual agreements and budgets</li>\n\n<li>Managing and mentoring GZA existing staff of project-level engineers</li>\n\n<li>P.E. registration (if not already attained)</li> \n</ul>\n\n<div><strong><u>Qualifications</u></strong></div>\n\n\n<ul>\n\n\t<li>Bachelor’s Degree in Civil Engineering (Master’s Degree specializing in Structural Engineering a plus)</li>\n\n<li>P.E. preferred, but not required. Candidate will be expected to become registered.</li> \n\n<li>4+ years of structural engineering or related experience with knowledge of applicable codes and regulations</li>\n\n<li>Self-starter able to work independently and as part of a team</li>\n\n<li>Ability to perform and manage field tasks and activities</li>\n\n<li>Demonstrate professional judgment, consistency, and strong attention to detail</li>\n\n<li>Demonstrate performance of analysis, problem solving and strong organizational skills</li>\n\n<li>Strong oral and written communication skills</li>\n\n<li>Experience in the northeastern United States or similar climate is preferred</li>\n\n<li>Out of town travel may be expected. Candidate must have consistent means of transportation to/from project sites.</li>\n</ul>\n\nGZA GeoEnvironmental, Inc. is an Affirmative/Equal Opportunity Employer and does not discriminate on the basis of race, color, religion, national origin, ancestry, sex, sexual orientation, physical or mental disability, citizenship status, marital or veteran status, age or other protected status."}