{"job title": "Civil/Geotechnical Engineer", "company": "GZA GeoEnvironmental", "city state": "– Waukesha, WI", "rating": "3.8", "job description": "GZA GeoEnvironmental, Inc. (GZA) is looking for a motivated <strong>Civil/Geotechnical Engineer</strong> to join our site development, building foundations, and pavement design group. As a <strong>Civil/Geotechnical Engineer</strong>, you will bring your expertise and unique solutions to highly visible and challenging projects. You will also work in a fast-paced team of Project Managers, Principals, and other Engineers. Our close-knit culture here at GZA will allow you to grow professionally. You will be mentored by seasoned professionals, who will in turn look to you to share technical knowledge and ideas. Our success relies on this collaborative environment. If you have a strong academic record, solid understanding of civil engineering principles with a geotechnical focus, strong communication skills, and a desire to work in site development with complex engineering challenges, please apply today!\n<br><br>\n<strong>Key Duties:</strong>\n\n\n<ul>\n\n\t<li>Conducting geotechnical fieldwork including soil boring advancement and analysis, monitoring well installation and sampling, instrumentation installations, and performing construction monitoring for site development.</li>\n\n<li>Data gathering, organization and interpretation of subsurface conditions in support of site development.</li>\n\n<li>Executing engineering analyses, under the direction of a senior engineer, including foundation, footing, pavement, and infrastructure design, differential settlement, and construction support.</li>\n\n<li>Writing drafts of field reports, inspection/engineering reports, technical specifications, and permitting applications.</li>\n\n<li>Preparing construction plans.</li>\n\n<li>Performing cost/quantity estimates and project scheduling.</li>\n\n<li>Communicating effectively and efficiently with contractors, clients, and team members.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n\n\t<li>Bachelor’s degree in Civil Engineering is required. Master’s degree in Civil Engineering with a geotechnical focus is preferred.</li>\n\n<li>3+ years of relevant work experience.</li>\n\n<li>Strong oral and written communication skills, problem solving, and organizational skills.</li>\n\n<li>Strong Microsoft Office and AutoCAD skills required; ArcMap proficiency is preferred.</li>\n\n<li>Experience or academic training with geotechnical computer software such as A-Pile, GRL WEAP, L-Pile, P-Y Wall, SEEP/W and SLOPE/W are preferred.</li>\n\n<li>Occasional out-of-town travel will be required. Candidate must have consistent means of transportation to/from project sites.</li>\n</ul>\n\nGZA GeoEnvironmental, Inc. is an Affirmative/Equal Opportunity Employer and does not discriminate on the basis of race, color, religion, national origin, ancestry, sex, sexual orientation, physical or mental disability, citizenship status, marital or veteran status, age or other protected status."}