{"job title": "Software Engineer - Product Development", "company": "Impaq International", "city state": "– US-MD-Columbia", "rating": "3.7", "job description": "Overview<br><br>IMPAQ International, a growing and dynamic social science research firm, provides high-quality research and impact evaluation services, policy analysis, survey research, technology solutions, organizational development, technical assistance and consulting services to U.S. and international government agencies, foundations, and the private sector. IMPAQ’s mission is to bring together exceptional people to develop innovative and rigorous approaches to evaluate the real-world impact of social policies and programs. IMPAQ offers five locations: our Corporate Headquarters in Columbia, Maryland, rated one of America’s Best Small Cities; Downtown Washington, D.C., Boston, Massachusetts, a Bay Area office in Oakland, California and Seattle, Washington. IMPAQ has a diverse and collegial work environment and is an Equal Opportunity/Affirmative Action Employer (M/F/Disability/Veterans).\n<br><br>\nIMPAQ Health is seeking a full-time Software Engineer to develop software for our ASCEND family of products. You will be responsible for the development of digital products incorporating mobile platforms, big data, collaboration, data capture, advanced analytics, messaging, and other technologies as identified. Your skills won’t become out of date while working with the latest technologies at IMPAQ Health.<br><br>Responsibilities\n\n\n<ul>\n\n <li>Participate and lead in the design, development, integration, and testing of new software and provide enhancements to existing software</li>\n<li>Conduct technical trade-off studies and research efforts</li>\n<li>Participate in requirements analysis</li>\n<li>Work with other members of the team to generate creative and innovative solutions</li>\n<li>Participate in performance analysis and performance improvement efforts</li>\n<li>Continue developing your technical skillset as aligned with your career goals</li>\n<li>Ability to engage in some travel (~10%) to support clients</li>\n</ul>\n\nQualifications<br><br><strong>Knowledge and Experience</strong>\n\n<ul>\n\n <li>4-6 years developing software programs in a highly technical environment</li>\n<li>Proficiency with languages such as HTML5, CSS, XML, JSON, Python, PHP, JavaScript, Ruby, C#, etc.</li>\n<li>Knowledge of software design patterns, refactoring, and software best practices</li>\n<li>Dynamic knowledge of the development process, and experience with aspects like requirements analysis, development, installation, integration, evaluation, enhancement, maintenance, testing, and problem diagnosis/resolution</li>\n<li>Experience with agile development tools and team development projects</li>\n<li>Experience with MySQL, SQL Server, Oracle or other relational databases</li>\n<li>Experience with JavaScript run-time environments (e.g., Node.js) is desirable</li>\n<li>Experience with JavaScript libraries (e.g., JQuery, React, Bootstrap, D3, etc.) is desirable</li>\n<li>Experience with Amazon Web Services (AWS) is desirable</li>\n<li>Experience with predictive analytics and machine learning is desirable</li>\n<li>Experience with cloud technologies such as MapReduce and Spark, as well as cloud data management tools such as Hadoop, Accumulo, or Cassandra is desirable</li>\n<li>Familiarity with health informatics and coding standards including ICD9, ICD10, CPT, LOINC and HL7 documents is a plus</li>\n</ul>\n<strong>Skills</strong>\n\n<ul>\n\n <li>Strong oral and written communication skills</li>\n<li>Outstanding customer-focused support and professional communication</li>\n<li>Ability to work across multiple projects simultaneously</li>\n<li>Ability to learn quickly and work in a collaborative team environment</li> \n\n<li>A desire to learn new skills and keep up with the changing environment</li>\n</ul>\n<strong>Education</strong>\n\n<ul>\n\n <li>Bachelor’s Degree in Computer Science, Software Engineer, or a related field required</li>\n</ul>\nIMPAQ International, LLC is an Equal Opportunity/Affirmative Action Employer (M/F/D/V)."}