{"job title": "Software Development Engineer in Test (SDET), Informatica Cloud Platform", "company": "Informatica", "city state": "– Redwood City, CA", "rating": "4.1", "job description": "<strong>Software Development Engineer in Test, Informatica Cloud Platform</strong>\n<br><br>\n<strong>Our Company</strong>\n<br><br>\nInformatica Corporation is the worlds number one independent provider of data integration software. Thousands of enterprises worldwide depend on Informatica data integration, data quality, and big data solutions to access, integrate, and trust their information assets residing on premise and in the Cloud.\n<br><br>\n<strong>Our Team</strong>\n<br><br>\nThe Informatica Cloud team is responsible for ensuring high quality, including performance and scalability of Informatica Cloud products. Engineers in the team are responsible for initiating and developing test cases, managing documents, participating in reviews, running and reporting issues, and automating the cases.\n<br><br>\n<strong>Your Opportunity</strong>\n<br><br>\nYou will participate in the testing effort of Informatica Cloud Platform and Applications. You will test and critique software components and interfaces in great technical depth. Your opinion will be sought out by product managers on many upcoming features. You will also help your immediate manager to evaluate risk factors in upcoming releases. You will develop test programs to ensure high product quality, and develop advanced test tools to increase productivity and efficiency. There will be many opportunities to interact directly with Sales and Marketing groups and Customer support to understand market needs and incorporate those into product verifications.\n<br><br>\n<strong>Our Ideal Candidate</strong> You are a self-motivated professional who demonstrates the ability to quickly grasp new technologies, products, and use cases. You are bright and intellectually curious; deal with concepts and complexity comfortably; are capable, adaptable and agile. The team crosses continents, and as such, communication in all forms is essential to success in this role. You will be expected to demonstrate an excellent working knowledge of Java Programming, developing test applications or automating using JUnit/TestNG. The ideal candidate will have had experience in QA and has a good handle on scripting and SQL.\n<br><br>\n<strong>Your Responsibilities</strong>\n<ul>\n<li>Participate in product functional reviews, test specifications, documentation review of Informatica Cloud product, one of the fastest growing integration products</li><li>Collaborate effectively with peer engineers and architects to solve complex problems spanning their respective areas to deliver end-to-end quality in our technology and customer experience</li><li>Design, develop and maintain test cases in JUnit/TestNG</li> <li>Execute test cases and analyze and report test results to product teams</li> <li>Participate actively in functional, system and regression testing activities</li><li>Work closely with the development team to analyze, debug and resolve any issues</li><li>Design and develop test plans; test cases based upon functional and design specifications</li><li>Influence development managers to insure appropriate levels of quality on owned technologies</li> <li>Influence and communicate effectively with non-technical audiences including senior product and business management</li><li>Estimate and perform risk analysis for large features</li> <li><strong>Your Qualifications</strong></li></ul>\n\n<ul>\n<li>3 + years of experience in testing or development using C++ or Java</li><li>Experience in developing test cases by using Junit/TestNG/Selenium is a must</li><li>Backend automation with tools such Eclipse, Maven (projects management), Java, REST-based framework</li> <li>Knowledge in Informatica Cloud Application Integration with strong experience in testing on-premises to cloud migration, real-time data integration, process orchestration, real-time / B2B application integration</li><li>Knowledge in testing Micro Service architecture in Sizing, resiliency, rolling deployment/upgrade</li><li>Cloud technologies with experience in AWS /AZURE</li><li>Knowledge on Chef deployment scripting is a must</li><li>Connectivity testing with Ego Systems is essential with Salesforce, SAP, NetSuite, OData, Marketo, Workday</li> <li>Experience in using JMeter is an added plus</li><li>Strong knowledge in RDBMS and experience writing SQL scripts</li><li>Strong working knowledge in Unix/Windows Operating system; any scripting language is a must</li><li>Excellent problem solving, analytical skills and technical troubleshooting skills</li><li>Clarity and precision in verbal and written communication</li><li>Familiarity with software development life cycles and agile programming methodologies</li><li>BS in Computer Science, Computer Engineering or similar technical degree; advanced degree a plus</li> <li>Informatica offers a competitive compensation package that includes base salary, medical, retirement and employee stock purchase (ESP) programs, flexible time off and more. Our generous benefits vary depending on your geographic work location. Its an exciting time to work at Informatica. You can learn more about our company, our products and our services at www.informatica.com. We are an Equal Opportunity Employer (EOE).</li>\n</ul>"}