{"job title": "Signal Processing/Radar Engineer", "company": "Integrity Applications", "city state": "– Beavercreek, OH", "rating": "4.4", "job description": "<div><div> <strong>Signal Processing/Radar Engineer</strong>\n<br><br>\nIntegrity Applications is the recipient of multiple “Best Place to Work” awards, including being recognized by Washingtonian Magazine, as well as more recently, The Best Place to Work Award, Dayton Business Journal 2016 and 2017, as well as finalists for Dayton’s Better Business Bureau’s Integrity Eclipse Award for 2016 and 2017. IAI is also the recipient of the DoD’s Patriotic Employer Award, for its support to the Ohio Guard and Reserve. We are always looking for bright, innovative and talented people to join our team of highly skilled professionals. IAI offers challenging work, competitive salaries, an incentive bonus program and one of the most competitive health and welfare benefits packages in the Dayton region for you and your family.\n<br><br>\nThe Signal Processing/Radar Engineer will provide support at the National Air and Space Intelligence Center (NASIC) at Wright-Patterson AFB. Duties shall include data processing, analysis, and developing algorithm enhancements. A successful candidate will have experience in radar signal processing and sensor data exploitation.\n<br><br>\n<strong>Job Duties:</strong>\n\n\n<ul>\n<li>Develop algorithms in R&amp;D and Operational environments to detect and characterize RF signals</li>\n\n<li>Analyze data in the application of remote sensing technology to solve intelligence issues</li>\n\n<li>Coordinate with analysts from other intelligence disciplines</li>\n\n<li>Work independently and in a team environment</li>\n</ul>\n\n<strong>Required Qualifications:</strong>\n\n\n<ul>\n<li>Master degree in engineering, science or mathematics with 10 years engineering experience</li>\n\n<li>Demonstrated knowledge of radar/signal processing, exploitation, and dissemination (PED)</li>\n\n<li>Strong MATLAB and C programming skills are required</li>\n\n<li>Experience with X-Midas preferred</li>\n\n<li>Strong technical writing and briefing skills</li>\n\n<li>TS/SCI clearance</li>\n</ul>\n\nIntegrity Applications Incorporated is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status or any other factor protected by law.</div>\n</div><div></div>"}