{"job title": "Data Warehouse Architect", "company": "Life Fitness", "city state": "– Rosemont, IL", "rating": "2.8", "job description": "It is our people behind life’s passions who will make the big difference. If you are interested in becoming part of a company that delivers market leading products, driving your own career and working with brands committed to active lifestyles, then you’ve found your fit.\n<br><br>\nHave what it takes? Join us.\n<br><br>\n<strong>Duties:</strong>\n<br><br>\nLead the overall analysis and design of the data warehouse data marts. Conduct analysis of business process, data and systems. Understand, design and create physical and logical data models to meet business needs. Develop and document overall data sourcing, data transformation and semantic layer designs. Lead, execute and participate in data validation and user acceptance testing. Design and maintain enterprise level conceptual, logical and physical data models using ERWIN and VISIO data modeling tools for OLTP and OLAP database systems. Design data warehouse and business intelligence solutions using Oracle, DB2, SQL server database management tools, ETL tools and business intelligence reporting tools. Troubleshoot, diagnose and work with a team to resolve problems in data marts. Identify and recommend database performance solutions and standards. Tune SQL query performance and resolve database performance issues to improve data availability. Participate in the development process by implementing integration or semantic design. Work collaboratively with information technology leadership team to propose master plan for enterprise level information asset architecture, data governance, master data management, metadata management framework and develop consensus from business stakeholders to define strategic roadmap align with organizational goals.\n<br><br>\n<strong>Education + Experience Requirements</strong>\n<br><br>\nBachelor’s in computer science, science, or engineering and five (5) years of experience in data warehouse.\n<br><br>\n<strong>Special Skills:</strong>\n<br><br>\nMust have work experience in each of the following: 1) design and maintain enterprise level conceptual, logical and physical data models using ERWIN and VISIO data modeling tools for OLTP and OLAP database systems; 2) design data warehouse and business intelligence solution using Oracle, DB2, Teradata or SQL Server database management tools, ETL tools and business intelligence reporting tools; and 3) work collaboratively with information technology leadership team to propose master plan for enterprise level information asset architecture, data governance, master data management, metadata management framework and develop consensus from business stakeholders to define strategic roadmap align with organizational goals.\n<br><br>\n<strong>Alternative Qualifications:</strong>\n<br><br>\nIn lieu of bachelor’s degree and five (5) years of experience, will accept a three-year bachelor’s degree and five (5) years of experience in the same fields.\n<br><br>\nWe are the people behind life’s passions.\n<br><br>\nBrunswick does not accept applications, inquiries or solicitations from unapproved staffing agencies or vendors. For help, please contact our support team at: hrservicecenter@brunswick.com or 1-888-735-4767.\n<br><br>\nEqual Opportunity Employer: Minorities/Women/Protected Veterans/Disabled\n<br><br>\nEEO is The Law - click here for more information\n<br><br>\nBrunswick and Workday Privacy Policies<br><br>#Brunswick Corporation - Life Fitness"}