{"job title": "Senior Mass Properties Engineer 4", "company": "Northrop Grumman", "city state": "– Palmdale, CA", "rating": "3.7", "job description": "<div>At Northrop Grumman, our employees have incredible opportunities to work on revolutionary systems in air and space that impact people's lives around the world today, and for generations to come. Our work preserves freedom and democracy, and advances human discovery and our understanding of the universe. We look for people who have bold new ideas, courage and a pioneering spirit to join forces to invent the future, and have a lot of fun along the way. Our culture thrives on intellectual curiosity, cognitive diversity and bringing your whole self to work - and we have an insatiable drive to do what others think is impossible. Our employees are not only part of history, they're making history.</div>\n<br>\n<div>This position performs mass properties functional analysis, timeline analysis, detail trade studies, and mass properties requirements allocation studies to translate customer, product or derived mass properties requirements into hardware and software specification requirements. Analyzes, researches and tests system hardware and conditions for optimal mass properties system solutions. Tools utilized may include solid modeling tools, database tools and standard office applications.</div><br>\n\n<div><strong>This individual will contribute to the Mass Properties team supporting the achievement of program requirements. Specific responsibilities may include, but are not limited to:</strong></div><div> Developing and implementing a Mass Properties Management and Control Program</div>\n<br>\n<div> Accurate estimating and optimizing of mass properties to achieve vehicle performance and fulfill weight based program metrics</div>\n<br>\n<div> Establishing specification and design target weights</div>\n<br>\n<div> Maintaining accounting and reporting systems to inform the customer and management of current and projected mass properties trends</div>\n<br>\n<div> Providing mass properties data for cost analyses and vehicle design and analysis</div>\n<br>\n<div> Evaluating subcontractor proposals, interacting with and overseeing subcontractor mass properties management and control</div>\n<br>\n<div> Reviewing drawings to achieve mass properties management and control</div>\n<br>\n<div> Measuring/weighing vehicle and/or components to increase vehicle weight estimate accuracy</div>\n<br>\n<div> Providing mass properties data in support of operational flight manual</div> \n<br>\n<div> Assisting and mentoring a team of Mass Properties Engineer</div><strong>Basic Qualifications:</strong>\n\n\n<ul>\n<li>Bachelor's degree in a Science, Technology, Engineering, or Mathematics (STEM) discipline from an accredited university with a minimum of9 years' experience as an Aerospace Engineer</li>\n<li>Minimum of 5 years' experience as a Mass Properties Engineer</li>\n<li>Active DoD Secret Clearance with background investigation within the past6 years. Must also be able to obtain access to Special Access programs</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n<br>\n<div> Strong people, organizational, presentation, and communication skills.</div>\n<br>\n<div> Self-starter, willing to take initiative, be proactive, and require minimal direction.</div>\n<br>\n<div> Aircraft Weight and Balance Certification</div>\n<br>\n<div> Automated Weight and Balance System (AWBS) experience</div>\n\n<br>Northrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit www.northropgrumman.com/EEO. U.S. Citizenship is required for most positions."}