{"job title": "Cloud Software Engineer", "company": "Palo Alto Networks", "city state": "– Santa Clara, CA, United States", "rating": "3.7", "job description": "<strong>Palo Alto Networks®</strong> is the fastest-growing security company in history. We foster a culture of innovation, authenticity, and collaboration. This focus helps to advance our mission of protecting our way of life in the digital age. Our people make this possible. Its in our everyday interactions, how we work together and treat each other, that sets Palo Alto Networks apart from other organizations. If you are a motivated, intelligent, creative, and hardworking individual, then this job is for you!\n<br><br>\n<strong>Description</strong>\n<br><br>\nAs a cloud software engineer, you will be a team member working on threat intelligence services for public cloud and private cloud software applications. You will work directly with PLMs, researchers and data scientists to provide real-time security services to customers.\n<br><br>\n<strong>Responsibilities</strong>\n<ul>\n<li>Participate in the design and implementation of threat intelligence services for public cloud and private cloud features.</li><li>Work with PLM on new feature requirement.</li><li>Working with QA and DevOps on new release deployment.</li><li>Working with support to handle customer issues.</li><li>Work with security researchers and data scientist on new feature request.</li>\n</ul>\n<strong>Qualifications</strong>\n<ul>\n<li>Solid programming skills in Python. C, Java are plus.</li><li>Solid knowledge of nginx and uwsgi.</li><li>Rich Experience with SQL and No-SQL DB technologies such as mysql, Redis, MongoDB, Cassandra.</li><li>Hands on experience with queuing system such as RabbitMQ, Kafka and experience in Consul is a big plus.</li><li>Solid skills in multi-threads and multi-processes programming and experience in a distributed system is a big plus.</li><li>Teamwork, problem-solving and a can-do attitude.</li>\n</ul>\n<strong>Company</strong>\n<br><br>\nWe are the global cybersecurity leader, known for always challenging the security status quo. Our mission is to protect our way of life in the digital age by preventing successful cyberattacks. This has given us the privilege of safely enabling tens of thousands of organizations and their customers. Our pioneering Security Operating Platform emboldens their digital transformation with continuous innovation that seizes the latest breakthroughs in security, automation, and analytics. By delivering a true platform and empowering a growing ecosystem of change-makers like us, we provide highly effective and innovative cybersecurity across clouds, networks, and mobile devices.\n<br><br>\nOur Security Operating Platform is built for automation. It is easy to operate, with capabilities that work together, so customers can prevent successful cyber attacks. They can use analytics to automate routine tasks, so they can focus on what matters. We are known for continuously delivering innovations; and with Application Framework, we extend that to an open ecosystem of developers that benefit from our customers existing investment in data, sensors, and enforcement points.\n<br><br>\nLearn more about Palo Alto Networks here and check out our fast facts\n<br>\n#LI-MB1\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}