{"job title": "Linux Systems Engineer", "company": "Quicken Loans", "city state": "– Detroit, MI", "rating": "3.5", "job description": "Who We Are<br><br>We’re America’s largest mortgage lender, closing loans in all 50 states. J.D Power ranked Quicken Loans “Highest in Customer Satisfaction in Primary Mortgage Origination” for the past eight consecutive years, 2010 – 2017. The company was also ranked highest in the nation for client satisfaction among mortgage servicers by J.D. Power for four consecutive years, 2014 through 2017, each year the company was eligible. There’s a simple reason we’ve been so successful: We care about the people we work with.\n<br><br>\nIf you’re tired of stuffy, bureaucratic workplaces, then you’ll be delighted to find something different here. We strive to make a creative, fun and collaborative environment you simply won’t find anywhere else. Quicken Loans was named #1 in ESSENCE Magazine’s first ever list of “Best Places to Work for African Americans” in 2015. We've been on Computerworld's \"Best Places to Work in IT\" list for 13 years running, hitting #1 the last five years. We were also ranked #14 in FORTUNE Magazine’s list of \"100 Best Companies to Work For\" in 2018, remaining in the top-30 for the past 15 years.<br><br>What You'll Do/Need<br><br>The Linux Systems Engineer plays a leading role in the design, implementation and administration of our systems. This team member ensures the stability, integrity and efficient operation of the information systems that support core organizational functions.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n\n <li>Support Linux systems in environments running Red Hat and CentOS</li>\n<li>Perform day-to-day systems administration activities such as user administrations, disk management and package installations</li>\n<li>Identify and solve complex problems involving hardware, software, networking and applications</li>\n<li>Install and configure enterprise-wide infrastructure tools including automation tools, job schedulers, authentication and authorization software and backup tools</li>\n<li>Restore service during system outages to provide troubleshooting support to team members, prevent problems and escalate technical details</li>\n<li>Manage, monitor and secure enterprise data center environments</li>\n<li>Participate in an on-call rotation schedule after hours and on weekends</li>\n</ul>\n<strong>Requirements</strong>\n\n<ul>\n\n <li>A bachelor’s degree in computer science or similar technical subjects, or 3 years of related work experience</li>\n<li>3 years of experience performing server systems design, implementation and administration and analyzing system failures to minimize outages and interruptions</li>\n<li>System engineering experience taking projects from initial concept through planning and implementation</li>\n<li>Install, configure and maintain designated operating systems or applications</li>\n<li>Manage and troubleshoot OS and applications using available tools</li>\n<li>Utilize enterprise tools to manage, monitor and secure enterprise data center environments</li>\n<li>Collaborate with others to ensure smooth and reliable operation of software and systems for fulfilling business objectives and processes</li>\n<li>Working knowledge of SAN, clustering, backup and other enterprise applications to maintain availability and recoverability of systems</li>\n<li>Ability to work both independently and collaboratively; the ability to troubleshoot problems and quickly resolve issues</li>\n</ul>\n<strong>What'll Make You Special</strong>\n\n<ul>\n\n <li>Proficiency with enterprise-level administration of network services such as DNS, TCP/IP, DHCP and troubleshooting</li>\n<li>Experience with infrastructure-as-a-service platforms such as AWS, Google Cloud Platform, Azure, OpenStack, Docker, etc.</li>\n<li>Experience with on-premises to cloud migrations including re-hosting, re-platforming and re-factoring</li>\n<li>Understanding of shared on-premise and cloud infrastructure services, such as AWS organizations and accounts, VPC, IPAM, security groups, NACLS, routing, active directory, Federation, DNS and others</li>\n</ul>\n\nWhat You'll Get\n\n\n<ul>\n\n <li>Excellent benefits package that includes a 401(k) match, medical/dental/vision, and much more</li>\n<li>Opportunities to participate in professional and personal development programs, including personal empowerment coaching, leadership training and ongoing personal growth training</li>\n<li>Other incentives, contests and rewards, including trips, event tickets, cash prizes and more</li>\n</ul>\n<strong>Why We're Different</strong>\n<br><br>\nCorporate politics not your strong suit? The anti-corporate culture of Quicken Loans gives our team members the initiative to build solutions <em>together</em> and grow both personally and professionally. At Quicken Loans, we’re in the business of putting roofs over our clients’ heads, but we certainly aren’t putting ceilings on our team members’ careers. If you’re interested in working in a place with a philosophy that’s truly different, apply today.\n<br><br>\nQuicken Loans is an equal opportunity employer.\n<br><br>\n<em>Quicken Loans received the highest numerical score in the proprietary J.D. Power 2010 – 2016 Primary Mortgage Origination studies and the 2014 – 2016 Primary Mortgage Servicer studies. 2016 Origination (or Sales) based on 5,182 total responses and measures experiences and perceptions of consumers who originated a new mortgage, surveyed in July – August 2016. 2016 Servicing based on 7,542 total responses and measures experiences and perceptions of consumers with their current mortgage servicer, surveyed in March – April 2016. Your experiences may vary. Visit JDPower.com.​</em><br><br>Apply"}