{"job title": "Software Engineering Manager", "company": "Reify Health", "city state": "– Boston, MA", "rating": "NA", "job description": "At Reify Health, we are building a more creative healthcare system. We envision a world where every potential therapy, if safe and effective, is available to the patients who can benefit. <br> Our healthcare system relies on clinical trials to develop new, potentially life-saving treatments for patients. But clinical trials continue to be slow, unpredictable, and expensive. Reify Health’s product helps both the research leaders driving forward clinical trials and the doctors and nurses who care for the patient participants. <br> As we continue scaling the adoption of our product, we accelerate world-class clinical research and unlock innovation. By joining our team, you will play a significant role in our growing engineering team, further establishing our foundation for a culture of impact and empathy.<br><br> <b>Your Responsibilities</b>\n<ul>\n<li>Run and improve on product engineering processes including sprint planning, training and timely delivery of product -- in collaboration with engineering leaders</li>\n<li>Work with product, design, data and customer teams to develop new initiatives and improve existing product engineering processes.</li>\n<li>Foster a healthy and collaborative culture that embodies our team values e.g. Bro-Free Zone and thoughtfulness.</li>\n<li>Manage engineering team health through retros, one-on-ones and other feedback meetings.</li>\n<li>Help grow and develop a team of talented and motivated engineers.</li>\n</ul>\n<br> <b>What Will Make You Stand Out</b>\n<ul>\n<li>Engineering management experience with a strong record of shipping product with Agile processes.</li>\n<li>Experienced product engineer that knows which product engineering processes work well and don't work.</li>\n<li>Experience working remotely. The engineering team is a distributed one with remote-first processes.</li>\n<li>Experience working in a startup and with engineering teams of 10-40 people.</li>\n<li>Enjoy mentorship, talking to people and growing teams.</li>\n<li>Experience or strong interest in healthcare products.</li>\n<li>Strong technical discipline with a good dose of people skills.</li>\n<li>Interest in working with teams that use functional programming languages. We primarily use Clojure(Script).</li>\n</ul>\n<br> <b>Compensation and Perks</b>\n<ul>\n<li>Competitive salary ($100-160k) and meaningful stock options -- commensurate to your experience and expertise. Compensation varies from mid-level to very senior.</li>\n<li>Health (including telemedicine), dental, vision, disability and life insurance. We pay 100% of your premiums and more than half for dependents.</li>\n<li>Paid time off plus standard holidays that can be floated.</li>\n<li>Macbook Pro or similar laptop provided for those who prefer a separate work computer.</li>\n<li>A public transportation monthly pass. We are a short 2-3 minute walk from South Station.</li>\n</ul>\n<br> We value diversity and believe the unique contributions each of us brings drives our success. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.<br><br> <b>Note</b>: We are currently only considering US citizens or Green Card holders. Thanks! <br>"}