{"job title": "Sales Engineer", "company": "Scality", "city state": "– Chicago, IL, US", "rating": "3.9", "job description": "<div>\n<strong><em>Location: Can be located anywhere in the North Central United States.</em></strong>\n<br><br>\n<strong>Company Description</strong></div><div>\nAiming for Disruption</div><div>\nAt Scaity, we give freedom and control to people create value with data. Proven with 500 million users and 1 trillion objects, Scality delivers software-defined storage solutions since 2009. We are disrupting the industry to make unlimited, affordable storage accessible to everyone. This takes exceptional technology, along with exceptional people.</div><div>\nWar of Ideas</div><div>\nWe are a diverse team, representing more than 20 nationalities from over 10 countries, working from 7 global offices. We are looking for talented individuals who are energized by innovating, thinking big, focusing-in and teaming up; people who give and take constructive feedback for continuous learning and growth with the support of the company. We see limitless potential for each individual, and provide an environment where you will be constantly challenged to innovate and collaborate.</div><div>\n<strong>Job Description</strong></div>\n<br>\n<div><strong>Key Responsibilities:</strong></div><ul>\n<li>\nQualify sales opportunities in terms of technical requirements, competitive landscape, and business drivers</li>\n<li>\nWork with sales team to develop and implement account acquisition strategies and solution proposals</li>\n<li>\nBuild relationships with ecosystem and channel partners to expand sales opportunities</li>\n<li>\nProvide feedback from the field to internal teams to shape product roadmap and/or corporate messaging</li>\n<li>\nDemonstrate strategic value to customer by leading consultative activity such as file assessment workshops, developer workshops, and customer briefings</li>\n<li>\nLead technical oversight of Proof of Concepts (POCs)</li>\n<li>\nScope and document technical solution and success criteria</li>\n<li>\nDevelop detailed test plan and schedule of events/milestones</li>\n<li>\nOrchestrate all resources involved to ensure successful execution of the test plan</li>\n<li>\nPresent POC results and articulate solution benefits to customer</li>\n</ul>\n\n<div><strong>Qualifications:</strong></div><ul>\n<li>\nYou are able to learn and understand the customers technical and business challenges, and translates complex requirements into qualified sales opportunities.</li>\n<li>\nYou are able to assist in business development and growing the mindshare of Scality in the marketplace.</li>\n<li>\nYou are able to ensure positive customer satisfaction even after a sale is completed.</li>\n<li>\nYou are able to develop strong relationships and collaborates with technical peers.</li>\n<li>\nYou are able to own the POC process, scoping technical requirements, defining success criteria, creating a test plan, and determining schedule based on customer input and capabilities of resource availability and technology.</li>\n<li>\nYou are creative and determined in applying the solution to the customers problems and proposing alternatives.</li>\n<li>\nYou continually sharpen your technical skills and understanding of the competitive and ecosystem landscape relative to our solution.</li>\n</ul>\n\n<div><strong>Necessary Skills &amp; Experience:</strong></div><ul>\n<li>\nMasters degree or foreign equivalent degree in Computer Science, Information Technology, Computer Engineering, or closely related.</li>\n<li>\nAt least 2 years of sales engineering experience in the big data/storage industry, including gathering customer requirements, preparing sales packages to meet customer requirements, and working with sales team to present sales package.</li>\n</ul>"}