{"job title": "Full Stack Software Engineer", "company": "Spectra Logic", "city state": "– Boulder, CO, United States", "rating": "3.3", "job description": "If your software engineering skills are strong and you’re ready to have an immediate and direct impact on our product offerings, we want you, too! Spectra engineers are driven to develop faster, smaller, and more efficient digital data storage devices that preserve corporate and national treasures for more than a lifetime.\n<br><br>\n<strong>Can you see yourself here?</strong>\n<ul>\n<li>We are a driven group of engineers who show a high level of initiative and personal ownership of tasks. If you have these same qualities we’d really like to talk to you!</li> <li>Comfortable working on any project with Ninjutsu abilities to jump from front end to back end development.</li><li>Be able to successfully use design patterns to drive elegant architectures.</li><li>Testability and maintainability are super important to us; we care about our code and you should too.</li><li>We continually refactor code to be more efficient, testable, maintainable, etc.</li><li>Every line of code is reviewed; we expect you to take feedback and work well with others. You have a voice here, and you will have a major say in what takes place.</li><li>We love taking on challenging projects that “can’t be done”, and making them happen.</li>\n</ul>\n<strong>Ideal candidate will have experience with the following technologies:</strong>\n<br><br>\nJavaScript, React, Redux, Material UI, Babel, Webpack, Full Stack Web Development, HTML, CSS, Go, C++\n<br><br>\n<strong>Who’s on your team?</strong><br><br>We do a little bit of everything. We brew cider, play instruments (have a drummer, guitarist wanted), and spend a lot of time outdoors. We are primarily snowboarders; as a diversity initiative we are willing to talk to skiers. We also enjoy mountain biking and hiking; enjoying the summer is a must. We enjoy taking on tough projects and making them work. We love discussing the latest technology, and how to use it day to day.\n<br><br>\n<strong>Minimum Requirements</strong>\n<br><br>\nBachelor’s degree in Computer Science, Engineering, or a related discipline.<br><br>3+ years of experience developing scalable web applications.\n<br><br>\n<strong>Why Spectra?</strong>\n<br><br>\nLocated in the foothills of the Rocky Mountains in Boulder, Colorado, Spectra Logic provides a career and work experience second to none. Develop high quality solutions while gazing at the fabulous view; work out on your own or with our trainer at one of the on-campus gyms; grab lunch or snacks onsite or challenge the CEO to a game of pinball; and grow your career with peers who are second to none. Privately held since its inception in 1979, Spectra is allowed to do what is right without having to satisfy the analysts each quarter. That means our associates and customers come out as winners.\n<br><br>\n<strong>Isn’t it time you joined our winning team?</strong>\n<br><br>\nSpectra Logic provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}