{"job title": "Senior Site Reliability Engineer - Cloud Ops", "company": "Symantec", "city state": "– California, San Diego", "rating": "3.5", "job description": "<strong>About Us</strong>\n<br><br>\nSymantec Corporation (NASDAQ: SYMC) is the global leader in cyber security. Operating one of the world's largest cyber intelligence networks, we see more threats, and protect more customers from the next generation of attacks. We help companies, governments and individuals secure their most important data wherever it lives.\n<br><br>\n<strong>About You</strong>\n<br><br>\nAre you looking for a job that can help make the world a safer place? Come work at Symantec!!\n<br><br>\nSymantec is a proven Fortune 500 leader in cyber-security, innovation and technology. Our award-winning Norton security products protect hundreds of millions of people around the world.\n<br><br>\nLifeLock is a SaaS offering that provides members an identity theft protection system, which is intended to detect fraudulent applications for various credit and non-credit related services.\n<br><br>\nAs a<strong> Site Reliability Engineer</strong> you will build, maintain and support a highly available application (LifeLock) infrastructure stack running at AWS. In order to accomplish this, you will work closely with our Product/Engineering and TechOps teams to understand how the Business Applications utilize the infrastructure and implement monitoring/alerting for these applications. Additionally, you will have the opportunity to drive changes, automate processes and provide continuous improvements in system performance, reliability and security.\n<br><br>\n******\n<br><br>\n<strong>Skills</strong>\n<br><br>\n******\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\n- Design and deploy infrastructure solutions\n<br><br>\n- Configure application components\n<br><br>\n- Implement and manage continuous integration and deployment systems and methodologies on AWS\n<br><br>\n- Maintain strong communication channels between operations and development (DevOps) to ensure cooperation between teams\n<br><br>\n- Ensures high availability, security, and performance of production and development environments for our customer facing applications\n<br><br>\n<strong>Technology</strong>\n<br><br>\n- AWS, Jenkins, Chef, Terraform, SumoLogic\n<br><br>\n- Full stack application (NodeJS, Java/Tomcat, Activiti BPM, Apache Nifi, NoSQL DB)\n<br><br>\n<strong>Education</strong>\n<br><br>\n- BS in Computer Science, Computer Engineering or an equivalent combination of education and experience.\n<br><br>\n<strong>Requirements</strong>\n<br><br>\n- Direct hands-on experience with AWS services\n<br><br>\n- Direct hands-on experience with Chef\n<br><br>\n3- 5 years of Systems Engineering in 24x7 Production environment\n<br><br>\n- Fluency with at least one current generation scripting language used by DevOps professionals (Python, Perl, PHP, Ruby)\n<br><br>\n====================​====================​\n<br><br>\nSymantec is an equal opportunity employer. All candidates for employment will be considered without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, physical or mental disability, veteran status, or any other basis protected by applicable federal, state or local law.<br><br>Apply"}