{"job title": "Engineer Princ, Quality (Supply Chain)", "company": "Telephonics", "city state": "– Huntington, US-NY", "rating": "2.7", "job description": "<strong>SUMMARY:</strong>\n<br><br>\nPerforms quality assurance activities concerned with the engineering of products, materials and processes.\n<br><br>\n<strong>ESSENTIAL DUTIES AND RESPONSIBILITIES:</strong> include the following. Other duties may be assigned.\n\n<ul>\n<li>Lead a cross-functional team assigned to special projects.</li>\n\n<li>Manage fiscal responsibilities and a staff of personnel if required.</li>\n\n<li>Performs and evaluates first article inspection of supplier items and approves AS9102 documentation. Assesses and rates suppliers’ standard practices and procedures, QMS state and ability to supply Telephonics with defect free material on time.</li>\n\n<li>Evaluates and recommends enhancements to Statements of Work (SOW) for suppliers.</li>\n\n<li>Acts as liaison between departments and makes independent decisions to insure internal and external adherence to quality procedures and specification requirements.</li>\n\n<li>Develops and implements quality procedures related to Supply Chain Quality.</li>\n\n<li>Develops and maintains monthly supplier improvement plans and reports status.</li>\n\n<li>Establishes and collects data for metrics reporting, and analyzes results of activities for potentially adverse trends</li>\n\n<li>Prepares status reports for management and presents status to management and customer as required.</li>\n\n<li>Generates and tracks responses to supplier requests or Corrective/Preventative Action and drives issues to closure.</li>\n\n<li>Establishes and maintains an effective monitoring program, including the use of PC-based tools for planning, tracking and evaluating supplier performance.</li>\n\n<li>Up to 25% travel requiring overnight stays. Airline travel must be acceptable</li>\n\n<li>Ability to communicate effectively with personnel at various levels to address both technical and management issues.</li>\n\n<li>Establishes and maintains a supplier rating system, approved supplier list, supplier control program, and monthly reports on status of vendors with low ratings.</li>\n\n<li>Schedules and performs on-site surveys and source inspections at Supplier’s facilities to insure performance to contract requirements.</li>\n\n<li>Performs pre-award surveys as a team member with other departments to determine a potential new supplier’s qualifications.</li>\n\n<li>Act as a mentor to less senior SQE’s and assist in training. Ability to manage and successfully complete special projects as assigned.</li>\n</ul>\nWe are an Affirmative Action / Equal Employment Opportunity Employer (M/F/D/V). All qualified applicants will receive consideration for employment without regard to race, color, gender, religion, sex, national origin, disability, protected veteran status or any other protected characteristic. Reasonable accommodations may include but are not limited to that which may enable individuals with disabilities and special disabled veterans to perform the essential functions of this position.<br><br>Required Skills\n<br><br>\nRequired Experience<br><br><strong>MINIMUM REQUIREMENTS:</strong>\n<br><br>\nEDUCATION: Bachelor’s degree in a technical field (Engineering preferred) from four-year college or university; a Master’s degree is a plus.\n<br><br>\nEXPERIENCE: 15+ years’ experience in military electronics or equivalent and/or training.\n<br><br>\nOTHER:\n\n<ul>\n<li>Must have a background that would permit the U.S. Department of Defense to issue a Secret clearance.</li>\n\n<li>Experience assessing supplier quality systems, manuals and pertinent documentation (test or special process instructions) to AS9100, ISO9001 and NADCAP industry standards.</li>\n\n<li>Experience performing AS9102 First Article Inspections at suppliers on medium to complex parts/assemblies</li>\n\n<li>Detailed Knowledge of IPC-A-610, IPC/WHMA-A-620, and J-STD-001 requirements in a capacity to make nonconforming material decisions.</li>\n\n<li>Experience with Mechanical measuring and/or Electrical test equipment to determine compliance to defined requirements.</li>\n\n<li>Working knowledge of true root cause &amp; corrective action techniques (5 Why, Fishbone, Is/Is Not and 8D tools) Failure Reporting and Corrective Actions System (FRACAS) experience and plus.</li>\n\n<li>Working knowledge of FMEA and Advanced Quality Planning techniques (APQP).</li>\n\n<li>Skilled use of PC applications in Microsoft (Excel, Word, PowerPoint) and familiarity with industry standard ERP systems (Oracle) a plus.</li>\n\n<li>Knowledge of various drawing types, specifications and configuration management systems</li>\n\n<li>Knowledge of Government/Industry Counterfeit Part requirements</li>\n\n<li>Proven track record and experience driving supplier improvement and defect reduction for assigned supply base.</li>\n</ul>\n\nJob Location\n<br>\nHuntington, US-NY\n<br>"}