{"job title": "Software Engineer", "company": "Tidel", "city state": "– Carrollton, TX", "rating": "4.5", "job description": "Tidel is a leading provider of cash management solutions that empower retail institutions across the globe to better manage their daily cash business, reduce risk, and increase profits. For more than 40 years, customers have relied on Tidel to provide the most innovative and reliable solutions that help secure, optimize, and streamline their cash environment. For more information, please visit the company’s website at www.tidel.com. <br>Tidel is seeking an experienced Software Engineer to contribute to the continued development of Tidel’s cash management and cash recycling product line. The Software Engineer will conduct analysis, design products, and program computer software to interface with various hardware components, provide custom user workflows, and communicate with external systems using multiple protocols, primarily C#/XAML and SQL. This role will develop code for embedded application code, resident on Tidel’s custom products, so the candidate must have experience writing software which interfaces to hardware devices (not just PCs).<br><br><br>ESSENTIAL JOB RESPONSIBILITIES: <br><br>• Requires an advanced knowledge of software development and methodologies, particularly in the area of interfacing with hardware devices and inter-device communications. <br>• Performs software development and dev testing procedures for new and legacy software functionality.<br>• Consults with internal and, occasionally, external customers concerning software requirements and specifications. <br>• Analyzes and researches software requirements to determine feasibility of design requirements within time and cost constraints.<br>• Performs product design and programming activities involving multiple modules or subsystems.<br>• Participates in design meetings and consults with other staff to evaluate interfaces between hardware and software, and operational and performance requirements of the overall system.<br>• Performs complex release testing and beta support for assigned projects and resolves problems found in the software.<br>• Prepares documentation required of the product, including code comments, ticket tracking database content, and other documentation as required.<br>• Coordinates installation of software systems as needed.<br>• Experience with cash dispensers, cash recyclers or other automation equipment is a plus.<br>• Experience with secure communications protocols is a plus.<br>• Attendance is required.<br>• Completes other duties as assigned.<br><br><br>KNOWLEDGE, EXPERIENCE AND SKILLS:<br><br>• Excellent technical skills, desire and ability to learn software, hardware and communications capabilities of Tidel safes in detail.<br>• Must be highly proficient with C#, XAML, WPF, and MS SQL.<br>• Excellent customer service and communication skills.<br>• Understanding of root cause analysis is essential.<br>• Must be proficient with multiple programming environments and hardware platforms. Experience with embedded Windows platforms, including .NET Framework, is required.<br>• Must be proficient developing multi-threaded components for embedded devices.<br>• Must have experience using software revision control systems in a team programming environment.<br>• Must have experience integrating software functionality with database logging and reporting tools (whether home-grown or commercial). SQL experience is a plus.<br>• Understanding of retail processes, particularly cash handling, is a significant plus.<br><br>EDUCATION, CERTIFICATIONS AND LICENSES:<br><br>• BA/BS degree in Computer Science, Computer Engineering, Software Engineering, or equivalent technical degree plus experience, is required.<br><br>If you have the background and integrity we require and are looking for a challenging opportunity, we hope you will consider employment with Tidel. We provide a competitive salary, medical, dental, vision and life insurance plans. In addition, we offer a 401(k) plan with company match. If you are interested and meet the requirements for this position, please apply.<br><br>Tidel is an Equal Opportunity Employer, and is committed to maintaining a drug-free workplace.<br>"}