{"job title": "Engineer/Geologist", "company": "Trihydro", "city state": "– Signal Hill, CA", "rating": "4.2", "job description": "<p>Trihydro Corporation is a leading U.S. engineering and environmental firm dedicated to providing clients across many industries with effective, responsive, and safe solutions.</p>\n<p><strong>Position: </strong> Engineer/Geologist</p>\n<p><strong>Position Location:</strong> Signal Hill, CA</p>\n<p><strong>Job description: </strong>We currently have an opening for an Engineer/Geologist with a BS in Environmental Engineering or Geology and 0-6 years of relevant experience. Responsibilities will include performing field work that will consist of environmental sampling, environmental remediation system operation and maintenance, hydrocarbon recovery, and construction and system operation oversight. Office duties will include remediation system design, remedial measures evaluation, preparation of plans and specifications, technical report preparation, data management and interpretation, and project management assistance. The position requires working outdoors at petroleum refineries and general/industrial construction sites. Preferred applicants will have the 40-hour OSHA HAZWOPER certification and an EIT/GIT. Applicants must have a clean driving record, excellent technical writing and communication skills, and a commitment to safe operations. </p>\n<p><strong>Minimum Qualifications:</strong></p>\n<ul>\n<li>0-6 years of relevant experience</li>\n<li>Bachelor’s Degree in Geology, Environmental Engineering, or Civil Engineer with Environmental emphasis</li>\n<li>Exceptional written and oral communication skills with the ability to communicate effectively with clients and project team members</li>\n<li>Good employment or academic history with a commitment to safe work practices</li>\n<li>Initiative and motivation, with an emphasis on completing project deliverables on schedule</li>\n<li>Dependable, with the ability to work in a team environment</li>\n<li>Clean driving record</li>\n<li>Applicants must be eligible to obtain a Transportation Worker Identification Card (TWIC)</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Strong technical and problem-solving skills, including attention to detail and accuracy, as well as a commitment to producing high-quality deliverables</li>\n<li>Direct industry employment history in environmental compliance, within an industrial setting, or a related field</li>\n</ul>\n<p>This is a full-time position (40 hrs/week) with excellent benefits (including a 10% 401(k) match.</p>\n<p>Apply at https://www.trihydro.com/about-us/careers with application, resume, and cover letter. Trihydro is an Equal Opportunity, Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, marital status, genetic information, disability or because he or she is a protected Veteran.</p>"}