{"job title": "BI/ETL Engineer - Entry Level", "company": "USAA", "city state": "– San Antonio, TX", "rating": "3.6", "job description": "Purpose of JobWe are currently seeking a talented BI/ETL Engineer - Entry Level for our San Antonio, TX facility. <br><br>BI/ETL Engineers are engaged in all phases of the software development lifecycle which include; gathering and analyzing user/business system requirements, responding to outages and creating application system models. BI/ETL Engineers primary functions are to design, develop, document, test and debug new and existing software systems and/or applications for internal use, perform defect corrections (analysis, design, code). In addition, BI/ETL Engineers participate in design meetings and consult with business clients to refine, test, and debug programs to meet business needs, and interact and sometimes direct third-party partners in the achievement of business and technology initiatives. This is an entry-level position responsible for learning USAAs existing processes, procedures, and workflows to include the software development lifecycle and/or release processes. Incumbents are gaining an understanding of the software development lifecycle, requirements gathering, analysis and design, coding and unit/integration testing in the development of new applications or modifications to existing applications. BI/ETL Engineers work under direct supervision and perform routine work assignments and problem resolution in support of other team members.<p></p><p></p>Job Requirements<p><b>ABOUT USAA</b></p><p>USAA knows what it means to serve. We facilitate the financial security of millions of U.S. military members and their families. This singular mission requires a dedication to innovative thinking at every level.</p><p>In each of the past five years, we've been a top-40 Fortune 100 Best Companies to Work For®, and we've ranked among Victory Media's Top 10 Military Friendly® Employers 13 years straight. We embrace a robust veteran workforce and encourage veterans and veteran spouses to apply.</p><p></p><p><b>ABOUT USAA IT</b></p><p>Our most important qualification isn't technical, it's human. Here, we don't just sit in front of a screen. We stand behind our 11 million members who rely on us every day.<br>We are over 3,000 employees strong, a passionately supportive and collaborative team built on Agile principles. We've been a top-two Computerworld 100 Best Places to Work in IT five years in a row and were recently named a Top 50 Employer for Minority Engineers &amp; IT by Workforce Diversity Magazine. <br><br>See what it's like to work for a company where your passion meets our purpose: <br>USAA Information Technology: A Realistic Preview </p><p></p><p><b>PRIMARY RESPONSIBILITIES</b></p><ul><li>May perform defect correction on less critical development defects, and/or begins to analyze requirements, develop coding skills to code simple applications.</li><li>Learns to install, customize and integrate commercial software packages.</li><li>Works with more tenured peers to gain understanding of systems while conducting root cause analysis of issues, reviewing new and existing code and/or performing unit testing.</li><li>Develops an understanding of customer requirements and how to respond to outages by following the appropriate processes.</li><li>Learns to create system documentation/play book and attends requirements, design and code reviews.</li><li>Receives work packages from manager/delegates.</li><li>Works with senior team members to develop understanding on developing accurate estimates on work packages.</li></ul><p></p><p><b>MINIMUM REQUIREMENTS</b></p><ul><li>Bachelor's degree required (4 additional years of related experience in Information Technology beyond the minimum required may be substituted in lieu of a degree) OR certification from an approved technical field of study</li><li>Up to 2 years of development experience or coursework in applicable discipline OR Successful completion of military enlistment</li></ul><p></p><p><b>PREFERRED</b></p><ul><li>Exposure to SQL</li><li>Exposure to Data Warehousing and data modeling</li><li>Exposure to AWS including Cloud Practitioner</li><li>Exposure to Lean Six Sigma (yellow belt training or better)</li><li>Exposure with Agile methodologies and best practices</li></ul><p></p><p><b>DESIRED CHARACTERISTICS</b></p><p>USAA BI/ETL Engineers create innovative solutions that impact our members. Collectively, we are:</p><ul><li>Curious and excited by new ideas</li><li>Energized by a fast-paced environment </li><li>Able to understand and translate business needs into leading-edge technology </li><li>Comfortable working as part of a connected team, but self-motivated </li><li>Community-focused, dependable and committee </li><li>Exceptionally detail-oriented</li></ul><p></p><p><b>BENEFITS </b></p><p>USAA's most valuable resource is our 28,000 employees. We promote a culture of diversity and inclusion, encouraging varied perspectives and ideas.</p><p>Our team enjoys world-class benefits, pay and highly competitive reward opportunities, including comprehensive healthcare, wellness and wealth building programs, employee resource groups, 401K matching dollar-for-dollar up to 8% of pay, career planning and continuing education.</p><p>We promote a strong work-life balance with a variety of on-site services and conveniences depending on location, including a daycare, health center and pharmacy, multiple dining options, company stores, covered parking and free fitness centers. USAA is a casual dress environment.</p><p></p><p>The above description reflects the details considered necessary to describe the principal functions of the job and should not be construed as a detailed description of all the work requirements that may be performed in the job.</p><p></p><p>At USAA our employees enjoy one of the best benefits packages in the business, including a flexible business casual or casual dress environment, comprehensive medical, dental and vision plans, along with wellness and wealth building programs. Additionally, our career path planning and continuing education will assist you with your professional goals.</p><p></p><p>USAA also offers a variety of on-site services and conveniences to help you manage your work and personal life, including seven cafeterias, two company stores and three fitness centers.</p><p></p><p><b>Relocation</b> assistance is <b>not available </b>for this position.</p>"}