{"job title": "Sales Engineer", "company": "Veritas", "city state": "– New York", "rating": "2.9", "job description": "VERITAS' vision is to enable organizations to thrive in this new world of digital business.\n<br><br>\nDid you know that the International Data Corporation (IDC) predicts that data will double every 2 years, reaching 44 zetabytes by 2020? That's more bytes than gallons of water in the ocean and an exponentially growing problem for businesses. Veritas helps organizations harness the power of their data &amp; turn it into actionable insights.\n<br><br>\nWe believe information is everything! Data is an organization's digital currency; a critical business asset that is growing in value. We are the only company that provides a data management platform to address the core challenge of accessing, managing, and analyzing all of their data, no matter where it is, in real time - allowing organizations to truly maximize the value of their data.\n<br><br>\nVERITAS is currently looking for motivated individuals who not only “do” but are also leaders who influence change and make a difference. The team is always looking for passionate, dedicated individuals who are self-motivated in their work and careers.\n<br><br>\n<strong>VERITAS Worldwide Field Operations Organization (WFO)</strong>\n<br><br>\nThe WFO team are critical to VERITAS’ success. This group engages with the customer from the first contact of discussing how Veritas can support the key business challenges through to implementation of the solution to supporting the technical teams internally.\n<br><br>\nThe WFO organization works collaboratively to maintain a winning, ambitious and putting the customer first culture and the Leadership team lead by example, inspiring and motivating all. We are focused on building solutions offering true value to the customers by offering world class enablement program for Sales, Pre Sales, Customer Services, Consultants and Technical Support as we firmly believe that our talent is key to our success.\n<br><br>\n<strong>SCOPE OF ROLE:</strong>\n<br><br>\nThis role is focused on working with a set assigned accounts and/or territory, and Sales to obtain closure and manage technical risk on new Information Management business.\n<br><br>\n<strong>RESPONSIBILITIES:</strong>\n<ul>\n<li>Provides a level of technical expertise and technical closure for a specific solution within an assigned</li> <li>accounts and/or territories.</li> <li>Recognized within the team as the subject matter expert across Information Management o Maintain product/solution expertise of market trends in aligned technology including detailed understanding of the competition</li> <li>Provide high level solution design for information security or information management</li> <li>Be able to present the VERITAS' technical vision and offering strategy to across the solution offering to all levels across the customer internally and externally e.g. technical or business leads.</li> <li>Own the delivery of technical briefings for solutions and/products for external and internal customers/partners including proof of concepts/demonstrations when required.</li> <li>Maintaining key relationships/contacts within the Sales, TSS customers and partners.</li> \n</ul>\n<strong>SKILLS &amp; KNOWLEDGE</strong>\n<ul>\n<li>Proven track record of building and maintaining excellent customer relationships with both technical and business stakeholders</li><li>Ability to map VERITAS' offerings against customer needs and to identify new opportunities within the territory/customers</li><li>Consistent proven achievement against goals or target so Understands the importance of driving the technical sales lifecycle.</li><li>Has understanding of operational cadence in their specific areas. Ensures operating within compliance from a process, legal and revenue recognition.</li><li>Presents themselves in a professional manner, being a representative of their organization</li>\n</ul>\nEXPERIENCE &amp; QUALIFICATIONS\n<ul>\n<li>Comes from an IT background working within a world class software organization covering IT Infrastructure, Datacenter technology.</li><li>In depth knowledge and/or experience of the industry sector the aligned customers reside in e.g. Telecommunications, Financial Services, Public Sector</li> <li>External qualification/industry certification e.g. SNIA, ITIL,SANS GIAC</li><li>Degree/Master’s Degree in Computer Science or equivalent IT related subject and/or specific industry related experience</li>\n</ul>"}