{"job title": "Business Analyst/Database Administrator", "company": "Zeno Office Solutions", "city state": "– Tampa, FL", "rating": "3.9", "job description": "The Business Analyst/Database Administrator is primarily responsible for providing a day-to-day support system through data analysis, continuous reporting and process improvement through utilization of various database management platforms and reporting modules.\n<br><br>\n<strong>KEY RESPONSIBILITIES:</strong>\n<ul>\n<li>Provide support to the sales organization through database reporting and analytics</li><li>Marketing Analytics</li><li>CRM Database Management</li> <li>Process Improvement Projects</li><li>Serves as a Subject Matter Expert (SME) for various internal databases, applications and social media platforms</li><li>Seeks opportunities for continuous improvement in all areas</li> <li>Other duties as assigned.</li>\n</ul>\n<strong>QUALIFICATIONS</strong>:\n<br><br>\n<strong>Education/Experience:</strong>\n<ul>\n<li>Associate's degree or higher in a related field is desirable. Equivalent combination of education and experience is acceptable.</li> \n</ul>\n<strong>Skills, Specialized Knowledge and Abilities</strong>:\n<ul>\n<li>Outstanding communication (verbal and written), interpersonal, problem solving and customer service skills</li><li>Strong attention to detail, planning and organization skills</li><li>Operating with a strong sense of urgency and takes initiative to identify opportunities for process improvements</li><li>Detail-oriented with the ability to work independently as well as collaboratively in a team setting with peers and colleagues in a cross functional setting</li><li>Ability to work with multiple internal and external clients in a fast-paced work environment.</li><li>Strong customer service focus and relationship management skills (customers, vendors and employees within the company required)</li><li>Must be a self-starter, able to prioritize and handle multiple tasks and ability to meet strict deadlines and perform under pressure in a fast-paced work environment.</li><li>Advanced computer proficiency with Microsoft Office Suite (Excel/Word/PowerPoint/Access )</li><li>High comfort level working with Technology products and processes.</li><li>Working knowledge of the following preferred but not required;\n\n<ul>\n<li>E-Auto, or other related billing systems, Compass Sherpa, or other CRM systems</li></ul></li>\n</ul>\n<strong>Requirements (Physical, Mental, Environmental Demands):</strong>\n<ul>\n<li>Must be able to concentrate, analyze and solve complex issues throughout the course of the work day</li><li>Ability to work on PC including repetitive use of a keyboard and mouse for long periods throughout the course of the work day</li><li>Must be able to read and comprehend technical documents and instructions throughout the course of the work day</li><li>Ability to sit and stand for long periods of time throughout the course of the work day</li><li>May at times be required to lift up to 10 pounds</li><li>May be required to work outside normal business hours (evenings and/or weekends) to support departmental effortsZENO is an Equal Opportunity/ AA Employer M/F/D/V, and maintains a drug-free workplace.</li>\n</ul>"}