{"job title": "Sr. Data Engineer", "company": "Allstate Insurance Company", "city state": "– Washington, Washington", "rating": "3.5", "job description": "Job ID : ******_2\n<br>\nLocation : Bothell, WA US\n<br>\nLevel : Experienced Professional\n<br>\nJob Category : Data Science &amp; AnalyticsDescription :\n<br>\nWhere good people build rewarding careers.\n<br>\nThink that working in the insurance field can't be exciting, rewarding and challenging? Think again. You'll help us reinvent protection and retirement to improve customers' lives. We'll help you make an impact with our training and mentoring offerings. Here, you'll have the opportunity to expand and apply your skills in ways you never thought possible. And you'll have fun doing it. Join a company of individuals with hopes, plans and passions, all using and developing our talents for good, at work and in life.\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nJob Family Summary\n<br>\nData Discovery and Decision Science (D3) is the research and analytics organization at Allstate. We are solving some of today's most complicated analytics problems, making the lives of our of Allstate colleagues easier and more productive, and driving our mission to deliver perfect insurance solutions to our customers. We are avid about learning and applying new tools and techniques to get the most value from our massive data resources. As a Sr. Data Engineer in D3 you will get 10% of your time to innovate, work on your own initiatives, learn, collaborate, and teach. In partnership with technology and the business, we are incorporating analytics into every aspect of the enterprise. We are deeply committed to developing ourselves and others as a path to success.\n<br>\n<strong>Job Description</strong>\n<br>\nIn this role you'll be responsible for the development of data infrastructure, business solutions, and proof of concept to equip Data Scientists with the datasets they need for modeling, including creating new and maintaining existing data acquisition processes end to end. You are a bold, consultative thought leader who loves looking at problems from a business and a technical perspective and conceptualizing and delivering elegant, repeatable, beyond scope solutions that our non-technical colleagues are eager to use. You can frame the business need as a technical solution, break it into approachable tasks, and manage them through development, execution, and delivery with excellence.\n<br>\nAs part of the Engineering Consulting Services team your ability to communicate ideas and mentor both junior engineers and data scientists will be critical to your success. This position will also naturally expose you a wide variety of problem domains requiring you to be an avid and versatile learner eager to grow, collaborate, and develop with the team.\n<br><br>\n<strong>Key Responsibilities:</strong>\n\n\n<ul>\n<li>Utilize multidisciplinary approach to Data Analytic problems to combine technical, analytics and business knowledge.</li>\n<li>Demonstrate high degree of analytic agility to meet fluid and dynamic business needs.</li>\n<li>Break down business problems into solvable components to recommend solutions.</li>\n<li>Use a wide variety of tools and languages to achieve results (e.g., Python, C++, Java, Scala, SQL).</li>\n<li>Rapid, hands-on development of new data and analytics prototypes.</li>\n<li>Develop and deliver data infrastructure to enable advanced analytics.</li>\n<li>Explore data sources to better understand the availability and quality of data.</li>\n<li>Document available data sources and how they are being transformed.</li>\n<li>Mentor junior engineers.</li>\n</ul>\n\nJob Qualifications\n\n\n<ul>\n<li>Bachelor's degree in computer science, mathematics, or equivalent. Master's or PhD in these fields is a plus.</li>\n<li>At least 5+ years of relevant experience</li>\n<li>Experience mentoring junior staff. Desire to share and inform others.</li>\n<li>Experience coding and developing prototypes in languages such as Python, C++, Java, Scala, SQL</li>\n<li>Experience discovering and integrating new datasets, building data pipelines, doing complex transformations, process automation, testing, and validation.</li>\n<li>Experience with the Hadoop ecosystem.</li>\n<li>Experience with spark and kafka for real time data processing.</li>\n<li>Familiarity with statistical concepts and related technology (R, SAS, Matlab).</li>\n<li>Experience working with data in support of predictive modeling strongly preferred.</li>\n<li>Experience with Agile project management strongly preferred.</li>\n<li>Demonstrated analytic agility and problem solving skills.</li>\n<li>Ability and desire to learn new languages and technologies.</li>\n<li>Solid written and oral communication skills. Strong ability to communicate technical concepts to non-technical audiences.</li>\n</ul>\n\nThe candidate(s) offered this position will be required to submit to a background investigation, which includes a drug screen.\n<br>\nGood Work. Good Life. Good Hands.\n<br>\nAs a Fortune 100 company and industry leader, we provide a competitive salary - but that's just the beginning. Our Total Rewards package also offers benefits like tuition assistance, medical and dental insurance, as well as a robust pension and 401(k). Plus, you'll have access to a wide variety of programs to help you balance your work and personal life -- including a generous paid time off policy.\n<br>\nLearn more about life at Allstate. Connect with us on Twitter, Facebook, Instagram and LinkedIn or watch a video.\n<br><br>\nAllstate generally does not sponsor individuals for employment-based visas for this position.\n<br>\nEffective July 1, 2014, under Indiana House Enrolled Act (HEA) 1242, it is against public policy of the State of Indiana and a discriminatory practice for an employer to discriminate against a prospective employee on the basis of status as a veteran by refusing to employ an applicant on the basis that they are a veteran of the armed forces of the United States, a member of the Indiana National Guard or a member of a reserve component.\n<br><br>\nFor jobs in San Francisco, please click 'here' for information regarding the San Francisco Fair Chance Ordinance.\n<br>\nFor jobs in Los Angeles, please click 'here' for information regarding the Los Angeles Fair Chance Initiative for Hiring Ordinance.\n<br><br>\nIt is the policy of Allstate to employ the best qualified individuals available for all jobs without regard to race, color, religion, sex, age, national origin, sexual orientation, gender identity/gender expression, disability, and citizenship status as a veteran with a disability or veteran of the Vietnam Era."}