{"job title": "Process Development Associate Scientist - Forensics Team", "company": "Amgen Inc.", "city state": "– Juncos, PR", "rating": "3.7", "job description": "Career CategoryProcess DevelopmentJob Description\n<br><br>\n<strong>SUMMARY</strong>\n<br><br>\nTo perform experiments, organize data and analyze results under minimal supervision. With minimal supervision, plans, conducts or monitors experiments, records and organizes data, analyses results. Generates robust and reliable data and/or ensures that contracted studies are conducted in compliance with the respective protocol and applicable guidelines and regulations.\n<br><br>\n<strong>SPECIFIC RESPONSIBILITIES INCLUDE BUT ARE NOT LIMITED TO:</strong>\n\n\n<ul>\n<li>Monitors or follows established experimental design and protocols and performs routine tasks and studies to obtain reproducible and reliable results with limited supervision.</li>\n<li>Plans, monitors or conducts, analyzes and records experiments, and provides interpretation of data.</li>\n<li>Effectively transfers experimental methods from literature to the lab and makes modifications as necessary.</li>\n<li>Develops and implements new protocols with moderate review Engages coworkers in scientific discussions.</li>\n<li>Communicates data and interpretation to work group.</li>\n<li>Skilled at developing systems to ensure quality data.</li>\n<li>Skilled and/or knowledgeable in the use of standard laboratory equipment and with one or more major laboratory instruments/techniques.</li>\n<li>Effectively trouble-shoots equipment and experimental difficulties.</li>\n<li>Contributes to internal/external reports, papers, presentations, regulatory documents, invention disclosure submissions and/or patents.</li>\n<li>Participates in department-wide support efforts such as safety, recruiting and committees.</li>\n<li>May train staff and/or supervise others.</li>\n<li>Coordinates and organizes resources needed to complete the task.</li>\n<li>Understands when to seek input and when to make independent judgments.</li>\n</ul>\n\n<strong>EDUCATION/LICENSES</strong>\n<br><br>\nBasic Education&amp;Experience\n\n\n<ul>\n<li>Bachelor's degree&amp;2 years of scientific industry experience</li>\n</ul>\n\n<strong>OR</strong>\n\n\n<ul>\n<li>Master's degree</li>\n</ul>\n\n<strong>PREFERRED QUALIFICATIONS</strong>\n\n\n<ul>\n<li>Experience in Raman, Microscopy and Fourier-transform infrared spectroscopy (FTIR) analysis and data interpretation.</li>\n<li>Education discipline/background in Life Sciences/chemical.</li>\n<li>Working knowledge of analytical methodologies and analytical instruments qualification programs</li>\n<li>Excellent computer technical writing skills</li>\n<li>Good communications skills in English and Spanish</li>\n</ul>\n\nAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.\n<br><br>\nAmgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.\n<br><br>\nJoin Us\n<br><br>\nIf you're seeking a career where you can truly make a difference in the lives of others, a career where you can work at the absolute forefront of biotechnology with the top minds in the field, you'll find it at Amgen.\n<br><br>\nAmgen, a biotechnology pioneer, discovers, develops and delivers innovative human therapeutics. Our medicines have helped millions of patients in the fight against cancer, kidney disease, rheumatoid arthritis and other serious illnesses.\n<br><br>\nAs an organization dedicated to improving the quality of life for people around the world, Amgen fosters an inclusive environment of diverse, ethical, committed and highly accomplished people who respect each other but compete intensely to win. Together, we live the Amgen values as we continue advancing science to serve patients.\n<br><br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n<br><br>\n<strong>.</strong>"}