{"job title": "Director of Data", "company": "Cline Davis&amp;Mann, Inc.", "city state": "– New York, NY", "rating": "3.2", "job description": "Overview\n<br><br>\nDirector of Data and Analytics\n<br><br>\n<strong>JOB SUMMARY</strong>\n<br><br>\nThe Director of Data and Analytics is responsible for building and managing a hybrid group of Analysts and Data Scientists that are able to couple strong technical abilities and business acumen in order to work closely with marketing/acct management, media, strategic planning and creative teams. This role will be the primary owner of the client relationship with the analytics team, thus requiring appropriate client management experience&amp;skills.\n<br><br>\n<strong>EDUCATION</strong>\n\n\n<ul>\n<li>Bachelor's degree (B.A. or B.S.) or equivalent in Computer Science, Statistics, Finance, Mathematics, Decision Science, Economics, Information Management Studies, Bio-statistics, Bio-informatics, or Psychology, Sociology with coursework in Statistics, Calculus, or Advanced Math; MBA or Masters Degree in Computer Science, Statistics, Applied Math or related field preferred.</li>\n</ul>\n\n<strong>REQUIREMENTS</strong>\n\n\n<ul>\n<li>6-10 years of work experience in marketing analytics or related field such as advertising, direct marketing, online marketing, loyalty marketing, using data to solve complex Marketing problems.• Experience in scoping, pricing and staffing analytic/data science engagements.• Expert knowledge of marketing/advertising/research principles and applied experience in integrated, multi-channel marketing/advertising campaign tactics including off-line and online/digital channels. • Expert knowledge of analytic solutions platforms and software and advanced skills in digital analytics tools such as Google Analytics, Tag Manager, Adobe, etc.• Expert knowledge of analytic techniques such as: time series data analysis, segmentation, univariate&amp;multivariate statistical analysis, modeling, various metrics and key performance indicators, research&amp;test design, significance testing, variance and growth calculations, forecasting, return on investment.• Working knowledge of the development and maintenance of data infrastructure and associated platforms and programming languages, such as Python, R, SQL, etc., along with cloud storage solutions.• Familiarity with Healthcare Marketing datasets such as IMS or Crossix.• Strong presentation and client management skills.</li>\n</ul>\n\n<strong>RESPONSIBILITIES</strong>\n\n\n<ul>\n<li>Guide and manage analysts/sr. analysts in performing extraction of data sets from multiple marketing/database platforms and perform hygiene and quality control steps. Data sources will include: web analytic tools, media analytics, customer databases, social listening tools, search tools, syndicated data, research&amp;survey tools, etc.• Provide leadership and coach analysts/sr. analysts on how to derive and write clearly articulated key findings and observations from analyzing various data sources.• Provide thought leadership in new marketing analytics methodologies, techniques, tools&amp;technology• Scope, price and staff analytic engagements.• Oversee development of analytical plans including proper selection of methodologies, techniques, KPIs and metrics.• Manage various external vendors including advanced modeling, research firms, or other services firms such as media, social, PR, direct mail, telemarketing, events marketing firms.• Stay abreast of industry trends, best practices, and the evolving analytics landscape.• Keep up-to-date with latest technology trends.• Manage clients and communicate results and ideas to key decision makers.</li>\n</ul>"}