{"job title": "Physical Scientist, GS-1301-13 (MP-YMJ)", "company": "Department Of The Interior", "city state": "– Carson City, NV", "rating": "3.4", "job description": "* Videos<br><br>* Duties<br><br>HelpDuties Summary<br><br>What General Information Do I Need To Know About This Position?<br><br>There is one vacancy however, this announcement may be used to fill additional vacancies if they become available.<br><br>Learn more about this agency<br><br>Responsibilities<br><br>As a Physical Scientist within the Nevada Water Science Center, some of your specific duties will include:<br><br>* Work with the National Hydrography Co-Leads to provide leadership and direction for the Hydrography Theme of The National Map.<br><br>* Work to fully integrate National Watershed Boundary Dataset (WBD) into the Hydrography Program Area and infrastructure.<br><br>* Plan the strategic direction of the WBD in coordination with the National Hydrography Co-Leads.<br><br>* Provides day-to-day management and direction for the core WBD Team.<br><br>* Coordinate WBD program activities with representatives of federal and state agencies on the development of the national hydrography infrastructure, component datasets, and related services, systems, and tools.<br><br>* Provide input to and supports research and technical developments related to hydrography data and systems.<br><br>Travel Required<br><br>Occasional travel - Overnight travel of 1-3 nights per month may be required.<br><br>Supervisory status<br><br>No<br><br>Promotion Potential<br><br>13<br><br>* Job family (Series)<br><br>1301 General Physical Science<br><br>* Requirements<br><br>HelpRequirements Conditions of Employment<br><br>* Selectee may be subject to serving a one-year probationary period.<br><br>* More requirements are listed under Qualifications and Other Information.<br><br>* Selectee must provide a valid state driver's license&amp;safe driving record.<br><br>Are There Any Special Requirements For This Position?<br><br>Because this position requires travel for official business, the selectee will be required to apply for a charge card within 30 calendar days of appointment. Individuals who have delinquent account balances from a previous Government charge card will be required to satisfy their existing obligation before a new card can be issued.<br><br>A background investigation will be required for this position. Continued employment will be subject to the applicant's successful completion of a background security investigation and favorable adjudication. Failure to successfully meet these requirements will be grounds for termination.<br><br>Throughout the recruitment and hiring process we will be communicating with you via email; therefore, it is imperative that the email address you provide when applying for this vacancy remains active. Should your email address change, please notify the point of contact identified in the vacancy announcement as soon as possible so that we can update our system.<br><br>If you are a Federal employee applying for a promotion (under merit promotion procedures) you must meet time-in-grade requirements by the closing date of the announcement.<br><br>Qualifications<br><br>For information on basic qualifications, which includes information on whether you may substitute education for specialized experience, please click on the following: https://www2.usgs.gov/humancapital/sw/quals/1301.html.<br><br>In addition to the basic education requirement as stated above, applicants must meet the following to qualify for the GS-13 level:<br><br>One year of appropriate professional experience that is in or directly related to the duties of the position to be filled is qualifying if it is equivalent to at least the GS-12 level in the Federal service, and if it equipped the applicant with the knowledge, skills and abilities to perform successfully the duties of the position.<br><br>Examples of such experience may include planning, executing and reporting on original physical science studies or ongoing physical science studies requiring a fresh approach to resolve new problems. The complexity of this work typically required extensive modification and adaptation of standard procedures, methods, and techniques, and the development of totally new methods and techniques to address novel or obscure problems for which guidelines or precedents were not substantially applicable. At this level, physical scientists have wide latitude for the exercise of independent judgment to perform scientific work of marked difficulty and responsibility.<br><br>You must meet all qualification and eligibility requirements for the position by the closing date of the announcement.<br><br>Education<br><br>* Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g. Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.<br><br>* Education completed in colleges or universities outside the United States may be used to meet the above requirements. You must provide acceptable documentation that the foreign education is comparable to that received in an accredited educational institution in the United States. For more information on how foreign education is evaluated, visit: http://www.usgs.gov/ohr/oars/quals/foreign.html."}