{"job title": "Staff Data Engineer", "company": "GE Aviation", "city state": "– San Ramon", "rating": "3.6", "job description": "<br><br><b>Role Summary: </b><br>The Data Engineering team helps solve our customers' toughest challenges; making flights safer, power cheaper, and oil &amp; gas production safer for people and the environment by leveraging data and analytics. The Lead Data Engineer will work with the team to create state-of-the-art data and analytics driven solutions, working across GE to drive business analytics to a new level of predictive analytics while leveraging big data tools and technologies. <br><br><b>Essential Responsibilities: </b><br>The Staff Data Engineer will be part of a data engineering or cross-disciplinary team on commercially-facing development projects, typically involving large, complex data sets. These teams typically include statisticians, computer scientists, software developers, engineers, product managers, and end users, working in concert with partners in GE business units. Potential application areas include remote monitoring and diagnostics across infrastructure and industrial sectors, financial portfolio risk assessment, and operations optimization. Be proficient in multiple ETL /MDM tools. Implement Data warehouse &amp; Big/Small data designs with automated MDM and data quality capabilities. Demonstrate proficiency at industry standard data modeling tools. Integrate customer and domain data knowledge into development of data requirements. The Staff Data Engineer will be responsible for all aspects of data acquisition, data transformation, and analytics scheduling and operationalization to drive high-visibility, cross-division Aviation outcomes. In addition, the Staff Data Engineer will:<br><li>Acquire domain Subject Matter Expertise (Supply Chain, Engineering, etc.) across IT systems by working closely with business partners, documenting learnings centrally<br></li><li>Write complex SQL (100's of lines) that is able to transform, pivot, and stitch big data sets, both relational and non-relational<br></li><li>Write custom scripts in Python, Java, R or Spark to transform and pivot data<br></li><li> Integrate domain data knowledge into development of data requirements<br></li><li> Look across multiple systems and understand the purpose of each system and define data requirements by system<br></li><li>Identify downstream implications of data loads/migration (e.g., data quality, regulatory, etc.)<br></li><li>Develop automated testing for code deployment<br></li><li>Write data ingestion flows using message queuing<br></li><li>Operationalize and scale data science algorithms to extremely large datasets<br></li><li> Optimize existing data architectures and queries to scale across terabytes of data for visualization or application consumption<br></li><li>Architect and model to-be data structures based on customer requirements<br></li><li> Operate in Agile framework, creating user stories from and tasks from customer requirements to track project progress <br><br><b>Qualifications/Requirements: </b><br><p>Basic Qualifications:</p><br><ul><br><li>Bachelors Degree in Computer Science or in \"STEM\" Majors (Science, Technology, Engineering and Math)</li><br><li> Minimum of 5 years of professional IT/DT experience</li><br><li>Minimum of 3 years of experience working on Database(s), SQL is required</li></ul><br><br><p>Eligibility Requirements:</p><br><ul><br><li>This position requires access to export controlled information. Due to this requirement, you must be one of the following: (1) U.S. Citizen or National; (2) U.S. Lawful Permanent Resident; (3) Person granted Refugee status in the United States; (4) Person granted Asylee status in the United States; (5) A Special Agricultural Worker under section 210 or (6) a beneficiary of legalization through an amnesty program under section 245A of the U.S. Immigration and Nationality Act.</li></ul> <br><br><b>Desired Characteristics: </b><br><p>Business Acumen:</p><br><ul><br><li>Interfaces directly with Military customers to determine data needs; articulates the value proposition of new &amp; existing technology capabilities and maps them to customer requirements to minimize incremental cost of development</li><br><li>Develops understanding of the military business and applies that knowledge in seeking out digital products to solve business needs</li><br><p>Leadership:</p><br><li> Uses teamwork skills to understand vision, achieve goals, solve problems, and manage conflict. Identifies individual differences and informs stakeholders of key customer issues, identifies potential problems or conflicts and resolves them when necessary</li><br><li>Produces functional area information in sufficient detail for cross-functional teams to utilize, using presentation and storytelling concepts</li></ul><br><br><p>Technical Expertise:<br></p><ul><br><li>Knowledge of big data technologies (Greenplum, PG Admin, Hadoop), experience in ETL/ELT technologies for ingestion of big data, such as Talend or Informatica and familiarity of engineering data for data lakes</li><br><li>Expertise in SQL for exploratory data analysis; generates visual summaries of data. Identifies data quality issues. Demonstrated experience using Scripting languages.</li><br><li>Basic level knowledge of analytic modeling (e.g., data, physics, or domain driven). Aware of basic forms of modeling and how they apply to different types of data</li><br><li>Knowledge of analytic development, and key tools such as R and Python; understanding of data science exploration principals and what it means to operationalize an analytic.</li><br><li> Resourceful and quick learner; able to efficiently seek out, learn, &amp; apply new areas of expertise as needed.</li></ul><br><br><p> Domain Knowledge:</p><p><br></p><ul><br><li>Understands basic functionality and interoperability of software products / components; delivers outcome-focused engagements in an Agile environment (MVPs with 2-3 week sprints)</li><br><li>Does a comparison analysis of trends, implements action towards new direction/trend; Knowledgeable about pricing and cost drivers</li><br><li>Experience with Core Java, Java WebServices development SOAP, REST APIs</li><br></ul><br><p>#DTR</p> <br><br><b>About Us: </b><br>GE is the world's Digital Industrial Company, transforming industry with software-defined machines and solutions that are connected, responsive and predictive. Through our people, leadership development, services, technology and scale, GE delivers better outcomes for global customers by speaking the language of industry.<br>GE offers a great work environment, professional development, challenging careers, and competitive compensation. GE is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law. <br><br><b>Locations: </b> United States; Michigan, Ohio; Van Buren, Evendale,<br><p>GE will only employ those who are legally authorized to work in the United States for this opening.</p>\n<p> </p></li>"}