{"job title": "Senior Data Engineer - Advanced Analytics - McKinsey &amp; Company", "company": "McKinsey &amp; Company", "city state": "– Massachusetts", "rating": "4.3", "job description": "<strong> QUALIFICATIONS</strong>\n<li> Bachelors degree ideally in IT, Computer Science, Information Systems, Math, Engineering or related discipline; Master's degree is a plus</li> <li> 5-8 years of experience in database development and ETL and/or data modeling, design patterns, building highly scalable and secured solutions</li> <li> Experienced on Big Data platform like Hadoop, hbase, CouchDB, hive, Pig, etc.</li> <li> Worked with TeraData, Oracle, MySQL, Informatica, Tableu, QlikView or similar reporting and BI packages</li> <li> Used SQL, PL/SQL and similar languages, UNIX shell scripting</li> <li> Strong analytical and problem-solving skills paired with the ability to develop creative and efficient solutions in dealing with varied data quality</li> <li> Distinct customer focus and quality mindset</li> <li> Ability to influence, to see from and sell to multiple viewpoints</li> <li> Excellent interpersonal, leadership and communication skills and the ability to work both independently and in various team settings</li> <li> Ability to work under pressure with a solid sense for setting priorities</li> <li> Demonstrate enthusiasm and innovation with the ability to manage own learning and contribute to domain knowledge building</li> <li> Can manage 50% travel</li>\n<strong> WHO YOU'LL WORK WITH</strong>\n<br><br>\nYoull work with our Advanced Analytics team in Waltham, Massachusetts, at our Knowledge Center, alongside data scientists, tool developers, consultants and clients on projects that use complex data and advanced modeling to solve client problems and deliver significant measurable impact.\n<br><br>\nAdvanced Analytics is a specialized service that leverages the latest technology disruptions (e.g., cloud, big data, mobile, agile, software development) and a team of talented technologists to rapidly build and deploy custom web and mobile applications for our clients.\n<br><br>\nDespite being part of a large, multinational organization, our group works more like a small startup company. Our development teams are small, flexible, and employ agile methodologies to quickly provide our consultants with the solutions they need. We combine the latest open source technologies together with traditional Enterprise software products. Our office culture is casual, fun and social, with an emphasis on education and innovation. We have the freedom to try new ideas, experiment and are expected to be constantly learning and growing. There is also a strong emphasis on mentoring others in the group, enabling them to grow and learn.\n<br><br>\n<strong> WHAT YOU'LL DO</strong>\n<br><br>\nYou will be a core member of our Advanced Analytics platform, responsible for extracting large quantities of data from clients IT systems, developing efficient ETL and data management processes, and building architectures for rapid ingestion and dissemination of key data.\n<br><br>\nYou will apply your passion for finding opportunities in data by using established tools and techniques, or by innovating new ones to model the data landscape, obtain data extracts, define secure data exchange approaches, and draw insights from large complex data sets."}