{"job title": "Senior Scientist, Chemical Biology - Discovery Chemistry", "company": "Merck&amp;Co., Inc.", "city state": "– South San Francisco, CA", "rating": "3.7", "job description": "Requisition ID: RES002173\n<br><br>\nMerck&amp;Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck's success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.\n<br><br>\nMerck is on a quest for cures and is committed to being the world's premier, most research-intensive biopharmaceutical company. Today, we're doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck's leading discovery capabilities and world-class small molecule and biologics R&amp;D expertise to create breakthrough science that radically changes the way we approach serious diseases.\n<br><br>\nOur research division in South San Francisco, a wholly owned subsidiary of Merck and Co., is focused on driving discovery research. Our new multi-disciplinary discovery research site offers state-of- the-art resources to explore the most promising science combined with Merck's world-class R&amp;D expertise in small molecules and biologics. Located within the heart of the Bay area's biomedical community, research conducted in our new laboratories spans exploratory biology through early clinical development and is an integral part of our organization's powerful world-class network of drug and vaccine discovery.\n<br><br>\nAt our organization, we are inspired by the belief that a research-driven enterprise dedicated to scientific excellence can create medicines and vaccines that save and improve lives. Every employee is building on our proud legacy of scientific breakthrough. Our ability to impact the lives of patients worldwide depends on the integrity, creativity, humility and scientific acumen of our team. We are creating a diverse organization that is inspired by invention and founded on a culture of respect and collaboration. At our research division in South San Francisco, you'll have the opportunity to expand your knowledge and skills through collaboration with talented and dedicated colleagues while advancing your career.\n<br><br>\nOur organization is currently seeking an exceptional chemist for a Chemical Biology position within the Discovery Chemistry Department located at our South San Francisco, CA site. The successful candidate will join a multidisciplinary team responsible for enabling target identification and molecular mechanism of action studies through the application of cutting-edge chemical biology. Specific responsibilities will include:\n\n\n<ul>\n<li>Act as a leader in the laboratory, executing on program strategy and collaborating effectively across functions</li>\n<li>Collaborate with disease area and pharmacology scientists within the SSF site, as well as across our research division network, to qualify new mechanisms of action and drug targets that will build a pipeline and positively impact human health</li>\n<li>Contribute to the development of innovative methods that qualify and validate novel mechanisms as part of a cross-functional team this can incorporate diverse screening, chemoproteomic, genomic and proteomic approaches</li>\n<li>Design, synthesize and characterize chemicalprobes and/or drug candidates in target identification and validation, as well as hit-to-lead through lead optimization projects</li>\n<li>Develop and utilize innovative synthetic and medicinal chemistry problem solving skills coupled with analysis of diverse data sets to build structure-activity relationships</li>\n<li>Engage and collaborate with the external scientific community to help identify and validate new targets</li>\n<li>Provide scientific mentoring and technical training of team members</li>\n<li>Establish a substantial external scientific presence including authoring significant scientific publications and presentations</li>\n</ul>\n\nTo accomplish the above, the successful candidate must have excellent interpersonal, collaboration and communication skills in addition to rigorous scientific thinking and a proven track record of excellence in an academic and/or industrial drug discovery environment.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n<strong>Education and Experience Requirements:</strong>\n\n\n<ul>\n<li>Ph.D. in Chemistry, Chemical Biology or Medicinal Chemistry</li>\n<li>Experience in Chemical Biology, as well as, Methodology/Catalysis, Total Synthesis, and/or Physical Organic Chemistry, is required, along with a proven track record of solving complex problems.</li>\n</ul>\n\nThequality of our team is essential to oursuccess. We are creating a new and innovative approach to rewarding ouremployees and establishing a comprehensive value proposition. Our competitivecompensation program and benefits are designed to support the wide range ofgoals, needs and lifestyles of our employees, and the people that matter themost in their lives. If you need an accommodation for the applicationprocess please email us at staffingaadar@merck.com .\n<br><br>\nMerck&amp;Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United Statesand Canada, is a global health care leader with a diversified portfolio ofprescription medicines, vaccines and animal health products. Today, weare building a new kind of healthcare company one that is ready to helpcreate a healthier future for us all.\n<br><br>\n<strong>Search Firm Representatives Please Read Carefully:</strong>\n<br><br>\nMerck&amp;Co., Inc. is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any employee at Merck via email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Merck. No fee will be paid in the event the candidate is hired by Merck as a result of the referral or through other means.\n<br><br>\nVisa sponsorship is not available for this position.\n<br><br>\nFor more information about personal rights under Equal Employment Opportunity, visit:\n<br><br>\nEEOC Poster\n<br><br>\nEEOC GINA Supplement\n<br><br>\nJob: Research Science (59000450)\n<br><br>\n<strong>Other Locations:</strong>\n<br><br>\nEmployee Status: Regular\n<br><br>\nTravel: Yes, 5 % of the Time\n<br><br>\nNumber of Openings: 1\n<br><br>\nShift (if applicable): 1st\n<br><br>\nHazardous Materials: Laboratory chemicals necessary for drug discovery.\n<br><br>\nCompany Trade Name: Merck\n<br><br>\nNearest Major Market: San Francisco\n<br><br>\nNearest Secondary Market: Oakland"}