{"job title": "Lead Research Scientist", "company": "National Association of County and City Health Officials", "city state": "– Washington, District of Columbia", "rating": "2.9", "job description": "A Lead Specialist is an individual contributor with an extremely high level of expertise in a particular area who is considered an expert within NACCHO. The Lead Specialist works on highly complex projects and, as a resident expert, typically provides guidance to less senior specialists in the area in a project management or technical capacity. Individuals at this level typically report to a Director or Senior Director and require advanced knowledge and experience in an area of specialization. Occasional travel may be required to represent NACCHO at scientific or professional meetings.<br><br>A Lead Specialist may provide guidance to other professionals and administrative staff either in a supervisory, project management, or technical capacity. The Lead Specialist is considered a career level professional and works with minimal supervision. Incumbents only move beyond this level if they develop expert level capabilities or if they take on significant management responsibilities. Positions at this level require proven analytical, research, and project management capabilities.\n<br><br>\nThe Lead Research Specialist works as part of NACCHOs Research and Evaluation Team. The Specialist will have responsibility for supporting research activities across NACCHO including The National Profile of Local Health departments and the Forces of Change Survey. In addition, the Specialist will collaborate with outside researchers on projects of importance to local health departments and public health overall. The Specialist will assist with the continued growth of NACCHOs research portfolio, supporting the Senior Director of R&amp;E, NACCHOs Senior Advisors, and NACCHOs Executive Leadership Team.<br><br>•Provide expert advice and support to NACCHO research and evaluation activities, including selection of appropriate research design, methods, sampling, instrument design, data analysis, data presentation, and reporting of results. •Plan and implement programs to improve research skills of NACCHO staff, including training and provision of research-related resources. •Promote and facilitate collaborations with external researchers that support NACCHOs strategic and program priorities. •Advance the field of public health systems research by participating in appropriate activities of professional and partner organizations. •Contribute to R&amp;E-led studies by providing advice on the studys data use policy, analysis plan, and study publications and by performing high level research tasks in each stage of these studies •Track and evaluation data collection efforts across all NACCHO programs. •Develop and execute marketing and promotion plans for survey research projects. •Supervise Research and Evaluation specialist.\n<br><br>\nInternal Number: 105\n<br>"}