{"job title": "Senior Investigator Recruitment In Data Science, Biomedical Informatics, And Computational Biology", "company": "National Institutes of Health", "city state": "– Bethesda, MD", "rating": "4.2", "job description": "The National Library of Medicine (NLM) of the National Institutes of Health (NIH) is seeking to recruit a tenure-eligible Senior Investigator to lead a world-class research program within its Intramural Research Program. The goal of this search is to identify candidates to develop a dynamic, innovative, and independent computational research program that will enhance NLM’s collaborative environment by performing novel, cutting-edge research and, thereby, advance the objectives of NLM’s new Strategic Plan, 2017-2027 to accelerate data-driven discovery. As part of this plan, and in alignment with NIH’s new Strategic Plan for Data Science, NLM is embarking on a major expansion of its Intramural Research Program, with a specific emphasis on data science methodologies, analytics, visualization, computer-assisted curation, and applications of novel methods for basic biological and biomedical discovery.\n<br><br>\nThe NIH Intramural Research Program offers unique opportunities for interaction and collaboration with an extensive community of scientists who have broad expertise across all fields of biomedical research, proximity to NLM’s advanced biomedical data and information systems, access to NIH’s high-performance computing resources, and a funding model that facilitates the conduct of long-term, high-impact science that can be difficult to undertake in other research environments.\n<br><br>\nNLM seeks to recruit a Senior Investigator with significant experience in the use of statistical, bioinformatic, machine learning, optimization, and advanced mathematical methodologies as applied to biomedical and health science, including one or more of the following domains of interest:\n<br><br>\nAnalysis of large biomedical data sets, multi-dimensional medical images, and unstructured text to generate new biomedical knowledge\n<br>\nStandards and ontologies for the content and structure of biomedical and health data, to facilitate the automated aggregation and analysis of these data\n<br>\nNatural language processing and computational linguistics, including question answering, de-identification, entity extraction, text indexing, and text mining\n<br>\nNetwork and systems approaches to answering relevant questions related to molecular biology, biochemistry, and disease\n<br>\nGenomic studies, including evolutionary genomics, metagenomics, ancient DNA-based genomics, cancer genomics, personalized genomics, population genetics\n<br>\nNovel methods for processing and analyzing emerging types of large-scale data sets, such as those arising from single-cell expression studies and multi-dimensional (3D/4D) chromatin structure studies\n<br>\nWe encourage individuals to apply who are at the forefront of working with complex biomedical and health-related data with the ability, expertise, and interpersonal skills to direct research projects yielding generalizable, scalable, and reusable methodologies. Ideal candidates are expected to have an outstanding record of publication and achievements in the aforementioned domains of interest.\n<br><br>\nThe successful candidate will join a diverse, collegial, and cooperative community of investigators within NLM, providing a supportive environment for high-quality mentoring. The successful candidate will be supported with long-term, stable resources equivalent to those provided to faculty in academic departments; this includes the ability to recruit postdoctoral fellows and a budget for software, consumables, and equipment. Salary is competitive and will be commensurate with experience, and full federal benefits are included.\n<br><br>\nApplicants must have a Ph.D., M.D., or equivalent degree in a field appropriate to this recruitment, as well as demonstrated accomplishment commensurate with several years of experience as an independent investigator. Appointees may be U.S. citizens, resident aliens, or non-resident aliens with (or eligible to obtain) a valid employment authorization visa."}