{"job title": "Data Analyst", "company": "Navvis", "city state": "– Saint Louis, MO", "rating": "4.5", "job description": "<strong>About Us:</strong>\n<br><br>\nNavvis is a Real-Person Care company with a transformative approach to population health. Our groundbreaking approach responds to how people really live their lives, day in and day out. Navvis Real-Person Care is integrated and holistic, physician-led and person-centered. Our entire approach begins with asking people a simple question that no one else is asking: Not, 'what's the matter <em>with</em> you?' but, 'what matters <em>to</em> you?'\n<br><br>\nNavvis delivers seamless, high-performing and aligned provider networks, care coordination, and value-base care models.\n<br><br>\nWe partner with health plans, health systems, providers and employers to eliminate the barriers, boundaries, and siloed efforts that fragment care. We help our clients move from a system that is complicated and frustrating to one that is centered on people's real-life needs.\n<br><br>\nReal life. Life changing. Changing healthcare. That's Navvis.\n<br><br>\nLearn more at: www.navvishealthcare.com\n<br><br>\n<strong>Position Summary:</strong>\n<br><br>\nThe Data Analyst sits in the Information Technology (IT) department and will turn data into information, information into insight and insight into business decisions. The Data Analyst will conduct full lifecycle analysis to include requirements, activities and design, and develop analysis and reporting capabilities. They will also monitor performance and quality control plans to identify improvements. The Data Analyst will gather and analyze healthcare data from multiple sources (e.g. insurance processing, clinical operations, and patient behavior) to extract trends and business insights.\n<br><br>\n<strong>Position Responsibilities:</strong>\n<ul>\n<li>Interpret data, analyze results using statistical techniques and provide ongoing reports.</li><li>Develop and implement databases, data collection systems, data analytics and other strategies that optimize statistical efficiency and quality.</li><li>Acquire data from primary or secondary data sources and maintain databases/data systems.</li><li>Identify, analyze, and interpret trends or patterns in complex data sets.</li><li>Filter and \"clean\" data by reviewing computer reports, printouts, and performance indicators to locate and correct code problems.</li><li>Work with management to prioritize business and information needs.</li><li>Locate and define new process improvement opportunities.</li><li>Understand health care operations and systems.</li><li>Create and validate record-keeping processes.</li><li>Pull and integrate data from disparate sources (e.g. cost and claims or clinical data).</li><li>Evaluate and preprocess raw information.</li><li>Delve into data to discover discrepancies and patterns.</li><li>Build models that capture a wide range of health care operations.</li><li>Present and explain information in an accessible way (e.g budgeting reports).</li><li>Suggest ways to both increase healthcare quality and reduce costs (e.g. money spent in R&amp;D).</li><li>Collaborate with management and internal teams to implement and evaluate improvements.</li><li>Other duties as assigned</li>\n</ul>\n<strong>Preferred Qualifications:</strong>\n<ul>\n<li>5-8 years proven working experience as a data analyst or business data analyst.</li><li>Technical expertise regarding data models, database design development, data mining and segmentation techniques.</li><li>Strong knowledge of and experience with reporting packages (Business Objects etc), databases (SQL etc), programming (XML, Javascript, or ETL frameworks).</li><li>Knowledge of statistics and experience using statistical packages for analyzing datasets (Excel, SPSS, SAS etc).</li><li>Familiarity with remote desktop applications and help desk software (Freshdesk, Zendesk).</li><li>Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy.</li><li>Adept at queries, report writing and presenting findings.</li><li>Proven experience as a Healthcare Data Analyst.</li><li>Experience in data analysis and visualization methods.</li><li>Understanding of healthcare procedures.</li><li>Knowledge of Extract, Transform and Load (ETL) frameworks.</li><li>Proficient in SQL and analysis tools (e.g. SAS).</li><li>Knowledge of Enterprise Data Warehouse (EDW) and data management systems.</li><li>Excellent analytical and communication skills</li><li>Outstanding organizational and problem-solving aptitude</li><li>Experience with structured query language</li><li>Export, transform and load (ETL)</li><li>Data modeling and data analysis</li>\n</ul>\n<strong>Degrees/Licensure:</strong>\n<ul>\n<li>BS in Mathematics, Economics, Computer Science, Information Management or Statistics</li>\n</ul>"}