{"job title": "Sr. Clinical Data Abstractor", "company": "Providence Health&amp;Services", "city state": "– Santa Monica, CA", "rating": "3.4", "job description": "Providence is calling a Full Time, Day Shift Sr. Clinical Data Abstractor to Providence John Wayne Cancer Institute Santa Monica, CA.\n<br><br>\n<strong>In this position you will:</strong>\n\n\n<ul>\n<li>Be responsible for the review and abstraction of neurosurgical and neuro-oncology data for the Pacific Neuroscience Institute (PNI).</li>\n<li>Data from various sources, including Providence Health&amp;Services' electronic medical records system (EMRS) and existing PNI databases currently in Excel and Filemaker Pro format, will be abstracted into research databases to support PNI's research and clinical trials.</li>\n<li>The ideal candidate must be a registered nurse with extensive experience in the neurosciences field and the ability to read and interpret medical reports, find relevant data, and enter data into existing databases or help create new databases as needed to support emerging research interests.</li>\n<li>Help obtain current follow-up data through direct patient contact, and in some instances via contact with referring MDs.</li>\n<li>Help consent patients for participation in clinical trials.</li>\n<li>You will potentially supervise other clinical data abstractors, will report to the Director of Data Management, and will work closely with PNI physicians and nurse practitioner, JWCI physicians and clinical research staff, as well as with JWCI Data Management and Providence biostatisticians.</li>\n<li>The incumbent must have the experience to work with limited supervision.</li>\n</ul>\n\n<strong>Required qualifications for this position include:</strong>\n\n\n<ul>\n<li>Registered Nurse</li>\n<li>Bachelor's Degree</li>\n<li>At least 5 years of nursing experience</li>\n<li>Experience in medical data abstraction and coding</li>\n<li>Experience in a neuro-oncology setting</li>\n<li>Experience in clinical research and gathering data to support research endpoints</li>\n<li>Experience with EPIC</li>\n<li>Ability to work independently with little supervision</li>\n<li>Proficient in Microsoft Word, Excel, PowerPoint, Access, Outlook, etc.</li>\n<li>Excellent oral and written communication and interpersonal skills to effectively correspond with co-workers, physicians, patients, caregivers and other healthcare professionals</li>\n<li>Demonstrated administrative skills and ability to exercise good judgement, initiative and resourcefulness in making decisions</li>\n<li>Ability to maintain patient confidentiality and privacy in accordance with hospital policy</li>\n</ul>\n\n<strong>Preferred qualifications for this position include:</strong>\n\n\n<ul>\n<li>Experience in database design and magement is a plus</li>\n</ul>\n\n<strong>About the hospital you will serve:</strong>\n<br><br>\nThe John Wayne Cancer Institute at Providence Saint John's Health Center is a cancer research institute dedicated to the understanding and curing of cancer in order to eliminate patient suffering worldwide. The Institute's mission is accomplished by conducting innovative research focused on biological mechanisms to provide new understandings of the cause, diagnosis, control, and cure of cancer; training the next generation of surgical scientists who study and treat cancer; and researching unique experimental treatment services to rapidly develop and test new forms of diagnosis and therapy in order to improve the quality of life and expected survival of those afflicted with cancer."}