{"job title": "Bioinformatics Scientist - Disease Discovery R&amp;D", "company": "Sema4", "city state": "– Stamford, CT", "rating": "2.7", "job description": "Sema4 Genomics is seeking a talented, self-motivated individual to participate in leading edge research in translational bioinformatics as a member of the R&amp;D Disease Discovery group. A successful applicant will be part of an interdisciplinary team that develops and applies computational methods and databases to integrate and perform analysis on large-scale human genetic and other-omic datasets to better understand Mendelian and complex diseases. A successful applicant may also play a role in developing systems for integrating novel informatics and genomic tools and methodologies into clinical practice.\n<br><br>\n<strong>DUTIES AND RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>Support research in disease discovery on internal, pharma and academic collaborations by performing computational analysis of big data collected from patients.</li>\n<li>This computational support will involve working closely with biology researchers to execute specific computational tasks providing the basis for research for publications, internal projects and projects involving external collaborators.</li>\n<li>Analyze the functional impact of genetic variants, and identify variant disease association.</li>\n<li>Analyze high throughput genetic data including whole genome, whole exome, genome-wide genotyping, and RNAseq (bulk and single cell) data.</li>\n<li>Integrate analysis of genetic data and clinical data to understand genetic risks, disease mechanisms, and drug response.</li>\n<li>Generate processing pipelines for gene expression and proteomic data.</li>\n<li>Generate differential expression and gene correlation signatures.</li>\n<li>Construct gene expression co-expression and Bayesian causal networks.</li>\n<li>Mine EMR for gene trait correlation analysis.</li>\n<li>Perform un supervised gene expression clustering analysis.</li>\n</ul>\n\n<strong>QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>Prior experience analyzing next generation sequencing and genotyping data in a high performance computing environment for the analysis of large human molecular biology, genetics and clinical datasets.</li>\n<li>A track record of contributing to biomedical projects using statistical and/or computational approaches.</li>\n<li>Outstanding programming skills with two or more of the following languages: R, Python, Perl, Matlab, Java, C, and/or C++, and UNIX.</li>\n<li>Experience in SQL.</li>\n<li>Experience in machine learning application preferred.</li>\n<li>Strong genomics and genetics background required.</li>\n<li>Outstanding knowledge of public repositories of genetic, genomic, biological and drug data.</li>\n<li>Experience mining EHR data.</li>\n<li>Aptitude for learning and applying new methods.</li>\n<li>Strong ability to collaborate with teams of research scientists, bioinformaticians, software developers, and external collaborators.</li>\n<li>Experience with meeting deadlines in a fast-paced environment.</li>\n<li>Strong written and verbal communication skills.</li>\n</ul>\n\n<strong>EDUCATION REQUIREMENTS:</strong>\n<br><br>\nPhD in bioinformatics, biomedical informatics, computer science, computational biology, genomics, genetics, or a related field or masters degree with prior experience (+7 years) in computational biomedical research.\n<br><br>\nPost doctoral experience is preferred, but not required."}