{"job title": "SCIENTIST, CANCER BIOLOGY", "company": "Tango Therapeutics", "city state": "– Cambridge, MA, US", "rating": "NA", "job description": "<p><strong>Company Overview</strong></p><br>\n<p>Tango, a 2017 “Fierce 15” company, is an exciting new oncology company launched by Third Rock Ventures, one of Boston’s premier biotech funding groups. Our focus is on exploiting synthetic lethal interactions to discover and develop new breakthrough cancer therapies.<br><br>Our discovery efforts begin and end with patients. We invert the traditional discovery paradigm by putting patient selection before target identification. We use deep DNA sequencing and CRISPR-based screening to identify novel targets for specific subgroups of cancer patients. Our goal is to leverage the principles of synthetic lethality to find novel weaknesses in cancer cells and use them to provide a roadmap to cures. As we advance our molecules into the clinic, our trials will enroll the patients most likely to benefit from our new treatments; thereby enabling greater speed, success, and impact for those patients.<br><br></p><br>\n<p><strong>Job Summary</strong></p><br>\n<p>We are seeking a motivated and scientifically rigorous scientist to perform laboratory-based research in a collaborative, multidisciplinary team environment. The successful candidate will have experience in biological target validation, utilizing genetic and pharmacological perturbants in mammalian cell culture to discover and confirm candidates for novel therapeutics, and identifying drug-resistance mechanisms. You will also be involved in mechanism-of-action studies, the interpretation and presentation of data, and will function as an integral member of the team to advance novel cancer therapeutic targets.</p><br>\n<p><strong>Job Responsibilities</strong></p><br>\n<p> </p><br>\n<ul><br>\n<li>Design and optimize existing and new protocols</li><br>\n<li>Conduct mammalian cell culture-mediated genetic perturbation studies using RNAi and/or CRISPR, as well as pharmacological perturbation studies to validate biological targets</li><br>\n<li>Perform mechanism-of-action studies, including analysis of gene expression, pathway expression, protein levels, and or/or target activity levels, to validate and advance targets</li><br>\n<li>Perform cellular assays to support drug discovery efforts</li><br>\n<li>Communicate and engage with contract research organizations</li><br>\n<li>Independently summarize, analyze and present work to project and senior leadership teams; document data using ELN</li><br>\n<li>Conduct research on underlying mechanisms relevant to cancer combination therapies, indication expansion and drug resistance</li><br>\n</ul><br>\n<p> </p><br>\n<p><strong>Required Skills &amp; Qualifications</strong></p><br>\n<p> </p><br>\n<ul><br>\n<li>PhD in Molecular or Cell Biology, or related field, Post-doctoral experience preferred</li><br>\n<li>Expertise with genetic perturbation (e.g. CRISPR and/or RNAi) and genetic rescue techniques required</li><br>\n<li>Solid understanding of cancer genetics and genomics</li><br>\n<li>Familiar with oncogenic pathways, targeted and immunotherapies</li><br>\n<li>Expertise with mammalian cell culture techniques required</li><br>\n<li>Experience with protein detection methods (e.g. Western immunoblot and ELISA) required</li><br>\n<li>Isolation and manipulation of RNA and DNA required</li><br>\n<li>Flow cytometry and FACS experience is favorably considered</li><br>\n<li>Ability to work in a cross-functional team environment, and a flexible team-oriented perspective is essential</li><br>\n<li>Understanding of how to troubleshoot assays is required; experience working with CROs strongly preferred</li><br>\n<li>Strong attention to detail and the ability to multi-task required</li><br>\n<li>Strong verbal and written communication skills required</li><br>\n<li>Knowledge of cancer biology pathways is favorably considered</li><br>\n</ul>"}