{"job title": "Associate Scientist II", "company": "WuXi AppTec", "city state": "– Plainsboro, NJ", "rating": "2.6", "job description": "Overview\n<br><br>\nXenobiotic Laboratories (XBL), a subsidiary of the Lab Testing Division of WuXi AppTec, Inc., is a leading contract research laboratory specializing in small and large molecule Bioanalytical drug metabolism, and pharmacokinetic services to the pharmaceutical, animal health and agrochemical industries. Xenobiotic Laboratories is seeking a Associate Scientist II within our Bioanalytical Department (Large Molecule), located in Plainsboro, NJ.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\n<strong>Primary Duties and Responsibilities:</strong>\n\n\n<ul>\n<li>Perform routine procedures without supervision.</li>\n<li>Delivers accurate results on assigned task and expected results.</li>\n<li>May assume the duty of a trainer to new hires.</li>\n<li>Maintains research notebooks in a well-organized manner. All necessary documentation is recorded.</li>\n<li>Complies with all safety rules, practices good housekeeping, and maintains safe workplace without supervision.</li>\n<li>Thorough understanding of Good Laboratory Practices and EPA, FDA, or other regulation pertaining to the study.</li>\n<li>Perform routine calculations. tabulates, and records results.</li>\n<li>Prepares standard solutions used in the laboratory.</li>\n<li>Maintains and calibrates laboratory equipment.</li>\n<li>Assumes responsibility for technical accuracy of work.</li>\n<li>Learns, and enhances technical knowledge of bioanalytical and biological assays, such as ELISA, PCR, western blotting, etc.</li>\n<li>Assume the responsibility of the GLP compliance in a designated laboratory (as primary or back up).</li>\n<li>Maintain the records and helping in ordering specific supplies for the entire Biological Division.</li>\n<li>Other duties as assigned including preparing the final study files for archiving and scanning notebooks, raw data and report QC, and the reconciliation of study samples.</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\n<strong>Experience / Training / Education:</strong>\n\n\n<ul>\n<li>Bachelor's degree in chemistry, biology, or a related discipline</li>\n<li>2-3 years of relevant experience, or equivalent</li>\n<li>Any similar combination of education and experience</li>\n</ul>\n\n<strong>Knowledge / Skills / Abilities:</strong>\n\n\n<ul>\n<li>Ability to follow instruction to perform required procedures</li>\n<li>Ability to work on multiple tasks with efficient approach to complete the work on time with high accuracy.</li>\n<li>Ability to trouble shoot simple experimental issues and problems caused by human errors.</li>\n<li>Knowledge of commonly used concepts, practices, and procedures within biological or chemical R&amp;D laboratory setting</li>\n<li>Well organized, detail oriented, and adaptable to changes</li>\n<li>Effective oral and written communication skills</li>\n<li>Effective interpersonal skills</li>\n<li>Computer skills: knowledge of internet research, MS Word, Excel, Outlook, and PowerPoint</li>\n<li>Good time management skill in order to perform of multiple projects within deadlines</li>\n<li>Ability to effectively prioritize workload and manage changes in direction</li>\n<li>Ability to work in a team environment</li>\n<li>Familiarity with and adherence to regulatory guidelines consistent with XBL requirements</li>\n</ul>\n\nWe are an Equal Opportunity Employer. Minorities/Women/Veterans/Disabled"}