{"job title": "SCIENTIST – ASSAY DEVELOPMENT", "company": "Ambys Medicines", "city state": "– Redwood City, CA, US", "rating": "NA", "job description": "Ambys Medicines is an early stage biopharmaceutical company committed to developing therapies for patients suffering from devastating liver diseases. Founded by Third Rock Ventures with world-renowned academic thought leaders, Ambys is pioneering novel approaches to liver restoration and regeneration. The company’s core technologies of hepatocyte cell therapy, gene therapy, drug therapy, and translational models are the foundation of our research and development platform. We are seeking smart, creative, and kind people to join our team and contribute to our mission.\n<br><br>\nPosition Summary:\n<br><br>\nOur Assay and Bioanalytical Development team is seeking a scientist to develop and execute cell-based and analytical assays to drive our discovery programs spanning small molecule therapeutics as well as gene and cell therapies. This individual will also help with build-out and establish the operations of our new laboratories. The successful candidate will have an opportunity to be the in vitro assay lead for internal and outsourced programs and collaborate with scientists on cross functional teams. He/she will play a leadership role in identifying critical analytical issues and developing solutions, developing tools and reagents, participating in technology transfer with external collaborators and vendors. Strong candidates will be highly and excited to collaborate across boundaries to help answer challenging scientific questions and develop impactful new medicines for patients.\n<br><br>\nJob Requirements:\n\n<ul>\n<li>PhD and at least 2 years industry experience in a biotechnology or pharmaceutical setting with exposure to multiple areas of drug discovery and development. Experience with small molecule discovery programs is preferred.</li>\n<li>Broad laboratory experience and skills in cell biology, biochemistry and assay development.</li>\n<li>Bioassays experience using cell lines, primary cells and ex-vivo cell/tissue preparations and a variety of assay readout technologies. Experience with gene expression analysis and HPLC/ SEC is preferred.</li>\n<li>Excellent data analysis skills and experience with a variety of scientific software applications.</li>\n<li>Strong experimental design and troubleshooting skills.</li>\n<li>Excellent communication, collaboration, time-management, and organizational skills.</li>\n<li>The successful candidate will be an ambitious self-starter, motivated to apply his/her skills to diverse projects and enjoy working in a fast-paced team environment.</li>\n</ul>"}