{"job title": "Senior-Inventive Scientist- 5G Virtualized RAN and Open Source", "company": "AT&amp;T", "city state": "– NJ, United States", "rating": "3.4", "job description": "<div><strong>Inventive Scientist in AT&amp;T Labs Advanced Technology &amp; Systems</strong>\n<br>\n<br>\nIn AT&amp;T Labs, we are helping to build the communications network of the future and enable industry leading services running on 5G and next generation access technologies, edge cloud and leveraging the worlds biggest and richest datasets. We focus on the companys most challenging business problems that inspire exciting technological opportunities, across diverse areas such as data science and AI, cloud computing, network service quality management, software defined networking, access systems, optimization and software engineering.</div><br>\n\n<div>AT&amp;T Labs Advanced Technology &amp; Systems is looking for passionate and talented engineers and scientists to join our team. We are looking for unique and exceptional individuals who will engage in software creation, forward-looking work and who have a passion to drive new and innovative systems into our business. Our employees are expected to think big and focus on the future, to explore and rapidly prototype new ideas and solutions to challenging real-world problems, and deliver excellent quality code to open source and internal production environments. They are independent thinkers able to lead and drive novel ideas from concept to operational reality. Successful candidates will work closely with fellow employees and directly with business unit leaders and academics to impact AT&amp;Ts network, products and services. We contribute significantly to multiple disciplines through open source software projects led by AT&amp;T.</div><br>\n\n<div>Outstanding Masters and Ph.D.-level candidates at all levels of experience are encouraged to apply. Candidates must demonstrate excellence in data processing, a collaborative spirit, strong communication skills, and software expertise. Access to real-world systems and data, the ability to work with internal and external researchers and collaborators, and the possibility of making an impact by developing solutions that will be used by tens of millions of consumers, and the largest corporations in the world, are some of the reasons AT&amp;T Labs is an exciting place to work.</div><br>\n\n<div><strong>We encourage applications from candidates with experience and strong interest in any of these areas:</strong></div><div>5G and Wireless Access Technologies\n<br>\nVirtualized RAN and open source</div> <div>Software Defined Networking (Network Function Virtualization)</div> <div>Cloud Technologies and IoT Services</div><div>Artificial Intelligence and Automation</div><br>\n\n<div>Please visit http://www.research.att.com to learn more about AT&amp;T Labs Advanced Technology &amp; Systems.</div> <div><strong>Qualifications depend on the specific position being filled and include:</strong></div>\n\n<ul>\n<li>Entry into this title will require Technical Title Plan (TTP) Board Approval</li><li>Candidate shall have a PhD in an approved field from an accredited university and a minimum of 4 years of relevant experience, or a Master's degree in an approved field from an accredited university and a minimum of 6 years of relevant experience, or a Bachelor's degree in an approved field from an accredited university and a minimum of 8 years of relevant experience</li><li>Degree in a relevant technical field, including but not exclusive to: Computer Engineering, Computer Science, Machine Learning, Software Engineering, Operations Research, Electrical or Electronic Engineering, Statistics, and Mathematics. </li><li>Established aptitude for software creation, open source tools, contributions and practices, internship experience, or patents.</li><li>Demonstrated ability to generate new ideas, and develop them from concept to a solution.</li><li>A demonstrated ability to operate independently, with minimal oversight, and proven experience in collaborative work environments with external customers</li><li>Accomplished programmer with superb software expertise with a language primarily relevant to the field (e.g. Python, C/C++, and Java)</li><li>Open source software development and community experience.</li> <div><strong>Requirements</strong></div>\n\n<ul>\n<li><strong>Your curriculum vitae, including your complete academic and professional histories and your publication record.</strong></li><li><strong>At least three (3) and up to five (5) references.</strong>\n<br>\nYour references will be contacted by email and provided with a URL for uploading their reference letter. </li><li><strong>A position statement (up to 2000 words) describing your current work and your vision for your future work in networking and access technologies.</strong> \n<br>\nFeel free to supply any other information helpful in assessing your application.</li><div><div>Work locations will depend on position offered but can be Bedminster, NJ; Middletown, NJ or San Ramon, CA. Qualified candidates will be asked to submit a position statement and 3-5 references.</div> </div><br>\n<div><strong>Job Requirements:</strong></div><div>\nPhD or experienced MS, in Math, Communication, EE or Computer Science\n<br><br>\nEducation and experiences in communication systems; Familiar with 5G standards and architecture. Ideally with network planning and optimization experience.\n<br><br>\nMust have strong software skills, data management, and it is a plus to have experience/background in Machine Learning/AI creation and application.</div> <div>A plus to have experience in SDN/NFV technologies.\n<br><br>\nImportant to have key leadership skills including good communication and be able to contribute in small teams to deliver innovative solutions in a highly competitive industry.</div>\n\n</ul>\n\n\n</ul>"}