{"job title": "Data Analyst", "company": "Baker Technologies", "city state": "– Denver, CO", "rating": "5.0", "job description": "Baker Technologies, Inc. | TILT Holdings, Inc.\n<br><br>\nOur growing technology firm is looking for an experienced Data Analyst who is able to turn project requirements into custom-formatted data reports. The ideal candidate for this position is able to do complete life cycle data generation and outline critical information for each Project Manager. We also need someone who is able to analyze business procedures and recommend specific types of data that can be used to improve upon them. As a Data Analyst, you will live and breathe data from all aspects of our business operations and make it available in innovative, impactful ways to help our team make important business, engineering, and product decisions.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Proven working experience as a data analyst or business data analyst</li>\n<li>Collaborate with our business and engineering teams to ensure our data infrastructure meets constantly evolving business requirements.</li>\n<li>Use statistical methods to analyze data and generate useful business reports</li>\n<li>Work with management team to create a prioritized list of needs for each business segment</li>\n<li>Identify and recommend new ways to save money by streamlining business processes</li>\n<li>Use data to create models that depict trends in the customer base and the consumer population as a whole</li>\n</ul>\n\n<strong>Minimum qualifications:</strong>\n\n\n<ul>\n<li>Experience working with data analysis and dashboard tools.</li>\n<li>Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy</li>\n<li>Adept at queries, report writing and presenting findings</li>\n<li>Experience working with marketing, data visualization, and customer service tools (e.g. DataStudio, Looker, Tableau)</li>\n<li>Strong SQL skills</li>\n<li>Dive into data without any knowledge of subject area and extract information or questions regarding the data details (data profiling)</li>\n<li>Write SQL to identify potential data quality issues (ex. Duplicate records, Data anomalies, etc.)</li>\n<li>Ability to run down data questions that arise (working with data team, business teams, development teams)</li>\n</ul>\n\n<strong>Preferred qualifications:</strong>\n\n\n<ul>\n<li>Experience with one or more programming languages (Python, Java, JavaScript, etc).</li>\n<li>Experience extracting data through web APIs and identifying opportunities for business or product improvement, and defining and measuring the success of those initiatives.</li>\n<li>Experience writing and maintaining extract, transform, and load scripts (ETLs/ELTs) which operate on a variety of structured and unstructured sources.</li>\n<li>Experience with data pipeline development tools (Apache Airflow, etc).</li>\n<li>Experience with full-stack integration and building data visualizations for complex business applications.</li>\n<li>Experience with implementing third party CRM/Marketing Automation tools such as Looker, Salesforce, Marketo, Zendesk, Tableau, etc.</li>\n<li>Demonstrated oral and written communication skills, including the ability to communicate complex findings in a structured and clear manner to a non-technical audience.</li>\n<li>Effective project management/organizational skills.</li>\n<li>Familiarity with graph databases and graph theory a huge plus.</li>\n</ul>\n\nSalary: $50-70,000\n<br><br>\nMust be willing to relocate to Denver.\n<br><br>\nAbout Baker and TILT\n<br><br>\nUnder a combination agreement signed on July 9, 2018, Baker plans to merge with Briteside, Sea Hunter Therapeutics, and Sante Veritas Therapeutics (SVT) to form TILT Holdings, Inc. (\"TILT\") after obtaining all regulatory approvals and satisfying all closing conditions. Post closing, the merged company, TILT, expects to establish operations in every state where cannabis laws exist, for both infrastructure as well as technology. At present, Baker, Briteside and Sea Hunter operate in 24 states collectively and have licenses for cannabis operations in a portion of those. TILT is expected to be a multinational infrastructure and technology platform delivering solutions to the legalized cannabis industry. TILT will enable businesses the opportunity to interact, communicate and operate with a greater degree of efficiency with their patients and consumers. Consisting of four leading cannabis companies, TILT will maintain competencies across the entire spectrum of the industry, from vertically integrated operations to cutting-edge genetics and business technology solutions, all supported by robust data-driven insights.\n<br><br>\nAbout the companies that will combine to become TILT:\n<br><br>\n? Baker Technologies (Denver, CO) - The cannabis industry's largest software company, helps dispensaries generate more revenue and build relationships with their customers through a variety of products, featuring online\n<br><br>\nordering, customer loyalty, messaging, and analytics. The company works\n<br><br>\nwith over 1,000 dispensaries across the U.S. and Canada.\n<br><br>\n? Briteside (Bend, OR) - Briteside produces a diverse range of products and\n<br><br>\nservices, from prefabricated modular cultivation units to home delivery and subscription based services. All Briteside products are predicated on\n<br><br>\nproprietary algorithms designed to improve yields and efficiencies while\n<br><br>\nreducing costs and time.\n<br><br>\n? Sea Hunter Therapeutics (Boston, MA) - Established as a service provider and franchisor, Sea Hunter provides retail license holders with intellectual\n<br><br>\nproperty, operating expertise, capital, and a diverse range of products and\n<br><br>\ndifferentiated brands. The company also operates proprietary, vertical\n<br><br>\noperations which allows it to deliver a more knowledge-based product to\n<br><br>\ncustomers.\n<br><br>\n? Sante Veritas Therapeutics - One of the few licensed producers in\n<br><br>\nCanada that has a developed facility and robust portfolio of wholesale\n<br><br>\ncontracts. SVT's subsidiary, Santé Veritas Therapeutics Inc. (\"SVT Subco\"), is at the final stage of obtaining a cultivation license under the Access to\n<br><br>\nCannabis for Medical Purposes Regulations.\n<br><br>\nThis listing is for a job opportunity with Baker Technologies, Inc."}