{"job title": "QM Associate Scientist", "company": "BD (Becton, Dickinson and Company)", "city state": "– Sparks, MD", "rating": "NA", "job description": "Job Description SummaryThe QM Associate is responsible to apply basic scientific principles to routine laboratory work and for gaining experience in the application and interpretation of the department procedures. Will perform assigned routine laboratory tasks and learn the application of Quality procedures to ensure compliance. Works with SAP enterprise system to enter laboratory data and release material. Typically involved in routine testing of products and supplier materials and/or stability testing. Implements tasks and participates on teams. Ensures documentation compliance and processes documentation. Interaction limited to areas such as Operations and other Quality groups.\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nGeneral Responsibilities\n<br><br>\nThe QM Associate Scientist is a laboratory Microbiologist who is primarily responsible for Quality Control testing of prepared media against acceptance specifications. The QM Associate Scientist is responsible for product release and assuring documentation and procedures are followed, updated and maintained as required by internal Quality Policies and related FDA/GMP guidelines. The QM Associate Scientist conducts product testing, complaint investigation, special investigative testing, assists in the investigation of manufacturing issues and provides data and input on technical issues and projects.\n<br><br>\nSpecific Responsibilities\n\n\n<ul>\n<li>Responsible for Microbiology Quality Control testing in peptone manufacturing, raw material products, Tissue Culture Testing, Dyes&amp;Stains testing and Final DCM testing as required.</li>\n<li>The QM Associate Scientist is required to perform testing of various Microorganisms in a Bio-safety Level II and TB Laboratory with strict adherence to safety policies.</li>\n<li>Ability to work in a clean room environment and meet validation requirements associated with donning and doffing clean room garments. Various duties and abilities include:</li>\n<li>Demonstrating effective communication skills and the ability to work effectively with large multi-functional teams</li>\n<li>Responsible for Quality Control Microbiology testing of prepared media as well as preparing various medias from scratch. Knowledge of Microbiology and Biochemistry as it relates to bacteria, yeast, and fungi.</li>\n</ul>\n\nKnowledge/Skills\n\n\n<ul>\n<li>Basic knowledge of Microbiology as it applies to a lab setting Good problem solving skills with the ability to make independent decisions.</li>\n<li>Preferred knowledge of the following industry regulations FDA (Food and Drug Administration), GMP (Good Manufacturing Practice) / QSR (Quality System Regulation), ISO (International Organization of Standardization), USDA</li>\n<li>Experience in handling biological or chemical samples and knowledge of GLP</li>\n<li>Basic knowledge in a broad range of laboratory techniques</li>\n<li>History of self motivation with a background in biological lab science</li>\n<li>Experience in handling biological samples and knowledge of GLP</li>\n<li>Demonstrated verbal and written communication skills in a team environment as well as a desire to work within a team</li>\n<li>Capable of readily identifying and analyzing problems</li>\n<li>Have basic analytical skills and be familiar with database and statistical software</li>\n<li>Knowledge of lean or six-sigma tools preferred.</li>\n</ul>\n\n<strong>Education</strong>\n\n\n<ul>\n<li>BS or BA in related field required. Typical degree in Biological Sciences and/or Microbiology.</li>\n<li>1-2 years' experience preferred</li>\n</ul>\n\nPrimary Work LocationUSA MD - Baltimore\n<br><br>\nAdditional Locations\n<br><br>\nWork Shift1st Shift 630am-3pm (United States of America)"}