{"job title": "Product Data Management Engineer (Mid-Level)", "company": "Boeing", "city state": "– Renton, Washington", "rating": "3.5", "job description": "Company\n<br>\nThe Boeing Company\n<br><br>\nJob ID\n\n\n<ul>\n<li>*********</li>\n</ul>\n\nDate posted\n<br>\n<strong>08/30/2018</strong>\n<br><br>\nLocation\n<br>\nRenton Washington United States\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nBoeing Commercial Airplanes is seeking an experienced Product Data Management Engineer to support 7 series engineering in Renton, Washington.\n<br><br>\nJob Responsibilities include but not limited to:\n<br><br>\nManages BCA Boeing driven production airplane changes via the Production Revision Record (PRR) process for airplane programs. Supports design engineering from airplane change concept to airplane change incorporation into production.\n<br>\nDevelops and maintains project schedules, gathers and analyzes work statements to support overall project development and coordinate with change board for committing change into the production system; ensures products meets technical, regulatory and company requirements.\n<br>\nCoordinates and maintains relationships with Finance Estimating, Program Planning, Change Board, Engineering, Airplane Certification groups, and Supplier Management to ensure integration of all impacted parties required to support Boeing Driven Change.\n<br>\nTracks and reports data to monitor adherence to regulatory, data configuration and contractual requirements; supports/conducts audits and reviews to ensure products meet requirements.\n<br>\nLeads others, directs and manages all phases of developing project plan to support Engineering Change Request Planning Phase and PRR Commitment Phase using change management process and tools, and project management standards.\n<br>\nWorks under minimal direction.\n<br><br>\nEngineering Change Coordinator (ECC) Roles and Responsibilities:\n<br><br>\nLeads Boeing Driven Change (PRR) resolution efforts in support of the change management process by working with ENGR, Change Board, Bus Ops and Change Board Supplier Management to ensure change solution is ready for commitment.\n<br>\nResponsible for understanding the design/factory/supplier issue and helps to facilitate technical review meetings with affected ENGR groups and stakeholders.\n<br>\nProvides project management discipline to ensure quality and schedule performance.\n<br>\nConducts work statement review; input work statements for DE if/as required.\n<br>\nPublishes and maintain Engineering Change Memos (ECM)\n<br>\nCommunicate relevant change information/issues across airplane value stream (i.e., Management, ENGR, Bus Ops, Supplier Mgmt, Factory, BDS)\n<br>\nUtilize tools to process committed changes (ECAS/IBEX, ACMS, REDARS, PDM)\n<br>\nBoeing is the world's largest aerospace company and leading manufacturer of commercial airplanes and defense, space and security systems. We are engineers and technicians. Skilled scientists and thinkers. Bold innovators and dreamers. Join us, and you can build something better for yourself, for our customers and for the world.\n<br><br>\nDivision\n<br><br>\n737 Program\n<br><br>\nRelocation Assistance Available\n<br><br>\nNo. Relocation assistance is not a negotiable benefit.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nThis position must meet Export Control compliance requirements, therefore a US Person as defined by 22 C.F.R. 120.15 is required. US Person includes US Citizen, lawful permanent resident, refugee, or asylee.\n<br><br>\n<strong>Basic Qualifications (Required Skills/Experience):</strong>\n<br><br>\nBachelor, Master or Doctorate of Science degree from an accredited course of study, in engineering, computer science, mathematics, physics or chemistry.\n<br><br>\n<strong>Preferred Qualifications (Desired Skills/Experience):</strong>\n<br><br>\nFamiliarity of committed change management process.\n<br>\nEffective communication (written/verbal).\n<br>\nBuild positive relationships, fosters a collaborative environment.\n<br>\nProactive with strong attention to details; proven organizational/project management skills.\n<br>\nAbility to juggle day-to-day tasks with emergent/critical work.\n<br>\nEngineering Configuration - general knowledge and understanding of the technical considerations to integration of the product software/hardware\n<br>\nDesign, Manufacturing or Production experience.\n<br>\nKnowledge of product life-cycle.\n<br><br>\n<strong>Typical Education/Experience:</strong>\n<br><br>\nDegree and typical experience in engineering classification: Bachelor's and 5 or more years' experience, Master's degree with 3 or more years' experience or PhD degree with experience. Bachelor, Master or Doctorate of Science degree from an accredited course of study, in engineering, computer science, mathematics, physics or chemistry. ABET is the preferred, although not required, accreditation standard.\n<br><br>\nExperience Level\n<br><br>\nIndividual Contributor\n<br><br>\nJob Type\n<br><br>\nStandard\n<br><br>\nTravel\n<br><br>\nNo\n<br><br>\nContingent Upon Program Award\n<br><br>\nNo\n<br><br>\nUnion\n<br><br>\nYes\n<br><br>\nJob Code\n<br><br>\n<strong>6D2EP3</strong>"}