{"job title": "Data and Analytics Engineer III Auburn Hills or Dallas", "company": "Comerica", "city state": "– Auburn Hills, Michigan", "rating": "3.2", "job description": "Data Scientist\n<br>\nThe Data Scientist will leverage data to help the enterprise make more informed decisions to generate additional revenue, increase efficiencies, and reduce losses. They will be responsible for taking a project from requirement gathering phase all the way to implementation and monitoring results of the campaign.\n<br><br>\nPosition Competencies\n<br>\nSuccessful incumbents have excellent customer service skills, have strong inter-personal and communication skills, strong attention to detail, drive for results, decision quality, dealing with ambiguity, and ability to multi-task and have strong organizational skills.\n<br><br>\n<strong>Responsibilities:</strong>\n<br>\nSystem Engineering\n<br><br>\n· Partner with clients and technical resources to create, design, implement and or maintain applications in the appropriate environment.\n<br><br>\n· Create estimates (when applicable) for System Design, Development, Testing and / or Implementation.\n<br><br>\n· Identify potential system issues in projects, request fulfillment and / or individual assignment.\n<br><br>\n· Understand the Infrastructure (IaaS) and Platform as a Service (PaaS) models or other models needed for role.\n<br><br>\n· Conduct testing as defined in department standards.\n<br><br>\n· Monitor system performance and troubleshoot alerts from commercial, open source and locally developed monitoring tools as required.\n<br><br>\n· Provide system failure analysis and recovery recommendations.\n<br><br>\n· Participate in Business continuity planning and testing as required.\n<br><br>\n· Perform Hardware/software configuration.\n<br><br>\n· Serve as liaison with non-technical people, operations personnel, and/or field service personnel; interact directly with business partners to negotiate solutions and implementation specifics.\n<br><br>\n· Partner with application developers to deploy and operate our systems.\n<br><br>\n· Automate and streamline operations and processes.\n<br><br>\n· Build and maintain tools for deployment, monitoring and operations.\n<br><br>\n· Troubleshoot and resolve issues in our dev, test and production environments.\n<br><br>\n· Establishes/recommends policies and procedures for system use and services.\n<br><br>\n· Responsible for good inter-personal and communication skills; capable of writing proposals and papers, acting as a vendor liaison, making presentations to customer/client audiences or making professional presentations, work closely with upper management.\n<br><br>\nTechnical Consulting\n<br><br>\n· Perform technical analysis and make recommendation on small to medium initiatives with medium complexity.\n<br><br>\n· Explain technical solution to client and technical resources.\n<br><br>\n· Serve as a point of escalation for technical and general troubleshooting for small to simple incidents.\n<br><br>\nSupport\n<br><br>\n· Determination and resolution of root cause behind reported problems and issues.\n<br><br>\n· Development and/or maintenance of system documentation.\n<br><br>\n· Proactive maintenance toward select systems.\n<br><br>\n<strong>· Vendor upgrades:</strong>\n<br><br>\no Ensuring compliance with departmental standards\n<br><br>\no Enhancements to will allow improved performance\n<br><br>\n· Participates in the design, development, testing and implementation of enhancements required to maintain business unit success.\n<br><br>\n· Utilize all appropriate departmental guidelines and processes.\n<br><br>\n· Develop / Maintain appropriate application documentation.\n<br><br>\nMaster's degree or PhD from an accredited university in a quantitative filed such as statistics, operations research, computer science, econometrics, applied mathematics, engineering or related field is Preferred.\n<br><br>\nRelocation\n<br>\nRelocation assistance is not provided for this position.\n<br><br>\nTravel\n<br>\nTravel is not required for this position.\n<br><br>\n· 2 years of experience in an Analyst role\n<br><br>\n· 1 year of experience in database query using SQL and experience in data management tools\n<br><br>\n· 1 year of Large-scale data manipulation and integration experience\n<br><br>\n· 1 year of experience conducting quantitative analyses using statistical modeling and machine learning\n<br><br>\n· 2+ years of programming experience and proficiency in at least one of the following languages: R, SAS or Python\n<br><br>\n· 1 year of experience using a cloud platform like AWS (Azure is a plus)\n<br><br>\n· 1 year of experience presenting data to both technical and non-technical audiences (Power BI is a plus)\n<br><br>\n· College Degree or High School Diploma or GED and 2 years of experience\n<br><br>\nEqual Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}