{"job title": "Big Data Engineer", "company": "CyberCoders", "city state": "– San Jose, CA", "rating": "3.8", "job description": "Big Data Engineer <div>\nBased in the San Jose, CA area, we are one of the most innovative, global analytics solutions companies in the World. We are an well-funded, offering exposure to fortune level clients, and the chance to change the way people interact with the world on a daily basis. Our team is composed of experts in the world of Big Data with a leadership team that brings experiences from leading global technology firms and pride themselves in their hands-on, mentor level management style.\n<br><br>\nWe are committed to continually leveraging and optimizing Deep Learning AI technologies that challenge the status quo and evolve data solutions that generate clinical insights in days versus months, reducing drug development timelines by up to 26 weeks and expediting the delivery of your breakthrough therapies to the patients who need them.\n<br><br>\nIf you are a strong Big Data Architect with Java and Hadoop expertise, we would welcome the opportunity to discuss the details.</div>\n<br>\nWhat You Need for this Position<div>\nCurrently hands on development of in Big Data Hadoop ecosystem &amp; Analytics space\n<br>\nMinimum of 10+ years of hands-on experience including architecture, design of enterprise applications in Java, Spring, Hibernate, Restful Web Services, HTML5, AngularJS, Python, AWS/Google compute/Azure.\n<br>\nExperience of implementing solutions on Big data technologies like - Hadoop, SPARK, Pig, Hive, Spark, Storm, Impala, Oozie, Mahout, Flume, ZooKeeper and/or Sqoop\n<br>\n3+ years of experience as a technology leader designing and developing data architecture solutions with more than 2+ years specializing in big data architecture or data analytics.\n<br>\nCome up with solutions based on open source Big Data Analytics framework.\n<br>\nClosely follow the changes in the open source community specifically regarding Big Data, Data Science and Analytics</div>\n\n<br>What's In It for You<div>\nWe are willing to offer excellent compensation packages including annualized pay potential of $120k - $200k, plus EQUITY, and excellent benefits.</div>\n<br>\n<div>\nSo, if you are looking for a growth opportunity, please apply today!</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}