{"job title": "Senior Data Engineer", "company": "CyberCoders", "city state": "– Palo Alto, CA", "rating": "3.8", "job description": "Senior Data Engineer <div>\nIf you are a Senior Data Engineer with experience, please read on!\n<br><br>\nWe are a top international company whose app quickly rose to the #1 spot in Asia, and since then, we've expanded into the US and UK. We are looking to add a few talented Senior Data Engineers to our team in the Bay area!</div>\n\n<br>What You Will Be Doing<div>\n\n\n<ul>\n<li>Design, build and operate ETL pipeline at scale.</li>\n<li>Development and operation of API/tools related to data products and machine learning products.</li>\n<li>Automation of processes related to data products and machine learning products.</li></ul></div>\n\n\nWhat You Need for this Position<div>\nMS/ PhD in Computer Science or equivalent\n<br>\nAt Least 3 Years of experience and knowledge of:\n\n\n<ul>\n<li>Machine Learning</li>\n<li>ETL</li>\n<li>API Tools</li>\n<li>Experience building out Data Pipelines</li>\n</ul>\n\n<strong>Nice to Haves:</strong>\n\n\n<ul>\n<li>Apache Airflow</li>\n<li>Container: Docker/Kubernets</li>\n<li>Cloud: Google Cloud</li>\n<li>Beam or Spark</li></ul></div>\n\n\nWhat's In It for You<div>\nCompetitive compensation package DOE, comprehensive benefits package, generous PTO, great company culture, and more!</div>\n<br>\n<div>\nThis is an urgent role with ongoing interviews, so please answer the screening questions to expedite your application process!</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}