{"job title": "Data Engineer (Contract-to-hire)", "company": "CyberCoders", "city state": "– Seattle, WA", "rating": "3.8", "job description": "Data Engineer (Contract-to-hire) <div>\nIf you are a Data Engineer with at least 5 years of experience and are interested in working for an industry-leading company that specializes in manufacturing and design of large-scale vehicles on a contract-to-hire basis, read on!</div>\n\n<br>What You Will Be Doing<div>\nYou will join our team of engineers and work on transforming incoming data into information that can be analyzed and used to drive business decisions. Responsibilities include building data pipelines, managing data warehouses and supporting how our data is produced and used.</div>\n<br>\nWhat You Need for this Position<div>\nMore Than 5 Years of experience with/knowledge of:\n\n\n<ul>\n<li>Data (Engineering/Analytics/Processing/Architectures)</li>\n<li>AWS (EC2, DynamoDB, ElasticSearch, etc.)</li>\n<li>Python/GO/Ruby/JavaScript/Scala</li>\n<li>Cloud Computing &amp; Cloud Services</li>\n<li>ETL</li>\n<li>SQL Server/Oracle/MySQL/Postgres/Teradata</li></ul></div>\n\n\nWhat's In It for You<div>\n<strong>Once hired on full-time, we offer:</strong>\n\n\n<ul>\n<li>Vacation/PTO</li>\n<li>Medical</li>\n<li>Dental</li>\n<li>Vision</li>\n<li>Relocation</li>\n<li>Bonus</li>\n<li>401k</li></ul></div>\n\n\n<div>\nSo, if you are a Data Engineer with at least 5 years of experience, apply today!</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}