{"job title": "Financial Big Data Engineer", "company": "CyberCoders", "city state": "– Charleston, SC", "rating": "3.8", "job description": "Financial Big Data Engineer <div>\nDisruptive. Game Changer. Truly innovative. These are just some of the ways we've been described in multiple media outlets &amp; in the financial world. We are a leader in high-performance, ultra low-latency financial technology and we are changing the way that investors and traders compete and do business. We are effectively creating an equal playing field for all investors, traders and firms of any size to compete with the big boys. Our team is composed of the best and the brightest, working on big data, matching engine technology all while maintaining a casual, laid-back working environment. We are looking for high-energy, down-to-earth developers &amp; engineers who are ready to build out our next-gen technology and continue to disrupt the market. We need 3-4 senior engineers who are strong with Python, Scala building large-scale big data applications. We can hire people in either the Charleston, SC area or NYC and can offer some relocation assistance so apply today!</div>\n\n<br>What You Will Be Doing<div>\n\n\n<ul>\n<li>Coding daily in languages like Python, Scala to integrate, architect &amp; implement data analytic tools for trading and financial markets</li>\n<li>This role combines the latest open source &amp; proprietary tech that you will be exposed to - supporting back end systems written in C++, front-end using NodeJS, Angular</li>\n<li>Working with Big Data Technology like SPARK, Hadoop, etc.</li>\n<li>Building highly-scalable, massively parallel trading infrastructure &amp; platform for real time analysis of tera/petabyte data stores (50 billion + records!!)</li>\n<li>Building tech that processes huge amounts of real-time market data</li></ul></div>\n\n\nWhat You Need for this Position<div>\n\n\n<ul>\n<li>BS &amp; MS (Preferred) in CS / EE / CE and outstanding background in coding fundamentals in a production environment</li>\n<li>Python or Scala experience is a must</li>\n<li>Background building out large-scale, big data apps using tech like HDFS internals, kafka streams, spark stream, etc.</li>\n<li>SDLC, Version control experience</li>\n<li>Background with orchestration, containers, CI/CD Pipelines, etc.</li>\n<li>Open source SW experience (puppet, Nagios, BIND, zookeeper, PostgreSQL, etc.) are a big plus</li>\n<li>Full-scale Software Development LifeCycle experience including Test-Driven or Behavioral-Driven development experience (BDD/ TDD)</li>\n<li>Experience working with large data sets, data stores, distributed computing &amp; related tools is a plus</li>\n<li>Hands on Linux operating system experience, Bash, Unix Scripting / Unix Command Line experience is a big plus</li>\n<li>Passion for &amp; ideally some hands on experience with real-time financial analysis, large-scale big data application, low-latency microstructure &amp; ideally some finance or related product experience (not a must)</li>\n<li>Must be a good problem solver and have a drive to make the right decisions the first time in a fast-paced environment</li></ul></div>\n\n\nWhat's In It for You<div>\n\n\n<ul>\n<li>Top pay, benefits, stock and ability to work in one of the most exciting technology fields</li>\n<li>Casual but fast-paced Silicon-Valley style work environment, surrounded by the best and the brightest technical and financial minds</li>\n<li>Make a true impact on our company and products with high-visibility and possibilities for career growth</li>\n<li>The opportunity to gain meaningful career development while working with the core development team</li>\n<li>Opportunity to learn a ton and to continue to grow as a developer / engineer</li></ul></div>\n\n\n<div>\nSo, if you are a top big data developer or engineer with a track record of releasing successful large-scale big data applications, please apply today!</div>\n\n<li><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}