{"job title": "Data Analyst", "company": "Decisive Data", "city state": "– Redmond, WA", "rating": "3.7", "job description": "Our organization delivers top-notch business intelligence solutions to our clients. The team is agile, lean, and composed of hard working, smart, self-starting individuals. We prize ingenuity, allow chances to push the envelope, and more than anything we prize critical thinking and excellence.\n<br><br>\nWhether you're a recent grad or an experienced consultant who's done it all, we're looking for a multi-talented data analyst who's looking to make a big impact. Projects include sales pipeline measurement, healthcare efficiency reporting, and sales/competitive intelligence product development.\n<br><br>\nWe are looking for an individual with a natural ability to understand our client's business questions and use data to quantify and gain knowledge required to answer the questions at hand.\n<br><br>\nPractical work experience background with database design, SQL development/data extraction, and Excel/Tableau report design will put you ahead of the curve.\n<br><br>\nA background in computer science and data driven applications is preferred. However, if you are a recent graduate of a program such as Applied Mathematics, Physics, or Management Information Systems, and think you are a good fit, then we'd love to hear from you.\n<br><br>\n<strong>Duties and Responsibilities:</strong>\n<ul>\n<li>Partner with clients to learn their business and build valuable new reports</li><li>Capture requirements and collaborate with BI developers to deliver new metrics and reports</li><li>Be a high-horsepower contributor delivering, standardizing, and organizing data for business uses</li><li>Take initiative where appropriate to drive project architecture and processes</li><li>Represent our company and build great relationships with clients in various industries.</li>\n</ul>\n<strong>Requirements:</strong>\n<ul>\n<li>Understand the problem at hand, study possible solutions, and find creative answers</li><li>Compose clear, concise and well formatted emails</li><li>Communicate issues and questions as soon as they become apparent</li><li>Excellent problem solving, analytical, communication and customer-facing skills</li><li>Team player and excellent collaborator</li><li>Willingness to dive into new technologies</li><li>Self-motivated, able to work independently, active participant in career growth</li><li>Basic experience with report design and delivery using Excel/Tableau/Pivot Table</li><li>Willingness to travel 25%</li>\n</ul>\n<strong>Beneficial Background and Skills:</strong>\n<ul>\n<li>SQL database development; T-SQL; and complex query development</li><li>Business Intelligence Training with emphasis on SQL Server Analysis Services Cubes / Tabular / Tableau</li><li>Understanding of ETL principles such as meta-driven ETL, table driven business rules, and dimensional modeling</li><li>Business acumen around software and high-tech manufacturing business processes</li><li>BS degree in Computer Science/ACMS/MIS</li><li>Microsoft SQL Server certifications (i.e. MCDBA, MCSD, MCSE)</li>\n</ul>\n<em>Decisive Data is an Equal Opportunity Employer. Decisive Data prohibits discrimination and harassment against any employee or applicant for employment because of race, color, age, religion, sex, national origin, sexual identity or expression, sexual orientation, disability, veteran, military or marital status, genetic information or any other protected status.</em><br><br><strong>Job Posted by ApplicantPro</strong>\n<br>"}