{"job title": "Principal Pharmacometrics Scientist", "company": "Novartis Pharmaceuticals", "city state": "– Cambridge, MA", "rating": "NA", "job description": "Job Description<br><br>The Principal Pharmacometrics Scientist leads the execution and delivery of pharmacometrics tasks on assigned projects within (early/full) clinical development.<br><br>Together with the PMX Development Unit leadership, s/he is responsible for the discussion and implementation of pharmacometric methodologies that optimally address the research and development objectives on assigned projects.<br><br>1.Project level:<br><br>a.Provide pharmacometric support for assigned projects, and proactively seek the support and input from senior PMX colleagues and PMX Development Unit leadership.<br><br>b.In collaboration with NIBR or Development quantitative partners (e.g. Statistics, PK Sciences), the PMX Development Unit leader and senior PMX associates, negotiate and develop pharmacometric objectives and deliverables.<br><br>c.In collaboration with partners in (early/full) Global Project Teams, provide pharmacometric support for the quantitative evaluation of competing trial/analysis strategies assuring robust support to clinical development planning and execution and alignment with clinical development plans and target product profiles.<br><br>d.In collaboration with PMX Development Unit leadership write and execute modeling plans, and deliver reports of results.<br><br>e.Contribute to the pharmacometric scientific content of materials for internal decision boards/regulatory/submission documents: Briefing Books, decision criteria, trial design(s), responses to trial-specific Health Authority questions.<br><br>f.Align with the Analytics team (biometrician, data management, database programming, programming, medical and scientific writing) on the pharmacometric strategy and execution on assigned projects.<br><br>2.Global Line Function level: Contribute to departmental initiatives (e.g. infrastructure/ process-related or scientific activities) as agreed with PMX Development Unit leadership.<br><br>3.Enterprise level: Promote the use of innovative methods within the organization, through scientific collaborations, publications in scientific peer reviewed journals and presentations at professional meetings.<br><br>Key Performance Indicators :<br><br>1.Quality and timeliness of pharmacometrics contribution in the implementation of robust, high quality research or development projects (including design, execution and delivery), as assessed by the respective team members and/or by the PMX Development Unit leader.<br><br>2.Pro-active at project level presentation of pharmacometrics in the Global Project Teams, as assessed by the respective NIBR or development team members and/or by the PMX Development Unit leader.<br><br>3.Application of high quality pharmacometrics methodology in the assigned clinical trials as assessed by the respective clinical team members and/or by the PMX Program leader.<br><br>4.Contributes to strong PMX team dynamics to support robust Clinical Programs as assessed by team colleagues.<br><br>Job Dimensions (Indicate key facts and figures)<br><br>Number of associates:<br><br>Financial responsibility:<br><br>Impact on the organization:<br><br>1.High impact by leading pharmacometric planning, execution and evaluation of development projects and assuring health authority acceptability.<br><br>2.Timely, efficient clinical trials. Quality drug development milestone transitions, and submissions.<br><br>3.Increased commercial value of brands.<br><br>Employment Type<br><br>Regular"}