{"job title": "Hub Data Analyst, Bureau of Primary Care Information Project", "company": "NYC Department of Health and Mental Hygiene", "city state": "– New York, NY", "rating": "3.3", "job description": "<div>\n<div>\n<div><strong>DEPT OF HEALTH/MENTAL HYGIENE</strong></div><br>\n\n<div><strong>Job Posting Notice</strong></div> </div><br>\n\n<div>Job Details<br>\n\n<div><strong>Job ID:</strong></div><div> 361758</div><br>\n\n<div><strong># of Positions:</strong></div><div> 1</div><br>\n\n<div><strong>Business Title:</strong></div><div> Hub Data Analyst, Bureau of Primary Care Information Project</div>\n\n<br><strong><div>Civil Service Title:</div>\n<br>\n</strong>\n<br>\n<strong><div>Title Code No:</div>\n<br>\n</strong>\n<br>\n<div><strong>Level:</strong></div><div> 21744</div>  <div> 01</div><br>\n\n<div> CITY RESEARCH SCIENTIST</div><br>\n\n<div><strong>Title Classification:</strong></div><div> Non-Competitive</div><br>\n\n<div><strong>Job Category:</strong></div><div> Health, Policy, Research &amp; Analysis</div><br>\n\n<div><strong>Proposed Salary Range:</strong></div><div> $ 59,708.00 - $ 65,678.00 (Annual)</div><br>\n\n<div><strong>Career Level:</strong></div><div> Experienced (non-manager)</div><br>\n\n<div><strong>Work Location:</strong></div><div> 42-09 28th Street</div><br>\n\n<div><strong>Division/Work Unit:</strong></div><div> Primary Care Info Project</div><br>\n\n<div>\n<div> Job Description</div><br>\n\n<div> Hiring Rate: $58,708 (Flat Rate)\n<br><br>\nThe NYC Department of Health and Mental Hygiene (DOHMH) Primary Care Information Project (PCIP) is devoted to improving health by promoting and supporting primary care. The PCIP works with over 1,300 health care organizations on increasing clinical prevention opportunities, reducing health disparities, managing/preventing chronic disease, and creating community linkages to support health promotion. We strive to transform the quality of health care services by helping providers use electronic health records (EHRs) and transform clinical workflows to improve the quality of care. The Hub Data Analyst will be responsible for producing and analyzing clinical data derived from electronic health records. These data are from health care settings and are pre-aggregated to create reports and data sets to assess the quality of care and preventive service utilization in primary care settings. In addition, reports are created from this unique data source to support PCIP's quality improvement programs, to track and explain trends, and to relay the results of this data to other DOHMH programs for use in resource allocation, program evaluation, policy, and planning. The Analyst will work with a dynamic, cross-disciplinary team that extracts data from the Hub Population Health System (the Hub), a cutting-edge, real-time query system which gathers aggregate data from EHRs at more than 700 doctor's offices, community health centers, and hospital clinics. The Hub covers 2 million patients per year in NYC and allows the DOHMH to answer relevant public health questions in a timely manner.\n<br><br>\n<strong>DUTIES WILL INCLUDE BUT NOT BE LIMITED TO:</strong>\n\n\n<ul>\n<li>-Collect, clean, analyze and report on data derived from clinical systems to produce reports, presentations, papers and other tabular and graphical summaries of findings for dissemination internally and externally to support the evaluation of PCIP's programs, and to explore topics relevant to PCIP and DOH priorities, such as chronic disease and quality of care.</li>\n<li>-Assist with quality assurance processes and query writing for the Hub, using SQL logic in conjunction with working knowledge of EHR data structure and clinical workflows.</li>\n<li>-Partner with other DOHMH bureaus to develop joint projects that analyze Hub data to support and promote primary care.</li>\n<li>-Rapidly respond to requests for data from the Bureau, Division and Agency leadership.</li>\n<li>-Assist with and conduct analyses on an ad hoc basis as requests come in from different PCIP teams.</li>\n<li>-Present on evaluation and Hub activities (i.e., internal staff meetings; agency workgroups etc.).</li>\n<li>-Contribute to the writing of manuscripts, white papers or other summaries of research and program evaluation findings; pursue personal research interests aligning with PCIP and Hub team goals.</li></ul></div> \n\n\n<div> Minimum Qual Requirements</div><br>\n\n<div> 1. For Assignment Level I (only physical, biological and environmental sciences and public health) A master's degree from an accredited college or university with a specialization in an appropriate field of physical, biological or environmental science or in public health.\n<br>\nTo be appointed to Assignment Level II and above, candidates must have:\n\n\n<ul>\n<li>A doctorate degree from an accredited college or university with specialization in an appropriate field of physical, biological, environmental or social science and one year of full-time experience in a responsible supervisory, administrative or research capacity in the appropriate field of specialization; or</li>\n<li>A master's degree from an accredited college or university with specialization in an appropriate field of physical, biological, environmental or social science and three years of responsible full-time research experience in the appropriate field of specialization; or</li>\n<li>Education and/or experience which is equivalent to \"1\" or \"2\" above. However, all candidates must have at least a master's degree in an appropriate field of specialization and at least two years of experience described in \"2\" above. Two years as a City Research Scientist Level I can be substituted for the experience required in \"1\" and \"2\" above.</li>\n</ul>\n\n<strong>NOTE:</strong>\n<br>\nProbationary Period\n<br>\nAppointments to this position are subject to a minimum probationary period of one year.</div><br>\n\n<div> Preferred Skills</div><br>\n\n<div> --Excellent written and oral communication skills.\n\n\n<ul>\n<li>-Ability to work collaboratively in a cross-disciplinary team environment.</li>\n<li>-Demonstrated organizational skills and detail orientation.</li>\n<li>-Analytic and statistical skills with experience in manipulating and analyzing data using statistical software; SAS preferred</li>\n<li>-Knowledge of epidemiological data analysis, research, and program evaluation methodologies.</li>\n<li>-Willingness to adapt to new data structures and tackle novel problems creatively.</li>\n<li>-Working knowledge of or interest in a range of public health topics.</li>\n<li>-Familiarity with geographical information software such as ArcMap preferred.</li>\n<li>-Experience with scientific writing preferred.</li>\n<li>-Competency in Microsoft Office (Word, Excel, and PowerPoint)</li></ul></div> \n\n\n<div> Additional Information</div> \n\n<br><strong></strong><div><strong>\n\n\n<ul>\n<li>*IMPORTANT NOTES TO ALL CANDIDATES:</li>\n</ul>\n\n</strong>\n<br>\nPlease note: If you are called for an interview you will be required to bring to your interview copies of original documentation, such as:\n\n<li> A document that establishes identity for employment eligibility, such as: A Valid U.S. Passport, Permanent Resident Card/Green Card, or Driver's license.\n\n</li><li> Proof of Education according to the education requirements of the civil service title.\n\n</li><li> Current Resume\n\n</li><li> Proof of Address/NYC Residency dated within the last 60 days, such as: Recent Utility Bill (i.e. Telephone, Cable, Mobile Phone)\n<br><br>\nAdditional documentation may be required to evaluate your qualification as outlined in this posting's \"Minimum Qualification Requirements\" section. Examples of additional documentation may be, but not limited to: college transcript, experience verification or professional trade licenses.\n<br><br>\nIf after your interview you are the selected candidate you will be contacted to schedule an on-boarding appointment. By the time of this appointment you will be asked to produce the originals of the above documents along with your original Social Security card.\n\n\n<ul>\n<li>*LOAN FORGIVENESS</li>\n</ul>\n\nThe federal government provides student loan forgiveness through its Public Service Loan Forgiveness Program (PSLF) to all qualifying public service employees. Working with the DOHMH qualifies you as a public service employee and you may be able to take advantage of this program while working full-time and meeting the program's other requirements.\n<br><br>\nPlease visit the Public Service Loan Forgiveness Program site to view the eligibility requirements:\n<br><br>\nhttps://studentaid.ed.gov/sa/repay-loans/forgiveness-cancellation/public-service</li></div><br>\n\n<div> To Apply</div><br>\n\n<div> Apply online with a cover letter to https://a127-jobs.nyc.gov/. In the Job ID search bar, enter: job ID number # 361758.\n<br><br>\nWe appreciate the interest and thank all applicants who apply, but only those candidates under consideration will be contacted.\n<br><br>\nThe NYC Health Department is committed to recruiting and retaining a diverse and culturally responsive workforce. We strongly encourage people of color, people with disabilities, veterans, women, and lesbian, gay, bisexual, and transgender and gender non-conforming persons to apply.\n<br><br>\nAll applicants will be considered without regard to actual or perceived race, color, national origin, religion, sexual orientation, marital or parental status, disability, sex, gender identity or expression, age, prior record of arrest; or any other basis prohibited by law.</div><br>\n\n<div> Residency Requirement</div><br>\n\n<div> New York City residency is generally required within 90 days of appointment. However, City Employees in certain titles who have worked for the City for 2 continuous years may also be eligible to reside in Nassau, Suffolk, Putnam, Westchester, Rockland, or Orange County. To determine if the residency requirement applies to you, please discuss with the agency representative at the time of interview.</div> </div><br>\n\n<div><strong>POSTING DATE:</strong></div><div> 08/30/2018</div><br>\n\n<div><strong>POST UNTIL:</strong></div><div> 12/21/2018</div> </div><br>\n\n<div><strong>The City of New York is an Equal Opportunity Employer</strong></div> </div>\n\n<br>"}