{"job title": "Senior Machine Learning Scientist", "company": "Partners HealthCare(PHS)", "city state": "– Boston, Massachusetts", "rating": "NA", "job description": "As a not-for-profit organization, Partners HealthCare is committed to supporting patient care, research, teaching, and service to the community by leading innovation across our system. Founded by Brigham and Women's Hospital and Massachusetts General Hospital, Partners HealthCare supports a complete continuum of care including community and specialty hospitals, a managed care organization, a physician network, community health centers, home care and other health-related entities. Several of our hospitals are teaching affiliates of Harvard Medical School, and our system is a national leader in biomedical research.\n<br><br>\nWe're focused on a people-first culture for our system's patients and our professional family. That's why we provide our employees with more ways to achieve their potential. Partners HealthCare is committed to aligning our employees' personal aspirations with projects that match their capabilities and creating a culture that empowers our managers to become trusted mentors. We support each member of our team to own their personal development-and we recognize success at every step.\n<br><br>\nOur employees use the Partners HealthCare values to govern decisions, actions and behaviors. These values guide how we get our work done: Patients, Affordability, Accountability &amp; Service Commitment, Decisiveness, Innovation &amp; Thoughtful Risk; and how we treat each other: Diversity &amp; Inclusion, Integrity &amp; Respect, Learning, Continuous Improvement &amp; Personal Growth, Teamwork &amp; Collaboration.\n<br><br>\n<strong>General Summary/Overview</strong>\n<br><br>\nThe Center for Clinical Data Science (CCDS) is an exciting new undertaking by Massachusetts General Hospital (MGH), in conjunction with Partners HealthCare, that aims to transform healthcare through data science. With unparalleled access to clinicians who are world-experts in their field, collaborations with top academic researchers at Harvard and MIT, and support from policy leaders who are shaping medicine today, we have all the resources needed to make a large impact. Moreover, with state of the art computing power and IT infrastructure, and the flexibility to pursue your passions, you will have all the tools you need to use data science to help make medicine better.\n<br><br>\nWe are seeking highly skilled machine learning scientists with significant experience in machine learning and advanced statistics. The focus of this position is to apply the newest mathematical techniques to help generate value from the Partners HealthCare System's immense repository of health records. With unparalleled access to clinical data and expert clinicians, as well as a world-class information technology (IT) team, CCDS provides the perfect environment to focus on using analytics to effect tangible advancements in medicine.\n<br><br>\n<strong>Principal Duties and Responsibilities</strong>\n\n\n<ul>\n<li>Lead research projects aimed at using clinical data to improve healthcare.</li>\n<li>Conceptualize and develop machine learning-empowered products.</li>\n<li>Interface with physicians to help answer important clinical questions based on medical imaging, pathology, and electronic health record data.</li>\n<li>Design frameworks for interfacing between health IT systems and research workflows.</li>\n<li>Work with academic collaborators to understand needs and implement cutting edge algorithms with machine learning.</li>\n<li>Use the Partners HealthCare values to govern decisions, actions and behaviors. These values guide how we get our work done: Patients, Affordability, Accountability &amp; Service Commitment, Decisiveness, Innovation &amp; Thoughtful Risk; and how we treat each other: Diversity &amp; Inclusion, Integrity &amp; Respect, Learning, Continuous Improvement &amp; Personal Growth, Teamwork &amp; Collaboration.</li>\n<li>Other duties as assigned.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>PhD or equivalent combination of experience and education (i.e. Masters degree and 4+ years of experience) in a quantitative field (i.e. engineering, computer science, physics, mathematics)</li>\n</ul>\n\n\n<ul>\n<li>Deep experience in data analysis, signal processing, modeling, and machine learning is required</li><li> Fluent in Python</li> <li> Highly comfortable in one of Tensorflow, PyTorch, or Caffe2</li>\n\n<ul>\n<li> Must be able to leverage one of these frameworks directly</li> \n</ul>\n\n<li> Highly comfortable in the theory and practice of neural networks</li>\n\n<ul>\n<li> Capable of debugging faulty network architectures</li> <li> Experience distributing training across many GPUs</li> \n</ul>\n\n<li> Highly comfortable in traditional machine learning algorithms (e.g., SVM, boosting, bagging, etc.)</li> <li> Highly comfortable in SQL</li> <li> Comfortable working independently and defining measurable, achievable goals</li> <li> Experience shipping ML solutions in product</li> \n</ul>\n\n<strong>Skills/Abilities/Competencies Required</strong>\n<br>\n<ul>\n<li>Excellent interpersonal skills to effectively communicate with cross functional teams including staff at all levels of the organization including both technical and non-technical personnel</li>\n<li>Exceptional problem solving and negotiation skills</li>\n<li>Self-motivated, independent and possesses the ability to learn quickly</li>\n<li>Ability to successfully negotiate and collaborate with others of different skill sets, backgrounds and levels within and external to the organization</li>\n</ul>\n\n<strong>Working Conditions</strong>\n<br>\n<ul>\n<li>Working with our team on site as well as traveling to meet collaborators at multiple sites in the Boston area</li>\n<li>Occasional travel to professional seminars and conferences</li>\n</ul>\n\n<strong>Supervisory Responsibility</strong>\n<br><br>\nNone; may indirectly provide leadership and guidance to less seasoned and new staff\n<br><br>\n<strong>Fiscal Responsibility</strong>\n<br><br>\n<ul>\n<li>Will oversee operating budget for a research project</li>\n<li>Demonstrates fiscal responsibility by effectively using CDSC resources</li>\n</ul>\n\n<strong>EEO Statement</strong>\n<br>\nPartners HealthCare is an Equal Opportunity Employer &amp; by embracing diverse skills, perspectives and ideas, we choose to lead. All qualified applicants will receive consideration for employment without regard to race, color, religious creed, national origin, sex, age, gender identity, disability, sexual orientation, military service, genetic information, and/or other status protected under law. Partner's Healthcare is acting as an Employment Agency in relation to this vacancy."}