{"job title": "SENIOR ASSOCIATE SCIENTIST", "company": "RADGOV", "city state": "– Spring House Pennsylvania", "rating": "1.8", "job description": "<div>The Senior Associate Scientist will join the Discovery team within the Oncology Department at client and aide in the advancement of early stage therapeutic targets in ImmunoOncology. S/he will be responsible for acting independently to generate relevant data for selection of clinical candidates as well as early target discovery and validation. The position resides in a highly interactive team, so collaborative spirit, excellent communication skills, both written and verbal, and strong interpersonal skills are both necessary and highly valued. \n<br>\nThe Senior Associate Scientist will design, perform and interpret complex in vitro, ex vivo and in vivo experiments. Flow cytometry and MSD experience is required. Proficiency in cellular immunologic assays that could include FACS, ELISAs, cell proliferation, cellular cytotoxicity, immune cell isolation from whole blood or tissues, cell culture, is ideal. S/he must demonstrate the ability to analyze and present data in professional 'publication ready' format. S/he will work independently and manage multiple experiments simultaneously. S/he will contribute to various projects outside of his/her own, and collaborate with stakeholders from all relevant functions, keep up-to-date with the literature related to his/her field, and be able to demonstrate clear and professional verbal and written communication. \n<br>\n<strong>Qualifications</strong>\n<br><br>\nA B.S. /B.A. with 4-8 years of experience OR a M.S. with 3-5 years of experience performing progressively advanced duties at the Associate Scientist II level, or the equivalent training/experience is required. Strong cell biology and assay development skills are required. Previous experience analyzing immune compartments/responses in presence of therapeutics is highly desirable. A good background in cancer biology or immunology is desirable. Intellectually curious and well informed on the latest scientific advances in the field is desirable. Excellent interpersonal skills with the ability to interact effectively with people, internally and externally is required. Detail-oriented, with excellent organizational and record-keeping skills is required. Excellent oral and written communication skills are required. Able to effectively present scientific data and concepts to international standards is required. Prior biotech/pharma experience is preferred. This position is located in Spring House, PA.</div>"}