{"job title": "Sr. Research Scientist", "company": "Spark Therapeutics", "city state": "– Philadelphia, PA", "rating": "2.3", "job description": "Join the Spark Team\n<br><br>\nWe were born of innovation, springing from the curiosity, imagination and dedication of remarkable scientists and healthcare visionaries. Our shared mission is to challenge the inevitability of genetic disease by discovering, developing, and delivering treatments in ways unimaginable until now.\n<br><br>\nWe don't follow footsteps. We create the path.\n<br><br>\nSummary\n<br><br>\nThe Research Scientist is a key member of the Liver Discovery Research Group and participates in the development of Spark's liver-targeted gene therapy products. S/he will actively participate in the development of novel targets, facilitating translation from in vitro through in vivo proof of concept.\n<br><br>\n<strong>S/he will be responsible for:</strong>\n\n\n<ul>\n<li>Collaborating with other Translational Research Scientists to develop pre-clinical programs from early discovery to the clinic.</li>\n<li>Designing and conducting in vitro and in vivo experiments to optimize pre-clinical development of liver-directed candidates.</li>\n<li>Initiating and overseeing joint programs with external collaborators.</li>\n<li>Writing study reports, manuscripts and present results at appropriate scientific meetings.</li>\n</ul>\n\nThe Senior Research Scientist position requires extensive experience with molecular biology, biochemistry and immunoassays including:\n\n\n<ul>\n<li>Design and construction of optimized gene expression cassettes to increase transgene expression derived from liver cells.</li>\n<li>Experience with design, execution, and data analysis of experimental studies utilizing both cell-based and in vivo models.</li>\n<li>Some experience or familiarity with liver-directed gene therapy and/or AAV vectors is preferred.</li>\n</ul>\n\n<strong>Responsibilities</strong>\n<br><br>\n<strong>70%</strong>\n\n\n<ul>\n<li>Work in the labs to perform experiments described above in the primary job duties</li>\n</ul>\n\n<strong>15%</strong>\n\n\n<ul>\n<li>Design experiments, organize, discuss, and record experimental data.</li>\n</ul>\n\n<strong>10%</strong>\n\n\n<ul>\n<li>Generate technical reports, prepare presentation slides, generate novel concepts.</li>\n</ul>\n\n<strong>5%</strong>\n\n\n<ul>\n<li>Trainings, lab meetings and administration work</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Experience in general and advanced lab techniques such as molecular cloning, plasmid design and construction, qPCR, ELISA, luciferase and enzymatic activity assays, SDS-PAGE/western blotting, etc.</li>\n<li>Experience with studies in laboratory animals.</li>\n<li>Strong analytical skills and problem-solving capabilities</li>\n<li>Proven ability to work independently in hands-on laboratory setting, self-motivated to learn and develop new techniques, perform multiple tasks simultaneously, keep accurate records, follow instructions, and comply with company policies.</li>\n<li>Excellent communication (oral and written) skills</li>\n<li>Familiar with computer software commonly used in bio/pharma industries.</li>\n<li>Works with colleagues as a team player.</li>\n<li>Strong organizational skills.</li>\n<li>Strong publication record is a plus.</li>\n<li>Experience managing external collaborations is a plus.</li>\n<li>Experience with AAV vectors is preferred.</li>\n</ul>\n\n<strong>Requirements</strong>\n\n\n<ul>\n<li>Ph.D. in relevant scientific discipline required (e.g. cell and molecular biology, biochemistry, etc.)</li>\n<li>Generally has at least 5 years of hands-on research experience with gene therapies targeting the liver</li>\n</ul>\n\nNearest Major Market: Philadelphia"}