{"job title": "Senior Data Engineer", "company": "Staples", "city state": "– Framingham, MA", "rating": "3.1", "job description": "Description\n<br><br>\nWe are seeking a highly motivated Senior Software Engineer who will work on delivering exceptional functionalities to Staples customers. The person in this role will be working with our data science to deliver personalized recommendations and personalized experiences.\n<br><br>\nAs a Senior Software Engineer, you will be responsible for:\n\n\n<ul>\n<li>Design, development&amp;maintenance of various functionalities and components for the rollout of new applications and services to Staples customers and internal use.</li>\n<li>Working with Data Scientist to discover, acquire and prepare new data sources that can be leveraged in modeling.</li>\n<li>Analyzing and evaluating business requirements by working with peers and management. Provide recommendations on the nature, scope and complexity of solutions using the SAFE Agile methodologies.</li>\n<li>Working on client-facing projects in small teams.</li>\n<li>Document the functional and technical specifications and project plans for proposed solutions to business requirements of moderate to high complexity.</li>\n<li>Writing code that is of high standards in terms of quality and usability while not compromising on security.</li>\n<li>Being a team player in a highly collaborative environment.</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\n<strong>Basic Requirements:</strong>\n\n\n<ul>\n<li>5 years of relevant experience and a Bachelor's degree OR 4 years of relevant experience and a Master's degree or higher</li>\n<li>1 - 3 years of experience work in Big Data Environments leveraging Hadoop, Hive, Spark, Parquet, HDFS</li>\n<li>Experienced working in developing large scale solution using Python and Big Data</li>\n<li>Interest in Data Science algorithms and optimization problems</li>\n<li>Solid Linux proficiency</li>\n<li>Knowledge ETL concepts and experience loading large data sets into NOSQL DB's</li>\n<li>Excellent communication and problem-solving skills</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Experience working with big data environments hosted by cloud providers (AWS, Azure)</li>\n<li>Server-side development and database experience is critical (JSON-based REST APIs, Java, Couchbase, Mongo, MySQL, Spring)</li>\n<li>Experience with UI development (JavaScript, Ajax, Angular, NodeJS)</li>\n<li>Strong knowledge in writing web services (SOAP/ REST / XML/ JSON) and web application development.</li>\n<li>Knowledge and experience in NoSQL database systems including Couchbase, Mongo and Redis</li>\n<li>Understands the importance developing solutions that meet operational goals and are supportable in a large-scale production system</li>\n</ul>\n\nStaples is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other basis protected by federal, state, or local law.\n<br><br>\nStaples"}