{"job title": "Lead Data Engineer - Sales Transaction Platform", "company": "Target", "city state": "– Sunnyvale, California", "rating": "3.4", "job description": "Job Details\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nLead Data Engineer - Sales Transaction Platform(Job Number:BUS0001JU)\n<br><br>\nJOIN US AS A LEAD DATA ENGINEER - SALES TRANSACTION PLATFORM The Data Science and Engineering team at Target is a hyper-growing, dynamic and collaborative team. Data Engineers work closely with Data Scientists to create valuable insights using voluminous data collected from internal and external systems on a large-scale. Business operations are empowered with these insights to achieve Target's strategic initiatives while providing world-class shopping experiences. About this Opportunity As a Lead Data Engineer, you will have the opportunity to create software solutions using Agile practices and DevOps principles. Responsibilities will include designing, programming, debugging and supporting high quality distributed systems and large-scale solutions on the latest Big Data tech stack (Java/Scala, Hadoop, Spark, Druid, Kafka, etc.). We're looking for a highly motivated and talented Big Data programmer who's a team player, wants to work on large-scale data products, grow their skills/career as well as have fun in an exciting retail data environment! Key Responsibilities:\n<br>\nDevelop software systems using test driven development employing CI/CD practices\n<br>\nPartner with other engineers and team members to develop software that meets business needs\n<br>\nFollow Agile methodology for software development and technical documentation\n<br>\nInnovate constantly and stay current with latest technologies while staying focused on solving problemsRequirements\n<br>\nMS degree in Computer Science or relevant experience\n<br>\n5 years of experience in developing software applications\n<br>\n3 years of experience working on Big Data tech stack like Hadoop, Spark and Hive\n<br>\nProficiency in at-least one of the following languages: Java, Scala or Python\n<br>\nExcellent understanding of software design and development at scale\n<br>\nWorked on building and supporting Web Services end to end\n<br>\nExperience with REST services preferred\n<br>\nExperience/knowledge of Kafka streaming solutions\n<br>\nTeam player who collaborates and enjoys solving technical challenges with huge data sets\n<br>\nPrimary Location: United States-California-Sunnyvale"}