{"job title": "Site Reliability Engineer - Big Data", "company": "TrueCar", "city state": "– Santa Monica, CA", "rating": "3.3", "job description": "Job Description:<br><br>TrueCar is seeking to add an Site Reliability Engineer to our technology team. This role is a client facing, hands on engineering position, delivering guidance and advice to the client organization regarding application integration, DevOps, RDBMS and NoSQL, networking, virtualization, storage and security.\n<br><br>\n<strong>WHAT YOU'LL DO</strong>\n<ul>\n<li>Work with software engineers, data engineers, data scientists, and infrastructure engineers (DevOps) to help define, build, optimize, and support the applications running on our infrastructure</li><li>Design and implement automated data replication processes and policies to enable development teams and cost savings. Elasticsearch indices, S3 buckets, PostgreSQL databases, HBase tables from one cluster to another--you name it, someone probably wants it.</li><li>Evaluate and vet new technologies for reliability, cost effectiveness, and maintainability</li><li>Design and implement solutions for key pieces of infrastructure around deployment, monitoring, alerting, data storage, and security</li><li>Continually improve the state of our shared infrastructure and tooling</li><li>Revisit existing applications and infrastructure to suggest improvements and optimizations</li><li>Build working relationships across the organization, at all levels</li><li>Define best practices with excellent written documentation</li><li>Participate in on-call rotation with other engineers and developers</li>\n</ul>\n<strong>WHAT YOU NEED:</strong>\n<ul>\n<li>Software development experience with one or more of: Python, Ruby, Java, or Scala</li><li>Experience with relational databases such as PostgreSQL, MySQL, or Microsoft SQL Server.</li><li>Experience with core Hadoop: HDFS, MapReduce, ZooKeeper, and YARN</li><li>Experience with distributed/NoSQL databases: HBase, DynamoDB, Cassandra, or Voldemort</li><li>Solid understanding of Linux systems and networking fundamentals</li><li>Clear commitment to cloud. Track record with AWS preferred, but OpenStack, Google and Azure also of interest</li><li>Excellent communication skills, written and spoken</li><li>Evidence of self-learning and a commitment to personal development</li><li>Bachelor's degree or higher in Computer Science, or equivalent experience</li>\n</ul>\n<strong>NICE TO HAVES:</strong>\n<ul>\n<li>2+ years of experience as a software developer with MapReduce or Spark</li><li>Experience with Elastic/ELK stack or Apache Solr</li><li>Experience with extended Hadoop ecosystem: Hive, Pig, Oozie, Phoenix, Hue</li><li>Experience with scaling AWS services for data: Athena, Redshift, Glue, RDS (Aurora), Elastic MapReduce (EMR), DynamoDB</li><li>Experience with Terraform or AWS CloudFormation</li><li>Experience with one or configuration management tools such as Ansible, Salt, Chef, or Puppet</li><li>Experience with Docker and/or Kubernetes</li>\n</ul>\n\nLocation(s): Santa Monica Offices\n<br>\nAssociated topics: infrastructure, ip, maintain, network, satcom, server, system engineer, system specialist, system technician, technician"}