{"job title": "Senior Data Operations&amp;Stewardship Analyst", "company": "TSR, Inc.", "city state": "– Princeton, NJ", "rating": "3.5", "job description": "Our client, a major pharmacuetical company in Princeton NJ is seeking a Senior Data Operations&amp;Stewardship Analyst on a contracting basis. The Data Operations will manage a team of Data Operations Steward(s) within Enterprise Information Data Management team and has day-to-day ownership of leading data management operations, processes and data quality in addition to leading and coordinating business requests on changes and enhancements. This role ensures that R&amp;D data assets are understood, used and shared effectively throughout the organization. Resource should have ability to manage data assets in enterprise Data Lake for R&amp;D Domain to ensure data is analysis ready for business consumption. In addition to serving as the subject matter expert, the role will be knowledgeable of key groups and functionalities to appropriately manage issues, incidents, and inquiries.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Strong R&amp;D Data Domain expertise in one or more areas (Translational, Clinical and ClinOps and Real World data)</li>\n<li>Working expertise in sub-domain, resolving data issues, hands-on data analysis skills, ability to run/support analytics, good communication skills to interface independently with scientist, researchers, clinical operations/clinical data management users</li>\n<li>Experience in configuring, mapping clinical/biomarker data sources to different data domains and maintaining the mapping as part of day to day data load, issue management/resolution</li>\n<li>Manage the production data assets in the data lake from data acquisition to publish, to ensure data is analysis ready for business consumption</li>\n<li>Experience working in Data Lakes (AWS) and tools to operationally manage load process end to end. Experience work with both external data vendors and internal stakeholder on data issues.</li>\n<li>Ability to put detail data requirements and maintain regular updates to data catalog, business glossary, metadata management for all of R&amp;D domains within enterprise data lake</li>\n<li>Deep data knowledge and working experience from both data ingestion support and data consumption perspective to develop data Quality measures/rules for each data sub-domains</li>\n<li>Analytics skills with data domain experience to provide user support, data extracts using analytics tools Domino/SAS, R, Python on need basis for external research partners</li>\n<li>Responsible for maintaining and updating critical data elements within the Enterprise Catalog</li>\n<li>Manage the production data assets from data acquisition to publish, to ensure data is analysis ready for business consumption</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>Must have related working experience in Data Operations and Stewardship.</li>\n<li>Prefer minimum 4+ years in a Pharmaceutical or Biopharmaceutical environment with 6-10yrs years professional experience as an data analyst</li>\n<li>Prefer a BS in Science, Engineering, Information Technology or related field but candidate will also consider equivalent relevant work experience</li>\n<li>Strong communication and relationship building skills to establish trust and rapport with the BI&amp;A, plan partners and R&amp;D business stakeholders</li>\n<li>R&amp;D Domain expertise in Translation Medicine, Clinical data, Real World Data domains</li>\n<li>Strong business analysis and business rules development skills</li>\n<li>Experience in Data catalog, metadata, ontology and business glossary management</li>\n<li>Working experience AWS environment and expertise in data analysis tools</li>\n<li>Experience with data quality framework, both in development and in execution across multiple data assets</li>\n<li>Experience using ETL tools(Eg. Paxata and Informatica) and visualization/Dashboard tools (Eg. Spotfire&amp;Tableau)</li>\n<li>Expertise in Data Analysis, Database&amp;SQL skills for DQ executions</li>\n</ul>"}