{"job title": "Data Analyst - (Duluth)", "company": "AT&amp;T", "city state": "– Columbia, MD", "rating": "3.4", "job description": "Job Description: The Data Analyst will understand IT service related data on a large IT service contract, turn raw data into information, information into knowledge and knowledge into wisdom for meaningful business decisions. Uses enterprise monitoring and reporting tools to identify performance trends and discover opportunities for improvements in IT service processes and workflow.\n<br><br>\n<strong>Responsibilities include:</strong>\n\n\n<ul>\n<li>Creating and maintaining views into data sets to provide visualization of data analysis.</li>\n<li>Leading process benchmarking to ensure fit for purpose and best in class process delivery / execution.</li>\n<li>Working with engineering on technical solution benchmarking to identify opportunities for solution improvement.</li>\n<li>Working with operational and engineering organizations to identify Continual Service Improvement (CSI) enhancements.</li>\n<li>Preparing daily/period reports to communicate outcomes of data analyst activities.</li>\n</ul>\n\nRequired Skills, Experience, and Education: The data analyst shall have ten (10) years of experience as a program or project manager in managing projects and contracts of similar scope, type, and complexity is required.\n\n\n<ul>\n<li>Deep Knowledge with the related ITSM Processes and Polices</li>\n<li>Deep Knowledge of Data Analysis tools and processes</li>\n<li>Experience with enterprise level monitoring and reporting tools such as ServiceNow, Splunk, Solarwinds</li>\n<li>Passion for customer service with a strong level of critical thinking in order to quickly resolve issues</li>\n<li>Excellent oral and written communication skills. Ability to understand others and clearly express thoughts</li>\n</ul>\n\nRequired Clearance:Candidate must have a TS/SCI polygraph clearance\n<br><br>\nDesired: ITIL v3 Foundations Certification. Preferred one or more ITIL Intermediate Certificate (Continual Service Improvement; Planning, Protection, and Optimization)\n<br><br>\nJob ID 1836183 Date posted 09/13/2018"}