{"job title": "Senior Data Analyst", "company": "BigCommerce", "city state": "– Austin, TX", "rating": "4.1", "job description": "<strong>BigCommerce</strong>, named a \"Best Place to Work\" in Austin in 2018 is looking for an experienced data analyst to partner with business leaders to understand and improve business performance. This role will work closely with stakeholders across the organization to measure and quantify business processes and performance and formulate strategic recommendations.<br><br><strong>What You'll Do</strong><br><br>This role will be instrumental in helping our business understand their performance against company objectives. Sometimes the tasks can be ambiguous but that's part of the challenge and you will determine the best way to find the right data points to tell the right story for any given audience. In this role, you will also:\n\n<ul>\n<li>Partner closely with business leaders to understand key challenges and business opportunities as well as provide insightful reporting on performance trends</li>\n<li>Work closely with data engineers, business application administrators, and other stakeholders to ensure reliable data collection and measurement capabilities</li>\n<li>Craft dashboards and KPIs that provide insight into business performance</li>\n<li>Design and conduct statistical analyses of business performance in order to optimize and improve investment</li>\n<li>Identify trends in data and provide recommendations on how to respond</li>\n</ul>\n\n<strong>Who You Are</strong>\n\n\n<ul>\n<li>3+ years in a data/analytics role</li> \n\n<li>Advanced SQL skills applied in a business context and proven ability with data visualization tools and techniques (Tableau, Looker, or Periscope Data preferred)</li>\n<li>Strong business acumen and critical thinking skills</li> \n\n<li>Demonstrated ability to apply statistical models and techniques to business problems</li>\n<li>Ability to present data in a concise and digestible manner; comfortable presenting in front of executive-level audiences</li>\n<li>Technically savvy with a penchant for systematic thinking and automation</li>\n<li>Some exposure to Python or similar scripting or programming languages</li>\n<li>Capable of executing analytical projects independently without direct supervision</li>\n<li>Have a quantitative mindset and passion for data and technology</li>\n<li>Able to deal with ambiguity and problem-solve independently</li>\n<li>Ambitious, self-motivated, goal-oriented and extremely driven</li>\n<li>Excellent written/verbal communication and interpersonal relationship skills</li>\n<li>Outstanding work ethic and excellent time management skills</li>\n<li>A Bachelor's degree in quantitative field (economics, statistics, business, computer science) or equivalent experience</li>\n</ul>\n<strong>Inside BigCommerce</strong>\n<br><br>\nBigCommerce is a robust, flexible commerce platform that provides established and emerging brands with everything they need to launch, promote, manage and scale a successful online store.BigCommerce merchants earn more than retailers on competitive commerce solutions thanks to advanced features, better site performance and streamlined business processes. Founded in 2009, the company has received more than $100 million in funding from SoftBank Capital, American Express, Telstra Ventures, General Catalyst, Revolution Growth and FLOODGATE. BigCommerce supports thousands of retailers around the world from its offices in San Francisco, Austin and Sydney.\n<br><br>\nWe're a team of smart, passionate and talented people on a mission to democratize commerce. If you're looking to work with industry leaders and love what you do, we want to hear from you!\n<br><br>\n<strong>Perks &amp; Benefits</strong>\n\n<ul>\n<li>An amazing company culture that doesn't just talk values, but lives them</li>\n<li>Open vacation policy for salaried team members and generous accrual vacation policy for hourly team members, + paid sick time</li>\n<li>Competitive compensation packages and meaningful stock grants for every employee</li>\n<li>Comprehensive health insurance coverage that starts on day one</li>\n<li>Fully stocked kitchens and craft beers (don't worry, we also subsidize gym memberships)</li>\n<li>Four especially cool offices in Austin, San Francisco and Sydney</li>\n<li>A free online store to help you live out your entrepreneurial dreams</li>\n<li>Employee-driven teambuilding activities like paintball, rock climbing, social sports leagues, hackathons, movie nights, river floats, etc.</li>\n<li>Time off for volunteering and employee-driven charity events</li>\n</ul>"}