{"job title": "Data Analyst (No C2C)", "company": "Capital Staffing Solutions", "city state": "– Jacksonville, FL", "rating": "4.2", "job description": "Data Analyst Jacksonville, FL. 3224612 month + contract. Essential Job Functions Very strong SQL experience and working with databases Supports the production of detailed functional requirements and/or user stories, including non-functional requirements Assists in developing user acceptance criteria, test plans and test cases. Participates in functional/user testing (User Acceptance Testing) and provides support for user sign off of changes Monitors system implementation ensuring user satisfaction and be comfortable with being hands on in support of implemented solutions. Operational readiness, Implementation/Warranty Support, Production support, Project analytics and reporting Provide functional and technical support/expertise during development, implementation, and testing of projects Develops a good understanding of the business unit's function and effectively communicates technical issues and solutions in non-technical terms to the business unit Supports BSAs and Sr BSAs in business requirements gathering and determining technical impacts Reviews and clarifies user stories and user acceptance criteria with the stakeholders, and works with development lead/technical architect to layout technical design Develops system related documentation that includes flow charts, work flow tables, mapping documents, integration specifications and provides system training Coordination with ETL and Application developers for issue management. Support module Productionalization and Scheduling Monitors project progress by tracking activity; resolving problems; publishing progress reports; recommending actions Contributes to team effort by accomplishing related results as needed Coordinates and manages sizing and scheduling requests for IT Other duties as assignedMinimum Job Requirements Bachelor s degree in an IT related field or equivalent work experience Experience in applying research methodology to business solutions Knowledge of systems development concepts and methods Experience with business requirements and business process analysis to ensure IT solutions meet the business needs Demonstrated organizational, analytical and interpersonal skills Proficient in requirements gathering methodologies and the SDLC Understanding of typical architecture standards and ability to apply them in their design work Ability to communicate technical information clearly and articulately Ability to adapt to a rapidly changing environment Basic understanding of systems, subsystems, development methodologies, systems architecture, tools and processes that support the assigned business initiative or systemPreferred Criteria Experience using Agile methodology - provided by Dice SQL experience and working with databases / UAT / ETL"}