{"job title": "Data Warehouse Business Analyst", "company": "Chandra Technologies", "city state": "– Madison, WI", "rating": "4.4", "job description": "Please apply for this position by sending your resume to:Email: apply AT chandratech DOT comSUBJECT: Applying for * Data Warehouse Business Analyst* Madison, WI Hourly Rate: $60 W2; $69 CTC/1099 Job Description: This position is for a dedicated IT Business Analyst; please do not submit ETL developers for this role. DCF is looking for a strong practitioner with 5 or more years of business requirements elicitation, documentation, stakeholder communication, requirements verification and testing as a primary job responsibilities. Preference will be given for candidates will experience in gathering requirements for data warehouse/business intelligence projects. * Responsible for leading and facilitating the communication with IT staff, business customers and other stakeholders, implementation services, and support services to assist in the development, implementation and support of business intelligence. * Understands business objectives and problems, identifies alternative solutions, performs feasibility studies and cost/benefit analysis of alternatives in support of enterprise wide business intelligence. Manages the balance between business requirements and user expectations. * Uses extensive experience as a liaison between users and technologists to drive requirements into design. * Analyzes user requirements, procedures, and problems to automate processing or to improve existing processes: Confers with personnel of organization unites involved to analyze current business procedures, identify issues, and learn specific business requirements, such as how data is to be summarized, and formats for reports. * Works with the team lead and manager to determine a detailed and prioritized list of objectives and activities for current and future projects. Experience with Human Services business intelligence is desirable. * Responsibilities with include project work enhancing existing/new processes through data sharing, configuration, report writing and metrics. * Troubleshoot and resolve issues efficiently. Identify potential technology improvements to be leveraged in support of the business. Assist in the creation and maintenance of test plans. Participate in special projects as required. * Business Analyst with 5 or more years of experience, relies on experience and judgment to plan and accomplish goals, independently performs a variety of complicated tasks. Required Skills : Change management (3 Years) Demonstrated experience in the design and utilization of performance measures and reports (3 Years) Business processes improvement (3 Years) Standardized processes and procedures implementation (5 Years) State of Wisconsin Privacy Regulations (Yes) Ability to develop and implement quality assurance processes and procedures including test/use cases (3 Years) Data analysis (5 Years) Data flow diagramming (3 Years) Data Warehouse - Experience in data warehouse design and development (3 Years) Data Warehouse - Experience in requirements gathering for data warehouse (3 Years) Knowledge of Kimball data warehouse design principals (2 Years) Participate in design reviews (2 Years) Documenting business processes (5 Years) Requirements analysis (5 Years) Requirements gathering (5 Years) Preferred Skills : Develop design specifications (2 Years) Data Warehouse Business Analyst * Data Analysis, Requirements Gathering and Analysis, Data Warehouse, Business Processes Higher Competitive Rates will be considered for consultants with advanced skill setCorp to Corp Resumes are welcomeConsultants may need a criminal background check - provided by Dice Data Warehouse Business Analyst Data Analysis, Requirements Gathering and Analysis, Data Warehouse, Business Processes\n<br>\nAssociated topics: business advisory, business analysis, business analyst, business systems, consult, customer, information technology consultant, market, marketing, sap"}