{"job title": "Marketing Data Analyst", "company": "CooperVision", "city state": "– Rochester, NY", "rating": "3.6", "job description": "CooperVision, a unit of The Cooper Companies, Inc. (NYSE:COO), is one of the worlds leading manufacturers of soft contact lenses and related products and services. The Company produces a full array of monthly, two-week and daily disposable contact lenses, all featuring advanced materials and optics. CooperVision has a strong heritage of solving the toughest vision challenges such as astigmatism and presbyopia; and offers the most complete collection of spherical, toric and multifocal products available. Through a combination of innovative products and focused practitioner support, the company brings a refreshing perspective to the marketplace, creating real advantages for customers and wearers. For more information, visit www.coopervision.com\n<br><br>\n<strong>JOB TITLE:</strong> Marketing Data Analyst\n<br><br>\n<strong>DEPARTMENT:</strong> Marketing\n<br><br>\n<strong>JOB SUMMARY</strong>\n<br><br>\nReporting to the Commercial Analytics Manager with a dotted line to the VP-Marketing, North America, the Marketing Data Analyst-a newly-created role-will work to enable the success of the US marketing and broader commercial team by informing better decision-making. The incumbent will leverage an expertise in quantitative analysis, data mining and data presentation to develop and socialize analyses of all marketing programs and tactics , so as to assess their effectiveness in driving engagement brand usage and retention with Eyecare Practitioners (ECPs) and contact lens-wearing consumers. The role will include, but not be limited to, projects related to customer targeting, program metric development and measurement, multi-touch campaign assessment revenue forecasting, marketing investment allocation and effectiveness, consumer rebate and free goods ROI, market data management and analysis and the modeling of a long range strategic planning inputs. Translating these insights, gathered from disparate data sources, into user-friendly dashboards will be a critical output of the role.\n<br><br>\n<strong>ESSENTIAL FUNCTIONS</strong><br><br><strong>\n<br>\nGeneral Tasks</strong>\n\n<ul>\n\n<li>\n Builds a deep knowledge of the soft contact lens category and CVIs US business, through the analysis of available data, to shape the development and execution of commercial imperatives.</li>\n<li>\n Serves as primary interface for inbound data requests that support long range strategic planning, annual brand planning and reporting around ongoing marketing initiatives.</li>\n<li>\n Manages research projects that address specific business questions, to inform business case development and/or decision-making.</li>\n<li>\n Works cross-functionally to facilitate the integration of data from various sources to better enable data sharing and analysis.</li>\n<li>\n Champions the creation, maintenance and socialization of data visualization dashboards for the Marketing team and serves as vendor liaison.</li>\n<li>Collaborates with the Marketing Leadership Team to support their teams in all aspects of analysis, report development, KPIs/dashboards and Business Intelligence from a revenue, customer, pricing, program performance and margin/ profitability perspective</li>\n<li>Drives data provision, in partnership with key stakeholders, to input monthly, quarterly and annual activities such as market data analysis, quarterly revenue forecast reviews, consumer rebate and fit set performance assessment, marketing program reviews and input into the annual and long-range strategy planning processes.</li>\n<li>Attends and presents, as required, at marketing, sales and commercial leadership meetings.</li>\n<li>Leads vendor management in the area of data gathering, data cleansing, analytics and reporting optimization by market data, consumer rebate management and marcom partners, as well as owning ad-hoc management of custom research vendors, as required.</li>\n</ul>\n\n<strong>Brand/Customer Marketing support:</strong>\n\n<ul>\n\n<li>\n Analyzes category and CVI sales trends, including legacy products and customer brands,to inform brand strategies, tactics and forecasting (customer and national brands, by modality and lens design).</li>\n<li>\n Analyzes category dynamics, channel and customer strategies and CVI sales into those channels and customers, in partnership with Sales Operations and Finance partners, to inform key channel and customer strategies, definition and reporting of success metrics and key customer program assessment.</li>\n<li>\n Partners with Sales Operations to inform pricing (list/promotional) strategy.</li>\n<li>\n Informs the creation of targeting list for brand and customer new product launches and marketing programs, and provides analytics on the execution of those programs.</li>\n<li>\n Creates KPI dashboards that show performance vs. objectives and associated ROI for key brand/customer marketing programs (e.g. inventory programs, channel/product-based promotions, consumer rebates, customer dinners, etc.), and provides recommendations to enhance current program performance and inform new program design.</li>\n<li>\n Partners with Finance and Customer Marketing to understand consumer rebate redemption rates by channel, customer, brand and value, and make recommendations to inform rebate strategy and investment.</li>\n<li>\n Partners with Finance to track fit set performance by brand, channel, customer, region and field sales rep to inform better management of these in-field assets and drive adoption of CVI focus products. Provides data-based rationale to inform allocation decisions.</li>\n<li>\n Partners with Finance to develop and socialize free lens analysis, and recommends opportunities to enhance investment decision-making, to both grow revenue and optimize investment.</li>\n<li>\n Partners with market data and rebate management vendors to develop more extensive data analysis of channel, segment and customer-specific performance and opportunities.</li>\n<li>\n Leverages customer, trade media, industry analyst and competitor reporting data to increase knowledge of category dynamics and inform marketing and commercial strategies.</li>\n<li>\n Partners with Finance, global marketing and brand team to increase brand forecast performance.</li>\n</ul>\n<strong>Marketing Communications support:</strong>\n<ul>\n\n<li>\n Informs, measures and reports success metrics to inform marcom program and campaign assessment, and attribution/ROI.</li>\n<li>\n Develops, in partnership with team and vendors, web, social media and email analytics to inform execution strategies.</li>\n<li>\n Provides insights to help marcom increase the quality and quantity of email addresses and database integrity</li>\n<li>Informs development of testing strategies to enhance the demand creation process, including response and conversion rates and multivariate testing.</li>\n<li>\n Partners with Finance to inform marketing program budget analysis.</li>\n<li>\n Partners with vendors to develop, report and social analytics to optimize usage strategies and demonstrate attribution/ROI.</li>\n<li>\n Partners with Digital Marketing, Commerical Operations and IT to ensure data hygiene and maintenance activities occur to enable execution of the marketing data analysis responsibilities outlined above.</li>\n</ul>\n\n<br>\n<strong>Professional &amp; Academic Affairs support:</strong>\n\n<ul>\n\n<li>\n Partners with the Professional Affairs team to develop metrics, gather data and report on Professional Affairs-sponsored events in order to establish, communicateand manage KPIs. Involves use of and other relevant data sources to generate dashboards and other relevant reporting formats.</li>\n</ul>\n<strong>POSITION QUALIFICATIONS</strong>\n<br><br>\nKNOWLEDGE, SKILLS AND ABILITIES\n<ul>\n\n<li>\n 3+ years of experience in analytics in a B2B, B2C2B or B2C multiple brand environment</li>\n<li>\n Expert knowledge in Microsoft Office suite (Excel, Powerpoint, Access, etc.)</li>\n<li>\n Experience working with CRM and Marketing Automation Platforms, preferably SFDC/SFMC</li>\n<li>\n Logical and organized with the ability to work accurately under time pressure and meet deadlines both working independently and as part of a team-able to prioritize and multi-task.</li>\n<li>\n Experience working with business data (products, pricing, financial, market share, etc.) required, as is superior business acumen.</li>\n<li>\n Demonstrated influencing and collaboration skills; ability to build effective relations and partner with diverse, remote and cross-functional teams inside &amp; outside of CVIUS required.</li>\n<li>\n Willingness to challenge the status quo-creative problem thinking, bringing new ideas and approaches to the team, and looking for ways to improve on current practices.</li>\n<li>\n Executive level communication proficiency (oral &amp; written)-ability to distill complex data.</li>\n<li>\n Data mining skills using disparate CVI and external sources and the ability to consolidate</li>\n<li>\n Superior Excel skills (macros, lookups, sum if, complex link files)</li>\n<li>\n Experience with enterprise databases and statistical software would be a plus.</li>\n<li>\n Experience in email/digital marketing would be a plus.</li>\n<li>\n Experience in the vision care category or a similar B2B2C environment would be a plus</li>\n</ul>\nWORK ENVIRONMENT\n<ul>\n\n<li>\n Office-based, with some travel to other CVI locations, customer sites and industry events.</li>\n<li>\n Sedentary to light physical effort necessary to perform the job.</li>\n<li>\n There will be extended periods of sitting and using a computer</li>\n<li>\n Travel, predominantly domestic, approximately 10-15%.</li>\n</ul>\nEDUCATION\n<ul>\n\n<li>\n A relevant university degree in a quantitative field such as Mathematics, Statistics, Business or Economics.</li>\n</ul>\nEXPERIENCE\n<ul>\n\n<li>\n 2+ years of marketing and/or finance</li>\n</ul>"}