{"job title": "Sr. Data Programmer/analyst (SAS)", "company": "Gunnison Consulting Group Inc", "city state": "– Suitland, MD", "rating": "4.5", "job description": "Sr. SAS PROGRAMMER/ANALYST\n<br><br>\nGunnison is growing! Join our team!\n<br><br>\nGunnison is seeking SAS programmers interested in working on challenging and rewarding assignments supporting our largest client. These positions offer the flexibility to find your own career path within the Gunnison organizational structure and become an integral part of a team supporting a massive data collection and analytics effort.\n<br><br>\nLocation: Suitland, MD - Easily Accessible by car or Metro, free parking. Potential Teleworking Opportunities.\n<br><br>\nSr. SAS PROGRAMMER/ANALYST\n<br><br>\n<strong>JOB DUTIES AND RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>The positions include writing and modifying SAS code to produce complicated combinations of detailed data</li>\n<li>Work on cross functional team</li>\n<li>Collaborate with client team</li>\n<li>Clear communication and problem-solving ability</li>\n<li>Product development in an agile style environment</li>\n</ul>\n\n<strong>TECHNOLOGIES:</strong>\n<br><br>\nSAS, UNIX/LINUX, Shell scripting, SFTP\n<br><br>\n<strong>REQUIREMENTS:</strong>\n\n\n<ul>\n<li>Bachelor's Degree in CS, Statistics, or applied math</li>\n<li>5-10+ years of experience</li>\n<li>Knowledge of Unix/Linux operating system</li>\n<li>At least one scripting language to run in Unix/Linux environment</li>\n<li>Experience with Unix operating system.</li>\n<li>Experience with shell scripting</li>\n<li>SAS programming experience with macros, proc sql, sas data steps.</li>\n<li>Ability to pass a US Government Background investigation (national agency check, Secret or TS not required).</li>\n</ul>\n\n<strong>OTHER:</strong>\n\n\n<ul>\n<li>SAS Certification, Korn shell scripting, Perl script, Python</li>\n<li>Hands on experience with Agile project</li>\n<li>Writing technical requirements</li>\n<li>Excellent communication skills</li>\n<li>Ability to work in a team environment</li>\n</ul>\n\nSr. SAS PROGRAMMER/ANALYST\n<br><br>\nWhy Join Gunnison?\n\n\n<ul>\n<li>Gunnison takes on ambitious projects. We target fun, challenging work that requires creative thinking and innovation. Quality is our top priority.</li>\n<li>Gunnison's employee benefits meet or exceed what other companies in the Washington, D.C. metropolitan area offer.</li>\n<li>Gunnison is a family-oriented business. As a small firm, there is a great sense of camaraderie and employees are treated like family. This is an atmosphere we fully intend to maintain, even as we continue to grow.</li>\n<li>Gunnison's revenues have grown steadily since the firm's founding in 1994. Our growth rate over the past decade is 19% per year.</li>\n<li>Our employee resources, financial resources, and client base are all expanding. Just as important, we have solid partnerships with several other firms, providing specialized niche expertise to fulfill unique customer needs. The vast majority of our work is from repeat customers.</li>\n</ul>\n\nEmployee Benefits\n<br><br>\nGunnison's employee benefits meet or beat other companies in the Washington, D.C. metropolitan area. We invite comparison.\n<br><br>\nClick here for details\n<br><br>\nEqual Opportunity/Affirmative Action Employer\n<br><br>\nMust be eligible for employment in the United States\n<br><br>\nWe are unable to sponsor candidates at this time<br><br>SDL2017"}