{"job title": "Data Conversion Analyst", "company": "Harris Computer", "city state": "– Allen, Texas", "rating": "4.1", "job description": "<p><b>Overview</b></p>At Harris Govern, we build software solutions specific to the requirements of Local Government and utilities. Our software suite enables us to bring comprehensive, innovative technology solutions to county governments nationwide.<br><br>We are currently seeking a Data Conversion Analyst to be responsible for creating database structure, migrating data, and gaining internal as well as external buyoff surrounding procedures to prepare and move new customers from their legacy system to the Harris Govern software suite.<p></p><p></p><p><b>Details</b></p><p>The <b>Data Conversion Analyst </b>as part of a project team will develop an understanding of the proposed business processes and help lead the subject matter experts and customer to a common understanding regarding the data to support the production environment. Project meetings will allow the team to learn about customer requirements and document the information into a mapping document to aid in the data conversion process. The conversion processes include TSQL coding, debugging and testing to complete the conversion in a timely and efficient manner meeting project deliverables as defined in the timeline.</p><p></p><p><b>Essential Job Functions:</b></p><p></p><ul><li>Participation on a project team to gather requirements and analyze data for conversion</li><li>Development of the conversion packages, procedures, and queries to move the data from the conversion to production database schema</li><li>Design, create and implement scripts to support the ETL process</li><li>Test data accuracy and data compatibility in Harris Govern applications</li><li>Ensure data integrity through validations and other methods</li><li>Document and present data solutions to internal and external customers to ensure the data requirements for the applications are met</li><li>Collaborate with conversion and development teams to ensure ETL processes are compatible and consistent and meet technical and architectural standards</li><li>Evaluate tools and solutions to improve and automate the conversion process</li><li>Establish and implementation of ETL processes to streamline the conversion and implementation process</li><li>Provides training/knowledge transfer to teams, individuals or external parties responsible for collaborative development of modules and extensions to the base framework</li></ul><p></p><p><b>Qualifications:</b></p><p></p><p>Education and Work Experience:</p><ul><li>BA/BS degree in related field or Professional Certification preferred. The equivalent in experience and self-study may be substituted</li><li>Experience with standard concepts, practices, and procedures within the ETL process</li><li>Minimum of 5 years’ experience with MS SQL Server databases</li></ul><p></p><p>Competencies<b>:</b></p><ul><li>Knowledge of standard data conversion concepts, practices, and procedures</li><li>Proficient working with TSQL functions, packages, and procedures</li><li>Extensive experience with MS SQL Server 2008+</li><li>Solid teamwork skills that encourage accountability and results. Attend all required project meetings and must communicate to the project team when you are not available for a meeting.</li><li>Onsite presence during normal business working hours.</li><li>In-depth understanding of ETL processes.</li><li>Task management skills to collaboratively work with a project team to identify requirements to complete the ETL process</li><li>Develop and maintain a standard conversion mapping document throughout the project lifecycle.</li><li>Strong organizational and documentation skills</li><li>Solid understanding of data structures and algorithms</li><li>Strong customer service skills to ensure project requirements are clearly defined for conversion components</li><li>Ability to quickly adapt to changing requirements and priorities</li><li>Must be able to operate effectively with minimal direction</li><li>Strong analytical, logical, and problem-solving skills</li><li>Ability to work on concurrent projects</li></ul><p></p><p>Additional<b>:</b></p><ul><li>Contributes to managing portions of conversion standards and documentation</li><li>20% travel to customer site as required during project</li></ul><p></p><p>#WeAreHarris</p><p></p><p></p><p><b>Harris is an Equal Opportunity/Affirmative Action Employer. We consider applicants without regard to race, color, religion, age, national origin, ancestry, ethnicity, gender, gender identity, gender expression, sexual orientation, marital status, veteran status, disability, genetic information, citizenship status, or membership in any other group protected by federal, state or local law.</b></p><p></p><p>If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact us at (1)-613-226-5611 or at HarrisTalentAcquisition@harriscomputer.com. This contact information is for accommodation requests only and cannot be used to inquire about the status of applications.</p>"}