{"job title": "Equity Data Analyst", "company": "Indiana University", "city state": "– Bloomington, IN", "rating": "4.2", "job description": "<div>\nJob Description<br>\n\n <div><strong><strong>*Search Re-Opened</strong>*</strong>\n<br><br>\nThe Equity Data Analyst develops, initiates, and implements education data collection and analysis approaches, as well as other information management strategies to inform and understand efforts to address race, sex, religion, and national origin-based discrimination and segregation in public education; execute data requirements to conduct data analyses; and assigns and coordinates activities of technical assistance (TA) provision to ensure compliance with protocols, regulatory and standard operating procedures (SOP) and continuously monitor performance and quality control plans to identify needed improvements for the Region III Equity Assistance Center. In addition, the Data Analyst develops solutions to complex problems that impact the timely and accurate provision of TA and research for the center. The center is funded by the U.S. Department of Education to support elementary and secondary education under Title IV Civil Rights Act.\n<br><br>\nDevelop, implement and maintain project management and client relationship management databases, data collection systems, data analytics and other strategies that optimize statistical efficiency and quality. Develop and execute processes to evaluate business data and to identify ways they can be integrated for better results. Locate and define new process improvement opportunities. Design comprehensive reports to assist executive leadership in making good center decisions.\n<br><br>\nIdentify and acquire data from internal and external data sources; analyze, and interpret trends or patterns in complex data sets; interpret data, analyze results using statistical techniques and provide ongoing reports. Interpret, analysis of collected data using different tools and both quantitative and qualitative research methods and statistical techniques such observations and structured interviews; and NVIVO, SPSS, MS Excel and other data management systems to provide accurate and reliable reports of center regional impact, and technical assistance quality and efficiencies to the executive leadership. Filter and “clean” data by reviewing computer reports, printouts, and performance indicators to locate and correct code problems.\n<br><br>\nSupport center research and evaluation activities. Identify potential research subjects from review of established criteria and in accordance to the center’s IRB protocol approved methodologies and consent requirements. Perform interviews and assessments at study/technical assistance sites for data required by research and evaluation protocols. Conduct study- and evaluation- related activities. Contact center clients and research study participants to obtain needed follow-up information. Extract data from source documents. Complete reports or data base entries and discusses with center leadership and PI. Create formative and summative reports and case studies; proof-read, review and edit reports and case studies. Create data representations, including charts and infographics and presentation slide decks that facilitate the dissemination of evaluation and research findings that are comprehensible to a variety of audiences.\n<br><br>\nInteract individually with center staff to identify their information and research needs, assist and provide guidance to the staff in determination of suitable analytical methodology for assigned projects and achieving project objectives. Interact with center staff and regional clients to have good knowledge of the center’s work and to assist in the data analysis. Handle staff and client related data collection needs issues and work with both central and field staff in facilitating deliverables. Also work with the Associate Director of Continuous Improvement to monitor, train and provide direction on the work of lower-level staff. Perform other related duties as assigned by the Associate Directors, Director of Operations and Executive Director.\n<br><br>\nMaintains current knowledge of regulatory affairs and/or issues. Maintains a high level of expertise through familiarity of research literature and/or attending continuing education classes, conferences, seminars and project team meetings.</div>\n </div><br>\n\n<div>\nJob Requirements<br>\n\n <div><strong>REQUIRED: Bachelors Degree in computer science, information management or statistics, plus 5 years in work experience as a data analyst or in information management; OR any equivalent combination of education and/or experience from which comparable knowledge, skills, and abilities have been achieved.</strong><br><br>Preferred Qualifications<br><br>Masters Degree in computer science, information management or statistics.<br><br>Working Conditions / Physical Demands</div>\n</div>\n<br>"}