{"job title": "Data Analyst II", "company": "Massachusetts General Hospital(MGH)", "city state": "– Boston, Massachusetts", "rating": "4.0", "job description": "We are looking for an individual who is enthusiastic about taking a hands-on approach to complex problems in biomedical research within a collaborative team of clinical researchers, statistical geneticists, computational biologists, and software engineers. The successful candidate will demonstrate innovative and analytical thinking, will have outstanding academic records, an excellent technical background, strong communication skills, and will enjoy working in an interdisciplinary team.\n<br><br>\nProject 1: Core responsibilities will include developing, testing and documenting cloud-based genetic analysis pipelines for, creating queries in the Partners biobank, performing genetic analysis for type 2 diabetes and insulin resistance studies, and presenting results to researchers at the Broad Institute and collaborators within national and international consortia.\n<br><br>\nProject 2: Core responsibilities will include performing epidemiologic analyses examining association between lifestyle factors and development and progression of inflammatory bowel disease. These analyses will leverage data from long-term prospective cohort studies in Sweden and the US. The programmer will also be involved in performing metagenomic analyses of longitudinal microbiome data. These analyses will mostly leverage pilot studies that have been completed at MGH.\n<br><br>\n<strong>CHARACTERISTICS DUTIES:</strong>\n<br><br>\nProject 1: Coordinating with the Broad Institute's Data Science Platform, writing analysis pipelines in cloud-based analysis platforms (AWS, FireCloud) and creating visualization mockups. Working with a team of software engineers at the Broad Institute's Data Science Platform to develop a prototype web portal based on the specifications and mockups. Designing queries in the Partners Biobank, and performing statistical analysis of genetic association analysis and developing causal inference models. Working closely with a multidisciplinary team to analyze large genomic data sets generated by NIH-funded projects. Critically review, summarize, and communicate results to researchers and collaborators and contribute to publications.\n<br><br>\nProject 2: Survival analyses using large prospective cohort studies. The programmer must have previous familiarity with SAS and R for these analyses. Additionally, programmer will be involved developing pipeline for analyses of metagenomic and metabolomics data in Partners and Harvard cluster computing environment (Linux).\n<br><br>\n<strong>Qualifications</strong>\n<br>\n<strong> REQUIREMENTS</strong> \n\n<ul>\n <li> B.S. in computer science, mathematics, (bio)statistics, bioinformatics, or a related quantitative discipline with two to three years of experience. M.S. in these fields preferred. Must have demonstrated proficiency with several of the following technologies: SAS, R, Python</li>\n<li> Experience with Unix/Linux environments required.</li>\n<li> Experience with analyzing biological data in a research setting is strongly preferred.</li>\n<li> Demonstrated capability as highly organized, a creative problem-solver, detail-oriented, self-motivated, and able to work independently as well as within cross-functional teams.</li>\n</ul>\n\n<strong>EEO Statement</strong>\n<br>\nMassachusetts General Hospital is an Equal Opportunity Employer. By embracing diverse skills, perspectives and ideas, we choose to lead. Applications from protected veterans and individuals with disabilities are strongly encouraged.\n<br>\nPartner's Healthcare is acting as an Employment Agency in relation to this vacancy."}