{"job title": "Lead Data Analyst", "company": "Nike", "city state": "– Portland, Oregon", "rating": "3.9", "job description": "<strong>Job Description</strong>\n<br><br>\nThe Nike, Inc. Supply Chain team is the engine that propels product around the world. Supply Chain experts ensure that every year, almost a billion units of footwear, apparel and equipment arrive at the right place, at the right time. To ensure this complex job goes off without a hitch, Supply Chain teams work with a network of more than 50 distribution centers, thousands of accountants, and more than 100,000 retail stores worldwide - making the impossible happen every single day.\n<br><br>\nDescription\n<br><br>\nAt Nike we are always on the offense, and we are looking for talented self-starters with a passion for data and analytics to join our growing team. We are responsible for leveraging predictive analytics to enhance decision making and drive to action against our strategic priorities, elevating the function of analytics within Nike.\n<br><br>\nAs a Lead Data Analyst for Global Marketplace Analytics, you will be a key contributor to the building and promoting of multiple platforms that provide actionable insights and support critical business and investment decisions. You will work side by side with our data scientists and engineers, and in close partnership with other business intelligence and data product teams.\n<br><br>\nThe role is perfect for a data evangelist who is self-motivated and unconventionally curious, especially about how data can be used to inform consumer demand. You enjoy finding relationships between disparate data sets and clarity in a muddied data environment. You are highly proficient in SQL, competent in a variety of scripting languages, well-versed in automation techniques and at home in a cloud based big data environment. You have a healthy degree of skepticism and the ability to speak data truth to power. You also know how to rise above the numbers and explain the essential insights to business users, and you instinctively minimize complexity to focus on results. While you rely on data to prove your point, you love to think outside the box and solve problems creatively. You thrive in an entrepreneurial environment, and you are excited by the challenge of building something from the ground up. You ask questions, are continually learning as well as finding opportunities to share knowledge with others.\n<br><br>\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Bachelor's degree in Computer Science, Information Systems, Stats, Business, or other relevant subject area.</li>\n<li>Master's Degree preferred</li>\n<li>Minimum 7-10 years of relevant professional experience with an emphasis on building data products.</li>\n<li>Expert SQL proficiency required</li>\n<li>Excellent written and verbal communication skills, ability to present findings and products to stakeholder groups</li>\n<li>Proven ability to sift through data, perform analysis, identify critical information, and develop solution options is essential.</li>\n<li>Commitment to and hands-on experience in performing technical code reviews and data issue triage.</li>\n<li>Familiarity with Tableau, as well as data analysis/visualization packages in R or Python is a plus.</li>\n<li>Working knowledge of Scrum and agile principles.</li>\n<li>Experience with Git and Amazon Web Services strongly preferred.</li>\n<li>Demonstrated ability to think critically and seamlessly collaborate with data science and engineering partners.</li>\n<li>Strong project management capabilities to manage multiple project streams and complexity; propensity for thinking through projects in a process-oriented way.</li>\n<li>Statistical knowledge and experience a plus.</li>\n</ul>"}