{"job title": "Data Analyst II", "company": "State of Rhode Island", "city state": "– Providence, RI", "rating": "NA", "job description": "Class Definition Benefits Supplemental Questions\n<br><br>\nGENERAL STATEMENT OF DUTIES: At a significant level of expertise, to undertake professional special and recurring assignments involving conducting full lifecycle activities of data analytics to include requirements and design, data cleaning, developing analysis and reporting capabilities, linking databases and datasets, and continuously monitoring performance and quality control plans to identify improvements in models; and to do related work as required.\n<br><br>\nSUPERVISION RECEIVED: Works under the general supervision of a superior with considerable latitude for the exercise of independent judgement and initiative. Work is subject to review for conformance with prescribed state policies and procedures.\n<br><br>\nSUPERVISION EXERCISED: May supervise less experienced personnel assigned to assist on a regular project basis or; ensures that work products are developed in a qualitative and timely manner.\n<br><br>\n<strong>Illustrative Examples of Work Performed:</strong>\n<br><br>\nAt a significant level of expertise, to undertake professional special and recurring assignments involving conducting full lifecycle activities of data analytics to include requirements and design, data cleaning, developing analysis and reporting capabilities, linking databases and datasets, and continuously monitoring performance and quality control plans to identify improvements in models. With a significant level of latitude and independence, to assure the integrity of project data, including data extraction, storage, manipulation, processing and analysis.\n<br><br>\nTo provide a high level of expertise to query and interpret data, analyze results using statistical techniques, develop predictive models using administrative datasets and provide ongoing reports.\n<br><br>\nTo develop and implement data collection systems and other strategies that optimize statistical efficiency and data quality.\n<br><br>\nTo work closely with management to prioritize business and information needs.\n<br><br>\nTo provide data visualization and presentation of analytical findings to program owners and other stakeholders.\n<br><br>\nTo acquire data from primary or secondary data sources and maintain databases/data systems.\n<br><br>\nTo identify, analyze, and interpret trends or patterns in complex datasets.\n<br><br>\nTo link databases and datasets to generate integrated datasets.\n<br><br>\nTo filter and \"clean\" data, and review computer reports, printouts, and performance indicators to locate and correct code problems.\n<br><br>\nTo participate in ongoing decisions concerning data collections, study design, methodology, and data analysis.\n<br><br>\nTo locate and define new process improvement opportunities.\n<br><br>\nTo do related work as required.\n<br><br>\n<strong>Required Qualifications for Appointment:</strong>\n<br><br>\nKNOWLEDGES, SKILLS AND CAPACITIES: A thorough knowledge of data models, regression analysis, database design development, data mining and segmentation techniques; a thorough knowledge of sophisticated reporting packages, databases and programming; a thorough knowledge of statistical methodologies and techniques utilized for analyzing large datasets; the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy; the ability to conduct queries, draw conclusions, prepare written reports and present findings in a clear and concise manner; the ability to mentor and/or supervise less experienced analysts as required; the ability to establish and maintain effective working relationships with state and municipal officials, superiors, subordinates and the public; and related capacities and abilities.\n<br><br>\n<strong>EDUCATION AND EXPERIENCE:</strong>\n<br><br>\nEducation: Such as may have been gained through: possession of a Master's Degree from a college of recognized standing in Mathematics, Economics, Computer Science, Information Management,Statistics, or a closely related field with similar technical and computational emphasis. Or,\n<br><br>\nEducation: Such as may have been gained through: graduation from a four-year college of recognized standing with a Bachelor's Degree in Mathematics, Economics, Computer Science, Information Management, Statistics, or a closely related field with similar technical and computational emphasis; and\n<br><br>\nExperience: Such as may have been gained through: considerable employment in a professional capacity as a data analyst.\n<br><br>\n<strong>Supplemental Information:</strong>\n<br><br>\n<strong>Position will:</strong>\n<br><br>\nSupervise and oversee the work of the Office of Bridge Planning. To be responsible for RIDOT's bridge database program. To be responsible for development of the Bridge Planning programs that are an integral component of and foundation for the State Transportation Improvement Program (STIP). Recommend improvements to technologies that enhance bridge and infrastructure planning systems. To be responsible for ensuring the bridge software is constantly updated with data obtained from other functional units. Coordinate program activities with other functional units in determining initial budgets and schedules for bridge capital and other infrastructure projects. To work on budget scenarios for improving bridge conditions to RIDOT's stated performance goals. Assist other functional units and agencies in establishing bridge-related performance targets. Work with other functional units determining and adjusting the requirements of the bridge component of the RIDOT Asset Management Program. To make recommendations on program planning and implementation, budget requirements, and staffing needs.\n<br><br>\n<strong>The following is preferred:</strong>\n<br><br>\nThorough knowledge of the principles, practices and techniques pertaining to: bridge and structural design, bridge inspection, bridge management, evaluation of bridge structures, highway design, budgeting, cost estimating, planning, environmental protection, materials and quality assurance, design engineering problems and techniques unique to RIDOT, transportation asset management and the RIDOT TAMP, bridge planning software experience a plus, organizing, directing and coordinating a State Bridge Management Program, technical computations, analyzes and presentation, federal and state laws relating to transportation administration, the ability to evaluate the effectiveness of programs, identify problems and work creatively ro improve them, the ability to plan, organize, review and evaluate the work of staff professionals, technical, support and other employees.<br><br>SDL2017"}