{"job title": "Technical Business Analyst (data space)", "company": "TeamSoft", "city state": "– Madison, WI", "rating": "4.8", "job description": "TeamSoft is looking for a Business Analyst for a CONTRACT opportunity in gorgeous downtown Madison, WI. We want to talk to you! We are looking for an experienced Business Analyst who has experience with gathering and documenting requirements in the Data Warehouse and Business Intelligence space. The person filling this role will be responsible for requirements gathering and documentation, along with a keen ability to build relationships with stakeholders at all levels!No out of state subcontracted candidates will be considered. MUST be local to the Madison or surrounding areas.Qualified candidates will possess the following:- Strong Business Analysis capabilities- Experience with stake holder communications and meeting facilitation- Requirements gathering within the BI and DW space- Business process documentation and mapping would be great too!*A full position description will be provided to qualified candidates. Find out why TeamSoft is the technology leader with over 200 IT consultants. Managed by IT professionals, TeamSoft is the clear choice for your career. Join the TeamSoft family today! Did you know?We are rated the top vendor at Madison's 2 largest clientsTeamSoft offers salaried options for many positions that include 5 weeks PTO and great benefits!TeamSoft has been business since 1996TeamSoft s Executives are IT professionals who possess a wealth of experience in application development, business analysis, and project managementTeamSoft s Recruiters are knowledgeable, friendly, and ready to help you make your next great career moveTeamSoft offers a full benefits suite to all of our W2 consultants, including a 401k plan with a 100% vested 4% dollar for dollar matchOur targeted selection process is designed to get to know your strengths and career interests and provide you with the best chance for success in your new positionOur longest running consultant has been with us for 16 yearsConsultants can participate in our charitable giving committee. To date, TeamSoft s charitable giving committee has donated over $100,000! TeamSoft is operated by IT professionals. Our team has deep experience with IT staffing. Our clients understand this and rely on our expertise. That is why TeamSoft is the largest IT consulting firm founded in the Madison Area, with more than 200 current consultants! With over 50 active clients, TeamSoft will give you the greatest exposure to the widest range of IT careers. Our executives possess a combined 60+ years of IT consulting experience. Our recruiting and Account Management staff are very well-versed in our client markets. We get you. We know you. We know what you do every day. And we know what you deal with on the job. You take your career seriously and so do we. At TeamSoft you are not just a resume or number. Our goal is to create long-term partnerships with each of our consultants, and according to feedback from many of them, we are very good at this. Click HERE to see what our consultants have to say about working with TeamSoft. TeamSoft is an equal employment opportunity employer functioning under an Affirmative Action Plan. - provided by Dice Business Analyst, Visio, process mapping, data warehouse, data analysis\n<br>\nAssociated topics: analyse, business, business analyst, business analytic, financial analyst, forecasting, inspect, investment analyst, legal, refine"}