{"job title": "Position Available Financial Data Analyst", "company": "The Fountain Group", "city state": "– New Brunswick, NJ", "rating": "4.0", "job description": "Job Description<div>My name is Josh Stock and I represent <strong>The Fountain Group.</strong> We are a national staffing firm and are currently seeking a <strong>Financial Analyst</strong> for a prominent fortune 500 clientof ours. This position is located in New Brunswick, NJ. Details for the positions are as follows:\n<br><br>\n<strong>Job Description</strong>\n<ul>\n<li>Job encompasses a variety of projects related to our global transfer pricing group mainly around gathering data from affiliates and systems (including Bravo), validating and analyzing this data (including running analytics looking for outliers, comparative analysis on a year on a year basis, etc.); producing Powerpoint and Word summaries of the data (including generating charts and graphics); and assisting with producing tools for managing large global project management.</li><li>Requirements include understanding company systems, particularly around management versus legal entity financial reporting; understanding of GAAP reporting for income statements and balance sheets; calculating key financial indicators (e.g., return on assets, operating margins); segmenting income statements and balance sheets; and performing other analyses .</li><li>Candidates must have advanced Excel skills and knowledge of Tableau, Power BI, and/or Access would be preferred.</li><li>Strong organizational skills are critical to the success of this role.</li><li>A BA/BS degree is required for this role.</li> \n</ul>\nIf you are interested in hearing more about the position please respond to this email <strong>with your resume attached</strong>\n<br><br>\nPlease forward this email to any friends or colleagues as we do offer a <strong>Referral Bonus</strong> for any candidate hired.</div>Company Description<div>About The Fountain Group:\n<br>\nHeadquartered in Tampa, FL, with operations in all 5 regions, The Fountain Group is a Contingent Labor Resource Provider. The Fountain Group services clients directly, clients with an internal contingent labor program, and clients with an external managed service program.\n<br><br>\nAt The Fountain Group, we know that searching for a new career can be stressful, which is why we take time to understand your skills and personal goals. We understand the importance of job flexibility and professional growth, and offer top-notch positions with leading employers. In fact, the majority of our clients are well known Fortune 100-500 companies. We also offer a variety of benefits to our associates to ensure their overall happiness.\n<br><br>\nIn addition to assisting with your job search, we will help you through every step of the process offering online tutorials and additional resources to enhance your industry knowledge and skills. As your employment agent, we are dedicated to providing career counseling and job advice, knowing precisely what established companies want.\n<br><br>\nAt The Fountain Group, we treat you like family, regardless of your proximity to our office. We are dedicated to providing you with an exciting, challenging and highly rewarding place to work. Become a part of our team today and let us put your talents to work.\n<br><br>\nIf you are interested in hearing more about the position please respond to this email with a copy of your resume in word form with the best contact info Please forward this email to any friends or colleagues</div>"}