{"job title": "Master Data Analyst", "company": "TrialCard", "city state": "– Cary, NC", "rating": "4.1", "job description": "Overview\n<p>At TrialCard, our passion is success - success for clients, success for us. You’ll notice who comes first. We’re committed to providing solutions, through innovation and unparalleled customer support, to the pharmaceutical industry to improve access and affordability of their medicines to patients. We work tirelessly on the behalf of our clients, because when they succeed, so do we.</p>\n<p> </p>\n<p>The Master Data Analyst will serve as the data steward who ensures that data collected through TrialCard source systems and presented to internal and external stakeholders is mastered to a high degree and meets rigorous data quality standards. They will work with cross-functional teams to define those standards and ensure they are enforced on an enterprise level.</p>\n<p> </p>\n<p>The candidate must be an excellent communicator (both orally and written) and be able to effectively foster interactive collaboration and discussions among clients and internal TrialCard teams. The Master Data Analyst must be able to present analyses and conclusions in a logical and clear manner and must be able to effectively work as part of a team.</p>\nResponsibilities\n<ul>\n <li>Work with TrialCard product owners to define, implement and document data mastering standards for common entities such as prescribers, payors, PBMs, pharmacies, sites and patients</li>\n <li>Conduct daily remediation of records requiring mastering</li>\n <li>Conduct bulk remediation of data imported into the TrialCard environment in support of programs that are being transferred from other vendors</li>\n <li>Conduct bulk remediation of data imported from legacy TrialCard systems into move forward enterprise systems</li>\n <li>Work closely with the TrialCard data warehouse and business intelligence teams on standards that support reporting needs of internal and external stakeholders</li>\n <li>Collaborate with source system owners on processes for the presentation of mastered data in those systems</li>\n <li>Collaborate with source system owners to improve processes for data collection to minimize remediation volumne</li>\n <li>Work with TrialCard’s Quality Assurance / Quality Control department to ensure their needs are supported with regards to raw data capture vs. mastered data in source systems</li>\n <li>Crosstrain to support ad hoc reporting requests for other areas of the TrialCard organization, particularly the Market Access division</li>\n</ul>\nQualifications\n<ul>\n <li>Bachelor's degree or equivalent combination of education and experience.</li>\n <li>Bachelor's degree in information science, data management, computer science or related field preferred.</li>\n <li>Experience working with industry standards, regulations, and guidelines in database warehousing and other relevant systems.</li>\n <li>Must have 2+ years of related data-management, analytics, or business intelligence experience.</li>\n <li>Solid technical writing skills; ability to clearly and completely articulate work to be done and describe tasks using proper terminology.</li>\n <li>Demonstrated application of analytical skills.</li>\n <li>Mid-level proficiency in SQL programming and common query optimization techniques for data extraction.</li>\n <li>Advanced Excel and/or Access skills. (e.g., VLOOKUP, SUMIF, Macros)</li>\n <li>Understanding of dimensional data modeling concepts, as well as data warehousing design highly desirable.</li>\n <li>Knowledge of the pharmaceutical or other healthcare industry highly desirable.</li>\n</ul>"}