{"job title": "Clinical Data Analyst", "company": "Unicon Pharma", "city state": "– San Francisco", "rating": "4.2", "job description": "<strong><br><br><strong>ROLE AND RESPONSIBILITIES</strong>:</strong>\n<br>\nWe are looking for a <strong>Clinical Data Analyst (CDA)</strong> to turn data into information, then information into insight and\n<br>\nobservations, with the goal for our business unit to review the pattern of these observations and use\n<br>\nthis information when making business decisions. The candidates need to be very curious , who\n<br>\nenjoy diving deep into the material to find observations into a yet unknown question. They need to\n<br>\nhave a natural desire to go beneath the surface of a problem. They need to be thinkers who can ask\n<br>\nthe right (business) questions. We'll ask this CDA to collect and study data to reveal ways to\n<br>\nimprove our business, or databases. The data would involve almost surveys, marketing, sales,\n<br>\nresearch or resources databases. This position involves problem-solving, mathematics, computer\n<br>\nskills and studying sets of both unstructured and structured data.\n<br>\nWe will supply the CDA with data sets, a scenario or problem, and the analyst must regularly\n<br>\npour through data and make observations. The analyst will analyze information from various sources\n<br>\nthat might help us better understand our situation and then study the information to uncover patterns\n<br>\nand outliers. They must be able to identify and interpret patterns and trends, assess data quality and\n<br>\neliminate irrelevant data.\n<br>\nThe CDA communicates the results of their analysis as a comprehensive report to company\n<br>\ndecision makers. He/She designs the report and includes tools that can help those involved easily\n<br>\ndigest the data, such as statistics, graphs, images and lists. He/She wouild distribute the report via a\n<br>\nface-to- face meeting presentation to SME.\n<br>\nThe CDA could provide database design services (nice to have, not need to have). They also\n<br>\ncollect data using a variety of methods, such as data mining and hardcopy or electronic\n<br>\ndocumentation, to improve or expand databases. Additionally, the data analyst should be able to\n<br>\nmake recommendations about the methods used to collect, analyze and manage data to improve\n<br>\ndata quality and the efficiency of our systems.\n\n<ul>\n<li>Interpret data, analyze results using statistical techniques and provide ongoing reports- Implement strategies that optimize statistical efficiency and data quality- Acquire data from primary or secondary data sources and maintain databases/data systems- Identify, analyze, and observe trends or patterns in structured and unstructured data sets- Filter, \"clean and \"normalize data- Work closely with management to prioritize business and information needs- Locate and define new opportunities for process improvement\n<br>\n<strong>PERSONAL AND PROFESSIONAL QUALIFICATIONS</strong>:\n<br>\n<strong>Education</strong>:BS in Mathematics, Economics, Computer Science, Information Management or Statistics; MS preferred.</li>\n<li><strong>5+</strong>working experience as a clinical data analyst with <strong>experience with clinical trials</strong>:</li>\n<li>Technical expertise regarding data models, data mining and segmentation techniques- Strong knowledge of and experience with reporting packages (<strong>SAS</strong>, Viseo, Tableau, Qlickview) and\n<br>\nprogramming (JSON, Javascript, or Python)</li>\n<li>Knowledge of statistics and experience using statistical packages for analyzing large datasets\n<br>\n(Database Logic/SQL)</li>\n<li>Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy- Adept at queries, report writing and presenting findings- Good verbal communication skills. Strong written and verbal communication skills- Ability to work in a fast-paced environment- Basic understanding of how a business and strategy work- Ability to work autonomously</li>\n</ul>"}