{"job title": "Data Center Operations Analyst", "company": "University of California", "city state": "– Los Angeles, CA", "rating": "4.1", "job description": "Requisition Number: 28732 Job Title: PROGRAMMER/ANALYST I Working Title: Data Center Operations Analyst Salary: $21.75 - $34.62 hourly Job Type: Career Department Name: 4100-ADMINISTRATIVE INFORMATION SYSTEMS Department Website URL: www.it.ucla.edu Job Summary Statement: Operate the Information Technology Services Data Center IBM z/os Mainframe, Distributed Platform servers, and related equipment. Detect and resolve abnormal conditions. Exercise initiative and judgment to efficiently utilize hardware and software to meet schedules. Perform Rerun/Restart functions. Analyze and develop solutions for problems with production work. Assist Job Scheduling staff. Participate in inter and intra departmental projects such as application conversions or revisions. Act as problem manager when called upon. Coordinate escalation and/or resolution to problems that occur on shift. Produce reports on adherence to scheduling. Assist in evaluation of new systems. Review and maintain logs and reports on batch jobs, hardware, component schedules and software performance. Maintain help desk functions after hours, on weekends and Holidays. Schedule and assist in performance of daily maintenance procedures. Perform as lead operator. Assume the duties of the shift supervisor in their absence. Position may be assigned to work either a day, evening or overnight shift, including weekends and holidays. Percentage of Time: 100 Shift Start: 11:30 pm Shift End: 8:00 am Qualifications for Position\n<br><br>\n11 Records Qualifications Required/Preferred\n<br><br>\nOne or more years professional experience supporting applications running on IBM z/os and mainframe console command experience including associated tools and products such as TSO, JES2,CA1,CA11,JAMS, and OMEGAMON.\n<br><br>\nRequired\n<br><br>\nDemonstrated ability to respond to mainframe production problems quickly, accurately, independently and with adequate follow-up.\n<br><br>\nRequired\n<br><br>\nAbility to use systems documentation, user manuals, and vendor documentation to maintain current knowledge of production environment.\n<br><br>\nRequired\n<br><br>\nAbility to establish and maintain cooperative working relationships with internal and external staff and users.\n<br><br>\nRequired\n<br><br>\nSkill to ensure maximum productivity of production processing through resource planning, analytical ability and technical knowledge of mainframe production.\n<br><br>\nRequired\n<br><br>\nWorking knowledge of mainframe utilities for debugging, scheduling, incident management and outages.\n<br><br>\nRequired\n<br><br>\nFamiliar with IT Service Management processes and procedures.\n<br><br>\nRequired\n<br><br>\nVerbal and written communication skills sufficient to share information with staff and leadership; ability to use standard English grammar and punctuation; able to effectively communicate technical information to people at all levels and technical background.\n<br><br>\nRequired\n<br><br>\nFamiliar with UPS,HVAC, fire systems and other mission critical infrastructure support equipment/tools.\n<br><br>\nRequired\n<br><br>\nBachelor's degree in MIS, Computer Science, Information Systems, or similar OR equivalent relevant professional experience.\n<br><br>\nPreferred\n<br><br>\nAbility to work during the day, evening or overnight, including weekends and holidays.\n<br><br>\nRequired Additional Posting InformationBargaining Unit: 99-Policy Covered Application Deadline: 10-04-2018 External Posting Date: Quicklink To Posting: hr.mycareer.ucla.edu/applicants/Central?quickFind=74180 Special Instructions: This position has the working hours of 11:30PM-8:00AM, Thursday through Monday. Contact information: Number of Positions: Special EmploymentDesignations/Requirements Per UC PolicyConflict of Interest: N/A Critical: Continued employment contingent upon completion of satisfactory background investigation. Driving Record: N/A E-Verify Check:\n<br><br>\nCertain positions funded by federal contracts/subcontracts requires UCLA to notify job applicants that an E-Verify check will be conducted and the successful candidate must pass the E-Verify check.\n<br><br>\nMore Information This position does not require E-Verify check. CANRA:\n<br><br>\nIs this position designated as a mandatory reporter under CANRA? No Other Special Employment Requirements: Position is subject to performance standards and other requirements of the University wide Police Policies and Administrative Procedures.\n<br><br>\nReturn to Search Results"}