{"job title": "Infosec Data &amp; Reporting Analyst", "company": "Vitamin T", "city state": "– Hillsboro, OR", "rating": "4.8", "job description": "<p>A Fortune 100 Athletic Apparel and Footwear Company located in Beaverton, OR is looking for a Infosec Data &amp; Reporting Analyst to join the team. </p>\n\n<p>This is a 6 month temporary role and a great way to get your foot in the door at this AMAZING company !</p>\n\n<p>As a Data &amp; Reporting Analyst, your role on the GRC (Governance, Risk and Compliance) team will include leveraging your skillset to deliver high-quality executive-level reports as well as <br>\nperforming ad-hoc administrative duties, managing timelines for projects, and facilitating meetings. </p>\n\n<p><u><strong>Your responsibilities will also include: </strong></u><br>\n Extracting data from various sources and incorporating into polished, executive-level <br>\npresentations <br>\n Supporting ad-hoc requests for information by querying relevant data sources <br>\n Managing the schedules of multiple simultaneous initiatives and ensuring milestones <br>\nare met <br>\n Facilitating meetings for the Governance team and coordinating schedules <br>\n Partnering with all GRC, CIS and other technology stakeholders to ensure project <br>\nalignment <br>\n<br>\n<u><strong>Requirements </strong></u><br>\n 1-2 years of data analysis experience, preferably within a cybersecurity organization <br>\n Excellent Microsoft Excel, Microsoft PowerPoint, Microsoft Word skills <br>\n Experience with Service-Now and/or Tableau is a plus <br>\n Excellent analytical and problem solving skills <br>\n Excellent collaboration skills – must be eager to work as part of a cohesive team and <br>\nwork as a partner to other teams within the company locally and global. <br>\n Comfortable working with ambiguity is a must <br>\n Exceptional communication skills, including the ability to gather relevant data and <br>\ninformation, actively listen, dialogue freely, verbalize ideas effectively, negotiate tense <br>\nsituations successfully, and manage and resolve conflict <br>\n Experience working successfully in a highly matrixed work environment. </p>"}