{"job title": "Co-op - Data Analyst", "company": "Volvo Group", "city state": "– Hagerstown, MD", "rating": "4.0", "job description": "Volvo Group Trucks Operations (GTO) is the truck industrial entity within the Volvo Group responsible for Truck manufacturing, including Cab&amp;Vehicle Assembly, Powertrain Production, Logistics Services, Parts Distribution and Remanufacturing. Hagerstown's group function is Powertrain Production. Powertrain production is one of the world's largest manufacturer of heavy-duty diesel engines for commercial vehicles. Powertrain production provides diesel engines and transmission systems to the Volvo Group Business Areas.\n<br><br>\nPosition Description\n<br><br>\nWe are currently looking for a student to work with our maintenance team as a data analyst. The student should be prepared to work in a challenging and fast-paced environment; gaining experience and knowledge in various aspects of engineering. As a valued member of the maintenance team within GTO, the student will have the opportunity to work directly with the VMMS application to populate machine Bills of Material, identifying obsolete Parts, correcting part inventory, and optimizing machine breakdown data. GTO's goal is to contribute to the student's development, as well as providing an opportunity for the student to work in a business environment within the manufacturing industry. This position will report to the VMMS Site Key User Steven Vaughn.\n<br><br>\nPosition Responsibilities\n\n\n<ul>\n<li>Populate machine Bills of Material from historic and breakdown data</li>\n<li>Identifying obsolete and incorrect parts through counting reporting</li>\n<li>Correcting part inventory from count reports, transactions and obsolete machines</li>\n<li>Optimizing machine breakdown data through team meetings and daily reports</li>\n</ul>\n\nCritical Competencies\n\n\n<ul>\n<li>Attention to Detail: Provide accurate data and reports that are pertinent to the team's tasks.</li>\n<li>Teamwork: Building cooperation among individuals and departments, sharing information and resources, and working to achieve group goals and outcomes.</li>\n<li>Communication: Listen effectively, transmit information accurately and understandably, and actively seek feedback from experienced engineers, project manager, etc.</li>\n<li>Dependability/Reliability: Follow through on commitments, timely delivery on projects, assigned tasks, etc.</li>\n<li>Flexibility: Willing to perform a wide range of tasks, positive responds to changes in direction and priorities, and acceptance of new challenges, responsibilities, and assignments.</li>\n<li>Co-op Education and Program Requirements</li>\n<li>Applicant must be currently enrolled and pursuing a degree in engineering or data analyst degree at an accredited school and have completed 30 semester hours of undergraduate studies prior to the start of the co-op.</li>\n<li>Applicants must have a minimum cumulative grade point average of 3.0.</li>\n<li>Strong communication skills.</li>\n<li>Valid US Work authorization.</li>\n</ul>\n\nPersonal Competencies\n\n\n<ul>\n<li>Customer Focus</li>\n<li>Technical Skills</li>\n<li>Peer Relationships</li>\n<li>Integrity and Trust</li>\n<li>Standing Alone</li>\n<li>Action Oriented</li>\n<li>Perseverance</li>\n</ul>"}