{"job title": "Research Data Scientist, Internal SLU Analytics Product", "company": "Amazon", "city state": "– Cambridge, MA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nThe Research Scientist – Applied Modeling &amp; Data Science for spoken language understanding (SLU) anlaytics is accountable for establishing performance metrics and analytics for Alexa SLU teams to continuously improve Alexa for our customers. Facilitate creation of KPIs and KPMs, tethered to SLU model performance/customer engagement, and define, drive, and execute research projects to test and prove these metrics. The Research Scientist should thrive and have demonstrated success in an environment which offers ambiguously defined problems, big challenges, and quick changes. They will deliver artifacts (e.g., analysis to support an organization or system decision, experimental design and execution exploring proper performance metrics, an algorithm, technical documentation, or technical program/script) while operating autonomously, even in ambiguous situations or requests. They will be expected to balance detailed execution with speed and possess solid collaborative skills. They will be working in a fast-paced environment where every day brings new challenges and new opportunities. They should have excellent business and communication skills and be able to work with business owners to develop and define solutions. This position involves regular communication with senior management on project status and risks. Cross-team coordination, project management, and executive presentation skills are essential.<br><br>The successful candidate will be a recognized expert for their analytical and leadership abilities.<br><ul><li>Apply data selection, experimental design, and statistical methods to specific business problems and data</li><li>Propose, define, scope, and execute experiments (A/B testing) for various analytics software program enhancements and performance and/or comparison of multiple different KPIs, metrics, or signals</li><li>Ensure data quality throughout all stages of acquisition and processing, including such areas as data sourcing/collection, ground truth generation, normalization, transformation, cross-lingual alignment/mapping, etc.</li><li>Collaborate with colleagues from multidisciplinary science, engineering and business backgrounds.</li><li>Work with engineers to develop efficient data querying and modeling infrastructure</li><li>Manage your own process: identify and execute on high impact projects, triage external requests, and make sure you bring projects to conclusion in time for the results to be useful</li><li>Communicate proposals and results in a clear manner backed by data and coupled with actionable conclusions to drive business decisions</li></ul><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Bachelor Degree in Data Science, Analytics, Computer Science Eng., Systems Eng., Statistics + 5 years of experience OR</li><li>MS in Statistics, Applied Math, Operations Research, Economics or related field + 2 years of experience</li><li>5+ years of experience with relevant technologies, enterprise reporting systems, data analytics.</li><li>5+ years of experience in working as an analytics or data engineering member working with cross functional teams.</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Experience in experimental design, analytical review of research proposals and results</li><li>Experience working with enterprise reporting systems, data analytics.</li><li>Experience working as an Analytics Engineer or Data Scientist working with cross functional teams.</li><li>Experience working with data visualization tools and creating data visualization concepts. (Excel, Tableau, or similar)</li><li>Experience of statistical analysis and tools such as SAS, R, or equivalent.</li><li>Familiarity with AWS RedShift and other distributed computing technologies preferred.</li></ul><br><br><br>Amazon.com is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation<br><br><br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}