{"job title": "Scientist", "company": "Apex Life Sciences", "city state": "– Kimberton, Pennsylvania", "rating": "2.5", "job description": "Apex Life Sciences has an exciting opportunity for a Scientist with one of our Chemical clients located near King of Prussia, Pennsylvania.\n<br><br>\nThe Scientist will be responsible for leading the execution of laboratory work for new and reformulation of products and product lines.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Conduct research in the areas of formulation modifications and potential new product development</li>\n<li>Develop new applications or customize existing applications to meet specific scientific project needs</li>\n<li>Summarize and communicate data results to the broader technology team and recommend new systems and processes to improve operations</li>\n<li>Document all work product in a clear and logical manner using standard scientific reports</li>\n<li>Provide input into quality control testing protocols as necessary</li>\n</ul>\n\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>Bachelor of Science degree in Chemistry or Science related field.</li>\n<li>Minimum of 2 years of industry experience with formulations.</li>\n<li>Asphalt, acrylic, moisture cure coatings, adhesives, sealants, etc.</li>\n<li>Must have experience with TGA and DSC.</li>\n</ul>\n\nEEO Employer\n<br><br>\nApex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at ************.\n<br><br>\nJob ID: ******\n<br><br>\nHelp us improve CareerBuilder by providing feedback about this job: .\n<br><br>\n<strong>CAREERBUILDER TIP</strong>\n<br>\nFor your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.\n<br>\nBy applying to a job using CareerBuilder you are agreeing to comply with and be subject to the CareerBuilder Terms and Conditions for use of our website. To use our website, you must agree with the Terms and Conditions and both meet and comply with their provisions.\n<br><br>\nApex Life Sciences\n<br><br>\nOn Assignment's U.S. life sciences businesses, Lab Support and Valesta Clinical Research Solutions, have been re-branded as Apex Life Sciences. The U.S. divisions of Lab Support and Valesta are leaders in the scientific, engineering, and clinical research staffing and services industry. The new name was chosen to leverage the national brand of On Assignment's Apex Systems, a leader in the technology staffing and services industry. For over 30 years, Lab Support and Valesta have provided top talent for contract, contract-to-hire, and direct hire positions in the life sciences industries. With hundreds of thousands of successful matches over three decades, the divisions have built reputations as the best in the business. Contact Info\n\n\n<ul>\n<li>Kimberton, PA</li>\n</ul>"}