{"job title": "Bioinformatics Scientist", "company": "Chan Zuckerberg Biohub", "city state": "– San Francisco, CA", "rating": "NA", "job description": "The Chan Zuckerberg Biohub (the \"CZ Biohub”) is a well-funded, non-profit, life science research institute located in the Mission Bay neighborhood of San Francisco, California. We are committed to solving some of the world’s biggest problems together: we seek to help cure, prevent or manage all human diseases by the end of the century. We find and invest in the best and brightest scientists and engineers and we seek to create an environment of true and free-flowing collaboration. We provide the best technologies and tools available – and when they don’t exist yet, we build them.\n<br><br>\n<strong>WHO WE ARE AND WHAT WE DO:</strong>\n<br><br>\nThe Darmanis group is developing tools to study different molecular entities in single cells in high-throughput and cost-effective ways. We use these tools to study: neuro-development, aging, and the heterogeneity of human tumors and their interactions with the tumor microenvironment to name a few current project themes.\n<br><br>\nWe are currently seeking a Bioinformatician to join our exceptional, motivated, and highly collaborative team. This position focuses on analyzing NGS data sets with an emphasis on single cell RNA-seq (scRNA-seq), including developing novel pipelines and computational approaches. The ability to develop, evaluate and implement new techniques will be critical.\n<br><br>\n<strong>CORE RESPONSIBILITIES:</strong>\n<br><br>\n• Analyze scRNA-seq dataset generated for internal and external collaborations\n<br><br>\n• Evaluate and improve open source tools for scRNA-seq data analysis, including developing reports encompassing differential gene expression, splice variant, and expressed SNP analysis\n<br><br>\n• Develop or extend in-house workflow to streamline NGS data analysis workflow and visualization\n<br><br>\n• Improve computational approaches related to NGS data QC and normalization, clustering of cell populations, inferring cellular trajectories and reconstructing lineage hierarchies\n<br><br>\n<strong>Requirements</strong>\n<br><br>\n• Master’s degree in Bioinformatics, Computer Science, Genomics, or a related field, with at least 5 years of hands-on experience with Bioinformatics methods\n<br><br>\n• Expertise in programming languages commonly used in Bioinformatics (such as Python and/or R)\n<br><br>\n• Fluency with Linux shell scripting and high performance computing\n<br><br>\n• Passion to build innovative software solutions and data analysis pipelines\n<br><br>\n• Ability to write and publish articles in quality peer-reviewed journals, and present at internal and external meetings\n<br><br>\n<strong>PREFERRED QUALIFICATIONS:</strong>\n<br><br>\n• A Ph.D. in Bioinformatics or Computational Biology related fields\n<br><br>\n• Prior experience with single-cell RNA-seq data preferred\n<br><br>\n• Familiar with NGS algorithms, such as Bowtie, BWA, STAR, cufflinks, RSEM, featureCounts, and etc.\n<br><br>\n• Significant experience in algorithm development and implementing pipelines for NGS data analysis\n<br><br>\n• Knowledge in Amazon cloud computing and Docker is a plus\n<br><br>\nThis opportunity is full-time only. No contractors, consultancies or recruiters will be considered. CZ Biohub is proud to be an equal opportunity employer."}