{"job title": "Scientist", "company": "Charles River Laboratories", "city state": "– San Francisco, CA", "rating": "3.0", "job description": "Scientist\n<br><br>\nReq ID #: 37294\n<br><br>\n<strong>Location:</strong>\n<br><br>\nS. San Francisco, CA, US, 94080\n<br><br>\nFor nearly 70 years, Charles River employees have worked together to assist in the discovery, development and safe manufacture of new drug therapies. When you join our family, you will have a significant impact on the health and well-being of people across the globe. Whether your background is in life sciences, finance, IT, sales or another area, your skills will play an important role in the work e perform. In return, we?ll help you build a career that you can feel passionate about.\n<br><br>\nWe have currently an open position for aBioanalytical Scientistand we are seeking a highly motivated, qualified and interactive candidate for ourDiscoverysite located inSouth San Francisco, CA.\n<br><br>\nThe successful candidate will perform and supervise routine analysis of small molecules and biotherapeutics in complex biological matrices. For the current position, you will provide quantitative analysis, develop new analytical methods and data interpretation of various biological samples using LC-MS/MS and enzyme-based immunoassays.\n<br><br>\nAll aspects of analytical laboratory operations, such as sample receipt, data generation, verification and interpretation, aberrant data and out-of-specification investigations, instrument qualification, operation, and troubleshooting, and all supporting documentation for such activities.\n<br><br>\n<strong>Specific Responsibilities will include:</strong>\n<br><br>\n+ Method Development, analysis, maintaining and troubleshooting of LC-MS instrumentation\n<br><br>\n+ Assure high quality of the analytical work performed at our company\n<br><br>\n+ Conduct scientific literature searches and maintain accurate documentation of experiments\n<br><br>\n+ Provide guidance and supervise junior research associates\n<br><br>\n+ Project planning and ensuring projects run to time frame and key milestones\n<br><br>\n+ Preparation and writing of bioanalytical reports\n<br><br>\nThe following are minimum requirements related to theScientistposition.\n<br><br>\n+ PhD in (bio)analytical and/or separation sciences with 2-5 years of post-doctoral or industry experience or an M.Sc. in related fields with 5-10 years of industry experience\n<br><br>\n+ Minimum of 5 years of theoretical and hands on experience with mass spectrometry and liquid chromatography is essential\n<br><br>\n+ Experience with enzyme-based immunoassays and/or protein chromatography will be appreciated\n<br><br>\nAbout Discovery\n<br><br>\nDiscovery from Charles River is industry-proven in the successful development of novel therapies, with over 320 patents and 74 preclinical drug candidates delivered to our sponsors in the past 17 years. Backed by more than 650 scientists, our comprehensive, integrated portfolio employs the latest technology and platforms to provide chemistry, biology, and pharmacology services that support clients from the earliest stages of hit identification all the way through to IND. Our client-focused, collaborative approach creates true partnerships that anticipate challenges, overcome obstacles, and move us forward together on the journey of getting new drugs to market.\n<br><br>\nAbout Charles River\n<br><br>\nCharles River is an early-stage contract research organization (CRO). We have built upon our foundation of laboratory animal medicine and science to develop a diverse portfolio of discovery and safety assessment services, both Good Laboratory Practice (GLP) and non-GLP, to support clients from target identification through preclinical development. Charles River also provides a suite of products and services to support our clients? clinical laboratory testing needs and manufacturing activities. Utilizing this broad portfolio of products and services enables our clients to create a more flexible drug development model, which reduces their costs, enhances their productivity and effectiveness to increase speed to market.\n<br><br>\nWith over 11,000 employees within 70 facilities in 18 countries around the globe, we are strategically positioned to coordinate worldwide resources and apply multidisciplinary perspectives in resolving our client?s unique challenges. Our client base includes global pharmaceutical companies, biotechnology companies, government agencies and hospitals and academic institutions around the world. And in 2016, revenue increased by 23.3% to $1.68 billion from $1.36 billion in 2015.\n<br><br>\nAt Charles River, we are passionate about our role in improving the quality of people?s lives. Our mission, our excellent science and our strong sense of purpose guide us in all that we do, and we approach each day with the knowledge that our work helps to improve the health and well-being of many across the globe. We have proudly supported the development of ~70% of the drugs approved by the FDA in 2016.\n<br><br>\nFor more information, please visitwww.criver.com.\n<br><br>\nEqual Employment Opportunity\n<br><br>\nCharles River Laboratories, Inc. is an Equal Opportunity Employer M/F/Disabled/Vet"}