{"job title": "SVP, Digital Business Analytics Data Scientist", "company": "Citi", "city state": "– Wilmington, DE", "rating": "3.6", "job description": "Primary Location: United States,Delaware,Wilmington Education: Bachelor's Degree Job Function: Decision Management Schedule: Full-time Shift: Day Job Employee Status: Regular Travel Time: Yes, 10 % of the Time Job ID: 18042524 Description Citi Branded Cards North America (N.A.) is the market leader in the credit card industry. With a pre-eminent global brand and franchise, Citi maintains its leadership position by delivering best in class products, advanced services and payment systems that address customers evolving needs. Position Objective: Citi continues to set the benchmark for growth and achievement in the financial services online space. To maintain this trajectory, as an industry frontrunner, Citi has created the role of Digital Business Analytics Grp Manager. The successful candidate will have a high visibility and strategic role in driving increased engagement of existing customers across the Citi online, web, mobile and app space. As one of the leaders for the Digital ECM team this individual will be focused on cross sell and customer engagement strategies for all digital channels. The team functions under the core agenda of \\\"Right offer to the right customer at the right time\\\". Key Responsibilities: Provide Digital Servicing subject matter expertise and provide competitive analysis Develop world class analytical approaches for customizing targeted offers Leverage statistical techniques (segmentation, machine learning models) to enhance the efficiency of targeting Identify and drive NPV opportunities working with cross functional partners Leverage data-driven insights and provide servicing and cross-sell marketing recommendations Develop test and learn strategies; measure impacts of program changes Assist with the development of business cases, which include quantifying revenue opportunities and examining cost-benefit trade-offs Control, Legal, and Compliance documentation/socialization to ensure targeting and offer strategies meet or exceed regulatory/internal guidelines Qualifications 6+ years leadership experience in a Digital Servicing / Marketing role Experience in Financial Services and/or Cards business highly preferred Knowledge of digital and offline data Predictive analytics (In-depth understanding of the machine learning algorithms / techniques) Advanced proficiency with statistical / analytical tools such as SQL, SAS, and R Advanced proficiency with Site Catalyst and other Digital Analytics tools Experience with Digital data using Big Data (Hadoop, Hive, R) highly preferred Strong project management skills and ability to focus on multiple priorities in a fast paced environment Ability to build partnerships across the business Strong written and verbal communication/presentation skills Bachelor's degree in analytical field such as Engineering, Statistics, or Mathematics (Masters level degree highly preferred) SVP, Digital Business Analytics Data Scientist\n<br>\nAssociated topics: analyst, business, business analytic, business systems analyst, examiner, forecasting, guidance, legal, market, regulation"}