{"job title": "Sr. Data Scientist - Engine Data Analytics", "company": "Criteo", "city state": "– Palo Alto, California", "rating": "4.0", "job description": "<div><strong>Who we are</strong></div><div>At Criteo, we connect 1.4 billion active shoppers with the things they need and love. Our technology takes an algorithmic approach to determining what user we show an ad to, when, and for what products. Our dataset is about 45 petabytes in Hadoop (more than 90 TB extra per day) and we take less than 10ms to respond to an ad request. This is truly big data and machine learning without the buzzwords. If scale and complexity excite you, join us.</div> <br>\n<div><strong>Your mission</strong></div><div>· Contribute to the development of a high-performance marketing product for the CPG (consumer packaged goods) industry.</div><div>· Build and improve the precision of our prediction models, used in to rank our ads in real time within 10ms.</div><div>· Gather and analyze data to extract valuable information relevant to prediction models.</div><div>· Identify key prediction problems and propose innovating solutions.</div><div>· Report, visualize and communicate results.</div>What you'll bring\n\n<ul>\n<li>MS degree in Software Engineering or related field.</li><li>3+ years of experience with data analysis or modeling.</li><li>2+ years of programming experience in Java, Scala, C++ or C#.</li><li>2+ years of data processing experience.</li><li>Passion for building exceptionally high quality prediction models, algorithms, creative problem solving, empowerment, agility, teamwork and superb communication.</li><li>Curiosity and drive - you love solving the hardest problems.</li>\n</ul>\n\n<div><strong>Criteo R&amp;D Culture</strong></div><div>· Empowerment We believe in hiring the best engineers in the industry and then letting them get on with what they do best designing, coding and releasing state of the art software.</div><div>· Mobility In our Voyager program our engineers get to pick which team they want to work on for 2-4 weeks, boosting collaboration, networking and maybe even leading to switching teams.</div><div>· Agility - We work in a fast pace environment where we build and release stuff frequently to deliver value soon and adapt to changes quickly.</div><div>· Variety We have many ways to get your code to production including our Hackathon, 10% projects, Voyager and more.</div><div>· Multicultural We have engineers from all over the world for you to interact and exchange ideas with.</div><div><strong>Our culture keeps evolving, and you will be expected to contribute actively with new ideas to complement and enhance the existing programs that include</strong> <strong>friction-less</strong><strong> internal mobility, 10% time, mentoring, technical talks, hackathons, conferences, etc. Are you up to the challenge?</strong></div><br>\n<div>At Criteo, we dare to be different. We believe that diversity fuels innovation and creates an energy that can be seen and felt all over Criteo. We champion different perspectives and are committed to creating a workplace where all Criteos are heard, feel a sense of belonging, and are treated with respect and dignity.</div><br>\n<div>Criteo collects your personal data for the purposes of managing Criteo's recruitment related activities. Consequently, Criteo may use your personal data in relation to the evaluation and selection of applicants. Your information will be accessible to the different Criteo entities across the world. By clicking the \"Apply\" button you expressly give your consent.</div>"}