{"job title": "Position Title Principal Data Scientist Consultant", "company": "DNV GL", "city state": "– Oakland, Texas", "rating": "3.3", "job description": "<li>Principal Data Scientist Consultant</li>\n\nLocation US-CA-Oakland | US-TX-Katy\n<br><br>\nRequisition ID 2018-11299\n<br>\nBusiness Area Digital Solutions\n<br>\nCategory/Discipline Consulting\n<br>\nPosition Type Permanent employment\n<br><br>\nLocal Unit &amp; Position Description\n<br><br>\nDNV GL - Digital Solutions is seeking a Principal Data Scientist Consultant to be based out of our Oakland, California or Houston (Katy) Texas offices. By joining our global team of data scientists and software developers, you will help leverage Big Data Analytic capabilities to transform our global services across all of the verticals we serve.\n<br><br>\nThe successful candidate will work in a strong multidisciplinary team of data scientists, software developers and domain experts. This team will run complex projects transforming existing and developing new digital services and tools across all of DNV GL's industries.\n<br><br>\nTasks may include\n\n\n<ul>\n<li>Design experiments, test hypotheses, and build models</li>\n<li>Conduct advanced data analysis and highly complex design algorithms</li>\n<li>Apply advanced statistical and predictive modeling techniques to build, maintain, and improve on multiple real-time decision systems.</li>\n<li>Establish and implement end to end proof of concepts and analytic applications</li>\n<li>Support Head of Department in creating business plans and strategy</li>\n<li>Prepare and conduct external and internal customer meetings and presentations</li>\n<li>Write business proposals and Statements of Work (SOW) for large and small project; estimate project delivery tasks</li>\n<li>Take ownership of small to mid-sized projects, including project management and delivery of all project needs such as written and oral feedback to the client, presentation materials, evaluations, data summaries and reports</li>\n<li>Follow up on business opportunities, lead on negotiations and closing business contracts</li>\n<li>Provide business metrics for the overall project to show improvements</li>\n</ul>\n\nPosition Qualifications\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nTechnical competencies\n\n\n<ul>\n<li>Master's Or PhD in computer science, statistics, physics, mathematics or a related field required, with focus on data analysis preferred</li>\n<li>3 years minimum hands on experience in analyzing scientific data, data analytics, machine learning, statistics or experiment design required</li>\n<li>The demonstrable ability to come up with solutions to loosely defined business problems by leveraging pattern detection over potentially large datasets</li>\n<li>Strong programming skills (such as Hadoop MapReduce or other big data frameworks, Java), and statistical modeling (such as SAS or R)</li>\n<li>Experience with languages like Python, R, Java and Scala preferred</li>\n<li>Experience with scalable noSQL databases, time series databases and search engines (like MongoDB, OpenTSDB, Elasticsearch, etc.) preferred</li>\n<li>Experience using Unix/Linux and the corresponding standard command line tools preferred</li>\n<li>Knowledge of and experience with micro service architecture style preferred</li>\n<li>Experience developing and consuming RESTful API services preferred</li>\n<li>Experience using code versioning systems (like Git) preferred</li>\n<li>Experience in building and leading high-performing teams preferred</li>\n<li>Good understanding of emerging digital technologies (such as big data, machine learning, IIOT, artificial intelligence) preferred</li>\n</ul>\n\nBusiness acumen\n\n\n<ul>\n<li>Knowledge of one or more of DNV GL's primary business areas: Maritime, Oil and Gas, Energy, Business Assurance (Certification).</li>\n<li>Experience in building and leading high-performing teams preferred</li>\n<li>Professional Experience and Industry Contacts (technically and commercially) from Energy sector, Oil and Gas business, Maritime business and/or Technical Consulting industry preferred</li>\n<li>Delivery Experience - experience preferred as a consultant or other 'knowledge worker'.</li>\n</ul>\n\nBehavioral competencies\n\n\n<ul>\n<li>Results orientation - Is highly resilient, works with pace, focus and determination to overcome obstacles and deliver business results.</li>\n<li>Integrated/Team Working - Communicates and works well with business and subject matter experts, ability to work independently and in a team environment</li>\n<li>Communication - Excellent overall English communication skills including the ability to write clearly and concisely, translating the rationale of their findings to internal and external stakeholders</li>\n<li>Customer-facing skills - ability to develop and maintain strong working relationships with our clients</li>\n<li>Analytical - Excellent analytical skills; ability to see commonalities among very different problems</li>\n<li>Creative - Demonstrates a high level of technical expertise and the ability to apply this knowledge to practical problems</li>\n<li>Time Management - Good organizational skills with the ability to deal with multiple issues under pressure</li>\n<li>Adaptable - Openness to continual learning with regard to emerging technologies, regulatory drivers and industry developments. Ability and willingness to learn and adapt quickly, and follow procedures</li>\n</ul>\n\nOther qualifications\n\n\n<ul>\n<li>Travel requirement (20-30% of the year). Flexibility to travel within the Americas and overseas for various periods of time required</li>\n<li>Physical ability to work with computers for extended periods of time on a daily basis required, including extended periods of sitting and/ or standing</li>\n<li>We conduct pre-employment drug and background screening; this position may also be subject to Personal Risk Assessment screening</li>\n<li>This is a US-based opportunity; applicants must be fully-authorized to work in the US</li>\n</ul>\n\nOpportunities Beyond Business\n<br><br>\nOur mission is to safeguard life, property and the environment. By joining us, you will work towards our meaningful vision: to make a global impact for a safe and sustainable future. DNV GL offers a congenial working environment, competitive salaries, and an exceptional benefits package.\n<br><br>\nDNV GL is an Equal Opportunity Employer and gives consideration for employment to qualified applicants without regard to race, color, religion, age, sex, national origin, disability or protected veteran status. For more information about your rights under the law, see: ****************************************************************\n<br><br>\nLocal employment conditions apply.\n<br><br>\nPlease visit our website at *************\n<br><br>\nCompany &amp; Business Area Description\n<br><br>\nDNV GL is a global quality assurance and risk management company. Driven by our purpose of safeguarding life, property and the environment, we enable our customers to advance the safety and sustainability of their business.\n<br><br>\nWe provide classification, technical assurance, software and independent expert advisory services to the maritime, oil &amp; gas, power and renewables industries. We also provide certification, supply chain and data management services to customers across a wide range of industries.\n<br><br>\nCombining technical, digital and operational expertise, risk methodology and in-depth industry knowledge, we empower our customers' decisions and actions with trust and confidence. We continuously invest in research and collaborative innovation to provide customers and society with operational and technological foresight.\n<br><br>\nWith origins stretching back to 1864 and operations in more than 100 countries, our experts are dedicated to helping customers make the world safer, smarter and greener.\n<br><br>\nDNV GL is a world-leading provider of digital solutions for managing risk and improving safety and asset performance for ships, pipelines, processing plants, offshore structures, electric grids, smart cities and more.\n<br><br>\nOur open industry platform Veracity, cyber security and software solutions support business-critical activities across many industries, including maritime, energy and healthcare."}