{"job title": "Sr. Data Scientist", "company": "Lucas Group", "city state": "– Atlanta, GA", "rating": "3.6", "job description": "Job Information:<br><br><strong>Job ID:</strong> 167549\n<br>\n<strong>Location:</strong> Atlanta, Georgia 30326\n<br>\n<strong>Industry:</strong> Retail\n<br>\n<strong>Occupational Category:</strong> Marketing\n<br>\n<strong>Position Level:</strong> Manager\n<br>\n<strong>Education:</strong> Doctoral or professional degree\n<br>\n<strong>Employment Type:</strong> Full Time<br><br>Description:<br><br>The<strong> Lucas Group</strong> is searching for an experienced, talented, and motivated<strong> Senior Data Scientist</strong> to add as a key member of our client’s Ecommerce team in Atlanta. The <strong>Senior Data Scientist</strong> will create machine learning and data mining solutions to improve digital experience for our client’s customers. The <strong>Senior Data Scientist</strong> will operate as a thought leader and visionary, with the ability to guide data science modeling and influence across analytical functions across organization.<br><br>Experience Requirements:\n\n\n<ul>\n<li>BA/BS and Master Degree in Human Factors, Marketing Analytics, Math, Computer Science or related quantitative field is required. PhD is preferred.</li>\n<li>10+ years of experience with large-scale data analysis and building high-performance computational software for an e-Commerce, Enterprise level company.</li>\n<li>Experience with recommender systems, information retrieval, graph analysis, statistical modeling, neural network, and natural language processing.</li>\n<li>Experience with e-Commerce and analyzing clickstream data.</li>\n<li>Experience with big data environment including Spark, Hadoop, Hive, etc.</li>\n<li>Proficiency in at least one statistics/data analysis package, such as Spark, Python or R.</li>\n<li>Proficiency in at least one programming language, such as Java or Python, etc.</li>\n<li>Solid coding practices including good design documentation, unit testing, and integration testing.</li>\n<li>Experience working with real-world noisy data.</li>\n<li>Strong communication and data presentation skills; ability to communicate with data-driven stories.</li>\n<li>Ability to quickly adapt to new technologies, tools and techniques.</li>\n<li>Flexible and responsive; able to perform in a fast paced, dynamic work environment and meet aggressive deadlines.</li>\n<li>Ability to work with technical and non-technical team members.</li>\n</ul>\n\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Develop a data science strategy that spans and informs all areas of the business from product innovation to customer success.</li>\n<li>Design and develop algorithms and models to improve recommendation, personalization, and search ranking that affects billions of visitors’ digital experience.</li>\n<li>Establish scalable, efficient processes for large scale data analysis, model development and model implementation.</li>\n<li>Develop the data roadmap using the most appropriate technologies, manage, and expand data teams to support growth.</li>\n<li>Engage cross-functionally to identify data-driven opportunities and map business problems to data science solutions.</li>\n<li>Communicate with product management and other business teams on problem definition and present findings in easily understood ways. Coordinate with IT team and write requirement documents for efficient model building and deployment.</li>\n<li>Mentor, guide, develop and inspire the technical and business skills the in data science best practices, and evangelize strategic use of data throughout the business.</li>\n<li>Define best practices and articulate a clear vision for how data analyses and model productionalization should be done.</li>\n</ul>\nLucas Group is North America's premier executive search firm. Since 1970, our culture and methodologies have driven superior results. We assist mid-tier to Fortune 500 clients find transcendent, executive talent; candidates fully realize their career ambitions; and associates find professional success. Headquartered in Atlanta, GA with 15 regional offices, our trusted, consultative, and passionate recruitment professionals combine industry depth and geographic breadth to deliver superior results. To learn more, please visit Lucas Group at www.lucasgroup.com.<br>\n<div>\nApply</div>\n<br>"}