{"job title": "Data Scientist - Genomics Intern or Co-op", "company": "Monsanto", "city state": "– Saint Louis, MO", "rating": "4.0", "job description": "Monsanto is passionate about using Data Science and Information Technology to improve agriculture. Data Science is critical to Monsanto?s success today and in the future as we transform into an Information Services company. We are seeking a Data Scientist to join our Global IT Analytics team as a co-op in the area of genome analytics. The Global IT Analytics team looks to find creative and innovative solutions to enable success within our R&amp;D, supply chain and commercial organizations while identifying and capitalizing on new opportunities to maintain and grow our position as a digital agriculture market leader. The ability to examine and optimize our current methods coupled with an eye on the future lends itself to a unique opportunity within Monsanto and our team. This is an exciting opportunity for a talented and passionate individual to join a multidisciplinary team of data scientists and engineers who work on real world problems.\n<br><br>\nAs a **Genomics** **Data Scientist** you will:\n<br><br>\n? Apply advanced skills in empirical analysis and mathematical modeling to complex domains such as genomics, plant breeding, and population genetics\n<br><br>\n? Identify new opportunities, expand existing methods, provide insights, and build practical solutions that balance theoretical performance with industrial scale\n<br><br>\n? Collaborate with a cross-disciplinary team that includes experts in fields ranging from computer science and bioinformatics to molecular biology, genetics, and plant breeding\n\n\n<ul>\n<li>*Required Qualifications:**</li>\n</ul>\n\n? Pursuing a Masters or PhD degree in Mathematics, Computer Science, Engineering, or other quantitative disciplines.\n<br><br>\n? Experience applying sophisticated scientific methods for analysis, using statistical and mathematical programming packages such as R, Python\n<br><br>\n? Proficiency in one or more modern programming languages\n<br><br>\n? Understanding of advanced analytics methods such as statistics, machine learning, and mathematical modeling\n<br><br>\n? Ability to turn complex data into predictive and prescriptive insights\n<br><br>\n? Experience analyzing and presenting complex data and proven problem solving abilities\n<br><br>\n? Exceptional organizational, interpersonal, and written communication skills\n<br><br>\n? Ability to work in a matrix environment, influencing people at varying levels of responsibility\n\n\n<ul>\n<li>*Desired Skills:**</li>\n</ul>\n\n? Knowledge of genomics, statistical genetics, or plant breeding\n<br><br>\n? Experience analyzing genetic/genomic data or applying computational techniques to biological data\n<br><br>\n? Experience with cloud computing and virtualization technology\n<br><br>\n? Experience with several programming paradigms (e.g. object-oriented, functional, scripting). Experience with Python, R, and Java languages. Experience with command-line tools and scripting\n<br><br>\n? Strong publication record in scientific journals\n\n\n<ul>\n<li>*Organization:** _GLB IT P&amp;E Analytics_51177654_</li>\n<li>*Title:** _Data Scientist ? Genomics Intern or Co-op_</li>\n<li>*Location:** _North America-USA-Missouri-St. Louis_</li>\n<li>*Requisition ID:** _01SSX_</li>\n<li>*Job:** _Information Technology_</li>\n<li>*Schedule:** _Full-time_</li>\n</ul>\n\nAt Monsanto, we value a diverse combination of ideas, perspectives and cultures. All qualified applicants will receive consideration for employment without regard to, among other things, race, religion, color, national origin, age, sex, sexual orientation, gender identity, gender expression, status as a protected veteran, or status as a qualified individual with a disability. If you need a reasonable accommodation to access the information provided on this website, please for further assistance.access our disability accommodations process\n<br><br>\nU.S. Employment Law (applicable for U.S. jobs ONLY): EEO Employer Minorities/Females/Protected Veterans/Disabled. For information about equal employment opportunity rights, please refer to this information from the U.S. federal government: ; .\n<br><br>\nEEOC PosterEEOC Supplement"}