{"job title": "Data Analyst 4", "company": "ServiceSource", "city state": "– Nashville, TN", "rating": "2.8", "job description": "This role is responsible for ongoing analysis of ServiceSource and industry specific data, obtained from a variety of sources and systems, including CRM, ERP, financial, and demographic data. It involves development and integration of multiple disparate data sources into distributed solutions for the Client Delivery and Sales organizations. It requires the ability to analyze complex data from conceptualization through presentation of the data. It requires proficiency with analytical tools, knowledge of data analysis methodology, use of presentation software, strong communication and consultative technical guidance skills with commitment to and affinity for delivering the highest level of data solutions.\n<br><br>\n<strong>Qualifications</strong>\n\n<ul>\n<li>5+ years experience in data analysis, decision support, including demonstrated proficiency with analytical software</li>\n<li>Bachelor's degree or higher in Computer Science or related field</li>\n<li>RDBMS - Advanced MS SQL Server experience preferred</li>\n<li>SalesForce CRM preferred</li>\n<li>Microsoft Integration Services (SSIS) preferred</li>\n<li>Microsoft Reporting Services (SSRS) preferred</li>\n<li>Strong ETL experience; extract data from different sources, transform data into a desired result and load such result into a data warehouse</li>\n<li>Basic statistical skills, including sample size, confidence intervals and linear correlation/regression desirable</li>\n<li>Data profiling and Data modeling experience</li>\n<li>Experience working in Agile development environment</li>\n<li>Knowedge of source control applications and use</li>\n<li>Exceptional written and verbal communication skills; with the ability to communicate technical solutions to non-technical end-users and stakeholders.</li>\n<li>Highly flexible, comfortable with large amounts of information, adept at managing expectations, and able to set and adjust priorities as needed</li>\n<li>Highly motivated \"self-starter\" capable of managing large pieces of a project without direct management</li>\n<li>Microsoft Office Suite with advanced Excel skills</li>\n<li>OLAP preferred</li>\n</ul>"}