{"job title": "Equipment Engineer - II", "company": "Axelon, Inc.", "city state": "– Walnut Creek, California", "rating": "3.5", "job description": "<strong>Equipment Management Roles and Responsibilities:</strong>\n<br><br>\nResponsible for Engineering and Design of macro and small cell equipment in Northern California/NV. Projects include macros, small cells, and in-building solutions.\n<br>\nForecast future cell site needs including but not limited to E/// equipment, cabinets, antennas, batteries, power plants, generators, and other major materials.\n<br>\nManage the ordering and delivery of equipment for timely equipment arrival. The goal is to have equipment ready prior to construction start.\n<br>\nLook at reusing available inventory first prior to ordering new equipment.\n<br>\nPrepare purchase order requests and ensure vendor payment on receipts.\n<br>\nKeep current and updated with the latest Maintenance Engineering approved equipment.\n<br>\nEnsure optimum equipment allocation and efficiency.\n<br>\nCommunicate information and follow-up to the internal Telecommunication team.\n<br>\nSupport construction team and Network Assurance with equipment issues.\n<br>\nPerform risk management to process to minimize project risks. Identify risks in the program.\n<br><br>\n<strong>Requirements:</strong>\n<br><br>\n5+ years experience as a Project Manager in Wireless\n<br>\n5+ years experience in construction and utility coordination\n<br>\nStrong working knowledge of MS Office, Siterra, and SiteTraker\n<br>\nPMP certification is a plus\n<br>\nExcellent written and verbal communication skills\n<br>\nStrong project management and communication skills and ability to work with various departments\n<br>\nCandidate must have strong experience with E/// and cell site equipment\n<br>\nSolid technical background with understanding of 4G LTE infrastructure\n<br>\nMust be self-managed and motivated.\n<br>\nExperience in managing budgets and peoplesoft skills.\n<br>\nKnowledge of Data Analytics and visualization"}