{"job title": "Sr Avaya Engineer", "company": "Carousel Industries", "city state": "– Waltham, MA", "rating": "3.0", "job description": "Carousel Industries is one of the fastest growing IT companies in the US, poised for explosive growth. As a premier IT services firm, we offer an extensive portfolio of services and technologies that span the following areas: unified communications and collaboration, networking, data center, security, and cloud-based solutions. Through our partnerships with leading technology vendors—like Cisco, Avaya, Microsoft, HPE, and Fortinet, for example—Carousel offers innovative IT leadership, consultative, professional, and managed services to help our clients drive transformation within their organization. Founded in 1992, Carousel serves more than 6,000 customers, including 35 of the Fortune 100. Carousel has been recognized by multiple publications and industry consortiums as a top technology integrator and managed services and cloud solution provider–including the Inc. 500/5000, Healthcare Informatics 100, and CRN MSP Elite 150. Headquartered in Exeter, RI, Carousel has more than 1,400 employees based in 27 offices–with three Network Operating Centers nationwide.\n<br><br>\nWe are searching for those who are fueled by an inner drive to make a difference and to push their professional and technical capabilities to the next level. If you are someone who wants to become the “go to person” or the “subject matter expert” in your field, then Carousel is the place for you. Ask Carousel employees what makes them stick around for five, 10, or 20 years, and they’ll tell you it’s the brilliant people with whom they collaborate and the opportunities for personal and professional growth.\n<br><br>\nIn addition to gaining a quantum leap in your technical IQ, Carousel is a fun place with a work hard / play hard mentality and an inspiring culture. Whether it’s assembling a team to compete in the next Tough Mudder or enjoying a summertime BBQ, Carousel employees consider their peers as family. To learn about our team and how you can be part of the Carousel family, find us at www.carouselindustries.com, Facebook, Twitter, and LinkedIn.\n<br><br>\n<strong>Position Summary:</strong>\n<br><br>\nThis position provides the customer with a dedicated resource to assist with meeting established business objectives. As an extension of the customer’s staff, the dedicated resource will be responsible for identifying and meeting their assigned customer’s needs though providing service and support on the applicable equipment and products that aligns with Carousel’s high standards of customer support and focus.\n<br><br>\n<strong>Essential Duties and Responsibilities:</strong>\n<ul>\n<li>Maintain voice network by monitoring and ensuring compliance to organizational standards</li><li>Identify voice system gaps and plan/implement solutions</li><li>Responsible for communicating to development team when changes are being made</li><li>Perform diagnostics and follow comprehensive troubleshooting steps to determine the cause of any failure in the voice infrastructure.</li> <li>Perform system upgrades including firmware, software, and hardware as required.</li> <li>Complete system and programming changes as required.</li><li>Ensure accurate and timely entry of work log information detailing performed in support of a customer request. including troubleshooting steps and final resolution into applicable ticket management system.</li> <li>Able to work with other technical experts towards problem resolution.</li><li>May be required to travel to additional customer locations.</li> <li>Perform other duties as assigned to meet customer expectations and business objectives.</li> <li>Comply with all Carousel policies, processes, and procedures.</li><li>Comply with all additional policies, processes, and procedures outlined by the customer.</li>\n</ul>\nExperience with and the ability to provide break/fix support, complete moves, adds, and changes, and provide administrative support for:\n<ul>\n<li><div>Avaya CM 6.0 or higher</div></li><li>SIP Session Manager</li><li>Avaya Aura experience</li><li>Basic Cisco Route and Switch</li>\n</ul>\n<strong>Qualifications:</strong>\n<ul>\n<li>Bachelor's or Master's degree with 8 years of experience in a networking role</li><li>Excellent written and verbal communication skills.</li><li>Expert working level with voice systems, contact center applications and SIP trunking</li><li>Excellent organizational and time management skills.</li><li>Strong troubleshooting, problem solving, and analytical skills.</li><li>Ability to work independently as well in a team environment.</li><li>Must be able to learn new things quickly, need minimal direction, and handle multiple tasks simultaneously.</li>\n</ul>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}