{"job title": "Software Engineer 2", "company": "CyberCore Technologies", "city state": "– Annapolis Junction, MD", "rating": "3.8", "job description": "<div><div><strong><u>ALL CANDIDATES MUST HAVE AN ACTIVE TS/SCI WITH A POLYGRAPH CLEARANCE!</u></strong>\n<br><br>\n<strong><u>Description:</u></strong>\n\n<ul>\n<li>The Software Engineer develops, maintains, and enhances complex and diverse software systems (e.g., processing-intensive analytics, novel algorithm development, manipulation of extremely large data sets, real-time systems, and business management information systems) based upon documented requirements.</li> \n\n<li>Works individually or as part of a team.</li> \n\n<li>Reviews and tests software components for adherence to the design requirements and documents test results.</li> \n\n<li>Resolves software problem reports.</li> \n\n<li>Utilizes software development and software design methodologies appropriate to the development environment.</li> \n\n<li>Provides specific input to the software components of system design to include hardware/software trade-offs, software reuse, use of Commercial-Off-the-Shelf (COTS)/Government-Off-the-Shelf (GOTS) in place of new development, and requirements analysis and synthesis from system level to individual software components.</li>\n</ul>\n<strong><u>Required Skills:</u></strong>\n\n<ul>\n<li>Python-scripting for file parsing, basic network communications (reach out to a website or REST endpoint and grab some data), data manipulation.</li>\n\n<li>NiFi-configuration, data flow creation, maintenance, troubleshooting</li>\n\n<li>Splunk-configuration, maintenance, troubleshooting, searching with SPL.</li>\n\n<strong><li>Desired:</li>\n\n</strong>\n\n<li>Linux-system administration experience certainly helps with day-to-day tasks, but a willingness to learn helpful</li>\n\n<li>Regex-this would be a great contribution to the team.</li>\n\n<li>Git basic usage would also be useful.</li>\n\n<li>Most tasks are dataflow-related. Usually done using Python, NiFi, or both. Lots of communication with external parties, often learning their API(s) or working with them to set up some sort of method to get the data to us as well as massaging the data once we get it to format it.</li>\n\n<li>For this position: a SW person looking to do enterprise-level development. Someone who can, and is willing to swap hats often (coder one minute, system admin the next, Splunk admin/architect).</li>\n\n<li>This position is not your typical Software Engineer role.</li>\n</ul>\n<strong><u>Qualifications:</u></strong>\n\n<ul>\n<li>Fourteen (14) years system engineering experience in programs and contracts of similar scope, type and complexity</li>\n</ul>\n\n</div>\n</div><div></div>"}