{"job title": "Automation Engineer – Fishers (ongoing)", "company": "Flexware Innovation", "city state": "– Fishers, IN", "rating": "4.9", "job description": "General Function<br><br>We are always looking for talented engineers of all levels. As an Automation Engineer will analyze user requirements and the design of process and/or mechanical equipment to design automation systems that will cause the equipment to function in the desired manner. They analyze user requirements, procedures, and problems to identify the system components and develop the design and functional specifications for the automation systems. They are responsible for the interface between the hardware and software development for the automation system.\n<br><br>\n**Please note that we are not currently accepting applications from candidates that would require sponsorship now or in the future.<br><br>Principle Responsibilities\n\n\n<ul>\n<li>Provide support to client’s functions during the manufacturing process to bring designs to completion.</li>\n<li>Participate and perform action items as a team member or work autonomously on assigned projects while interacting with Flexware clients.</li>\n<li>Establish standards, templates, and guidelines as applied to the automation system using the information gathered in the requirements stage</li>\n<li>Responsible for automation and controls systems design, specifications, programming, simulation, testing, as well as start-up assistance</li>\n<li>Participate in design reviews with customers to resolve technical issues.</li>\n<li>Select the physical communications media, network architecture, and protocols based on data requirements in order to complete system design and support systems development</li>\n<li>Define the data structure layout and data flow model considering the volume and type of data involved in order to provide specifications for hardware selection and software development</li>\n<li>Develop a functional description of the automation solution (e.g. control scheme, alarms, HMI, reports) using rules established in the definition stage in order to guide development and programming</li>\n<li>Design and install wiring to reliably communicate information between measurement and control element devices and control equipment</li>\n<li>Calibrate, troubleshoot, test, repair, and improve sensing, measurements, and actuation devices</li>\n<li>Develop Human Machine Interface (HMI) in accordance with the design documents in order to meet the functional requirements</li>\n<li>Assemble all required documentation and user manuals created during the development process in order to transfer essential knowledge to customers and end users</li>\n<li>Provide detailed documentation</li>\n<li>Perform safety and/or hazard analyses, security analyses, and regulatory compliance assessments by identifying key issues and risks in order to comply with applicable standards, policies, and regulations</li>\n<li>Travel requirements is no more than 20-30% when needed</li>\n<li>Perform other duties as necessary</li>\n</ul>\n\nKnowledge and Experience\n\n\n<ul>\n<li>B.S. in Electrical Engineering, Electrical Engineering Technology, Computer Science, Software Engineering, or related technical field</li>\n<li>4+ years of experience working in a manufacturing environment in controls/automation and system integration</li>\n<li>Ability to work both in a team environment and autonomously with exceptional interpersonal skills</li>\n<li>Experience in programming one or more of the following PLC platforms: Allen Bradley, Rockwell, Siemens, etc.</li>\n<li>Hands on experience programming HMI, SCADA, and MES applications such as Wonderware, RSFactoryTalk, Ignition, Parsec, Apriso, Camstar, etc.</li>\n<li>Experience with information technology infrastructure components as they relate to industrial automation systems</li>\n</ul>\n\nScope of Interaction<br><br>As an Automation Engineer you will interact in multiple environments with customers and other members of Flexware. You will be assisting other resources to provide solutions to customers. This resource must have excellent analysis and design skills, and must have the desire and ability to learn new technologies and tools quickly.<br><br>Problem Solving Environment<br><br>It is critical that as an Automation Engineer you possess a strong understanding of the manufacturing process along with automation and system integration. This individual must be able to manage projects and work with customers to provide solutions to their challenges and needs.<br><br>Additional Duties and Responsibilities<br><br>This job description does not state or imply that the above duties and responsibilities are the only ones assigned to this position. The employee holding this position may be requested to perform additional duties.<br><br>About Flexware Innovation<br><br>Flexware Innovation is a leading technology integrator who helps forward thinkers in manufacturing and related industries build comprehensive and long-lasting solutions with ease. Founded in 1996, Flexware continues to help companies leverage technology to solve real business problems with teams of engineers focused on software development, automation engineering, manufacturing systems integration, business intelligence, and Internet of Things (IoT) devices. Our passion is helping our customers avoid costly architectural mistakes and design, architect, and build solutions that stand the test of time.\n<br><br>\nStaffed with well-rounded technical and business experts, our firm has a history of success with helping clients improve productivity, minimize downtime, reduce costs, and accomplish business goals. Flexware offers competitive salary and benefits packages, as well as performance-based bonuses. Our environment is fun, family-friendly, energetic and was nominated for TechPoint’s Mira Award for “Company Culture of the Year” in 2017.\n<br><br>\nOur core purpose is to have a positive and lasting impact on our families, clients, and community through a healthy work environment and innovative problem solving. We follow this core purpose by living out our Four Core Values on an everyday basis.\n<br><br>\nYour opportunity starts with a conversation. If this sounds like a role you would like more information on, please apply on this posting or send your qualifications to Matt Heiden at matt.heiden@flexwareinnovation.com. All inquiries will be treated confidentially and your resume will never be sent anywhere without your consent and awareness. We look forward to talking to you!"}