{"job title": "Systems Engineer", "company": "Flexware Innovation", "city state": "– Fishers, IN", "rating": "4.9", "job description": "General Function<br><br>We are always looking for talented engineers of all levels. The Systems Engineer will be responsible for deploying and supporting client projects on Flexware’s Integration Team. You will be responsible for working with a multitude of technologies such as PLC controls and automation, OPC’s, HMI and SCADA development, custom software development, integrating databases, working with data historians and OEE’s, and validating system requirements, among other things. As a Systems Engineer, you will be responsible for engaging with the customer, guiding and leading them through solutions, and ultimately delivering successful projects. Preference will be given to candidates that match the majority of skills listed below.\n<br><br>\n**Please note that we are not currently accepting applications from candidates that would require sponsorship now or in the future.<br><br>Principle Responsibilities\n\n\n<ul>\n<li>Design and development of multiple technologies such as but not limited to\n\n\n<ul>\n<li>HMI and SCADA Platforms, specifically Rockwell Platforms</li>\n<li>Data Historians such as Rockwell FactoryTalk Historian or OSI PI</li>\n<li>Databases using SQL Server or Oracle</li>\n<li>Operational Reporting using SQL Server Reporting Services (SSRS) or similar tools</li>\n<li>Custom application development using C#/.NET or similar programming languages</li>\n</ul>\n\n</li>\n<li>Develop and configure interfaces with third-party software tools/utilities such as OPC Servers</li>\n<li>Validate, test, and document systems according to clients specifications</li>\n<li>Provide detailed documentation in accordance with specific regulations</li>\n<li>Design technical solutions and lead implementation projects utilizing Flexware resources as well as client resources when necessary.</li>\n<li>Support, maintain and enhance deployed solutions in multiple environments</li>\n<li>Work with customers to define solution requirement and project success metrics</li>\n<li>Develop and implement long-term support plans for solutions</li>\n<li>Participate and perform action items as a team member or lead projects involving other engineers and cross-functional team members.</li>\n<li>Must be adaptable to new production trends and have an aptitude for technology and a desire to learn new trends and technologies</li>\n<li>Travel requirements is no more than 10-20% when needed</li>\n<li>Perform other duties as necessary</li>\n</ul>\n\nKnowledge and Experience\n\n\n<ul>\n<li>Bachelor’s degree in Computer Science (CS), Computer Engineering (CE), Electrical Engineering Technology (EET), Electrical Engineering (EE) or similar technical degree</li>\n<li>3+ years of experience in Manufacturing Integration space with a preference to candidates in a consulting role</li>\n<li>Experience with high-level programming with C#.NET or similar programming languages</li>\n<li>Experience with Rockwell products is highly preferred</li>\n<li>Experience working in a pharmaceutical or similar high regulated environment</li>\n<li>Experience working with HMI/SCADA/OEE solutions such as Rockwell, Ignition, Wonderware, or TrakSYS,</li>\n<li>Experience working with SQL or Oracle Databases including writing medium to complex queries, stored procedures, functions, and triggers.</li>\n<li>Experience with design and development of Operational reports using SQL Server Reporting Services (SSRS)</li>\n<li>Extensive experience working with OPC Servers and tag data</li>\n<li>Ability to understand PLC and PLC logic and programming with preference toward the Rockwell Platform</li>\n<li>Hardware integration experience with barcode scanners, scales, printers, etc. is a plus</li>\n<li>Must be able to interact with customers and vendors and resolve comments and requested changes</li>\n<li>Strong organizational and time management skills</li>\n<li>Must demonstrate high commitment to quality and ability to manage multiple tasks and work independently</li>\n<li>Ability to mentor and lead teams with outstanding communication skills</li>\n</ul>\n\nScope of Interaction<br><br>As a Flexware Systems Engineer you will interact in multiple environments with customers and fellow Engineers. You will be assisting other resources to provide solutions to customers within highly regulated industries. This resource must have excellent documentation, analysis and design skills, and must have the desire and ability to learn new technologies and tools quickly.<br><br>Problem Solving Environment<br><br>It is critical that the Systems Engineer possess a strong understanding of the full lifecycle of a project. This individual must be able to manage projects and provide guidance during the establishment of business requirements, whiteboarding sessions, workshops, providing scope of projects, and high-level design of a solution.<br><br>Additional Duties and Responsibilities<br><br>This job description does not state or imply that the above duties and responsibilities are the only ones assigned to this position. The employee holding this position may be requested to perform additional duties.<br><br>About Flexware Innovation<br><br>Flexware Innovation is a leading technology integrator who helps forward thinkers in manufacturing and related industries build comprehensive and long-lasting solutions with ease. Founded in 1996, Flexware continues to help companies leverage technology to solve real business problems with teams of engineers focused on software development, automation engineering, manufacturing systems integration, business intelligence, and Internet of Things (IoT) devices. Our passion is helping our customers avoid costly architectural mistakes and design, architect, and build solutions that stand the test of time.\n<br><br>\nStaffed with well-rounded technical and business experts, our firm has a history of success with helping clients improve productivity, minimize downtime, reduce costs, and accomplish business goals. Flexware offers competitive salary and benefits packages, as well as performance-based bonuses. Our environment is fun, family-friendly, energetic and was nominated for TechPoint’s Mira Award for “Company Culture of the Year” in 2017.\n<br><br>\nOur core purpose is to have a positive and lasting impact on our families, clients, and community through a healthy work environment and innovative problem solving. We follow this core purpose by living out our Four Core Values on an everyday basis.\n<br><br>\nYour opportunity starts with a conversation. If this sounds like a role you would like more information on, please apply on this posting or send your qualifications to Matt Heiden or Tiffany Black at resumes@flexwareinnovation.com. All inquiries will be treated confidentially and your resume will never be sent anywhere without your consent and awareness. We look forward to talking to you!"}