{"job title": "Software Engineer (Ongoing)", "company": "Flexware Innovation", "city state": "– Valparaiso, IN", "rating": "4.9", "job description": "General Function<br><br>We are always looking for talented engineers of all levels. If you feel you have FlexDog DNA and are interested in a position, please feel free to apply! The Software Engineer is responsible for all aspects of software solution development and delivery as directed by the Software Development Team Leader. Specifically, this role requires designing and developing data-centric Microsoft Windows-based solutions, web-based solutions, mobile applications, and solutions that integrate with real-world devices such as Programmable Logic Controllers (PLCs), barcode scanners, weigh scales, and industrial printers. Solution types range from single-user desktop applications, to internationally-deployed enterprise-wide solutions, to mission-critical execution and data collection systems. This position will be located at Flexware’s Valparaiso office.\n<br><br>\n**Please note that we are not currently accepting applications from candidates that would require sponsorship now or in the future.<br><br>Principle Responsibilities\n\n\n<ul>\n<li>Define project objectives and ensure they are met</li>\n<li>Work directly with the customer to analyze, derive, and document solution requirements</li>\n<li>Work directly with solution architects to design appropriate software deliverables</li>\n<li>Develop desktop, web-based, and mission-critical applications and system features utilizing primarily Microsoft stack of technology such as C#, .NET, SQL</li>\n<li>Develop solutions that fully utilize Microsoft SQL Server for data storage</li>\n<li>Develop reporting applications using Microsoft SQL Server Reporting Services (SSRS)</li>\n<li>Develop and configure interfaces with third-party software tools and utilities such as OPC servers</li>\n<li>Develop and configure interfaces with external software systems such as MRP, ERP, and WMS</li>\n<li>Unit test software solution components</li>\n<li>Participate in system and integration testing</li>\n<li>Configure and deploy software applications and systems</li>\n<li>Train end users on job-specific usage of deployed software solutions, and train system owners on proper maintenance and support of software solutions</li>\n<li>Travel requirements is no more than 10-20% when needed</li>\n<li>Support, maintain, and enhance deployed software solutions</li>\n</ul>\n\nKnowledge and Experience\n\n\n<ul>\n<li>B.S. in Computer Science or related field</li>\n<li>3+ years of experience with the full lifecycle of delivering software solutions</li>\n<li>Proficient in Microsoft stack of technologies, specifically .NET development, primarily using C#</li>\n<li>Experience using JavaScript-based frameworks, such as AngularJS, Backbone.js, Ember.js, Knockout.js, React, Vue.js, etc a plus</li>\n<li>Familiar with rapid application development (RAD), agile, or similar methodology</li>\n<li>Experience in all aspects of relational database design, development, and support using Microsoft SQL Server 2005 or newer</li>\n<li>Experience in the development of Microsoft SQL Server Reporting Services (SSRS) solutions</li>\n<li>Experience with performance analysis and tuning, and diagnosis and troubleshooting of software systems</li>\n<li>Effective communication skills, and the ability to interact professionally with a diverse group of customers and staff</li>\n<li>Cloud-based (specifically Microsoft Azure) design, and development a plus</li>\n<li>Mobile development (e.g., iOS, Android, Xamarin) a plus</li>\n<li>Microsoft certifications for related technologies is a plus</li>\n<li>Experience in a manufacturing environment a plus</li>\n</ul>\n\nScope of Interaction<br><br>The Software Engineer will interact, both individually and as part of various project teams, directly with customers and with fellow engineers during the life of a project to ensure business and technical expectations are met. Interaction with team leaders to scope and estimate proposed software solutions will also be required.<br><br>Problem Solving Environment<br><br>It is critical that the Software Engineer possess a strong understanding of the full life cycle of a project. This individual must be able to manage projects and provide architectural guidance during establishment of business requirements, white boarding sessions, workshops, providing scope of projects, and high-level design of a solution.<br><br>Additional Duties and Responsibilities<br><br>This job description does not state or imply that the above duties and responsibilities are the only ones assigned to this position. The employee holding this position may be requested to perform additional duties.<br><br>About Flexware Innovation<br><br>Flexware Innovation is a leading technology integrator who helps forward thinkers in manufacturing and related industries build comprehensive and long-lasting solutions with ease. Founded in 1996, Flexware continues to help companies leverage technology to solve real business problems with teams of engineers focused on software development, automation engineering, manufacturing systems integration, business intelligence, and Internet of Things (IoT) devices. Our passion is helping our customers avoid costly architectural mistakes and design, architect, and build solutions that stand the test of time.\n<br><br>\nOur core purpose is to have a positive and lasting impact on our families, clients, and community through a healthy work environment and innovative problem solving.\n<br><br>\nStaffed with well-rounded technical and business experts, our firm has a history of success with helping clients improve productivity, minimize downtime, reduce costs, and accomplish business goals. Flexware offers competitive salary and benefits packages, as well as performance-based bonuses. Our environment is fun, family-friendly, and energetic.\n<br><br>\nFlexware and Ipact recently united teams and now have two offices under the Flexware brand in Fishers, IN and Valparaiso, IN.\n<br><br>\nYour opportunity starts with a conversation. If this sounds like a role you would like more information on, please apply on this posting or send your qualifications to Matt Heiden at matt.heiden@flexwareinnovation.com. All inquiries will be treated confidentially, and your resume will never be sent anywhere without your consent and awareness. We look forward to talking to you!"}