{"job title": "DevOps Engineer (MVM-LD)", "company": "General Dynamics Mission Systems, Inc", "city state": "– USA--MD-Ft Meade", "rating": "3.6", "job description": "<div><div>\n<div>\n<p><strong>Required Skills:</strong></p><ul><li><div>Creating and deploying NiFi processors </div></li><li>Creating and deploying MongoDB (JSON) storage </li><li>Familiarity with Docker containers suitable for a Kubernetes deployment </li><li>Experience working in a DevOps role</li><li>Experience working with MongoDB </li><li>Experience with Atlassian Suite of Tools, to include Jira and Confluence </li><li>Oral and written communication skills, teaming, and time management </li></ul><div><p> </p></div><p><strong>Education Requirements:</strong></p><p>Bachelor's degree in systems engineering, a related specialized area or field is required (or equivalent experience) plus a minimum of 5 years of relevant experience; or Master's degree plus a minimum of 3 years of relevant experience. Agile experience preferred.</p><p><br><strong>Clearance Requirements:</strong><br>Department of Defense TS/SCI with Polygraph security clearance is required at time of hire. Applicants selected will be subject to a U.S. Government security investigation and must meet eligibility requirements for access to classified information. Due to the nature of work performed within our facilities, U.S. citizenship is required.</p><p> </p><p> </p>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\nResponsibilities for this Position\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<p>General Dynamics Mission Systems has an immediate opening for a DevOps Engineer. This position provides an opportunity to further advance the cutting-edge technology that supports some of our nation’s core defense/intelligence services and systems. General Dynamics Mission Systems employees work closely with esteemed customers to develop solutions that allow them to carry out high-stakes national security missions.</p><p> </p><p><strong>Representative Duties and Tasks:</strong></p><p>The <strong>DevOps Engineer</strong> will join an existing agile team of engineers in support of a large scale distributed data collection, storage, and query “system of systems”:</p><p>The successful candidate will have experience</p><ul><li>Creating and deploying NiFi processors</li><li>Creating and deploying MongoDB (JSON) storage</li><li>Familiarity with Docker containers suitable for a Kubernetes deployment</li></ul><p>The candidate must be accustomed to looking for opportunities to automate routine processes; identify, initiate and monitor metrics; and proactively support the team’s efforts to redirect the development culture in the DevOps direction. <br><br><strong>Preferred Knowledge Skills and Abilities:</strong></p><ul><li>Familiarization with Java</li><li>Familiarization with Scala </li></ul><p> </p><p> </p><p>#CJ3</p><p> </p><p>#CB</p>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\nCompany Overview\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<p>General Dynamics Mission Systems (GDMS) engineers a diverse portfolio of high technology solutions, products and services that enable customers to successfully execute missions across all domains of operation. With a global team of 13,000+ top professionals, we partner with the best in industry to expand the bounds of innovation in the defense and scientific arenas. Given the nature of our work and who we are, we value trust, honesty, alignment and transparency. We offer highly competitive benefits and pride ourselves in being a great place to work with a shared sense of purpose. You will also enjoy a flexible work environment where contributions are recognized and rewarded. If who we are and what we do resonates with you, we invite you to join our high performance team!</p><p> </p><p>General Dynamics is an Equal Opportunity/Affirmative Action Employer that is committed to hiring a diverse and talented workforce. EOE/Disability/Veteran</p>\n\n</div>\n</div>\n</div>"}