{"job title": "Senior Photonics/Telecommunications Engineer", "company": "General Dynamics Mission Systems", "city state": "– Hanover, MD", "rating": "3.6", "job description": "<div><div>\n<div>\n<p>Bachelor’s degree in Electrical Engineering, a related specialized area or field is required (or equivalent experience) plus a minimum of 10 years of relevant experience; or Master's degree plus a minimum of 8 years of relevant experience.</p><p> </p><p>Requirements include:</p><ul><li>Familiarity with high-speed transport, including SONET/SDH, GFP, and OTN, at rates up to 10 Gbps and higher (100G)</li><li>Direct experience with commercial multiplexing, routing, and switching hardware and routing protocols</li><li>Familiarity with performance monitoring metrics </li><li>Familiarity with DWDM transport systems (metro, unrepeatered, or long-haul), and design and impairment analysis of such systems</li><li>Familiarity with coherent systems</li><li>Candidate should have experience in developing requirements and specifications, demonstrated leadership in an integrated team environment and excellent verbal and writing skills</li></ul><p><strong>PREFERRED DEGREE TYPES AND EXPERIENCE:</strong></p><ul><li><div>BS in Optical Engineering, Optical Sciences and Engineering, Physics, or Electrical Engineering from an accredited major university and ten years of relevant design experience</div></li><li>MS in Optical Engineering, Optical Sciences and Engineering, Physics, or Electrical Engineering from an accredited major university and eight years of relevant design experience</li></ul><div><p> </p></div><p><strong>CLEARANCE REQUIREMENTS:</strong></p><p>A current TS/SCI with Polygraph is required at time of hire. Applicants selected will be subject to a U.S. Government security investigation and must meet eligibility requirements for access to classified information. Due to the nature of work performed within our facilities, U.S. citizenship is required.</p><p> </p><p> </p><p> </p>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\nResponsibilities for this Position\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<p>General Dynamics Mission Systems has an immediate opening for a Senior Photonics/Telecommunications Engineer. This position provides an opportunity to further advance the cutting-edge technology that supports some of our nation’s core defense/intelligence services and systems. General Dynamics Mission Systems employees work closely with esteemed customers to develop solutions that allow them to carry out high-stakes national security missions.</p><p> </p><p>The Senior Photonics/Telecommunications Engineer will work with collaborative teams to design, develop and manage a variety of equipment and systems solutions for General Dynamics Mission Systems and its clients. In addition to receiving a competitive salary and generous health and personal benefits, this person will enhance their skill set by working among a talented and technically accomplished group of colleagues. The employee will also enjoy a flexible work environment where contributions are recognized and rewarded. </p><p> </p><p><strong>Key Responsibilities</strong></p><p>The Senior Photonics/Telecommunications Engineer will design, develop, build and test systems and products based on optic, photonic and laser technologies. Additionally this person will interact with device, hardware and software design teams to assist in overall development of optical systems which includes: specifying, selecting and qualifying active and passive optical components, developing and benchmarking system performance models, developing and implementing test procedures and/or evaluating and selecting appropriate test instrumentation. The candidate will recommend technological modifications to the development of new photonic products and/or design changes that improve performance of existing products. </p><p> </p><p><strong>Additional Responsibilities</strong></p><p>The Senior Photonics/Telecommunications Engineer will exercise creative thinking and ideation to advance our business performance. The candidate will deliver innovative, flexible, integrated solutions to meet the customer's changing business needs. This person will also support and engage in programs, projects and practices behind the General Dynamics Mission Systems' culture and strategy, and comply with all policies and procedures. </p><p> </p><p> </p><p> </p><p><strong>REPRESENTATIVE DUTIES AND TASKS:</strong></p><ul><li>Designs, develops, builds and tests systems and products based on optic, photonic and laser technologies </li><li>Interacts with device, hardware and software design teams to assist in overall development of optical systems; specifying, selecting and qualifying active and passive optical components, developing and benchmarking system performance models, developing and implementing test procedures and/or evaluating and selecting appropriate test instrumentation</li><li>May provide recommendations for cost reduction efforts</li><li>Participates in electrical and optical requirements analysis, requirements definition, requirements management, functional analysis, performance analysis (e.g. optical loss, timing, power, etc.), design, integration, and verification of electrical components, equipment and systems </li><li>Applies principles and techniques of Electrical and Optical Engineering</li><li>Performs root cause analysis for electrical and optical issues, conducts experimental tests, evaluates results to formulate and implement solutions to issues</li><li>Participates in design reviews of electrical and optical components, equipment and systems</li><li>Evaluates vendor capability to support product development</li><li>Applies a good understanding of the organizationally defined optical processes used throughout the lifecycle of the program or project</li><li>Supports the generation of engineering products by using the appropriate standards, processes, procedures, and tools throughout the electrical development life cycle</li><li>Contributes to the research and analysis of data, such as customer design proposal specifications, and manuals to determine feasibility of design or application</li><li>Selects components and equipment based on analysis of specifications and reliability </li><li>Plans sub tasks for activities described above</li><li>Generally works with interdisciplinary teams and multiple work groups</li><li>Generally has contact with project leaders and Program Managers</li><li>Leads small technical proposals and contributes on medium proposals</li><li>Exercises considerable latitude in determining technical objectives of assignments</li><li>Works on advanced applications that may result in new business for the company</li><li>Frequent contact with project leaders, program managers, and senior managers including customers</li><li>Serves as consultant to management and customers on projects and applications</li><li>May serve as company technical spokesperson</li><li>Works on unusually complex problems and provides creative and innovative solutions</li><li>May function in a project leadership role </li></ul><p><br><strong>KNOWLEDGE SKILLS AND ABILITIES:</strong></p><ul><li>Strong use and understanding of optical and electrical engineering concepts, principles, and theories</li><li>Strong knowledge with telecommunication applications</li><li>Frequently contributes to the development of new theories and methods</li><li>Strong understanding of optical engineering processes</li><li>Keeps abreast of technology trends</li><li>Aware of business objective and Engineering role in achieving</li><li>Strong knowledge of Microsoft Office applications</li><li>Strong written and verbal communications skills</li><li>Ability to think creatively</li><li>Ability to multi-task</li><li>Highly skilled in communicating issues, impacts, and corrective actions</li><li>Strong ability to recognize and clearly report information relevant to sound electro-optical engineering design</li><li>Strong ability to understand and apply project leadership principles including SPI/CPI, Earned Value, Cost Account Management (CAM), and Statistical Process Controls</li><li>Strong ability to work well in a team environment</li></ul><p><br><br></p><p> </p><p> </p><p>#CJ3</p>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\nCompany Overview\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<p>General Dynamics Mission Systems (GDMS) engineers a diverse portfolio of high technology solutions, products and services that enable customers to successfully execute missions across all domains of operation. With a global team of 13,000+ top professionals, we partner with the best in industry to expand the bounds of innovation in the defense and scientific arenas. Given the nature of our work and who we are, we value trust, honesty, alignment and transparency. We offer highly competitive benefits and pride ourselves in being a great place to work with a shared sense of purpose. You will also enjoy a flexible work environment where contributions are recognized and rewarded. If who we are and what we do resonates with you, we invite you to join our high performance team!</p><p> </p><p>General Dynamics is an Equal Opportunity/Affirmative Action Employer that is committed to hiring a diverse and talented workforce. EOE/Disability/Veteran</p>\n\n</div>\n</div>\n</div><b><br></b>"}