{"job title": "Utilities Engineer", "company": "Intarcia Therapeutics, Inc.", "city state": "– Hayward, CA", "rating": "2.9", "job description": "<strong>Intarcia Therapeutics, Inc., is a rapidly emerging biopharmaceutical company committed to developing innovative therapies that merge medicine with technology.</strong>\n<br><br>\nAt Intarcia, we seek to transform the standard of care and improve patient outcomes in major therapeutic categories for serious chronic diseases, such as diabetes. We successfully completed our Phase 3 clinical trial program for our lead product, ITCA 650, and submitted our New Drug Application filing in the U.S. in 2016.\n<br><br>\nAdditionally, we are developing a pipeline of products for our proprietary Medici Drug Delivery System, comprised of three unique technologies: 1) A stabilization technology that allows for proteins, peptides, antibody fragments, and other highly potent small molecules to be stabilized at or above human body temperatures for up to three years or more; 2) A matchstick-sized osmotic mini-pump that is placed just under the dermal layer of skin to deliver a continuous and consistent flow of medication; and 3) A placement technology including proprietary tools designed to provide an optimal user experience.\n<br><br>\n<strong>We Are Growing</strong>\n<br><br>\nSince our 2012 round of financing, much progress has taken place at Intarcia, including significant enhancements to our world-class manufacturing facility, the opening of our new headquarters in Bostons Innovation Center, and the diversification of expertise on our Board of Directors and Leadership Team through new senior leaders who contribute vital new capabilities and experiences.\n<br><br>\nA key element of pride during our progress has been our ability to remain fully independent throughout our rounds of financing so that we continue to have full strategic and executional control over all aspects of our rapidly evolving business. While we are always accountable to our stakeholders, we are and intend to remain the driving vision and force behind our progress and our ultimate success.\n<br><br>\n<strong>Your Opportunity</strong>\n<br><br>\nIntarcia Therapeutics is seeking a Utilities Engineer to provide technical, compliance, and performance oversight of the utility systems serving the manufacturing environment. These systems including HVAC, building automation system (BAS), clean dry air (CDA), chilled water, cooling water, heating hot water, nitrogen, power distribution, RODI water, steam, clean steam, Water for Injection (WFI), and wastewater and exhaust treatment systems.\n<br><br>\nThe role reports to the Associate Director of Facilities Engineering and Maintenance, and will represent critical utility systems to auditors, partners and project teams, working closely with other technical functions, consultants, and contractors as required.\n<br><br>\nThe Utilities Engineer will ensure utilities are maintained compliant with the latest regulations and meet safety, quality, productivity, operability, reliability, and cost drivers. The Engineer will raise our overall performance through technical improvements, ensuring our validation and environmental permit status is always maintained.\n<br><br>\n<strong>Duties and Responsibilities:</strong>\n\n<ul>\n<li>Acts as technical expert to train and coach facility technicians on preventive and corrective maintenance methods and procedures.</li>\n<li>Accountable for technical systems documentation (P&amp;IDs, URS, FS, FAT/SAT, Commissioning, IOQs, SOPs, data sheets, material and equipment specifications, etc.)</li>\n<li>Ensures the utilities PM program is properly documented, executed, and the appropriate CMMS data, including spares and task lists, is available.</li>\n<li>Leads utilities technical investigations, CAPAs, and change controls, supporting the EHS and QA teams collaboratively to ensure compliance with all government regulations, site standards, and programs.</li>\n<li>Collaborates with project teams throughout capital project lifecycles to ensure utilities engineering scope is challenged, sustainable, reliable, and designed for maintainability.</li>\n<li>May perform hands-on activities in operations, ranging from equipment/systems setup, inspection, and support to maintenance.</li>\n</ul>\n<strong>Qualifications:</strong>\n\n<ul>\n<li>A Bachelor's degree in Engineering or equivalent</li>\n<li>6-8years of pharmaceutical manufacturing experience in a technical function</li>\n<li>Fluency with cGMP manufacturing and regulatory regulations and requirements for pharmaceuticals and devices</li>\n<li>GMP utility systems qualification experience in a cGMP environment (IQ, OQ, PQ) is required</li> \n</ul>\n<strong>Skills:</strong>\n\n<ul>\n<li>Demonstrated knowledge of critical utility systems, with experience maintaining and improving systems for uptime and reliability.</li>\n<li>Demonstrated ability to think critically and analytically; demonstrated troubleshooting and problem solving skills.</li>\n<li>Good interpersonal, follow up, and excellent verbal and written communication skills.</li>\n<li>Ability to function efficiently and independently in a fast-paced, changing environment.</li>\n<li>Strong team player aligned with Intarcia Corporate Values.</li>\n</ul>"}