{"job title": "Applications Security Engineer", "company": "Jack Henry", "city state": "– Lenexa, KS", "rating": "3.5", "job description": "<strong>Job Description</strong>\n<br><br>\nJack Henry &amp; Associates, Inc. a leading provider of technology solutions and payment processing services primarily for the financial services industry is seeking a Applications Security Engineer position for our growing team!\n<br><br>\nWe are looking for an individual that is ready for a new challenge in a fast-paced environment. This position will work with a team of 6 team members and reports to the Application Security Manager. The Applications Security Engineer will interact with a diverse set of technology groups including product development, infrastructure and governance teams to implement and develop authentication solutions including federated access, single sign on, and multi-factor authentication. The ideal candidate will enjoy collaborating on a team of professionals and be adept at articulating technical concepts to individuals without a technical background.\n<br><br>\nJack Henry &amp; Associates offers work/life balance, competitive benefits and career advancement! This position can be located in Springfield, MO, Monett, MO, Lenexa KS or Allen, TX.\n<br><br>\n<strong>MINIMUM QUALIFICATIONS</strong>\n<ul>\n<li>Minimum of 18 months with Active Directory or ADFS experience.</li>\n</ul>\n<strong>PREFERRED QUALIFICATIONS</strong>\n<ul>\n<li>Developing professional expertise. Works on non-complex to moderately complex projects. Exercises judgement within defined procedures and practices.</li><li>Excellent understanding of ethics in business and information security.</li><li>Practical understanding of SAML, OAuth and Kerberos.</li><li>Proficient English language written and oral communication skills.</li><li>Knowledge of OWASP tools and methodologies, HTTP and web programming.</li><li>Able to prioritize and organize a diversified workload.</li><li>Able to learn diverse network and information securities technologies and principles.</li><li>Able to communicate well across all levels of the organization.</li><li>Security certifications (e.g., CISSP, CEH).</li><li>Bachelor’s Degree.</li>\n</ul>\n<strong>ESSENTIAL FUNCTIONS</strong>\n<ul>\n<li>Manages enterprise ADFS environment.</li><li>Works with development and product teams to incorporate MFA, SSO and Federated Access into products.</li><li>Assesses products and applications for authentication best practices.</li><li>Acts as an escalation point for complex internal and customer facing application authentication and support functions.</li><li>Manages high level projects that drive current security initiatives and support the security solutions.</li><li>Follows up on authentication security findings with various development teams from application security-related reviews and other third-party reviews.</li><li>Develops the security of applications and establishes security systems, policies and procedures to prevent system compromise or infiltration.</li><li>Assesses the impact on the business caused by theft, destruction, alteration, or denial of access to information.</li><li>Develops policies &amp; procedures to ensure the security of relevant solutions.</li><li>Investigates, recommends and monitors implementation of new security products and services.</li><li>Acts as a central point of contact for internal and external customers on application security issues.</li><li>Participates in product Change Control Boards and work with other JHA departments to ensure security of products and services.</li><li>Monitors and evaluates internal and external application security threats. Researches application security threats and implement appropriate changes to the Security program to prevent company and customer data assets from being compromised.</li><li>Acts as an escalation point for complex internal and customer facing application security and support functions.</li><li>Manages high level projects that drive current security initiatives and support the security solutions.</li><li>Follows up on application security findings with various development teams from application security-related reviews and other third-party reviews.</li><li>Perform application security assessment and penetration testing.</li>\n</ul>\n<strong>Equal Employment Opportunity</strong>\n<br><br>\n<em>Applicants for U.S. based positions with Jack Henry &amp; Associates must be legally authorized to work in the United States. Verification of employment eligibility will be required at the time of hire. Visa sponsorship is not available for this position.</em>\n<br><br>\n<em>Jack Henry &amp; Associates, Inc. is an Equal Employment Opportunity/Affirmative Action Employer and maintains a Drug-Free Workplace.</em>\n<br><br>\n<em>Females, minorities, veterans, and individuals with disabilities are encouraged to apply.</em>\n<br><br>\n<em>#D</em>\n<br><br>\n#G"}