{"job title": "Information Systems Engineer (Data)", "company": "MITRE", "city state": "– &amp;#128269; McLean, Virginia", "rating": "3.2", "job description": "<div><div><div><div><div><div> <p></p>\n\n<div> <strong><u>Job Highlights</u></strong> \n\n<div> In this position you will perform duties associated with the design and development of enterprise-wide information systems. You will work with DoD, Intelligence Agency, and other government staff members to shape the development of their Information Systems. </div>\n<div>\n\n<div> <strong><u>Key Functions</u></strong> </div>\n\n<div> Work as a strong individual contributor, and provide technical subject matter expertise. Stay abreast of emerging trends in information technology and help shape the research agenda for the division. Work with sponsors to understand their requirements and evaluate possible technical solutions. The successful candidate should be familiar with the systems engineering process, and Agile Development. Participation in working groups, design reviews and system tests at contractor and government facilities is required. The successful candidate will help generate assessments and develop and implement actionable recommendations based on reviews. </div></div> </div>\n<p></p>\n<div>\n\n<div> <strong><u></u></strong> </div>\n\n<div> </div></div>\n<p> </p>\n<p> </p> </div>\n \n \n \n\n \n \n \n \n \n <div>\n <strong><u>Required Qualifications</u></strong> \n\n<div> Candidate will have strong capabilities in the following areas:<br>• Software design, development (Java, C++) and scripting (Perl, Python)<br>• Data engineering (managing massive data volume and velocity, information cleansing &amp; refinement, information models &amp; architectures)<br>• Deep working knowledge of specific tools and technologies (e.g., DBMS, ETL)<br>• Design techniques and tradeoff analysis for scalability, availability, extensibility, redundancy, load balancing<br>• Cloud Computing and virtualization<br>• Service Oriented Architecture<br>• Web Services <br>• Information Assurance<br>• Attribute Based Access Control<br>• Information Management<br>• Information Exchange/interface specification<br>• Agile Development and Agile Acquisition<br><br>Must have good analytical, written, presentation, and interpersonal communication skills. Must possess a strong aptitude to work in a research-focused program. </div>\n </div>\n \n \n\n \n <div>\n \n </div>\n \n\n \n </div>\n </div>\n </div>\n\n \n </div>\n\t</div>"}