{"job title": "Assistant Professor at Electrical Engineering", "company": "University of Vermont", "city state": "– Burlington, VT", "rating": "4.1", "job description": "The Department of Electrical &amp; Biomedical Engineering at the University of Vermont (UVM) seeks applications for a tenure-track hire in the area of signal processing with a research focus on hardware and/or software implementation (e.g., cognitive communication and sensing, cyber physical systems, environmental monitoring, medical devices, robotics, internet of things, or artificial intelligence). Candidates are expected to hold a baccalaureate degree in engineering or physics and a doctorate in electrical engineering or related field. Position will be nominally at the Assistant Professor level. The anticipated start date is Fall 2019.\n<br><br>\nSuccessful candidates will develop and maintain an active program of externally-funded research, advise and mentor undergraduate and graduate students, and contribute broadly to undergraduate and graduate teaching in the Electrical Engineering program. The Department values interdisciplinary research and innovative approaches to engineering education. Strong ties exist between UVM’s engineering departments and local industry; and it is expected that the successful candidates will leverage these as an opportunity. The engineering programs at UVM have seen significant recent growth in undergraduate and graduate student enrollments and research funding, and that growth has accelerated with the introduction of new programs such as the biomedical engineering and data science degrees. To support this growth, the University is completing its largest-ever capital project with the construction of the STEM Complex.\n<br><br>\nThe University of Vermont, established in 1791, is a comprehensive research university located in Burlington, Vermont, about 90 miles south of Montreal. Burlington is often rated as the best small city in America for quality of living, and features year-round outdoor recreation and cultural events. Greater Burlington has a population of approximately 200,000 and enjoys a panoramic setting on Lake Champlain, bordered by the Adirondack and Green Mountains.\n<br><br>\nThe University of Vermont is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other category legally protected by federal or state law. The University encourages applications from all individuals who will contribute to the diversity and excellence of the institution.\n<br><br>\nApplicants should provide 1) a cover letter that highlights expertise and teaching experience, 2) a 2-3 page research statement, 3) a 1-page statement describing your teaching philosophy, 4) a statement on how you will further the diversity of the unit, 5) a current CV, and 6) the names and contact information for three references. Applications without each of these components will not be considered. A background check will be conducted on the final candidate. Evaluation of applications will begin December 1, 2018, and will continue until the position is filled. For further information, please email Katarina.Khosravi@uvm.edu. Applications must be submitted through the UVM website www.uvmjobs.com (Search posting #F1126PO)).\n<br><br>\nPosting direct link: http://www.uvmjobs.com/postings/31457"}