{"job title": "Sr Software Engineer", "company": "USANA Health Sciences", "city state": "– Salt Lake City", "rating": "3.4", "job description": "<div><div>USANA Health Sciences is seeking engineers who are passionate about technology and writing quality code. Our engineers work closely together in agile teams to create the best possible solutions for our users. We are looking for engineers who are passionate about both software development and excited about working for a stable and growing company.\n<br><br>\n<strong>Description</strong>\n<br><br>\nA Sr Software Engineer is capable of owning the technical design for projects of moderate complexity and understands the trade-offs required in creating good software. They are capable of effectively troubleshooting and debugging software without issue. They handle complex tasks and can complete them despite roadblocks. They can effectively break large projects down into tasks and sub-tasks that allow them to work effectively within their team. They are champions for team process and maintaining the highest coding standards possible. They should also have an understanding of operation skills such as monitoring, performance optimization, documentation, integration testing and visual design.\n<br><br>\n<strong>Role</strong>\n\n<ul>\n<li>Delivers consistently high-quality code and are aware of industry best practices and trends</li>\n\n<li>Has a depth of knowledge in systems that enable them to effectively and quickly debug moderately complex tasks throughout the codebase</li> \n\n<li>Able to identify and suggest areas of work for themselves and others</li>\n\n<li>Support their ideas with metrics and make data-centric decisions</li>\n\n<li>Proactively identify and clean up technical debt before it turns into a long-term issue</li>\n\n<li>Understands the business and how their code supports it</li>\n\n<li>Work well with QA and can identify the risk associated with software and communicate it to the appropriate parties</li>\n\n<li>Responsible for projects that encompass more than their own development</li>\n\n<li>Provide mentorship to other engineers via code reviews, code pairing and effectively presenting ideas and concepts to other engineers</li>\n\n<li>Participates in the initial creation and continual improvement of the team development process and standards</li>\n</ul>\n<strong>Qualifications/Knowledge, Skills and Abilities Requirements</strong>\n\n<ul>\n<li>~5+ years of experience</li>\n\n<li>Mastery of Java and Spring</li>\n\n<li>Mastery of JavaScript &amp; Angular JS</li>\n\n<li>Mastery of HTML / CSS / JSON</li>\n\n<li>Mastery with SQL / ORM</li>\n</ul>\n<strong>Preferred but not required</strong>\n\n<ul>\n<li>Bachelors in Computer Science or other relational databases</li>\n\n<li>Experience working in Scrum/Agile environments</li>\n\n<li>Polyglot</li>\n\n<li>Understanding of Responsive Design</li>\n</ul>\nWe've been around a while. We've done some amazing things. We've climbed to the top of the nutritional supplement industry, touching millions of lives along the way. Founded in 1992 by Dr. Myron Wentz, USANA Health Sciences is a U.S.-based international company that manufactures high-quality supplements, personal care, and energy products in our FDA-registered facility in Salt Lake City, Utah.\n<br><br>\nUSANA is committed to making the highest quality products without compromise. That's why we use only the purest ingredients, stringent quality control, and a manufacturing process that's second-to-none. After all, at USANA we make more than just nutritionals––we help others create their USANA lifestyle. And we are able to do that with teams of incredible employees based around the world.\n<br><br>\nUSANA employees do more than work for our company­––we embody the culture, and we live our company values: Excellence, Integrity, Health, and Community. We are committed to doing whatever it takes to ensure USANA’s direct-selling Associates are supplied with whatever they need to become successful.</div> </div><div></div>"}