{"job title": "Electrical Engineer - Motor Design", "company": "Ward Leonard Electric Company", "city state": "– Thomaston, CT - Thomaston, CT", "rating": "4.6", "job description": "<div><div><div>Job Details</div></div><div><div><div>Level <div><div>Experienced</div></div></div><div>Job Location <div><div>Thomaston, CT - Thomaston, CT</div></div></div><div>Position Type <div><div>Full Time</div></div></div><div>Education Level <div><div>4 Year Degree</div></div></div></div><div><div>Travel Percentage <div><div>Negligible</div></div></div><div>Job Shift <div><div>Day</div></div></div><div>Job Category <div><div>Engineering</div></div></div></div></div><div><div>Job Description</div></div><div><div> <div>The successful candidate will provide technical support and product design for the development of AC &amp; DC rotating equipment ensuring the company's leadership position in the market.\n<br><br>\n<u><strong>The Electrical Engineer will be responsible for:</strong></u>\n\n<ul>\n\n\t<li>Development of electrical simulations that show a path of compliance toward meeting customer performance requirements.</li>\n\n<li>Presentation of engineering calculations for proof of concept.</li>\n\n<li>Review of existing products to determine if a customer solution already exists within the business</li>\n\n<li>Providing production data and technical support for the quoting and build of rotating machines.</li>\n\n<li>Leading within a cross-functional environment to define the needs and develop solutions to meet customer requirements within the boundaries of the project.</li>\n\n<li>Test oversight to ensure that performance is met as defined by the project.</li>\n\n<li>Report writing as necessary for root cause failure analysis.</li>\n\n<li>Providing guidance in prototype testing of concept ideas.</li>\n\n<li>Entering manufacturing and design data as necessary for production build within existing ERP system.</li>\n</ul>\n<strong><u>Travel Requirements:</u></strong>\n\n<ul>\n\n\t<li>Some travel may be required (\n</li></ul>\n\n</div>\n</div></div><div><div>Job Qualifications</div></div><div><div> <div><strong><u>The ideal candidate will have, but not limited to, the following developed skills:</u></strong>\n\n<ul>\n\n\t<li>The ability to perform basic through advanced Electrical and Electromagnetic Engineering calculations to solve complex problems involving influences from the electrical, mechanical and thermal engineering disciplines.</li>\n\n<li>Basic understanding of thermal and fluid dynamics to aid in temperature control of the product.</li>\n\n<li>Basic Mechanical Engineering understanding to assess strengths and weaknesses of existing and new products.</li>\n\n<li>Basic Rotor Dynamics understanding for the determination of limits of rotating components such as shafts and bearings, including natural frequency and deflection at speed and temperature.</li>\n\n<li>Knowledge of material sciences to confirm strengths and weaknesses of parts.</li>\n\n<li>Equivalent circuit methodologies.</li>\n\n<li>Analytical motor performance calculators, preferably RMxprt.</li>\n\n<li>3D CAD Simulation - FEA and/or FVM analysis with ANSYS, Maxwell.</li>\n\n<li>3D CAD Modelling - preferably SolidWorks.</li>\n\n<li>2D CAD Detailing - preferably SolidWorks.</li>\n\n<li>Knowledge and application of FMEA and DFMEA methods</li>\n\n<li>Knowledge of ASME Y14.5 application of dimensions and geometric tolerancing.</li>\n\n<li>Understanding of Enterprise Data Management system processes, preferably SolidWorks EPDM.</li>\n\n<li>MRP/ERP data entry.</li>\n</ul>\n<strong><u>Education / Experience:</u></strong>\n\n<ul>\n\n\t<li>BSEE with a minimum of 5 to 7 years experience in product design and providing technical guidance, instruction and sales support in rotating machinery disciplines.</li>\n\n<li>Demonstrated knowledge of motors, generators and switchgear operation, construction and testing.</li>\n\n<li>Ability to work independently with a high level of accuracy and attention to detail.</li>\n\n<li>Proficient knowledge and use of MS Office Suite.</li>\n\n<li>Experience in a LEAN environment a PLUS!</li>\n\n<li>Good oral and written communication skills are essential.</li>\n\n<li>Must possess the ability to build peer relationships as well as work independently.</li>\n\n<li>Must be action oriented, ethical in value, and have a strong customer focus.</li>\n</ul>\n<strong><u>Physical / Safety Requirements:</u></strong>\n\n<ul>\n\n\t<li>Spends approximately 70% of time working at a desk in an office environment.</li>\n\n<li>Spends about 30% of time on work away from the desk, including going out onto the shop floor and discussing manufacturing issues with Manufacturing Department personnel.</li>\n\n<li>Must wear eye protection and any other required personal protective equipment while on the shop floor.</li>\n</ul>\n\n</div>\n</div></div></div>"}