{"job title": "Senior Dev Ops Engineer", "company": "Zscaler ", "city state": "– Atlanta, Georgia", "rating": "4.7", "job description": "Description<br><br><strong>Position: Senior Dev Ops Engineer</strong>\n<br><br>\n<strong>Location: San Jose, CA</strong><br>\n<div>Zscaler enables the world’s leading organizations to securely transform their networks and applications for a mobile and cloud first world. Its flagship services, Zscaler Internet Access and Zscaler Private Access, create fast, secure connections between users and applications, regardless of device, location, or network. Zscaler services are 100% cloud-delivered and offer the simplicity, enhanced security, and improved user experience that traditional appliances are unable to match. Used in more than 185 countries, Zscaler operates the world’s largest cloud security platform, protecting thousands of enterprises and government agencies from cyberattacks and data loss. The Zscaler platform operates at a carrier grade level– we process over 25 billion transactions a day in our cloud to protect our customers.\n<br><br>\nThe Senior Dev Ops Engineer reports to our Director of Engineering.\n<br><br>\n50TB of data - every single day, and growing. That's the scale of data that we are dealing with at Zscaler. If you like operating at this scale, there's no dearth of interesting challenges awaiting you to take on. You'll enjoy applying the latest technologies to automate and improve data engineering, continuous integration and continuous deployment,.<br>\n<div>Zscaler's data engineering team is seeking a Sr. DevOps Engineer. As a member of our group, you'll have the rewarding opportunity to work on cutting edge technologies to deliver and manage a platform that would be foundational to next gen security analytics.</div>\n<br><strong>Responsibilities/What You’ll Do:</strong>\n<ul>\n<li>Automate, deploy and operate data pipelines</li><li>Implement facilities to monitor all aspects of data pipeline</li> <li>Administer and manage data in Spark and Hadoop environments with an emphasis on automation</li> <li>Troubleshoot and address operational issues as they come up</li><li>Develop tools to monitor workload on Hadoop cluster and tune the cluster for improving data processing throughput</li><li>Support and improve the build, delivery, and deployment pipeline of software developed in Java, Scala and Python</li>\n</ul>\n<strong>Qualifications/Your Background:</strong>\n<ul>\n<li>BS in Computer Science or related field and 5+ years of relevant work experience</li><li>Proficiency in data management and automation on Spark, Hadoop, and HDFS environments</li><li>Proficiency in understanding various log files emitted by Hadoop and troubleshooting performance bottlenecks in the cluster</li><li>Experience developing ETL pipelines</li><li>Experience using Spark SQL</li> <li>Experience developing build and deployment automation</li> <li>Experience implementing and administering logging and monitoring tools</li>\n</ul>\n\n<div><strong>Desirable:</strong></div><div>\n\n<ul>\n<li>Experience managing source in git (GitHub ops, branching, merging, etc) a big plus</li><li>Experience in orchestration tools like Ansible</li> <li>Experience with ETL tools like Airflow</li><li>Experience with SaaS operations</li><li>Experience in CI build tools such as Gradle and Jenkins</li> </ul></div>\n<br><strong>What You Can Expect From Us:</strong>\n<ul>\n<li>An environment where you will be working on cutting edge technologies and architectures</li><li>A fun, passionate and collaborative workplace</li><li>Competitive salary and benefits, including equity</li><li>The pace and excitement of working for a Silicon Valley Unicorn</li>\n</ul>\n<strong>Why Zscaler?</strong>\n<br><br>\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team.\n<br><br>\nLearn more at zscaler.com or follow us on Twitter @zscaler. Additional information about Zscaler (NASDAQ : ZS ) is available at http://www.zscaler.com. All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.</div>\n<br>"}