{"job title": "Quality Data Scientist", "company": "Abbott Laboratories", "city state": "– North Chicago, IL", "rating": "3.6", "job description": "At Abbott, we're committed to helping people live their best possible life through the power of health. For more than 125 years, we've brought new products and technologies tothe world -- in nutrition, diagnostics, medical devices and branded generic pharmaceuticals -- that create more possibilities for more people at all stages of life. Today, 99,000 of us are working to help people live not just longer, but better, in the more than 150 countries we serve.\n<br><br>\n<strong>JOB DESCRIPTION:</strong>\n<br><br>\nAs a Quality Data Scientist, you will provide high quality support for advanced analytics projects within the Abbott Quality and Regulatory division. You will develop advanced algorithms and models to generate key insights for multiple Abbott divisions. In addition, you will support the Quality Management Review process by automating periodic reports, streamlining data collection, and enhancing the efficiency of current business processes.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Under the direction of the Data Science Manager, develop and lead advanced analytics projects and issue regular status/progress reports.</li>\n<li>Collect, compile and analyze data from multiple sources. Understand how to verify data correctness and test for data integrity.</li>\n<li>Streamline current data gathering and data analysis processes.</li>\n<li>Synthesize data projects into actionable items to improve business performance. Present outcomes to non-technical audiences</li>\n<li>Design and implement advanced modeling techniques such as classification, regression, and deep learning to address technical and business issues</li>\n<li>Serve as statistical and data science subject matter expert for collaborative, interdisciplinary team projects</li>\n<li>Support quality management review, including data gathering, analysis and trending and preparing graphs.</li>\n</ul>\n\nExperience/skill\n\n\n<ul>\n<li>Strong analytical and technical skills</li>\n<li>Strong attention to detail</li>\n<li>Excellent verbal/written communication, user interaction&amp;interpersonal skills</li>\n<li>Team player</li>\n<li>Data mining and data engineering experience (SQL, noSQL, Spark, etc.)</li>\n<li>Data analytics experience and modeling experience in Python or R</li>\n<li>Strong programming/scripting skill in Python or R</li>\n<li>Dashboarding experience (PowerBI, Qlik, Tableau, DOMO, etc.)</li>\n<li>Experience presenting complex data analysis to technical and non-technical stakeholders</li>\n<li>Quality and/or compliance experience is desired, but not a requirement.</li>\n</ul>\n\n<strong>Education</strong>\n\n\n<ul>\n<li>Bachelor's degree in engineering/science with 2 years of industry experience in data analytics/science.</li>\n</ul>\n\nJOB FAMILY:Operations Quality\n<br><br>\nDIVISION:AQR Abbott Quality and Regulatory\n<br><br>\nLOCATION:United States&gt;Abbott Park : AP52 Floor-1\n<br><br>\n<strong>ADDITIONAL LOCATIONS:</strong>\n<br><br>\nWORK SHIFT:Standard\n<br><br>\nTRAVEL:Yes, 10 % of the Time\n<br><br>\nMEDICAL SURVEILLANCE:No\n<br><br>\nSIGNIFICANT WORK ACTIVITIES:Continuous sitting for prolonged periods (more than 2 consecutive hours in an 8 hour day), Keyboard use (greater or equal to 50% of the workday)\n<br><br>\nAbbott is an Equal Opportunity Employer of Minorities/Women/Individuals with Disabilities/Protected Veterans.\n<br><br>\nEEO is the Law link - English: http://webstorage.abbott.com/common/External/EEO_English.pdf\n<br><br>\nEEO is the Law link - Espanol: http://webstorage.abbott.com/common/External/EEO_Spanish.pdf"}