{"job title": "Senior Applied Scientist", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAre you passionate about leveraging data to deliver actionable insights that impact daily marketing activities at Amazon? The Customer Targeting team in Amazon is seeking an Applied Scientist to join our team to develop production quality machine learning solutions for optimizing the performance of Amazon’s marketing initiatives across channels and advertising formats. You have experience applying modern machine learning methods to answer key business questions, make strategic and tactical recommendations for change, and work with development teams and business leaders to drive these to production. You are entrepreneurial and able to work in a highly collaborative environment. <br> <br> This role requires an individual with strong quantitative modeling skills and experience getting these production ready. The successful candidate will be a self-starter comfortable with ambiguity, with strong attention to detail, an ability to work in a fast-paced and ever-changing environment. You will be expected to:<br> · Leverage knowledge of statistics and optimization to frame decision-making problems for determining marketing spends across channels.<br> · Build statistical models required to measure the impact of cross-channel spend<br> · Predict future customer behavior and business conditions through machine learning and predictive modeling. <br>· Use optimization tools to recommend optimal spend across channels<br>· Use analytical and predictive techniques to build models for optimizing targeting. <br>· Translate prototype models to production quality, large scale software systems.<br> · Present proposals and results in a clear manner backed by data and coupled with actionable conclusions. <br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>PhD in Computer Science (Machine Learning, AI, Statistics, or equivalent);</li><li>3+ years of industry experience applying ML to solve complex problems;</li><li>Algorithm and model development experience for large-scale applications;</li><li>Skilled with Java, C++, or other programming language, as well as with R, MATLAB, Python or similar scripting language;</li><li>Ability to distill informal customer requirements into problem definitions, dealing with ambiguity and competing objectives</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>PhD in Computer Science (Machine Learning, AI, Statistics, Mathematics, or equivalent);</li><li>5+ years of industry experience applying ML to solve complex problems;</li><li>Extensive knowledge and practical experience in several of the following areas: machine learning, statistics, deep learning, NLP, recommendation systems;</li><li>Significant peer reviewed scientific contributions in premier journals and conferences;</li><li>Expert in more than one more major programming languages (C++, Java, or similar) and at least one scripting language (Perl, Python, or similar);</li><li>Proven track record of production achievements, handling gigabyte and terabyte size datasets;</li><li>Strong fundamentals in problem solving, algorithm design and complexity analysis;</li><li>Strong personal interest in learning, researching, and creating new technologies with high customer impact;</li><li>Experience with defining research and development practices in an applied environment;</li><li>Proven track record in technically leading and mentoring scientists;</li><li>Superior verbal and written communication and presentation skills, ability to convey rigorous mathematical concepts and considerations to non-experts.</li></ul>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}