{"job title": "Data Analyst", "company": "Centric Consulting", "city state": "– Cincinnati", "rating": "4.6", "job description": "<div>Description</div> <div> \n<div> \n<div> \n<div> \n<div><strong>Data Analyst</strong>\n<br><br>\n<em>Location: Cincinnati</em>\n<br><br>\n<strong>Do you have a passion for Data</strong> <strong>?</strong>\n<br><br>\nCentric Consulting is hiring a Data Analyst for to join our Cincinnati practice . We are looking for a technical mind who has excellent analytical skills and the ability to translate needs from the business, working with a team to complete detailed analysis. Minimum of 3 years experience working as a Data Analyst.\n<br><br>\n<strong>What We Look For In Data Analysts</strong>\n<br><br>\n<strong>Consulting experience is strongly preferred</strong>. That said, you will also be considered if you have a strong industry background. We like to work in the communities we live in.\n<br><br>\nWe want someone who <strong>likes to solve problems.</strong> Clients don’t come to us when the problem is easy. You should enjoy taking on the hard stuff.\n<br><br>\n<strong>Why Centric?</strong>\n<br><br>\n<strong>Supportive environment</strong> – We expect a lot from our Data Analysts. But you won’t be asked to do it alone. You will have the full support of the Cincinnati office leadership and everyone at Centric. We love to help people succeed.\n\n<ul>\n\n <li><strong>Growth opportunities</strong> – As a mid-size firm, there is more flexibility when it comes to career paths. Figure out what you want to do, and we’ll figure out how to get you there.</li>\n\n<li><strong>Special culture</strong> – Hands down, the people are the best part of Centric. But you shouldn’t take our word on it – check us out on Glassdoor, Facebook or Twitter to get a glimpse inside what makes us different.</li>\n\n<li><strong>Network of technology champions</strong> – There’s no fun in being the only geek in the room. Centric celebrates all things tech. For example, we hold a yearly gathering called Camp I/O. In the vein of TEDx talks, Camp I/O is an opportunity for technology-minded people across Centric to get together and show off what they can do when not constrained by client requirements and platforms.Check out some of the innovative presentations from last year.</li>\n\n<li><strong>All-company (paid!) vacation trip</strong> – Who doesn’t want to go someplace warm in the winter?</li>\n\n<li><strong>Prefer to contract?</strong>\n\n\n<ul>\n\n <li><strong>Contractor friendly environment</strong> – Contractors are an important part of our Centric family and we treat them as such. You will find that our policies and practices make it easy for you to contract with us.</li>\n\n<li><strong>Benefits eligibility</strong> – As a W2T temporary employee, you are eligible for Centric’s W2T benefits package which includes medical and dental coverage. We are also open to Corp to Corp arrangements (no benefits in that case, however).</li>\n\n<li><strong>Full time potential</strong> – Many of our full time employees originally started as contractors. If that’s something you are interested in, we can explore those options. That said, if you want to remain a contractor that’s fine too. We are flexible!</li>\n</ul>\n\n </li>\n</ul>\n\n </div>\n</div></div></div></div>"}