{"job title": "Atmospheric Data Scientist / Meteorologist", "company": "ClimaCell", "city state": "– Boston, MA, US", "rating": "5.0", "job description": "<div>\nClimaCell is transforming meteorology by developing novel techniques for gathering and assimilating weather data into real-time analysis systems. In addition to working with traditional data sources and modeling outputs, were building our own approach for integrating new measurements from proprietary data sources into weather monitoring systems, as well as developing new forecast products using all of these data.</div><br>\n<div>\nAs an Atmospheric Data Scientist, you will conduct independent research and development of applications for weather forecasting, real-time weather analysis, data engineering, and data quality control systems. You will employ traditional physical and statistical methods for developing these applications, and explore new approaches including machine / deep learning, taking your ideas from experimentation/prototype all the way to production. Most of your work will be spent building those prototypes and demos,but youll also help productionize your work in a cloud environment. A successful candidate will be able to identify a spectrum of solutions for a given problem, building on established successes in the field - but with a keen eye on where ClimaCell can innovate with new approaches.</div><br>\n<div>\n<strong>What it takes</strong></div><ul>\n\n<li>\nStrong background leveraging the PyData stack (pandas, scikit-learn, xarray, dask, numba, etc) to build analysis tools and data processing pipelines for geo-spatial data such as NWP/GCM outputs, re-analysis, or other geoscientific datasets</li>\n<li>\nExperience in applying statistics to solve problems in the atmospheric sciences, such as processing forecast model output / observations from sources like NOAA or ECMWF, executing model emulation, or assessing uncertainty and predictability</li>\n<li>\nExperience working with ensemble model output from NOAA, ECMWF, etc</li>\n<li>\nExpertise in processing and analyzing tera-scale collections of weather model or climate model output</li>\n</ul>\n\n<br>\n<div>\n<strong>Education and Experience</strong></div><ul>\n\n<li>\nAt least a BS in Meteorology, Atmospheric Science, or similar is <strong>required;</strong> an MS in a related field is a strong plus</li>\n<li>\nAt least one year conducting research or development in weather, oceanography, or climate in an academic or business setting</li>\n</ul>\n\n<br>\n<div>\n<strong>Bonus points</strong></div><ul>\n\n<li>\nPrior work with machine learning or deep learning to study geo-scientific data and develop novel forecasting or analysis applications.</li>\n<li>\nPhD in atmospheric sciences, climate science, mathematics, or physics</li>\n<li>\nCan share an existing portfolio of work, either on GitHub or a personal website</li>\n<li>\nFamiliarity computing on the cloud</li>\n<li>\nProficient in writing code to visualize, analyze, and assess weather forecasts and data.</li>\n<li>\nExperience with open-source software development</li> \n</ul>"}