{"job title": "Senior Data Scientist", "company": "Color Genomics", "city state": "– ", "rating": "4.9", "job description": "Color provides a high-quality, physician-ordered, genetic test at a low cost. We include support for physicians, as well as genetic counseling as part of every purchase. Our goal is to expand physician-supported access to genetic testing to help every person, everywhere understand their risk for hereditary disorders.\n<br><br>\nAs Color grows, we are expanding our data science team to drive improvements across the company in product, growth, and laboratory operations. Our data science team tackles a range of challenges, such as helping Color reach a broader market, developing data-driven insights that guide our product roadmap, and using machine learning to drive operational efficiency in our state-of-the-art next generation sequencing laboratory.\n<br><br>\nSome topics you’ll be working on include:\n<br><br>\n♦ Laboratory and process optimization to reduce turnaround time and lower costs, including partnering with our laboratory scientists to optimize assay design as we expand our report offering.\n<br><br>\n♦ Analytics across our business channels (consumer, provider, employer, research) to help us understand our users and key challenges.\n<br><br>\n♦ Designing experiments to improve our lab operations and product experience.\n<br><br>\n♦ Working with Engineering to build infrastructure for data science and modeling.\n<br><br>\n<strong>Who we are looking for:</strong>\n<br><br>\nWe are looking for a motivated and proactive senior data scientist who will have a strong impact in each of these areas. You'll have opportunities to contribute both high-impact tactical analysis and exploratory data science that helps shape our future direction.\n<br><br>\nYou're well versed in the tools of the data science trade and a fast learner who's excited to dive into solving interesting problems in genetics and healthcare (or perhaps you already know a thing or two about these fields!). You'll take a proactive approach to leveraging data to help us grow and want to partner closely with engineering, product, laboratory, and business colleagues to build a data-driven culture across the company.\n<br><br>\n♦ A strong desire to work at the intersection of genomics, healthcare, and technology.\n<br><br>\n♦ MS or PhD in a quantitative or computational field.\n<br><br>\n♦ Industry experience using data science to drive business growth and operational efficiency.\n<br><br>\n♦ Experience mentoring peers and prioritizing workflows from across the company.\n<br><br>\n♦ A knack for converting data-driven insights into actionable next steps.\n<br><br>\n♦ Strong communication and presentation skills.\n<br><br>\n♦ Domain experience in genetics/NGS or healthcare analytics is a plus.\n<br><br>\n♦ Significant experience working with large data sets in Python or R and familiarity with core statistical concepts.\n<br><br>\n♦ Solid programming skills, good familiarity with Python and Git.\n<br><br>\n♦ Work with top people in the tech industry\n<br><br>\n♦ Impact people's lives at a massive scale\n<br><br>\n♦ Drive innovation in the junction between software and genetics\n<br><br>\n♦ Help change the business and product approach in healthcare"}