{"job title": "Staff Data Scientist", "company": "Coursera", "city state": "– Mountain View, CA", "rating": "3.5", "job description": "<div><div>Coursera is scaling a global platform to provide universal access to the world’s best education, and we’re motivated by the passion and mission to transform lives through learning. Our platform has reached over 30 million learners worldwide and we have partnered with 150+ elite universities around the globe with over 2,000 courses in our catalog. We offer Courses, Specializations, Certificates, and Degrees to meet the needs and goals of the diverse learners who come to Coursera. </div><div><br></div><div>In 2016, Coursera began hosting accredited online Masters degrees provided by University partners, which ​provide ​a​ more convenient, lower-cost,​​ “stackable”​ means of earning credentials identical ​to their ​​traditional​ on-campus​​ counterparts. We also launched Coursera for Business, partnering with enterprise companies around the world to provide access to curated skill development for their employees.</div><div><br></div><div>The Data Science team owns the quantitative measurement, experimentation, and inference that informs Coursera's product and business direction; builds the statistical models and machine learning algorithms that power content discovery and an engaging, scalable learning experience; and empowers partners and enterprise customers with on-platform analytics and direct data access. </div><div><br></div><div>We are looking for a Staff Data Scientist to define and build innovative data products that personalize and scale high-quality learning experiences for our tens of millions of learners. The ideal candidate shares our passion for education, possesses a strong statistical and computational skill set, and is collaborative and impact-driven. </div></div><div><div>You personally exhibit a conviction that the world needs Coursera to be wildly successful and alignment to our core values:<ul><ul><li>Betterment: a tireless pursuit to drive results</li><li>Boldness: take risks and act decisively </li><li>Deep Honesty: invite and offer candid feedback in order to learn, change, and grow</li><li>Solidarity: recognize that we are part of something bigger than ourselves and are committed to our mission</li></ul></ul></div></div><div><div>Your responsibilities:<ul><ul><li>Refining key learning features like diagnostics, personalized behavioral and pedagogical interventions, and automated review materials</li><li>Ideating and building key new features to scale the learning experience, including machine-assisted grading and feedback</li><li>Working cross-functionally with engineers, product managers, and other data scientists on our core discovery and learning products</li></ul></ul></div></div><div><div>Your skills:<ul><ul><li>Solid background in applied math, computer science, statistics, or related technical field</li><li>Deep applied statistics and modeling skills</li><li>Strong computational skills</li><li>Proficient with at least one scripting language (e.g., Python) and at least one statistical software package (e.g., R)</li><li>Excellent communication and project management skills</li><li>Domain expertise in NLP preferred</li><li>Familiarity with domain-specific technologies and challenges in learning preferred</li><li>6+ years of industry experience preferred </li></ul></ul></div></div><div><div>If this opportunity interests you, you might like these courses on Coursera:<ul><ul><li>Recommender Systems</li><li>Machine Learning</li></ul></ul></div></div>"}