{"job title": "Data Scientist - Portfolio Management Strategy and Analytics-New York, NY", "company": "Credibly", "city state": "– New York, United States", "rating": "3.5", "job description": "<strong>Who We Are:</strong>\n<br><br>\nCredibly’s mission is to build a Data Science driven FinTech Lending Platform which improves the speed, cost, experience, and choice of capital to small and medium sized businesses. At Credibly, we make it easy and intuitive for small businesses to access capital. We have a laser focus on the customer experience and are committed to serving business owners as a trusted partner.\n<br><br>\n<strong>The Company:</strong>\n<br><br>\nFounded in Michigan in 2010, Credibly has provided over half a billion dollars to small business customers, and was named in 2014, 2015, and 2016 to the Inc. 500 list of fastest growing private companies in America, and as one of Crain’s New York Fast 50 Companies for 2015 and 2016.\n<br><br>\nFollowing a 2014 strategic equity investment from the $2.8Bn private equity fund Flexpoint Ford, Credibly rapidly accelerated their growth – opening NYC and Arizona offices, building out their Data Science, Marketing, and Technology teams, launching new loan products, and securing a $100MM credit facility.\n<br><br>\n<strong>The Opportunity:</strong>\n<br><br>\nCredibly is looking for an inquisitive, passionate, and self-motivated Data Scientist who thrives at solving real-world problems in a fast-paced environment. Using advance analytics, outside-the-box thinking, and cutting-edge techniques you will be responsible for focusing on R&amp;D and improving the way decisions are made within portfolio management, fraud management, and collections operations. The ideal candidate will have the experience and knowledge to monitor multiple business functions and drive operational efficiency, but also possesses the humility to build Data Science microservices and perform tracking initiatives.\n<ul>\n <li>Create and analyze reports to improve functions within various business groups</li> <li>Monitor customer management, early warning and collections</li>  <li>Develop data science capabilities to manage portfolio health and improve collection efficiency</li> <li>Evaluate the portfolio under different macro-stress scenarios</li>  <li>Monitor overall provisioning and enterprise risk</li> <li>Take responsibility for all Data Science microservices and capabilities for portfolio management deployed on mobile, web, and as external services for other clients</li>\n</ul>\nRequirements\n\n<ul>\n <li>MS/PhD in quantitative field such as Mathematics, Data Science, Operations Research, Engineering, Statistics or Equivalent from an Ivy League school or equivalent</li> <li>Minimum of 2 years+ experience in consumer or business lending a plus</li> <li>Knowledge of portfolio risk management, early warnings, customer management and collection best practices</li> <li>Ability to express yourself in a clear and concise manner in both written and verbal discussions and ability to work within very tight deadlines and ability to shift gears quickly</li> <li>Ability to transform data and prototype quickly to conduct statistical analysis using tools primarily written in SAS, Python or Java;</li>  <li>Proficiency with SQL language and relational databases</li> <li>Knowledge of API and microservices a plus</li> <li>Knowledge of machine learning a plus</li>\n</ul>\n\n<strong>Benefits</strong>\n\n<ul>\n <li>Health/dental/vision</li> <li>Company paid life insurance</li> <li>7 paid holidays</li> <li>Flex time</li> <li>Vacation time</li> <li>Energetic fast-paced environment</li> <li>Business casual dress attire</li> <li>Excellent opportunity for growth and development</li> <li>Disability insurance</li> <li>401K</li>\n</ul>"}