{"job title": "Data Scientist/Analyst", "company": "Hire Velocity", "city state": "– Dayton, OH", "rating": "4.0", "job description": "<strong>Job Description</strong><div><strong><strong>Job Overview</strong>:</strong>\n<br>\nThe Data Scientist/Analyst will be an active and collaborative member of the ICMSE (Integrated Computational Materials Science and Engineering) Systems Development team within the Materials and Manufacturing Directorate of the Air Force Research Laboratory.\n<br><br>\n<strong>The Scientist/Analyst will be primarily responsible for:</strong>\n<ul>\n<li>Concept and data modeling and development of data/object modeling tools, to include ontologies, taxonomies, and vocabularies and associated code for use in a variety of client and server- based data archiving environments to advance progress in the Materials Genome Initiative.</li><li>Duties will also involve the development of concept, ontology and pedigree visualization tools, which will fully utilize the concept/object modeling tools to provide consumers with graph-based search capabilities.</li><li>Secondary duties involve designing and discovering new technology solutions, breaking new ground in collaborative capabilities.</li><li>Additional responsibilities include providing guidance and input to data customers and developers.</li>\n</ul>\n<strong>Requirements:</strong>\n<ul>\n<li>The data scientist/analyst should be an independent and self-starting contributor, able to work for extended periods (a week or longer) without regular guidance from other functions.</li><li>Successful candidates will have excellent oral and written communication skills and be excited to work in a collaborative environment with engineers from different technical backgrounds.</li><li>Main focus for this position will be:\n\n<ul>\n<li>60% - Python development against new and emerging data modeling and search toolsets (specifically, coding enhancements and refactoring the Data Model Builder and graph search)</li><li>20% - Data and method analysis for ontologies and knowledge retrieval,</li><li>15% - Standards development, and</li><li>5% - Workshops, meetings and conferences.</li></ul></li>\n<li>BS or MS in computer science or related field of study preferred, practical experience will be paramount, technical experience required</li><li>Minimum 5 years of experience in data modeling including include ontologies, taxonomies, and vocabularies</li><li>Minimum 5 years of experience in developing data/object modeling tools</li><li>Experience in server-based data archiving environments</li><li>Demonstrable skills in problem solving and technology risk analysis</li><li>This position is working within a government facility and <strong>requires U.S. Citizenship</strong></li>\n</ul>\n<strong>Additional Information:</strong>\n<br><br>\nOur client is an innovative science and technology company providing customers with superior research and development expertise since its inception in 1973. Our long-term success is a direct result of a strong commitment to the success of our employees. We look forward to reviewing your application.\n<br><br>\nOur client is firmly committed to Equal Employment Opportunity (EEO) and prohibits employment discrimination for employees and applicants based on age, race, color, pregnancy, gender, gender identity, sexual orientation, national origin, religion, marital status, citizenship, or because he or she is an individual with a disability, protected veteran or other status protected by federal, state and local laws.</div>Company Description<div>Our client is highly regarded for providing research and technical expertise to our government and industry customers. Their unique philosophy emphasizes passion for advancing science, dedication to superior service, and commitment to enhancing careers.</div>"}