{"job title": "Data Analyst", "company": "Jackson Lewis", "city state": "– Sacramento, CA", "rating": "3.4", "job description": "<p>Jackson Lewis P.C. is an employment law firm that represents management exclusively in every aspect of employment, benefits, labor and immigration law and related litigation. The Firm is ranked in the First Tier nationally in the category of Labor and Employment Litigation, as well as in both Employment Law and Labor Law on behalf of Management, in the <em>U.S. News - Best Lawyers® “Best Law Firms</em>”. </p>\n<p> </p>\n<p>Jackson Lewis has offices across the United States and Puerto Rico. The Firm is comprised of individual local offices staffed by attorneys and support personnel. These offices are supported by the National Operations Center which includes Human Resources, Information Technology, Finance/Accounting, Facilities, Marketing and Information Services.</p>\n<p> </p>\n<p>Jackson Lewis is presently looking for a Data Analyst located at our Sacramento Office.</p>\n<p> </p>\n<p> </p>\n<p><strong>DUTIES AND RESPONSIBILITIES:</strong></p>\n<p> </p>\n<p>Ø Analyze client data and workplace law issues</p>\n<p>Ø Design, create and analyze data reports for results, trends and variations</p>\n<p>Ø Design and create data summaries and/or databases from data obtained from various sources, including raw data and multiple forms of evidence</p>\n<p>Ø Written and verbal contact with HR and legal professionals at Fortune 500 companies</p>\n<p>Ø Collaborate with class action attorneys and paralegals</p>\n<p>Ø Organize and maintain electronic and hard copy data files</p>\n<p> </p>\n<p><strong>SKILLS AND EDUCATIONAL REQUIREMENTS:</strong></p>\n<p> </p>\n<p>Ø Bachelor’s Degree required</p>\n<p>Ø 1 to 3 years data analyst experience</p>\n<p>Ø Proficiency in Microsoft Excel; Familiarity and Microsoft Office Professional Suite</p>\n<p>Ø Experience with Microsoft Access and Visual Basic for Applications preferred</p>\n<p>Ø Experience with statistics preferred</p>\n<p>Ø Critical thinking and problem solving skills required</p>\n<p>Ø Ability to multi-task and manage multiple projects, from start to finish, with shifting priority levels</p>\n<p>Ø Strong organizational and communication skills</p>\n<p>Ø Experience with routine billable time and cost capturing for analysis performed</p>\n<p> </p>\n<p>We offer a competitive starting salary and a comprehensive benefits package, along with opportunity for growth. We are an equal opportunity (M/F/V/D) employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, national origin, gender, age, religion, disability, sexual orientation, veteran status, marital status or any other characteristics protected by law.</p>"}