{"job title": "Data Analyst, Finance", "company": "Mentor Graphics", "city state": "– US - OR, Wilsonville", "rating": "4.1", "job description": "<div><div><strong>\n<br>\nData Analyst, Finance - 8777</strong><br>\n\n<div>\n<div>\nWork Location\n<br><br>\n<strong>\n<br>\nUS - OR, Wilsonville</strong>\n</div><br>\n\n<div>\nReq ID\n<br><br>\n<strong>8777</strong>\n</div><br>\n\n<div>\nJob Category\n<br><br>\n<strong>\n<br>\nFinance</strong>\n</div>\n</div>\n</div>\n\n<br>Apply Now</div><br>\n\n<div>Company: Mentor Graphics\n<br>\nJob Title: Data Analyst, Finance - 8777\n<br>\nJob Location: USA – OR - Wilsonville\n<br>\nJob Category: Finance\n<br><br>\nMentor, a Siemens Business is a leading global provider of software for the design of complex electronics, contributing to the creation of everything from cell phones to airplanes. Our software tools enable companies around the world to develop new and highly innovative electronic products faster and more cost-effectively. Our customers use our tools to push the boundaries of technology and physics in order to deliver better products in the increasingly complex world of chip, board and system design. Founded in 1981, the company is headquartered in Wilsonville, OR (Portland).\n<br><br>\n<strong>Job Duties:</strong>\n<br><br>\nReporting to the Sr. Manager of Performance Reporting in Finance, this position will support the financial reporting needs of the Siemens PLM Software business unit. This position is responsible for creating and maintaining financial operational reporting data structures and dashboards. Responsibilities include managing data assets and ensuring trusted data quality across Finance and the company-wide reporting.\n<br><br>\nThe Performance Reporting organization serves as a strategic partner to the Enterprise enabling efforts to drive Growth and Profitability by providing excellence in performance reporting and business insight.\n<br><br>\nKey Responsibilities\n<br><br>\n• Support a strong financial reporting infrastructure of global systems and processes involving all aspects of information management and technology for the organization\n<br><br>\n• Develop and maintain reports and dashboards utilizing standardized tool sets\n<br><br>\n• Maintain multiple reporting data hierarchies\n<br><br>\n• Implement controls and processes to mitigate data quality risks including monitoring data quality results, reports and dashboards\n<br><br>\n• Assist with major data and organizational changes that impact reporting structures\n<br><br>\n• Automate business processes and monthly reporting activities\n<br><br>\n• Analyze and review reporting capabilities for enhancements in support of Financial Performance Reporting\n<br><br>\n• Enhance reporting documentation and training materials for the reporting community\n<br><br>\n• Partner with technical teams on systems and data structures\n<br><br>\n• Promote and evangelize new reporting capabilities to other functional business units\n<br><br>\n• Perform ad-hoc reporting as needed\n<br><br>\n<strong>Job Qualifications:</strong>\n<br><br>\n• 2-5+ years related business experience preferred\n<br><br>\n• Reporting, visualization and process automation tool experience (Qlikview, Tableau, Alteryx)\n<br><br>\n• Experience with metadata, master data, reference data, and data management systems\n<br><br>\n• Ability to write, read and interpret SQL for report and dashboard development\n<br><br>\n• Understanding of relational databases and hierarchical data schemes\n<br><br>\n• Exposure to enterprise data flows and systems (ERP, CRM, HR, Marketing)\n<br><br>\n• Passion for researching, collecting, and analyzing data\n<br><br>\n• Process driven – Detailed, transactional, efficient, effective\n<br><br>\n• Quick Learner – business systems, data intersections, reporting, organizational structure\n<br><br>\n• Perceptive of up and down stream impacts\n<br><br>\n• Professional and customer focused with developed project, organization and time management skills\n<br><br>\n• Self-starter who prioritizes multiple projects with competing deadlines and is motivated to promote change\n<br><br>\n• BA, BS degree in Finance, Accounting (or similar), or relevant work experience\n<br><br>\n<strong><u>Mentor Benefits</u></strong>\n<br><br>\nMentor Graphics believes in fostering a work environment that promotes a healthy work-life balance. Our world class benefits package includes 401k matching, annual performance reviews/bonuses, education reimbursement, partially paid Medical/Dental/Vision insurance, Life, Short/Long Term Disability, and a generous time off plan. Our Wilsonville site also has the following onsite: 24/7 workout facility, full service cafeteria, child development center, basketball courts, sand volleyball, daily exercise classes.\n<br><br>\n<em>All qualified applicants will receive consideration for employment without regard to race, sex, sexual orientation, gender expression or identity, color, religion, national origin, disability or protected veteran status.</em></div>\n\n<br>"}