{"job title": "Data &amp; Applied Scientist", "company": "Microsoft", "city state": "– Redmond, Washington", "rating": "4.1", "job description": "Core Services Engineering builds and manages the critical products and services that Microsoft runs on. We boldly pursue big ideas that power transformational advances at Microsoft and for our customers, while helping Microsoft teams work smarter, faster and more securely every day. Core Services Engineering employees have deep technical and business expertise, customer insights, and a clear point of view that comes from first-hand, large-scale experience with Microsoft and industry solutions. We are engineers, technology leaders and experts, digital transformation change agents, and customer advocates.\n<br><br>\nWe have exciting opportunities for you to innovate, influence, transform, inspire and grow within our organization and we encourage you to apply to learn more!\n<br><br>\nAre you someone with a passion for data, analytics, insights and technology? Do you want to be part of a team lighting up actionable insights to help the organization make business decisions? If you excel in blending quantitative analysis with strategy development and want to influence the future of Core Services at Microsoft, then this position is for you.\n<br><br>\nThe Data team in Shared Services (part of Core Services Engineering) is looking for a passionate, creative, analytical and experienced data analyst who loves big data and is curious to explore and unveil insights to impact key business decisions. Our team plays a key role in providing data and analytics within Core Services Engineering and owns the end to end decision sciences charter that includes:\n<ul>\n<li> bringing the relevant data together to deliver high value business scenarios</li><li> creating key metrics, reports and dashboards to support business health</li><li> building advanced analytical models (behavior segmentation, churn prediction, recommendation engine, etc.) that spans over sales, marketing, supply chain, finance, HR and engineering areas.</li> \n</ul>\n\nResponsibilities<br><br>This position is for a Data Analyst within Core Services Engineering, a key role driving insights about the internal services that we provide the company including employee experience, E2E process digitization, and speed to value for our products. The scope includes understanding and monitoring key metrics and ongoing analysis to inform overall strategy for enabling the company to accelerate its digital transformation and lead the industry in leveraging data to drive intelligence. Also includes stakeholder engagement and close collaboration with and leveraging efforts of data scientists, data engineers and other data analysts of the Data team in Core Services Engineering.\n<br><br>\nYou are driven, self-directed, entrepreneurial and focused on delivering the right results. To be successful in this role, you must have strong skills in written and oral communications, a can-do attitude and the willingness to tackle hard problems in innovative ways.\n<br><br>\n<strong>Key responsibilities:</strong>\n<ul>\n<li>Partner with specific functions of CSEO and develop a deep understanding of those areas</li><li>Manipulate and analyze complex, high-volume, high-dimensionality data from varying sources using a variety of tools and data analysis techniques</li><li>Define, track and report key metrics to assess overall business health</li><li>Deliver in depth analysis on business performance (trends, funnels) and drivers, as well as forecasts and targets</li><li>Build/design dashboards to enable ongoing monitoring of business health</li><li>Work with data engineers to operationalize dashboards and ingest new data sources (provide data modeling requirements)</li><li>Provide actionable insights on how to improve our services.</li><li>Connect findings and recommendations to business initiatives and collaborate with key stakeholders at various management levels</li><li>Partner with analytics, data science, and data engineering partners for data structures, data availability, and model development</li><li>Ensure data accuracy via UAT</li>\n</ul>\n\nQualifications<br><br><strong>Knowledge, experience and skills:</strong>\n<ul>\n<li>3-6 years hands on analytics experience with proven quantitative orientation</li> <li>Bachelor or Master’s Degree in Statistics/Math/Computer Science/Economics/Business or Engineering; MBA preferred</li><li>Exceptional problem solving, technical and data analysis skills</li> <li>Advanced working knowledge of large data manipulation and data mining</li> <li>Strong programming knowledge (proficient in SQL)</li><li>Advanced Excel and PowerPoint skills, familiarity with Power BI</li> <li>Exceptional written and oral communication and presentation skills</li> <li>Be self-driven, and show ability to deliver on ambiguous projects with incomplete or dirty data</li> <li>Ability to work in a team environment that promotes collaboration and succeed in a matrix structure by influencing new thinking</li>\n</ul>\n<strong>Preferred, not required:</strong>\n<ul>\n<li>Advanced Power BI dashboard design &amp; development</li><li>Experience with big data technologies such as Azure Data Lake, HD Insight, Spark, Hive, etc.</li> <li>Business domain expertise in areas of sales, marketing, supply chain, finance and/or HR</li> \n</ul>\n<strong>Basic Qualifications:</strong>\n<ul>\n<li>3+ years of hands on data analytics with proven quantitative orientation</li><li>Bachelor in Statistics/Math/Computer Science/Economics/Business or Engineering</li>\n</ul>\n<strong>Describe the ideal candidate</strong>\n<br><br>\nThe ideal candidate will have hands on experience on data analysis, will have worked on scorecard creation projects from design to delivery and will have been responsible for analyzing performance and have clear examples where actionable insights / recommendations were results of her/his analysis. Will have worked closely with business stakeholders and will be able to communicate easily with a number of different disciplines (business and engineering). Will be a true team player and will not be afraid to take initiatives and be pro-active.\n<br><br>\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n<br><br>\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.\n<br><br>\n#CSEO"}