{"job title": "Cloud Data Engineer", "company": "National Renewable Energy Lab", "city state": "– Golden, CO", "rating": "3.6", "job description": "Posting TitleCloud Data Engineer .\n<br><br>\nLocationCO - Golden .\n<br><br>\nPosition TypeRegular .\n<br><br>\nHours Per Week40 .\n<br><br>\nJob Summary The Data Science and Innovation Group in the Strategic Energy Analysis Center has an opening for a full-time data engineer, who has cloud computing expertise, and big data analytics experience. NREL Is looking for a dynamic, motivated data engineer with a strong technical background and an interest in the mission of NREL. The successful candidate will collaborate with NREL staff and researchers, other national labs and cloud computing vendors to help develop a data lake and a suite of analytical tools built on Amazon Web Services (AWS), and work closely with researchers to find, prepare, cleanse, and curate datasets for a variety of research applications. Experience with developing Jupyter Notebooks and manipulating large/complex datasets is key. The candidate must be a versatile team player, good at multitasking, and be willing to work on multiple projects. Strong attention to detail and a willingness to learn quickly in an ever-changing environment is key. .\n<br><br>\nRequired Education, Experience, and SkillsRelevant PhD . Or, relevant Master's Degree and 3 or more years of experience . Or, relevant Bachelor's Degree and 5 or more years of experience . Demonstrates broad understanding and wide application of engineering technical procedures, principles, theories and concepts in the field. General knowledge of other related disciplines. Demonstrates leadership in one or more areas of team, task or project lead responsibilities. Demonstrated experience in management of projects. Very good writing, interpersonal and communication skills. .\n<br><br>\nPreferred Qualifications Experience working with cloud computing vendors, especially AWS. ·Familiarity with foundational statistical concepts such as regression models, uncertainty quantification, Bayesian analysis, model selection, clustering, outlier detection, etc. · Experience in big data analytics on diverse, asynchronous data sets including experience in designing efficient and robust ETL workflows. Sufficient software engineering expertise to enable big data solutions: object-oriented design, coding and testing patterns; engineering software platforms and large-scale data infrastructures. A strong familiarity with Unix/Linux operating systems and open source software. Background in relevant engineering disciplines and an interest in renewable energy technologies · Candidates should be able to demonstrate some existing skills and experience in applying data science in industry, academia, or government settings. Interested candidates should have experience programming Python and R, accessing APIs and databases (SQL), A high degree of curiosity, willingness to learn new skills and ability to adapt to the data needs of differing domains. . Submission Guidelines Please note that in order to be considered an applicant for any position at NREL you must submit an application form for each position for which you believe you are qualified. Applications are not kept on file for future positions. Please include a cover letter and resume with each position application. .\n<br><br>\nEEO Policy NREL is dedicated to the principles of equal employment opportunity. NREL promotes a work environment that does not discriminate against workers or job applicants and prohibits unlawful discrimination on the basis of race, color, religion, sex, national origin, disability, age, marital status, ancestry, actual or perceived sexual orientation, or veteran status, including special disabled veterans. NREL validates right to work using E-Verify. NREL will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS), with information from each new employee’s Form I-9 to confirm work authorization. For additional information, click here.\n<br><br>"}