{"job title": "Quantitative Analyst/Data Scientist", "company": "S&amp;P Global", "city state": "– Boston, MA US", "rating": "3.5", "job description": "<div>\n<div><strong>JobDescription :</strong></div><div><strong>The Role:</strong> Quantitative Analyst/Data Scientist\n<br><br>\n<strong>The Location:</strong> Boston or Chicago\n<br><br>\n<strong>The Team:</strong> Our Quantamental Research group specializes in uncovering new anomalies and differentiated stock selection strategies. Integrated quantamental research products enable portfolio managers, quantitative analysts, and researchers to refine and differentiate their strategies to gain insights into new sources of potential alpha.\n<br><br>\nWe strive to combine the efficiency and breadth of the quantitative approach with the intuition, judgement and deep dive analysis of the fundamental approach.\n<br><br>\nWe conduct creative, industry leading investment research on which derived content is built. This research is the basis for in depth client interaction and the creation of derived content and analytics.\n<br><br>\n<strong>The</strong> <strong>Impact:</strong> You will be reporting to the Director of Research and will have both an internal research component and an externally facing component.The internal research role component consists of exploring and testing investment thesis. You and the team’s research is often featured in top-tier media publications.\n<br><br>\nThe external aspect of this role involves communicating the actionable investment insights and solutions resulting from the research. The channels for communication are broad, including: industry events, webinars, and face to face meetings with institutional investment practitioners. A significant amount of time will be spent interacting with clients around investment solutions.\n<br><br>\n<strong>The</strong> <strong>Career</strong> <strong>Opportunity:</strong> You will face interesting challenges which include creatively determining how best to accomplish your job. You should value the free exchange of ideas, solicit critical feedback to make your work better, and, above all, find the best solution to the challenge at hand. Along with a keen analytical mind, you are an excellent communicator and writer. Along with technical skills, you will demonstrate strong character, integrity and respect for others.\n<br><br>\nYou will have deep financial market experience and understanding, and have a real passion for asset management and risk analysis. In addition, you should be able to work well in a team, be highly self-motivated with the ability to execute independently.\n<ul>\n<li>Conducting hands-on, actionable creative research around investment strategies using the entire suite of our products.</li><li>Collaborating with team on a variety of research initiatives. All members of the research team drive their own research and support other team members on their initiatives.</li><li>Publishing industry leading research in white papers, blogs, research briefs.</li><li>Presenting at sponsored and industry events and conduct webinars.</li><li>Working closely with sales as a subject matter expert, providing proof statements to clients around research.</li><li>Working with marketing around thematic research strategies.</li>\n</ul>\nAreas of focus include:\n<ul>\n<li>Event Driven Investing</li><li>Industry-Specific Signals</li><li>Supply Chain Interactions</li><li>Insights from Academic Literature</li><li>Alternative Data Sets</li>\n</ul>\nDemonstrating the uniqueness and depth of our data and analytics offerings, the research group uncovers new investment insights in their monthly publications. Research findings are frequently cited by mainstream industry publications, including: The Wall Street Journal, Barron's, and Fortune, among others.\n<br><br>\n<strong>Requirements:</strong>\n<ul>\n<li>Master’s degree in Statistics, Physical Sciences, Finance, or Technology required</li><li>Expertise in Machine Learning, NLP and have data science experience.</li><li>3-5 years experience conducting empirical equity research</li><li>Able to establish credibility with clients and fellow team members around investment management ideas.</li><li>Strong technical and programming skills in one or more high level programming languages such Clarifi, EXCEL, R, MatLab, SQL, Python</li><li>Organized and detail oriented. High degree of comfort with large datasets.</li><li>Deep analytical mindset and understanding of either a quantitative or fundamental investment approach</li><li>Excellent presentation skills</li><li>Intellectual curiosity and inquisitiveness. Ability to conduct investment research within a dynamic, team based culture</li><li>Ability to explain complex investment concepts in simple terms</li><li>Masters or Ph.D. in Finance or similar</li><li>CFA (or working towards)</li><li>Demonstrable knowledge of statistics and econometrics; as well as capital markets, particularly global equities</li>\n</ul>\nAt S&amp;P Global Market Intelligence, we know that not all information is important—some of it is vital. Accurate, deep and insightful. We integrate financial and industry data, research and news into tools that help track performance, generate alpha, identify investment ideas, understand competitive and industry dynamics, perform valuation and assess credit risk. Investment professionals, government agencies, corporations and universities globally can gain the intelligence essential to making business and financial decisions with conviction.\n<br><br>\nS&amp;P Global Market Intelligence is a division of S&amp;P Global (NYSE: SPGI), which provides essential intelligence for individuals, companies and governments to make decisions with confidence. For more information, visit, S&amp;P Global Market Intelligence.\n<br><br>\nS&amp;P Global is an equal opportunity employer committed to making all employment decisions on the basis of merit, capability and equality of opportunity, and without regard to race/ethnicity, gender, pregnancy, gender identity or expression, color, creed, religion, national origin, age, disability, marital status (including domestic partnerships and civil unions), sexual orientation, military veteran status, unemployment status, or any other basis prohibited by federal, state or local law, or any other characteristic that has no bearing on a person’s ability to perform his or her job.\n<br><br>\nOnly electronic job submissions will be considered for employment. If you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.</div></div><br>\n\n <div>\n<div><strong>Job ID :</strong></div><div>236324</div></div><br>\n\n <div>\n<div><strong>Posted On :</strong></div><div>3-26-2018</div></div><br>\n\n <div>\n<div><strong>Location :</strong></div><div>Boston, MA US</div></div>\n<br>"}