{"job title": "Data Engineer", "company": "Syapse", "city state": "– Radnor, PA", "rating": "3.8", "job description": "<strong>About Syapse</strong>\n<br><br>\nMaybe you've supported a friend or family member who's dealing with cancer. Maybe you've battled it yourself. At Syapse, our mission is to enable healthcare providers to deliver the best care to every cancer patient through precision medicine. Our personal connections to this mission unite us.\n<br><br>\nWe integrate genomics and clinical data on a single platform and allow doctors to share important treatment and outcomes information across a national network. Our customers manage more than 1 million active cancer cases at hundreds of hospitals across the US and Asia. Now, we're racing to meet growing demand and bring precision cancer care to every patient, regardless of location or income.\n<br><br>\n<strong>About the Engineering Team</strong>\n<br><br>\nThe Engineering team at Syapse builds our revolutionary oncology decision support platform that empowers physicians to deliver consistent, high-quality precision cancer care. We're scaling our data platform using distributed systems, stream processing, and microservices. To do this and tackle all our engineering challenges, our autonomous, customer value focused scrum teams work in short sprints and own product areas end to end. Our domain-based guilds (e.g. Data Semantics, Web Technology, Architecture) balance that by encouraging the building of communities and foster collaboration across teams.\n<br><br>\nAs Syapse continues to grow, we'll use advanced software engineering methods to expand the capabilities of the platformand help deliver the best cancer care to every patient.\n<br><br>\n<strong>About the role</strong>\n<br><br>\nYou will join our newly-formed ecosystem team whose focus is to develop data-intensive applications that are the bridge between our health-system customers and companies in the healthcare ecosystem pioneering the use of real world evidence in the treatment of cancer. As an early member of the ecosystem team, you will have a unique opportunity to establish new infrastructure and processes that enable us to deliver insights that drive the practice of precision medicine forward. You will design and build out the applications and tooling that make data more accessible and enable analytics pipelines, data visualization, and other services.\n<br><br>\nOur team is based out of Syapse's East Coast office and takes pride in our unique culture and environment. Our mission as a company is a serious one, so you can expect to join a nimble team that strives for ever increasing standards of delivery with quality. Fortunately, when you love what you do and you are surrounded by great people, you can grow and accomplish more than you think possible.\n<br><br>\n<strong>What you bring to the table</strong>\n\n<ul>\n<li>BS, MS, or Ph.D. in computer science or related field</li>\n<li>5+ years relevant work experience</li>\n<li>Successful track record of manipulating, processing, and extracting value from large complex datasets</li>\n<li>Expertise in writing SQL and working with large-scale relational databases built on PostgreSQL, MySQL, or similar platforms</li>\n<li>Experience building solutions that leverage non-relational database technologies (DynamoDB, Cassandra, MongoDB, etc)</li>\n<li>Strong programming skills in languages like Python, Ruby, or Java</li>\n<li>Skilled at working with a mix of structured and unstructured data from a variety of sources</li>\n<li>An affinity for simple solutions to complex problems</li>\n<li>A strong motivation to meet our mission</li>\n</ul>\n<strong>Bonus points if you</strong>\n\n<ul>\n<li>Have experience working with AWS cloud technologies, especially DynamoDB, RedShift, Athena, and Kinesis</li>\n<li>Exposure to other big data tools: Hadoop, Spark, Kafka, etc</li>\n<li>Understand distributed systems and patterns for data replication</li>\n<li>Switched from pre-med or biology to computer science in college</li>\n</ul>\n<strong>Benefits and perks</strong>\n<br><br>\nAmazing Coworkers\n<br><br>\nCompetitive pay and ownership in the company\n<br><br>\n100% company paid medical, dental and vision for employees\n<br><br>\n401(K) matching\n<br><br>\nFlexible time off\n<br><br>\nTransit assistance &amp; Pre-tax commuter benefits.\n<br><br>\nWeekly catered lunches and office snacks\n<br><br>\nCompany sponsored gym membership &amp; lots of other perks\n<br><br>\n<strong>Next steps</strong>\n<br><br>\n<em>After submitting an application a team member will reach out to you shortly. While each interview is unique to the role, our interview process typically consists of an introductory phone conversation with a recruiter, a second phone or video interview with a hiring manager or senior team member, and wraps up with a visit our to our office, usually lasting +/- 4 hours.</em>\n<br><br>\n<em>Have a quick question about the role? Email</em> <em>careers@syapse.com</em><em> or simply apply here.</em>"}