{"job title": "New Grad (Advanced Degree)- Data Scientist /Sr. Data Scientist", "company": "Visa", "city state": "– Foster City, CA", "rating": "3.3", "job description": "<strong>About Visa:</strong>\n<br><br>\nCommon Purpose, Uncommon Opportunity. Everyone at Visa works with one goal in mind making sure that Visa is the best way to pay and be paid, for everyone everywhere. This is our global vision and the common purpose that unites the entire Visa team. As a global payments technology company, tech is at the heart of what we do. CyberSource, a Visa company, has been and continues to be a pioneer within the e-Commerce Payment Management world. Our VisaNet network is capable of handling over 65,000 transaction messages per second for people and businesses around the world, enabling them to use digital currency instead of cash and checks.\n<br><br>\nWe are also global advocates for financial inclusion, working with partners around the world to help those who lack access to financial services join the global economy. Visa's sponsorships, including the Olympics and FIFA World Cup, celebrate teamwork, diversity, and excellence throughout the world. If you have a passion to make a difference in the lives of people around the world, Visa offers an uncommon opportunity to build a strong, thriving career. Visa is fueled by our team of talented employees who continuously raise the bar on delivering the convenience and security of digital currency to people all over the world. Join our team and find out how Visa is everywhere you want to be.\n<br><br>\n\"Visa will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of Article 49 of the San Francisco Police Code.\"\n<br><br>\nTo ensure that Visa's payment technology is truly available to everyone, everywhere requires the success of our key bank or merchant partners and internal business units. The Global Data Science group supports these partners by using our extraordinarily rich data set that spans more than 3 billion cards globally and captures more than 100 billion transactions in a single year. Our focus lies on building creative solutions that have an immediate impact on the business of our highly analytical partners. We work in complementary teams comprising members from Data Science and various groups at Visa. To support our rapidly growing group we are looking for Data Scientists who are equally passionate about the opportunity to use Visa's rich data to tackle meaningful business problems. You will join one of the Data Science focus areas (e.g., banks, merchants&amp;retailers, digital products, marketing) with an opportunity for rotation within Data Science to gain broad exposure to Visa's business.\n<br><br>\nThe position is based either at Visa's headquarter in the San Francisco Bay Area (Foster City, CA) or our office in the Washington, DC Metro Area (Ashburn, VA).\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Be an out-of-the-box thinker who is passionate about brainstorming innovative ways to use our unique data to answer business problems</li>\n<li>Communicate with clients to understand the challenges they face and convince them with data</li>\n<li>Extract and understand data to form an opinion on how to best help our clients and derive relevant insights</li>\n<li>Develop visualizations to make your complex analyses accessible to a broad audience</li>\n<li>Partner with a variety of Visa teams to provide comprehensive solutions</li>\n<li>Find opportunities to craft products out of analyses that are suitable for multiple clients</li>\n</ul>\n\nCan you take on the responsibilities described above? Then please apply! Independent of years of experience or educational background, successful candidates frequently have a mix of the following qualifications:\n\n\n<ul>\n<li>2+ years experience in data-based decision-making or quantitative analysis</li>\n<li>Bachelor's degree in an analytical field such as statistics, operations research, economics, computer science or many others (graduate degree is a plus)</li>\n<li>Experience with extracting and aggregating data from large data sets using SQL or other tools</li>\n<li>Competence in Excel, PowerPoint and Tableau</li>\n<li>Experience in understanding and analyzing data using statistical software (e.g., Python, SAS, R, Stata or others)</li>\n<li>Previous exposure to financial services, credit cards or merchant analytics is a plus, but not required</li>\n</ul>\n\nAll your information will be kept confidential according to EEO guidelines."}