{"job title": "Quantum Scientist", "company": "Booz Allen Hamilton Inc.", "city state": "– Rome, NY", "rating": "3.7", "job description": "<strong>Job Number: R0030690</strong>\n<br><br>\nQuantum Scientist<br><br>Key Role:\n<br><br>\nConduct research in quantum computing, quantum information processing, quantum algorithms, and advanced analytics. Develop and review research design, operations, and integrated project schedules and participate in strategic planning efforts. Use technical and analytical expertise to review reports and provide oral and written summaries that summarize work in a technical context. Provide background research and assistance for presented technologies.\n<br><br>\nBasic Qualifications:\n<br><br>\n-7+ years of experience with quantum information processing, quantum computing, quantum gate modeling, or superconducting or spin-based semiconductor qubit designing, gained during academic internships, doctoral or post-doctoral studies, or in the industry\n<br><br>\n-Experience with authoring peer-reviewed articles on quantum topics\n<br><br>\n-Ability to effectively communicate results to technical and non-technical audiences\n<br><br>\n-Ability to work independently on complex tasks\n<br><br>\n-Ability to obtain a security clearance\n<br><br>\n-PhD degree required\n<br><br>\nAdditional Qualifications:\n<br><br>\n-Experience with project management for scientific projects\n<br><br>\n-Experience with working in a supervisory or advisory position\n<br><br>\n-Experience with programming\n<br><br>\n-Experience with data science, including analysis, data visualization, and machine learning\n<br><br>\n-Secret clearance or higher preferred\n<br><br>\n-PhD degree in Physics, EE, Mathematics, or related technical discipline with an emphasis on quantum information research preferred\n<br><br>\nClearance:\n<br><br>\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information.\n<br><br>\nWere an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change.<br><br>DIG-AF\n<br><br>"}