{"job title": "Associate Scientist", "company": "Bristol-Myers Squibb Company", "city state": "– Devens, Massachusetts", "rating": "3.7", "job description": "Bristol-Myers Squibb is a global biopharmaceutical company whose mission is to discover, develop and deliver innovative medicines that help patients prevail over serious diseases. Around the world, we are passionate about making an impact on the lives of patients with serious disease. Empowered to apply our individual talents and ideas so that we can learn and grow together. Bristol-Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees the resources to pursue their goals, both at work and in their personal lives.\n<br><br>\nBristol-Myers Squibb is currently undergoing an expansion of its large-scale biologics manufacturing facility in Devens, Massachusetts. The expansion creates a mammalian cell biologics center of excellence through the introduction of biologics development and clinical trial manufacturing capabilities to the site. Both represent new capabilities for Devens, a site that in its early years has focused solely on large-scale, bulk biologics manufacturing.\n<br><br>\nThe Associate Scientist will be responsible for supporting development of analytical separation-based methods activities within the Biologics Process Development Group (MPD). Our group is focused on development of robust chromatographic and electrophoretic methods for protein-based therapeutic agents entering clinical trials. The role will involve development-focused experimentation and method qualification activities supporting product release testing, delivering results within project timelines, assay harmonization activities within the network groups, and evaluation of new analytical technologies. The Successful candidate will work closely with Process Development and Quality Testing groups inside and outside of the BMS network. The role is expected to interact and provide support to Process Development Analytics (PDA) and Analytical Science and Technology (AS&amp;T) team members. The successful candidate is also expected to take active role in the planning and execution of basic analytical method development, validation and verification experiments, and deliver quality analytical data for method study reports in a timely manner. The successful candidate will have excellent communication skills, be a team player, and have experience in separation techniques as they apply to Biologics and related process impurities. Techniques of particular interest include Capillary Electrophoresis, Isoelectric Focusing, Liquid Chromatography, and Gel Electrophoresis.\n<br><br>\n<strong>Responsibilities:</strong>\n<li>Develop, and evaluate bio-analytical techniques for monoclonal antibodies and recombinant proteins to support product release and stability studies</li><li>Assay support of Biologics Process Development activities</li><li>Method transfer to GxP labs, CROs and CMO</li><li>Work closely within Matrix environment to support..Process Development, Analytical Development and Testing, and AS&amp;T analytical needs and engage in long-term collaboration.</li><li>Authors and reviews technical documents and protocols; follows written scientific methods and experimental protocols, documents results, authors and reviews development and qualification summary reports.</li><li>Run tests and trend assay performances across the Network sites.</li><li>Contribute analytical perspective to PD design of experiments and AS&amp;T study protocols.</li><li>Support testing site investigations as required.</li>\nEducation Experience:\n<br><br>\nA MS in analytical chemistry, biochemistry, biophysics or related field with at least 3 years industrial experience in relevant fields."}