{"job title": "Research Scientist", "company": "Dartmouth-Hitchcock Medical Center", "city state": "– Lebanon, New Hampshire", "rating": "3.4", "job description": "Performs essential roles in the researchenterprise of individual laboratories or in providing support for broad-based institutional initiatives through roles in data analysis and assessment. In some cases, Scientists may manage individual labs, core services or analysts of institutional data that is used either internally or externally (e.g., in supportof major extramural programs).\n<br><br>\nResponsibilities: A listing of the key responsibilities.\n\n\n<ul>\n<li>Formulates and conducts independent research on problems of considerable scope and complexity in a clinical capacity across all research phases including design, execution and analysis within the scope of the project.</li>\n<li>Insures the quality and integrity of data and safe and proper management of study parameters.</li>\n<li>Explores subject area and defines scope and selection of problems for investigation through conceptually related studies or a series of projects of lesser scope.</li>\n<li>Manages and reviews preparation of study protocols, statistical analysis and study reports and produces scientific content for clinical and regulatory documents.</li>\n<li>Provides scientific expertise in an ongoing capacity for assigned organization and may supervise clinical team members.</li>\n<li>Performs other duties as required or assigned.Minimum Qualifications:</li>\n<li>Master's degree in a related field required with three (3) years of experience in specific areas of research.</li>\n<li>PhD preferred</li>\n<li>Exercises a high degree of creativity, foresight, and mature judgment in planning, organizing, and guiding scientific research programs.</li>\n<li>Requires in-depth knowledge and experience within specific area(s) of expertise.</li>\n<li>Works independently with minimal guidance.</li>\n<li>Analytical problem solving skills with demonstrated skills to define, scope and analyze complex, cross-functional problems and work in partnership with operational owners and project leaders to develop and execute all facets of project work.</li>\n<li>Excellent communication, organizational, decision-making and leadership skills with the ability to work independently and as part of a team.</li>\n<li>Must be skilled in the use of data analysis and applicable project management tools i.e., MS Project (or equivalent), Visio, SharePoint, Word, Excel, PowerPoint, Outlook. Required Licensure/Certification Skills:</li>\n<li>None</li>\n</ul>"}