{"job title": "Computer Scientist", "company": "Department of the Army", "city state": "– Alexandria, Virginia Alexandria, Virginia", "rating": "4.0", "job description": "<div>\n <ul>\n <li>\n \n Videos\n \n </li>\n </ul>\n </div>\n <div>\n <ul>\n <li>\n \n Duties\n \n <div>\n \n Help\n Help\n \n Duties\n Summary\n <div>\n <p><b>About the Position: </b><br>\n<br>\nAGC has been repeatedly named as one of the \"Best Places to Work\" in the Corps of Engineers. We are a relatively small, close knit organization that prides itself on taking care of employees. We are always looking for positive, hardworking individuals to join our team!<br>\n<br>\nThis is a Permanent Position.<br></p>\n \n Learn more about this agency\n \n </div>\n Responsibilities\n <div>\n <ul>\n <li>Practice professional level web-based design and programming.</li>\n <li>Execute professional competence in applying the theoretical foundations of computer science.</li>\n <li>Identify and employ the most advanced and affordable tools or techniques and methods for the analysis, display, and integration.</li>\n <li>Knowledge of geographic information systems, computer networks, and web data distribution.</li>\n </ul>\n </div>\n\n <div>\n Travel Required\n <p>Occasional travel - You may be expected to travel for this position.</p>\n </div>\n <div>\n <div>\n \n \n Supervisory status\n \n \n <p>\n No\n </p> </div>\n <div>\n \n \n Promotion Potential\n \n <p>\n 13\n </p> </div>\n </div>\n </div>\n </li>\n <li>\n <div>\n Job family (Series)\n <p>\n \n 1550 Computer Science\n \n </p>\n </div>\n </li>\n <li>\n \n Requirements\n \n <div>\n \n Help\n Help\n \n Requirements\n Conditions of Employment\n <ul>\n <li>Appointment may be subject to a suitability or fitness determination, as determined by a completed background investigation.</li>\n <li>This position requires you must be able to obtain and maintain a Top Secret clearance and is designated non-critical sensitive as defined in DoD 5200.2-R</li>\n <li>This position requires that you submit a Financial Disclosure Statement, OGE Form 450, Executive Branch Personnel confidential Financial Disclosure Report upon entrance to this position and annually thereafter</li>\n <li>This position is a Testing Designated Position (TDP) subject to applicant testing and random drug testing. Tentatively selected applicants will be required to sign DA Form 5019</li>\n </ul>\n <div>\n Qualifications\n\n <div>\n <strong>Who May Apply</strong>: Only applicants who meet one of the employment authority categories below are eligible to apply for this job. You will be asked to identify which category or categories you meet, and to provide documents which prove you meet the category or categories you selected. See Proof of Eligibility for an extensive list of document requirements for all employment authorities.<br>\n<br>\n<br>\n<br>\n<ul><li>Current Department of Army Civilian Employees</li><li>Current Permanent Department of Defense (DOD) Civilian Employee (non-Army)</li><li>Interagency Career Transition Assistance Plan</li><li>Non-Appropriated Fund Instrumentality (NAFI)</li><li>Non-Department of Defense (DoD) Transfer</li><li>Priority Placement Program (PPP), Program S (Military Spouse) registrant</li><li>Veterans Employment Opportunity Act (VEOA) of 1998</li></ul><br>\n<br>\n<br>\nIn order to qualify, you must meet the experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document.<br>\n<br>\n<br>\nBasic Requirement for Computer Scientist:<br>\n <br>\nDegree: Bachelor's degree (or higher degree) in computer science or bachelor's degree (or higher degree) with 30 semester hours in a combination of mathematics, statistics, and computer science. At least 15 of the 30 semester hours must have included any combination of statistics and mathematics that included differential and integral calculus.<br>\n <br>\nIn addition to meeting the basic requirement above, to qualify for this position you must also meet the qualification requirements listed below:<br>\n<br>\nSpecialized Experience: One year of specialized experience which includes knowledge of computer programming, network applications and software applications. Working knowledge and experience in software design, detailed knowledge and geographic information systems and software programming.<br>\n<br>\n<br>\nThis definition of specialized experience is typical of work performed at the second lower grade/level position in the federal service (GS 12).<br>\n<br>\nYou will be evaluated on the basis of your level of competency in the following areas:<br>\n<ul><li>Data Systems and Management</li><li>Project Management</li><li>Software Development</li></ul><br>\n<br>\nTime in Grade Requirement: Applicants who have held a General Schedule (GS) position within the last 52 weeks must have 52 weeks of Federal service at the next lower grade or equivalent (GS-12).\n </div>\n </div>\n\n <div>\n Education\n <p>\n \n </p>\n </div>\n\n\n <div>\n Additional information\n <div>\n <p></p><ul>\n\t<li>Male applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration.</li>\n\t<li>You will be required to provide proof of U.S. Citizenship.</li>\n\t<li>Two year trial/probationary period may be required.</li>\n\t<li>Direct deposit of pay is required.</li>\n\t<li>This position requires you to submit a Public Financial Disclosure Report (OGE 278) or a Confidential Financial Disclosure Report (OGE450) upon entry, and annually thereafter.</li>\n\t<li>Selection is subject to restrictions resulting from Department of Defense referral system for displaced employees.</li>\n\t<li>If you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet.</li>\n\t<li>This is a Career Program (CP) 14 position</li>\n\t<li>Salary includes applicable locality pay or Local Market Supplement.</li>\n\t<li>Interagency Career Transition Assistance Program (ICTAP). If you are a Federal employee in the competitive service and your agency has notified you in writing that you are a displaced employee eligible for ICTAP consideration, you may receive selection priority. To receive selection priority for this position, you must: (1) meet ICTAP eligibility criteria; (2) be rated well-qualified for the position with a score of 90 or above; and, (3) submit the appropriate documentation to support your ICTAP eligibility. Additional information about the program is on OPM's Career Transition Resources website.</li>\n\t<li>If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.</li>\n</ul><p></p>\n </div>Read more\n \n </div>\n\n <div>\n How You Will Be Evaluated\n <div>\n <p>You will be evaluated for this job based on how well you meet the qualifications above.</p>\n <p>\n Once the announcement has closed, a review of your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine whether you meet the qualification requirements listed on this announcement. If you are minimally qualified, your résumé and supporting documentation will be compared against your responses to the assessment questionnaire to determine your level of experience. If, after reviewing your résumé and/or supporting documentation, a determination is made that you have inflated your qualifications and/or experience, you may lose consideration for this position. Please follow all instructions carefully when applying, errors or omissions may affect your eligibility.<br>\n <br>\nYou should list any relevant performance appraisals and incentive awards in your resume as that information may be taken into consideration during the selection process. If selected, you may be required to provide supporting documentation.\n </p>\n <p></p>\n </div>Read more\n\n <div>\n Background checks and security clearance\n <div>\n <div>\n Security clearance\n <p>\n \n Top Secret/SCI\n \n </p>\n </div>\n\n <div>\n Drug test required\n <p>\n Yes\n </p>\n </div>\n </div>\n </div>\n </div>\n </div>\n </li>\n <li>\n \n Required Documents\n \n <div>\n \n Help\n Help\n \n Required Documents\n <div>\n <p>\n The documents you are required to submit vary based on the authority you are using to apply (i.e., applying as a veteran, applying as a current permanent Federal employee, applying as a reinstatement, etc). Please review the following links to see which documents you need to provide to prove your eligibility to apply: Applicant Merit Checklist and Proof of Eligibility.<br>\n<br>\nAs described above, your complete application includes your resume, your responses to the online questionnaire, and documents which prove your eligibility to apply.<strong> If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further.<br>\n<br>\n1. Your resume:</strong>\n\n</p><ul>\n\t<li>Your resume may be submitted in any format and must support the specialized experience described in this announcement.</li>\n\t<li>If your resume includes a photograph or other inappropriate material or content, it will not be used to make eligibility and qualification determinations and you may not be considered for this vacancy.</li>\n\t<li>For qualifications determinations your resume must contain hours worked per week and the dates of employment (i.e., HRS per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application will be marked as incomplete and you will not receive consideration for this position.</li>\n\t<li>For additional information see: What to include in your resume.</li>\n</ul>\n<br>\n2. Other <strong>supporting documents:</strong>\n\n<ul>\n\t<li>Cover Letter, optional</li>\n\t<li>Most recent Performance Appraisal, if applicable</li>\n\t<li><strong>Proof of Eligibility to Apply: </strong>Your application must include the documents which <strong>prove you are eligible to apply</strong> for the vacancy. The Proof of Eligibility document describes authorities commonly used in merit promotion recruitment and what document(s) are required to prove you meet the requirements of the authority. You must meet the requirements of at least one of the authorities listed in the <strong>Who May Apply</strong> section above to receive further consideration.</li>\n\t<li><strong>Time-in-grade documentation: </strong>If you are applying for a higher grade and your SF-50 has an effective date within the past year, it may not clearly demonstrate you meet the one year time-in-grade requirement so you will need to provide an SF-50 which clearly demonstrates you meet the time-in-grade requirements (examples of appropriate SF-50s include Promotions, Within-grade Grade/Range Increases, and SF-50s with an effective date more than one year old).</li>\n</ul>\nNOTE: Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove another person's personal information before you submit your application. You may be asked to provide an un-sanitized version of the documents if you are selected to confirm your eligibility.\n <p></p>\n <div>\n \n If you are relying on your education to meet qualification requirements:\n \n <p>\n Education must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and/or degrees from\n schools accredited by accrediting institutions recognized by the U.S. Department of Education.\n </p>\n <p>\n Failure to provide all of the required information as stated in this vacancy announcement may result in an ineligible rating or may affect the overall rating.\n </p>\n </div>\n </div>\n </div>\n </li>\n <li>\n \n Benefits\n \n <div>\n \n Help\n Help\n \n Benefits\n <div>\n <p></p>\n <p>\n Review our benefits\n </p>\n </div>\n </div>\n </li>\n <li>\n \n How to Apply\n \n <div>\n \n Help\n Help\n \n How to Apply\n <div>\n <p>To apply for this position, you must complete the online questionnaire and submit the documentation specified in the Required Documents section below.<br>\n<br>\nThe complete application package must be submitted by 11:59 PM (EST) on 09/14/2018 to receive consideration.\n</p><ul>\n\t<li>To begin, click <strong>Apply </strong>to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application (https://apply.usastaffing.gov/ViewQuestionnaire/10298679).</li>\n\t<li>Follow the prompts to <strong>select your résumé and/or other supporting documents </strong>to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process.</li>\n</ul>\n\n<ul>\n\t<li>After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and <strong>click to continue with the application process</strong>.</li>\n\t<li>You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. <strong>You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete.</strong></li>\n\t<li>It is your responsibility to verify that your application package (resume, supporting documents, and responses to the questionnaire) is complete, accurate, and submitted by the closing date. Uploaded documents may take up to one hour to clear the virus scan.</li>\n\t<li>Additional information on how to complete the online application process and submit your online application may be found on the USA Staffing Applicant Resource Center.</li>\n</ul>\nTo verify the status of your application, log into your USAJOBS account https://my.usajobs.gov/Account/Login), all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/.<br>\n<br>\n<strong>If you submit an inquiry to the e-mail address listed in the Agency Contact Information below please identify the announcement number of the position in the subject line of the e-mail. This will expedite a response to your inquiry.</strong><p></p>\n </div>Read more\n \n <div>\n Agency contact information\n \n Army Applicant Help Desk\n\n Army Applicant Help Desk\n \n\n <div>\n <div>\n Phone\n <p>\n (000)000-0000\n </p>\n\n\n Email\n <p>\n \n USARMY.APG.CHRA-NE.MBX.APPLICANTHELP@MAIL.MIL\n \n </p>\n </div>\n <div>\n Address\n <p>\n </p>\n FL-APF-W6RNAA US ARMY GEOSPATIAL CENTER<br>\n DO NOT MAIL<br>\n APO,\n AP \n 96271<br>\n US\n \n </div>\n </div>\n \n Learn more about this agency\n \n </div>\n\n Next steps\n <div>\n <p>\n If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility, qualifications, and quality ranking for this position. If you are determined to be ineligible or not qualified, your application will receive no further consideration.\n </p>\n </div>Read more\n </div>\n </li>\n <li>\n \n Fair &amp; Transparent\n \n <div>\n Fair &amp; Transparent\n <p>\n The Federal hiring process is setup to be fair and transparent. Please read the following guidance.\n </p>\n Equal Employment Opportunity Policy\n <div>\n <p>\n The United States Government does not discriminate in employment on the basis of race, color, religion, sex (including pregnancy and gender identity), national origin, political affiliation, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service, or other non-merit factor.\n </p>\n <ul>\n <li>\n \n Equal Employment Opportunity (EEO) for federal employees &amp; job applicants\n \n </li>\n </ul>\n </div>Read more\n Reasonable Accommodation Policy\n <div>\n <p>\n Federal agencies must provide reasonable accommodation to applicants with disabilities where appropriate. Applicants requiring reasonable accommodation for any part of the application process should follow the instructions in the job opportunity announcement. For any part of the remaining hiring process, applicants should contact the hiring agency directly. Determinations on requests for reasonable accommodation will be made on a case-by-case basis.\n </p>\n <p>\n A reasonable accommodation is any change to a job, the work environment, or the way things are usually done that enables an individual with a disability to apply for a job, perform job duties or receive equal access to job benefits.\n </p>\n <p>\n Under the Rehabilitation Act of 1973, federal agencies must provide reasonable accommodations when:\n\n </p><ul>\n <li>An applicant with a disability needs an accommodation to have an equal opportunity to apply for a job.</li>\n <li>An employee with a disability needs an accommodation to perform the essential job duties or to gain access to the workplace.</li>\n <li>An employee with a disability needs an accommodation to receive equal access to benefits, such as details, training, and office-sponsored events.</li>\n </ul>\n <p></p>\n <p></p>\n <p>\n You can request a reasonable accommodation at any time during the application or hiring process or while on the job. Requests are considered on a case-by-case basis.\n </p>\n <p>\n Learn more about disability employment and reasonable accommodations or how to contact an agency.\n </p>\n\n\n </div>Read more\n\n Legal and regulatory guidance\n <ul>\n <li>\n Financial suitability\n </li>\n <li>\n \n Social security number request\n \n </li>\n <li>\n \n Privacy Act\n \n </li>\n <li>\n \n Signature and false statements\n \n </li>\n <li>\n \n Selective Service\n \n </li>\n <li>\n \n New employee probationary period\n \n </li>\n </ul>\n </div>\n </li>\n </ul>\n </div>\n\n\n <p>\n This job originated on www.usajobs.gov. For the full announcement and to apply,\n visit www.usajobs.gov/GetJob/ViewDetails/509603400.\n Only resumes submitted according to the instructions on the job announcement listed at www.usajobs.gov will be considered.\n </p>"}