{"job title": "Quantitative Analyst", "company": "DTCC", "city state": "– Dallas, TX", "rating": "3.6", "job description": "<div><div><div><div><div><div><strong>Business Unit:</strong> Group Chief Risk Office</div>\n<br>\n<div><strong>Department:</strong> Quantitative Risk Management - QRM</div>\n<br>\n<div><strong>Job Family:</strong> Oversight and Control</div> \n<br>\n<div><strong>Job Title:</strong> Quantitative Analyst</div>\n<br>\n<div><strong>Corporate Title:</strong> Senior Associate</div>\n<br>\n<div><strong>FLSA Code (US Only):</strong> Exempt</div>\n\n<br><strong><div>Business Unit Description:</div>\n<br>\n</strong><br>\n\n<div>Our Risk Management teams work to protect the safety and soundness of our systems and are responsible for identifying, managing, measuring and mitigating a spectrum of key risk types including credit, market, liquidity, systemic, operational and technology in all existing and new products, activities, processes and systems.</div>\n\n<br><strong><div>Position Summary:</div>\n<br>\n</strong><br>\n\n<div>The candidate is primarily responsible for designing, developing, testing, and maintaining stress test models or tools and performing Stress Test related analyses and reporting.</div>\n\n<br><strong><div>Specific Responsibilities:</div>\n<br>\n</strong>\n<br>\n<div>\n\n\n<ul>\n<li>Design and implement stress testing scenarios</li>\n<li>Perform analytical analysis such as attribution analysis to explain stress testing risk metrics results</li>\n<li>Conduct quality assurances and controls on data</li>\n<li>Maintain stress testing related functions in QRM’s Production System, including setting up scheduled jobs to perform stress testing calculations</li>\n<li>Mitigates risk by following established procedures and monitoring controls, spotting key errors and demonstrating strong ethical behavior.</li> </ul></div>\n\n<br><strong><div>Leadership Competencies for this level include:</div>\n<br>\n</strong>\n<br>\n<div>\n\n\n<ul>\n<li><strong>Feedback:</strong> Seeks feedback from others, provides feedback to others in support of their development, and is open and honest while dealing constructively with criticism.</li> \n\n<li><strong>Delegating:</strong> Effectively manages tasks and people, taking a practical approach to determine the most effective method of execution while respecting others’ expertise and considering others’ feelings and working styles.</li> \n\n<li><strong>Inclusive Leadership:</strong> Values individuals and embraces diversity by integrating differences and promoting diversity and inclusion across teams and functions.</li> \n\n<li><strong>Team Building:</strong> Builds teams by quickly establishing relationships and drives a team identity and shared purpose based on diversity of thought, skills and personalities.</li> </ul></div>\n\n<br><strong><div>Qualifications:</div>\n<br>\n</strong>\n<br>\n<div>\n\n\n<ul>\n<li>Minimum of 5 years of related experience; minimum 2 years of quantitative financial engineering / data analysis / modeling experience</li>\n<li>Proficiency with Statistical programs and SQL desired</li>\n<li>Knowledge of other languages such as Visual Basic, Python a plus</li>\n<li>Bachelor's degree; Masters preferred or equivalent experience</li></ul></div>\n\n<br><strong><div>About DTCC:</div>\n<br>\n</strong><br>\n\n<div>With over 40 years of experience, DTCC is the premier post-trade market infrastructure for the global financial services industry. From operating facilities and data centers around the world, DTCC automates, centralizes, and standardizes the processing of financial transactions across the trade lifecycle and mitigates risk for thousands of institutions worldwide.</div><br>\n\n<div>At DTCC we value on our clients' interests and partner to deliver superior results with excellence and innovation and lead with integrity. We proactively develop your potential and invest in your career.</div>\n</div>\n</div>\n </div>\n </div>\n</div>\n<br>"}