{"job title": "Field Scientist", "company": "ICF", "city state": "– Annapolis, MD", "rating": "3.6", "job description": "Working at ICF\n<br><br>\nWorking at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you?re seeking to make a difference in the world, visit www.icf.com/careers to find your next career. ICF?together for tomorrow.\n<br><br>\nLooking for a Field Scientist professional to conduct audits of state and local ambient air monitoring stations who will be responsible for measurement of air pollution parameters including particulate matter (PM2.5), ozone, sulfur dioxide (SO2), Nitrogen dioxide (NO2) and other related pollutants.\n<br><br>\nThe position is located at Fort Meade in Maryland.\n<br><br>\nYou must have or be able to obtain authorization for access to Fort Meade and U.S. Environmental Protection Agency Environmental Science Center.\n<br><br>\nYou will be part of a team of chemists and technicians that also provides laboratory analysis and other quality assurance support through EPA Region 3.\n<br><br>\n<strong>Key Responsibilities:</strong>\n\n\n<ul>\n<li>Travel, including overnight travel, within EPA Region 3 (MD, DC, DE, VA, WV, and PA) is required. Travel requires extensive driving with provided vehicle. Travel is expected to be required as much as 50% of the time</li>\n<li>Collect particulate matter filter samples and ship to laboratories for PM2.5 and Lead analysis</li>\n<li>Utilize instrumentation to provide on-site analysis of air parameters including ozone, NO2, SO2, and other related pollutants</li>\n<li>Maintain, repair, and operate air sampling and analysis equipment</li>\n<li>Coordinate with state and local air monitoring operators to schedule side-by-side testing to audit their operations</li>\n<li>Understand basic laboratory and sampling procedures including Chains of Custody, clean techniques to prevent contamination, and safe work practices</li>\n<li>Conduct sampling and analysis in strict accordance with required protocols</li>\n<li>Prepare written reports using MS Word</li>\n<li>Utilize MS Excel to present and analyze air data</li>\n<li>Review the reports and Excel spreadsheets of others</li>\n<li>Support Region 3 analytical laboratory work performed in the EPA Environmental Science Center laboratory as needed. Basic Qualifications:</li>\n<li>Bachelor's degree in scientific discipline, or equivalent</li>\n<li>1-3 years of relevant experience</li>\n<li>Have good driving record and valid driver?s license. Able to drive distances to reach Region 3 air monitoring sites</li>\n<li>Able to lift and carry 40 pounds, use ladders and work comfortably at heights are required</li>\n<li>Able to pass field Health and Safety training and annual Medical Monitoring</li>\n<li>US Citizenship or Permanent Resident status</li>\n</ul>\n\n<strong>Preferred Skills/Experience:</strong>\n\n\n<ul>\n<li>40 hour HAZWOPER training and other related safety training</li>\n<li>Air sampling, auditing or knowledge of EPA PEP, Pb-PEP, and NPAP/TTP programs</li>\n<li>Mechanical capabilities to operate and care for analytical instrumentation - Demonstrated ability to work independently</li>\n<li>Excellent verbal, interpersonal and written communication skills</li>\n<li>Strong organizational skills and able to meet deadlines</li>\n<li>Experience working at DoD, EPA or other Federal facilities</li>\n</ul>\n\nAbout ICF\n<br><br>\nICF (NASDAQ:ICFI) is a global consulting and technology services provider with more than 5,000 professionals focused on making big things possible for our clients. We are business analysts, policy specialists, technologists, researchers, digital strategists, social scientists and creatives.\n<br><br>\nSince 1969, government and commercial clients have worked with ICF to overcome their toughest challenges on issues that matter profoundly to their success.\n<br><br>\nICF offers an excellent benefits package, an award winning talent development program, and fosters a highly skilled, energized and empowered workforce. ICF is an equal opportunity employer that values diversity at all levels. (EEO/AA ? Minorities/Females/Veterans/Individuals with Disabilities)\n<br><br>\nMaryland Client Office (MD88)\n<br><br>\nAbout ICFICF (NASDAQ:ICFI) is a global consulting and technology services provider with more than 5,000 professionals focused on making big things possible for our clients. We are business analysts, policy specialists, technologists, researchers, digital strategists, social scientists and creatives. Since 1969, government and commercial clients have worked with ICF to overcome their toughest challenges on issues that matter profoundly to their success. Come engage with us at icf.com."}