{"job title": "Principal Scientist", "company": "ICON Clinical Research", "city state": "– Whitesboro, NY", "rating": "3.3", "job description": "Are you interested in assisting in the day-to-day activities of the bioanalytical laboratory including responsibility for developing and performing assays on biological samples from pre-clinical and clinical trials? We currently have a position available for a protein bioanalytical mass spectrometrist in our Whitesboro, NY facility.\n\n\n<ul>\n<li>*</li>\n<li>Principal Scientist role within ICON: *</li>\n</ul>\n\nICON has a strong reputation in our approaches to clinical development. We apply scientific and operational excellence across all phases of clinical trial outsourcing services for our clients. We work with top pharmaceutical organizations on emerging therapeutic areas which include, but are not limited to oncology, diabetes, CNS, cardiovascular and pain. We are presently in over 40 countries with over 80 offices worldwide and over 13K employees globally.\n<br><br>\nThe Principal Scientist will design, develop, and validate bioanalytical methods for the quantification of peptide and protein novel chemical entities (NCEs) in tissues and biological fluids using LC-MS/MS techniques. In addition, the Principal Scientist will operate, maintain, and troubleshoot the LC-MS/MS systems. The Principal Scientist will use the validated methods for routine batch analysis meeting FDA and international regulatory GLP and GCP standards. The Principal Scientist will be responsible for training others in the operation of instrumentation and the conduct of the validated assays.\n\n\n<ul>\n<li>Benefits of working at ICON:*</li>\n</ul>\n\nIn addition to partnering with the top pharmaceutical and biotech companies in the world to participate in the development of new medicines at all stages of drug development, we offer a strong benefits package that includes a comprehensive health plan, retirement plans, competitive pay, bonus plans, vacation, and other incentives.\n\n\n<ul>\n<li>To succeed you will need:*</li>\n</ul>\n\nWe are seeking candidates with a Doctorate in Biochemistry, Analytical Chemistry, Pharmaceutical or Biotechnological Science.\n<br><br>\nTo be successful you will be expected to maintain high quality in a fast paced and collaborative environment, have excellent written and verbal communication skills, including presentation of data, and author technical and regulatory documents. Hands-on experience with LC-MS/MS instrumentation and quantification of peptides and proteins is required. Experienced in chromatographic techniques for separation of peptides and proteins is expected. In addition, experience with proteolytic digestion of proteins and peptide mapping is required. Familiarity with Sciex triple quadrupole instruments and associated software (i.e. Analyst and MultiQuan) is preferred. Previous experience in a GLP bioanalytical laboratory is advantageous, but not required.\n<br><br>\nWe invite you to review our opportunities at www.iconplc.com/careers.\n\n\n<ul>\n<li>What?s Next?*</li>\n</ul>\n\nFollowing your application you will be contacted by one of our dedicated recruiters and if successful we will be able to provide you with more details about this opportunity.\n\n\n<ul>\n<li>ICON is an equal opportunity employer - M/F/D/V and committed to providing a workplace free of any discrimination or harassment.*</li>\n</ul>"}