{"job title": "Data Science - Policy &amp; Configuration", "company": "Oscar Insurance", "city state": "– New York", "rating": "4.1", "job description": "Data Science - Policy &amp; Configuration<div>New York</div><div>As an insurer, we have unique insight into the flow of information through the healthcare system. Oscar’s data team is responsible for ensuring that we leverage this unique informational advantage throughout our organization. From disease modeling to risk management to provider contracting to consumer transparency, we want to use data and analytics to change the way the healthcare system works.\n<br><br>\nResponsibilities:\n\n<ul>\n<li>Be(come) an expert on healthcare - and apply that expertise to make the entire system better.</li>\n<li>Solve core business problems in systematic and data-driven ways.</li>\n\n\n<ul>\n<li>Understand and create policies that impact how we pay claims and ensure we have structured, scalable approaches as we grow.</li>\n<li>Build the apparatus to manage the complexities of running an operationally and regulatory intensive business seamlessly.</li> \n</ul>\n\n<li>Work with other data team members, product managers and engineers to develop beautiful and data-driven tools to help our members understand and navigate the healthcare system.</li>\n</ul>\nAbout you:\n\n<ul>\n<li>You are passionate about breaking down and understanding complex systems.</li>\n<li>You are a strong critical thinker who thrives working with both technical and non-technical people.</li>\n<li>You aren’t afraid of messy data, and excel at structuring and building analytical systems.</li>\n<li>You know how to get things done in a modern data science stack - you have strong SQL skills, experience with data wrangling and script writing (we primarily use Python/pandas) and an appreciation for beautiful data visualization (we’ve mostly been using D3, Seaborn and Periscope).</li>\n<li>You see data science as a powerful tool to get things done rather than as an end in itself.</li>\n<li>You get excited about taking ownership of problems and solving them in a fast-paced and scrappy environment.</li>\n</ul>\nMost data scientists at Oscar have a strong analytical background from a top university, a few years of experience in industries such as finance or consulting, and/or an advanced degree in a quantitative field. That being said, we have no hard criteria in terms of prior experience - we are looking for the most talented and productive people we can find to join us and help change healthcare.\n<br><br>\nAt Oscar, being an Equal Opportunity Employer means more than upholding discrimination-free hiring practices. It means that we work to cultivate an environment where exceptional people can be their most authentic selves and find both belonging and support. We're on a mission to change healthcare -- an experience made whole by your unique background and perspectives.\n<br><br>\n<strong>Pay Transparency Policy: Oscar's Pay Transparency Policy ensures that you won't be discharged or discriminated against based on whether you've inquired about, discussed, or disclosed your pay. Read the full policy here.</strong></div>"}