{"job title": "Senior Scientist", "company": "Raytheon", "city state": "– ", "rating": "3.7", "job description": "Senior Scientist\n<br><br>\n05-Sep-2018\n<br><br>\n<strong>Business</strong>\n<br>\nSpace And Airborne Systems\n<br><br>\n<strong>Job Description</strong>\n<br>\nU.S. Citizenship status is required as this position needs an active U.S. Security Clearance as of day one of employment.\n<br><br>\nRaytheon BBN Technologies (BBN) is the research company behind many revolutionary advances that we take for granted today. BBN is where email and the first routers were invented. Today, BBN's scientists and engineers are working to advance the state-of-the-art in topics ranging from machine language translation to quantum cryptography. BBN offers the opportunity to perform exciting and revolutionary research and engineering that solves important problems in a collaborative environment. BBN fosters an exceptional work environment with knowledgeable co-workers and offers excellent performance-based bonus incentives and generous retirement contributions.\n<br><br>\nLocated in Arlington, VA, our Information Exploitation group is seeking talented software engineers and scientists interested in designing, prototyping, developing, and deploying advanced systems and algorithms using Data Science and Analytics, Semantic Web Technologies, and Machine Reasoning and Machine Learning to solve challenging DoD and IC problems. Our ideal candidate will have experience in machine reasoning, semantic web technologies, data analytics, or artificial intelligence technologies and will have strong Java development experience.\n<br><br>\nOur applied software research uses cutting edge technologies to build both prototype and operational systems. You will tackle significant challenges, including:\n\n\n<ul>\n<li>Serving as principal investigator or technical lead for IC and DoD programs</li>\n<li>Researching and publishing novel solutions to complex, open-ended intelligence problems</li>\n<li>Developing and analyzing complex data models and ontologies</li>\n<li>Devising algorithms for co-reference resolution, complex event processing, similarity measures, etc.</li>\n<li>Optimizing systems’ knowledge representation, storage, and query for high performance</li>\n<li>Developing REST-ful analytic and management services as part of large-scale web applications</li>\n</ul>\n\n<strong>Required Education and Experience:</strong>\n\n\n<ul>\n<li>BS in Computer Science or equivalent discipline and 11 years of experience; or MS in Computer Science or equivalent discipline and 9 years of experience; or Ph.D. in Computer Science or equivalent discipline and 6 years of experience</li>\n<li>Desire and demonstrated ability to lead small teams in the performance of IC and DoD programs</li>\n<li>Proficiency in Java and its development ecosystem</li>\n<li>Active Top Secret security clearance are required.</li>\n</ul>\n\n<strong>Desired Skills and Education:</strong>\n\n\n<ul>\n<li>BS and 15 years of experience; MS and 12 years; PhD and 6 years</li>\n<li>TS/SCI highly desired</li>\n<li>Experience with knowledge representation, semantic graphs, and Semantic Web technologies (RDF, OWL, SPARQL)</li>\n<li>Experience with logic programming (XSB Prolog or Flora-2) or other rule-based systems for knowledge representation and reasoning</li>\n<li>Experience with probabilistic reasoning, machine learning, or big data</li>\n<li>Experience gathering requirements and implementing large software systems with minimal guidance</li>\n<li>Experience with Web application development and agile development methodology</li>\n</ul>\n\n<strong>Requisition ID</strong>\n<br>\n<strong>122902BR</strong>\n<br><br>\n<strong>Business Unit Profile</strong>\n<br>\nRaytheon Space and Airborne Systems (SAS) builds radars and other sensors for aircraft, spacecraft and ships. The business also provides communications and electronic warfare solutions and performs research in areas ranging from linguistics to quantum computing. SAS is headquartered in McKinney, Texas USA. As a global business, our leaders must have the ability to understand, embrace and operate in a multicultural world -- in the marketplace and the workplace. We strive to hire people who reflect our communities and embrace diversity and inclusion to advance our culture, develop our employees, and grow our business.\n<br><br>\nRaytheon is headquartered in Waltham, Massachusetts. Follow us on Twitter.\n<br><br>\n<strong>Clearance Type</strong>\n<br>\nTop Secret - Current\n<br><br>\n<strong>Relocation Eligible</strong>\n<br>\nYes\n<br><br>\n<strong>Expertise</strong>\n<br>\nComputer Science, Research &amp; Development\n<br><br>\n<strong>Work Location</strong>\n<br>\nVA - Rosslyn\n<br><br>\n<strong>Type Of Job</strong>\n<br>\nFull Time\n<br><br>\n<strong>Posting Title</strong>\n<br>\nSenior Semantic Web Developer and Technical Lead\n<br><br>\n<strong>Job Function</strong>\n<br>\nEngineering &amp; Sciences\n<br><br>\n<strong>U.S. FLSA Classification</strong>\n<br>\nExempt\n<br>"}