{"job title": "Data Analyst (aka Data Wrangler)", "company": "St. Jude Children's Research Hospital", "city state": "– Memphis, TN", "rating": "4.7", "job description": "Overview<br>\n\n<div>\n<div>As the \"Data Wrangler,\" you will collect and analyze significant amounts of data that can be used to discover better treatments and cures for catastrophic childhood illnesses. The Department of Epidemiology &amp; Cancer Control has an additional interest in the study of long-term effects of such illnesses and their treatment. In this position, you will serve as a member of our Databases and Systems team alongside an existing data specialist. Your responsibilities include integrating, assembling, manipulating, summarizing, and disseminating data from numerous disparate system in support of our survivorship research teams. In addition, you communicate with clinicians, epidemiologists, behavioral scientists, statisticians, and other interested staff concerning various study data points. You will use SAS daily and should be familiar with Tableau, SQL and/or R. Take the first step to join our team by applying now.</div>\n</div>\n\n<br>Minimum Education<br>\n\n<div>\n<div>\n\n\n<ul>\n<li>Bachelor's degree required</li>\n<li>Bachelor's degree in health sciences, computer science or related field preferred</li>\n</ul>\n\n</div>\n</div>\n\n<br>Minimum Experience<br>\n\n<div>\n<div>\n\n\n<ul>\n<li>Two (2) years of experience in database analysis design involving experience with database and software validation, current querying tools and knowledge of relational database structures and methodologies required</li>\n<li>Clinical database experience preferred</li>\n</ul>\n\n</div>\n</div>\n\n<br>EEO Statement<br>\n\n<div>\n<div>St. Jude is an Equal Opportunity Employer<br><br>No Search Firms:<br><br>St. Jude Children's Research Hospital does not accept unsolicited assistance from search firms for employment opportunities. Please do not call or email. All resumes submitted by search firms to any employee or other representative at St. Jude via email, the internet or in any form and/or method without a valid written search agreement in place and approved by HR will result in no fee being paid in the event the candidate is hired by St. Jude.</div>\n</div><br>\n\n<div>\n<div>\nWe're breaking new ground at St. Jude. Stay up-to-date on our latest news and career opportunities in the areas you're most interested in by becoming a St. Jude Careers Insider.\n<br><br>\nSearch all St. Jude Jobs, including postdoctoral research fellowships, clinical fellowships and faculty appointments.</div>\n</div>\n<br>"}