{"job title": "Market Impact Quantitative Analyst", "company": "Two Sigma", "city state": "– New York, New York, United States", "rating": "3.6", "job description": "Researchers at Two Sigma are the explorers and the dreamers of what's possible and what's next.\n<br><br>\nThey delve into the vast sea of data in the pursuit of truth. Guided by the scientific method and driven to unearth the new, they devise models that begin with inspired ideas or economic hypotheses. In a systematic, process-driven fashion, these models are expanded, tested, and, if successful, integrated into our investment portfolios. These models seek to predict the future and provide a market edge.\n<br><br>\nAt Two Sigma, research and technology are united as one. Our scientific bent and commitment to staying at the forefront of technological advancement enable our researchers to continuously investigate the hardest problems and analyze the most formidable data sets, with speed and precision.\n<br><br>\nResearchers at Two Sigma are passionate about model building, data analysis, and the possibilities that they hold for exploration, insight, and illumination. We seek individuals who are curious, intellectually driven, practical, and purposeful. Our team is comprised of a diverse set of empirical and imaginative thinkers – eager to mix quantitative discipline with creative problem solving.\n<br><br>\nThis role sits within the Execution Modeling team and is responsible for preparing execution data sets, owning the data management process, and analyzing and fitting transaction cost models.\n<br><br>\nRequirements Include:\n<ul>\n<li>An advanced degree (Masters or PhD) in quantitative disciplines.</li><li>Strong programming skills preferably in Java, C, C++ or Python.</li><li>Solid statistical knowledge and familiarity with packages such as R, pandas, SAS or Matlab.</li><li>Experience working with large data sets and building predictive models.</li><li>Experience working with transaction cost analysis or market impact modeling and authoring of white papers in these areas a plus.</li>\n</ul>"}