{"job title": "Staff Scientist", "company": "Vanderbilt University Medical Center", "city state": "– TN-Nashville", "rating": "3.6", "job description": "<div><b><u>Discover Vanderbilt University Medical Center:</u></b></div>\n<div>Located in Nashville, Tennessee, and operating at a global crossroads of teaching, discovery and patient care, VUMC is a community of individuals who come to work each day with the simple aim of changing the world. It is a place where your expertise will be valued, your knowledge expanded and your abilities challenged. It is a place where your diversity — of culture, thinking, learning and leading — is sought and celebrated. It is a place where employees know they are part of something that is bigger than themselves, take exceptional pride in their work and never settle for what was good enough yesterday. <b>Vanderbilt’s</b> mission is to advance health and wellness through preeminent programs in patient care, education, and research.</div>\n<div> </div>\n<div>Click Here To View The VUMC Promise of Discovery</div><br><br><b>JOB SUMMARY:</b><br>Assists the Principal Investigator with grant and manuscript preparation. Independently carry out and design highly sophisticated and independent experiments. Mentor and train graduate students and post doctoral fellow in developing their research projects.<br><br><br><b>KEY RESPONSIBILITIES:</b> \n<p>\n</p>\n<p>• Independently oversee research projects and perform near to totally independent research.</p>\n<p>• Process and analyze genomic and transcriptomic data generated using next-generation sequencing and high-density genotyping arrays</p>\n<p>• Search for relevant genomic and other –omics data publicly available and submit relevant applications to obtain these datasets for research</p>\n<p>• Harmonize multi-omics data from multiple sources for research</p>\n<p>• Maintain large genomic and other –omics datasets for a large research program</p>\n<p>• Prepare manuscripts for publication</p>\n<p>• Supervise, plan, design and implement research projects</p>\n<p>• Establish highly complex protocol(s); define data collection, evaluation and analysis procedures</p>\n<p>• Contribute to research so as to merit serving as author or co-author on research publications, etc.</p>\n<p>• Assist principal investigators in writing research grants and contract proposals</p>\n<p>• Assist PIs in manuscript preparation for scientific journals.</p>\n<p>• Present research findings as needed</p>\n<p>• Train and supervise technical staff, medical and graduate students</p>\n<p> </p>\n<div><b><u>VUMC Recent Accomplishments</u></b></div>\n<div>Because we are committed to providing the best in patient care, education and research, we are proud of our recent accomplishments:</div>\n<div> </div>\n<ul>\n<li>\n<div><strong>US News &amp; World Report:</strong> #1 Hospital in Tennessee, #1 Health Care Provider in Nashville, #1 Audiology (<b>Bill Wilkerson Center</b>), 12 adult and 10 pediatric clinical specialties ranked among the nation's best, #15 Education and Training</div></li>\n<li>\n<div><strong>Truven Health Analytics:</strong> among the top 50 cardiovascular hospitals in the U.S.</div></li>\n<li>\n<div><strong>Becker's Hospital Review:</strong> one of the \"100 Greatest Hospitals in America\"</div></li>\n<li>\n<div><strong>The Leapfrog Group:</strong> grade \"A\" in Hospital Safety Score</div></li>\n<li>\n<div><strong>National Institutes of Health:</strong> among the top 10 grant awardees for medical research in the US</div></li>\n<li>\n<div><strong>Magnet Recognition Program:</strong> Vanderbilt nurses are the only group honored in Tennessee</div></li>\n<li>\n<div><strong>Nashville Business Journal:</strong> Middle Tennessee's healthiest employer</div></li>\n<li>\n<div><strong>American Hospital Association:</strong><b> </b>among the 100 \"Most Wired\" medical systems in the US</div></li></ul><br><br>\n<br>Doctorate/PhD (or equivalent experience) and 2 years experience \n<ul><br><br><b>Physical Requirements/Strengths needed &amp; Physical Demands:</b><br><br>\n <br><br><b>Movement</b><br><br>\n<ul>\n<li>Occasional: Sitting: Remaining in seated position</li>\n<li>Occasional: Standing: Remaining on one's feet without moving.</li>\n<li>Occasional: Walking: Moving about on foot.</li>\n<li>Occasional: Lifting under 35 lbs: Raising and lowering objects under 35 lbs from one level to another</li>\n<li>Occasional: Push/Pull: Exerting force to move objects away from or toward.</li>\n<li>Occasional: Bending/Stooping: Trunk bending downward and forward by bending spine at waist requiring full use of lower extremities and back muscles</li>\n<li>Occasional: Reaching below shoulders: Extending arms in any direction below shoulders.</li>\n<li>Occasional: Handling: Seizing, holding, grasping, turning or otherwise working with hand or hands.</li></ul><br><br><b>Sensory</b><br><br>\n<ul>\n<li>Occasional: Vision: Clarity of near vision at 20 inches or less and far vision at 20 feet or more with depth perception, peripheral vision, color vision.</li>\n<li>Frequent: Noise: May include exposure to occupational noise levels which equal or exceed an 8-hr time-weighted average of 85 decibels, requiring enrollment in VUMC's Hearing Conservation Program which includes training, use of hearing protection, and periodic audiometry.</li>\n<li>Continuous: Communication: Expressing or exchanging written/verbal/electronic information.</li></ul><br><br><b>Environmental Conditions</b><br><br>\n </ul>"}