{"job title": "Research Scientist", "company": "Western Digital Corporation", "city state": "– Milpitas, CA", "rating": "3.3", "job description": "<p><b>Description</b> </p> <div>\n<div>Western Digital®</div>\n<div> </div>\n<div>We deliver the possibilities of data. <b>YOU</b> define what’s possible.</div>\n<ul>\n<li>The job opening is for a full-time Research Staff Member. </li>\n<li>Research field includes machine learning / artificial intelligence, advanced semiconductor packaging technology, high performance computing hardware, storage system hardware, and thermal management. </li>\n<li>Our goal is development of revolutionary technologies with long time horizon (5-10 years), thus, ability to devise innovative ideas is essential. </li>\n<li>The individual is expected to carry out research projects in these fields both as an individual researcher and as a team member. </li></ul>\n<p> </p>\n<div>\n<div>\n<div>\n<div></div>\n<p>Qualification:</p>\n<ul>\n<li>\n<div>Ph.D. degree in Electrical Engineering, mechanical engineering, Computer Science or closely related field, or master’s degree with extensive industrial experience.</div></li>\n<li>\n<div>The candidate should have expertise in one or more of the following areas:</div></li>\n<ul>\n<li>\n<div>Machine learning / artificial intelligence</div></li>\n<li>\n<div>Semiconductor packaging technology.</div></li>\n<li>\n<div>High-speed interconnect (electrical and/or optical).</div></li>\n<li>\n<div>Thermal management (device cooling)</div></li></ul>\n<li>\n<div>Ability to create innovative ideas.</div></li>\n<li>\n<div>Demonstrated ability of independently executing a research project.</div></li>\n<li>\n<div>Strong communication skills and ability to work independently and in a team environment are essential.</div></li></ul>\n<div><b></b> </div>\n<div><b>ABOUT WESTERN DIGITAL </b></div>\n<div> </div>\n<div>Western Digital Corporation is the world’s largest data storage company with a leading portfolio of HGST, SanDisk, G-Technology and WD brands covering flash and disk-based solutions. Deployed by the largest and most prominent organizations worldwide, Western Digital solutions are everywhere, touching lives and enabling great value from the data they possess. </div>\n<div> </div>\n<div>Western Digital is an equal opportunity employer. We are committed to providing equal employment opportunity for all applicants and employees. Western Digital does not unlawfully discriminate and complies with the laws and regulations set forth in the following EEO Is The Law poster: Equal Employment Opportunity Is The Law.</div>\n<div> </div>\n<div>Western Digital participates in the E-Verify program in the US. For more information click here. Este empleador participa in E-Verify.</div>\n<div><b> </b></div></div></div></div></div>"}