{"job title": "Wood Scientist", "company": "Weyerhaeuser", "city state": "– Centralia, WA", "rating": "3.3", "job description": "At Weyerhaeuser, our focus is as much on building our people as building our business. As a leader in sustainable forest products, we are committed to creating an environment where individuals can flourish, diversity is encouraged, and communities are supported. We are the premier integrated forest organizations in the world. At Weyerhaeuser we?re always looking for people who can contribute, grow, think and create. Our employees are the real reason we've been in business for over 100 years. Their skill and ingenuity have made Weyerhaeuser one of the largest timberland companies, manufacturer and distributor of wood products in the world.\n<br><br>\nAs a wood scientist on the Advanced Forestry Systems (AFS) team at Weyerhaeuser you will work on a diverse range of projects involving non-destructive evaluation of wood properties in standing trees and logs; ring-by-ring and sub-ring analysis of properties (e.g., MFA, specific gravity); consultation on log suitability for export and engineered wood products; and development of predictive models of wood properties under an array of silvicultural treatments.\n<br>\nThe AFS team is part of Weyerhaeuser?s Research and Development organization and Weyerhaeuser?s commitment to sustainable industrial timberland management based on sound science and technology.\n<br><br>\nThe AFS team mission is to ensure the availability of reliable and cost-effective forest information for the optimal management of Weyerhaeuser land and timber. The AFS team is committed to fulfilling this mission by providing world-class data acquisition, analytical technologies, and support.\n<br>\nThis position will be based out of the Weyerhaeuser research facility in Centralia, Washington, with occasional travel to regional offices across the country.\n\n\n<ul>\n<li>Roles &amp; Responsibilities*</li>\n<li>Provide consultative resource to business and technical leaders on wood properties, product application, and other issues.</li>\n<li>Develop models to enhance silviculture decisions by incorporating wood properties into growth and yield models.</li>\n<li>Assist in property-wide assessments of long-term harvest value.</li>\n<li>Design and conduct mill studies to evaluate tree to log to product properties.</li>\n<li>Collaborate on study design to incorporate wood property assessment.</li>\n<li>Maintain and operate a wood analysis laboratory.</li>\n<li>Communicate concepts, issues, and results to both technical and non-technical audiences.</li>\n<li>Provide technical review of analyses and interpretation of results going to peer review or of critical importance to our businesses and operations.</li>\n<li>Experience:* We place an emphasis on our candidate?s skills, willingness to learn, and drive results. Knowledge and expertise is preferred in:</li>\n<li>Non-destructive evaluation of wood properties (both standing tree and log/lumber form).</li>\n<li>Wood properties at the tree, tree-ring, and cellular scales.</li>\n<li>Lumber, veneer, and structural member standards and assessment methods.</li>\n<li>Statistical modeling.</li>\n<li>Silviculture.</li>\n<li>Education:*</li>\n<li>MS or PhD preferred in wood science or related field.</li>\n<li>Graduate-level statistics course-work.</li>\n<li>Silviculture course-work or experience.</li>\n<li>Technical Skills:*Ability to maintain and operate wood property evaluation tools and equipment in a laboratory. Understanding and ability to procure, prepare, and analyze wood samples.</li>\n</ul>\n\n<li>*</li>\n\n\n<ul>\n<li>Drive*: We are looking for someone who is eager to learn, engages with subject matter experts, and business clients; works well with their team; and who looks for opportunities to improve processes, while applying their technical expertise to ensure analytical rigor and effective implementation of our decision support tools in our Timberlands business environment.</li>\n</ul>\n\n<li>*</li>\n\n\n<ul>\n<li>Communication:*Strong communication and interpersonal skills are essential for working effectively with a diverse set of internal and external clients.</li>\n</ul>\n\n<li>*</li>\n\n\n<ul>\n<li>Safety:*We expect all team members to hold themselves and their team members accountable to a high level of safety awareness and safe behavior. Our goal is an injury-free workplace.</li>\n</ul>\n\n<li>*</li>\n\n\n<ul>\n<li>About Weyerhaeuser*</li>\n</ul>\n\nWe sustainably manage forests and manufacture products that make the world a better place. We?re serious about safety, driven to achieve excellence, and proud of what we do. With multiple business lines in locations across North America, we offer a range of exciting career opportunities for smart, talented people who are passionate about making a difference.\n\n\n<ul>\n<li>We know you have a choice in your career. We want you to choose us. *</li>\n</ul>\n\n<li>*</li>\n\n/Weyerhaeuser is an equal opportunity employer. We are committed to taking affirmative action to employ and advance in employment women, minorities, qualified individuals with disabilities and protected veterans./\n\n\n<ul>\n<li>M</li>\n<li>*Job:** **Engineering, Science, &amp; Architecture*</li>\n<li>*Title:** *Wood Scientist*</li>\n<li>*Location:** *WA-Centralia*</li>\n<li>*Requisition ID:** *01012706*</li>\n</ul>"}