{"job title": "Data Engineer", "company": "American-Express", "city state": "– Phoenix, Arizona", "rating": "3.8", "job description": "<ul>\n<li>Do you see data or a better way to* *improve business and lives?* Today, theres a business advantage hiding in plain sight, and youll find it in data. Our Data Engineers know how to use the latest technology to design, evaluate, debug and manage the data that leads to better decisions, a stronger company, and higher customer satisfaction. So if youre not intimidated by the data explosion, engineer your career here. *More than the data on what youll be doing.* * * Theres no end to the data thats created every day and the opportunities you find here. But these are just some of your responsibilities: * Document data requirements/data stories and maintain data models * Support the management of data assets according to enterprise standards, guidelines and policies * Help build and enhance the database design that supports our business portfolio * Work collaboratively with business and product teams * Identify opportunities to adopt innovative technologies *Are you up for the challenge? * * Bachelors Degree in computer science, computer science engineering, or related field required; advanced degree preferred * 5 years of software development experience in a professional environment and/or comparable experience * Experience with design and development across one or more database management systems * Understanding of Big data / NOSQL design and development with variety of data stores *At the core of Data Engineering* Every member of our team must be able to demonstrate the following technical, functional, leadership and business core competencies, including: * Agile Practices * Database Design * Programming Languages and Frameworks * SDLC Methodologies and Practices * Business Analysis * Data Analysis * Data Management * Analytical Thinking *Why American Express * Talk to our people and youll find out what were really all about. Open, creative, risk-taking, collaborative and innovative are just some of the expressions youll hear. Its our culture that makes American Express an outstanding place to work, and a big part of why we regularly win best workplace awards all over the world. If youre ready to take on a challenge and make an impact, you owe it to yourself to launch or grow your career here. / / /Employment eligibility to work with American Express in the U.S. is required as the company will not pursue visa sponsorship for these positions./ **Job** *Technology* **Title:** *Data Engineer* **Location:** *Arizona-Phoenix* **Requisition ID:** ********** Categories</li>\n</ul>\n\n<li>Financial Services</li>"}