{"job title": "Quantitative Researcher", "company": "AXA", "city state": "– New York, NY", "rating": "3.5", "job description": "We are seeking a creative, highly motivated and detail-oriented candidate with a strong background in actuarial or financial engineering to join our team.\n<br><br>\nIn this role, the Quantitative Researcher will support the development of hedging strategy for the Variable Annuity business, apply quantitative techniques to large and unconventional datasets and purse unexplored research topics related to our statutory risk profile.\n<br><br>\nThe Quantitative Researcher will be engaged in an exciting effort to design and implement state-of-the-art quantitative models that drive our Variable Annuity Hedging program. Responsibilities include:\n\n\n<ul>\n<li>Developing hedging strategies, from idea generation and data collection to analysis and model creation.</li>\n<li>Supporting actuarial analysis and reporting, performing and reviewing complex financial analyses by automating and streamlining processes</li>\n<li>Building predictive models and analytics for reporting and forecasting.</li>\n<li>Working with the derivatives trading, investment and capital management, risk management and accounting teams to achieve business objectives and help develop the center of excellence in actuarial transformation.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>Passed actuarial examinations or solid commitment to taking/finishing actuarial exams.</li>\n<li>Bachelor's degree in actuarial, financial mathematics, engineering, statistics or a related quantitative or technical discipline. A post-graduate degree indicating strong quantitative and technical ability is a plus.</li>\n<li>2+ years relevant experience ideally within Hedging, Variable Annuity, Actuarial Analysis, Quantitative Risk Management/Research or related functions.</li>\n<li>Adept programming experience utilizing at least one of the following: C++, Matlab, Python, Perl. VBA is a prerequisite.</li>\n<li>Solid analytical and organizational skills, great attention to details, strong communication skills both verbal and written.</li>\n<li>Demonstration of high intellectual capacity and curiosity; Strong work ethic (takes ownership), self-starter and quick-study mentality</li>\n</ul>\n\nAbout AXA\n<br><br>\nAs an employer AXA is committed to creating an environment where everyone feels completely comfortable bringing their true selves to work every day. AXA US has been recognized and certified as a great place to work by the Great Place to Work Institute.\n<br><br>\nWe provide our employees opportunities to move within our organization so they can grow their career and skills without ever having to leave AXA. Almost 40% of our open jobs are filled with current employees.\n<br><br>\nNOTE: AXA participates in the E-Verify program.\n<br><br>\nIn addition to competitive compensation and an outstanding benefits package including 401 (k) and medical programs, we offer the opportunity for continued professional development in a congenial corporate environment.\n<br><br>\nAXA is committed to providing equal employment opportunities to our employees, applicants and candidates based on individual qualifications, without regard to race, color, religion, gender, gender identity and expression, age, national origin, mental or physical disabilities, sexual orientation, veteran status, genetic information or any other class protected by federal, state and local laws."}