{"job title": "Data Analyst", "company": "CGH Technologies, Inc.", "city state": "– Washington, DC", "rating": "2.6", "job description": "<div>CGH Technologies, Inc. (CGH) is a business solutions firm, specializing in Data Management, Software Engineering, and Business Intelligence solutions. Located within the Washington corridor, CGH has worked successfully with Government, Commercial and International sectors, providing management, development and maintenance, and support of large and complex environments. CGH has an exciting opportunity for a seasoned Data Analyst to join the CGH Team.\n<br><br>\n<strong><u>Purpose:</u></strong>\n<br><br>\n<strong><u>Responsibilities:</u></strong>\n<ul>\n<li>Analyze, validate, formulate and document business, functional and technical requirements.</li> <li>Liaise among business stakeholders to elicit and communicate business, functional and technical requirements. Conduct requirement walkthroughs and manage the requirements change control process.</li> <li>Model relevant \"as-is\" and proposed \"to-be\" processes using work flow diagrams.</li> <li>Conduct problem analysis to identify problems in current business and technical processes. Explain in detail how you will accomplish this task.</li> <li>Prepare clear, business, functional and technical requirements, use cases, and communication plans. Explain in detail how you will accomplish this task.</li><li>Ability to translate/dissect business requirements for software developers.</li></ul></div>\n<br>\n<div><strong>Qualifications</strong></div> <div>\n<strong>Number of Years Experience Required:</strong>\n<ul>\n<li>5-7 years of relevant technical or business work experience.</li><li>Minimum of 5 years of experience as a requirements analyst working with project sponsor to understand and document project objectives, scope, gaps and to establish vision.</li><li>Minimum of 5 years of experience working with business owners to understand current processes and to document and prioritize requirements specifications, business processes and recommendations.</li><li>Minimum of 5 years of experience assisting in the collection and consolidation of required information and data.</li><li>Minimum of 5 years of experience working with business users to define accurate, meaningful and measurable requirements.</li>\n</ul>\n<strong>Minimum Education and Certifications Required:</strong>\n<ul>\n<li> Bachelor's degree in related field</li>\n</ul>\n<strong>Technical Skills Required:</strong>\n<ul>\n<li> Use case tools a plus</li>\n</ul>\n<strong><u>Computer Skills:</u></strong>\n<ul>\n<li>Proficient with Microsoft Excel</li><li>Proficieint with Visio</li>\n</ul>\n<strong>Other Knowledge, Skills, and Abilities Required:</strong>\n<ul>\n<li>U.S. Citizen or person with valid U.S. Work Visa who has lived in the U.S. for three or more years.</li><li>Experience in Agile software development a plus.</li><li>Excellent presentation and written communication skills.</li> <li>Working knowledge of requirements elicitation, analysis and documentation.</li> <li>Working knowledge of business analysis, quality assurance, and workflow tools and/or practices.</li> <li>Effective professional relationship building skills.</li> <li>Demonstrated ability to quickly learn existing business processes and combine knowledge from multiple disciplines in order to produce an optimal business solution.</li> <li>Strong analytical thinking and problem solving skills.</li> <li>Excellent written and verbal communication skills to both business users and technical staff.</li>\n</ul>\nCandidates selected will be subject to a Government background investigation and must meet eligibility requirements.\n<br><br>\nCGH offers a comprehensive benefits package to include medical, dental, short- and long-term disability insurance, life insurance, commuter benefit, and flexible spending account. Other benefits include 401K, paid government holidays, and Paid Time Off (PTO).\n<br><br>\nCGH is an Equal Opportunity Employer</div> 0\n<br><br>\n<strong>Job Posted by ApplicantPro</strong>\n<br>"}