{"job title": "Data Analyst", "company": "Drinker Biddle &amp; Reath LLP.", "city state": "– Washington, DC", "rating": "3.5", "job description": "Tritura is revolutionizing how law firms work!&nbsp; We are seeking a Data Analyst to join our team!&nbsp; An entry level role, the Tritura Data Analyst works within a team of talented individuals to perform data analysis, data searching, data reporting, data conversion, data normalization, data extraction, data categorization, statistical analysis, and quality control from various forms of electronic data and from various sources (both structured and unstructured) to uncover answers and develop facts.&nbsp; Most law firms (or companies) have one specific type of data you have to trudge through all day, but Tritura works with a wide variety of data in various formats, making the daily work interesting and challenging.&nbsp; The Tritura Data Analyst employs data management tools, various programming languages and disparate data analysis strategies as necessary.\n<br><br>\nIt is important that the Data Analyst be a self-starter with considerable initiative. Tritura continually explores the edges of data science, stretching the comfort zone of its technicians.\n<br><br>\nThe Data Analyst must display good judgment and have effective interpersonal communications skills.&nbsp; Confidentiality and discretion are required consistently.\n<br><br>\n<strong>JOB FUNCTIONS:</strong>\n<br><br>\nCreating and maintaining databases; data collection, data staging, data loading, data and metadata extraction, and data normalizing.\n<br>\nData preparation for analytical tools.\n<br>\nData conversion, data editing, data formatting, data normalization, data analysis and data reporting.&nbsp;\n<br>\nData formatting and general processing of data for legal review.\n<br>\nRequirements gathering with high-end legal professionals.\n<br>\nMaintenance of necessary technical documentation and data tracking logs.\n<br>\nTroubleshooting support applications and databases such as SQL Server, Postgres or Neo4j.&nbsp;&nbsp;\n<br><br>\nThe statements contained in this job description are not all-inclusive.&nbsp; Duties and requirements may vary from time to time.&nbsp; This job description is not an exhaustive list of duties, responsibilities and skills required of employees so classified.\n<br><br>\n<strong>KNOWLEDGE, SKILLS AND ABILITIES:</strong>\n<br><br>\nCandidate must have technical proficiency in databases and programming languages such as JavaScript, Python, SQL or similar.\n<br>\nExceptional verbal and written communication skills and a commitment to teamwork work are necessary.&nbsp;&nbsp;\n<br>\nCandidate should enjoy problem solving and have a willingness to learn new skills and take on new challenges.\n<br>\nMust be able to work with detailed information accurately and efficiently.\n<br>\nMust take ownership of projects and be successful in driving them, in addition to seeing daily tasks through to a successful conclusion.\n<br>\nMust exercise discretion and maintain confidentiality at all times.\n<br>\nMust set a positive example for all personnel and support a collegial and collaborative work environment.\n<br>\nMust exhibit clear and concise telephone and email etiquette.\n<br>\nMust be Client Service driven and conduct him/herself professionally in both appearance and actions at all times.\n<br>\nMust be adaptable to change, open to new ideas, willing to take on new responsibilities and capable of quickly adjusting plans to meet changing situations and priorities.\n<br>\nMust be respectful of people’s differences in background, culture and perspective and possess the ability to interact with people in such a manner that shows sensitivity, tact and professionalism.\n<br>\nMust quickly grasp the goals, service, culture and strategy of the department, office and the firm overall.\n<br>\nMust adhere to and serve as a role model for the firm’s Client Service Standards.\n<br>\nMust have excellent oral communication skills, especially the use of proper grammar.\n<br>\nMust consistently produce quality work.\n<br>\nMust be able to work well independently or as part of a team with a high degree of accuracy, confidentiality and professionalism.\n<br>\nMust be flexible and dependable, including the ability to work overtime as needed.\n<br><br>\n<strong>EDUCATION AND EXPERIENCE:</strong>\n<br><br>\nBachelor’s degree required; degree in a technical area such as Math, Statistics, or Computer Programming preferred.\n<br>\nMinimum of 2 years’ experience as a Data Analyst.\n<br>\nMust be qualified to handle export-controlled data.\n<br>\nMust be a US Citizen or Lawful Permanent Resident.\n<br><br>\nWe are an Equal Opportunity Employer and we offer an excellent total compensation package, which includes medical/dental coverage (PPO/HD), vision care, life insurance, short and long-term disability plans, 401(k) with employer match, paid vacation/holiday/sick days, wellness programs, stand-up desks, and more. In addition, we offer weekly internal training sessions and a strong commitment to work-life balance.\n<br><br>\nTO APPLY:&nbsp; Interested candidates should submit&nbsp;a cover letter, including salary requirements, and resume for consideration.&nbsp; Incomplete applications will not be considered."}