{"job title": "Data Analyst", "company": "Envision", "city state": "– Saint Louis, MO", "rating": "3.4", "job description": "Candidates with a strong background in data analysis and visualization are highly desired for this position. The individual will be responsible for building real-time dashboards that inform business decisions around data quality issues. The work comprises exploratory data analysis targeting quality issues, defining metrics to assess quality issues, and building dashboards to present the metrics. This position is expected to interact with various functions within the company, for example, data analytics, data science, and product. Attention to detail, agility, and meeting deadlines on a fast-paced environment are key for the success of this role.\n<br><br>\n<strong>Required Skills / Experience:</strong>\n<ul>\n <li>BA/BS in Applied Math, Statistics, Computer Science, Engineering or a related quantitative discipline with at least a year of data analytics or data science experience.</li> <li>Familiarity with statistical software (R/Python) or Scala</li> <li>Experience with data visualization tools, especially Looker</li> <li>Relational database skills</li> <li>Ability learn fast a number of processes with consistency and attention to detail</li> <li>Self starter and be able to work as part of a team</li> <li>Ability to inform the limits and trade-offs to stakeholders as well as peers</li> <li>Strong communication skills to solicit information from domain experts and present results back to different audiences.</li>\n</ul>\n<strong>Desired Skills / Experience:</strong>\n<ul>\n <li>M.Sc. in an analytics field</li> <li>Experience with exploratory Big Data discovery through the use of technologies such as Tableau, Hadoop, MapReduce, or Spark</li> <li>Experience with complex data formats and data of varying quality</li> <li>Knowledge of agricultural technology especially with regard to row crops</li> <li>Curiosity and an open-mind towards unfamiliar data sources and unfamiliar quantitative domains</li>\n</ul>\n\nAssociated topics: data administrator, data analyst, data center, data integrity, data quality, database, mongo database, mongo database administrator, sql, sybase"}