{"job title": "Data Analyst", "company": "FiveBy", "city state": "– Redmond, WA", "rating": "NA", "job description": "FiveBy has an exciting opportunity for a Data Analyst to innovate, influence, transform, inspire and grow within our organization. FiveBy is on the forefront of fighting Digital Crime, if this is something that interests you, we encourage you to apply to learn more!\n<br><br>\nThe Data Analyst will assume an integral role in supporting trade compliance for our client. The work will involve providing forensic support for due diligence and sanctions activities. The successful candidate must be analytical, flexible and able to succeed within an open and collaborative peer environment across multiple projects simultaneously.Roles and\n<br><br>\nResponsibilities:\n\n<ul>\n<li>Investigative data analysis, pulling and reconciling data across multiple systems</li>\n\n<li>Building SOPs for gathering data and searching specific systems</li>\n\n<li>Regular control monitoring report resolutions</li>\n\n<li>Trade quality control reviews and enhancements</li>\n\n<li>Review and analyze potential sanctions hits while maintaining compliance requirements</li>\n\n<li>Use individual problem-solving and analytical skills to authenticate customers</li>\n\n<li>Willingness to work hours outside of the standard work day as needed</li>\n</ul>\nQualifications:\n\n<ul>\n<li>1 to 3 years of prior forensic investigative experience</li>\n\n<li>Excellent written and verbal communication skills</li>\n\n<li>Strong attention to detail and organizational skills</li>\n\n<li>The ability to adapt in a dynamic and fast-paced environment</li>\n\n<li>Intermediate MS SQL Server based analysis skills</li>\n\n<li>ETL, Complex Joins, Functions, Stored Procedures, Loops</li>\n\n<li>Experience with data visualization tools (Power BI, Tableau etc.)</li>\n\n<li>Experience collecting and analyzing data to detect deficient controls, fraud, or non-compliance with laws, regulations, and management policies</li>\n\n<li>Experience assessing data integrity (completeness, accuracy, explaining impact of data integrity on decisions/assumptions)</li>\n\n<li>Experience examining and evaluating processes and information systems, recommending controls to ensure reliability and data integrity</li>\n\n<li>Knowledge of Microsoft Systems</li>\n</ul>\nThe Data Analyst role requires a self-starter, comfortable with ambiguity and able to be resourceful. Additionally, the successful candidate will be detail oriented and possess the ability to work well with cross-functional teams.\n<br><br>\nFiveBy is an equal opportunity employer."}