{"job title": "Mid-Level Data Analyst", "company": "INDUS Technology, Inc.", "city state": "– Panama City, FL", "rating": "3.1", "job description": "<strong>Job Requisition Number:</strong> 20171115E\n<br><br>\n<strong>Job Title:</strong> Mid-Level Data Analyst\n<br><br>\n<strong>Salary Range or Maximum:</strong> Negotiable\n<br><br>\n<strong>Work Location:</strong> Panama City, FL <strong>Relocation Assistance:</strong> None\n<br><br>\n<strong>Employment Type:</strong> Full-Time\n<br><br>\n<strong>Security Clearance:</strong> SECRET\n<br><br>\n<strong>Posted Date</strong>: 15 November 2017 <strong>Closing Date:</strong> Continuous\n<br><br>\n<strong>Mandatory Skill Requirements (must have):</strong>\n<br><br>\nMust have strong analytical skills to work with large amounts of data; excellent written and oral communication skills present complex ideas; critical thinking to reach conclusions based on findings; strong attention to detail; math and statistical skills to support conclusions. Must possess strong Microsoft Office skills.\n<br><br>\n<strong>Desired Skill Requirements:</strong>\n<br><br>\nWorking knowledge of Naval Surface Warfare Center (NSWC) Panama City Division Adaptive Persistent Awareness Systems (APAS) or similar specific hardware and software applications.\n<br><br>\n<strong> Job Duties:</strong>\n<br><br>\nAnalyze data, prepare analytical reports, create databases, devise methods for identifying data patterns and trends in available information sources. Investigate and evaluate commercial practices, COTS or GOTS products, and new emerging technologies, such as Internet Protocol version 6 (IPv6) to identify potential best practices for NSWC PCD approval. Assist Team Leads with support of system design reviews for systems incorporating any of these technologies or having any security requirements; evaluation of system integration strategies with respect to security impacts; and recommendation of design approaches to address system vulnerabilities.\n<br><br>\n<strong> Education/Equivalent:</strong>\n<br><br>\nBachelor's degree in Computer Science or closely related field preferred.\n<br><br>\n<strong>Travel Required:</strong>\n<br><br>\nNone\n<br><br>\n<strong>Comments:</strong>\n<br><br>\nApply for position online at http://industechnology.applicantpro.com/jobs/.<br><br>0\n<br><br>\n<strong>Job Posted by ApplicantPro</strong>\n<br>"}