{"job title": "Research Scientist - Battery Development", "company": "Lynntech, Inc.", "city state": "– College Station, TX", "rating": "3.2", "job description": "<p>Lynntech is seeking an experienced and creative Research Scientist to assist in the development of technologies within our collaborative group. A Research Scientist will typically have a PhD degree and 1-6 years postdoctoral experience.</p><p>Lynntech develops world-class technology solutions and is actively engaged in various stages of technology development from preliminary concept generation and feasibility demonstration all the way through advanced engineering and manufacturing of products to meet different customer needs by integrating creative talent and business expertise.</p><p>The Energy and Power (EP) Division is comprised of a group of Scientists and Engineers that develop advanced and commercially viable technologies for defense, aerospace, energy and medical applications. Example applications that Lynntech's EP unit is currently working on include batteries, supercapacitors, and sensors.</p><p>The EP unit is seeking a Research Scientist that is a problem solver, and can come up with innovative ideas and concepts to create cutting edge battery research opportunities. This Research Scientist will have the opportunity to be involved in the following functions as part of this job:</p><ul><li>Responsible for obtaining regular funding as primary author of research proposals submitted to federal agencies</li><li>Responsible for executing and designing laboratory experiments and interpretation of the results</li><li>Responsible for the preparation of high quality and well written progress reports required by funding agencies </li><li>Responsible for identifying potential intellectual property and writing draft patent applications</li></ul><p>Why should you work at Lynntech?</p><ol><li><strong>Your work will have an impact and make a difference in the world:</strong> Lynntech employees get to work across various disciplines, and are engaged in all aspects of technology development from idea generation to commercialization.</li><li><strong>You get the best of both worlds:</strong> We offer the infrastructure and stability of an established company as well as the challenge, benefits, and entrepreneurial spirit associated with a small business.</li><li><strong>Your work will be interesting and varied:</strong> You will have the opportunity to be creative and work on a myriad of projects across various industries (defense, energy, aerospace and medical). </li><li><strong>You get to work with the best, the brightest, and the most creative:</strong> People are Lynntech's biggest asset. We employ personnel across a broad range of disciplines including physicists, chemists, biologists, engineers, program managers, and business development.</li></ol><p>This applicant is anticipated to have the following qualifications:</p><ul><li>D. in Chemistry, Materials Science, Engineering or related disciplines</li><li>Record of publications and presentations</li><li>Technical writing ability</li><li>Excellent verbal and written communication skills</li><li>Experience in electrochemical energy storage and conversion technologies (e.g. batteries, supercapacitors, electrolyzers, etc.) and/or energy harvesting devices (piezoelectrics, thermoelectrics, etc.) </li><li>Experience in development of innovative materials to make electrodes (cathodes and anodes) for batteries (Li-ion, solid-state, or new battery chemistries), electrolytes, membranes, and/or electrosynthesis, electrocatalysis</li></ul><p>Preferred qualifications for this position are </p><ul><li>Postdoctoral experience</li><li>Experience working in or with government laboratories (e.g. DOE or DOD labs)</li><li>Experience in managing projects</li><li>Experience in writing proposals to federal agencies</li></ul><p>Candidate must be a US Person (Citizen or Permanent resident) due to contract requirements.</p><p>Interested candidates are encouraged to apply online at www.lynntech.com. Feel free to include a cover letter or expanded resume to outline how you fit this position.</p><p>Lynntech is an Equal Opportunity Employer/M/F/Vet/Disabled.</p>0<br><br><b>Job Posted by ApplicantPro</b><br>"}