{"job title": "Data Analyst", "company": "Marsh&amp;McLennan Companies, Inc.", "city state": "– Sioux Falls, SD", "rating": "3.4", "job description": "You spend more time working than virtually anything else. Isn't your time worth more than just a paycheck? If so, Marsh&amp;McLennan Agency (MMA) located in Sioux Falls, SD, may be the place for you. As an MMA colleague, you'll get personal and professional development, a driven and entrepreneurial team-oriented environment, and leaders at all levels who are committed to maintaining high levels of colleague engagement.\n<br><br>\nOur talented colleagues work hard to make a difference in the moments that matter for our clients, communities and each other. Discover how much is possible as you grow and advance your career.\n<br><br>\nLead teams, grow people, and make an impact. MMA continues to grow, and we are adding another data analyst to our Data Analytics team.\n<br><br>\n<strong>Job Summary:</strong>\n<br><br>\nThe regional Data Analyst will work in the Sioux Fallclosely with client teams in the upper Midwest region to evaluate health and welfare programs to identify, trend, benchmark, predict and measure key financials and specific improvements in the overall population of Marsh&amp;McLennan Agency (\"MMA\") clients. Responsibilities include utilization of claims analysis tools and development of detailed client reports.\n<br><br>\n<strong>Essential Functions:</strong>\n<br><br>\nUtilization of Claims Analysis and Modeling Tools\n\n\n<ul>\n<li>Facilitate the completion and delivery of the data collection requests and appropriate documents to the Planning and Analytics for Total Health (\"PATH\") team members and carriers.</li>\n<li>Compare monthly PATH data summary reports to carrier/vendor claim reports, verify accuracy and/or identify discrepancies.</li>\n<li>Partner with carriers/vendors and MMA colleagues to build and maintain schedule for delivery of reports and analysis.</li>\n<li>Analyze, prioritize and interpret information drawing accurate conclusions with minimal guidance.</li>\n<li>Organize, maintain and centralize carrier/vendor information.</li>\n<li>Prepare/develop detailed reports such as PATH RoadMap, Medical/Enterprise Intelligence Report and adhoc analysis.</li>\n<li>Provide observations on population, cost and utilization trends and cost drivers based on detailed reports and provide subsequent appropriate recommendations.</li>\n<li>Independently identify process improvement opportunities related to PATH delivery.</li>\n<li>Attend weekly vendor and monthly MMA financial modeling conference calls.</li>\n<li>Evaluate, determine and recommend alternative coverage, pricing options and plan design changes based on economic analysis of available plan elements related to client goals.</li>\n<li>Present client materials (claims, trends, recommendations, modeling, etc.) as needed through in person visits, conference calls, web-ex, etc.</li>\n<li>Exercise discretion and independent judgment in relation to matters of significance.</li>\n</ul>\n\nProactive Client Service\n\n\n<ul>\n<li>Develop effective business relationships with clients in conjunction with client service teams and producers through in-person visits, telephone and electronic contact at multiple levels within client organization.</li>\n<li>Act as primary contact for PATH-related inquiries for internal client service team and producers.</li>\n<li>Present recommendations, modeling and analysis directly to client teams and respond to requests promptly.</li>\n</ul>\n\nAdditional Responsibilities Necessary to Successfully Complete Role\n\n\n<ul>\n<li>Travel to MMA Upper Midwest Offices will be required as needed to fulfill support role of the position.</li>\n<li>Read, practice and live the Code of Conduct for the agency. Be a participant in maintaining a strong work environment and culture for all team members.</li>\n<li>Any other duties that may be assigned.</li>\n</ul>\n\n<strong>Desired Qualifications:</strong>\n<br><br>\nWorking knowledge of employee benefit plans with 2 years of industry experience and demonstrated relationship management skills. Ability to coordinate multiple projects while ensuring timely and accurate client deliverables, with effective problem solving and resolution skills. Strong organizational, project planning and management, analytical and multi-tasking skills. Ability to communicate with tact and maintain confidentiality. Excellent relationship building and presentation skills. superior listening, verbal and written communication skills. Proficiency with Microsoft Office suite required.\n<br><br>\n<strong>Education Requirements:</strong>\n<br><br>\nBachelor's degree required. State Life/Health insurance license required."}