{"job title": "Healthcare Data Analyst", "company": "Millennium Physician Group", "city state": "– Fort Myers, FL", "rating": "3.8", "job description": "<strong>Summary</strong>\n<br><br>\nThe Healthcare Data Analyst supports all healthcare analytical efforts of the fast-growing company's various value based contracts ranging from MSSP ACOs, Medicare Advantage Plans, and Commercial ACOs. This position will use state of the art population health system, electronic health record, and various payer portals and reports to gather, analyze, and present actionable solutions to complex healthcare issues. The analysis will range from macro healthcare trends and individual patient analysis. The position works on multiple projects as a subject matter expert in a fast-paced environment for the support of executive management, physicians and other internal clients. Works closely with the company's clinical integration, care coordinator and quality teams to provide meaningful data for clinical transformation, quality and process improvement initiatives. Obtains, understands and communicates reporting specifications from government agencies and other entities.\n<br><br>\n<strong>Essential Duties and Responsibilities:</strong>\n<ul>\n<li>Create proactive analyses comparing company results to industry data to evaluate program performance for internal management and internal clients</li><li>Develop and produce financial reports and clinical analysis on a periodic and ad-hoc basis for care coordination staff as well as physicians and executive leadership.</li> <li>Ensures accuracy and timeliness of company's staff and physician reports to include regularly scheduled and ad-hoc reporting request. Responsible for all follow-up and/or research requests regarding physician data</li><li>Participates in project teams, analyzing various new programs, projects or ventures that require analysis of clinical data</li><li>Prepares reports, presentations and other documents and presents these materials in meetings</li><li>Identify problematic areas and conduct research to determine the best course of action to correct the data</li><li>Participates in high level business initiatives and assist with all levels of metric reporting</li><li>Maintains a working knowledge of relevant Government and third-party health care initiatives in which the company participates. It is assumed, in order to maintain these skills, that relevant seminars, books, periodicals and regulations be routinely reviewed</li><li>Identify and research anomalies and outliers in data</li><li>Performs other related duties as assigned or requested</li>\n</ul>\n<strong>Competencies</strong>\n<br><br>\nTo perform the job successfully, an individual should demonstrate the following competencies:\n<br><br>\n<strong><u>Analysis/Problem Assessment</u></strong> Securing relevant information and identifying key issues and relationships from a base of information; relating and comparing data from different sources; identifying cause-effect relationships.\n<br><br>\n<strong><u>Compassion</u></strong> - The responsibility to put a patient's or person's interests first, including the duty not to harm, deliver proper care, and maintain confidentiality.\n<br><br>\n<strong><u>Compliance</u></strong> - Employee has satisfactory completed employers required compliance training. Employee is able to demonstrate an understanding of employers Code of Conduct.\n<br><br>\n<strong><u>Communication</u></strong> - Expressing ideas effectively in individual and group situations (including nonverbal communication); adjusting language or terminology to the characteristics and needs of the audience. Good listening skills.\n<br><br>\n<strong><u>Follow-up</u></strong> - Consistently maintaining a high activity or productivity level; sustaining long work hours.\n<br><br>\n<strong><u>Initiative</u></strong> - Making active attempts to influence events to achieve goals; self-starting rather than accepting passively; taking action to achieve goals beyond what is required; being proactive. Practices self-development.\n<br><br>\n<strong><u>Integrity</u></strong> - Maintaining and promoting social, ethical, and organizational norms is conducting internal and external business activities.\n<br><br>\n<strong><u>Judgement/ Problem Solving</u></strong> - Recognizes problems and responds, systematically gathers information, sorts through complex issues, seeks input from others, addresses root cause of issues, makes timely decisions, can make difficult decisions, uses consensus when possible, and communicates decisions to others.\n<br><br>\n<strong><u>Patient Service Orientation</u></strong> - Proactively developing patient/customer relations by making efforts to listen and understand the customer and their needs (both internal and external); anticipating and providing solutions to customer needs; giving high priority to patient/customer satisfaction. Ensures appropriate follow up and is their advocate in determining solutions. The employee uses a variety of communication techniques to effectively express thoughts and ideas and to understand or influence.\n<br><br>\n<strong><u>Results Driven &amp; Execution</u></strong> - Accountable for meeting or exceeding individual and/or department goals and objectives. Committed to producing results that will achieve company objectives. Sets priorities and organizes time to meet or exceed goals, follows up, and takes personal responsibility for results whether they are positive or negative.\n<br><br>\n<strong><u>Teamwork/</u></strong><strong> <u>Collaboration</u></strong> - Working effectively with team/work group or those outside formal line of authority (e.g., peers, senior managers) to accomplish organizational goals; taking actions that respect the needs and contributions of others; contributing to and accepting the consensus; subordinating own objectives to the objectives of the organization or team. Listens to others and values opinions.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<br><br>\n<strong>Education and/or Experience</strong>\n<ul>\n<li>Bachelor's in Business Administration, Healthcare Administration or related field required</li><li>Minimum of 2 years' experience in Healthcare required; an understanding of Electronic Medical Record and population management system strongly preferred</li><li>Data analysis experience</li> <li>Use of analytic tools (e.g. Excel, SQL, Access, SAS)</li>\n</ul>\n<strong>Language Skills</strong>\n<br><br>\nAbility to read, analyze, and interpret common financial reports and contracts. Ability to respond to inquiries from internal customers. Ability to effectively present information to management and/or end users.\n<br><br>\n<strong>Mathematical Skills</strong>\n<br><br>\nAbility to add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions, and decimals. Ability to compute rate, ratio, and percent and to draw and interpret bar graphs.\n<br><br>\n<strong>Reasoning Ability</strong>\n<br><br>\nAbility to solve practical problems and deal with a variety of concrete variables in situations where only limited standardization exists. Ability to interpret a variety of instructions furnished in written, oral, diagram, or schedule form.\n<br><br>\n<strong>Analytical / Interpretive Skills</strong>\n<br><br>\nAbility to analyze and interpret the raw data and data trends to properly communicate to the management and end users to create action oriented plans that will result in positive movement of measures. Also, have the ability to understand the business implications and goals of the data being presented.\n<br><br>\n<strong>Computer Skills</strong> To perform this job successfully, an individual should have advanced knowledge of Microsoft Excel software, including use of pivot tables and other advanced data manipulation techniques; Microsoft Word; Microsoft Excel; Microsoft Access; Microsoft PowerPoint, SQL Server, SSRS and Adobe Software Suite.\n<br><br>\n<strong>Certificates, Licenses, Registrations</strong>\n<br><br>\nNone.\n<br><br>\n<strong>Physical Demands</strong>\n<br><br>\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<br><br>\nWhile performing the duties of this Job, the employee is regularly required to stand; walk; sit; use hands to finger, handle, or feel; reach with hands and arms; climb or balance and talk or hear. The employee is occasionally required to stoop, kneel, crouch, or crawl. The employee must occasionally lift and/or move up to 10 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus.\n<br><br>\n<strong>Work Environment</strong>\n<br><br>\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<br><br>\nThe noise level in the work environment is usually moderate depending on business activity in the office.<br><br>0\n<br><br>\n<strong>Job Posted by ApplicantPro</strong>\n<br>"}