{"job title": "Business Intelligence Analyst", "company": "Mountain America Credit Union", "city state": "– West Jordan, UT", "rating": "4.2", "job description": "<strong>Please reference the schedule and minimum qualifications listed below before applying.</strong><br><br>If you need assistance with filling out our application form or during any phase of the application, interview, or employment process, please notify our Human Resources Team at 801-###-#### and every reasonable effort will be made to accommodate your needs in a timely manner.<br><br><strong>Job Summary</strong> Manage critical organization data and data systems, turn data into information, and information into insight. Deliver comprehensive business intelligence solutions, data cube design, reporting and analytics. Provide system administrative support for data extract processes and reporting tools, including support for user community. <strong>Job Description</strong><br><br>To be effective, an individual must be able to perform each job duty successfully.\n<ul>\n<li>Identifies and recommends methods to normalize and maintain data from disparate systems. Works closely with ETL Developers throughout the EDW development lifecycle.</li><li>Works with internal and external data users to identify requirements to deliver high quality BI solutions and analyses and takes ownership for data and report quality.</li><li>Translates and documents results of requirements gathering into a standard format to be used to create the appropriate Business Intelligence (BI) solution.</li><li>Leads in the collection of system/business requirements and the documentation of business and technical data dictionaries/metadata and specifications in support of complex strategic EDW solutions. Prepares documentation for ETL Developers for integration of new data into EDW.</li><li>Applies industry standards to the technical architecture of a Business Intelligence solution (Stars, Cubes, etc.) to solve business problems or increase business efficiency.</li><li>Manages user acceptance testing of reporting modules, analyzes test results, and corrects problems.</li><li>Establishes data quality standards and data governance protocols.</li><li>Coordinates with ETL Developers to create and support Business Intelligence environment.</li> <li>Identifies and works with appropriate staff to resolve technical issues.</li><li>Provides on-going data consultation, including training end users on data usage and BI tools</li><li>Collects and analyzes external market data to provide benchmarks for comparison purposes</li><li>Performs additional duties as assigned</li>\n</ul>\n<strong>KNOWLEDGE, SKILLS, and ABILITIES</strong>\n<br><br>\nThe requirements listed are representative of the knowledge, skills, and/or abilities required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential job functions.\n<br><br>\n<strong>Experience</strong>\n<br><br>\nFive to eightyears related experience\n<br>\nBanking/Finance experience preferred\n<br><br>\n<strong>Education</strong>\n<br><br>\nFour-year college degree or equivalent in related field.\n<br><br>\n~\n<br><br>\n<strong>Computer/Office Equipment Skills</strong>\n<ul>\n<li>Strong knowledge and experience using T-SQL and MS-SQL - (MCSE Certification preferred)</li><li>Strong knowledge of data warehouse architecture, data modeling, data cubes, etc. and experience using SQL query techniques to access SQL Server or other relational databases.</li><li>Data reporting and analytics competencies (content knowledge)</li><li>Experience with detailed data analysis over complex data systems, including many-to-many databases</li><li>Experience with management of BI systems for a large organization</li><li>Advanced level skill for Excel</li><li>Intermediate knowledge in analytical software such as Tableau, Power BI, Oracle, Google Analytics</li><li>SSMS or SSIS experience preferred</li>\n</ul>\n<strong>Managerial Responsibility</strong>\n<br><br>\nDoes not have managerial responsibility.\n<br><br>\n<strong>Other Skills and Abilities</strong>\n<ul>\n<li>Project management</li><li>Forecasting</li><li>Adaptive to change</li><li>Innovative</li><li>Responds positively to altered circumstances or conditions</li><li>Effective communication skills with technical team members as well as business partners. Able to distill complex ideas into straightforward language</li>\n</ul>\n<strong>PHYSICAL ABILITIES / WORKING CONDITIONS</strong>\n<br><br>\n<strong>Physical Demands</strong>\n<br><br>\nAbility to sit, talk and hear consistently\n<br><br>\nAbility use hands to handle or reach occasionally\n<br><br>\n<strong>Vision Requirements</strong>\n<br><br>\nClose vision (clear vision at 20 inches or less)\n<br><br>\nDistance vision (clear vision at 20 feet or more)\n<br><br>\n<strong>Weight Lifted or Force Exerted</strong>\n<br><br>\nAbility to lift up to 10 pounds occasionally\n<br><br>\n<strong>Environmental</strong>\n<br><br>\nThere are no unusual environmental factors (such as a typical office)\n<br><br>\n<strong>Noise Environment</strong>\n<br><br>\nModerate noise (business office with computers and printers, light traffic)\n<br><br>\nMountain America Credit Union is an EEO/AA/ADA/Veterans employer.<br><br>Associated topics: business advisory, business analysis, business systems, consult, consultant, crm, information technology consultant, marketing, sap, support analyst"}