{"job title": "Sr Data Analyst", "company": "Mountain America Credit Union", "city state": "– West Jordan, UT", "rating": "4.2", "job description": "<strong>Please reference the schedule and minimum qualifications listed below before applying.</strong><br><br>If you need assistance with filling out our application form or during any phase of the application, interview, or employment process, please notify our Human Resources Team at 801-###-#### and every reasonable effort will be made to accommodate your needs in a timely manner.<br><br><strong>Job Summary</strong> Manages critical data, turns data into information, information into insight, and insight into recommendation for business decisions and provide analytical support for the organization, with a holistic view of members and the business. <strong>Job Description</strong><br><br><strong>LOCATION</strong>\n<br><br>\nCorporate Tanner Building\n<br><br>\n7167 S Center Park Drive\n<br><br>\nWest Jordan, UT 84084\n<br><br>\n<strong>SCHEDULE</strong>\n<br><br>\nFull-time; Monday - Friday 9:00am - 6:00pm\n<br><br>\n<strong>This position is currently not eligible to work remotely</strong>\n<br><br>\n<strong>JOB DESCRIPTION</strong>\n<br><br>\nTo be effective, the following duties must be completed successfully:\n<ul>\n\n<li>Demonstrates high-level knowledge of statistical analysis and modeling techniques and applies them in a financial or operational industry setting to support strategic decision making. Runs statistical tests on data while noting the pros and cons of the test selection.</li>\n<li>Assists with consultation to study investigators and business leaders in the areas of protocol development, study design, analysis plan, sample size / power calculations, and interpretation of study data. Applies statistical methods to drive new/original statistical insight.</li><li>Assists in the preparation and submission of written documents or presentations for senior leadership.</li><li>Uses appropriate analytic methods to research a loosely defined problem or hypothesis. Analyzes some predefined variables and some unknowns.</li><li>Programs new statistics not available in vended software based on published statistical articles.</li><li>Writes intermediate level ad hoc SQL, including basic selects, joins, use of Where clause and simple functions (e.g., Trunc, Sum, Min, Max, Avg, Concat, etc.). Demonstrates an understanding of Primary / Foreign Keys, Table/Field Aliases, and Partitions/Indexes to deliver high quality material.</li> <li>May train others on skills and competencies required for previous levels.</li><li>Provides project management / leadership as appropriate to drive timelines and deliverables.</li><li>Applies statistical coding to complex data or methods. Reviews other analysts coding. Understands the technology and languages that will provide the most efficient and accurate results.</li><li>Creates reports that answer a specific question or a limited number of questions. Reports include basic graphs, output lists of data, and basic use of parameters. Reports used to promote evidence-based decision-making.</li><li>Reviews analyses for data validity, appropriateness of model selection, limitations of results, and valid interpretation of results. Compares data output to ensure data accuracy. Creates basic QA test plans and validates data for accuracy.</li><li>Collaborates with corporate and region resources to design, create, test, and implement analytic tools (reports, dashboards, etc.) that support enterprise / region needs and to improve data collection and reporting strategies (minimize duplication, redundancy, etc.).</li><li>Responsible to document work/projects per enterprise-wide standards (reports, project-tracking, databases, etc.).</li><li>Operates with minimal supervision, taking lead roles in working with key stakeholders and other analysts or developing own methodological research.</li><li>Shares important and relevant information with the team. Proactively offers suggestions, provides resources, volunteers for assignments, and removes barriers to help the team accomplish its goals.</li><li>Demonstrates a high level of proficiency in using / analyzing data sources to meet local and enterprise needs.</li><li>Provides consultation, data analysis, and project management for business stakeholders across the organization. Communicates technical / analytical concepts to others.</li><li>Assists in the identification of data quality (accuracy, completeness, etc.) issues. As appropriate, trains other individuals and teams in the routine use of data collection, analysis, and reporting and interpretation tools for measuring performance.</li>\n</ul>\n<strong>KNOWLEDGE, SKILLS, and ABILITIES</strong>\n<br>\nThe requirements listed are representative of the knowledge, skills, and/or abilities required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential job functions.\n<br><br>\n<strong>Education and Experience</strong>\n<br><br>\nMaster's Degree in Analytics, Business, Finance, Economics, Statistics or related field and three years of analytics experience. Or Bachelor's Degree with minimum five years of analytics experience. Degree must be obtained through an accredited institution. Education is verified.\n<br><br>\n<strong>Licenses, Certificates, Registrations</strong>\n<br><br>\nN/A\n<br><br>\n<strong>Computer/Office Equipment Skills</strong>\n<ul>\n<li>Demonstrated proficiency and an advanced working knowledge of SQL (structured query language), quality improvement principles, and a solid knowledge of database design principles.</li><li>Demonstrated experience in developing, analyzing, interpreting, and managing a variety of complex data sets.</li><li>Demonstrated capabilities in planning, participating, and managing a variety of complex analytics projects.</li><li>Demonstrated strong proficiency using word processing, spreadsheet, database, internet and e-mail, and scheduling applications, as well as statistical and analytical software systems such as SAS, SPSS, Statit, R, Python, etc.</li><li>Demonstrated experience in a role requiring effective verbal, written, and interpersonal communication skills.</li><li>Prefer a working knowledge of Marketing Customer Information File (MCIF)</li>\n</ul>\n<strong><strong>Managerial Responsibility</strong></strong>\n<br><br>\nHas no direct reports.\n<br><br>\n<strong>Language Skills</strong>\n<br>\nMust have the ability to read, understand and carry out instructions in written and oral form.\n<br><br>\n<strong>Other Skills and Abilities</strong>\n<ul>\n<li>Project management</li><li>Adaptive to change</li><li>Innovative</li><li>Responds positively to altered circumstances or conditions</li><li>Effective communication skills with technical team members as well as business partners.<br><br>Able to distill complex ideas into straightforward language</li>\n\n</ul>\n<strong>PHYSICAL ABILITIES / WORKING CONDITIONS</strong>\n<br><br>\n<strong>Physical Demands</strong>\n<br>\nHas the ability to talk, hear, sit, use hands to handle or feel and reach with hands and arms consistently. Ability to stand, walk, kneel and crouch occasionally\n<br><br>\n<strong>Vision Requirements</strong>\n<br>\nClose vision (clear vision at 20 inches or less) Distance Vision (clear vision at 20 feet or more)\n<br><br>\n<strong>Weight Lifted or Force Exerted</strong>\n<br>\nAbility to lift up to 10 pounds consistently and up to 50 pounds occasionally\n<br><br>\n<strong>Environmental</strong>\n<br>\nThere are no unusual environmental factors\n<br><br>\n<strong>Noise Environment</strong>\n<br>\nModerate noise (business office with computers and printers, light traffic)\n<br><br>\nMountain America Credit Union is an EEO/AA/ADA/Veterans employer."}