{"job title": "Research Scientist, Graphics (PhD University Grad)", "company": "Oculus VR", "city state": "– Redmond, WA", "rating": "4.5", "job description": "Research Scientist, Graphics (PhD University Grad)Research | Redmond, WA\n<br><br>\nAt Facebook Reality Labs our goal is to make great consumer virtual, augmented, and mixed reality experiences that ship in five to ten years. We are currently seeking innovative researchers for a position of Research Scientist in Graphics with an interest for technology to develop next generation graphics systems at our research location in Redmond, WA. The focus of this role is on computer graphics with the primary responsibility being the efficient synthesis of high quality images, including realistic shading, application of machine learning methods, ray tracing, geometry processing and compression, perceptual rendering, rendering for new displays, and global illumination. The full-time position requires publications in computer graphics journals, computer engineering, or similar areas, and a strong background in graphics and programming, as well as solid mathematical skills.\n<br><br>\nThe ideal candidate will have the ability to obtain and maintain work authorization in the US at the time of hire.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Lead graphics research projects that span cross-functional teams</li>\n<li>Develop new graphics technologies for improving the rendering quality and efficiency and driving future head mounted displays</li>\n<li>Collaborate with other researchers and engineers to develop methods that impact the future graphics pipeline</li>\n<li>Publish and present papers in international conferences and journals, attend top conferences in graphics and related fields</li>\n</ul>\n\n<strong>Minimum Qualifications</strong>\n\n\n<ul>\n<li>Currently has or is in the process of obtaining a PhD degree or completing a postdoctoral assignment in the field of computer graphics, image processing or similar</li>\n<li>3+ publications at a tier-1 or tier-2 computer graphics conference/journal</li>\n<li>3+ years of experience in C++, at least one of the following: Vulkan, CUDA, DirectX, or DXR</li>\n<li>2+ years of experience with image synthesis, e.g., rendering, sampling, reconstruction, ray tracing, shading, level of detail</li>\n<li>2+ years of experience with real-time or interactive computer graphics</li>\n<li>Interpersonal experience: cross-group and cross-culture collaboration</li>\n<li>Must be available to start employment on or after September 1st, 2018</li>\n</ul>\n\nPreferred Qualifications\n\n\n<ul>\n<li>1+ years of experience with machine learning</li>\n<li>1+ paper(s) published on machine learning for graphics</li>\n<li>Proven track record of achieving results as demonstrated by grants, fellowships, patents, as well as first-authored publications at leading workshops or conferences such as SIGGRAPH, Eurographics, HPG, EGSR, etc.</li>\n</ul>"}