{"job title": "Senior Director of Big Data Science &amp; Analytics", "company": "RecruiterDNA", "city state": "– Austin, TX", "rating": "NA", "job description": "<strong>Job description</strong>\n<br><br>\n<strong>Position Purpose:</strong>\n<br><br>\nProvide vision, strategy and operational leadership for the company’s health economics functions relating to business development, financial outcomes and contracting analysis.\n<br><br>\nServe as primary corporate analytical contact for the company to support the information needs to support strategic and operational goals and objectives. Support all lines of business\n<br><br>\n(Medicare/Medicaid/Exchanges/ASO/Hybrid), corporate departments, specialty companies, and state agencies in reviewing all costs Manage inpatient estimation process for all health plans to price out all stays for use in the month-end close process.\n<br><br>\nManage revenue reconciliation process including verifying correct payments from the state, correct eligibility setup in the system, and correct claims payments Provide internal consulting for financial, IT, RFPs, rate setting and operational processes\n<br><br>\nMonitor and correct data quality and data processes throughout the organization Provide utilization and cost analyses to support health plan and corporate health benefits ratio, utilizing enterprise analytic and predictive models and data analysis tools.\n<br><br>\nCreate an analytical environment that enhances medical cost decisions to maximize utilization of these tools. Support the business process and systems to ensure of the health economics/data warehouse data.\n<br><br>\nDirect the consolidation of health information to support medical expenditure and utilization analyses and evaluate new tools/models to support business Identify risks and opportunities associated with future profitability and member retention\n<br><br>\nSupport merger and acquisition opportunities with financial and statistical analysis\n<br><br>\nConduct medical cost data economic analysis, research and development projects for the Health Plan’s and Finance to identify strategic and operational opportunities, using enterprise tools\n<br><br>\nOverview:\n<br><br>\nThe Senior Director of Data Science will lead the Data Science area within Data Science &amp; Analytics. This team is dedicated to building data-driven solutions that have a measurable impact across all parts of the organization by aiding strategic product and content. The role will require a deep understanding of machine learning, deep learning, and AI techniques and their application in creating operational analytic solutions in member and provider analytics.\n<br><br>\nThe position requires someone who is comfortable striking a balance between cutting-edge and pragmatic solutions.\n<br><br>\nPartnering with business stakeholders, product engineers, IT professionals and other groups within Enterprise Analytics they will ensure that analytic solutions can be leveraged throughout the organization to drive Centene business strategies.\n<br><br>\n<strong>Primary responsibilities:</strong>\n<br><br>\nLead a team of talented data scientists in the design and development of foundational and operational analytic solutions that empower the organization to <strong>make key strategic decisions</strong> across the organization Be a thought leader in the application of <strong>cutting-edge techniques</strong> to real-world business problems\n<br><br>\nFoster a shared purpose among team members that enhances the capabilities of the team by building a collaborative learning environment\n<br><br>\n<strong>Qualifications:</strong>\n<br><br>\n<strong>Education/Experience &amp;</strong><strong> Minimum Qualifications:</strong>\n<br><br>\nBachelor’s degree in Finance, Economics, Statistics, Health Administration or related field.\n<br><br>\n8+ years of healthcare reporting and analytics. Leadership experience and skills required.\n<br><br>\nKnowledge of data systems, IT processes, and reporting tools including SQL, Teradata, Microstrategy required.\n<br><br>\nExperience with accounting practices, state reporting requirements, and rate setting activities preferred.\n<br><br>\nPreferred Qualifications/Skills: MS or in field of study (mathematics, physical or biological sciences, data science etc.) from an accredited institution Inquisitive, conceptual thinker comfortable working on complex problems at the cutting edge with the limited definition of scope or guarantee of expected outcome\n<br><br>\nDeep experience in the application of machine learning, deep learning and analytic techniques in a media or entertainment company within a big-data environment.\n<br><br>\nStrong background in analytic programming (R, SparkR, Python, SAS) and data manipulation (SQL) in a big-data environment\n<br><br>\nProven technical abilities, but must be capable of communicating complex analyses effectively to varying internal and external stakeholders, of varying seniority\n<br><br>\nCapability to lead multiple data science work streams simultaneously in a fast-paced environment in partnership with multiple business stakeholders\n<br><br>\nDemonstrated success executing and managing complex data science initiatives\n<br><br>\nDemonstrable experience leading a data science team in a healthcare, or big-data driven consumer-product company\n<br><br>\nDrive value in the broader business.\n<br><br>\nDevelops and communicates goals, strategies, tactics, project plans, timelines, and key performance metrics to align with multiple internal stakeholder departments and ultimately grow companies analytics capabilities.\n<br><br>\nApplies a broad business approach to find and create value for the company.\n<br><br>\nAdvanced level proficiency with statistical, machine learning modeling techniques such as regression, decision trees, neural networks, support vector machines, supervised/unsupervised clustering techniques, experimental test design, etc.\n<br><br>\nExpert theoretical knowledge of machine learning modeling techniques and advanced applied skills in developing predictive targeting models within distributed computing platforms such as Hadoop, AWS, Azure, GCP using tools like Spark, Scala, SAS, R, Python, Bayesian, H2O, Storm, Yarn, Kafka, Superior analytical skills.\n<br><br>\nAbility to perform insightful and actionable quantitative and qualitative analysis of the business.\n<br><br>\nStrong interpersonal skills-an outstanding ability to build relationships, influence and navigate within a complex organization.\n<br><br>\nPrepare and distribute medical cost lags and month-end close reporting to finance, utilizing enterprise tools\n<br><br>\nLicenses/Certifications: MBA, CPA preferred Employee\n<br><br>\nStatus: Regular\n<br><br>\nJob Level: Director/Sr. Director Job Type: Regular"}