{"job title": "Data Analyst", "company": "Staco Energy Products Co.", "city state": "– Miamisburg, OH", "rating": "2.5", "job description": "x\n<br><br>\n<strong>THE COMPANY:</strong>\n<br><br>\nStaco Energy Products Company is one of the longest lasting innovators of Power Quality and Voltage Control technologies in the world. In an industry where companies come and go, Staco Energy continues to provide products with the reliability and continuity that their customers need.\n<br><br>\n<strong>THE TEAM:</strong>\n<br><br>\nThe Staco <strong>Innovation Team</strong> is a creative, interactive, and agile team who is committed to exploring new approaches, partnerships, and technologies that are critical to Staco's ability to provide their customers with the tailored power solutions that they seek.\n<br><br>\nWe sit at a unique intersection, where a company that works on providing tailored power solutions meets the startup thinking, the technology, and the partners that turn this energy into scalable solutions. Our team disregards barriers to find solutions, collaborates constantly in an open environment, and is energized by the challenges we aim to tackle.\n<br><br>\n<strong>THE ROLE:</strong>\n<br><br>\nThis is a great opportunity for a skilled Data Analyst to join the Innovation Team of a leading manufacturing company. The role will be temporary for 1 year, at which point it could potentially convert to a full-time position. Reporting to the Innovation Team's Marketing Manager, the Data Analyst will work closely with other Innovation Team members to deliver solutions that support the strategic initiatives and decision making of the Innovation Team. The Analyst's work focuses on transforming data, improving information quality, and expanding the team's access to business analytics. You will engage in a wide variety of data-centered projects, and consistently work with teams of professionals across multiple departments.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Gathering and analyzing data for the innovation team to evaluate and use to make decisions</li> <li>Evaluating software platforms for most efficient usage</li><li>Historical cost analysis of services across various product line</li><li>Evaluating existing and potential channel partnerships and report findings to innovation team</li><li>Perform data quality analysis to ensure accurate and complete data</li><li>Develop process documentation to provide on-going support of data analytics</li><li>Identify business process improvements by understanding technical problems and solutions as they relate to business needs</li>\n</ul>\n<strong>KEY REQUIREMENTS</strong>\n<ul>\n<li>Bachelor's degree or equivalent experience</li><li>2-5 years relevant work experience</li><li>Ability to work with no supervision while performing duties, to work under pressure and time constraints and pro-active self-starter who thrives on independently seeking out information that may not be readily available.</li><li>Analytical mind, service-minded approach and keen to resolve problems and excellent organizational skills, ability to multi-task and manage priorities. Ability to deal with complex problems involving multiple facets and variables in non-standardized situations.</li><li>Product Service, Repair, and Warranty Experience is a plus</li><li>Proficient in Microsoft Office</li><li>Experience using CRM and ERP systems</li>\n</ul>\n\n<strong>Job Posted by ApplicantPro</strong>\n<br>"}