{"job title": "Data Analyst FD", "company": "SyApps", "city state": "– Dallas, TX", "rating": "4.0", "job description": "SyApps is a technology and management consulting services firm focused on providing solutions in strategy, processes, technology and management. As a diverse end-to-end IT and management solution provider, SyApps offers a range of technical expertise thelp customers compete successfully in an ever changing marketplace.\n<br><br>\nPlease visit us at www.syapps.com.\n<br><br>\nSAS Developer to design, develop, and implement applications using SAS and SQL to support business requirements.\n\n\n<ul>\n<li>Responsible for translating data requirements into formal and standardized physical and logical model that conforms to Enterprise Guidelines.</li>\n<li>Document data flows, data mappings and data exchange between applications. Work with business and technical partners to create data dictionary.</li>\n<li>Provide technical assistance to data projects or operations to maintain enterprise-wide standards and will help align findings and insights to deliver business requirements.</li>\n<li>Develop processes and tools to monitor and analyze data accuracy.</li>\n<li>Manage initiatives focused on implementing enterprise data management capabilities.</li>\n<li>Assist team in establishing data security guidelines for data subject to specific regulatory requirements.</li>\n<li>Strong knowledge of computer software, such as SQL, ER Studio, Aginity Workbench, Toad, etc.</li>\n<li>Bachelor's degree in a technical field such as computer science, computer engineering or related field required.</li>\n<li>MBA or other related advanced degree preferred.</li>\n<li>5-7 years experience required.</li>\n</ul>\n\nLocation: Dallas, TX\n<br><br>\nSyApps LLC is a Winner of the SmartCEO/Grant Thornton Future 50 Award for being recognized as one of 50 fastest growing companies in the Greater Washington Area.\n<br><br>\nWe are proud of our diverse environment, Equal Opportunity Employer. SyApps is committed ta policy of equal employment opportunity. SyApps participates in E-Verify.<br><br>SDL2017"}