{"job title": "Data Analyst", "company": "UnitedHealth Group Inc.", "city state": "– Overland Park, KS", "rating": "3.3", "job description": "No industry is moving faster than health care. And no organization is better positioned to lead health care forward. We need attention to every detail with an eye for the points no one has considered. The rewards for performance are significant. You'll help improve the health of millions. And you'll do your life's best work.(sm)\n<br><br>\n<strong>Primary Responsibilities:</strong>\n\n\n<ul>\n<li>Conducting analysis to identify and recognize trends, performing normalization operations and assuring data quality for the purposes of demand and inventory planning</li>\n<li>Collaborating with suppliers on forecasted usage and identifying potential supply constraints</li>\n</ul>\n\n<strong>Required Qualifications:</strong>\n\n\n<ul>\n<li>Undergraduate degree or equivalent experience</li>\n<li>5 years specific knowledge in supply chain and demand planning</li>\n<li>2 years experience with data analysis and data analytical tools</li>\n</ul>\n\nCareers with OptumRx. We're one of the largest and most innovative pharmacy benefits managers in the US, serving more than 12 million people nationwide. Here you'll fill far more than prescriptions. As a member of one of our pharmacy teams, you're empowered to be your best and do whatever it takes to help each customer. You'll find unrivaled support and training as well as a wealth of growth and development opportunities driven by your performance and limited only by your imagination. Join us. There's no better place to help people live healthier lives while doing your life's best work.(sm)\n<br><br>\nDiversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.\n<br><br>\nUnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment."}