{"job title": "Data Analyst", "company": "United Technologies Corporation", "city state": "– East Hartford, CT", "rating": "3.3", "job description": "<strong>Job Description</strong>\n<br><br>\nGo Beyond.\n<br><br>\nFlight is an instrument of human progress. It not only gets people where they want to go, it carries humanity to places it never thought possible.\n<br><br>\nAt Pratt&amp;Whitney, you'll be part of an evolving, globally diverse company that's moving fast to craft the future of aviation. Customers all over the world depend on our technology and the people behind it.\n<br><br>\nAs part of our team, you'll help answer today's challenges in powered flight while crafting and supporting tomorrow's solutions. Have you considered what it would be like to work at Pratt&amp;Whitney?\n<br><br>\nThis is a really exciting time at P&amp;W! As we continue to grow, there is a deep focus on our culture. We are committed to being a company that is transparent and mindful. We 've built an environment where each and every employee has value.\n<br><br>\nA rare opportunity exists to join us in the role of a Data Analyst - Business Support at our East Hartford, CT campus.\n<br><br>\nP&amp;W Engine Services handles long term maintenance agreements with airlines worldwide.\n<br><br>\nThe portfolio includes contracts for P&amp;W and IAE commercial engine models and covers services including: engine overhaul and repair, on-wing and off-wing maintenance planning, coordination of maintenance services, engine health monitoring, and logistical support.\n<br><br>\nThis role in the Business Analytics department in Engine Services would have you working with relational and non-relational database structures, perform data analysis tasks, and develop queries that deliver business value to process owners.\n<br><br>\nYou will work with process owners and third party vendors to provide complete, accurate and timely data sets and reports to support business requirements.\n<br><br>\nYou will also work with the data quality and governance analysts to ensure that the data being delivered meets end use expectations.\n<br><br>\nSpecific projects are expected to include estimate at completion process (contract financial forecasting), profit assurance and wing to cash initiatives, monthly/quarterly reports and ad hoc reporting.\n<br><br>\n<strong>Responsibilities / Accountabilities:</strong>\n\n\n<ul>\n<li>Identify and document business process owner data requirements.</li>\n<li>Assess data availability and quality to support business process owner needs.</li>\n<li>Craft and document efficient methods to query, summarize and present data in various formats.</li>\n<li>Carry out data management standards, guidelines and practices.</li>\n<li>Communicate results and meaning to business process owner and data consumers.</li>\n</ul>\n\nMust Be A US Citizen due to Government Contracts.\n<br><br>\nDo you have what it takes to join our Team?\n<br><br>\nEmployment Type\n<br><br>\nFull time"}