{"job title": "Financial Data Analyst", "company": "University of California", "city state": "– Davis, CA", "rating": "4.1", "job description": "Under general direction of the Director of Controls&amp;Accountability, provide high-level analytical and problem solving support in the areas of internal controls, ethics, accounting, higher education administration, relevant legal and regulatory requirements and financial analysis. Develop or enhance processes to find and mitigate control weaknesses. Monitor financial compliance and perform high level financial reporting. Position will also provide advice and support to fiscal officers across campus in support of the overall mission of the division. Act on behalf of the Director in his/her absence.\n<br><br>\n<strong>Physical Demands:</strong>\n<br><br>\nWork on a personal computer for extended periods of time.\n<br><br>\nOccasionally lift boxes of office supplies or files weighing 25 lbs.\n<br><br>\n<strong>Work Environment:</strong>\n<br><br>\nMust be able to work overtime.\n<br><br>\nLimited vacation usage during peak workload periods. Restricted vacation near beginning of the academic quarters and fiscal close.\n<br><br>\nEmployee is personally responsible for following safety guidelines/procedures.\n<br><br>\nUC Davis is a smoke and tobacco free campus effective January 1, 2014. Smoking, the use of smokeless tobacco products, and the use of unregulated nicotine products (e-cigarettes) will be strictly prohibited on any UC Davis owned or leased property, indoors and outdoors, including parking lots and residential space.\n<br><br>\n<strong>Background Check Required:</strong>\n<br><br>\nThis position is a critical position and subject to a background check. Employment is contingent upon successful completion of background investigation including criminal history and identity checks.\n<br><br>\nYes\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n<strong>Minimum Qualifications:</strong>\n<br><br>\nBachelor's degree in Accounting, Finance, Business Administration or finance-related field.\n<br><br>\nMinimum of five years as a financial or data analyst.\n<br><br>\nExperience using SQL queries and producing ad-hoc reports.\n<br><br>\nExperience with automated financial systems.\n<br><br>\nExperience analyzing financial issues in a multi-fund source, public service environment and presenting complex data in a way to facilitate decision-making.\n<br><br>\nExperience working with and understanding complex financial data attributes to analyze data, build reports and define requirements.\n<br><br>\nExperience working with budgets, generally accepted accounting principles, fund accounting and financial management practices.\n<br><br>\nExperience in preparation of statistical and financial data for business\n<br><br>\nplanning and evaluation.\n<br><br>\nAnalytical skills to map functional and system processes in support of\n<br><br>\nsystems.\n<br><br>\nAnalytical, problem-solving and management skills to independently research, develop and recommend solutions to complex problems and issues.\n<br><br>\nExperience in a customer service oriented environment.\n<br><br>\nOral and written communication skills for individual, group and formal presentation settings, and to interact effectively with diverse communities and senior leaders.\n<br><br>\nExperience with computers including software programs/applications (Microsoft Word, Excel, Access, Outlook, etc.).\n<br><br>\n<strong>Preferred Qualifications:</strong>\n<br><br>\nCPA license or other financial/audit certificate.\n<br><br>\nKnowledge of University and College fund accounting.\n<br><br>\nWorking knowledge of the National Association of College and University Business Officers (NACUBO).\n<br><br>\nExperience working with records covered by HIPAA (Health Insurance Portability and Accountability Act) and FERPA (Federal Educational Rights and Privacy Act).\n<br><br>\nExperience with UC financial systems (e.g., DaFIS, KFS, BANNER, etc.).\n<br><br>\nExperience auditing."}