{"job title": "Business Data Analyst - Risk Management - Full Time 8 Hour Days", "company": "University of Southern California", "city state": "– Los Angeles, CA", "rating": "4.3", "job description": "<strong>Minimum Education:</strong>\n\n\n<ul>\n<li>Bachelor Degree, Master Degree preferred</li>\n</ul>\n\n<strong>Minimum Experience/Knowledge:</strong>\n\n\n<ul>\n<li>Five years of experience in risk management, claims management, quality, performance improvement, patient relations, safety or other related healthcare position/setting (Preferred);</li>\n<li>Knowledge of JCAHO, Title 22, and CMS regulations pertaining to healthcare (Preferred);</li>\n<li>Knowledge of principles, practices, processes, quality assessment, performance improvement functions, and legal concepts related to healthcare or related field (Preferred);</li>\n<li>LEAN or Six Sigma Certification (Preferred)</li>\n</ul>\n\n<strong>Required License/Certification:</strong>\n\n\n<ul>\n<li>Fire and Safety Certification. If no card upon hire, one must be obtained within 30 days of hire, and maintained by renewal before expiration date.</li>\n</ul>\n\nThe Risk Management Analyst (Provider Services) supports the Office of Integrated Risk Management by providing departmental expertise in coordinating, accepting, and facilitating claims activities surrounding depositions and subpoenas; facilitating the updates to open and closed professional liability cases; tracking of USC Workers Compensation subpoenas; accepting, documenting, and processing all professional liability summons and complaints and notices of intent; managing the source of information medical malpractice certificates, claims history reports, and coverage issues; coordinating patient termination and warning letters; developing initial drafts of letters to regulatory agencies and processing them appropriately; coordinating with others in the Office of Integrated Risk Management Office in managing complex concerns; providing educational programs in both inpatient and outpatient settings; administrative support; and other duties as assigned. This role is critical to the Office's commitment to managing the claims and provider support services necessary to the Keck Medicine system as a whole.\n<br><br>\nUSC is an equal opportunity, affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristic protected by law orUSC policy. USC will consider for employment all qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring ordinance. We provide reasonable accommodations to applicants and employees with disabilities. Applicants with questions about access or requiring a reasonable accommodation for any part of the application or hiring process should contact USC Human Resources by phone at (213) 821-8100, or by email at uschr@usc.edu. Inquiries will be treated as confidential to the extent permitted by law.\n<br><br>\nRead USC's Clery Act Annual Security Report\n<br><br>\nRequired Legal Notices\n<br><br>\nCertain positions are subject to background screening\n<br><br>\nIf you are a current USC employee, please apply to this USC job posting in Workday by copying and pasting this link into your browser:\n<br><br>\nhttps://wd5.myworkday.com/usc/d/inst/1$9925/9925$21781.htmld"}