{"job title": "Senior Data Analyst", "company": "W. R. Grace &amp; Co.", "city state": "– Columbia, MD", "rating": "3.4", "job description": "<strong>Requisition ID:2819</strong>\n<br><br>\nBuilt on talent, technology, and trust, Grace is a leading global supplier of catalysts and engineered materials. The companys two industry-leading business segmentsCatalysts Technologies and Materials Technologiesprovide innovative products, technologies, and services that enhance the products and processes of our customers around the world. Grace employs approximately 3,900 people in over 30 countries.<br>\n<div>\nJob Description\n<br><br>\nThe Senior Data Analyst will work closely with cross-functional teams and executive leadership to identify and resolve data quality issues, define key performance indicators, and implement dashboards to support improved decision making at all levels.\n<br><br>\n<strong>Major Responsibilities</strong>\n<ul>\n<li>Subject matter expert for data sources used in analysis and reporting</li><li>Perform root cause analysis to identify data quality issues, system performance issues, and data discrepancy issues</li><li>Generate and present a summary of the data quality related issues to senior managers</li><li>Work with cross functional teams to develop, test, implement and maintain data quality rules</li><li>Work closely with stakeholders to identify and implement process improvements</li><li>Collaborate with key stakeholders throughout the company on key initiative to leverage SAP Analytics Cloud</li><li>Develop KPIs within the businesses to identify trends and evaluate success of the businesss initiatives</li><li>Work directly with the business to gather requirements and develop functional/technical specifications</li><li>Design, build and maintain reports/dashboards using data from our various systems to support data-driven decision making at all levels</li><li>Document and conduct end user training</li>\n</ul>\nRequired Skills\n<ul>\n<li>Strong communication, interpersonal, and influencing skills</li><li>Exceptional computer skills proficient in Microsoft Office Suite capabilities (Excel, Word, PowerPoint) and data visualization tools (Tableau, Qlik, Power BI, SAP Analytics Cloud, etc.)</li>\n</ul>\nRequired Experience\n<ul>\n<li>BS in Data Science, Information Technology, Finance, Economics, Statistics, or related field</li><li>Financial Planning and Analysis experience preferred</li><li>5+ years relevant experience in large multinational manufacturing corporation</li><li>Experience managing cross functional teams</li>\n</ul>\nPreferred Qualifications\n<ul>\n<li>MBA</li><li>SAP, SAP Analytics Cloud, and related systems</li>\n</ul>\n</div>\n<br>Grace is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any employee at Grace via email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Grace. No fee will be paid in the event the candidate is hired by Grace as a result of the referral or through other means."}