{"job title": "UR - IT Data Warehouse Analyst", "company": "3M", "city state": "– MAPLEWOOD, MN", "rating": "3.9", "job description": "<strong>3M is seeking a IT Data Warehouse Analyst for the Business Transformation &amp; Information Technology organization</strong> <strong>located in Maplewood, MN. At 3M, you can apply your talent in bold ways that matter. Here, you go.</strong><br><br><strong>Job Summary</strong>:<br><br>The person hired for the position of <strong>SAP HANA Data Warehouse Analyst</strong> will work with the global process teams to build and deploy standardized global reporting and analytical solutions as part of the Polaris project.<br><br><strong>This position provides an opportunity to transition from other private, public, government or military environments to a 3M career.</strong><br><br><strong>Primary Responsibilities</strong> include but are not limited to the following:<br><br>SAP HANA Data Warehouse Analyst for support of the SAP Supply Chain or Customer Facing areas including Make To Deliver or Logistics Execution or Order To Cash areas.\n<ul>\n<li>Design, develop and test HANA models/Business Warehouse extracts from SAP based on a functional design specification</li><li>Analyze, design, code/develop and implement changes to resolve break/fix issues to resolve and close tickets during both testing cycle of project and in production.</li><li>Understand the functionality of relevant process area and data that will be required to Build, Test and implementation</li><li>Responsible for coordination of all deliverables in their area of HANA/BW and on time delivery per release timelines</li>\n</ul>\n<strong>Basic Qualifications:</strong>\n<ul>\n<li>Currently possess or in the last year of pursuing a bachelors degree, or higher, in in Computer Science, Management Information Systems or Analytics from an accredited university</li>\n</ul>\n<strong>Preferred Qualifications:</strong>\n<ul>\n<li>Current cumulative GPA of 3.0 or higher on a 4.0 scale</li><li>Exposure to SAP tools and technology or taken course work on SAP technology</li><li>Previous internship experience in SAP implementations or previous working experience in Information Technology</li><li>Working knowledge on SQL queries</li><li>Self-motivated with the ability to prioritize, meet deadlines, and manage changing priorities</li><li>Excellent interpersonal, problem-solving skills with the ability to work independently and in a team environment</li><li>Have a strong background and interest in technology</li>\n</ul>\n<strong>Location:</strong> Maplewood, MN<br><br><strong>Travel:</strong> May include up to 10% domestic/international travel<br><br><strong>Relocation:</strong> Is authorized<br><br>Must be legally authorized to work in country of employment without sponsorship for employment visa status (e.g., H1B status).<br><br>See job description."}