{"job title": "Configuration/Data Management Analyst", "company": "Abacus Technology", "city state": "– US-MA-Lexington", "rating": "3.2", "job description": "<div><div>\n<div>Abacus Technology is seeking a Configuration/Data Management Analyst to provide support for the Command, Control, Communication, Intelligence and Networks (C3I&amp;N) Directorate at Hanscom AFB. This is a full-time position.</div>\n</div>\n</div>\n\n<br>Responsibilities<br>\n\n<div>\n<div>\n<div>Conduct and prepare configuration management (CM) plans and procedures, perform configuration audits, monitor trouble reports and change requests, evaluate and select tools to automate the change control process, and provide status accounting support. Coordinate with users and developers on the release of new software versions. Establish, operate, and maintain program documentation support libraries. Assist in the evaluation, definition, standardization, and tracking of data elements and object names. Determine entity relationships, assigns attributes, and develops procedures for maintaining enterprise data models. Facilitate working groups of functional experts to establish central repository requirements for data storage, protection, and retrieval. Create and populate data dictionaries. Provide full range of data mapping, validation, and documentation support as well as electronic records management.</div>\n</div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div>5+ years experience in configuration and data analysis and management. Bachelor’s degree in a related field. Knowledge of the CM process and inputs across the project life cycle and the handling of Data Item Descriptions (DIDs). Experience developing CM plans and performing system audits. Able to track change requests and provide regular status updates to all invested parties. Familiarity with data modeling and/or data analysis. Experience implementing or administering automated CM/DM tools is a plus. Must have solid communication skills and be capable of interacting with staff at all levels of an organization. Must be a US Citizen.\n<br><br>\n<strong><em>Applicants selected will be subject to a U.S. government security investigation and must meet eligibility requirements for access to classified information.</em></strong>\n<br><br>\n<strong><em>EOE/M/F/Vet/Disabled</em></strong></div>\n</div>\n</div>\n<br>"}