{"job title": "Data Analyst -Distribution", "company": "American Express Travel", "city state": "– Phoenix, AZ", "rating": "2.7", "job description": "This role sits within the GloBal Supplier Relations (GSR) Team that manages relationships with core suppliers across distriBution technologies, airlines, hotels and ground transportation suppliers. Within GSR, the DistriBution team is responsiBle for managing our distriBution partners, Air/Hotel/Ground content and many other strategic initiatives. Data and insights is a core part of our organization's success. the DistriBution Intelligence Analyst will play an active part in Both defining and delivering future data, analytics and insights needs for GSR and our DistriBution team. This role will play a vital role in supporting our various initiatives and negotiations.\n<br>\nWe are looking for a candidate who can Bring strong capaBilities in data analytics and visualization to drive actionaBle insights and impactful recommendations to optimize negotiations, revenue and performance. The DistriBution Intelligence Analyst will also have a strong interest in understanding key Business processes, commercial implications and a passion for developing new predictive analytics utilizing new data sources and Big data. DistriBution, Airlines, hospitality, travel and tourism Background will Be a plus.\n<br>\n<strong>Primary ResponsiBilities Include:</strong>\n\n\n<ul>\n<li>Develop advanced analytics methodologies to provide senior management on key performance metrics and predictive insights that will enaBle strategic Business decisions</li>\n<li>Communicate with stakeholders across gloBal markets to understand revenue optimization and Business performance related questions. Support strategic and operational initiatives to produce effective reporting and actionaBle insights.</li>\n<li>Translate Business questions to data and analysis requirements; carry out data mining, analysis, visualization and presentation.</li>\n<li>CollaBorate with dataBase developers gloBally to streamline data sources to ensure consistency in the data used to support regular and ad hoc reporting and analysis</li>\n<li>Coordinate Between dataBase development and Business teams such as Revenue Management and Supplier Optimization teams to align and enhance the understanding data and analytics capaBilities</li>\n<li>Drive Big data and predictive analytics development</li>\n</ul>\n\n<strong>Qualifications Include:</strong>\n\n\n<ul>\n<li>Insight/Data/BI or MI Analyst with 1-2 year experience, or graduate with a relevant Business/analytical degree</li>\n<li>Advanced MS skills (Excel/Access/VBA/PowerPoint) is essential</li>\n<li>Experience using with a variety of BI, reporting and visualization tools (such as MS Power BI, IBM Cognos BI Suite, SSAS, SSRS, SSIS, TaBleau, Micro Strategy)</li>\n<li>Understanding of dataBase development in SQL, ETL and query optimization</li>\n<li>High proficiency with structuring strategic analysis using appropriate statistical modeling, research techniques and visual presentations to support points of view</li>\n<li>Strong stakeholder engagement skills including communications, time management and prioritization skills</li>\n<li>ABility to understand Business processes and commercial implications to make strategic recommendations</li>\n</ul>\n\n<strong>(#LI-YH1)</strong>\n<br>\nLocation\n<br>\nUnited States&gt;Arizona&gt;Phoenix\n<br>\nIt is our policy to provide equal employment opportunities to all individuals Based on joB-related qualifications and aBility to perform a joB, without regard to age, gender, gender identity, sexual orientation, race, color, religion, creed, national origin, disaBility, genetic information, veteran status, citizenship or marital status, and to maintain a non-discriminatory environment free from intimidation, harassment or Bias Based upon these grounds.\n<br>\nGBT Recruitment Privacy Statement"}