{"job title": "Data Analyst (SAS Software)", "company": "Amtec Inc.", "city state": "– Lake Oswego, OR", "rating": "2.9", "job description": "Job Description<div><strong>Job Title: Technical Data Analyst Associate</strong>\n<br><br>\n<strong>Job Type: 4-6 months contract</strong>\n<br><br>\n<strong>Location: Lake Oswego, OR</strong>\n<br><br>\nThe Technical Associate position is an intermediate consulting staff position. This job is qualitative and quantitative in nature. Projects can range from industry research and data collection to preparation of statistical, financial and other forms of data analysis. Must have experience with SAS and the ability to utilize various tools such as Excel and Python to analyze data. Experience working with Microsoft Excel needs to include complex formulas, pivot tables, and charting.\n<br><br>\n<strong>Key Accountabilities:</strong>\n<ul>\n<li>Accountable for fully understanding how to construct the Bates standard analysis schedules; develops good understanding of the proprietary programs used to create them and the underlying purpose of each schedule</li><li>Accountable for preparing more complicated schedules with the expectation that a minimum of your time will be spent on standard analysis</li><li>Provides leadership and regular coaching to Analysts</li><li>Consults with case managers and experts regarding case work product</li><li>Accountable for preparing technical work product and presentation materials through the use of computer modeling, including the development of comprehensive and complex work product</li><li>Accountable for progress towards discussing/explaining Bates Group products with case managers and providing input into how to address case issues</li><li>Adheres to firm administrative policies, professional conduct and practices</li><li>Assumes other duties as assigned by management</li>\n</ul>\n<strong>Requirements:</strong>\n<ul>\n<li>BS or BA from an accredited college or equivalent experience working in professional services; accounting, legal or financial services</li><li>2-3 years relevant experience</li><li>Technical knowledge – Ability to utilize SAS and Python etc. to analyze data. High level experience with Microsoft Excel including experience in complex formulas, pivot tables and charting.</li><li>Research skills - Ability to gather, analyze, and summarize data from client databases, public and commercial databases and specialized industry resources</li><li>Organizational skills - Ability to prioritize tasks and meet deadlines</li><li>Interpersonal skills – Applies flexibility when faced with multiple project deadlines; exceptional capability to work independently and as part of a team, and interact with all levels of staff and management</li><li>Comprehension and Business Writing - Ability to read and interpret general and specialized business periodicals, professional journals and government regulations, and proofread reports and business correspondence written in English; able to follow written and oral instructions</li><li>Client facing ability and strong communication skills – both written and verbal</li><li>Strategic thinking and excellent organization and time management skills</li><li>Acts in line with the company’s core values: principled, accountable, connected to the client, independent, exhibits strong work ethic, provides quality services and products, values the company's employees, has fun, and values leadership</li></ul></div>\n<br>\nCompany Description<div>At Amtec, we care about you and your career. Since 1959, we have changed the lives of thousands of people for the better - people just like you. It is our goal to help you find meaningful work by matching your character, competence, and culture with an organization that truly values what you have to offer. Whether you want a contract assignment, a temp-to-perm job, or a regular full-time position, we are here to be your partner throughout your whole career.</div>"}