{"job title": "Assistant Data Analyst", "company": "AssuredPartners", "city state": "– Louisville, KY", "rating": "3.2", "job description": "<strong>Job Title:</strong> Data Analyst Project Assistant\n<br><br>\n<strong>Department:</strong> Operations\n<br><br>\n<strong>Reports To:</strong> Director of Operations\n<br><br>\n<strong>FLSA Status:</strong> Non-Exempt\n<br><br>\n<strong>Job Code:</strong> Admin II\n<br><br>\n<strong>Summary</strong>: Assists Systems Data Analyst in executing all agency management system conversions. Will work with AssuredPartners Conversion team to ensure a successful conversion process from original source systems to converting management system.\n<ul>\n<li>Ability to assist in executing mapping between source systems to converting new system in Excel documents.</li><li>Capacity to review data sets from reports for trends, cleanup needs, and system configuration at the direction of the System Data Analyst for each conversion project.</li><li>Assist in importing data from original source system to templates to successfully complete “manual” conversion imports into converting system via SQL server applications.</li><li>Document and understand the reasoning for documenting aspects of prior source system configure, Data Analysts review of system applications, and all workflows performed by the team.</li><li>Scrub reports for cleanup to converting system both pre and post conversion with Systems Data Analyst.</li><li>Learn and become an assisting resource for reporting functionality source systems such as Epic, AMS360, TAM, and Sagitta.</li>\n</ul>\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<br><br>\n<strong>Education and/or Experience</strong>\n<br><br>\nBachelor's degree (B. A.) from four-year college or university and/or Minimum of 3-5 years insurance experience; Insurance data conversion experience preferred and/or proficient Excel knowledge.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}