{"job title": "Business Data Analyst", "company": "Assurant Solutions", "city state": "– FL-Miami", "rating": "3.1", "job description": "The\n<br>\nprimary objective of this position is to serve as either lead or support\n<br>\nanalyst on project requests as submitted by internal and external clients. This\n<br>\nrequires independent and team-based work across multiple lines of business\n<br>\nwhile utilizing a range of analytical techniques and tools. All members\n<br>\nof Data Analytics enjoy working with some of the most diverse global data sets,\n<br>\ncutting edge technology, and the ability to see data insights turned into real\n<br>\nbusiness results on a regular basis.\n<br><br>\nThe Data\n<br>\nAnalyst / Behavioral Analyst position requires professional and technical\n<br>\nexperience in a multidisciplinary set of data sciences to lead individual and\n<br>\norganizational development of primary initiatives. This position may also\n<br>\nrequire partnership with other key internal/external business and IT personnel\n<br>\nto promote the effective and efficient use of analytical tools and resources. \n<br>\nThese tools and resources will be utilized in managing customer interactions,\n<br>\nincreasing market share, communicating and enhancing competitive advantages,\n<br>\nand maximizing revenue and/or profits while reducing costs across all lines of\n<br>\nbusiness within Assurant.\n<br><br>\n<strong>Operations Execution\n<br>\n– 70&amp;</strong>\n<ul>\n<li>Analyze\n<br>\n effectiveness of analytical products and services to constantly improve tools,\n<br>\n procedures, and workflows that minimize risk and enhance customer\n<br>\n experience</li><li>Transform\n<br>\n data into insights through leveraging internal and external tools (e.g.,\n<br>\n R, SAS, Python, SQL, Hadoop, Excel, Sawtooth, CART, etc.) to identify\n<br>\n and quantify opportunities</li><li>Partial\n<br>\n Management of data and data requests to improve the accuracy of\n<br>\n decision-making and efficiency of resources, personnel and data</li>\n</ul>\n\n<div><strong>Effective Communication -20\"</strong></div>\n\n<ul>\n<li>Understands\n<br>\n the business’ opportunities to hypothesize as an individual\n<br>\n researcher and in collaboration with other team members\n<br>\n in identifying the optimal business solution</li><li>Produces\n<br>\n clear, insightful, understandable work products (visualizations, reports,\n<br>\n presentations, etc.) to outline business opportunities and actionable\n<br>\n recommendations internally and externally</li><li>Effectively\n<br>\n partner with I/T, Account Management, Operations, Digital, Finance,\n<br>\n Marketing and others to communicate findings from team’s analytical\n<br>\n insights, design tests and incorporate recommendations into business\n<br>\n processes</li><li>Collaborates\n<br>\n with Behavioral Analytics team members to prioritizes requests requiring\n<br>\n multiple resources for thorough project completion within stated timelines</li><li>May\n<br>\n participate in the talent acquisition process by screening and\n<br>\n interviewing candidates at all levels</li>\n</ul>\n<strong>Strategy Development\n<br>\n– 10&amp;</strong>\n<ul>\n<li>Build\n<br>\n strategic insights and planning function that not only executes various\n<br>\n projects and studies but also adds substantial value to the\n<br>\n decision-making process through proactive data analysis, reporting, and\n<br>\n research</li><li>Work\n<br>\n cross-functionally with business owners to develop innovative advanced\n<br>\n analytics products that will increase customer experience, capitalize\n<br>\n growth opportunities, deliver competitive advantage and improve decision\n<br>\n making</li><li>Participate\n<br>\n and drive data modeling and governance best practices.</li><li>Partial\n<br>\n project management operations in order to drive all aspects of projects\n<br>\n including: understanding business requirements from stakeholders,\n<br>\n independently formulating analysis approach and creating hypothesis,\n<br>\n identifying required data, preparing data for analysis, testing\n<br>\n hypothesis, conducting analysis, presenting complex information for\n<br>\n various audiences in simplified terms, and identifying next steps and\n<br>\n future opportunity</li><li>Remains\n<br>\n abreast of developments in the field(s) of insurance, management, and data\n<br>\n sciences by attending self-development programs, interacting with peers,\n<br>\n and reviewing pertinent literature. Incorporates advancements when\n<br>\n practicable and cost effective.</li>\n</ul>\n\n<br>\n<div><strong>Basic Qualifications:</strong> </div> \n\n<ul>\n<li>Bachelor’s\n<br>\n Degree in Statistics, Economics, Applied Mathematics, Computer Science, or\n<br>\n Information Management</li><li>2 years\n<br>\n of experience in business analysis, research, statistics, applied\n<br>\n mathematics, data management, business intelligence, or related fields</li><li>2 years\n<br>\n of working experience with data science tools (e.g., R, SAS, Python,\n<br>\n SQL, Hadoop, Advanced Excel, Tableau, PowerBI, Sawtooth, CART, etc…) and\n<br>\n relational database software</li><li>2 years\n<br>\n of experience in data analysis that includes translating insights into\n<br>\n recommendations</li><li>Effective\n<br>\n presentation and communication skills</li> <li>Ability\n<br>\n to travel at least once per quarter (10\n<br>\n)</li>\n</ul>\n\n<br>"}