{"job title": "Eligibility Analyst Associate - AEP (Healthcare and Data entry exp)", "company": "Collabera", "city state": "– Nashville, TN", "rating": "3.9", "job description": "Job Description<div><strong>Duration: 4 months contract with high possibility of extension</strong>\n<br><br>\n<strong>Duties</strong>\n<ul>\n<li>Responsible for determining plan eligibility and enrolling members within CMS regulatory guidance.</li><li>Work to “save” members with incorrect/incomplete applications by performing customer, physician and/or agent outreach and using support tools. Maintain member demographic update and membership revalidation and apply eligibility requirements for membership changes.</li><li>Research and respond to eligibility inquiries as needed.</li><li>Ensures all enrollment eligibility is reconciled and maintained in accordance with CMS and departmental guidelines, requirements, regulations, policies, and procedures.</li> \n</ul>\n<strong>Day to Day Activity</strong>\n<ul>\n<li>A typical day in this position involves reviewing incoming applications, keying information into systems, determining eligibility, and saving submissions as needed.</li><li>Phone calls to potential customers and Medicaid systems will be made as needed throughout the day.</li><li>In addition to phone calls, websites will be reviewed to gather additional information on enrollees.</li>\n</ul>\n<strong>Interviews Phone Screens and then onsite interviews hosted like a job fair</strong>\n<ul>\n<li>Excellent verbal and written communication skills - communications should be respectful, professional, proactive and polite at all times.</li><li>Must be able to react quickly and proactively in a rapidly changing and dynamic work environment.</li><li>Strong Customer Service skills must be highly customer centric.</li><li>Ability to manage multiple tasks simultaneously in a fast-paced, customer-oriented environment</li><li>Proficiency with MS Office recommended.</li> <li>Strong organizational skills</li></ul></div>\n<br>\nCompany Description<div>Established in 1991, Collabera is a leading, global, end-to-end information technology consulting, services and solutions company. Collabera focuses on helping businesses “bridge the execution gap” and experience accelerated business performance. Its client-centric philosophy, commitment to service excellence and a Collaborative Engagement Model enables its global 2000 and leading mid-market clients to succeed in today’s global digital economy. With over 6000 professionals operating from 19 locations and 3 delivery centers worldwide, Collabera provides onsite, offsite and offshore technology consulting, services and solutions to leading Financial Services, Technology, Communications &amp; Media, Energy &amp; Utilities and Manufacturing, Retail &amp; Logistics corporations. The privately held company has offices in the U.S., Europe, and India.</div>"}