{"job title": "Data Analyst - Strong Start to Finish Grant", "company": "Cuny Research Foundation", "city state": "– New York, NY", "rating": "3.9", "job description": "<div>\nGeneral Description<br><br>The City University of New York (CUNY) is the nation's leading urban public university serving more than 270,000 students in degree programs at 24 colleges and institutions in New York City. CUNY’s Office of Policy Research provides research, analysis, and recommendations to the Chancellery to guide policy and to evaluate academic and administrative processes.\n<br><br>\nUnder the supervision of the Director of Policy Research, the Data Analyst will support CUNY’s involvement in the Strong Start to Finish grant, which will promote a transition from traditional remedial education to more effective practices and increase students’ academic momentum. The Data Analyst will support project development and decision-making by managing, analyzing, and reporting data.\n<br><br>\nResponsibilities may include but are not limited to:\n\n<ul>\n<li>Use statistical programs (SQL, Stata, R, or SPSS) to extract, clean, and prepare data for internal analysis and reporting to funders</li>\n<li>Analyze trends in enrollments in and student outcomes from various types of courses and interventions</li>\n<li>Produce briefings, progress reports, and materials for project evaluation based on data</li>\n<li>Communicate with project managers and stakeholders</li>\n</ul>\n\n</div><br>\n\n<div>\nOther Duties</div><br>\n\n<div>\nQualifications<br><br>Basic Qualifications:\n\n<ul>\n<li>Bachelor’s Degree with formal training in quantitative research methods</li>\n<li>Experience writing syntax in Stata, R, or SPSS</li>\n<li>Experience building and using complex datasets</li>\n<li>Ability to work independently or as part of a team, as needed</li>\n<li>Strong organizational skills, with the ability to prioritize tasks</li>\n<li>Attention to detail</li>\n<li>Strong written/verbal communication skills</li>\n</ul>\nPreferred qualifications:\n\n<ul>\n<li>Experience writing SQL syntax</li>\n<li>Some familiarity with higher education policy</li>\n</ul>\n\n</div>\n\n<br>"}