{"job title": "Data Analyst (Commercial coordination team)", "company": "Dante International", "city state": "– ", "rating": "4.1", "job description": "<strong>Responsibilities</strong>\n\n<ul>\n<li> Works closely with the Direct Manager, Commercial Directors, Business Unit Managers, Product/Category Managers, Business Intelligence team and other stakeholders in order to support them to make informed decisions based on data;</li>\n<li>Clean and extract data from a variety of sources in order to connect and unify data in a single and accurate view;</li>\n<li>Identify and interpret trends or patterns in complex data sets;</li>\n<li>Monitor performance and quality of result data, plan for improvements;</li>\n<li>Use statistical and\\or machine learning techniques to develop scalable solutions to address the business needs.</li>\n</ul>\n<strong>Requirements</strong>\n\n<ul>\n<li>Self-motivated, proactive;</li>\n<li>Has a constructive approach toward problems;</li>\n<li>Open to new approaches;</li>\n<li>Eye for detail, capable of spotting flaws in processes and data inconsistencies;</li>\n<li>University degree in a quantitative academic discipline (e.g. statistics, mathematics, cybernetics, etc.) or equivalent professional experience;</li>\n<li>1+ years of working experience in data analysis, ideally within a very large data set environment.</li>\n</ul>\n<strong>Will be a plus:</strong>\n\n<ul>\n<li>1 + years of knowledge and practical experience in applying machine learning (decision trees, artificial neural networks, clustering, unsupervised and supervised learning) and developing algorithms and models to solve business challenges.</li>\n</ul>\n<strong>Benefits</strong><br>\n<div>At eMAG, we are constantly moving forward and we love what we do. If you are passionate about your job, whether it’s offering consultancy to a customer or writing a code line, and you aim high, then you belong with us, the No. 1 IT company to work for in Romania (according to a Biz Magazine study in 2017).</div> \n<br>\n<div>We provide you with the best development programs to improve both your soft and job specific skills, but it is you who decides what you want to learn and where you want to go. The possibilities are endless.</div><br>\n\n<div><strong>We know benefits are important, that’s why we provide you with a full range of them:</strong></div>\n\n<li>Medical subscription;</li>\n<li>A monthly budget you can spend on flexible benefits - meal tickets, travel vouchers, trainings for your development;</li>\n<li>Employee discounts;</li>\n<li>Access to the Bookster library;</li>\n<li>Fruits, juice, water and coffee at the office;</li>\n<li>Other discounts (gym, pizza, car wash and others).</li>"}