{"job title": "Political Data Analyst - Outside Groups", "company": "Data Trust", "city state": "– Washington, DC", "rating": "4.0", "job description": "<strong>Summary</strong>: Data Trust is currently seeking a Data Analyst – Outside Groups, a full-time position, that will be responsible for working under the Deputy Director of External Support fielding requests from clients relating to voter and consumer data. The Data Analyst – Outside Groups will be responsible for managing client relationships and fulfilling various requests. They will be a motivated self-starter with an interest in politics and data.\n<br><br>\n<strong>About Us:</strong>  Data Trust is a young dynamic political data organization focused on center-right leaning advocacy and support.\n<br><br>\n<strong>Reporting:</strong> The Data Analyst – Outside Groups will report directly to the Deputy Director of External Support, as well as the Director of External Support.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n<li>Analyze election results and other datasets to provide actionable insights to clients, and proactively solicit client feedback.</li>\n\n<li>Become comfortable using SQL to manipulate Data Trust’s data into meaningful reports and tables for clients.</li>\n\n<li>Apply political knowledge and an understanding of the current climate to aid clients with strategic decisions making use of data and technical skills.</li>\n\n<li>Utilize thousands of political, demographic and consumer data points to create actionable voter universes that allow clients to achieve electoral goals.</li>\n\n<li>Adapt to ever-changing client needs and build a knowledge of campaign strategies and how Data Trust can help clients carry out voter outreach operations.</li>\n\n<li>Engage in creative destruction and entrepreneurialism to assist the External Support team with developing new products and processes to serve client needs.</li>\n\n<li>Serve as Data Trust’s point of contact with client organizations when needed.</li>\n</ul>\n<br><br>\n<strong>Qualifications:</strong>\n\n<ul>\n<li>An ideal candidate will be professional and reliable and display strong communication skills.</li>\n\n<li>The ability to effectively multitask while meeting deadlines.</li>\n\n<li>0-2 years of professional experience, preferably in campaigning/electoral politics, or political data.</li>\n\n<li>Possess an understanding of how data educates and interacts with the political process on all levels.</li>\n\n<li>Prior experience with a political campaign or committee is helpful.</li>\n\n<li>Proficiency in Microsoft Excel.</li>\n\n<li>A willingness to work longer-than-usual hours if needed, responsiveness, and a very close attention to detail.</li>\n</ul>"}