{"job title": "Data Analyst, Finance Analytics", "company": "Etsy", "city state": "– Brooklyn, NY", "rating": "3.8", "job description": "<div><div>Analysts at Etsy use rigorous analytics to generate insights that inform financial, product, marketing and business decisions across the company, and across the idea lifecycle -- from ideation to iteration to launch. Ultimately, the team’s work strengthens Etsy and helps continuously improve the accuracy and efficiency of our financial reporting and analysis. Learning new skills and techniques is not only a requirement but a perk of the job; we are always looking for opportunities to improve. Our mission is to tell the story of what is transpiring in the world of Etsy — to teams, to senior management, and to the community.</div><br>\n<div>Etsy’s Finance Analytics team plays an integral role supporting Etsy’s financial infrastructure - we own critical financial systems, continuously drive process improvement, and provide an analytical framework for critical decisions impacting revenue and operational drivers. The position requires an experienced analytics professional capable of juggling multiple priorities in a dynamic, rapidly growing organization who can partner across organizational and functional boundaries to drive loosely defined projects to successful completion.</div><br>\n<div>This role is located in Brooklyn, NY.</div></div><div><div>About the Role\n\n<ul>\n\n\n<ul>\n<li>Transform raw data into meaningful and impactful analysis characterized by strong data governance, technique transparency and thorough documentation and communication.</li><li>Partner with colleagues from Strategic Finance and Analytics, Accounting, Internal Audit, and other teams to improve financial analysis and reporting processes.</li><li>Identify metrics to understand the performance of the company’s key initiatives and measure process efficiency, develop dashboards and/or reports to track performance.</li><li>Continually evaluate and refine your technical toolkit; teach what you learn to the team.</li></ul>\n</ul>\n\n</div>\n</div><div><div>About You\n\n<ul>\n\n\n<ul>\n<li>You have 2-4 years experience as an analyst or in a quantitative role in which you extracted meaning from complex sets with little engineering support.</li><li>You are proficient in SQL and either R or Python. Bonus points for experience with the Hadoop ecosystem or additional scripting languages (Scala, PHP, Ruby, etc.)</li><li>You can communicate your insights verbally, visually and in writing.</li><li>You care deeply about the quality of your data and the integrity of your work.</li><li>You care about reproducible work and have picked up tools to this end; you can teach others how to make their own work better and more efficient.</li><li>You are passionate about subjects such as quantitative analysis, data visualization, and process efficiency.</li><li>You have proven project management skills are capable of carrying projects through to completion with little direct guidance.</li></ul>\n</ul>\n\n</div>\n</div><div><div><strong>What’s Next</strong></div><br>\n<div>Interested in working with us? Send us a cover letter and your resume explaining why you’d be great for the job. We value your unique talents and point of view, so feel free to tell us what you are all about. And if you write, draw, craft, or contribute to something you’re proud of, we’d love to hear about it.</div><div>At Etsy, we believe that a diverse, equitable and inclusive workplace makes us a more relevant, more competitive, and more resilient company. We welcome people from all backgrounds, ethnicities, cultures, and experiences. Etsy is an equal opportunity employer. We do not discriminate on the basis of race, color, ancestry, religion, national origin, sexual orientation, age, citizenship, marital or family status, disability, gender identity or expression, veteran status, or any other legally protected status.</div></div>"}