{"job title": "Data Reporting / Power BI Analyst - BHJOB13738_47952 GD", "company": "Fast Switch", "city state": "– Boston, MA", "rating": "4.1", "job description": "<div>\n Job Description\n \n <div>\n \n <b>Job ID: 47952 </b><br><br><b>Our client in Boston, Massachusetts is seeking a Data Reporting / Power BI Analyst.</b><p>Data Reporting Analyst/Power Bl Report and Dashboard Developer</p><p><b>Summary of Job:</b></p><p>We are seeking an experienced SOL Server Data Reporting Analyst to utilize program development series or other technical tools (SOL; business objects) for agency reporting purposes.</p><p><b>Duties include: </b></p><p>Working with stakeholders to understand reporting needs, identifying and querying data sources to get the required data, cleansing and massaging data into the shape required, creating Power Bl datasets, reports, and dashboards to meet requirements, presenting and gathering feedback from stakeholders on the finished product, and deploying data, reports, and dashboards to Power BI; developing reports according to analyst-defined specifications; conduct technical training; work as the architect and development lead to improve performance and extend functionality; maintain and document operational environment.</p><p><b>General Qualifications:</b></p>• Experience in SOL developing and maintaining stored procedures and triggers.• Experience with Data Warehousing and ETL (SS\\\\S)• Experience with SOL Server Reporting Services and reporting technologies• Experience with developing Business Intelligence dashboards using Microsoft technologies, specifically Power 81• Experience in application level problem diagnosis and troubleshooting, resolution and testing.<p><b>Mandatory Requirements:</b></p>• Minimum of 4-6 years' experience in SOL Server Reporting Services and development with SOL technologies• Knowledge of SOL Server database architecture (components and processes of the database) for SOL Server 2014, 2016• Knowledge of API Web Services• At least 3 years' experience developing Business Intelligence dashboards and reports (at least 1 year experience using Microsoft Power 81), analyzing, and visualizing data with Microsoft technologies such as Excel, Power Bl Power Query, Performance Point, and SOL Server Reporting Services• An understanding of Power Bi administration, licensing, security, and deployment• A solid understanding of the concepts involved in modeling relational data• Experience with ETL of data from a variety of sources using SSIS, Excel Power Query, or similar technologies• Strong analytic skills• Superior organizational skills, with a disciplined approach to implementation, support and documentation• Hands-on approach with ability to deliver to commitments• Self-motivated and highly professional with ability to take on responsibility and work independently• Ability to work under pressure and tight deadlines.• Excellent client (internal &amp; external) communication and liaison skills.<p><b>Other Desired Skills:</b></p>• Experience with creating tabular data models in SOL Server Analysis Service with DAX• Development experience using SOL Server Analysis Services• Experience with Power Bl Administration a plus.&nbsp;<p>Fast Switch, Ltd. is a high-growth IT staffing firm, with headquarters in Dublin, Ohio and with offices serving the Columbus, Detroit, Boston, Cincinnati, Minneapolis, Phoenix, Hartford, Los Angeles, Tucson, San Francisco, Denver, and Cleveland metropolitan areas. We have a staff of over 780 associates and have experienced growth while remaining profitable.<br><br></p><p>Compensation can vary depending on experience and capability, plus benefits which include healthcare, dental, and vision insurance, long term disability coverage, and 401(k) with match and IMMEDIATE vesting. Our benefits package, in this day and age, is superb.<br><br></p><p>To view all of our open positions, please go to:&nbsp;www.fastswitch.com&nbsp;and/or navigate to our&nbsp;Careers&nbsp;page.</p><p></p><p></p><p></p><p>indeed456</p>\n \n </div>\n </div>"}