{"job title": "Master Data Management (MDM) Analyst", "company": "Integrated Resources, Inc.", "city state": "– Waltham, Massachusetts", "rating": "3.2", "job description": "Title: Master Data Management (MDM) Analyst\n<br><br>\nLocation: Waltham, MA\n<br><br>\nDuration: 12 months\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\n<strong>Description:</strong>\n<br><br>\nThe Master Data Management (MDM) Analyst will be responsible for consistency, quality, accessibility, and security of strategic shared data and information to Clients Supply Chain and Technical Operations organizations.\n<br>\nResponsible for gathering information requirements and working with the business to define standards and rules to ensure master data is compliant with defined information, policies, and quality requirements as defined by the data owner.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nContribute to the creation and maintenance MDM processes and procedures.\n<br>\nExecute a data management strategy and assist with continuous improvement of data management in ERP and QMS systems.\n<br>\nUnderstand the requirements of master data and the relationship with IT systems, Quality requirements, and broader business processes.\n<br>\nMonitor and facilitate the workflow processes for new data requests, changes, and deletions.\n<br>\nIdentify, analyze, and report/resolve data issues, related to uniqueness, integrity, accuracy, consistency, and completeness.\n<br>\nActively participate in IT implementation projects and various other projects as deemed necessary to ensure data management standards are recognized.\n<br>\nWork with cross-functional teams to identify and acquire new strategic data.\n<br>\nProvide analytical support on business metadata and ensure that it is accessible and meaningful to data users.\n<br>\nEnsure data documentation policies and procedures are properly developed and maintained.\n<br>\nActively advocate for data management.\n<br>\nTake on other responsibilities and special projects as directed by management.\n<br>\nServe as subject matter expert regarding product change control impacting the Supply Chain\n<br>\nRepresent the Supply Chain functional area as a subject matter expert on product change control during regulatory and third-party inspections\n<br>\nDevelop, implement and track an End to End Change control process.\n<br><br>\n<strong>Qualifications:</strong>\n<br><br>\n3+ of pharmaceutical industry experience\n<br>\nExperience in master data management and change control process in regulated pharmaceutical industry\n<br>\nExperience with ERP (Oracle, SAP, etc.) systems and Quality Management Systems (QMS)\n<br>\nAbility to communicate effectively both orally and in writing, both internally and with external vendors and partners\n<br>\nAbility to multi-task and work in a fast paced and dynamic environment\n<br>\nStrong working knowledge of standard business software, including MS Excel, Word, PowerPoint and Project\n<br><br>\n<strong>Education:</strong>\n<br><br>\nBachelors degree in Engineering or Life Sciences"}