{"job title": "Health Data Analyst II", "company": "Kaiser Permanente", "city state": "– Portland, Oregon", "rating": "3.9", "job description": "Provide quantitative measurement and data analysis expertise for the Utility for Care Data Analysis. Responsible for implementing established, as well as developing and applying innovative techniques for measuring, analyzing, and reporting on healthcare processes, health outcomes, and health costs.\n<br><br>\n<strong>Essential Functions:</strong>\n\n<li> Given analytical project or task data requirements, works independently to access and validated needed data from KP HealthConnect information systems (e.g. Clarity).\n\n</li><li> Determines appropriate analytical tools and applies them to implement specified analytical methods in order to achieve specified analytical project or task objectives.\n\n</li><li> Identifies potential problems with analysis assumptions and data quality and applies established quality assurance processes to resolve problems or escalate them as needed.\n\n</li><li> Prepares tabular and graphicak summaries of data and analytical results based on established templates and formats. Selects the most appropriate template or format based on project or task requirements.\n\n</li><li> Working from specified requirements, authors written reports and presentation materials describing project objectives, methods, data, and results.\n<br><br>\n<strong>Basic Qualifications:</strong>\n<br>\nExperience\n\n</li><li> N/A\n<br>\n<strong>Education</strong>\n\n</li><li> Bachelor's degree in statistics or another discipline requiring substantial course work in quantitative analysis methods.\n<br>\nLicense, Certification, Registration\n\n</li><li> N/A\n<br><br>\n<strong>Additional Requirements:</strong>\n\n</li><li> Ability to effectively communicate complex technical concepts, both verbally and in writing.\n\n</li><li> Skills in analytical methods including problem and model formulation, algorithm selection, and development of overall solution strategy.\n\n</li><li> Creativity, critical thinking, and excellent problem-solving skills.\n<br><br>\n<strong>Preferred Qualifications:</strong>\n\n</li><li> Experience writing, debugging and documenting complex queries against relational databases.\n\n</li><li> Experience performing exploratory data analysis and model development and evaluation using R, SAS, SPSS, Stata or some other data analysis package.\n\n</li><li> Previous work experience in the healthcare industry, especially healthcare analytics or health services research.\n\n</li><li> Graduate degree in statistics or another discipline requiring substantial course work in quantitative analysis methods.\n\n</li><li> Familiarity with Kaiser Permanente healthcare system preferred.\n<br></li>"}