{"job title": "HR Data Analyst", "company": "Lamons", "city state": "– Houston, TX", "rating": "3.1", "job description": "HR Data Analyst\n<br><br>\nCompany: Lamons\n<br><br>\nPrimary Location: 7300 Airport Blvd, Houston, TX 77061 USA\n<br><br>\nEmployment Type: Salaried - Full-Time\n<br><br>\nFunction: Human Resources\n<br><br>\nEqual Opportunity Employer Minorities/Women/Veterans/Disabled\n<br><br>\nMain Duties &amp; Responsibilities\n<br><br>\n<strong>Job Summary:</strong>\n<br><br>\nData Analyst is responsible for turning data into useful information. In this role, the Data Analyst will collect information, analyze it, and interpret and report results. He/ she will also be responsible for creating and maintaining databases. To be successful in this role, an ideal candidate will demonstrate attention to detail, critical thinking, logic, common sense, good communication skills and possess a creative side with charts and dashboards.\n<br><br>\n<strong>Job Duties and Responsibilities:</strong>\n<br><br>\n· Collecting data, analyze results and publish metrics and reports\n<br><br>\n· Develop and implement databases, data collection systems, and data analytics\n<br><br>\n· Identify, analyze and interpret trends or patterns in complex datasets\n<br><br>\n· Assist stakeholders in interpreting results\n<br><br>\n· Work with management to prioritize business and information needs\n<br><br>\n· Present written and verbal data analysis findings, to both the project team and business stakeholders\n<br><br>\n· Identify and define new process improvement opportunities\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n<strong>Job Specifications:</strong>\n<br>\n<strong>Skills</strong>\n\n\n<ul>\n<li>Excellent Excel skills in making spreadsheets, formulas, and pivot tables</li>\n<li>Good analysis ability to convert raw data into performance metrics</li>\n<li>Excellent communication skills, both, spoken and written</li>\n<li>Demonstrated ability for critical thinking</li>\n<li>Ability to take instructions and convert them into a clear performance explanation</li>\n<li>Solid organization and file management skills</li>\n<li>Basic knowledge of Statistical Analysis</li>\n<li>Proven computer skills in the of Microsoft Office: Word, Excel, PowerPoint, Visio and Project</li>\n<li>Demonstrated ability to work effectively and positively with a wide variety of resources</li>\n<li>Strong administrative and interpersonal communication skills</li>\n<li>Teamwork - able to facilitate effective team interaction</li>\n</ul>\n\n<strong>Education</strong>\n<br>\n· Bachelor's degree or equivalent in business, engineering, or other data driven curriculums\n<br><br>\nWork Experience\n<br>\n· 1 to 3 years of work experience as a data analyst, or a similar\n<br><br>\nPhysical Requirements\n<br><br>\n· Using a computer for extended periods of time\n<br><br>\n· Extended time sitting, standing or walking"}