{"job title": "Marketing Data Analyst", "company": "London Stock Exchange Group", "city state": "– Buffalo, NY", "rating": "3.2", "job description": "Major Responsibilities\n<br><br>\nThis role focuses on analysis and reporting of marketing programs.\n<br><br>\nCampaign Effectiveness Measurement &amp; Account Based Marketing Analysis\n\n\n<ul>\n<li>Working with marketing managers, synthesize data from multiple platforms to evaluate campaign effectiveness</li>\n<li>Develop standard reports and dashboards, and deliver analysis on the performance of marketing activities and provide recommendations to stakeholders around how to optimize their campaigns.</li>\n<li>Support the establishment of metrics for account-based marketing programs. Account-Based Marketing (ABM) is used by B2B marketers to identify and target the accounts they value most.</li>\n<li>Identify resources needed for account-based data analysis.</li>\n<li>Support Segment and Product Marketing Managers to evaluate the effectiveness of marketing campaigns and recommend tactics to dial up or dial down for most efficient use of resources.</li>\n</ul>\n\nMarket Research\n\n\n<ul>\n<li>Support client insight programs - program set up, questionnaire coding, coordination of data pulls, data management, analysis and reporting support</li>\n<li>Support data analysis requests using the benchmarked assets database, an internal source of a highly valued information about our products and the competitive landscape.</li>\n<li>Become an expert in the technical parameters of the AUM database and be able to identify opportunities to leverage the data to advance the business.</li>\n</ul>\n\nSkills &amp; Experience\n<br><br>\nRequired skills include proficiency with Microsoft Excel and a high level of intellectual curiosity. Additional skills include business analytics, a process oriented mind, determination, persistence, and creativity. This individual must be able to manage multiple tasks and projects simultaneously, prioritize workload effectively and build workable solutions to current issues or roadblocks. Ideal candidates are natural problem solvers who can identify trends and patterns in data to help guide strategic and tactical business decisions.\n\n\n<ul>\n<li>Bachelor's degree or equivalent in a quantitative/technical field such as Engineering, Economics, or Statistics required.</li>\n<li>Demonstrable marketing experience preferably at a financial services firm.</li>\n<li>Demonstrable experience in analytics focused on turning questions into insight and owning and maintaining data sets</li>\n<li>Expertise in measuring, testing and analyzing marketing programs strongly preferred.</li>\n<li>Possesses a \"no job too big or too small mentality\" and takes initiative wherever possible to identify new opportunities for the team and the business.</li>\n<li>Excellent written, oral communication and presentation skills with excellent interpersonal skills.</li>\n<li>Demonstrated ability to lead results-oriented initiatives through influence and collaboration among peers and senior executives.</li>\n<li>Sound Excel and PowerPoint skills</li>\n<li>Experience with web analytics tools preferred.</li>\n<li>Data visualization experience desired (Tableau or Power BI).</li>\n<li>Experience with fund database tools like Morningstar Direct and eVestment preferred but not required.</li>\n</ul>\n\nPeople are at the heart of what we do and drive the success of our business. Our colleagues thrive personally and professionally through our shared values of Integrity, Partnership, Innovation and Excellence are at the core of our culture. We embrace diversity and actively seek to attract people with unique backgrounds and perspectives. We are always looking at ways to become more agile so we meet the needs of our teams and customers. We believe that an inclusive collaborative workplace is pivotal to our success and supports the potential and growth of all colleagues at LSEG.\n<br><br>\nA career with London Stock Exchange Group offers you the opportunity to be at the centre of the financial community. As well as competitive salaries and a range of attractive benefits, we maximise each employee's potential through personal development plans, training, coaching and mentoring.\n<br><br>\nPlease take a moment to read this privacy notice carefully, as it describes what personal information the London Stock Exchange Group (\"We\") may hold about you, what it's used for, and how it's obtained. If you would like this information to be removed from the London Stock Exchange Group HR database, please contact workday@lseg.com. If you choose to have your information removed, you will be removed as a candidate and we will not be able to progress your application for opportunities at the London Stock Exchange Group.<br><br>SDL2017"}