{"job title": "Data Analyst, Ophthalmology", "company": "NYU Langone Health", "city state": "– New York, NY", "rating": "3.8", "job description": "<strong>NYU School of Medicine</strong> is one of the nation’s top-ranked medical schools. For 175 years, NYU School of Medicine has trained thousands of physicians and scientists who have helped to shape the course of medical history and enrich the lives of countless people. An integral part of NYU Langone Health, the School of Medicine at its core is committed to improving the human condition through medical education, scientific research, and direct patient care. For more information, go to med.nyu.edu, and interact with us on Facebook, Twitter and Instagram.\n<br><br>\n<strong>Position Summary:</strong>\n<br>\nWe have an exciting opportunity to join our team as a Data Analyst.\n<br><br>\nThe Ophthalmic Imaging Research Laboratory in the Department of Ophthalmology is seeking a Data Analyst. Responsibilities will include operation of ocular imaging devices, image acquisition from human and animal subjects, data collection and analysis. Obtaining quality images of human and animal models is required. The individual must have at least an undergraduate degree in Bioengineering or Physics. A background in biomedical engineering specializing in medical imaging and lasers, experience in retinal functional, anatomical, and metabolic imaging is advantageous. Must be able to work independently as well as with a group and have excellent interpersonal skills.\n<br><br>\n<strong>Job Responsibilities:</strong>\n\n<ul>\n<li>The individual will be solely responsible for the operation of ocular imaging devices This responsibility also requires maintaing the devices in good operational status which could include troubleshooting, cleaning and calibration of the equipment.\n<br>\nWill be solely responsible for exporting images and raw image data for further processing.</li>\n<li>The individual is responsibile for data collection Will be solely responsible for exporting images and raw image data for further processing. This responsibility will be done following a strict timeline.\n<br>\nWill be responsible for quality images under minimal supervison under a strict deadline. Will be solely responsible for exporting images and raw image data for further processing.</li>\n<li>The incumbent will be responsible for image analysis. The processing of the images will be captured using state of the art software. This individual should be able to work independently.\n<br>\nWill be solely responsible for exporting images and raw image data for further processing.</li>\n<li>The incumbent will be reponsible for image acquisition . Obtaining good quality images of human and animal models is a mandated responsibility for this individual.\n<br>\nThe incumbent will be responsible for acquiring quality images on a daily basis.</li>\n</ul>\n<strong>Minimum Qualifications:</strong>\n<br>\nTo qualify you must have a background in biomedical engineering specializing in medical imaging and lasers, experience in retinal functional, anatomical, and metabolic imaging is advantageous. At least 2 years experience or equivalent combination of education and experience. At least an undergraduate degree in Bioengineering or Physics. The incumbent must be willing to work with minimal supervision. Individual must be willing to work independently under a strict timeline. Some analytical skills will be required. This job will require data collection and analysis. Will not be involved will financial reponsibility/accountability\n<br>\nThe incumbent must proficient with regards to data collection and analysis. Any deviation could lead to miscalculations with data analysis.\n<br>\nThis individual will be working directly with physicians, students, residents and other staff. Good inter-personal skills and the ability to work as part of a group is mandatory.\n<br>\nNo impact with regards to human resources will be required for this position\n<br>\nWill have internal contact with various levels of the department on a daily basis. Good inter-personal skills and the ability to work as part of a group is mandatory\n<br>\nWill have external contact with potential research subjects on a daily basis.\n<br>\nThe incumbent must be able to assist potential research subjects to a sitting position in order to capture the necessary images. Must be able to lift 20 pounds or less.\n<br><br>\n<em>Qualified candidates must be able to effectively communicate with all levels of the organization.</em>\n<br><br>\nNYU School of Medicine provides its staff with far more than just a place to work. Rather, we are an institution you can be proud of, an institution where you’ll feel good about devoting your time and your talents.\n<br><br>\nNYU School of Medicine is an equal opportunity and affirmative action employer committed to diversity and inclusion in all aspects of recruiting and employment. All qualified individuals are encouraged to apply and will receive consideration without regard to race, color, gender, gender identity or expression, sex, sexual orientation, transgender status, gender dysphoria, national origin, age, religion, disability, military and veteran status, marital or parental status, citizenship status, genetic information or any other factor which cannot lawfully be used as a basis for an employment decision. We require applications to be completed online.\n<br>\nIf you wish to view NYU School of Medicine’s EEO policies, please click here. Please click here to view the Federal “EEO is the law” poster or visit https://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm for more information. To view the Pay Transparency Notice, please click here."}