{"job title": "SAS Programmer (Data Analyst)", "company": "Oasis Systems", "city state": "– Washington, DC", "rating": "3.9", "job description": "<p>MAR Division of Oasis Systems has an exciting opportunity for a full-time<strong> SAS Data Analyst</strong> to support the Commodity Futures Trading Commission (CFTC) in Washington, DC. The successful candidate will provide ongoing technical support for the maintenance and enhancements to the data standards managed and supported by the Data Standards team. This will include the following tasks Data Standards Support, Application Review, Rulemaking Support, Data Standards Maintenance, Data Operations Support and Transition Support.</p><p> </p><p><strong> REQUIRED QUALIFICATIONS: (Education, Certifications, Experience, Skills)</strong></p><p>This candidate must have experience with the following:</p><ul><li><strong>EXPERIENCE LEVEL: </strong>8 years of general experience in Data Analytics with 5 years or more directly related experience. At least 5 years of experience using SAS to create and automate reports and data analysis.</li><li><strong>EDUCATION: </strong>Bachelor’s degree required. Bachelor’s Degree or Master’s Degree in Computer Science, Mathematics, Economics, Statistics or Related Area of Study</li><li><strong>CERTIFICATIONS AND TOOLS</strong>: N/A</li><li><strong>SECURITY CLEARANCE: </strong>Ability to pass a Special Agreement Check (SAC) and a National Agency Check and Inquires (NACI) Background Investigation - Public Trust. </li><li>Knowledge of and experience with visualization tools and software, SAS Enterprise Guide and SAS Stored Processes, SQL software and querying, and performance tuning with big data.</li></ul><p><strong>JOB RESPONSIBILITIES: </strong>Functionally, the successful candidate will:</p><ul><li>Work closely with the customer to gather and document project requirements.</li><li>Perform data analysis to learn and understand the data and the question being answered. Independent research may be required to facilitate understanding.</li><li>Perform data processing to manipulate the data to prepare for reporting including linking the data to other data sources, formatting the data, supplementing the data with reference data, and may require data modelling skills and the use of intermediary tables to store the cleansed data set.</li><li>Create data report and visualizations to present the data in ways that are meaningful, actionable, and understandable to the customer.</li><li>Test each project thoroughly before presenting to management and executives.</li><li>Create documentation required under PMLC and the Configuration Change Board. Create user guides for customers.</li><li>Design and develop automation procedures for summary tables, reports, and queries of large databases. </li><li>Assist business users, economists, statisticians, and others to support effective use of analytic techniques and CFTC-approved tools.</li><li><strong>TRAVEL:</strong> N/A </li></ul><p> <br></p><p><strong><em>Who We Are</em></strong></p><p>Oasis Systems is a premier provider of customer-driven, cost-effective and quality Engineering Services; Enterprise Systems and Applications; Human Factors Engineering; Information Technology and Cyber Security; Professional Services; and Specialized Engineering Solutions to the Department of Defense, FAA, NRC and other federal agencies.</p><p> </p><p>We strive to be an exciting and welcoming company that attracts, develops, motivates and retains the most talented, skilled and dedicated people in the industry; where they are encouraged to achieve personal excellence, purpose, and their full potential and career aspirations; while supporting mission-critical national security technologies and programs.</p><p> </p><p>MAR Division of Oasis Systems is an equal opportunity employer and does not discriminate in hiring or employment on the basis of any legally protected characteristic including, but not limited to, race, color, religion, national origin, marital status, gender, sexual orientation, ancestry, age, medical condition, military veteran status or on the basis of physical handicap which, with reasonable accommodation, render the application to satisfactorily perform the job available.</p><br><br><p><b>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</b></p>"}