{"job title": "Tier III Customer Support Data Analyst", "company": "PSI Pax", "city state": "– Yorktown, VA", "rating": "4.1", "job description": "PSI Pax is currently recruiting for Tier III Customer Support Data Analyst to support our customer in Yorktown, VA.\n<br><br>\n<strong>Duties&amp;Responsibilities:</strong>\n\n\n<ul>\n<li>Provides a wide-range of assistance to customers including but not limited to:</li>\n<li>Non-Routine and complex customer support requirements</li>\n<li>Reorganizations and other customer events that require master data maintenance</li>\n<li>Integration with external system interfaces</li>\n<li>Custom data queries and reporting</li>\n<li>Support of critical customer business events (such as Fiscal Year close) by providing data management; help for complex issues; and data extraction and analysis</li>\n\n<strong><li>Supporting requirements related to:</li>\n\n</strong>\n\n<li>System/user access</li>\n<li>Access/procedural questions</li>\n<li>Application workflow</li>\n<li>Connectivity/performance issues</li>\n<li>Account verifications</li>\n<li>Provides end-user training through in-person, telephone, and web meetings</li>\n<li>Supports the development and maintenance of end user training material including training curriculum and desktop guides</li>\n<li>Analyzes inquiries through use of personal knowledge of the functional subject matter</li>\n<li>Monitoring customer inquiries for a specific functional area, tracking progress and resolution of escalated inquiries</li>\n<li>Support the documentation of standard operating procedures</li>\n</ul>\n\n<strong>Required Qualifications:</strong>\n\n\n<ul>\n<li>At least Four (4) years of experience in customer service is required</li>\n<li>SQL query development experience is a plus</li>\n<li>User Account Management experience is a plus</li>\n<li>Navy Time and Attendance expertise is a plus</li>\n<li>Security+ certification is desired. Ability to obtain Security+ certification is required.</li>\n<li>US Citizen with the ability to obtain Secret Clearance is required.</li>\n</ul>\n\n<strong>Education Requirements:</strong>\n\n\n<ul>\n<li>Bachelor's Degree in an information technology or business discipline</li>\n<li>An Associate's Degree and two (2) additional years of experience can be substituted for a Bachelor's Degree</li>\n<li>A High School Diploma and four (4) additional years of experience can be substituted for a Bachelor's Degree</li>\n</ul>"}