{"job title": "Senior Data Analyst", "company": "Raytheon", "city state": "– El Segundo, California", "rating": "3.7", "job description": "<p>Provide Data Management (DM) support for assigned Program(s). Support data item reviews, and deliver data in electronic and hardcopy format per Government Contract Data Requirements List (CDRL), Subcontract Data Requirements List (SDRL), and Raytheon internal requirements. Post electronic documentation in Program databases. Help analyzing contracts and contract modifications to develop Data Item schedules in line with Program Integrated Master Schedules (IMS). Assist program management personnel in organizing and recording Program data in Program and Corporate libraries and databases.<br><br>Responsibilities Include:</p><ul><li>Track/expedite/forecast Program data deliverables (CDRLs/SDRLs) and other work products</li><li>Provide control of program documentation as required</li><li>Generate programs operating instructions, data approval forms, submittal letters, and title pages observing classification, distribution, marking, and handling requirements</li><li>Ability to interpret contract/SSOW specific to data delivery requirements</li><li>Coordinate electronic transmittal/sharing of program data per Program requirements</li><li>Support contract closure efforts; program review activities, and archival of records</li><li>Observe Program security requirements and Raytheon data protection requirements, especially for marking deliverable data</li><li>Ability to create and analyze reports specific to data management work products and deliverables</li><li>Support peer reviews of selected Program plans and key documents</li><li>Ability to present in program meetings</li></ul><p><br><strong>Required Skills: </strong></p><ul><li>4+ years of related work experience</li><li>Experience communicating Data Management processes both verbally and in writing</li><li>Knowledge of industry Configuration/Data Management/Work Product Management principles, standards and processes, such as described in GEIA-859, Data Management Standard</li><li>Knowledge of standard Government Data requirements and delivery forms, including DD Form 250 and DD Form 1423</li><li>Proficient in Microsoft Office and Adobe Acrobat</li><li>Ability to multi-task</li><li>U.S. Citizenship status is required as this position will need a U.S. Secret Security Clearance and SAP/SAR clearances within 1 year of start date.</li><li>U.S. Citizenship status is required as this position will require the ability to access US only data systems.</li></ul><p><br><strong>Required Education: </strong>Bachelor's Degree</p>\n123155BR 123155<br><p>Raytheon is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, sex, sexual orientation, gender identity, national origin, disability, or protected Veteran status.</p>"}