{"job title": "Business Data Analyst", "company": "Sager Electrical", "city state": "– Middleborough, MA, US", "rating": "3.1", "job description": "<div>Sager Electronics, a wholly owned subsidiary of TTI Inc., a Berkshire Hathaway Inc. company, is a North American distributor of Interconnect, Power and Electromechanical components from leading manufacturers worldwide. Grounded in over 130 years of innovation and service, Sager Electronics provides customers and suppliers a unique combination of operational excellence and innovative business solutions through its Distributing Confidence® business model. Headquartered in Middleborough, MA, Sager Electronics operates a national network of field sales representatives and strategically located service centers across North America. To learn more about Sager, visit www.sager.com. </div><div><br></div><div>At Sager we have a high-energy team that supports our vision of understanding and satisfying our customers. We are currently looking for a Business Data Analyst to join our newly created Business Analytics team in our corporate office located in Middleboro, MA. You will be part of a team that oversees reporting for the entire organization. If you are someone who has strong project management skills, the ability to problem solve and you are someone who is a critical and analytical thinker with a high attention to detail, please apply within. The typical business hours are from 8:00 AM – 5:00 PM. </div><div><br></div><div>Primary Responsibilities Include:</div><div>•Provide consistent, repeatable and timely managerial reports</div><div>•Interpret data and make recommendations based upon findings</div><div>•Perform various sales, gross margin and inventory analysis to better understand company trends</div><div>•Ability to work collaboratively across all business units within the organization</div><div>•Ability to multi task and manage concurrent projects</div><div>•Support the annual budget process</div><div>•A positive attitude and the ability to respond to requests in a timely manner</div><div>•Provide assistance and support to the department as needed</div><div><br></div><div>Qualifications:</div><div>•Bachelor’s Degree in a business related field; Finance, Statistics or Economics</div><div>•2-4 years of experience </div><div>•Strong Microsoft Office, data compilation and analysis are required</div><div>•Required: Excel skills should be at a proficient or advanced level</div><div>•Strong interpersonal skills</div><div>•PeopleSoft experience desired, but not required</div><div><br></div><div>Sager Electronics offers an attractive benefits package for full time employment, including medical/vision/dental insurance, life insurance, short-term and long-term disability, paid time off, paid holidays, tuition reimbursement, and a company matched 401(k). To learn more about Sager Electronics, please visit our web site at http://www.sager.com. </div><div><br></div><div>Sager Electronics is an Equal Opportunity Employer committed to providing equal opportunities to all employees and applicants for employment without regard to race, color, sex (including pregnancy), sexual orientation, gender identity, age, national origin, religion, physical or mental disability, veterans’ status, genetic information, or any other characteristic protected by law.</div><div></div><div><br></div>"}