{"job title": "Systems Analyst - Data Reporting", "company": "United Fire Group", "city state": "– Cedar Rapids, Iowa", "rating": "3.5", "job description": "<strong>Job ID</strong> 2018-1822\n<br>\n<strong># of Openings</strong> 1\n<br>\n<strong>Job Locations</strong> US-IA-Cedar Rapids\n<br>\n<strong>Posted Date</strong> 2018-08-15\n<br>\n<strong>Category</strong> Project Management Office\n<br>\n<strong>Travel</strong> None\n<br>\n<strong>Company Car Provided</strong> No\n<br><br>\n<strong>Overview</strong>\n<br><br>\nUFG offers you an award-winning workplace and a trustworthy, financially stable company. While we've always known our commitment to employees and financial stewardship, it is good to have others recognize our dedicated efforts. We've been named an Iowa Top Workplace by the <em>Des Moines Register</em> for four consecutive years, and included on <em>Forbes'</em> \"America's Most Trustworthy Financial Companies\" every year since 2014. Additionally, UFG is a super-regional property and casualty insurer rated \"A\" (Excellent) by A.M. Best Company.\n<br><br>\nUFG is looking to add a System Analyst to our Data Reporting team.\n<br><br>\nThe Systems Analyst is responsible for full comprehension of UFG's reporting systems and underlying databases/data infrastructure to ensure accurate, quality data is provided in our operational reports. The Reporting Data/Systems Analyst will be responsible for creating technical specifications for each data query and report program in the system(s) as well as provide data modeling, flowcharts, and architecture diagrams for project teams to follow.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Analyze reporting processes/needs within UFG for inefficiencies, inadequacies, and/or redundancies, making recommendations for solutions/improvements that can be achieved and sustained via new technology or alternative uses of technology.</li><li>Document and evaluate required data and information needed for internal and external reporting.</li><li>Use business process modeling and data modeling to improve the flow of information through our organization.</li><li>Collaborate with database administrators, data scientists, and other data engineers to understand underlying database structures/tables, field definitions/uses, and data interrelations.</li> <li>Collaborate with developers and subject matter experts to establish the technical vision and analyze tradeoffs between usability and performance needs.</li><li>Collaborate with Business Analysts, Project Managers, stakeholders, and IT teams to understand business needs and provide solution recommendations.</li><li>Define and write high-level and low-level design specifications for programmers and report writers. Should include, but is not limited to: all system inputs and outputs; all data sources, ranges of values, default values, and data format; all reporting calculations/algorithms.</li> <li>Keep current in new technologies to stay current on new trends.</li><li>Other duties as assigned.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n<ul>\n<li>Four-year college degree in computer science, MIS, business administration, or related discipline</li><li>Insurance coursework or designations, which include AINS, API, AU, AIT, or CPCU, are desired.</li><li>5 - 7 years of systems analyst and/or systems engineer experience</li><li>3 - 5 years of insurance experience is desired</li><li>Demonstrated experience with reporting frameworks including IBM Cognos and SQL Server Reporting Services (SSRS).</li> <li>Demonstrated experience with BI/information infrastructures including an Application Data Mart, Enterprise Data Warehouse (EDW), ETL, and/or others.</li><li>Demonstrated experience with data query programming in SQL, DML, DQL, and/or others.</li><li>Demonstrated experience in writing technical requirements and/or design specifications.</li><li>Demonstrated experience in system/software architecture diagramming.</li><li>Strong knowledge and experience with data modeling and data visualization tools.</li><li>Ability to work well with business leaders, project team members, vendors, application developers, and DBAs/data engineers.</li><li>Exceptional interpersonal skills; the ability to work well with people from many disciplines and with varying degrees of business and technical experience.</li> <li>Ability to express complex technical concepts effectively, both verbally and in writing, to diverse groups of people.</li><li>Strong leadership, facilitation, negotiation, and analysis skills.</li><li>Adaptability and flexibility including ability to manage multiple priorities and work under deadlines.</li>\n</ul>\nPI104311945"}