{"job title": "Academic Coordinator / Data Analyst", "company": "University of Kentucky", "city state": "– Lexington", "rating": "4.0", "job description": "<strong>Required License/Registration/Certification</strong>\n<br>\nNone\n<br><br>\n<strong>Physical Requirements</strong>\n<br>\nMinimal physical requirements. Occasional lifting of objects under 50 lbs.\n<br><br>\n<strong>Shift</strong>\n<br>\nMonday - Friday, 8:00 am - 5:00 pm\n<br><br>\n<strong>Job Summary</strong>\n<br>\nThe Lewis Honors College (LHC) seeks an Academic Coordinator to provide administrative support as well as perform a wide variety of data management, analysis, and reporting functions to measure student success and guide college planning. This individual will collaborate with leadership, stakeholders, and other analysts to query and report from a variety of data sources while serving as the LHC Tableau Super-user. The ability to successfully use reporting tools such as Course Distribution, Enrollment Tabulations, Sections Status, Course Audit Reports, Hobsons Retain, and more will be essential.\n<br><br>\nThis position will oversee and manage the LHC admissions procedures annually, guiding updates to the LHC application, maintaining and processing all applicant data, managing the workflow of application review, and coordinating with the Director of Recruitment to align admissions strategies with the University of Kentucky mission.\n<br><br>\nThe Academic Coordinator will also guarantee proper student coding in SAP to facilitate accurate fee assessment, timely payment processes for LHC scholarships, tracking of instructional costs (including faculty contracts), and distribution of peer-mentor stipends.\n<br><br>\nOther duties include providing administrative support to the Director of College Life and program staff and to the LHC Budget Officer. Successful candidates will possess a comprehensive understanding of SAP and all UK business processes regarding financial transactions, including PRDs, POs, Procard editing, and more.\n<br><br>\nThis position will manage the complex and variable instructional and professional facilities within the LHC complex, including oversight for scheduling and usage of 4-7 dedicated classrooms, 2 programming and conference spaces, and over 30 faculty and staff offices. Additional assignments involve the college-level review and inventory of all course offerings, including instructional and capacity/enrollment audits.\n<br><br>\nThis position will supervise and be assisted by an administrative support associate to meet all LHC needs.\n<br><br>\n<strong>Skills / Knowledge / Abilities</strong>\n<br>\nTableau, Hobsons Retain, and other related software. Database Management, MS Office Suite, Excel, Facilities Management, Financial Processes, Report Generation, Collaboration, Communication\n<br><br>\n<em>*Does this position have supervisory responsibilities? *</em>Yes\n<br><br>\n<strong>Preferred Education/Experience</strong>\n<br><br>\n<strong>University Community of Inclusion</strong>\n<br>\nThe University of Kentucky is committed to a diverse and inclusive workforce by ensuring all our students, faculty, and staff work in an environment of openness and acceptance. We strive to foster a community where people of all backgrounds, identities, and perspectives can feel secure and welcome. We also value the well-being of each of our employees and are dedicated to creating a healthy place to work, learn and live. In the interest of maintaining a safe and healthy environment for our students, employees, patients and visitors the University of Kentucky is a Tobacco &amp; Drug Free campus.\n<br><br>\nAs an Equal Opportunity Employer, we strongly encourage veterans, individuals with disabilities, women, and all minorities to consider our employment opportunities.\n<br><br>\nAny candidate offered a position may be required to pass pre-employment screenings as mandated by University of Kentucky Human Resources. These screenings may include a national background check and/or drug screen."}