{"job title": "RESEARCH DATA ANALYST", "company": "UW Medicine", "city state": "– Seattle, WA", "rating": "3.3", "job description": "<div> RESEARCH DATA ANALYST</div> <div> \n<div> Req #: 160068</div> <div> Department: BIOENGINEERING</div> <div> Job Location: Health Sciences Center</div> <div> Posting Date: 09/07/2018</div> <div> Closing Info: Open Until Filled</div> <div> Salary: Salary is commensurate with education and experience</div> <div> Shift: First Shift</div> <div> Notes:\n<br><br>\nAs a UW employee, you will enjoy generous benefits and work/life programs. For a complete description of our benefits for this position, please visit our website, click here.</div>\n</div>\n<br>\n <div>\nAs a UW employee, you have a unique opportunity to change lives on our campuses, in our state and around the world. UW employees offer their boundless energy, creative problem solving skills and dedication to build stronger minds and a healthier world.\n<br><br>\nUW faculty and staff also enjoy outstanding benefits, professional growth opportunities and unique resources in an environment noted for diversity, intellectual excitement, artistic pursuits and natural beauty. All of which has allowed the UW to be nationally recognized as a “Great College to Work For” for four consecutive years.\n<br><br>\nEvery day UW Bioengineering invents the future of medicine. We bridge the traditional disciplines of medicine and engineering to drive health care forward for those in remote parts of the world and here at home. Students, scientists, engineers, and physicians come together here to develop innovative and cost-effective approaches to improve health care.\n<br><br>\nUW Bioengineering naturally evolved from partnerships between engineering and medicine. Today, our faculty and students continually reach across traditional boundaries in education and research. The interdisciplinary scope of our research spans five overarching themes: regenerative medicine and biomaterials, molecular and cellular engineering, imaging and image-guided therapy, technology to improve access to health care, and systems and synthetic biology.\n<br><br>\nUW Bioengineering currently has an outstanding opportunity for a <strong>RESEARCH DATA ANALYST</strong>.\n<br><br>\nThe Sanders Lab is a 15-person interdisciplinary group of bioengineers, clinicians, mechanical and electrical engineers and software specialists. The research is focused on development and implementation of novel measurement techniques for external prosthetics. The goal of the projects is to create instruments to help practitioners better understand patient prosthetic fit problems and select treatments to improve function and quality of life.\n<br><br>\n<strong>Job Description:</strong>\n<br>\nThis position relies on strong laboratory bench work, critical thinking and analysis aptitude and the capability to work well with a team of other engineers and practitioners. The candidate will be expected to document work clearly towards the preparation of manuscripts and funding agency progress reports. Major duties and responsibilities are:\n<br><br>\nLimb volume and prosthetic fit/activity data analysis and interpretation:\n\n<li>Use Matlab to write scripts to process collected data</li>\n<li>Conduct advanced engineering signal analysis (e.g., machine learning) of limb volume and liner volume data, as well as signals from other prosthesis sensors</li>\n<li>Use model to generate hypotheses about relationships between limb fluid volume, socket fit, sensor data, and liner variables\n<br><br>\nAnalysis for design of prosthesis controller algorithm:</li>\n<li>Create and use innovative waveform characterization strategies (e.g., wavelets) to relate measured variables to prosthetic fit outcomes</li>\n<li>Present interpretations to senior researchers and research prosthetists to establish appropriate daily adjustment practices so as to maintain a stable residual limb fluid volume\n<br><br>\nData collection on people with limb loss:</li>\n<li>Operate instrumentation as part of a team to collect sensor data on people with limb loss (may require domestic travel)\n<br><br>\n<strong>Minimum Requirements:</strong>\n<br>\nBachelor’s Degree in science, engineering, or a related discipline with a minimum of one to three years of job related experience.\n<br><br>\nSpecific knowledge, skills and abilities required to perform the job satisfactorily include:</li>\n<li>Minimum 1 year experience working in a research or industry environment.</li>\n<li>Proficient in Matlab, and/or other programming languages commonly used for data analysis.</li>\n<li>Ability to run detailed scientific protocals with human subjects for data collection.</li>\n<li>Ability to present analysis results and developed algorithms in clear, readily understandable form.</li>\n<li>Ability to independently prioritize and organize work to meet deadlines; ability to delegate tasks and seek help.</li>\n<li>Capability to write manuscript-quality description of analysis methods and results.</li>\n<li>Willingness and ability to learn new systems and to implement new processes in response to changes.</li>\n<li>Knowledge, skills and abilities that are desirable, providing for an enhanced level of job performance, include:</li>\n<li>Proficient in advanced analysis of unpredictable systems (machine learning, fuzzy logic, etc.)</li>\n<li>Demonstrated ability to conduct analysis of complex, multivariate data, particularly of biomechanical systems.</li>\n<li>Publication(s) in a scientific pier-reviewed journal.\n<br><br>\n<strong>Desired:</strong>\n<br>\nMaster of Science degree in engineering or science.\n<br><br>\n<strong>Application Process:</strong>\n<br>\nThe application process for UW positions may include completion of a variety of online assessments to obtain additional information that will be used in the evaluation process. These assessments may include Work Authorization, Cover Letter and/or others. Any assessments that you need to complete will appear on your screen as soon as you select “Apply to this position”. Once you begin an assessment, it must be completed at that time; if you do not complete the assessment you will be prompted to do so the next time you access your “My Jobs” page. If you select to take it later, it will appear on your \"My Jobs\" page to take when you are ready. <strong>Please note that your application will not be reviewed, and you will not be considered for this position until all required assessments have been completed.</strong></li>\n\n </div> <div> <div>The University of Washington is a leader in environmental stewardship &amp; sustainability, and committed to becoming climate neutral.</div><br>\n\n <div>The University of Washington is an equal opportunity, affirmative action employer.\n<br>\n To request disability accommodation in the application process, contact the Disability Services Office at 206-543-6450 / 206-543-6452 (tty) or dso@uw.edu.</div>\n </div> <div> Apply for this job</div>"}