{"job title": "Senior Scientist, Translational and Exploratory Biology – Neuromuscular Disease", "company": "Acceleron Pharma", "city state": "– Cambridge, MA, US", "rating": "4.5", "job description": "<div><strong>Who are we?</strong></div><br>\n\n<div></div>\n<br>\n<div>Acceleron is a Cambridge-based, clinical-stage biopharmaceutical company dedicated to the discovery, development, and commercialization of therapeutics to treat serious and rare diseases. The Company’s leadership in the understanding of TGF-beta biology and protein engineering generates innovative compounds that engage the body’s ability to regulate cellular growth and repair.</div><br>\n\n<div>Acceleron focuses its research and development efforts in hematologic, neuromuscular, and pulmonary diseases. In hematology, the Company and its global collaboration partner, Celgene, are developing luspatercept for the treatment of chronic anemia in myelodysplastic syndromes, beta-thalassemia, and myelofibrosis. Acceleron is also advancing its neuromuscular franchise with two distinct Myostatin+ agents, ACE-083 and ACE-2494, and a pulmonary program with sotatercept in pulmonary arterial hypertension.</div><br>\n\n<div><strong>What’s in it for you?</strong></div><br>\n\n<div>In order to support our neuromuscular research efforts as well as future clinical programs, you will use your research expertise to explore different biological hypotheses and identify novel disease targets and therapeutics not limited to the TGFβ signaling pathway. You will have the opportunity to innovate and make strategic decisions that would directly impact our neuromuscular disease therapies. As a lead scientist in our neuromuscular research activities, you will also supervise projects and progress of other personnel and will significantly contribute to the group’s timely deliverables.</div><br>\n\n<div><strong>What will you be doing?</strong> </div>\n<br>\n<div>\n\n\n<ul>\n<li>Designing, implementing and analyzing <em>in-vitro</em>, <em>ex-vivo</em> and <em>in-vivo</em> experiments to generate proof of concept and contribute toward the understanding of Neuromuscular Diseases (NMD)</li>\n<li>Evaluate novel therapeutic modalities that include protein biologics, small chemical molecules and gene editing technologies</li>\n<li>Explore and evaluate each therapeutic technology in NMDs such as CMT, FSHD, DMD, SMA, ALS and sIBM</li>\n<li>Carrying out target engagement and target validation analyses using biomarker, genomics and histology assessments</li> \n\n<li>Meeting strict deadlines on assigned projects</li>\n<li>Writing pharmacological reports, presenting data internally in different cross-functional team meetings and externally at various scientific conferences</li>\n</ul>\n\n</div><br>\n\n<div><strong>What are we looking for?</strong></div>\n<br>\n<div>\n\n\n<ul>\n<li>Ph.D. in biological sciences or related discipline</li>\n<li>Minimum of 6 years of experience in NMD research and with minimum of 3 years in industry setting</li>\n<li>Comprehensive understanding of muscle biology and signal transduction pathways in various neurogenic and myogenic diseases. TGF-beta signaling pathway expertise will be a plus</li>\n<li>Thorough understanding of NMD human clinical trials and drug development</li>\n<li>Deep scientific knowledge of biochemistry, molecular and cellular biology, and molecular genetics</li>\n<li>Extensive hands-on experience in latest gene editing technologies and <em>in-vivo</em> delivery approaches</li>\n<li>Expertise in performing and troubleshooting various basic laboratory techniques including molecular and cellular biology, ELISA, western blotting, flow cytometry and qPCR</li>\n<li>Experience analyzing and interpreting proteomic and transcriptomic data to evaluate target engagement and validation</li>\n<li>Designing and performing various <em>in vitro</em> and <em>in vivo</em> studies, evaluating disease phenotypic efficacy that could translate to end points in human trials</li> \n\n<li>Handling of human tissue, animal tissue and other biological samples for preclinical and translational research</li>\n<li>Attention to detail supported by excellent time management, organizational and communication skills</li>\n<li>Ability to approach complex problems creatively and develop innovative solutions</li>\n</ul>\n\n</div><br>\n\n<div><strong>How will you grow with us?</strong></div><br>\n\n<div>This opportunity will allow you to expand Acceleron’s capabilities in neuromuscular disease drug discovery and development by implementing novel strategies and technologies. As a member of a growing company with an active pipeline, you will be able to leverage your skills by taking on an active role in the R&amp;D group, directly contributing to the drug development process. You will work alongside passionate team members who will motivate you to learn and grow in your career in a fast-paced environment. Join our team!</div>\n<br><strong>*In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and complete the required employment eligibility verification document form upon hire.</strong>"}