{"job title": "Entry Level Environmental Scientist", "company": "AECOM", "city state": "– Santa Maria, California", "rating": "3.2", "job description": "<p> <b> Job Summary</b> </p> <p> AECOM is actively seeking a highly motivated Entry Level Environmental Scientist for employment in the Santa Maria, CA office. Candidate will work in a team that provides air quality compliance services to key clients and will participate in other environmental projects and tasks as needed. At minimum, the qualified applicant will utilize Air Force enterprise systems and proprietary software that support the tracking and management of air quality data sets and calculations to generate air emission inventories for clients. The applicant will inspire to become an expert in environmental compliance, specifically aspects of the Clean Air Act (CAA) and Amendments and consequent compliance.</p> <p> AECOM is pleased to include you in a unique development opportunity, the Graduate Development Program (GDP). This program is designed to support your assimilation into the organization and assist with creating a foundation of knowledge for a successful career at AECOM. You will gain experience in your discipline through learning on the job and participate in development opportunities during the program, including access to AECOM's social media resources, group mentoring, and professional networking. The program also has learning activities that will be available to you, including webinars and online programs.</p> <p> Imagine working on rewarding projects within a diverse culture, and having access to exceptional training and career development opportunities. Working at AECOM means being part of a global team, working with award-winning professionals across the world. Aspire to be a key player on some of the best projects regionally, with opportunities to work on projects nationally or internationally. Our people bring deep industry knowledge to help you succeed.</p> <p> The responsibilities of this position include, but are not limited to:</p> <li> <p> Responsible for assisting in the implementation of key strategic initiatives for improving air quality compliance at (Department of Defense) DoD installations</p> </li> <li> <p> Provide advanced technical support to DoD air quality professionals on compliance issues, including their use of required data management systems</p> </li> <li> <p> Research, review, and analyze applicable air quality policy and regulations</p> </li> <li> <p> Calculate air emissions according to scientific and regulatory standards</p> </li> <li> <p> Prepare air reports and permits for compliance with federal, state, and local regulations</p> </li> <li> <p> Interact with clients on project tasks in a professional and highly competent manner</p> </li> <li> <p> Participate in other environment-related projects and tasks as required</p> </li> <li> <p> Travel to DoD installations throughout the US to provide air program support</p> </li> <p> <b> Minimum Requirements</b> </p> <li> <p> Bachelors degree in Environmental Science or other related field required</p> </li> <li> <p> Up to 50% travel required</p> </li> <li> <p> Valid driver license is required</p> </li> <li> <p> Qualified candidates must be competent with mathematic and scientific calculations</p> </li> <li> <p> Qualified candidates must pass a pre-employment substance abuse test and a favorable National Agency Check with Inquiries (NACI) is required. The NACI is conducted by the Office of Personnel Management (OPM). This investigation has a five year scope which includes a check of the FBI fingerprint, name check, and investigation files, OPM Security/Suitability Investigations Index, national credit bureaus and appropriate military records, written inquiries to law enforcement agencies, former employers and supervisors, personal references, and schools</p> </li> <p> <b> Preferred Qualifications</b> </p> <li> <p> Experience with Air Program Information Management System and the Enterprise Environmental Safety and Occupational Health systems</p> </li> <li> <p> General understanding of the CAA</p> </li> <li> <p> Experience in general air regulations and permits</p> </li> <li> <p> Experience in regulatory and policy analysis</p> </li> <li> <p> Knowledge of Department of Defense (DOD) management practices as they relate to environmental compliance</p> </li> <li> <p> Proficiency in manipulating/managing large data sets with tools such as Microsoft Excel</p> </li> <li> <p> Proficiency of office skills especially email etiquette and scheduling using Outlook calendar</p> </li> <li> <p> Strong organization, reading comprehension, written, and verbal communication skills</p> </li> <li> <p> Strong focus and attention to detail</p> </li> <p> <b> What We Offer</b> </p> <p> AECOM is a place where you can put your innovative thinking and business skills into high gear and work alongside other highly intelligent and motivated people. It's a place where you can apply your skills to some of the world's most challenging, interesting, and meaningful projects worldwide. It's a place that values the diversity of our areas of practice and our people. It's what makes AECOM a great place to work and grow.</p> <p> AECOM is an equal opportunity employer and Minorities, Females, Veterans, and Disabled persons are encouraged to apply. For further information, please click here to view the EEO Is The Law poster.</p> <p> NOTICE TO THIRD PARTY AGENCIES:</p> <p> Please note that AECOM does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed Recruitment Fee Agreement, AECOM will not consider or agree to payment of any referral compensation or recruiter fee. In the event a recruiter or agency submits a resume or candidate without a previously signed agreement, AECOM explicitly reserves the right to pursue and hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of AECOM.</p>"}