{"job title": "R&amp;D Scientist 3", "company": "AECOM", "city state": "– Pittsburgh, Pennsylvania", "rating": "3.2", "job description": "<strong> Job Summary</strong>\n<br><br>\nAECOM is seeking a Research and Development Scientist 3 for our Pittsburgh, PA location.\n<br><br>\n1)\n<br><br>\nThis position requires a degree in engineering or related science.\n<br><br>\n2)\n<br><br>\nThe candidate will perform statistical analysis, risk assessment, and uncertainty quantification for decision support, including development of probabilistic models including Bayesian belief networks, fault tree analysis, and integrated assessment modeling.\n<br><br>\n3)\n<br><br>\nThe candidate will have a general technical understanding of the behavior of behavior of engineered geologic systems, including geologic carbon storage, enhanced oil recovery, and unconventional oil and gas production.\n<br><br>\n4)\n<br><br>\nThe candidate will have experience in interpretation of simulation and field datasets and diagnosis of leakage based on information from multiple monitoring signals.\n<br><br>\n5)\n<br><br>\nThe candidate will provide R&amp;D support to Carbon Storage FWP and NRAP FWP activities.\n<br><br>\n6)\n<br><br>\nThis position will analyze data from experiments and assist in the development of papers, presentations and posters.\n<br><br>\n7)\n<br><br>\nAn update will be due by the end of each month briefly describing the accomplishments from that month and the next months forecast. Also, the applicant will include the relevant status of patents, publications or presentations. Reported information concerning publications and presentations shall include full title, author listing and journal or society name.\n<br><br>\n8)\n<br><br>\nAn update will be due by the end of the quarter briefly describing that quarters accomplishments.\n<br><br>\n9)\n<br><br>\nThe candidate will participate in group meetings. Group meetings are designed to allow the applicant to discuss current research and promote discussion with fellow AECOM researchers. Group meetings occur every week. The manager will request the applicant to provide a PowerPoint presentation for group meetings. The frequency of these presentations is generally once every 6 months but can occur at a higher rate.\n<br><br>\n10)\n<br><br>\nThis position will require extensive interface with customers and potential collaborative partners, so excellent verbal and written communication skills are required. The complexity of information to be managed will require excellent organization skills and attention to detail.\n<br><br>\n<strong> Minimum Requirements</strong>\n<br><br>\nBachelors degree and 5 years of job-related experience in biology, chemistry, economics, geology, physics, mathematic or related scientific field or a Masters degree or equivalent. Excellent communications and analytical skills, working knowledge of computer systems and integrated software application programs. Position may require travel. Position may require the ability to pass and maintain a security clearance.\n<br><br>\n<strong> Preferred Qualifications</strong>\n<br><br>\nPh.D. in engineering or related science.\n<br><br>\n<strong> What We Offer</strong>\n<br><br>\nAECOM is a place where you can put your innovative thinking and business skills into high gear and work alongside other highly intelligent and motivated people. It's a place where you can apply your skills to some of the world's most challenging, interesting, and meaningful projects worldwide. It's a place that values the diversity of our areas of practice and our people. It's what makes AECOM a great place to work and grow.\n<br><br>\nAECOM is an equal opportunity employer and Minorities, Females, Veterans, and Disabled persons are encouraged to apply. For further information, please click here to view the EEO Is The Law poster.\n<br><br>\nNOTICE TO THIRD PARTY AGENCIES:\n<br><br>\nPlease note that AECOM does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed Recruitment Fee Agreement, AECOM will not consider or agree to payment of any referral compensation or recruiter fee. In the event a recruiter or agency submits a resume or candidate without a previously signed agreement, AECOM explicitly reserves the right to pursue and hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of AECOM."}