{"job title": "NGS Scientist", "company": "Aerotek, An Allegis Group Company", "city state": "– Woburn, Massachusetts", "rating": "NA", "job description": "<strong>Top Must Haves:</strong>\n<br>\nNGS (Next-Generation Sequencing)\n<br>\nPh.D. (Molecular Biology or other Life Science)\n<br>\nSome management experience\n<br>\nCLIA (preferred)\n<br><br>\n<strong>LAB MANAGER</strong>\n<br>\nReports to: Chief Technology Officer\n<br><br>\n<strong>Summary:</strong>\n<br>\nWe are looking for a highly motivated, well organized and detail-oriented lab technical manager to set up our next generation sequencing (NGS) CLIA/CAP laboratory and manage 5 direct reports.\n<br><br>\nEssential Functions\n\n\n<ul>\n<li>Set up a CLIA/CAP NGS laboratory with supervision;</li>\n<li>Supervise lab technicians to run Next generation sequencing (NGS) assay which can be transferred from clients or internal R&amp;D group in a CLIA/CAP lab</li>\n<li>Develop customized assays for customers by supervising a scientist focusing single cell sequencing and other advanced NGS assays</li>\n<li>Lab daily operation</li>\n<li>Sample managements for clients</li>\n<li>DNA/RNA extractions, QC, and reporting</li>\n<li>Validate NGS assays and write validation reports</li>\n<li>Work with IT and QA for data managements</li>\n<li>Work with QA manager to ensure the lab staff cross trained according CLIA/CAP compliance with other lab sites within the company</li>\n<li>Work with lab QA manager to keep the lab complied</li>\n<li>Prepare auditing documents.</li>\n</ul>\n\n<strong>About Aerotek:</strong>\n<br><br>\n<strong> We know that a company's success starts with its employees. We also know that an individual's success starts with the right career opportunity. As a Best of Staffing® Client and Talent leader, Aerotek's people-focused approach yields competitive advantage for our clients and rewarding careers for our contract employees. Since 1983, Aerotek has grown to become a leader in recruiting and staffing services. With more than 250 non-franchised offices, Aerotek's 8,000 internal employees serve more than 300,000 contract employees and 18,000 clients every year. Aerotek is an Allegis Group company, the global leader in talent solutions. Learn more at Aerotek.com.</strong>\n<br><br>\n<strong> The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.</strong>\n<br><br>\n<strong> If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please call 888-237-6835 or email accommodation@aerotek.com for other accommodation options. However, if you have questions about this position, please contact the Recruiter located at the bottom of the job posting. The Recruiter is the sole point of contact for questions about this position.</strong>"}