{"job title": "Principal Machine Learning Scientist - Automation", "company": "Capital One", "city state": "– McLean, Virginia", "rating": "3.8", "job description": "11 West 19th Street (22008), United States of America, New York, New York\n<br><br>\nAt Capital One, were building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Capital One is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding.\n<br><br>\nGuided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good.\n<br><br>\nPrincipal Machine Learning Scientist - Automation\n<br><br>\nAt Capital One, data is at the center of everything we do. When we launched as a startup we disrupted the credit card industry by individually personalizing every credit card offer using statistical modeling and the relational database, cutting edge technology in 1988! Fast-forward a few years, and this little innovation and our passion for data has skyrocketed us to a Fortune 200 company and a leader in the world of data-driven decision-making.\n<br><br>\nDepartment Summary:\n<br><br>\nThe Card ML team is working to transform every corner of our business with machine learning. To accomplish this goal, we use the latest techniques in machine learning - deep learning, reinforcement learning, genetic algorithms, and natural language processing - and marry them with real-time streaming data in the cloud, to create best-in-class enterprise-scale ML products. We tackle a huge variety of business problems and work with vast quantities of data of every kind.\n<br><br>\nRole Summary:\n<br><br>\nDo you have a passion for building machine learning systems that work at massive scale in the cloud? Capital One is searching for ML Scientists with a passion for building tools, platforms, and pipelines to join our Card Machine Learning team. You'll bring your strengths in machine learning, data engineering, and devops to join with a dynamic team of scientists, software developers, and data engineers to radically reimagine what ML can do at scale. In this role you'll be working with cutting edge technologies such as Kubernetes, Istio, Spark, and Tensorflow to build a next-generation machine learning platforms that enable rapid model training, deployment, monitoring, and real-time refit. We do machine learning research and product development differently at Capital One. ML scientists aren't siloed in the lab, but instead partner closely with Software Engineers, Product Managers, and business stakeholders, to discover, invent, and build at the largest scale. Ideas may come from internal projects as well as from academic partnerships with world-class institutions. In this role, you will apply your expertise to inform a research groups agenda and drive critical business outcomes. You stay connected to the wider research community as an active contributor.\n<br><br>\nThe Ideal Candidate will be:\n<br><br>\n-Technical. You are independent and can develop your own algorithms and experiments. You have hands-on experience developing ML solutions, from concept to production, and selecting the right tool for the job at hand. You understand modern cloud computing. Lots of data do not frighten you, they present a challenge you are eager to take on. You know R, Scala, and/or Python.\n<br><br>\n-Innovative. You continually research and evaluate emerging technologies. You stay current on published state-of-the-art ML methods, technologies, and applications. You ask why, explore and openly share your disruptive ideas.\n<br><br>\n-Business-Minded. You can analyze customer needs and drive towards impactful business outcomes.\n<br><br>\n-Leader. You challenge conventional thinking and traditional ways of operating and you work with stakeholders to identify and improve the status quo.\n<br><br>\nBasic Qualifications:\n<br><br>\n-Masters Degree plus 3 years of experience in machine learning, or PhD\n<br><br>\n-At least 3 years coding experience with open source programming languages such as R, Python, or Scala;\n<br><br>\n-At least 1 year experience working with AWS, Azure, or similar cloud platform\n<br><br>\n-At least 1 year experience developing enterprise-scale solutions that leverage one or more of the following: operations research, natural language processing, machine learning, deep learning, video/image analysis, or time-series analysis.\n<br><br>\nPreferred Qualifications:\n<br><br>\n-PhD in a Machine Learning discipline\n<br><br>\n-At least 2 years experience working with AWS, Azure, or similar cloud platform\n<br><br>\n-At least 3 years experience developing solutions in Python, Scala, or R-Top-tier peer-reviewed publications on NLP research\n<br><br>\n-At least 3 years experience in natural language processing, speech recognition, or computational linguistics\n<br><br>\nCapital One will consider sponsoring a new qualified applicant for employment authorization for this position."}