{"job title": "Food Scientist III", "company": "Dean Foods", "city state": "– Broomfield, CO", "rating": "2.6", "job description": "This role can be located in either Broomfield CO or Wilbraham MA\n<br><br>\nJob Description &amp; Requirements\n<br><br>\nThis position is part of the Research and Development team and is responsible for providing technical proficiency and leadership cross-functionally related to dairy, non-dairy beverage, cultured and ice cream product lines including frozen dairy and non-dairy desserts with a focus on innovation, productivity and cost savings programs with limited to no supervision.\n<br><br>\n<strong>Job Description:</strong>\n\n<ul>\n<li> Articulating complex technical information and translating that information to non-technical audiences.</li> <li> Leading work across all business functions to positively yield results, and leading multiple project launches simultaneously.</li> <li> Identifying, implementing, formulating and executing cost savings and innovation opportunities independently within a cross functional team.</li> <li> Assessing technical feasibility and providing direction on formulations.</li> <li> Coordinating and conducting production line trials of new or modified foods.</li> <li> Developing and maintaining component specifications.</li> <li> Preparing test plans, technical reports and documentation for the technical community. - Providing direction to various suppliers for new or modified food developments.</li> <li> Working across all functions, including Purchasing, Operations, Engineering and Marketing to support project launches.</li> \n</ul>\n\n<strong>Minimum Requirements:</strong>\n\n<ul>\n<li> 5+ years of experience in product development, formulation and commercialization within an R&amp;D environment.</li> <li> Bachelor's degree in Food Science, or science based degree (Master's preferred).</li> <li> Expert knowledge of dairy processing equipment and ingredient interaction.</li> <li> Expert knowledge of product formulation.</li> <li> Expertise, hands-on and theoretical, with experience in the following areas:</li>\n\n<ul>\n<li> Dairy Processing</li> <li> Fermentation</li> <li> Design of Experiment</li> <li> Hydrocolloids &amp; Stabilizers</li> <li> Statistics</li> <li> Food Safety</li> <li> Proteins - Nutritive and non-nutritive sweeteners</li> <li> Qualification Methods &amp; Practices</li> <li> Food Regulations</li> \n</ul>\n\n<li> Quality Control &amp; Sampling knowledge and practice</li> <li> Co-Packer development and commercializing exposure</li> <li> Strategic and tactical decision-making ability using sound scientific principles and data analytics.</li> <li> Capability in directing suppliers through design, development/improvement to commercialization projects.</li> <li> Extensive experience in conceptually designing food formulations, utilizing consumer insight and technical knowledge.</li> <li> Proven ability, demonstrated by years of experience and achievements, leading multiple projects in cross-functional environment with minimal direction from a supervisor or manager.</li> <li> Proven ability, demonstrated by years of experience and achievements, to build technical competencies across multiple food platforms with minimal direction from a supervisor or manager.</li> <li> Proactive contributor and effective communicator within R&amp;D and project teams.</li> <li> Proven technical expertise with competent business awareness.</li> <li> Energetic and motivated.</li> <li> Ability and willingness to travel +35% consistently throughout various locations in the domestic US.</li> \n</ul>\n\nEEO Statement\n<br><br>\nDean Foods considers marijuana (including medical marijuana) to be an illegal drug. Dean Foods will rescind offers of employment to applicants who test positive for marijuana (unless restricted from doing so by state or local law). Dean Foods is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, citizenship, disability or protected veteran status.\n<br><br>"}