{"job title": "Senior Data Engineer", "company": "Evidation Health", "city state": "– Santa Barbara, CA", "rating": "4.5", "job description": "<div>Evidation Health is a technology and services company that helps individuals and the world's most innovative healthcare companies understand and influence the everyday behaviors that create better health outcomes. Evidation pairs a first of its kind discovery engine designed for better, faster, and more efficient studies with a delivery platform, Achievement, that connects individuals and the healthcare industry, including life sciences organizations, providers, payers, and digital health companies. The company's technology is designed to be entirely privacy-safe and individually-permissioned.\n<br><br>\nWe are seeking a Senior Data Engineer to join our Enterprise Data Engineering team. As a Senior Data Engineer you will be working on our Data Platform, coding in Python and React and using cutting-edge big data technologies such as Apache Spark, Airflow, Hadoop, and Jupyter to build out data pipelines, data lakes, full-stack applications, and analytics tools that scale on the cloud to empower data scientists to gather insights from billions of data points to improve health outcomes.<br><br><strong>RESPONSIBILITIES</strong>\n\n<ul>\n<li>Design scalable, high performance solutions that continuously handle terabytes of data and enable data scientists to analyze data at scale.</li><li>Understand overall performance, and design around improving data performance using different technologies, algorithm efficiencies and infrastructure architecture.</li><li>Work with customers to understand their needs. Develop and deliver products, that meet the customers needs, in a timely manner.</li> <li>Implement best practices and provide feedback to team members through peer reviews.</li>\n</ul>\n\n<strong>QUALIFICATIONS</strong>Technical Qualifications:\n<br>\n\n\n<ul>\n<li>5+ years experience in data engineering or full-stack engineering with strong database skills</li><li>Coding proficiency in at least one scripting language (Python, Ruby, Java, etc.)</li><li>Proficiency building data pipelines with big data processing technologies (Spark, Hadoop, Kafka, etc.)</li><li>Experience with SQL databases (e.g., Postgres, MySQL, Redshift) and Distributed Datastores (e.g., S3)</li><li>Distributing computing experience on the cloud (AWS, Google)</li>\n</ul>\n\n<strong>Professional Competencies:\n<br>\n</strong>\n\n<ul>\n<li>Strong written and verbal communication</li><li>Work effectively in a collaborative and cross-functional team environment</li><li>Take personal responsibility for driving initiatives forward and continually improving the product</li><li>Quality-focus, ensuring proper test coverage for all the code you write</li>\n</ul>\n\n<strong>BENEFITS</strong> \n\n<ul>\n<li>Health, dental, and vision benefits for you and competitive coverage for your family</li><li>Relocation support</li><li>Equity</li><li>Flexible work hours</li><li>Open vacation policy - take time when you need it</li><li>Support for remote work when needed</li><li>Relaxed work environment</li><li>Your choice of computing equipment and gear</li><li>Lots of opportunities for growth</li><li>Opportunity to work on fascinating challenges that improve peoples lives</li>\n</ul>\n\nEvidation Health values diversity and is committed to equal opportunity for all persons without regard to race, color, creed, religion, marital status, age, national origin or ancestry, political activity or affiliation, physical or mental disability, medical condition including genetic characteristics, marital status, sexual orientation, gender identity, sex or gender.</div>\n<br>SDL2017"}