{"job title": "Data Scientist and Computer Engineer, Machine Learning&amp;Artificial Intelligence, Finastra Innovations Lab", "company": "Finastra", "city state": "– Atlanta, GA", "rating": "2.6", "job description": "<strong>WHY DO WE LOVE COMING TO WORK EVERY DAY?</strong>\n<br><br>\nWith over 10,000 superstars across 48 different countries globally, it is hard not to be inspired every single day. At Finastra we celebrate in global knowledge sharing, diversity and an opportunity to make a difference for each other and for our customers.\n<br><br>\nWe are on a journey. After bringing two global Fintech leaders together in June 2017, Finastra has truly recognized the opportunity and power we have, by combining our expertise, successes and passion together. Whether it is in a collaboration hub or innovating with colleagues across our global landscape, we are one team creating a network of talent and creativity in a stimulating environment, to do what we can to make a difference for our customers.\n<br><br>\nOur people are leaders in their role and are always looking for new ways to help our customers grow, compete and optimize their business. From a graduate Software Engineer to an experienced Sales Executive we are looking for personal leadership and people with the appetite to understand the markets and customers we serve. We drive innovation that challenges the status quo and feel proud of the positive differences that we make every day. We recognize talent and provide a work environment where leaders can drive results, develop and grow their careers.\n<br><br>\nSuccess is what you do, success is what we achieve, together.\n<br><br>\nThe future of Finance is open combine your talents with Finastra opportunities to create an exciting career with us.\n<br><br>\nFor more information, visit Finastra.com\n<br><br>\nWhat will you contribute?\n<br><br>\nWorking as part of the Global Innovation team, this role with provide you with the opportunity to innovate, explore and build solutions with banks, fintech companies and partners using emerging technologies. Within our Innovation Lab based in Norcross, Georgia, you will develop and apply Artificial intelligence, Machine learning, Deep learning Blockchain and Robotics to various areas to solve for financial challenges.\n<br><br>\n<strong>Required Experience:</strong>\n\n\n<ul>\n<li>1+ year of experience in applying, development and validation of machine learning, deep learning and artificial intelligence to real customer and business problems.</li>\n<li>Master's or PhD in related field such as Computer Science, Machine Learning, Statistics, Math, Engineering, etc.</li>\n<li>Programing skills with machine learning/deep learning libraries (TensorFlow, Caffee, Scikit-learn, PyTorch, Keras, etc.)</li>\n<li>Programing skills with modern languages (Python, C#, Java, Scala, Go, etc.)</li>\n<li>Programing skills with APIs and micro-services (node.JS, swagger, containers)</li>\n<li>Programing skills with big-data open source stack (Hadoop, spark, map-reduce, etc.)</li>\n<li>Programming skills with front-end stack and analytics (html-5, angular, D3.JS, etc.)</li>\n</ul>\n\n<strong>Skills and Knowledge:</strong>\n\n\n<ul>\n<li>Thinks big and likes to generate bold concepts and ideas visionary by nature</li>\n<li>Passion to succeed and know how to celebrate quick wins but also understands how to fail fast and not to give up</li>\n<li>Take ideas into action by putting together fast workable solutions and gets the job done</li>\n<li>Understands how to balance between team work and independent development work</li>\n</ul>\n\n<strong>#LI-MG1</strong>\n<br><br>\nThe above statements describe the general nature and level of work being performed by people assigned to this job. They are not intended to be an exhaustive list of all responsibilities, duties, and skills required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. If you need assistance or an accommodation due to disability please contact us at 800-274-7280.\n<br><br>\nThe Future is Collaborative. The Future is Open. The Future is Now."}