{"job title": "Associate Director, Clinical Scientist", "company": "G1 Therapeutics", "city state": "– RTP, NC", "rating": "NA", "job description": "G1 Therapeutics is seeking an Associate Director, Clinical Scientist with oncology experience to join the team.<br><br>Responsibilities:\n\n<ul>\n<li>Provides support for development of clinical plans and individual study protocols</li><li>Writes or assists in writing of clinical plans, study protocols, and protocol amendments in close collaboration with Director, and Vice President, Clinical Development</li><li>Writes or assists in writing Investigator Brochures, DSURs and other regulatory documents</li><li>Assist other team members in Clinical Development in the implementation and conduct of clinical trials which includes but not limited to review of enrollment packets, review of adverse events and all other clinical data generated during conduct of trial</li><li>Work closely with Drug Safety and Biometrics including Data Management to ensure that all relevant clinical and safety data is collected in a timely manner and assist with cleaning of CRF data.</li><li>Participates in the development of clinical operation guidelines and maintains secure study files</li><li>May require travel to field sites and scientific meetings</li><li>Works on problems of a moderate scope where analysis of situations or data requires review of a variety of factors</li><li>Receives general instructions on routine work, detailed instructions on new projects or assignments</li><li>A self-starter and comfortable with fluctuating timelines, work demands and changes in scope of work</li><li>Ability to troubleshoot situations as needed and understands when issues or questions need to be escalated to the VP, Clinical Development</li>\n</ul>\n\n<strong>Requirements:\n<br>\n</strong>\n\n<ul>\n<li>BS/MS in related scientific field 7+ years, PhD/PharmD 5+ years clinical development/clinical operations. In addition, demonstrated potential for technical proficiency, creativity, collaboration with others, and independent thought.</li><li>Strong teamwork skills with demonstrated skills in managing a team.</li> <li>Oncology experience required</li>\n</ul>\nG1 Therapeutics provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state and local laws. G1 Therapeutics complies with applicable state and local laws governing non-discrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including, but not limited to, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.<br><br>0\n<br><br>\n<strong>Job Posted by ApplicantPro</strong>\n<br>"}