{"job title": "Behavioral Scientist", "company": "Healthy Minds Innovations", "city state": "– Madison, WI", "rating": "NA", "job description": "Healthy Minds Innovations, Inc. (HMI) is a 501(c)3 nonprofit organization affiliated with the Center for Healthy Minds, UW-Madison (CHM). Collectively, our mission is to cultivate well-being and relieve suffering through a scientific understanding of the mind. HMI contributes to this mission through the development and dissemination of tools and services based on scientific evidence. It also supports a social movement strategy aimed at the idea that well-being is a skill that can be learned.\n<br><br>\n<strong>Position Description</strong>\n<br><br>\nHealthy Minds Innovations is seeking a Ph.D. level scientist. This position will focus on developing and validating mobile measures to investigate skills underlying well-being. This position will support creating a mobile measures for large-scale use. The ideal candidate is highly self-motivated and capable of managing their workload and prioritizing tasks in a fast-paced environment. This full-time position is an excellent opportunity to gain substantial hands-on experience and training in many aspects of a quickly growing non-profit operation.\n<br><br>\n<strong>Responsibilities</strong>\n<ul>\n<li>Literature search and synthesis to identify candidate measures</li><li>Adapt and pilot measures as needed to implement on mobile devices</li><li>Generate specs for measures and guide mobile development with tech partners</li><li>Design and analyze studies to assess validity and reliability of measures on mobile</li><li>Maintain documentation related to measures development and validation studies</li><li>Present findings and recommendations to scientist and non-scientist groups</li><li>Support user experience research focused on in-the-world engagement with measures</li>\n</ul>\n<strong>Skills and Qualifications</strong>\n<ul>\n<li>Ph.D. in Psychology, Neuroscience, or a related field</li><li>Topical expertise in well-being, ideally including contemplative science</li><li>Demonstrated ability to complete projects as evidenced by first-author publications</li><li>Skilled at experimental design and measurement of behavior</li><li>Proficiency in psychometrics</li><li>Strong computer, statistical, and technical skills (Matlab, Python, R, or similar platforms)</li><li>Excellent organizational, interpersonal, and communication skills</li><li>Desire to work in a collaborative, multi-disciplinary environment</li><li>Excited about translating basic research to applied settings</li>\n</ul>\n<strong>Salary and Benefits:</strong>\n<br><br>\nSalary is commensurate with qualifications. HMI offers an extensive benefits package.\n<br><br>\nHealthy Minds Innovations, Inc. (HMI), is dedicated to supporting the mission of the Center for Healthy Minds, UW-Madison to cultivate well-being and relieve suffering through a scientific understanding of the mind.\n<br><br>\nHMI takes the discoveries and insights gleaned from Center research and transforms them into tools and services as well as helps manage events and public speaking engagements for the Center.\n<br><br>\nOngoing feedback and a wider dissemination of tools will allow for larger data collection, provide refinement, generate ideas for additional research and continually inform the field of the neuroscience of well-being.<br><br>0\n<br><br>\n<strong>Job Posted by ApplicantPro</strong>\n<br>"}