{"job title": "Reporting Data Analyst", "company": "ICF International, Inc", "city state": "– Trenton, NJ", "rating": "3.6", "job description": "Working at ICF\n<br><br>\nWorking at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you're seeking to make a difference in the world, visit www.icf.com/careers to find your next career. ICFtogether for tomorrow.\n<br><br>\nReporting and Data Analyst\n<br><br>\nEducation, Community and Social Programs (ECSP)\n<br><br>\nJustice and Community Development (JCD)\n<br><br>\nTrenton, NJ\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nJustice and Community Development (JCD) is a Line of Business within the Education, Community and Social Programs Division. Our work addresses disaster recovery, affordable housing, homelessness, economic sustainability, and community development. Our functional expertise is in technical assistance, performance measurement and evaluation, website development, and adult learning. Clients include HUD, HHS, and USDA among others. We often work in close collaboration with ICF experts across the firm on issues related to energy efficiency and green building, disaster planning and recovery, financial literacy, job training, and others. All our work is done in a professional, collegial, and intellectual environment that allows individuals pursue their passions and generate results.\n<br><br>\nTo support our growth, ICF is seeking an experienced Reporting and Data Analyst to support disaster recovery efforts related to disaster relief, long-term recovery, and restoration of infrastructure, housing, and economic revitalization. In this role, you will work with our team and our client to assess, define, and implement improved business processes to ensure that the client's recovery efforts are compliant with state and federal reporting requirements. You should be able to synthesize quantitative information from a variety of sources, juggle multiple tasks, and interact effectively with clients and colleagues. Ideally, you will should have an understanding of federal, state, and grant funding sources; experience with data management of basic and complex datasets from multiple sources and in multiple formats; the ability to interpret and communicate complex fiscal and administrative concepts to operational staff; and a sense of ownership and accountability as well as a willingness and commitment to adding value to the project. This is a full-time position with office assignment at the client site in Trenton, NJ. Travel is expected.\n<br><br>\n<strong>Key Responsibilities:</strong>\n\n\n<ul>\n<li>Develop a strong understanding of the client's processes and procedures to provide meaningful reports and analyses that focus on forecasting on operational and financial performance, burn rates, and average costs by individual Sandy program.</li>\n<li>Prepare reports, analyses, and briefings on CDBG-DR policy related issues for senior client staff.</li>\n<li>Proactive review, verification, and/or remediation of data quality in existing operational and financial reports. Work closely with the technology vendor to ensure that data corrections are made properly.</li>\n<li>Provide support to the client in monitoring and reconciling CDBG-DR and Program Income (PI) spending by specific Sandy program, CDBG-DR funding round, expense category (program delivery, direct program), and accounting object codes across three financial systems (Grants Management, State Treasury, Federal Reporting). Meet and discuss reconciliation concerns and disseminate resolution reports.</li>\n<li>Provide technical assistance to client staff and partner government agencies regarding programmatic metric data for Quarterly Performance Reports (QPR).</li>\n<li>Analyze new system changes to determine how they affect data across the multiple systems and reports.</li>\n<li>Work closely with external cross-functional teams (program, finance, compliance and monitoring, technology, contracts) on improving systems and reporting functionality, design and user experience, and endorsing a culture where high-quality data is at the forefront.</li>\n<li>Facilitate meetings between client staff and technology vendor to ensure that both parties arrive at complete, high quality requirements to reduce development time, costs and errors.</li>\n<li>Review and verify requirements specifications, process flow diagrams, and other system documentation generated by the technology vendor to ensure client needs are fulfilled.</li>\n<li>Generate high quality dashboard and report mock-ups to support requirements gathering and reporting requirements.</li>\n<li>Lead and be engaged in special projects, including ad hoc assignments, the production of special reports, and responses to federal and local inquiries, when necessary.</li>\n</ul>\n\n<strong>Basic Qualifications:</strong>\n\n\n<ul>\n<li>Bachelor's degree in a technical field (computer science, information science, accounting, finance) or related field of study</li>\n<li>8+ years of progressively increasing responsibility in related roles during which technical capability has been clearly demonstrated</li>\n<li>Proficient knowledge in MS Excel including use of advanced formulas, charts, and formatting to create polished and \"client ready\" deliverables</li>\n<li>Demonstrated experience be showing strong critical thinking and problem-solving skills paired with a desire to take initiative</li>\n<li>Demonstrated experience balancing and prioritizing multiple projects and competing priorities to meet goals, deliverables, and deadlines</li>\n<li>Ability to effectively communicate with client regarding issues, needs, and/or priority setting for projects</li>\n<li>Demonstrated experience working under pressure, both individually and collaboratively in a team environment</li>\n<li>Demonstrated ability to work with large amounts data, identify patterns, trends, and see the 'bigger picture'</li>\n<li>Ability to facilitate meetings and present complex information in an understandable and compelling manner</li>\n<li>Expertise in understanding business needs (including drawing out those unstated), translating these business needs into requirements, and then meeting them with data solutions</li>\n<li>Strong organizational skills and client service focus</li>\n<li>Must be comfortable with heavy client and colleague interaction (face to face, phone, email, and text)</li>\n</ul>\n\n<strong>Preferred Skills:</strong>\n\n\n<ul>\n<li>Master's degree in a technical field (Computer Science, Information Science, Accounting, Finance) or related field of study with 2+ years of experience in a client facing role as a business or data analyst</li>\n<li>Expertise in writing SQL queries against large data sets</li>\n<li>Experience with project management and agile development</li>\n<li>Experience managing the full data product lifecycle encompassing opportunity identification, requirements gathering, design, development, execution and sunsetting</li>\n<li>Advance experience using MS Office products (Word, Excel, PowerPoint, SharePoint, Visio) and the ability to learn new technology quickly</li>\n<li>Experience managing and mentoring junior staff, leading project tasks, and working directly with client management and leadership preferred</li>\n<li>Experience working with data related to federal grant reporting, financial analysis, public sector accounting, public policy analysis, grant management, and budgetary planning/management.</li>\n</ul>\n\n<strong>Professional Skills:</strong>\n\n\n<ul>\n<li>Excellent verbal, interpersonal and written communication skills</li>\n<li>Strong analytical, problem-solving and decision-making capabilities</li>\n<li>Resourceful and highly self-motivated</li>\n<li>Team player with the ability to motivate others</li>\n<li>Comfortable working in challenging and fast-paced environments with minimal oversight</li>\n<li>Ability to work calmly and proficiently under pressure, exercising independent judgment while effectively prioritizing and executing tasks</li>\n<li>Exceptional interpersonal skills and an ability to maintain working relationships with colleagues, client staff, state officials, partner government agencies, and all other internal and external workforces at all levels with utmost professionalism.</li>\n</ul>\n\nICF offers an excellent benefits package, an award-winning talent development program, and fosters a highly skilled, energized and empowered workforce.\n<br><br>\nICF is an equal opportunity employer that values diversity at all levels. (EOE Minorities/Females/ Protected Veterans Status/Disability Status/Sexual Orientation/Gender Identity)\n<br><br>\nPay Transparency Statement: For more information, please click here: https://www.dol.gov/ofccp/pdf/pay-transp_formattedESQA508c.pdf\n<br><br>\nWorking at ICF\n<br><br>\nWorking at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. ICFtogether for tomorrow.\n<br><br>\nAbout ICF\n<br><br>\nICF (NASDAQ:ICFI) is a global consulting and technology services provider with more than 5,000 professionals focused on making big things possible for our clients. We are business analysts, policy specialists, technologists, researchers, digital strategists, social scientists and creatives. Since 1969, government and commercial clients have worked with ICF to overcome their toughest challenges on issues that matter profoundly to their success. Come engage with us at icf.com.\n<br><br>\nNew Jersey Client Office (NJ88)"}