{"job title": "Certifying Scientist", "company": "LabCorp", "city state": "– Saint Paul, MN", "rating": "2.9", "job description": "Location Saint Paul, Minnesota Job ID 18-85029 Date posted 08/23/2018\n<br><br>\nMedTox Laboratories is a subsidiary of Laboratory Corporation of America (LabCorp). The integration of LabCorp and Covance in 2015 makes LabCorp the largest health care diagnostic company in the world. LabCorp operates in over 60 countries creating great opportunities for career growth and advancement across the world.\n<br><br>\nIf you are motivated by job satisfaction, MedTox Laboratories is the place for you. Every day we make a difference in the way the medical community receives accurate results for our clients and patients. Come join an industry leader to grow your career in the Medical Laboratory Industry as a Clinical Certifying Scientist\n<br><br>\nMedTox Clinical Certifying Team is seeking a Certifying Scientist. The Certifying Scientist is responsible for reviewing, certifying and reporting results. This position interacts with both internal and external clients on interpretation of results and issues arising from testing, and routinely consults with Laboratory Managers and Directors concerning results and client test management.\n<br><br>\n<strong>Key Responsibilities:</strong>\n\n\n<ul>\n<li>Review all test results for applicable screening and confirmatory testing methodologies, relevant Quality Control data and associated documentation; certify and release results; ensure that results meet quality standards</li>\n<li>Apply QC practices and procedures to the review, interpretation and reporting of results and when applicable monitor chain-of-custody documentation</li>\n<li>Take proper remedial action in response to test systems being out of control limits, detect aberrant results of quality control and takes appropriate action</li>\n<li>Provide consultation and assistance to clients when technical, interpretive, and/or regulatory questions arise</li>\n<li>Assist in training fellow certifying scientists and other LabCorp employees in the interpretation and reporting of results and applicable departmental processes</li>\n<li>Advise/consult with laboratory technical staff regarding routine testing issues and practices</li>\n<li>Assist in preparation of litigation packages and affidavits. Potential to provide testimony under subpoena</li>\n<li>Assist in preparation for inspections and audits. Interact with inspectors and auditors when appropriate</li>\n</ul>\n\nAbout our Company: MedTox Laboratories, a LabCorp Specialty Testing Group, located in the Roseville/New Brighton area operates a SAMHSA-certified drug testing laboratory and CAP and CLIA-certified clinical laboratory. Our comprehensive laboratory and testing services coupled with our commitment to excellent customer service ensures that our clients' testing programs operate as efficiently and effectively as possible. We are committed to building strong relationships with our clients; being responsive to their questions and adaptable to their needs.\n<br><br>\n<strong>Requirements</strong>\n<br><br>\n<strong>Required Education, Experience, Skills and Qualifications:</strong>\n\n\n<ul>\n<li>Bachelor's degree in Chemistry, Biology, Clinical Laboratory Science or related field or equivalent education and experience</li>\n<li>At least five years of pertinent laboratory experience; or four years of pertinent laboratory experience with two years certifying experience; or a Master's degree or higher in one of the above disciplines</li>\n<li>Must have the training and experience in the theory and practice of methods and procedures used in the laboratory for which the individual is certifying data</li>\n<li>Excellent communication and interpersonal skills including written, verbal, and listening skills</li>\n<li>Excellent research and problem resolution skills</li>\n<li>Must be able to perform work with a high degree of accuracy and attention to detail</li>\n<li>Work effectively in fast paced high volume environment</li>\n</ul>\n\n<strong>Preferred Education, Experience, Skills and Qualifications:</strong>\n\n\n<ul>\n<li>Two years of Confirmation experience (GCMS and/or LCMS)</li>\n</ul>\n\nShift2\n<br><br>\nSchedule2nd shift Mon-Fri ;12:30 pm to 9 pm with every 4th weekend commitment.\n<br><br>\nApply Now\n<br><br>\nShare\n\n\n<ul>\n<li>Facebook</li>\n<li>Twitter</li>\n<li>LinkedIn</li>\n<li>Email</li>\n</ul>\n\nLocation\n<br><br>\nCheck out where you could be working if you apply.\n<br><br>\nView Map\n<br><br>\nRelated Jobs\n\n\n<ul>\n<li>MCT Technologist Saint Paul, Minnesota</li>\n<li>Lab Services Team Lead Saint Paul, Minnesota</li>\n<li>Technologist Saint Paul, Minnesota</li>\n</ul>\n\nJoin Our Talent Community\n<br><br>\n<strong>Email:</strong>\n<br><br>\nInterested In:Search for a category and select one from the list of suggestions. Search for a location and select one from the list of suggestions. Finally, click \"Add\" to create your job alert.\n<br><br>\n<strong>Category:</strong>\n<br><br>\n<strong>Location:</strong>\n<br><br>\nAdd +\n\n\n<ul>\n<li>Laboratory Support, Saint Paul, Minnesota, United StatesRemove</li>\n<li>Laboratory Technician, Saint Paul, Minnesota, United StatesRemove</li>\n<li>Remove</li>\n</ul>\n\nConfirm Email\n<br><br>\nExplore More\n<br><br>\nLabcorp Specialty Labs\n<br><br>\nLabCorp and its Specialty Testing Group, a fully integrated portfolio of specialty and esoteric testing laboratories.\n<br><br>\nLearn More\n<br><br>\nPhlebotomy\n<br><br>\nAn important link between our patients and our laboratory.\n<br><br>\nLearn More\n<br><br>\nCytogenetics\n<br><br>\nHelp contribute to health care decisions nationwide.\n<br><br>\nLearn More\n<br><br>\nApplication FAQs\n<br><br>\nWhat you need to know about applying at LabCorp.\n<br><br>\nLearn More"}