{"job title": "Sequencing Scientist", "company": "Nesco Resource", "city state": "– Atlanta, Georgia", "rating": "3.2", "job description": "<strong> Molecular Virologist/Next Generation Sequencing Scientist</strong>\n<br><br>\nCLIENT is guided by a founding mission. We invest our knowledge, talents and resources, helping our customers achieve their most important goals. We apply scientific rigor and creativity, succeeding where others may fail and we invest in our communities, making the world better for generations to come. All of us share a common purpose: to solve the greatest challenges of today and tomorrow.\n<br><br>\nOur 22,000 employees work at the forefront of scientific innovation to tackle critical challenges in security, human health, manufacturing, energy and environmental management. CLIENTs work is grounded in the belief that science, technology and a passion for excellence can make industries more competitive and the world a better place.\n<br><br>\nWe are currently seeking a Molecular Virologist/NGS scientist. This position is located on the Roybal Campus in Atlanta, Georgia.\n<br><br>\n<strong>JOB DESCRIPTION</strong>\n<br><br>\nCLIENTs Integrated Science Solutions (ISS) is a part of the Contract Research business within CLIENT providing laboratory support to the Centers for Disease Control and Prevention (CDC). We are currently seeking a molecular virologist/NGS scientist for a team focused on developing influenza genomic methods for the Influenza Genomics Team. The position plays a critical role in the development of new approaches in Next Generation Sequencing and Advance Molecular Detection techniques to assist in genetic surveillance of influenza.\n<br>\nThe position is located in the Influenza Division (ID) of the National Center for Immunization and Respiratory Diseases (NCIRD), OID, CDC at the Roybal Campus, Atlanta, Georgia.\n<br><br>\nISS is working with HHS/CDC which is responsible for pandemic influenza preparedness. The CDC ID provides critical standards for pandemic preparedness to the US State Public Health Laboratories and acts as a World Health Organization (WHO) reference laboratory supporting international influenza surveillance and response networks. Rapid genetic and antigenic characterization of circulating viral strains coupled with vaccine development are essential components to increase pandemic readiness and response. CDC requires support in research and development efforts to eliminate data gaps in influenza surveillance by increasing the diagnostic and immunization tools available to clinical providers, public health laboratories and domestic and international partners. Monitoring influenza viruses through the application of molecular technologies and incorporation of laboratory surveillance with classic epidemiology facilitate detection of new epidemic variants and provide complete and accurate information about influenza viruses posing a pandemic threat. The use of viral molecular technologies and surveillance studies will provide candidate viruses for pre-pandemic and pandemic vaccine development to assist decision makers in formulating management strategies needed during influenza outbreaks, epidemics or pandemic.\n<br><br>\n<strong>RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>Provide technical support to the sequencing activities of the Division by developing methods using Next Generation Sequencing and Advanced Molecular Detection techniques/instruments to assist in the ISA task of maintaining genetic surveillance in influenza</li>\n<li>Investigate how influenza responds to host changes and treatment, explore tissue specificity, and Client compensatory mutations that stabilize antigenic drift and resistance</li>\n<li>Have experience with PacBio, and Illumina sequencing platforms</li>\n<li>Develop new protocols and techniques to address challenges of genetic sequencing for influenza including Diagnostic and Metagenomics strategies of influenza detection</li>\n<li>Explore and contribute development and implementation of data analysis techniques that align and assemble HGS data.</li>\n<li>Provide additional support towards technical and informatics development for the Influenza Genomics team</li>\n<li>Keep up with necessary laboratory supplies and stock inventory, along with detailed record keeping and report preparation as requested</li>\n<li>Train other staff and Generate protocols of developed techniques, and provide training and technical support to colleagues as part of cross training</li>\n<li>Maintain Compliance with all Division and Agency safety protocols</li>\n<li>Contribute to journal articles, manuscripts and technical documents on an as needed basis</li>\n</ul>\n\n<strong>THE FOLLOWING REQUIREMENTS MUST BE MET TO BE CONSIDERED FOR THIS POSITION:</strong>\n\n\n<ul>\n<li>BS 5-8, MS 3-5 or PhD 0-2 years of experience in bioinformatics, computer science, genetics, microbiology, biology, or biochemistry working in laboratories demonstrating expertise in bioinformatics, next-generation sequencing methodology, and/or molecular biology.</li>\n<li>Proficient in visualization and data analysis from Next Gen Sequencing systems</li>\n<li>Expertise must include: data management, project design and execution, data analysis, de novo genome sequencing, assembly, annotation, and functional analyses.</li>\n<li>Demonstrated proficiency in conducting research, data-analysis, and problem solving to maintain successful self-directed project management.</li>\n<li>Willingness and ability to shift project priorities based on client needs and contract deliverables.</li>\n<li>Experienced in sequencing genes/genomes of viruses, preferably influenza, but not required</li>\n<li>Familiar with modern NGS platforms</li>\n<li>Demonstrated interpersonal skills with ability to work collaboratively with other scientists and laboratorians</li>\n<li>A bioterrorism risk assessment for handling select agents may be required</li>\n</ul>\n\n<strong>DESIRED, BUT NOT REQUIRED:</strong>\n\n\n<ul>\n<li>Proficiency with broad molecular laboratory toolbox, computational analysis, and expertise in the following computer skills: Linux, Python, and Perl</li>\n<li>Experience with Next Gen Sequencing LIMS (Laboratory Information Management Systems) to support sample tracking, sample bulk upload, custom parameters.</li>\n</ul>"}