{"job title": "Research Scientist III", "company": "New York State Psychiatry Institute", "city state": "– New York, NY", "rating": "NA", "job description": "Description:\n<br><br>\nMental Health Data Science at NYSPI is seeking for an exceptional postdoctoral research scientist in the field of statistics, biostatistics and neuroscience.\n<br><br>\nDuties and Responsibilities:\n<br><br>\nPrimary duties will include the analysis of rich neuroimaging datasets that include both cross-sectional and longitudinal multimodal MRI data. The successful applicant will play a central role in the analysis and dissemination of data from a large imaging studies, in particular focusing on developing and applying methods for integrating multimodal imaging (sMRI, ASL, DTI, fMRI) and potentially genetic data.\n<br><br>\nMinimum Qualifications:\n<br><br>\nEligible candidates must have a doctoral degree in statistics, biostatistics, biomedical engineering, computer science or related field. Demonstrated proficiency in R, Matlab, python, shell scripting or similar programming languages or software tools is required.\n<br><br>\nPreferred Qualifications:\n<br><br>\nIdeal candidates will have experience in the analysis of MRI data including statistical analysis software such as FSL, SPM, Freesurfer or others. An interest and expertise in imaging, brain network and connectivity analysis, or multivariate large-scale pattern recognition or machine learning techniques is an advantage. The successful applicant will have well-developed problem solving skills, be able to manage several projects simultaneously, lead and mentor students and research assistants, have excellent computing as well as verbal and written English skills, and an aptitude for writing manuscripts and giving scientific presentations.\n<br><br>\n<strong>To apply:</strong>  Submit an application with cover letter and resume by September 4, 2018 through our website https://nyspi.applicantpro.com/jobs/. Only applications submitted through the RFMH website will be accepted.\n<br><br>\nThe Research Foundation is a private not-for-profit corporation and is not an agency or instrumentality of the State of New York. Employees of the Research Foundation are not state employees, do not participate in any state retirement system, and do not receive state fringe benefits. Excellent Benefits Package. Employer/Minority/Women/Disabled/Veteran Employer. VEVRAA 41 CFR 60-300.5(a) compliant.<br><br><strong>Job Posted by ApplicantPro</strong>\n<br>"}