{"job title": "environ Scientist II", "company": "State of North Dakota", "city state": "– Bismarck, ND", "rating": "3.5", "job description": "Summary of Work\n<br><br>\nThis position is with the Drinking Water Program in the Division of Municipal Facilities. The Drinking Water Program works with public water systems (PWSs) in North Dakota to ensure that drinking water meets all enforceable standards established under the Safe Drinking Water Act (SDWA). This is accomplished by monitoring for contaminants, providing operator training and certification, conducting inspections, ensuring proper design of upgraded/new facilities, and providing compliance/technical assistance. Also administers the state's fluoridation program and provides technical assistance to private water systems\n<br><br>\n<strong>Responsibilities of the position include:</strong>\n\n\n<ul>\n<li>Evaluate groundwater sources for potential direct influence by surface water.</li>\n<li>Coordinate sampling kit assembly and sampling timeframes with Department's Laboratory Services Division for primary and secondary inorganic chemicals.</li>\n<li>Coordinate acrylamide and epichlorohydrin surveys to determine compliance.</li>\n<li>Oversee implementation of the Filter Backwash Rule.</li>\n<li>As requested, assist in implementation of the Revised Total Coliform Rule and future emerging contaminant issues.</li>\n<li>Assist in implementation of the state Source Water Assessment and Protection program.</li>\n<li>Collect latitude, longitude and elevation readings of wells, water treatment plants and water intake structures.</li>\n<li>As requested, sample PWSs for regulated and unregulated chemicals and radionuclides.</li>\n<li>Enter well data into the Safe Drinking Water Information System.</li>\n<li>Assist in implementing new/modified requirements for groundwater to retain SDWA primacy.</li>\n<li>Provide technical assistance to public and private water systems on groundwater issues.</li>\n<li>As requested, prepare and deliver presentations at Spring Operator Training and the fall meeting of the ND Water and Pollution Control Conference.</li>\n</ul>\n\n<strong>Desirable Knowledge, Skills, and Abilities:</strong>\n\n\n<ul>\n<li>Good understanding of the basic principles and concepts associated with environmental issues and systems.</li>\n<li>Skill in reviewing, analyzing and resolving environmental problems, and in gathering information and data for preparing reports.</li>\n<li>Ability to interpret regulations and provide guidance and assistance on policies and procedures for achieving and maintaining compliance.</li>\n<li>Effective oral and written communication skills.</li>\n<li>Good interpersonal skills.</li>\n<li>Computer skills including usage of databases and spreadsheets.</li>\n</ul>\n\n<strong>Minimum Qualifications</strong>\n<br><br>\nThe position requires a bachelor's degree in a natural or physical science with emphasis in hydrology, geology, and chemistry and one year of related experience.\n<br><br>\nApplicants must have a valid driver's license.\n<br><br>\nIf unable to find a qualified candidate, the department will consider under-filling the position as an Environmental Scientist I, which requires a bachelor's degree in one of the fields listed above.\n<br><br>\nPreferred Qualifications\n<br><br>\nPreference will be given to applicants that have experience in the construction, operation, maintenance, and monitoring of groundwater wells used for potable water. Applicants are requested to describe such experience in the application.\n<br><br>\nApplication Procedures\n<br><br>\nAll applications for open Department of Health positions must be made via the Careers site: http://www.nd.gov/omb/jobs Paper submissions will not be accepted. Application materials must be received by 11:59 PM on the posted closing date. All potential applicants must attach and/or upload the following documents in a .pdf, .docx, or .doc format:\n\n\n<ul>\n<li>Resume</li>\n<li>Cover letter that includes a brief description of the applicant's background/qualifications</li>\n<li>College transcript (copies or unofficial versions are acceptable)</li>\n</ul>\n\nApplicants who are residents of North Dakota and eligible to claim veteran's preference must include Form DD214. Claims for disabled veteran's preference must include a current statement of disabled status from the Veterans' Affairs Office.\n<br><br>\nPlease fill in all requested information, such as dates of employment, hours worked per week, credits earned, etc.\n<br><br>\nApplications will be scored against the minimum qualifications and preferences listed on the job announcement and qualifying military service. After the scoring is completed, a certified list of eligible candidates and the applications will be forwarded to the hiring manager for further consideration and possible interview, based on the final scores.\n<br><br>\nFor more information about the position, contact Greg Wavra, Drinking Water Program Administrator, Division of Municipal Facilities, at 701.328.5211. For assistance in the application or interview process, contact Stacy Hoffman, Human Resources Officer, at 701.328.3321 or TTY 800.366.6888.\n<br><br>\nApplicants must be legally authorized to work in the United States. Sponsorships will only be considered if funding is available.\n<br><br>\nEqual Employment Opportunity\n<br><br>\nThe State of North Dakota and this hiring agency do not discriminate on the basis of race, color, national origin, sex, genetics, religion, age or disability in employment or the provisions of services and complies with the provisions of the North Dakota Human Rights Act.\n<br><br>\nAs an employer, the State of North Dakota prohibits smoking in all places of state employment in accordance with N.D.C.C. § 23-12-10."}