{"job title": "Scientist, R&amp;D", "company": "Vericel", "city state": "– Cambridge, MA", "rating": "3.3", "job description": "<strong>Department Description:</strong>\n<br><br>\nThe Research and Development group within Vericel supports the continuing development, characterization and validation of manufacturing methods, novel assays, new technology and operational improvements. This group manages technology transfers, clinical manufacturing, training, database development, trending analysis and stability. The R&amp;D team plays an important role in commercial manufacturing troubleshooting, root cause investigation, process optimization and product life cycle management.\n<br><br>\n<strong>Position Summary:</strong>\n<br><br>\nApplies scientific principles and expertise in the design and development of robust, cost-effective manufacturing procedures and associated analytical method that meet quality, GMP, regulatory and health, safety, and environmental standards.\n<br><br>\n<strong>Core Responsibilities:</strong>\n\n\n<ul>\n<li>Demonstrates a comprehensive solid understanding and use of scientific principles and professional practices, to solve a wide range of complex problems in creative and practical ways.</li>\n<li>Leads cross-functional development teams and provides scientific support and guidance in the development, scale-up, optimization and operation of methods for the production and testing of new components, technologies and products.</li>\n<li>Maintains and demonstrates significant knowledge of state-of-the art principles and theories in area of responsibility.</li>\n<li>Independently reviews existing process and analytical development and production data; designs and conducts necessary experiments; interprets results; recommends changes or additional experiments.</li>\n<li>Designs, executes, and interprets experiments to identify new methods to enhance the manufacture of or characterization of products in regards to safety, identity, strength, purity, stability and quality with minimal direction.</li>\n<li>Stay abreast of new developments/technologies in areas of responsibility. Prepares proposals for introduction of technologies outlining the positive impact to the product for cost and/or quality.</li>\n<li>Participate in establishing project strategy in consultation with management.</li>\n<li>Represents the corporation in the greater biotech community by publishing in peer review journals and participation in scientific/technical conferences.</li>\n<li>Represents the organization as the prime technical contact on contracts and projects. Interacts with senior external personnel on significant technical matters often requiring coordination between organizations.</li>\n<li>Guides the successful completion of major programs and may function in a project leadership role.</li>\n<li>Directs the work of more junior staff. Provides technical guidance and trains less experienced staff.</li>\n<li>Other duties as assigned.</li>\n</ul>\n\n<strong>Leadership Qualifications:</strong>\n<br><br>\nAn ongoing commitment to conducting our global business according to the highest legal and ethical standards, and to continually pursue excellence in the development and delivery of all of our products and services. This includes:\n\n\n<ul>\n<li>Respecting the laws and operating within the applicable regulations of the places in which we conduct business, as well as our own Company policies and procedures.</li>\n<li>Being honest and treating people with respect and courtesy.</li>\n<li>Constantly striving to make Vericel a great place to work, and a company respected for the quality of its people and products.</li>\n<li>Acting as role models for our fellow employees by acting responsibly, fairly, and honestly in our dealings and exercising sound judgment in performing our jobs.</li>\n</ul>\n\n<strong>Basic Qualifications:</strong>\n\n\n<ul>\n<li>BS and 8+ years of related work experience, or</li>\n<li>MS and 6+ years of related work experience, or</li>\n<li>Ph.D. or equivalent in Biology, Biochemistry, Biomedical engineering, Pharmaceutical Sciences or related fields and 4+ years of related work experience.</li>\n<li>Advanced expertise in mammalian cell culture and related techniques.</li>\n<li>Familiarity with technical writing and statistical analysis to produce research protocols and reports.</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>4+ years of experience working on development or support of assays and/or manufacturing processes for a biological drug in a GMP facility.</li>\n<li>4+ years of experience in isolation and culturing human primary cells.</li>\n<li>Experience with medium development, cell banking methods and development of cell-based assays.</li>\n<li>2+ years of experience in developing autologous cell therapies or tissue engineered products</li>\n<li>Proficient with molecular biology techniques and Flow Cytometry.</li>\n<li>Extensive hands-on experience in analytical methods for protein, RNA and DNA analysis.</li>\n<li>Prior experience in cGMP environment and clean room requirements.</li>\n<li>Prior success with cell-based assay development.</li>\n<li>Good leadership and people skills, team work experience, and demonstrated conflict handling and resolution ability and negotiation skills.</li>\n<li>Good achievement and record in scientific research and technical development as evidenced by research paper, conference presentation, and patent publications.</li>\n<li>Self-motivated, organized, familiar with the relevant literature, attention to details.</li>\n</ul>\n\nAll applicants will receive consideration for employment without regard to their race, color, religion, sex, national origin, sexual orientation, gender identity, or protected veteran status and will receive consideration for employment and will not be discriminated against on the basis of disability. Vericel Corporation is an Equal Opportunity Employer.\n<br><br>\nVericel Corporation is VEVRAA federal contractor and desires priority referrals of protected veterans for job openings at all locations within the state.<br><br>SDL2017"}