{"job title": "Software Engineer in Test", "company": "Accruent", "city state": "– New Orleans, LA", "rating": "3.2", "job description": "<strong>Software Engineer in Test</strong>\n<br><br>\nThe <strong>Software Engineer in Test</strong> is responsible for designing, developing, and analyzing automated test suites and tools for Accruent's asset management software. Responsibilities include mentoring entry level Software Associates in Test, reviewing manual test suites for automation, and developing automation tools and utilities in a variety of programming languages for a web based enterprise application.\n<br><br>\nThe ideal candidate will be highly motivated and have a passion for technology and creative problem solving. If you are self-driven, enjoy working in a team environment, have an entrepreneurial spirit and enjoy creating innovative solutions to complex problems, Accruent may be a fit for you.\n<br><br>\n<strong>ESSENTIAL DUTIES &amp; RESPONSIBILITIES</strong>\n\n<ul>\n<li>Develop automation by writing components, tools, and scripts to automate the owned test cases</li>\n<li>Develop powerful tools and automation systems to accelerate product development, ensuring long-term quality</li>\n<li>Automate and execute functional UI and API end to end tests as well as integration tests.</li>\n<li>Ensure the teams and roles you work with are following the standards and best practices when working with QA</li>\n<li>Create test documentation (test strategies, plans, designs, scripts) derived from a variety of sources (business use cases, functional specifications, object models, relational diagrams, class diagrams, and system diagrams) to support individual and group testing efforts.</li>\n<li>Create feature test plans and cases, and supporting applications, harnesses, and automation to successfully test at the API, class, interface, data access, and application layers</li>\n<li>Assist in maintaining quality of work through regular code reviews</li>\n<li>Mentor entry level Software Associates in Test on engineering and company best practices</li>\n<li>Advocate for quality software development by influencing and improving upstream development processes, creating a proactive approach to quality in all its forms</li>\n<li>Analyzes test results to determine where application bugs exist and where tests need improvement</li>\n</ul>\n<strong>REQUIRED KNOWLEDGE, SKILLS &amp; ABILITIES</strong>\n\n<ul>\n<li>Bachelor's Degree in Computer Science, Engineering, Math or Physics, graduation from Technical School, or 2 years of equivalent experience.</li>\n<li>1+ years of test experience</li>\n<li>2+ years of programming experience (C#, Java, Ruby, Python)</li>\n<li>Understanding of risk based testing and risk mitigation planning</li>\n<li>Ability to use metrics and data to holistically assess the testing needs of a product</li>\n<li>Clear understanding of software development practices and life cycles</li>\n<li>Strong knowledge of Object Oriented concepts</li>\n<li>Self-reliant and motivated self-starter</li>\n<li>Project and task oriented with a focus on details</li>\n<li>Ability to work well within a group or individually on projects</li>\n</ul>\n<strong>DESIRED</strong> <strong>SKILLS/EXPERIENCE</strong>\n\n<ul>\n<li>Knowledge of industry testing/development best practices</li>\n<li>Agile Development Methodologies (Scrum/Kanban)</li>\n<li>Scalable Enterprise Web Based Applications</li>\n<li>HTML5 (HTML, XML, CSS, &amp; Javascript), and .NET/Java Development Environments</li>\n<li>Automated Testing Using Python, PERL, Java, Robot Framework, Selenium, SQL, etc.</li>\n<li>Using unit test frameworks such as xUnit or JUnit</li>\n<li>Building mocks/stubs to perform isolated testing</li>\n<li>Mobile Platform Testing (Android, iOS, Windows Phone)</li>\n<li>UI/UX, CLI, Microservice, and API Testing</li>\n<li>Cloud IaaS Solutions (AWS, Azure, OpenStack, etc.)</li>\n<li>Database Management Systems</li>\n<li>Linux and Windows Server/IIS Environments Testing</li>\n<li>Proven ability to write test automation frameworks or harnesses</li>\n<li>Experience with Crucible, Git, and Jenkins</li>\n</ul>\n<strong>ABOUT ACCRUENT</strong>\n<br><br>\nAccruent is a global software company that helps organizations achieve superior performance by transforming how they manage their physical resources. Its innovative, industry-leading cloud-based software and services enable organizations to optimize all stages of real estate, facilities and asset management, from capital planning through to IoT-based monitoring and control. With a proven track record across two decades, Accruent has created the only integrated SaaS-based framework and reporting platform for full lifecycle physical resource management. More than 7,000 global customers depend on Accruent solutions to drive out hidden costs, extend asset lifecycles, protect their brands, ensure compliance and deliver on the missions of their organization. Headquartered in Austin, Texas, Accruent serves a wide range of industries in 149 countries around the world.For more information, visit www.accruent.com.\n<br><br>\n<em>Accruent is an Equal Opportunity, Affirmative Action employer.</em> <em>Women, minorities, veterans, and individuals with disabilities are encouraged to apply.</em><br><br>All offers of employment are made contingent upon the successful completion of a background check. A background check may include: verification of education, past employment, criminal background reports, motor vehicle driving records, reference checks, civil suit records, drug test and/or investigations into incidents involving theft, fraud, harassment and workplace violence. The company is the sole determinant of a successful background check."}