{"job title": "Software Development Engineer in Test II", "company": "Akamai", "city state": "– Santa Clara, CA", "rating": "3.7", "job description": "<div><div><div><div><div>About the Job\n<br><br>\nThis position will offer the opportunity to be part of the highly motivated team that works on software running on one of the largest distributed systems in the world. You will be an integral part of our aggressive growth strategy for creating highly innovative security products for the Internet scale, making our products more reliable, secure and faster.\n<br><br>\nThe team works on a product for detecting API abuse for web and mobile APIs\n<br>\nThe role involves creating validation framework for end to end testing of the system, coming up with innovative ways to test the web and mobile threat detection APIs. Role also involves working on a test data generation, improving and maintaining current set of tests. Experience in creating and improving the tests for client side components like JavaScript would be need as well.\n<br><br>\nThe ideal candidate must have a background in web API testing, building test frameworks for complex systems and maintaining test systems.\n<br><br>\nThe candidate will need to partner and work closely with dev team.\n<br><br>\nAbout the Team\n<br><br>\nAkamai powers over 85% of the top online retailers and delivers somewhere between 15% to 30% of Internet traffic on any given day. Our team is part of the Security organization which is responsible for design and development of technology that helps customers to protect their web sites and secure the transactions over the web. Our Bot Manager product is designed to provide superior cloud computing security, prevent data theft and downtime and mitigate large account takeover attempts. In addition, this group is building unique technology that can secure the cloud and make it a safe place to do billions of transactions daily and handles petabytes of data every day. Akamai has built a massive global distributed network that can solve problems at a scale that few others can approach. By leveraging our deployment of servers around the world, we can uniquely solve technology problems with innovative solutions that exceed the fundamental limitations of networking.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Perform automated functional test, performance test and end-to-end product test</li>\n<li>Contribute to system test methodologies and effective test automation building for product apis.</li>\n<li>Create, deploy and maintain automated functional tests</li>\n<li>Create a framework to generate test data which replicates real-world scenarios</li>\n<li>Work closely with the dev team to come up with regression tests that cover changes to our software.</li>\n<li>Work with different teams to troubleshoot and reproduce complex problems for our customers.</li>\n<li>Self-motivated, willing excel in their role, leading by example and keeping enthusiasm high under stressful situations</li>\n<li>Ability to test Javascript functions for accuracy and performance.</li>\n<li>Overseeing the Javascript releases to customers</li>\n</ul>\n\n<div>\nRequired Education and Experience\n<br>\nApplicants must meet one of the following education and experience requirements:\n\n\n<ul>\n<li>3+ years of relevant experience and a Bachelor’s degree or</li>\n<li>1+ years of relevant experience and a Master’s degree</li>\n</ul>\n\nRequired Qualifications\n\n\n<ul>\n<li>Education: Bachelor's Degree in Computer Science or equivalent.</li>\n<li>Minimum of 3 years of overall SW testing experience.</li>\n<li>3+ years of experience with web API testing.</li>\n<li>3+ years of scripting experience with using Python for building test frameworks.</li>\n<li>1+ years experience with JavaScript testing</li>\n</ul>\n\n<strong>Desired Qualifications</strong>\n\n\n<ul>\n<li>Education: Master's Degree in Computer Science or equivalent.</li>\n<li>Understanding of AWS would be a plus.</li>\n<li>Experience in software release testing on tight schedules with high quality.</li>\n<li>Experience in developing automated testing infrastructures.</li>\n<li>Design with best possible architectures and clean code</li>\n<li>Drive for product quality and attention to detail</li>\n<li>The ability to manage and prioritize own workload effectively</li>\n<li>Highly responsible, self-disciplined, self-managed, self-motivated, able to work with little or no supervision.</li>\n<li>Passion to understand, learn, and dissect new technologies quickly on your own.</li>\n<li>Extensive experience working on multiple projects at a time in a fast paced, results oriented environment.</li>\n<li>Experience with the complete software development life cycle</li>\n<li>Excellent written and verbal communications skills.</li>\n<li>Pluses: Security domain knowledge</li>\n<li>Pluses: Data Science, Machine Learning, Math and Statistics.</li>\n</ul>\n\nOther Information\n\n\n<ul>\n<li>Is relocation available for this position: No</li>\n<li>Is US Citizenship required: No</li>\n<li>Is a Security Clearance Required: No</li>\n</ul>\n\nIf yes, applicants selected will be subject to a government security investigation &amp; must meet eligibility requirements for access to classified information.\n</div>\n </div>\n</div>\n </div>\n </div>\n</div>\n<br>"}