{"job title": "Platform Engineer", "company": "Anaplan", "city state": "– San Francisco, CA", "rating": "4.1", "job description": "<strong>Platform Engineer</strong>\n<br><br>\n<strong>San Francisco, CA</strong>\n<br><br>\nAre you a creative problem solver who can both give and receive feedback? Do you lead with inclusion, collaboration and openness?\n<br><br>\nAt Anaplan, we are looking for a self-motivated Platform Engineer to join our growing engineering team in San Francisco. This is an opportunity for you to work for a high-growth startup disrupting how companies do business.\n<br><br>\nAs a Platform Engineer you'll be building the next generation of the Anaplan Platform. With big technical problems to solve - you'll have the chance to push boundaries and create something new.\n<br><br>\nWe have a long list of incredible benefits and offer highly competitive packages - we're serious about attracting the best technologists in the industry. You'll be working with super smart people who are pushing Java and the JVM to the limits. We'll also offer you a rewarding career with a company that values diversity and invests in you.\n<br><br>\nThis role is an immediate full-time position. If you're ready to roll up your sleeves and take on unique problems that no one is solving in the tech space yet, keep reading.\n<br><br>\n<strong>What we're looking for:</strong>\n\n<ul>\n<li>Extraordinary communication and collaboration skills. You are pragmatic and know how to build trust.</li>\n<li>A passion for engineering and a consistent record of delivering great software</li>\n<li>An advocate of TDD, you write code that is tested and testable</li>\n<li>Ability to coach and collaborate - you enjoy working closely with others, pairing and learning, and are comfortable showing off your work.</li>\n<li>Ability to confidently discuss and explain topics such as design patterns, memory management, garbage collection and performance optimization</li>\n<li>Positive energy and enthusiasm - cultural fit is a really big deal for uswe're looking for really smart people who love solving big problems and are self-motivated to get things done.</li>\n</ul>\n<strong>You must have:</strong>\n\n<ul>\n<li>5+ years of professional experience as a distributed systems engineer</li>\n<li>Experience in design, implementation and deployment of scalable API services</li>\n<li>Experience with Java, Spring frameworks, multi-threading, and caching techniques</li>\n<li>Experience with CQRS, event sourcing, streaming data and complex event processing</li>\n<li>Experience working with containers and container-orchestration tools like Docker and Kubernetes</li>\n</ul>\n<strong>You should ideally have experience with, or a very good understanding of:</strong>\n\n<ul>\n<li>Distributed computing systems such as GigaSpaces, Hazelcast, Coherent</li>\n<li>Messaging systems such as Kafka, AMQP (RabbitMQ), ZeroMQ</li>\n<li>Cloud infrastructure such as AWS, GCP or Azure</li>\n<li>Database management systems (SQL, noSQL)</li>\n<li>High performance (HPC) / low-latency computing (LLC)</li>\n<li>Mechanical sympathy (LMAX Disruptor)</li>\n<li>Creation of DSLs (ANTLR, Lexers, Parsers, Translators)</li>\n</ul>\n<strong>Technologies you would work with:</strong>\n\n<ul>\n<li>Java 10+</li>\n<li>Kubernetes</li>\n<li>Docker</li>\n<li>Apache Kafka</li>\n<li>Apache Cassandra</li>\n<li>AWS, GCP, Azure</li>\n</ul>\n<strong>Do you align with Anaplan's Values?</strong>\n\n<ul>\n<li>Open</li>\n<li>Creative</li>\n<li>Authentic</li>\n<li>Inclusive</li>\n<li>Collaborative</li>\n</ul>\n<strong>Explore all of our Values on Anaplan.com/careers</strong>\n<br><br>\n#AnaplanLOVE\n<br><br>\n<strong>About the Anaplan San Francisco office</strong>\n<br><br>\nLocated in SOMA district, when you walk into our San Francisco office, you can feel the excitement and energy of what we are doing at Anaplan. Open floor plan, stocked kitchens, and collaboration spaces, we gear our office around making sure you have everything you need to work well. And whether it's a company outing to a Giants game or team happy hour, there are always events for you to connect with your colleagues outside of work. You will join a team of individuals who embrace and respect diverse perspectives, aren't afraid to push boundaries and try new ideas, and are passionate about helping our customers and each other succeed. We work hard, but we also don't wait for an excuse to have fun and we inspire each other!\n<br><br>\n<strong>CAN'T FIND THE PERFECT ROLE FOR YOU? NEW OPPORTUNITIES ARE OPENING UP DAILY:</strong>\n<br><br>\n<strong>ANAPLAN.COM/CAREERS</strong>\n<br><br>\n#LI-TH1"}