{"job title": "Quality Engineer", "company": "Chart Industries", "city state": "– New Prague, MN", "rating": "2.8", "job description": "<strong>Ensuring Chart’s Success…</strong>\n<br><br>\nAssist in the technical aspects of assuring Chart products meet all code and regulatory requirements as well as meet or exceed customer expectations related to function and product quality.\n<br><br>\n<strong>What Your Day-to-Day Activities Will Be…</strong>\n\n<ul>\n\n\t<li>Participate in the development of quality management system to ensure compliance to ISO 9001, 14001 and OHS 18001 &amp; other regulatory requirements.</li>\n<li>Participate in product &amp; process review to ensure compliance with applicable industrial standards &amp; codes.</li>\n<li>Participate in risk analysis, product and process quality planning, quality performance, non-conformance prevention and root cause corrective actions.</li>\n<li>Conduct internal and/or external assessments of Quality Management Systems, prepare and write audit reports and conduct verification activities.</li>\n<li>Develops and maintain key metrics on product and process performance</li>\n<li>Drive continuous improvement actions based on the data compiled</li>\n<li>Assist on containment and associated corrective actions on internal or external product non-conformities</li>\n</ul>\n<strong>Your Professional Experience Should Be…</strong>\n\n<ul>\n\n\t<li>3-5 years of Quality Assurance, Quality Engineering or Quality Compliance in a manufacturing environment</li>\n<li>Experience in the documentation, implementation, and maintenance of ISO-9001 and other quality management systems</li>\n<li>Knowledge of related codes and standards – such as ISO 9001, AAR, ASME etc.</li>\n<li>Familiar with FMEA, CAPA, Lean and other quality engineering/assurance techniques</li>\n<li>Skills in successfully working with multi-functional departments to achieve desired results</li>\n<li>Effective in using MS Office Software programs (such as MS Word, Excel, Access, etc.) for data collection, analysis, and report generation</li>\n<li>Detail oriented, with a drive to meet or exceed internal &amp; external customer requirements</li>\n</ul>\n<strong>Your Education Should Be…</strong>\n\n<ul>\n\n\t<li>Bachelor's degree in Engineering (ME, IE, QE)</li> \n</ul>\n<strong>Your Physical Work Environment Will Require…</strong>\n\n<ul>\n\n\t<li>This position will require the ability to move around the production floor</li>\n<li>Lift up to 15 pounds</li>\n<li>Sitting, standing, stooping, bending, other related tasks in an office setting</li>\n<li>Some travel as needed</li>\n</ul>\nChart is an equal opportunity employer"}