{"job title": "Sr. Manager, Engineering Operations", "company": "Comcast", "city state": "– Philadelphia, PA", "rating": "3.5", "job description": "Comcast brings together the best in media and technology. We drive innovation to create the world's best entertainment and online experiences. As a Fortune 50 leader, we set the pace in a variety of innovative and fascinating businesses and create career opportunities across a wide range of locations and disciplines. We are at the forefront of change and move at an amazing pace, thanks to our remarkable people, who bring cutting-edge products and services to life for millions of customers every day. If you share in our passion for teamwork, our vision to revolutionize industries and our goal to lead the future in media and technology, we want you to fast-forward your career at Comcast.\n<br><br>\nDUTIES: Manage and lead teams responsible for maintaining the development and engineering of Java-based applications that provide customer care and service support for Comcast Cable's X1 platform and RDK-based devices; lead software engineers in building and troubleshooting customer support applications for niche cable industry services and practices, such as Platform as a Service (PaaS) offerings, including ensuring the software solutions and architecture design is extensible and partner agnostic so that it can be used by other multiple system operators who partner with Comcast Cable for X1 and RDK syndication; oversee and lead Java development teams responsible for utilizing Spring Security, REST, JQuery, JQuery UI, Angular, and other open source technologies to develop, test, and maintain the operations of key customer support product offerings; ensure that Agile and DevOps methodologies (developing, testing, fixing, deploying, etc.) are carried out accurately during the design of cloud computing systems; architect, design, and develop support solutions for cable TV and high-speed data (HSD) services and hybrid fiber-cable (HFC) networks; provide clear guidance on software and architectural design principles and standards; collaborate with product owners and scrum masters to ensure alignment between business requirements technical specifications; select, guide, and manage software engineering personnel for the development team to report on current projects and future plans to stakeholders; act as a systems architect to collaborate with business partners for architectural designs and discussions; mentor, train, and provide direction to junior-level engineers/developers; and directly manage and supervise eleven (11) software developers.\n<br><br>\nREQUIREMENTS: Bachelor's degree (or foreign equivalent) in Computer Science, Engineering, or a related technical field; seven (7) years of experience performing software architecture, including utilizing Agile and DevOps methodologies to design cloud computing systems; of which four (4) years includes experience managing software development teams; and of which two (2) years includes experience architecting and designing extensible solutions in a partner-agnostic way for troubleshooting and support of a Platform as a Service (PaaS) offering; utilizing Spring Security, REST, JQuery, JQuery UI, and Angular; and architecting, designing, and developing support solutions for cable TV and high-speed data (HSD) services and hybrid fiber-cable (HFC) networks.\n<br><br>\nComcast is an EOE/Veterans/Disabled/LGBT employer"}