{"job title": "Operations Engineer II", "company": "Comcast", "city state": "– Philadelphia, PA", "rating": "3.5", "job description": "<p>Comcast brings together the best in media and technology. We drive innovation to create the world's best entertainment and online experiences. As a Fortune 50 leader, we set the pace in a variety of innovative and fascinating businesses and create career opportunities across a wide range of locations and disciplines. We are at the forefront of change and move at an amazing pace, thanks to our remarkable people, who bring cutting-edge products and services to life for millions of customers every day. If you share in our passion for teamwork, our vision to revolutionize industries and our goal to lead the future in media and technology, we want you to fast-forward your career at Comcast.</p><p></p><p><b>Job Summary:</b><br>Responsible for contributing in project teams, troubleshooting<br>operational issues, providing technical solutions to operational<br>problems, new product implementation, implementing existing products and<br>services, and the overall upkeep and maintenance of designated areas of<br>engineering. Acts in compliance with industry and Company technical<br>requirements, standards, policies, and procedures. Works with moderate<br>guidance in own area of knowledge.<br><br>Employees at all levels are expect to:<br><br>- Understand our Operating Principles; make them the guidelines for how<br>you do your job<br>- Own the customer experience-think and act in ways that put our<br>customers first, give them seamless digital options at every touchpoint,<br>and make them promoters of our products and services<br>- Know your stuff-be enthusiastic learners, users and advocates of our<br>game-changing technology, products and services, especially our digital<br>tools and experiences<br>- Win as a team-make big things happen by working together and being<br>open to new ideas<br>- Be an active part of the Net Promoter System-a way of working that<br>brings more employee and customer feedback into the company-by joining<br>huddles, making call backs and helping us elevate opportunities to do<br>better for our customers<br>- Drive results and growth<br>- Respect and promote inclusion and diversity<br>- Do what's right for each other, our customers, investors and our<br>communities</p><p><b>Core Responsibilities:</b><br>- Ability to troubleshoot and repair all but the most complex issues.<br>Performs maintenance activities with a minimum of supervision and<br>guidance. Leads technical outage bridges and engages appropriate<br>resources to drive issues to closure.<br>- Acts as an advocate for Engineering Operations procedures, policies,<br>and processes. Ensures projects and initiatives are adhering to Company<br>standards.<br>- Tracks and reports operational workflows; maintains records of results<br>and feedback. Analyzes data and metrics, identifies problem areas, and<br>provides actionable insight.<br>- Acts as a technical resource in projects and initiatives and ensures<br>successful project implementation.<br>- Contributes to design considerations for new products or architectural<br>changes to existing products.<br>- Analyses problems in design, configuration, data flow, and data state<br>within a highly complex multi-product provisioning system.<br>- Performs routine maintenance tests for designated areas of engineering<br>and ensures all maintenance is properly validated to minimize impact.<br>- Provides training and guidance to less experienced team members.<br>- Attains industry standard certifications and education.<br>- Consistent exercise of independent judgment and discretion in matters<br>of significance.<br>- Regular, consistent and punctual attendance. Must be able to work<br>nights and weekends, variable schedule(s) as necessary.<br>- Other duties and responsibilities as assigned.</p><p><b>Job Specification:</b><br>- Bachelors Degree or Equivalent<br>- Engineering, Computer Science<br>- Generally requires 2-5 years related experience</p><p></p><p>Comcast is an EOE/Veterans/Disabled/LGBT employer</p>"}