{"job title": "Engineer 4, Quality Assurance", "company": "Comcast", "city state": "– West Chester, PA", "rating": "3.5", "job description": "Comcast brings together the best in media and technology. We drive innovation to create the world’s best entertainment and online experiences. As a Fortune 50 leader, we set the pace in a variety of innovative and fascinating businesses and create career opportunities across a wide range of locations and disciplines. We are at the forefront of change and move at an amazing pace, thanks to our remarkable people, who bring cutting-edge products and services to life for millions of customers every day. If you share in our passion for teamwork, our vision to revolutionize industries and our goal to lead the future in media and technology, we want you to fast-forward your career at Comcast.\n<br><br>\n<strong>Job Summary:</strong>\n<br>\nResponsible for designing and executing test environments for Quality\n<br>\nAssurance Engineers. Tests products and software to ensure quality and\n<br>\na successful rollout. Assists in managing project teams, developing\n<br>\ntest strategies, and designing quality assurance practices. Leads\n<br>\nEngineering teams in investigation process which includes identifying,\n<br>\nreproducing, and documents defects, bugs, or problems. Maintains\n<br>\ntechnical quality assurance and control systems and activities.\n<br>\nUtilizes clearly defined standards, methods, and procedures for\n<br>\ninspecting, testing, and evaluating the precision, accuracy, and\n<br>\nreliability of company products. Assists product support areas in\n<br>\ngathering and analyzing data. Integrates knowledge of business and\n<br>\nfunctional priorities. Acts as a key contributor in a complex and\n<br>\ncrucial environment. May lead teams or projects and shares expertise.\n<br><br>\nEmployees at all levels are expect to:\n\n\n<ul>\n<li>Understand our Operating Principles; make them the guidelines for how</li>\n</ul>\n\nyou do your job\n\n\n<ul>\n<li>Own the customer experience-think and act in ways that put our</li>\n</ul>\n\ncustomers first, give them seamless digital options at every touchpoint,\n<br>\nand make them promoters of our products and services\n\n\n<ul>\n<li>Know your stuff-be enthusiastic learners, users and advocates of our</li>\n</ul>\n\ngame-changing technology, products and services, especially our digital\n<br>\ntools and experiences\n\n\n<ul>\n<li>Win as a team-make big things happen by working together and being</li>\n</ul>\n\nopen to new ideas\n\n\n<ul>\n<li>Be an active part of the Net Promoter System-a way of working that</li>\n</ul>\n\nbrings more employee and customer feedback into the company-by joining\n<br>\nhuddles, making call backs and helping us elevate opportunities to do\n<br>\nbetter for our customers\n\n\n<ul>\n<li>Drive results and growth</li>\n<li>Respect and promote inclusion and diversity</li>\n<li>Do what's right for each other, our customers, investors and our</li>\n</ul>\n\n<strong>communities\n<br><br>\n<strong>Core Responsibilities:</strong>\n\n\n<ul>\n<li>Collaborates with Product and Development teams to identify product</li>\n</ul>\n\nand technical requirements. Reviews and verifies requirements and\n<br>\ndesign specifications for validity in overall product design, with an\n<br>\nemphasis towards product testability and verification.\n\n\n<ul>\n<li>Contributes to the development of Quality Assurance test philosophies</li>\n</ul>\n\nand methodologies. Identifies viable test strategies in order to support\n<br>\ntesting product functionality.\n\n\n<ul>\n<li>Reviews literature, patents, and current practices relevant to the</li>\n</ul>\n\nsolution of assigned projects. Publishes detailed test strategies, test\n<br>\nplans and test cases.\n\n\n<ul>\n<li>Develops test cases and detail test scenarios for Quality Assurance</li>\n</ul>\n\nEngineers and oversees their execution, tracking, and automation.\n<br>\nEnsures proper execution of regression test procedures and automated\n<br>\ntest suites and scripts. Participates in design, code, and functional\n<br>\nproduct reviews to facilitate white-box test design.\n\n\n<ul>\n<li>Reviews project progress, evaluates results and recommends corrections</li>\n</ul>\n\nin technical applications and analysis.\n\n\n<ul>\n<li>Leads in the identification and resolution of problems and defects.</li>\n</ul>\n\nInitiates investigation processes, identifies and reproduces bugs or\n<br>\ndefects and drives issues and improvements to resolution.\n\n\n<ul>\n<li>Serves as a guide and mentor for junior-level Quality Assurance</li>\n</ul>\n\nEngineers. Provides technical leadership and consultation with regards\n<br>\nto practices, procedures and techniques.\n\n\n<ul>\n<li>Supports trials of new infrastructure designs/services.</li>\n<li>Works with vendors to troubleshoot problems when necessary.</li>\n<li>Consistent exercise of independent judgment and discretion in matters</li>\n</ul>\n\nof significance.\n\n\n<ul>\n<li>Regular, consistent and punctual attendance. Must be able to work</li>\n</ul>\n\nnights and weekends, variable schedule(s) as necessary.\n\n\n<ul>\n<li>Other duties and responsibilities as assigned.\n<br><br>\n<strong>Job Specification:</strong></li>\n<li>Bachelors Degree or Equivalent</li>\n<li>Engineering, Computer Science</li>\n</ul>\n\n<li></li><li>Generally requires 7-11 years related experience\n<br><br>\nComcast is an EOE/Veterans/Disabled/LGBT employer</li>\n\n</strong>"}