{"job title": "Principal Platform Architect Engineer", "company": "Comcast", "city state": "– West Chester, PA", "rating": "3.5", "job description": "Comcast's Technology &amp; Product organization works at the intersection of media and technology. Our innovative teams are continually developing and delivering products that transform the customer experience. From creating apps like TVGo to new features such as the Talking Guide on the X1 platform, we work every day to make a positive impact through innovation in the pursuit of building amazing products that are enjoyable, easy to use and accessible across all platforms. The team also develops and supports our evolving network architecture, including next-generation consumer systems and technologies, infrastructure and engineering, network integration and management tools, and technical standards.\n<br><br>\n<strong>Job Summary:</strong>\n<br><br>\nThe APA team exists to remove infrastructure heavy lifting from Comcast product and development teams. We build and operate modern, multi-cloud application platforms such as Cloud Foundry, Kubernetes, and Concourse CI/CD. We enrich these platforms by layering on easy-to-consume services such as load balancing, persistent storage, metrics and telemetry, messaging, CI/CD, and data services. We remove infrastructure bottlenecks, such as submitting request tickets, by automating everything. Our mission is to enable our product teams to forget about managing infrastructure so they can focus on writing code and bringing their products and services to market as fast as possible.\n<br><br>\nWe are seeking a Principal Platform Architect to help us deliver and enhance our next generation application platforms. Our team is driving innovation and our fingerprint is all over the industry. Come join us!\n<br><br>\n<strong>Core Responsibilities:</strong>\n<br><br>\n-Participate on a DevOps infrastructure team; develop and enhance Comcast's next-gen multi-cloud platforms- Pivotal Cloud Foundry, Open Source Cloud Foundry, Kubernetes, and Concourse CI/CD.\n<br><br>\n-Create automation, employ open source software, interact with API's, and enable CI/CD to create new cloud features, harvest/visualize metrics, monitor health/performance/capacity, etc.\n<br><br>\n-Partner with product and development teams to provide education and design consultation.\n<br><br>\n-Enthusiastic self-starter with an entrepreneurial mindset, proven history of execution and delivery, and well developed business acumen.\n<br><br>\n-Experience with Agile methodologies, effective working independently and in a virtual team setting.\n<br><br>\n-Excellent communication skills, both written and oral with the ability to adjust the messaging based on the audience.\n<br><br>\n<strong>Technical Scope:</strong>\n<br><br>\n<em>Successful candidates for this position should possess broad experience in many of the following areas:</em>\n<br><br>\n-Cloud building blocks Data center, compute, storage, network, tools &amp; automation.\n<br><br>\n-Extensive platform design experience in private and public cloud IaaS (vSphere, AWS), PaaS (Cloud Foundry), and container orchestration (Kubernetes/Docker).\n<br><br>\n-Expert level Linux experience, experience with DevOps tooling such as Puppet, Ansible, BOSH, Concourse.\n<br><br>\n-Broad experience in application middleware architecture and data services architecture.\n<br><br>\n-Software development using Java, Python, GoLang.\n<br><br>\n-Innovating with open source software to create production services.\n<br><br>\n-Experience in monitoring and telemetry- Telegraf, Grafana, Kapacitor, InfluxDB, Prometheus, and Nagios.\n<br><br>\n-Understanding of cloud-native, 12-factor application design principles and refactoring applications to be container friendly.\n<br><br>\n-Experience influencing application modernization and migration to cloud platforms.\n<br><br>\nComcast is an EOE/Veterans/Disabled/LGBT employer"}