{"job title": "Site Reliability Engineer", "company": "First Republic Bank", "city state": "– US-CA-San Francisco", "rating": "3.7", "job description": "Overview<br><br>First Republic is an ultra-high-touch bank that provides extraordinary client service. We believe that one-on-one interactions build lasting relationships. We move quickly to serve our clients’ needs so that their financial transactions are handled with ease and efficiency. Client trust and security are paramount in our line of business. Ultimately, our goal is unsurpassed client satisfaction which will lead to personal referrals – our number one source of new business. We recognize that our competitive advantage starts with our people and our culture. At First Republic, we work hard and move quickly as a very coordinated team. If you are looking for an opportunity to grow and contribute in a fun, fast-paced environment, First Republic is the place for you. We have exceptional people focused on providing extraordinary service.\n<br><br>\nLooking for a disciplined Enterprise Operations Center (Network Operations Center) engineer to help troubleshoot and own the site reliability for the growing organization. We are building a team and looking for someone who is proactive, collaborative, thinks clearly under pressure, takes a systematic approach to problems, and loves to automate tasks and processes. The ideal candidate has developed automation that recognizes patterns, allowing the team to anticipate, detect, and resolve system issues.\n<br><br>\nThe EOC (NOC) engineer is responsible for monitoring, maintenance and troubleshooting of enterprise-wide information systems and related infrastructure; ensuring that any issues that may adversely impact the confidentiality, integrity or availability of computing resources are addressed and promptly resolved.<br><br>Responsibilities\n\n\n<ul>\n\n <li>Responsible for proactive monitoring, maintenance, troubleshooting, repair and upgrades of servers, network infrastructure, base software services, power distribution systems and environmental systems for the distributed internal network as well as the monitoring of connectivity to vendors, partners and subsidiaries.</li> \n\n<li>Escalation point for technical issues that require advanced skills, knowledge and troubleshooting.</li>\n<li>Responsible identification and creation of automation to facilitate key activities such as timely triage of issues, rapid system recovery, and speedy validation of service restoration.</li>\n<li>Responsible for the development, configuration, monitoring, troubleshooting and maintenance of complex enterprise-wide file transfers.</li> \n\n<li>Interfaces with internal and external contacts to develop file transfer solutions and to troubleshoot / resolve issues.</li> \n\n<li>Acts as an escalation point for file transfer technical issues that require advanced skills, knowledge and troubleshooting.</li>\n<li>Responsible for the monitoring and management of automated tasks such as system backups and scheduled tasks.</li>\n<li>Participates in disaster recovery and business continuity tests by performing documented recovery procedures and troubleshooting issues that may be encountered.</li> \n\n<li>May also be called upon to act as a coordinator for the IS portion of the exercise.</li>\n<li>Performs other duties &amp; responsibilities as required or assigned by supervisor.</li>\n<li>Responsibilities include the following: 1) adhering to and complying with all applicable, federal and state laws, regulations and guidance, including those related to Anti-Money Laundering (i.e. Bank Secrecy Act, USA PATRIOT Act, etc.), 2) adhering to Bank policies and procedures, 3) completing required training, 4) identifying and reporting potential suspicious activity to the BSA/AML Officer, and 5) knowing and verifying the identity of any customer(s) that enters into a relationship with the Bank.</li>\n</ul>\n\nQualifications\n\n\n<ul>\n\n <li>Requires a one to three years operations experience, including demonstrated knowledge using and/or supporting enterprise applications.</li>\n<li>Requires expert knowledge of Microsoft Windows Server software, Windows Terminal Services, Citrix Presentation Server, Microsoft Exchange/Outlook, Microsoft Active Directory, SharePoint, IIS and/or other industry standard server platform services.</li>\n<li>Experience with Linux in an enterprise environment.</li>\n<li>Requires advanced understanding of LAN topology, routers, hubs, switches, firewalls and network protocols and services, including WAN/Frame Relay/MPLS, TCP/IP, DNS, WINS, DHCP, SMTP, SNMP, etc.</li>\n<li>Python and Bash scripting.</li>\n<li>Requires proficiency with various types of computer hardware and software.</li>\n<li>Requires demonstrated understanding of core Bank business applications and operations.</li>\n<li>Self-directed: works independently and is able to fulfill job requirements with minimal supervision.</li>\n<li>Requires strong interpersonal and organizational skills, including the ability to meet deadlines, work in a team environment, follow written policies and procedures, and maintain superior customer service at all times.</li>\n<li>Assists Operations Control management increase departmental effectiveness by identifying opportunities for improvement and suggesting superior alternatives.</li>\n<li>Trains other staff in new technologies, methods or process, when required.</li>\n<li>Experience with Solarwinds monitoring and alerting features.</li>\n<li>Ability to create metrics as requested based on data pulled from Service now.</li>\n<li>Experience running queries and locating raw data from Service Now for metrics and reports.</li>\n<li>Understanding and execution of System Recovery Manager (SRM) and other related tools within VMWare infrastructure.</li>\n<li>Applies deductive reasoning in decision making.</li>\n<li>Must possess excellent communication skills and the ability to independently solve complex technical issues.</li>\n<li>Team player.</li>\n<li>Provides extraordinary service.</li>\n<li>Furthers the First Republic Bank culture and values.</li>\n</ul>\n<strong>Mental/Physical Requirements:</strong>\n\n<ul>\n\n <li>The ability to learn and comprehend basic instructions; understand the meanings of words and respond effectively; and perform basic arithmetic accurately and quickly.</li>\n<li>Vision must be sufficient to read data reports, manuals and computer screens.</li>\n<li>Hearing must be sufficient to understand a conversation at a normal volume, including telephone calls and in person.</li> \n\n<li>Speech must be coherent to clearly convey or exchange information, including the giving and receiving of assignments and/or directions.</li>\n<li>Position involves sitting most of the time, but may involve walking or standing for brief periods of time.</li>\n<li>Must be able to travel in a limited capacity.</li>\n</ul>"}