{"job title": "Data Pipeline Engineer", "company": "Hunter Technical Resources", "city state": "– Atlanta, GA", "rating": "4.8", "job description": "<strong><u>Data Engineer</u></strong>\n<br><br>\n<strong>Position Summary</strong>\n<br><br>\nResponsible for design, analysis, evaluation, testing, debugging and implementation of data, metrics, and analytics pipeline.\n<br><br>\n<strong>Duties</strong> \n\n\n<ul>\n\n\t<li>Build positive and effective working relationship with the Product Team, Project Management and Development teams. The end result being to deliver solutions that meet the expectations of our Customers.</li>\n<li>Experience with Business Intelligence / Data Warehouse components including source data analysis, ETL, ODS, Data Lakes, Data Marts, Reporting, Dashboards, and Analytics.</li>\n<li>Exceptional problem-solving ability and a positive attitude.</li>\n</ul>\n\n<strong>Other Responsibilities</strong>\n\n\n<ul>\n\n\t<li>Architect and design analytic solutions that deliver business value.</li>\n<li>Implement software solutions according to design and business requirements on complex development efforts.</li>\n<li>Perform data profiling and analysis.</li>\n<li>Assist in creating documentation and training materials to familiarize other team members with the given system and help educate non-technical staff.</li>\n<li>Refine and automate regular processes, track issues, and manage change though the production environment.</li>\n<li>Experience with performance tuning and troubleshooting.</li>\n<li>Excellent oral and written communications skills.</li>\n<li>Intellectual Curiosity: Exploring new territories and finding creative and unusual ways to solve problems.</li>\n</ul>\n\n<strong>Education, Experience, Certification Requirements</strong>\n\n\n<ul>\n\n\t<li>Bachelor’ s degree in Computer Science or Data Science or equivalent work experience</li>\n<li>3-5 years of relevant experience</li>\n</ul>\n\n<strong> Core Skills and Abilities</strong>\n\n\n<ul>\n\n\t<li>Implementation experience deploying and supporting AWS solutions.</li>\n<li>Development experience with: Python (PySpark), SQL (standard ANSI, as well as Presto nuances preferred)</li>\n<li>End-to-end experience with file based and relational data management solutions - including experience with data modeling and data reporting in both data management paradigms.</li>\n</ul>\n\n<strong>Desirable Skills and Abilities</strong>\n\n\n<ul>\n\n\t<li>Experience optimizing code for performance.</li>\n<li>Experience with Segment.com Analytics.</li>\n<li>Experience in the media/broadcast/video industry.</li>\n<li>Able to work independently or in a team environment. Develop strong working relationships with internal customers and peer IT team members.</li>\n<li>Ability to learn new software and hardware systems quickly.</li>\n</ul>"}