{"job title": "RF Engineer Sr", "company": "Lockheed Martin", "city state": "– Littleton, Colorado", "rating": "3.6", "job description": "<strong>Description:</strong> Performs technical planning, RF payload performance, and verification and validation at the subsystem and system level. Executes analysis of payload test data, payload calibration and creation of verification reports. Key to this position is establishing and maintaining an excellent working relationship with team members and other functional organizations. Candidate must possess strong teamwork, problem solving, and customer interaction skills.\n<br>\n<strong>Desired Skills:</strong> Experience in RF hardware design, RF system performance analysis, requirement allocation, functional decomposition, and requirement verification planning. Excellent communications skills. Experience with MSP mission. Active TS/SCI Clearance.\n<br>\n<strong>BASIC QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>Experience with RF performance analysis.</li>\n<li>Experience with MATLAB.</li>\n<li>Strong communications capabilities with peers and management, with proven oral and written presentation and interpersonal relations skills.</li>\n<li>Must possess the ability work with minimal direction; be self-motivated.</li>\n<li>Ability to obtain a TS/SCI Clearance.</li>\n</ul>\n\n<strong>Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.</strong>\n<br>\nAs a leading technology innovation company, Lockheed Martins vast team works with partners around the world to bring proven performance to our customers toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.\n<br><br>\nJoin us at Lockheed Martin, where were engineering a better tomorrow."}