{"job title": "Cyber Systems Engineer 4", "company": "Northrop Grumman", "city state": "– Annapolis Junction, MD", "rating": "3.7", "job description": "Northrop Grumman Mission Systems is seeking Cyber System Engineer to join our team of qualified, diverse individuals located at Annapolis Junction, MD.\n<br><br>\nHow do cyber terrorists get past the industries' best? They don't. There are too many of us fighting virtual threats, protecting enterprises and entire countries from large-scale attacks. From creating a citywide wireless network for our first responders, to protecting our nation from cyber threats, to building software-defined radios that change how our military communicates, our Cyber and Intelligence Mission Solutions Division (CIMS) helps life run smoothly and safely.\n<br><br>\n<strong>Description of Position:</strong>\n<br><br>\nWork as a System Engineer in the design and development of Next Generation SIGINT architecture. This position is focused on the end-to-end engineering of interfaces, both internal and external, and architectural level system engineering activities. Work will also include definition and management of system requirements, CONOPs and verification and validation activities. The preferred candidate should be able to work and function in a dynamic environment where requirements can change according to the customer needs. Candidate should be skilled in Agile Process Framework and be able to contribute to daily Scrums.\n<br><br>\nOur professionals live and breathe different perspectives here; we are curious about the world, accepting of each other, and well aware that the more ideas, backgrounds, opinions, and experiences we bring to our work, the stronger that work will be. Just as you would invest your time and hard work into our company, we focus on investing back into you through enriching professional experiences and high-quality learning and development opportunities. We want you to bring your whole self to work and for you to have meaningful connections with your coworkers, customers, and communities, while providing the best products, systems, and technologies to protect our world.\n<br><br>\nIf you are the sort of professional who loves a challenge and likes to be involved in serious organizational and software change -- Then what is happening in the CIMS Division is the place for you. This is without a doubt one of the most interesting and exciting times to join an organization like ours. The culture is one of excellence; team work, learning, delivered value and people. We are looking for people who love to learn and take initiative to really make this happen.\n<br><br>\n<strong>Basic Qualifications:</strong>\n<br><br>\n<strong>*Security Clearance: An active TS/SCI clearance with Polygraph is required.</strong>\n\n<ul>\n<li>Bachelor's Degree in Systems Engineering, Computer Engineering, Computer Science, Information Systems, Engineering Science, Engineering Management, or related discipline from an accredited college or university is required. Four (04) years of system engineering experience may be substituted for a Bachelor's Degree.</li> \n\n<li>Shall have nine (09) years of experience as a System Engineer supporting software intensive system and software development including areas such as requirements analysis, requirements management, system architecture, system design, process execution and evaluation, selections and evaluation of COTS/GOTS tools, systems development, integration, verification and sustainment.</li>\n</ul>\n*Shall have experience using Scrum/Agile development methodology.\n\n<ul>\n<li>Shall have experience with development of system documentation such as CONOP, requirements, design, diagrams verification activities, SOP, etc.</li>\n<li>Shall have strong verbal and written communications skills.</li>\n</ul>\n<strong>Preferred Qualifications:</strong>\n\n<ul>\n<li>Experience developing scenarios (threads) and an Operational Concept that describes the interactions between the system, the user, and the environment, that satisfies operational, support, maintenance, and disposal needs. She or he will be able to review and/or approve system engineering documentation to ensure that processes and specifications meet system needs and are accurate, comprehensive, and complete</li> \n\n<li>Proficiency with Linux (must be evidenced in previous work experience)</li> \n\n<li>Ability to assess possible architectural limitations or shortcomings in such areas as scaling, speed, and throughput</li> \n\n<li>Experience leading a product development team including defining the product roadmap and working with stakeholders to define requirements</li>\n<li>Experience with requirements definition development and traceability through implementation</li> \n\n<li>Experience with analysis of architectural data flows and interface definition</li> \n\n<li>An understanding of networking protocols such as, TCP/IP, IPv4/6, ICMP, SMTP, etc.</li>\n<li>Familiarity with XML/XSD, messaging and schemas</li> \n\n<li>Understanding of system modeling and SysML</li>\n<li>Experience developing software as a software engineer or design/architect of object oriented software solutions</li>\n<li>Experience building solutions within a virtualized and/or cloud based environment</li>\n<li>Certifications such as CEH, CISSP or INCOSE</li>\n</ul>\n<strong>NGCIMSMD</strong>\n<br><br>\n<strong>ISCYBERDIV</strong>\n<br><br>\n<strong>MSCYBERDIV</strong>\n<br><br>\nNorthrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit www.northropgrumman.com/EEO. U.S. Citizenship is required for most positions."}