{"job title": "Software Engineer, Senior", "company": "realtor.com", "city state": "– Morgantown, WV", "rating": "3.7", "job description": "A leader in online real estate, Move Inc. provides the best real estate tools in the market that ultimately empower people to love where they live. We're committed to providing real estate professionals with the content, tools, and data intelligence they need in order to provide unparalleled service to clients making big investment decisions.\n<br><br>\n<strong>The Role</strong>\n<br><br>\nWe have an exciting opportunity for a skilled and energetic <strong>Senior Software Engineer</strong> to join our team in the Morgantown, WV office. You'll become a member of a small, cohesive, and experienced team with the ability to make an impact on the larger organization. You'll be building out our core \"Next Generation\" real estate information platform. You will \"wear many hats\" with responsibilities that touch on all stages of the software engineering lifecycle: understanding requirements, system design, writing/testing/deploying code, and monitoring systems to ensure proper operation. If you have proven technical abilities and demonstrated leadership and teamwork skills, and you enjoy finding creative solutions to complex problems, then this might be the position for you.<br><br><strong>Duties and Responsibilities:</strong>\n\n\n<ul>\n<li>Develop solutions that are high quality, scalable, robust, and reusable</li>\n<li>Work collaboratively in an Agile/Scrum team to plan sprints, expand stories into tasks, work on removing impediments, and execute at top velocity while focusing on rapid and incremental delivery of high quality code</li>\n<li>Maintain and build core competency of technological knowledge, staying in touch with emerging technologies, and share this knowledge with colleagues</li>\n<li>Understand business and customer goals to introduce innovations, provide technical input into product roadmaps, and negotiate compromises between business and technical constraints</li>\n<li>Lead and contribute to guidelines and coding standards used for building reusable application components that are easy to maintain and troubleshoot</li>\n<li>Lead technical design and code reviews</li>\n<li>Identify and assist in mitigating risks</li>\n</ul>\n\n<strong>Education, Skills and Qualifications:\n<br><br>\n</strong>\n\n\n<ul>\n<li>Bachelor's degree in Computer Science/Engineering or related field</li>\n<li>At least 5 years of hands on and progressive professional software development experience architecting, building, deploying, and maintaining systems at scale</li>\n<li>Successful track record of delivering on projects, both individually and as a team member</li>\n<li>Proficient in multiple programming languages, Go is big plus</li>\n<li>Expertise using cloud technologies like Amazon Web Services strongly preferred</li>\n<li>Experience utilizing Docker, Kubernetes or other containerization technologies in a production environment is a plus</li>\n<li>Ability to work efficiently with large data sets</li>\n<li>Experience designing and building RESTful APIs as well as multithreaded, scalable and distributed systems</li>\n<li>Experience with GNU/Linux as primary development target (CoreOS, Ubuntu, CentOS, etc.)</li>\n<li>Experience with build and deployment automation technologies</li>\n<li>Experience with unit test frameworks and test automation tools</li>\n<li>Solid experience with relational databases</li>\n<li>Experience with NoSQL data stores</li>\n<li>Expertise with using source revision-control systems, especially git, in a team setting</li>\n<li>Understanding of networking protocols and concepts</li>\n</ul>\n\n<strong>Personal characteristics include:\n<br><br>\n</strong>\n\n\n<ul>\n<li>You are passionate about creating world-class solutions and experiences for our customers and will work hard to achieve this</li>\n<li>You are able to work as part of self-directed and self-managed teams; demonstrating unrelenting focus on understanding, anticipating, and satisfying stated and unstated needs</li> \n\n<li>You hold a point of view and aren't afraid of voicing it, but are humble enough to recognize and adopt the views of others; get your opinion heard, but then execute forcefully once the decision is made</li>\n<li>You have excellent troubleshooting, problem-solving, time management, and organizational skills</li>\n<li>You have low-tolerance for avoiding best practices; without urging or oversight, be self-motivated, have strong work ethic, and be dedicated to quality, quantity, and timeliness of results</li>\n<li>Reliable in tracking, reporting on, and completing tasks; seek solutions, not blame</li>\n<li>Ask questions until you have a sufficient level of understanding and then use intuition and diligence to fill in any gaps; push back when things don't appear to be set up to succeed</li>\n<li>Be optimistic, mixed with healthy doses of pessimism and help make sure we have fun!</li>\n</ul>\n#LI-KK1"}