{"job title": "Data Engineer", "company": "Roadtrippers", "city state": "– Cincinnati, OH", "rating": "4.6", "job description": "<strong>Role Responsibilities</strong>\n<br><br>\nRoadtrippers has made the travel planning process simple and fun through both a great user and experience and an enormous amount of place data. We not only know about the big theme parks and attractions, but the best snake museums and places to get goat milk fudge. Roadtrippers is looking for a data engineer to help us improve the comprehensiveness and quality of our place data. We are looking for an engineer who can get to the heart of data quality problems and think of creative solutions to address them, by working with our data scientists, other data engineers and product managers.\n<br><br>\nJoin us to empower the world's travelers and travel companies!\n<br><br>\n<strong>Qualifications</strong>\n\n<ul>\n<li>A love of travel, especially road trips! Knowledge of RV'ing is a plus</li>\n<li>A strong knowledge of SQL with the ability to create cogent analyses using joins, CTEs, subqueries, window functions, etc.</li>\n<li>A working knowledge of Python, Ruby and/or some other related high level language</li>\n<li>Bonus points for using Spark, Airflow, Docker, AWS, SageMaker, Jupyter Notebook, GIS data/frameworks, machine learning</li>\n</ul>\n<strong>About Roadtrippers</strong>\n<br><br>\nRoadtrippers is a rapidly growing team, recently acquired by TH2, a Thor/THL joint venture. On the Roadtrippers platform, travelers can seamlessly discover, plan, and book their next trip all in one place. Using its database of millions of diners, national parks, museums, hotels and more, Roadtrippers is the ultimate road trip companion, generating unprecedented insight into audience and regional travel intent, patterns, and behaviors.\n<br><br>\nRoadtrippers headquarters is located in the historic Over-the-Rhine district in Cincinnati, Ohio. Remote opportunities are available for highly qualified applicants.\n<br><br>\n<strong>Team Benefits</strong>\n<br><br>\n<u>Lunches and snacks</u>\n<br>\nDrinks, kegs, and snacks available in the office. Team lunches on Tuesdays.\n<br><br>\n<u>Unlimited vacation</u>\n<br>\nThis is a partnership of people that want to build something great. We trust you to pull your own weight and manage your own time.\n<br><br>\n<u>Team led task management</u>\n<br>\nEveryone on the team gets to decide what we work on to achieve our goals. We work in small, self-organized teams who determine the best tactics to support the vision and strategy set by leadership.\n<br><br>\n<u>Path to the top</u>\n<br>\nWe operate on merit. If you consistently work hard and improve your own knowledge set, there is no position that isn't open to you.\n<br><br>\n<u>Great healthcare</u>\n<br>\nWe pride ourselves on offering a multitude of healthcare options for you and your family, including healthcare (PPO &amp; HDHP), dental, vision and more. We absorb the majority of the costs which means a much higher take-home pay for you.\n<br><br>\n<u>Highly competitive salary</u>\n<br>\nWe are in the same range as everyone else in town, plus all the benefits.\n<br><br>\n<u>The tools for your job</u>\n<br>\nA computer and all of the software you need to be successful in your role.\n<br><br>\n<strong>Note: We do not work with external recruiters or placing agencies, so please don't contact us.</strong>"}