{"job title": "Data Engineer", "company": "SAPSOL Technologies Inc.", "city state": "– Renton, WA", "rating": "3.4", "job description": "Job Description<div>Role : Data Engineer\n<br><br>\nLocation : Renton WA\n<br><br>\nDuration : 6 Months\n<br><br>\nJD:\n<br><br>\nJob Functions / Responsibilities Provide data engineering on modern, cloud-based and legacy data processing technology stacks. Build data pipelines, data validation frameworks, job schedules with emphasis on automation and scale. Contribute to overall architecture, framework, and design patterns to store and process high data volumes. Ensure product and technical features are delivered to spec and on-time. Design and implement features in collaboration with product owners, reporting analysts / data analysts, and business partners within an Agile / Scrum methodology. Proactively support product health by building solutions that are automated, scalable, and sustainable – be relentlessly focused on minimizing defects and technical debt.\n<br><br>\nQualifications and Skills 5+ years of experience in large-scale software development with emphasis on data analytics and high-volume data processing. 3+ years of experience in data engineering development. 2+ years of experience implementing scalable data architectures. 2+ years of experience with AWS and related services (e.g., EC2, S3, DynamoDB, ElasticSearch, SQS, SNS, Lambda, Airflow, Snowflake). Experience in data-centric programming languages (e.g., Python, GO, Ruby, Javascript, Scala). Proficiency with ETL tools and techniques. Knowledge of and experience with RDBMS platforms, such as MS SQL Server, Oracle, DB2, IMS, MySQL, Postgres, SAP HANA, and Teradata. Experience with participating in projects in a highly collaborative, multi-discipline team environment.\n<br><br>\nWork settings: Requires frequent sitting and walking. Availability to work “on-call” 24 hours/day for emergencies. Position could be required to minimal traveling up to 20%. Education Masters' or Bachelors' degree in Computer Science or a related field.</div>Company Description<div>SAPSOL Technologies Inc. (SAPSOL) is a consulting firm dedicated to providing enterprise solutions-based business transformation to businesses and public sector organizations of all sizes. SAPSOL provides a comprehensive offering of ERP, Cloud, Big Data, Mobility and IoT solutions and services, a proven methodology for accelerated delivery, deep industry expertise, and flexible onsite/offshore, on-premise or on-demand delivery models that accommodate the reality of business today.</div>"}