{"job title": "Sr. Software Engineer (BI)", "company": "Sony PlayStation", "city state": "– Aliso Viejo, CA", "rating": "3.5", "job description": "PlayStation isn't just the Best Place to Play it's also the Best Place to Work. We've thrilled gamers since 1994, when we launched the original PlayStation. Today, we're recognized as a global leader in interactive and digital entertainment. The PlayStation brand falls under Sony Interactive Entertainment, a wholly-owned subsidiary of Sony Corporation.\n<br><br>\n<strong>Sr. Software Engineer (BI)</strong>\n<br><br>\n<strong><em>Sony Interactive Entertainment</em> </strong>\n<br><br>\n<strong><em>Cloud Gaming Engineering &amp; Infrastructure</em> </strong>\n<br><br>\n<strong>Aliso Viejo, CA</strong>\n<br><br>\n<strong>Who are you?</strong>\n\n<ul>\n<li>You strive to automate tedious work rather than pushing buttons daily to keep things running</li>\n<li>Talent matters but so does curiosity, inventiveness and passion for your craft.</li>\n<li>You have an expertise in data engineering but don't mind crossing the streams with other colleagues on the team.</li>\n<li>You have strong and well-formed ideas that are weakly held; you can discuss, listen and participate in a passionate debate that may make you reconsider.</li>\n<li>You create code that is understandable, simple, clean, and want to frame it and hang it next to your desk with pride.</li>\n<li>Given context, you're capable of self-direction.</li>\n<li>You are comfortable with ambiguity and shifting contexts.</li>\n<li>You enjoy exploring new technologies and taking them for a spin.</li>\n</ul>\n<strong>What do you know?</strong>\n\n<ul>\n<li>Great application development skills. Our stuff written in Python but any of these will do: Python, Java, C, C++</li>\n<li>Batch-driven ETL over distributed data (e.g. Hadoop, Spark, and MPP databases)</li>\n<li>Know how to work with analytics &amp; data science people</li>\n<li>Team-based software development tools and best practices</li>\n<li>Experience with HP Vertica is a plus but experience with other MPP DBs will suffice</li>\n<li>Knowledge of data warehouse techniques that will make our systems awesome</li>\n<li>Knowledge of NoSql DBs, Spark, Drill, Hadoop, Parquet and other large data tech is a plus</li>\n</ul>\n<strong>What will you do?</strong>\n\n<ul>\n<li>Support the Machine Learning &amp; Data Science teams to productionalize experiments and systems</li>\n<li>Build, update and maintain ETL pipelines that contains a massive, rich, and connected set of data that supports PlayStation Now programming decisions</li>\n<li>Build software and social glue between engineers, scientists, product managers, and other analytics teams</li>\n<li>Make our data load faster</li>\n<li>Keep our data stores up and running</li>\n<li>Build data expertise and own data quality for the awesome pipelines you build</li>\n</ul>\n<strong>One more thing...</strong>\n\n<ul>\n<li>BS or equivalent in Computer Science. MS degree would be good.</li>\n<li>Minimum of 5 years of work experience</li>\n<li>Willing to move a few miles from a So Cal beach (recommended).</li>\n</ul>\nSony is an Equal Opportunity Employer. All persons will receive consideration for employment without regard to race, color, religion, gender, pregnancy, national origin, ancestry, citizenship, age, legally protected physical or mental disability, covered veteran status, status in the U.S. uniformed services, sexual orientation, gender identity, marital status, genetic information or membership in any other legally protected category.\n<br><br>\nWe strive to create an inclusive environment, empower employees and embrace diversity. We encourage everyone to respond.\n<br><br>\nWe sincerely appreciate the time and effort you spent in contacting us and we thank you for your interest in PlayStation.\n<br><br>\n#LI - RD1"}