{"job title": "Lead Software Engineer", "company": "Tarana Wireless", "city state": "– Santa Clara, CA", "rating": "4.4", "job description": "<strong>You will work on the design, development, integration, and testing of software modules on multi-core processing platforms in fixed broadband access systems. The primary focus of this position comprises of the control plane and connection management functions for layers 2 &amp; 3 on both ends of the access link. Specifically, this position is targeted at developing parts of the MAC layer of a broadband wireless access system including radio resource control, scheduling, QoS, and network entry, but depending on need and skills can also target parts of the networking stack.</strong>\n<br><br>\n<strong>Responsibilities will also include:</strong>\n<br><br>\nInterface design, protocol state machine design, and test framework design\n<br><br>\nImplementation of modules on a C++ /Linux system\n<br><br>\nDesign reviews and code reviews\n<br><br>\nSystem integration and debugging in complex hardware platforms\n<br><br>\nPerformance optimization of wireless communication systems\n<br><br>\n<strong>Key requirements:</strong>\n<br><br>\nMSCS/EE or BS with equivalent technical experience\n<br><br>\nIndustry experience with design and development (5 years at a minimum)\n<br><br>\nExperience with one or more of: L2/L3 protocols, wireless networks, OFDM, and MIMO\n<br><br>\nExperience with socket, network, and systems programming\n<br><br>\n<strong>Highly desired:</strong>\n<br><br>\nExperience with RTOS, multi-core software development, and embedded systems.\n<br><br>\nExperience with version control systems (Git/Gerrit) and collaboration processes (Agile/Scrum)\n<br><br>\nC++ 11/14/17 development experience\n<br><br>\nAdvanced knowledge of networking protocols (TCP/IP) and Internet architecture\n<br><br>\nWe are hiring only highly experienced software engineers, <em>this is not an entry-level position</em>. We have multiple openings for different levels of experience. The title and responsibilities will be matched to the skills and experience you bring to the table."}