{"job title": "Senior Software Engineer (DSP Group)", "company": "Tarana Wireless", "city state": "– Santa Clara, CA", "rating": "4.4", "job description": "You will be working on design, development and integration of software modules on multi-core processing platforms for various aspects of wireless communication systems.\n<br><br>\nYou need to have ability to lead features to their completion, to understand critical issues and come up with optimal solutions to resolve them. You should be willing to learn continuously and collaborate with other team members.\n<br><br>\n<strong>Job responsibilities:</strong>\n<br><br>\nDevelop scalable multi-threaded software for multi-core DSP/GPP in C/C++\n<br><br>\nDefine software architecture for State Machine and lower MAC for different features of a wireless communication system.\n<br><br>\nImplement and unit test software modules required for State Machine and Lower MAC\n<br><br>\nPerforming system integration, debug and bring-up of a wireless communication system.\n<br><br>\n<strong>Key requirements:</strong>\n<br><br>\nMS or PhD in Computer Science with software development experience\n<br><br>\nAt least 2+ years demonstrated experience in software design and development experience on a real-time system using multi-core ARM/DSP architecture employing Linux or other RTOS.\n<br><br>\nDemonstrated experience in software architecture for embedded systems\n<br><br>\nHave experience in scripting languages (python, bash, javascript etc)\n<br><br>\nExperience with lab integration and using signal generators, oscilloscopes, logic analyzers, spectrum/vector signal analyzers etc.\n<br><br>\nExperience with version control systems, collaboration tools (wikis, ticket systems)\n<br><br>\nExpertise in messaging protocols (protobuf, JSON) is a plus\n<br><br>\nFormal understanding in communication and signal processing theory and techniques, with strong mathematical background in linear algebra is a plus but not necessary\n<br><br>\nSoftware development experience with Multicore DSP + ARM Keystone (TI) SoC is a big plus"}