{"job title": "Software Engineer, Product Security", "company": "Toast", "city state": "– Boston, MA", "rating": "3.9", "job description": "<strong>Why be a Toaster?</strong>\n<br><br>\nToast is a rapidly growing startup building the first all-in-one restaurant management software platform. Toast's Android tablet based system helps restaurants operate more efficiently and connect with their customer base in new and innovative ways. For example, our portable tablets allow waitstaff to enter orders directly to the kitchen, reducing guest wait time and allowing the restaurant to turn over tables faster. This is good for the guest experience and good for the restaurant! We're growing fast and serve cafes, restaurants, bars and nightclubs in all 50 states. We move fast and thus have lots of opportunities for career growth. If you're a passionate security engineer looking to grow personally and make an impact, join us!\n<br><br>\nToast is looking for a self-motivated individual with a keen eye for application security that loves building extraordinary software. The Product Security team at Toast is focused on ensuring that Toast is the safest and most secure platform for restaurants to entrust with their critical data and business operations. If you're a software engineer with a real passion for security, who always keeps up with the latest security trends and technologies, and has an eye for secure, reliable, high-quality code, you might be a great fit for our dedicated security engineering team.\n<br><br>\nAs a software engineer on the Product Security team, you will be:\n\n<ul>\n<li>Building state of the art features across the Toast product, including frontend, backend, and database technologies, to improve the overall security of the platform</li>\n<li>Collaborate across the engineering org on all matters of security</li>\n<li>Working to discover and fix any security issues in the Toast platform</li>\n<li>Providing security domain expertise to others in the organization</li>\n<li>Supporting other Toast engineers with security code reviews and security testing</li>\n</ul>\nIf you're someone that is:\n\n<ul>\n<li>Passionate about writing quality code across a wide range of technologies, such as Java, Android, and web</li>\n<li>Always interested in learning more about application security</li>\n<li>Passionate about building phenomenal software</li>\n<li>Collaborative</li>\n</ul>\nBonus Points (but not necessary):\n\n<ul>\n<li>Familiarity with AWS and cloud computing infrastructure</li>\n<li>Familiarity with distributed systems</li>\n<li>Skilled in Android, Java, Kotlin, HTML/CSS/JS, and/or database development</li>\n<li>Experience with application vulnerability discovery and/or mitigation</li>\n<li>Experience with financial technology</li>\n</ul>\nOur Tech Stack\n<br><br>\nToast's products run on a stack that ranges from guest and restaurant-facing Android tablets to backend services in Java to internal, guest-facing and restaurant-facing web apps. Our backend services follow a microservice architecture written using Java 8 and DropWizard; we use AWS extensively, ranging from S3 to RDS to Lambda. We have our own platform for dealing with user management, service elevations and robust load balancing. Toast stores data in a set of sharded Postgres databases and utilizes Apache Spark for large scale data workloads including query and batch processing. The front-end is built primarily using Angular and ES6. The main Toast POS application is an Android application written in Java and Kotlin. For data between tablets and our cloud platform we operate RabbitMQ clusters as well as direct tablet communication to the back end."}