{"job title": "Senior Network Engineer", "company": "Total System Services, Inc.", "city state": "– Lehi, Utah", "rating": "3.1", "job description": "Every day, the people of TSYS® and Netspend® improve lives and businesses around the globe through payments. We make it possible for millions of people to move money between buyers and sellers using our payments solutions including credit, debit, prepaid and merchant services. We are \\\"People-Centered Payments\\\", and our team has the unique opportunity to help create a world in which payments make people's lives easier and better. This is both a tremendous honor and an important responsibility for those who accept the challenge. If you are looking to make a valuable difference for people everywhere — and for yourself — we may have the right place for you.<br><br>Summary of This Role<br><br>Install, configure, maintain, support, and secure the organization's network communications, including LANs and/or WANs. Identifies network problems, isolates root causes, and initiates corrective action. Determines priority of action and additional resources required, based on severity of service interruption. Provides technical analysis to all customers to isolate issues and develop strategies to restore or activate services. Interacts with Telecommunication Engineers, LAN Administrators, and transmission and RF staff regarding ongoing network activities. Ascertains compliance with security, safety, and environmental guidelines. Generates reports on network performance, trouble-shooting results, and routine maintenance of network elements. This role requires individuals to work within the demands a global 24x7 High availability transaction oriented network. Ability to translate business requirements into network requirements and collaboratively work with other technical teams to deliver an overall solution.<br><br>What Part Will You Play?\n\n<ul>\n<li>Acts as a Technical SME to drive collaboration in a team environment</li><li>Serves as a Technical SME on unusually complex projects , demonstrating expert level problem solving skills with the Network</li><li>As the Technical SME, recognizes and resolves unusually complex problems and issues according to corporate policies</li><li>Manages unusually complex project tasks independently with internal and external clients</li><li>Provides mentorship to entry/lower level team members</li><li>At an expert/Technical SME level, independently designs, configures, tests, documents, and implements unusually complex network designs and components</li><li>Develops ad-hoc, unusually complex reports on network performance, trouble-shooting results, and maintenance of network elements</li><li>Acts as a Technical SME to independently utilize tools within the network to analyze client networks</li>\n</ul>\n\nWhat Are We Looking For in This Role?<br><br><strong>Minimum Qualifications</strong>\n<ul>\n<li>Bachelor's Degree</li><li>Relevant Experience or Degree in: No degree specified</li><li>Typically Minimum 8+ Years Relevant Exp</li><li>8 + years of enterprise networking experience and/or a Bachelor's Degree</li>\n</ul>\n<strong>Preferred Qualifications</strong>\n<ul>\n<li>Appropriate advanced industry network certifications are preferred.</li>\n</ul>\n\nWhat Are Our Desired Skills and Capabilities?\n\n<ul>\n<li>Skills / Knowledge - As a highly skilled specialist, contributes to the development of concepts and techniques. Completes complex tasks in creative and effective ways. Ensures tasks of team are competed in a timely manner.</li><li>Job Complexity - Consistently works on complex assignments requiring some independent action and a high degree of initiative to resolve issues. Makes recommendations for new procedures. Oversees a team and coordinates daily work covering multiple assignments.</li><li>Supervision - Determine methods and procedures on new assignments with some independence. Often acts as a facilitator for group. Is formal team leader.</li><li>Dynamic Routing - Configure industry standard dynamic routing protocols including but not limited to BGP and OSPF.</li><li>WAN Optimization and QoS - WAN optimization and QoS on global MPLS network carrying voice and data.</li><li>Load Balancing - Global DNS load balancing and local application load balancing.</li>\n</ul>\n\n<strong>Not Ready to Apply? Join Our Talent Community!!</strong><br><br><strong>US Applicants:</strong>\n<br>\nTSYS is an equal opportunity employer (EOE) committed to employing a diverse workforce and sustaining an inclusive culture. For more information about your rights, click here.\n<br><br>\nQualified individuals with disabilities may be entitled to reasonable accommodations to assist in their pursuit of employment with TSYS. This includes assistance in completing the job application (online or otherwise) and reasonable accommodations during the hiring process. For assistance with reasonable accommodations needed to apply for a job, please contact the TSYS Pay and Benefits Center between 8 a.m. and 7 p.m. Eastern Monday-Friday at +1.706.644.8747 or +1.877.644.8747 or email at PayandBenefits@tsys.com.\n<br><br>\nEOE/Minorities/Females/Vet/Disability\n<br><br>\n<strong>Outside of US Applicants:</strong>\n<br><br>\nTSYS is committed to diversity and equal opportunities for everyone. We are committed to ensuring that all job applicants and team members are treated equally, without discrimination because of gender, sexual orientation, marital or civil partner status, gender reassignment, race, colour, nationality, ethnic or national origin, religion or belief, disability, age or any other characteristic prohibited by law. For more information, please refer to our Code of Business Conduct and Ethics, found here."}