{"job title": "Senior Service Reliability Engineer - Realtime API", "company": "Transunion", "city state": "– Portland", "rating": "4.0", "job description": "<strong>Senior Service\n<br>\nReliability Engineer (Realtime API) - iovation</strong>\n<br><br>\n<strong>“We are a very client-centric organization. The client comes\n<br>\nfirst in everything we do. That’s why we hire smart, talented people with a\n<br>\npassion for developing the best tools to stop fraudsters, while saving our\n<br>\nclients time and money.”</strong> – Greg Pierson, Sr. VP iovation\n<br><br>\n<strong>What\n<br>\nwe’ll bring:</strong>\n<ul>\n<li>A\n<br>\nwelcoming and energetic environment that encourages collaboration and\n<br>\ninnovation. We consistently explore new technologies and tools to be agile.</li><li>Flexible\n<br>\ntime off, workplace flexibility, an environment that welcomes continued\n<br>\nprofessional growth through support of tuition reimbursement, conferences and\n<br>\nseminars.</li><li>Our\n<br>\nculture encourages our people to hone current skills and build new\n<br>\ncapabilities, while discovering their genius.</li><li>A\n<br>\ncollaborative environment that values the pursuit of excellence, acting with\n<br>\nintegrity, being innovative, active participation, building partnerships and\n<br>\ntaking pride in the work being done.</li>\n</ul>\n\n<strong>What\n<br>\n<strong>you’ll bring:</strong>\n\n<ul>\n<li>At least 10 years of development and/or operations experience,\n<br>\nincluding several years of demonstrated experience in a large SaaS environment.</li><li>Demonstrated practical problem solving, communication and\n<br>\ndocumentation skills</li><li>Proven experience performing root cause analysis and engaging\n<br>\nother stakeholders when appropriate</li><li>Experience operating SQL and NoSQL data stores in a high\n<br>\nthroughput, high availability, low latency environment.</li><li>Experience with systems management tools such as Puppet or Chef\n<br>\nand concepts of configuration management in a large-scale environment</li><li>Practical knowledge of at least one scripting language (Bash,\n<br>\nRuby, Python, Perl)</li><li>Ability to assess tradeoffs and make decisions collaboratively\n<br>\nin a cross-functional team</li><li>Comfortable with the event driven nature of our work</li>\n</ul>\n<strong>We’d love to see:</strong>\n<ul>\n<li>Experience with capacity planning practices or methodologies</li></ul>\n\n<ul>\n<li>Familiarity with Java debugging tools</li></ul>\n\n<ul>\n<li>Familiarity with operating software based on Spring Cloud and/or\n<br>\nassociated components</li></ul>\n\n<ul>\n<li>Experience operating Apache Cassandra in a production\n<br>\nenvironment</li></ul>\n\n<ul>\n<li>Experience operating Elastic Search, Lucene, Solr or Katta in a\n<br>\nproduction environment</li></ul>\n\n<ul>\n<li>Experience operating containers (Docker, rkt) in a production\n<br>\nsetting</li></ul>\n\n<ul>\n<li>Experience using Kubernetes, Marathon, Docker Swarm or another\n<br>\ncontainer orchestration platform</li></ul>\n\n<ul>\n<li>Experience troubleshooting and/or building systems in the JVM</li>\n</ul>\n<strong>Impact\n<br>\nyou’ll make:</strong>\n<ul>\n<li>Participate in cross functional feature teams to bring\n<br>\noperational perspective during the development cycle in the form of</li><li>Non-functional requirements; develop and evangelize best\n<br>\npractices for commonly needed design patterns</li><li>Driving deployment automation towards repeatable, consistent,\n<br>\nand safe outcomes</li><li>Driving\n<br>\ndown systemic risk through failure mode analysis, instrumentation, and\n<br>\nmitigation</li><li>Driving\n<br>\ntesting of reliability and scalability</li><li>Provide operational support for highly critical real time APIs\n<br>\nto meet SLO and SLA objectives</li><li>Troubleshoot issues with our systems at all levels of the stack\n<br>\nby performing deep problem analysis to identify root cause and appropriate\n<br>\nresolution</li><li>Work to reduce manual toil through automation and development of\n<br>\nstandardized practices for managing systems and services</li><li>Take part in a 24x7 on-call rotation (current on-call rotation\n<br>\nis once every 9 weeks)</li><li>Perform routine care and feeding tasks of the production\n<br>\nenvironment including deployments, data corrections, and upgrades</li>\n</ul>\n<strong>Tools\n<br>\nwe use:</strong>\n<ul>\n<li> Java, Groovy, Ruby, Python, Perl, Git, Go</li><li> Cassandra, Elasticsearch, Postgres, Redis, ActiveMQ, MySQL</li><li> Puppet, Rundeck, Docker, Kubernetes, CentOS,</li><li> Sensu, Collectd, Graphite, JMX</li><li> JIRA, Confluence, BitBucket</li>\n</ul>\nWe are an equal opportunity employer and all\n<br>\nqualified applicants will receive consideration for employment without regard\n<br>\nto race, color, religion, sex, national origin, age, disability status, veteran\n<br>\nstatus, marital status, citizenship status, sexual orientation, gender identity\n<br>\nor any other characteristic protected by law.<br><br>#DICE</strong>"}