{"job title": "Principal Software Engineer", "company": "Xilinx", "city state": "– San Jose, CA", "rating": "3.8", "job description": "<strong>Description</strong><br><br>Xilinx develops highly flexible and adaptive processing platforms that enable rapid innovation - from the endpoint to the edge to the cloud. Xilinx is the inventor of the FPGA, programmable SoCs and the ACAP, designed to deliver the most dynamic processor technology in the industry and enable adaptable, intelligent computing.\n<br><br>\nIf you are a passionate, innovative and an out-of-the-box thinker that enjoys challenging projects, Xilinx is the right place for you. Our global team is growing and we are looking for bold, collaborative and creative people to help deliver groundbreaking technologies that build an adaptable intelligent world. Come do your best work and live your best life through collaboration, wellness and giving back to your community as a member of the ONEXILINX team. <br>\n<div>Xilinx is looking for a very experienced and motivated individual to join the physical optimization team. Your responsibility will include:\n\n<ul>\n<li>Researching, inventing, implementing and enhancing Xilinx FPGA specific optimizations and flows.</li> <li>Developing and maintaining best in class FPGA software implementation tool including logic and physical optimization algorithms and flows.</li><li>Leading cross functional projects, collaborating with teams such as marketing, apps, and communicating with management</li><li>Performing design analysis and addressing customer issues</li><li>Taking initiative on software tool quality and performance improvements</li>\n</ul>\n\n</div><br>\n\n<div><div>\n\n<ul>\n<li>MS or PhD in CS, EE, CE or related fields with 15+ years experience in EDA software industry</li><li>In-depth expertise and knowledge on general and EDA related data structures and algorithms, digital designs and FPGA architecture</li><li>Expert in C++, UNIX shell scripting.</li><li>Extensive experience on developing and support large-scale software. Include defining use model, writing functional spec, coding, testing and document</li><li>Proven track record of successfully designing and implementing major software modules/features, including taking initiative and leading cross-functional team to accomplish it</li></ul> </div>\n</div>"}