{"job title": "Design Verification Engineer - DSP", "company": "Xilinx", "city state": "– San Jose, CA", "rating": "3.8", "job description": "<p><b>Description</b> </p> <div> \n<div>\n<div>Xilinx develops highly flexible and adaptive processing platforms that enable rapid innovation across a variety of technologies - from the endpoint to the edge to the cloud. Xilinx is the inventor of the FPGA, hardware programmable SoCs and the ACAP (Adaptive Compute Acceleration Platform), designed to deliver the most dynamic processor technology in the industry and enable the adaptable, intelligent and connected world of the future in a multitude of markets including Data Center (Compute, Storage and Networking); Wireless/5G and Wired Communications; Automotive/ADAS; Emulation &amp; Prototyping; Aerospace &amp; Defense; Industrial Scientific &amp; Medical, and others. Xilinx's core strengths simultaneously address major industry trends including the explosion of data, heterogeneous computing after Moore's Law, and the dawn of artificial intelligence (AI). <br><br>Our global team is growing and we are looking for bold, collaborative and creative people to help us lead the industry transformation to build an adaptable intelligent world. We believe that by embracing diverse ideas, striving for excellence in all that we do, and working together as a unified team, we can accomplish anything. Come do your best work and live your best life as part of the ONEXILINX team!</div>\n<div><br></div>\n<div>The Silicon development team is looking for verification engineers for the verification of next generation DSP processors in Silicon</div>\n<div><b></b> </div>\n<div><b>Responsibilities include the following: </b></div>\n<ul>\n<li>\n<div>Will be working with a team of design and verification engineers and play an important role in the verification of a next generation DSP architecture in Silicon</div></li>\n<li>\n<div>Work with Architecture, design and software teams to create block and subsystem level verification testplans and develop testcases for verifying next generation multi-core DSP processors</div></li>\n<li>\n<div>Create testbenches, testplans and testcases starting from the architecture/ implementation specification, and work with architecture, design, verification and software teams to ensure micro-architecture and design is fully verified/validated across multiple platforms</div></li>\n<li>\n<div>Debug failures in simulation / emulation of the design on multiple platforms and assist in identifying / obtaining and verifying design changes</div></li></ul></div></div><p><b> </b> </p> <ul>\n<li>Requires BS w/ 3+ yrs or MS 2+ yrs in Electrical Engineering, Computer Engineering, Computer Science or related equivalent.</li>\n<li>Experience in the area of processor / SoC verification. </li>\n<li>Experience in verification of one or more of the following: multi-core processors including SIMD, Vector processors, floating point, etc. is a plus.</li>\n<li>Experience in SoC verification a plus</li>\n<li>Ability to debug failures in RTL and environment on different verification platforms</li>\n<li>Strong analytical problem solving, and attention to details </li>\n<li>Strong experience HDL, verification, and general computational logic design/verification concepts</li>\n<li>Expertise in Verilog/System Verilog, C/C++/SystemC, UVM, Scripting languages like Perl/Python, etc</li>\n<li>Excellent written and verbal communication skills</li>\n<li>Excellent interpersonal skills, self-motivated</li></ul>"}