{"job title": "Machine Learning Scientist", "company": "CyberCoders", "city state": "– Mountain View, CA", "rating": "3.8", "job description": "Machine Learning Scientist <div>\nTitle: Machine Learning Engineer\n<br>\nCompensation: $120k - $150k\n<br>\nDirect Hire\n<br>\nLocation: Mountain View, CA (Local candidates only)\n<br>\nREQUIRED - BSc in Computer Science, Machine Learning, or relevant\n<br>\nREQUIRED - At least 3 Years of Relevant Experience\n<br>\nREQUIRED - Elastic Search Experience\n<br><br>\nIn the age of information, the cloud is more than just a thing in the sky that kind of looks like an elephant if you squint just right. The cloud of today has no shape, but that of the future. We are a Mountain View based company that is the driving force behind the world's leading AI powered knowledge cloud. Our solutions allows our clients to enjoy a learning platform that aggregates, curates, stores, and assists in the analysis of targeted and relevant information that transforms the way companies engage and conduct business.\n<br><br>\nWe are looking for an Python/ElasticSearch savvy Machine Learning Engineer to help us revolutionize the world of business. If this sounds like you, please read on!</div>\n\n<br>What You Need for this Position<div>\nREQUIRED - BSc in Computer Science, Machine Learning, or relevant\n<br>\nREQUIRED - 3 Year of Relevant Experience and Knowledge of:\n\n\n<ul>\n<li>Python</li>\n<li>C++</li>\n<li>ElasicSearch</li>\n<li>NoSQL exp, MongoDB required</li>\n<li>Large data manipulation</li></ul></div>\n\n\n<div>\nSo, if you are a Machine Learning Engineer, please apply today!</div>\n\n<li><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}