{"job title": "Scientist", "company": "F. Hoffmann-La Roche Ltd", "city state": "– Tucson, Arizona", "rating": "NA", "job description": "<strong> POSITION SUMMARY:</strong>\n<br><br>\nThis is a position in the Stability and Surveillance Program, where stability testing is performed to support and /or extend product expiration dating, and to ensure that label claims are met throughout a products shelf life.\n<br><br>\nResponsible for initiating, directing and executing scientific research, development and manufacturing process strategies to support new and existing products. Investigates the feasibility of applying a wide variety of scientific principles and concepts to potential inventions, products and problems. Plans and executes laboratory research. Maintains broad knowledge of state-of-the art principles and theories. Makes contributions to scientific literature and conferences. Serves as an in-house and outside consultant. May act as a spokesperson for corporate scientific affairs and advise top management. Participates in development of patent applications. Promotes and participates in the professional development of scientists and laboratory facilities. Uses professional concepts to contribute to the development of product or process principles and to achieve objectives in creative and effective ways.\n<br><br>\n<strong> ESSENTIAL FUNCTIONS:</strong>\n<li> Conducts research and development activities for products, methods and/or processes.</li> <li> Projects are assigned with defined scope and goals.</li> <li> Direction is provided by more senior scientists, management or project leader.</li> <li> Participates in efforts to define new components, products or processes and identify technical challenges.</li> <li> Makes suggestions to improve work processes.</li> <li> Creates potentially patentable components for systems, reagents or processes.</li> <li> Plans and executes assigned projects; utilizes thorough technical and theoretical understanding of numerous techniques.</li> <li> Analyzes data, evaluates results, forms conclusions and provides/implements process or document improvements.</li> <li> Applies advanced scientific knowledge to projects.</li> <li> Executes experiments; participates in experimental design.</li> <li> Utilizes DOE where appropriate.</li> <li> Participates in cross functional technical team activities.</li> <li> Shares knowledge and expertise with others.</li> <li> Participates in project planning, process updates and contributes to experimental design.</li> <li> Prepares and delivers presentations of project results to own or other groups.</li> <li> Monitors work to ensure quality, and continuously promote Quality First Time.</li>\n<strong> Other responsibilities include:</strong>\n<li> Monitoring products as packaged under recommended storage conditions over a period of time, with periodic testing to confirm that products meet specifications</li> <li> Maintaining laboratory equipment/instruments, ensuring that they are calibrated and in good working order</li> <li> Data management</li> <li> Participating in evaluating and reporting results</li> <li> Generating required documentation/procedures/technical reports in support of daily activities</li>\n<strong> MINIMUM QUALIFICATIONS:</strong>\n<br><br>\n<strong> Formal Training/Education and Experience:</strong>\n<br><br>\nPh.D. degree in Science, entry level, or Master's degree with 3+ years, or Bachelors with 8 years relevant experience. If degree is in a non-scientific field Executive Committee approval is required.\n<br><br>\n<strong> Knowledge, Skills, and Abilities:</strong>\n<li> Demonstrates potential for technical proficiency, scientific creativity, collaboration with others and independent thought.</li> <li> Strong understanding of scientific principles and concepts.</li> <li> Applies advanced technical writing skills to produce reports and documents.</li>  <li> Background in immunohistochemistry, histology/pathology, pharmaceutical chemistry, analytical chemistry, biology, biochemistry, or biomedical engineering</li> <li> Experience from the medical device and/or pharmaceutical industries is preferred</li> <li> Project management experience is preferred</li> <li> Must have the ability to adhere to design control procedures in compliance with FDA and ISO guidelines</li> <li> Ability to follow Quality System regulations, including Design Control, Stability protocols</li> <li> Requires excellent communication, technical writing, and oral presentation skills</li> <li> Multitasking and having excellent organization skills, as well as orientation to detail is essential to this position</li> <li> Skilled at using Microsoft Word and Excel</li>\n<strong> Roche is an equal opportunity employer.</strong><br><br>Research &amp; Development, Research &amp; Development &gt; Research <li> Ventana Medical Systems, Inc. (Ventana), a member of the Roche Group, innovates and manufactures instruments and reagents that automate tissue processing and slide staining for cancer diagnostics. Our integrated staining, workflow management and digital pathology solutions optimize laboratory efficiency to reduce errors and support diagnosis for pathology professionals. Together with Roche, Ventana is driving personalized healthcare through accelerated drug discovery and companion diagnostics.\n<br><br>\nRoche is an equal opportunity employer and strictly prohibits unlawful discrimination based upon an individuals race, color, religion, gender, sexual orientation, gender identity/expression, national origin/ancestry, age, mental/physical disability, medical condition, marital status, veteran status, or any other characteristic protected by law.</li>"}