{"job title": "Data Engineer", "company": "Global Resource Management, Inc", "city state": "– Irving, Texas", "rating": "4.0", "job description": "Job Title: Data Engineer\n\n\n<ul>\n<li>Create and maintain optimal data pipeline architecture,</li>\n<li>Assemble large, complex data sets that meet functional / non-functional business requirements.</li>\n<li>Identify, design, and implement internal process improvements: automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc.</li>\n<li>Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources using SQL and AWS big data technologies.</li>\n<li>Build analytics tools that utilize the data pipeline to provide actionable insights into customer acquisition, operational efficiency and other key business performance metrics.</li>\n<li>Work with stakeholders including the Executive, Product, Data and Design teams to assist with data-related technical issues and support their data infrastructure needs.</li>\n<li>Keep our data separated and secure across national boundaries through multiple data centers and AWS regions.</li>\n<li>Create data tools for analytics and data scientist team members that assist them in building and optimizing our product into an innovative industry leader.</li>\n</ul>\n\nWork with data and analytics experts to strive for greater functionality in our data systems.\n<br><br>\n<strong>Must have Skills:</strong>\n\n\n<ul>\n<li>Advanced working SQL knowledge and experience working with relational databases, query authoring (SQL) as well as working familiarity with a variety of databases.</li>\n<li>Experience building and optimizing big data data pipelines, architectures and data sets.</li>\n<li>Experience performing root cause analysis on internal and external data and processes to answer specific business questions and identify opportunities for improvement.</li>\n<li>Strong analytic skills related to working with unstructured datasets.</li>\n<li>Build processes supporting data transformation, data structures, metadata, dependency and workload management.</li>\n<li>A successful history of manipulating, processing and extracting value from large disconnected datasets.</li>\n<li>Working knowledge of message queuing, stream processing, and highly scalable big data data stores.</li>\n<li>Strong project management and organizational skills.</li>\n<li>Experience supporting and working with cross-functional teams in a dynamic environment.</li>\n</ul>\n\n<strong>Desired Skills:</strong>\n\n\n<ul>\n<li>Experience with big data tools: Hadoop, Spark, Kafka, etc.</li>\n<li>Experience with relational SQL and NoSQL databases, including Postgres and Cassandra.</li>\n<li>Experience with data pipeline and workflow management tools: Azkaban, Luigi, Airflow, etc.</li>\n<li>Experience with AWS cloud services: EC2, EMR, RDS, Redshift</li>\n<li>Experience with stream-processing systems: Storm, Spark-Streaming, etc.</li>\n<li>Experience with object-oriented/object function scripting languages: Python, Java, C++, Scala, etc.</li>\n</ul>\n\n<strong>Education:</strong>\n<br>\nWe are looking for a candidate with 5+ years of experience in a Data Engineer role, who has attained a Graduate degree in Computer Science, Statistics, Informatics, Information Systems or another quantitative field.\n<br><br>\n<strong>GitHub Profile:</strong>\n<br>\nAll candidates MUST provide their public GitHub account with repositories that demonstrate Data Engineering competencies."}