{"job title": "Process Scientist", "company": "Illumina", "city state": "– San Diego, CA", "rating": "4.2", "job description": "Position Summary:\n<br><br>\nWe are looking for highly driven and talented Process Development Scientist to join our growing Life Cycle Management (LCM) group with a focus on new product and process introduction to support our growing portfolio of products. The LCM group works as an integral part of our Reagents Manufacturing process and is tasked with introducing new products to manufacturing and increasing quality and yield within our high volume production environments.\n<br><br>\nOur team is hiring a scientist to support new product design and transfer of sequencing application products. These highly collaborative, flexible and dynamic individuals provide technical and operations leadership to new product introductions and new process development. Additionally, this position will partner cross-functionally with R&amp;D, Quality, Production and other departments to develop processes for new products, as well as sustain and improve processes for existing products.\n<br><br>\nResponsibilities:\n<br><br>\nProvide technical leadership in production processes of reagents used in genomic sequencing and application products.\n<br>\nWork cross-functionally with R&amp;D, Manufacturing and Quality to develop processes and assist in design transfer to manufacturing for new products.\n<br>\nDevelop and execute analytical, molecular, and biochemical assays to characterize reagent critical-to-quality and critical-to-performance attributes.\n<br>\nConstruct and execute controlled experiments (including DOEs) to optimize processes to address yield and quality issues, reduce costs, and drive implementation of solutions to meet goals.\n<br>\nUtilize strong production and process change management practices to drive improved quality or production performance.\n<br>\nServe as subject matter expert on NGS sample preparation technology.\n<br>\nAuthor technical documents, such as engineering reports, test protocols, validation documents or changes to existing documentation, to support product manufacturing process documentation requirements.\n<br>\nAnalyze, trend and monitor process test results, issue reports, and make technical recommendations\n<br>\nPerform root cause analysis investigation using RCA tools (such as 8D, 7-Step, 5 Why’s or model based problem solving, etc) together with sound science and data analysis to make technical and compliance-related recommendations and decisions.\n<br>\nAssist manufacturing facilities in completing required technical documentation to enable successful product launches.\n<br>\nUtilize expertise in process engineering methodologies, such as FMEA, SPC, Gauge R&amp;R, Critical Parameter Management, to measure and improve process capability and robustness.\n<br>\nFacilitate and support product and process continuous improvement activities.\n<br>\nLead the technical direction of a project team including driving execution to project deliverables and providing risk mitigation recommendations to meet project milestones.\n<br>\nFacilitate or support the transfer of manufacturing and QC processes from development through scale-up to volume production in a regulated manufacturing environment.\n<br>\nRequirements:\n<br><br>\nPrevious work experience in a similar role in one or more of the biotech, diagnostic, pharmaceutical, medical device or semiconductor industries.\n<br><br>\nHigh level problem solving and reasoning skills.\n<br><br>\nExperience in production support, process development and project management skills is required.\n<br><br>\nWillingness to work outside your primary area of educational discipline or area of current expertise.\n<br><br>\nStrong interpersonal communication skills and the ability to positively influence others and build relationships.\n<br><br>\nWell-developed documentation and technical report writing skills.\n<br><br>\nComfortable working in areas of high ambiguity and complexity in a fast-paced environment.\n<br><br>\nDemonstrated ability to accomplish goals while working across departments is required.\n<br><br>\nHigh level of computer skills are required.\n<br><br>\nHighly Desired:\n<br><br>\nExperience with large data sets and data mining techniques would be a plus.\n<br><br>\nExperience working in an ISO13485, GMP or FDA regulated environment.\n<br><br>\nExperience expanding production capacity and automating processes.\n<br><br>\nExperience with liquid handling and filling technologies.\n<br><br>\nAutomated filling experience with Hamilton or Tecan is a plus.\n<br><br>\nExperience with fluorescence imaging technologies.\n<br><br>\nExperience with protein characterization\n<br><br>\nExperience with measure system analysis and specification setting\n<br><br>\nExperience applying statistics, Statistical Process Control, and Design of Experiments\n<br><br>\nExperience of analytical methods (e.g. HPLC, LC-MS, SDS Page), enzymatic assays or other biological techniques.\n<br><br>\nExperience working with SAP and MES\n<br><br>\nExperience of Lean/Six Sigma/DFM\n<br><br>\nEducation:\n<br><br>\nB.S./M.S./ PhD in Molecular Biology, Biochemistry, Chemical Engineering, Biochemical Engineering, Bioengineering, Biotechnical Engineering, with at least 0-2 years of relevant experience.\n<br><br>\nExperience/Education:\n<br><br>\nTypically requires a minimum of 5 years of related experience with a Bachelor’s degree; or 3 years and a Master’s degree; or a PhD without experience; or equivalent work experience"}