{"job title": "CIB Chief Data Science Office-Data Scientist VP", "company": "J.P. Morgan", "city state": "– New York, NY", "rating": "3.8", "job description": "<p><b>About J.P. Morgan Corporate &amp; Investment Bank</b> </p>\n<p><br>J.P. Morgans Corporate &amp; Investment Bank (CIB) is a global leader in Banking. The worlds corporations, governments and institutions entrust us with their business in more than 100 countries. The Corporate &amp; Investment Bank supports our clients around the world providing strategic advice, raising capital and managing risk.<br></p>\n<div>The Data Analytics team at JPMorgan Corporate Investment Bank combines cutting edge machine learning techniques with the companys unique data assets to optimize all the business decisions we make. In this role, you will be part of our industry-leading data analytics team, and advance the state-of-the-art in financial applications ranging from generating business intelligence to predictive models and automated decision making. Our work spans the companys lines of business, with exceptional opportunities in each.</div>\n<div> </div>\n<div>The successful candidate will apply data analytics techniques from traditional statistics to data engineering and some machine learning for banking applications including risk assessment, trading models, client relationship management, and pricing models. Machine learning techniques will include familiarity or knowledge of at least one of the following areas: feed-forward, recurrent, recursive and convolutional neural networks, maximum entropy models, and other algorithms related to time series analysis and supervised learning.</div>\n<div> </div>\n<div><b>Responsibilities</b></div>\n<ul>\n<li>Develop scalable tools leveraging machine learning and deep learning models to solve real-world problems in areas such as Speech Recognition, Natural Language Processing and Time Series predictions.</li>\n<li>Collaborate with all of JPMorgan's lines of businesses and functions in the Corporate Investment Bank: Markets, Global Investment Banking, Corporate Banking, Technology and Operations.</li>\n<li>Lead your own project. Suggest, collect and synthesize requirements. Create an effective roadmap towards the deployment of a production-level machine learning application.</li></ul>\n<div> </div>\n<div><b>Technical</b></div>\n<ul>\n<li>MS or PhD in a quantitative discipline, e.g. Computer Science, Mathematics, Statistics, Operations Research, Data Science, or similar BS with 2+ years of experience in a highly quantitative position.</li>\n<li>Experience in Deep Learning: DNN, CNN, RNN/LSTM, GAN or other auto encoder (AE).</li>\n<li><b>6-10 years of hands-on experience</b> developing statistics models and machine learning models.</li>\n<li>Ability to develop and debug in Python, Java, C or C++. Proficient in git version control. R and Matlab are also relevant.</li>\n<li>Experience with big-data technologies such as Hadoop, Spark, SparkML, etc.</li>\n<li>Experience with machine learning APIs and computational packages (TensorFlow, Theano, PyTorch, Keras, Scikit-Learn, NumPy, SciPy, Pandas, statsmodels).</li>\n<li>Familiarity with basic data table operations (SQL, Hive, etc.)</li></ul>\n<div> </div>\n<div><b>Problem solving and collaboration skills</b></div>\n<ul>\n<li>Should be able to work both individually and collaboratively in teams, in order to achieve project goals.</li>\n<li>Must be curious, hardworking and detail-oriented, and motivated by complex analytical problems.</li>\n<li>Must have the ability to design or evaluate intrinsic and extrinsic metrics of your models performance which are aligned with business goals.</li>\n<li>Must be able to independently research and propose alternatives with some guidance as to problem relevance.</li>\n<li>Must be able to undertake basic and advances EDA, may require some direction from more senior team; should be aware of limitation and implication of methodology choices.</li>\n<li>Ensures re-use and sharing of ideas within team and locale.</li>\n<li>Able to work with non specialists in a partnership model, conveys information clearly and creates a sense of trust with stakeholders. </li>\n<li>\n<div>Shows institutional awareness and some understanding of applied problem solving, may require coaching and guidance as to how to most rapidly reach a satisfactory conclusion</div></li>\n<li>\n<div>Must be able to train others in these areas, and is seen as a leader within the broader DS community; taking leadership of topics and areas in order to help others grow</div></li>\n<li>\n<div>Seeks to publish work internally, and ideally externally, which would also include speaking / teaching at appropriate venues (either internal or external)</div></li>\n<li>\n<div>Is able to envisage the end to end solution for a problem, including data, technology and methodological decision; either alone in conjunction with technology partners.</div></li>\n<li>\n<div>Takes the lead in sharing best practice within the CIB analytics team</div></li>\n<li>\n<div>Takes a structured, incremental approach to delivery, inclusive of stakeholders, with clear transparency of plan, and consistent track record of delivery.</div></li></ul>"}