{"job title": "Research Scientist", "company": "KLA-Tencor Corporation", "city state": "– Milpitas, California", "rating": "3.7", "job description": "Job Opening ID: 117306<br><br><strong> Job Opening ID:</strong><br><br>Full-Time\n<br><br>\nRegular<br><br><strong> Company Overview</strong> Calling the adventurers ready to join a company that's pushing the limits of nanotechnology to keep the digital revolution rolling. At KLA-Tencor, we're making technology advancements that are biggerand tinierthan the world has ever seen. Who are we? We research, develop, and manufacture the world's most advanced inspection and measurement equipment for the semiconductor and nanoelectronics industries. We enable the digital age by pushing the boundaries of technology, creating tools capable of finding defects smaller than a wavelength of visible light. We create smarter processes so that technology leaders can manufacture high-performance chipsthe kind in that phone in your pocket, the tablet on your desk and nearly every electronic device you ownfaster and better. We're passionate about creating solutions that drive progress and help people do what wouldn't be possible without us. The future is calling. Will you answer? <strong> Group/Division</strong> The Corporate Technology Group develops key technology used in KLA-Tencors inspection and metrology systems. We research, analyze and prototype key technologies such as sensors, lasers and optics. When the technology is proven to meet requirements, we work with KLA-Tencor product divisions and key suppliers to implement the technology into KLA-Tencors products. <strong> Responsibilities</strong><br><br>As a research scientist within KLA-Tencor, your responsibilities will include:\n<li> Analyzing design rules for advanced nodes and determining the requirements for measuring and inspecting semiconductor devices manufactured at those nodes.</li> <li> Developing detailed, rigorous models of the interaction of light or electron beams with structures on semiconductor wafers and the propagation of light through optical systems.</li> <li> Designing and systematically executing experiments.</li> <li> Analyzing experimental data and comparing with model.</li> <li> Working with KLA-Tencors product divisions to develop and implement metrology and inspection system architectures that meet the future requirements for semiconductor measurement and inspection.</li> <strong> Preferred Qualifications</strong> <li> Ph.D. in Physics, Optics or Electronics.</li> <li> Postdoc experience preferred but not required.</li> <li> Must be experienced in electromagnetic simulations using programs such as MATLAB and COMSOL.</li> <li> Must be familiar with numerical techniques commonly used in physical simulations.</li> <li> Experienced designing and executing experiments, and analyzing experimental data.</li> <li> Must be a team player with good written and verbal communication skills.</li> <strong> Minimum Qualifications</strong><br><br>Doctorate (Academic) in Pysics, Optics or Electronics.<br><br><strong> Equal Employment Opportunity</strong> KLA-Tencor is an Equal Opportunity Employer. Applicants will be considered for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristics protected by applicable law."}