{"job title": "Cloud DATA SCIENTIST - Big Data Platform Team - New York", "company": "Oracle", "city state": "– United States", "rating": "3.4", "job description": "Overlay sales personnel providing specialist product expertise to the sales force.\n<br><br>\nPartners with Account, Technology, and Application sales representatives to qualify and close new business on Oracle solutions. Provides specific industry or product expertise to facilitate the closing of deals within sales representatives territory. Interacts with sales team to architect the solution, and develop and execute solution strategies for market. Manages solution opportunities to obtain appropriate and necessary resources for all qualified opportunities. Leads teams in the sales process for establishing market visibility and deal visibility. Presents/demonstrates solution to high level clients and industry conference attendees. May provide training to field sales on industry/solutions. Builds and maintains a network and up to date specific industry or product knowledge.\n<br><br>\nJob duties are varied and complex, needing independent judgment. May have project lead role. 5 years field sales experience. Subject matter expertise in industry/product space. Knowledge of key industry leaders and management. Knowledge of Oracle competition. Presentation and product demonstration experience. Understanding of software and consulting arenas. Excellent communication, negotiating, and closing skills with prospects and customers. Travel may be needed. BA/BS degree in related field.\n<br><br>\n<strong>Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.</strong><br>\n\n<div>Job Requirements: Cloud Data Scientist - Big Data\n<br><br>\n· Strong verbal and written communication skills.\n<br><br>\n· Works well independently and with a team - both technical and non-technical teams.\n<br><br>\n· Strong problem solving skills and the ability to dive into details and drive issue resolution.\n<br><br>\n· Bachelors or Masters in Computer Science, Computer Engineering, Machine Learning, Statistics or related quantitative field.\n<br><br>\n· Proficiency in one statically typed language (Java, C, C , C#, etc.) and one scripting language (Python, Perl, Scala, etc.).\n<br><br>\n· Exposure to mathematical programming libraries (e.g. R, Matlab, Weka, SAS, Numpy, etc.).\n<br><br>\n· Exposure to declarative data manipulation languages (eg. SQL) as well as Relational and NoSQL databases.\n<br><br>\n· Experience with Linux or UNIX environment.\n<br><br>\n· Experience with map reduce framework, and parallel/distributed processing such as Hadoop/Spark.\n<br><br>\n· Experience with software development tools (e.g. git, cvs, etc) and agile/scrum development processes.\n<br><br>\n· 3 years of hands-on experience with software development or research\n<br><br>\n<strong>Preferred:</strong>\n<br><br>\n· Experience in large scale data mining and cloud computing.\n<br><br>\n· Demonstrated ability to implement different techniques in predictive analytics, forecasting, modeling &amp; measurement.\n<br><br>\n· 5 years of hands-on experience with software development or research.\n<br><br>\n· Strong computer science fundamentals - i.e. algorithms and data structures, and be able to write snippets of code using these to solve a problem.\n<br><br>\nFor more information, contact: Anita Filip, Principal Talent Advisor - anita.filip@oracle.com</div>\n<br>"}