{"job title": "Scientist or Senior Scientist, Computational Oncology", "company": "Sage Bionetworks", "city state": "– Seattle, WA", "rating": "4.8", "job description": "<strong>Position Overview</strong>\n<br><br>\nSage Bionetworks is currently recruiting for computational biologist / research scientists at multiple levels with an interest and strong background in cancer research. This position presents the opportunity to support and lead research teams focused on a diverse set of questions in cancer. Ideal candidates will have a background in pre-clinical and translational medicine, and an appreciation of efforts to incorporate `omics’ data into clinical practice. We are active in a number of disease areas including immune-oncology, colorectal cancer, prostate cancer, NF1 &amp; 2, lower grade gliomas, and large pan cancer studies.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\n• Support the interaction with external research consortia to develop bioinformatics analysis and visualizations of genomic data in collaboration with clinicians, biologists, foundations and other bioinformaticians in academia and industry.\n\n\n<ul>\n<li>Design, develop, and lead research projects, from inception to publication, in various cancer domains including:</li>\n<li>Prognostic modeling of patient outcomes</li>\n<li>Predictive modeling of drug response</li>\n<li>Analysis of functional screen data e.g. drug response, siRNA</li>\n<li>Integrative genomic modeling</li>\n<li>Design and develop algorithms for interrogating and interpreting complex genomic data.</li>\n<li>Work closely with Sage and DREAM scientists to develop DREAM Challenges around impactful questions in cancer research.\n<br><br>\n<strong>Basic Qualifications</strong>\n<br><br>\n• Candidate will hold a Ph.D. in computer science, bioinformatics, or related quantitative discipline.</li>\n<li>Strong candidates will also be considered holding Masters or Bachelors degree, with 6+ years of significant relevant work experience and strong track records of bioinformatics analysis.</li>\n<li>Experience working with high dimensional genomic data, such as sequencing data, gene expression, genotype, CNV, sequence and/or data from other high throughput biological technologies.</li>\n<li>Demonstrated excellence in research with evidence of advancing an area of computational biology.\n<br><br>\n<strong>Additional Skills/Preferences</strong>\n<br><br>\n• Professional software development experience, including strong programming skills in a high level language such as Python, R, or Java.</li>\n<li>An understanding of advanced machine learning or statistical techniques, such as probabilistic graphical models, Bayesian inference, and optimization methods.</li>\n<li>A passion for open-access innovation.</li>\n<li>Strong collaboration, teamwork, and communication skills.</li>\n<li>A desire to change the world and contribute to the elimination of human disease.</li>\n\n</ul>"}