{"job title": "Postdoctoral Research Scientist III - Spectroscopy R&amp;D", "company": "Thermo Fisher Scientific", "city state": "– Madison, WI", "rating": "3.3", "job description": "Job Description<br><br>Job Title: Postdoctoral Research Scientist III - Spectroscopy R&amp;D\n<br>\nRequisition ID: 74037BR\n<br><br>\nWhen you join us at Thermo Fisher Scientific, youll be part of a smart, driven team that shares your passion for exploration and discovery. With revenues of $22 billion and the largest investment in R&amp;D in the industry, we give our people the resources and opportunities to make significant contributions to the world.\n<br><br>\nLocation/Division Specific Information: Madison, Wisconsin\n<br><br>\nJob Description:\n<ul>\n<li>Responsibilities include: experimental design and execution, data extractions and analysis, modify and optimize experiments, conceive and develop new research motivated experiments, provide guidance on new instrumentation design.</li><li>Propose technology projects to prototype new instrumentation that could address unmet needs for new applications</li><li>Work closely with engineering team to ensure that new products are designed for manufacturability and are optimized for quality and cost targets.</li><li>Develop and execute test plans, including mainly but not limited to spectroscopy functional tests</li><li>Fast-prototyping of sub-component opto-mechanical systems including grating based spectrometers</li>\n</ul>\nQualifications:\n<br><br>\nBasic Qualifications:\n<ul>\n<li>Ph.D. in Applied Physics, Chemistry, Material Science, Chemical Engineering, - or a related physical science</li><li>Self-driven and achievement motivated</li><li>Good communication skills and strong in technical writing and presentation</li><li>Demonstrate Thermo Fisher Scientific values Integrity, Intensity, Innovation and Involvement</li>\n</ul>\nPreferred Qualifications:\n<ul>\n<li>Familiar with various spectroscopic techniques (at least one of the following): Raman spectroscopy, FTIR spectroscopy, fluorescence, or other spectroscopic techniques</li><li>Experience with photonics tools, light sources (i.e. lasers), detectors: CCDs; ICCDs, EMCCDs, InGaAs detectors, cooled cameras.</li><li>Experience with Kerr gating, time-gating, time-resolved detection schemes, fluorescence lifetime measurements, and noise suppression techniques.</li><li>Experience in real-time instrumentation control of Vision, motion control, digital signal processing and data acquisition systems used in metrology, physics, chemistry, or microbiology.</li><li>Programming skills in Python, MATLAB, LabView, C# or other programming languages are plus/desired but not required.</li><li>Good communications skills in English, both oral and written, technical documentation, technical presentation skills a plus.</li><li>Familiar with optical design software packages, such as ZEMAX, or Code5, familiar with Solidworks, etc. not required but a plus.</li>\n</ul>\n\nAt Thermo Fisher Scientific, each one of our 70,000 extraordinary minds has a unique story to tell. Join us and contribute to our singular missionenabling our customers to make the world healthier, cleaner and safer.\n<br><br>\nApply today! http://jobs.thermofisher.com\n<br><br>\nThermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status.\n<br><br>\nIf you are an individual with a disability who requires reasonable accommodation to complete any part of our application process, click here for further assistance.<br><br>Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status."}