{"job title": "Data Engineer", "company": "8x8", "city state": "– San Jose, CA", "rating": "3.7", "job description": "Can you envision working closely with all aspects of data from application to cloud services?\n<br><br>\nCome Join our team as a Data Engineer !!!\n<br><br>\nAt 8x8, we have many opportunities to work with data on a daily basis. Can you envision working on data and build the infrastructure that are critical to drive valuable business insight. How about building a scalable data pipelines to drive critical data analysis for our end users and enable data science experimentation? Our Enterprise data analytics team works closely with all aspects of data from our application to our cloud services. We’re looking for Data Engineer with experience building efficient data pipelines reliably moving data across various and eager to build the scalable data tools for data exploration. Your work will greatly influence our program teams and analysts. You’ll take an active role in driving our analytics strategic projects that takes on some of the most challenging problems to solve. This is a full time position in our office in San Jose.\n<br><br>\n<strong></strong>\n<br><br>\n<strong></strong>\n<ul>\n<li>Build data expertise and own data quality for all data pipelines you build</li><li>Track events that are critical to drive business values</li><li>Work with new data models that provide intuitive analytics</li><li>Move data from large scale data warehouse and data storage both internally and externally</li><li> Develop new systems and tools to enable folks to consume and understand data faster</li><li>Use your expert coding skills across a number of languages from Python, Java and PHP</li><li>Work across multiple teams in high visibility roles and own the solution end-to-end</li>\n</ul>\n<strong><br><br>\n</strong>\n<br><br>\n<strong>Requirements</strong>\n<br><br>\n<strong></strong>\n<ul>\n<li>2+ years of Java and/or Python development experience is necessary</li><li>2+ years of SQL (mySQL, Hive, etc) experience is required</li><li>3+ years of experience with dimensional data modeling &amp; schema design in Data Warehouses</li><li>2+ years of experience in ETL design, implementation and maintenance (Pentaho, Elastic Search)</li><li>100% passionate for reliable data pipelines and intuitive user interfaces</li><li>Ability to write well-abstracted, reusable code components</li><li>Excellent communication skills including the ability to identify and communicate data driven insights</li><li>BS or MS degree in Computer Science or a related technical field</li>\n</ul>\n#LI-RM1\n<br><br>\n<strong>ABOUT 8x8</strong>\n<br><br>\n8x8, Inc. (NYSE: EGHT) is the trusted provider of secure and reliable enterprise cloud communications solutions to more than 45,000 businesses operating in over 100 countries across six continents. 8x8's out-of-the-box cloud solutions replace traditional on-premises PBX hardware and software-based systems with a flexible and scalable Software as a Service (SaaS) alternative, encompassing cloud business phone service, contact center solutions, and conferencing.\n<br><br>\nIn today’s competitive market 8x8 continues to deliver service excellence, with a consistent, innovative, cohesive, progressive and dynamic culture.\n<br><br>\nFor additional information, <em>visit</em> <em>www.8x8.com</em><em>,</em> <em>www.8x8.com/UK</em><em> or connect with 8x8 on</em> <em>LinkedIn</em><em>,</em>\n<br><br>\n<em>Twitter</em><em>,</em> <em>Google+</em><em> and</em> <em>Facebook</em>\n<br><br>\n8x8 is proud to provide equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics.\n<br><br>\nFor 8x8 jobs located in the US: 8x8 participates in the E-Verify program.\n<br>\nView the Participant Poster in English | Español.\n<br>\nView the Right to Work Poster in English | Español.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}