{"job title": "Senior Scientist, Data II", "company": "AbbVie", "city state": "– North Chicago, IL", "rating": "3.7", "job description": "AbbVie Operations Business Insights (OBI) is working to transform AbbVie operations organization to enable the use of data and analytics to drive world-class innovation, performance and agility.\n<br><br>\nWe are looking for a Data Scientist to be an analytics thought-leader for a diverse operations business which includes Supply Chain, Manufacturing, Quality, Purchasing and Science &amp; Technology.\n<br><br>\nThe Data Scientist will develop predictive models using statistical and machine-learning methodologies using complex modeling techniques, communicate insights and provide guidance on the evolution of data architecture and data science toolset.\n<br><br>\n<strong>What youll do:</strong>\n<ul>\n<li>Consult with IT partners and clients in the analysis of short and long range business requirements and recommends innovations which anticipate the future impact of changing business requirements.</li>\n</ul>\n· Design and develop processes and systems to consolidate and analyze data. Considerations include variety (structured, unstructured), volume (includes big data), data quality (cleaning and validation of the data) and velocity (batch, stream).\n<br><br>\n· Develop advanced data analytical models and techniques from supervised and unsupervised machine learning, statistical analysis and predictive modeling.\n<ul>\n<li>Generate reports with findings and communicate these effectively via written, oral and visual Dashboard methods.</li>\n</ul>\n· Mentor and coach related team members\n<br><br>\n<strong>What youll Need:</strong>\n<ul>\n<li>Advanced knowledge of statistical and machine learning methods, with expertise in modeling and business analytics</li>\n<li>Experience with statistical languages and packages, such as R, SAS, Matlab</li> \n\n<li>Experience working with relational databases and/or distributed computing platforms Big Data, and their query interfaces, such as SQL, Spark, MapReduce and Hive.</li> \n\n<li>Experience with additional programming languages, such as Python stack e.g. (NumPy, pandas)), Java</li> \n\n<li>Experience using visualization techniques for presenting data and analysis as dashboard in tools such as Qlik.</li>\n<li>Familiarity with Amazon Web Services, Apache Spark, Tensorflow etc.</li>\n<li>Excellent written and verbal communications skills</li> </ul>\n\n<ul>\n<li>Bachelors or Masters Degree or equivalent work experience in Computer Science and or related discipline such as Statistics, Mathematics etc.</li>\n<li>5+ Years of demonstrated experience in the relevant areas.</li>\n<li>2-5 years of prior experiences data analysis, business intelligence including data warehousing and business intelligence tools, techniques and technology experience performing analyses and presentation of data.</li>\n<li>Knowledge of Agile Project management processes</li>\n</ul>\n· Comfortable working in a fast paced, highly collaborative, dynamic work environment\n<br><br>\nAdditional Desired Experience:\n<ul>\n<li>Experiences in Personalization, Search, Deep Learning, Operations Research</li>\n<li>Working experience of OS Linux/Unix</li> \n\n<li>Data mining, text mining etc.</li>\n<li>Ability to think creatively and solve problems</li>\n</ul>"}