{"job title": "Senior Machine Learning Research Scientist", "company": "Arm Holdings", "city state": "– Austin, TX", "rating": "4.4", "job description": "<div><div>\n <div>\n <p><b>We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.</b></p>\n </div>\n </div>\n\n <div>\n <div>\n Job Description\n <p></p><p>Arm’s Machine Learning Research Team identifies and investigates emerging ML technologies and applications and evaluates how to creatively deploy them wherever computing happens; from always-on sensors, to mobile phones, and to the cloud. You will be given the ability work within the rapidly-growing ML field and to deliver the underlying technology to deploy creative applications on Arm IP – the center of the world’s most ubiquitous compute platforms.</p><p>ML research adds extra dimensions to the already challenging problems of tomorrow – providing top model accuracy while optimizing for energy consumption on embedded devices, maintaining QoS across a wide variety of mobile hardware, and scaling ML to billions of connected devices in the Internet of Things. The ML research team collaborates with product teams to deliver industry leading hardware and software solutions to Arm’s partners. The team also works closely with leading ML university research to track and collaborate on emerging technology.</p><p>We are looking to add extraordinary researchers to Arm’s Machine Learning research team. You will have the opportunity to influence real products through ground breaking research. You will also be afforded the freedom to develop new skills, collaborate with academic partners, and publish research results.</p><p>What will I be accountable for?</p><ul><li>Identifying and investigating key machine learning technologies and algorithms, and assessing how they’ll impact our products and partners</li><li>Collaborating with our product teams to develop new IP – architecture, hardware, and software</li><li>Reporting and presenting research findings and experimental results to key partners</li><li>Publishing the results of your research to contribute to the overall ML ecosystem</li><li>Developing and adapting ML algorithms for energy-constrained devices</li><li>Advancing the state of the art in application areas: natural language processing, computer vision, sensor fusion, object tracking, and motion planning</li><li>Prototyping hardware and software solutions</li></ul><p>If you have an established track record in these areas and have exceptional skills to develop creative research agendas and execute projects successfully, you could be an extraordinary fit to join our team.<br> <br> #LI-JS1</p><p></p>\n </div>\n </div>\n\n <div>\n <div>\n Job Requirements\n <p></p><p><strong>What skills, experience, and qualifications do I need?</strong></p><ul><li>MS or PhD in machine learning, computer science, mathematics, physics, electrical engineering, or equivalent</li><li>Minimum of 5 years in Machine Learning</li><li>At least 1 years experience in Machine Learning Algorithms</li><li>Deep understanding of machine learning/deep learning</li><li>Understanding of CPU, GPU, and NN accelerator micro-architecture preferred</li><li>Strong programming skills</li><li>Scientific, data-driven, objective mindset</li></ul>Desired behaviors for this role:<p>Arm is proud to have a set of behaviors that reflect our visionary culture and guide our decisions, defining how we work together to defy ordinary and craft extraordinarily. These behaviors are assessed during the recruitment process:<br> <br> <strong>We Not I<br> </strong></p><ul><li>Take daily responsibility to make the Global Arm community thrive</li><li>No individual is responsible for the right answer. Brilliance is collective</li><li>Information is crucial, share it</li><li>Realize that we win when we collaborate — and that everyone misses out when we don’t</li></ul>Passion for Progress<br><ul><li>Our differences are our strength. Widen and mix up the pool of people you connect</li><li>Difficult things can take unexpected directions. Stick with itMake feedback positive and expansive, not negative and narrow</li><li>The essence of progress is that it can’t stop. Grow with it and be responsible for your own progress</li></ul><div>Be Your Brilliant Self<br><ul><li>Be quirky not egocentric</li><li>Recognize the power in saying ‘I don’t know\"</li><li>Make trust our default position</li><li>Hold strong opinions lightly</li></ul><br> <br> </div><p></p>\n </div>\n </div>\n\n\n <div>\n <div>\n Benefits\n <p>Your particular benefits package will depend on position and type of employment and may be subject to change. Your package will be confirmed on offer of employment. Arm’s benefits program provides permanent employees with the opportunity to stay innovative and healthy, ensure the wellness of their families, and create a positive working environment.</p>\n<ul><li>Annual Bonus Plan</li>\n<li>Discretionary Cash Awards</li>\n<li>401(k), 100% matching on first 6% eligible earnings</li>\n<li>Medical, Dental &amp; Vision, 100% coverage for employee only, shared cost for dependents</li>\n<li>Basic Life and Accidental Death and Dismemberment Insurance (AD&amp;D)</li>\n<li>Short Term (STD) and Long Term (LTD) Disability Insurance</li>\n<li>Vacation, 20 days per year with option to buy 5 more.</li>\n<li>Holidays, 13 days per year</li>\n<li>Sabbatical, 20 paid days every four-years of service</li>\n<li>Sick Leave, 7 days per year</li>\n<li>Volunteering, four hours per month (TeamARM)</li>\n<li>Office location dependent: café on site, fitness facilities, team and social events </li>\n<li>Additional benefits include: Flexible Spending Accounts for health and dependent care, EAP, Health Advocate, Business Travel Accident Program &amp; Commuter programs.\n<p></p>\nARM, Inc. (USA) participates in E-Verify. For more information, please refer to www.dhs.gov/E-Verify\n</li></ul> </div>\n </div>\n\n <div>\n <div>\nAbout Arm\n<p>\nArm® technology is at the heart of a computing and connectivity revolution that is transforming the way people live and businesses operate. From the unmissable to the invisible; our advanced, energy-efficient processor designs are enabling the intelligence in 86 billion silicon chips and securely powering products from the sensor to the smartphone to the supercomputer. With more than 1,000 technology partners including the world’s most famous business and consumer brands, we are driving Arm innovation into all areas compute is happening inside the chip, the network and the cloud.</p>\n<p>\nWith offices around the world, Arm is a diverse community of dedicated, innovative and highly talented professionals. By enabling an inclusive, meritocratic and open workplace where all our people can grow and succeed, we encourage our people to share their unique contributions to Arm's success in the global marketplace.</p>\n<p> </p></div>\n </div>\n\n <div>\n <div>\n About the office\n<p>\n The Arm Austin office employs staff from across all divisions of ARM and is considered the engineering hub for North America. Austin has the nickname of “Silicon Hills” thanks to the high number of tech companies in the area, and is also known as the “Live Music Capital of the World\". Events such as South by Southwest, Austin City Limits Music Festival and the F1 Grand Prix are but a few of the many activities that make Austin a top destination for both residents and travelers. </p>\n <div>\n <div>\n <strong> Austin, TX USA </strong>\n <br> Arm Inc.\n <br> Encino Trace\n <br> 5707 Southwest Pkwy\n <br> Bldg 1 Suite 100\n <br> Austin, TX. 78735\n <br>\n <br>\n See on Google maps\n </div>\n <div>\n \n </div>\n <div>\n \n </div>\n </div> </div>\n </div>\n\n\n</div>\n\n <div></div>"}