{"job title": "Data Scientist", "company": "Cardinal Solutions Group", "city state": "– 30009, GA", "rating": "4.2", "job description": "Job Description<div><strong>What Data Cardinal Scientists Do:</strong>\n<ul>\n<li>Work collaboratively with business stakeholders and team members to deliver value through advanced analytic and modeling techniques</li><li>Analyze, visualize, and model data using advanced statistical techniques and tools against structured and unstructured data</li><li>Perform machine learning, natural language, and statistical analysis, such as classification, regression, recommendation, sentiment analysis, and deep learning</li><li>Work with organizations to move from descriptive analytics to predictive and prescriptive analysis</li><li>Work with a variety of tools to implement advanced analytic solutions</li><li>Create quality deliverables to communicate technical solutions to appropriate audiences</li><li>Work with the sales team to create and deliver client proposals and demonstrations</li><li>Present to client, industry and internal peer groups</li><li>Provide mentoring and leadership to more junior team members</li>\n</ul>\n<strong>What We Look For at Cardinal:</strong>\n<ul>\n<li>High level understanding of advanced analytics techniques</li><li>Ability to quickly understand and adapt to new industries, situations, and business requirements</li><li>Development experience with R, Python, Azure Machine Learning, SAS, SPSS or related languages and tools.</li><li>Advanced knowledge of data analysis with transactional SQL</li><li>Knowledge of Big Data techniques and methodologies</li><li>Degree or equivalent experience in Statistics, Mathematics, Computers Science, or related fields</li><li>Eagerness to learn new tools and technologies</li><li>Strong communication skills</li></ul></div>\n<br>\nCompany Description<div>Cardinal delivers custom and out-of-the-box IT solutions to a wide variety of Fortune 500 companies.\n<br><br>\nOur offerings include Mobile &amp; Web Applications, Agile Enablement, UX Design, Business Intelligence, Data, Enterprise Social, Portals &amp; Collaboration, Web Experience Management, Project Management, and Requirements Analysis. Cardinal also provides strategic guidance, training, and mentoring for our clients.\n<br><br>\nWe hire full time, permanent employees and provide competitive benefits, training, career development and advancement opportunities, and interesting work in a wide range of cutting edge domains and disciplines. We have won the Best Places to Work award in several of the cities we serve.\n<br><br>\nCardinal has 8 locations in Cincinnati, Columbus, Charlotte, Raleigh, Tampa, Nashville, Atlanta, and St. Louis and employs over 550 full-time employees.</div>"}