{"job title": "Data Scientist", "company": "CircleUp", "city state": "– San Francisco, CA", "rating": "4.2", "job description": "<div><div>CircleUp is an online marketplace for private investing. Our mission is to help entrepreneurs thrive by giving them the resources and capital they need. We also provide investors access to a highly-curated set of investment opportunities and help those investors connect with the companies that meet their investment goals.</div> <br>\n<div>We are working on challenging problems in information retrieval and being able to develop an in-depth knowledge graph of all private companies. We are mining vast amounts of data to successfully rewrite the rules on how private companies are evaluated. You can find more information on what we are building in the blog post below</div> <br>\n<div>https://medium.com/@ryancaldbeck/announcing-the-launch-of-helio-b06458a27af#.8988ph8st</div><br>\n<div>We are looking for a data scientist who will be responsible for a variety of different projects, including data collection, data analysis, and algorithm development. You will be working closely with engineers, product managers, and business development to move our data infrastructure forward. Prior experience with economic research is a big plus.</div> </div><div><div>Responsibilities\n\n<ul>\n\n\n<ul>\n<li>Collect structured and unstructured data on private companies</li><li>Be able to prototype, clean and analyze new and existing data pipelines</li> <li>Build end to end algorithms for assessing early stage consumer companies for growth equity investments</li><li>Build reproducible backtests for proposed models / algorithms</li><li>Work cross functionally with key stakeholders in engineering, product, and business development to help decide &amp; prioritize what to build</li><li>Come up with creative ways to find and use data that significantly impacts our key business goals and metrics</li></ul>\n</ul>\n\n</div>\n</div><div><div>Requirements\n\n<ul>\n\n\n<ul>\n<li>Degree (B.S/ M.S./Phd) preferably in statistics, computer science, engineering, physical sciences, economics or related technical field</li><li>Strong background in Economics or economic research is a big plus</li><li>Prior experience as a quantitative researcher at a quantitative investment firm/hedge fund is a big plus</li><li>Excellent communication skills – Must be able to articulate their analysis and methodologies clearly and communicate insights in an easily accessible way to the team</li><li>Must be excited about working in a fast and changing environment where solutions have not been already defined</li> <li>Ability to write code in at least one scripting language, preferably Python</li><li>Experience with machine learning</li><li>Passion to have an impact outside of Silicon Valley on the world around us</li><li>Unassailable integrity</li><li>Huge horsepower and ability to solve difficult problems</li><li>Strong work ethic and courage to overcome meaningful obstacles</li></ul>\n</ul>\n\n</div>\n</div>"}