{"job title": "Data Scientist", "company": "EDO, Inc.", "city state": "– SF, , US", "rating": "NA", "job description": "<div>\nWho We Are\n<br><br>\n<strong>EDO is a data science software firm that develops analytics tools to make data accessible and actionable for the media and entertainment industry.</strong> Currently focused on film and TV, we work with many major movie studios and TV networks to help them forecast, market and distribute their content more effectively. Building from this strong base, we are growing into adjacent verticals.</div><br>\n<div>\nWe are a team of world-class engineers and data scientists backed by top leaders in entertainment and technology. Our co-founders and executive leadership have an established track record with other successful ventures.</div> <div>\nWhat You Will Do</div>\n\n<ul>\n\n<li>\nGenerate data-driven insights to help guide client decision-making</li>\n<li>\nDiscover novel applications of data within entertainment</li>\n<li>\nWork on a small team and take ownership of high impact projects</li>\n<li>\nWork in a fast paced environment with continuous deployment and rapid product iteration</li>\n<li>\nMeet and work directly with media and entertainment clients to understand their needs and translate into product solutions</li>\n<li>\nUnderstand how the futures of media, entertainment and advertising are being defined by the innovative applications of technology and data</li> \n<li>\nLearn about how a startup is built from an early stage</li>\n</ul>\n\n<div>\nWhat We Are Looking For</div>\n\n<ul>\n\n<li>\nSelf-driven individuals who take ownership of their work</li>\n<li>\nAbility to build products quickly and efficiently</li>\n<li>\nStrong understanding of data science practices and principles</li>\n<li>\nInterpersonal and communication skills to work on a small team</li>\n<li>\nWillingness to learn about our clients and their unique problems</li>\n<li>\nExperience with R or Python and comfort with databases</li>\n</ul>\n\n<div>\nBenefits</div>\n\n<ul>\n\n<li>\nEarly-stage equity and competitive salary</li>\n<li>\nMedical, dental, and vision insurance</li>\n<li>\nMeals and snacks during work</li>\n<li>\nMovie tickets, fitness discounts, commuter subsidies, and Apple hardware</li>\n</ul>\n\n<br>"}