{"job title": "Data Scientist", "company": "Expedia", "city state": "– USA - Washington - Bellevue", "rating": "3.8", "job description": "Expedia<br><br>Expedia’s Global online marketing team is looking for a highly motivated and analytical individual to lead and optimize key display, paid social, and customer acquisition campaigns. Your work will impact millions of our customers worldwide. The focus of your job will be ensuring operational excellence and optimizing marketing across various aspects of highly complex global advertising platforms and partners.\n<br><br>\nAs a Senior Marketing Analyst/Data Scientist, you will make a daily, direct and meaningful impact on Expedia’s P&amp;L. You will apply analytics, statistics and code to optimize marketing campaigns, testing, analyzing and reporting campaign performance, channel attribution, and influencing partners through data.\n<br><br>\nWe spend millions of dollars a year participating in highly dynamic and visionary display and paid social advertising platforms &amp; auctions. In addition to audience and bid economics, Display and Paid Social campaigns have dimensions of complexity in deriving value from the ad impression, across each ad creative lever (image, video, animation, ad copy, overlay), and sophisticated incrementality/LTV attribution models. Your real passion for campaign management, operations, analytics, and data science has the power to unlock tangible growth for our business. This is an exciting opportunity for someone passionate about data to improve effectiveness of a marketing function which runs on products, algorithms and engineering.\n<br><br>\nPrimary duties and responsibilities:\n<br><br>\nYou will...\n<ul>\n<li>Use statistics, distributions and confidence intervals to make campaign decisions based on click, impression, transaction, and email referral data.</li><li>Manipulate large data sets for business insights, implement solutions and marketing test hypotheses to improve channel operations and ROI</li><li>Troubleshoot and identify root cause of operational issues (e.g. data quality, critical process degradation)</li><li>Refine ad impression and delivery economics (including bidding algorithms), and ad creation processes using prediction modeling, optimization, and incrementality measurement</li><li>Manipulate large data sets for business insights and implement solutions to improve channel operations and increase return on investment.</li><li>Communicate complex analytical topics in a clean &amp; simple way to multiple partners and senior leadership (both internal &amp; external)</li><li>Automate and/or streamline repetitive processes to improve individual and team productivity</li><li>Detect changes in key market forces and apply analytics in order present tangible business problems/actions (e.g. seasonality, partner UI changes, auction changes, competitor actions, partner marketing strategy)</li><li>Collaborate with Partners, Product and Technical Teams to contribute to Social products and tools development (APIs, bidding tools, dashboards, etc.) and influence prioritization</li>\n</ul>\nRequired qualifications:\n<ul>\n<li>Bachelor’s degree in a quantitative field, such as Statistics, Engineering, Applied Mathematics</li><li>Minimum 5 years of relevant work experience or 3 years of relevant work experience with post grad degree</li><li>Strong quantitative, analytical and problem-solving skills, combined with a high level of initiative and ability to thrive in a multi-tasking, dynamic environment</li><li>Foundational statistics experience (e.g. t-tests, distributions)</li><li>Expertise with one or more scripting languages (e.g. Python, R)</li><li>Comfortable writing and working with complex queries in SQL/Hadoop</li><li>Shown success working cross-functionally</li>\n</ul>\nPreferred qualifications:\n<ul>\n<li>Master’s degree</li><li>Applied experience with data mining and analytic methods such as Clustering / Cluster Analysis, Factor Analysis, Regression Models, Logistic Regression, Predictive Modeling, optimization models</li><li>Experience in online marketing, e-commerce, or equivalent role with an analytical bend</li>\n</ul>\n\nExpedia is committed to creating an inclusive work environment with a diverse workforce. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. This employer participates in E-Verify. The employer will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS) with information from each new employee's I-9 to confirm work authorization."}