{"job title": "Physical Scientist", "company": "Frontier Technology, Inc", "city state": "– Beverly, Massachusetts", "rating": "4.4", "job description": "<div>\n<div> \n<div> <div>\n<div> 732-Physical Scientist</div> <div>\n<div> <strong>Position:</strong> 732-Physical Scientist</div> <div> <strong>Type:</strong> Full Time</div> <div> <strong>Location:</strong> Beverly, Massachusetts</div> </div></div><br>\n\n <div>\n<div>\n<div>\n<div> \n<div> LOG IN\n<br>\n<div>\n<div>\n<strong><div>Member ID:</div>\n<br>\n</strong>\n<br>\n<strong><div>Password:</div></strong></div><strong>\n</strong></div><strong>\n<br>\n</strong><br>\n\n<div> Click Here if you forgot your login information</div> </div> </div> </div>\n </div>\n</div><br>\n\n<div>Frontier Technology Inc.’s Sensor and Data Services group is a small, collaborative team of scientists working with space-based imaging and non-imaging EO-IR sensors. We have extensive experience in sensor requirements definition, sensor design, sensor calibration, data analysis, radiometric performance validation, physics-based and phenomenological simulation tools, and data management.\n<br><br>\nAs a physical scientist, you will work as part of a team of scientific analysts and software developers to develop novel approaches to object identification and tracking in image data, as well as inferring object characteristics or automatically identifying anomalies in telemetry data. You will be responsible for seeing the development of novel approaches end-to-end, from conception, to prototyping and testing approaches, reporting on results and guiding the development of deployable software. You will be working in a team that is responsible for sensor calibration, simulation of real sensor systems, systems engineering, and automation of data management.\n<br><br>\n<strong>Requirements</strong>\n\n<ul>\n\n\t<li>BS in Physics, Applied Mathematics, Engineering or a related discipline.</li>\n<li>Strong technical background in the physical sciences.</li>\n<li>Strong data analysis skills.</li>\n<li>Strong foundation in mathematics and particularly statistics.</li>\n<li>Scientific programming competency: C, C++, and/or Python.</li>\n<li>Excellent communication skills with the ability to communicate technical results to non-technical audiences such as customers.</li>\n<li>Must be a U.S. Citizen</li>\n<li>Must be able to obtain/maintain a U.S. government security clearance</li>\n<li>This position will require minimal travel.</li>\n</ul>\n<strong>Optional Experience:</strong>\n\n<ul>\n\n\t<li>Machine learning or statistical inference</li>\n<li>Multi-scale modeling, first principles and phenomenological simulation of physical systems</li>\n<li>Optical signatures modeling</li>\n<li>Remote sensing</li>\n<li>EO/IR detector science</li>\n<li>Technical work on a sensor program</li>\n<li>Experience working with the Department of Defense</li>\n</ul>\n\n</div>\n</div> </div> </div>\n\n<br>"}