{"job title": "Data Scientist", "company": "Infoscout", "city state": "– Chicago, IL, US", "rating": "4.8", "job description": "<strong>About This Role</strong>\n<br><br>\nOur receipt pipeline ingests over 500,000 shopping receipts a day, piping that data into the largest shopping behavior and product database in the US.\n<br><br>\nWe’re looking for a Data Scientist to help us turn that data into real actionable business insights. This person will work with our internal teams as well as our clients to not only make statistically relevant insights into past data, but also model projections into future behavior and sales. This is an ideal role for someone who loves using huge amounts of data, statistics, and models to tell a story and predict the future. Our clients are the biggest companies on the planet and you can help them decide how to market, advertise, and sell their products.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n\n <li>Predict future buyer behavior based on models built from past history, attitudes, and other highly descriptive variables from InfoScout's unparalleled dataset</li>\n\n<li>Own client projects that involve varying degrees of data modeling and analysis, e.g. sampling, post-stratification, custom reporting, segmentation, classification, predictive modeling</li>\n\n<li>Serve as an analytical lead for Sales &amp; Services, and provide support to ongoing Data Engineering, Consumer Apps, Product and Data Science initiatives where needed</li>\n\n<li>Investigate data quality issues, ensure our data meets certain metrics and standards</li>\n</ul>\n<strong>Requirements</strong>\n\n<ul>\n\n <li>4+ years of relevant experience</li>\n\n<li>Quantitative degree in Statistics, Mathematics, Economics, Engineering, or other related technical field</li>\n\n<li>Proficiency in R, Python, SQL</li>\n\n<li>Experience with applied statistical modeling, sampling methods and survey analysis</li>\n\n<li>Experience with leading multiple projects in parallel, while effectively prioritizing the demands of internal and external clients</li>\n\n<li>Strong ability to influence stakeholders by synthesizing findings into actionable recommendations</li>\n\n<li>Outstanding written/oral communication, consulting and analytical/problem solving skills</li>\n</ul>\n<strong>Exceptional candidates will have</strong>\n\n<ul>\n\n <li>Experience with analyzing data and building analytics across a variety of industries and subject areas</li>\n\n<li>Experience with developing, operationalizing and scaling complex statistical models and machine learning algorithms</li>\n\n<li>Strong proficiency with SQL and the ability to write complex queries against large databases</li>\n\n<li>Enthusiasm for identifying and pursuing new business and product opportunities</li>\n\n<li>Versatility, intellectual curiosity, and a passion for learning and growth</li>\n\n<li>Willing and able to wear multiple hats in a fast paced startup environment</li>\n</ul>"}