{"job title": "Data Scientist", "company": "Knowles", "city state": "– Itasca, IL, United States", "rating": "2.8", "job description": "<strong>SUMMARY DESCRIPTION:</strong>\n<br><br>\nKnowles seeks a motivated and creative individual to work in a fast-paced, market-oriented R&amp;D team environment developing MEMS technology for microphones, and related mobile platform applications. A strong preference will be given for advanced data mining, statistical analysis, developing data models and predictive modeling algorithms. Other desirable background experiences include machine algorithms, failure prediction, DOE setup and data analysis. Candidate will be expected to act as expert to ensure requirements are effectively captured, documented and implemented for maximum effectiveness through implementation of statistical/mathematical models and analysis.\n<br><br>\n<strong><u>SPECIFIC DUTIES AND RESPONSIBILITIES</u></strong><strong>:</strong><ul>\n<li>Leading development of predictive analytics techniques leveraging both repeatable patterns in data and discovering new patterns that reduce cost, increase performance, and improve reliability for microphones.</li><li>Access, analyze and transform large product performance and process data in the semiconductor/MEMS and electronic manufacturing environment.</li><li>Collaborate with process and design engineering team to understand key data management and analytics opportunities and devise data-driven solutions</li><li>Define data structures, evaluate data quality, perform appropriate data analyses using software such as JMP, Minitab, R, Python and MATLAB.</li><li>Determine relationships of different metrics measured and process steps to identify the right features for a given analytical model</li><li>Prototype creative solutions quickly, and be able to lead others in crafting and implementing superior technical vision.</li>\n</ul>\n<strong><u>POSITION REQUIREMENTS</u></strong><strong>:</strong>\n<ul>\n<li>Masters in Electrical Engineering, Physics, Applied Mathematics, Statistics or a related field (Ph.D preferred)</li><li>5 years experience within electronics manufacturing, semiconductor or MEMS related field desired</li><li>Experience with database, data structure, analytics, data science with SQL and relational databases knowledge</li><li>Familiarity with statistical analysis software such as JMP, SAS, Minitab will be beneficial.</li><li>Familiarity with scripting languages; including python and JMP JSL is preferred</li><li>Experience with unstructured &amp; semi-structured data sources and requisite processing tools.</li><li>Understanding of MEMS/Semiconductor and customer fab process flows and hands on process engineering experience</li><li>Solid fundamentals, knowledge of machine learning algorithms, classification, clustering, regression, Bayesian modeling, probability theory, algorithm design, linear algebra, partial differential equations, Bayesian statistics, and information retrieval.</li><li>Experience with advanced data mining, predictive modeling algorithms, developing data models, reinforced, supervised and unsupervised learning methods, linear classifiers, Markov models, Bayesian networks and clustering techniques strong plus.</li><li>Experience with electronics assembly flow and test process a plus</li><li>Reliability modeling experience, including methods of analyzing censored data a plus</li><li>FMEA and 8D experience a plus</li><li>Desirable to have strong background in communication, negotiation, DOE setup, data analysis and reporting</li><li>Excellent oral and written communication skills are required</li>\n</ul>\n<strong><u>SOFT SKILLS</u></strong><strong>:</strong>\n<ul>\n<li>Meticulous attention to detail and excellent electronic record keeping skills</li><li>Ability to think critically about the relationships of different metrics measured and process steps to land the right features for a given model</li><li>Demonstrated ability to acquire, prepare, and characterize real-world data for subsequent analysis;</li><li>Prototype creative solutions quickly, and be able to lead others in crafting and implementing superior technical vision.</li><li>Highly motivated, team player with an entrepreneurial spirit, self-starter with willingness to learn, master new technologies and clearly communicate results to technical and non-technical audience.</li><li>Ability to quickly understand challenging business problems, find patterns and insights within structured and unstructured data.</li>\n</ul>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}