{"job title": "Data Engineer", "company": "Northwestern Mutual", "city state": "– Franklin", "rating": "3.8", "job description": "<strong>At Northwestern Mutual, we believe relationships are built on trust.</strong> That our lives and our work matter. These beliefs launched our company nearly 160 years ago. Today, they're just a few of the reasons why people choose to build careers at Northwestern Mutual.\n<br><br>\n<strong>We're strong and growing.</strong> In a company with such a long and storied history, this may be the most exciting and important time to be a part of Northwestern Mutual. We're strong, innovative and growing.\n<br><br>\n<strong>We invest in our people.</strong> We provide opportunities for employees to grow themselves, their career and in turn, our business.\n<br><br>\n<strong>We care.</strong> We make a positive difference in our communities. Nationally, thousands have benefitted from our support of research and programs to fight childhood cancer. Each year, our Foundation, employees and financial representatives donate time, talent and financial support to causes they're passionate about.\n<br><br>\n&nbsp;\n<br><br>\n<em>We are an equal opportunity/affirmative action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender identity or expression, sexual orientation, national origin, disability, age or status as a protected veteran, or any other characteristic protected by law.</em>\n<br><br>\n&nbsp;\n<br><br>\n<strong>What's the role?</strong>\n<br><br>\nAccesses, combines, synthesizes, and stores data from a wide range of internal and external sources for analytical purposes. Works side-by-side with data scientists and senior data engineers to assemble datasets required to develop advanced analytical models. Works side-by-side with analysts to derive business insights from data. Works to expand the company’s analytical data universe.\n<br><br>\n&nbsp;\n<br><br>\n<strong>Accountabilities:</strong>\n<ul>\n<li>Achieves business value by translating raw data into usable business information.</li><li>Understands Northwestern Mutual data and business, able to incorporate business understanding into design and approach to achieve current value and prepare for future benefit.</li><li>Documentation, communications, reporting, risk identification, accountability, ownership, collaboration</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>Bring Your Best! What this role needs:</strong>\n<ul>\n<li>2+ years of experience in data engineering</li><li>Data systems experience, designing and building larger scale data engineering solutions</li><li>Able to design and build a data model, including both relational and dimensional models</li><li>Exceptionally strong SQL skills required.</li> <li>Experience with python, java a plus.</li><li>ETL tool experience required, with a strong preference for MSBI</li><li>Can execute alone but is an awesome team player</li><li>Experience with different engineering eco systems (Hadoop, Netezza, relational, big data, complex data, mainframe, redshift, AWS) a plus</li><li>Industry background a plus</li><li>Cloud experience a plus</li><li>Analytics understanding is a must, past experience a plus</li><li>Big picture approach a plus</li><li>Consulting experience a plus – role includes client-facing meetings and communication</li><li>Project management experience a plus</li><li>Relevant bachelor degree a plus</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>Req ID:</strong> 23449\n<br>\n<strong>Position Type:</strong> Regular Full Time\n<br>\n<strong>Education Experience:</strong> Bachelor's Desired\n<br>\n<strong>Employment Experience:</strong> 3-5 years\n<br>\n<strong>Licenses/Certifications:</strong> \n<br>\n<strong>FLSA Status:</strong> Exempt\n<br>\n<strong>Posting Date:</strong> 08/30/2018"}