{"job title": "Data Sciences Intern", "company": "Publishers Clearing House", "city state": "– Jericho, US-NY", "rating": "3.7", "job description": "Publishers Clearing House (PCH) is currently looking for a talented, self-motivated <strong>Data Sciences Intern</strong> to support our Analytical Sciences team!\n<br><br>\n<strong>Responsibilities include but are not limited to:</strong>\n\n<ul>\n<li>Design and implement predictive models</li>\n\n<li>Utilize various statistical and machine learning techniques to optimize monetization across all PCH divisions</li>\n\n<li>Responsible for data preparation for model inputs, model scoring and model validation</li>\n\n<li>Various projects as needed</li>\n</ul>\n<strong>Required Skills/Experience:</strong>\n\n<ul>\n<li>College student pursuing a Bachelor's degree in Statistics or a related field</li>\n\n<li>Experience in creating regression models preferred</li>\n\n<li>Experience in machine learning algorithms such as Decision Tree, Neural Network and SVM preferred</li>\n\n<li>Knowledge of SAS and SQL</li>\n\n<li>Good communication skills</li>\n\n<li>Able to collaborate with various functions</li>\n</ul>\nPublishers Clearing House (PCH), headquartered in Jericho, NY with offices in New York City, NY, Portland, ME, Boston, MA and Chicago, IL is a leading interactive media Company offering a broad range of products, digital entertainment and services to consumers as well as customized solutions for advertisers. Our continued success in today’s new digital publishing environment is built on PCH’s unique, free-to-play, chance-to-win value proposition, which enables individually personalized offers based on the trusted first party relationship we maintain with millions of consumers and is fueled by the excitement of the Publishers Clearing House brand.\n<br><br>\n<strong><em>Join our winning team and apply today!</em></strong>\n<br><br>\n<em><strong>This is a Long Island, NY based position. Candidates must reside in the tri-state area.</strong></em>\n<br><br>\n<em><strong>PCH is an Equal Opportunity Employer</strong></em><br><br>Required Skills\n<br><br>\n<strong>Required Experience</strong>\n<br><br>\nJob Location\n<br>\nJericho, US-NY\n<br>"}