{"job title": "Image Scientist", "company": "Riverside Research Institute", "city state": "– Dayton OH", "rating": "4.1", "job description": "<div>\nReturning Candidate? Log back in to the Career Portal and click on 'Job Browsing/History' and find the job you're looking for.</div><br>\n\n<div> 2018-069-INT: Image Scientist</div>\n<br>\n<div> \n<div> Directorate Intelligence &amp; Defense Solutions</div> <div> Location Dayton Research Center-OH</div> </div><div> *Riverside Research is seeking a full-time Image Scientist for an opportunity at Wright-Patterson AFB, OH. This position requires a Top Secret/SCI.\n<br><br>\nThe Intelligence and Defense Solutions (IDS) Business Unit within Riverside Research is comprised of exceptionally talented and dedicated individuals, working as a team, who assist IC and DoD customers in accomplishing their critical missions. Within IDS, we provide services spanning program management and advocacy, systems engineering, research and development, intelligence analytics, mission planning, and software engineering. IDS currently assists three national intelligence agencies, three U.S. Service Intelligence Centers, and a variety of additional clients serving national and tactical intelligence, surveillance and reconnaissance missions.</div> \n<br>\n<div><strong>Job Responsibilities:</strong></div><div> •\tPerform technical analysis of remote sensing data to investigate multispectral image performance characteristics\n\n\n<ul>\n<li>Support GEOINT analysis and operation support for data processing, data analysis and analytic support</li>\n<li>Provide subject matter expertise to image quality assessments and investigate and diagnose data anomalies</li>\n<li>Prototype engineering scripts to assist with data investigations and novel processing techniques in line with data processing requirements and goals established by the customer</li>\n<li>Create and edit documentation (e.g. CONOPs and Users’ Guides) for new applications</li>\n<li>Other duties as assigned</li></ul></div> \n\n\n<div><strong>Qualifications:</strong></div><div> •\tMaster's degree in Physics, Image Sciences, Astronomy, Geography or other strongly related degrees to the remote sensing area\n\n\n<ul>\n<li>8+ years’ experience in Image Science, Engineering or Physics</li>\n<li>Experience with coding in Matlab or Python for the processing of remote sensing data</li>\n<li>Strong Communication skills (written and verbal)</li>\n<li>Self-motivated, independent, detail oriented and responsible team player who exhibits exceptional relationship management skills</li>\n<li>Open to occasional travel</li>\n<li>Current Top Secret clearance</li>\n</ul>\n\n<strong>Desired:</strong>\n\n\n<ul>\n<li>PhD in engineering, physics, meteorology or related technical field</li>\n<li>12+ years’ experience in Image Science, Engineering or Physics</li>\n<li>Strong understanding of OPIR sensor capabilities, dataflow and phenomenology</li>\n<li>Intelligence production experience</li>\n<li>Professional Certifications, (e.g. PMP, INCOSE CSEP, ISTQB, DoDAF, or Security+)</li>\n<li>Experience with needs documentation, e.g. CONOPs, use cases, user story boards</li></ul></div> <div> Riverside Research strives to be one of America’s premier providers of independent, trusted technical and scientific expertise. As we continue to add experienced, technically astute staff, we are looking for highly motivated, talented team members that can help our DoD and Intelligence Community (IC) customers continue delivery of world class programs. As a not-for-profit, technology-oriented Defense Company, we believe service to customers and support of our staff is our mission. Our goal is to serve as a destination company by providing an industry-leading, positive, and rewarding employee experience for all who join us. We aspire to be a valued partner to our customers and to earn their trust through our unwavering commitment to achieve timely, innovative, cost-effective and mission-focused solutions.\n\n\nAll positions at Riverside Research are subject to background investigations. Employment is contingent upon successful completion of a background investigation including criminal history and identity check.\n<br><br>\nThis contractor and subcontractor shall abide by the requirements of 41 CFR 60-741.5(a). This regulation prohibits discrimination against qualified individuals on the basis of disability, and requires affirmative action by covered prime contractors and subcontractors to employ and advance in employment qualified individuals with disabilities.\n<br><br>\nThis contractor and subcontractor shall abide by the requirements of 41 CFR 60-300.5(a). This regulation prohibits discrimination against qualified protected veterans, and requires affirmative action by covered contractors and subcontractors to employ and advance in employment qualified protected veterans.</div>\n<br>\n<div> Apply Now</div>"}