{"job title": "Data Scientist", "company": "RMS Computer Corporation", "city state": "– Irving, Texas", "rating": "2.9", "job description": "Our client, a leading global financial services company, has approximately 200 million customer accounts and does business in more than 140 countries. They provide consumers, corporations, governments and institutions with financial products and services, including consumer banking and credit, corporate and investment banking, securities brokerage, transaction services, and wealth management.\n<br><br>\nSeeking to hire on contract basis a Data Scientist with hands on experience in predictive analytics, statistical tools and big data tools.\n<br><br>\n<strong>Role Description:</strong>\n<br><br>\nApply scientific data collection and interpretation activities and ensure collected data is relevant and exhaustive.\n<br>\nIdentify, analyze and interpret trends or patterns in complex data sets.\n<br>\nManipulate, extract, process, and analyze large data sets to develop insights and surface implications using statistical techniques.\n<br>\nCreate visualizations for consumption by varied audiences to convey understandable insights.\n<br>\nDefine data store architecture.\n<br><br>\nRequired Technical Skills\n<br><br>\nSQL, no-SQL, R or Python,\n<br>\nHadoop, Spark, Storm, Hive\n<br>\nFrameworks/libs: NumPy, SciPy, Pandas, numpy, Matplotlib/Plotly, Statsmodels\n<br><br>\nDesirable Technical Skills\n<br><br>\nElastic Stack, Git\n<br>\nFrameworks/libs: TensorFlow, Keras, NLTK, Gensim, Scikit-learn\n<br>\nFamiliarity with HTTP and invoking web-APIs\n<br><br>\nPersonal Skills\n<br><br>\nExperienced in managing work with distributed teams.\n<br>\nExperience working in SCRUM methodology.\n<br>\nProven sense of high accountability and self-drive to take on and see through big challenges.\n<br>\nConfident, takes ownership, willingness to get the job done.\n<br>\nExcellent verbal communications and cross group collaboration skills.\n<br><br>\nTotal Experience Required\n<br><br>\n2+ years of relevant experience.\n<br>\nNLP exposure beneficial.\n<br><br>\n<strong>18-01351</strong>\n<br><br>\nPlease see our complete list of jobs at:\n<br>\nwww.rmscorp.com"}