{"job title": "Data Scientist", "company": "Rose International", "city state": "– Creve Coeur, MO", "rating": "4.4", "job description": "<div>Position Title: Data Scientist</div> \n<br>\n<div>Position Number: 294623</div>\n<br>\n<div>Location: Creve Coeur, MO</div><br>\n\n<div><strong>Desired Skill Set:</strong></div><div> Python, R Programming, Research, Statistics</div><br>\n\n<div><strong>Position Description:</strong></div><div> **C2C and STEM-OPT are not available**\n\n\n<ul>\n<li>*Only U.S. Citizens and those authorized to work in the U.S. can be considered as W2 candidates.**</li>\n</ul>\n\nLocation: Creve Coeur, MO 63141\n<br>\nDuration: 6 months\n<br><br>\nData Scientist\n<br><br>\nDesign, implement and optimize algorithms for unsupervised and supervised learning based on structured and unstructured data. Develop powerful business insights from social, marketing, industrial data and public policy using advanced machine learning techniques. Work closely with the software engineering team to productize analytic software. Collaborate with system integration and data warehouse engineers on data extraction and data cleaning. Work in a highly interactive, team-oriented environment.\n\n\n<ul>\n<li>MUST HAVES: Solid research background, good analytics and coding capability, agile, and good communication skills. Coding with R or Python, knowledge in statistics, familiar with environmental data. Requires PhD.</li></ul></div>\n\n\n<div> #CBRose#</div>\n<br>\n<div> \n<div>\nSend me a reminder to complete this application</div>\n </div><br>\n\n<div>\n<strong>Rose International is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender (expression or identity), national origin, arrest and conviction records, disability, veteran status or any other characteristic protected by law. Positions located in San Francisco and Los Angeles, California will be administered in accordance with their respective Fair Chance Ordinances.\n<br><br>\nRose International has an official agreement (ID #132522), effective June 30, 2008, with the U.S. Department of Homeland Security, U.S. Citizenship and Immigration Services, Employment Verification Program (E-Verify).\n<br><br>\n(Posting required by OCGA 13/10-91.)</strong></div>\n<br>"}