{"job title": "Data Scientist", "company": "StrategyWise", "city state": "– Atlanta, GA", "rating": "5.0", "job description": "StrategyWise is a global provider of data science and artificial intelligence solutions.\n<br><br>\nWe are seeking a Data Scientist with Machine Learning and AI experience. Candidates who are an excellent fit for this job possess a combination of business acumen, analytical problem-solving skills, programming andstatistical computing, and are adept at learning new skills and grasping complex concepts. This position will challenge you mentally. If you are willing to go the extra mile, learn new skills and completely dedicate yourself to the data science craft, this job is for you. If you want to be on the cutting edge of machine learning, big data and artificial intelligence, and you are willing to invest in yourself and our team, you will find this position immensely rewarding. You will work closely with clients, data scientists, project managers and IT engineers to transform data into knowledge that can be used to make sound organizational, strategic, product, and business decisions.\n<br><br>\n<strong>Responsibilities</strong>: <strong>(</strong>Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions)\n\n<ul>\n<li>Interfacing with client stakeholders to accurately understand and define business challenges and requirements and translate them into analytical solutions</li>\n\n<li>Extracting, exploring, and wrangling data from various sources/formats to appropriately prepare data for further analyses</li>\n\n<li>Applying business-relevant statistical, machine learning, or deep learning approaches to solve business challenges</li>\n\n<li>Programming data science applications that directly solve business challenge, considering infrastructure and end-use constraints</li>\n\n<li>Consulting on and assisting with deployment of end-to-end data science applications</li>\n\n<li>Collaborating with StrategyWise team members to learn and share data science best practices</li>\n</ul>\n<strong>Qualifications</strong>\n\n<ul>\n<li>Strong written, oral and visual communication skills</li>\n\n<li>Bachelor’s degree or other advanced degree in Applied Mathematics, Statistics, Computer Science, Software Engineering or a related analytical field</li>\n\n<li>3+ years experience applying quantitative methods to extract value from complex datasets</li>\n\n<li>2+ years consulting experience with solid track record of problem solving and business wins</li>\n\n<li>Proven programming proficiency in Python and/or R</li>\n\n<li>Portfolio showcasing completed, original projects leveraging the latest ML and AI (Deep Learning) methodologies</li>\n</ul>\n<strong>Preferred</strong>\n\n<ul>\n<li>Robust digital portfolio of advanced data science projects</li>\n\n<li>Deep Learning specialization (NLP, Computer Vision, Sequence-to-Sequence, Deep Reinforcement Learning)</li>\n\n<li>Expertise in data science DevOps (Code Testing, Git Version Control, etc.)</li>\n\n<li>Active in data science community showcasing thought-leadership on digital and offline (meetup) forums</li>\n\n<li>Published Blogs, Tutorials, or Research Papers</li>\n</ul>"}