{"job title": "Senior Data Analyst", "company": "Stratonex", "city state": "– Princeton, NJ", "rating": "NA", "job description": "We are looking for a Senior Data Reporting Analyst to join a growing team. You will be responsible for producing reports from various sources to provide the department /division with actionable information or business intelligence. Working with marginal oversight, the incumbent is responsible for performing complex research, analysis, and reporting of network utilization, cost containment and key operational information. This is a senior level position. <br><br> <strong>Responsibilities:</strong>\n<ul>\n<li>Design, Develop and validate Healthcare payer plan operations reports and dashboards</li>\n<li>Mentor and train more junior analysts.</li>\n<li>Evaluate data and report findings for accuracy, completeness, intent, and scope, etc.</li>\n<li>Determine or agree upon deliverables with customer, as well as determining the resources necessary to meet those deliverables.</li>\n<li>Determine resources necessary (time, headcount, external resources) to meet deliverables,</li>\n<li>Act as liaison with IT /vendor and customer and initiate /implement project plan for requests.</li>\n<li>Perform appropriate analysis on data: forecasting, modeling, regression.</li>\n<li>Mine data from appropriate system and perform appropriate analysis on data.</li>\n<li>Present data and provide feedback to client/customer; making recommendations where appropriate.</li>\n<li>Develop relationships with subject matter experts (SME).</li>\n<li>Seek and adopt best practices in data reporting.</li>\n<li>Perform other relevant tasks as assigned by management.</li>\n</ul>\n<strong>Requirements</strong>\n<ul>\n<li>Bachelor's degree required.</li>\n<li>Minimum 3+ years of experience in health insurance.</li>\n<li>Requires 6+ years of professional experience.</li>\n</ul>\n<strong>Knowledge:</strong>\n<ul>\n<li>Must have strong knowledge of SAS and SQL systems.</li>\n<li>Must have healthcare claims processing or claims management experience.</li>\n<li>Prefer 5 years data reporting experience including solid query development and ad hoc reporting.</li>\n<li>Strong PC skills.</li>\n<li>Prefer strong database management skills.</li>\n<li>Understanding interdependencies among data</li>\n<li>Must have strong knowledge of SQL preferably on Microsoft SQL Server platform</li>\n<li>Must have advance level skills in developing solutions/report using SQL Server Integration Service (SSIS) and SQL Server Reporting Service (SSRS).</li>\n<li>Must have data reporting and analysis experience with healthcare medical claims data</li>\n<li>Experience in data reporting from Facets Claims platform is preferred</li>\n<li>Experience in using SAS Enterprise Guide is preferred</li>\n</ul>"}