{"job title": "Operating Room Data Analyst", "company": "UCHealth", "city state": "– Aurora, Colorado", "rating": "3.8", "job description": "<div> <div><strong>Facility:</strong></div> University of Colo Hospital</div> <div> <div><strong>Department:</strong></div> OR Administration</div> <div> <div><strong>Schedule:</strong></div> Full-time</div> <div> <div><strong>Shift:</strong></div> 1st Shift - Days</div> <div> <div><strong>Scheduled Days &amp; Hours:</strong></div> M-F, various hrs</div> <div> <div><strong>Requisition number:</strong></div> 79883</div>\n<br><strong>Data Analyst</strong>\n<br><br>\nPerforms and reports advanced data analysis\n<br><br>\n<strong>At UCHealth, we do things differently</strong>\n<br><br>\nWe believe in something different: a focus on the individuality of every person. In big ways and small, we exist to improve the extraordinary lives of all those we serve. As Colorado's largest and most innovative health care system, we as a team deliver on the commitment to provide the best possible experience for our patients and their families. We foster a true human connection and give people the freedom to live extraordinary lives. A career at UCHealth is more than a job, it's a passion.\n<br><br>\n<strong>Job Duties</strong>\n\n<ul>\n\n <li>Develops and implements tools for data collection, analysis, reporting and presentation</li>\n\n<li>Works collaboratively with colleagues and business customers to develop and track performance metrics, including quality and cost savings</li>\n\n<li>Performs routine and ad-hoc reporting to evaluate performance and to identify opportunities for process improvements</li>\n</ul>\n· Provides support with implementing system analysis, updates, and changes\n<br><br>\n<strong>Requirements</strong>\n\n<ul>\n\n <li>Associate's degree in related field. Preferred: Bachelor's degree in a related field.</li>\n\n<li>3 years of data analysis work experience</li>\n</ul>\n<br>\nDue to Point of Care Testing duties associated with this position, upon hire, a copy of highest level of education (diploma, degree, or transcripts) would be required to present to the hiring manager. If this is available to you at this time, please attach it with your resume in one document.\n<br><br>\nGoing beyond quality requires the perfect balance of talent, integrity, drive and intellectual curiosity. We are looking for individuals who recognize, like us, that the world of medicine is ever-changing and are motivated to do what is right, not what is easy. We support creativity and curiosity so that each of us can find the extraordinary qualities within ourselves. At UCHealth, we'll do everything in our power to make sure you grow and have a meaningful career. There's no limits to your potential here.\n<br><br>\n<strong>Be Extraordinary. Join Us Today!</strong>\n<br><br>\nUCHealth recognizes and appreciates the rich array of talents and perspectives that equal employment and diversity can offer our institution. As an affirmative action/equal opportunity employer, UCHealth is committed to making all employment decisions based on valid requirements. No applicant shall be discriminated against in any terms, conditions or privileges of employment or otherwise be discriminated against because of the individual's race, creed, color, religion, gender, national origin or ancestry, age, mental or physical disability, sexual orientation, gender identity, transgender status, genetic information or veteran status. UCHealth does not discriminate against any \"qualified applicant with a disability\" as defined under the Americans with Disabilities Act and will make reasonable accommodations, when they do not impose an undue hardship on the organization."}