{"job title": "Contract Scientist, Bioanalysis", "company": "Alkermes", "city state": "– Waltham, MA", "rating": "4.3", "job description": "<div><div><strong>\n<br>\nContract Scientist, Bioanalysis</strong><br>\n\n<div>\n<div>\nJob ID\n<br><br>\n<strong>8904</strong>\n</div><br>\n\n<div>\nLocation\n<br><br>\n<strong>\n<br>\nWaltham, MA</strong>\n</div><br>\n\n<div>\nField Locations\n</div>\n</div>\n</div>\n\n<br>Apply Now</div><br>\n\n<div>\n<div>\n</div><br>\n\n<div>\n<div>\n<div><strong>Experience Level:</strong></div><div><strong>Not Applicable</strong></div></div>\n</div>\n<br><strong>Company Overview</strong>\n<br><br>\nAlkermes plc is a fully integrated, global biopharmaceutical company developing innovative medicines for the treatment of central nervous system (CNS) diseases. The company has a diversified commercial product portfolio and a substantial clinical pipeline of product candidates for chronic diseases that include schizophrenia, depression, addiction and multiple sclerosis. Headquartered in Dublin, Ireland, Alkermes plc has an R&amp;D center in Waltham, Massachusetts; a research and manufacturing facility in Athlone, Ireland; and a manufacturing facility in Wilmington, Ohio. For more information, please visit Alkermes’ website at www.alkermes.com .\n<br><br>\nWe are seeking a candidate with hands-on experience running in vitro DMPK assays and analyzing primarily in vivo samples (drug and metabolites in biological fluids) by LC-MS/MS methods, with particular emphasis to bioanalytical work, i.e. in vivo PK studies. The candidate will be involved in experimental research, data analysis, laboratory maintenance, protocol review, and in working with other team members to determine a course-of-action for meeting project milestones. The candidate will analyze in vitro and in vivo DMPK studies work to support our drug discovery and development projects. He/she will also interpret in vitro DMPK and bioanalytical findings, write reports, and communicate with scientists. A certain number of study submissions (bioanalytical work) to CROs are expected.\n<br><br>\n<strong>Duties and Responsibilities:</strong>\n<br><br>\nThe candidate will be responsible for developing LC-MS/MS methods needed to analyze in vivo biological fluids (e.g. plasma, blood, urine) and tissue (e.g. muscle, brain homogenates) samples. Submission of bioanalysis studies to external CROs, when needed, will fall under the responsibilities of the candidate as well as the data analysis to assure integrity prior to PK analysis performed by PK scientists.\n<br><br>\n<strong>Requirements:</strong>\n<br><br>\nA BS/MS degree with 4 – 8 years of experience (or Ph.D. with 1 – 3 years) in industry is required, with hands-on experience in the development of LC/MS/MS and other chromatography-based assays for the quantitation of small molecules and identification of metabolites from diverse biological matrices such as plasma and tissues. Sample preparation solid/liquid extraction experience is required. GLP experience is not required but it would be a plus.\n<br><br>\nUnderstanding of “fit-for-purpose” assay development and support is also a requirement. Ability to work with ELN (electronic notebook), web-based applications, WinNonlin and other information technology tools is required. Experience in developing and qualifying internal methods and transferring to CROs for late-stage development support is a plus.\n<br><br>\nMust be able to work independently and should be also able to interact with chemists, PK and other bioanalytical scientists as well as external scientists at CROs. The role requires confidence and expertise with data handling, chromatographic and MS skills. Hands-on experience running and maintaining, among others, ABSCIEX 4000 and ABSCIEX QTrap 5500, mass spectrometry as applied to biological samples is highly desirable.\n<br><br>\nExperience with the utilization and implementation of LIMS systems and automation of data reporting is highly desired.\n<br><br>\nStrong scientific organization and problem-solving skills are required.\n<br><br>\nAlkermes, Inc. is an equal employment opportunity employer and does not discriminate against any applicant because of race, creed, color, age, national origin, ancestry, religion, gender, sexual orientation, gender expression and identity, disability, genetic information, veteran status, military status, application for military service or any other class protected by state or federal law.\n<br><br>\n#LI-AB1</div>"}