{"job title": "Fall Internship - Data Engineer", "company": "Amazon", "city state": "– US, WA, Seattle", "rating": "3.8", "job description": "Are you passionate about data? Does the prospect of dealing with massive volumes of data excite you? Do you want to build data engineering solutions that process billions of records a day in a scalable fashion using big data technologies? Do you want to create the next-generation tools for intuitive data access and advance analytics?\n<br><br>\nAs a Data Engineer, you should be familiar with data warehousing technical components (e.g. Data Modeling, ETL, Performance Tuning, Data Extraction, SQL and Reporting), Infrastructure (e.g. hardware and software) and their integration. You should have good understanding of enterprise level data warehouse solutions using multiple platforms (RDBMS, Columnar, Cloud). You should be able to create and manage business use of extremely large datasets. You should have excellent business and communication skills to be able to work with business owners to develop and define key business questions, and to build data sets that answer those questions. The individual is expected to be able to build efficient, flexible, extensible, and scalable ETL and reporting solutions. You should be enthusiastic about learning new technologies and be able to implement solutions using them to provide new functionality to the users or to scale the existing platform. Excellent written and verbal communication skills are required as the person will work very closely with diverse teams. Having strong analytical skills is a plus. Above all, you should be passionate about working with huge data sets and someone who loves to bring datasets together to answer business questions and drive change.\n<br><br>\nOur ideal candidate thrives in a fast-paced environment, relishes working with large transactional volumes and big data, enjoys the challenge of highly complex business contexts (that are typically being defined in real-time), and, above all, is a passionate about data and analytics.\n<br>"}