{"job title": "Principal Data Scientist - Prime Video Personalization", "company": "Amazon", "city state": "– US, WA, Seattle", "rating": "3.8", "job description": "Principal Data Scientist Prime Video Personalization\n<br><br>\nPrime Video is changing the way people watch movies and TV shows, with hundreds of thousands of titles available to stream and download on all your favorite devices.\n<br><br>\nThe Prime Video Personalization (AVP) team is looking for a Data Scientist who will analyze customer behavior, title catalog information and Personalization algorithms and provide direction to the Personalization Product and Engineering teams, to help customers connect with content they want to watch.\n<br><br>\nYou will work closely with Product Managers and SDMs but also ML scientists, economists and finance within AVP and the wider Digital organization. You will influence how AVP targets and measure success.\n<br><br>\nAs a member of the Product Intelligence team (within AVP) you will spend your time as a hands-on Data Scientist practitioner and thought leader. You will source much of your own data for modelling, and guide junior analysts in data modeling and provide support to the models and insights you develop. This role requires you to:\n<br>\n· Analyze and solve business problems at their root, stepping back to understand the broader context.\n<br>\n· Disambiguate problems and develop new metrics for identifying and tracking success\n<br>\n· Utilize database technologies, including SQL, ETL, EMR, and Redshift to shape data and statistical modelling packages like R and python to build customer models.\n<br>\n· Establish scalable, efficient, automated processes for large scale data analyses, model development, model validation, and model implementation.\n<br>\n· Manage and execute entire projects or components of large projects from start to finish including project management, data gathering and manipulation, synthesis and modeling, problem solving, and communication of insights and recommendations.\n<br><br>\nAmazon.com is an Equal Opportunity-Affirmative Action Employer Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation\n<br><br>"}