{"job title": "Response Support Scientist - Researcher", "company": "Battelle", "city state": "– Fort Detrick, MD", "rating": "2.8", "job description": "Battelle is guided by a founding mission. We invest our knowledge, talents and resources, helping our customers achieve their most important goals. We apply scientific rigor and creativity, succeeding where others may fail, and we invest in our communities, making the world better for generations to come. All of us share a common purpose: to solve the greatest challenges of today and tomorrow.\n<br><br>\nOur 22,000 employees work at the forefront of scientific innovation to tackle critical challenges in security, human health, manufacturing, energy and environmental management. Battelles work is grounded in the belief that science, technology and a passion for excellence can make industries more competitive and the world a better place.\n<br><br>\nWe are currently seeking a <em><strong>Response</strong> </em><strong><em>Support Scientist</em></strong> This position located in <strong><em>Frederick, Maryland.</em> </strong><em>This position will require deployment to foreign locations on a rotational basis.</em><br>\n<div>\nJOB DESCRIPTION\n<br><br>\nThe <strong>Support Researcher</strong> will monitor disease states in animal models, as well as perform microbiological and virology-based assays supporting research studies investigating host/pathogen interactions of high consequence viral pathogens at the <strong>National Institutes of Allergy and Infectious Diseases (NIAID) Integrated Research Facility located at Fort Detrick in Frederick, Maryland</strong>. The candidate will be involved in supporting foreign research activities by deploying to necessary locations and perform various molecular, virologic, microscopic and immunologic assays. He/she will be responsible for proficiency in the use and maintenance of all equipment and procedures for the assigned area with ability to cross-train in related support areas.\n<br><br>\nMajor Responsibilities\n\n<ul>\n\n\t<li>Support Foreign Research Activities. Requires deployments to foreign locations on a rotational basis.</li>\n<li>Performs assays and experiments in molecular biology to include nucleic acid extraction, PCR, real time PCR, cloning, plasmid preparation, mutagenesis, gel electrophoresis, and sequence analysis</li>\n<li>Performs transfections of eukaryotic or prokaryotic cells, confirmation of plasmid expression to include immunofluorescence assays, gel electrophoresis and western blot analysis.</li>\n<li>Performs in vitro transcription, protein production and purification, co-immunoprecipitation.</li>\n<li>Maintains cell cultures needed for specific experiments.</li>\n<li>ELISA assays and viral plaque assays</li>\n<li>Identifies and solves common problems relating to laboratory methodology, instrumentation and procedure under the direction of their supervisor.</li>\n<li>Participates in development of assays used in the laboratory, and training others on equipment and assays.</li>\n<li>Maintains adequate inventory of supplies as required by the department.</li>\n<li>Maintains a laboratory notebook and meets with supervisor to review data.</li>\n<li>Enters data into database adhering to specifications and support online protocols and amendments.</li>\n</ul>\nAdditional Skills:\n<br><br>\n<strong>General Lab Duties include:</strong>\n\n<ul>\n\n\t<li>General lab organization and maintenance.</li> \n\n<li>Maintain cell line, plasmid, freezer, and reagent inventories.</li> \n\n<li>Prepare packages for shipment; maintain lab cell lines, supplies, common lab stocks, and lab equipment.</li>\n<li>Participate in general laboratory housekeeping, to include biohazard waste management</li>\n</ul>\n<strong>Computer Skills:</strong>\n\n<ul>\n\n\t<li>Word, Excel, and PowerPoint</li>\n<li>Basic understanding of laboratory information management systems (LIMS)</li>\n</ul>\nTHE FOLLOWING IS REQUIRED TO BE CONSIDERED FOR THIS POSITION:\n\n<ul>\n\n\t<li>Must be a US citizenship or permanent resident.</li>\n<li>Bachelor’s degree in Virology, Immunology, Molecular Biology or related field with at least 3 years of applicable experience.</li>\n<li>Must be willing to deploy to foreign locations on a rotational basis.</li>\n<li>Excellent interpersonal skills, excellent oral and written communication and organizational skills, ability to work independently, design experiments, and analyze data are required.</li>\n<li>Fluency in English.</li>\n<li>Ability to obtain/maintain certification in Chemical Personnel Reliability Program and/or Biological Personnel Reliability Program.</li>\n<li>Ability to obtain/maintain CDC Select Agent Program approval.</li>\n<li>Ability to obtain/maintain DoJ Security Risk Assessment (SRA) approval.</li>\n<li>Must be willing to work in a biosafety level 2 (BSL2) and/or 3 (BSL3) and/or 4 (BSL 4) environment and able to wear appropriate respiratory protection.</li>\n<li>Must be willing to be immunized with licensed and FDA approved Investigational New Drugs (IND) recommended for persons at risk to occupational exposure of biological agents.</li>\n<li>Must be willing to participate in periodic drug screening.</li>\n<li>Individual must be able to meet the requirements for Public Trust Level 5b.</li>\n</ul>\nTHE FOLLOWING IS DESIRED TO BE CONSIDERED, BUT NOT REQUIRED FOR THIS POSITION:\n\n<ul>\n\n\t<li>Previous BSL-3 or BSL-4 containment experience.</li>\n<li>Experience with viral Select Agents is highly desired.</li>\n<li>Fluency in French.</li>\n</ul>\nLegal Disclaimer\n<br><br>\nThe above statements are intended to describe the nature and level of work being performed by people assigned to this job. They are not intended to be an exhaustive list of all responsibilities, activities and skills required of staff members. No statement herein is intended to imply any authorities to commit Battelle unless special written permission is granted by Battelle's Legal Department.\n</div>\n<br><strong>BENEFITS</strong>\n<br><br>\nBattelles competitive benefits program includes comprehensive medical and dental care, matching 401K, paid time off, flexible spending accounts, disability coverage, and other benefits that help provide financial protection for you and your family.\n<br><br>\n<em>Battelle provides employment and opportunities for advancement, compensation, training, and growth according to individual merit, without regard to race, color, religion, sex (including pregnancy), national origin, sexual orientation, gender identity, marital status, age, genetic information, disability, veteran-status, or any other characteristic protected under applicable Federal, state, or local law. Our goal is for each staff member to have the opportunity to grow to the limits of their abilities and to achieve personal and organizational objectives. We will support positive programs for equal treatment of all staff and full utilization of all qualified employees at all levels within Battelle.</em>\n<br><br>\nFor more information about our other openings, please visit www.battelle.org/careers"}