{"job title": "Principal Scientist, Analytical Development - Biologics", "company": "Celgene Corporation", "city state": "– Cambridge, MA", "rating": "3.6", "job description": "<div><strong>Other Locations:</strong>US- MA- Cambridge</div>\n<br>\nDescription<br><br>Celgene is a global biopharmaceutical company leading the way in medical innovation to help patients live longer, better lives. Our purpose as a company is to discover and develop therapies that will change the course of human health. We value our passion for patients, quest for innovation, spirit of independence and love of challenge. With a presence in more than 70 countries, and growing - we look for talented people to grow our business, advance our science and contribute to our unique culture.<br><br>Principal Scientist Analytical Development (Mass Spectrometry)Cambridge, MA<br><br><strong><strong>DEPARTMENT</strong></strong>\n<br><br>\nAnalytical Development Biologics\n<br><br>\n<strong>PREREQUISITES</strong>\n<br><br>\nPh.D. in Biochemistry, Analytical Chemistry or related discipline and minimum of 10 years relevant experience preferred; or\n<br><br>\nMS degree with 15 years of relevant experience preferred.\n<br><br>\nThe successful candidate will be highly motivated to work within a science focused, collaborative, multidisciplinary drug substance and drug product development environment to achieve the companys aggressive drug development targets. As part of Celgenes Biologics team, this Principal Scientist will play an important role through development of innovative tools for characterization of new drug candidates from discovery to commercialization, contributing to the advancement of new therapeutics in the areas of hematology, oncology, inflammation &amp; immunology.\n<br><br>\n<strong><u>Responsibilities will include, but are not limited to, the following:</u></strong>\n<br><br>\nThe Principal Scientist position will be responsible for the development of analytical methodology for the characterization of our products and processes, the creation of fundamental product and process understanding, and the advancement of innovative approaches to drug development.\n<br><br>\nThe Principal Scientist should work with minimal supervision to carry out laboratory based analytical methods development, product characterization studies and stability characterization evaluations.\n<ul>\n<li>Develop innovative, cutting edge and high throughput analytical tools for characterization of biologics.</li><li>Responsible for the characterization of protein primary structure, carbohydrate structure of biologics using mass spectrometry based techniques.</li><li>Forge collaborations with other laboratories in academic and industry settings.</li><li>Stay current on new technology through literature review and networking.</li><li>Support drug substance process development including characterization of in-process and formulated drug substance and drug product.</li><li>Develop, optimize and qualify analytical methods for structural characterization of biologics.</li><li>Qualify/transfer analytical methodology to quality control and contract laboratories.</li><li>Review analytical data for completeness and correctness.</li><li>Support drug substance and drug product impurity characterization and identification.</li><li>Serve on and lead departmental, interdepartmental and project teams.</li><li>Report and discuss analytical results and conclusions both orally and in writing.</li><li>Maintain lab notebooks in a compliant manner, draft study protocols, reports and SOPs for inclusion in regulatory filings.</li><li>Ensure that all facilities, equipment, and personnel are and remain in compliance with applicable regulatory requirements, appropriate SOPs and corporate policies.</li>\n</ul>\n<strong><u>Skills/Knowledge required</u></strong><strong>:</strong>\n<ul>\n<li>Background in Analytical Chemistry or a Scientific Discipline with demonstrated analytical capabilities.</li><li>Knowledge and hands-on experience in biologics characterization with mass spectrometry (LC-MS) based techniques is required.</li><li>Knowledge and/or experience working on H-D exchange, Ion-Mobility, Multi-Attribute Methods, HCP analysis by MS, CE-MS analysis, or real-time, high throughput process monitoring, by MS based methods is strongly desired.</li> <li>Demonstrated ability for critical thinking, problem solving and innovation</li><li>Strong problem-solving and troubleshooting skills.</li><li>Strong capabilities in experimental design and execution.</li><li>Ability to work independently and in cross functional team environment.</li><li>Experience working in GLP/GMP environment is required</li><li>Strong verbal and written communication skills.</li>\n</ul>\n<strong><u>Skills/Knowledge in the following areas are a plus</u></strong><strong>:</strong>\n<ul>\n<li>Knowledge and experience in comparability, CQA assessment and forced degradation characterization is preferred.</li><li>Experience with development, qualification and validation of biochemical protein characterization methods is preferred.</li><li>Understanding of biologics development is preferred and experience working with monoclonal antibodies is a plus.</li><li>The ideal candidate will also have experience in interacting with CROs</li><li>Modern laboratory automation.</li>\n</ul>\n\nCelgene is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Celgene complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must have authorization to work for Celgene in the U.S."}