{"job title": "(Senior) PHC Data Scientist - Real World Data Neuroscience", "company": "Genentech", "city state": "– • South San Francisco California, United States", "rating": "4.0", "job description": "<div><div>(Senior) PHC Data Scientist - Real World Data Neuroscience<br><br>South San Francisco\n<br>\nCalifornia,\n<br>\n United States of America<br>\n<div>\n<div>Job ID: 201805-103737<br><br>Download PDF</div><br>\n\n<div>\n<div>\nApply For This Job</div>\n </div>\n </div>\n\n<br>Return to Search Results\n<br><br>\nThe Position<br><br><strong>POSITION SUMMARY</strong>\n<br><br>\nAs a (Senior) Data Scientist within our Personalized HealthCare (PHC) function you will work with meaningful data to generate impactful evidence and insights on our molecules/ medicines and patients, that support R&amp;D, advance scientific and medical knowledge, and enable personalized patient care and access.\n<br><br>\nYou will collaborate with peers within the function and across the organization to develop evidence generation strategies, identify evidence gaps and data sources, design and execute studies, and implement analyses to address molecule and disease area questions. The data will be varied in type -- patient-level clinical data, supplemented with deep patient data such as omics (e.g. genomics, proteomic), imaging, digital health, etc. Source data will be diverse -- real-world data, including patient registries, electronic medical records, claims, biobanks, and clinical trials. The evidence and insights will be used to inform the research and development of our molecules, and support healthcare decisions by patients, physicians, health authorities, payers, and policy-makers. You will also contribute to functional, crossfunctional, enterprise-wide or external initiatives that shape our business and healthcare environments. This will require a good understanding of molecule and disease area strategies, healthcare environments, as well as strong scientific and technical expertise in observational research. You will need strong strategic, collaboration and communication skills, as well as an entrepreneurial mindset, to transform the way we use data and analytics to develop and deliver medicines for our patients.\n<br><br>\nAs (Senior) Data Scientist you will typically be expected to contribute to the molecule/disease area for multiple or complex projects with minimal supervision. You will contribute to the design and analysis of real world data retrieved through a novel patient-centered approach. You are expected to closely collaborate with our external research partners and internal stakeholders to ensure study implementation. We will look to you as a positive role model for peers and you will coach colleagues to improve in their role with both technical and interpersonal skills.\n<br><br>\n<strong>RESPONSIBILITIES</strong>\n<ul>\n<li>IDENTIFY EVIDENCE NEEDS &amp; RECOMMEND DATA SOLUTIONS: Ask the right scientific questions, understand the evidence needs for research and development, regulatory and market access, and ideate and make recommendations on fit-for-purpose data and analytics solutions.</li><li>DEVELOP DATA STRATEGY &amp; GAIN ACCESS TO DATA: Develop strategic plans to access fit-for-purpose data sources to support evidence generation, and gain access to data through collaboration or data generation.</li><li>DIVE INTO DATA: Develop a comprehensive and deep understanding of the data we work with and foster learning with colleagues using analytical tools and applications to broaden data accessibility and advance our proficiency/efficiency in understanding and using the data appropriately.</li><li>BE AN EXPERT IN APPLYING METHODS: Stay current with and adopt emergent analytical methodologies, tools and applications to ensure fit-for-purpose and impactful approaches.</li><li>PRODUCE HIGH QUALITY ANALYSES: Apply rigor in study design and analytical methods; plan for data processing; design a fit-for-purpose analysis plan, assess effective ways of presenting and delivering the results to maximize impact and interpretability; implement and/or oversee the study, including its reporting; ensure compliance with applicable pharma industry regulations and standards.</li><li>INTERPRET AND SHARE RESULTS: Communicate findings to internal stakeholders, regulatory, health technology assessment (HTA) bodies and scientific communities; publish results; participate in external meetings and forums to present your insights (e.g. congress/conference).</li><li>COLLABORATE &amp; SHAPE: Collaborate and contribute to functional, cross-functional, enterprise-wide or external data science communities, networks, collaboratives, initiatives or goals on knowledge-sharing, methodologies, innovations, technology, IT infrastructure, policy-shaping, processes, etc. to enable broader and more effective use of data and analytics to support business.</li>\n</ul>\n<strong>MINIMUM QUALIFICATIONS</strong>\n<ul>\n<li>MSc or PhD in epidemiology, pharmacoepidemiology or biostatistics/public health (with focus on epidemiology/observational research)</li><li>Demonstrated track record of developing and executing epidemiological research projects, with publications and presentations</li><li>Demonstrated experience with managing project scope and driving delivery in an evolving environment requiring proactivity and effective problem-solving and prioritization when faced with challenges</li><li>Demonstrated strong collaboration skills and excellent communication skills</li><li>Demonstrated entrepreneurial mindset and self-direction, ability to teach others and willingness to learn new techniques</li><li>Proficiency in English, both written and verbal</li><li>Track record of effectively working in a matrix environment with global, international team members coming from scientific, business and operational backgrounds, using influence without authority</li>\n</ul>\n<strong>PREFERRED/ADDITIONAL QUALIFICATIONS</strong>\n<ul>\n<li>PhD degree as listed in Minimum Qualifications</li><li>4+ years of relevant work experience</li><li>Proven ability to translate and communicate complex study design and findings to diverse audiences</li>\n</ul>\n*LI-PD-HB<br><br>Who We Are<br><br>A member of the Roche Group, Genentech has been at the forefront of the biotechnology industry\n<br>\n for more than 40 years, using human genetic information to develop novel medicines for serious and\n<br>\n life-threatening diseases. Genentech has multiple therapies on the market for cancer &amp; other serious\n<br>\n illnesses. Please take this opportunity to learn about Genentech where we believe that our employees\n<br>\n are our most important asset &amp; are dedicated to remaining a great place to work.\n<br><br>\nThe next step is yours. To apply today, click on the \"Apply online\" button.\n<br><br>\nGenentech is an equal opportunity employer &amp; prohibits unlawful discrimination based on race, color, religion, gender, sexual orientation, gender identity/expression, national origin/ancestry, age, disability, marital &amp; veteran status. For more information about equal employment opportunity, visit our Genentech Careers page.\n<br><br>\nAt Genentech, we share salary ranges with applicants during the recruiting process, if requested. Third party salary estimates may not be accurate or up-to-date.</div>\n </div>"}