{"job title": "Senior Data Scientist", "company": "Ingram Micro", "city state": "– United States | Irvine, California", "rating": "3.3", "job description": "Senior Data Scientist<br><br>United States | \n<br>\n Irvine,\n<br>\n California\n<br>\nJob ID: 17632<br>\n<div>\n<strong>Job Description</strong>\n<br>\n <div>\n<em>Position at Ingram Micro</em></div>\n<br><strong>Ingram Micro touches 80% of the technology you use every day with our focus on Technology Solutions, Cloud, and Commerce and Lifecycle Solutions. With $43 billion in revenue, we have become the world’s largest technology distributor with operations in 56 countries and more than 30,000 associates. We continue to strategically expand our global reach with 32 acquisitions since 2012.</strong>\n<br><br>\nWe are seeking a Sr. Data Scientist to develop statistical, machine learning, economic, geographic, and mathematical models to address complex business problems in the tech and ecommerce space.\n<br><br>\nYou will work with the Advanced Science Lab, reporting to a Director with a Ph.D. in Economics, to build causal and predictive models, design and execute field experiments, model demand, design and conduct surveys, perform supply chain optimization, and develop state of the art machine learning and AI models.\n<br><br>\nThe role will collaborate with a diverse team of highly talented Ph.D.’s, M.A.s, and industry experts to use advanced scientific techniques on a world class data infrastructure to develop large-scale models with immediate relevance. You will focus on new product development projects as well as own sub-streams of projects that require effective communication with cross-functional teams.\n<br><br>\nAs a Senior Data Scientist, your focus will be more on development of models and being the thought leader for the analyst team. You will also be required to be more of a communicator of results to our customers as compared to the junior analysts. This position will require project ownership and communication with internal and external customers. You will lead multiple sub-streams of a project and will be positioned as a Subject Matter Expert (SME).\n<br><br>\n<strong><u>Qualifications</u></strong>\n<ul>\n<li>Ph.D. (or technical Masters considered) in Economics (applied micro, applied econometrics, empirical IO, labor, finance, behavioral, applied macro/time series), Statistics, Operations Research, Applied Mathematics, Physics, Engineering, GIS, or related technical field (Ph.D. preferred)</li><li>5 years of quantitative analysis experience in business intelligence or pricing metrics.</li><li>3 years of experience in consulting, government, industry or academic research.</li><li>Experience in analysis of large data sets, identifying trends and patterns, and effectively communicating both internally and externally.</li><li>Candidate must have ability to apply training, models, and insights to high impact questions with immediate relevance.</li><li>Perform econometric and statistical analysis of large transaction level data sets to develop causal and predictive models.</li><li>Design and execute field experiments to draw insights from market behavior.</li><li>Build predictive models to forecast downstream market activity.</li><li>Experience developing and implementing demand models.</li><li>Experience with optimization techniques.</li><li>Experience with machine learning models.</li><li>Be familiar with and use modeling techniques such as:\n\n<ul>\n<li>Support Vector Machines</li><li>Features extraction, attributes selection</li><li>Clustering, decision and model trees</li><li>Numerical optimization (linear and nonlinear) with constraints</li><li>Experimental Design</li><li>Multiple Dimensional Scaling</li><li>Neural Network</li><li>Conjoint/Discrete Choice</li><li>Time Series Modeling</li><li>Linear and Non-Linear Regression</li><li>Price optimization, price elasticity/demand modeling</li><li>Text mining on structured and unstructured data, sentiment analysis</li></ul></li>\n</ul>\n\n\n<ul>\n<li>Ability to work independently and in a highly engaged team environment.</li><li>Experience analyzing large data sets, identifying trends and patterns, and effectively communicating insights.</li><li>Experience cleaning, aggregating, and pre-processing large granular data from varied sources, including complex relational databases.</li><li>Experience with tools such as R, Python, STATA, SQL, SAS, and MATLAB.</li><li>Effective verbal and written communication skills and the ability to collaborate with internal and external teams.</li>\n</ul>\n<em><strong>Ingram Micro Inc. is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, or any other protected category under applicable law.</strong></em></div>\n<br>"}