{"job title": "Product Data Management - Scientist IV", "company": "Reynolds American Inc. (RAI)", "city state": "– Winston Salem, NC", "rating": "NA", "job description": "Product Data Management - Scientist IV\n<br><br>\nDate:Aug 3, 2018\n<br><br>\nLocation:Winston Salem, NC, US\n<br><br>\nCompany:RAI\n<br><br>\nReynolds American Incorporated is positively transforming the tobacco industry. We?re a family of companies that strives for success in everything we do. The future inspires us because our people are igniting the breakthroughs that are redefining the ways adult tobacco consumers enjoy tobacco in the 21st century.\n<br><br>\nWhen other companies talk about growth, they only talk about size. At RAI, we focus on the growth of our people. We take pride in each other?s growth and well-being throughout our careers. We invest in your career and total well-being because we know our companies succeed when our people thrive.\n<br><br>\nAt the RAI companies you?ll have the opportunity to work on iconic brands and revolutionary products by collaborating with visionary, principled and passionate people every day.\n<br><br>\nThis position is with RJ Reynolds Tobacco Company?the second-largest U.S. tobacco company. The company's brands include Newport, Camel and Pall Mall.\n<br><br>\n<strong>POSITION DESCRIPTION</strong>\n<br><br>\nR.J. Reynolds Tobacco Company is seeking a Product Data Management Scientist to support the development of products consistent with RAI?s Growth, Innovation, and Harm Reduction Platforms. The Product Data Management Scientist is responsible for supporting the implementation of new and innovative products while working collaboratively with other functions to achieve strategic objectives.\n<br><br>\n<strong>Principal responsibilities and duties:</strong>\n<br><br>\nThe Product Data Management Scientist is responsible for facilitating the transition of product and material designs into technical commercial requirements while meeting aggressive timelines on multiple projects. The individual must possess strong interpersonal skills with the ability to establish collaborative relationships. He/she must be capable of grasping technical information, systems, and business processes quickly, managing multiple projects simultaneously with extreme attention to detail.\n<br><br>\n<strong>Key responsibilities will include:</strong>\n<br><br>\n+ Creating and maintaining manufacturing specifications and relevant product data in corporate computer systems including, but not limited to, purchased materials, process assemblies, and finished product.\n<br><br>\n+ Managing the business process data required for planning, procurement, manufacture, shipment, and sale of direct materials, semi-finished and finished products.\n<br><br>\n+ Collaborating cross functionally with various groups to ensure data is accurate, complete, and approved.\n<br><br>\n+ Ensuring internal business process and regulatory compliance requirements are achieved in the implementation of new products and maintenance of existing products.\n<br><br>\n<strong>POSITION QUALIFICATIONS</strong>\n<br><br>\nRelevant degree in supply chain, mathematics, physics, chemistry, engineering, computer science or other technical discipline plus a minimum of 2 years? experience (or equivalent internship experience); or 5 plus years? experience with an organization that manufactures finished goods for sale (preferably in a FDA regulated industry).\n<br><br>\n<strong>+ The candidate should demonstrate:</strong>\n<br><br>\n+ A thorough understanding of manufacturing and business processes associated with the production of semi-finished and finished products\n<br><br>\n+ The ability to interpret technical requirements for the development of material specifications and bills of material\n<br><br>\n+ The ability to manage multiple projects simultaneously, and within project time fences, while adapting to changing priorities\n<br><br>\n+ Strong organizational skills with attention to detail\n<br><br>\n+ Effective oral and written communication skills\n<br><br>\n+ The ability to work seamlessly in a team environment and independently in area of expertise\n<br><br>\n+ The ability to master the use of new software applications\n<br><br>\n+ Highly skilled in the use of Microsoft Office tools (Excel, Word, and Outlook)\n<br><br>\n+ The ability to interpret software user business requirements into clear software functionality requirements to achieve desired outcomes\n<br><br>\n+ Strong math skills (at a minimum, Algebra is required)\n<br><br>\n+ Detailed working knowledge of SAP and/or Siemens Interspec software preferred\n<br><br>\n+ Basic SQL or other programming language skills preferred\n<br><br>\nCompensation/Targeted Bonus\n<br><br>\n+ Competitive Annual Salary\n<br><br>\n+ Targeted Annual Bonus\n<br><br>\n+ Relocation assistance available for those who qualify.\n<br><br>\nBenefit Summary\n<br><br>\nOur company offers very competitive compensation and benefit plans, including:\n<br><br>\n+ 401(k) plan that offers opportunity to save on pre- and post-tax basis up to 50 percent of eligible compensation. Company matches 100 percent of employee pre-tax/Roth (401k) contributions up to six percent\n<br><br>\n+ Comprehensive health- and welfare-benefits package\n<br><br>\n+ Eleven paid company holidays annually, plus a generous paid vacation plan based on length of service\n<br><br>\n+ Company-paid sick and personal days, funeral leave and jury duty leave\n<br><br>\n+ Confidential personal financial counseling service\n<br><br>\n+ On-site health clinics and fitness centers\n<br><br>\n+ A matching grants program that enables employees to direct and double their donations to qualifying charitable organizations of their choice\n<br><br>\n+ Health-care advocacy service\n<br><br>\n+ Volunteer service opportunities\n<br><br>\n+ Federal credit union membership through Allegacy Federal Credit Union\n<br><br>\n+ Extensive training opportunities\n<br><br>\n<strong>ABOUT OUR ORGANIZATION:</strong>\n<br><br>\nReynolds American Inc. is an indirect, wholly owned subsidiary of British American Tobacco p.l.c., and the U.S. parent company of R. J. Reynolds Tobacco Company; Santa Fe Natural Tobacco Company, Inc.; American Snuff Company, LLC; Niconovum USA, Inc.; Niconovum AB; R. J. Reynolds Vapor Company; Lorillard Licensing Company, LLC; and Reynolds Brands, Inc..\n<br><br>\nReynolds American Inc. and its affiliated companies is an Equal Opportunity / Affirmative Action Employer.\n<br><br>\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n<br><br>\nOur organization offers a level of challenge, responsibility and creativity for motivated employees that stands apart from the crowd.\n<br><br>\nWe are also committed to employing a diverse workforce and valuing different perspectives, experiences and talents to maximize the company's potential for successfully achieving its business objectives.\n\n\n<ul>\n<li>----------------------------------------------------------------------------------------------------------------------------------------------------------</li>\n</ul>\n\nOnlyapplicants requiring reasonable accommodation for any part of the application and hiring process should contact us directly.\n<br><br>\nTelephone:262-439-1893\n<br><br>\nEmail: TalentAcquisition@RJRT.com\n<br><br>\nNearest Major Market:Winston-Salem"}