{"job title": "Sensor Technology Scientist (NOAA)", "company": "Riverside Technology, inc.", "city state": "– College Park, MD", "rating": "4.0", "job description": "Riverside Technology, inc. (Riverside), recognized internationally for providing innovative engineering, science, and information technology solutions to Federal and state agencies, private companies and international organizations, has an opportunity for a Sensor Technology Scientist working on-site at the National Oceanic and Atmospheric Administration (NOAA) Center for Satellite Applications Research (STAR) in College Park, MD.\n<br><br>\n<strong>BACKGROUND</strong>\n<br><br>\nThe NOAA Center for Satellite Applications and Research (STAR) is the science arm of NOAA’s Satellite and Information Services, which acquires and manages the nation’s environmental satellites. STAR scientists lead efforts to develop, test, validate, and refine the science algorithms needed to drive user-defined products. They also investigate both enhanced and new sensor technology for future NOAA satellite missions and conduct research to examine which products users will need to carry out NOAA's mission goals. STAR supports the calibration and validation of all data in NOAA's satellite operations and develops new methods for inter-calibrating data from NOAA polar and geostationary satellites with other satellites in the evolving international system. Additionally, STAR collaboratively develops efficient methods and technology to transfer new products from research to operations.\n<br><br>\n<strong>POSITION</strong>\n<br><br>\nRiverside is seeking a mid to senior-level engineering or scientific professional to conduct a comprehensive survey and maturity assessment of emerging new satellite remote sensing sensors, payload-hosting platforms and associated technologies that can be used to assist NOAA’s mission. The position is expected to entail a moderate level of travel to attend scientific and technical conferences and visit Industry and Government agencies (both domestic and international) that are conducting related technology developments.\n<br><br>\nThe individual should possess a solid technical understanding of satellite remote sensing instrument design and applications, and be able to think outside the box to identify uses related to NOAA’s mission that may not be the original design intent of the system. This will range from exploiting new sensors to adopting new techniques that have not been proven yet and to helping design new space constellations. The individual should further have the demonstrable interpersonal and communications skills necessary to acquire technical information from diverse organizations, organize it in a concise way, and convey it in both oral and written form to technical audiences.\n<br><br>\n<strong>Requirements</strong>\n<ul>\n <li>Minimum Master’s degree in remote sensing-related engineering or scientific field</li> <li>10+ years experience in the space or related scientific field; NOAA or NASA satellite system experience preferred</li>  <li>Excellent verbal and written communications</li> <li>Detail-oriented with solid understanding of broad multi-disciplinary engineering and science</li> <li>Proficiency with Microsoft Office tools, including PowerPoint, Word and Excel</li> <li>Strongly motivated self starter requiring little supervision</li> <li>Highly organized and very conscious of schedules and deadlines</li> <li>Team player capable of getting along with diverse personalities and capable of communicating with the full range of organizational leadership levels</li></ul> \n\n<ul>\n <li>Ability to pass a NOAA background check</li>\n</ul>\n<strong>Benefits</strong>\n<br><br>\nRiverside is an Equal Opportunity Employer offering very competitive compensation and exceptional employee benefits."}