{"job title": "Scientist - Molecular Diagnostics R&amp;D", "company": "Thermo Fisher Scientific", "city state": "– South San Francisco, CA", "rating": "3.3", "job description": "Job Description<br><p></p><p>When youre part of the team at Thermo Fisher Scientific, youll do important work, like helping customers in finding cures for cancer, protecting the environment or making sure our food is safe. Your work will have real-world impact, and youll be supported in achieving your career goals.<br> <br><strong>How will you make an impact?</strong> <br>The Scientist III, Research &amp; Development will have responsibility in planning and oversight for scientific activities in the research and development of clinically oriented products. Housed within the Genetic Sciences Division of Thermo Fisher Scientific, the successful candidate will drive additional microbial detection R&amp;D projects and work collaboratively with product management, bioinformatics, manufacturing, and other R&amp;D teams to take new microbial assay products and applications through concept, feasibility, development, and commercialization. In addition, the candidate will actively participate in external communication and collaborations with thought leaders in microbiome and infectious disease research &amp; diagnostics.<br><br>As part of the R&amp;D staff, he/or she pursues the highest level of technical competency and professionalism in all development activities and that all projects are aligned to the needs of the customers and business, and that developmental timelines are met. In this position, you will drive results through inspired leadership and a focused and disciplined approach to product development that is consistent with best practices in the Company and in the industry as well as in compliance with appropriate regulatory requirements. This position will act as a resident expert for assays in development.<br> <br><strong>What will you do? </strong> </p><ul><li>Designs, plans and executes experiments in support of new product development.</li><li>Develops procedures and documentation for manufacturing and testing of new and existing products.</li><li>Interact cross-functionally to define products, transfer new designs to manufacturing, and ensure on-time regulatory submissions</li><li>Critically analyzes complex data using knowledge of the scientific field, interprets and integrates experimental results with project objectives.</li><li>Responsible for technical leadership of projects and assay development</li><li>Set clear product development timelines and prioritize efforts to deliver on commitments</li><li>Identify gaps in resources and capabilities in place to deliver ongoing product development functions</li><li>Cross Train staff in areas of expertise</li><li>Performs statistical analysis and DOE methods.</li><li>Contributes innovative ideas for new products and intellectual property.</li><li>Collaborates with peers and cross functional teams.</li><li>Writes technical and business communications including papers and posters.</li><li>Gives effective internal and external presentations</li><li>Supports technical questions related to on-market products</li><li>Contribute in R&amp;D evaluation of new license and co-development opportunities</li></ul> <br><strong>How will you get here?<br>Education/Experience:</strong><ul><li>BS, MS or PhD in related Life Sciences Degree<strong> </strong></li><li>5+ years experience in molecular diagnostic assay development (Could be in LDT, CE-IVD or IVD space) </li><li>Familiarity with diagnostic methods for infectious diseases</li><li>Expert in diagnostic molecular methods with expertise in technologies including qPCR, Sanger sequencing.</li><li>Demonstrated experience with a stage gated development process within a regulated diagnostic company</li><li>Hands on experience working with pathogenic microorganisms</li><li>Familiarity with nucleic acid sample preparation technologies from blood products, tissue, swabs and other esoteric sample types</li><li>Familiarity with the process of obtaining CE-IVD, FDA or cFDA clearance/approval of In Vitro Diagnostic (IVD) products, preferably in molecular diagnostics</li><li>Understanding of Quality Systems Regulations and cGMP product development</li></ul><strong>Knowledge, Skills, Abilities:</strong><ul><li>Demonstrated ability to deliver results</li><li>Driven to deliver quality results on time and in a highly ethical and professional manner</li><li>Demonstrated resourcefulness, strategic and analytical thinking, directed toward achieving objectives </li></ul><p>At Thermo Fisher Scientific, each one of our 70,000 extraordinary minds has a unique story to tell. Join us and contribute to our singular missionenabling our customers to make the world healthier, cleaner and safer.<br> <br>Apply today! http://jobs.thermofisher.com</p><p></p><p></p><p></p><p></p><br><br><br>If you are an individual with a disability who requires reasonable accommodation to complete any part of our application process, click here for further assistance. \n<p>\n</p>\n<p>Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status.</p>"}