{"job title": "Field Application Scientist - HID Forensics", "company": "Thermo Fisher Scientific", "city state": "– Remote / Field, CA", "rating": "3.3", "job description": "Job Description<br><br>When youre part of the team at Thermo Fisher Scientific, youll do important work, like helping customers in finding cures for cancer, protecting the environment or making sure our food is safe. Your work will have real-world impact, and youll be supported in achieving your career goals.\n<br><br>\n<strong>How will you make an impact?</strong>\n<br>\nProvide technical and application support to Forensic Human Identification customers, and is responsible for presales forensic application support, new installation and customer application trainings, workshops/conferences and providing data analysis, logistical, and troubleshooting support in their territory. The primary goals are to ensure customer success with Thermo Fisher Scientific Forensic Human Identification products services and workflows. FORENSIC LAB EXPERIENCE REQUIRED (PUBLIC OR PRIVATE)\n<br><br>\n<strong>What will you do?</strong>\n<ul>\n<li>Provide technical knowledge and support for Forensic Human Identification applications using HID products across the US, primarily focused on western US, including</li><li>Work closely with customers on a range of activities, via in-person visits, phone and email communications. As needed, conduct experiments and lab bench work, data review and customer presentations, instruct product demonstrations and technical classes, conference workshops, etc. with minimal direction from Sr. Field and Validation Application Scientists.</li><li>Troubleshoots issues related to the forensic science workflow, assays, software and/or instrumentation. Interprets customer needs and identifies a resolution pathway that address the specialized needs of the forensic customer and may include gathering support or inputs from sales, manufacturing/QC, R&amp;D, or other internal functions.</li><li>Work alongside Sales Account Managers to provide technical and applications assistance.</li><li>Perform independent product demonstrations and trainings in the field. Support conditional sales placements in the field through on-site visits and telephone communication.</li><li>Delivers installation and advanced forensic application and product training across the entire forensic human identification workflow. And represent Human Identification products and services at Scientific Forums.</li><li>Provide technical support for Validation Professional Services activities, conducting wet laboratory work, data analysis and product training.</li><li>Perform other duties as required and/or assigned.</li><li>Provide feedback to Marketing and Product Development teams to help improve products and processes.</li><li>Develops and improves processes that support our mission of building a world-class customer support organization.</li>\n</ul>\n<strong>How will you get here?\n<br>\nEducation/Experience:</strong>\n<ul>\n<li>A minimum of 4 years of Forensic Analyst experience working in a casework and/or databasing laboratory.</li><li>Bachelors degree in a major branch of Science is required. Requires knowledge and skills normally acquired through completion of a Bachelor`s degree (B.A. /B.S.) in Biology, Molecular Biology, Microbiology or Biochemistry, or equivalent experience.</li><li>Demonstrated proficiency in using Thermo Fisher Scientific Human Identification (HID) assays, instrumentation and software.</li><li>Demonstrated superior problem solving and interpersonal skills.</li><li>Demonstrated written and verbal communication skills. including training and presentation skills.</li><li>Clear vision of and commitment to providing outstanding customer service.</li><li>Ability to respond quickly to changing needs and adapt as necessary to meet new challenges.</li><li>Strong influencing skills able to motivate, drive, steer and convince others at all levels of the organization.</li><li>Takes ownership and accountability to achieve the proper team output.</li>\n</ul>\n<strong>Working Conditions:</strong>\n<ul>\n<li>Travel and valid Drivers License required.</li><li>Must be able to work safely with chemicals and hazardous material.</li><li>Frequent travel required. (Up to 80%).</li><li>Qualified candidates must reside near a major US airport.</li>\n</ul>\nAt Thermo Fisher Scientific, each one of our 70,000 extraordinary minds has a unique story to tell. Join us and contribute to our singular missionenabling our customers to make the world healthier, cleaner and safer.\n<br>\nApply today! http://jobs.thermofisher.com<br><br>Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status."}