{"job title": "Health Data Analyst, Lead - Rx Reporting", "company": "Blue Shield Of California", "city state": "– San Francisco, CA (US)", "rating": "3.1", "job description": "<div>Blue Shield of California (BSC) is looking for a Lead Health Data Analyst for our Enterprise Analytics - Analytic Data Foundation (ADF) group.</div>\n<br>\n<div>The Lead Health Data Analyst will be a key analyst within the ADF - Pharmacy Analytics team to design, develop, maintain, and implement internal data management processes, custom reports and analytic tools/applications to support Blue Shield COHC, Network, and Rebate processes. The Lead Pharmacy Analyst will also work with other analysts within the Analytic Data Foundation team and cross functionally to meet the objectives.</div>\n<br>\n<div>Reporting to the Sr. Manager, Rx Analytics, the Lead Health Data Analyst may be based in our Woodland Hills, Rancho Cordova, or San Francisco office.</div>\n<br>\n<div>Provide an overview of the business unit and describe the purpose of the unit: Describe the context of the role and how it operates within the unit.</div>\n<br>\n<div>The purpose of the ADF – Pharmacy Analytic team is to develop consultative analytic methods to transform pharmacy data into accurate and meaningful information to meet client requirements, facilitate performance monitoring, and assist with business strategy planning.</div><br>\n\n<div><strong>Key Pharmacy Analytics &amp; Reporting accountabilities include:</strong></div>\n<ul>\n<li>Conduct trend driver analyses, outcomes reporting and benchmarking to support Cost of Health Care (COHC) trend management and forecast</li>\n<li>Develop reports to support efficient operations and regulatory requirements</li>\n</ul>\n\n<div><strong>Key Responsibilities include:</strong></div>\n<ul>\n<li>Leads report development and maintenance and analytic tool development for Pharmacy Network Program Monitoring.</li>\n<li>Leads report development and maintenance and analytic tool development for Pharmacy Rebate.</li>\n<li>Provide consultative analyses and RFP data to support membership growth and retention<strong>.</strong></li>\n<li>Understands the overall business and analytic objectives, recommends and develops proper analytic plan and statistical methods to support the evaluation.</li>\n<li>Utilizes programming software to efficiently develop process or tools to analyze relevant data from various sources (e.g., claims, membership, operation and other ancillary data sources), interprets and presents analytic results for all ad hoc and ongoing reporting requests.</li>\n<li>Serves as pharmacy data liaison to key stakeholder areas (e.g., Pharmacy Benefits &amp; Claims, Health Information Technology, and IT/business intelligence) and supports business and strategic project planning and implementation.</li>\n<li>Develops innovative analyses and reports using understanding of the business need for information. Conducts independent analysis of high complexity under minimal supervision and guidance.</li></ul>\n\n\n<ul>\n<li>Requires BA/BS degree in health science, quantitative social science, public health, health services research or business.</li>\n<li>SAS Certified Advanced Programmer or equivalent experience required. Must be able to develop new SAS programs and SQL scripts</li>\n<li>Experience with Visual Analytic tools required (Tableau)</li> \n\n<li>Experience with Python or other scripting languages preferred</li>\n<li>Requires advanced data analytic skils with SAS, Business Objects, Microsoft Office (e.g. Access and Excel including VBA). Other data analytic experience is a plus (e.g. Crystal Reports, Linux, SQL/PL-SQL).</li>\n<li>Requires 3-5 years experience in health care (Health Plan, Pharmacy Benefit Management or government payer).</li>\n<li>Must have sufficient familiarity with the technical, clinical, and financial concepts necessary to adequately perform the duties described above.</li>\n<li>Demonstrated ability to work with pharmacy claims data and familiar with pharmacy data parameters available for analysis. Prior experience and demonstrated ability to work with large datasets required.</li>\n<li>Experience with designing analytic plan using sound statistical approach to solve complex questions or evaluate program ROI.</li>\n<li>Exhibits “can do” attitude and solution-oriented approach to resolve challenges.</li>\n<li>Produces accurate work under tight deadlines.</li>\n<li>Possesses strong collaboration and partnership skills in a matrix work environment.</li>\n</ul>"}