{"job title": "Data Governance Application Analyst", "company": "Bose", "city state": "– Boston, MA (US)", "rating": "3.6", "job description": "<u><strong>Job Description</strong></u><br><br>Bose is about better sound, but better sound is just the beginning. We’re about inventing new technologies that truly benefit people, and creating a culture where innovation and teamwork are highly valued. Working at Bose, you’re encouraged to question conventional thinking in the relentless quest to create products and experiences that change people's lives. Our culture is as distinctive as our products. Join a company that operates globally, with a culture that embraces new ideas.\n<br><br>\nWe have exciting Data Governance Application Analyst employment opportunity in our Corporate Information Systems team. The team is working to build a world class data driven organization that includes Data Governance enabling advanced analytics and Data Science across Bose. The goal is to have proactive data quality, enable certified data, provide for a searchable data catalog that includes lineage from visualizations to source systems decreasing analytics time to value.\n<br><br>\nIf you have a <strong>passion</strong> for creating a data driven culture by delivering value, please consider a career at Bose!<br><br>Responsibilities include:\n\n<ul>\n<li>The Data Governance Application Analyst role accelerates advanced analytics and Data Science time to value by working across different functional teams to:\n\n<ul>\n<li>Purchase, configure, implement, and support applications including Data Governance tools, Data Quality Tools, Lineage and metadata automation tools.</li><li>Understand existing business applications including SAP, Workday, SharePoint, Confluence, Slack, Trello, Tableau and internally developed tools learning how the tools are used and identify key Data Governance integrations as well as potential use for processes.</li><li>Evaluate marketplace data governance, data science and analytical applications that would improve stakeholder’s experience and how Bose could utilize applications to improve data usage and governance.</li><li>Provide support of Data Science and Advanced Analytics project/programs reducing administrative data governance tasks and action items.</li></ul></li>\n<li>Subject matter expert on the Data Governance Applications to support business requirements into application configurations.</li> <li>Understand the vendor relationships including support, services, upgrades schedules, and roadmaps.</li> <li>Own the business support for the day-day execution of the applications as well as anticipate new features and functionalities for Bose to plan for execution and usage. Work to understand critical applications across Bose.</li><li>Stay abreast of Data Governance and Analytical application’s future architectures developing strategies contributing to Data Governance roadmap development.</li><li>Own Data Governance application’s backlog managing stakeholder expectations delivering features and functionality to improve business processes and outcomes.</li><li>Develop and deliver training and documentation on Data Governance supported applications</li><li>Provide consistent communications to the stakeholder community on Data Governance applications to ensure transparency on new features, existing challenges, and use case successes.</li><li>Create application requirements to support centralized Data Governance applications assisting stakeholders during new implementations.</li><li>Assist architecture, data engineers, story tellers, data stewards, business data process flow, and other members of the Central Data Organization aligning application configurations to align with business processes by configuring (not customizing) the applications.</li><li>Provide recommendations around application upgrades including benefits, resource requirements, planning, dependencies, etc. to ensure efficient and successful application upgrades.</li><li>Work with the Business Data Flow Analyst to understand upstream and downstream impacts on changes to applications.</li><li>Translate business requirements to technical requirements ensuring business outcomes are delivered and meeting/exceeding the internal business customer’s expectations.</li><li>Partner with Legal, Information Security and HR to ensure compliance and security of data including how to manage data (masking, encrypting, pseudonymizing, synonymizing).</li><li>Develop and execute quarterly plans while aligning to Bose strategic vision.</li><li>Track and measure wins including return on investment measuring quarterly governance results and value delivered.</li>\n</ul>\n\nSkills, Knowledge and Experiences\n\n<ul>\n<li>Candidate should have a minimum of 2 years of Application Analysis and an understanding of a Data Governance framework.</li><li>The ideal candidate will understand how people, process and technology can come together to enable business processes.</li><li>Proven experience of cross functional leadership in complex organizations with strong emphasis on influencing and collaboration.</li><li>Strong analytical orientation.</li><li>Teach, mentor, and provide value on a consistent basis to stakeholders.</li><li>Ability to translate strategy into an operational plan and can execute delivering consistent value to Bose.</li>\n</ul>\n\nOther\n\n<ul>\n<li>Passion for Data, Data Governance, and process.</li><li>Bachelor’s degree.</li><li>Knowledge of MS Office.</li><li>Knowledge in data quality, data governance and supporting tools.</li><li>Relocation is not available for this position.</li>\n</ul>\nWe’re looking forward to your application.<br><br>Bose is an equal opportunity employer that is committed to inclusion and diversity. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, age, disability, veteran status, or any other legally protected characteristics. For additional information, please review: (1) the EEO is the Law Poster (http://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf); and (2) its Supplements (http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm). Please note, the company's pay transparency is available at http://www.dol.gov/ofccp/pdf/.pdf. Bose is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the application or employment process, please send an e-mail to Wellbeing@bose.com and let us know the nature of your request and your contact information."}