{"job title": "Marketing Data Analyst", "company": "Carmichael Lynch", "city state": "– Minneapolis, MN", "rating": "4.3", "job description": "We find ourselves in need of an entry-level Marketing Data Analyst.\n<br><br>\nThe Marketing Data Analyst is responsible for supporting the digital needs of the analytics department. This person will assist the analytics department in the data management, data tracking, and report building for the analytics team.\n<br><br>\nIn addition, the position is also responsible for collaboration with other key analytics positions in order to make sure the data is accurate, data processes are defined and followed, and day to day opertions tasks are being fulfilled.\n<br><br>\nEssential Functions of the Job\n\n\n<ul>\n<li>Day to day responsibilities for the Marketing Data Analyst include but are not limited to:</li>\n<li>Key Comepetencies and Responsbilites</li>\n<li>Build and manage complex data sets</li>\n<li>Works closely with analytics team and technical producers and to implement and monitor data collection tags and processes</li>\n<li>Assist with the development of an automated business intelligence reporting solution for marketing</li>\n<li>Support analytics department to understand key performance indicators</li>\n<li>Strong interst in driving for results and problems solving</li>\n<li>Ability to manage multiple tasks as once</li>\n<li>Team Player</li>\n<li>Develops positive working relationships</li>\n<li>Maintains a professional, can-do attitude at all times</li>\n<li>Maintains effective communication, responding quickly and accurately</li>\n</ul>\n\n<strong>Required Skills</strong>\n<br><br>\n<strong>\n</strong><ul><strong>\n<li>Education:</li>\n\n</strong>\n\n<li>A bachelor's degree in a closely related field (such as Statistics, Marketing, Business, Advertising, Applied Economics, etc.)</li>\n\n<strong><li>Skills and Experience:</li>\n\n</strong>\n\n<li>0-2 years in web analytics group or similar department</li>\n<li>Experience with core measurement tools (Adobe Analytics, Google Analytics a plus)</li>\n<li>Proven passion, drive and active knowledge for emerging media and analytics tools</li>\n<li>Competencies (characteristics and work style)</li>\n<li>Strong analytical skills</li>\n<li>Ability to think and express ideas both strategically and tactically</li>\n<li>Results-oriented, with a commitment to accountability</li>\n<li>Adaptable to change</li>\n<li>Solid business acumen</li>\n<li>Ability to manage up well</li>\n<li>Well-organized, with excellent follow through, an ability to work well under pressure, to effectively manage multiple projects simultaneously, and an ability to consistently meet deadlines</li>\n</ul>"}