{"job title": "Business Data Analyst", "company": "CyberCoders", "city state": "– Fort Worth, TX", "rating": "3.9", "job description": "Business Data Analyst <div>\nIf you are a Business Data Analyst with experience, please read on!</div>\n<br>\nTop Reasons to Work with Us<div>\n\n\n<ul>\n<li>Health, Dental, Vision!</li>\n<li>401K</li>\n<li>Growing Company!</li>\n<li>Vacation/Sick!</li>\n<li>Much More!</li></ul></div>\n\n\nWhat You Will Be Doing<div>\nAs the Business Data Analyst you will be responsible for querying data, understand the results, and make the data easy to understand. You will need to understand all business data, eligibility sales, claims, payments, and be very efficient with SQL statements. If you have at least 5 years of experience as a Business Data Analyst and have Healthcare experience please feel free to apply today or email me at jared.scinto@cybercoders.com!</div>\n<br>\nWhat You Need for this Position<div>\nMore Than 5 Years of experience and knowledge of:\n\n\n<ul>\n<li>Business Data Analyst</li>\n<li>Health Insurance</li>\n<li>SQL</li>\n<li>Healthcare</li>\n<li>Software Development</li>\n<li>Reporting</li>\n<li>Excel</li></ul></div>\n\n\nWhat's In It for You<div>\n\n\n<ul>\n<li>Vacation</li>\n<li>Medical</li>\n<li>Dental</li>\n<li>Vision</li>\n<li>Relocation</li>\n<li>Bonus</li>\n<li>401k</li></ul></div>\n\n\n<div>\nSo, if you are a Business Data Analyst with experience, please apply today!</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}