{"job title": "Senior Data Analyst", "company": "Eclaro", "city state": "– Jersey City, NJ", "rating": "4.1", "job description": "Kick start your career in Financial Services. Eclaro is looking for a Senior Data Analyst for our client in Jersey City, NJ.\n<br><br>\nEclaro’s client is a full-service bank providing a wide spectrum of corporate, commercial, retail banking, and wealth management solutions with offices across the United States. If you’re up to the challenge, then take a chance at this rewarding opportunity!\n<br><br>\n<strong>RESPONSIBILITIES:</strong>\n<ul>\n<li>Document Data sourcing requirement ,including data flow and working with source system for the data required for AML platform.</li><li>Work with AML Up streams systems including Data Ware house and create data extraction document for Payment data – Wire ,ACH and Core Banking data.</li><li>Analyze the source data to support business and provide the clarity to business questions.</li><li>Guide the Development team of the AML \"Data requirements” to fulfill the implementation for AML platform project.</li><li>Create Data flow diagrams and mapping documents as required for payment wire data and Core Banking data (Deposit, Loan and Credit Control).</li><li>Understand the Data transformation process with Development team and ensure AML platform consumed the cleansed good quality data.</li><li>Translate test data requirements from source system to support AML platform design activities.</li><li>Prepare SQL scripts during the data sourcing validation and document the process followed.</li><li>Co-ordinate with Business to ensure the AML data requirements are met</li>\n</ul>\n<strong>EXPERIENCE/ SKILLS REQUIRED</strong>:\n<ul>\n<li>More than 8+ hands-on experience in creating/refining business and functional requirements, Data Analysis and Documentation.</li><li>Solid experience in the Database SQL skills and ETL knowledge.</li><li>Experience with Waterfall SDLC.</li><li>Able understand the Core Banking (Deposit, Loan, Credit Control) data , Payments data and co-ordinate with multiple source systems as required.</li><li>Experience working with Wire ,SWIFT formats and ACH transactions data.</li><li>Experience working with Data Quality Monitoring and Reconciliation process.</li><li>Should have Data Modelling skill.</li><li>Skills required:\n\n<ul>\n<li>Data Analysis</li><li>SQL skills</li><li>ETL</li><li>Informatica</li><li>SAS DI</li><li>Documentation</li><li>Presentation</li></ul></li>\n</ul>\nIf hired, you will enjoy the following Eclaro Benefits:\n<ul>\n<li>401k Retirement Savings Plan administered by Merrill Lynch</li><li>TransitChek Pretax Commuter Benefits</li><li>Eligibility to purchase Medical, Dental &amp; Vision Insurance through Eclaro</li>\n</ul>\n<strong>Equal Opportunity Employer:</strong> Eclaro values diversity and does not discriminate based on Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status."}