{"job title": "Data and Reporting Analyst", "company": "Patelco Credit Union", "city state": "– Pleasanton, CA", "rating": "3.5", "job description": "The Data Reporting Analyst is a key technical resource responsible primarily for design, development, and deployment of processes in response to requests for periodic and reoccurring reports of enterprise data to ensure Patelco Credit Union achieves project goals as prioritized by IT Management and Credit Union Leadership. Focused on normalizing and standardizing data provided to business users from the Fiserv/Spectrum core, our account and loan origination systems, financial reporting systems, and other third party or in-house systems, this position will work closely with the Data Analytics group, other groups in IT, and key representatives of other business units to accomplish Credit Union priorities.\n<ul>\n<li>Complete accurate, project tasks, on time, supporting project and business requests for data.</li><li>Research, design, test, and deploy solutions to respond to requests for periodic and reoccurring data from the business units and IT Teams.</li><li>Analyze data sourced from the Core banking system (Fiserv/Spectrum) and other systems of record in the Patelco infrastructure including account and loan origination systems, downstream SQL databases, and third party systems to recommend changes to procedures, processes and systems to identify, document, and correct non-normalized data; with explicit consideration to the value of correction, and the effects of the recommended changes to existing systems, documentation, and procedures.</li><li>Implement high quality processes to export, transform, and promote data downstream from source systems into Patelco’s data infrastructure using Microsoft SSIS.</li><li>Work with IT Management, Project management, Business Analysts, and business partners to validate the accuracy of business requirements.</li><li>Provide technical support and advice to all areas of IT and Credit Union end users.</li><li>Other duties as assigned.</li></ul>\n\n<ul>\n<li>Bachelor’s degree, or equivalent from an accredited college, technical, business, and vocational school in Computer Science, Data Science, Management Information Systems or a related field; or equivalent work experience.</li><li>Three (3) years of experience working with MS SQL Server (2008R2/2012/2014/2017) Data Tools, SSIS/SSRS, SQL Management Studio, and/or Visual Studio</li><li>Three (3) years of hands-on experience in SQL, T-SQL and/or other scripting languages for data extraction and manipulation.</li><li>Two (2) years of experience in design and deployment of solutions for a financial institution (highly preferred) or other regulated industry (such as HealthCare, Education, or Governmental agency).</li><li>Two (2) years of hands-on experience with ETL/Data Warehousing methodologies, including database normalization, indexing/performance, and query optimization.</li><li>Two (2) years’ experience in project execution and/or management, with exposure and use of the tools, techniques, and methods employed for successful project management.</li><li>Intermediate skills in systems development lifecycle, scrum, agile, etc.</li><li>Intermediate skills in project definition, task management, and project reporting in one or more project management applications, such as Microsoft Project, Eclipse, JIRA, Microsoft Team Foundation Server, Asana, or Basecamp.</li><li>Intermediate skills in Microsoft Office applications including Word, Excel, Outlook, Visio (or other visualization application), and PowerPoint. Advance MS Excel skills preferred.</li><li>Intermediate skills in Unix shell scripting.</li><li>Knowledge of a Unix environment terminal emulation application, such as Putty or Reflections.</li><li>Strong written and oral/verbal communication abilities, including strong listening and interpersonal skills</li><li>Strong attention to detail and documentation skills</li>\n</ul>\nPhysical Requirement:\n<ul>\n<li>This position is based out of the Pleasanton Headquarters office.</li> <li>Limited travel requirements, but may be requested to attend meetings, training, or seminars at other locations.</li>\n</ul>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}