{"job title": "Safety Data Analyst", "company": "Patel Consultants Corporation", "city state": "– Jersey City, NJ", "rating": "4.1", "job description": "Job Description<div>Manages Drug Safety Data Systems to ensure the timely creation, deployment and maintenance of databases required by MTDA projects. Analyzes study protocol and project requirement(s), identifies drug safety data quality rules, and design data entry interfaces in accordance with SOPs, client requirements, and regulatory guidelines.\n<br><br>\nProvides technical support for the Drug Data Systems employed in processing and management of study safety data encompassing reporting tools for data review and Drug Safety metrics, performance and quality, generation. Resolves Drug Safety data integrity issues and addresses database design inconsistencies over time. Manages and monitors interactions with Drug Safety project specific third party vendors. Identifies process optimization to improve efficiencies. Develops and maintains standard library (global, therapeutic and client specific). Provides technical support to the Global Drug Safety Data Management staff and Project Team for existing databases, user interface, reporting tools, metrics generation and E2B / CDISC standards.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\n· Deploy complete, accurate and efficient database(s) for the purpose of Drug Safety Data Management and Data Processing. To conduct and support design and programming of data entry interface, data structures and quality rules for assigned projects and studies.\n<br><br>\n· Support and ensure the preparation, transfer and integration of safety data from internal and external sources into the database.\n<br><br>\n· Provide safety data in various formats and applications to Drug Safety data management customers.\n<br><br>\n· Ensure high quality deliverables, good cooperation with internal and client partners and active participation in project teams.\n<br><br>\n· Setup of Drug Safety Data Management tools for study conduct. (e.g., data quality checks, validity tool, coding call, SAE, etc.)\n<br><br>\n· Full Drug Safety study programming and validation responsibility - Develop, program, test and maintain computer edit/validation checks.\n<br><br>\n· Develop programs for transformation of the acquisition of drug safety data from the ‘core’ Data Systems to a definitive study database to meet MTDA / client project standards.\n<br><br>\n· Ensure in conjunction with Drug Safety Data Project Manager adherence to MTDA standards and validation of all study related calculations and data mappings.\n<br><br>\n· Full responsibility for safety data exchange with external parties, for example, client, third party vendors (Labs, ECG, etc.) and Safety / Independent Data Monitoring Committees.\n<br><br>\n· Provide ongoing day to day end-user support to the US Drug Safety team to ensure all drug safety systems and programs are executing correct and efficiently.\n<br><br>\n· Setup and support of data review and reporting tools required by stakeholders in Global Drug Safety, Clinical, Medical, and Regulatory Affairs and where required Client Study Management Team.\n<br><br>\n· Provide technical expertise and programming support for MTDA projects and safety data management staff.\n<br><br>\n· Communicate project status and key project issues to Drug Safety Data Manager.\n<br><br>\n· Assist in developing new Drug Safety Data Systems programming procedures and processes.\n<br><br>\n· Keeps current with technological advances and coordinates activities with Global Training and Information Technology Team in an effort to maximize their potential use in managing data.\n<br><br>\n· Provide mentoring and training of others.\n<br><br>\n· Assist in delegating work.\n<br><br>\n· Run and review Drug Safety department metrics, plus perform some root cause analysis.\n<br><br>\n· Manages Drug Safety Data Systems and support projects at MTDA with special attention to the administration and evaluation of Drug Safety Data Systems including but not limited to Global Safety Database, Query Tool, CDMS, EDC, Clinical and Regulatory Systems, ensuring that all submission safety data are captured and stored in a validated environment consistent with 21 CFR part 11.\n<br><br>\n· Supports, maintains and utilizes standardization of electronic modules, data quality rules, data structures, data libraries, code lists, and dictionaries in conjunction with input from other functional areas and project teams and in accordance with E2B / CDISC standards.\n<br><br>\n· Provides technical expertise to project teams in the operational aspects of Drug Safety Data Systems and support, ensuring consistency among systems to avoid redundancy, inefficiency, or potential problems; and keeps current with technology trends as they affect data systems management.\n<br><br>\n· Manages and coordinates activities of Drug Safety vendors through the project cycle of all studies from study start up to archival ensuring adherence to MTDA procedures and policies.\n<br><br>\n· Provides training in use of systems, including but not limited to ARISg Safety, ARGUS Safety, Oracle / Clinical and EDC, as well as, the application and use of electronic modules, data quality rules, data structures, data libraries, code lists, and dictionaries to other functional areas and project teams.\n<br><br>\n· Manages and coordinates external vendors’ activities ensuring their adherence to contract specifications.\n<br><br>\n· Manages and coordinates the integration / consolidation and archival of drug safety databases in accordance with applicable MTDA, client and / or regulatory guidelines.\n<br><br>\n· Evaluates external vendors and technologies as to their ability to perform in accordance to MTDA goals, procedures, and quality standards prior to contract finalization.\n<br><br>\n· Identifies areas of process improvement that may be provided by standardization and/or technology to increase efficiency, quality and timeliness of safety data management processes and deliverables.\n<br><br>\n· Provides Drug Safety metric reports for monitoring the progress of projects and processes for reporting to management and project teams.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n· BA/BS in a life or computer science, Master's Degree in Science, Biological or Computer Science preferred or a combination of education and experience\n<br><br>\n· 3 to 5 years pharmaceutical/ Drug Safety Data Management, Clinical Data Management.\n<br><br>\n· Excellent oral and written communication skills\n<br><br>\n· Proficient in the use of computer software systems (Word, Excel, PowerPoint, Microsoft Project, Share Point, CTMS, timesheet software, etc.)\n<br><br>\n· Excellent problem solving, analytical, organization and time management skills\n<br><br>\n· Customer focus, flexibility\n<br><br>\n· Good project management skills\n<br><br>\n· SAS programming experience preferred\n<br><br>\n· Strong experience in using data management technologies (clinical data management systems, electronic data capture, data review tools, data warehousing)\n<br><br>\n· Expert in Global Drug Safety databases, or Oracle Clinical, SAS, SQL\n<br><br>\n· Expert in Query Tools, electronic data capture system(s) such as Spotfire, Business Objects, Crystal Reports, InForm, Rave\n<br><br>\n· Experience in developing drug safety data management standards\n<br><br>\n· Ability to apply 21 CFR Part 11 standards to Drug Safety Data System deployment\n<br><br>\n· Experience managing vendors\n<br><br>\n· Experience with additional programming languages and tools will be a plus\n<br><br>\n· Experience with clinical studies.\n<br><br>\n· Demonstrate knowledge in research design, system validation, E2B / CDISC, standard coding dictionaries (MedDRA)\n<br><br>\n· Experience with regulatory submissions (e.g. BLA, NDA, NDS, MAA, etc.)\n<br><br>\n· Positive attitude and an ability to creatively use programming skills across variety of tasks in the Clinical Programming area.\n<br><br>\n· Strong communication and presentation skills, including experience with multicultural audiences.\n<br><br>\n· Critical thinking skills, ability to set priorities and develop strategies/studies to answer complex research questions\n<br><br>\n· Experience managing multiple projects, often complex in nature and with both internal and external stakeholders under short timelines.\n<br><br>\n· Ability to work effectively in a cross-functional, project team environment and manage several ongoing projects\n<br><br>\n· Experience working in a regulatory agency and/or past experience supporting regulatory filings preferred.\n<br><br>\n· Good understanding of advanced design and analysis techniques used in the analysis of secondary data (e.g., matching, multivariate regression, etc.).\n<br><br>\n· Ability to conceptualize the presentation of results (e.g., develop layout of tables and figures for inclusion in analysis plans).\n<br><br>\n· Ability to clearly communicate written results in drafts of study reports, presentations, publications, and other key project documents.\n<br><br>\n· Ability to contribute to written processes to ensure consistent and quality deliverables.\n<br><br>\n· Strong oral and written communication.</div>Company Description<div>Founded in 1973, Patel Consultants Corporation is an employee-based, customer-oriented, Information Technology Services firm specializing in offering a wide range of IT Staffing Solutions to our growing customer base. Our sustained growth for over 30 years is owing to the focus we place on the recruitment and retention of our consultants as well as a formidable customer-oriented sales staff. We can state with pride that a large number of Patel consultants are nearing ten years of employment with us. Our ability to successfully retain employees has allowed us to build lasting customer relationships with our business partners.</div>"}