{"job title": "Data Analyst Internship", "company": "Ted Todd Insurance", "city state": "– Atlanta, GA", "rating": "4.0", "job description": "At Ted Todd Insurance, our mission is to leave anyone we come into contact with better than we found them. Our mission statement includes clients, team members, and even prospects who have never bought from us because we want to change the way the world views insurance.\n<br><br>\nTed Todd Insurance is the largest Allstate Agency in the country, and we are constantly evolving. We are an established business with a rich 32-year history, but we run ourselves like a startup. This means were lean, flexible, and open to new ideas and collaboration. We aim to be the best place to work and a company you can be proud to work with.\n<br><br>\nWe focus on modernizing insurance sales and customer service by providing our team with the best and most up to date technologies. With high-end compensation, health and wellness benefits, and a leadership team that is passionate about providing the best employee experience in the industry, it is simply left to the individual to make the kind of living that they not only envision for themselves, but for their loved ones as well.\n<br><br>\n<u><strong>Why Intern with us?</strong> </u>\n\n<ul>\n<li>Flexible Hours - we know youre juggling a lot of responsibilities and will work around</li>\n<li>your needs.</li>\n<li>Supporting Cast - We hire less than 1% of applicants and these will be your mentors.</li>\n<li>Improve your Resume - Youll learn real skills that will make your resume shine to employers.</li>\n<li>We understand you - Many of our team members arent far removed from where you are today.</li>\n<li>Career Development - Our goal is to find exceptional people and place them in a full-time role after their internship ends should they decide to stay.</li>\n<li>We Bridge the Gap - We know how hard it is to find that first opportunity and were here to help.</li>\n<li>Pain Internship - $14.00 per hour</li>\n</ul>\n<strong><u>Qualities of a Successful Intern</u> </strong>\n\n<ul>\n<li>Fun - We want people who can have fun at their own expense.</li> \n\n<li>Positive - Life is too short to work with negative people!</li> \n\n<li>Self-Starter - We give our reps autonomy, so you must be able to self-manage.</li> \n\n<li>Humble - Admitting your shortcomings is the first step towards improvement.</li> \n\n<li>Coachable - Were here to help you develop so we can grow together.</li> \n\n<li>Integrity - Were here to help people and we never cut corners.</li> \n\n<li>Competitive - We want the people who hate to lose.</li> \n\n<li>Growth Mindset - We push for progress, not perfection.</li> \n\n<li>Hardworking - We want the hardest working people in the industry.</li> \n</ul>\n<strong><u>Responsibilities</u></strong>\n\n<ul>\n<li>Complete both industry level and corporate level analysis and research</li>\n<li>Develop new and utilize existing templates to support efficient initial and ongoing analysis</li>\n<li>Retrieve, interpret, and summarize data from various information systems for inclusion into research or operating reports</li>\n<li>Generate reports, presentations, graphics, forms and other documents to demonstrate information flow and project results. May make presentations of periodic reports or special projects to organizational management.</li>\n<li>Assist designated mentor for 2 hours a day with their tasks</li> \n\n<li>Validate data including determining outliers and other test cases that stress the current application</li>\n</ul>\n<strong><u> Minimum Requirements</u> </strong>\n\n<ul>\n<li>Over 18 years of age</li> \n\n<li>Legal United States Resident</li>\n<li>Never convicted of a felony</li> \n\n<li>High School Diploma or Equivalent</li> \n\n<li>Excellent written and oral/presentation skills</li> \n\n<li>Fluent in English</li> \n\n<li>Ability to type 50+ wpm and a strong proficiency with computers and technology</li> \n\n<li>Ability to intern for 90 days - Internships are 90 days and can be renewed in perpetuity</li> \n\n<li>Ability to work 25-40 hours a week based on school schedule</li>\n<li>Must be able to work in Atlanta GA</li>\n</ul>\n<strong><u>Preferred Qualifications</u> </strong>\n\n<ul>\n<li>Currently enrolled in an undergraduate or masters university program with focus in data analytics, mathematics, computer science, statistics, econometrics, or social science-organizational-operations research. Planned graduation date of May 2019</li>\n<li>Extremely proficient in Microsoft Excel and Microsoft PowerPoint</li>\n<li>Experience working with large databases, data visualization tools (e.g., Tableau) and statistics preferred</li>\n<li>Exceptional analytical and quantitative problem-solving skills</li>\n<li>Strong multi-tasking abilities, flexibility, and patience in a fluid environment</li>\n</ul>\n<u>EQUAL OPPORTUNITY</u>\n<br><br>\nAt Ted Todd Insurance we believe that a diverse workplace means a better, more resilient, and more innovative company. We are excited to work with anyone who shares our values regardless of race, color, national origin, citizenship, ancestry, familial pedigree, education, religion, gender, sexual orientation, age, marital status, disability, or veteran status.<br>\n<div>\n</div>\n<br>"}