{"job title": "Data Analyst Clerk - Temp to Hire", "company": "Tyler Technologies", "city state": "– Lubbock, TX", "rating": "3.7", "job description": "Job Description<div>Tyler Technologies is seeking temporary assistance on a Full-time basis to assist with an Excel/data project with our corporate finance team. This project will last 4-5 months. Hours are approximately 40 per week. Monday-Friday: 8 a.m. – 5 p.m.\n<br><br>\n<strong>You will:</strong>\n<ul>\n<li>Complete billing system updates, transferring data from ERP system into a web based reporting tool.</li><li>Monitor reporting from ERP to establish when updates are to be made.</li><li>Review reconciliation of customer balances to compare that balances in both systems match after adjustments. On exceptions or non-balancing accounts, research and review the cause of difference.</li><li>Work with Revenue Managers to document processes being performed to transfer data for correct processes and workflow procedures.</li><li>Input software projects and contracts into Tyler’s accounting and billing systems.</li><li>Set deferred revenue schedules to ensure compliance with US GAAP and Tyler revenue recognition policies.</li><li>Maintain positive, productive relationships with all internal resources as well as with customers.</li><li>Meets or exceed productivity standards in the completion of daily and monthly assignments and accurate production</li>\n</ul>\n<strong>Desired skillset:</strong>\n<ul>\n<li>Computer proficient, especially Microsoft Excel, Word and Adobe Acrobat</li><li>Excel knowledge helpful (formulas, creating new worksheets)</li><li>Strong attention to detail while working at a quick pace.</li><li>An understanding of accounting principles</li><li>Data entry experience with typing speed greater than 50 wpm.</li><li>Ten-key typing</li>\n</ul>\n<strong>Job Requirements:</strong>\n<ul>\n<li>HS Diploma or Equivalent</li><li>Ability to prioritize and complete multiple tasks in a fast-paced environment</li><li>Proven experience and proficiency with Microsoft Office products, especially Microsoft Excel</li></ul></div>\n<br>\nCompany Description<div>If you are looking for challenging and meaningful work that directly impacts our clients and communities, we offer a dynamic environment where employees collaborate on engaged and innovative teams. With more than 4,000 employees (and growing), Tyler has a 50-year track record of developing our people's careers while supporting strong work-life balances. Tyler encourages employees to think outside of the box, stay curious, build on their skills and be the drivers of their careers. Come join us and be a part of an organization that continuously empowers communities. Tyler Technologies is the largest software company in the nation solely focused on providing integrated software and technology services to the public sector — cities, counties, states and school districts.</div>"}