{"job title": "Data Analyst", "company": "US Government Other Agencies and Independent Organizations", "city state": "– Washington, DC", "rating": "NA", "job description": "<ul>\n<li>Videos</li>\n<li>Duties</li>\n</ul>\n\nHelpDuties Summary\n<br><br>\nThis position is located in the Office of Inspector General. Relocation expenses will not be paid.\n<br><br>\nLearn more about this agency\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nThe incumbent utilizes a diverse range of statistical, mathematical standards, computer programming, operations research, actuarial theories, principles and practices, concepts, laws, and diagnostic methods and techniques, to quantify performance in the discovery, interpretation, and communication of meaningful patterns in data collection to address substantive and technical issues or problems characterized by complex, controversial, and/or sensitive matters that contain several inter-related issues. The incumbent liaises with management to understand their requirements, ensuring that objectives are met.\n<br><br>\nDevelops and maintains applications using MS Access, Oracle and Sybase Standard Query Language (SQL), Python, and other computer models that support analytic methods and requirements.\n<br><br>\nThe incumbent designs models and devlops analyses that are used to mine enterprise systems and applications for knowledge and information that enhances OIG processes. Responsible for building, deploying and maintaining data support tools. Applies code writing skills, programming languages, and basic predictive models and scripting languages.\n<br><br>\nPerforms data discovery, data mining, predictive modeling simulation and visualization to further enhance insights and drive decisions based on the data. Applies sophisticated mathematical algorithms and modeling tools to a variety of data assets and develops critical solutions for multiple OIG areas. This includes working with unstructured or structured data and converting those data sets using a variety of analyses such as optimization, simulation, classical and spatial statistics, and/or programming languages.\n<br><br>\nPlans for and provides data analyses for OIG staff to satisfy internal and external reporting requirements. Develops, interprets, analyzes data extracts and reports form OIG systems and databases, and develops the most efficient and effective automated approaches for preparing/presenting OIG reports, charts, tables and graphs to support and satisfy management reporting requirements.\n<br><br>\nTravel Required\n<br><br>\nNot required\n<br><br>\nSupervisory status\n<br><br>\nNo\n<br><br>\nPromotion Potential\n<br><br>\n<strong>13</strong>\n\n\n<ul>\n<li>Job family (Series)</li>\n</ul>\n\n0301 Miscellaneous Administration And Program\n<br><br>\nSimilar jobs\n\n\n<ul>\n<li>Inspectors</li>\n<li>Requirements</li>\n</ul>\n\nHelpRequirements Conditions of Employment\n\n\n<ul>\n<li>US Citizenship.</li>\n<li>Suitable for employment as determined by a background investigation.</li>\n<li>Serve a probationary period of one year, if applicable.</li>\n<li>Males born after 12/31/59 must be registered with Selective Service.</li>\n<li>Must submit a financial disclosure statement upon assuming the position.</li>\n</ul>\n\nPlease note your resume must thoroughly support your responses to the vacancy questions. Your resume is an integral part of the process for determining if you meet the basic qualifications of the position and determining if you are to be among the best qualified.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nApplicants must meet eligibility and qualification requirements by the closing date of this announcement. Current Federal employees must meet time-in-grade requirements by the closing date of this announcement.\n<br><br>\nSpecialized Experience: Applicants must have a minimum of one year of specialized experience equivalent to at least the GS-11 in the Federal service. For this position, specialized experience includes the following:\n\n\n<ul>\n<li>Analyzing data using probability statistics and trend analysis;</li>\n<li>Writing statistical computer programs, design and perform computer simulation;</li>\n<li>Developing mathematical algorithms; and/or</li>\n<li>Applying code writing and programming languages (e.g., Python and SQL-Structured Query Language) basic and advance prediction models and fluency with scripting language (e.g., Python)</li>\n</ul>\n\nSpecialized Experience: Applicants must have a minimum of one year of specialized experience equivalent to at least the GS-12 in the Federal service. For this position, specialized experience includes the following:\n\n\n<ul>\n<li>Developing applications using Structured Query Language (SQL), Python, and other computer programming languages, and using these languages to build visualizations, reports or models that support analytic methods and requirements;</li>\n<li>Applying code writing skills, programming and scripting languages (e.g., Python, R, SQL, and Ruby) to mine enterprise systems, design data models, and develop analyses;</li>\n<li>Working closely with an investigative team to develop analytic requirements as part of a larger investigative strategy. This includes working with team members and managers to understand relevant investigative risks (e.g., chain of custody issues; data preservation; documentation of methods for repeatability to analysis; data security), proposing risk-mitigation solutions to managers and investigators, and working to implement approved solutions; and/or</li>\n<li>Working with managers and team members to ensure that the team's time and resources are allocated properly considering office-wide priorities among teams and projects/cases.</li>\n</ul>\n\nPART-TIME OR UNPAID EXPERIENCE: Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.Applicants must meet eligibility and qualification requirements by the closing date of this announcement. Current Federal employees must meet time-in-grade requirements by the closing date of this announcement.\n<br><br>\n<strong>Education</strong>"}