{"job title": "Scientist - Pharmacokinetics and Drug Metabolism (PKDM)", "company": "Amgen", "city state": "– Thousand Oaks, CA", "rating": "3.7", "job description": "Amgen is seeking a Scientist to work out of their Thousand Oaks, CA location. This position reports to the Director Preclinical.\n<br><br>\nThe department of Pharmacokinetics and Drug Metabolism (PKDM) within Amgen is dedicated to the discovery and development of novel effective, safe medicines. PKDM scientists work closely in partnership with disciplines such as protein therapeutics, medicinal chemistry, pharmacology, toxicology, pharmaceutical sciences and clinical pharmacology and regulatory to design promising clinical therapeutic candidates, conduct preclinical development studies, support clinical evaluation and contribute to regulatory submissions.\n<br><br>\nWe are seeking a Scientist who will contribute to developing, validating and implementing robust bioanalytical methods for the measurement of large molecule biotherapeutics. These methods will be used to support both nonclinical and clinical studies.\n<br><br>\nThe primary responsibilities of the Scientist will include:\n\n\n<ul>\n<li>Design and execution of innovative scientific experiments for development, validation and implementation of robust bioanalytical methods for large molecule biotherapeutics, including Oligonucleotides in clinical and nonclinical study samples.</li>\n<li>Develop and implement new and novel protocols to address specific issues and/or troubleshoot and improve current existing assay platforms towards being more robust and transferable.</li>\n</ul>\n\n<strong>Basic Qualifications:</strong>\n<br><br>\nDoctorate degree\n<br><br>\n<strong>OR</strong>\n<br><br>\nMaster's degree and 4 years of pharmaceutical-biotechnology and/or CRO industry and/or Scientific experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nBachelor's degree and 6 years of pharmaceutical-biotechnology and/or CRO industry and/or Scientific experience\n<br><br>\n<strong>Preferred Qualifications:</strong>\n<br><br>\n<strong>+ BS</strong>\n<br><br>\n+ 2+ years of laboratory experience.\n<br><br>\n+ Experience in any of the following areas: immunology, immunochemistry, biochemistry, or cell biology.\n<br><br>\n+ Working knowledge of the regulatory (GxP) requirements for bioanalysis in drug development and possess critical thinking skills with an ability to integrate data and information to solve complex problems to advance drug discovery and development programs.\n<br><br>\n+ Experience communicating complex ideas to audiences with varying degrees of knowledge.\n<br><br>\n+ Demonstrated ability to drive scientific excellence and innovation.\n<br><br>\n+ Demonstrated experience of contributing as lead author on external peer review publications.\n<br><br>\n+ Ability to work in a team environment with excellent verbal and written communication skills.\n<br><br>\n<strong>\\#LI-SF5</strong>\n<br><br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status."}