{"job title": "Machine learning Research Scientist", "company": "Applied Communication Sciences", "city state": "– US-NJ-Red Bank", "rating": "3.4", "job description": "<div><div>\n<div>Every day at Perspecta, we enable hundreds of thousands of people to take on our nation’s most important work. We’re a company founded on a diverse set of capabilities and skills, bound together by a single promise: we never stop solving our nation’s most complex challenges. Our team of engineers, analysts, developers, investigators, integrators and architects work tirelessly to create innovative solutions. We continually push ourselves—to respond, to adapt, to go further. To look ahead to the changing landscape and develop new and innovative ways to serve our customers.\n<br><br>\nPerspecta works with U.S. government customers in defense, intelligence, civilian, health care, and state and local markets. Our high-caliber employees are rewarded in many ways—not only through competitive salaries and benefits packages, but the opportunity to create a meaningful impact in jobs and on projects that matter.\n<br><br>\nPerspecta’s talented and robust workforce—14,000 strong—stands ready to welcome you to the team. Let’s make an impact together.\n<br><br>\nPerspecta is an AA/EEO Employer - Minorities/Women/Veterans/Disabled and other protected categories</div>\n</div>\n</div>\n\n<br>Responsibilities<br>\n\n<div>\n<div>\n<div>Perspecta Labs applies research in machine learning and data analytics to multiple areas including cyber security, IP networking, Wireless and sensor networks, Power and Smart Grid to name just a few, for government and commercial customers. Our customers include DARPA, the U.S. Army Research Labs, the U.S. Air Force Research Labs, the U.S. Army CERDEC, and others.\n<br><br>\nWe are looking for a dynamic individual skilled in the areas of machine learning and data analytics and interested in working in small to mid-size multi-disciplinary teams. Responsibilities will include performing applied research, formulating and defining new projects and proposing new areas of work, including participating in writing proposals for new funding.</div>\n</div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div>Requires 5 to 8 years with BS/BA or 3 to 5 years with MS/MA or 0 to 2 years with PhD.\n<ul>\n<li>U.S. Citizenship (This is an absolute requirement, no exceptions. This is required due to requirements imposed by contracts with the Federal government.)</li><li>M.S. or Ph.D. degree in a field related to machine learning (Computer Science, Statistics, Mathematics, Electrical Engineering or related field).</li><li>5 years of work experience in a relevant field.</li><li>Hands-on skills in implementation of machine learning techniques and development of software systems that incorporate machine learning.</li><li>Ability to apply machine learning to real-world problems, such as cyber security, IP networking, sensor networks, power grid, image, video and social network analysis, or other relevant areas.</li><li>Effective communication and writing skills.</li></ul></div>\n</div>\n</div>\n<br>"}