{"job title": "Clinical Safety Scientist", "company": "CSL Behring", "city state": "– King Of Prussia, PA", "rating": "3.1", "job description": "Clinical Safety ScientistUnited States of AmericaR-0667262012 CSL Behring L.L.C.\n\n\n<ul>\n<li>*Job Description**</li>\n</ul>\n\nThe Clinical Safety Scientist is an integral member of the Global Clinical Safety and Pharmacovigilance Risk Management function and is a key contributor to the lifecycle risk management activities of CSL products.\n<br><br>\nThe Clinical Safety Scientist is responsible for conducting integrated safety surveillance, review, analysis of relevant clinical safety data of CSL medicines throughout their lifecycle, that is, for products in clinical development and CSL manufactured products on the market in collaboration with the Clinical Safety Physician.\n\n\n<ul>\n<li>*Responsibilities:**</li>\n<li>Support Clinical Safety Physicians in the safety review process and evaluation of safety data throughout the product lifecycle using a combination of quantitative and qualitative approaches</li>\n<li>Undertake signal detection activities on safety data sets from various sources, such as spontaneous adverse event listings, clinical trial datasets, reports or datasets from observational studies- and present summaries of the data in a meaningful way</li>\n<li>Review publications from the scientific and medical literature for important safety information; summarize and critically appraise the findings from these publications for safety reports (such as periodic safety update reports, signal detection reports, signal evaluations)</li>\n<li>Drafting of safety-related documents, particularly sections relating to safety risk management e.g. periodic safety update reports, development safety update reports, clinical overview addenda to support registration activities; and contributing to/ reviewing safety sections of other clinical or regulatory documents including Investigator?s brochures and submission dossiers</li>\n<li>Contribute to the production of, and updates to, Risk Management Plans for CSL manufactured products, including drafting of the safety sections</li>\n<li>Support ongoing risk management activities by participation in and coordination of the operational and scientific activities associated with internal cross functional Safety Management Teams for the associated products.</li>\n<li>Participate in associated development teams, such as the Study Execution Team and the Clinical Development Team, in collaboration with the Clinical Safety Physician</li>\n<li>Support the physician in providing responses for safety-related questions from internal sources and/or external regulatory requests</li>\n<li>Contribute to quality improvement: Review, prepare, and/or update local and global SOPs and working instructions as required</li>\n<li>*Education:**</li>\n</ul>\n\n+ Bachelor?s degree required in the biological, nursing or pharmaceutical sciences\n<br><br>\n+ Advanced clinical/scientific degree preferred\n\n\n<ul>\n<li>*Experience:**</li>\n</ul>\n\n+ Understanding of pharmacovigilance and global clinical safety methodology and regulations, guidelines and standards.\n<br><br>\n+ Knowledge and experience of safety monitoring and signal detecting preferred.\n<br><br>\n+ Understanding of ICH GCP and drug development preferred.\n<br><br>\n+ Computer proficiency in basic database entry and graphics presentations (e.g. Microsoft Excel or equivalent).\n<br><br>\n+ Excellent written and verbal communication skills in English, with the ability to evaluate, interpret and synthesize scientific data.\n<br><br>\n+ Self-motivated, able to prioritize and plan effectively\n<br><br>\n+ Ability to work independently and as a team player, working in a global cross functional environment.\n<br><br>\n<strong>Share:</strong>\n<br><br>\nState/ProvincePennsylvania\n<br><br>\nCityKing of Prussia\n<br><br>\nStreet Address1020 First Avenue\n<br><br>\nPrimary LocationCSL Behring King of Prussia\n\n\n<ul>\n<li>*Equal Opportunity Employer**</li>\n</ul>\n\nCSL is an Equal Opportunity Employer. If you are an individual with a disability and need a reasonable accommodation for any part of the application process, please click below."}