{"job title": "Chemoinformatics Scientist", "company": "DiCE Molecules Corporation", "city state": "– Redwood City, California", "rating": "NA", "job description": "DiCE Molecules is focused on the development of DNA-programmed chemical synthesis and its application to drug discovery. Our innovative platform unites the power of directed evolution with organic synthesis to identify and optimize hits against challenging pharmaceutical targets. We are a startup with ~ 25 employees located in Redwood City, California. Join our team and take part in transforming traditional Medicinal Chemistry by performing optimization on a massive scale.\n<br><br>\nWe seek an exceptional chemoinformatics scientist to join our Informatics team. Responsibilities include building and utilizing tools to analyze results from DNA-programmed libraries of small molecules to prioritize hits for resynthesis as well as identifying commercially available building blocks to develop structure activity relationships. The candidate will work closely with the chemistry team during the library design, synthesis, and hit profiling stages on multiple targets and libraries.\n<br><br>\nCandidate must (i) have a firm understanding of the medicinal chemistry process and drug property design (ii) be comfortable manipulating and drawing conclusions from large datasets, taking many factors and types of data into consideration and (iii) have familiarity and skills in chemoinformatics including physicochemical property prediction, library enumeration, chemical fingerprinting, and substructure searching. Familiarity with tools such as Pipeline Pilot, Vortex/Spotfire, Knime, R, Python, and experience with chemical registration databases (e.g. Dotmatics) is preferred.\n<br><br>\nKey Skills Required:\n\n<ul>\n<li>Highest integrity; committed to ethics and scientific standards</li>\n<li>Experience in drug design and optimization</li>\n<li>Experience with chemoinformatics</li>\n<li>Exceptional scientific thinker, ability to drive innovation and creative thinking</li>\n<li>Strong organizational and time-management skills</li>\n<li>Excellent written and oral communication skills</li>\n<li>Strong interpersonal skills with the ability to collaborate with and influence others at all levels</li>\n<li>Team player; comfortable and effective in a collaborative research environment</li>\n</ul>\nEducation and Experience:\n<br><br>\nPhD in chemistry, computational chemistry, or chemoinformatics or MS/BS in chemistry with 4-8 years laboratory experience in Medicinal Chemistry."}