{"job title": "Principal Clinical Scientist, Clinical Development", "company": "Endo International", "city state": "– Malvern, PA", "rating": "3.2", "job description": "<strong>Job Description</strong>\n<br><br>\nJob Title\n<br><br>\nPrincipal Clinical Scientist, Clinical Development\n<br><br>\nCompany\n<br><br>\nEndo\n<br><br>\nFunction\n<br><br>\nClinical Development\n<br><br>\nLocation(s)\n<br><br>\nMalvern, PA\n<br><br>\nDepartment\n<br><br>\nResearch &amp; Development\n<br><br>\nDirect Reports (list)\n<br><br>\nn/a\n<br><br>\nReports to (title)\n<br><br>\nHead Clinical Development\n<br><br>\nDate Submitted\n<br><br>\n<strong>04/09/2018</strong>\n<br><br>\n<strong>To be completed by Corporate Compensation:</strong>\n<br><br>\nJob Code\n<br><br>\nBand\n<br><br>\nDate Reviewed\n<br><br>\n<strong>5/2/2018</strong>\n<br><br>\nBenchmark\n<br><br>\n<strong>EEO</strong>\n<br><br>\nFLSA (USA only)\n<br><br>\nExempt\n<br><br>\nJob Summary - a concise overview of the job\n<br><br>\nThe Principal Clinical Scientist, Clinical Development participates in the Clinical Development (CD) strategy and plan and contributes to various deliverables necessary for effective and efficient execution CD plan for all studies/projects. This role has primary responsibility for contributing to CD activities including the design and development of clinical studies, writing various clinical documents such as, but not limited to, clinical study synopsis, clinical study protocol, investigator brochures etc.\n<br><br>\nThe Principal Clinical Scientist, Clinical Development will represent CD on various sub-teams, acting as a primary point-of-contact for questions and inquiries to CD regarding CD studies or other programs, contributing to ongoing study data reviews, and providing CD inputs on clinical study designs. This role is likely to join in regular interactions with clinical sites/Investigators, external vendors supporting the work of CD, and Clinical Operations colleagues in support of the overall CD strategy. It will also work closely with the project management team and will be responsible for overall tracking of projects/departmental activities and provide timely updates to Head Clinical Development.\n<br><br>\nAll incumbents are responsible for following applicable Division &amp; Company policies and procedures.\n<br><br>\nScope of Authority - span of control (work unit, site, department, division, etc.), monetary value of budget/spend authority ( capital, operating, etc.), P&amp;L responsibility, etc.\n<br><br>\nEndo Branded ? domestic and international; reviews budgets; oversees contractors\n<br><br>\nKey Accountabilities - key outcomes/deliverables, the major responsibilities, and % of time\n<br><br>\nAccountability\n<br><br>\nKey Responsibilities\n<br><br>\n% of Time\n<br><br>\nClinical Lead\n<br><br>\n+ Lead cross-functional clinical development teams.\n<br><br>\n+ Lead development of study designs.\n<br><br>\n+ Lead writing of protocols, and amendments, ICFs, and clinical sections of other documents.\n<br><br>\n+ Interact with thought leaders in various therapeutic areas.\n<br><br>\n+ Track and update CD team on the CD deliverables across the all clinical studies/projects.\n<br><br>\n+ Oversee regular maintenance and update of the CD project folders/drives.\n<br><br>\n<strong>35%</strong>\n<br><br>\nClinical Study Planning Development, Data and Reports\n<br><br>\n+ Author and/or provide operational input into study documents such as Protocol Synopses, Protocols, Protocol amendments, Administrative Change letters etc.\n<br><br>\n+ Ensure trial implementation according to the protocol.\n<br><br>\n+ Provide CD contributions to trial-related documents such as the IBs, ICF, CRFs, CRF Completion Guidelines, Study Execution and Monitoring Plans, Clinical Data Review Plan, Clinical Database specifications, statistical analysis plan, the data management plan, the medical monitoring plan, Clinical Study Report (CSR) etc.\n<br><br>\n+ Provide regular and ad-hoc data reviews and interpretation; prepare and present summaries/documentations of these reviews.\n<br><br>\n+ Support the development of program-level documents, including, but not limited to, abstract and manuscripts, presentations, and various other internal and external documents and communications as needed.\n<br><br>\n+ Support identifying, contracting and engaging subject matter experts/thought leaders in advisory board meetings, consultancy etc.\n<br><br>\n<strong>35%</strong>\n<br><br>\nClinical Operations\n<br><br>\n+ Assist Head Clinical Development with developing the operational strategies for clinical research studies and development programs (e.g. PI selection, CRO selection, budgets).\n<br><br>\n+ Participation in vendor selection, specification development, and management/oversight.\n<br><br>\n+ Facilitation of country and site feasibility/selection processes.\n<br><br>\n+ Develop/coordinate study training for study team, investigational sites, and vendors.\n<br><br>\n+ Assist Clinical Leads with scientific and data-related queries.\n<br><br>\n<strong>15%</strong>\n<br><br>\nSafety &amp; Efficacy\n<br><br>\n+ Collaborate with the medical monitor to identify any trial-related safety trends, and as needed, generate reports to interpret, analyze and summarize the data and trends.\n<br><br>\n+ Collaborate with the statistician to identify any trial-related efficacy trends, and as needed, generate reports to interpret, analyze and summarize the data and trends.\n<br><br>\n<strong>15%</strong>\n<br><br>\nTotal\n<br><br>\n<strong>100%</strong>\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nEducation &amp; Experience\n<br><br>\nMinimal acceptable level of education, work experience and certifications required for the job\n<br><br>\n+ Advanced Scientific degree (Master?s degree-level or higher, Immunology background preferred)\n<br><br>\n+ At least 8 years of experience in clinical development within Industry (pharmaceutical, CRO)\n<br><br>\n+ Previous experience designing and developing phase 1-3 protocols.\n<br><br>\n+ Broad therapeutic area experience (typically demonstrable with 2 or more years relevant experience).\n<br><br>\n+ Broad experience in the principles and techniques of data analysis, interpretation and clinical relevance (e.g., ISS, ISE, competitor data, etc.).\n<br><br>\n+ Data listing review experience.\n<br><br>\n+ Experience working on a clinical team.\n<br><br>\n+ Previous project management/clinical operations experience desirable.\n<br><br>\nKnowledge\n<br><br>\nProficiency in a body of information required for the job\n<br><br>\ne.g. knowledge of FDA regulations, GMP/GLP/GCP, Lean Manufacturing, Six-Sigma, etc.\n<br><br>\n+ Has extensive knowledge of clinical research and has successfully worked across Phase I ? III drug development projects.\n<br><br>\n+ Comprehensive understanding of product and safety profiles.\n<br><br>\n+ Well-versed in medical aspects of GCP, ICH, FDA, EMEA, and other relevant guidelines and regulations.\n<br><br>\n<strong>Skills</strong>\n<br><br>\n<strong>&amp;</strong>\n<br><br>\nAbilities\n<br><br>\nOften referred to as ?competencies?, leadership attributes, skills, abilities or behaviors that may be enterprise, functional or job specific e.g. coaching, negotiation, calibration, technical writing etc.\n<br><br>\n+ Strong interpersonal and communication skills (verbal and written) bridging scientific and business needs ? integrating clinical science, disease area knowledge, and operational requirements. Incumbent must be able to work with colleagues at all levels of responsibility and authority.\n<br><br>\n+ Ability to work on multiple projects with aggressive timelines\n<br><br>\n+ Action oriented, flexible, able to adapt to changes in priorities, projects, and daily activities.\n<br><br>\n+ Strong presentation skills\n<br><br>\n+ Strong MSP skills\n<br><br>\nPhysical Requirements\n<br><br>\nPhysical &amp; mental requirements e.g. lift 40 pounds, walk across plant/warehouse, business travel (% of time), driving as part of work responsibilities, etc.\n<br><br>\n+ Up to 10% travel\n<br><br>\nDisclaimer: The above statements are intended to describe the general nature and level of work performed by employees assigned to this job. They are not intended to be an exhaustive list of all duties, responsibilities, and qualifications. Management reserves the right to change or modify such duties as required.\n<br><br>\nPage 1 of 3\n<br><br>\nCustomer Focus - Breakthrough Thinking ? Collaboration ? Accountability\n<br><br>\nEndo Job Description Template - Revised July 2012"}