{"job title": "Digital Data Analyst", "company": "Kforce", "city state": "– Pleasanton, CA", "rating": "3.8", "job description": "<strong>RESPONSIBILITIES:</strong><br><br>Kforce has a client in search of a Digital Data Analyst in Pleasanton, California (CA).\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li> Advises and recommends areas of program planning, business requirements management, budget execution and program coordination</li>\n<li> Prepares needs assessment</li>\n<li> Validates resource requirements and develops cost estimate models</li>\n<li> Conducts and coordinates financial, product, market, operational, and related research to support strategic and business planning within the various departments and programs of the client group</li>\n<li> Interprets, evaluates, and interrelates research data, and develops integrated business analyses and projections for incorporation into strategic decision-making</li>\n<li> Plans and coordinates the development of primary and secondary market research studies in support of strategic planning and specific marketing initiatives, as required, and presents findings of studies to client committees</li>\n<li> Provides consultative, advisory, technical, and staff support, as appropriate</li>\n<li> Use survey and market research methodologies, systems, and techniques</li>\n</ul>\n<strong>REQUIREMENTS:</strong>\n\n<ul>\n<li> BA or BS required plus minimum 6+ years of direct relevant experience</li>\n<li> At least 4 years of experience on a digital analytics team or as a data analyst utilizing SAS, SQL, Impala, or Spark</li>\n<li> At least 3 years of experience producing dashboards and regular reports</li>\n<li> Experience with project management for digital analytics projects</li>\n</ul>\n\n<strong>Desired Skills:</strong>\n\n\n<ul>\n<li> Project management &amp; coordination</li>\n<li> Analytic mindset and approach to identifying and solving business questions</li>\n<li> Technical understanding of analytics tools</li>\n<li> Understanding of healthcare industry</li>\n<li> R or Python for data analysis experience is a plus, but not required</li>\n</ul>\n\n<strong>Soft Skills:</strong>\n\n\n<ul>\n<li> Strong communicator and presenter</li>\n<li> Curious, resourceful, and detail oriented</li>\n<li> Ability to work well with both leadership, IT and Product</li>\n</ul>\n\nKforce is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status."}