{"job title": "Engineering Manager, Data Engineering", "company": "Lyft", "city state": "– San Francisco, CA", "rating": "4.0", "job description": "At Lyft, community is what we are and it's what we do. It's what makes us different. To create the best ride for all, we start in our own community by creating an open, inclusive, and diverse organization where all team members are recognized for what they bring.<br>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>Lyft's engineering team is growing rapidly, and we are looking for engineering managers to help us scale. Our engineers are smart, flexible, and love solving difficult challenges. They look to their managers for organizational transparency, career development, mentorship, and honest feedback. They move fast and ship code to production continuously, relying on their leadership to increase productivity by removing obstacles and keeping processes lean. Our engineering managers are people with varying technical backgrounds and interests -- some are involved in the technical details of their team and others provide general technical direction and oversight. As managers, our job is to keep teams efficient and executing on the right goals. We build teams that are inclusive, helpful, and have a strong sense of ownership for the things they build.</div>\n\n<br><strong><div>Responsibilities:</div></strong></div><strong>\n</strong></div><strong>\n</strong></div><strong>\n</strong></div><strong>\n</strong></div><strong>\n\n<br></strong>\n<br>\n<div>\n\n\n<ul>\n<li>Proactively drive the vision for Data and Data Warehousing across a product vertical, and define and execute on a plan to achieve that vision</li>\n<li>Partner actively with product management/data infra/customer teams to build shared objectives</li>\n<li>Define the processes needed to achieve operational excellence in all areas, including project management and system reliability</li>\n<li>Build a high-quality BI and Data Warehousing team and design the team to scale</li>\n<li>Build cross-functional relationships with Data Scientists, Product Managers and Software Engineers to understand data needs and deliver on those needs</li>\n<li>Manage data warehouse plans across a product vertical</li>\n<li>Drive the design, building, and launching of new data models and data pipelines in production</li>\n<li>Manage development of data resources and support new product launches</li>\n<li>Drive data quality across the product vertical and related business areas</li>\n<li>Manage the delivery of high impact dashboards and data visualizations</li>\n<li>Define and manage SLA's for all data sets and processes running in production</li>\n</ul>\n<strong>Experience and Skills:</strong>\n\n<ul>\n<li>6+ years of experience in Data and Data Warehousing</li>\n<li>Experience scaling and managing 5-20 person teams</li>\n<li>Experience scaling data environments with distributed processing/RT systems and self-serve visualization environments</li>\n<li>Communication and leadership skills, with the ability to initiate and drive projects proactively</li>\n<li>Project management skills</li>\n<li>Data architecture skills</li>\n<li>Experience in SQL or similar languages and development experience in at least one scripting language (Python, Perl, etc.)</li>\n<li>BA/BS in Computer Science, Math, Physics, or another technical field</li>\n</ul>\n<em>Lyft is an Equal Employment Opportunity employer that proudly pursues and hires a diverse workforce. Lyft does not make hiring or employment decisions on the basis of race, color, religion or religious belief, ethnic or national origin, nationality, sex, gender, gender-identity, sexual orientation, disability, age, military or veteran status, or any other basis protected by applicable local, state, or federal laws or prohibited by Company policy. Lyft also strives for a healthy and safe workplace and strictly prohibits harassment of any kind. Pursuant to the San Francisco Fair Chance Ordinance and other similar state laws and local ordinances, and its internal policy, Lyft will also consider for employment qualified applicants with arrest and conviction records.</em></div>\n<br>"}