{"job title": "Senior Scientist, Discovery Chemistry", "company": "Merck&amp;Co., Inc.", "city state": "– Boston, MA", "rating": "3.7", "job description": "Requisition ID: CHE006071\n<br><br>\nMerck&amp;Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck's success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.\n<br><br>\nMerck is on a quest for cures and is committed to being the world's premier, most research-intensive biopharmaceutical company. Today, we're doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck's leading discovery capabilities and world-class small molecule and biologics R&amp;D expertise to create breakthrough science that radically changes the way we approach serious diseases.\n<br><br>\nOur organization is currently seeking exceptional chemists for positions within the Discovery Chemistry department located in Boston, MA. The successful candidate will join multidisciplinary, highly collaborative teams to invent novel medicines by applying innovative synthetic chemistry, analytical techniques, and data analysis. Specific responsibilitieswill include utilizing state-of-the-art synthetic and medicinal chemistry problem solving skills to build structure-activity relationships, designing and synthesizing drug candidates and intermediates, and providing scientific and technical training of team members. Additionally, the successful candidate will help identify and validate new targets and be responsible for establishing a substantial external scientific presence including authoring publications and presentations. A proven track record of solving complex problems is required. Candidates must also possess strong written and oral communication skills, and the ability to work effectively in a team environment.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nEducation Minimum Requirement: B.S./M.S. in chemistry, biochemistry, medicincal chemistry, or related field with a minimum of 5 years of industry experience in synthesis/drug discovery OR Ph.D. in chemistry, biochemistry, medicinal chemistry, or related field. Anticipated attainment of Ph.D. in 2019 matching noted criteria is also acceptable.\n<br><br>\nRequired Experience and Skills: Experience in methodology/catalysis, total synthesis, chemical biology, or physical organic chemistry. A proven track record of solving complex problems. Experience in purification and analytical characterization including HPLC, MS, NMR, and biophysical methods.\n<br><br>\nYour role at Merck is integral to helping the world meet new breakthroughs that affect generations to come, and we're counting on your skills and inventiveness to help make meaningful contributions to global medical advancement. At Merck, we're inventing for life.\n<br><br>\nIf you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request to staffingaadar@merck.com.\n<br><br>\n<strong>Search Firm Representatives Please Read Carefully:</strong>\n<br><br>\nMerck&amp;Co., Inc. is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any employee at Merck via email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Merck. No fee will be paid in the event the candidate is hired by Merck as a result of the referral or through other means.\n<br><br>\nFor more information about personal rights under Equal Employment Opportunity, visit:\n<br><br>\nEEOC Poster\n<br><br>\nEEOC GINA Supplement\n<br><br>\nJob: Chemistry\n<br><br>\n<strong>Other Locations:</strong>\n<br><br>\nEmployee Status: Regular\n<br><br>\nTravel: No\n<br><br>\nNumber of Openings: 1\n<br><br>\nShift (if applicable): 1st\n<br><br>\nHazardous Materials: Laboratory chemicals necessary for drug development.\n<br><br>\nCompany Trade Name: Merck\n<br><br>\nNearest Major Market: Boston"}