{"job title": "Sr. Translational Research Scientist", "company": "Providence Health &amp; Services", "city state": "– Santa Monica, CA", "rating": "3.4", "job description": "<strong>Description:</strong>\n<br><br>\n<strong>Providence is calling a Full Time, Day Shift Sr. Translational Research Scientist to Providence John Wayne Cancer Institute Santa Monica, CA.</strong>\n<br><br>\n<strong>In this position you will:</strong>\n\n<ul>\n<li>Under the general supervision of Program Manager Dr. Tiffany Juarez, the Senior Translational Research Scientist will monitor and manage projects related to clinical and translational program activities for the Department of Translational Neurosciences and Neurotherapeutics department.</li>\n\n<li>This position will interact with faculty and staff at many levels, coordinate with academic and industrial laboratories, and provide support for programmatic and individual investigator research within the program.</li>\n</ul>\n<strong>Qualifications:</strong>\n<br><br>\n<strong>Required qualifications for this position include:</strong>\n\n<ul>\n<li>Ph.D in biological science or related discipline</li>\n\n<li>Excellent interpersonal communication, presentation and project management skills, including the ability to network, strong personal integrity and teamwork abilities are necessary.</li>\n\n<li>Must be experienced in discovery biology, preclinical drug development, experimental design for target ID engagement projects with new chemical entities and repurposing drugs.</li>\n\n<li>Must be able to organize, prioritize, and work effectively in a constantly changing environment.</li>\n\n<li>Must have a thorough understanding of cancer and neuroscience drug development process.</li>\n\n<li>Demonstrated record of scientific/medical publication.</li>\n\n<li>Working knowledge of clinical trials development and conduct and management of regulatory documents.</li>\n\n<li>Strong computer skills including Microsoft Office Suite and familiarity with electronic data capture systems.</li>\n\n<li>Excellent oral and written communication skills.</li>\n\n<li>Strong problem solving, analytical skills, and strategic thinking.</li>\n\n<li>Ability to work independently with little or no supervision to prioritize, organize, and coordinate work.</li>\n\n<li>Ability to work with human/clinical specimens.</li>\n\n<li>Ability to handle multiple tasks, meet multiple deadlines, and appropriately prioritize.</li>\n\n<li>Ability to work effectively and clearly communicate with internal and external customers, including, but not limited to, patients, co-workers, management, physicians, and visitors.</li>\n\n<li>Ability to maintain patient confidentiality and privacy in accordance to hospital policy.</li>\n</ul>\n<strong>About the hospital you will serve:</strong>\n<br><br>\nThe John Wayne Cancer Institute at Providence Saint Johns Health Center is a cancer research institute dedicated to the understanding and curing of cancer in order to eliminate patient suffering worldwide. The Institute's mission is accomplished by conducting innovative research focused on biological mechanisms to provide new understandings of the cause, diagnosis, control, and cure of cancer; training the next generation of surgical scientists who study and treat cancer; and researching unique experimental treatment services to rapidly develop and test new forms of diagnosis and therapy in order to improve the quality of life and expected survival of those afflicted with cancer.\n<br><br>\n<strong>We offer a full comprehensive range of benefits - see our website for details</strong>\n<br><br>\nhttp://www.providenceiscalling.jobs/rewards-benefits/\n<br><br>\n<strong>Our Mission</strong>\n<br><br>\nAs expressions of Gods healing love, witnessed through the ministry of Jesus, we are steadfast in serving all, especially those who are poor and vulnerable.\n<br><br>\n<strong>About Us</strong>\n<br><br>\nProvidence Health &amp; Services is a not-for-profit Catholic network of hospitals, care centers, health plans, physicians, clinics, home health care and services guided by a Mission of caring the Sisters of Providence began over 160 years ago. Providence is proud to be an Equal Opportunity Employer. Providence does not discriminate on the basis of race, color, gender, disability, veteran, military status, religion, age, creed, national origin, sexual identity or expression, sexual orientation, marital status, genetic information, or any other basis prohibited by local, state, or federal law.\n<br><br>\n<strong>Schedule:</strong> Full-time\n<br><br>\n<strong>Shift:</strong> Day\n<br><br>\n<strong>Job Category:</strong> Research\n<br><br>\n<strong>Location:</strong> California-Santa Monica\n<br><br>\n<strong>Req ID:</strong> 199014"}