{"job title": "Consulting Data Engineer", "company": "RELX Group", "city state": "– Raleigh, NC", "rating": "3.5", "job description": "Consulting Data Engineer\n\n\n<ul>\n<li>*Category:**</li>\n<li>*Location:** Raleigh, North Carolina, United States</li>\n<li>*Consulting Data Engineer**</li>\n</ul>\n\nDeveloping Artificial Intelligence (AI) is a primary mission for LexisNexis and we are seeing the acceleration of amazing AI work being developed in the Legal space. AI technology is evolving quickly, but ?good AI? is only as good as its training data. And LexisNexis has over 2PB of the best legal training data in the world! We are looking for an experienced data engineer who is devoted to developing and maintaining our data pipeline and data lake. This central data platform will be the hub for AI and Business Intelligence across all of LexisNexis.\n<br><br>\nThe Data Engineer is responsible for ensuring the collection and storage of data in the LexisNexis Corporate Data Lake. The successful candidate must be able to quickly familiarize themselves with LexisNexis? diverse data resources and have the ability to leverage the latest in AWS technologies to collect, maintain, and optimize the data platform. The ideal candidate has built and maintained a large-scale data pipeline, hub, lake utilizing the AWS cloud platform.\n<br><br>\nThis position reports to the Director of iLabs.\n\n\n<ul>\n<li>*Key Responsibilities:**</li>\n<li>Add and maintain data flows into the LexisNexis Data Lake</li>\n<li>Develop innovation, strategies, processes and best practices</li>\n<li>Writing stored procedures, functions, and ETL jobs</li>\n<li>Consult on feature design, implementation and relevant metrics like reliability and cost</li>\n<li>Identify, analyze and resolve problems with the LexisNexis Data Lake</li>\n<li>Perform capacity monitoring and short and long-term capacity planning</li>\n<li>Schedule and coordinate database jobs, monitor progress and completion of all jobs and take corrective action as needed</li>\n<li>*Qualifications**</li>\n<li>5+ years experience with AWS products</li>\n</ul>\n\na. Must include intimate familiarity with EC2, Redshift, RDS, and S3\n<br><br>\nb. Should have hands-on experience with Athena, DynamoDB, API Gateway, Lambda, and EMR\n<br><br>\nc. AWS Certification is a plus\n\n\n<ul>\n<li>Advanced linux shell expertise. Must be able to analyze loads and tune job scheduling.</li>\n<li>Expert Python programmer</li>\n<li>Expert with SQL languages (ANSI, PostGres, MySQL, etc.)</li>\n<li>Expertise in server backup and recovery</li>\n<li>Experience with the Google cloud environment a plus</li>\n<li>Experience with Windows server a plus</li>\n<li>Ability to provide guidance to data scientists, engineers and other team members</li>\n<li>Documentation skills for processes and procedures</li>\n<li>Bachelor of Science Degree in Engineering, Mathematics, or Computer Science</li>\n</ul>\n\nLexisNexis Legal &amp; Professional (www.lexisnexis.com) is a leading global provider of content and technology solutions that enable professionals in legal, corporate, tax, government, academic and non-profit organizations to make informed decisions and achieve better business outcomes. As a digital pioneer, the company was the first to bring legal and business information online with its Lexis- and Nexis- services. Today, LexisNexis Legal &amp; Professional harnesses leading-edge technology and world-class content, to help professionals work in faster, easier and more effective ways. Through close collaboration with its customers, the company ensures organizations can leverage its solutions to reduce risk, improve productivity, increase profitability and grow their business. Part of RELX Group plc, LexisNexis Legal &amp; Professional serves customers in more than 100 countries with 10,000 employees worldwide. LexisNexis, a division of RELX Group, is an equal opportunity employer: qualified applicants are considered for and treated during employment without regard to race, color, creed, religion, sex, national origin, citizenship status, disability status, protected veteran status, age, marital status, sexual orientation, gender identity, genetic information, or any other characteristic protected by law. If a qualified individual with a disability or disabled veteran needs a reasonable accommodation to use or access our online system, that individual should please contact 1.877.734.1938 or accommodations@relx.com."}