{"job title": "Perception Scientist for Marine Autonomy - LiDAR", "company": "Sea Machines", "city state": "– Boston, MA", "rating": "NA", "job description": "Perception Scientist for Marine Autonomy - LiDARLocationBoston, MAJob TypeFull-time\n<br><br>\nSea Machines is a fast-growing startup specializing in autonomous technology for marine vessels. We’re passionate about applying practical A.I. to the massive global ocean transportation market. Our products provide ships and workboats the intelligence to work remotely and give maritime operators the tools to effectively communicate with them. Based in Boston and operating globally, the company is crewed by an experienced team of mariners, engineers, coders, and autonomy scientists. Our culture is dynamic, collaborative and biased towards execution.\n<br><br>\nSea Machines is venture-funded and we’ve introduced our first product, the Sea Machines 300. We’re located on the East Boston waterfront in historic Jeffries Point, with quick access to the T and water taxis.\n<br><br>\n<strong>Job Summary</strong>\n<br><br>\nWe are seeking a Perception Scientist with LiDAR experience to actively push the next stage of perception R&amp;D at Sea Machines which tackles the exciting challenges of moving the world’s fleets to the era of autonomous operations. This role will focus on the use of LiDAR on marine vessels and will work in conjunction with the existing R&amp;D perception team currently looking at multimodal sensor fusion of live data streams (AIS, radar, camera, etc.). A focus will be on SLAM, object detection, object tracking, visual domain understanding, and sensor calibration.\n<br><br>\nThis position reports to the Director of Engineering\n<br><br>\n<strong>Responsibilities and Duties</strong>\n\n<ul>\n\n <li>Specification, selection and integration of LiDAR sensor technology on SMR vessels</li>\n<li>Development of segmentation, detection and tracking algorithms</li>\n<li>Integrate prototype into the existing Sea Machines autonomy system</li>\n<li>Maintain software documentation and assist in the development of user documentation</li>\n<li>Participate in field testing &amp; trials.</li>\n<li>Document and communicate bugs &amp; issues encountered during testing &amp; trials.</li>\n<li>Participate as a multi-disciplinary engineering team member including team meetings, stand-ups &amp; quality reviews.</li>\n<li>Work cross-functionally with technical teams developing autonomy, communications, perception, system interfaces and hardware to execute functional testing, system integration verification and performance validation on new products in automated simulation and in vessel trials.</li>\n<li>Develop collaborative relationships and work closely with suppliers, engineering, operations, sales team and customers.</li>\n</ul>\n<strong>Qualifications and Skills</strong>\n\n<ul>\n\n <li>Advanced degree in Computer Science, Electrical Engineering, Mechanical Engineering, Aerospace, Controls, or a related field, with a publication record on relevant topics.</li>\n<li>Experience working with and developing software algorithms for object tracking with LiDAR</li>\n<li>Proficiency developing software for complex products using C, C#, C++, Python, OpenCV.</li>\n<li>Experience collaborating with other functional teams to seamlessly integrate software and hardware systems.</li>\n<li>Excellent communication and writing skills.</li>\n<li>Experience with building autonomous systems containing both perception and control.</li>\n<li>Experience with ROS, MOOS or equivalent robotics architecture preferred</li>\n<li>Experience with GPU acceleration, CUDA</li>\n<li>Working knowledge of modern machine learning methods.</li>\n<li>Working knowledge of planning and control theory.</li>\n<li>Understanding and appreciation of hardened industrial systems</li>\n<li>Excellent analytical and program solving skills, excellent written and oral communication, self-starter and highly motivated.</li>\n</ul>\n*"}