{"job title": "Sr Scientist", "company": "Snyder's-Lance", "city state": "– United States-North Carolina-Charlotte", "rating": "2.6", "job description": "<div><b>Job Summary </b></div>\n<div>Provides technical expertise and/or guidance to solve ingredient, product, packaging and manufacturing food safety and quality issues. Applies leading edge scientific and technological solutions to business issues and opportunism in product innovation.</div>\n<div><b> </b></div>\n<div><b>Essential Job Duties </b></div>\n<div>Provides technical expertise based on innovative leading edge scientific technological solutions, and directions/ guidance to Quality, R&amp;D, and manufacturing to solve food safety issues or asset with product launches.</div>\n<ul>\n<li>\n<div>Assists the Global Food Safety process responsible for chilled products produced at the CFresh division and bakery snack products. </div></li>\n<li>\n<div>Provides oversight and support to baking and high pressure processing validations.</div></li>\n<li>\n<div>Provides oversight and support to corporate policies along with facility environmental monitoring programs.</div></li>\n<li>\n<div>Uses working knowledge of Food Safety &amp; Microbiological principles to design, manage, execute, interpret and report on scientific studies which drive innovation solving operational issues.</div></li>\n<li>\n<div>Manages the Microbiological ingredient specification SMI groups and special batch approval within Optiva.</div></li>\n<li>\n<div>Establishes benchmarking relationships with external technical experts at peer companies, universities, governmental agencies, and ingredient/equipment suppliers remaining abreast of current technologies related to food safety &amp; food processing.</div></li>\n<li>\n<div>Holds in-depth knowledge regarding food safety regulatory requirements (HACCP, and FSMA) assist with evaluating company compliance.</div></li>\n<li>\n<div>Completes and/ or direct process validations studies which include review of time/temperature data as well culturing inoculation and microbial analysis of food samples.</div></li>\n<li>\n<div>Issues summary reports as scientific support of processing parameters.</div></li>\n<li>\n<div>Provides disposition for out of compliance situations due to HACCP deviations, temperature abuse from mishandling or evaluate risk and determine final disposition.</div></li>\n<li>\n<div>Through collaboration with external technical experts, evaluate and investigate efficacy of potential antimicrobial ingredients to ensure food safety/ stability of existing and new products in development within an effort to reduce TDC or assist with clean label initiatives.</div></li>\n<li>\n<div>May perform other duties as required.</div></li></ul>\n<div><b> </b></div>\n<div><b>Statement of Coverage </b></div>\n<div>Employee may have supervisory responsibility when filling in due to absence of key management. </div>\n<div><b> </b></div>\n<div><b>Scope of Responsibility</b> <b> </b></div>\n<div>Works closely with R&amp;D, Quality and Engineering innovation teams providing food safety guidance and support on new project initiatives. High level of autonomy and independent decision making. </div>\n<div><b> </b></div>\n<div><b>Knowledge</b><b> and Skill Requirements </b></div>\n<div>Thorough knowledge &amp; proven experience in Food Safety, Microbiological, FSMA, and HACCP implementation is required</div>\n<div>Must be proficient in all aspects of laboratory techniques required to direct/ execute the following types of studies: Pathogen Analysis, Lethality Testing, Challenge Studies, and Shelf-life Studies</div>\n<div>Must be detail-oriented, well-organized with excellent verbal and written communication skills.</div>\n<div> </div>\n<div><b>Education and Experience </b> </div>\n<div>Master’s Degree in Food Safety or Microbiology and a minimum of 10 years of food safety experience.</div>\n<div> </div>\n<div><b>Professional Licenses or Certifications</b> </div>\n<div>FSMA, HACCP, SQF Practitioner</div>\n<div><b> </b></div>\n<div><b>Travel Required </b> </div>\n<div>10&gt; travel required.</div>"}