{"job title": "Data Center Security PSE", "company": "Symantec", "city state": "– Utah, Draper", "rating": "3.5", "job description": "<strong>Why Symantec?</strong>\n<br><br>\nBe a part of a team that strives to make the digital world a safer place to work and play, where we raise awareness of cyber issues and contribute resources to our communities, reinforcing our place as a world class technical community.\n<br><br>\nHeadquartered in Mountain View, California, a member of the S&amp;P 500 Stock Market Index and a Fortune 500 company, Symantec was founded in 1982 by visionary computer scientists with the view of relentlessly protecting the world's information. We at Symantec consider the security of information central to corporate responsibility in this digital age of increased exposure. With more than 18,000+ employees, we continue to partner to both consumers and businesses of all sizes in providing security and systems management solutions to help protect their information. Our ability to successfully integrate internally developed with technologies we acquire has kept us at the front of the industry and enabled us to provide best-of-breed solutions for millions of corporate and individual customers in more than 48 countries. It is what has earned the company almost every major technology award and top-tier rankings from industry analysts.\n<br><br>\n<strong><u>Roles &amp; Responsibilities:</u></strong>\n<ul>\n<li>Act as a trusted advisor by providing technical support to Global Enterprise level Customers and Partners on Symantec Security Products (Threat &amp; Information Protection Solutions)</li><li>Researches on a wide array of technical topics such as Operating Systems, Infrastructural Technologies and Symantec Software Products</li><li>Applies specialized knowledge, analytical practices and procedures to analyze, diagnose and resolve issues in unique and often complex enterprise environments</li><li>Effectively communicates procedural and technical issues to internal and external customers/stakeholders in an enterprise environment</li><li>Participates and possibly leads conference calls with customers and 3rd party Teams/Vendors</li><li>Assesses when it is necessary to engage or escalate to senior resources to resolve complex issues</li><li>Manages own schedule of cases, which includes determining priority levels and negotiating and setting expectations with customers</li><li>Participate in new product releases and beta cycles to ensure information and training requirements are met to support new products.</li><li>Interface with Sales, Services, Engineering, Product Management, and Support Management when necessary to prioritize customer requests</li><li>Define and track bugs for Development, and offer innovative ideas to improve product quality.</li><li>Mentor, train, and help develop the skills of new Technical Support Engineers as well as peers.</li><li>Comfortable working in a shift model</li><li>Develop documentation and the Technical Support Knowledge Base to reduce troubleshooting time and drive faster issue resolution</li><li>Engage in on-going training and departmental development, along with self-learnings</li><li>Works toward becoming subject matter expert in a particular area or areas</li><li>Reviews technical solution articles for accuracy and completeness</li><li>Determines which technical tool(s) and tests are to be used</li>\n</ul>\n<strong><u>Skills &amp; Qualifications:</u></strong>\n<ul>\n<li>Diploma Holders / Graduates / Post Graduates\n<br>\n4+ years of working knowledge and experience troubleshooting applications and platform faults in enterprise environments</li> <li>Hands on experience across the following core technologies including:</li></ul>\n\n<ul>\n<li>Operating Systems such as Windows Server/Client and Linux.</li><li>Enterprise Level Infrastructure Technology: Active Directory, Domain Name System(DNS), DHCP</li><li>Networking Fundamentals: TCP/IP, Packet Switching, Routing, Network Topologies and Security.</li>\n</ul>\n\n<strong><ul><li>Working knowledge in the following:</li>\n</ul>\n\n</strong>\n\n<ul>\n<li>Knowledge on virtualization technologies: VMWare, Hyper-V</li><li>Scripting or programming concepts</li><li>Working knowledge of Relational Database principles and methodologies (SQL, Oracle)</li><li>Windows Exchange and/or other Mail systems</li></ul>\n\n<ul>\n<li>MCSA, MCSE, CCNA, CompTIA Security+ or relevant industry certifications (one or more is a must)</li><li>Firewalls, Intrusion Detection System Brands &amp; technologies, Packet sniffers and Vulnerability Network Scanners would be an added advantage</li><li>Advanced troubleshooting and debugging skills</li><li>Proven capability to own, drive and take responsibility</li><li>Ability to multitask, prioritizes, and works well under pressure</li><li>Leadership qualities</li>\n</ul>\n====================​====================​\n<br><br>\nSymantec is an equal opportunity employer. All candidates for employment will be considered without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, physical or mental disability, veteran status, or any other basis protected by applicable federal, state or local law.<br><br>Apply"}