{"job title": "Product Manager- Data Infrastructure", "company": "Uber", "city state": "– San Francisco, California", "rating": "4.2", "job description": "We’re changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now we’re a part of the logistical fabric of more than 600 cities around the world. Whether it’s a ride, a sandwich, or a package, we use technology to give people what they want, when they want it.\n<br><br>\nFor the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer.<br>\n<div>And that’s just what we’re doing today. We’re thinking about the future, too. With teams working on new modalities, self-driving cars and even urban air transportation, we’re in for the long haul. We’re reimagining how people and things move from one place to the next.</div>\n<br><strong>About The Role</strong>\n<br><br>\nData volumes at Uber are growing exponentially. Uber’s business relies heavily on these rich datasets to gain deep insights and to make real-time business decisions. Analytics at Uber power critical applications like dynamic pricing, UberEATS delivery estimates, fraud detection, maps creation, driver activation, and many others.\n<br><br>\nAs a Product Manager, you will help define the strategy, drive requirements, and deliver products that power intelligence at Uber. Your teams will create and own systems that enable end-to-end data pipelines that take data from event emission and ingestion all the way through to BI applications and other Uber services built on top of our data. You will work closely with world-class Engineering teams, Product Managers, Technical Program Managers, Data scientists, and Designers. You will interface with nearly every aspect of the Uber organization - from Fraud to Finance, from Maps to Marketplace. If successful, you will change the course of data at Uber and create a world-class product suite that fuels and supports our unprecedented growth.\n<br><br>\nHaving excellent communication and collaboration skills, an entrepreneurial bent, excellent technical and analytical understanding, product management expertise, good judgment, and deep background in building scalable systems will allow you to thrive in this role.\n<br><br>\n<strong>What You’ll Do</strong>\n<ul>\n<li>Internalize and deeply understand Uber's mission and strategy, as well as the mission and goals of multiple teams under your direction</li><li>Lead multiple teams and multiple projects working toward a scalable data infrastructure that supports your customers' needs. Attain internal product-market fit and widespread product adoption among data consumers at Uber</li><li>Help recruit and mentor a team of highly technical Product Managers. Ensure excellent team dynamics, team and individual team member performance, growth and enthusiasm</li><li>Be in the details. Know your team's work in depth.</li><li>Work closely with other teams at Uber to ensure efficient and productive working relationships</li><li>Lead by example. Be incredibly truth-seeking and finger-tippy with data, set a high bar for the team to think boldly and creatively and then to funnel that energy into concrete products and execution plans, move fast and be biased toward action</li>\n</ul>\n<strong>What You’ll Need</strong>\n<ul>\n<li>A computer science undergraduate degree or equivalent plus hands-on software engineering experience. Technical understanding must go from the highest abstractions down to the hardware</li><li>At least 5 years experience leading product teams that delivered solutions/products related to data infrastructure at scale</li><li>A personality that encourages action, great collaboration and excellent simplification for communication.</li><li>You never hesitate to roll up your sleeves and address something hands-on.</li><li>Customer-centricity - you have many examples from your past of tough product issues that you persevered through to ensure customer satisfaction</li><li>Bonus: Familiarity with exciting and new data technologies, including HDFS, Hive, Kafka, Spark, Presto, Docker, Mesos, data warehousing solutions, and in-memory databases</li>\n</ul>\n<strong>About the Team</strong>\n<br><br>\n<strong>The Data team at Uber is a highly driven, motivated, and fun-loving team. In just a few years, the team has grown significantly to take the Data platform from a handful of products to one of the most sophisticated Data platforms in the world. You will learn from the best engineers and thought leaders in the valley.</strong>"}