{"job title": "Staff Image Scientist", "company": "United Technologies", "city state": "– Westford, Massachusetts", "rating": "3.3", "job description": "The Information and Intelligence group, within the Engineering department, is seeking a Staff Engineer for our Image Science team. In this position, you would contribute to the development and support of long range, high altitude reconnaissance sensors. The optimal candidate would have expert knowledge of image processing algorithms, as well as, an understanding and experience with the components of imaging systems (optics, focal planes, etc.). The candidate should understand what drives and impacts good image quality. Experience with high altitude or space based reconnaissance is a plus.\n<br><br>\nThis position offers an exciting opportunity to grow technically and broaden capabilities while proudly contributing to unique state of the art solutions that truly make a difference.\n<ul>\n<li>Lead technical projects</li><li>Represent Image Science during technical exchanges with internal and external customers</li><li>Prototype image processing algorithms</li><li>Analyze and model imaging systems for performance and image quality</li><li>Collaborate on multi-disciplinary teams to devise leading edge sensor solutions 6. Write and encourage robust, maintainable documentation</li> \n</ul>\n<strong>Qualification:</strong> 7+ years of experience.\n<br><br>\n<strong>Required Skills</strong>\n\n<ul>\n<li>Strong mathematical background with emphasis in one or more of the following: Statistics, Linear Systems, Fourier Analysis</li> <li>Deep knowledge of image processing algorithms</li> <li>Design, documentation and Product Development Life Cycle experience</li><li>Experience with prototype algorithm development and data analysis in languages such as Matlab, Python, or IDL</li> \n</ul>\n\nPreferred Skills\n\n<ul>\n<li>Experience with Photogrammetry</li><li>Experience with DOD</li> <li>Experience with either high altitude airborne or satellite ISR sensors</li> \n</ul>\n\n<strong>Competencies</strong>\n\n<ul>\n<li>Leadership</li> <li>Excellent writing and verbal skills</li><li>Ability to convey complex concepts simply and concisely</li> <li>Ability to positively contribute in a team environment</li> \n</ul>\n\nCandidates must be a US Citizen and have the ability to obtain DoD security clearance.\n<br><br>\nInclusion and diversity are fundamental to our culture and success. Achieving our common vision depends on people with diverse backgrounds working together. Who knows - your unique point of view could be the key to our next groundbreaking idea. We’d love to explore that possibility!\n<br><br>\nAt ISR &amp; Space Systems we design world class high altitude electro-optical sensors employed by the U.S. and foreign military in time critical intelligence, surveillance and reconnaissance operations. Our passion for the Warfighter and their mission demands excellence in everything we do, from the talent we recruit to the highly-engineered systems we deliver. We value and trust our people, their integrity, ideas and performance. With singular clarity, our focus is providing true intelligence in real time to key decision makers.\n<br><br>\nDo you have what it takes to push the boundaries of game-changing technologies, deliver results while working with a diverse team of talented individuals, and challenge yourself knowing that what we do matters to the Warfighter? Are you Mission Ready? This job is for you!\n<br><br>\n<strong>Education:</strong> BS in Imaging Science, Physics, Mathematics, Optics, Electrical Engineering or related field required; MS in Engineering or Mathematics discipline preferred.<br><br>United Technologies Corporation is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class."}