{"job title": "Scientist I - Protein Purification", "company": "Volt Workforce Solutions", "city state": "– Carlsbad, CA", "rating": "3.1", "job description": "Scientist I - Protein Purification in Carlsbad, CA at Volt\n<br><br>\n# Date Posted: _7/29/2018_\n<br><br>\n# Job Snapshot\n<br><br>\n+ **Employee Type:** Contingent\n<br><br>\n+ **Location:** Carlsbad, CA\n<br><br>\n+ **Job Type:** Scientific/Biotech\n<br><br>\n+ **Duration:** 28 weeks\n<br><br>\n+ **Date Posted:** 7/29/2018\n<br><br>\n+ **Job ID:** 116520\n<br><br>\n+ **Contact Name** Volt Branch\n<br><br>\n+ **Phone** (714) 921-8003\n<br><br>\n# Job Description\n\n\n<ul>\n<li>*PROTEIN PURIFICATION SCIENTIST NEEDED IN CARLSBAD!**</li>\n</ul>\n\n# Job Description\n<br><br>\n+ Responsible for manufacturing product(s) in a lab setting following standard operating procedures. Will utilize basic laboratory techniques, calculations, materials measurement, operation of laboratory equipment and record keeping necessary to manufacture products.\n<br><br>\n+ Will perform column purification/ chromatography, buffer preparation, SDS-Page Analysis, Western Blotting, and other protein characterization techniques. Responsible for Batch Data Records, notebooks, customer reports and work order documents.\n<br><br>\n+ Utilize specialized technical knowledge and skills to make detailed observations and analyze data to ensure within operating parameters.\n<br><br>\n+ Advise manager of factors that may affect quality of product. Suggest options/ideas for corrective actions.\n<br><br>\n+ Maintain equipment, product inventories and related records as assigned. Note variances on manufacturing documents; audit and evaluate process documents and propose revisions.\n<br><br>\n+ Complete, distribute and file records as required in accordance with Document Control Practices. Identify potential issues in the production process; report findings to team management and members for resolution or participate in troubleshooting.\n<br><br>\n+ Write technical documents which may include standard operating procedures and batch records. May lead process improvement projects or product transfer projects May perform other related duties as required and/or assigned\n<br><br>\n+ **Minimum Qualifications (must have):** Must have a bachelor's degree in Biology, Chemistry, Biochemistry, or other related discipline. Master's degree is a plus.\n<br><br>\n+ Requires a minimum of 3 years relevant experience demonstrating laboratory techniques in a manufacturing environment or research laboratory. Demonstrated proficiency in the use of scientific laboratory techniques, equipment and materials required.\n<br><br>\n+ Experience in the use of basic laboratory techniques, including buffer preparation, column purification/ chromatography, SDS-Page Analysis, Western Blotting, and other protein characterization techniques are beneficial.\n<br><br>\n+ Familiar with GE AKTA FPLC protein chromatography equipment and Unicorn software. Experience with different modes of chromatography such as: affinity, ion-exchange, size exclusion, hydrophobic interaction.\n\n\n<ul>\n<li>*VOLT IS AN EQUAL OPPORTUNITY EMPLOYER**</li>\n</ul>\n\nIn order to promote this harmony in the workplace and to obey the laws related to employment, Volt maintains a strong commitment to equal employment opportunity without unlawful regard to race, color, national origin, citizenship status, ancestry, religion (including religious dress and grooming practices), creed, sex (including pregnancy, childbirth, breastfeeding and related medical conditions), sexual orientation, gender identity, gender expression, marital or parental status, age, mental or physical disability, medical condition, genetic information, military or veteran status or any other category protected by applicable law."}