{"job title": "Principal Scientist - In Vitro Diagnostics", "company": "Amgen", "city state": "– US - California - Thousand Oaks", "rating": "3.7", "job description": "<strong>Career Category</strong>Scientific<strong>Job Description</strong><br><br>A biotechnology pioneer since 1980, Amgen was one of the first companies to realize the promise of this emerging science to bring safe, effective medicines from lab, to manufacturing plant, to patient. Amgen therapeutics have changed the practice of medicine, helping millions of people around the world in the fight against cancer, kidney disease, rheumatoid arthritis, and other serious illnesses. With a deep and broad pipeline of potential new medicines, Amgen remains committed to advancing science to dramatically improve people’s lives.\n<br><br>\nAmgen is seeking a Principal Scientist - In Vitro Diagnostics to work out of their Thousand Oaks, CA location.\n<br><br>\nIntegral to the ongoing success of Amgen’s comprehensive biomarker programs, the Medical Sciences In Vitro Diagnostics (IVD) Group is responsible for the transition of exploratory biomarkers to marketed IVDs, working with other functions within Amgen to identify the appropriate partner for diagnostic test development. The role uses a wide breadth of communication expertise across a broad range of stakeholders, influencing decision-making through negotiation, and addressing conflict by building productive working relationships across functional areas both within and outside the company.\n<br><br>\nThe Principal Scientist is responsible for:\n<ul>\n<li>Formulating and implementing companion diagnostic development strategies through integration of functional stakeholder input</li><li>Developing project plans including resource identification, budget, facility and regulatory requirements to meet project goals</li><li>Leading cross-functional teams required to manage and execute external diagnostic development partnerships through regulatory approval in multiple jurisdictions and the test’s life cycle as companions to Amgen’s therapeutics</li>\n</ul>\nBasic Qualifications:\n<br><br>\nDoctorate degree and 3 years of Scientific experience\n<br><br>\nOR\n<br>\nMaster’s degree and 6 years of Scientific experience\n<br>\n<strong>OR</strong>\n<br>\nBachelor’s degree and 8 years of Scientific experience\n<br><br>\nPreferred Qualifications:\n<br><br>\nPh.D\n<br><br>\nExperience in companion diagnostics development and knowledge of regulatory submission requirements of in vitro diagnostic devices in multiple markets\n<br><br>\nExperience integrating data from multiple sources and identifying critical process variables\n<br><br>\nExperience establishing and reviewing complex plans for multiple projects or activities. This includes planning resource allocation and distribution and identifying contingency plans\n<br><br>\nUnderstanding of clinical study design and operational considerations associated with CDx and Dx trials\n<br><br>\n5+ years of experience in pharmaceutical industry<br><br><strong>Join Us</strong><br><br><strong>If you're seeking a career where you can truly make a difference in the lives of others, a career where you can work at the absolute forefront of biotechnology with the top minds in the field, you'll find it at Amgen.</strong>\n<br><br>\n<strong>Amgen, a biotechnology pioneer, discovers, develops and delivers innovative human therapeutics. Our medicines have helped millions of patients in the fight against cancer, kidney disease, rheumatoid arthritis and other serious illnesses.</strong>\n<br><br>\n<strong>As an organization dedicated to improving the quality of life for people around the world, Amgen fosters an inclusive environment of diverse, ethical, committed and highly accomplished people who respect each other but compete intensely to win. Together, we live the Amgen values as we continue advancing science to serve patients.</strong><br><br>Amgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.Amgen will consider for employment qualified applicants with criminal histories in a manner consistent with the San Francisco Fair Chance Ordinance.\n<br><br>\nApply"}