{"job title": "Process Development Principal Scientist", "company": "Amgen", "city state": "– US - California - Thousand Oaks", "rating": "3.7", "job description": "<b>Career Category</b>Scientific<b>Job Description</b><p>This position is an exciting leadership opportunity within the Attribute Sciences group based at Amgen’s Thousand Oaks, CA headquarters. The Principal Scientist will lead a dynamic team with broad responsibility for developing, qualifying and transferring state-of-the-art and fit-for-purpose biological assays in support of potency assessment and biological characterization of Amgen’s therapeutics. This will involve working on a wide range of modalities including antibodies, engineered proteins, multi-specific molecules, as well as novel therapies. </p><p></p><p><b>Responsibilities include</b>:</p><p>Developing and implementing state-of-the-art and fit-for-purpose analytical methods for: release testing, stability testing, product characterization, and reference standard characterization</p><p></p><p>Designing and implementing analytical projects involving method development, qualification, and transfer; monitoring method performance metrics across multiple testing sites and devising plans to address method performance issues</p><p></p><p>Managing a team or teams of staff that contribute to the achievement of department and project objectives</p><p></p><p>Preparing technical reports for investigations, product and impurity characterization, and regulatory submissions</p><p></p><p>Analyzing and interpreting analytical data to support: product development investigations and regulatory submissions</p><p></p><p>Contributing to critical analytical development teams (e.g., Product and Process Development teams, Product Quality teams) by providing analytical updates, analytical documentation and data interpretation</p><p></p><p>Authoring detailed analytical procedures for lot release, stability and product characterization testing</p><p></p><p>Adhering to program deliverables such as timelines, milestones, methodological approaches, expected results, and necessary resources</p><p></p><p>Keeping current in analytical development field including literature and technology development for cutting edge and regulatory driven activities</p><p></p><p>Driving the development of key scientific strategies and objectives within the function</p><p></p><p>Providing critical evaluation of analytical data and results to support: product development (for Process Development, Quality, etc.), investigations and regulatory submissions</p><p></p><p><b>Basic Qualifications </b></p><p>Doctorate degree and 3 years of Scientific experience</p><p>OR</p><p>Master’s degree and 6 years of Scientific experience</p><p>OR</p><p>Bachelor’s degree and 8 years of Scientific experience</p><p></p><p><b>Preferred Qualifications </b></p><p>PhD in Cell Biology, Molecular Biology, Immunology, Biochemistry, or similar disciplines</p><p></p><p>Experience in requisite authoring or regulatory submissions</p><p></p><p>Expertise in cell culture and cell biology techniques for the quantitative determination of biological activity of proteins</p><p></p><p>Expertise in cell-based and non-cell-based potency assay development (method optimization, qualification, validation, technical transfer) </p><p></p><p>Experience with signal transduction, gene expression, receptor binding and fluorescent probe technologies</p><p></p><p>Leadership – provides clear and consistent vision and direction using an appropriate leadership style; builds teamwork and collaboration </p><p></p><p>Experience with authoring and critical review of regulatory filings: Investigational New Drug (IND), Biologic(s) License Application (BLA), New Drug Application (NDA)</p><p></p><p>Proven experience to interact with regulatory agencies during inspections and face-to-face meetings</p><p></p><p>Proven ability to expand analytical development expertise to a broader level of understanding in pharmaceutical R&amp;D and commercialization</p><p></p><p>Resource management – ensures resources are utilized fully and productively and that adequate resources are projected and selected to accomplish unit responsibilities </p><p></p><p>Innovation oriented – positive approach to challenges; champions new ideas and initiatives; brings out and utilizes the creativity of the team to improve unit performance </p><p></p><p>Client oriented– establishes effective and responsive relationships with all clients; translates client requirements into work design; ensures value is delivered </p><p></p><p>Performance management – ensures direct reports are oriented and developed to perform at a high level; monitors performance and provides adequate feedback through coaching and effective performance appraisal and development planning </p><p></p><p>Communication – establishes and maintains effective communication mechanisms to keep staff appropriately informed; bridges communication between individuals, units and other organizations</p><p></p><p>Interpersonal skills – communicates effectively with others, using appropriate diplomacy and sensitivity; makes others feel respected, valued and understood </p><p></p><p></p><p></p><p></p><p>Amgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.</p><p></p><p>Amgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people’s lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world’s leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.</p><p></p><b>Join Us</b><p></p><p><b>If you're seeking a career where you can truly make a difference in the lives of others, a career where you can work at the absolute forefront of biotechnology with the top minds in the field, you'll find it at Amgen.</b></p><p></p><p><b>Amgen, a biotechnology pioneer, discovers, develops and delivers innovative human therapeutics. Our medicines have helped millions of patients in the fight against cancer, kidney disease, rheumatoid arthritis and other serious illnesses.</b></p><p></p><p><b>As an organization dedicated to improving the quality of life for people around the world, Amgen fosters an inclusive environment of diverse, ethical, committed and highly accomplished people who respect each other but compete intensely to win. Together, we live the Amgen values as we continue advancing science to serve patients.</b></p>Amgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.<p></p><p></p><p></p>.<br><br>Apply"}