{"job title": "Associate Scientist (Analytical)", "company": "Bristol-Myers Squibb Company", "city state": "– Devens, Massachusetts", "rating": "3.7", "job description": "At Bristol-Myers Squibb, we believe that together we can make the difference. We want to do this by building professional teams who can create and innovate medicines that benefit doctors and their patients.\n<br><br>\nOur large-scale biologics manufacturing facility in Devens, Massachusetts, is expanding and there are a number of exciting career opportunities to join Bristol-Myers Squibb, one of the worlds leading BioPharma companies.\n<br><br>\nWeve created one of the worlds premier biologics facilities, among the first sites in the industry to have a fully automated, integrated manufacturing control system that enables the plant to run virtually paperless. It is a site that combines biologics development with clinical and commercial manufacturing on a single campus a true biologics center of excellence for the company where teams are encouraged to closely collaborate.\n<br><br>\nThe Analytical Sciences &amp; Technology group is committed to supporting our global biologics analytical network with reliability, integrity, active engagement, and cross functional collaboration. The Method Lifecycle Group in the Analytical Sciences and Technology department provides analytical oversight for the transition of programs entering the commercial space following clinical development. The Method Lifecycle Group is looking for an experienced Associate Scientist with demonstrated expertise and hands-on experience with one or more of the following methods: SDS-PAGE, CE-SDS, icIEF, ion exchange, size exclusion, and RP HPLC. Good hands-on knowledge and experience with Empower chromatography DCS is required. Knowledge of compendia methods would be a plus. The successful candidate will participate in defining new scientific approaches and data analysis in a commercial environment. Critical thinking, expertise in trouble-shooting of analytical methods and equipment as well as attention to detail is a must. This is a part laboratory based and part office based role with the expectation that majority of the time will be devoted to laboratory work. Candidate will be required to plan &amp; execute experiments as well as analyze data generated at other sites for method troubleshooting and improvements. Ability to work collaboratively and across different functions in fast-paced environment is required.\n<br><br>\n<strong>Duties/Responsibilities:</strong>\n<li>Provide technical input into analytical method revisions and improvements.</li><li>Provide input during periodic review of method performance and work with team leader to execute remediation experiments and help implement changes to existing commercial methods</li><li>Assist in authoring and review sections of regulatory filings as well as in responding to Health Authority queries regarding analytical methods.</li><li>Work collaboratively across organization and sites for method readiness, transfer, performance and trouble shooting in commercial environment.</li><li>Work closely with all AS&amp;T team members to understand their deliverables to achieve organization goals.</li>\n<strong>QUALIFICATIONS</strong>\n<br><br>\n<strong>Specific Knowledge, Skills, Abilities, etc:</strong>\n<li>Demonstrated troubleshooting abilities and hands-on experience with one or more protein separation methods, including Electrophoresis, Chromatography, and UVIS spectroscopy based technologies (for example SDS-PAGE, CE-SDS, icIEF, different modes of LC)</li><li>Familiarity with one or more protein characterization methods such as mass spectrometry, peptide mapping, and carbohydrate analysis.</li><li>Practical knowledge of Empower CDS.</li><li>Basic knowledge and understanding of regulatory guidelines (ICH, Compendia)</li><li>Understanding of method validation and transfer.</li><li>Experience of working with colleagues at remote sites.</li><li>Understanding of GMP principles is expected.</li><li>Ability to work independently.</li><li>Strong written and communication skills and experience working in a matrix organization.</li>\n<strong>Education/Experience/ Licenses/Certifications:</strong>\n<br><br>\nBio-therapeutic development &amp; industry experience required: BS with 4+ years, or MS with 2+ years.\n<br><br>\n<strong>Physical Demands:</strong>\n<li>This role requires office work, biochemical laboratory work, computer work, group meetings, and thus involves sitting, standing, walking, working with analytical instruments, repetitive motion including bending and lifting small containers/equipments.</li><li>Due to safety concerns in a laboratory setting this role requires sufficient manual dexterity and sufficient vision.</li>\n<strong>Work Environment:</strong>\n<li>Working in an analytical laboratory handling chemical reagents that may be hazardous (corrosive, toxic, flammable etc.).</li><li>Office work, teleconferencing, computer work, participation in meetings requiring working in open office environment, working alone and working with/around others.</li>\n<strong>Travel</strong>\n<li>This position may require occasional domestic and international travel.</li>"}