{"job title": "Analytical Senior Scientist", "company": "Bristol Myers Squibb", "city state": "– Devens, MA", "rating": "3.7", "job description": "<ul>\n<li>*POSITION SUMMARY:**</li>\n</ul>\n\nAt Bristol-Myers Squibb, we believe that together we can make the difference. We want to do this by building professional teams who can create and innovate medicines that benefit doctors and their patients.\n<br><br>\nOur large-scale biologics manufacturing facility in Devens, Massachusetts, is expanding and there are a number of exciting career opportunities to join Bristol-Myers Squibb, one of the world?s leading BioPharma companies.\n<br><br>\nWe?ve created one of the world?s premier biologics facilities, among the first sites in the industry to have a fully automated, integrated manufacturing control system that enables the plant to run virtually paperless. It is a site that combines biologics development with clinical and commercial manufacturing on a single campus ? a true biologics center of excellence for the company where teams are encouraged to closely collaborate.\n<br><br>\nThe Analytical Sciences &amp; Technology group is committed to supporting our global biologics analytical network with reliability, integrity, active engagement, and cross functional collaboration. The Method Lifecycle Group in the Analytical Sciences and Technology department provides analytical oversight for the transition of programs entering the commercial space following clinical development. The Method Lifecycle Group is looking for an experienced Senior Scientist with demonstrated expertise and hands-on experience in oligosaccharide analysis using capillary based as well as LC based methods. In addition expertise and hands-on experience with two or more of the following methods is required: SDS-PAGE, CE-SDS, icIEF, ion exchange chromatography, peptide mapping. Good hands-on knowledge and experience with Empower chromatography DCS is required. Knowledge of compendia methods and requirements as pertaining to biopharmaceuticals is expected. The successful candidate will participate in defining new scientific approaches and data analysis in a commercial environment. Critical thinking, expertise in trouble-shooting of analytical methods and equipment as well as attention to detail are a must. This is a part laboratory based and part office based role. Candidate will be required to plan &amp; execute experiments as well as analyze data generated at other sites for method troubleshooting and improvements. Ability to work collaboratively and across different functions in fast-paced environment is required.\n\n\n<ul>\n<li>*Duties/Responsibilities:**</li>\n</ul>\n\n+ Provide technical oversight and ownership of carbohydrate/oligosaccharide analysis methods.\n<br><br>\n+ Provide technical oversight and troubleshooting input to two or more of the methods listed above (SDS-PAGE, CE-SDS, icIEF, ion exchange chromatography, peptide mapping)\n<br><br>\n+ Act as a representative of the group on different project teams\n<br><br>\n+ Provide expert input during periodic review of method performance and work with team leader to design and execute remediation experiments and implement changes/revisions/improvements to existing commercial methods.\n<br><br>\n+ Author and review sections of regulatory filings.\n<br><br>\n+ Respond to Health Authority queries regarding analytical methods.\n<br><br>\n+ Work collaboratively across organization and sites for method readiness, transfer, performance and trouble shooting in commercial environment.\n<br><br>\n+ Work closely with all AS&amp;T team members to understand their deliverables to achieve organization goals.\n<br><br>\n+ Occasional method development work may be needed.\n\n\n<ul>\n<li>*QUALIFICATIONS**</li>\n<li>*Specific Knowledge, Skills, Abilities, etc:**</li>\n</ul>\n\n+ Demonstrated troubleshooting abilities and hands-on experience with carbohydrate analysis and two or more protein separation methods listed above.\n<br><br>\n+ Familiarity with protein characterization methods.\n<br><br>\n+ Knowledge and understanding of regulatory guidelines including all major international guidelines (USP/ICH, EP, JP etc.).\n<br><br>\n+ Ability to lead complex technical projects\n<br><br>\n+ Understanding of method validation and transfer.\n<br><br>\n+ Experience of working with colleagues at remote sites.\n<br><br>\n+ Understanding of GMP principles is expected.\n<br><br>\n+ Ability to work independently.\n<br><br>\n+ Strong written and communication skills and experience working in a matrix organization.\n\n\n<ul>\n<li>*Education/Experience/ Licenses/Certifications:**</li>\n</ul>\n\nBio-therapeutic development &amp; industry experience required: BS with 10+ years, MS with 6+ years or Ph.D. with 4+ years.\n\n\n<ul>\n<li>*Physical Demands:**</li>\n</ul>\n\n+ This role requires office work, biochemical laboratory work, computer work, group meetings, and thus involves sitting, standing, walking, working with analytical instruments, repetitive motion including bending and lifting small containers/equipment?s.\n<br><br>\n+ Due to safety concerns in a laboratory setting this role requires sufficient manual dexterity and sufficient vision.\n\n\n<ul>\n<li>*Work Environment:**</li>\n</ul>\n\n+ Working in an analytical laboratory handling chemical reagents that may be hazardous (corrosive, toxic, flammable etc.).\n<br><br>\n+ Office work, teleconferencing, computer work, leading meetings requiring working in open office environment, working alone and working with/around others.\n\n\n<ul>\n<li>*Travel**</li>\n</ul>\n\n+ This position may require occasional domestic and international travel.\n<br><br>\nBristol-Myers Squibb is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status."}