{"job title": "Research Scientist, Eye Tracking (PhD University Grad)", "company": "Facebook", "city state": "– Redmond, Washington", "rating": "4.4", "job description": "As a Research Scientist for the Eye Tracking team, you will advance the state of human tracking technologies by designing and implementing eye tracking software in a broad range of eye tracking research applications. Working closely with expert Scientists, Mechanical Engineers, Electrical Engineers and Software Engineers you will help create cutting-edge research prototypes that explore the future of virtual reality (VR) and augmented reality (AR). You will be responsible for designing, developing and testing new software algorithms for eye tracking and gaze estimation applications using a variety of sensor modalities. In addition, you will take part in simulating, analyzing, testing, and reporting on potential software and hardware solutions. Join the adventure of a lifetime as we make science fiction real and change the world.\n<br><br>\n<strong>Responsibilities:\n<br>\n</strong>\n\n<ul>\n<li>Create computer vision algorithms for eye tracking and gaze estimation</li><li>Utilize multiple sensor modalities for eye tracking and gaze estimation including computer vision, image processing, and signal processing</li><li>Simulate potential eye tracking and gaze estimation technology, analyze and report on results</li><li>Drive novel eye-tracking algorithm development through analysis of experimental results</li>\n</ul>\n\n<strong>Mininum Qualifications:\n<br>\n</strong>\n\n<ul>\n<li>Currently has or is in the process of obtaining a PhD degree or completing a postdoctoral assignment in the field of Computer Vision, Computer Science, Mechanical Engineering, Electrical Engineering, Robotics, Physics, or a related technical field</li><li>5+ years experience developing computer vision</li><li>5+ years of C++ coding skills</li><li>Experience with simulation and determination of success criteria</li><li>Interpersonal skills: cross-group and cross-culture collaboration</li><li>Must be available to start employment on or after January 1, 2018</li><li>Able to obtain work authorization in the U.S. beginning 2018</li>\n</ul>\n\n<strong>Preferred Qualifications:\n<br>\n</strong>\n\n<ul>\n<li>Experience developing signal processing algorithms that utilize a broad range of sensor modalities</li><li>Experience in 3D reconstruction using structured light, stereo, photogrammetry, or similar methods</li><li>Experience in 3D data processing and 3D data filtering</li><li>Experience in machine learning</li><li>Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as first-authored publications at leading workshops or conferences such as CVPR, ICCV, SIGGRAPH, and ETRA</li>\n</ul>"}