{"job title": "ES Manager Data &amp; Analytics", "company": "GlaxoSmithKline", "city state": "– Warren, NJ", "rating": "3.7", "job description": "Position Title: ES Manager Data &amp; Analytics\n<br><br>\n Working Location: New Jersey\n<br><br>\n Employment Status: Full time\n<br><br>\n Required Experience: 5 years\n<br><br>\n Required Education: Bachelors\n<br><br>\n Travel Required: 0%\n<br><br>\n Job Description:\n<br>\nGSK is on a journey towards digital transformation to become the global leader in bringing the best in class analytics and insights, to serve the consumer and patient. In April 2017, Emma Walmsley, formerly the Head GSK Consumer, was appointed CEO of GSK and has been vocal about her desire to accelerate GSKs digital transformation. This strategy is far reaching and will extend to all corners of the business from Big Data and applications of artificial intelligence in Healthcare to New Media in bringing to life consumer brands for Expert Sales &amp; Marketing across North America and LATAM countries.\n<br><br>\n The role is rare in that the scope for you to make an impact is very real and you will interface significantly with senior colleagues across the company in the Commercial Business &amp; in the digital business including product development and new product introduction. This is an excellent time to be joining a highly successful market leader in the healthcare industry and drive significant technology change across the organization.\n<br><br>\n The ideal candidate is highly experienced in conducting business analysis on multiple projects simultaneously in a distributed global matrix environment with an expertise in SQL and BI tools providing strategic, consultative insights/analysis to senior management across the company in Expert Sales, Commercial, Marketing &amp; in the digital business across North America and LATAM.\n<br><br>\n Influences strategic decisions with current brand portfolios, new product launches and/ or introductions to the marketplace and the Healthcare Provider that drive our sales. The Business Data &amp; Analytics manager will join a strong technical team in a highly demanding area of the Expert Sales business and should possess a strong background in technology and driving business strategy. This role has changed from providing analysis of Healthcare provider (HCP) transactional data, insights gathered from the CRM system and segmentation &amp; targeting of HCPs to a more strategic role responsible for delivering digital transformation for our Expert sales business, delivering key and critical metrics in line with our strategic purpose of expanding HCP reach.\n<br><br>\n Key Duties:\n\n\n<ul>\n<li>Responsible for providing the strategic direction through in-depth analytics which helps set how to best leverage Expert sales resources to deliver the needs of the Expert business and improve productivity across North America &amp; LATAM countries</li>\n<li>Develop high-level business requirements / use cases for projects to support business justification and drive Expert Sales &amp; Marketing strategy.</li>\n<li>Responsible for all emerging capabilities such as Sales Reporting tools, Sales Forecasting tools, SAP Utilization, Microsoft Power BI, SalesForce.com, Territory &amp; Segmentation tools.</li>\n<li>Provide leadership &amp; best practice guidance for requirements analysis and prioritization.</li>\n<li>Development of scorecards and dashboards for use in visual performance management that drives Expert Sales &amp; Marketing strategy.</li>\n<li>Manage / oversee all Systems analytics responsible for managing all aspects of Sales utilization of GSK Global reporting tool Microsoft PowerBI</li>\n<li>Sets the strategic direction with the Technical business lead for Microsoft PowerBI for Expert Sales</li>\n<li>Responsible for defining the strategy in automating integrated business planning processes utilizing various data inputs for Expert Sales, Marketing, Global Analytics team and Finance.</li>\n<li>Understand the different nature of commercial challenges (ie, legal, compliance, financial reporting, country specific) in globally diverse business models in order to frame business analysis in a business context within the NA &amp; LATAM Expert business.</li>\n<li>Understand when to highlight risks or issues and ability to clearly communicate them to management teams and stakeholders.</li>\n<li>Operate effectively in a globally distributed matrix environment</li>\n\n</ul>\n\n<li>GSK-LI</li>\n\n Essential Skills:\n\n\n<ul>\n<li>Bachelors Degree, IT/Business preferred</li>\n<li>Extensive experience coding in SQL</li>\n<li>Experience with BI Powertools &amp; Reporting</li>\n<li>Significant SAP Operating Environment experience</li>\n<li>5 years of Data Analytics experience, Sales Force System Support, Data Scientist</li>\n<li>Ability to travel 10-25% of the time</li>\n</ul>\n\nWe are an Equal Opportunity Employer and do not discriminate against\n<br>\nany employee or applicant for employment because of race, color, sex,\n<br>\nage, national origin, religion, sexual orientation, gender identity,\n<br>\nstatus as a veteran, and basis of disability or any other federal,\n<br>\nstate or local protected class.\n<br><br>\n<strong> .</strong>"}