{"job title": "Quality Control Development Scientist", "company": "Integrated DNA Technologies", "city state": "– Coralville, IA", "rating": "3.6", "job description": "<strong>Integrated DNA Technologies</strong>\n<br><br>\n<strong>ID</strong> 2018-4065\n<br>\n<strong>Job Locations</strong> US-IA-Coralville<strong>Category</strong> Manufacturing Operations\n<br>\n<strong># of Openings</strong> 1\n<br>\n<strong>Posted Date</strong> 14 hours ago\n<br>\n<strong>Shift/Schedule</strong> M-F 40 Hour Week (United States of America)\n<br><br>\n<strong>Overview</strong>\n<br><br>\nThe QC Development Scientist assists with all scientific and documentation aspects of relevant process development, improvements, and investigations in support of maintaining and improving manufacturing processes within Integrated DNA Technologies.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\n<strong><u>Essential Functions:</u></strong>\n\n<ul>\n<li>Designs and performs experimentation with assistance or as prescribed by management to improve existing or create new processes</li><li>Applies extensive scientific knowledge with broad laboratory skills to execute complex bench experiments using a variety of molecular biology, biochemical, and analytical techniques as directed, while maintaining GLP</li><li>Analyzes and interprets QC and experimental data and appropriately responds to the information on hand</li><li>Documents all testing via reports and/or presentations, presents data, and recommends future steps</li><li>Collaborates and effectively communicates with all levels of IDT staff within various departments to facilitate successful project and process outcomes, including full documentation via reports and/or presentations</li><li>Evaluates QC instruments and processes for areas of improvement</li><li>Evaluates new technology for integration into existing QC processes and recommend adoption of new technology/processes</li><li>Responds to internal and external customer inquiries and requests as relevant to product quality or integrity</li><li>Manages development or transfer of new QC processes or improvements to existing QC processes through implementation with minimal assistance. This may include investigation and implementation of new QC equipment, methods, procedures, and software.</li><li>Designs applications for process automation.</li><li>Supports QC operations at all facilities.</li><li>Investigates customer complaints and obtains data for customer inquiries that are relevant to QC.</li><li>Conducts experimentation in the synthesis, characterization, and/or functional integrity of oligonucleotides or Raw Materials.</li><li>Prioritizes work and completes projects in an accurate and timely manner.</li><li>Drives change for QC at all IDT locations.</li><li>Develops equipment and process validation plans related to QC.</li><li>Provides and coordinates training for end users and support staff</li><li>Recommends testing for manufacturing-related NCRs and CAPAs</li><li>Adheres to all departmental protocols, rules, and safety regulations and understand the requirements of ISO 9001, ISO 13485, and ISO 14001</li><li>Demonstrates behavior consistent with the Integrated DNA Technologies Core Values.</li> <li>Performs other duties as assigned.</li>\n</ul>\n\n<strong><u>Education:</u></strong>\n\n<ul>\n<li>Minimum of bachelor's degree in a scientific field required; Advanced degree or 2 years of IDT or equivalent experience strongly preferred</li><li>Understanding of ISO 9001, ISO 13485, ISO 14001 required</li>\n</ul>\n\n<strong><u>Professional Experience:</u></strong>\n\n<ul>\n<li>PCR experience preferred, but not required</li><li>Knowledge of Sequencing required</li><li>Sequencing experience preferred, but not required</li><li>Minimum of three years of experience working with relevant QC techniques required</li><li>Manual dexterity and technical proficiency with pipetting required</li><li>Proficiency in a variety of PC software programs with strong working knowledge of Microsoft Office required</li><li>Awareness of principles of Lean and Six Sigma preferred</li><li>Experience with statistical analysis and design of experiments preferred</li><li>Experience in Next Generation Sequencing (NGS) for enrichment, library construction, and sequencing strongly preferred</li><li>Analytical instrumentation experience (liquid chromatography, spectrophotometers) preferred</li>\n</ul>\n\n<strong><u>Other Job Qualifications</u></strong>\n\n<ul>\n<li>Ability to maintain a high degree of mechanical aptitude</li><li>Adaptability to performing under stress when confronted with emergent, critical, unusual, or dangerous situations, or situation in which working speed and sustained attention are make-or-break aspects of the job.</li> <li>Adaptability to performing a variety of duties, often changing from one task to another without loss of efficiency or composure.</li><li>Ability to maintain both a high standard of courtesy and cooperation in dealing with co-workers.</li> <li>Adaptability to accepting responsibility for the direction, control or planning of an activity.</li> <li>Adaptability to situations requiring the precise attainment of set limits, tolerances or standards.</li>\n</ul>\n\n<strong><u>Physical Requirements:</u></strong>\n<br><br>\nExert 20-50 lbs. of force occasionally and/or 10-15 lbs. of force frequently\n<br><br>\n<em>Frequent (34-66% of work day)</em>\n\n<ul>\n<li><strong>Sitting</strong>: to assume a position in which the weight is largely supported by the buttocks, usually with the body vertical and the thighs horizontal.</li><li><strong>Walking</strong>: moving about on foot to accomplish tasks.</li> <li><strong>Lifting</strong>: raising objects from a lower to a higher position or moving objects horizontally from position to position.</li> <li><strong>Using Fingers/Grasping/Feeling</strong>: writing or otherwise working, primarily with fingers rather than with the whole hand or arm as in handling. Applying pressure to an object with the fingers or palm and perceiving attributes of objects such as size, shape, temperature or texture by touch.</li> <li><strong>Talking</strong>: expressing or exchanging ideas by means of the spoken work- those activities in which they must convey detailed or important spoken instructions to other workers accurately, loudly, or quickly.</li> <li><strong>Hearing</strong>: perceiving the nature of sounds at normal range; ability to receive detailed information through oral communication, and to make fine discriminations in sound, such as when auscultating and percussing.</li> <li><strong>Repetitive Motion</strong>: substantial movements (motion) of the wrists, hands, and/or fingers.</li> <li><strong>Bending</strong>: bending body downward and forward by bending spine at the waist and/or bending leg; bending legs at knee to come to rest or kneel.</li> \n</ul>\n\n<em>Occasional (33% or less of work day)</em>\n\n<ul>\n<li><strong>Reaching</strong>: extending hand(s) and arm(s) in any direction.</li> <li><strong>Standing</strong>: maintaining an upright position.</li> <li><strong>Pushing/Pulling</strong>: using upper extremities to press against something with steady force in order to thrust forward, downward or outward/using upper extremities to exert force in order to drag, haul or tug objects in a sustained motion.</li><li><strong>Climbing</strong>: stairs, stools, ramps, ladders.</li>\n</ul>\n\n<strong><u>Visual Acuity:</u></strong>\n\n<ul>\n<li>Work requires close vision, distance vision, peripheral vision, depth perception and ability to adjust focus.</li> <li>Ability to read pertinent printed material and distinguish colors.</li><li>Ability to accurately read measurements on equipment.</li> <li>Ability to prepare and read written documentation; use of computer.</li>\n</ul>\n\nIntegrated DNA Technologies is an equal employment and affirmative action employer. Minorities, women, veterans and individuals with disabilities are encouraged to apply.<br><br>PI104220042"}