{"job title": "Senior Polymer Scientist", "company": "Lubrizol", "city state": "– Brecksville, OH", "rating": "3.5", "job description": "<ul>\n<li>*Senior Polymer Scientist**</li>\n</ul>\n\nReq ID: 38827\n<br><br>\nLubrizol, a Berkshire Hathaway company, is a market-driven global company that combines complex, specialty chemicals to optimize the quality, performance and value of customers? products while reducing their environmental impact. Lubrizol produces and supplies technologies to customers in the global transportation, industrial and consumer markets. These technologies include lubricant additives for engine oils, driveline and other transportation-related fluids, industrial lubricants, and additives for gasoline and diesel fuel. In addition, Lubrizol makes ingredients and additives for home care and personal care products and pharmaceuticals, and specialty materials, including plastics technology and performance coatings in the form of resins and additives.\n\n\n<ul>\n<li>*Summary of Responsibilities:**</li>\n</ul>\n\nThe Senior Scientist is primarily responsible for leading polymer synthesis to improve current products or to develop new products with unique performance characteristics. The position will work with business teams to identify, and lead new technology platforms that deliver a new and valuable capability.\n<br><br>\n<strong>DUTIES/RESPONSIBILITIES:</strong>\n<br><br>\n+ Develop new products and formulations for thermoplastic polyurethanes and high performance thermoplastic elastomers.\n<br><br>\n+ Work with business teams and/or customers to identify and commercialize innovative technology\n<br><br>\n+ Support process development and scale up of new products\n<br><br>\n+ Develop structure-performance relationships\n<br><br>\n+ Perform independent research in a multidisciplinary environment on complex issues\n<br><br>\n+ Utilize advanced chemical knowledge, data, modeling, and statistical tools to solve technical challenges\n<br><br>\n+ Document, interpret, and communicate results to colleagues, sponsors and customers\n<br><br>\n+ Create and secure intellectual property\n<br><br>\n+ Stay current with the state of the art in TPU chemistry, test methods and processing techniques.\n<br><br>\n+ Proactively maintain a safe working environment.\n<br><br>\n<strong>SKILLS, QUALIFICATIONS, EXPERIENCE, SPECIAL PHYSICAL REQUIREMENTS:</strong>\n<br><br>\n+ Ph.D. in Polymer Science, Chemistry, Materials Science or related field\n<br><br>\n+ 5+ Years of industrial experience in Synthesis\n<br><br>\n+ Experience in high performance thermoplastic elastomers is desirable\n<br><br>\n+ Experience translating customer needs and performance gaps into product characteristics\n<br><br>\n+ Track record of innovation and commercializing new products\n<br><br>\n+ Strong project management skills including the ability to manage multiple projects concurrently\n<br><br>\n+ Ability to lead diverse, multidisciplinary work teams\n<br><br>\n+ Excellent interpersonal skills and experience with customer interactions\n<br><br>\n+ Up to 30% global travel\n<br><br>\n+ Willingness to travel as needed\n<br><br>\nWith multiple facilities in and around Cleveland, Ohio at http://www.thisiscleveland.com/ , Lubrizol is located in one of the largest economic regions in the United States.For the last seven years Lubrizol has been named one of the top workplaces in Northeast Ohio, and in 2016 was judged as the number one workplace by Northeast Ohio?s annual Top Workplaces survey at http://www.cleveland.com/business/index.ssf/2016/06/lubrizol_top_large_company_win.html#incart . Buzzing with business, culture, knowledge and entertainment, Northeast Ohio at http://www.globalcleveland.org/ is a vibrant place for people of all ages and walks of life to live, learn, work and play. This region offers a little bit of everything for everyone - ethnically-diverse communities, affordable housing, award-winning schools and universities, world-class healthcare, indoor waterparks and zoos, ski resorts, museums, halls of fame, one of the longest water-fronts in the country, and the most concentrated square mile of art, cultural, education and health institutions in the nation. From making your heart race at Cedar Point, to attending a professional sporting event orbiking or hiking through over the 100,000 acres of state parks, to catching a Broadway show at Playhouse Square - the second largest performing arts center in the country, you can make it happen right here in Cleveland, Ohio .\n<br><br>\n_Lubrizol is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status._\n\n\n<ul>\n<li>*Nearest Major Market:** Cleveland</li>\n<li>*Job Segment:** Chemistry, Scientific, Scientist, Chemical Engineer, Materials Science, Science, Engineering</li>\n</ul>"}