{"job title": "Assistant Research Scientist (32)", "company": "NYU Langone Health", "city state": "– New York", "rating": "3.8", "job description": "<strong>NYU School of Medicine</strong> is one of the nation's top-ranked medical schools. For 175 years, NYU School of Medicine has trained thousands of physicians and scientists who have helped to shape the course of medical history and enrich the lives of countless people. An integral part of NYU Langone Health, the School of Medicine at its core is committed to improving the human condition through medical education, scientific research, and direct patient care. For more information, go to med.nyu.edu, and interact with us on Facebook, Twitter and Instagram.\n<br><br>\n<strong>Position Summary:</strong>\n<br><br>\nPrimary responsibility will involve the isolation, culture and characterization by biochemical and genomic properties of strains of anaerobic bacteria from the human intestine. The candidate will work with primary human stool samples and blood samples. These will be characterized for in vitro growth characteristics and DNA analyses based on 16S ribosomal gene assignments. Bacterial isolates will also be subjected to genomic sequence analysis\n<br><br>\n<strong>Job Responsibilities:</strong>\n\n<ul>\n\n<li>General Responsibilities\n\n<ul>\n<li>Demonstrates knowledge of the organization’s Core Values and incorporates them into the performance of duties.</li>\n\n<li>Initiates, interprets, organizes, executes, and coordinates research assignments critical to department mission.</li>\n\n<li>Formulates and conducts research on problems of considerable scope and complexity.</li>\n\n<li>Explores subject area and defines scope and selection of problems for investigation through conceptually related studies or series of projects of lesser scope.</li>\n\n<li>Makes decisions and recommendations that have an impact on scientific research activities.</li>\n\n<li>Develops new ideas that promote current research. Exercises a high degree of creativity, foresight, and mature judgment in planning, organizing, and guiding extensive scientific research programs and activities of outstanding novelty and/or importance.</li>\n\n<li>May manage the operations of a lab for the Principal Investigator by supervising Post Docs and technicians. Oversees the maintenance and upkeep of all instruments and laboratory facilities.</li>\n\n<li>Ensures timely and accurate completion of research projects.</li>\n\n<li>May provide students with technical guidance and direction in the operation of various sample preparation techniques, extraction lines, and equipment as well as general laboratory practices and safety protocols.</li>\n\n<li>May participate in writing grant proposals.</li>\n\n<li>May be responsible research/lab quality control and compliance.</li>\n\n<li>May develop protocol for the collection and quality of research data.</li>\n\n<li>Develops research techniques and methodologies.</li>\n\n<li>May determine and establish laboratory policies, procedures and practices.</li>\n\n<li>Maintains a thorough knowledge of the advances in specialized fields through attendance of scientific conferences.</li>\n\n<li>May make contributions to scientific papers and serve as a resource/ author/ co-author for reports and presentations.</li>\n\n<li>May provide recommendations for equipment purchases and lab operations issues.</li>\n\n<li>May coordinate the activity and experimental design between various labs, scientific staff, and collaborators. Identifies and resolves technical problems.</li>\n\n<li>May serve on internal committees to help further goals of research projects and bring new expertise to the research program.</li>\n\n<li>May give oral presentations to present, to summarize and to defend a position of a research publication.</li>\n\n<li>Performs other related duties as assigned</li>\n</ul>\n\n</li>\n</ul>\n<strong>Minimum Qualifications:</strong>\n<br><br>\nMasters degree with up to 2 years of outstanding related professional research experience. Experience in an immunology lab and a strong scientific background apparent from publication record is desired as is previous experience with multicolor flow cytometry and molecular biology.\n<br><br>\n<em>Qualified candidates must be able to effectively communicate with all levels of the organization.</em>\n<br><br>\nNYU School of Medicine provides its staff with far more than just a place to work. Rather, we are an institution you can be proud of, an institution where you'll feel good about devoting your time and your talents.\n<br><br>\nNYU School of Medicine is an equal opportunity and affirmative action employer committed to diversity and inclusion in all aspects of recruiting and employment. All qualified individuals are encouraged to apply and will receive consideration without regard to race, color, gender, gender identity or expression, sex, sexual orientation, transgender status, gender dysphoria, national origin, age, religion, disability, military and veteran status, marital or parental status, citizenship status, genetic information or any other factor which cannot lawfully be used as a basis for an employment decision. We require applications to be completed online.\n<br>\nIf you wish to view NYU School of Medicine's EEO policies, please click here. Please click here to view the Federal \"EEO is the law\" poster or visit https://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm for more information. To view the Pay Transparency Notice, please click here.<br><br>Required Skills\n<br><br>\n<strong>Required Experience</strong>\n<br><br>\nJob Location\n<br>\nNew York,\n<br>"}