{"job title": "Associate Scientist, Prep Room", "company": "The Estee Lauder Companies", "city state": "– Melville, NY", "rating": "3.5", "job description": "<ul>\n<li>*Associate Scientist, Prep Room**</li>\n<li>*Brand:** Est?e Lauder Companies Corporate Departments</li>\n<li>*Description**</li>\n</ul>\n\n<strong>Test Product Management:</strong>\n\n\n<ul>\n<li>Manage inventory of all add-on study products and materials, e.g. sunscreens, wash-out soaps/cleansers, etc.</li>\n<li>Maintain products from study set-up through to completion</li>\n<li>Maintain product logs</li>\n<li>Includes archiving and/or destruction of returned test products according to approved guidelines</li>\n<li>Accountable for all test product inventory for internal and external clinical studies</li>\n<li>Receive clinical returns for Safety In-Use studies and determine appropriate product diversion to Micro, use-up, etc.</li>\n<li>Adhere to deadlines for preparation of test samples, devices, test materials, and other products</li>\n<li>Ensure on-time study initiation and facilitation of interim study visits</li>\n</ul>\n\n<strong>Study Documentation:</strong>\n\n\n<ul>\n<li>Perform quality control checks of all clinical study documents for accuracy</li>\n<li>Perform quality control checks of product labeling to ensure proper instructions for compliance support</li>\n<li>Make recommendations for updates/changes to best support study needs</li>\n<li>Ensure adequate number of documents (e.g. consent forms, photo releases, diaries, etc.) are available for distribution to panelists on required study dates</li>\n<li>Create studies in the electronic informed consent program, including uploading informed consent documents, photo releases, and panelist information as required.</li>\n<li>Ensure on-time study initiation and facilitation of interim study visits</li>\n</ul>\n\n<strong>Compliance Management:</strong>\n\n\n<ul>\n<li>Test product weighing</li>\n<li>Analysis of product pre-study and post-study weights</li>\n<li>Review of daily diaries</li>\n<li>Report results and escalate questionable findings to study investigator</li>\n</ul>\n\n<strong>Equilibration Room Responsibilities:</strong>\n\n\n<ul>\n<li>Provide coverage for the Clinical Coordinator as a backup when needed</li>\n<li>Complete required study-related documents accurately and in a timely manner including enrollment documents and ongoing testing documents, e.g. Informed Consents, Photo Releases, interim visit screeners, and product collection logs</li>\n<li>Conduct preliminary qualification interviews and assess questionable responses that may affect eligibility for study participation</li>\n<li>Manage Equilibration Room temperature and humidity monitoring, escalating issues that affect study integrity, and initiating contingency plans</li>\n<li>Manage the daily panelist work flow to ensure efficient testing schedule and proper equilibration time for all panelists prior to testing and data collection</li>\n<li>Promote the ethical conduct of clinical research studies by reporting any suspicion of panelist non-compliance or misconduct</li>\n</ul>\n\n<strong>Additional Responsibilities:</strong>\n\n\n<ul>\n<li>Maintain updated training on all applicable GCP and SOP processes.</li>\n<li>Perform other duties as required/requested by Supervisor.</li>\n<li>*Qualifications**</li>\n</ul>\n\nBachelor?s Degree in Science\n<br><br>\nKnowledge of basic biological principles as they relate to skin/skin physiology\n<br><br>\nMinimum 6 months experience in Clinical Research\n<br><br>\nExtremely strong written and verbal communication skills\n<br><br>\nExcellent organizational, time management, and project planning abilities\n<br><br>\nMicrosoft Word, Excel, and Outlook\n\n\n<ul>\n<li>*Job:** Research &amp; Development</li>\n<li>*Primary Location:** Americas-US-NY-Melville</li>\n<li>*Job Type:** Standard</li>\n<li>*Schedule:** Full-time</li>\n<li>*Shift:** 1st (Day) Shift</li>\n<li>*Travel:** No</li>\n</ul>\n\nWe are an equal opportunity employer. Minorities, women, veterans, and individuals with disabilities are encouraged to apply. **Job Number:** 187740"}