{"job title": "Principal, Science \\u0026 Analytics-Earthquake Scientist", "company": "CoreLogic", "city state": "– Oakland, California", "rating": "2.8", "job description": "<strong>Job Duties:</strong>\n\n<ul>\n<li>Provide seismic hazard model-related sales support including analytic support, preparation of presentation slides, giving presentations, and participation in meetings with clients and prospects.</li><li>Provide seismic hazard model-related support including participation in webinars presented to clients and prospects. Develop and give presentations at client conferences and external industry and scientific conferences.</li><li>Strong communication skills in the English language (both verbal and written).</li><li>Strong problem solving and analytical ability.</li><li>Ability to quickly and efficiently adapt to new concepts through innovation.</li><li>Ability to thrive in a team environment and adapt to quickly changing priorities.</li>\n</ul>\n\n<strong>Auto req ID</strong>\n<br>\n<strong>12329BR</strong>\n<br><br>\n<strong>Position Type</strong> \n<br>\nFull Time\n<br><br>\n<strong>Posting Job Summary</strong>\n<br>\nJoin the team that powers the global real estate economy - CoreLogic is an innovative, future focused company whose vision is to deliver unique property-level insights that power the global real estate economy.\n<br>\nWe are a $1.95 billion in sales company with more than 6,000 employees globally serving the financial services and insurance industries. We are evolving at a rapid pace and the clients we serve are challenged from every direction, which means we are growing and innovating to help drive their success. Working together, and differentiated by our superior data, analytics and data-enabled solutions, we empower our clients to make smarter business decisions through data-driven insights. We take initiative, are fully accountable, build respect and trust, make transparency a must - and engage, include and collaborate at every turn.\n<br>\nWe take pride in our work and believe in cultivating a work environment that supports and values our greatest asset: our talented employees.\n<br><br>\n<strong>State/Region/Province</strong>\n<br>\n<strong>CA</strong>\n<br><br>\n<strong>% Travel Involved</strong>\n<br>\nLess than 10%\n<br><br>\n<strong>Posting Job Requirements</strong>\n<br>\n<strong>Education, Experience, Knowledge and Skills</strong>\n\n<ul>\n<li>Ph.D. in an earth-science related field (e.g., seismology, geophysics, geology, engineering seismology, geotechnical engineering).</li><li>3-5 years of directly related experience in deterministic and probabilistic seismic hazard analysis (PSHA) and seismic hazard model development.</li><li>Experience in OpenSHA / OpenQuake probabilistic seismic hazard analysis platform.</li><li>Experience in Tsunami Modeling.</li><li>Familiarity with natural hazard catastrophe modeling is essential.</li><li>Working knowledge of probability theory and statistics is essential.</li>\n</ul>\n\nCoreLogic offers an empowered work environment that encourages creativity, initiative and professional growth and provides a competitive salary and benefits package. CoreLogic is an Equal Opportunity/Affirmative Action employer committed to attracting and retaining the best-qualified people available, without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, disability or status as a veteran of the Armed Forces, or any other basis protected by federal, state or local law. CoreLogic maintains a Drug-Free Workplace. We are fully committed to employing a diverse workforce and creating an inclusive work environment that embraces everyone's unique contributions, experiences and values. Please apply on our website for consideration.\n<br><br>\n<strong>Category</strong>\n<br>\nData &amp; Analytics\n<br><br>\n<strong>City</strong>\n<br>\nOakland\n<br><br>\n<strong>Business Segment</strong>\n<br>\nProperty Intel &amp; Risk Mgmt Sol\n<br><br>\n<strong>Country</strong>\n<br>\nUnited States\n<br>"}