{"job title": "Senior Staff Clinical Research Scientist", "company": "Leica Biosystems", "city state": "– Vista, California", "rating": "2.5", "job description": "About UsLeica Biosystems is a global leader in workflow solutions and automation. As the only company to own the workflow from biopsy to diagnosis, we are uniquely positioned to break down the barriers between each of these steps. Our mission of Advancing Cancer Diagnostics, Improving Lives is at the heart of our corporate culture. Our easy-to-use and consistently reliable offerings help improve workflow efficiency and diagnostic confidence. The company is represented in over 100 countries. It has manufacturing facilities in 9 countries, sales and service organizations in 19 countries, and an international network of dealers. The company is headquartered in Nussloch, Germany. Visit for more information. Leica Biosystems Imaging, Inc. is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, national origin, religion, gender, age, marital status, disability, veteran status, sexual orientation, gender identity, or any other characteristic protected by law. All employment offers are contingent upon successful completion of our pre-employment drug screening and background/criminal check. Be sure to follow Leica Biosystems on LinkedIn!<p> </p><p> <b> </b></p><b> Description</b> <p></p> <p> </p> <p> Reporting to the Sr. Director of Clinical Affairs, the Sr. Staff Clinical Research Scientist understands business needs and follows established operating company policies/procedures and Good Clinical Practice global standards in the strategic design and oversight of assigned clinical study programs. </p> <p> Leads the development and execution of the clinical evidence portfolio for multiple programs, ensuring that global market needs are designed into the plan for clinical trial investments (pre-market and post-market).</p> <p> Represents the Sponsor in clinical study planning, trial design, trial execution and trial closeout. Examples of work deliverables include clinical evidence strategy, clinical protocol, data management plan, monitoring plan and clinical report. Collaborates with other functions (biostatistics, data management, regulatory, quality, R&amp;D, etc) and external partners (investigators, subject matter experts, Contract Research Organizations) on product development process deliverables.</p> <p> Operational activities supporting these clinical responsibilities require strong cross-functional collaboration. Deliverables include: Study site qualification, site selection, site initiation, clinical study monitoring, evaluate clinical results, report generation and clinical evidence publication of trial results in peer-reviewed journals.</p> <p> Represents the Clinical Affairs department on multi-functional core teams, and at FDA, to ensure program requirements are met and that clinical trials are executed in a compliant, scientifically appropriate manner. </p> <p> Uses the Danaher Business System and standard work to systematically measure/report/improve the overall clinical study process. </p> <p> Maintains current knowledge and ensures adherence to Good Clinical Practice (GCP) global standards and department standard operating procedures for conducting clinical studies.</p> <p> The Sr. Staff Clinical Research Scientist will work closely with the Senior Director of Clinical Affairs to ensure efficient and effective start-up, conduct and close-out of diagnostic clinical trials (such as advanced staining, companion diagnostics or other):</p> <p> Clinical evidence strategy synthesis of Voice of Customer requirements into recommended clinical trial investments. These clinical investments are collectively designed to generate clinical evidence (such as a peer-reviewed publication) that meets customer needs and drives market awareness/adoption of a product/technology.</p> <p> Study design diagnostic protocol writing, biospecimen procurement, collaborate on the statistical analysis plan/data management plan, monitoring plan</p> <p> Study conduct management of external vendors &amp; contract research organizations (CROs), quality and integrity of clinical data (data management), clinical study monitoring</p> <p> Study reporting data analysis &amp; presentation to internal and external stakeholders, contribution to clinical reports and peer-reviewed publications</p> <p> May provide direction and task oversight to others on the clinical program team for one or more programs</p> <p> The role involves collaborations with internal project stakeholders (Clinical Affairs, R&amp;D, Quality, Regulatory, etc.) and external partners (such as co-development collaborators and CROs).</p> <p> </p><p> <b> </b></p><b> Qualifications</b> <p></p> <p> </p> <p> Demonstrated experience in evidence planning, clinical strategy, study design/execution and study monitoring for clinical diagnostics, medical devices or pharmaceutical products in a regulated environment.</p> <p> Demonstrated experience in effectively negotiating with regulators (such as the U.S. Food and Drug Administration) and designing/executing clinical programs resulting in a successful global commercial release.</p> <p> Experience in oncology, IHC and/or ISH, or pathology imaging are highly preferred.</p> <p> Hands-on experience with genomics and/or proteomics assay development is highly preferred.</p> <p> Able to secure appropriate internal or external technical expertise required and coordinate efforts to resolve compliance or technical issues that may arise during clinical trials.</p> <p> Demonstrated strong ability to work in a team environment, with the ability to relate to both highly educated and unskilled team members.</p> <p> Demonstrated strong ability to handle and resolve conflicts and work under stressful conditions and in an environment of changing priorities.</p> <p> Demonstrated ability or track record of successful results, building effective teams and getting work done through others. </p> <p> Demonstrated strong ability to understand complex scientific, engineering and business concepts.</p> <p> Proven technical writing and presentation skills required.</p> <p> Demonstrated strong ability to be flexible and resourceful. Excellent communication and diplomacy skills required.</p> <p> Independent, motivated, organized individual with strong analytical and problem solving skills</p> <p> Strong computer skills, including demonstrated high proficiency with Microsoft Word, Excel and Powerpoint</p> <p> Demonstrated ability to apply the Danaher Business System to track/measure/report performance, solve problems and drive continuous process improvement. </p> <p> Bachelor of Science (B.S.) or Master of Science (M.S.) or Doctor of Philosophy (Ph.D.). in Histology, Microbiology, Biomedical Engineering or a related field and a minimum of the following years of industry or relevant experience according to degree:</p> <p> Bachelors Degree 10+ years </p> <p> OR Masters degree with 7+ years</p> <p> OR Doctoral degree with 5+ years</p> <p> Must be proficient in writing, and communicating in the English language. </p> <p> Must be consistent with claimed level of education. Knowledge of and practical experience with statistics is highly desired.</p> <p> Good problem solving, judgment and decision making skills are required.</p> <p> Clinical research certification (such as CCRA, CCRC) is highly desired.</p> Danaher Corporation OverviewDanaher is a global science &amp; technology innovator committed to helping our customers solve complex challenges and improve quality of life worldwide. Our world class brands are leaders in some of the most demanding and attractive industries, including life sciences, medical diagnostics, dental, environmental and applied solutions. Our globally diverse team of 67,000 associates is united by a common culture and operating system, the Danaher Business System, which serves as our competitive advantage. We generated $18.3B in revenue last year. We are ranked #162 on the Fortune 500 and our stock has outperformed the S&amp;P 500 by more than 1,200% over 20 years.At Danaher, you can build a career in a way no other company can duplicate. Our brands allow us to offer dynamic careers across multiple industries. Were innovative, fast-paced, results-oriented, and we win. We need talented people to keep winning. Here youll learn how DBS is used to shape strategy, focus execution, align our people, and create value for customers and shareholders. Come join our winning team.<p> </p><p> <b> Organization</b> </p> <p></p> :Leica Biosystems"}