{"job title": "Research Data Analyst", "company": "McLean Hospital(MCL)", "city state": "– Waltham, Massachusetts", "rating": "NA", "job description": "McLean Hospital is a comprehensive psychiatric hospital committed to providing easy access to superior quality, cost-effective mental health services in the Boston area, Massachusetts and beyond. Since 1811, McLean Hospital has been a world leader in the treatment of mental illness and chemical dependency, research into the cause of mental illness and the training of generations of mental health care providers. McLean's multidisciplinary programs treat a broad range of psychiatric illnesses across the full continuum of care.\n<br><br>\n<strong> General Summary:</strong> \n<br>\nInterested in applying technical or computational skills to deep questions about the human mind and mental illness? Have a background in computer science or engineering and want to make an impact on human disease while engaging with intelligent, creative colleagues at the interface of neuroscience, psychiatry, and technology?\n<br><br>\nJoin our team - under the supervision of the Director of Functional Neuroimaging and Bioinformatics for the Psychotic Disorders Division of McLean Hospital and in collaboration with world-class scientists and clinicians at Harvard University, McLean Hospital and Massachusetts General Hospital - acquiring and analyzing an array of biological and behavioral data to better understand the causes and cures for severe mental illness, particularly bipolar disorder and schizophrenia.\n<br><br>\nData obtained in the lab include (1) structural and functional neuroimaging, (2) physiological measures, (3) eye-tracking, (4) face/body tracking, (5) mobile sensor and usage data, (5) electronic health record data and (6) an array of clinical assessment tools. In addition to refining strategies for longitudinal collection of each of these data types, this position - in collaboration with the Harvard Neuroinformatics Research Group and support technical staff at the Martinos and McLean Imaging Centers - requires maintaining and extending data processing pipelines, maintaining and extending relational databases for collected data, text mining/natural language processing of data obtained from narrative notes and transcribed interviews of patients, and assorted technical support services (e.g., basic UNIX support, archiving, troubleshooting). The ideal candidate will have experience with MATLAB, UNIX and shell scripts and ideally experience with analysis of brain imaging data, although not required.\n<br><br>\nDepending on the interest of the applicant, there are also opportunities for this position to include interaction with patients around study recruitment and performing the procedures listed above.\n<br><br>\nThis position is intended for ambitious, focused individuals looking to launch careers applying technical and computational skills to challenging medical and/or scientific problems, particularly in the neurosciences. Ideal for those transitioning to either graduate school (i.e., MD, PhD, or MD/PhD) or industry but seeking academic experience to develop and apply skills obtained during bachelor's or masters level work.\n<br><br>\nAll McLean team members are expected to consistently demonstrate our values of integrity, compassion, respect, diversity, teamwork, excellence and innovation in their work activities and interactions.\n<br><br>\n<strong>Qualifications</strong>\n<br>\nBS or BA in computer science, electrical engineering, statistics or related fields. Candidates should have previously participated in research or performed relevant coursework in image processing, computer vision, statistical or machine learning. Experience with functional MRI is preferred (but not required). Experience with iOS/Android development helpful (but not required).\n<br><br>\n<strong> Skills/Abilities/Competencies (Required):</strong> \n<br>\n· Good interpersonal and communication skills.\n<br>\n· Good organizational skills, detail oriented.\n<br>\n· Ability to methodically record data and to analyze data using MATLAB, SPSS, UNIX and shell scripts.\n<br>\n· Ability to perform a variety of routine tests and prioritize work.\n<br>\n· Knowledge of computer programs, databases, etc.\n<br><br>\n· Ability to demonstrate professionalism.\n<br><br>\n<strong> Technology Statement:</strong> \n<br>\nAll employees must possess basic computer skills to use a variety of electronic or online systems for communication, clinical and administrative purposes.\n<br><br>\n<strong>EEO Statement</strong>\n<br>\nIt is the policy of McLean Hospital to affirmatively provide equal opportunity to all qualified applicants for employment and existing employees without regard to their race, religion, color, national origin, sex, age, ancestry, protected veteran status, disability, sexual orientation, gender identity or expression, or any other basis that would be in violation of any applicable law or regulation.\n<br>\nPartner's Healthcare is acting as an Employment Agency in relation to this vacancy."}