{"job title": "Data Engineer, Global Product Analytics", "company": "Pearson", "city state": "– Centennial, CO", "rating": "3.1", "job description": "Data Engineer, Global Product Analytics\n<br><br>\nDescription\n<br><br>\nAt Pearson, we're committed to a world that's always learning and to our talented team who help make that possible. From bringing lectures vividly to life to turning textbooks into laptop lessons, we are always re-examining the way people learn best, whether it's one child in our own backyard or an education community across the globe. We are bold thinkers and standout innovators who motivate each other to explore new frontiers in an environment that supports and inspires us to always be better. By pushing the boundaries of technology and each other to surpass these boundaries we create seeds of learning that become the catalyst for the world's innovations, personal and global, large and small.\n<br><br>\n<strong>Position Summary:</strong>\n<br><br>\nProduct Analytics is transforming education, and Pearson is at the forefront of using data to improve teaching and student learning. With over 10 million higher education students annually studying in our MyLabs, Mastering, and other digital learning products, we generate a lot of data. We also have great instructional and assessment content. Our product teams are building adaptive and intelligent learning systems to derive actionable insights about our learners, instructors and institutions. Today, our learning products are delivering personalized experiences worldwide, establishing a powerful foundation for new research and innovation.\n<br><br>\nWe are looking for a data engineer to join the Global Product Analytics team in AI Products and Solutions. Our mission is to improve the impact of Pearson products and people via data tools/processes that offer insights, create meaning, and enable innovation. The position provides an opportunity to engage with cutting-edge technology to push the boundaries of what's possible in education and have an impact on millions of learners around the globe.\n<br><br>\n<strong>In this role, you will:</strong>\n\n\n<ul>\n<li>Assemble large, complex data sets that meet business requirements</li>\n<li>Design, build, and maintain high quality data pipelines</li>\n<li>Act in a Product Owner role to our Engineering partners in Pearson Technology to automate and scale solutions</li>\n<li>Create data tools for analysts and data scientists that assist them in building and optimizing our products and services</li>\n<li>Identify, design, and implement internal process improvements; automate manual processes and optimize data delivery</li>\n<li>Implement data marts that make data available in highly usable schemas</li>\n<li>Extract, transform, and load data from a wide variety of data sources using SQL and big data technologies</li>\n<li>Champion appropriate data governance, security, privacy, quality, and retention policies within the organization</li>\n<li>Help scope, estimate, and prioritize work in an Agile environment</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\nWe are looking for an Engineer with the following:\n\n\n<ul>\n<li>A Bachelor's degree or advanced degree in a technical or math-based field</li>\n<li>At least 3 years of hands-on experience in data modeling, data visualization and pipeline design and development</li>\n<li>Advanced understanding of SQL and database/data warehouse design concepts</li>\n<li>Ability in Python</li>\n<li>Familiarity with AWS S3, AWS Glue, AWS Athena, Hadoop stack, Spark</li>\n<li>Exposure to diverse data storage technologies (RDBMS, SQL Server, MySQL, ElasticSearch, DynamoDB, etc.)</li>\n<li>Experience in data visualization (Tableau, D3) technologies</li>\n<li>Experience interacting with individuals at all levels, good time management, and solid communication skills</li>\n<li>Experience in Agile Methodology</li>\n</ul>\n\nAny of the following are a plus:\n\n\n<ul>\n<li>Experience with Java/other</li>\n<li>Experience in writing R scripts</li>\n<li>Experience with Google Tag Manager, Google Analytics, or Google Big Query</li>\n<li>Experience working with remote teams</li>\n<li>Ability to build analytics tools that utilize the data pipeline and provide actionable insights into learner engagement, content usage, and other key business performance metrics</li>\n</ul>\n\nNOTE: MUST be fully authorized to work in the U.S. No sponsorship or visa transfers.\n<br><br>\n<strong>#LI-NB0</strong>\n<br><br>\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n<br><br>\nPrimary Location: US-CO-Centennial\n<br><br>\nWork Locations: US-CO-Centennial-2154 East Commons 2154 East Commons Avenue Centennial 80122\n<br><br>\nJob: Product Management\n<br><br>\nOrganization: Global Product\n<br><br>\nEmployee Status: Regular Employee\n<br><br>\nJob Type: Standard\n<br><br>\nShift: Day Job\n<br><br>\nJob Posting: Aug 29, 2018\n<br><br>\nJob Unposting: Ongoing\n<br><br>\nSchedule: Full-time Regular\n<br><br>\nReq ID: 1811305\n<br><br>\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply."}