{"job title": "Senior Scientist I, Biology", "company": "Pharmacyclics, an Abbvie Company", "city state": "– Sunnyvale, California", "rating": "NA", "job description": "Pharmacyclics is committed to the development and commercialization of novel therapies intended to improve the quality and duration of life and to resolve serious unmet medical needs for cancer patients. Pharmacyclics is a wholly-owned subsidiary of AbbVie (NYSE:ABBV), a global, research-based biopharmaceutical company. Oncology is a key therapeutic area for AbbVie, with a portfolio consisting of three marketed products and a pipeline containing multiple promising new molecules that are being studied in more than 200 clinical trials for over 20 different types of cancer.\n<br><br>\nMore than 1,200 Pharmacyclics and AbbVie research scientists, clinicians, marketing, operations and corporate professionals work in the San Francisco Bay Area. They combine their expertise in immuno-oncology, stem cells, and cell-signaling with their knowledge of bispecific antibodies, antibody-drug conjugates (ADCs), and covalent-inhibitor technologies to discover and develop novel cancer treatments. Together, we are striving to outsmart cancer.\n<br>\nTo learn more about us, please visit us at\n<br>\n<strong> Senior Scientist I, Biology</strong> \n<br>\n<strong> General Position Summary/Purposes</strong> \n<br>\nProvide strong scientific and technical initiative and hands-on implementation for new target identification/validation in the fields of hematologic malignancies and immuno-oncology. Conceive and execute novel scientific approaches to achieve departmental project goals.\n<br><br>\n<strong> Key Accountabilities/Core Job Responsibilities:</strong> \n\n<ul>\n <li> Devise and implement strategies to identify novel targets in hematological malignancies and immune-oncology.</li>  <li> Advance science from the bench. Design and execute in vitro or ex vivo experiments to validate novel targets using cell lines and primary human cell sources.</li>  <li> Actively participate in internal and external scientific meetings by presenting and critically evaluating emerging scientific literature to contribute to novel target discovery efforts.</li>  <li> Impact projects through experimental designs, critical analysis and interpretation of results and communication of results promptly.</li>  <li> Strong relationships with peers and cross functionally with partners to achieve high performance. Strongly embrace the ideas of others and nurtures innovations.</li> \n</ul>\n\n<strong> Qualifications:</strong> \n\n<ul>\n <li> Ph.D with postdoctoral training in molecular biology/ immunology/ cancer biology.</li>  <li> Strong track record of peer-reviewed publications and (or) presentations.</li> \n</ul>\n\n<strong> Experience:</strong> \n\n<ul>\n <li> Expertise in molecular biology skill sets including gain of function or loss of function techniques to validate targets (transduction of primary cells, CRISPR etc).</li>  <li> Expertise in molecular cellular biology techniques such as ELISA, western blotting, cell culture, FACS, separation techniques for primary cells, gene expression analysis.</li>  <li> Experience with cell-based and/or biochemical assay development, optimization and troubleshooting.</li>  <li> Experience working with immune subsets and functional analysis of immune cells.</li>  <li> Willing to troubleshoot experimental procedures and should be adaptable to changing requirements of the project.</li>  <li> Basic knowledge on biological data analysis tool (GraphPad Prism, FACS DIVA software, FlowJo).</li>  <li> Contribute to lab and equipment maintenance and order supplies/reagents to help create a safe, effective and efficient working environment.</li> \n</ul>\n\nEqual Opportunity Employer Minorities/Women/Veterans/Disabled\n<br><br>"}