{"job title": "Data Analyst", "company": "Segue Technologies", "city state": "– San Antonio, TX", "rating": "4.5", "job description": "<strong>Position Summary:</strong>\n<br><br>\nSegue Technologies, Inc. seeks a Data Analyst. This is a full-time, remote telework position. Travel to multiple locations may be required; typically limited to once per quarter for short durations of less than 5 days.\n<br><br>\nThe Data Analyst will provide day to day financial and contract consulting support to our Department of Defense (DoD) customer and contractor team. The person in this position may introduce new features to end users and provide first level user support and will be expected to work with moderate supervision.\n<br><br>\nJob Duties and Responsibilities include but are not limited to:\n\n\n<ul>\n<li>Identify current and prior fiscal year financial and contract under-execution for liquidating excess funds, mitigating risks, and increasing efficiencies while preparing deobligation packages</li>\n<li>Provide data retrieval, data entry and data reconciliation</li>\n<li>Runs and manipulates standard reports</li>\n<li>Apply technical knowledge of DoD, contract, financial regulations to ensure compliance with internal control programs such as DoD Financial Improvement Audit Readiness (FIAR)</li>\n<li>Assist internal and external staff members with utilization of finance and contract management accounting structure, to include execution of DHP appropriated funds by EEIC, PEC, RCCC, FAC, BAG, and EOR</li>\n<li>Collaborate with Regional Data Analysts and other team members to prioritize work to ensure completion of all tasks including deobligation reports, end of month reports, trip reports, etc.</li>\n<li>Provide quality control of financialand contract data and submit issues to team leadership for further review</li>\n<li>Additional tasks as required</li>\n</ul>\n\n<strong>Required Skills:</strong>\n\n\n<ul>\n<li>Experience in data entry and analysis</li>\n<li>General knowledge of government accounting theory, principles, and practices</li>\n<li>Working knowledge of office automation and computerized financial applications</li>\n<li>Ability to accurately enter, record and retrieve financial data</li>\n<li>Ability to analyze, organize, interpret and correctly present financial data</li>\n<li>Ability to prepare and interpret complex financial reports</li>\n<li>Ability to maintain efficient and effective financial systems and procedures, accurately accounting for service funds</li>\n<li>Ability to establish and maintain effective working relationships with employees, and government/military officials</li>\n<li>Ability to present financial information effectively and persuasively to a diverse audience</li>\n<li>Ability to use independent judgment to know when to escalate issues and make decisions which have considerable impact on the organization</li>\n<li>Demonstrated ability to initiate and manage small analysis projects and strong organization/administrative skills</li>\n<li>Demonstrated ability to use all facets of Microsoft Office (Word, PowerPoint, Excel and Access)</li>\n<li>Ability to pass the DoD T1 background investigation (i.e., NACI)</li>\n<li>Ability to manage confidential information</li>\n<li>Demonstrated attention to detail</li>\n<li>Excellent oral and written communication skills with demonstrated public speaking experience</li>\n<li>Excellent interpersonal skills, teamwork orientation and ability to motivate diverse audiences</li>\n</ul>\n\n<strong>Desired Skills:</strong>\n\n\n<ul>\n<li>Bachelor's degree or equivalent combination of education and work experience</li>\n<li>Working technical knowledge of government and DoD medical and financial regulations</li>\n<li>Working knowledge of government financial and contract procedures and management information systems</li>\n<li>Experience working with DoD financial or contracting management arena</li>\n<li>Experience working in Air Force medical financial and contracting management</li>\n<li>Practiced user of Air Force financial or contract management information systems such as CRIS, DEAMS, ABSS, EDA, and WAWF experience highly desired</li>\n<li>User level experience with the Commodity Management Planning and Surveillance System (COMPASS)</li>\n</ul>\n\nSegue Technologies, Inc. is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law. Please visit our website, www.seguetech.com/careers, to submit an application."}