{"job title": "Data Analyst", "company": "Teltech Systems", "city state": "– South Amboy, New Jersey", "rating": "4.8", "job description": "At TelTech, our mobile apps and services help people do new and useful things with their smartphones, such as revealing blocked callers, putting an end to spam calls, protecting the privacy of their phone number and recording phone calls. But we see our ten-year success story so far as just the beginning of our journey. We are looking to expand our team with creative, talented and passionate people who will be committed to the growth of our existing products as well as new products we intend to launch.\n<br><br>\nWe are looking for a Data Analyst — a hybrid data driver, analyst, communicator and trusted adviser to help us grow our business. The Data Analyst will be part of the Data Science &amp; Analytics team within our Product Marketing department. The Data team supports TelTechs data-driven philosophy by working closely with product, marketing, and engineering to understand user behavior, build machine learning products, and drive proactive decision making across our portfolio of products.\n<br><br>\nA big focus of the Data Analyst will be to take ownership of business intelligence tasks of the team by developing and automating reports, as well as analyze data to drive informed business decisions.\n<br><br>\nHere is what you will do to help us grow:\n<ul>\n<li>Design and automate reports/dashboards to communicate key business metrics such as LTV, churn, etc.</li> <li>Apply quantitative analysis and data mining across all areas of our business to drive product development, marketing efficiencies, and growth</li><li>Design experiments, and assist others on the growth team in designing experiments and interpreting results to draw detailed and actionable conclusions</li><li>Present findings to senior management and product owners to drive business decisions</li>\n</ul>\nHere is what we are looking for in a candidate:\n<ul>\n<li>0-2 years of experience in a data analytics or quantitative analysis role</li><li>A bachelors degree or significant real-world experience in Math, Economics, Statistics, Engineering, Computer Science, Business Analytics, or other quantitative fields</li><li>Proficiency with Microsoft Excel</li><li>Fluency in Python and SQL</li><li>Strong communication skills</li><li>Ability to work in a team and independently as needed</li><li>Basic knowledge of statistics</li>\n</ul>\nHere are some nice to have skills:\n<ul>\n<li>Experience with data visualization tools such as Tableau</li><li>Experience with Airflow or other scheduling tools</li><li>Basic understanding of programming in the context of backend servers</li>\n</ul>\nWe would love to find someone local to work in our phenomenal, open office space in South Amboy, New Jersey. Our team is 50+ strong and we pride ourselves on putting people and culture first. We offer competitive compensation, great benefits and more. If you are interested in this position, please make sure to include both a resume and cover letter with your response."}