{"job title": "Data Analyst", "company": "University of Virginia", "city state": "– Charlottesville, VA", "rating": "4.3", "job description": "This job posting is for a position at a University-Related Foundation. Such Foundations are established and operated exclusively to benefit the University or one or more of the University's units, generally by soliciting philanthropic support, managing and investing gifts and property, or promoting and sponsoring programs.\n<br><br>\nEach University-Related Foundation is a private and independent legal entity, separate from but approved by the University of Virginia Board of Visitors. Foundation employment is subject to the rules and guidelines established by the Foundation rather than by the University. Foundations comply with any applicable federal and state non-discrimination laws.\n<br><br>\nFor the full position description and to apply for the for this position at the College Foundation of the University of Virginia go to http://alumni.as.virginia.edu/college-foundation-employment-opportunities\n<br><br>\nThe College Foundation of the University of Virginia, which exists to support the College and Graduate School of Arts &amp; Sciences, is conducting a search for a Data Analyst.\n<br><br>\nThis position reports to the Associate Vice President of Development Services and works closely with the data team to provide data support to all areas of the office, accessing and providing reports that analyze and present data in a variety of forms and functions. Data analysis, data reporting, and data mining are primary functions of this position. This position conducts extensive analysis and research to increase the participation rate of overall giving to the College and Graduate School of Arts &amp; Sciences and to strategically identify donor/prospect segments for the College; compiles, analyzes, and verifies biographical and financial information; and creates intuitive ways to represent data to different groups of people.\n<br><br>\nThe incumbent will organize and present information in both customized and standardized reports and will also compile and distribute profiles and data points for use by development officers, campaign leadership, and executive leadership. In addition, this position may participate in prospect and portfolio management, as well as in the identification, analysis, and presentation of information about donors and prospects.\n<br><br>\nReview of applications will begin immediately and the position will remain open until filled. The College Foundation is an Equal Opportunity Employer. Women, minorities, veterans and persons with disabilities are encouraged to apply.\n<br><br>\nThe annual salary will be commensurate with experience. The College Foundation offers generous benefits, including full health insurance coverage for employees and a 403(b) retirement plan. In 2017, The Nonprofit Times recognized The College Foundation as one of the top 50 nonprofit employers in the country.\n<br><br>\nThe College Foundation of the University of Virginia is a 501(c)(3), University-Related Foundation whose mission is to raise and invest private funds for the benefit of the College and Graduate School of Arts &amp; Sciences. Governed by a 40-member volunteer Board of Trustees, and organizationally aligned with the Dean of Arts &amp; Sciences, it employs a team of approximately three dozen advancement professionals who focus on development, donor relations, and marketing, and their related support functions.<br><br>SDL2017"}