{"job title": "Data Analyst (SFLC-IBCT)", "company": "Vector CSP", "city state": "– Oakland, CA", "rating": "4.6", "job description": "Interviews are now being conducted to fill three (2) contingent opportunities. These non-supervisory positions are located in Oakland, CA. Work is performed in a typical office setting.\n<br><br>\n<strong>Job Summary:</strong> Provide support in maintenance and diagnostics text data collection and analysis for IBCT Product Line Assets\n<br><br>\n<strong>Citizenship:</strong> U.S.\n<br><br>\n<strong>Security Clearance:</strong>  None.\n<br><br>\n<strong>Education and Experience:</strong>\n<ul>\n<li>Bachelor's degree desired</li><li>3 years of experience analyzing data, collating, and reporting the results</li><li>Expereice working with IBCT assets including the 225 WLB, 175 WLM, 140 WTGB, 100 WLI, 65 WLI, 100 WLIC, 160 WLIC, 75 WLIC, 65 WLR, 75 WLR, and 65 WYTL cutters is preferred.</li>\n</ul>\n<strong>Essential Duties:</strong>\n<ul>\n<li>Create and analyze monthly and yearly historical reports and also be required to collect, review and analyze engineering reports produced by various depot maintenance activities. Both these activities will require the employee to create and maintain databases and develop action items based upon results.</li><li>Collect, input, edit, extract, consolidate, analyze, report, present and maintain historical information for the areas as assigned by the product line. Analysis includes ability to write 'macros' or other programs to scan large data files for identification of patterns or anomalies, forecasting trends based on data analysis of various mathematical and other means (linear trend, Weibul analysis etc).</li> <li>Collect, electronically transfer, file, organize and maintain a historical library of all data collected or submitted.</li> \n</ul>\n<strong>Knowledge, Skill and Abilities:</strong>\n<ul>\n<li>FLS, NESSS, FEDLOG, Web-FLIS SFLC Central, CG-LIMS experience desired</li><li>Possess a working knowledge of all standard office equipment (phones, computers, scanners, fax machines, etc.) as well as Microsoft Office applications.</li><li>Must be able to demonstrate knowledge of all preferred systems or satisfactorily demonstrate a working knowledge within 90 day after hire</li><li>Understanding of Coast Guard organization and vessels is desired.</li>\n</ul>\nVector CSP, LLC provides reasonable accommodation for disabled applicants to participate in the selection process. For assistance please contact our Human Resources Department by email, summer.vincent@vectorcsp.com. Please state your reasonable accommodation need in your message. Only reasonable accommodation requests related to applying for a specific position within VectorCSP, LLC will be reviewed at the phone number and email address supplied.\n<br><br>\nVector CSP, LLC is an equal opportunity employer and does not discriminate against any employee or applicant for employment because of race, color, religion, sex, sexual orientation, gender identity or national origin, veterans' status or any other reasons prohibited under Federal, State or local laws. <strong>EOE/M/F/Disability/Vet</strong><br><br>0\n<br><br>\n<strong>Job Posted by ApplicantPro</strong>\n<br>"}