{"job title": "Sales and Business Intelligence Analyst", "company": "Weatherford International Inc", "city state": "– Oklahoma City, OK", "rating": "5.0", "job description": "<strong>ORGANIZATION SUMMARY</strong>\n<br><br>\nWeatherford is one of the largest multinational oilfield service companies providing innovative solutions, technology and services to the oil and gas industry. The Company operates in over 90 countries and has a network of approximately 1,000 locations, including manufacturing, service, research and development, and training facilities and employs approximately 29,500 people. For more information, visit www.weatherford.com and connect with Weatherford on LinkedIn, Twitter, YouTube and Facebook.\n<br><br>\nWeatherford delivers innovative technologies and services designed to meet the world's current and future energy needs in a safe, ethical, and sustainable manner. Grounded by our core values and inspired by our world-class people, we are committed to being a trusted business partner to those we serve.\n<br><br>\n<strong>JOB DESCRIPTION</strong>\n<br><br>\nSupports the sales and marketing effort through the collection, analysis and reporting of sales and marketing data. Drives and supports the use of Salesforce; supports with the compilation and submission of tenders, compiles and circulates weekly and monthly reports. Assists in the development and implementation of business intelligence tools and solutions. Analyzes and reports on historical and future trends in performance, return and depreciation. Provides commercial and sales oversight, leadership and support to the sales team.\n<br><br>\n<strong>DUTIES&amp;RESPONSIBILITIES:</strong>\n<br><br>\nManage and synthesize external and internal sales data in order to develop and/or make decisions on business strategy. Prepare and report results of analysis and present as needed.\n<br><br>\nProvide information and analysis to management to be used in management decision making.\n<br><br>\nCreate and manage a knowledge management system for all customer and market information to be shared effectively across the business unit group and business development team.\n<br><br>\nPrepare briefing and presentation material for management to support their Product Line performance with management.\n<br><br>\nEnsure that market intelligence from external sources is being effectively archived and utilized and that it meets the unique needs of Management, and where appropriate Product Lines (PL's) and Regions.\n<br><br>\nProvide support in the identification, analysis, design, planning and implementation of business process improvement initiatives.\n<br><br>\nDeveloping Forecasting and Variance Explanations.\n<br><br>\nMust understand and comply with all safety rules and company policies of Weatherford.\n<br><br>\nKnow and understand Weatherford SRO Quality Policy and comply with all requirements of the Quality Systems Manual, Operating and Technical Procedures and Workplace Instructions.\n<br><br>\nPerform various other duties and activities as assigned by supervisor within the physical constraints of the job.\n<br><br>\n<strong>QUALIFICATIONS</strong>\n<br><br>\n5-10 years experience in a similar role\n<br><br>\nMust be able to coordinate, prioritize and meet multiple deadlines in demanding environment\n<br><br>\nDegree in Engineering/Accounting / Finance\n<br><br>\nSuperior analytical and problem solving skills\n<br><br>\nAbility to communicate information of a complex nature to various levels of management and external clients (written&amp;verbal) in an easy to understand business language\n<br><br>\nAdvanced knowledge of Microsoft Excel, Access and other MS office software\n<br><br>\nAbility to respond to an emergency situation.\n<br><br>\n<strong>Preferred:</strong>\n<br><br>\nAbility to understand the impact of moderately complex changes, formulate test/plans conditions to minimize risks and recommend appropriate business and system solutions\n<br><br>\nTechnical, project management and organizational skills\n<br><br>\nPossess strong data management technical understanding\n<br><br>\n<strong>POSITION SPECIFIC DETAILS</strong>\n<br><br>\nWeatherford offers competitive compensation and benefits upon hire; including paid vacation to start, matching 401K program, comprehensive benefits program, and employee stock purchase program (ESPP) and opportunities for on-going training and career development. VEVRAA Federal Contractor Priority Referral Requested\n<br><br>\nWeatherford is an Equal Opportunity Employer Females/ Minorities/ Veterans/Disabled and gives consideration for employment to qualified applicants without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status."}