{"job title": "Entry Level Geologist, Engineer or Environmental Scientist", "company": "Wood", "city state": "– Atlanta, GA", "rating": "3.2", "job description": "Wood Environment &amp; Infrastructure Solutions has an immediate need for a <strong>Geologist, Civil or Environmental Engineer</strong> or<strong> Environmental Scientist</strong> to join our team in Atlanta, GA. This position requires performance of a broad range of activities including performing Phase I due diligence investigations, Phase II and supplemental investigations to include environmental sample collection, field oversight of remediation projects, and basic operation and maintenance on remediation systems. Wood is dedicated to implementing all projects in a safe manner. Must have solid communication skills and the ability to accurately document field activities in a field log book. Must be able to budget time and resources. Successful applicant will interact with professional staff, geologists / engineers, as well as subcontractors and client staff.\n<br><br>\nThe <strong>Geologist / Engineer / Environmental Scientist</strong> will generally work Monday through Friday with occasional evenings and weekends. Some overnight travel may be required for up to two weeks at a time. This individual will generally work 50% of the time in the field primarily in Georgia.\n<br><br>\n<strong>Key Responsibilities</strong>\n<ul>\n<li><div>Will work under the supervision of a Senior / Associate Geologist, Environmental Engineer or Environmental Scientist</div></li><li><div>Field activities include logging soil borings; installing groundwater monitoring wells; collecting soil, and groundwater, surface water and sediment sampling</div></li><li><div>Field activities may also include oversight of remediation subcontractors during remediation activities including excavations, pilot studies and remediation system installation</div></li><li><div>Office activities include analysis and interpretation of hydrogeologic data, soil and water analytical results, and preparation of reports</div></li><li><div>Will prepare tables and figures using analytical data and topographic / site maps</div></li><li><div>Will perform statistical analysis of data and work with Excel spreadsheets</div></li><li><div>Research scientific literature and regulatory requirements, prepare permit applications and regulatory compliance reports (such as Discharge Monitoring Reports)</div></li><li><div>Follow company safety standards, prepare site-specific Health and Safety Plans and Job Hazard Analyses</div></li><li><div>Project coordination assisting Project Manager with project financial management, scheduling and communications</div></li><li><div>Our professionals work on many projects at one time and must have the ability to multi-task</div></li><li><div>Maintaining successful client relations is a must</div></li>\n</ul>\nRequired\n<ul>\n<li><div>BS in Geology, Engineering or Environmental Science</div></li><li><div>Must be a self-starter with excellent written and verbal communication skills</div></li><li><div>0 – 3+ years of field experience (soil borings, well installations, multi-media sampling)</div></li><li><div>Experience in permitting, compliance and application of environmental regulations to project work</div></li><li><div>Good data management and general organizational skills</div></li><li><div>Strong computer skills for database work and proficiency in MS Office</div></li><li><div>Flexible to work outside normal business hours as required</div></li><li><div>Must pass drug test, physical, background check and must have a satisfactory driving record in accordance with the Company's driving (MVR) policy</div></li>\n</ul>\nPreferred\n<ul>\n<li><div>Experience logging soil borings and setting monitoring wells</div></li><li><div>Experience conducting Phase I / II environmental site assessments in accordance with ASTM Standards</div></li><li><div>Basic understanding of telemetry systems</div></li><li><div>OSHA 40 hour HAZWOPER trained</div></li>\n</ul>\nPhysical Demands\n<ul>\n<li><div>Physically able to travel to work in the field in potentially difficult terrain and under a variety of weather conditions (cold, heat, wind, rain) as required to accomplish project execution</div></li><li><div>Able to occasionally lift over 40 pounds and able to wear respirator, if required, to mitigate dust or fumes</div></li>\n</ul>\nWood is a global leader in the delivery of project, engineering and technical services to energy and industrial markets. We operate in more than 60 countries, employing around 55,000 people, with revenues of around $10 billion. We provide performance driven solutions throughout the asset life cycle, from concept to decommissioning across a broad range of industrial markets including the upstream, midstream and downstream oil &amp; gas, power &amp; process, environment and infrastructure, clean energy, mining, nuclear and general industrial sectors. We strive to be the best technical services company to work with, work for and invest in.\n<br><br>\nwww.woodplc.com\n<br><br>\nWe are an equal opportunity employer that recognises the value of a diverse workforce. All suitably qualified applicants will receive consideration for employment on the basis of objective criteria and without regard to the following (which is a non-exhaustive list): race, colour, age, religion, gender, national origin, disability, sexual orientation, gender identity, protected veteran status, or other characteristics in accordance with the relevant governing laws.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}