{"job title": "Associate Scientist - Next Gen Sequencing", "company": "Amgen", "city state": "– Thousand Oaks, California", "rating": "3.7", "job description": "Job Description\n<br>\nThe Biologics department is seeking a highly motivated Associate Scientist to join the Biologics Optimization group at our state-of-the-art research facility at the Amgen headquarters in Thousand Oaks, CA.\n<br><br>\nThe Biologics Optimization group is responsible for the optimization, production, assessment, and selection of large therapeutic drug candidates, with many of the molecules of interest being complex biologics. The Associate Scientist will provide Next-Generation Sequencing support to a multidisciplinary team with capabilities in protein engineering, cloning, expression and purification of large molecule drug candidates.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nProvide Next-Generation Sequencing support to facilitate drug discovery and engineering efforts in Therapeutic Discovery. Key responsibilities include maintaining instruments (e.g. MiSeq and NextSeq500/550), setting up, performing and coordinating runs, and standard run QC.\n<br><br>\nDevelop and implement innovative technologies to improve efficiency and speed of the processes in the biologics optimization organization.\n<br><br>\nProvide scientific results that support the generation of publications, patents, or regulatory submissions, and participate in internal and external scientific meetings.\n<br><br>\nDesign high throughput work streams and carry out work using automated equipment.\n<br><br>\nAdditional responsibilities to include the support of yeast display technology efforts for the selection of protein therapeutics with improved biophysical properties.\n<br><br>\n<strong>Basic Qualifications:</strong>\n<br><br>\nMaster's degree and 2 years of Scientific Experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nBachelor's degree and 4 years of Scientific Experience\n<br><br>\n<strong>Preferred Qualifications:</strong>\n<br><br>\nThe successful candidate will have a strong track record of knowledge in molecular biology and Next-Generation Sequencing (NGS) technology\n<br><br>\nA strong record of hands-on experience in library construction of Amplicon-Seq or/and operation of Illumina NGS instruments like MiSeq and NextSeq500/550\n<br><br>\nExperience with standard NGS run QC is essential\n<br><br>\nAn understanding of read alignment for data analysis would be plus\n<br><br>\nAdditional experience in library design and use of display technologies for the optimization of therapeutic proteins\n<br><br>\nExperience in laboratory techniques supporting molecular biology, display systems, knowledge of bioinformatics\n<br><br>\nStrong communication and interpersonal skills, and the ability to work flexibly in a dynamic and collaborative environment\n<br><br>\nExperience with automated liquid handling platforms and high throughput methods\n<br><br>\nAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.\n<br><br>\nAmgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.\n<br>\n<strong> Join Us</strong> \n<br><br>\n<strong>If you're seeking a career where you can truly make a difference in the lives of others, a career where you can work at the absolute forefront of biotechnology with the top minds in the field, you'll find it at Amgen.</strong>\n<br><br>\n<strong>Amgen, a biotechnology pioneer, discovers, develops and delivers innovative human therapeutics. Our medicines have helped millions of patients in the fight against cancer, kidney disease, rheumatoid arthritis and other serious illnesses.</strong>\n<br><br>\n<strong>As an organization dedicated to improving the quality of life for people around the world, Amgen fosters an inclusive environment of diverse, ethical, committed and highly accomplished people who respect each other but compete intensely to win. Together, we live the Amgen values as we continue advancing science to serve patients.</strong>\n<br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n<br><br>\n<strong>.</strong>"}