{"job title": "Sr. Data Engineering- ML Manager", "company": "Capital One", "city state": "– Tysons Corner, Virginia", "rating": "3.8", "job description": "7900 Westpark Drive (12131), United States of America, Tysons, Virginia\n<br><br>\nAt Capital One, were building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Capital One is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding.\n<br><br>\nGuided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good.\n<br><br>\nSr. Data Engineering- ML Manager\n<br><br>\nAs a Sr. Manager of Data Engineering with a focus on Machine Learning at Capital One, youll be leading a group thats part of driving the next wave of innovations in using data to identify and fight financial crimes. You will be working on data at a whole new scale, engineering for cloud, and using the latest in distributed computing technologies across millions of customers and billions transactions.\n<br><br>\nWe do machine learning product development differently at Capital One. ML scientists aren't siloed in the lab, but instead partner closely with Software Engineers, Product Managers, and business stakeholders, to discover, invent, and build at the largest scale. Youll be leading the engineering aspects of these engagements, which will require a solid engineering background with a passion for machine learning. We apply cutting edge and novel approaches to build state of the art solutions and engineer them for cloud with the latest DevOps techniques.\n<br><br>\nWe are looking for a passionate technologist with a knack for delivery and good people management skills to lead some of our world-class engineering talent. The products we are building are putting Capital One on the leading edge of how financial institutions prevent criminals such as terrorists and drug dealers from laundering money.\n<br><br>\nThe Ideal Candidate will be:\n<br><br>\n-Technical. You are independent and can develop your own solutions but also have a passion for mentoring your team and ensuring good design. You have hands-on experience with data engineering and machine learning solutions, from concept to production, and the ability to select the right tool for the job at hand. You understand modern cloud computing. Large datasets and engineering challenges do not frighten you, they present a challenge you are eager to take on.\n<br><br>\n-Leader. You are an effective mentor and leader who is able to guide a team through a cohesive development and execution strategy towards a unified business outcome. You challenge conventional thinking and traditional ways of operating and you work with stakeholders to identify and improve the status quo.\n<br><br>\n-Innovative. You continually research and evaluate emerging technologies. You stay current on published state-of-the-art ML methods, technologies, and applications. You ask why, explore and openly share your disruptive ideas.\n<br><br>\n-Business-Minded. You can analyze customer needs and drive towards impactful business outcomes.\n<ul>\n<li>Develop batch data processing applications from the ground up using a modern technology stack such as Spark, Hbase, Gremlin and Elasticsearch</li><li>Transform complex analytical models into scalable, big data solutions and deploy on AWS</li><li>Work directly with Product Owners and end-users to constantly deliver data-driven products in a highly collaborative and agile environment</li> <li>Maintain a strategic vision for what, when and how your teams will create next generation data capabilities to make the Product Owners dreams a reality</li><li>Help grow and mentor team members on the fine art of data engineering and datastore evaluation</li><li>Be an evangelist at hackathons and other external events for the FinTech industry</li>\n</ul>\n<strong>Basic Qualifications:</strong>\n<ul>\n<li>Bachelors Degree or military experience</li> <li>At least 5 years of experience delivering big data solutions within an agile delivery environment</li><li>At least 5 years of experience directly managing a team of engineering resources</li><li>At least 3 years of experience in an object oriented or functional languages</li> <li>At least 3 years of experience with open source programming languages such as Spark, Scala or Python</li><li>At least 1 year experience working with AWS, Azure, or similar cloud platform</li><li>At least 1 year experience working in machine learning</li>\n</ul>\n<strong>Preferred Qualifications</strong>:\n<ul>\n<li>2+ years of experience implementing Graph database solutions</li><li>2+ years of experience working with Ontologies</li><li>2+ years of experience working with automated build and continuous integration systems such as Ansible, Chef or Puppet, and Jenkins</li>\n</ul>\nCapital One will consider sponsoring a new qualified applicant for employment authorization for this position."}