{"job title": "Lead Machine Learning Engineer", "company": "CyberCoders", "city state": "– New York City, NY", "rating": "3.8", "job description": "Lead Machine Learning Engineer <div>\nIf you are a Machine Learning Engineer with significant practical experience, you'll want to read this...\n<br><br>\nWe are a growing team that has been in business over 10 years, and among other accolades, received significant VC funding. Our mission is to develop a highly scalable and reliable cloud-computing architecture that powers and permits businesses to grow rapidly.\n<br><br>\nWe are looking to bring on a Senior ML Engineer to join our exciting and innovative team in Midtown, Manhattan.</div>\n\n<br>What You Need for this Position<div>\nM.S. or Ph.D and 3+ years of practical experience along with the following:\n\n\n<ul>\n<li>Production-Level Python and/or Java Coding</li>\n<li>Machine Learning Algorithms and Integrations</li>\n<li>Topic Modeling/Text Mining</li>\n<li>Artificial Intelligence</li>\n<li>Data Analysis and Reporting</li>\n<li>Natural Language Processing (TF-IDF, Word2Vec)</li>\n<li>SQL</li>\n<li>Strong Communication Skills (Written/Verbal)</li>\n<li>Cloud Implementations (AWS/Google Cloud)</li></ul></div>\n\n\nWhat's In It for You<div>\n\n\n<ul>\n<li>Competitive compensation (Base salary plus EQUITY)</li>\n<li>Growth opportunities</li>\n<li>Generous benefits package with the works</li>\n<li>Great office environment with excellent team members</li>\n<li>Work for a stable, rapidly growing company</li>\n<li>Make your mark on something very important</li></ul></div>\n\n\n<div>\nSo, if you are a Senior Machine Learning Engineer with relevant experience, please apply today!</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}