{"job title": "Physical Scientist, GS-1301-12 (MAP)", "company": "Department Of Commerce", "city state": "– Seattle, WA", "rating": "3.6", "job description": "<ul>\n<li>Videos</li>\n<li>Duties</li>\n</ul>\n\nHelpDuties Summary\n<br><br>\nThis position is located in the National Ocean Service (NOS), Office of Response and Restoration (ORR), Emergency Response Division (ERD) with one vacancy in Seattle, Washington.\n<br><br>\nThis position is also announced under vacancy number NOS-ORR-2018-0014, which is open to all US Citizens or Nationals. You must apply to both announcements if you want to be considered for both.\n<br><br>\nLearn more about this agency\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nAs a Physical Scientist, you will perform the following duties:\n\n\n<ul>\n<li>Serve as the Program Manager for the Emergency Response Division's (ERD) specific software development and tools; and utilize software development technologies, tools, and practices to sustain and enhance environmental and response data access tools.</li>\n<li>Utilizing principles of User Centered Design (UCD), work with ORR stakeholders to ensure focused tool development and that training needs are met. Responsible for graphical design of user interface and user experience.</li>\n<li>Lead the Chemical Response Team: actively engage in emergency response incidents and serve as a valuable conduit to provide chemical response personnel with specialized guidance and training on the ERD software tools.</li>\n</ul>\n\nTravel Required\n<br><br>\nOccasional travel - Up to 10% Domestic travel may be required.\n<br><br>\nSupervisory status\n<br><br>\nNo\n<br><br>\nPromotion Potential\n<br><br>\n14 - If you are selected for a position with further promotion potential, you may be non-competitively promoted if you perform successfully and if recommended by management.\n\n\n<ul>\n<li>Job family (Series)</li>\n</ul>\n\n1301 General Physical Science\n\n\n<ul>\n<li>Requirements</li>\n</ul>\n\nHelpRequirements Conditions of Employment\n\n\n<ul>\n<li>Must be a U.S. Citizen or National to apply.</li>\n<li>Required to pass a background investigation and fingerprint check.</li>\n<li>Must be suitable for Federal employment.</li>\n<li>Must be registered for Selective Service, if applicable (www.sss.gov).</li>\n<li>Time-in-grade/band must be met by closing date of announcement.</li>\n<li>If selected, required to complete OGE Form 450 financial disclosure.</li>\n</ul>\n\n<strong>Condition of Employments:</strong>\n\n\n<ul>\n<li>This position requires providing 24/7 hazard assessment support services to response personnel during a time of emergency.</li>\n<li>The incumbent will need to obtain a Contracting Officer's Representative (COR) Level 1 to maintain incumbency within 6 months.</li>\n</ul>\n\n<strong>NOTE:</strong>\n\n\n<ul>\n<li>A one year probationary period may be required.</li>\n<li>Payment of relocation expenses is not authorized.</li>\n<li>This position is in the bargaining unit</li>\n</ul>\n\nCollege Transcript: If you are qualifying based on education, submit a copy of your college transcript that lists college courses detailing each course by the number and department (i.e., bio 101, math 210, etc.), course title, number of credit hours and grade earned. You must submit evidence that any education completed in a foreign institution is equivalent to U.S. education standards with your resume. You may submit an unofficial copy of the transcript at the initial phase of the application process. If course content cannot be easily identified from the title of the course as listed on your transcript, you must submit an official course description from the college/university that reflects the content at the time the course was taken.\n<br><br>\nNote: Your college transcript is used to verify successful completion of degree, or college course work. An official college transcript will be required before you can report to duty.\n<br><br>\nApplicants must meet ALL application requirements, to include a complete online resume, by 11:59 p.m. EASTERN TIME (ET) on the closing date of this announcement.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nQualification requirements in the vacancy announcements are based on the U.S. Office of Personnel Management (OPM) Qualification Standards Handbook, which contains federal qualification standards. This handbook is available on the Office of Personnel Management's website located at: http://www.opm.gov/qualifications.\n<br><br>\n<strong>To qualify for the 1301 series:</strong>\n<br><br>\nBASIC REQUIREMENTS: This position requires applicants to meet a Basic Education Requirement. You MUST meet one of the following basic education requirements:\n<br><br>\nA. Professional Degree: physical science, engineering, or mathematics that included 24 semester hours in physical science and/or related engineering science such as mechanics, dynamics, properties of materials, and electronics.\n<br><br>\n<strong>OR</strong>\n<br><br>\nB. Combination of education and experience: education equivalent to one of the majors shown in A above that included at least 24 semester hours in physical science and/or related engineering science, plus appropriate experience or additional education.\n\n\n<ul>\n<li>AND -</li>\n</ul>\n\nApplicants must possess one year of specialized experience equivalent in difficulty and responsibility to the next lower grade level in the Federal Service. Specialized experience is experience that has equipped the applicant with the particular competencies/knowledge, skills and abilities to successfully perform the duties of the position. This experience need not have been in the federal government.\n<br><br>\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations e.g., professional; philanthropic, religious; spiritual; community, student, social). Volunteer work helps build critical competencies; knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n<br><br>\n<strong>To qualify at the GS-12 level:</strong>\n<br><br>\nSPECIALIZED EXPERIENCE: In addition to meeting the Basic Requirements above, applicant must also possess one full year (52 weeks) of specialized experience equivalent to the GS-11 in the Federal service. Specialized experience MUST include all of the following:\n\n\n<ul>\n<li>Serving as a software project manager in a physical sciences environment;</li>\n<li>Leading the development and design of software and supporting training modules, using the principals of user centered design; and</li>\n<li>Using software tools to assess hazardous chemical releases and provide technical software tool training.</li>\n</ul>\n\n<strong>Education</strong>\n<br><br>\nSubstitution of Education for Specialized Experience is not applicable to this vacancy."}