{"job title": "Analytics Developer (Big Data Cloud)", "company": "Envision", "city state": "– Saint Louis, MO", "rating": "3.4", "job description": "We are seeking for a Strong developer to become an expert of AWS services that we leverage. Help to efficiently integrate our big data infrastructure in the AWS cloud. Build services, deploy models, algorithms, perform model training and provide tools to make our infrastructure more accessible to all our data scientists. Enable specific initiatives to build our capabilities from environmental classification to In-Season Field Analytics and more.\n<br><br>\nRequired Education and Skills/Experience:\n<ul>\n <li>Master's Degree in Computer Science, Electrical Engineering or a closely-related field.</li> <li>Experience with Spring, Spring MVC, Hibernate, Spring boot framework, java restful web services</li> <li>Experience in web development frame works such as angular 2,4,5, D3 JS, React JS, HTML 5, CSS3, Boot Strap</li> <li>Experience with \\\"single page\\\" web Applications as well as a deep understanding of utilizing JSON Based services</li> <li>Experience with Relational Databases such as Oracle, MySQL, SQLServer and NoSQL</li> <li>Experience with AWS cloud services: EC2, EMR, RDS, Redshift,AWS Cli</li> <li>Experience working with distributed architectures including SOA based solutions and or AWS implementations.</li> <li>Experience working with Node / Scala / React / Redux / Angular / hBase / AWS / Cloud Foundry / Docker</li> <li>Experience in deploying applications by using cloud formation</li> <li>Experience authoring workflows (using technology like Apache Airflow)</li> <li>Experience in microservices. Jira, GIT and are highly desirable.</li> <li>Experience in Python or R.</li> <li>Candidates must be adaptable and have a drive to learn new technologies and frameworks to support R&amp;D interests</li>\n</ul>\n\nAssociated topics: algorithm, develop, developer, devops, java, perl, programming, sde, software developer, software engineer"}