{"job title": "CIB-Treasury Services- Data Product Analyst, Associate", "company": "JPMorgan Chase", "city state": "– New York, NY", "rating": "3.7", "job description": "<ul>\n<li>*Who we are**</li>\n</ul>\n\nWe are a new and\n<br>\nrapidly growing team of change agents inside J.P. Morgan. We are data\n<br>\nscientists and analysts, design strategists and business leaders creating and\n<br>\nbuilding data products that transform the way we and our clients do business -\n<br>\nbalancing the art of decision making with science.\n<br><br>\nWhat we build\n<br>\nmatters and will have huge impact; our products and solutions will reach\n<br>\nthousands of our clients around the world, and affect how J.P. Morgan does\n<br>\nbusiness, moving trillions of dollars a day. Our group will also work closely\n<br>\nwith FinTech teams to find emerging tech companies that can help us accelerate\n<br>\ndevelopment of new products.\n\n\n<ul>\n<li>*Why join?**</li>\n</ul>\n\nNew technologies,\n<br>\nanalytics and business models are emerging with the potential to radically\n<br>\ntransform financial services. You will be at the leading edge inside the\n<br>\n<strong>company driving change. You will:</strong>\n<br><br>\n+ Become an expertin how money moves through J.P. Morgan?s core payments infrastructure, tools,systems and data. Develop deep subject matterexpertise in the wide range domains in payments and liquidity to support adiverse set of products\n<br><br>\n+ Collaborate with product managers, data scientists,engineers, end users, developers, and other stakeholders to understand theirbusiness needs, formulate and complete end-to-end analysis that includes datagathering, analysis, ongoing scaled deliverables and presentations\n<br><br>\n+ Deliver practicalrecommendations and data insights in a compelling manner to multiple levels ofstakeholders. Articulate findingsclearly and concisely including presentations, discussions and visualizations.\n<br><br>\n+ Identifybusiness problems and opportunities to create unique sources of value that cankeep the strategy ahead of external trends and competitors. We clear 20% of US$ globally, how can we putthis data to good use?\n\n\n<ul>\n<li>*Who you are**</li>\n</ul>\n\nPassionate,\n<br>\ncreative, and analytical. You love data,\n<br>\ncurious to explore and unveil insights to create a business story and to impact\n<br>\n<strong>key business decisions. Specifically:</strong>\n\n\n<ul>\n<li>*Data expertise ?** A deep interest and aptitude in data, metrics,</li>\n</ul>\n\nanalysis and trends. Working knowledge\n<br>\nof statistical packages (e.g. R, SAS, Stata, MATLAB, etc.). Experience with articulating product\n<br>\nquestions, pulling data from datasets and using statistics to arrive at an\n<br>\nanswer.\n\n\n<ul>\n<li>*Hybrid at your core** - You</li>\n</ul>\n\nwill bring a strong analytical and business skillset. Capable of translating\n<br>\nanalysis results into business recommendations.\n<br>\nThis is an incredible opportunity for hybrid thinkers that love to learn\n<br>\nand synthesize in a high-performing inter-disciplinary / cross functional field.\n\n\n<ul>\n<li>*Cognitive and Communications Skill** - Highly articulate, built upon an underlying</li>\n</ul>\n\nfundamental clarity of thought. Proactive approach to problem solving, taking\n<br>\nownership of issues and having the determination to follow things through. General ability to root out fundamental\n<br>\nissues, bring order from chaos, synthesize elegant insights, and drive to clear\n<br>\ndecisions.\n\n\n<ul>\n<li>*Mindset**</li>\n<li>Primary focus of building something of significance. Self-confidence and</li>\n</ul>\n\npersonal presence that inspires confidence in others. Intellect, flexibility,\n<br>\nand integrity that motivates others to trust and collaborate.\n\n\n<ul>\n<li>*Experience** ? 3+ years work experience, BA/BS or Master?s</li>\n</ul>\n\nwith emphasis on coursework of a quantitative nature (e.g. statistics, computer\n<br>\nscience, math, data science, management consulting background preferred.\n<br><br>\n<strong>J.P.</strong>\n<br>\nMorgan?s Corporate &amp; Investment Bank is a global leader across banking,\n<br>\nmarkets and investor services. The world?s most important corporations,\n<br>\ngovernments and institutions entrust us with their business in more than 100\n<br>\ncountries. The Corporate &amp; Investment Bank provides strategic advice,\n<br>\nraises capital, manages risk and extends liquidity in markets around the world.\n<br><br>\nAbout J.P. Morgan Treasury Services\n<br><br>\nJ.P. Morgan Treasury Services (TS) is one of the world's largest providers of\n<br>\ntreasury management services. J.P. Morgan's TS business is a full-service\n<br>\nprovider of innovative cash management, trade, liquidity, commercial card, and\n<br>\nescrow services - specifically developed to meet the challenges treasury\n<br>\nprofessionals face today. More than 135,000 corporations, financial\n<br>\ninstitutions, governments and municipalities in over 180 countries and\n<br>\nterritories entrust their business to J.P. Morgan.\n<br><br>\nJPMorgan Chase is an equal opportunity and affirmative action employer Disability/Veteran."}