{"job title": "Lead Api Eng-Demand Sensing, Enterprise Data", "company": "Nike", "city state": "– Beaverton, Oregon", "rating": "3.9", "job description": "<strong>Job Description</strong>\n<br><br>\nDescription\n<br><br>\nNike is looking for a seasoned software engineer who can lead the development of distributed systems, innovative and highly scalable microservices APIs to productionalize scalable machine learning and advanced analytics solutions to customers across our business. You will enable solutions for a variety of complex business problems such as forecasting, personalization, and inventory optimization. You will productionalize and scale solutions in the cloud as APIs using cloud native technologies, Python SDKs, and NoSQL databases. This will enable Nike to quantitatively plan product demand, allocate resources, and target the right customers with the best products. You will foster partnerships with best of breed open source communities, commercial vendors, and universities. Above all, your work will accelerate Nike's core mission of serving Athletes*.\n<br><br>\n<strong>SCOPE &amp; RESPONSIBILITIES</strong>\n\n\n<ul>\n<li>Evangelize and cultivate adoption of APIs, open source software and agile principles within the organization</li>\n<li>Ensure solutions are designed and developed using a scalable, highly resilient cloud native architecture</li>\n<li>Deliver well-documented and well-tested code, and participate in peer code reviews</li>\n<li>Develop tools and frameworks to improve security, reliability, maintainability, availability and performance for the technology foundation of our platform</li>\n<li>Ensure product and technical features are delivered to spec and on-time</li>\n<li>Collaborate with and consult other Nike development teams</li>\n<li>Explain designs and constraints to stakeholders and technical teams</li>\n<li>Assist in the support and operation of the platforms you help build</li>\n<li>Work with product management to support product / service scoping activities</li>\n<li>Work with leadership to define delivery schedules of key features through an agile framework</li>\n<li>Be a key contributor to overall architecture, framework and design of enterprise platforms</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Experience developing applications to run in a large-scale environment.</li>\n<li>Strong knowledge and hands-on experience with Python.</li>\n<li>Experience designing REST APIs and developing RESTful Web Services</li>\n<li>Experience with developing automated unit tests and managing and executing unit tests using tools.</li>\n<li>Experience developing Object Oriented, multi-tier applications in a complex architectural landscape.</li>\n<li>Experience developing in a continuous integration environment using Jenkins.</li>\n<li>Experience working in an Agile development environment.</li>\n<li>Experience developing web applications.</li>\n</ul>\n\n<strong>Preferred if you have:</strong>\n\n\n<ul>\n<li>Experience working with machine learning engineers and data scientists.</li>\n<li>Experience using and scaling NoSQL databases such as Cassandra, DynamoDB, Mongo or Couchbase.</li>\n<li>Experience designing and developing on horizontally and highly scalable cloud-based architecture. AWS cloud infrastructure experience strongly preferred.</li>\n<li>Experience developing in a TDD environment or a strong desire to learn.</li>\n<li>Experience in a Blue/Green deployment model.</li>\n<li>Experience in a Continuous Delivery (CD) environment.</li>\n<li>Experience designing and implementing performance tests.</li>\n<li>Experience designing instrumentation into code and using and integrating with software &amp; logging analysis tools such as New Relic &amp; Splunk.</li>\n<li>Experience with Linux (CentOS, Ubuntu, etc).</li>\n</ul>"}