{"job title": "Principal Software Engineer - Oracle Data Cloud", "company": "Oracle", "city state": "– Reston, VA", "rating": "3.4", "job description": "<ul>\n<li>*Principal Software Engineer - Oracle Data Cloud**</li>\n<li>*Preferred Qualifications**</li>\n<li>*SENIOR JAVA ENGINEER - Data Cloud**</li>\n</ul>\n\n_\"The Addthis/ODC engineering is solving data challenges at huge scale (data sets in the billions!!) that is very unique in the industry, and certainly the DC area. It's a fast-paced start-up culture with the stability &amp; backing of a top software company._ \" Yuesong Wang - Director Development - Oracle Data Cloud(ODC)\n<br><br>\nhttps://github.com/addthis/hydra\n<br><br>\nODC engineers are responsible for building robust distributed systems and infrastructure that process massive amounts of data, execute machine learning algorithms at scale, and make the insights derived from these processes available to millions of website publishers and billions of users in near real-time. As the **Senior Java Engineer** on the Platform team, your job will be to build and maintain the systems and algorithms that make this possible. Our software stack includes many best-of-breed open source technologies, such as Cassandra and Kafka, as well as home grown tools, some of which have been open sourced, such as Hydra (checkout our Github page). In addition to building the distributed systems that enable data processing at scale you will work with our data scientists to implement machine learning algorithms that are able to efficiently operate in a distributed environment. Data is at the heart of what we do at AddThis and your work will be a critical factor in our success.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Build and maintain high-performance distributed systems</li>\n<li>Design and implement highly scalable API's and services that receive billions of requests per day</li>\n<li>Be fanatical about performance and performance monitoring</li>\n<li>Use efficient data structures and algorithms to enable data processing at scale</li>\n<li>Code primarily in Java but also able to use the right language for the right job</li>\n</ul>\n\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>Extensive experience with distributed computing, performance analysis, network protocols, data storage subsystems, and Linux</li>\n<li>Strong computer science fundamentals including a deep understanding of data structures and distributed algorithms</li>\n<li>Able to create elegant, efficient, and testable code</li>\n<li>Expert Java programmer with a deep understanding of the JVM, the Java memory model, and asynchronous I/O.</li>\n<li>BS, MS, or PhD in Computer Science or related field</li>\n</ul>\n\n<strong>Desired:</strong>\n\n\n<ul>\n<li>Experience processing very large data sets</li>\n<li>Experience working with advertising systems</li>\n<li>Ability to understand and implement machine learning algorithms</li>\n<li>Experience with Cassandra, Kafka, Hadoop, Spark, Riak, or similar technologies</li>\n<li>Experience working with Docker, Mesos, SDC or similar technologies</li>\n<li>Familiar with common POSIX and Linux specific system calls</li>\n<li>Understanding of Linux Kernel development</li>\n<li>Experience developing high performance software that operates on SSDs</li>\n<li>*Detailed Description and Job Requirements**</li>\n</ul>\n\nDesign, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.\n<br><br>\nAs a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associated with the developing, designing and debugging of software applications or operating systems.\n<br><br>\nWork is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience.\n\n\n<ul>\n<li>*Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.**</li>\n<li>*Job:** Product Development</li>\n<li>*Location:** US-VA,Virginia-Reston</li>\n<li>*Job Type:** Regular Employee Hire</li>\n<li>*Organization:** Oracle</li>\n</ul>"}