{"job title": "Field Application Scientist", "company": "Repligen Corporation", "city state": "– Waltham, MA", "rating": "2.7", "job description": "Repligen is abioprocessing-focused life sciences company bringing over 30 years of expertiseand innovation to our customers. We are inspiring advances in bioprocessingthrough the development and commercialization of high-value products andflexible solutions that address critical steps in the production of biologicdrugs.\n<br><br>\nWe are seeking a US-based Field Application Scientist to technicallysupport the downstream product lines in thebioprocess industry. This individual will use their knowledge ofprocess development, filtration and manufacturing to support customers and oursales team in pre and post sales opportunities.\n<br><br>\nThe successful candidate will also work closely with Repligencolleagues including sales account managers, product management, quality assurance,and R&amp;D scientists/engineers to ensure our products continue to serve theevolving needs of our customers in the bioprocessing industry.\n<br><br>\nThis is a field-based position requiring domestic and someinternational travel. The position willbe based in the US; California or Massachusetts location is preferred.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Work in coordination with the Repligen sales team and product management to provide pre and post-sales support to customers for the TangenX® TFF and Spectrum KrosFlo® hollow fiber product lines. This will include responding to customer requests for technical support, giving technical seminars, performing product demonstrations, providing on-site/in-lab support, troubleshooting and assisting with the execution of voice of customer surveys</li>\n<li>Develop and execute project plans to meet customer needs using Repligen technologies</li>\n<li>Draft detailed technical reports from customer interaction</li>\n<li>Provide knowledge and customer feedback to product management and R&amp;D for the continuous improvement of products</li>\n<li>Contribute to applications data and collateral generation</li>\n</ul>\n\n<strong>Qualifications:</strong>\n<br><br>\nA Bachelor's degree or higher in a scientific (biology/biochemistry) or engineering (chemical) field\n\n\n<ul>\n<li>5+ years' experience working in a downstream purification discipline in a development or manufacturing setting in the bioprocessing industry. Relevant experience in the development of harvest clarification and UF/DF unit operations. Working knowledge of scale-up/scale-down, tech transfer and cGMP requirements.</li>\n<li>Excellent interpersonal skills, strong verbal/written communications skills and attention to detail are required</li>\n<li>Strong problem solving and analytical skills</li>\n<li>Ability to prioritize and work independently to achieve defined goals</li>\n<li>Ability to work well within a global, cross functional team</li>\n<li>Must be willing and able to work flexible hours to accommodate client schedules</li>\n<li>Up to 50% domestic travel and occasionally internationally</li>\n</ul>"}