{"job title": "Medical Lab Scientist MLS", "company": "Saint Agnes Hospital", "city state": "– Wichita, Kansas", "rating": "4.2", "job description": "<strong> Department:</strong>  General Lab Amb 001\n<br><br>\n<strong> Additional Job Details:</strong>  Part-Time, Day, 20 hours Weekly\n<br><br>\n<strong> About Us</strong>\n<br><br>\nVia Christi Health's rich history of serving the people of Kansas and the surrounding region dates back more than 100 years to the healing ministries of our founding congregations. Today, Via Christi Health, part of Ascension, is the largest provider of healthcare services in Kansas. Based in Wichita, we serve Kansas and northeast Oklahoma through our doctors, hospitals, senior villages and health services.\n<br><br>\n<strong> Job Description</strong>\n<br><br>\n<strong> Job Summary:</strong>\n<br><br>\nPerforms routine diagnostic/analytic testing of laboratory specimens, and interprets, documents and reports test results in compliance with department procedures and applicable regulations.\n<br><br>\n<strong> Responsibilities:</strong>\n<li> Implements, validates, and reports laboratory test results.</li> <li> Performs instrument maintenance and troubleshooting.</li> <li> Conducts quality control and quality assurance testings.</li> <li> Maintains supplies needed for performance of tests.</li> <li> Assists with data collection or special projects as assigned.</li> <li> Assists in documentation and submission of all required laboratory, departmental and staff statistics/reports.</li>\n<strong>\n<br>\n<strong> Qualifications</strong></strong>\n<br><br>\n<strong> Licenses/Certifications/Registration:</strong>\n<li> <strong> Required Credential(s):</strong> One or more of the following:Certified Medical Lab Scientist (ASCP) credentialed from the American Society for Clinical Pathology Board of Certification (ASCP-BOC) obtained within 12 Months (1 year) of hire date or job transfer date. Certified Medical Tech credentialed from the American Medical Technologists (AMT) obtained within 12 Months (1 year) of hire date or job transfer date.</li>\n<strong> Education:</strong>\n<li> Diploma Associate's degree or Technical degree in a related field, or combination of High School degree and related experience required. Associate's degree or Technical degree in a related field, or specific certification related to position preferred.</li>\n<strong> Work Experience:</strong>\n<li> 2 Years Preferred Technical Experience.</li>"}