{"job title": "Senior Research Scientist", "company": "The New Jewish Home", "city state": "– New York, NY", "rating": "2.6", "job description": "The New Jewish Home has been a New York eldercare landmark for nearly 170 years, and we're still creating innovative new ways to serve seniors every day. Our mission is to empower older adults to enhance purpose and well-being through a portfolio of innovative health care services.\n<br><br>\nThe New Jewish Home's Research Department conducts clinically informed applied research on health services, palliative and person directed care; and develops/tests emerging care models (program evaluation). The ultimate goal is to translate, implement and sustain clinically informed research findings into evidence based practice. The Research Department is seekng a Senior Research Scientist to join their team!\n<br><br>\n<strong>JOB SUMMARY:</strong>\n<br><br>\nInitiates, designs, develops, conducts, publishes and otherwise disseminates results of scientific investigations. Develops a program of research, submits research proposals to external funding organizations and secures funding for research studies.\n<br><br>\n<strong>DUTIES AND RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>Identifies and formulates research questions relevant to TNJH Research Department's Mission and Vision.</li>\n<li>Develops research design and research instruments.</li>\n<li>Supervises research scientists, associates, coordinators, and assistants, as needed, in literature reviews, data collection, data entry, data cleaning, and data analyses.</li>\n<li>Conducts data analyses.</li>\n<li>Disseminates research findings through publications in scholarly and professional journals, presentations at professional conferences, and presentations for JHL staff.</li>\n<li>Develops a program of research and submits research proposals for external funding, and secures funding for specific research projects.</li>\n<li>Teaches, advises, and/or assists staff, geriatric fellows, and medical students with issues of research methodology, statistics and use of computer software.</li>\n</ul>\n\nSkills/Requirements\n<br><br>\n<strong>JOB QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>Doctoral degree in relevant scientific discipline</li>\n<li>Five or more years previous experience in externally sponsored research programs</li>\n</ul>\n\nReasonable accommodations may be made to enable individuals with disabilities to perform the essential job functions of the position without compromising patient/resident/client care.<br><br>SDL2017"}