{"job title": "Staff Scientist I", "company": "WuXi AppTec", "city state": "– Plainsboro, NJ", "rating": "2.6", "job description": "Overview\n<br><br>\nXenobiotic Laboratories (XBL), a subsidiary of the Lab Testing Division of WuXi AppTec, Inc., is a leading contract research laboratory specializing in small and large molecule Bioanalytical drug metabolism, and pharmacokinetic services to the pharmaceutical, animal health and agrochemical industries. Xenobiotic Laboratories is seeking a Staff Scientist I within our Bioanalytical Department (Large Molecule), located in Plainsboro, NJ.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nPrimary Responsibilities\n\n\n<ul>\n<li>Plans and carries out experiments and associated research assignments. May help in design set-up.</li>\n<li>Operates and/or oversees the operation of equipment to acquire experimental data.</li>\n<li>Designs, modifies, constructs, calibrates, and maintains equipment.</li>\n<li>Compiles, calculates, plots, and analyzes, and maintains data in accordance with accepted standards and practices.</li>\n<li>Assumes responsibility for technical accuracy of work.</li>\n<li>Thorough understanding of Good Laboratory Practices and EPA, FDA, or other regulations pertaining to the study. Writes and modifies SOPs.</li>\n<li>Promotes implementation and compliance with XBL safety policies, practices, and procedures in order to maintain a safe work environment and minimize or eliminate injury.</li>\n<li>Maintains and enhances technical expertise and knowledge of environmental, metabolism chemistry, and/or pharmaceutical areas.</li>\n<li>Identifies safety hazards and initiates corrective action. Assists in the safety training for subordinates and/or less experienced staff.</li>\n<li>Assists in training Associate Scientist, Assistant Scientist, and Laboratory Assistant.</li>\n<li>Laboratory Maintenance</li>\n<li>Other duties as assigned.</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\n<strong>Experience / Training / Education:</strong>\n\n\n<ul>\n<li>Bachelor or Master's degree in chemistry, biology, or a related discipline</li>\n<li>4-6 years of relevant experience with advanced responsibilities in research and development, or equivalent</li>\n<li>Any similar combination of education and experience</li>\n</ul>\n\n<strong>Knowledge / Skills / Abilities:</strong>\n\n\n<ul>\n<li>Knowledge of commonly used concepts, practices, and procedures within biological or chemical R&amp;D laboratory setting</li>\n<li>Well organized, detail oriented, and adaptable to changes</li>\n<li>Effective oral and written communication skills</li>\n<li>Effective interpersonal skills</li>\n<li>Proficiency in ELISA, PCR, electrophoresis, immunoblotting, cell culture, and other related biochemistry and cell biology techniques.</li>\n<li>Computer skills: knowledge of internet research, MS Word, Excel, Outlook, and PowerPoint</li>\n<li>Knowledge of Laboratory Information Management System (LIMS)</li>\n<li>Knowledge and hands on experience of Data Acquisitions and Operating Software such as SpectraMax Pro, MSD DiscoveryWorkbench software, GeneSnap, Gene Tools, etc. Ability to work under pressure of multiple projects and deadlines</li>\n<li>Ability to effectively prioritize workload and manage changes in direction</li>\n<li>Ability to work in a team environment</li>\n<li>Familiarity with and adherence to regulatory guidelines consistent with XBL requirements</li>\n</ul>\n\nWe are an Equal Opportunity Employer. Minorities/Women/Veterans/Disabled."}