{"job title": "Senior Staff Scientist I", "company": "WuXi AppTec", "city state": "– Plainsboro, NJ", "rating": "2.6", "job description": "Overview\n<br><br>\nXenobiotic Laboratories (XBL), a subsidiary of the Lab Testing Division of WuXi AppTec, Inc., is a leading contract research laboratory specializing in small and large molecule Bioanalytical drug metabolism, and pharmacokinetic services to the pharmaceutical, animal health and agrochemical industries. Xenobiotic Laboratories is seeking a Senior Staff Scientist I position within our Bioanalytical Department (Large Molecule), located in Plainsboro, NJ.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\n<strong>Primary Duties and Responsibilities:</strong>\n\n\n<ul>\n<li>Designs, plans, and caries out experiments and associated research assignments.</li>\n<li>May independently devise procedures or studies to search out causes and remedies for problems.</li>\n<li>Performs and/or oversees work to attain objectives.</li>\n<li>Utilizing the effective time management to complete assigned tasks on time with high accuracy</li>\n<li>Operates and/or oversees the operation of equipment to acquire experimental data.</li>\n<li>Compiles, calculates, plots, and analyzes, and with experience, interprets data; records and maintains data in accordance with accepted standards and practices.</li>\n<li>May act as principal investigator. Assumes complete responsibility for assigned projects, assumes a continuing responsibility for contributing ideas related to this area of investigation.</li>\n<li>Prepares reports, oral and written, covering work objectives, methods, and results, which may include recommendation for further experimentation.</li>\n<li>Thorough understanding of Good Laboratory Practices and EPA, FDA, or other regulations pertaining to the study.</li>\n<li>Promotes implementation and compliance with XBL safety policies, practices, and procedures in order to maintain a safe work environment and minimize or eliminate injury.</li>\n<li>Maintains and enhances technical expertise, knowledge in the Bioanalytical area which include up-to-date-technology in method development and sample analysis for parent drugs and its metabolites in various biological matrices.</li>\n<li>Prepare draft scientific presentation in-house and in scientific meetings</li>\n<li>Guides and counsels employees in order to contribute to the goals of XBL for both the long and short period and to encourage personal growth.</li>\n<li>Identifies safety hazards and initiates corrective action. Assists in the safety training for subordinates and/or less experienced staff.</li>\n<li>Supervises and participates in training of Staff Scientist, Associate Scientist, Assistant Scientist, and Laboratory Assistant.</li>\n<li>Other duties as assigned.</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\n<strong>Experience / Training / Education:</strong>\n\n\n<ul>\n<li>Bachelor's or M.S. degree in chemistry, biology, or equivalent</li>\n<li>At least 5-7 years of relevant experience in biological or bioanalytical research field or equivalent</li>\n<li>Any similar combination of education and experience</li>\n</ul>\n\n<strong>Knowledge / Skills / Abilities:</strong>\n\n\n<ul>\n<li>Knowledge of commonly used scientific concepts, practices, and procedures within pharmacology or animal science field</li>\n<li>Well organized, detail oriented, and adaptable to changes</li>\n<li>Effective oral and written communication skills</li>\n<li>Effective interpersonal skills</li>\n<li>Computer skills: knowledge of internet research, MS Word, Excel, Outlook, and PowerPoint</li>\n<li>Knowledge of Laboratory Information Management System (LIMS)</li>\n<li>Knowledge and hands on experience of Data Acquisitions and Operating Software such as SpectraMax Pro, MSD DiscoveryWorkbench software, GeneSnap, Gene Tools, etc.</li>\n<li>Ability to work under pressure of multiple projects and deadlines</li>\n<li>Ability to effectively prioritize workload and manage changes in direction</li>\n<li>Ability to work in a team environment</li>\n<li>Familiarity with and adherence to regulatory guidelines consistent with XBL requirements</li>\n</ul>\n\nEqual Opportunity Employer Minorities/Women/Veterans/Disabled"}