{"job title": "Sr Associate Scientist", "company": "AlphaProTemps", "city state": "– Thousand Oaks, CA", "rating": "NA", "job description": "Job Description<div><strong>Description:</strong>\n<br><br>\n<strong>Job Summary</strong> \n<br>\nWe are seeking a highly motivated and scientifically rigorous In Vivo Pharmacologist to join the Cardiometabolic Research group. The successful candidate will support pre-clinical development by evaluating therapeutic candidates in animal models of metabolic diseases.\n<br><br>\n<strong>Primary Responsibilities</strong> \n\n\n<ul>\n<li>Perform animal husbandry duties</li>\n<li>Perform administrations via IP, IM, SC and IV routes</li>\n<li>Perform blood collection via tail venipuncture and retro-orbital routes</li>\n<li>Blood sampling and analysis of plasma chemistries and circulating hormones</li>\n<li>Perform necropsy, tissue collection and processing</li>\n<li>Keep meticulous records of research activities and experimental details</li>\n<li>Prepare, review and deliver scientific presentations for internal/external use\n<br><br>\n<strong>Qualifications</strong> </li>\n<li>BS/MS in Biology, Physiology or related disciplines</li>\n</ul>\n\no 5 years of experience in executing preclinical in vivo studies using mouse models of obesity, diabetes and metabolic disease\n\n\n<ul>\n<li>Proficiency in Microsoft Word, Excel, PowerPoint and GraphPad Prism</li>\n<li>Experience in preparation of dosing large and small molecule therapeutics</li>\n<li>Excellent organizational skills and attention to detail</li>\n<li>Proven ability of multi-tasking to meet aggressive timelines</li>\n<li>Willing to take on additional responsibilities and demonstrated experience of high performance in matrix organization</li>\n<li>Excellent interpersonal and collaborative skills, and the ability to work independently and effectively in a dynamic environment</li>\n<li>Proven ability to operate autonomously and execute on deliverables</li>\n<li>Strong analytical and problem-solving skills\n<br><br>\n<strong>Top 3 Must Have Skill Sets:</strong></li>\n</ul>\n\nIn vivo pharmacology experience Rodent drug dosing and blood sampling Experience with diabetic or obese animal models\n<br><br>\n<strong>Day to Day Responsibilities</strong>:\n<br>\nAnimal handling and husbandry, dosing test articles and monitoring body weight changes, drug exposure and changes in pharmacodynamic markers. Preparing reports of results and data using graph pad and office software.</div>"}