{"job title": "Sr Data Architect", "company": "American technology", "city state": "– Hartford, CT", "rating": "3.8", "job description": "Client recognizes data and information as critical business assets, both in terms of managing risk and enabling new business opportunities. This data should not only be high quality, but also actionable – enabling Client’s executive leadership team to maximize benefits and facilitate sustained competitive advantage. Our Chief Data Office also known as our Enterprise Business Data Solutions team (EBDS) is focused on driving innovation through optimizing how we leverage data to drive strategy and create a new business model – disrupting the insurance market.\n<br><br>\nAs we develop an enterprise-wide data and digital strategy that moves us toward greater focus on the use of data and data-driven insights, we are seeking a Senior Data Architect.\n<br><br>\nThe Senior Data Architect is a hands-on, execution-focused role helping translate data architecture to execution. In this role you will have an understanding of our data at a granular level and, function as organizational subject matter expert for the various data architecture projects.\n<br><br>\nWhat will your essential responsibilities include?\n<ul>\n <li>Understand our existing data elements’ “bits and bytes” and architecture deeply</li> <li>Understand data user requirements and existing data environments, and translate these configurations into a data architecture that meets performance, scalability, and availability needs</li> <li>Extract best-practice knowledge, reference architectures, and patterns for sharing with the company wide solution architect community and team</li> <li>Collaborate with customers, data analysts, data scientists, infrastructure architects, data developers, data testers, and program management</li></ul> \n\n<ul>\n<li>Guide the full lifecycle of a Data Solution, including:\n\n<ul>\n <li>Translate business requirements to technical requirements and assist the business to define and declare non-functional requirements for building out data solution capabilities</li> <li>Design data solutions to meet business requirements in a manner that balances architectural standards, implementation risks, and operational risks, with restricted parameters such as budget and time</li> <li>Assist in the creation of cost estimates including implementation as well as total cost of ownership</li> <li>Ensure solution security designed to meet Information Security policies, Legal, Compliance, and Regulatory requirements, and industry best practice</li> <li>Assess vendor tools based on required capabilities, future capabilities, and architecture drivers, and document justification for tool selection</li> <li>Document infrastructure requirements for data solution and tools selected</li> <li>Document data flow and storage mechanisms and provide examples to data developers when necessary</li> <li>Work with quality assurance team on testing approach</li></ul> </li>\n</ul>\n\n\n<ul>\n<li>Present architecture decisions, explain the end to end data journey, educate others how they can contribute, and provide guidance on tool usage</li>\n</ul>\n<strong>Requirements</strong>\n<br><br>\nWe’re looking for someone with the following experience:\n<ul>\n <li>Design of data architecture solutions</li> <li>Hands-on experience with architecting, configuration management, and performance tuning of Hadoop ecosystem (e.g. HDFS, Hive, Spark, Kafka)</li> <li>Hands-on experience working in Azure cloud platform environment</li> <li>Hands-on experience with microservices</li> <li>Hands-on experience with relational databases and structured query languages</li> <li>Hands-on experience with NoSQL databases and query languages</li> <li>Hands-on experience with integration architecture and ETL technologies</li> <li>Hands-on experience with metadata management and data governance</li> <li>Hands-on experience with data science tools</li> <li>Hands-on experience writing Python or R code</li>\n</ul>\nWe’re looking for someone who has these abilities and skills:\n<ul>\n <li>Passion for data and experience working within a data-driven organization</li> <li>Excellent presentation, communication (oral &amp; written), and relationship building skills, across all levels of management</li> <li>Strong Organizational skills with attention to detail and ability to handle change</li> <li>Excellent problem solving and analysis skills</li> <li>Must be able to work well under pressure and consistently meet deadlines</li> <li>Ability to work as part of a team or to be self-directed as required</li> <li>Practiced at working as part of a global team (including outsourcing) spanning multiple time zones</li> <li>Understands cultural differences and is effective working in a diverse environment</li> <li>Passion for learning and prepared to go the “extra mile”</li> <li>You care about what you do, and what we do</li> <li>Bachelor’s degree in Computer Science, Mathematics, Statistics, Finance, related technical field, or equivalent work experience</li> <li>10+ years of Data-focused architecture, design and hands-on experience</li>\n</ul>"}