{"job title": "Process Development Scientist", "company": "Amgen", "city state": "– Thousand Oaks, California", "rating": "3.7", "job description": "Job Description\n<br>\nA biotechnology pioneer since 1980, Amgen has grown to be the world's largest independent biotechnology company, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential. Amgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics.\n<br><br>\nThe Process Development Scientist will be responsible for supporting trouble shooting method related issues across various analytical platforms, which may include PCR, Microbiology, Viral, and general compendial methods related to microbial control. In addition to hands-on involvement with method trouble shooting, the incumbent will be involved with the evaluation of new technologies related to rapid microbiological methods and providing technical expertise to the manufacturing sites in relation to the microbiological methods. This individual would be a part of a team that would support various methods in various stages of the product life cycle. This team would support programs/methods at locations throughout the company. The Scientist collaborates with representatives from key functions within Process Development, Manufacturing and Quality.\n<br><br>\n<strong>Basic Qualifications:</strong>\n<br><br>\nDoctorate degree\n<br><br>\n<strong>OR</strong>\n<br><br>\nMaster's degree and 4 years of Scientific experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nBachelor's degree and 6 years of Scientific experience\n<br><br>\n<strong>Preferred Qualifications:</strong>\n\n<ul>\n<li> Excellent written and oral communication skills for the timely documentation, presentation and discussion of scientific results in a fast-paced, multi-disciplinary, team-based environment.</li> <li> Advanced ability to critically analyze and interrogate various analytical data sets to drive and influence the investigational process</li> <li> Advanced root cause analysis capabilities including leading advanced and complex events</li> <li> Advanced ability to propose and lead new scientific imperatives/initiatives</li> <li>Expert in an investigational laboratory setting within a pharmaceutical or biotechnology company</li><li> Expert understanding and experience on analytical testing and sample handling</li> <li> Advanced understanding and hands-on experience in various analytical platform such as compendial microbial methods, rapid methods for microbial detection/identification and advanced technologies for detection of bacteria and viruses.</li> <li> Advanced experience in working closely with scientific and manufacturing disciplines across process development, clinical, and commercial operations</li> <li> Familiarity with cGMP regulations, FDA and EU regulations and guidelines</li> <li> Experience designing and running process development microbiology laboratory</li> <li> Global regulatory and pharmacopeia compliance experience related to microbiological methods</li> <li> Prior experience in Microbiological Quality at both the technical and management levels providing support for microbiological methods</li> \n</ul>\n\n<strong> Join Us</strong> \n<br><br>\n<strong>If you're seeking a career where you can truly make a difference in the lives of others, a career where you can work at the absolute forefront of biotechnology with the top minds in the field, you'll find it at Amgen.</strong>\n<br><br>\n<strong>Amgen, a biotechnology pioneer, discovers, develops and delivers innovative human therapeutics. Our medicines have helped millions of patients in the fight against cancer, kidney disease, rheumatoid arthritis and other serious illnesses.</strong>\n<br><br>\n<strong>As an organization dedicated to improving the quality of life for people around the world, Amgen fosters an inclusive environment of diverse, ethical, committed and highly accomplished people who respect each other but compete intensely to win. Together, we live the Amgen values as we continue advancing science to serve patients.</strong>\n<br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n<br><br>\n<strong>.</strong>"}