{"job title": "Senior Scientist - Basic Research", "company": "Coty Inc", "city state": "– Morris Plains, NJ", "rating": "2.6", "job description": "<ul>\n<li>*Equal Employment Opportunities**</li>\n</ul>\n\nWe offer equal employment opportunity to qualified individuals without regard to race, religion, color, national origin, age, gender,\n<br><br>\ndisability, sexual orientation, gender identity, gender expression, marital status, veteran status, or any other characteristic protected\n<br><br>\nby law. We strongly believe that cultivating a diverse workplace gives a company strength. The combination of unique skills, abilities,\n<br><br>\nexperiences and backgrounds creates an environment that produces extraordinary results. EOE Minorities/Females/Protected Veterans/Disabled.\n<br><br>\nEnglish - Please click on this link at https://app.box.com/s/hyf188z5pvagk35ll7w4 to review the Notification of Equal Opportunity Rights poster\n<br><br>\nEspa?ol - Por favor, haga un clic at https://app.box.com/s/hj0e3snqaobnqbu70455 en el enlace para revisar el poster de la Ley de los Derechos de Igualdad de Empeo\n\n\n<ul>\n<li>*PURPOSE**</li>\n</ul>\n\nOur purpose is to celebrate and liberate the diversity of beauty. We challenge convention through invention, expanding our horizons to enrich your reality with possibility. We build brands to inspire and enable our consumers to experience the confidence and joy of expressing their beauty, their way.\n\n\n<ul>\n<li>*MISSION AND RESPONSIBILITIES**</li>\n</ul>\n\nWe are actively looking for Sr. Scientist to join our growing Basic and Long-Term R&amp;D team to develop new and unique technologies that deliver superior consumer benefit. The Sr. Scientist will be a technical leader who understands color cosmetic technologies across multiple categories (eyes, lip, face, and nail) and how to develop prototype formulations that showcase the proof of concept. The Sr. Scientist will be able to work effectively both independently and as part of a larger R&amp;D team consisting of basic research scientists, development chemists, packaging engineers, supply chain, regulatory, safety, clinical and consumer scientists. Furthermore, the ability to perform patent searching and developing IP strategy and whitespace analysis will be highly desired.\n\n\n<ul>\n<li>*_Key Responsibilities_**</li>\n</ul>\n\n+ Independently perform research across multiple innovation technical platforms based on business and consumer needs\n<br><br>\n+ Manage multiple projects, design technical approaches, set milestones and drive projects to completion\n<br><br>\n+ Solve complex problems and technical challenges with entrepreneurial spirit\n<br><br>\n+ Characterize raw material and prototype formula properties using various analytical and physical testing instruments and techniques\n<br><br>\n+ Identify technologies from other industries that may be applied to cosmetic applications\n<br><br>\n+ Partner internally and externally to create or optimize breakthrough technologies and foster a collaborative working environment\n<br><br>\n+ Keep up to date with relevant scientific literature, patents, and competitive product launches\n<br><br>\n+ Present and communicate research in internal and external forums\n<br><br>\n+ Document project work and maintain a detailed laboratory notebook\n\n\n<ul>\n<li>*THE COTY IDEAL FIT**</li>\n</ul>\n\n+ M.S or Ph.D. degree(s) in an appropriate technical discipline: Chemistry (Organic, Physical, Polymer), Biology, Chemical Engineering, or similar discipline\n<br><br>\n+ 3+ years relevant experience\n<br><br>\n+ Strong fundamental scientific knowledge of cosmetic technologies including: organic and inorganic pigments, emulsion/suspension chemistry, anhydrous systems, polymer film formers, and rheology modifiers.\n<br><br>\n+ Understand the principles of design of experiments and data analysis and incorporate into experimental work plan\n<br><br>\n+ Knowledge of physical/chemical properties of raw materials and cosmetic formulations and proven ability to identify and transfer technologies from different industries to color cosmetics\n<br><br>\n+ Excellent communication, presentation, networking, and interpersonal skills\n<br><br>\n+ Innovative and creative thinker\n<br><br>\n+ Entrepreneurial and self-motivated\n<br><br>\n+ Excellent analytical and problem solving skills with an innate curiosity\n<br><br>\n+ Passion for beauty\n<br><br>\n+ Ability to collaborate across various Coty groups, divisions, and geographies\n\n\n<ul>\n<li>*Equal Employment Opportunities**</li>\n</ul>\n\nWe offer equal employment opportunity to qualified individuals without regard to race, religion, color, national origin, age, gender,\n<br><br>\ndisability, sexual orientation, gender identity, gender expression, marital status, veteran status, or any other characteristic protected\n<br><br>\nby law. We strongly believe that cultivating a diverse workplace gives a company strength. The combination of unique skills, abilities,\n<br><br>\nexperiences and backgrounds creates an environment that produces extraordinary results. EOE Minorities/Females/Protected Veterans/Disabled."}