{"job title": "Quality Assurance Scientist - Complaint Handling", "company": "Danaher Corporation", "city state": "– Miami, FL", "rating": "3.3", "job description": "<ul>\n<li>*Danaher Company Description**</li>\n</ul>\n\nAt Beckman Coulter, we are dedicated to advancing and optimizing the laboratory. For more than 80 years, we have been a trusted partner for laboratory professionals, helping to advance scientific research and patient care. We do challenging work on a global scale, and are invested in growing our associates? careers. We embrace continuous improvement, and are passionate about moving science and healthcare forward.\n<br><br>\nWe have a vital role at Beckman Coulter: our focus on innovation, reliability and efficiency has led us to become the partner of choice for clinical, research and industrial customers all over the world.\n<br><br>\nBeckman Coulter is a Danaher company, operating in two industries: Diagnostics and Life Sciences.\n<br><br>\nBeckman Coulter is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, national origin, religion, gender, age, marital status, disability, veteran status, sexual orientation, gender identity, or any other characteristic protected by law.\n<br><br>\nAll employment offers are contingent upon successful completion of our pre-employment drug screening and background/criminal check.\n<br><br>\nBe sure to follow Beckman Coulter on LinkedIn!\n\n\n<ul>\n<li>*Description**</li>\n<li>Receive and process complaints escalated from internal and external customers related to products manufactured and or distributed and serviced by the company in a manner consistent with all laws and regulations for medical devices.</li>\n<li>Generate and analyze customer feedback (CF) data to improve product reliability and performance for our customers.</li>\n<li>Possess understanding of risk management concepts and is capable of assessing product risks across unit of work.</li>\n<li>Independently and collaboratively evaluate information, reports, and data and provide recommendations for process improvements.</li>\n<li>*Qualification**</li>\n<li>Bachelor?s degree with 3 years in Science or Engineering discipline, or relevant years of Quality/Regulatory Affairs experience</li>\n<li>Able to make judgment calls using combination of knowledge of regulations, knowledge of technology, critical thinking, and interpretation of intent of the regulations.</li>\n<li>Ability to drive results, foster teamwork, handle pressure, and provide feedback</li>\n<li>Able to apply extensive technical expertise and has full knowledge of other related disciplines.</li>\n<li>Ability to perform detail-oriented work with a high degree of accuracy</li>\n<li>Proven ability to work cross-functionally in a team based environment</li>\n<li>Proficient in MS Office Suite of products</li>\n<li>Willingness to be flexible and adaptable to changing priorities</li>\n<li>Excellent oral and written technical communication skills</li>\n<li>Effective analytical and problem solving skills</li>\n<li>*Danaher Corporation Overview**</li>\n</ul>\n\nDanaher is a global science &amp; technology innovator committed to helping our customers solve complex challenges and improve quality of life worldwide. Our world class brands are leaders in some of the most demanding and attractive industries, including life sciences, medical diagnostics, dental, environmental and applied solutions. Our globally diverse team of 67,000 associates is united by a common culture and operating system, the Danaher Business System, which serves as our competitive advantage. We generated $18.3B in revenue last year. We are ranked #162 on the Fortune 500 and our stock has outperformed the S&amp;P 500 by more than 1,200% over 20 years.\n<br><br>\nAt Danaher, you can build a career in a way no other company can duplicate. Our brands allow us to offer dynamic careers across multiple industries. We?re innovative, fast-paced, results-oriented, and we win. We need talented people to keep winning. Here you?ll learn how DBS is used to shape strategy, focus execution, align our people, and create value for customers and shareholders. Come join our winning team.\n\n\n<ul>\n<li>*Organization:** Beckman Coulter - Diagnostics</li>\n<li>*Job Function:** Quality and Regulatory Affairs</li>\n<li>*Primary Location:** North America-North America-United States-FL-Miami</li>\n<li>*Schedule:** Full-time</li>\n<li>*Req ID:** BEC011895</li>\n</ul>"}