{"job title": "Principal Big Data Architect", "company": "Fidelity Investments", "city state": "– US-NC-Durham", "rating": "3.8", "job description": "At Fidelity, we love to use data and analytics to personalize\n<br>\nincredible customer experiences and develop solutions that help our customers\n<br>\nlive the lives they want. As part of our digital transformation, we have significant\n<br>\ninvestments to create innovative big data capabilities and platforms. We are\n<br>\nlooking for a hands-on data architect that help us design our next generation,\n<br>\ncloud enabled data capabilities.\n<br><br>\nThis position will be\n<br>\nbased in Raleigh-Durham, NC.<br>\n<div><strong>The Purpose of your role</strong></div> \n\n<ul>\n<li>Partner with cross functional teams\n<br>\n across the company to architect and design and develop our next generation\n<br>\n customer data platforms using traditional DB technologies, open source\n<br>\n frameworks and cloud services.</li> <li>Drive a\n<br>\n holistic information management strategy including capability roadmaps\n<br>\n across advanced analytic, big data and OLTP (MDM) platforms.</li><li>Analyze and\n<br>\n manage technology cost drivers to ensure efficient scale and support of OLTP/OLAP\n<br>\n capabilities including public cloud migration.</li><li>Continuously\n<br>\n drive innovation, evaluate and prototype emerging technologies within\n<br>\n developer community to understand business value and feasibility of\n<br>\n proposed solutions.</li> <li>Publish data\n<br>\n architecture principles, best practices and emerging architecture and design\n<br>\n patterns to assist development teams in implementing optimal solutions.</li><li>Govern\n<br>\n solution architecture and designs to ensure that the implementations are\n<br>\n aligned with the reference data architecture.</li>\n</ul>\n<strong>The Skills and Knowledge\n<br>\nYou Bring</strong>\n<ul>\n<li>Strong execution skills in a fast-paced\n<br>\n environment using agile methodologies.</li><li>Ability to collaborate and\n<br>\n partner with business domain leads, data scientists, product owners,\n<br>\n enterprise architects and other functional leads to deliver world class data\n<br>\n solutions.</li><li>Knowledge in architecture and\n<br>\n development of real-time, enterprise scale OLTP and MDM solutions.</li><li>Mastery of relational database,\n<br>\n NoSQL, ETL/ELT and data service (APIs) technologies.</li> <li>Strong foundation in Big Data\n<br>\n Ecosystem technologies with hands on experience implementing scalable data\n<br>\n ingestion, storage, processing and publication solutions.</li><li>Hands on experience with public and\n<br>\n private cloud capabilities including compute, storage, database and APIs.</li> <li>Expertise in designing end to end\n<br>\n data engineering solutions using a variety of data integration and processing\n<br>\n patterns.</li>\n</ul>\n<strong>The Expertise We Are\n<br>\nLooking For</strong>\n<ul>\n<li>Bachelor’s or Master’s Degree in\n<br>\n Engineering, Computer Science or technical field required.</li><li>Demonstrated technology and leadership\n<br>\n experience in architecting, designing and building highly scalable OLTP/OLAP\n<br>\n applications.</li><li>Enterprise scale expertise in master data\n<br>\n management (MDM), data analysis &amp; modeling including proven experience\n<br>\n with data management best practices such as data governance, data\n<br>\n security, data warehousing, metadata management and data quality.</li><li>Extensive knowledge and experience\n<br>\n in architecting modern data ingestion frameworks, integration pattern, highly\n<br>\n scalable distributed systems using open source and emerging data architecture\n<br>\n processing designs/patterns.</li> <li>Experience building external\n<br>\n cloud (e.g. AWS) data applications and capabilities. Expert ability to\n<br>\n evaluate, prototype and recommend open source and vendor technologies and\n<br>\n platforms.</li> <li>Extensive hands-on architecture and\n<br>\n development experience with deep knowledge of data movement, ETL/ELT,\n<br>\n RDBMS, NoSQL, HDFS, messaging, API (Microservices) and in-memory\n<br>\n technologies. Hands on experience with Oracle, Informatica, Cassandra,\n<br>\n Spring Batch, Kafka, NiFi, Flink and Spark technologies is desired.</li><li>Experience with DevOps,\n<br>\n Continuous Integration and Continuous Delivery (Maven, Jenkins, Stash,\n<br>\n Ansible, Docker).</li><li>This role requires 3 years of data\n<br>\n architecture, design and development delivery experience.</li>\n</ul>\n\n<div>Company Overview</div>\n<br>At Fidelity, we are focused on making\n<br>\nour financial expertise broadly accessible and effective in helping people live\n<br>\nthe lives they want. We are a privately held company that places a high degree\n<br>\nof value in creating and nurturing a work environment that attracts the best\n<br>\ntalent and reflects our commitment to our associates. For information about\n<br>\nworking at Fidelity, visit <strong>FidelityCareers.com</strong>\n<br><br>\nFidelity Investments is an equal\n<br>\nopportunity employer."}