{"job title": "Environmental Data Validation Chemist", "company": "ICF", "city state": "– Annapolis, MD", "rating": "3.6", "job description": "Working at ICF\n<br><br>\nWorking at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you?re seeking to make a difference in the world, visit www.icf.com/careers to find your next career. ICF?together for tomorrow.\n<br><br>\nLooking for an Environmental Chemist professional who will be responsible for independent evaluation of third party environmental laboratory sample analysis results for compliance with method and QA/QC requirements.\n<br><br>\nThe position is located at Fort Meade in Maryland.\n<br><br>\nYou'll need to have or be able to obtain authorization for access to Fort Meade and U.S. Environmental Protection Agency facilities.\n<br><br>\n<strong>Key Responsibilities:</strong>\n\n\n<ul>\n<li>Review laboratory reported data according to EPA?s National Functional Guidelines for Data Validation or other procedures, as appropriate</li>\n<li>Prepare written data validation reports using MS Word</li>\n<li>Revise Electronic Data Deliverables (EDDs) using MS Excel - Review the reports and Excel spreadsheets of others Basic Qualifications:</li>\n<li>Bachelor's degree in chemistry, or equivalent - 8+ years of relevant experience including at least 3 years of analytical laboratory experience</li>\n<li>Experience reviewing third party laboratory data</li>\n<li>US Citizenship or Permanent Resident status</li>\n</ul>\n\n<strong>Preferred Skills/Experience:</strong>\n\n\n<ul>\n<li>Laboratory experience in important environmental, analytical instrumentation such as GC, GC/MS, ICP/AES, or ICP/MS</li>\n<li>Experience in reviewing data from high resolution GS/MS techniques for dioxin/furans and/or PCB congener analysis</li>\n<li>Experience in non-routine analyses such as explosives or radionuclides</li>\n<li>Experience in validating data according to the EPA National Functional Guidelines</li>\n<li>Experience working at DoD, EPA or other Federal facilities</li>\n</ul>\n\n<strong>Professional Skills:</strong>\n\n\n<ul>\n<li>Excellent verbal and written communication skills</li>\n<li>Proficient in the use of Microsoft Office suite of software</li>\n<li>Team player with flexibility to meet a variety of fluctuating and varied client requirements</li>\n<li>Strong quantitative skills</li>\n<li>Attention to detail</li>\n<li>Ability to prioritize, multi-task, and work under strict deadlines</li>\n</ul>\n\nAbout ICF\n<br><br>\nICF (NASDAQ:ICFI) is a global consulting and technology services provider with more than 5,000 professionals focused on making big things possible for our clients. We are business analysts, policy specialists, technologists, researchers, digital strategists, social scientists and creatives.\n<br><br>\nSince 1969, government and commercial clients have worked with ICF to overcome their toughest challenges on issues that matter profoundly to their success.\n<br><br>\nICF offers an excellent benefits package, an award winning talent development program, and fosters a highly skilled, energized and empowered workforce. ICF is an equal opportunity employer that values diversity at all levels. (EEO/AA ? Minorities/Females/Veterans/Individuals with Disabilities)\n<br><br>\nMaryland Client Office (MD88)\n<br><br>\nAbout ICFICF (NASDAQ:ICFI) is a global consulting and technology services provider with more than 5,000 professionals focused on making big things possible for our clients. We are business analysts, policy specialists, technologists, researchers, digital strategists, social scientists and creatives. Since 1969, government and commercial clients have worked with ICF to overcome their toughest challenges on issues that matter profoundly to their success. Come engage with us at icf.com."}