{"job title": "Computational Research Scientist (Natural Language Processing)", "company": "Memorial Sloan-Kettering", "city state": "– New York", "rating": "4.0", "job description": "<div><div>\n<div>At Memorial Sloan Kettering (MSK), we’re not only changing the way we treat cancer, but also the way the world thinks about it. By working together and pushing forward with innovation and discovery, we’re driving excellence and improving outcomes.\n<br><br>\nFor the 27th year, MSK has been named a top hospital for cancer by U.S. News &amp; World Report. We are proud to be on Becker’s Healthcare list as one of the 150 Great Places to Work in Healthcare in 2016, as well as Glassdoor’s annual Employees’ Choice Awards 2017. We’re treating cancer, one patient at a time. <em><strong>Join us and make a difference every day.</strong></em></div>\n</div>\n</div>\n\n<br>Job Description<br>\n\n<div>\n<div>\n<div>Are you an <strong>experienced Computer Scientist, Physicist, Engineer, or Applied Mathematician?</strong>\n<br><br>\nCan you drive a group of quantitative scientists in Cancer Research?\n<br><br>\nAre you a strong computational person?\n<br><br>\nDo you want to learn about and deeply impact the future of cancer research, medicine, and health care?\n<br><br>\nThe <strong>Precision Pathology Biobanking Center (PPBC)</strong> is a newly established Research Center at MSK and its Department of Pathology.\n<br><br>\nUsing complex real-world structured, text, and image data, Memorial Sloan Kettering (MSK) has collected over the past 20+ years, the Scientist will develop and implement advanced computational methods to power the PPBC’s efforts to build a best-in-class analytics platform for healthcare data. The development and implementation of cutting-edge computational Big Data Analytics represents a major strategic priority for the Center. This recruitment seeks to expand this expertise within the Center.\n<br><br>\nThe <strong>right candidate</strong> will have a track record of developing new quantitative methods such as<strong> Machine Learning, Artificial Intelligence (AI), or Natural Language Processing (NLP)</strong> and apply them to complex problems in medicine. To that end, the Computational Scientist will actively chip in to the research community through collaborations with academic partners, publishing in peer-reviewed journals, and attending top-tier conferences.\n<br><br>\nThis position is a leadership position in computational science and will develop, oversee, and implement a comprehensive computational strategy for the Center in addition to leading a team of computational specialists.<br><br><strong>Responsibilities include but are not limited to:</strong>\n\n<ul>\n<li>Performs software development, programming, and support for the PPBC</li><li>Interest in Natural Language Processing, AI, Machine and Deep Learning</li><li>Develops, maintains, and expands functionality of existing and to be developed biobank database systems</li><li>Works closely with other IT groups throughout MSKCC on development and federation of database systems</li><li>Develops software systems using a mix of the following: C/C++, Python, Java, Perl/CGI, JavaScript, Ruby, and SQL</li><li>Installs necessary and relevant software. Knows the latest with new software versions, patches and security</li><li>Builds tools for real-time federation to other databases at MSKCC</li><li>Stays current with general bioinformatics tools and installs/runs tools as needed (genomics, proteomics, other bioinformatics tools)</li><li>Works to develop web-based visualizations of PPBC data</li><li>Collects use scenarios and functionality requirements for biobank specimen acquisition, database entry, specimen storage and annotation, and automated retrieval</li><li>Develops an attractive web presence for the PPBC and real-time data display (“dashboard”) of relevant biobank data</li><li>Collaborates with the clinical pathology team on interoperability and data flow between clinical LIMS (CoPath) and research databases</li><li>Works with Linux systems administrator to configure new and existing software packages for security, performance and maintainability</li><li>Performs database integrity checks and prepares the PPBC informatics pipeline for clinical certification (CAP, CLIA)</li><li>Sets up technical evaluation studies for the optimization of database schemas and SQL queries</li><li>Writes scripts to monitor database back-ups and archiving when appropriate</li>\n</ul>\n\n<strong>Qualifications:\n<br>\n</strong>\n\n<ul>\n<li>Bachelor’s Degree with 2-4 years in computer science or related field. Master’s or PhD with 0-2 years experience preferred</li><li>Background in biology, medicine, biochemistry, etc. very desirable</li><li>Proven background in programming, configuring, and implementing database systems required</li><li>Experience with bioinformatics algorithms and software tools very desirable; writing and modifying code</li><li>Prior experience with biobank database systems preferred (e.g., caTissue Suite, other open source software or commercial, such as Freezerworks)</li><li>Experience with web programming and data visualization on websites</li><li>Experience with health data exchange standards (HL7) preferred</li><li>Experience with building, configuring, running, and maintaining Linux servers preferred</li><li>High-performance computing experience preferred</li><li>Solid experience with programming, modifying, customizing, and querying database systems (Oracle, SAP)</li><li>Experience with data federation between different database systems</li><li>Experience with production systems and building data warehouse products and reporting systems desirable</li>\n</ul>\n<strong>This position requires cross-disciplinary and strong analytical skills as well as broad experience using computational methods, databases, software, and hardware.</strong>\n<br><br>\n<strong>#LI-POST</strong></div>\n</div>\n</div>\n\n<br>Closing<br>\n\n<div>\n<div>\n<div>MSK is an equal opportunity and affirmative action employer committed to diversity and inclusion in all aspects of recruiting and employment. All qualified individuals are encouraged to apply and will receive consideration without regard to race, color, gender, gender identity or expression, sexual orientation, national origin, age, religion, creed, disability, veteran status or any other factor which cannot lawfully be used as a basis for an employment decision.\n<br><br>\nFederal law requires employers to provide reasonable accommodation to qualified individuals with disabilities. Please tell us if you require a reasonable accommodation to apply for a job or to perform your job. Examples of reasonable accommodation include making a change to the application process or work procedures, providing documents in an alternate format, using a sign language interpreter, or using specialized equipment.</div></div>\n</div>\n<br>"}