{"job title": "CMC Data Management Specialist", "company": "Merck USA", "city state": "– West Point, PA", "rating": "3.7", "job description": "<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong><br>\n<div><strong>Requisition ID:</strong> REG003880<br><br>Merck &amp; Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck’s success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.\n<br><br>\nMerck is on a quest for cures and is committed to being the world’s premier, most research-intensive biopharmaceutical company. Today, we’re doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck’s leading discovery capabilities and world-class small molecule and biologics R&amp;D expertise to create breakthrough science that radically changes the way we approach serious diseases.\n<br><br>\nUnder the guidance of the Global Regulatory Affairs &amp; Clinical Safety (GRACS) CMC Product Lead(s) the CMC Data Management Specialist will provide support to CMC Product Team to enable compliant delivery of CMC submissions through planning, preparation, and execution through management of CMC Quality Data in the Health Registration Management and MMD Change Control systems. The CMC Data Management Specialist will manage the progression of CMC Change Requests, CMC Events and Regulatory Product Information from authorization, assessment, project definition, execution and implementation by administering the CMC HRM and Change Control data in partnership with CMC product teams.\n<br><br>\nThe incumbent is expected to be knowledgeable in project management principles, manufacturing change control management and Health Registration Management information. The individual will be required to gather, review, update and report routine data and CMC related information and maintain regulatory tools and databases on a routine schedule to ensure visibility to the status of regulatory activities.\n<br><br>\nPrimary Activities\n<ul>\n<li>Support CMC scientists in collection of information to support change assessments and update regulatory tools and databases, on a routine schedule to ensure timely delivery of assigned activities. The individual is expected to follow the guidance provided by the CMC Product Lead.</li> <li>Works with the CMC Product Team to update CMC deliverables related to Health Registration Management data associated with the preparation of Chemistry, Manufacturing, and Controls information for new product registrations or post-approval changes including annual reports, registration renewals, supplements, variations, tender bids and responses.</li> <li>Utilizes and maintains GRACS and/or MMD systems to support compliant operational execution of activities related to change control (GCM, HRM-ORION), as needed. Conduct all activities with an unwavering focus on regulatory conformance.</li> <li>Support CMC scientists in collection of Health Registration Management information to support change assessments. Liaise with MMD and internal stakeholders to support compliant execution of change management and CMC business processes.</li> <li>Actively manage assigned work including a clear understanding of Health Registration Management data, dependencies and critical path</li> <li>Assist in the development and continuous improvement of business processes, tools, systems, metrics and analytics under supervision of manager.</li> <li>Provide support for other CMC projects and activities, as required.</li>\n</ul>\n\n<br>\n<strong>Qualifications</strong><br><br>Education Minimum Requirement:\n<br><br>\nBachelor’s degree and a minimum of 10 years’ experience in the Pharmaceutical Industry or equivalent industry with focus on Quality or Data Management\n<br><br>\nRequired Experience and Skills:\n<br><br>\nKnowledge and experience related to CMC regulatory change control requirements, regulatory information and supporting business processes.\n<br><br>\nCapability to effectively manage and deliver against multiple and potentially competing priorities.\n<br><br>\nDemonstrated flexibility in responding to changing priorities and adapting to unexpected events by identifying innovative ways to achieve high quality, compliant deliverables.\n<br><br>\nKnowledge and understanding of Lean Six Sigma methodologies and Project Management skills; ability to work effectively in matrix organizational structures, develop appropriate solutions and follow through on implementation.\n<br><br>\nStrong written and verbal communication and time management skills\n<br><br>\nStrong developed cross-functional teamwork, collaboration, influencing and negotiating skills\n<br><br>\nComputer skills: knowledge and proficient in PowerPoint, Excel and Word\n<br><br>\nKnowledge and experience with Trackwise\n<br><br>\nPreferred Experience and Skills:\n<br><br>\nExposure to regulatory affairs either through direct experience, or via a role in R&amp;D or manufacturing\n<br><br>\nYour role at Merck is integral to helping the world meet new breakthroughs that affect generations to come, and we’re counting on your skills and inventiveness to help make meaningful contributions to global medical advancement. At Merck, we’re inventing for life.\n<br><br>\nIf you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request to staffingaadar@merck.com.\n<br><br>\n<strong>Search Firm Representatives Please Read Carefully:</strong>\n<br><br>\nMerck &amp; Co., Inc. is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any employee at Merck via email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Merck. No fee will be paid in the event the candidate is hired by Merck as a result of the referral or through other means.\n<br><br>\nVisa sponsorship is not available for this position.\n<br><br>\nFor more information about personal rights under Equal Employment Opportunity, visit:\n<br><br>\nEEOC Poster\n<br><br>\nEEOC GINA Supplement<br><br><strong>Job:</strong> Regulatory Affairs Generic\n<br>\n<strong>Other Locations:</strong> Rahway, NJ, US\n<br>\n<strong>Employee Status:</strong> Regular\n<br>\n<strong>Travel:</strong> Yes, 5 % of the Time\n<br>\n<strong>Number of Openings:</strong> 1\n<br>\n<strong>Shift (if applicable):</strong> 1st\n<br>\n<strong>Hazardous Materials:</strong> No\n<br>\n<strong>Company Trade Name:</strong> Merck</div>"}