{"job title": "Clinical Laboratory Scientist", "company": "Personalis", "city state": "– Menlo Park, CA", "rating": "3.9", "job description": "<div><div> Personalis is a genome-scale diagnostics company with a mission to pioneer genome guided medicine. Our priority is to obtain the most accurate genetic data from each sample, and then to draw the most reliable medically-focused conclusions from these. Our tests are based on whole human genome and exome sequencing, conducted in our state-of-the art laboratory. We analyze results utilizing proprietary databases, advanced human reference sequences, and sophisticated algorithms.\n<br><br>\nPersonalis Genome Services provides academic, pharmaceutical, and biotech researchers an accurate and comprehensive end-to-end human genome sequencing and analysis solution. Our services support researchers engaging in large case-control and family-based genome studies of complex or Mendelian diseases and traits, pharmacogenomics, and cancer. Located in Menlo Park, CA, we are seeking a talented and highly motivated Clinical Laboratory Scientist to join our Team.\n<br><br>\nSummary\n<br><br>\nThe Experienced Clinical Laboratory Scientist is responsible for testing and reporting clinical laboratory results.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Performs and reports laboratory testing on clinical laboratory samples used to aide physicians in the diagnosis and treatment of patients</li>\n\n<li>Selects, implements, and evaluates results for Quality Control materials used in statistical process control of laboratory assays</li>\n\n<li>Troubleshoots assays and equipment for which QC materials fail to perform adequately</li>\n\n<li>Participates in activities required to support all necessary licensure for the clinical laboratory, including quality management functions and on-site inspections of the laboratory</li>\n\n<li>Responsible for maintaining updated understanding and knowledge of the methods employed in the laboratory and the use of the resulting information by physicians through continuing education activities</li>\n\n<li>Trains other CLS personnel and other staff in laboratory methods. May be required to monitor the activities of non-licensed personnel</li>\n\n<li>May be required to supervise the activities of the laboratory in the absence of an on site manager</li>\n\n<li>May be required to assist in assay development activities. The testing personnel are responsible for specimen processing, test performance and for reporting test results</li>\n\n<li>Each individual performs only those high complexity tests that are authorized by the laboratory director and require a degree of skill commensurate with the individual's education, training or experience, and technical abilities</li>\n\n<li>Each individual performing high complexity testing must —</li>\n\n<li>Follow the laboratory's procedures for specimen handling and processing, test analyses, reporting and maintaining records of patient test results</li>\n\n<li>Maintain records that demonstrate that proficiency testing samples are tested in the same manner as patient specimens</li>\n\n<li>Adhere to the laboratory's quality control policies, document all quality control activities, instrument and procedural calibrations and maintenance performed</li>\n\n<li>Follow the laboratory's established policies and procedures whenever test systems are not within the laboratory's established acceptable levels of performance</li>\n\n<li>Be capable of identifying problems that may adversely affect test performance or reporting of test results and either must correct the problems or immediately notify the general supervisor, technical supervisor, clinical consultant, or director</li>\n\n<li>Document all corrective actions taken when test systems deviate from the laboratory's established performance specifications</li> \n\n<li>Experience working with a microtome, preparing slides for H&amp;E staining is a plus.</li>\n</ul>\n\nEducation / Experience\n\n\n<ul>\n<li>California Clinical Laboratory Scientist license in categories appropriate for the area of testing performed</li>\n\n<li>Minimum of 1 year of experience in a clinical laboratory setting; preferably with experience in a high complexity molecular testing environment\n<br>\n\n<br>\nPersonalis is an equal opportunity employer. Personalis offers a competitive compensation package.</li>\n</ul>\n\n</div> </div><div></div>"}