{"job title": "Senior Research Scientist - Machine Learning for Healthcare", "company": "Philips", "city state": "– Cambridge, MA", "rating": "3.4", "job description": "<ul>\n<li>*Your challenge**</li>\n</ul>\n\nDrive our expanding efforts in healthcare research for real time diagnostic and therapeutic decision support applications. Our interests are in big healthcare data analytics, predictive modeling, precision medicine, and outcome management. Collaborative relationships are maintained with universities, scientific institutions, academic organizations and governmental resources.\n\n\n<ul>\n<li>*Your responsibilities**</li>\n</ul>\n\nWe are seeking an exceptional, self-motivated, seasoned individual with excellent track record to participate in the growth of our Acute Care Solutions group. Our interests are in predictive modeling, simulation, and outcome management.\n<br><br>\n<strong>As the Research Scientist you will:</strong>\n<br><br>\n+ Conduct research, design, develop and evaluate first-of-kind data analytics solutions to provide real time diagnostics and therapeutic decision support applications.\n<br><br>\n+ Interact with clinical customers to understand their problems, share insights and best practices, and validate prototypes of solutions to assess their value in patient care.\n<br><br>\n+ Partner with Philips business groups to deliver innovations in a timely and high-quality manner. **Your team:** Philips Research is at the forefront of healthcare research. Existing now for 100 years, Philips Research has been one of the world's premier research labs and now has more than 1000 research scientists and engineers around the world. Our agenda includes discovering fundamental principles and developing scientific and engineering innovations to enhance health and well-being. Philips is a pioneer and leader in the healthcare industry. **Our offer:** At Philips, we are driven by our mission to improve the lives of 3 billion people per year by 2025, and every day we move closer to achieving our goal by creating cutting-edge solutions that lead to confident diagnosis, improved interventions, and increased quality of life for patients. We enable our employees to create a legacy in life through their work and support their development through people-centric learning, total rewards and personalized development planning programs. Our research and business provides unique opportunities to develop cutting edge clinical solutions and deliver meaningful solutions in the healthcare space. **We are looking for** The candidate is expected to have a Ph.D. in computer sciences, bioinformatics, biomedical engineering, electrical engineering, or a related field. The candidate is expected to have &gt; 5 years research experience working on novel applications for use in hospital and home patient care settings.The candidate will demonstrate excellent experience with:\n<br><br>\n+ Data modeling, analytics and visualization\n<br><br>\n+ Machine learning and deep learning\n<br><br>\n+ Python data science pipeline (pandas, sklearn, numpy, scipy, TensorFlow, PyTorch)\n<br><br>\n+ Algorithm design, implementation\n<br><br>\n+ Physiological signal processing\n<br><br>\n+ Knowledge of human physiology\n<br><br>\n+ Knowledge of healthcare industry\n<br><br>\n+ Trends in patient care at hospital and home\n<br><br>\n+ Publishing scientific papers and presenting at scientific conferences\n<br><br>\n+ Excellent oral and written communication skillsSkills and experience in some of the following areas would be a plus:\n<br><br>\n+ Bioinformatics\n<br><br>\n+ High performance computing using Spark, cloud infrastructure, or related technology\n<br><br>\n+ Assessment of drug effectiveness and adverse drug events\n<br><br>\n+ Government grant applications\n<br><br>\n+ Database technologies\n<br><br>\n+ Ability to work with cross-functional teams\n\n\n<ul>\n<li>*In this role, you have the opportunity to:**</li>\n</ul>\n\nDrive our expanding efforts in healthcare research for real time diagnostic and therapeutic decision support applications. Our interests are in big healthcare data analytics, predictive modeling, precision medicine, and outcome management. We want to know if you are you ready to champion this effort as an important member of the Research team?\n\n\n<ul>\n<li>US work authorization is a precondition of employment for this position. The company cannot consider candidates who require sponsorship for a work-authorized visa</li>\n<li>*You are responsible for:**</li>\n</ul>\n\n+ Developing new technologies in the areas of predictive modeling, simulation, and outcome management.\n<br><br>\n+ Conducting research, designing, developing and evaluating first-of-kind data analytics solutions to provide real time diagnostics and therapeutic decision support applications.\n<br><br>\n+ Interacting with clinical customers to understand their problems, share insights and best practices, and validate prototypes of solutions to assess their value in patient care.\n<br><br>\n+ Collaborating with Philips business groups to deliver innovations in a timely and high-quality manner.\n\n\n<ul>\n<li>*You are a part of:**</li>\n</ul>\n\nPhilips Research is at the forefront of healthcare research. Existing now for 100 years, Philips Research has been one of the world's premier research labs and now has more than 1000 research scientists and engineers around the world. Our agenda includes discovering fundamental principles and developing scientific and engineering innovations to enhance health and well-being. Philips is a pioneer and leader in the healthcare industry.\n\n\n<ul>\n<li>*To succeed, you should have the following skills and experience:**</li>\n</ul>\n\n+ Ph.D. in computer sciences, bioinformatics, biomedical engineering, electrical engineering, or a related field.\n<br><br>\n<strong>+</strong>\n<br>\n+ Data modeling, analytics and visualization\n<br><br>\n+ Machine learning and deep learning\n<br><br>\n+ Python data science pipeline (pandas, sklearn, numpy, scipy, TensorFlow, PyTorch)\n<br><br>\n+ Algorithm design, implementation\n<br><br>\n+ Physiological signal processing\n<br><br>\n+ Knowledge of human physiology\n<br><br>\n+ Knowledge of healthcare industry\n<br><br>\n+ Trends in patient care at hospital and home\n<br><br>\n+ Publishing scientific papers and presenting at scientific conferences\n<br><br>\n+ Excellent oral and written communication skills\n<br><br>\nSkills and experience in some of the following areas would be a plus:\n<br><br>\n+ Bioinformatics\n<br><br>\n+ High performance computing using Spark, cloud infrastructure, or related technology\n<br><br>\n+ Assessment of drug effectiveness and adverse drug events\n<br><br>\n+ Government grant applications\n<br><br>\n+ Database technologies\n<br><br>\n+ Ability to work with cross-functional teams\n\n\n<ul>\n<li>*In return, we offer you:**</li>\n</ul>\n\nWe are happy to provide an opportunity to work with one of the strongest research labs in the world and deliver solutions will have a direct impact on patient care. You will be part of flexible team of highly skilled professionals that are able to find an excellent work-life balance. Just think the solutions you develop will give a better balance to the healthcare professionals and patients they are treating.\n\n\n<ul>\n<li>*Why should you join Philips?**</li>\n</ul>\n\nAre you passionate about having a career that will improve healthcare? Do you want your efforts to be more than a job? At Philips, it is a calling to build a healthier society through relevant work, passionate about improving 3 billion lives a year by delivering creative solutions across the health continuum. Our people experience a variety of unexpected moments when their lives and careers come together in substantial ways.\n\n\n<ul>\n<li>*Why should you join Philips?**</li>\n</ul>\n\nWorking at Philips is more than a job. It?s a calling to create a healthier society through meaningful work, focused on improving 3 billion lives a year by delivering innovative solutions across the health continuum at http://www.philips.com/b-dam/corporate/corporateblog/2016/Philips_Chronic_Disease_5.jpg . Our people experience a variety of unexpected moments when their lives and careers come together in meaningful ways.\n<br><br>\nTo find out more about what it?s like working for Philips at a personal level, visit the Working at Philips page at http://www.philips.com/a-w/careers/healthtech/working-at-philips/working-at-philips.html on our career website, where you can read stories from our employee blog at http://www.usa.philips.com/a-w/our-people/life-at-philips.html . Once there, you can also learn about our recruitment process at http://www.philips.com/a-w/careers/healthtech.html , or find answers to some of the frequently asked questions at http://www.philips.com/a-w/careers/healthtech/faq.html .\n<br><br>\nPhilips is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex (including pregnancy), sexual orientation, gender identity, national origin, genetic information, creed, citizenship, disability, protected veteran or marital status.\n<br><br>\nAs an equal opportunity employer, Philips is committed to a diverse workforce. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants that require accommodation in the job application process may contact 888-367-7223, option 5, for assistance.\n<br><br>\n<strong>\\#LI-PH1</strong>"}