{"job title": "Senior Application Data Engineer", "company": "Porch", "city state": "– Seattle", "rating": "3.9", "job description": "<div><div>\nBack to all current positions</div> <div> Senior Application Data Engineer</div> <div> Location: <strong>Seattle</strong></div> <div> Department: <strong>Engineering</strong></div> <div><div> Description</div> <div>Can you own the data layer, guiding the underlying data architecture to support a fast growing application stack? Do you enjoy working closely with software engineers to develop and refine software systems? Can discriminate use cases between transactionally consistent, ACID-compliant systems of record vs. eventually consistent options vs non-traditional data stores?\n<br><br>\nThis role will be part of our data engineering group that works closely with our feature product teams facilitating the underlying data model and architecture as our product evolves. Knowledge and experience within systems and software architecture is required.\n<br><br>\nPorch’s tech stack has evolved around Microservices Architecture and underlying micro-databases. We integrate the application of DDL and DML into our software CI systems via Flyway so that our services have true ownership of our data. We have our domain / canonical model represented behind their own APIs as part of a master data management solution. PostgreSQL is our relational database of choice.<br><br>Responsibilities:<br><br>The Architecture Stuff:\n\n<ul>\n\n<li>Data Architecture - You will need to ensure we have the correct level of normalization to support that application features. Maintain the integrity of the underlying data, ensure we have a transactionally consistent view of the data when necessary and support eventually consistent data representations when appropriate.</li>\n\n\n\n<li>Domain Modeling - Is A a part of B or a part of C or is A actually D? Sometimes microservices get scope creep, it is generally most apparent and least reversible at the data layer. Be comfortable asking questions and giving frank answers.</li>\n\n\n\n<li>OLTP vs. OLAP - Is the request a functional requirement of the application or a reporting need? Keep analytical requirements out of transactional systems and evangelize the usage of the data warehouse. Be the bridge between the Engineering, Product, and Development (EPD) teams and the Analysts, Data Scientists, and Data Warehouse.</li>\n\n\n\n</ul>\nThe Engineering Stuff: You will work with several software engineering teams to ensure the application is supported by a high quality data layer. This means you need to own:\n\n<ul>\n\n<li>Data Migrations - Underlying data model changes? New features? Migration plans may be needed to support the evolution of the systems while maximizing availability.</li>\n\n\n\n<li>Technologies - Not everything has to be in a relational database. Be open to leveraging key-value stores, document databases, and other technologies to provide the right tool for the job.</li>\n\n\n\n<li>Process Improvement - Is there a better way? Periodically question what, how and why you are doing a task. Don’t be a drone.</li>\n\n\n\n<li>Collaboration - Vertically: fulfill the needs of the application layer and front end. Horizontally: communicate and coordinate with data engineering team to establish conventions, utilize best practices and share lessons learned.</li>\n\n\n\n<li>Scaling - Identify appropriate applications of partitioning and sharding.</li>\n\n\n\n</ul>\n\nExperience:<br><br>At least five years as a software, systems, or data engineer during which you:\n\n<ul>\n\n<li>Have been the go to for query optimization and performance troubleshooting.</li>\n\n\n\n<li>Have had 3+ years owning DDL and data model implementations in production environments.</li>\n\n\n\n<li>Are comfortable being part of the on-call rotation. Everyone is on the on-call rotation.</li>\n\n\n\n<li>Have done all of these things in a cloud environment—AWS, GCP, or other public cloud.</li>\n\n\n\n</ul>\n\nAbout Porch:<br><br>Porch sprang to life to tackle an age old, recurring problem: moving in, maintaining, and managing one’s home is hard. Porch is becoming the partner for the home, helping homeowners to get any home project done, both by providing Porch Services to get all small jobs done ourselves and a large professional network to provide homeowners with multiple quotes for larger projects. Home services is a $400 billion market and Porch is positioned to build a large and rapidly growing company with an opportunity to change home ownership. Porch’s mission is to ensure every home project gets done, with every customer satisfied. We aim to build a lasting brand that delivers quality, data-driven, delightful results.\n<br><br>\nPorch was founded by successful entrepreneurs and is led by an experienced team of techies who build beautiful products, are operationally-minded, data-driven, have relentless customer focus, and put team before self. Based in Seattle, Porch is backed by Valor Equity Partners, Lowe’s Home Improvement, and many others.</div> </div><div></div><br>\n<strong></strong><div><strong>\n</strong><div><strong> \n<div>Previous Applicants:</div>\n<br>\n</strong>\n<br>\n<strong><div>Email:</div>\n<br>\n</strong>\n<br>\n<div><strong>Password:</strong></div><div>\nIf you do not remember your password click here.</div>\n</div> </div></div>"}