{"job title": "Data &amp; Analytics Innovation POC Lead", "company": "SunTrust Robinson Humphrey", "city state": "– Atlanta Area, GA US", "rating": "3.8", "job description": "<div>\n<div><strong>Posting Date :</strong></div><div>9-5-2018</div></div><br>\n\n <div>\n<div><strong>Primary Location :</strong></div><div>Atlanta Area, GA US</div></div><br>\n\n <div>\n<div><strong>Work Address :</strong></div><div>303 Peachtree Street</div></div><br>\n\n <div>\n<div><strong>Job ID :</strong></div><div>W457478</div></div><br>\n\n <div>\n<div><strong>Schedule :</strong></div><div>Full-time</div></div><br>\n\n <div>\n<div><strong> :</strong></div><div>Data-Analytics-Innovation-POC-Lead</div></div><br>\n\n <div>\n<div><strong>Job Description :</strong></div><div><strong>Job Description</strong><br><br>Do you have a passion for testing out new techniques? Do you love developing proof-of-concepts with new analytical tools? If so, this is the right role for you. As Data &amp; Analytics Innovation POC lead you will work with a team of modelers and data scientists to identify innovative techniques and tools to accelerate insights delivery &amp; value for our key strategic analytics use cases. You will stay abreast of industry trends &amp; cutting edge use cases that will drive value for SunTrust. You will help build new capabilities (such as text analytics &amp; machine learning) and partner with the enterprise data &amp; analytics team to identify high value use cases to leverage those new capabilities. You will develop and manage a team of data scientists. You will help drive cross-functional collaboration across our data &amp; analytics team, technology partners &amp; business leaders. You will help identify areas for application of proven innovation POCs across the enterprise. You will help build a culture of innovative thinking &amp; collaboration by sharing the Innovation team’s successes and failed POCs.<br><br><strong>Qualifications</strong>\n<br>\n<div><strong>Basic Qualifications:</strong>\n<ul>\n <li>Bachelor’s degree and 8 years of related experience or an equivalent combination of education and experience.</li>  <li>In-depth and broad knowledge within own professional discipline.</li>  <li>Ability to interpret internal and external business challenges and implement best practices to improve products, processes, or services.</li> <li>Ability to lead projects of significant complexity and risk exposure.</li>  <li>Ability to exercise judgment in solving technical, operational, and organizational challenges.</li>  <li>Ability to manage a team, including identifying and recruiting talent, managing performance, and making decisions about resource allocation.</li> <li>Ability to influence others to adopt a new perspective and handle interpersonal issues with tact and diplomacy.</li>\n</ul>\n<strong>Preferred Qualifications:</strong>\n<ul>\n <li><strong>Experience</strong></li>\n\n<ul>\n <li>Bachelor’s degree and 10 years of experience</li> <li>4 - 7 years relevant experience in a Lead Analyst/Manager function</li> <li>Graduate degree in Statistics, Engineering, Mathematics, Decision Sciences, Marketing Research or similar field or Bachelor’s degree with extensive relevant experience</li> <li>Client-facing presentation experience required</li> <li>Experience training and developing others required</li> <li>Experience in an R&amp;D or Lab with proven measurement a plus</li>  <li>Previous experience in banking industry</li>\n</ul>\n\n<li><strong>Skills</strong></li>\n\n<ul>\n <li>Thorough understanding of data science and data manipulation techniques</li> <li>Desire to test &amp; learn, experience working in an Agile environment/team</li> <li>Experience with automating complex processes</li> <li>Strong ability to interpret analytical results and transform into an executive ready deliverable</li> <li>Equally comfortable presenting to a non-technical marketer or a statistician</li> <li>Ability to juggle multiple projects &amp; clients at a time</li> <li>Experience managing technical projects with specialized team members</li> <li>Proficient in Python, R, SQL, SAS</li> <li>Advanced Excel and PowerPoint skills required</li> <li>Experience with Qlik and data visualization an advantage</li>\n</ul>\n\n<li><strong>Communication and Cognitive Abilities</strong></li>\n\n<ul>\n <li>Proactive problem-solving capabilities</li> <li>Heavy attention to detail</li> <li>Strong communication and presentation skills</li> <li>Outstanding interpersonal skills</li> <li>Energetic, can-do attitude</li> <li>Patient and adaptable</li> <li>Entrepreneurial and team-oriented spirit</li> <li>Willingness to patiently mentor team members</li></ul> \n</ul>\n\n</div>\n\n<br>Equal Opportunity Employer: SunTrust supports a diverse workforce and is a Drug Testing and Equal Opportunity Employer. SunTrust does not discriminate against individuals on the basis of race, creed, color, gender, religion, national origin, age, disability, veteran status, pregnancy, marital status, citizenship status, sexual orientation, gender identity, genetic information, or any other classification protected by applicable laws.\n<br><br>\nTo review the EEO Poster, copy and paste the following link into your browser: http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf http://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf</div></div>\n<br>"}