{"job title": "Senior Optical Coating Scientist", "company": "THORLABS INC", "city state": "– Jessup, Maryland", "rating": "3.1", "job description": "Thorlabs is seeking an experienced optical coating scientist / engineer for development of MID IR coatings. Job activities include new process/product development, new equipment introduction, process improvement, equipment improvement, process maintenance, equipment maintenance, lean manufacturing projects, and maintaining fab documentation. This position requires deep knowledge of optical coating processes, process engineering core skills, equipment trouble-shooting skills, and a track record of using data-driven problem solving techniques. Preference will be given to experienced candidates with significant MID IR coating experience.\n<br><br>\n<strong>Essential Job Functions</strong> <strong>include the following, but are not limited to:</strong>\n\n<ul>\n\n\t<li>Provides state of the art coating designs in the Mid-IR in both transmission and reflection modes.</li>\n\n<li>Ability to utilize all formats of material deposition: E-beam ,IAD, Magnetron Sputtering.</li>\n\n<li>Ability to design coating tooling for precision optics, laser facets, and fiber.</li>\n\n<li>Introduce new product, process, equipment and material technologies into optical coating fab in timely manner, using effective design input, evaluation testing, and project management.</li>\n\n<li>Utilize continuous improvement tools, project management skills, team leadership, and basic engineering skills to 1) reduce manufacturing costs, 2) improve/sustain tight control of wafer fab manufacturing process.</li>\n\n<li>Provide product line support in creating/maintaining all development and production routes used by the optical coating fab and investigating product failures both within and outside of the coating fab. Provide training to operations related to the routes.</li>\n\n<li>Provide engineering equipment ownership via creating/maintaining equipment operation procedures, training personnel, setting up quality indicator procedures, developing effective PMs, and supporting maintenance/ops team during equipment down events.</li>\n\n<li>Support operations team in writing required documentation and leading various coating fab improvement projects (e.g. Lean Manufacturing, 5S).</li>\n\n<li>Support engineering team in maintaining and improving our Manufacturing Execution System (MES) and related components. Set up MES reports for operations team that support daily production.</li>\n</ul>\n<strong><em><u>Qualifications</u></em></strong>\n<br><br>\n<strong>Experience:</strong>\n\n<ul>\n\n\t<li>Minimum of 10 years? experience with optical coating processes including E-beam, IAD, Magnetron Sputtering processes.</li>\n\n<li>Minimum of 5 years? experience with MID IR Coatings.</li>\n\n<li>Experience in test/characterization of optical coatings (e.g. FTIR, Ellipsometer, Photo-spectrometer, Film Stress Analyzer, and SEM).</li>\n\n<li>Experience with CAD tools (e.g. SolidWorks).</li>\n\n<li>Experience with Six Sigma process improvement methods.</li>\n\n<li>Experience with troubleshooting and resolving optical coating equipment issues, especially repair and maintenance of high vacuum systems.</li>\n</ul>\n<strong>Education:</strong>\n\n<ul>\n\n\t<li>A minimum of PhD in Engineering or Physics</li>\n</ul>\n<strong>Specialized Knowledge and Skills:</strong>\n\n<ul>\n\n\t<li>Proficient in coating software (preferred TF Calc).</li>\n\n<li>Design of Experiments (DOE).</li>\n\n<li>Statistical Process Control (SPC).</li>\n\n<li>Knowledge of the following software/programming languages: SQL, Visual Basic, C++, Matlab, JMP, R, Microsoft Sharepoint, and Microsoft Office.</li>\n\n<li>Semiconductor device physics, especially optoelectronic devices.</li>\n\n<li>Knowledge of ISO 9001 Quality Management Systems.</li>\n</ul>\n<em>Thorlabs values its diverse environment and is proud to be an Equal Employment Opportunity/Affirmative Action employer. All qualified individuals will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age or veteran status. Job descriptions are not intended as and do not create employment contracts. The organization maintains its status as an at-will employer. Employees can be terminated for any reason not prohibited by law.</em>"}