{"job title": "Research Scientist - SLAM", "company": "Amazon", "city state": "– North Reading, MA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAre you inspired by invention? Is problem solving through teamwork in your DNA? Do you like the idea of seeing how your work impacts the bigger picture? Answer yes to any of these and you’ll fit right in here at Amazon Robotics. We are a smart team of doers that work passionately to apply cutting edge advances in robotics and software to solve real-world challenges that will transform our customers’ experiences in ways we can’t even image yet. We invent new improvements every day. We are Amazon Robotics and we will give you the tools and support you need to invent with us in ways that are rewarding, fulfilling and fun.<br><br> The Research and Advanced Development team at Amazon Robotics is seeking passionate and talented research scientists to develop future mobility and transportation systems. We are looking for excellent candidates with expertise in perception for autonomous vehicles that operate alongside human users in highly dynamic, uncertain, and large-scale environments. Candidates with backgrounds in SLAM (simultaneous localization and mapping), semantic scene understanding, machine vision, and/or long-term autonomy are encouraged to apply. The ideal candidates for these positions will be familiar with algorithms at both the theoretical and implementation levels. You will be challenged intellectually and have a good time while you are at it! <br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n* PhD in Robotics, Computer Science, Machine Learning, or similar <br> * Depth and breadth in state-of-the-art approaches for at least one of the following: localization and mapping, object detection and tracking, or semantic scene understanding <br> * At least three years of academic research or industry experience in developing relevant algorithms <br> * Passion to work with physical robots and bridge the gap between theory and practice <br> * Scientific mindset and the ability to invent, a track record of thought leadership and contributions that have advanced the field <br> * Superior communication and data presentation skills<br> * Experience with programming languages such as C++, Java, Python <br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n* Demonstrated ability to lead research projects and identify fruitful research directions <br> * Demonstrated ability to work on cross-functional teams <br> * Experience writing production or library code <br> * Experience with ROS<br> * Experience with computer vision libraries such as PCL, OpenCV <br> * Development on Linux <br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}