{"job title": "Scientist", "company": "Amgen Inc", "city state": "– Cambridge, Massachusetts", "rating": "3.7", "job description": "Amgen is a leading global biotechnology company, with a mission to serve patients around the world. As a science-based, patient-focused organization, we discover and develop innovative therapies to treat serious illnesses. Our medicines have made a dramatic difference in the lives of millions. To underpin our commitment to serve patients, Amgen is hiring in the department of Medicinal Chemistry at our Research and Development facility in Cambridge MA (AMA).\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nThis Scientist will be part of an innovative Medicinal Chemistry group, with responsibilities including (but not limited to) the design, synthesis, and purification of novel compounds for potential clinical drug development. The successful candidate will devise and implement creative scientific research through conducting laboratory experiments, planning detailed procedures for defined projects including timelines, milestones, methodological approaches, expected results and necessary resources; reviewing, analyzing, and interpreting scientific data and results; providing regular updates, documentation, and/or communication on project results; collaborating with other scientists and keeping current with field of expertise, including literature and technology development. Additional responsibilities may include advising supervisors and colleagues in areas of expertise; participating in national and international scientific meetings; providing scientific results that support the generation of publications, patents, or regulatory submissions and mentoring research associates and laboratory assistants.\n<br><br>\n<strong>Basic Qualifications</strong>\n<li>Doctorate degree or Doctorate degree completed by August 2019</li><li>OR</li><li>Masters degree and 4 years of scientific experience</li><li>OR</li><li>Bachelors degree and 6 years of scientific experience</li>\n<strong>Preferred Qualifications</strong>\n<li>Chemistry degree specializing in organic synthesis</li><li>Proven track record of academic accomplishments (i.e., peer-reviewed publications and/or patents)</li><li>Demonstration of good lab practices, with particular attention to safety</li><li>Clear understanding of structural determination using NMR and mass spectral techniques as well as knowledge of related purification methods</li><li>Understanding of biological and pharmaceutical principles and a working knowledge of the use of structure-based or other computer-aided drug design tools</li><li>Knowledge of the application of parallel synthesis techniques to medicinal chemistry</li><li>Excellent communication skills (both written and oral)<br><br>Amgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.</li>\n\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status."}