{"job title": "Senior Cyber Security Data Scientist", "company": "Bank of America", "city state": "– Charlotte, NC", "rating": "3.6", "job description": "<strong>Job Description:</strong>\n<br><br>\nWe are looking for a senior data scientist to form the core of our Applied Data Science team within the Emerging Threat Analytics &amp; Disruption team for the Global Information Security (GIS) Cyber Security Defense (CSD) organization.\n<br><br>\nThis role will involve working directly with security operators and leaders throughout GIS to develop solutions to complex predictive analytic problems involving diverse input data sources including real-time data. This person will be expected to work alongside a team of MapR, Hadoop, and Splunk engineers to develop theories using security data, analyze the requirements of our stakeholders and provide expertise in a fairly complex technical environment.\n<br><br>\nThe ideal candidates should be comfortable during technical demonstrations and be able to discuss the specifics of machine learning algorithms and preprocessing methods. The candidate will be supporting our tactical hunt team functions by providing expertise in exploratory data analysis, pattern discovery and advanced analytical techniques (e.g. neural networks, deep learning) to anticipate or detect undiscovered threats.\n<br><br>\nThe overall role will support strategic cyber risk analysis discussions through repeatable, data-driven, quantitative methods using all available data sources. We need candidates who can identify data gaps and help drive data strategy within GIS CSD.\n<br><br>\nSuccess for this role will be achieved by identifying previously undiscovered intrusions or by improving the banks security posture or the measurement thereof. The goal is to create new strategic and tactical value from security-relevant data through the dedicated exploration, analysis and investigation of that data using leading edge analytic technologies and techniques.\n<br><br>\nEnterprise Role Overview:\n<br><br>\nSenior contributor, with accountability for researching, designing, and engineering information security (authentication, perimeter security, security &amp; compliance tools, etc.) &amp; directory technology systems (software &amp; hardware) and security policies / procedures. Utilizes in-depth technical / project knowledge and business requirements to design secure solutions to meet customer / client needs while protecting the Bank's assets. Serves as organization spokesperson on specialized projects. Acts as a prime consultant on large projects that affect the organizations long-term goals and objectives. Exercises independent judgment in methods, techniques, and evaluation criteria for obtaining results. Provides direction and guidance to others in the group. Works under minimal supervision, with general guidance from Technical or Senior Technical Manager.\n<br><br>\nREQUIRED SKILLS\n<br><br>\n• 5+ years of real world business experience\n<br><br>\n• Educational background in Mathematics, Statistics, Computer Science, Information Science or Engineering\n<br><br>\n• Excellent organizational, writing and interpersonal skills\n<br><br>\n• Experience with programming languages such as Java, Python, Perl or C++\n<br><br>\n• Understanding of the Hadoop platform (e.g. MapReduce, Hive, Impala, Spark, Flume, Kafka) and related Big Data technologies\n<br><br>\n• Knowledge of R or SAS\n<br><br>\n• Fluency with SQL on one or more relational databases such as Microsoft SQL Server, MySQL, Postgres or Oracle\n<br><br>\n<strong>Shift:</strong><br><br>1st shift (United States of America)<br><br><strong>Hours Per Week:</strong><br><br>40"}