{"job title": "Sr. Data Scientist, IoT Security", "company": "ForeScout", "city state": "– San Jose, CA, United States", "rating": "2.9", "job description": "<strong>What We Are Doing:</strong>\n<br><br>\nForeScout is at the forefront of IoT Security. As the world becomes more and more connected so does the need for ForeScout's products. We are looking for individuals that want to be at the ground floor of building a product that addresses the world’s most challenging security problems. Innovation starts here, visionaries welcomed!\n<br><br>\nForeScout’s San Jose Engineering organization is looking for seasoned cyber security data scientist to drive the delivery of world-class IoT security intelligence content. An ideal candidate has deep technical background in security research, reverse engineering, machine learning, data modeling, clustering and classification, industry experience in mining endpoint, network and security data, strong problem solving skills, and most importantly a can-do attitude. As a key member of our IoT device cloud team, the candidate will work closely with cloud development team and CounterACT software development team to ensure that ForeScout’s security solution constantly addresses the newest IoT attacks with high accuracy. This is a rare opportunity to work with a group of super smart technical talents to solve the most challenging security problems.\n<br><br>\nWe are open to candidates of different experience levels.\n<br><br>\n<strong>What You Will Do:</strong>\n<ul>\n<li>Work with a group of security researchers and data scientists to analyze unique context-rich endpoint and network traffic data collected through our cloud platform;</li><li>Identify additional data sets that can be useful in refining and enhancing ForeScout’s IoT security policy engine;</li><li>Apply advanced machine learning algorithms to classify IoT devices and detect anomalous device behavior;</li><li>Suggest CounterACT software enhancements and define detailed requirements with software development team. Ensure accurate implementation;</li><li>Develop, test, release and maintain periodical security content update;</li><li>Be responsible for the overall quality of ForeScout’s IoT security intelligence content.</li>\n</ul>\n<strong>What You Bring to ForeScout:</strong>\n<ul>\n<li>Most importantly, true startup spirit and strong “can do” attitude. Willing to wear multiple hats when needed;</li><li>3+ years of industry experience in security research and/or data science;</li><li>Experience in endpoint, network or application security;</li><li>Experience in IoT security highly desirable;</li><li>PhD degree with cyber security focus highly desirable;</li><li>Experience in advanced machine learning algorithms highly desirable;</li><li>Experience in data mining and information retrieval with large data set highly desirable;</li><li>Strong problem solving skills</li><li>Ability to analyze complex multi-dimensional problems using systematic approach to achieve quick solution</li><li>Excellent communication and presentation skills</li><li>Strong teamwork spirit</li><li>Ability to influence with or without authority</li><li>Self-starter</li><li>Ability to efficiently collaborate with cross-functional teams</li>\n</ul>\n<strong>What ForeScout Offers You:</strong>\n<br><br>\nStrong product, good leadership, great culture, good people, diverse, great benefits, great compensation. If you have good work ethic, are visible, lean in, you will be recognized. We are in growth mode and there is tons of opportunity. A positive attitude and being flexible to change goes a long way here at ForeScout!\n<ul>\n<li>Competitive compensation and Benefits</li><li>Collaborative and innovative environment – make an impact on worldwide security while working on the hottest technology.</li><li>We work hard…and we PLAY hard!</li>\n</ul>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}