{"job title": "Lead Data Scientist", "company": "GoHealth", "city state": "– Chicago, IL", "rating": "3.2", "job description": "<div>Company Description<br><br>GoHealth has an ambitious mission: to improve the health care system in America. Achieving this mission relies on hiring and developing great people, which is why our team is our top priority. We encourage employees to do their best work through innovation and risk taking. Our environment is fun yet constructive, thanks to leaders whose doors are always open. And most importantly, we’ll never stop investing in you and your career.<br><br>Job Description<br><br>GoHealth is looking for a Lead Data Scientist who will be responsible for leading GoHealth's initiatives in the areas of advanced analytics, business intelligence, algorithm development and optimization, and machine learning. The Lead Data Scientist is expected to work with the Data Science, Data Engineering, and various teams and use data sets to find opportunities for improving GoHealth's software products and business processes.<br><br>Qualifications\n\n<ul>\n<li>Live the GoHealth Culture and ensure it is represented within the team.</li><li>Lead quantitative analyses with product management, business stakeholders, and data engineers in identifying and solving business problems.</li><li>Present analytical information in front of large group of business users.</li><li>Find innovative ways to combine data that do not naturally mesh together.</li><li>Stay current with leading edge systems, methods, and best practices for data science and analytics; and successfully introduce technology and process changes across the organization.</li><li>Drive the collaboration around actual performance and forecasts to directly impact business decisions and actions.</li><li>Continually find ways to improve how the team operates and delivers results that align with GoHealth's objectives.</li><li>Mentor, guide, and develop Data Scientists within the team.</li>\n</ul>\n<strong>Qualifications</strong>\n<ul>\n<li>Master's or PhD in Statistics, Mathematics, Computer Science, or related quantitative field.</li><li>At least 5 years of experience demonstrating trajectory of professional growth in software engineering, data science, or data engineering.</li><li>Experience in leading and delivering projects with other data scientists.</li><li>Experience in building and operating models in business plaforms.</li><li>Experience in softare engineering, and in building and deploying RESTful services.</li><li>Proficient in Python in manipulating data and drawing insights from data sets.</li><li>Strong analytical and problem solving ability with strong attention to detail and accuracy.</li><li>Strong knowledge and experience in using machine learning techniques such as regression and classification analyses, clustering, neural networks, etc.</li><li>Proven focus on results while leveraging both technical and analytical skills.</li><li>Familiar with relational databases and SQL.</li><li>Ability to handle multiple tasks and adapt to evolving business and technical environments.</li><li>Self-starter with the ability to work independently, take initiative, and learn new skills.</li><li>Excellent written and oral communication skills, with the ability to articulate complex processes to individuals of varying technical abilities</li><li>Knowledge of build systems, and version control systems using Git, Bitbucket, SVN, or Team Foundation.</li>\n</ul>\n\n<strong>Additional Information</strong>\n\n<ul>\n<li>Open vacation policy</li><li>401k match program</li><li>Medical, life, dental, and vision benefits</li><li>Flexible spending accounts</li><li>Subsidized gym memberships</li><li>Commuter and transit benefits</li><li>Professional growth opportunities</li><li>Casual dress code</li><li>Generous employee referral bonuses</li><li>Happy hours, ping-pong tournaments, and more company-sponsored events</li><li>GoHealth is an Equal Opportunity Employer</li></ul></div>\n<br>"}