{"job title": "Data Scientist Technical Lead, Google Maps", "company": "Google", "city state": "– Seattle, WA, United States", "rating": "4.4", "job description": "<div><div><strong>Note: By applying to this position your application is automatically submitted to the following locations: New York, NY, USA; Mountain View, CA, USA; Seattle, WA, USA</strong></div><div>The Geo team builds the most accurate, comprehensive, and useful maps for our users. More than a billion people rely on Google Maps services to explore the world and navigate their daily lives. That includes sailing down the Amazon river, choosing where to get a bite of pizza, flying over a 3D version of New York City and saving time commuting.\n<br><br>\nGeo helps merchants get their businesses on Google, and more than a million developers use the power of Google Maps to enhance their apps and websites. They are solving complex computer science problems, designing beautiful and intuitive product experiences and improving the accuracy of our geo data, all in order to plot a course for the future of mapping.</div><div><div> Responsibilities  <div>\n\n<ul>\n <li>Work with large, complex Geo datasets and solve difficult, non-routine analysis problems, applying advanced analytical methods as needed. Conduct end-to-end analysis that includes data gathering and requirements specification, processing, analysis, ongoing deliverables, and presentations.</li> <li>Build and prototype analysis pipelines iteratively to provide insights at scale. Develop comprehensive understanding of Google data structures and metrics, advocating for changes where needed for both products development and sales activity.</li> <li>Make business recommendations (e.g., cost-benefit, forecasting, experiment analysis) with effective presentations of findings at multiple levels of stakeholders through visual displays of quantitative information.</li> <li>Research and develop analysis, forecasting and optimization methods to improve the quality of Google's user facing products; example application areas include ads quality, search quality, end-user behavioral modeling, and live experiments.</li> <li>Manage a data science team. Interact cross-functionally with a wide variety of leaders and teams, and work closely with Engineers and Product Managers to identify opportunities for design and to assess improvements for Google products.</li></ul> </div>\n<br>\n<div> Qualifications  <div>Minimum qualifications:\n\n<ul>\n <li>Master's degree in a quantitative discipline (e.g., Statistics, Operations Research, Bioinformatics, Economics, Computational Biology, Computer Science, Mathematics, Physics, Electrical Engineering, Industrial Engineering) or equivalent practical experience.</li> <li>10 years of relevant experience in data analysis or related field as a Statistician, Data Scientist, Computational Biologist, or Bioinformatician.</li> <li>5 years of experience in people management or leadership.</li> <li>Experience with statistical software (e.g., R, Python, MATLAB, pandas) and database languages (e.g., SQL).</li>\n</ul>\n\n<strong>Preferred qualifications:</strong>\n\n<ul>\n <li>Doctorate's degree in a quantitative discipline (e.g., Statistics, Operations Research, Bioinformatics, Economics, Computational Biology, Computer Science, Mathematics, Physics, Electrical Engineering, Industrial Engineering).</li><li>12 years of directly relevant, tech industry work experience (e.g., as a statistician, bioinformatician, or data scientist), with deep expertise in statistical data analysis, such as linear models, multivariate analysis, stochastic models, and sampling methods.</li> <li>8 years of demonstrated leadership and self-direction including people management.</li> <li>Applied experience with machine learning on large datasets.</li> <li>Experience articulating business questions and using mathematical techniques to arrive at an answer using available data.</li> <li>Demonstrated skills in selecting the right statistical tools given a data analysis problem.</li></ul> </div>\n</div></div></div><div><div>At Google, we don’t just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a disability or special need that requires accommodation, please let us know.</div></div><div><div><strong>To all recruitment agencies:</strong> Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees or any other company location. Google is not responsible for any fees related to unsolicited resumes.</div></div></div>"}