{"job title": "Staff Data Scientist - Business Analytics", "company": "Intuit", "city state": "– Mountain View, United States", "rating": "4.2", "job description": "Overview<br><br>We are looking for a hands-on Staff Analyst in the Data Analytics &amp; Science team. Someone who is a creative problem solver with a passion for customer experience and for delivering advanced data-driven solutions. You will work alongside customer experience leaders and product managers to define, build and shape the future of the customer experience across Intuit’s ecosystem. We are seeking a Staff Analyst who will partner closely with Customer Success/Care leaders, product management, data engineering, data scientists and analysts to drive and execute across boundaries using data-driven practices. As a senior member of the analytics team, you will have a strong track record of combining advanced analytics skills, knowledge of customer care and/or product analytics and exceptional analytical acumen. Responsibilities: - Key thought-partner with business stakeholders. Suggest appropriate analysis, ideas and data points to help drive business decisions - Partner with leadership to prioritize areas of opportunity to drive growth and improved customer retention - Lead and execute analytics problems end-to-end. Translate complex business requirements into a roadmap with key milestones and deliverables - Leads teams in complex analytical initiatives, developing tracking, combining data from multiple sources to extract meaning, reconcile assumptions, and identify logical path for action - Understand the current ecosystems, historical customer behaviors, and long-term trends in order to identify ways to improve and communicate the necessary information to key partners - Partner with cross-functional teams including Customer Care, Product, Marketing, Engineering, Finance and Analytics to design and build tools to improve upon customer experience - Democratize data by building and socializing decision tools (dashboards, reports); build key data sets/pipelines to empower operational and exploratory analysis - Provide insights to the leadership team on impact of strategic initiatives on the key metrics<br><br>Responsibilities..Qualifications.."}