{"job title": "Scientist, Data Science (1 of 2)", "company": "Johnson &amp; Johnson", "city state": "– Spring House, Pennsylvania", "rating": "4.0", "job description": "<div>Janssen Research &amp; Development LLC, a Johnson &amp; Johnson company, is recruiting for a Scientist, Data Science. The primary location for this position is Spring House, PA. Consideration will be given to Raritan, NJ; La Jolla, CA; and Beerse, Belgium. Up to 10% domestic travel may be required.</div><div>Janssen develops treatments that improve the health and lifestyles of people worldwide. Research and development areas encompass oncology, cardiovascular and metabolic disorders, immunology, neuroscience, and infectious disease. Our ultimate goal is to help people live longer, healthier lives. We have produced and marketed many first-in-class prescription medications and are poised to serve the broad needs of the healthcare market from patients to practitioners and from clinics to hospitals. To learn more about Janssen, one of the Pharmaceutical Companies of Johnson &amp; Johnson, visit www.janssenpharmaceuticalsinc.com.</div><br>\n<div>Thriving on a diverse company culture, celebrating the uniqueness of our employees and committed to inclusion. Proud to be an equal opportunity employer.</div><br>\n<div>The R&amp;D Data Science team within Janssen is looking for an outstanding scientist who is interested in designing, developing, and fielding impactful data science solutions. Our team supports projects from discovery through late development. The scientist will help identify viable data science opportunities and then conceive, develop and implement end to end data analytical solutions. There are many ways to explore and analyze data, and this drives the excitement and passion of data scientists at Janssen as many teams are eager to leverage data to drive scientific innovation. The scientist will be someone who stays on the cutting edge of the data science field in order to implement novel algorithms that influence decisions at various levels in the organization. The role requires both a broad knowledge of existing machine learning algorithms and creativity to invent and customize when necessary. The scientist will be part of a dynamic, accomplished team that supports multiple R&amp;D therapeutic areas in the discovery and development of innovative medicines.</div>\n<br>\n<strong><div>The Scientist will:</div>\n<br>\n</strong>\n\n<li>Work with colleagues in research and development to design, build, and implement state-of-the art scientific algorithms to support Janssen R&amp;D initiatives.</li>\n<li>Develop and apply creative solutions that go beyond current tools to deliver data-driven insights to high-priority scientific problems.</li>\n<li>Participate in project teams and interact closely with scientific colleagues across various disciplines.</li>\n\n<br><br>\n<strong>Qualifications</strong>\n\n<li>Ph.D degree (OR Masters degree with a minimum of 3 years of relevant experience) in Computer Science, Statistics, Machine Learning &amp; Artificial Intelligence, Physics, Mathematics, Computational Chemistry, Bioinformatics, Computational Biology or a related discipline is required.</li>\n<li>Familiarity with drug discovery and clinical development processes is preferred.</li>\n<li>Strong working knowledge of machine learning algorithms such as Random Forest, SVM, neural networks, etc. and/or Natural Language Processing techniques is required.</li>\n<li>Familiarity with large datasets, understanding of data analysis workflows, and/or knowledge of querying languages such as SQL is required.</li>\n<li>Handling of healthcare relevant datasets, such as EHR, insurance claims or registry data, is preferred.</li>\n<li>Proficiency with one or more programming languages such as Python, R, C++, or Java is required.</li>\n<li>Experience with visualization software/tools such as R, Spotfire, Tableau, etc. is preferred.</li>\n<li>Ability to effectively communicate technical work to a wide audience is required.</li>\n\n<br><br>\n<strong>Primary Location</strong>\n<br>\nUnited States-Pennsylvania-Spring House\n<br>\n<strong>Other Locations</strong>\n<br>\nEurope/Middle East/Africa-Belgium-Antwerp-Beerse, United States-New Jersey-Raritan, North America-United States-California-La Jolla\n<br>\n<strong>Organization</strong>\n<br>\nJanssen Research &amp; Development, LLC. (6084)\n<br>\n<strong>Job Function</strong>\n<br>\n<strong>R&amp;D</strong>\n<br>\n<strong>Requisition ID</strong>\n<br>\n<strong>00001DJO</strong>\n<br>"}