{"job title": "Data Consultant- SAS, SQL, Visual Intelligence", "company": "Kaiser Permanente", "city state": "– San Francisco, California", "rating": "3.9", "job description": "Under general supervision, this position exists to assist the organization in making strategic data-related decisions by analyzing, manipulating, tracking, internally managing and reporting data. This position functions both as consultant and as a high-level statistical analytics programmer.\n<br><br>\n<strong>Essential Functions:</strong>\n\n<li> Designs and enhances databases.\n\n</li><li> Designs menu systems that are effective and user-friendly.\n\n</li><li> Develops reports with accurate, easy to read, useful information.\n\n</li><li> Designs and generates tracking and monitoring tools.\n\n</li><li> Participates in the development of outcomes and process measures, including technical specifications, to enable population measurement, guideline implementation, and evaluation.\n\n</li><li> Builds and maintains complex statistical routines using macros, vendor software, and software written by self and others.\n\n</li><li> Tests and maintains data integrity across multiple databases (internal SAS, DB2, VSAM; external: Adobe, Excel, SAS parsing routines, COBOL).\n\n</li><li> Builds sophisticated statistical models and forecasting tools using these databases.\n\n</li><li> Defines and frames complex multi-dimensional healthcare issues and develops time tables/processes for decision making.\n\n</li><li> Translates needs, issues, and ideas into effective strategies and action plans.\n\n</li><li> Formulates specific implementation plans and evaluates the effectiveness of actions/programs implemented.\n\n</li><li> Develops creative alternative solutions.\n\n</li><li> Works closely with IT and outside partners (and physicians for TPMG departments).\n\n</li><li> May coordinate team/project activities and schedules.\n\n</li><li> May assist in the determination of goals and priorities with team, clients, or project management sponsors.\n\n</li><li> May provide leadership to multi-disciplinary project teams.\n\n</li><li> Communicates results/recommendations to project sponsors, clients, and various senior level audiences (including physicians for TPMG departments).\n<br><br>\n<strong>Basic Qualifications:</strong>\n<br>\nExperience\n\n</li><li> Minimum three (3) years of programming in SAS, SQL, VBA, .net or equivalent statistical analytical programming language.\n\n</li><li> Minimum of three (3) years of related analytical consulting experience.\n<br>\n<strong>Education</strong>\n\n</li><li> Bachelor's degree in economics, finance, health care administration, public health administration, statistics, mathematics, operations\n<br>\nresearch, or related field required OR four (4) years of experience in a directly related field.\n\n</li><li> High School Diploma or General Education Development (GED) required.\n<br>\nLicenses, Certifications, Registrations\n\n</li><li> N/A.\n<br><br>\n<strong>Additional Requirements:</strong>\n\n</li><li> Broad familiarity with medical practices, especially population management and process and outcomes measurement.\n\n</li><li> Experience with MVS/TSO operating systems required\n\n</li><li> Experience with analytical manipulation and interpretation of large databases required.\n\n</li><li> Microsoft Office skills required.\n\n</li><li> Very strong analytic and critical thinking skills, writing skills, communication skills, consulting skills, and ability to work within a team.\n\n</li><li> Ability to express complex analytical and technical information to senior management or to audiences with clinical training.\n\n</li><li> Must be an independent self-starter.\n\n</li><li> Must be able to work in a Labor/Management Partnership environment.\n<br><br>\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Min 3-5 years programming across complex data platforms</li>\n<li>At least 1 year data consulting.</li>\n<li>Working with constituents to understand the data needs and presentation format for end- understanding. Comfortable working with a variety of leadership in clinical settings and other analysts across the clinical spectrum of care.</li>\n<li>Critical Thinking and Complex Data Skills</li>\n<li>Excellent communication skills in email and verbally.</li>\n<li>Leveraging Complex Technology</li>\n<li>Experience with Visual Intelligence</li>\n<li>Tableau</li>\n<li>Excel Expertise</li>\n<li>Any Experience with the Web/Intranet</li>\n<li>Developing Reports with ability to extract data from disparate data sources</li>\n<li>Efficiency in knowledge: Automating data</li>\n<li>Ability to move from Mainframe to SQL and Clarity</li>\n<li>SQL and SAS Experience: One is not sufficient.</li>\n<li>Expertise in Oracle-based platforms</li>\n<li>Expertise in Excel</li>\n<li>Knowledge of impacts related to transition from Teradata to Exadata, and how to anticipate and overcome them.</li>\n<li>Ability to work independently with minimal supervision but be a very strong collaborator</li>\n<li>Interest in keeping pace with technology and forward thinking. Self-development opportunities.</li>\n</ul></li>"}