{"job title": "Expert Information Security Data Scientist", "company": "Nike", "city state": "– Beaverton, OR", "rating": "3.9", "job description": "Become a Part of the NIKE, Inc. Team\n<br><br>\nNIKE, Inc. does more than outfit the world's best athletes. It is a place to explore potential, obliterate boundaries and push out the edges of what can be. The company looks for people who can grow, think, dream and create. Its culture thrives by embracing diversity and rewarding imagination. The brand seeks achievers, leaders and visionaries. At Nike, it?s about each person bringing skills and passion to a challenging and constantly evolving game.\n<br><br>\nNike Technology designs, creates and implements the methods and tools needed to make the world?s largest sports brand run faster, smarter and more securely. Global Technology teams aggressively innovate the solutions needed to help employees navigate Nike's rapidly evolving landscape. From infrastructure to security and supply chain operations, Technology specialists drive growth through top-flight hardware, software and enterprise applications. Simply put, without Nike Technology, there are no Nike products.\n\n\n<ul>\n<li>*Description**</li>\n</ul>\n\nAs an Artificial Intelligence Reinforcement Learning Data Scientist, your role in Corporate Information Security (CIS) Cyber Threat Analytics (CTA) team is to improve Nike?s Cyber Defense by leveraging your knowledge of data science, semantic and cognitive reasoning, neural networks, data mining, and industry best practices to develop detection methods. Your responsibilities will include:\n<br><br>\n+ Collaborate with data scientists and stakeholders to explore opportunities to develop data-driven solutions by developing and utilizing statistical modeling and machine learning algorithms\n<br><br>\n+ Translate ambiguous statements into structured problem statements and testable hypotheses\n<br><br>\n+ Analyze and profile available, reliable, and relevant data (internal and external) to uncover insights in support of scalable solutions\n<br><br>\n+ Clean, prepare and verify the integrity of data for analysis\n<br><br>\n+ Validate appropriate models to discover meaningful patterns and insights\n<br><br>\n+ Track model accuracy, ensuring model relevance and reliability\n<br><br>\n+ Create clear and structured deliverables to communicate meaningful insights and prescribe actionable data driven business solution recommendations\n<br><br>\n+ Build trust and drive business adoption by demystifying solution intricacies for stakeholders\n<br><br>\n+ Create clear, user-friendly documentation to support business usage of the solution\n<br><br>\n+ Collaborate with a team of data scientists, solutions delivery managers, engineers, and business stakeholders to take an opportunity or pain point from concept to scaled solution\n<br><br>\n+ Stay abreast of and apply industry and technology trends as well as emerging tools and techniques relevant to discipline\n<br><br>\n+ Participate in a continuous learning environment within the advanced analytics community through persistent development of new skills and sharing of knowledge through mentorships and contributions to the open source community\n\n\n<ul>\n<li>*Qualifications**</li>\n</ul>\n\nTo make it clear, we're not looking for just anyone. We're looking for someone special, someone who had these experiences and clearly demonstrated these skills:\n<br><br>\n+ In-depth background in mathematics, statistics, or a related field\n<br><br>\n+ In-depth knowledge of applied data science\n<br><br>\n+ In-depth knowledge of machine learning algorithms and data science methods\n<br><br>\n+ In-depth data wrangling experience with structured and unstructured data\n<br><br>\n+ Experience with various programming and scripting languages\n<br><br>\n+ Experience with databases, processing, and storage frameworks\n<br><br>\n+ Experience with various hyperparameter tuning approaches\n<br><br>\n+ Strong knowledge of CRISP-DM and Agile data science framework\n<br><br>\n+ Strong knowledge of information security principles and practice.\n\n\n<ul>\n<li>*Qualifications** To make it clear, we're not looking for just anyone. We're looking for someone special, someone who had these experiences and clearly demonstrated these skills:</li>\n</ul>\n\n+ In-depth background in mathematics, statistics, or a related field\n<br><br>\n+ In-depth knowledge of applied data science\n<br><br>\n+ In-depth knowledge of machine learning algorithms and data science methods\n<br><br>\n+ In-depth data wrangling experience with structured and unstructured data\n<br><br>\n+ Experience with various programming and scripting languages\n<br><br>\n+ Experience with databases, processing, and storage frameworks\n<br><br>\n+ Experience with various hyperparameter tuning approaches\n<br><br>\n+ Strong knowledge of CRISP-DM and Agile data science framework\n<br><br>\n+ Strong knowledge of information security principles and practice.\n<br><br>\nNIKE, Inc. is a growth company that looks for team members to grow with it. Nike offers a generous total rewards package, casual work environment, a diverse and inclusive culture, and an electric atmosphere for professional development. No matter the location, or the role, every Nike employee shares one galvanizing mission: To bring inspiration and innovation to every athlete* in the world.\n<br><br>\nNIKE, Inc. is committed to employing a diverse workforce. Qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, veteran status, or disability.\n\n\n<ul>\n<li>*Job ID:** 00398081</li>\n<li>*Location:** United States-Oregon-Beaverton</li>\n<li>*Job Category:** Technology</li>\n</ul>"}