{"job title": "2019 Summer Analyst - Data Scientist", "company": "Point72", "city state": "– New York", "rating": "3.7", "job description": "An Internship with Point72’s MI Data - Analytics team\n<br>\nPoint72’s MI Data - Analytics team is our big data research platform. We conduct compliant, data driven research to provide actionable insights to Point72’s Long/Short equity investing businesses. We combine an experiment-based approach with the strongest possible management support and the freedom to innovate unencumbered by bureaucracy. We encourage our Data Scientists to imagine the impossible, and provide the structure to bring those ideas to market in months, not years.\n<br>\nWhat you’ll do\n<br>\nAs a Summer Analyst you will learn the fundamentals of Big Data research, including how to source, process, analyze, and distribute large data inputs. In this role, you will:\n\n\n<li>Collaboratively manage all aspects of the research and execution process including methodology selection, data collection and quality, modeling and analysis, and performance monitoring</li>\n<li>Tackle the challenges of featurizing and modeling large and unstructured data using machine learning and statistical techniques</li>\n<li>Run scripts and other analytical tools on unstructured and/or raw data to extract insights</li>\n<li>Use BI and other tools to understand trend inflections, flag data integrity issues</li>\n<li>Query SQL and NoSQL databases</li>\n<li>Work with the team to help drive innovation on metrics and modeling strategies</li>\n\n<br>\nDesired skill sets\n<br>\nWe want you to join us if you have a strong desire to learn data science skills and possess strong analytical skills. Other requirements include:\n\n<li>Commitment to the highest ethical standards</li>\n<li>A minimum cumulative GPA of 3.5/4.0 (or equivalent)</li>\n<li>Strong programming skills, Python, R, SQL</li>\n<li>Industrial working experience in a role that requires advanced statistical models</li>\n<li>Hands-on working experience with varied and complex data sets</li>\n<li>Ability to think creatively</li>\n\n<br>\nAbout Point72\n<br>\nPoint72, the family office managing Steve Cohen’s assets, is a global firm that uses discretionary long/short, macro, and systematic strategies to invest in five countries across three continents. We look for people who want to build a career with us – people who want to innovate, experiment, and be the best at what they do – while adhering to the highest ethical standards."}