{"job title": "Chief Data Scientist Solution Architect", "company": "SAIC", "city state": "– Reston, VA", "rating": "3.6", "job description": "Chief Data Scientist Solution Architect (Job Number:436115)\n\n\n<ul>\n<li>Description:*</li>\n</ul>\n\nSAIC is hiring a Chief Data Scientist Solution Architect\n<br><br>\nin Reston, VA\n<br><br>\n<strong>Job Description:</strong>\n\n\n<ul>\n<li>The Chief Data Scientist plays a leadership position in the data science department and is responsible for overseeing activities of the junior data science team ensuring proper execution of duties and alignment with the business?s overall vision.</li>\n<li>The Chief Data Scientist is responsible for the creation of new data sciences capabilities for the business by envisioning and executing strategies that will influence improvement of the business?s performance by enabling informed decision-making.</li>\n<li>The Chief Data Scientist proactively works with business executives and various departmental heads across the business in order to provide advanced analytic data modeling systems.</li>\n<li>The Chief Data Scientist designs and launches innovative and complex analytic models, utilizing a blend of contemporary and traditional data mining techniques, which he applies to both structured and unstructured data sets.</li>\n<li>The Chief Data Scientist leads the development of big data capabilities and utilization as well as the coordination of cross-functional analytic initiatives.</li>\n</ul>\n\n<strong>Leadership/Supervisory Role:</strong>\n\n\n<ul>\n<li>This is a leadership position responsible for playing the role of leading innovation within the business and, as such, defining how the business creates additional value through the utilization of its data assets and analytics.</li>\n<li>The Chief Data Scientist is tasked with consistently identifying and monitor key business risks and realizing the data needs of the business.</li>\n<li>The Chief Data Scientist oversees all data science proposal activities ensuring alignment with market segment and subsegment vision and strategies.</li>\n<li>In this position, it is also the Chief Data Scientist?s role to drive education and evangelization of data sciences throughout the business by communicating the vision and use cases of advanced analytics.</li>\n<li>This is an Engineering position, which will provide for Research and Development activities in areas such as enterprise deployment of deep neural networks, integration with big data analytics platforms including Apache Spark, Apache Hadoop and SAIC analytics products as an example.</li>\n<li>Develop functionality in an agile fashion, with regular releases</li>\n<li>Learn new technologies and techniques from efficient GPU programming, C, CUDA, Python and Java code</li>\n<li>Design and develop analytics solutions and products for production use</li>\n<li>Prototype new technologies and approaches to assess alternatives</li>\n<li>Work as part of an agile team, delivering new functionality on a regular cadence</li>\n<li>Work in a collaborative and fast-paced fun team environment with effective communication and assisting peers. Be an asset and contributor to the team.</li>\n<li>Contribute to designing and building our next generation architecture/ platform for Machine and Deep Learning</li>\n<li>Work with a group of Machine Learning engineers, data scientists and product management</li>\n<li>Distill business objectives into technical solutions through effective system design and architecture</li>\n<li>Show ownership and completion for delivery of technical functions</li>\n<li>Provide technical and analytical solutions to evaluate the merits and challenges of a product idea</li>\n<li>Perform high complexity integration testing, distributed development and validate integration</li>\n<li>Qualifications:*</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\n<strong>Required Experience and Skills:</strong>\n\n\n<ul>\n<li>Overall 14+ years of experience managing or supporting in a significant role, the acquisition, integration, and acceptance lifecycle of one or more complex computational systems or system upgrades in a mission critical or production R&amp;D computational environment.</li>\n<li>3+ years of full time programming experience within an operations or technical department.</li>\n<li>Understanding of programming concepts and application development. In-depth understanding of one or more computational technical areas such as advanced modeling and simulation.</li>\n<li>Domain knowledge in artificial intelligence and machine learning</li>\n<li>Demonstrated ability to manage complex projects, creating innovative processes and solutions</li>\n<li>Problem solving and analysis skills</li>\n<li>Strong written and verbal communication skills</li>\n<li>Experience working for federal agencies in a consulting position</li>\n<li>Experience specifying user-representative requirements for complex computational environments</li>\n</ul>\n\n<strong>Education:</strong>\n\n\n<ul>\n<li>BS is required. BS, MS or Ph.D in Computer Science, Engineering, Mathematics, Science or other related technical discipline is preferred.</li>\n</ul>\n\n<strong>Clearance:</strong>\n<br><br>\nUS Citizen\n<br><br>\nAbility to obtain a SECRET Clearance\n<br><br>\n<strong>Work Location and Travel:</strong>\n<br><br>\nReston, VA\n<br><br>\nTravel would be up to 50%\n<br><br>\nSAIC Overview:SAIC is a premier technology integrator providing full life cycle services and solutions in the technical, engineering, intelligence, and enterprise information technology markets. SAIC is Redefining Ingenuity through its deep customer and domain knowledge to enable the delivery of systems engineering and integration offerings for large, complex projects. SAIC?s approximately 15,000 employees are driven by integrity and mission focus to serve customers in the U.S. federal government. Headquartered in Reston, Virginia, SAIC has annual revenues of approximately $4.5 billion. For more information, visit saic.com. For information on the benefits SAIC offers, see ( My SAIC Benefits. EOE AA M/F/Vet/Disability\n\n\n<ul>\n<li>Job Posting:* Aug 23, 2018, 2:19:03 PM</li>\n<li>Primary Location:* United States-VA-RESTON</li>\n<li>Clearance Level Must Currently Possess:* None</li>\n<li>Clearance Level Must Be Able to Obtain:* Secret</li>\n<li>Potential for Teleworking:* No</li>\n<li>Travel:* Yes, 50% of the time</li>\n<li>Shift:* Day Job</li>\n<li>Schedule:* Full-time</li>\n</ul>"}