{"job title": "Marketing Data Analyst", "company": "Verve", "city state": "– Los Angeles, CA", "rating": "4.5", "job description": "This is a really exciting time to join Verve’s performance marketing team. This is a new role for Verve and an opportunity to shape the Marketing strategy and develop our Los Angeles office to achieve a high, fast and sustainable growth.\n<br><br>\nIn the next 12 months you will:\n<ul>\n <li>Be leading the data driven mindset within the acquisition team for Verve: You will become an expert in Data analysis and insights for advocate and customer acquisition, always focussing on the company ROAS, revenue growth and scalability.</li> <li>Develop and implement databases, data collection systems, data analytics and other strategies that optimize statistical efficiency and quality</li> <li>Acquire data from primary or secondary data sources and maintain databases/data systems</li> <li>As Marketing Analyst Leader, you will Interpret data, analyze results using statistical techniques and provide ongoing reports including actionable insights to the marketing team in order to improve the campaign results</li> <li>Using your mathematical skills, you will be creating a bidding algorithm to shape our digital advertising bidding strategy</li> <li>You will combine your communication skills with the insights gathered to report actionable insights and strategy to other department of the business.</li> <li>You will be ruthlessly data-driven, ensuring the development and implementation of best practice in the tracking and storage of customer data, and support the use of this data in providing training to the teams member</li>\n</ul>\n<strong>Requirements</strong>\n<br><br>\nYou are:\n<ul>\n <li>An experienced analyst, with 3+ years of paid advertising data management, ideally in either marketplace, retail or travel</li> <li>A start-up enthusiast, with demonstrable experience in a high growth start-up environment</li> <li>Highly analytical, data-driven and with a ROAS solution-oriented mindset.</li> <li>Proficient in SQL &amp; excel and willing to teach others</li>\n</ul>\n<strong>Benefits</strong>\n<br><br>\nVerve is building a platform which enables our global network of advocates to sell products and services they love to their friends in exchange for unique experiences and rewards. We‘ve established a beachhead in live entertainment and work with some of the biggest events in the world, and are rapidly expanding our festival and event portfolio across the U.S., UK, Europe, and Australasia. As we continue to expand rapidly within this market, we’re also developing and launching exciting new technology for events to connect directly with their biggest fans. At Verve we believe in a culture of freedom and ownership.\n<br><br>\nWe empower you to own the value you create and impact on our future success. And we believe that to act as an owner you should be empowered to work in the way that enables you to deliver the best results – how and when you do is up to you. You choose your hours, where you work, the meetings you attend and the amount of holiday to take in order to create the most value and be at your best."}