{"job title": "Scientist", "company": "VIE HIRE", "city state": "– Framingham, MA, US", "rating": "NA", "job description": "<div>\n**EASY APPLY on our Company Page with RESUME ONLY (Cover page optional). <br><br><br>We are seeking a Scientist to employ in-depth technical knowledge in the field of analytical experiment design and execution often working independently to design and implement a series of experiments. A successful candidate must have strong organization skills and ability to write technical reports describing the experiments and their outcome. Experience in separation of biomolecules is a plus. Must be well-versed in the software for Thermo, Waters and AB Sciex systems. Experience with ICP-MS and ICP-OES is desired. Experience with Fatty Acid Analysis is a plus. Experience of working in a GMP regulated environment is preferred. </div><div>\nExperience with data bases is a plus</div><div>\n<br></div><div>\n<strong>Basic Qualifications:</strong></div><div>\n--BS, MS, or Ph.D. degree in biology, chemistry, or pharmaceutical science discipline plus at least 10 years for BS, 5-7 years for MS or 2-4 years for Ph.D. of industrial experience in conducting drug metabolism studies using hepatocytes and liver microsomes is a must.</div><div>\n--Strong technical skills in handling hepatocytes, cells, and other biological matrices is required</div><div>\n--Experience in operating and maintaining LC and Thermo Scientific Orbitrap or AB Sciex triple-quadruple mass spectrometers is a plus.</div><div>\n--Prior experience in Analyst® and Watson® software for quantitative analysis and automation using Tecan liquid handling system for drug metabolism assays is a plus.</div><div>\n-- Records in strong technical writing skill as evidenced by research paper, conference presentation, and patent publications, etc.</div><div>\n<br><br></div><div>\n<strong>Preferred Qualifications</strong>:</div><div>\n--Attention to details</div><div>\n--Critical analytical and problem solving skills</div><div>\n--Excellent communication and interpersonal skills</div><div>\n--Strong commitment to the assigned tasks and striving for on-time delivery</div><div>\n--Desire to work within a team in a highly dynamic environment</div><div>\nKeywords: </div><div>\nEducation: BS/BA 4-7 years of experience or PH.D with 1-3 years experience </div><div>\nSkills and Experience:</div><div>\nRequired Skills: </div><div>\nDRUG METABOLISM </div><div>\nGMP </div><div>\nICP </div><div>\nMETABOLISM </div><div>\nORGANIZATION SKILLS </div><div>\nAdditional Skills: </div><div>\nCHEMISTRY </div><div>\nLIQUID HANDLING </div><div>\nPROBLEM SOLVING </div><div>\nQUANTITATIVE </div><div>\nQUANTITATIVE ANALYSIS <br><strong><br>About us:</strong><br><br></div><div>\nWe are not a large corporate consulting conglomerate, we are a small and steadily growing valuable consulting firm. -Valuable to our clients and consultants we work with. We have an excellent reputation with our clients and one that we continue to build upon. We are always looking for top talent.<br><br></div><div>\n <br><br></div><div>\n<br>**EASY APPLY on our Company Page with RESUME ONLY (Cover page optional). <br><br></div>"}