{"job title": "Data Scientist", "company": "Thermo Fisher Scientific", "city state": "– Carlsbad, CA", "rating": "3.3", "job description": "Job Description<br><br>Thermo Fisher Scientific Inc. is the world leader in serving science, with revenues of more than $20 billion and approximately 70,000 employees globally. We help our customers accelerate life sciences research, solve complex analytical challenges, improve patient diagnostics, deliver medicines to market and increase laboratory productivity. When you join us at Thermo Fisher Scientific, youll be part of a smart, driven team that shares your passion for exploration and discovery.\n<br><br>\n<strong>Position Summary:</strong>\n<br><br>\nThe Data Scientist will be involved in a wide variety of activities to enable and support data-driven decision making with regards to new product ideas and portfolio expansion within the Protein and Cellular Analysis Business unit. The Data Scientist will identify, collect, and assemble relevant data from disparate sources (internal and external) to enhance internal software/analysis tools, as well as for use in ad hoc analyses. The Data Scientist will also serve as a subject-matter expert and proactively identify and implement the best methods/models to address complex business questions, such as data visualization, statistical modeling, algorithm development, or machine learning. The Data Scientist will participate in cross-functional teams and effectively communicate difficult concepts at a high level, as well as the technical details, to various stakeholders within the organization.\n<br><br>\n<strong>Key Responsibilities:</strong>\n<ul>\n<li>Obtain and standardize data from public and private sources, including biological, clinical, and market-related information</li><li>Collaborate internally to obtain and standardize internal data related to products, revenue, etc.</li><li>Provide accurate, timely, and actionable intelligence to support business decision-making</li><li>Contribute to design, data preparation, and algorithm development for internal software tools</li><li>Identify and implement data science-based approaches to inform strategy for new product development and portfolio expansion efforts, in collaboration with cross-functional teams</li>\n</ul>\n<strong>Minimum Requirements/Qualifications:</strong>\n<ul>\n<li>A Bachelor or Masters Degree in a highly quantitative field (Bioinformatics, Computational Biology, Computer Science, Statistics, or related field)</li><li>Bioinformatics experience, especially with regards to genome, proteome, and/or pathway analysis</li><li>3+ years experience in predictive modeling, data science and analysis</li><li>Hands-on experience with relational databases and managing data</li><li>Solid experience using Excel as reporting tool (utilizing pivot tables, VLOOKUPs, charting, etc.)</li><li>Working knowledge of using statistics for analyzing datasets</li><li>Experience with formulating algorithms for predictive analysis and data mining</li><li>Experience with reporting software (e.g. Tableau), database queries (SQL), programming/scripting (e.g. Python, XML, Javascript)</li><li>Strong planning and analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy</li><li>Strong problem-solving aptitude with track record of diving into data to discover hidden patterns</li><li>Excellent visualization and presentation skills</li>\n</ul>\n<strong>Preferred Qualifications:</strong>\n<ul>\n<li>Ph.D. in Bioinformatics, Computational Biology, Computer Science, Statistics, Clinical Informatics, or related field</li><li>5+ years experience in predictive modeling, data science and analysis</li><li>Expertise and proven track record (preferably in industry) in applying data science, including machine learning, to solve complex problems</li><li>Expertise in text mining</li><li>Life science research experience, especially with regards to protein analysis, antibody-related techniques, and disease biology/translational research</li><li>Life science reagent business experience</li>\n</ul>\nThis position does not offer relocation benefits\n<br><br>\nAt Thermo Fisher Scientific, each one of our 70,000 extraordinary minds has a unique story to tell. Join us and contribute to our singular missionenabling our customers to make the world healthier, cleaner and safer.<br><br>If you are an individual with a disability who requires reasonable accommodation to complete any part of our application process, click here for further assistance.<br><br>Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status."}