{"job title": "Senior Applied Scientist", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAre you passionate about building data-driven solutions to drive the profitability of the business? Are you excited about solving complex real world problems? Do you have proven analytical capabilities, exceptional communication, project management skills, and the ability to multi-task and thrive in a fast-paced environment? We need your skills and experience to help us grow Amazon Lending.<br>Amazon Lending is an exciting program that provides businesses with click-to-cash access to funds that they need to grow their business with Amazon. We take pride in building scalable automated systems that make data-driven decisions to automate the entire lending process on a global scale.<br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\nBasic Qualifications\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<b>Basic qualifications</b><br><ul><li><br></li><li>Graduate degree in Statistics, Economics, Electrical Engineering, Computer Science, Mathematics, or related technical field</li><li><br></li><li>At least 5 years of experience using predictive models to make business decisions.</li><li><br></li><li>Experience with programming languages such as SQL, R, Python</li><li><br></li><li>Demonstrated track record of project delivery for large, cross-functional projects with evolving requirements</li></ul><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\nPreferred Qualifications\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<b>Preferred qualifications</b><br><ul><li><br></li><li>Applicants with considerably more experience, including mid-career, are also strongly encouraged.</li><li><br></li><li>Strong background in statistics methodology, applications to business problems, and/or big data.</li><li><br></li><li>Large breadth of experience with of predictive modeling using supervised or unsupervised learning techniques.</li><li><br></li><li>Ability to work in a fast-paced business environment.</li><li><br></li><li>Effective verbal and written communications skills.</li><li><br></li><li>Credit or risk management experience.</li></ul><br>Amazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation<br><br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}