{"job title": "Data Scientist", "company": "Booz Allen Hamilton Inc.", "city state": "– Washington, DC", "rating": "3.7", "job description": "<strong>Job Number: R0034993</strong>\n<br><br>\nData Scientist<br><br><strong>The Challenge:</strong>\n<br><br>\nAre you excited at the prospect of unlocking the secrets held by a data set? Are you fascinated by the possibilities presented by machine learning, artificial intelligence advances, and IoT? In an increasingly connected world, massive amounts of structured and unstructured data open up new opportunities. As a data scientist, you can turn these complex data sets into useful information to solve global challenges. Across private and public sectors from fraud detection, to cancer research, to national intelligence you know the answers are in the data.\n<br><br>\nWe have an opportunity for you to use your analytical skills to improve the DoD and federal agencies. Youll work closely with your customer to understand their questions and needs, then dig into their data-rich environment to find the pieces of their information puzzle. Youll develop algorithms, write scripts, build predictive analytics, use automation, apply machine learning to turn disparate data points into objective answers, and use the right combination of tools and frameworks to turn that set of disparate data points into objective answers to help our nations services and leaders make data-driven decisions. Youll provide your customer with a deep understanding of their data, what it all means, and how they can use it. Join us as we use data science for good in the DoD and federal agencies.\n<br><br>\nEmpower change with us.\n<br><br>\n<strong>Build Your Career:</strong>\n<br><br>\nAt Booz Allen, we know the power of data science and machine intelligence and were dedicated to helping you grow as a data scientist. When you join Booz Allen, you can expect:\n<ul>\n<li>access to online and onsite training in data analysis and presentation methodologies, and tools like Hortonworks, Docker, Tableau, Splunk, and other open source and emerging tools</li><li>a chance to change the world with the Data Science Bowlthe worlds premier data science for social good competition</li><li>participation in partnerships with data science leaders, like our partnership with NVIDIA to deliver Deep Learning Institute (DLI) training to the federal government.</li>\n</ul>\nYoull have access to a wealth of training resources through our Analytics University, an online learning portal specifically geared towards data science and analytics skills, where you can access more than 5000 functional and technical, certifications, and books. Build your technical skills through hands-on training on the latest tools and state-of-the-art tech from our in-house experts. Pursuing certifications? Take advantage of our tuition assistance, on-site boot camps, certification training, academic programs, vendor relationships, and a network of professionals who can give you helpful tips. Well help you develop the career you want as you chart your own course for success.\n<br><br>\n<strong>You Have:</strong>\n<br><br>\n-Experience with one or more scripting or scientific languages, including Java, Python, C++, or R\n\n\n<ul>\n<li>Experience with using statistical software applications, including SAS, R, MATLAB, SPSS, and Stata</li>\n<li>Experience in working with a wide range of predictive and decision models, including tools for developing such models</li>\n<li>Experience with Microsoft Excel and Access\n<br><br>\n-Knowledge of relevant statistical measures, including confidence intervals, significance of error measurements, development and evaluation data sets</li>\n<li>Ability to obtain a security clearance\n<br><br>\n-Scheduled to obtain a BA or BS degree in Winter 2018 or Spring 2019\n<br><br>\n<strong>Nice If You Have:</strong>\n<br><br>\n-Experience with developing statistical and simulation models</li>\n<li>Experience with Big Data programming technologies, including Hadoop, MapReduce, Accumulo, Cassandra, HBase, R, Mahout, Pig, and Hive</li>\n<li>Experience with applying various machine learning techniques, and comprehending the key parameters that affect their performance</li>\n<li>Experience in one or more natural language processing topics: tagging, syntactic parsing, word sense disambiguation, topic modeling; contextual text mining, and application of deep learning to NLP</li>\n<li>Experience in developing experimental and analytic plans for data modeling processes, use of excellent baselines\n<br><br>\n-Ability to accurately determine cause and effect relationships\n<br><br>\n-MS or PhD degree in Operations Research, Data Science, Applied Mathematics, CS, Physics, Statistics, Engineering, or similar technical field\n<br><br>\n<strong>Clearance:</strong>\n<br><br>\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information.\n<br><br>\nWere an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change.<br><br>SIG2017</li>\n</ul>"}