{"job title": "Scientist - AFP", "company": "Aequor", "city state": "– Cambridge, Massachusetts", "rating": "4.1", "job description": "Client is a biopharmaceutical leader founded on discovering, developing, manufacturing, and delivering innovative human therapeutics. Client's Attribute Sciences group within Process Development is seeking a Scientist. The Process Development Scientist will be responsible for the strategy, execution, analysis and communication of method transfer and method validation protocol and report writing. This candidate will help to drive improving this process and effectively communicate results with internal and external partners across a global network.\n<br>\nThe Scientist role in Commercial Process Development will be part of a team responsible for authoring method transfer and method validation protocols and reports for clinical/commercial programs for the following method platforms: Chromatography, Bioassay, Device, PCR, Microbiology, Immunoassay, CE/Gel, Viral, and General. Protocols and reports will be authored according to regulatory and industry guidelines (i.e., ICH). This individual will support clinical and commercial locations throughout the company. This position works closely with representatives from key functions within Process Development, Manufacturing and Quality.\n<br>\n<strong>Basic Qualifications:</strong>\n\n\n<ul>\n<li>PhD</li>\n<li>OR Masters degree and 4 years of Operations or Scientific experience</li>\n<li>OR Bachelors degree and 6 years of Operations or Scientific experience</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>PhD in Biochemistry, Analytical Chemistry, Physical or Life Sciences</li>\n<li>Strong understanding and hands-on experience of methods within the following platforms Chromatography, Bioassay, PCR, Microbiology, Immunoassay, CE, Gel, Device, Viral, and General</li>\n<li>Strong understanding and hands-on experience with method transfer and method validation processes with direct experience from a Pharmaceutical or Biotechnology Company.</li>\n<li>Advanced knowledge of analytical methods/technologies used in biologic and synthetic development and manufacturing</li>\n<li>Excellent written and oral communication skills for the timely documentation, presentation, and discussion of scientific results in a fast-paced, multi-disciplinary, team-based environment</li>\n<li>Demonstrated ability to critically analyze and interrogate various analytical data sets to drive and influence the process</li>\n<li>Demonstrated ability to propose and drive new scientific initiatives</li>\n</ul>"}