{"job title": "Stewardship and Data Coordinator", "company": "ALS TDI", "city state": "– Cambridge, MA", "rating": "4.6", "job description": "<strong>Stewardship &amp; Data Coordinator</strong>\n<br><br>\nThe ALS Therapy Development Institute (ALS TDI) is seeking a full-time Stewardship and Data Coordinator to manage acknowledgment communications, execute lead evaluations and assignments, and assist the Lead Data Management Analyst and the Director of Donor Communications and Stewardship.\n<br><br>\nThe ideal candidate must thrive in a fast-paced environment, have excellent attention to detail, and exemplify a strong work ethic.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\n-Manage and execute acknowledgment communications through donor portal and Salesforce database. Tasks include reviewing communications in detail, working with Development staff to ensure accurate information is included, printing, mailing, and recording in database.\n<br><br>\n-Assist in evaluating and assigning new leads. Requires conducting research, documenting findings, qualifying potential, categorizing based on a scoring system, and assigning to a Development staff member.\n<br><br>\n-Assist in executing sustained giving initiatives. Tasks include list scrubbing, reviewing and editing communications (both print and email), mailing communications, and recording in database.\n<br><br>\n-Assist in expanding donor relations outreach efforts including new stewardship initiatives, thank you calls, and notes/letters to donors.\n<br><br>\n-Assist with solicitations programs and leveraging opportunities. Tasks include scrubbing and categorizing lists as needed.\n<br><br>\n-Create and send stewardship gifts and special communications as requested by Development staff.\n<br><br>\n-Help with assignments related to in-person seminars, online webinars, social media (e.g., Facebook fundraisers), and signature events.\n<br><br>\n-Help with assignment requests submitted by Development staff members.\n<br><br>\n-Assist in creating geo-targeted email blast lists for various signature events and fundraising campaigns.\n<br><br>\n-Help with data clean-up projects in Salesforce as needed.\n<br><br>\n-Assist in assigning or responding to info box emails. Includes helping with email blast follow up, such as logging responses and updating information in Salesforce and MailChimp.\n<br><br>\n-Assist in creating and editing templates for MailChimp automated emails.\n<br><br>\n-Create donation reports as requested by signature event fundraisers, community event hosts, and Development staff.\n<br><br>\n-Assist with creating reports and analyzing data as needed.\n<br><br>\n-Support and collaborate with the Development team, the Marketing team, and the Donation Processing team.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n-Bachelor's degree from an accredited college or university.\n<br><br>\n-Two years of office experience.\n<br><br>\n-Strong English communication skills, both written and verbal.\n<br><br>\n-Proficient in Microsoft Office applications.\n<br><br>\n-Experience with Salesforce or CRM software is advantageous, but not required.\n<br><br>\n-Excellent attention to detail and commitment to accuracy.\n<br><br>\n-Strong organizational skills, great time management, and highly analytical.\n<br><br>\n-Hard-working, reliable, and self-motivated.\n<br><br>\n-Ability to work independently with minimal supervision as well as on a team.\n<br><br>\n-Commitment to ALS TDI's mission.\n<br><br>\n<strong>About ALS TDI</strong>\n<br><br>\nThe ALS Therapy Development Institute (ALS TDI) and its scientists actively discover and develop treatments for ALS. It is the world's first and largest nonprofit biotech focused 100% on ALS research. Led by people with ALS and drug discovery experts, ALS TDI understands the urgent need to slow and stop this horrible disease. For more information, visit www.als.net.\n<br><br>\n<strong>\n<br>\n<strong>To Apply</strong>\n<br><br>\n</strong>Please apply at https://als.applicantpro.com Please submit a cover letter, salary requirements and resume.<br><br><strong>Job Posted by ApplicantPro</strong>\n<br>"}