{"job title": "Temporary Research Scientist II", "company": "AMRI", "city state": "– US-NY-Rensselaer", "rating": "2.8", "job description": "<strong>Temporary Research Scientist II in Rensselaer, NY</strong><br>\n<div><strong>AMRI provides global contract research and manufacturing services to the pharmaceutical and biotechnology industries.</strong> </div>\n<br>\n<strong><div></div></strong>\n<br>\n<div>The Temporary Research Scientist II is an integral part of the AMRI team, contributing to our success by analyzing chemical intermediates and target compounds. The Temporary Research Scientist II is expected to demonstrate expertise in both the theoretical and practical aspects of analytical chemistry. A major component in the scientist’s performance rating will be based on productivity.</div><br>\n\n<div>Join our talented workforce, where a commitment to excellence and a customer focused attitude is everything. We pursue excellence because our work has the power to improve patients’ lives with the pharmaceuticals we develop and manufacture.</div><br>\n\n<div><strong>In this role, you will:</strong></div><div>\n\n\n<ul>\n<li>Conduct laboratory operations in a safe manner. Maintain familiarity with the Chemical Hygiene Plan. Exhibit safety awareness and safe work practices.</li>\n<li>Follow responsible actions regarding chemical disposal. Maintain compliance with all regulations at the federal, state, and local levels, as well as appropriate SOP’s.</li>\n<li>Develop and maintain working knowledge of commonly used spectroscopic and chromatographic procedures. Establish a demonstrated expertise in at least one technique.</li>\n<li>Write analytical method procedures to establish format.</li>\n<li>Write analytical validation reports.</li>\n<li>Use sound judgment and previously acquired knowledge and experience to develop new procedures for new compounds.</li>\n<li>Process samples with the standard procedures effectively and independently. Analyze experimental data for validity before reporting results.</li>\n<li>Use and maintain equipment in a neat and orderly manner. Report any malfunction immediately to supervisor. Repair minor problems. Maintain service and calibration records.</li>\n<li>Keep contemporary, accurate, legible, and complete experimental records in accordance with GMP and GLP practices.</li>\n<li>Use technical and regulatory knowledge and judgment to validate procedures to comply with internal SOPs and regulatory needs with minimal supervision.</li>\n<li>Submit complete, documented, and legible reports of analytical testing. Ensure that data is properly filed and accessible for review in accordance with appropriate SOP’s.</li></ul></div>\n\n<br><h1>Qualifications and background to be successful in this role:</h1> \n<br>\n<div><strong> Required</strong></div>\n\n\n<ul>\n<li>Bachelor’s or Master’s Degree with major in Natural Science or Pharmacy, or equivalent industrial experience</li>\n<li>2-5 years of industry experience</li>\n</ul>\n\n<div>All interested applicants must apply online. AMRI is an Equal Opportunity Employer, we value diversity and inclusiveness. Minorities/females/veterans/individuals with disabilities/sexual orientation/gender identity are encouraged to apply.</div>"}