{"job title": "Senior Data Engineer", "company": "Blinker Inc.", "city state": "– Denver, CO", "rating": "5.0", "job description": "<strong>Why work with us:</strong>\n<br><br>\nBlinker is a Denver-based mobile app that puts people in control of car ownership. We started our company because we believe the used car market has a major consumer problem each year, twenty eight million people in the US buy or sell a car at the dealership and lose thousands of dollars in every transaction. Blinker is the only company that allows anyone to sell a car with a lien, buy a car with financing or refinance a car, all on their own with their mobile device.\n<br><br>\nOur CEO, Rod Buscher, founded Blinker in 2013. Today, Blinker's leadership team carries 170 years of collective automotive and lending experience. Blinker has received over 100,000 downloads and originated millions of dollars in auto loans. Weve also won a 2017 SXSW Interactive Innovation Award, Colorado Biz Top Company Award, Telly Award, as well as been named a Gazelle by the Denver Office of Economic Development and a Colorado Company to Watch.\n<br><br>\nWere looking for talented people to help us scale our business and serve a nationwide audience from our headquarters in downtown Denver. Were a passionate, smart, and driven group, working together to cause some major market disruption. You could be part of that. If youre eager and ready to work alongside inspiring teammates and make a major, positive impact on our business each and every day, we want you to join us.\n<br><br>\n<strong>Summary of what you'll do:</strong>\n<br><br>\nAs a senior data engineer, you will own and architect Blinkers data landscape. You will combine product usage, behavioral, transactional, business systems, and third-party data into the analytics pipeline. You will work closely with our analytics and engineering teams to implement solutions to answer complex questions and drive business decisions.\n<br><br>\n<strong>What is expected of you:</strong>\n\n<ul>\n<li>Hands-on leadership, influence, and development of all things data services.</li>\n<li>Develop modern data architectural approaches for business intelligence reporting and analytics, including that for machine learning models and data science, ensuring effectiveness, scalability, and reliability.</li>\n<li>Design, develop, implement, and optimize existing ETL processes that merge data from disparate sources for consumption by data analysts and scientists, business owners, and decisions makers.</li>\n<li>Complete current evaluation of new ETL software options, propose recommendations, and implement the solution.</li>\n<li>Facilitate data transformation, normalization, cleansing, aggregation, workflow management, and business rule application.</li>\n<li>Detect data quality issues, identify their root causes, implement fixes, and design data audits to capture issues.</li>\n<li>Distill technical requirements into the product development and operational process via continuous collaboration with product, engineering, and analytics team members.</li>\n<li>Influence and communicate with all levels of stakeholders including analysts, developers, business users, and executives.</li>\n<li>Use analytics to influence product development, surfacing data around product usage and customer behavior.</li>\n<li>ETL tool evaluation and implementation to prepare for scaling and efficiency.</li>\n</ul>\n<strong>Your skills and experience:</strong>\n\n<ul>\n<li>2+ years of hands-on experience in collection, mining, reporting, and analysis of large amounts of data</li>\n<li>Experience designing and implementing database tables, as well as performance profiling and tuning of database processes and table usage</li>\n<li>Experience in a variety of data storage platforms (MySQL, Postgres, Oracle, Redshift, RDS)</li>\n<li>Experience as a Data Engineer or related role (Data Warehouse Developer, ETL Developer, Business Intelligence Analytics, Software Engineer) with a track record of manipulating, processing and extracting value from datasets</li>\n<li>Advanced proficiency in SQL</li>\n<li>Experience designing and developing ETL processes in a variety of platforms (Pentaho, Microstrategy, Talend, CloverETL, FiveTran, Stitch)</li>\n<li>Experience with analytics platforms (Google Analytics, Mixpanel, etc.)</li>\n<li>Experience with log aggregation and extraction (Elasticsearch) and Business Intelligence reporting tools (Tableau, etc.) a plus</li>\n<li>Proven track record of innovation and expertise in data engineering</li>\n<li>Tenure in architecting and delivering complex projects</li>\n<li>Deep understanding and application of modern data processing technology and real-time/low-latency data pipeline and ETL architectures</li>\n<li>Strong stakeholder interaction and influence experience at executive, business stakeholder, and engineering team levels</li>\n</ul>\n<strong>Additional Information:</strong>\n\n<ul>\n<li>Blinker Inc. does not currently provide Visa sponsorship</li>\n</ul>\n<strong>What we offer to you:</strong>\n\n<ul>\n<li>Competitive pay + equity</li>\n<li>Paid/flexible time off</li> \n\n<li>Comprehensive medical, dental, vision, disability, life insurance, and parental leave benefits</li>\n<li>401K Plan</li>\n<li>Paid covered parking in Tabor Center garage or RTD transportation</li>\n<li>Fully stocked kitchen with free snacks, beverages, &amp; cold brew coffee on tap</li>\n<li>Regularly recurring, company-side social activities (e.g. BBQ lunches on patio and afternoon happy hours)</li>\n<li>Hackathons</li>\n</ul>"}