{"job title": "Research Scientist", "company": "Eli Lilly and Company", "city state": "– Indianapolis, Indiana", "rating": "3.8", "job description": "<br><b></b><br>Research Scientist<br><br><b></b><br>07-Aug-2018<br><br><b></b><br>05-Dec-2018<br><br><b>Responsibilities</b><br><p>Are you a highly motivated scientist with experience in mass spectrometry or bio-analytical chemistry? Do you have experience in small molecule mass spectrometry as well as biological sample preparation techniques? Lilly Research Laboratories Diabetes and Complication therapeutic area has a role for you. We have an exciting opportunity that will utilize your skills to analyze both preclinical and clinical samples to facilitate drug discovery. Are you looking to join a dynamic team where you can not only contribute both collaboratively but also work independently to drive research? You should have demonstrated experience in LC-MS based metabolomics. If you have prior experience working in the area of endocrinology and its disorders we would encourage you to apply. Experience working with bioinformatics tools for pathway analysis, biomarker discovery and multivariate statistics is a plus. Excellent communication skills and an ability to interact scientifically with other collaborators within Lilly Research Laboratories are critical.</p><p>The main objective of the work is to provide the Diabetes and Complications therapeutic area with high-quality metabolomics data to understand diseases, identify/validate pharmaceutical targets, and discover biomarkers. Work responsibilities may include, but are not limited to,</p><ul><li>Operating and basic maintenance of the mass spectrometers and liquid chromatographic systems (GCTOF, LCTOF, and LCQQQ),</li><li>Bio-analytical method development, data processing, sample preparation, and handling of robotics.</li><li>Supervisory skills would be advantageous as well.</li></ul><br><br><b>Req ID</b><br>43460BR<br><br><b>Additional Skills/Preferences</b><br><ul><li>Demonstrated experience using liquid chromatography-mass spectrometry, particularly using high resolution based mass spectrometers in the area of metabolomics. </li><li>Relevant academic or industrial experience in the metabolomics area.</li><li>Ability to conceive ideas and design experiments independently.</li><li>Excellent written and verbal communication, work planning, data analysis and record keeping skills.</li><li>Ability to work closely with scientists in Diabetes and complications areas, Discovery Chemistry mass spectrometry, biostatistics and bioinformatics.</li></ul><br><br><b>Additional Information</b><br>Lilly is an EEO/Affirmative Action Employer and does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status. .<br><br><b>Title</b><br>Research Scientist-Metabonomics<br><br><b>Job Category</b><br>Science<br><br><b>Basic Qualifications</b><br><ul><li>Ph.D. degree in chemical, biochemical sciences or related discipline</li></ul><br><br><b>Company Overview</b><br>At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 39,000 employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We’re looking for people who are determined to make life better for people around the world.<br> <br><br><b>City</b><br>Indianapolis<br><br><b>Country</b><br>USA <br><br><b>State / Province</b><br>Indiana <br><br><b>Region</b><br>North America<br>"}