{"job title": "Translational Scientist", "company": "Evelo Biosciences", "city state": "– Cambridge, Massachusetts", "rating": "NA", "job description": "<strong><u>Evelo Biosciences is seeking a highly motivated and dedicated Translational Scientist to support our growing organization.</u></strong>\n<br><br>\nThis is an outstanding opportunity to join a fast-paced company leveraging the previously untapped biology of the gut-body network to develop a new class of therapies that could transform the treatment of many major diseases, potentially providing profound benefits to patients and society. Evelo Biosciences is pioneering the development of therapies designed to act on the gut-body network – monoclonal microbials. Monoclonal microbials use naturally evolved pharmacological potential to work in the gut for effects throughout the body. We believe they comprise an entirely new class of effective, convenient and safe medicines to address the unmet needs of huge numbers of patients with serious diseases. As a member of the Evelo team, you will play a vital role in supporting our efforts in developing this new modality of medicine.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Work closely with the Director of Translational Medicine and members of clinical project teams to define translational and biomarker strategy for select indications</li>\n<li>Support preparation of clinical trial documents and regulatory filings, including IRB brochures, IND and IMPD submission, Clinical Protocols and Laboratory Manuals</li>\n<li>Review presentations, regulatory communications and manuscripts</li>\n<li>Drive the design, selection and validation of relevant biomarker assays and oversee their execution in-house and at CROs</li>\n<li>Support biomarker data cleaning and drive data analysis and interpretation for communication to clinical project teams</li>\n<li>Participate in investigator meetings, site visits and clinical trial monitoring</li>\n</ul>\n<strong>Position Requirements:</strong>\n\n<ul>\n<li>PhD in immunology or related discipline with at least 3 years of experience in drug development</li>\n<li>In-depth knowledge and extensive hands-on experience with standard immunology techniques, including flow cytometry, multiplexed cytokine analysis, immunohistochemistry and antigen-specific cellular and ex vivo assays</li>\n<li>Experience with biomarker assay development and conducting translational research</li>\n<li>Excellent written and oral communication skills, attention to detail and sense of urgency</li>\n</ul>\n<strong>About Evelo Biosciences</strong>\n<br><br>\nEvelo Biosciences, Inc. is a clinical-stage biotechnology company developing a new modality of medicine, monoclonal microbials, which are designed to act on the gut-body network. Evelo’s product candidates are orally-delivered, single strains of microbes, selected for their defined pharmacological properties. They are intended to modulate systemic immunology and biology by acting on multiple naturally evolved biological pathways through the gut-body network. Evelo believes that monoclonal microbials have the potential to be broadly applicable across many diseases including immunoinflammatory, cancer, autoimmune, metabolic, neurological and neuroinflammatory diseases.\n<br><br>\nEvelo currently has several for the treatment of inflammatory diseases and for the treatment of cancer, for which ten clinical readouts are expected during 2019 and 2020. Evelo is also advancing additional candidates through preclinical development in other disease areas.\n<br><br>\nFor more information, please visit www.evelobio.com."}