{"job title": "Data Engineer", "company": "Hired by Matrix, Inc.", "city state": "– New York, New York", "rating": "4.5", "job description": "<strong>Job Summary</strong>\n<ul>\n<li>Collecting data from many unique sources we are strongly positioned to derive deep knowledge on our member's behaviors.</li><li>Using this data we can provide improved &amp; personalized experiences for users as well as providing insights to the executive team that will drive the evolution of our company.</li><li>As they rebuild many of their core experiences, they are seeking talented people who are excited to join their team.</li><li>This is a rare opportunity to join a company embracing a modern Technology culture, where you will have the ability to improve people's lives in a very meaningful way and have a major impact on the Company's offerings to their members.</li><li>As reliance on health and wellness awareness increases, you can be part of the team that is leading the way.</li><li>To help them achieve their goals, they are seeking a Data Engineer to join their team.</li>\n</ul>\n<strong>Responsibilities</strong>\n<ul>\n<li>Work closely with our data scientists to help build complex algorithms that provide unique insights into our data.</li><li>Build data pipelines that clean, transform and aggregate data from many different sources.</li><li>Develop models that can be used to make predictions.</li><li>Build complex functions that answer questions for the business.</li><li>Model data at rest and enable powerful data analysis.</li><li>Enable machine learning, natural language processing and other data science methods within the Company.</li><li>Work with engineers across the organization to identify data quality issues in source systems and help keep the data clean.</li><li>Provide solutions that help share data with the enterprise.</li><li>Be an advocate for best practices and continued learning.</li>\n</ul>\n<strong>Qualifications</strong>\n<ul>\n<li>Experience with a Cloud Data Platform such as GCP or AWS\n\n<ul>\n<li>If GCP: Big Query, Cloud Dataflow, Cloud Dataproc, Pub/Sub</li><li>If AWS: Redshift, EMR, Datapipeline, RDS, Lambda ,and Kinesis.</li></ul></li>\n<li>Experience programming in Scala, Python, or Java.</li><li>Experience building data pipelines using Apache Beam or Apache Spark.</li><li>Experience with some of the following data stores: Big Query, Redshift, Postgres, Cassandra, or Mongo.</li>\n</ul>\nIt would be great if you also have:\n<ul>\n<li>Experience with real time streaming solutions such as Kinesis, Pub/Sub, or Kafka.</li><li>Large scale Data Modeling from a Modern Big Data perspective.</li><li>Experience producing and consuming event driven data.</li><li>Experience working on a data team building functions, models and complex algorithms.</li>\n</ul>\n<strong>Please submit your resume for consideration. Once submitted, feel free to contact Adam at 201-226-3531 for additional information.</strong>\n<br><br>\n<strong>Approx. Duration: Perm</strong>\n<br><br>\n<strong>About Hired By Matrix</strong>\n<br><br>\nHired by Matrix, Inc. founded in 1986, is a certified Woman-Owned Business Enterprise (WBE) dedicated to providing the highest quality of job opportunities to our candidates and staffing services to our clients. We are a full service staffing firm with experience recruiting and delivering for IT, Accounting &amp; Finance, Administrative &amp; Clerical, Clinical &amp; Scientific, and Marketing disciplines. Our long history in the staffing industry and dedication to excellence are the key differentiators that have fueled our success for over 30 years.\n<br><br>\nAs the staffing industry evolves, Hired by Matrix continues to develop and grow. By combining our expertise with a keen understanding of each client's needs we are able to source for the most qualified candidates. Our commitment to servicing our clients corresponds with our commitment to finding the perfect match between our clients and candidates and maintaining our relationships long term.\n<br><br>\nHired by Matrix offers our contract professionals competitive salaries, benefits after 60 days and a 401k option after one year.\n<br>\nEqual Opportunity Employer\n<br>\nWBENC Certified\n<br>\nWOSB Certified\n\n\n<ul>\n<li>CEO Sharon Olzerowicz serves on the WBENC Board and is a long-standing member of the Forum Governing Group.</li>\n</ul>\n\nConnect with us on LinkedIn and see how we can impact your career!\n<br><br>\nHired by Matrix Career Center: http://bit.ly/HbMCareers"}