{"job title": "Data Science Professional , Assistant Vice President", "company": "Mitsubishi UFJ Financial Group", "city state": "– Jersey City, NJ", "rating": "3.0", "job description": "Discover your opportunity with Mitsubishi UFJ Financial Group (MUFG), the 5th largest financial group in the world with total assets of over $2.4 trillion (as ranked by SNL Financial, April 2016) and 140,000 colleagues in nearly 50 countries. In the U.S., we're 13,000 strong, working together to positively impact every customer, organization, and community we serve. We achieve this by delivering on our values, putting people first, fostering long-term relationships built on honesty and mutual understanding, and inspiring the best in each other. This is all part of our inclusive, high-performing culture supported by Total Rewards that include our cash balance pension plan. Join a team that's working to fulfill its vision to be the world's most trusted financial group.\n<br><br>\n<strong>Data Science Professional , Assistant Vice President</strong>\n<br><br>\n<strong>Job Summary</strong>\n<br>\nSeeking an enthusiastic technologist to join a first-class group of data technologists within Data &amp; Enterprise Content Management Department in building our Enterprise Data Platform (EDP) within AWS cloud environment. Individuals on this team are self-driven, excited to learn new technologies, and interested in solving challenging problems.\n<br><br>\n<strong>Major Responsibilities</strong>\n\n<ul>\n<li>Develop and build interfaces, data models, and scripts for data capture, data integration/aggregation, and data delivery &amp; consumption.</li> \n\n<li>Utilize APIs to build pipelines and integrations between applications as needed</li> \n\n<li>Build and develop metadata driven solutions for data capture and use</li> \n\n<li>Build data expertise and own data quality for allocated areas of ownership</li> \n\n<li>Apply Continuous Integration/Continuous Delivery (CI/CD) methodologies</li> \n\n<li>Document solutions thoroughly, Practice source code control best practices</li> \n\n<li>Own the DevOps processes involved in Build, Automated test of the models and eventually deployment to production</li> \n\n<li>Support data operations team for critical data processes running in production with a focus to meet SLAs and quality metrics</li> \n\n<li>Architect, implement and deploy new data processes in production</li> \n\n<li>Perform data analysis to generate business insights</li> \n\n<li>Interface with Engineers, Product Managers and Product Analysts to understand product goals and data needs</li> \n\n<li>Clearly communicate results of complex technical work. Maintain high standards for code quality, maintainability, testing, and performance</li>\n</ul>\n\n\n\n<ul>\n<li>Bachelor's degree, in a STEM program required</li> \n\n<li>8+ years of overall application development experience</li> \n\n<li>Proficiency in one (or more) of the following: C/C++, Java, Scala, Python</li> \n\n<li>3-5 years of experience in big data technologies (Spark, Storm, Kafka, Kinesis, Flink, MapReduce, Oozie, etc.)</li> \n\n<li>Hands-on experience architecting and implementing data infrastructure from scratch using platforms such as AWS Redshift</li> \n\n<li>Experience with SQL, NoSQL, Relational Databases, Unstructured Data</li> \n\n<li>Experience with Git version control</li> \n\n<li>Experience using RESTful APIs</li> \n\n<li>Data driven, problem solving skills, lean product development, project mgmt., SDLC methodologies- Agile(Scrum) and Waterfall</li> \n\n<li>Curiosity and creativity, with sound judgment and high degree of both integrity and empathy</li> \n\n<li>Effective written and verbal communication of data-driven solutions across all levels of the organization</li> \n</ul>\nThe above statements are intended to describe the general nature and level of work being performed. They are not intended to be construed as an exhaustive list of all responsibilities duties and skills required of personnel so classified.\n<br><br>\nWe are proud to be an Equal Opportunity / Affirmative Action Employer and committed to leveraging the diverse backgrounds, perspectives, and experience of our workforce to create opportunities for our colleagues and our business. We do not discriminate in employment decisions on the basis of any protected category.\n<br><br>\nA conviction is not an absolute bar to employment. Factors such as the age of the offense, evidence of rehabilitation, seriousness of violation, and job relatedness are considered in all employment decisions. Additionally, it's the bank's policy to only inquire into a candidate's criminal history after an offer has been made. Federal law prohibits banks from employing individuals who have been convicted of, or received a pretrial diversion for, certain offenses."}