{"job title": "Data Analyst", "company": "Square Root", "city state": "– Austin, TX", "rating": "4.6", "job description": "Square Root is built on understanding our customers’ data more deeply than they do. We’re looking for a Data Analyst to be an integral part of that equation. You’ll spend your days nose-deep in data, supporting and learning from a Senior Data Scientist. You’ll collaborate with our Customer Success team, investigating technical issues and data discrepancies. Along the way, you’ll get to work with innovative technologies and great people in a startup culture.\n<br><br>\nSound like your jam? Keep reading!\n<br><br>\n<strong>The Gig</strong>\n\n<ul>\n<li>Assist in rapid customer implementations and data integrations to allow for minimal customer investment and maximum data quality and consistency</li>\n<li>Support our Senior Data Scientists in uncovering insights during customer data exploration</li>\n<li>Collaborate with the Customer Success team to ensure operational stability</li>\n<li>Work directly with our customers to understand business logic and integrate data</li>\n<li>Gain a deep understanding of the automotive and retail industries</li>\n<li>Learn to use cutting edge auto-scaling serverless databases and Elastic Map Reduce</li>\n<li>Implement and automate customer deliverables to include Excel and Looker</li>\n</ul>\n<strong>About You</strong>\n\n<ul>\n<li>You love to dive deep into numbers and statistics</li>\n<li>You understand the importance of patience and attention to detail in partnerships</li>\n<li>You’ve got 1+ years experience working in complex databases using formulas and algorithms</li>\n<li>You’ve got experience using SQL to query, update large databases, and build OLAP structures</li>\n<li>You have experience in customer support</li>\n<li>You’re able to articulate data insights to non-technical customers</li>\n<li>You’re innately curious and fanatical about learning</li>\n</ul>\n<strong>Basics</strong>\n\n<ul>\n<li>Please apply with a cover letter​ that details why you’re a fit for the role and Square Root!</li>\n</ul>\n<strong>Our Radical Culture</strong>\n<br><br>\nOur culture is at the core of everything we do. We have fun, but we work hard. So, as we grow we’re not only looking to hire the best and brightest, but we’re also looking for people that share our values. This is the code we live by:\n\n<ul>\n<li>Think big. Do bigger. Big ideas are meant to be pursued. We have a bias for action, iteration, and impact.</li>\n<li>Be Customer Inspired. Our customers’ toughest challenges inspire us to build innovative software. We delight them by deeply understanding their business and driving results.</li>\n<li>Partner. We’re approachable, dependable, and collaborative. We go above and beyond to help our customers, our partners, and one another succeed.</li>\n<li>Thrive. We revere personal and professional growth. We recognize individuality, embrace authenticity, and celebrate each other’s success.</li>\n</ul>\n<strong>The Good Stuff</strong>\n<br><br>\nFounded in Austin, Texas, we’ve been bootstrapped and profitable since our start in 2006. Along the way we’ve added a slew of benefits + perks inspired by our team of Radicals. Here’s a sample:\n\n<ul>\n<li>Flexibility: no dress code, office hours, or vacation policy</li>\n<li>Competitive benefits and compensation</li>\n<li>Cozy campus of five 1920’s craftsman homes in downtown</li>\n<li>Radicals get $3,000 a year to learn anything (seriously!)</li>\n<li>Team lunches, stocked kitchen + bar, coffee-snob compliant coffee machines</li>\n</ul>\n<em>Square Root is an Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected Veteran status or any other characteristic protected by law.</em><br><br>APPLY"}