{"job title": "RESEARCH SCIENTIST", "company": "University of Washington", "city state": "– Seattle, WA", "rating": "4.1", "job description": "<div> RESEARCH SCIENTIST</div> <div> \n<div> Req #: 158200</div> <div> Department: ALCOHOL &amp; DRUG ABUSE INSTITUTE</div> <div> Job Location: Other Location</div> <div> Job Location Detail: Alcohol and Drug Abuse Institute (ADAI)</div> <div> Posting Date: 08/06/2018</div> <div> Closing Info: Open Until Filled</div> <div> Salary: Salary is commensurate with experience and education</div> <div> Shift: First Shift</div> </div>\n<br>\n <div>\nAs a UW employee, you have a unique opportunity to change lives on our campuses, in our state and around the world. UW employees offer their boundless energy, creative problem solving skills and dedication to build stronger minds and a healthier world.\n<br><br>\nUW faculty and staff also enjoy outstanding benefits, professional growth opportunities and unique resources in an environment noted for diversity, intellectual excitement, artistic pursuits and natural beauty. All of which has allowed the UW to be nationally recognized as a “Great College to Work For” for four consecutive years.\n<br><br>\n<strong>Health Sciences Administration</strong>  has an outstanding opportunity for a <strong>Research Scientist.</strong>\n<br><br>\nRecognizing a need to address the enormous problems caused by alcohol and drug abuse, UW established the Alcohol &amp; Drug Abuse Institute (ADAI) in October, 1973 as an interdisciplinary research center. From its beginning, the mission of ADAI has been to conduct and support substance abuse research at UW, and disseminate research findings on substance abuse.\n<br><br>\nThe ADAI has been the home for the Pacific Northwest Node of the National Institute on Drug Abuse’s National Drug Abuse Treatment Clinical Trials Network (CTN) since 2001. The CTN’s goal is to move substance abuse treatments with demonstrated efficacy into community-based treatment settings to determine their effectiveness when implemented in real-world treatment settings.\n<br><br>\nThe Research Scientist position is at the intersection of substance abuse treatment and HIV prevention. The Research Scientist will function as the National Project Director for two HIV prevention studies in the CTN. One has been funded (http://ctndisseminationlibrary.org/protocols/ctn0082.htm) and is an HIV prevention implementation science survey study designed to identify barriers and facilitators to scaling up Pre-Exposure Phrophylaxis (PrEP) to substance-using men who have sex with men in high-HIV incidence cities in the US. A second study, awaiting funding, is a medication adherence trial of PrEP in substance-using men who have sex with men and in people who inject drugs. This position will work with Lead Investigators at ADAI, Columbia and Yale Universities, and with other Lead Team members, on the development, implementation, and dissemination of the studies. Secondarily, this position may involve work on other opioid-related clinical treatment trials on an as-needed basis. Examples include a rapid buprenorphine induction trial in emergency departments, and an evaluation of rural hub-and-spoke models to deliver medication assisted treatment to people with opioid use disorders in rural Washington.\n<br><br>\n<strong>RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>Project management and oversight of multi-site clinical trials across all phases of the research, including protocol development, implementation, study closeout and dissemination. This includes regulatory management, supervision of RC/RAs, oversight of data collection, development of training materials, consultation as needed on fidelity monitoring, recruitment tracking and troubleshooting, coordination between sites and the national coordinating center, and subsequent collaboration on manuscripts.</li>\n<li>Participate in study-related national conference calls with other Lead Team members and participating site/Node staff.</li>\n<li>Collaborate on preparation of presentations for national meetings</li>\n<li>Be knowledgeable about the details of specific protocols being implemented at participating sites.</li>\n<li>Work collaboratively with the Clinical Coordinating and the Data and Statistics Coordinating Centers to coordinate factors important in the implementation and conduct of clinical trials (i.e., Regulatory Affairs, Quality Assurance, Data, Training).</li>\n<li>Manage the day-to-day research operations of the project(s), including monitoring staff activities at study sites. Troubleshoot recruitment and retention at participating sites and consult with local implementation teams on strategies for attaining recruitment &amp; retention goals. Problem solve accordingly.</li>\n<li>Develop and monitor protocol implementation timelines for on time task completion. Report study progress to Lead Team investigators, and Pacific Northwest Node operations committee on a regular basis.</li>\n<li>Convey general information to research and clinical/administrative staff of participating agencies about the protocols such as goals, hypotheses, working knowledge of protocol, procedures, and staffing needs.</li>\n<li>Attend all Lead Team protocol implementation conference calls, organize and sustain protocol conference calls with local agency staff on an as-needed basis.</li>\n<li>Work with the Clinical Coordinating Center to oversee quality assurance and regulatory affairs for adherence and compliance with human subject and HIPPA regulations at participating agencies.</li>\n<li>Work with the Clinical Coordinating Center to manage IRB correspondence for protocols.</li>\n<li>Assist in planning, preparing, and presenting at protocol training sessions (including travel to such meetings if necessary); ensure completion of local training requirements associated with each protocol.</li>\n</ul>\n\n<strong>REQUIREMENTS:</strong> \n\n\n<ul>\n<li>Master’s degree in social or health sciences.</li>\n<li>3 years of prior experience in substance abuse research; prior experience in increasingly responsible HIV research project coordination and management; skills in collaborative team work; excellent interpersonal and communication skills; attention to detail.</li>\n</ul>\n\nSpecific knowledge, skills and abilities required to perform the job satisfactorily include:\n\n\n<ul>\n<li>Interest in substance abuse treatment related research</li>\n<li>Prior experience with increasing responsibilities in research project coordination and management</li>\n<li>Experience with clinical trials and substance abuse treatment</li>\n<li>Ability to work collaboratively with a team of colleagues</li>\n<li>Excellent interpersonal and communication skills</li>\n<li>Strong writing skills</li>\n<li>Attention to detail</li>\n<li>Ability to proactively identify problems, take initiative, and propose solutions</li>\n<li>Ability to work independently</li>\n</ul>\n\n<strong>Experience as a research assistant/coordinator or other front-line clinical research role</strong>\n<br><br>\nEquivalent education/experience will substitute for all minimum qualifications except when there are legal requirements, such as a license/certification/registration.\n<br><br>\n<strong>DESIRED EXPERIENCE</strong>\n\n\n<ul>\n<li>PhD in social or health sciences.</li>\n<li>Experience with overseeing the conduct of clinical research trials in applied settings; experience participating as a collaborating site in a multisite trial. Supervisory experience in research settings; proficiency with data analysis for clinical experimental design; demonstrated skill in writing for professional publication; experience in grant writing and public speaking.</li>\n</ul>\n\nKnowledge, skills and abilities that are desirable, providing for an enhanced level of job performance, include:\n\n\n<ul>\n<li>Interest in or experience with the intersection of substance abuse and HIV prevention, PrEP, gay/bisexual men, stimulant use, and/or working with agencies that serve these populations</li>\n<li>Experience with overseeing the conduct of clinical trials in applied settings</li>\n<li>Experience participating as a collaborating site in a multi-site trial</li>\n<li>Supervisory experience in research settings</li>\n<li>Proficiency with data analysis for clinical experimental design</li>\n<li>Demonstrated skill in writing for professional publication</li>\n<li>Experience in grant writing, regulatory management, or public speaking</li>\n</ul>\n\nAs a UW employee, you will enjoy generous benefits and work/life programs. For detailed information on Benefits for this position, click here.\n<br><br>\n<strong>Application Process:</strong>\n<br>\nThe application process for UW positions may include completion of a variety of online assessments to obtain additional information that will be used in the evaluation process. These assessments may include Workforce Authorization, Cover Letter and/or others. Any assessments that you need to complete will appear on your screen as soon as you select “Apply to this position”. Once you begin an assessment, it must be completed at that time; if you do not complete the assessment you will be prompted to do so the next time you access your “My Jobs” page. If you select to take it later, it will appear on your \"My Jobs\" page to take when you are ready. <strong>Please note that your application will not be reviewed, and you will not be considered for this position until all required assessments have been completed.</strong></div><br>\n\n<div> <div>The University of Washington is a leader in environmental stewardship &amp; sustainability, and committed to becoming climate neutral.</div><br>\n\n <div>The University of Washington is an equal opportunity, affirmative action employer.\n<br>\n To request disability accommodation in the application process, contact the Disability Services Office at 206-543-6450 / 206-543-6452 (tty) or dso@uw.edu.</div>\n </div> <div> Apply for this job</div>"}