{"job title": "Data Analyst", "company": "", "city state": "– Newport Beach, California", "rating": "NA", "job description": "Data Analyst\n<br><br>\n<strong> Organizational and Role Overview:</strong> \n<br><br>\nHarbor Health Systems (a division of One Call) was founded on the belief that providers with exceptional skills in patient care and business management could greatly reduce the cost of care, complications, and time away from work.\n<br><br>\nTo this end, Harbor Health has created advanced analytics and provider benchmarking that identifies, manages, and measures the best doctors utilizing a proprietary scoring system to ensure the best outcomes for patients.\n<br><br>\nWe are currently seeking a Data Analyst to join the analytics team at Harbor Health to help us showcase the power of data to surface predictive, valuable insights for our clients.\n<br><br>\nThe Data Analyst will work closely with our Research and Development team, Products and BI/Analytics teams.\n<br><br>\n<strong> Responsibilities:</strong> \n<br><br>\nUtilizing tools/technology such as R, SQL, and Tableau, the Data Analyst will analyze large data sets to identify trends, spot any issues with data integrity, and model data as requested for new product development.\n\n<ul>\n<li> Partners effectively with customers to interpret business needs and translates them into application and operational requirements, resolving complex technical and business problems.</li> <li> Produces high quality work deliverables leveraging industry best practices.</li> <li> Adjusts development practices for delivering BI and Data solutions based on the project and client expectations</li> <li> Conducts formal and informal presentations in both small and large group settings within all levels of the organization.</li> <li> Manages multiple tasks/projects simultaneously.</li> <li> Exudes a \"can do\" attitude with a focus on team first.</li> <li> Motivates and guides others to ensure performance is in accordance with clear expectations and goals.</li> <li> Based on experience, may mentor other engineers in developing scalable, secure, high-performance BI and Data solutions</li> \n</ul>\n\n<strong> Requirements:</strong> \n\n<ul>\n<li> Bachelor's degree from an accredited university or college in statistics, computer or relevant statistical analytics experience</li> <li> 3+ years' work experience as a data analyst or in related field</li> <li> Solid aptitude of data-mining, modeling and hypothesis generation in support of high-level business goals.</li> <li> Proficiency in programming in R and/or Python</li> <li> Proficiency in Tableau or similar Analytic platforms.</li> <li> Solid understanding of data driven statistics and principles.</li> <li> Experience with SQL 2008 or higher. Ability to pull, query, and join datasets using SQL Server database technologies</li> <li> Ability to work with stakeholders to assess potential risks</li> <li> Stay abreast of emerging tools and techniques in machine learning, statistical modeling &amp; analytics</li> <li> Ability to translate business requirements into non-technical, lay terms</li> <li> High-level experience in methodologies and processes for managing large scale databases</li> <li> Demonstrated experience in handling large data sets and relational databases.</li> <li> Demonstrated experience working with incomplete data sets and analytical problems.</li> <li> Solid understanding of data driven statistics and principles.</li> \n</ul>\n\n<strong> Desired Skills and Experience:</strong> \n\n<ul>\n<li> Experience in big data technologies, such as Hadoop, Spark, MapReduce is a plus</li> <li> Experience with noSQL, such as Mongo is a plus</li> \n</ul>\n\n<strong>#LI-AA1</strong>\n<br><br>"}