{"job title": "Data Analyst", "company": "Alliance Data", "city state": "– Atlanta, GA", "rating": "3.5", "job description": "<strong>Summary:</strong>\n<br><br>\nThe Analytic Consulting Group partners with both internal and external clients, and data providers, leveraging predictive analytics and advanced statistical techniques to drive strategic thought and effective decision making. The Data Analyst is responsible for conducting data analyses using SAS/SQL and other resources in support of a variety of analytic solutions.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Provide SAS/SQL programming, with detailed direction, in the execution of data analysis that will contribute to the final project deliverables</li>\n<li>Appropriately account for the timeliness and quality of all assignments</li>\n<li>Collaborate with internal stakeholders to manage data logistics - including data transfers, understanding data structures, business rules, etc. - to enable project execution</li>\n<li>QA/QC data and report output to ensure accuracy</li>\n<li>Support the development of reports by providing requisite content</li>\n<li>Participate in presentation of reports to key internal stakeholders, effectively communicating the steps taken to create the output</li>\n<li>Manage multiple projects concurrently</li>\n<li>Monitor project progress relative to timeline and scope</li>\n</ul>\n\n<strong>Minimum Qualifications:</strong>\n\n\n<ul>\n<li>Bachelor's degree in a quantitative discipline (e.g., statistics, economics, mathematics, marketing analytics) or significant relevant coursework</li>\n<li>1-3 years' professional experience with data mining, segmentation, and/or predictive modeling using large, marketing databases</li>\n<li>Demonstrated proficiency in SAS/SQL programming; minimum 2 years</li>\n<li>Working knowledge of MS Office; including PowerPoint, Word, Excel and Outlook</li>\n<li>Strong analytic thought process and ability to interpret findings</li>\n<li>Ability to work on multiple assignments concurrently</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Highly motivated and collaborative team player with strong interpersonal skills</li>\n<li>Acute attention to detail (QA/QC)</li>\n<li>Effective organization and time management skills</li>\n<li>Professional judgment</li>\n</ul>\n\n<strong>Desirable Qualifications:</strong>\n\n\n<ul>\n<li>Advanced degree (Master's/PhD) in Statistics, Economics or other quantitative discipline</li>\n<li>Database marketing experience/knowledge</li>\n<li>Ability to program in newer and emerging languages such as R and Python; working knowledge of Hadoop and other big data technologies</li>\n</ul>\n\nConditions of Employment\n<br><br>\nAll job offers are contingent upon successful completion of certain background checks which unless prohibited by applicable law may include criminal history checks, employment verification, education verification, drug screens, credit checks, DMV checks (for driving positions only) and fingerprinting.\n<br><br>\nGreat People, Deserve Great Benefits\n<br><br>\nWe know that we have some of the brightest and most talented associates in the world, and we believe in rewarding them accordingly. If you work here, expect competitive pay, comprehensive health coverage, and endless opportunities to advance your career. From tuition reimbursement to scholarship programs to employee stock purchase plans and 401(k)s, we offer associates a variety of benefits that work as hard for them as they work for us.\n<br><br>\nAbout Epsilon\n<br><br>\nEpsilon® is an all-encompassing global marketing innovator. We provide unrivaled data intelligence and customer insights, world-class technology including loyalty, email and CRM platforms and data-driven creative, activation and execution. Epsilon's digital media arm, Conversant, is a leader in personalized digital advertising and insights through its proprietary technology and trove of consumer marketing data, delivering digital marketing with unprecedented scale, accuracy and reach through personalized media programs and through CJ Affiliate, one of the world's largest affiliate marketing networks. Together, we bring personalized marketing to consumers across offline and online channels, at moments of interest, that help drive business growth for brands. An Alliance Data* company, Epsilon employs over 8,000 associates in 70 offices worldwide. For more information, visit www.epsilon.com and follow us on Twitter @EpsilonMktg.\n<br><br>\nAlliance Data provides equal employment opportunities without regard to race, color, religion, gender, age, national origin, disability, sexual orientation, gender identity, veteran status or any other characteristic protected by law.\n<br><br>\n<strong>For San Francisco Bay Area:</strong>\n<br><br>\nAlliance Data will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of San Francisco Police Code Sections 4901 - 4919, commonly referred to as the San Francisco Fair Chance Ordinance\n<br><br>\nAlliance Data is an Equal Opportunity Employer.\n<br><br>\nAlliance Data will provide accommodations to applicants needing accommodations to complete the application process.\n<br><br>\nAny applicant offered employment will be required to establish that they are legally authorized to work in the United States for Alliance Data.\n<br><br>\nAlliance Data participates in E-Verify.\n<br><br>\nAlliance Data will consider for employment qualified applicants with criminal and credit histories in a manner consistent with the requirements of all applicable laws, including the City of Los Angeles' Fair Chance Initiative for Hiring Ordinance.\n<br><br>\n<strong>#LI-BW1</strong>"}