{"job title": "Data Analyst", "company": "AvantGarde", "city state": "– Arlington", "rating": "3.9", "job description": "<div>Desired: Microsoft OfficeExcelSharePointThe AvantGarde, LLC (AG)<em>* Data Analyst II</em>* supports the AG Client onsite at the DoD National Guard Bureau (NG) in Arlington, VA.\n<br><br>\nAG offers a comprehensive benefit package including a monthly commuter benefit worth $3,000 annually as well as immediate 401k and medical enrollment.\n\n<ul>\n<li><em>Occasional travel may be required to deliver _Defense Sexual Assault Incident Database (DSAID)</em> training and attending conferences/meetings_</li>\n</ul>\n<strong>Responsibilities</strong>\n<br><br>\n<strong>Administration</strong>:\n\n<ul>\n<li>Provide maintenance for the Sexual Assault Prevention and Response (SAPR) Guard Knowledge Online (GKO) SharePoint site</li>\n<li>Develop and regularly update the SAPR GKO SharePoint web site by auditing state submissions and granting access to TAGs, SARCs and approved leadership to restricted sites</li>\n<li>Maintain a nationwide SAPR personnel directory and the SAPR GKO SharePoint restricted sites report</li>\n<li>Participate in monthly meetings regarding database and SharePoint management, as requested</li>\n<li>Perform Administrator duties for monitoring, updating, deleting DoD Safe Helpline Accounts and DSAID Accounts as required</li>\n<li>Monitor Department of Defense Sexual Assault Advocate Certification Program (D-SAACP) re-certification packet compliance</li>\n<li>Audit D-SAACP Certification process to ensure SAPR personnel attain D-SAACP certification prior to granting them access to DSAID</li>\n<li>Resolve DSAID issues at the lowest level with NG DSAID Program Managers</li>\n<li>Provide current correspondence to the field on DSAID webinars, product upgrades and changes to frequently asked questions regarding DSAID for the NG</li>\n</ul>\n<strong>Analysis</strong>:\n\n<ul>\n<li>Analyze data extracted from DSAID to create reports and charts, such as the Stop light or Dash Board data report, to help inform senior leadership of trends</li>\n<li>Audit D-SAACP Certification process to ensure SAPR personnel attain D-SAACP certification prior to granting them access to DSAID</li>\n</ul>\n<strong>Reporting</strong>:\n\n<ul>\n<li>Gathering, reviewing for accuracy, and preparing data metrics reports for senior leadership</li>\n<li>Develop, assist, and facilitate data collection sites and tracking mechanism on SAPR GKO SharePoint for the quarterly retaliation data call and Annual Report of Sexual Assaults in the Military data call and other data call reports as required</li>\n</ul>\n<strong>Training</strong>:\n\n<ul>\n<li>Administration and delivery of training of the NG DSAID</li>\n<li>Assist the 54 States and Territories by scheduling and conducting NG DSAID training, providing a training certificate, and granting initial DSAID access upon completion of all requirements.</li>\n<li>Assist in conducting annual Refresher training and initial training, as requested</li>\n</ul>\n<strong>Minimum Qualifications</strong>:\n\n<ul>\n<li>Bachelors degree required, Information Systems, Business, Finance, or similar focus area</li>\n<li>Experience working with military SAPR program desired</li>\n<li>Minimum of 2 years working with Microsoft Office products, specifically Access, Excel, and SharePoint, SharePoint designer (desired).</li>\n<li>Advanced Excel Skills desired</li>\n<li>Excellent analytical skills with specific attention to detail.</li>\n<li>Excellent, demonstrated customer service skills</li>\n<li>Must have exceptional organizational skills and able to handle multiple priorities.</li>\n</ul>\n<strong>Other Qualifications</strong>\n\n<ul>\n<li>Ability to travel up to 10%</li>\n<li>Must be able to work onsite in Alexandria, VA</li>\n<li>Must be able to obtain a Public Trust clearance required by the client</li>\n</ul>\n<strong>ABOUT AvantGarde</strong>\n<br><br>\nAvantGarde, LLC, a rapidly expanding Certified 8(a) firm, offers a unique set of integrated consulting services and tools in Human Capital Management, Organizational Development, Business Operations Support, and Information Technology. We partner with clients and bring deep and broad-based expertise with the best industry practices delivering personalized solutions that overcome our clients most pressing People, Process, Strategy and Technology problems. Visit our website at www.avantgarde4usa.com to learn more about the company, our opportunities, and benefits.</div>"}