{"job title": "Data Analyst", "company": "BDO USA", "city state": "– McLean, Virginia", "rating": "3.4", "job description": "<div>Auto req ID 13416BR </div><div> Posting Title Data Analyst </div><div> Multiple Locations Greater Washington D.C. </div><div> Address 1 8401 Greensboro Drive </div><div> Address 2 Suite 800 </div><div> City McLean </div><div> State Virginia </div><div> Zip Code 22102 </div><div> Job Summary BDO’s Core Purpose is Helping People Thrive Every Day. Our Core Values reflect how we manage our work, our relationships and ourselves. As an employee of the firm, you will live true to our Core Values of people first, being exceptional every day in every way, embracing change, feeling empowered through knowledge and choosing accountability. Our Core Values are the standards by which we conduct ourselves day in and day out, both internally and externally.\n<br>\n<br>\n<br>The Data Analyst will be responsible for assisting with data analytics and research projects supporting multiple practices within BDO. In this role, the Data Analyst will normalize disparate datasets from client’s current and legacy business systems into a single business intelligence to aid in the creation of client deliverables. This position will aid in the design and development of software to further improve efficiencies of the data analytics team. </div><div> Qualifications Education:\n<br>- Bachelor’s degree in Finance, Accounting, Business Administration or other relevant field, required\n<br>\n<br>Experience:\n<br>- Relevant internship experience, preferred\n<br>\n<br>Software:\n<br>- Proficient with Microsoft Office Suite, specifically Excel, Access, PowerPoint and Word, required\n<br>- Experience with Microsoft SQL Server, SharePoint and Dynamics, preferred\n<br>\n<br>Other Knowledge, Skills &amp; Abilities:\n<br>- Knowledge of Private Equity, Venture Capital and/or Investment Banking industries\n<br>- Excellent verbal and written communication and presentation skills\n<br>- Strong knowledge of accounting/industry \n<br>- Ability to interact effectively with people at all organizational levels of the firm \n<br>- Ability to work in a demanding, deadline-driven environment while working on multiple projects simultaneously \n<br>- Ability to successfully multi-task while working independently or within a team environment\n<br>- Ability to interpret and fulfill ad hoc requests across all divisions and levels of the firm </div><div> <div></div></div>"}