{"job title": "Data Analyst", "company": "Blue &amp; Co, LLC", "city state": "– Indianapolis", "rating": "3.6", "job description": "The Healthcare Data Analyst will work alongside our IT Analytical Team, providing critical data analysis/administration on client projects involving large sets of data, including massive databases. As our analyst/administrator, you will play a key role interpreting and comparing data, cross-referencing databases to find hits, and extracting data to support decision making, report findings, and discover additional opportunities to assist clients.\n<br><br>\nKey Responsibilities:\n\n\n<ul>\n<li>Perform complex analytics on large datasets- Create and maintain interactive dashboards- Perform ad-hoc queries and data analysis- Act as a steward over data integrity, ensuring data is accurate and up-to-date- Document code and business logic\n<br><br>\n<strong>Required Skills</strong>:</li>\n<li>1+ years hands-on experience in a language such as ACL, R, MATLAB, SAS, STATA, VBA, etc. Strong data wrangling/transformation skills- Strong knowledge of statistics, including hypothesis testing and linear models- Good working knowledge of SQL (writing queries, performing joins, etc.)- Experience with MySQL, Oracle, MS SQL Server, or any other common RDBMS- Excellent independent problem solving skills- Desire to learn new analytic tools and acquire in-depth knowledge of the Healthcare industry- Strong working knowledge of MS Office Suite, particularly Excel\n<br><br>\nPreferred Skills:</li>\n<li>Experience implementing and creating algorithms- Knowledge of HIPAA regulation and compliance- Knowledge of EDI X12 standards, including 837/835 and 270/271- Experience with AWS- Experience with R Shiny or similar- Experience with an ETL system like Talend- Work or internship experience in audit, consulting, or another professional services industry\n<br><br>\nQualifications:</li>\n<li>Bachelors degree preferably in computer science, business, economics, statistics or a math-related major- 1+ years of experience in similar role with a focus in statistics and analytics (filters, unique calculations, queries, etc.) in a consulting firm or similar professional business setting- Keen aptitude in analyzing, interpreting and communicating outputs, including those of large data sets, from both internal client perspective- Strong written and oral communication skills- Professional presence- Organizational and time management skills; self-starter; independent worker\n<br><br>\nWhy Blue?</li>\n</ul>\n\nSee what our employees think at http://www.blueandco.com/careers.html andhttp://www.blueandco.com/lifeblue.html.\n<br><br>\nWe pride ourselves in developing our talent from within and offer excellent ongoing training and mentoring to help you reach your career goals. Blue offers a highly competitive compensation and benefits package, business casual work environment, an ideal work-life balance and open-door access to our directors. This is a career opportunity, not just a job!\n<br><br>\nWe will not sponsor an employment related visa for this position. A background check will be required for employment in this position. Blue is an EOE/AA employer. M/F/D/V. All individuals, including minorities, women, individuals with disabilities, and veterans are encouraged to apply. No phone calls please. Agency candidates will not be considered for this position._**"}