{"job title": "Data Analyst", "company": "CSSI Inc.", "city state": "– Washington, DC", "rating": "3.3", "job description": "<div> Requisition Number 18-0041</div> <div> Post Date 8/20/2018</div> <div> Title Data Analyst</div> <div> City Washington</div> <div> State DC</div> <div> Description ***Please note - this position is contingent upon contract award***\n<br><br>\nCSSI, is a leading provider of transportation and mobility solution to government and commercial clients, is seeking a Data Analyst for an upcoming opportunity in Washington, DC. The successful candidate will be part of a team supporting the continued evolution,\n<br>\n development, and application of multiple of aviation databases in order to benchmark NAS performance, especially in relation to other comparable ATC/ATM systems. In addition, the candidate will help develop and apply analytical tools in order to identify trends\n<br>\n and to report those trends to FAA and the airline industry. The successful candidate must be able to work in a team environment with a diverse group of stakeholders.\n<br><br>\n<strong>Minimum Qualifications:</strong>\n\n\n<ul>\n<li>Ability to analyze data, recognize errors, diagnose causes, and develop plans for error correction</li>\n<li>Experience in database management, ETL procedures, and data/system architectures</li>\n<li>Knowledge and skills to develop defensible mathematical models for NAS system performance</li>\n<li>Willingness to learn and enthusiasm for solving interesting, impactful, national problems</li>\n<li>Strong written and verbal communications skills and proven ability to work effectively in a diverse and dynamic R&amp;D environment</li>\n</ul>\n\n<strong>Desired Qualifications:</strong>\n\n\n<ul>\n<li>Experience in the field of aviation and air traffic control operations is desired, particularly from the perspective of data analysis</li>\n<li>Strong computing skills, relating to data manipulation, analysis, and master data management</li>\n<li>Experience with Python, Java and one or more other high level languages such as C#, C++</li>\n<li>Knowledge and experience with data visualization tools such as Tableau and ArcGIS</li>\n<li>Familiarity with FAA flight and trajectory databases such as Aviation System Performance Metrics (ASPM), Traffic Flow Management System (TFMS), Performance Data Analysis and Reporting System (PDARS), National Offload Program (NOP) radar data, Terminal Arrival\n</li>\n\n</ul>\n\nEfficiency Rate (TAER)\n\n\n<ul>\n<li>Ability to apply statistical analysis techniques and tools where needed</li>\n<li>Familiarity with modeling and simulation tools and methods, including programming experience in Matlab, R, or other modeling tools/languages</li>\n<li>Strong abilities in critical thinking, technical writing, and delivering oral presentation</li>\n</ul>\n\n<strong>Educational Requirements:</strong>\n\n\n<ul>\n<li>Six (6) years of relevant experience with a Bachelor's Degree; Three (3) years of relevant experience with a Master’s Degree; Zero (0) years of relevant experience with a PhD in Engineering, Computer Science, or related technical field.</li>\n</ul>\n\n<strong>About CSSI:</strong>\n<br><br>\nCSSI, Inc. is a technical and engineering services company headquartered near L’Enfant Plaza in Washington, DC, with additional offices along the Eastern Seaboard. CSSI has been solving challenging problems for the FAA, the DoD and NASA for over 25 years. With\n<br>\n nearly 200 employees, CSSI offers challenging work, a comprehensive benefits package, and a collegial environment.\n<br><br>\nCSSI is an equal opportunity employer and considers qualified applicants for employment without regard to race, color, ethnic background, religion, sex, sexual orientation, marital status, age, physical impairment, veteran status, or other characteristic protected\n<br>\n by law.\n<br><br>\nThis position is located in Washington, DC and relocation compensation is not available for this position.</div>\n<br>\n<div>\n\n\n<ul>\n<li>Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities.</li><li>Please view Equal Employment Opportunity Posters provided by OFCCP \n<br>\nhere.</li><li>The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access\n<br>\n to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure\n<br>\n is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information. 41\n<br>\n CFR 60-1.35(c)</li></ul></div>\n<br>"}