{"job title": "Data Analyst", "company": "Delaware County Memorial Hospital", "city state": "– Springfield, PA", "rating": "3.4", "job description": "Gathers and analyzes healthcare data from multiple sources to accomplish goals (e.g. financial, clinical, operational, utilization, market). To succeed in this role you should be analytical and resourceful. Requires excellent communicator, who's able to tell the story behind raw data to non-technical audiences. Must have experience in the healthcare industry. The goal is to help the system grow profitably and measurably impact our clinical and business enterprise.\n<br><br>\n<strong>DUTIES AND RESPONSIBILITIES</strong>\n\n\n<ul>\n<li>Gather and integrate data from disparate sources.</li>\n<li>Build models and analyze data to determine feasibilities and enterprise impacts. Complete new business pro formas with demand modeling.</li>\n<li>Experience and success in working with data visualization tools. Presents and explains information in actionable and clear ways that are meaningful to the customer.</li>\n<li>Create and validate record-keeping processes and/or implement other forms of QA. Very detailed and focused on data integrity of product.</li>\n<li>Pull and integrate data from disparate sources (e.g. cost accounting, data warehouse,market data). Evaluate and process raw information and transform into a high quality analytical product.</li>\n<li>Outstanding organizational and problem-solving aptitude. Ability to synthesize information and produce project deliverables quickly.</li>\n<li>Build models that capture a wide range of health care inputs.</li>\n<li>Collaborate with management and internal teams to successfully achieve CKHS business development and related growth objectives</li>\n</ul>\n\n<strong>QUALIFICATIONS</strong> \n\n\n<ul>\n<li>MBA or Master's degree in finance or health information desired.</li>\n<li>BS degree in relevant field required (Finance, Health Information, Quantitative Economics, Statistics, Mathematics or related field.)</li>\n<li>Proven experience as a Healthcare Data Analyst.</li>\n<li>3+ years of experience in healthcare acquisitions, strategy/business development, operations or financial management in a health care organization.</li>\n<li>Must be highly analytical both at a broad strategic level as well as detailed operational level.</li>\n</ul>"}