{"job title": "Data Analyst", "company": "Epiq Systems, Inc.", "city state": "– Durham, NC", "rating": "2.5", "job description": "It's fun to work at a company where people truly believe in what they are doing!\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nThe Deal Attribution Analyst will work with Sales Finance to calculate the quarterly quota attainment for Sales Reps.\n<br><br>\n<strong>Job Responsibilities:</strong>\n\n\n<ul>\n<li>Serve as primary point of contact for sales reps with questions regarding their sales bonus</li>\n<li>Liaise with Finance Operations, Sales Ops, HR, and Comp contacts to resolve issues with inputs used to calculate sales bonuses. Work with our partners in a positive, productive way that encourages collaboration.</li>\n<li>Use Google Sheets and query language to access large data files and databases to locate deal booking information and help troubleshoot deal ownership disputes</li>\n<li>Identify common problems and concerns across sales reps and help brainstorm potential solutions</li>\n<li>Help enhance and maintain customer relationship management tools on behalf of Sales team</li>\n<li>Help enhance and maintain customer service procedures for Sales Operations team</li>\n</ul>\n\n<strong>Minimum Requirements:</strong>\n\n\n<ul>\n<li>BS/BA degree</li>\n<li>2-3 years of experience in customer service or operations</li>\n<li>Familiar with SQL or another database query language</li>\n<li>Fluent in MS Excel</li>\n<li>Strong written and verbal communication skills in English</li>\n<li>Proven ability to maintain confidentiality</li>\n<li>Ability to work for any US employer (we do not provide visa sponsorship) Preferred Requirements:</li>\n<li>Experience in sales operations or sales compensation</li>\n<li>Attention to detail with the ability to effectively multitask and work independently</li>\n<li>Proven ability to turn frustrated customers into happy customers</li>\n<li>Forensic skills, ie, ability to analyze data pieces and identify best solution given business and systems context</li>\n</ul>\n\nIf you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us!\n<br><br>\nEpiq and its affiliated companies are Equal Opportunity Employers (EOE). Qualified applicants are considered for employment without regard to age, race, color, creed, religion, sex, national origin, sexual orientation, disability, marital or veteran status or any other category protected under applicable federal, state or local law. In addition Epiq will take affirmative action for minorities, women, covered veterans and individuals with disabilities. If you need assistance or an accommodation during the application process because of a disability, it is available upon request. Epiq is pleased to provide such assistance and no applicant will be penalized as a result of such a request. Pursuant to relevant law, where applicable, Epiq will consider for employment qualified applicants with arrest and conviction records."}