{"job title": "Data Analyst", "company": "ICF", "city state": "– Atlanta, GA", "rating": "3.6", "job description": "<u><strong>Working at ICF</strong></u><br><br>Working at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you’re seeking to make a difference in the world, visit www.icf.com/careers to find your next career. ICF—together for tomorrow.<br><br><strong>Health, Environment, Analytics, Resilience &amp; Social Policy</strong>\n<br><br>\n<strong>Health, Research, Informatics and Technology</strong>\n<br><br>\n<strong>Atlanta, GA</strong>\n<br><br>\nAre you passionate about improving quality of life through disease prevention and health promotion? Then consider ICF. We work at the forefront of today’s global health issues, helping clients understand the specific needs of diverse populations and address complex health challenges with behavior and disease surveillance and monitoring, research and surveys, training and technical assistance, and informatics and systems.\n<br><br>\n<u><strong>Job Description:</strong></u>\n<br><br>\nICF has an opening for a Data Analyst. Performing in the role of a Syndromic Data Analyst II, in conjunction with CDC staff. The analyst shall analyze, or interpret BioSense Platform data utilizing ESSENCE software deployed on the Platform, SAS and/or RStudio, and may be required to leverage external information sources, such as public health event reports, for interpretation of analytical results. The Syndromic Data Analyst may be required to produce and analyze reports, identify topics for analysis, conduct ad hoc investigations or analyses to be included in standard reports. The Syndromic Data Analyst will need the ability to quickly comprehend public health threats and leverage available analysis tools against existing BioSense Platform data sources to meet situation awareness reporting needs, and share expertise with other programmers and staff members. Duties will include:\n<ul>\n<li>Monitoring daily analytic output of the syndromic surveillance systems hosted in the BioSense Platform environment utilizing the ESSENCE interface and other analytic tools (SAS, R, SQL) to identify and characterize potential public health events of interest.</li><li>Performing “Enhanced Surveillance” analysis and report generation to support CDC needs for event-specific surveillance utilizing CDC-provided reporting formats or templates.</li><li>Supporting the CDC and NSSP during events such as declared public health emergencies, Events of National Significance or environmental threats to public health.</li><li>Closely collaborate with NSSP, CDC program, or jurisdictional partner staff as needed to provide syndromic surveillance support that may include reports and analysis.</li><li>Participate/collaborate with NSSP, CDC program staff to produce analysis and reports for publication.</li><li>Perform in a Syndromic Surveillance leadership role to guide and instruct other staff in syndromic surveillance.</li>\n</ul>\n<u><strong>Basic Qualifications:</strong></u>\n<ul>\n<li>Masters in Public Health</li><li>2 years of experience in Epidemiology</li><li>2 years of Survey Research experience</li>\n</ul>\n<u><strong>Professional Skills:</strong></u>\n<ul>\n<li>Ability to work independently</li><li>Strong analytical, problem-solving and decision making capabilities based on use of data</li><li>Excellent English verbal and written communication skills</li><li>Demonstrated ability to work effectively in cross-cultural situations and developing country environments</li><li>Proficiency in MS Office Applications (Word, PowerPoint, Outlook, Excel)</li>\n</ul>\nICF offers an excellent benefits package, an award winning talent development program, and fosters a highly skilled, energized and empowered workforce.\n<br><br>\nICF is an equal opportunity employer that values diversity at all levels. (EOE – Minorities/Females/ Protected Veterans Status/Disability Status/Sexual Orientation/Gender Identity)\n<br><br>\n<strong>Working at ICF</strong>\n<br><br>\nWorking at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. ICF—together for tomorrow.\n<br><br>\n<strong>About ICF</strong>\n<br><br>\nICF (NASDAQ:ICFI) is a global consulting and technology services provider with more than 5,000 professionals focused on making big things possible for our clients. We are business analysts, policy specialists, technologists, researchers, digital strategists, social scientists and creatives. Since 1969, government and commercial clients have worked with ICF to overcome their toughest challenges on issues that matter profoundly to their success. Come engage with us at icf.com.<br><br>Georgia Client Office (GA88)"}