{"job title": "Data Analyst", "company": "JPMorgan Chase&amp;Co.", "city state": "– Wilmington, DE", "rating": "3.8", "job description": "Apply Now\n<br><br>\nData Analyst\n<br><br>\nReq #: 180069538_1\n<br><br>\nLocation: Wilmington, DE,US\n<br><br>\nJob Category: Digital\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\n<strong>Chase:</strong>\n<br><br>\nChase is the U.S. consumer and commercial banking business of JPMorgan Chase&amp;Co. (NYSE: JPM), a leading global financial services firm with assets of $2.5 trillion and operationsworldwide. Chase serves nearly half of America's households with a broad range of financial services, including personal banking, credit cards, mortgages, auto financing, investment advice, small business loans and payment processing. Customers can choose how and where they want to bank: 5,200 branches, 16,000 ATMs, mobile, online and by phone. For more information, go to Chase.com.\n<br><br>\nChase is undertaking an aggressive digital transformation agenda, which builds on the success of the current mobile and online service offerings. Chase is investing in innovative ways to deepen customer engagement and profitability through the use of digital channels. The ambition is to position Chase as the undisputed leader in digital financial services and payments and to enable Chase to deliver the highly personalized, real time experiences that customers increasingly expect.\n<br><br>\n<strong>The Role:</strong>\n<br><br>\nDigital Analytics is tasked with measuring and analyzing the current customer experience when using the bank's web and mobile products and to provide actionable recommendations to enhance the consumer experience in order to build long term, profitable customer relationships.\n<br><br>\nThis Data Analyst role will be responsible for delivering against the Digital Analytics agenda and working with partners in Digital and across the Consumer Bank. Key constituents will include Digital Management, Product Management, Customer Experience Design, the various consumer lines of business, risk, compliance, and controls.\n<br><br>\nAs a Data Analyst, you will work as a member of a cross-functional team to improve the online and mobile experience for our customers. You will be responsible for building relationships with Product partners and delivering actionable Business Intelligence in clear and compelling terms. You'll have a passion for data visualization and deep analytical understanding.\n<br><br>\n<strong>Responsibilities include:</strong>\n\n\n<ul>\n<li>Work with partners across Digital functions and LOB's to provide data driven insights in support Digital strategic direction and growth</li>\n<li>Provide consultative support for Digital Product partners driven by fact-based findings</li>\n<li>Evolve and refine measurement frameworks and KPIs for Online and Mobile Customer Measurement</li>\n<li>Provide analysis and associated data visualization and story-telling</li>\n<li>Focus and prioritize the analytics agenda to align with overall strategy and business value</li>\n<li>Collaborate within Digital Analytics to enhance the quality and value of team deliverables</li>\n<li>Work with Data Services and Core Analytics partners to enhance overall performance of Digital Analytics team</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>3-5 years relevant experience analyzing online and mobile customer experiences</li>\n<li>Demonstrated ability to define business KPIs and establish measurement frameworks</li>\n<li>Structured thinker with passion for analyzing results and digging deeper</li>\n<li>Hands on experience with behavioral and transactional analytics tools and techniques</li>\n<li>Experience working with Business Intelligence (BI) platforms to deliver reports and scorecards</li>\n<li>Experience with Tableau, Adobe Data Workbench, and SQL preferred</li>\n<li>Ability to communicate effectively with executives, business partners, and technical resources in analytics and data management</li>\n<li>Post MBA Strategy and/ or Management Consulting experience preferred</li>\n<li>An understanding of social media trends and changes in the digital products/services space</li>\n<li>Ability and desire to work in a start-up paced environment and culture</li>\n</ul>"}