{"job title": "Data Analyst", "company": "New York Blood Center", "city state": "– US-NY-New York", "rating": "2.9", "job description": "Overview<br><br>At <strong>New York Blood Center</strong>, one of the most comprehensive blood centers in the world, our focus is on cultivating excellence by merging cutting-edge innovation with diligent customer service, groundbreaking research, and comprehensive program and service development. Join us as we work towards meeting and exceeding the growing needs of our diverse communities, further our lifesaving strategic goals in a rapidly changing environment, and expand our impact on the local, national, and global communities we serve.<br><br>Responsibilities<br><br>As an integral member of our team, you will oversee the data analysis of core business data domains, including studying donor behavior, donations, deferrals, test results and medical questionnaires.\n<br><br>\n<strong>Responsibilities include:</strong>\n\n<ul>\n\n <li><strong>Performing analyses on data</strong></li>\n<li><strong>Conducting relevant research and documenting all findings</strong></li>\n<li><strong>Working closely with cross-functional teams of analysts, product owners, marketers, designers, and others across the company who are passionate about data</strong></li>\n<li><strong>Communicating data-driven insight and making recommendations to the Analytics team and key stakeholders</strong></li>\n<li><strong>Documenting requirements and specifications</strong></li>\n<li><strong>Handling other related functions as necessary</strong></li>\n</ul>\n\nQualifications<br><br>Successful candidate will have a Bachelor’s Degree in Science, Computer Science, Statistics, Economics, Mathematics or related quantitative discipline, and possess 1 year of data analysis or related experience. The ability to perform analysis utilizing datasets, including basic technical competence with SQL, Python, Perl, Java, or R will be expected, as will the ability to identify and analyze problems and effectively develop/implement alternative solutions. Superior oral/written communication, decision-making, multitasking, PC, and organizational skills are all essential."}