{"job title": "Data Analyst", "company": "Odecee", "city state": "– Dallas, Texas, United States", "rating": "3.0", "job description": "<br>\n\n<div><div><strong><u>Business Analyst</u></strong></div><br>\n\n<div><strong>Job responsibilities:</strong> </div>\n\n<ul>\n<li>Act as a liaison between IT\n<br>\nteams and business teams</li> <li>Possess an in-depth\n<br>\nunderstanding of the various business units within the organization as well as\n<br>\nan understanding of the IT organization’s systems and capabilities</li> <li>Ability to lead\n<br>\nrequirements gathering, future state design and fit-gap analysis workshops with\n<br>\nbusiness stakeholders</li> <li>Determines operational\n<br>\nobjectives by studying business functions; gathering information; evaluating\n<br>\noutput requirements and formats.</li> <li>Designs future state by\n<br>\nanalyzing requirements; constructing workflow charts and diagrams; studying\n<br>\nsystem capabilities</li> <li>Assess and develop high\n<br>\nlevel requirements docs for project and communicate in writing or in meetings\n<br>\nwith development team.</li> <li>User testing management for\n<br>\nassigned projects, as applicable; development of consolidated user test plans,\n<br>\nexecuting those test plans and obtaining appropriate sign off from user\n<br>\nmanagers</li> \n</ul>\n\n<strong><div>Experience:</div>\n\n<br></strong>\n\n<ul>\n<li>Total experience of 5 to 8\n<br>\nyears</li> <li>Experience in requirement\n<br>\nelicitation techniques, JAD, Interviews and documentation (BRDs, Functional\n<br>\n&amp; Technical specifications, Use cases)</li> <li>Working knowledge of data\n<br>\nanalysis tools &amp; Top notch analytical skills</li> <li>Working knowledge of\n<br>\nrelevant SDLC methodologies such as Waterfall or Agile</li> \n</ul>\n\n<div><strong>Skills</strong> </div>\n\n<ul>\n<li>Excellent Interpersonal\n<br>\nskills coupled with excellent verbal and written communication skills</li><li>Excellent Knowledge of\n<br>\nDelivery and Process improvement Methodologies.</li> \n</ul>\nJob Location : Dallas, Texas, United States\n<br><br>\nEmployee Status : Contractor\n<br><br>\nShift : Day Job\n<br><br>\nTravel : No\n<br><br>\nJob Posting : Sep 17 2018\n<br><br>\nCognizant US Corporation is an Equal Opportunity Employer Minority/Female/Disability/Veteran. If you require accessibility assistance applying for open positions in the US, please send an email with your request to CareersNA2@cognizant.com\n<br><br>\nAbout Cognizant<br>\n<div>Cognizant is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant, a member of the NASDAQ-100, is ranked 195 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us on Twitter: USJobsCognizant.</div> <div>Cognizant is recognized as a Military Friendly Employer and is a coalition member of the Veteran Jobs Mission. Our Cognizant Veterans Network assists Veterans in building and growing a career at Cognizant that allows them to leverage the leadership, loyalty, integrity, and commitment to excellence instilled in them through participation in military service.</div></div>"}