{"job title": "Data Analyst", "company": "SBM Management Services", "city state": "– McClellan Park, CA", "rating": "2.8", "job description": "<div>\n<div>\nJob Description<br><br>SBM Management&nbsp;is searching for a <strong>Data Analyst</strong>. The Data Analyst is responsible for designing, developing, implementing and supporting solutions to address some of the company’s unique challenges using third-party and in-house technologies which will handle the growing business needs.<br><br><strong>\n\n\n\nResponsibilities</strong>\n\n\n\n\n\n\n\n\n\n\n<ul>\n<li>Develop reporting requirements and specifications with business and development teams</li><li>Design and implement reporting solutions enabling stakeholders to manage the business and make effective decisions</li><li>Conduct ad hoc data analysis and data quality investigations</li><li>Design data solutions with ETL using different tools, SQL queries, triggers, joins, with data mapping, integration, migration, cleansing / scrubbing, for analysis, reporting and presentation using spreadsheets, flat file, XML, CSV, MS-Access, Oracle and MS-SQL databases among others</li><li>Create dashboards and reports using reporting, analytics &amp; BI tools such as SSRS, Birst etc.</li><li>Support cross-functional teams on the day-to-day execution of projects and initiatives</li><li>Communicating progress and direction within the team, stakeholders and leadership team</li><li>Recommend business actions based on analytical findings, define new metrics, techniques, and strategies to improve performance</li><li>Develop and deploy predictive &amp; prescriptive models to answer key business questions</li><li>Work closely with senior leadership to understand business challenges, and provide data/analysis for better decision making</li><li>Communicate complex analysis and insights to senior leaders, both verbally and in writing</li><li>Perform other duties and projects as assigned</li>\n</ul>\n</div><br>\n\n<div>\n<div>\nJob Requirements\n\n<ul>\n<li>Bachelor's degree (B. A.) from four-year College or university; or one to two years related experience and/or training; or equivalent combination of education and experience.</li>\n<li>Ability to speak effectively before groups of customers or employees of organization.</li>\n<li>Ability to solve practical problems and deal with a variety of concrete variables in situations where only limited standardization exists.</li>\n<li>To perform this job successfully, an individual should have knowledge of Database software; Design software; Development software; Spreadsheet software and Word Processing software.</li>\n\n</ul>\nAvailable Shift: Full Time\n<br><br>\nCompensation: Depends on experience&nbsp;</div>\n</div>\n\n<br></div>"}