{"job title": "Data Analyst", "company": "T. D. Williamson", "city state": "– US-UT-Salt Lake City", "rating": "3.3", "job description": "Overview<br><br>Accurately interpret, evaluate, and convey inspection vehicle data to facilitate on-going safe operation of pipelines.<br><br>Responsibilities\n\n\n<ul>\n\n <li>Performs initial run checks to ensure inspection data meet clients’ minimum specifications within contractual requirements, </li> \n\n<li>Identifies all instances of metal loss for the inspected pipeline length, </li> \n\n<li>Determines all pipeline features, fittings and locations in order to provide a comprehensive customer report, </li> \n\n<li>Collates and documents all quality checked inspection data in order to produce a comprehensive overview of the pipeline integrity per client-specified standards; </li> \n\n<li>Completes assigned online training modules and participates in classroom/workshop sessions to gain experience in Pipeline Inspection Technology Level II and Level II QC material, </li> \n\n<li>Acquires knowledge and skills necessary to obtain the industry standard Data Analyst Level II, in compliance with industry standard, </li> \n\n<li>As a Level II DA, works toward Senior Data Analyst once requirements set forth in TDW procedure D1306 Qualified QC Analyst are met, </li> \n\n<li>Coordinates with the software development team in areas of fault finding and possible methods of process improvement, </li> \n\n<li>Updates job tracking methods and monitors own work to ensure timely project milestone completion, </li> \n\n<li>Attends scheduled meetings and trainings to ensure adherence to current TDW initiatives and processes, </li> \n\n<li>Maintains applicable knowledge of TDW standards and industry practices for use in the absence of client-defined values.</li>\n</ul>\n\nQualifications\n\n\n<ul>\n\n <li>High School Diploma required; Bachelor’s Degree preferred, </li> \n\n<li>Certification level corresponding to a minimum of Data Analyst Level I in compliance with industry standard, </li> \n\n<li>Demonstrated ability to be detail oriented, </li> \n\n<li>Good basic mathematics skills, </li> \n\n<li>Good verbal and written communication skills in English, and/or other local language, if required, </li> \n\n<li>Proficient personal computer skills and intermediate knowledge of Microsoft Word and Excel. </li> \n\n<li>Ability to learn new internal software programs.</li>\n</ul>"}