{"job title": "Data Management Analyst II", "company": "University of Oklahoma", "city state": "– Norman, OK", "rating": "4.1", "job description": "<p><b>OU Physicians is Oklahoma's largest physician group and encompasses almost every adult and child specialty.</b></p>\n<p> </p>\n<p><b>FUNCTION:</b> Provide feasibility analysis, development of system specification and design of management information systems, integrating data from other systems, using data access tools and reporting tools available. Works proficiently in data management, user liaison, long-range planning, and manages assignments in software/hardware evaluation and/or with a specific data management system. Responsible for analysis, maintenance, and enhancements to assigned information systems.\n</p>\n<p> </p>\n<p><b> </b></p>\n<p><b>REPRESENTATIVE DUTIES: </b></p>\n<p><b> </b></p>\n<p><b>1. </b><b>Leadership &amp; Supervision</b>. Serves as a project lead and seasoned resource; may directly supervises assigned staff; contributes to the continuous development and refinement of assigned systems and related policies/procedures</p>\n<p><b> </b></p>\n<p><b>2. </b><b>Software Support.</b> Provides software support in loading, dumping, and maintaining data in databases. Develops and maintains information for assigned information systems, the relationships among systems and the data contained within systems. Maintain code libraries and documentation. Assist with the maintenance of the data lexicon and structured data elements.</p>\n<p> </p>\n<p><b>3. </b><b>Database Assistance. </b>Assists systems and programming staff in using database debugging tools. Assists in updates and reorganization of the database necessary to support users’ requests. Assists with the installation, configuration, documentation and maintenance of assigned information systems using current best practices. Provides detailed analysis, validation and correction of data for assigned applications and associated modules as assigned. May generate specialized reports such as Crystal Reports from database(s).</p>\n<p> </p>\n<p><b>4. </b><b>Operations Assistance. </b>Assists operations in defining and maintaining backup and recovery processes. Assists in developing and maintaining user interfaces and interfaces to facilitate information flow between internal systems and with outside entities. Assists in developing and maintaining training and help systems for assigned systems; develops documentation including specifications, interface maps, project plans and timelines, standards, policies, procedures, and task and issues logs. </p>\n<p> </p>\n<p><b>5. </b><b>Database Analysis.</b> Analyzes and assists in performance monitoring of database activity. Assists in the analysis and specification of database requirements with restraints established by management. Ensures applications programs use of logical database.</p>\n<p> </p>\n<p><b>6. </b><b>Data Security. </b> Assists in providing data security for users through guard files and related developments. May coordinate users’ requests for database usage.</p>\n<p> </p>\n<div><b>REQUIREMENTS:</b></div>\n<div><u></u> </div>\n<div><b>Education: </b>Bachelors Degree in Computer Science, Business Management, MIS, information management or a related field</div>\n<div><b> </b></div>\n<div><b>Experience: </b>36 months experience in systems programming or analysis. </div>\n<div><b></b> </div>\n<div><b>Equivalent/ Substitution: </b>Associate’s Degree and an additional 24 months directly related experience will be accepted in lieu of a bachelor’s degree.</div>"}