{"job title": "Data Scientist", "company": "Aquilent", "city state": "– Rockville, Maryland", "rating": "3.1", "job description": "<strong>Employee Type:</strong>\n<br><br>\nFull-Time\n<br><br>\n<strong>Location:</strong>\n<br><br>\nRockville, MD\n<br><br>\n<strong>Job Type:</strong>\n<br><br>\nScience\n<br><br>\n<strong>Experience:</strong>\n<br><br>\nNot Specified\n<br><br>\n<strong>Date Posted:</strong>\n<br><br>\n<strong>9/3/2018</strong>\n<br><br>\nAbout Us\n<br><br>\nAt Booz Allen, we harness our collective ingenuity to solve our clients' toughest management and technology problems. We work with governments, Fortune 500 corporations, and not-for-profits around the globe, in industries ranging from defense to health, energy to international development. We believe there is no product, code, or strategy that can create progress - only people can. That's why for more than 100 years we've empowered our team: over 24,000 dreamers, drivers, and doers who work together to change the world .\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nJob Number: R*******\n<br><br>\nData Scientist\n<br>\n<strong>The Challenge:</strong>\n<br>\nAre you excited at the prospect of unlocking the secrets held by a data set? Are you fascinated by the possibilities presented by the IoT, machine learning, and artificial intelligence advances? In an increasingly connected world, massive amounts of structured and unstructured data open up new opportunities. As a data scientist, you can turn these complex data sets into useful information to solve global challenges. Across private and public sectors - from fraud detection, to cancer research, to national intelligence - you know the answers are in the data.\n<br><br>\nWe have an opportunity for you to use your leadership and analytical skills to improve the health care industry. You'll work closely with your customer to understand their questions and needs, then dig into their data-rich environment to find the pieces of their information puzzle. You'll mentor teammates, develop algorithms, write scripts, build predictive analytics, use automation, apply machine learning and use the right combination of tools and frameworks to turn that set of disparate data points into objective answers to help make informed decisions. You'll provide your customer with a deep understanding of their data, what it all means, and how they can use it. Join us as we use data science for good in the health care industry.\n<br><br>\nEmpower change with us.\n<br><br>\n<strong>Build Your Career:</strong>\n<br>\nAt Booz Allen, we know the power of analytics and we're dedicated to helping you grow as a data analysis professional. When you join Booz Allen, you can expect:\n<br>\naccess to online and onsite training in data analysis and presentation methodologies, and tools like Hortonworks, Docker, Tableau, and Splunk\n<br>\na chance to change the world with the Data Science Bowl - the world's premier data science for social good competition\n<br>\nparticipation in partnerships with data science leaders, like our partnership with NVIDIA to deliver Deep Learning Institute (DLI) training to the federal government\n<br><br>\nYou'll have access to a wealth of training resources through our Analytics University, an online learning portal specifically geared towards data science and analytics skills, where you can access more than 5000 functional and technical courses, certifications, and books. Build your technical skills through hands-on training on the latest tools and state-of-the-art tech from our in-house experts. Pursuing certifications? Take advantage of our tuition assistance, on-site bootcamps, certification training, academic programs, vendor relationships, and a network of professionals who can give you helpful tips. We'll help you develop the career you want, as you chart your own course for success.\n<br><br>\n<strong>You Have:</strong>\n\n\n<ul>\n<li>5+ years of experience with SAS programming, including Base SAS, SAS/MACRO, SAS/STAT, and SAS/GRAPH</li>\n<li>Experience with task leadership or project management in a consulting environment, including identifying requirements, determining priorities, executing projects, and tracking and resolving issues</li>\n<li>Experience with using SAS data steps or SAS/SQL procedures for data manipulation, quality assurance, data cleaning, normalization, and analysis</li>\n<li>Experience with manipulating large or complex databases and developing appropriate data models, tracking and evaluating patterns of care and outcomes, and applying relevant analytical and statistical methods, including predictive models to evaluating and solving healthcare problems</li>\n<li>BA or BS degree required</li>\n</ul>\n\n<strong>Nice If You Have:</strong>\n\n\n<ul>\n<li>Possession of excellent oral and written communication skills, including presenting client deliverables and findings at conferences or internal roundtable discussions</li>\n</ul>\n\nWe're an EOE that empowers our people - no matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran status - to fearlessly drive change."}