{"job title": "Data Scientist", "company": "Bosch Security", "city state": "– 4421 N Hwy 81, Anderson, SC 29621", "rating": "3.1", "job description": "Data Scientist\n\n<ul>\n<li>4421 N Hwy 81, Anderson, SC 29621, USA</li><li>Full-time</li></ul>\n\n<ul>\nLegal Entity: Robert Bosch LLC\n</ul>\n\n<div>Company Description<div>Do you want beneficial technologies being shaped by your ideas? Whether in the areas of mobility solutions, consumer goods, industrial technology or energy and building technology with us, you will have the chance to improve quality of life all across the globe. Welcome to Bosch.</div>Job Description<div>\n\n<ul>\n\n<li>Clean and organize raw data from different sources.</li>\n<li>Use descriptive statistics to summarize the overall picture.</li>\n<li>Collect, organize, analyze, and present data for possible quality, test, manufacturing problems or trends to answer key questions.</li>\n<li>Visualization of data analysis and derivation of recommended actions.</li>\n<li>Creation/use of Machine learning models for predictions.</li>\n<li>Testing and improving the performance of machine learning tools.</li>\n<li>Systematic development and usage of statistical algorithms for the analysis of high-dimensional big data.</li>\n<li>Evaluation of statistical models, determination of validity of the analysis.</li>\n<li>Assist in the creation and maintenance of data collection and reporting procedures and systems to insure the validity of the data used for decisions.</li>\n<li>Support problem-solving teams with data analysis for quality improvements, cost reductions, and cycle time reductions.</li>\n<li>Co-development of data analysis on an existing analytics platform.</li>\n<li>Process and implement changes in accordance with quality standards.</li>\n<li>Support product teams, CIP activities and Policy Deployment objectives.</li>\n<li>Translation of business needs into data-driven, technical solutions.</li>\n</ul></div>\n<br>\nQualifications<div>\n\n<ul>\n<li>4 yr. Degree (Computer Science or Computer Engineering) and 2 years’ experience as data scientist.</li><li>Knowledge in data analysis, statistics data mining, machine learning, visual analysis of big data.</li><li>Knowledge in machine learning models for predictions.</li><li>Knowledge in statistical algorithms.</li></ul></div>\n<br>\nAdditional Information<div>By choice, we are committed to a diverse workforce - EOE/Protected Veteran/Disabled.\n<br><br>\nBOSCH is a proud supporter of STEM (Science, Technology, Engineering &amp; Mathematics) Initiatives\n<ul>\n\n<li><u>FIRST Robotics</u> (For Inspiration and Recognition of Science and Technology)</li>\n<li><u>AWIM</u> (A World In Motion)</li>\n</ul></div>\n<br>\nJob Location</div>"}