{"job title": "Data Scientist", "company": "Comcast", "city state": "– New York, NY", "rating": "3.5", "job description": "FreeWheel, a Comcast company, has superior end-to-end technology, premium marketplace, and best in market advisory services that power the advertising businesses of the largest media and entertainment companies in the world, including DIRECTV, Fox, NBC Universal, Turner Broadcasting System and Viacom in U.S., and Sky and Channel 4 in Europe. From our unique position at the center of the premium video economy, we enable our clients to unify audiences across desktop, mobile, OTT, and traditional STB devices, and profitably monetize their content. Headquartered in New York, with offices in San Francisco, London, and Beijing, FreeWheel stands to advocate for the entire industry through the FreeWheel Council for Premium Video.Description:Freewheel is currently looking to recruit a Data Scientist to join our Data Sciences team. This role will be responsible for supporting efforts related to machine learning, optimization methods, predictive analytics, attribution analyses, yield management, media economics modeling, and algorithm development.This role will work very closely with engineering, database administrators, account management, and product management staff in assisting with data and analytical needs.This position will work closely on research, development, and analytics tasks to help shape future advanced advertising offerings. The role will be responsible for:<br> *Prototyping optimization solutions for advertising applications<br> *Developing and implementing machine learning algorithms<br> *Researching and building new analytical solutions<br> *Developing methods for advertising attribution analyses<br> *Data visualization and analysis<br> *Data processing and statistical algorithm development<br><br>Skills and Specifications<br> *Graduate degree in Statistics, Operations Research, Applied Math, Engineering, Computer Science, or other quantitative discipline preferred<br> *Experience in implementing optimization methods<br> *Experience in conducting attribution analyses<br> *Experience with Media Math &amp; Economics<br> *Experience with R and Python a plus<br> *Experience with Machine Learning Implementation<br> *Experience working with relational databases. SQL experience a plus.<br> *Excellent oral and written communication skills are a must.<br> *Must be highly analytical with the ability to resolve complex issues independently.<br> *Must be detail oriented with a passion for providing informative documentation.<br> *Strong interest in TV advertising and advanced media platforms.<br> *3+ years of working experience<br><br><br>Comcast is an EOE/Veterans/Disabled/LGBT employer"}