{"job title": "Data Scientist", "company": "Global Resource Management, Inc", "city state": "– Spring Valley, New York", "rating": "4.0", "job description": "<strong></strong><div><strong>JOB DUTIES:</strong>\n<br>\nThe Data Scientist will be responsible for performing Network Analytics by discovering patterns in massive amounts of network data (Troubleshooting steps and results, Alarms, Historical data, etc.) and developing models.\n<br>\nIn this role, the Data Scientist will be implementing descriptive, predictive and prescriptive capabilities to improve the network diagnostics in troubleshooting OSS platform for Telecom Network and thereby improve the customer experience.\n<br><br>\n<strong>Skillset Requirements:</strong>\n<br>\nUsing a mixture of industry tools and IT developed capabilities; the data scientist will work in an environment that includes tools appropriate to add value to the business.\n<br>\nA qualified candidate must have experience in:\n<br>\n1-3 yrs+ experience in Business Intelligence domain including data mining, data visualization and Machine Learning.\n<br>\nData Mining, Preparation and Modeling\n<br>\no Strong concepts in different modeling techniques, with application and implementation of at least two to three methods:\n<br>\no random forest, logistic regression, cluster analysis, discriminant, DEA, time series, neural networks, survival analysis.\n<br>\nProgramming skills in at least one of Python and R; having both is preferable\n<br>\nStrong fundamentals in Statistics and Algorithms\n<br>\nUtilization of Perl, Java or other tools for data preparation\n<br>\nExperience with Tableau, OBIEE or other Business Intelligence / visualization software\n<br>\nStrong analytical and problem solving skills\n<br>\nEffective Communication &amp; Presentation skills\n<br>\nAptitude to learn quickly on current trends and techniques in Data Science and Machine Learning\n<br>\nAbility to work within a team onshore as well as offshore; and across multiple locations</div> <div>\n<strong>EDUCATION/CERTIFICATIONS:</strong>\n<br>\nEducation Level MS or equivalent in relevant fields like Data Science, Applied Math, Statistics or Computer Science</div>"}