{"job title": "Data Scientist", "company": "Hearst", "city state": "– New York, New York, United States", "rating": "3.2", "job description": "<div><div><div><div><div>Hearst reaches more than 100 million people around the world every month on digital platforms connected to loved and trusted brands like Cosmopolitan, Esquire, Elle, the Houston Chronicle, and 29 television stations.<br> <br>Data has become the driving force to moving us forward, with confidence, on all business decisions. We’re hiring talented and passionate data scientist to solve problems as we integrate data science and machine learning techniques into the new HDM platform. The ideal candidate has extensive experience working with python, SQL, distributed, service oriented architecture (SOA) systems and writing clean object-oriented code.<br> <br> <br>Responsibilities<br> <br> <br>•\tBe part of the team that continues to architect and build on Hearst Magazine's content platform<br>•\tWork on challenging fundamental data science problems in online publishing.<br>•\tFormulate, implement, test, and validate virous predictive models, such as linear regression, tree models, etc.<br>•\tDiscover actionable insights from data and present informative and clear visualizations to support these actions.<br>•\tMeasurably impact the business KPIS with high-quality solutions. <br>•\tParticipate in key software design decisions<br>•\tWrite expressive code that is efficient and extensible<br>•\tBe ready to adapt and extend the architectural plan as new product goals and technical challenges emerge<br> <br>Desired Skills and Experience<br> <br>Skills &amp; Requirements<br> <br>•\tAdvanced degree in a relevant technical field (machine learning, computer science, statistics, physics, mathematics, or related field), or 4+ years’ experience in a relevant role<br>•\tThe ability to take a feature or service to full completion, from working with our back-end tech Python<br>•\tDemonstrably robust experience with:<br>o\tSaaS design / RESTful API integration<br>o\tPython, pandsa, scikit-learn, Django<br>o\tGoogle Cloud Platform, BigQuery, Google Analystics, DFP <br>o\tExperience following the ES6 spec preferred<br>o\tStrong foundational knowledge of web technologies on both ends of the stack<br>o\tUnderstanding relational databases / data models<br>o\tWorking in an Agile development team (Scrum highly desired)<br>o\tLinux<br>o\tPerformance tuning / caching strategies<br>This role is based at Hearst’s global headquarters in New York City.<br><br>\n \n \n \n\n \n \n\n \n\n \n </div>\n </div>\n </div>\n\n \n </div>\n\t</div>"}