{"job title": "Data Scientist", "company": "L3 Technologies", "city state": "– USA-Virginia-Chantilly", "rating": "3.3", "job description": "<div>At L3, success is defined by our ability to meet our customers' needs. That's why every part of our business is focused on quick and agile response, innovative thinking and a relentless commitment to getting the job done. For more than a decade, L3 has delivered superior performance to the U.S. government, our allies and leading corporations throughout the world. As a top ten defense contractor in the world, we know the critical role our products and services play in the protection and defense of freedoms worldwide. We take our responsibility very seriously, and we are privileged to support our customers and the men and women who get the job done . </div>\n<div> </div>\n<div>L3 – Advanced Programs – Chantilly is looking for a self-starting, entrepreneurial, team oriented developer with experience in Big Data and Data Science to join a dynamic team of engineers working in collaboration with a Government Customer to redefine space operations and decision-making at a National level. This individual will be responsible for performing sophisticated analytics and statistical modeling. Analysis tools will interface with existing simulation tools such as AFSIM, STK, or MACE. The ideal candidate will have experience in C , Java, Excel, MATLAB, and Python, as well as SQL knowledge and advanced data mining methodologies. </div>\n<div> </div>\n<ul>\n<li>Build custom code to manipulate existing data into consolidate exports for analysis, typically in JAVA or C </li>\n<li>Work with and analyze large amounts of data. Interact with functional experts, at all levels, to understand challenges and identify new opportunities. </li>\n<li>Collaborate with users and team members to provide accurate estimates for assigned tasks. </li>\n<li>Work individually and as a team member to ensure stability of company production systems. </li>\n<li>Develop and devise advanced analytical analysis, methods and tools for design, quality, production and engineering departments. </li>\n<li>Provide expert perspective on modeling approach, technique and tools in resolving the engineering problem. </li>\n<li>Help identify, assess, and document potential data sources and flows, and analyze existing data warehouses to determine relevance trends to engineering and customer needs. </li>\n<li>Research latest technique and tools to continuously enhance the discipline. </li></ul>\n<div><b>*Position requires an active Top Secret/SCI with Poly </b></div>\n<div><b>Education Requirements: </b></div>\n<ul>\n<li>\n<div>Bachelor’s degree in Data Science, Computer Science, Computer Engineering, Mathematics or related science and engineering field. Graduate Degree is preferred. </div></li></ul>\n<div><b>Skills Requirements: </b></div>\n<ul>\n<li>At least 5-10 year's relevant work experience in C &amp; Java programming. </li>\n<li>Minimum 5 years hands-on experience in mathematical/statistical model buildings. </li>\n<li>Experience and/or broad familiarity with military terminology &amp; concepts. </li>\n<li>Working knowledge of machine learning topics </li>\n<li>Knowledge of commercial/open source operational analysis tools including optimization and graphical visualization techniques. </li>\n<li>Applicant selected will be subject to a government security clearance investigation and must meet the requirements for access to classified information. Eligibility requirements include U.S. citizenship. </li>\n<li>Position requires an Active Top Secret/SCI with Polygraph. </li></ul>\n<div><b>Desired Skills and/or experience: </b></div>\n<ul>\n<li>Experience deploying, maintaining, and developing against big data engines, such as HADOOP and SPLUNK </li>\n<li>Previous work applying machine learning to database analysis and data modeling </li>\n<li>Experience developing data visualization tools using a web-based framework such as Cesium and Sencha. </li>\n<li>Experience with design of experiments (DOE), regression analysis (linear and logistics), multivariate data analysis </li>\n<li>In addition to Java and C , experience in Matlab, Python, and Unix shell scripting is desired. </li></ul>\n<div> </div>\n<div>Position can be filled at Level 4 or Level 5. </div>\n<div> </div>\n<div>We offer a competitive benefits package for full-time and part-time employees to include: paid holidays, paid time off, medical, dental, vision, flexible spending account, long and short term disability and company paid life insurance, 401(k) Employee Stock Purchase Plan, referral bonuses and tuition reimbursement. <br><br>L3 is an equal opportunity employer. We maintain a drug-free workplace and perform pre-employment substance abuse testing to include background checks. </div>\n<div> </div>\n<div>Equal Opportunity Employer – minorities / females / veterans / individuals with disabilities / sexual orientation / gender identity. </div>"}