{"job title": "Data Scientist", "company": "Lawrence Berkeley Lab", "city state": "– Berkeley, CA", "rating": "4.0", "job description": "<p>Berkeley Lab’s Joint Genome Institute Division has an opening for a Data Scientist. Develop software, algorithms and automated processes to cleanse, integrate and evaluate large genomic datasets from multiple sources. Under broad supervision, perform thorough quality analysis of DNA sequence data and various sequencing library types; develop, improve, and recommend sequence analysis tools and pipelines including genome assembly; and provide technical and analytical interpretation of data. Play a significant role in defining post-sequencing quality metrics and standards. Develop computational tools to perform DNA sequence analysis for production and research projects. Provide troubleshooting and analysis support for the production sequencing operation. Will work with various JGI groups on data analysis and facilitate transfer of knowledge of technologies and applications to JGI staff. Identify meaningful insights; interpret and communicate insights and findings from analysis and experiments to colleagues, project managers, and collaborators. May also supervise non-exempt group members. This position will report to the QAQC Group Lead. </p><br><p>What You Will Do:</p><ul><li><p>Perform quality analysis of sequence data and assist others in interpretation of analyzed data.</p></li><li><p>Define quality metrics for assessing library and sequencer performance.</p></li><li><p>Independently and proficiently utilize genome assembly and analysis software.</p></li><li><p>Provide high quality data to collaborators.</p></li><li><p>Provide clear and concise professional reports and present technical and analytical status in meetings.</p></li><li><p>Work closely with scientists and production staff to improve production line quality.</p></li><li><p>Contribute to publications on experimental data generated by the new sequencing approaches.</p></li><li><p>Troubleshoot complex system and data analysis problems and provide feedback on areas of improvement for existing tools.</p></li><li><p>Provide feedback on the improvement of the library construction and sequencing procedures.</p></li><li><p>Analyze the impact of process, hardware or software changes on production line performance.</p></li><li><p>Quantitatively evaluate assembly results and use to improve genome assembly methods and performance.</p></li><li><p>Develop and improve tools to evaluate quality of data generated by various sequencing platforms and library types.</p></li><li><p>Refine and improve existing analytical tools.</p></li><li><p>Design and build new tools to analyze assembled sequences of various research projects.</p></li><li><p>Provide technical support to implement new sequence analysis pipelines.</p></li><li><p>Produce high quality documentation for newly developed software and approaches.</p></li></ul><br><p>What is Required: </p><ul><li><p>B.S. in Physics, Statistics, Bioinformatics, Computer Science or a related field and at least 5 years of experience in bioinformatics or an equivalent combination of education and experience.</p></li><li><p>Experience with the collection, recording and analysis of experimental data.</p></li><li><p>Experience with distributed computing.</p></li><li><p>Demonstrated experience processing large volumes of data.</p></li><li><p>Demonstrated experience applying statistics to analyze large biological datasets.</p></li><li><p>Proficiency with programming languages including Python, R, C/C , Java or others in a Unix environment.</p></li><li><p>Demonstrated analytical skills sufficient to troubleshoot complex systems and data analysis problems and make recommendations.</p></li><li><p>Expertise with DNA sequencing, genome assembly and data analysis.</p></li><li><p>Demonstrated knowledge and experience with standard bioinformatics methods and tools, including sequencing databases.</p></li><li><p>Strong organizational and record-keeping skills.</p></li><li><p>Effective oral and written communication and interpersonal skills.</p></li><li><p>Ability to work independently and as a team member in a diverse team environment.</p></li><li><p>Ability to handle multiple tasks in parallel while working on a large number of projects.</p></li><li><p>Ability to follow laboratory safety guidelines.</p></li></ul><br><p>Additional Desired Qualifications:</p><ul><li><p>Knowledge and experience with laboratory DNA sequencing technologies and genetics, or related field or equivalent experience preferred.</p></li><li><p>Some experience with database structure and management.</p></li><li><p>Experience applying machine learning, pattern recognition, or modeling to scientific problems.</p></li><li><p>Experience in a multi-disciplinary scientific or production environment.</p></li></ul><br><p>The posting shall remain open until the position is filled, however for full consideration, please apply by close of business on October 4, 2018.</p><br><p>Notes:</p><ul><li><p>This is a full time, 1 year, term appointment with the possibility of extension or conversion to Career appointment based upon satisfactory job performance, continuing availability of funds and ongoing operational needs.</p></li><li><p>Full-time, M-F, exempt (monthly paid) from overtime pay.</p></li><li><p>Salary is commensurate with experience.</p></li><li><p>This position may be subject to a background check. Any convictions will be evaluated to determine if they directly relate to the responsibilities and requirements of the position. Having a conviction history will not automatically disqualify an applicant from being considered for employment.</p></li><li><p>Work will be performed at DOE Joint Genome Institute (JGI) — 2800 Mitchell Dr., Walnut Creek, CA.</p></li></ul><br><p><u>Berkeley Lab </u>(LBNL) addresses the world’s most urgent scientific challenges by advancing sustainable energy, protecting human health, creating new materials, and revealing the origin and fate of the universe. Founded in 1931, Berkeley Lab’s scientific expertise has been recognized with 13 Nobel prizes. The University of California manages Berkeley Lab for the U.S. Department of Energy’s Office of Science.</p><br><p>Equal Employment Opportunity: Berkeley Lab is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, or protected veteran status. Berkeley Lab is in compliance with the <u>Pay Transparency Nondiscrimination Provision </u>under 41 CFR 60-1.4. Click <u>here</u> to view the poster and supplement: \"Equal Employment Opportunity is the Law.\"</p><div><br></div>"}