{"job title": "Machine Learning Scientist", "company": "Samsung Research America", "city state": "– Mountain View, CA", "rating": "3.3", "job description": "Title: Data Scientist, Machine Learning / AI\n<br><br>\nLocation: Mountain View, CA\n<br><br>\n<strong><u>Position Summary:</u></strong>\n<br><br>\nSamsung Research Americas Artificial Intelligence Team is currently seeking a talented, competent, and highly motivated individual to join our Collective Rationality group as a Data Scientist. Collective Rationality group is an interdisciplinary and hands-on research group focusing on building consumer focused recommendation engine on top of Samsungs product line such as Samsung Pay, Samsung Smart TV, and so on.\n<br><br>\nThe successful candidate will research on and develop Machine Learning algorithms to solve challenging problems involving big data and will work with other team members to build machine learning systems for proof-of-concept prototypes or consumer-oriented services.\n<br><br>\n<u><strong>Responsibilities:</strong></u>\n\n<ul>\n<li>Develop scalable solutions based on state-of-the-art machine learning and AI methodologies.</li>\n<li>Contribute to the teams research and development activities; participate and lead some of the efforts.</li>\n<li>Formulate research problems based on real-world needs and conduct high-quality research.</li>\n<li>Apply expert software development skills to a wide range of ML-related coding projects.</li>\n<li>Read research papers, attend conferences to learn about the latest machine learning research and productize them.</li>\n<li>Develop prototypes and execute experiments to evaluate the performance of ML/AI architectures/algorithms in large-scale industrial applications.</li>\n<li>Write well-structured and re-usable code.</li>\n<li>Create proof-of-concept technology demonstrations.</li>\n</ul>\n<strong><u>Basic Qualifications:</u></strong>\n\n<ul>\n<li>MS in Computer Science, Mathematics, Statistics, Physics, or similar quantitative fields with 2+ years of industry experience</li>\n<li>Solid background in at least one area of machine learning and/or AI research.</li>\n<li>Solid background in linear algebra, calculus, and probability theory.</li>\n<li>Experience in working with supervised, unsupervised machine learning.</li>\n<li>Experience in working with matrix/tensor factorization or any other methods for building recommendation systems.</li>\n<li>In-depth experience in building systems based on machine learning and/or AI methods.</li>\n<li>Strong programming skills in Python and/or C/C++ and/or Java.</li>\n<li>Experience in working with numpy, scipy, scikit-learn, surprise.</li>\n</ul>\n<strong><u>Preferred Qualifications:</u></strong>\n\n<ul>\n<li>Ph.D. in Computer Science, Electrical Engineering, Operation Research, Mathematics, Statistics, Physics, or similar quantitative fields</li>\n<li>Experience in probabilistic models and/or stochastic processes in machine learning</li>\n<li>Experience in designing/developing scalable algorithms for large-scale recommendation systems is a strong plus</li>\n<li>Experience in deep learning, transfer learning</li>\n<li>Experience in optimization models and methodologies</li>\n<li>Achievements in competitions such as Kaggle, ILSVRC, or WMT a strong plus</li>\n<li>Publication in top-tier conferences or journals such as NIPS, ICML, ICLR, AAAI, KDD, JMLR, PAMI a strong plus</li>\n<li>Good knowledge and hands-on experience in distributed technologies such as Hadoop, Hive, Spark Experience in Scala programming language</li>\n<li>Experience in working with one or few of these tools:Pytorch, Tensorflow, Keras, Edward, FastML</li>\n</ul>\nSamsung is an EEO/Veterans/Disabled/LGBT employer. We welcome and encourage diversity as we strive to create an inclusive workplace."}