{"job title": "Product Data Analyst", "company": "Shutterfly", "city state": "– Redwood City, CA, United States", "rating": "3.4", "job description": "Shutterfly is seeking a successful Product Data Analyst for Web Data and Analytics for the Shutterfly experience, focused on creation paths across all products. We are looking for someone who is passionate about data and the role it can play in building experiences that delight customers and deliver business results. In this role, you will be responsible for driving the vision, strategy, and build-out of our platform and team processes around data and analytics. This is a great opportunity where you will play a key leadership role in helping us become a world-class data and insights-driven team.\n<br><br>\n<strong>KEY RESPONSIBILITIES:</strong>\n<ul>\n<li> Serve as data and analytics platform domain expert and process owner, leader, and motivator on a cross-functional team</li><li> Conduct market research and analyze competitive landscape to understand and disseminate best practices</li><li> Drive site data focused on product creation paths and analytics platform strategy and roadmap including recommendations on tools, vendors/partners, and technologies</li><li> Own end-to-end process by gathering and prioritizing stakeholder data needs and writing requirements. Also, work closely with other product managers and cross-functional partners to deploy, test/validate, and maintain the data and analytics platform</li><li> Lead the team in creating a process to ensure each new project launches with proper tracking and enable the team to answer key product and business questions. Support other product managers in defining KPIs and technical data requirements. Also collaborate in developing A/B test plans for new features and workflows</li><li> Support team in maximizing leverage of BI/self-service tools. Assist team members with creating funnels, dashboards, and reports that enable data-driven decisions</li>\n</ul>\n<strong>REQUIRED SKILLS:</strong>\n<ul>\n<li> 5+ years of experience in product management</li><li> Experience in website design and development. Specific domains of interest: e-commerce, social networking, gaming</li><li> Experience adding tracking metrics to a product. Ability to define product and business KPIs and measure customer value, conversion, retention, engagement, and virality. Experience designing and conducting A/B tests</li><li> Understanding of the technical architecture of data and tracking systems</li><li> Power user of data tools and platforms (e.g. OMTR, MixPanel, Google Analytics) and experience in creating funnels and dashboards</li><li> Motivated, dynamic, creative, and results-oriented. History of thriving in a fast-paced, agile product development environment</li><li> Excellent project management skills and attention to detail. Know how to hustle and get things done. Comfortable juggling multiple projects at various stages of completion, and motivating and driving a project team to success</li><li> Experience working closely with engineering to balance technical, product and business trade-offs</li><li> Strong interpersonal skills and experience leading and collaborating with cross-functional teams. Know how to influence without authority</li><li> Strong analytic and strategic thinking skills</li><li> Expert level experience in Excel</li><li> And of course, mad love and passion for data!</li>\n</ul>\n<strong>PREFERRED SKILLS:</strong>\n<ul>\n<li> Experience in BI tools (e.g. Tableau, MicroStrategy, Cognos)</li><li> Proficiency in SQL and experience with big data</li><li> Statistical competence (regression modeling, A/B testing, significance testing and etc.) is highly-welcome<br><br><em>Location: Redwood City, CA (some travel required)</em></li>\n\n</ul>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}