{"job title": "Data Scientist", "company": "Twitter", "city state": "– New York, NY", "rating": "4.0", "job description": "<div>\n<div>\n<div>\n<div>\n<div>\nData Scientist</div><br>\n\n<div>\nNew York, NY</div></div>\n</div>\n </div>\n</div><br>\n\n<div>\n<div>\n<div>\n<div>\n<div><strong>Description</strong>\n<br><br>\nTwitter’s Brand Strategy Innovation team is responsible for innovating how we generate, represent, and deliver new solutions and user experiences to bring to Twitter's most valuable advertisers.\n<br><br>\nThe Innovation team is made up of designers, creative technologists, data scientists, and producers. We’re responsible for studying how people interact on Twitter, the overall digital landscape, and in their day-to-day lives to design experiences that get them talking.\n<br><br>\nThe Data Scientist on this team will be responsible for using internal and external data sources to assess and understand behavioral patterns on Twitter, develop unique and innovative ways of measuring the value of brand activations, and inform our R&amp;D prioritization and approach.\n<br><br>\nBecause the team focuses on a wide range of project types, broad curiosity and problem-solving skills are critical to success.\n<br><br>\nOur broader Brand Strategy team’s collective mission is to create human-centric ideas worth talking about – a goal the Innovation segment of the team shares and embraces. It’s ambitious to create work so good people proactively want to talk about it, but it’s inherent to our DNA.\n<br><br>\nThis role will be based in San Francisco or New York.\n<br><br>\n<strong>Responsibilities</strong>\n<ul>\n<li>Investigate internal and external data sources that help us understand how users interact with brand and cultural content on Twitter</li> <li>Conduct analyses to learn from our vast amount of data and make it more accessible to Strategists and Designers, and to surface reporting and insights</li><li>Apply advanced statistical techniques to model user behavior, identify causal impact and attribution, build and benchmark metrics</li><li>Write complex data flows using SQL, Spark, Scalding, R and Python scripts</li><li>Use data visualization tools (e.g, Tableau, Zeppelin) to share ongoing insights</li> <li>Communicate findings to executives and cross-functional product teams</li><li>Partner with the Twitter Marketing Insights and Ads Research teams to understand how internal and external data is utilized today and propose new ways it can improve our creative work</li><li>Translate data patterns and insights into recommended areas for product exploration</li><li>Document methodologies and processes for repeated use</li><li>Extract usage and behavioral data from Twitter systems and present findings</li><li>Present and visualize basic data findings for communicating to brand advertisers and internal business leaders</li><li>Experiment with internal and external 3rd party tools and document processes with potential team-wide relevance</li><li>Define and document best practices, and contribute to company knowledge sharing efforts</li>\n</ul>\n<strong>Qualifications</strong>\n<ul>\n<li>Minimum 5+ years of experience with data extraction and analysis at an agency, brand, or technology platform</li><li>Hands-on experience utilizing SQL and proprietary data extraction and analysis tools</li> <li>Strong written and visual communication skills for documenting and sharing methodologies and processes for wider utilization</li><li>Experience translating verbal or written business problems into data solutions</li><li>Familiarity with experiment design and testing at scale</li><li>Ability to connect business hypotheses and real world problems to data insights</li>\n</ul>\n<strong>Desired</strong>\n<ul>\n<li>Bachelor's degree, Masters preferred in statistics, econometrics, computer science, or related field, or equivalent experience</li>\n</ul>\n﻿\n<br><br>\nWe are committed to an inclusive and diverse Twitter. Twitter is an equal opportunity employer. We do not discriminate based on race, color, ethnicity, ancestry, national origin, religion, sex, gender, gender identity, gender expression, sexual orientation, age, disability, veteran status, genetic information, marital status or any legally protected status.</div></div>\n</div>\n </div>\n</div><br>\n\n<div><div><div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n</div></div></div></div></div></div></div></div></div>"}