{"job title": "Data Scientist, Marketing Analytics, Web Analytics &amp; Experimentation", "company": "Uber", "city state": "– San Francisco, California", "rating": "4.2", "job description": "Were changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now were a part of the logistical fabric of more than 600 cities around the world. Whether its a ride, a sandwich, or a package, we use technology to give people what they want, when they want it. For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer. And thats just what were doing today. Were thinking about the future, too. With teams working on new modalities, self-driving cars and even urban air transportation, were in for the long haul. Were reimagining how people and things move from one place to the next.\n\nAbout UberWe're looking for an experienced data scientist and experimentalist to help optimize investment decisions for Ubers multi-million dollar marketing budget and address projects that sit at the intersection of marketing, data science, and our business operations. You will be responsible for developing actionable analytical solutions to inform decisions across Ubers global marketing efforts, accelerating both demand and supply growth within Ubers 600+ cities worldwide! What you'll doDesign experiments to evaluate the performance of our website, platform and marketing efforts, and optimize rider and driver conversionDevelop statistical models/analysis and apply them into solving real-time problemsLeverage web traffic and performance data to identify areas of opportunityDefine key business metrics for experimentation, develop SQL queries to generate reports, and run large scale experiments that deliver impactful results to the businessCollaborate with marketing and finance leadership, design, product and engineering teams. Guide these teams through data-driven recommendations.Participate in cross-functional project planning/prioritization meetings, stakeholder meetings, etc.Translate data-driven learnings and statistical models into actionable insights, and communicate to key stakeholders.\n\nWhat youll need3+ years of experience as a data scientist at a company with global operationsExpertise with R and PythonAdvanced SQL skills - comfortable working with very large data setsExperience with A/B Testing, machine learning techniques and advanced analytics (e.g. regression, classification, clustering, time series, econometrics) Strong statistics knowledge required; ability to explain marketing analytics models to key stakeholders preferredExperience with big data using technologies like Hadoop, Hive, and Spark a plusPrevious experience in advertising tech is a plusGreat communication skills, organized, able to multitask and be a team playerBalance attention to detail with swift execution Hunger and drive to learn complex topics Enthusiasm about Uber!"}