{"job title": "Data Scientist", "company": "Vencore", "city state": "– Richmond, VA", "rating": "3.2", "job description": "<ul>\n<li>*Overview**</li>\n</ul>\n\nEvery day at Perspecta, we enable hundreds of thousands of people to take on our nation?s most important work. We?re a company founded on a diverse set of capabilities and skills, bound together by a single promise: we never stop solving our nation?s most complex challenges. Our team of engineers, analysts, developers, investigators, integrators and architects work tirelessly to create innovative solutions. We continually push ourselves?to respond, to adapt, to go further. To look ahead to the changing landscape and develop new and innovative ways to serve our customers.\n<br><br>\nPerspecta works with U.S. government customers in defense, intelligence, civilian, health care, and state and local markets. Our high-caliber employees are rewarded in many ways?not only through competitive salaries and benefits packages, but the opportunity to create a meaningful impact in jobs and on projects that matter.\n<br><br>\nPerspecta?s talented and robust workforce?14,000 strong?stands ready to welcome you to the team. Let?s make an impact together.\n<br><br>\nPerspecta is an AA/EEO Employer - Minorities/Women/Veterans/Disabled and other protected categories\n\n\n<ul>\n<li>*Responsibilities**</li>\n</ul>\n\nThe sponsors requires a Data Scientist with experience in cyber risk and security.The person selected for this position shall have practical hands-on, as well as enterprise/policy level experience.This role includes applying established or developing new programmatic and quantitative methods to find patterns and relationships in large data sets; conducting mathematical, statistical, geospatial modeling, or otherdata-driven problem-solving analysis to address business operations questions; identifying and collaborating with collectors and analysts to determine the data needed to address problems, and incorporating insights and findings into a broad range of products.These products can range from those that provide direct mission support to those that provide capabilities to peers and colleagues. The work includes the design, modification, and/or use of scientific computing, programming, and mathematics.Specific responsibilities include,but are not limited to the following:\n<br><br>\n+ Collaborating with Cybersecurity SMEs to develop practical analytic cyber security behavioral models to identify, qualify, prioritize, and proactively manage cyber risks, e.g.anomalous behaviors across an **IT** enterprise\n<br><br>\n+ Applying rigor in qualifying the cyber risk in terms that can be used to prioritize cyber risk mitigation approaches\n<br><br>\n+ Developing warning triggers/conditions that indicate an unacceptable level of cyber risk\n<br><br>\n+ Assisting with the development and institution of a cyber-risk continuous validation and compliance system\n<br><br>\n+ Identifying and networking with appropriate internal and external sources to gather and/or exchange data on specialized matters.\n<br><br>\n+ Engaging with customers to determine the nature of analytic problems, evaluate options, and offer recommendations for resolution.\n<br><br>\n+ Building and exploit database and files\n<br><br>\n+ Advising customers on the methods and data needed and/or available to evaluation the problems.\n<br><br>\n+ Collaborating with collectors and analysts to identify and close gaps on complex problems; devising creative data collection and analysis strategies.\n<br><br>\n+ Conceiving, preparing, and communicate a wide range of strategic, highly complex graphics, computational models/tools, or written/oral assessments to internal and external customers.\n<br><br>\n+ Conceive and prepare thorough, well-argued and authoritative tactical and strategic analytic products (e., technical articles, graphic depictions, intelligence reports) summarizing the methods and results of data analysis\n<br><br>\n+ Acquiring, processing, and refining large or complex data sets from various sources, utilizing computer programming where necessary\n<br><br>\n+ Analyzing, evaluating, and assessing quantitative data (using statistical software, computer models, geospatial models, software languages, and mathematical models) to contribute to or develop software tools, analytic models, or reports.\n<br><br>\n+ Conducting statistical, mathematical, geospatial modeling or data-mining analysis in partnership with other Data scientist(s) or Analyst colleagues.\n<br><br>\n+ Anticipate and project a wide range of possible outcomes using scenario/alternative analysis,machine learning, and agent based modeling or other advance analytictechniques.\n<br><br>\nIdentify, use,and/or develop a wide range of methodologies and analytic toolsto address existing or potential intelligence problems and collection strategies\n\n\n<ul>\n<li>*Qualifications**</li>\n</ul>\n\n+ Knowledge and experience working withstatistical tools such as,SAS,R,SPSS, Matlab,Mahour/MADlib,Stata,\n<br><br>\n+ Experience work with programming languages,such as SQL,C/C++, Java,Python,Perl\n<br><br>\n+ Experience working with data management tools,such as Hadoop,MapReduce,Pig, Hive,NoSQL, Tableau, Hbase\n<br><br>\n+ Working knowledge of appropriate analytic method and methodologicaltoolsin one ormore fo the following areas:\n<br><br>\n+ Applied mathematics (e.g.,probability and statistics,formal modeling,computational social sciences)\n<br><br>\n+ Computer programming (e.g., programming languages, math/statistics packages,computer science, machinelearning,scientific computing)\n<br><br>\n+ Visualization (e.g.,GIS/geospatialanalysis,telemetry analysis)\n<br><br>\n+ Working knowledge of research design\n<br><br>\n+ Working knowledge of collection methods,capabilities,andtasking process\n<br><br>\n+ Familiarity with project management concepts and principles\n<br><br>\n+ Ability to leverage multiple data management tools to organizerelevantinformation and make\n<br><br>\n+ decisions\n<br><br>\n+ Bachelor's degree or equivalent experience in engineering, IT,or computer science\n<br><br>\n+ Minimum of 12 years'experience,plus 3+ years supporting the Sponsor\n<br><br>\n+ Excellent oral and writtencommunications skills\n<br><br>\nSubmit employee referral\n<br><br>\nSorry the Share function is not working properly at this moment. Please refresh the page and try again later.\n\n\n<ul>\n<li>*Connect With Us!**</li>\n</ul>\n\nNot ready to apply?for general consideration.\n\n\n<ul>\n<li>*Req #** _2018-51121_</li>\n<li>*Category** _Intelligence_</li>\n<li>*\\# of Openings** _1_</li>\n<li>*Job Location** _US-Classified-VA_</li>\n<li>*Clearance** _Top Secret/SCI w/Poly_</li>\n</ul>"}