{"job title": "Senior Data Scientist", "company": "24 Seven Talent", "city state": "– New York NY, US", "rating": "3.7", "job description": "<div>\n<div><strong>Company Overview:</strong>\n<br><br>\nOur client is an iconic American men’s and women’s fashion brand that is dedicated to bringing fun, classic, high-quality clothing to its customers. The company is all about the people – employees included – and takes pride in giving back and doing what’s best for its teams, its customers and their communities. The company is all about creating a work environment that is conducive to creativity &amp; getting things done. Their cool, modern offices and warm and inviting company culture are just 2 examples of how they achieve that.\n<br><br>\n<strong>Position Overview:</strong>\n<br><br>\nIn this role you will be utilizing your algorithmic/programming toolkit, build predictive models to improve profitability, growth, retention and other such key performance indicators for our clients\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\n• Implement formal modeling processes from end to end including data gathering, data profiling, numerical model building, calibration, cross-validation, putting product into production, etc.\n\n\n<ul>\n<li>After building the models, pilot “scorecards” to track model performance and calculated improvement to business.</li>\n<li>Explain complex modeling approaches in layman’s terms and discuss modeling results and business case impacts with non-technical business users</li>\n<li>Collect data from a wide variety of corporate databases, including various SQL databases (Microsoft, Oracle, Netezza, etc.), no-SQL databases, Access databases, and Excel files</li>\n<li>Utilize your toolset in regular expressions to extract information from un-structured text documents</li>\n<li>Handle missing data through an algorithmic approach such as multiple imputations to enable insights in sparse and messy data.\n<br><br>\n<strong>Key Qualifications:</strong>\n<br><br>\n• Bachelor’s degree in mathematics, business, statistics, economics, computer science or equivalent combination of education and experience.</li>\n<li>2-5 years of directly related experience</li>\n<li>Strongly motivated to be a player in a team which is constantly working to improve themselves through discovering new analytics techniques and software tools to improve the quality of our work</li>\n<li>Strong understanding and proficiency of predictive modeling techniques</li>\n<li>Superior research, statistical, analytical, processing and mathematical skills with ability to structure and conduct analyses</li>\n<li>Ability to engage in model discussions with co-workers and give feedback as required</li>\n<li>Proficiency in Microsoft Office Suite, SQL, and at least one of the following: SAS, R, and/or Python</li></ul></div>\n\n\n\n</div>\n<br>\n <div>\n\n\n<ul>\n\n <li>Digital Marketing Project Manager</li>\n<li>Manager, Global Initiatives &amp; Customer Experience</li>\n<li>Digital Analyst</li>\n<li>Digital Consumer Analyst</li>\n<li>Director Regional Marketing &amp; Consumer Engagement</li>\n<li>Vice President of Product</li>\n<li>Content Strategist</li>\n<li>Social Media/PR Specialist</li>\n<li>Digital Marketing &amp; Content Community Manager</li>\n<li>SEO Analyst</li>\n</ul>\n</div>"}