{"job title": "Senior Scientist III, Chemical Engineering", "company": "AbbVie", "city state": "– North Chicago, IL", "rating": "3.7", "job description": "The Process Research and Development organization within AbbVie invents synthetic processes to prepare active pharmaceutical ingredients (APIs) to enable the development of AbbVies pipeline, and ultimately to provide commercial manufacturing processes.\n<br><br>\nAbbVie is seeking a highly motivated individual with a proven track record of accomplishment to join the API Pilot Plant Technical Operations (Tech Ops) group. This position will serve as a liaison between the Process Research and Development scientific functions and the API Pilot Plant organization.\n<br><br>\nThe successful candidate will assist in the optimization and scale-up of synthetic processes and facilitate the implementation of the processes and new technologies in to the API Pilot Plant. The Scientist will also provide technical oversight during production campaigns and will support technical transfer to the ultimate commercial manufacturing site.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n<li>Management of processes entering the API Pilot Plant, including scheduling, equipment selection, materials tracking, authoring direction sets, obtaining safety analyses, and executing pre-runs.</li><li>Technical oversight of processes running in the API Pilot Plant, and responsibility for process-trouble shooting in collaboration with the project teams.</li><li>Serves as primary point of contact between API Pilot Plant, project teams, Quality Assurance, and Environmental Health and Safety.</li><li>Responsible for review and documentation of data for cGMP execution of chemical processes. Authors campaign summary reports.</li><li>Identify, evaluate and implement new technologies for the pilot plant and/or identify opportunities to modify or leverage existing assets to enhance operational efficiency. Examples include automation, flow chemistry, novel separation, Process Analytical Technology (PAT) feedback control and drying technologies.</li><li>Support the implementation of PAT. Assist with equipment specification, setup, data collection and analysis.</li><li>Interface with project teams to ensure that processes are safe and operable.</li><li>Partner with API development teams to optimize processes for scale-up. Identify appropriate equipment and configurations.</li><li>Assist with technology transfer of late stage processes to commercial sites, including process fit, identification of equipment needs, and facility modifications.</li>\n</ul>\n\n<strong> <strong>*Level and compensation will be commensurate with experience.*</strong>\n<br><br>\n<strong>Basic:</strong></strong>\n\n<ul>\n<li><strong>BS, MS, PhD in Chemical Engineering with 14+ (BS), 12+ (MS), or 6+ (PhD) years of experience</strong></li><li><strong>3 Years (minimum) in drug substance development (strongly preferred)</strong></li><li><strong>Understanding of cGMP, process safety requirements, and OSHA chemical hygiene plans.</strong></li><li><strong>Working Knowledge of analytical techniques such as HPLC, GC, NMR, and microscopy</strong></li><li><strong>Experience with Process Analytical Technology</strong></li></ul>\n\n<strong>\n<br>\n<strong>Preferred:</strong></strong>\n\n<ul>\n<li><strong>Experience with laboratory experiments, process scale-up from lab to pilot plant and/or transferring a process from pilot plant to a commercial facility.</strong></li><li><strong>Experience working in an API Plant environment. Familiarity with operation of chemical process equipment and systems.</strong></li><li><strong>Strong technical background in chemical processing unit operations including reactions, crystallization, distillation, extraction, membrane separation, chromatography, centrifugation, filtration, drying and milling.</strong></li></ul>\n\n<strong>\n<br>\n<strong>Key Leadership Competencies:</strong></strong>\n\n<ul>\n<li><strong>Builds strong relationships with peers and cross functionally with partners to enable higher performance.</strong></li><li><strong>Learns fast, grasps the \"essence\" and can change course quickly where indicated.</strong></li><li><strong>Raises the bar and is never satisfied with the status quo.</strong></li><li><strong>Creates a learning environment, open to suggestions and experimentation for improvement.</strong></li><li><strong>Embraces the ideas of others, nurtures innovation and manages innovation to reality.</strong></li><li><strong>Strong interpersonal and communication skills with demonstrated ability to work within a team environment.</strong></li></ul>\n\n<br><br><strong><strong>Equal Opportunity Employer Minorities/Women/Veterans/Disabled</strong></strong>\n<br><br>"}