{"job title": "Data Scientist, FBA fees", "company": "Amazon", "city state": "– US, WA, Seattle", "rating": "3.8", "job description": "Fulfillment by Amazon (FBA) leverages Amazons global fulfillment and customer service network for third party sellers who want to grow their business on and off Amazon.com. FBA enables customers to take advantage of Free Super Saver Shipping and Amazon Prime on third party items, while sellers can focus on selling rather than shipping.\n<br><br>\nThe FBA Fees Advanced Analytics team is looking for a talented Data Scientist to leverage the latest in data mining, predictive modeling and optimization methods to drive key insights and enhance our pricing calculation models. The Data Scientist will be responsible for developing quantitative models to improve our understanding of seller's behaviors and costs, and measure the impact of pricing on the FBA business across North America, Europe and Asia.\n<br>\nThe ideal candidate will have outstanding analytical and modeling capabilities, advanced statistical skills and strong business acumen. He/she will be a self-starter, comfortable with ambiguity and able to break down large, complex problems into smaller solvable ones. He/she will think big and be creative (while paying careful attention to detail), and will enjoy working in a fast-paced dynamic environment with other data scientists, research scientists, economists, product managers, and software engineers.\n<br><br>\n<strong>Responsibilities:</strong>\n<br>\n· Drive development of quantitative models necessary for the evaluation and implementation of pricing strategies for new features or services.\n<br>\n· Develop tools and methods to understand sellers behaviors related to pricing changes.\n<br>\n· Analyze and solve business problems at their root, stepping back to understand the broader context.\n<br>\n· Write high quality code to retrieve and analyze data in order to apply advanced statistical and machine learning techniques.\n<br>\n· Collaborate with software developers to insure proper implementation of complex models.\n<br>\n· Partner with other scientists and economists on model development.\n<br>\n· Manage and execute entire projects or components of large projects from start to finish including project management, data gathering and manipulation, synthesis and modeling, problem solving, and communication of insights and recommendations."}