{"job title": "Scientist, Data Management", "company": "CSL Behring", "city state": "– Kankakee, IL", "rating": "3.1", "job description": "Scientist, Data ManagementUnited States of AmericaR-0732462010 CSL Behring L.L.C.\n\n\n<ul>\n<li>*Job Description**</li>\n</ul>\n\nUnder minimal supervision, lead the implementation and/or maintenance of the R&amp;D Data Management tool (s). Defines current state of R&amp;D Data Management and develops and/or maintains a system suitable to current industry standards.\n<br><br>\nServe as data analytics SME in support of management and scientists of all R&amp;D areas. Works through simple and complex data analysis, providing insights on data interpretation with a multitude of areas, products, and topics.\n<br><br>\nDriven by Quality by Design (QbD) principles, develops process improvement strategies for data generation, interpretation, and solutions generation.\n<br><br>\nResponsible for analyzing complex data, anticipating potential opportunities for yield and quality improvements and escalating findings to R&amp;D areas of ownership. Collaborate with area SMEs to strategize, design, and implement remedial actions and monitor resolution.\n<br><br>\nRequired to maintain an appropriate level of documentation and communication through timely and thorough drafting and execution of protocols and reports.\n<br><br>\nRequired to maintain an awareness of and compliance with current Good Manufacturing Practices and Good Laboratory Practices.\n<br><br>\nMay be required to completes any other duties/responsibilities assigned by management.\n\n\n<ul>\n<li>*Education**</li>\n</ul>\n\nBS/BA, MS, Ph.D. in science-related fields such as Chemistry, Biochemistry, Bioprocess Engineering, Mathematics\n\n\n<ul>\n<li>*Experience**</li>\n</ul>\n\n+ 6+ years? experience with proven technical leadership roles in project deliveries and data analysis for process development or manufacturing support. Possesses knowledge and experience in design of data analytics systems in similar industry. Experienced and proficient in statistical analysis.\n<br><br>\n+ Preferred: Experience in projects with high levels complexity, equivalent to Green belt/Black belt with the use of standard analysis tools for MVDA. Experience in Quality by Design topics in biopharmaceutical development and manufacturing.\n\n\n<ul>\n<li>*Competencies**</li>\n</ul>\n\n+ Communicates Effectively\n<br><br>\n+ Decision Quality\n<br><br>\n+ Drives Results\n<br><br>\n+ Self-Development\n<br><br>\n+ Instills Trust\n<br><br>\n+ Manages Complexity\n<br><br>\n+ Collaboration\n<br><br>\n+ Problem Solving\n<br><br>\n<strong>Share:</strong>\n<br><br>\nState/Province : Illinois\n<br><br>\nCity : Kankakee\n<br><br>\nStreet Address : 1201 N. Kinzie\n<br><br>\nPrimary Location : CSL Behring Kankakee\n\n\n<ul>\n<li>*Equal Opportunity Employer**</li>\n</ul>\n\nCSL is an Equal Opportunity Employer. If you are an individual with a disability and need a reasonable accommodation for any part of the application process, please click below."}