{"job title": "Agronomic Data Scientist", "company": "DuPont", "city state": "– Johnston, IA", "rating": "3.5", "job description": "<ul>\n<li>*Agronomic Data Scientist (Job Number: 197590W-01)**</li>\n<li>*Description**</li>\n</ul>\n\n<strong>The Opportunity:</strong>\n<br><br>\nCorteva Agriscience? has a rich history of scientific discovery that has enabled countless innovations. We?re looking for more people, in more places, to collaborate with us to create a market-shaping, agriculture company with leading positions in seed technologies, crop protection and digital agriculture.\n<br><br>\nWe need Soil or Agronomic Data Scientists to collaborate with visionary crop scientists, agronomists, plant breeders, and engineers to build digitally enabled science and business capabilities.\n\n\n<ul>\n<li>*Are you looking for an opportunity to use your data science skillset to contribute to our team and help us on our mission!?**</li>\n</ul>\n\n<strong>In this role, you will:</strong>\n<br><br>\n+ Engage with a team of domain scientists, data scientist, engineers, and software developers assembled to identify business problems, provide data driven solutions, and deliver production applications which enhance value and efficiency for collaborators and customers.\n<br><br>\n+ Identify, acquire, and engineer feature data sets and pipelines with potential to address customer needs.\n<br><br>\n+ Capability to apply machine learning, statistical or mechanistic models and other computational approaches to extract insights from datasets in complex agronomic systems.\n<br><br>\n+ Develop, prototype, and implement data pipeline and software solutions with engineering and production teams.\n<br><br>\n+ Collaborate with scientists from multiple domains in solution/experiment design and analyses.\n<br><br>\n+ Conduct and communicate results of research on data science approaches to improve decisions, add value to services, extend or improve in-house models and algorithms, and contribute to the advancement of these ideas into the marketplace.\n<br><br>\n+ Uphold Corteva Agriscience? Core Values at all times.\n\n\n<ul>\n<li>*Qualifications**</li>\n</ul>\n\n<strong>About you:</strong>\n<br><br>\n+ You have outstanding problem solving skills and a proven ability to independently deliver analytic solutions by asking the right questions, identifying necessary data sources, building predictive models, and producing actionable results.\n<br><br>\n+ Expertise in machine learning, data mining, statistical methodology, or simulation modeling and demonstrated experience using these techniques to solve research problems.\n<br><br>\n+ Proficiency in Python or R.\n<br><br>\n+ Experince with geospatial and remote sensing data.\n<br><br>\n+ Strong skills in building visualizations of scientific data.\n<br><br>\n+ Familiarity with cloud based or HPC systems and computation in linux.\n<br><br>\n+ Proven ability to work in a team setting and ability to complete complex projects on time and in budget.\n<br><br>\n+ Superior communication skills, both verbal and written.\n<br><br>\n+ An M.S. or PhD and demonstrated experience with quantitative applications in Soil, Hydrology, Agronomy/Plant Sciences, Geography, Ecology, Climatology or related fields. Or conversely, you have an M.S. or PhD in Computer Science, Physics, Mathematics, or Statistics with demonstrated Data Science applications in Agronomic or Natural sciences.\n<br><br>\n<strong>Nice to have:</strong>\n<br><br>\n? Capability with Relational or NoSQL databases.\n<br><br>\n? Experience using Docker\n<br><br>\nWe are excited to announce that Corteva Agriscience? is the name of the new Agriculture Division of DowDuPont?. We are bringing together DuPont Crop Protection, DuPont Pioneer and DowAgroSciences to create a market-shaping, standalone agriculture company with leading positions in seed technologies, crop protection and digital agriculture. We will work across the global agriculture value chain to create a more efficient food system.\n<br><br>\nAt Corteva Agriscience?, we seek to enrich the lives of those who produce and those who consume. This means we will help rejuvenate the agricultural ecosystem to support people and the planet and to ensure progress for generations to come.\n\n\n<ul>\n<li>*Primary Location:** _NA-United States-Iowa-Johnston_</li>\n<li>*Organization:** _Pioneer_</li>\n<li>*Schedule:** _Full-time_</li>\n<li>*Education Level:** _Master's Degree (?18 years)_</li>\n<li>*Employee Status:** _Regular_</li>\n<li>*Job Type:** _Experienced_</li>\n</ul>\n\nDuPont is an equal opportunity employer. Qualified applicants will be considered without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability or any other protected class. If you need a reasonable accommodation to search or apply for a position, please visit our Accessibility Page for Contact Information. For US Applicants: See the ?Equal Employment Opportunity is the Law? poster."}