{"job title": "Senior Managing Data Scientist, Digital Analytics", "company": "Kaiser Permanente", "city state": "– Burbank, California", "rating": "3.9", "job description": "Provides oversight and/or leads major projects that inform the growth and market strategies essential to KP's revenue, membership and margin goals. Strategic Market Planning Managers provide analytical/strategic-thinking and leadership skills that enable project teams to:\n<br>\n1) isolate business issues;\n<br>\n2) design and execute analytics for studying business issues (market research, scenario planning, forecasting, market share, profitability, etc);\n<br>\n3) bring technical/content expertise (competitive intelligence, utilization, financial analysis, market research, deep data analysis &amp; programming);\n<br>\n4) vet findings and make formal recommendations to senior levels of KP leadership;\n<br>\n5) review/approve strategic recommendations. Incumbents would manage teams whose work includes membership forecasts &amp; goals, strategies to achieve membership, revenue &amp; margin goals, market research findings, competitive intelligence insights. Selects, develops, evaluates, coaches, and advises personnel.\n<br><br>\n<strong>Essential Functions:</strong>\n\n<li> Works with director to develop scope of work for team, sequencing, defining value proposition, setting strategic and business direction, context &amp; priorities for the team.\n\n</li><li> Provides oversight, coaching &amp; management to more senior individual contributors (e.g. Analysts, Data Consultants, Senior Market Strategy Consultants I, Senior Market Strategy Consultants II, and Senior Data Consultants).\n\n</li><li> Educate and communicate goals, strategy, and methodologies clearly and persuasively.\n\n</li><li> Build relationships with internal and external partners.\n<br><br>\n<strong>Preferred Experience:</strong>\n<br>\nTrack record of Paid Search Analytics\n<br><br>\n<strong>Basic Qualifications:</strong>\n<br>\nExperience\n\n</li><li> Minimum eight (8) years of content/functional experience.\n\n</li><li> Minimum two (2) years of management experience, OR;\n\n</li><li> Master's degree and a minimum four (4) years of experience.\n<br>\n<strong>Education</strong>\n\n</li><li> Bachelor's degree in business, economics, mathematics, statistics, OR four (4) years of experience in related field.\n\n</li><li> High School Diploma or General Education Development (GED) required.\n<br>\nLicense, Certification, Registration\n\n</li><li> N/A\n<br><br>\n<strong>Additional Requirements:</strong>\n\n</li><li> Advanced knowledge (broad expertise or unique knowledge) of policies, practices and systems.\n\n</li><li> Develops advanced concepts, techniques, and standards.\n\n</li><li> Develops new applications based on professional principles and theories.\n\n</li><li> Viewed as functional expert in field within KP.\n\n</li><li> Applies advanced principles, theories, and concepts.\n\n</li><li> Contributes to the development of innovative principles and ideas.\n\n</li><li> Must be able to work in a Labor/Management Partnership environment.\n<br><br>\n<strong>Preferred Qualifications:</strong>\n\n</li><li> Minimum eight (8) years of content/functional experience preferred.\n\n</li><li> Minimum three (3) years of management experience preferred.\n\n</li><li> Master's degree preferred.\n<br></li>"}