{"job title": "Azure Data Scientist, Manager", "company": "KPMG", "city state": "– Seattle, WA", "rating": "3.8", "job description": "Azure Data Scientist, Manager\n\n\n<ul>\n<li>*Seattle, Washington**</li>\n<li>*Requisition #:** 32844</li>\n<li>*Practice Area:** Business Support Services</li>\n<li>*Location:** Irvine, CA; Atlanta, GA; New York, NY; Seattle, WA</li>\n</ul>\n\nInnovate. Collaborate. Shine. Lighthouse ? KPMG's Center of Excellence for Advanced Analytics ? has both applied data science, AI, and big data architecture capabilities. Here, you?ll work with a diverse team of sophisticated data and analytics professionals to explore solutions for clients in a platform-diverse environment. This means your ability to find answers is limited only by your creativity in leveraging a vast array of techniques and tools. Be a part of a high-energy, diverse, fast-paced, and innovative culture that delivers with the agility of a tech startup and the backing of a leading global consulting firm. For you, that translates into the chance to work on a wide range of projects ? covering technologies and solutions from AI to optimization ? and the power to have a real impact in the business world. So, bring your creativity and pioneering spirit to KPMG Lighthouse.\n<br><br>\nKPMG is currently seeking an Azure Data Scientist to join- Center of Excellence for Advanced Analytics.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\n+ Passion for solving previously unsolvable business problems through the innovative combination of data and new AI cloud technologies\n<br><br>\n+ Manage complex engagements, mentor others and interface with senior level management internally as well as with clients and support project leaders in tracking and communicating project risks, budget, rates, and launch/closeout activities, including the administration of work papers and collaboration sites\n<br><br>\n+ Analyze and model structured data and implement algorithms to support analysis using advanced statistical and mathematical methods from statistics, machine learning, data mining, econometrics, and operations research\n<br><br>\n+ Perform Statistical Natural Language Processing to mine unstructured data, using methods such as document clustering, topic analysis, named entity recognition, document classification, and sentiment analysis\n<br><br>\n+ Utilize a diverse array of Microsoft Azure and open source technologies and tools as needed, to deliver insights, such as R, Python, Azure Machine Learning, Azure Search, Azure R/Machine Learning Server, Azure Cognitive Services and Azure Bot Framework &amp; Services\n<br><br>\n+ Help drive client engagements focused on Big Data and advanced business analytics, in diverse domains such as risk management, product development, marketing research, supply chain, public policy; communicate results and educate others through reports and presentations\n<br><br>\n<strong>Qualifications:</strong>\n<br><br>\n+ A minimum of seven years of professional experience working as a Data Scientist\n<br><br>\n+ Master's, or PhD in Computer Science, Statistics, Mathematics, Engineering, Econometrics, or related fields from an accredited college or university\n<br><br>\n+ Strong mathematical background with strong knowledge in at least one of the following fields: statistics, data mining, machine learning, statistics, operations research, econometrics, natural language processing, and/or information retrieval and experience with command-line scripting, data structures, and algorithms; ability to work in a Linux environment\n<br><br>\n+ Proficiency in analysis (e.g. R, Azure Machine Learning) packages as well as proficiency in programming languages (e.g. Python, .NET, Ruby, Java, and Scala)\n<br><br>\n+ Ability to travel up to eighty percent of the time\n<br><br>\n+ Applicants must be currently authorized to work in the United States without the need for visa sponsorship now or in the future\n<br><br>\nKPMG LLP (the U.S. member firm of KPMG International) offers a comprehensive compensation and benefits package. KPMG is an equal opportunity employer. All qualified applicants are considered for employment without regard to race, color, creed, religion, age, sex/gender, national origin, ancestry, citizenship status, marital status, sexual orientation, gender identity or expression, disability, physical or mental handicap unrelated to ability, pregnancy, veteran status, unfavorable discharge from military service or military status, genetic information, genetic disposition and or carrier status, domestic violence status, personal appearance, family responsibility, matriculation or political affiliation, status with regard to public assistance, or other legally protected status. KPMG maintains a drug-free workplace. KPMG will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of applicable local, state or federal law (including San Francisco Ordinance number 131192). No phone calls or agencies please.\n\n\n<ul>\n<li>*Our Benefits**</li>\n<li>*Health**</li>\n</ul>\n\nKPMG offers a range of medical insurance options to meet your needs as well as prescription drug coverage, health care flexible spending accounts, and dependent day care flexible spending accounts.\n\n\n<ul>\n<li>*Personal Time Off (PTO)**</li>\n</ul>\n\nUp to 30 PTO Days per year (depending on job classification/level/years of service).\n\n\n<ul>\n<li>*Financial**</li>\n</ul>\n\n+ 401(k) and Pension Plans\n<br><br>\n+ Dependent Care Flexible Spending Account\n<br><br>\n+ Health Care Flexible Spending Account\n<br><br>\n+ Mortgage Assistance Program\n<br><br>\n+ HomeBenefits@Work Program\n<br><br>\n+ Hyatt Legal Plan\n\n\n<ul>\n<li>Benefits vary by employment status.</li>\n</ul>"}