{"job title": "EMR Data Scientist (PhD)", "company": "SEMA4", "city state": "– Stamford, CT", "rating": "2.7", "job description": "Sema4, a health information company, is seeking computational research scientist to join Clinical Informatics team to develop and study novel approaches in translational bioinformatics, or the application of analytic and interpretive methods to optimize the transformation of integration of EMR and multi-omics data of many types into proactive, predictive, preventative, and wellness. Our goal will be advancing novel diagnostics, therapeutics, and insights into both diseases and wellness; with the aim to deliver clinical applications into practice and help clinicians work more efficiently, and bring impact to improve patient outcomes. We are developing innovative new features within and along side the frameworks and clinical applications utilized in the comprehensive big data domain. The right candidate will work with software engineers and biostatisticians within the Clinical Informatics team, and others in R&amp;D including bioinformatics and data sciences teams in a multidisciplinary environment.\n<br><br>\n<strong><u>Responsibilities:</u></strong>\n<br><br>\nDevelop and apply topological analysis method for disease subtypes stratification and patient disease profile identification.\n<br><br>\nBuild tools and approaches for integrated big data analytics using various database sources, including multi-omics data, EMR, behavioral, environmental, and imaging data.\n<br><br>\nBuild drug risk models for advancing medication indication or new side effects identification.\n<br><br>\nCollaborate with team members and other scientists on analyzing EMR and genomic data for eMERGE algorithm development.\n<br><br>\nWork with business development team for collaborating with pharmaceutical / payer to identify patient cohorts for drug repurposing and observational studies and to deliver clinical utilities.\n<br><br>\nBring experience in machine learning with a proven track record of developing and applying advanced computational techniques to solve complex disease problems.\n<br><br>\nExperience working with high-performance computing clusters, especially ones designed for AI/machine learning applications.\n<br><br>\n<strong><u>Requirements:</u></strong>\n<br><br>\nPhD in Computer Science, Computer Engineering, Bioinformatics, or Computational Biology related field.\n<br><br>\n5+ years experience in post-graduate or healthcare/biotech/pharma experience in analyzing large data sets with advanced analytics approaches.\n<br><br>\nDeep knowledge of advanced machine learning methodologies such as deep learning, graphical models, and natural language processing.\n<br><br>\nStrong background in developing new algorithms and implementing algorithms from the scientific literature.\n<br><br>\nSolid experience with programming and scripting (R, Python, Java, etc.)\n<br><br>\nExperience with SQL, Oracle databases\n<br><br>\nHigh-performance computing experience preferred\n<br><br>\nExcellent written and oral communication skills and ability to build strong relationships."}