{"job title": "Senior Data Scientist Engineer", "company": "Splunk", "city state": "– San Jose, CA", "rating": "3.8", "job description": "Join us as we pursue our disruptive new vision to make machine data accessible, usable and valuable to everyone. We are a company filled with people who are passionate about our product and seek to deliver the best experience for our customers. At Splunk, we?re committed to our work, customers, having fun and most importantly to each other?s success. Learn more about Splunk careers and how you can become a part of our journey!\n\n\n<ul>\n<li>Role:*</li>\n</ul>\n\nSplunk IT Operations and Analytics team is looking for a seasoned data scientist engineer to build the next generation of Splunk products that provide IT and Ops users with meaningful insights into all aspects of modern day IT and Apps infrastructure and technology stacks. You will be developing state of the art web applications that help customers collect, analyze, correlate, and visualize data. You will be interacting with product management and customers to understand and refine requirements. You will also work with other engineering teams across Splunk to design and build high-performance solutions.\n\n\n<ul>\n<li>Responsibilities:*</li>\n<li>You understand various types of data</li>\n<li>You will closely interact with the research team as well as product management to derive requirements for how the data should be processed and what we are looking for</li>\n<li>You will research, evaluate and implement statistical methods to track metrics</li>\n<li>Implementation of the solutions in a product environment</li>\n<li>You will derive data insights and bring them back to the product management team</li>\n<li>You will interact with various teams and areas throughout the product organization to collect feedback, improve the backlog, and define best practices for machine learning related matters.</li>\n<li>You will design and implement web applications (large scale, distributed system)</li>\n<li>You will quickly learn new technologies and product areas</li>\n<li>You will analyze and tackle performance and scalability problems</li>\n<li>You will work with Technical Support on identifying and troubleshooting issues</li>\n<li>Requirements:*</li>\n<li>5-10 years of relevant industry experience</li>\n<li>Experience with Java or Scala C++ Go or similar language</li>\n<li>Expert level knowledge of Python programming language</li>\n<li>Excellent problem-solving skills and great attention to details</li>\n<li>Strong communication interpersonal skills, both verbal and written</li>\n<li>Leadership mentorship with strong accountability skills</li>\n<li>Math, Statistics or CS background with emphasis in Machine Learning</li>\n</ul>\n\n<strong>Nice to have:</strong>\n\n\n<ul>\n<li>You have experience working with large datasets, preferably using tools like SQL, Hadoop, MapReduce, Pig, Hive</li>\n<li>What we offer you:*</li>\n<li>A constant stream of new things to learn. We're always expanding into new areas, bringing in open source projects and contributing back, and exploring new technologies.</li>\n<li>A set of exceptionally talented and dedicated peers, all the way from engineering and QA to product management and customer support.</li>\n<li>Breadth and depth. You want to work on an area that spans backend and frontend and SDKs? We have that.</li>\n<li>Growth and mentorship. We believe in growing engineers through ownership and leadership opportunities. We also believe mentors help both sides of the equation.</li>\n<li>A stable, collaborative and supportive work environment. We work in an open environment, have a shared kitchen and sit down for a quick sync every morning.</li>\n<li>We don't expect people to work 12 hour days. We want you to have a successful time outside of work too. Want to work from home sometimes? No problem. We trust our colleagues to be responsible with their time and dedication, and believe that balance helps cultivate a great environment.</li>\n<li>About Splunk*</li>\n</ul>\n\nSplunk was founded to pursue a disruptive new vision: make machine data accessible, usable and valuable to everyone. Machine data is one of the fastest growing and most complex areas of big data?generated by every component of IT infrastructures, applications, mobile phone location data, website clickstreams, social data, sensors, RFID and much more.\n<br><br>\nSplunk is focused specifically on the challenges and opportunity of taking massive amounts of machine data, and providing powerful insights from that data. IT insights. Security insights. Business insights. It?s what we call Operational Intelligence.\n<br><br>\nSince shipping its software in 2006, Splunk now has over 13,000 customers in more than 110 countries around the world. These organizations are using Splunk to harness the power of their machine data to deepen business and customer understanding, mitigate cybersecurity risk, prevent fraud, improve service performance and reduce costs. Innovation is in our DNA ? from technology to the way we do business. Splunk is the platform for Operational Intelligence!\n<br><br>\nSplunk has more than 2,700 global employees, with headquarters in San Francisco, an office in San Jose, CA and regional headquarters in London and Hong Kong.\n<br><br>\nWe?ve built a phenomenal foundation for success with a proven leadership team, highly passionate employees and unique patented software. We invite you to help us continue our drive to define a new industry and become part of an innovative, and disruptive software company.\n\n\n<ul>\n<li>Benefits &amp; Perks: Wow! This is really cool!*</li>\n<li>SF Only*</li>\n</ul>\n\nMedical, full company paid Dental, Vision and Life Insurance, Flexible Spending and Dependent Care Accounts, Commuter Accounts, Employee Stock Purchase Plan (ESPP), 401(k), 3 weeks of PTO, sick leave, stocked micro kitchens in Splunk offices, catered lunches on Mondays, catered breakfast on Fridays, basketball hoops, ping pong, arcade games, BBQ?s, soccer, ?Fun Fridays?.\n<br><br>\nPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\n\n\n<ul>\n<li>Non SF*</li>\n</ul>\n\nMedical, full company paid Dental, Vision and Life Insurance, Flexible Spending and Dependent Care Accounts, Commuter Accounts, Employee Stock Purchase Plan (ESPP), 401(k), 3 weeks of PTO and sick leave. Our work environments vary by location however we believe in hosting amenities and fun activities to fuel our energy. You may find fully stocked micro kitchens, catered lunches on Mondays and breakfast on Fridays, basketball hoops, ping pong, arcade games, BBQ?s, soccer and ?Fun Fridays?.\n<br><br>\nThis isn?t a job ? it?s a life changer ? are you ready?\n<br><br>\nIndividuals seeking employment at Splunk are considered without regards to race, religion, color, national origin, ancestry, sex, gender, gender identity, gender expression, sexual orientation, marital status, age, physical or mental disability or medical condition (except where physical fitness is a valid occupational qualification), genetic information, veteran status, or any other consideration made unlawful by federal, state or local laws. Click here to review the US Department of Labor?s EEO is The Law notice. Please click here to review Splunk?s Affirmative Action Policy Statement.\n<br><br>\nSplunk does not discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. Please click here to review Splunk?s Pay Transparency Nondiscrimination Provision.\n<br><br>\nSplunk is also committed to providing access to all individuals who are seeking information from our website. Any individual using assistive technology (such as a screen reader, Braille reader, etc.) who experiences difficulty accessing information on any part of Splunk?s website should send comments to accessiblecareers@splunk.com. Please include the nature of the accessibility problem and your e-mail or contact address. If the accessibility problem involves a particular page, the message should include the URL of that page.\n<br><br>\nSplunk doesn't accept unsolicited agency resumes and won't pay fees to any third-party agency or firm that doesn't have a signed agreement with Splunk.\n<br><br>\nTo check on your application click here."}