{"job title": "Sr. Data Scientist", "company": "Stride Search", "city state": "– California, United States", "rating": "NA", "job description": "As a Data Scientist, you will focus on improving and deepening\n<br>\nthe level of understanding of our reader behavior. Your goal will\n<br>\nbe to extract meaning from the data and advise our editorial and\n<br>\ndevelopment teams on your findings. You look to tell a story\n<br>\nbased on your findings to assist in developing the product road\n<br>\nmap to customize our content to better suit our reader. This\n<br>\nposition will bring analytical rigor and statistical methods to\n<br>\nthe challenges of measuring and understanding the behavior of the\n<br>\n40 million+ women that shop and consume content every month.\n<br><br>\n<strong>As a Data Scientist, you will:</strong>\n\n\n<ul>\n<li>Research, develop, and apply methods for measuring and</li>\n</ul>\n\nanalyzing the performance of the media site and targeted email\n<br>\nproducts.\n\n\n<ul>\n<li>Develop new algorithms and methods for optimizing content</li>\n</ul>\n\nperformance, revenue, and adoption.\n\n\n<ul>\n<li>Research new ways for modeling and predicting reader</li>\n</ul>\n\nbehavior.\n\n\n<ul>\n<li>Lead investigations streams of content usage and A/B testing.</li>\n</ul>\n\nAdvise product team on new features and modules based on\n<br>\nfindings.\n\n\n<ul>\n<li>Design experiments and models to answer targeted questions.</li>\n</ul>\n\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>At least 4 years of hands-on experience working with large</li>\n</ul>\n\ndata sets.\n\n\n<ul>\n<li>Minimum of a BS in a quantitative discipline such as</li>\n</ul>\n\nStatistics, Engineering, Computer Science, Applied Mathematics,\n<br>\netc.\n\n\n<ul>\n<li>Demonstrated proficiency in SQL, SAS, Matlab, or R.</li>\n<li>Comfortable writing code in python, ruby, perl, or equivalent</li>\n</ul>\n\nscripting language.\n\n\n<ul>\n<li>Ability to understand business problems, draw conclusions</li>\n</ul>\n\nfrom data and recommend actions on how best to solve these\n<br>\nproblems.\n\n\n<ul>\n<li>Demonstrated self-direction.</li>\n</ul>\n\n<strong>Nice to Haves:</strong>\n\n\n<ul>\n<li>Experience with Hadoop/Spark, Scala, MySQL, Redshift and</li>\n</ul>\n\nother Amazon AWS"}