{"job title": "Senior Data Scientist", "company": "Stride Search", "city state": "– California, United States", "rating": "NA", "job description": "You will work with a highly talented and fast-moving team to\n<br>\nfocus on improving and deepening our understanding of core\n<br>\nbusinesses. Search is what we do, and optimizing search is the\n<br>\nkey to our future success. Your goal will be to extract meaning\n<br>\nfrom the data and advise our product and business teams on your\n<br>\nfindings. Tell us a story based on your findings about search,\n<br>\nsort, relevance, and even our recommendation algorithm to assist\n<br>\nin developing the product road map to better suit our end-users.\n<br>\nYou must be self-directed, deeply curious, collaborative, and an\n<br>\nexcellent communicator. This position will bring analytical rigor\n<br>\nand statistical methods to the challenges of measuring and\n<br>\nunderstanding the behavior of the millions of daily shoppers.\n<br><br>\n<strong>In this role you will:</strong>\n\n\n<ul>\n<li>Research, develop, and apply methods for measuring and</li>\n</ul>\n\nanalyzing the performance of our shopping search engine.\n\n\n<ul>\n<li>Develop new search algorithms and methods for optimizing the</li>\n</ul>\n\nvalue to end-users and improve customer retention.\n\n\n<ul>\n<li>Research new ways for modeling and predicting end-user</li>\n</ul>\n\nbehavior.\n\n\n<ul>\n<li>Lead investigation streams of product data, advise product</li>\n</ul>\n\nteam on new features and modules based on findings.\n\n\n<ul>\n<li>Design, conduct, and analyze A/B tests.</li>\n<li>Design experiments to answer targeted questions.</li>\n</ul>\n\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>Minimum of a MS in a quantitative discipline such as</li>\n</ul>\n\nStatistics and/or Applied Mathematics.\n\n\n<ul>\n<li>At least 5 years of hands-on experience applying statistical</li>\n</ul>\n\ntechniques to large data sets.\n\n\n<ul>\n<li>At least 5 years of hands-on experience with search engine</li>\n</ul>\n\nalgorithms and technology.\n\n\n<ul>\n<li>Proficiency with various statistical techniques including</li>\n</ul>\n\nregression, support vector machines, bagging, boosting,\n<br>\ndecision trees, lifetime analysis, clustering, recommendation\n<br>\nsystems, etc.\n\n\n<ul>\n<li>Demonstrated proficiency in SQL, and tools like SAS, Matlab,</li>\n</ul>\n\nor R.\n\n\n<ul>\n<li>Comfortable writing code in Python, Scala and/or Java.</li>\n<li>Ability to understand business problems, draw conclusions</li>\n</ul>\n\nfrom data and recommend actions on how best to solve these\n<br>\nproblems.\n\n\n<ul>\n<li>Demonstrated self-direction.</li>\n</ul>\n\n<strong>Nice to Haves:</strong>\n\n\n<ul>\n<li>Experience with Redshift, MySQL, Hadoop/Spark, Cassandra and</li>\n</ul>\n\nAmazon AWS.\n\n\n<ul>\n<li>Experience with Lucene and SOLR search platforms.</li>\n<li>E-commerce domain expertise.</li>\n<li>Love shopping and fashion.</li>\n</ul>"}