{"job title": "Data Scientist, Applied Machine Learning", "company": "Tempus Labs", "city state": "– Chicago, IL", "rating": "2.9", "job description": "With the advent of genomic sequencing, we can finally measure and process our genetic makeup. We now have more data than ever before, but providers often don't have the infrastructure or expertise required to easily extract the valuable insights that exist within this data. Here at Tempus we believe the greatest promise for the detection and treatment of cancer &amp; other diseases lies in building a deep understanding of the interaction between molecular attributes and clinical treatment.\n<br><br>\nWe're on a mission to redefine how genomic data is used in a clinical setting. We are looking for data scientists who are passionate about applying state of the art techniques to the processing and analysis of vast amounts of clinical, molecular, and imaging data.\n<br><br>\nWhat You'll Do\n\n<ul>\n<li>Collaborate with product, science, engineering, and business development teams to build the most advanced data platform in precision medicine</li>\n<li>Design and prototype novel data visualization and analysis tools and algorithms</li>\n<li>Wrangle and analyze large diverse sparse datasets, extract insights, and drive further research opportunities</li>\n<li>Interrogate analytical results for robustness, validity, and out of sample stability</li>\n<li>Document, summarize, and present your findings to a group of peers and stakeholders</li>\n</ul>\nQualifications\n\n<ul>\n<li>Degree in computer science, software engineering, statistics, machine learning, bioinformatics or related technical field</li>\n<li>2+ years full time employment experience building and validating predictive models on structured or unstructured data</li>\n<li>Proficient in Python, and SQL</li>\n<li>Experience with the following: Pandas, NumPy, SciPy, Scikit-learn, Jupyter Notebooks</li>\n<li>Experience with supervised and unsupervised machine learning algorithms, and ensemble methods, such as: K-Means, PCA, Regression, Neural Networks, Decision Trees, Gradient Boosting</li>\n<li>Experience working in a Linux / Mac environment</li>\n<li>Outstanding programming and problem solving skills</li>\n<li>Self-driven and work well in an interdisciplinary team with minimal direction</li>\n<li>A strong desire to understand why things work the way they do</li>\n<li>Thrive in a fast-paced environment and willing to shift priorities seamlessly</li>\n<li>Experience with communicating insights and presenting concepts to diverse audiences</li>\n</ul>\nNice to Haves\n\n<ul>\n<li>Kaggle.com competitions and/or kernels track record</li>\n<li>Experience working with clinical and/or genomic data</li>\n<li>Experience with AWS architecture</li>\n<li>Experience with: Git, matplotlib, seaborn, HTML5, CSS3, JavaScript, D3, Plot.ly, Flask, Dask</li>\n<li>Experience in agile environments and comfort with quick iterations</li>\n</ul>"}