{"job title": "Senior Data Scientist", "company": "Walmart", "city state": "– SUNNYVALE, CA", "rating": "3.2", "job description": "<strong>Position Description</strong><br><br>Proficient in Java or Python\n<br>\nBig Data knowledge - Hadoop, Pig, Hive, Spark\n<br>\nMathematical, Statistics, operations research background preferred\n<br>\nProven experience with building models working with big data<br><br><strong>Minimum Qualifications</strong><br><br>Master or PhD in the areas of Statistics, Operation Research, Computer Science or Electrical Engineering.\n<br>\nAt least 3-4 years of experience applying machine learning solving real business and customer problems.\n<br>\nProficient knowledge in Java, Scala or Python\n<br>\nGood understanding and practical knowledge of Neural Networks and use of transfer learning.\n<br>\nExperience with Big Data (Spark, Hive, Pig, etc)<br><br><strong>Additional Preferred Qualifications</strong><br><br>AI / Deep learning (Tensorflow, Keras, etc)\n<br>\nUnderstanding of NN\n<br>\nNLP<br><br><strong>Company Summary</strong><br><br>The Walmart eCommerce team is rapidly innovating to evolve and define the future state of shopping. As the worlds largest retailer, we are on a mission to help people save money and live better. With the help of some of the brightest minds in technology, merchandising, marketing, supply chain, talent and more, we are reimagining the intersection of digital and physical shopping to help achieve that mission.<br><br><strong>Position Summary</strong><br><br>You will be part of the Walmart Personalization &amp; AI group supporting the Walmart International markets.\n<br><br>\nWe work closely with our business partners, product, UI/UX teams and engineering teams to deliver solutions and experiences that delight our customers. Our mission is to infuse with personalization and AI every single customer touchpoint.\n<br><br>\nWe are more than a data science or a technology team. We are equal partners in every step of the process defining and shaping the experiences our customers use every day. We are a small but very agile team building multi tenant personalization and data science solutions and then adapt them for each individual market. We are customer centric and have a passion of using data (a lot), algorithms, building models or neural networks to solve real and impactful customer problems.\n<br><br>\nYou will help us rethink and shape the future of online groceries, fashion, house furnishing and meal planning using AI.\n<br><br>\nFor fashion and house furnishing, you will use image recognition and neural style transfer to dynamically create outfits and room sets for international customers.\n<br><br>\nFor online groceries we want to talk personally to each customer, understand them and their dietary needs and help them complete their shopping journey as quickly as possible. Our goal here is to create a virtual grocery store for each customer. One of the ways of accomplishing this is by using in session personalization using RNNs.\n<br><br>\nFinally, with meal planning we plan to Inspire our customers and make their shopping journey fun again!\n<br><br>\nAnd accomplish the above across all channels including voice!\n<br>"}