{"job title": "Customer Service Data Analyst (schedule includes nights, weekends and holidays)", "company": "Wunderman", "city state": "– US-TX-Houston", "rating": "3.6", "job description": "<div><div>\n<div>Serve as a support role to many groups across Wunderman. Interaction points include Service Managers, Service Directors, Account Directors, Infrastructure support personnel, and sometimes clients. Works as part of an operational team ensuring the client’s needs are addressed within a timely manner.</div>\n</div>\n</div>\n\n<br>Responsibilities<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n\n\n<ul>\n<li>Monitoring day to day Database activity</li><li>Communicating with Service Management on client needs</li><li>Error reporting and diagnosis</li><li>Understanding of data processing in a Direct Marketing environment</li><li>Work effectively with programming and technical staff to resolve system issues</li><li>Provide process improvements to aid in client development</li><li>Able to provide information for problem resolution</li><li>Provide technical assistance and support for incoming queries and issues</li><li>Identify and coordinate process improvements with DS Supervisor</li><li>Meet with Delivery Scheduling Supervisor to discuss upcoming projects/issues</li></ul>\n</ul>\n\n</div>\n</div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n\n\n<ul>\n<li>Works well with others on a team in an effort to achieve goals or task completion, ability to work in a team environment and participate in meetings and discussions</li><li>Understands Application and Functions relating to data processing</li><li>Customer Focus – Responds to service management/customer requests in a timely manner. Communicates with service management to ensure that all needs have been met</li><li>Communication – Effectively gets ideas, thoughts and information across in written form and through speaking with others. Must clearly articulate project goals and objectives to technical and non-technical audiences</li><li>Multi-tasking – Ability to prioritize and work on multiple projects in a deadline sensitive environment</li><li>Self-Motivated/Assertive - Able to work independently with minimal supervision</li><li>Problem Solving Skills – Demonstrates the ability to break down and solve problems</li><li>Time / Task / Deadline Management – Regularly meets deadlines and demonstrates an ability to manage their time effectively</li><li>Interpersonal Skills – Demonstrates ability to effectively get along with other employees, vendors or clients</li><li>Project Management – Ability to manage a particular project from beginning to end by the due date requested, communicating with any resources that are needed</li> <li><strong><u>Skill / Knowledge / Experience Requirements:</u></strong></li> <li>Bachelor’s Degree</li><li>Customer service background a plus</li><li>Strong Microsoft Office skills</li> <li>Knowledge of database structure a plus</li><li>Database query knowledge a plus</li><li>Knowledge of Mainframe JCL a plus</li><li>BMC Control-M experience strongly preferred</li><li>Ability to learn and use new tools</li><li>Flexible schedule including nights, weekends, and holidays</li><li>Basic understanding of SQL a plus</li></ul>\n</ul>\n\n</div>\n</div>\n</div>\n<br>"}