{"job title": "Data Analyst", "company": "Aerotek, An Allegis Group Company", "city state": "– Peoria, Illinois", "rating": "NA", "job description": "We are looking to hire qualified candidates immediately!\n<br><br>\n<strong>Job Overview:</strong>\n<br>\nThis Cost Analyst supports the Cost Management team which identifies and delivers cost management projects and processes to reduce costs or mitigate potential cost increases for all parts. In addition to developing powerful visual dashboards and various analytics tools for team members to leverage, the Cost Analyst uncovers insights from complex data sets by using statistics and analytics best practices.\n<br><br>\nThis role has responsibilities of the following:<li> Identify new opportunities / project ideas to reduce the cost of components</li> <li> Monitor component costs to assist in the identification and mitigation of cost increase requests from suppliers</li> <li> Prepare weekly / monthly / ad hoc reports that detail cost reduction forecasts and actual cost performance results</li> <li> Interface with buyers, design engineers, should-cost modelers, cost leads, product groups, suppliers, and managers throughout the organization to assist with execution of cost projects</li> <li> Govern and connect several large data sets of sensitive cost data while understanding and communicating their various advantages and limitations</li> <li> Support team members with accurate data-driven answers to business questions under short turn-around times</li> <li> Coach team members on best practices and methods to perform light analytics tasks</li> <li> Develop, own, and maintain critical <strong> Microsoft PowerBI visualization dashboards</strong> that are used by business partners across the organization and must be refreshed at regular intervals</li> <li> Develop, own, and maintain processes for data collection, organization, and compilation including manual spreadsheet management and advanced Microsoft Excel macros (VBA)</li> <li> Administer the Cost Management SharePoint site by maintaining several SharePoint lists, document libraries, and automated workflows</li>\n\n<strong> The Qualifications for this position are as follows:</strong>  <li> Bachelor's Degree</li> <li> Microsoft Excel expertise (incl. advanced formulas / nested logic / PivotTables / data modeling)</li> <li> Experience developing data dashboards in visualization software (PowerBI, Tableau, Qlik, Alteryx)</li> <li> Proficiency with all Microsoft Office software (PowerPoint / Word / Visio / etc.)</li> <li> Basic understanding of statistical analysis</li> <li> Excellent written and oral communication-ability to communicate complex technical concepts to non-technical audiences</li>\n\nAll candidates should apply for immediate consideration!\n<br><br>"}