{"job title": "Google Analytics Consultant IV", "company": "Apex Systems LLC", "city state": "– San Antonio, Texas", "rating": "3.1", "job description": "<strong> Job Description</strong>\n<br><br>\n<strong> Job #:</strong>  879470<br><br>Responsibilities: Own creation of a robust set of standards and baseline for Google Analytics (GA) adoption and onboarding GA for all existing and new platforms. Goal is to integrate analytics capabilities into the Platform to capture customer and performance data that will drive future feature enhancements\n<li> Work with stakeholders across the business to evaluate analytics needs and formulate a plan for identifying gaps, recommending changes towards baseline adoption and measurement moving forward</li> <li> Consult with various engineering teams to bring customer-facing web applications in line with expected analytics practices while required needed development effort</li> <li> Review the Big Query data we receive and help parse the information for the origination</li> <li> Set up reporting, etc. and help run knowledge management experiments</li>\nProject Description:\n<li> Own creation of a robust set of standards and baseline for Google Analytics (GA) adoption and onboarding GA for all existing and new platforms. Goal is to integrate analytics capabilities into customer facing portals to capture customer and performance data that will drive future feature enhancements, inform product strategies, roadmap prioritization etc.</li>\nRequired Skills (and years of experience): TOP 5 SKILLS NEEDED\n<li> 2+ years of experience using Google Analytics and Google Tag Manager in an enterprise situation. Knowledge of best practices in creating an analytics set up, presenting data in an accessible format, and optimizing usage to keep costs under control.</li> <li> 4+ Experience with modern front end technologies (HTML5, JavaScript/ES6, CSS, frontend libraries such as ReactJS and AngularJS) in an enterprise environment</li> <li> 2+ Experience creating powerful, informative reports that bring actionable data to decision-makers across the business</li>\nRequired Soft Skills:\n<li> Experience working effectively on a distributed team and interacting with other cross functional teams ranging from product to UX etc.</li> <li> Ability to onboard and ramp up within quickly with teams that are all remote and some that have a mix of local and remote team members</li> <li> Excellent verbal and written communication skills</li> <li> Take full ownership of work</li> <li> Lead group discussions to positive compromises</li> <li> Ability to advocate a technical position while being open to alternative ideas</li>\nEducation Requirement:\n<li> Bachelors degree in computer science or related field</li>\nRequired Certifications/Testing:\n<li> Google Analytics Individual Qualification assessment</li>"}