{"job title": "Data Analyst II", "company": "Apex Systems LLC", "city state": "– Austin, Texas", "rating": "3.1", "job description": "<strong> Job Description</strong>\n<br><br>\n<strong> Job #:</strong>  869196<br><br><strong> JOB TITLE: Data Analyst II</strong>\n<br><br>\n<strong> TEAM: Quality, Speech Analytics &amp; VOC\n<br>\nLOCATIONS: Austin, TX</strong>\n<br><br>\n<strong> Quality and VOC Team Overview:</strong>\n<br><br>\nWant to work on a team focused on transforming Quality and Customer Experience across the enterprise? Join a team that is transforming the way we operate through cutting edge business intelligence. The Quality &amp; VOC team leverages state of the art Nexidia Speech technology, Quality Central and NPM to unlock hidden insights. The team builds speech studies, automated quality programs, business intelligence insights and performance management mechanisms designed to support enterprise Quality, Voice of the Customer and Performance Coaching.\n<br><br>\n<strong> Overview:</strong>\n<br><br>\nA Quality Speech Analyst will typically spend 50% of their time listening to calls and analyzing calls for our Billing, Repair, Retention, and other channels to support targeted Quality studies. Another 50% of the time will be focused on partnering with Speech Analytics Consultants to tune speech categories. The analyst will be expected to analyze patterns, identify, and align insights w/ speech studies, and document findings, insights, and trends. In addition, the speech analyst may utilize Nexidia speech analytics to identify and download calls for targeted purposes such as operational effectiveness, customer effort, legal, risk, or quality control.\n<br><br>\n<strong> Role and Responsibilities:</strong>\n<br><br>\nThe Quality Speech Analyst will take the lead in the data compilation and analysis of customer experience across the call centers through targeted call listening. The Analyst will gather data and assist with the development of in depth case studies on strategic business topics that directly relate to customer experience, risk management, operational efficiency and coaching routines. The primary focus of in depth studies will span across voice and web channels as they relate to the contact center. Studies will include analysis and recommendation of team member development, process enhancements or development, and/or technology enhancement recommendations that will positively impact the experience of our customer as it relates to the focus of the study.\n<br><br>\nThe Analyst may also define user requirements, perform user acceptance testing and/or troubleshoot systems-related operational issues. May assist ongoing production and workflow improvement efforts, report any production issues, manage small projects, and/or small segments of larger projects.\n<br><br>\nThe Analyst will also tune speech categories in support of the auto-quality program which uses speech technology to auto-score objective call criteria in the customer experience, operational effectiveness and compliance business objective areas.\n<br><br>\n<strong> Minimum Qualifications:</strong>\n<br><br>\n- 2 years reporting or analytics experience\n<br><br>\n- Experience in recognizing quality and performance measures.\n<br><br>\n- Knowledge of statistics and experience using statistical packages for\n<br>\nanalyzing datasets (Excel, SPSS, SAS etc)\n<br><br>\n- Strong with the ability to collect, organize, analyze, and disseminate\n<br>\nsignificant amounts of information with attention to detail and accuracy\n<br><br>\n- 3 + years of call center experience\n\n\n<ul>\n<li>Demonstrated ability to analyze and arrive at root cause\n<br><br>\n- Strong ability to communicate confidentially and professionally.\n<br><br>\n- Strong organizational, written and verbal communication, problem solving and</li>\n</ul>\n\ninterpersonal skills.\n<br><br>\n- Advanced experience w/ PowerPoint, Excel and Word\n<br><br>\n- Demonstrated self-starter with the ability to work independently with limited direction.\n<br><br>\n- Demonstrated ability to handle multiple tasks within short timeframes.\n<br><br>\n<strong> -</strong>  Have the ability to learn quickly, expand and grow skill set with on- the- job tasks.\n<br><br>\n- Demonstrated experience in meeting daily production goal\n<br><br>\n- Adept at queries, report writing and presenting findings\n<br><br>\n- BS in Mathematics, Economics, Computer Science, Information Management or Statistics\n<br><br>\n<strong> Preferred Qualifications:</strong>\n<br><br>\n- Knowledge of cable/telecommunication industry\n<br><br>\n- Experience with speech analytics, call recording platforms and/or quality software"}