{"job title": "SAS Analytics Consultant", "company": "Apex Systems LLC", "city state": "– Minneapolis, Minnesota", "rating": "3.1", "job description": "<strong> Job Description</strong>\n<br><br>\n<strong> Job #:</strong>  860481<br><br><strong> Project:</strong>\n<li> This group is in charge of all of analytics and reporting.</li> <li> They support internal clients on reporting needs and requirements, and help shape the reports and prepare talking points for the internal customers to use in meetings.</li> <li> The reports this group runs are very high profile</li>\n<strong> Responsibilities:</strong>\n<li> Must have strong analytic skills ability to understand what story the internal customer is trying to tell and create that story through reporting.</li> <li> Work closely with those customers to develop and deliver the reports will most accurately bring to light the information they are looking for.</li>  <li> Strong ability to create/deliver reporting and dissect talking points for those customers in their presentations</li>  <li> Strong SAS skills, ability to develop reports (SSRS not required)</li> <li> This position requires compliance with all mortgage regulatory requirements and compliance policies related to these requirements including acceptable background check investigation results. Successful candidates must also meet ongoing regulatory requirements including additional screening and required reporting of certain incidents.</li>\n<strong> Requirements:</strong>\n<li> Strong hands on SAS and/or SQL skills.</li> <li> Ability to research, trend/analyze data, summarize and recommend new strategies and solutions.</li>  <li> Demonstrated ability to communicate effectively (verbal and written) analytical results, and recommendations.</li>  <li> Demonstrated critical thinking skills with the ability to quickly recognize and resolve problems.</li>  <li> Strong organizational and time management skills with the ability to manage multiple responsibilities and tasks simultaneously.</li>  <li> Self-directed, attention to detail and take ownership on all assigned tasks timely.</li> <li> Must be a self-starter with the ability to acquire new concepts and skills quickly.</li>  <li> Technical skills that can take data and turn into a presentation/story and articulate the story surrounding the data to senior leaders in the organization.</li>  <li> Risk Management experience highly desirable.</li>  <li> Demonstrated ability to interpret regulatory requests, decipher associated risks and quantify overall exposure on behalf of the business.</li>  <li> Incumbent must have proven experience in analytics, data management, and reporting in a financial industry.</li> <li> Successful candidate must have proven ability to effectively liaison across and within business functions.</li> <li> Responsible for consulting with partners to identify and define business requirements and translate business needs into complex analysis designs and recommendations.</li> <li> Identifies and recommends internal and external data sources, compiles/mines data from multiple, cross business sources.</li> <li> Recommends and participates in the development of complex analysis designs using statistical and/or financial analysis, etc.</li> <li> Interprets results and recommends solutions to increase revenue, reduce expense, maximize operational efficiency/quality, etc.</li> <li> Ensures adherence to data management/data governance regulations and policies.</li>\n<strong> Preferred Skills</strong>\n<li> Extensive knowledge and understanding of research and analysis</li> <li> Strong analytical skills with high attention to detail and accuracy</li> <li> Excellent verbal, written, and interpersonal communication skills</li> <li> Knowledge and understanding of mortgage industry operations</li> <li> Ability to provide leadership by coaching, training, and mentoring</li> <li> Strong documentation skills</li> <li> Strong analytic skills with attention to detail and accuracy</li> <li> Strong organizational, multi-tasking and prioritization skills</li> <li> Advanced problem solving and technical troubleshooting capabilities</li> <li> Knowledge and understanding of default loan servicing</li> <li> Experience with technical writing, e.g. Business Requirements documents, data mapping documents, test cases</li> <li> Experience with predictive modeling using statistical techniques (such as logistic regression, Markov model) and/or simple data mining techniques.</li> <li> Excellent problem solving and analytical skills, with ability to apply critical judgment.</li>  <li> Proven ability to clearly articulate ideas through verbal and written communication.</li>  <li> Deep understanding of mortgage default processes and functions, or equivalent experience.</li>  <li> Demonstrated excellence at identifying stakeholders, understanding business needs and driving analytical/reporting solutions.</li>  <li> Proven experience in building partnerships, collaborating and influencing at senior levels and across business lines.</li>  <li> Demonstrated ability to manage effectively in a matrixed organization, develop partnerships with many business and functional areas, provide insights into data/processes and identify trends which may present opportunities or reflects gaps.</li>  <li> Relationship building and the ability to drive decision making through a consensus building approach.</li>\n<strong> Ideal candidate:</strong> Very analytical and very driven by fast paced environments. Ability to work well with internal customers and support their business needs. Candidates MUST be open to a challenging atmosphere as they're dealing with regulators and high level executives every day."}