{"job title": "Clinical Data Analyst", "company": "Community Health Systems", "city state": "– Franklin, TN", "rating": "2.6", "job description": "<ul>\n<li>*Description:**</li>\n</ul>\n\nCommunity Health Systems (\"CHSPSC, LLC\") is one of the leading operators of general acute care hospitals. The organization's affiliates own, operate, or lease more than 100 hospitals in 20 states, with an aggregate of approximately 21,000 licensed beds. The consolidated organization owns and leases community hospitals that offer quality, cost-effective healthcare including a range of inpatient medical and surgical services, outpatient treatment and skilled nursing care. In over 60 percent of the markets served, CHS-affiliated hospitals are the sole provider of healthcare services.\n<br><br>\nCHSPSC, LLC seeks a **Clinical Data Analyst** for its Franklin, TN, headquarters **Data Governance, Analytics and Reporting** team.\n\n\n<ul>\n<li>*Summary:** The Clinical Data Analyst is responsible for developing and providing clinical analytics support for clinics and Physician Practice Services to be utilized by corporate colleagues and senior leadership.</li>\n<li>*Qualifications**</li>\n<li>*Essential Duties and Responsibilities include the following:**</li>\n</ul>\n\n?Responsible for collaborating with internal and external colleagues to develop data acquisition methodology for defined clinic quality and population health metrics as assigned.\n<br><br>\n?Responsible for collaborating with Informatics colleagues, at the direction and in conjunction with the Director, Physician Quality, to develop, test and modify clinical quality dashboards as assigned.\n<br><br>\n?Responsible for sourcing data from multiple systems for the purposes of clinical quality reporting for PPS.\n<br><br>\noThis includes working with other key stakeholders to develop data extraction methodologies, development of macros, and other programming functions as necessary.\n<br><br>\n?Responsible for the preparation and delivery of standardized monthly, quarterly and annual provider/clinic reports as assigned.\n<br><br>\n?Responsible for ensuring data accuracy and integrity through defined validation methodologies.\n<br><br>\n?Interact and communicate with physicians and clinicians, consistently exhibiting behavior and communication skills that demonstrate commitment to superior customer service, including quality, care and concern with internal and external contacts as a professional representative of Community Health Systems.\n<br><br>\n?Must exhibit keen attention to detail and accuracy in all work products.\n<br><br>\n?All other duties as assigned\n\n\n<ul>\n<li>*Qualifications:**</li>\n</ul>\n\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\n<ul>\n<li>*Reasoning Ability:**</li>\n</ul>\n\nAbility to define problems, collect data, establish facts, and draw valid conclusions. Ability to interpret an extensive variety of technical instructions in mathematical or diagram form and deal with several abstract and concrete variables.\n\n\n<ul>\n<li>*Computer Skills:**</li>\n</ul>\n\nTo perform this job successfully, an individual should have knowledge of Word Processing software; Spreadsheet software and Database software. Programming, data handling, and analytics are essential to this job function.\n\n\n<ul>\n<li>*Physical Demands:**</li>\n</ul>\n\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\n<ul>\n<li>*Education/Experience:**</li>\n</ul>\n\n?Knowledge of clinical data analytics and statistical methodologies for complex analyses.\n<br><br>\n?Ability to technically communicate complex ideas and concepts.\n<br><br>\n?Minimum of 2 years experience developing and disseminating standard clinical metric reports.\n<br><br>\n?4-year degree from an accredited school plus 2 years of clinical analytics experience, or equivalent combination of education and experience.\n<br><br>\n?Knowledge of MIPS, Value-Based Payment Models and HEDIS strongly desired.\n\n\n<ul>\n<li>*Job:** _Corporate Positions_</li>\n<li>*Organization:** _CHS Corporate_</li>\n<li>*Location:** _TN-Franklin_</li>\n<li>*Requisition ID:** _1838565_</li>\n</ul>\n\nThis organization does not discriminate in any way to deprive any person of employment opportunities or otherwise adversely affect the status of any employee because of race, color, religion, sex, sexual orientation, genetic information, gender identity, national origin, age, disability, citizenship, veteran status, or military or uniformed services, in accordance with all applicable governmental laws and regulations. In addition, the facility complies with all applicable federal, state and local laws governing nondiscrimination in employment."}