{"job title": "Senior BI Data Analyst", "company": "Iconma", "city state": "– McLean, Virginia", "rating": "3.4", "job description": "<strong>Description:</strong>\n\n\n<ul>\n<li>The Enterprise PMO is responsible for providing objective, enterprise-wide view of the firm's initiative portfolio and ongoing monitoring of critical programs across Freddie Mac.</li>\n<li>The Senior Business Intelligence Analyst will be part of the Analytics team, responsible for providing strategic insight on the Freddie Mac project portfolio.</li>\n<li>The role will work on issues where analysis of situations or data requires building an in-depth understanding of organizational objectives.</li>\n<li>As a Senior Business Intelligence Analyst, the candidate will be charged with providing analytics reporting and data-driven strategic insights, trends and perspectives.</li>\n<li>The ideal candidate will develop and maintain relevant reporting and perform critical data analysis.</li>\n<li>This role requires a proactive personality, extremely analytical mindset, attention to detail, and excellent time management and communication skills.</li>\n<li>This role will report to the Director of Business Analysis.</li>\n</ul>\n\n<strong>Key Responsibilities:</strong>\n\n\n<ul>\n<li>Help rebuild Enterprise Program Management Office (EPMO) Reporting Suite to provide meaningful and actionable insight. (Predictive vs. Descriptive)</li>\n<li>Assist with the establishment and adoption of EPMO reporting standards and other best practices</li>\n<li>Streamlining of data analytics and reporting capabilities.</li>\n<li>Own the data, analytics, and reporting to empower senior executives and other business users.</li>\n<li>Collaborate closely with all areas of the business to provide analysis, reporting and tool-building capabilities that inform our key stakeholders</li>\n<li>Utilize internal/external data sources to develop and maintain dynamic and scalable dashboards to track key performance metrics for effective project portfolio management.</li>\n<li>Ensure data integrity across all enterprise wide portfolio, program, project reporting and analytics.</li>\n<li>Interpret and communicate information in a manner that can be comprehended by non-analytical audience.</li>\n</ul>\n\n<strong>Required Skills:</strong>\n\n\n<ul>\n<li>Undergraduate or Master's degree in a quantitative field (e.g. engineering, business, economics, finance, statistics, and analytics).</li>\n<li>Strong analytical background with a proven track record demonstrating an aptitude to compile data in comprehensive reports, analyze trends and make fact-based recommendations</li>\n<li>Strong experience with data extraction, manipulation and blending across different data sources. Experience with ETL tools a plus.</li>\n<li>Strong experience with MicroStrategy, Tableau and/or other Business Intelligence tools to build dynamic/scalable dashboards.</li>\n<li>Proficient at writing SQL queries against complex databases for the purpose of data extraction.</li>\n<li>Ability to translate business questions into problems solvable using analytics tools, and enjoy converting the results of your analyses into visual stories tailored to the needs of the audience.</li>\n<li>Strong written and verbal communication skills and have experience working on and communicating with fast-paced, dynamic teams.</li>\n<li>Excellent Excel and PowerPoint Skills</li>\n<li>Team-oriented, self-motivated, success-driven, roll-up-your-sleeves attitude</li>\n</ul>\n\n<strong>Key Skills:</strong>\n\n\n<ul>\n<li>Strong candidates will be familiar with either MicroStrategy, Tableau, or both.</li>\n</ul>"}