{"job title": "Senior Data Engineer", "company": "Iconma", "city state": "– McLean, Virginia", "rating": "3.4", "job description": "<strong>Description:</strong>\n\n\n<ul>\n<li>Responsible for delivery in the areas of: big data engineering with Hadoop, Python and Spark (PySpark) and a high-level understanding of machine learning</li>\n<li>Develop scalable and reliable data solutions to move data across systems from multiple sources in real time (Kafka) as well as batch modes (Sqoop).</li>\n<li>Construct data staging layers and fast real-time systems to feed BI applications and machine learning algorithms</li>\n<li>Utilize expertise in technologies and tools, such as Python, Hadoop, Spark, AWS, as well as other cutting-edge tools and applications for Big Data</li>\n<li>Demonstrated ability to quickly learn new tools and paradigms to deploy cutting edge solutions.</li>\n<li>Develop both deployment architecture and scripts for automated system deployment in AWS</li>\n<li>Create large scale deployments using newly researched methodologies.</li>\n<li>Work in Agile environment</li>\n</ul>\n\n<strong>Basic Qualifications:</strong>\n<br>\n<strong> - Bachelor's degree in Mathematics, Statistics, Computer Science</strong>\n<br>\n<strong> - Solid experience with Hadoop including Hive, HDFS, Kafka and PySpark</strong>\n<br>\n<strong> - At least 3 years' experience in Python (NumPy, SciPy, scikit-learn, pandas, PySpark) and any other open source programming languages for large scale data analysis</strong>\n<br>\n<strong> - 3+ years of experience working with AWS</strong>\n<br>\n<strong> - At least 8+ years of software development experience</strong> \n<br><br>\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Master's Degree in Computer Science</li>\n</ul>\n\n<strong> - 2+ years of experience working with financial data</strong>\n\n\n<ul>\n<li>knowledge of modern statistical learning methods</li>\n<li>Familiarity with one or more streaming technologies, NiFi etc.</li>\n</ul>\n\n<strong> - Experience with NoSQL databases</strong>\n\n\n<ul>\n<li>Strong communication skills, with the ability to work both independently and in project team</li>\n</ul>"}