{"job title": "Sr. Test Data Engineer", "company": "Modis", "city state": "– Tampa, Florida", "rating": "3.0", "job description": "<strong> Job Description</strong>\n<br><br>\n<strong> ---- JOB SUMMARY ----</strong>\n<br><br>\nThe Test Data Engineer Senior is responsible for evaluating test data requirements. producing test data delivery strategies. and helping the test data management team members in addressing delivery issues and/or other technical test data delivery questions. The Test Data Engineer Senior will act as a subject matter expert within data creation and processing for critical business systems.------\n<br><br>\nThe Test Data Engineer Senior is expected to be a subject area expert in EDI X12 and Health Care industry claims processing. ------\n<br><br>\nWorks closely with Business. Development and QA Partners to deliver test data that meet defined requirements for new and existing IT solutions.\n<br><br>\n<strong> ---- ESSENTIAL FUNCTIONS ----</strong>\n<br><br>\nWork with Test Data Manager in recommending/developing/implementing Test Data creation/loading/archiving solutions to improve services.---\n<br><br>\nProduce status reports on project related test data activities.---\n<br><br>\nWorks as a Liaison between the Environments. Testing and Development team for data processing.---\n<br><br>\nDevelop and maintain team procedures and process documentation.---\n<br><br>\nManage and track data processing issues to resolution.---\n<br><br>\nProvide mentorship to junior or new team members.---\n<br><br>\nProvide work effort estimates and manage the processing of Test Data Requests.---\n<br><br>\nReview and approve Test Data Requirements.---\n<br><br>\nCreate Test Data Files per user requirements.---\n<br><br>\nProcess Test Data Files into target application environments per user requirements.---\n<br><br>\nArchive Test Data Files as needed.---\n<br><br>\nAct in the capacity of Test Data Engineer Lead when needed\n<br><br>\nAble to travel domestically---\n<br><br>\nAble to be on call and respond to emergencies 24 x 7 when required\n<br><br>\n<strong> ---- MINIMUM QUALIFICATIONS ----</strong>\n<br><br>\nA Bachelor's Degree in Computer Science or MIS Required---or equivalent work experience Required ----\n<br><br>\n3+ years of experience in Software Development and/or Quality Engineering background Required---\n<br><br>\n1+ year of experience in the Healthcare Payer industry Required---\n<br><br>\n2+ years of experience in working with EDI X12 data Required---\n<br><br>\n3+ years of experience in Searching. inserting. updating and deleting data in a database environment using SQL. Required---\n<br><br>\nOther Advanced experience using automation tools in several different applications environments. Required ----\n<br><br>\n<strong> ---- Technology ---</strong>\n<br><br>\nMicrosoft Word Intermediate Required---\n<br><br>\nMicrosoft Excel Intermediate Required---\n<br><br>\nMicrosoft PowerPoint Intermediate Required---\n<br><br>\nMicrosoft Outlook Intermediate Required---\n<br><br>\nMicrosoft Visio Intermediate Required---\n<br><br>\nMicrosoft Project Intermediate Required---\n<br><br>\nOther Must be familiar with Software Development and SDLC Intermediate Required---\n<br><br>\nOther Must be familiar with relational databases (Oracle. Access. SQL Server) to create and review databases. queries. and reports as required. Intermediate Required---\n<br><br>\nOther Ability to determine the best approach for testing applications and identifying data requirements and should also be familiar with how to diagnose and resolve problems in the creation and running of automation scripts. Intermediate Required---\n<br><br>\nOther Ability to interface with multiple teams in order to design a suitable workflow for the enterprise Intermediate Required---\n<br><br>\nOther Programming skills in VB. VB script. C. and SQL Beginner Preferred---\n<br><br>\nOther Strong knowledge of QA methodologies Intermediate Required"}