{"job title": "Human Capital Analytics Consultant -Req ID", "company": "Phoenix Capital Associates", "city state": "– Washington, DC", "rating": "2.0", "job description": "Job Description<div><strong>Summary</strong>\n<br><br>\nAre you interested in helping solve today's most critical housing challenges? In simplest terms, our client serves the people who house America. We work at the heart of housing by providing reliable, affordable mortgage financing in all markets at all times, buying loans that banks and other lenders originate, so they can fund new loans. This gives more people the opportunity to buy, refinance, or rent homes and apartments. Creating these opportunities is what drives the people who work for our client\n<br><br>\nThe Human Capital Analytics Consultant contributes to the organization's success by collecting and analyzing human capital and HR data and metrics to identify important workforce trends and demonstrate the implications of these trends on the business. This is a high-impact, key contributor position responsible for consulting with the business and/or HR COEs to analyze workforce data and insights, particularly as it relates to workforce planning, succession planning, recruiting, diversity/EEO, and talent management. This role is responsible for ensuring the data is accurate and for translating it in a clear, concise, and business-relevant manner to key business stakeholders.\n<br><br>\n<strong>Responsibilities</strong>\n<ul>\n<li>Leverage multiple data sources and tools to produce actionable metrics that drive strategic decision making.</li><li>Work proactively and independently with business and/or HR COE customers to perform analysis of relevant workforce metrics, uncover and interpret trends in data, and produce substantiated recommendation presentations.</li><li>Conduct in person and Webex training to support analytics products and produce relevant training documentation.</li><li>Investigate new methods of improving analytics service delivery while ensuring compliance with governance standards.</li><li>Conduct benchmarking analysis by tracking the progress of business and/or HR COE customers’ metrics against benchmarks.</li><li>Conduct research, design, and execute studies to analyze special workforce issues for internal business clients and HR COE Leadership.</li><li>Provide ad-hoc data analysis as required.</li>\n</ul>\n<strong>Qualifications/Skills</strong>\n<ul>\n<li>Bachelor's Degree or equivalent</li><li>4+ years of related experience</li><li>Prior experience working in a human capital analytics/insights role required.</li><li>2+ years of experience using Tableau is required.</li><li>Ability to successfully partner across multiple groups.</li><li>Understanding of descriptive and inferential statistics techniques.</li><li>Highly consultative and able to work closely with internal business customers effectively in a fast-paced, changing environment.</li><li>Ability to problem solve and present findings to multiple levels of the organization.</li><li>Knowledge of R and/or Python is a plus.</li><li>Knowledge of Oracle HCM Cloud is a plus.</li> \n</ul>\n<strong>Required Documents</strong>\n<br><br>\nApplicants will need to submit the following documents during the application process.\n<ul>\n<li> Resume</li><li> Cover letter</li>\n</ul>\n​</div>Company Description<div>Phoenix Capital Associates, we supply human capital. Established in 2000 Phoenix is an IT company that offers our clients, IT consulting services in the areas of Technology Solutions, Process Solutions Training Solutions, and Staff Augmentation. We offer Software Services and Staffing Augmentation across multiple industries.\n<br><br>\nPhoenix Capital Associates main headquarters is located in Northampton County (Center Valley Pennsylvania) in the heart of the technology district of PA. In addition, the company also has a dedicated offshore research and development center\n<br><br>\nOur objectives are to be your IT staffing provider matchmaker and solutions supplier for businesses that need to fill out the ranks but are having difficulty finding qualified employees and IT solutions needs.</div>"}