{"job title": "DATA ANALYST II", "company": "State of Rhode Island and Providence Plantations", "city state": "– Providence, RI", "rating": "3.7", "job description": "<div>\n \n Class Definition\n <p>GENERAL STATEMENT OF DUTIES: At a significant level of expertise, to undertake professional special and recurring assignments involving conducting full lifecycle activities of data analytics to include requirements and design, data cleaning, developing analysis and reporting capabilities, linking databases and datasets, and continuously monitoring performance and quality control plans to identify improvements in models; and to do related work as required.<br>SUPERVISION RECEIVED: Works under the general supervision of a superior with considerable latitude for the exercise of independent judgement and initiative. Work is subject to review for conformance with prescribed state policies and procedures.<br>SUPERVISION EXERCISED: May supervise less experienced personnel assigned to assist on a regular project basis or; ensures that work products are developed in a qualitative and timely manner.</p>\n Illustrative Examples of Work Performed\n <p></p><ul>\t<li>At a significant level of expertise, to undertake professional special and recurring assignments involving conducting full lifecycle activities of data analytics to include requirements and design, data cleaning, developing analysis and reporting capabilities, linking databases and datasets, and continuously monitoring performance and quality control plans to identify improvements in models. With a significant level of latitude and independence, to assure the integrity of project data, including data extraction, storage, manipulation, processing and analysis.\t</li><li>To provide a high level of expertise to query and interpret data, analyze results using statistical techniques, develop predictive models using administrative datasets and provide ongoing reports.\t</li><li>To develop and implement data collection systems and other strategies that optimize statistical efficiency and data quality.\t</li><li>To work closely with management to prioritize business and information needs.\t</li><li>To provide data visualization and presentation of analytical findings to program owners and other stakeholders.\t</li><li>To acquire data from primary or secondary data sources and maintain databases/data systems.\t</li><li>To identify, analyze, and interpret trends or patterns in complex datasets.\t</li><li>To link databases and datasets to generate integrated datasets.\t</li><li>To filter and \"clean\" data, and review computer reports, printouts, and performance indicators to locate and correct code problems.\t</li><li>To participate in ongoing decisions concerning data collections, study design, methodology, and data analysis.\t</li><li>To locate and define new process improvement opportunities.\t</li><li>To do related work as required.</li></ul><p></p>\n Required Qualifications for Appointment\n <p>KNOWLEDGES, SKILLS AND CAPACITIES: A thorough knowledge of data models, regression analysis, database design development, data mining and segmentation techniques; a thorough knowledge of sophisticated reporting packages, databases and programming; a thorough knowledge of statistical methodologies and techniques utilized for analyzing large datasets; the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy; the ability to conduct queries, draw conclusions, prepare written reports and present findings in a clear and concise manner; the ability to mentor and/or supervise less experienced analysts as required; the ability to establish and maintain effective working relationships with state and municipal officials, superiors, subordinates and the public; and related capacities and abilities.<br><br>EDUCATION AND EXPERIENCE:<br>Education: Such as may have been gained through: possession of a Master's Degree from a college of recognized standing in Mathematics, Economics, Computer Science, Information Management,Statistics, or a closely related field with similar technical and computational emphasis. Or,<br>Education: Such as may have been gained through: graduation from a four-year college of recognized standing with a Bachelor's Degree in Mathematics, Economics, Computer Science, Information Management, Statistics, or a closely related field with similar technical and computational emphasis; and<br>Experience: Such as may have been gained through: considerable employment in a professional capacity as a data analyst.</p>\n Supplemental Information\n <p>In additional to the stated qualifications, as well as the qualifications for a data analyst I, a data analysts II will:<br><br>•&nbsp;Cultivate best practices on emerging techniques and strategies as they relate to data design, SDLC and graphical interpretation of data<br>•&nbsp;Supervise day to day activities of Business Analysts and Data Analysts<br>•&nbsp;Plan, execute and evaluate projects throughout the agency related to business process modernization and/or data reporting<br>•&nbsp;Work with Division Chiefs to plan and prioritize according to agency need<br>•&nbsp;Balance multiple project varying in stakeholders, resources, capabilities used and/or priorities</p>\n\n \n </div>"}