{"job title": "Economic and Quality Data Analyst", "company": "Tennessee Hospital Association", "city state": "– Brentwood, TN", "rating": "4.3", "job description": "The Tennessee Center for Patient Safety (TCPS) mission is to advance Tennessee hospitals' adoption of proven strategies that enhance the reliability, safety and quality of care received by patients. The TCPS provides extensive education, resources and direct support to hospitals to accomplish the mission of better outcomes for patients. Annual Salary: $66,000-$76,000 DOE Benefits Include: Health, dental, vision and life insurance; paid time off; and 401(k) JOB SUMMARY: The Economic and Quality Data Analyst provides the quantitative design and execution of projects and analyzes the data generated from such to support and document the value of the Tennessee Center for Patient Safety (TCPS) programs.The programs promote and facilitate the achievement of improvement in quality and safety in Tennessee hospitals in ways that are clinically, scientifically and statistically sound and that can be objectively documented to meet grant and contract requirements and deliverables to the THA board of directors. The position will support the data analysis and reporting needs for the THA Hospital Improvement and Innovation Network (HIIN) contract and future Centers for Medicare &amp; Medicaid Services (CMS) funded projects, Tennessee Surgical Quality Collaborative (TSQC), TCPS programs and THA special projects. ESSENTIAL FUNCTIONS OF THE JOB: (listed in order of importance) List your principal accountabilities; identify what you do, what end results you are accountable for, and how you measure your success. The ability to adapt to a changing work environment and meet challenges presented throughout the day.Analyze data on several clinical topics and for multiple measures to support TCPS programs using statistical methods and validated tools. Identify key trends and correlations between safety topics at the aggregate and individual hospital level.Identify correlations between Agency for Healthcare Research and Quality (AHRQ) safety culture survey scores and hospital complications.Analyze data to provide feedback on hospital performance, explain current trends and determine focus areas for improvement. Assist TCPS clinical staff in evaluating hospital performance to target interventions and measure success.Conduct in depth analysis of claims data related to safety topic areas to better identify variables associated with performance differences.Conduct analysis of REAL data and social determinants within the safety topic areas, such as readmissions and sepsis. Assist in identifying disparities in outcomes among safety topics.Conduct analysis of hospital quality and patient safety indicators, including the management and analysis of confidential, patient and hospital-level clinical measures for monthly reports to funders and all required reports for the CMS HIIN obligations.Utilize data variables from the American College of Surgeons National Surgical Quality Improvement Program (ACS NSQIP) surgical database provided by TCPS for the purpose of developing statistical analysis and reports pertaining to hospital performance for surgical outcomes.Provide quarterly surgical collaborative trend analysis for all major complications reported to the ACS NSQIP database, as well as a summary of cumulative impact trends for complications avoided and costs avoided for the state collaborative.Provide each participating hospital in the surgical collaborative with hospital-specific reports in a standardized format, including leadership reports, surgeon-specific reports and hospital year-to-year trend reports.Assist individual hospitals and/or surgeons with interpretation of their respective reports or other consultation or presentations as part of the state collaborative.Conduct specific research requests identified by THA/Tennessee Surgical Quality Collaborative (TSQC) leadership committee related to surgical performance from the ACS NSQIP data set. Contribute to publications and articles for TSQCPrepare data for presentation to committees and board of directors to insure consistent messages from all levels of the organization.Validate the appropriateness and accuracy of data analyses and reports.Prepare data reports for hospital and consumer audiences.Support sustainability efforts of TCPS through the use of data and reports in evaluation activities and grant applications.Develop research methods as appropriate to advance THA/TCPS programsPursue publication and national conference presentation opportunities for TCPS and THA.Assist as needed with other THA projects related to areas of expertise.Must be available in the office during regular office hours, unless job responsibilities require otherwise.Must be available for out of town travel approximately 5 percent of the time, be able to drive an automobile and maintain a valid driver's license. MARGINAL JOB FUNCTIONS: None. Skills Required to Perform the Duties of the Job: Strong organizational, data management and data analysis skills.Knowledge of epidemiology, healthcare delivery systems, biostatistics and quantitative methods for quality management.Ability to produce sophisticated and polished charts and reports for varied audience levels.Excellent oral and written communications skills.Excellent interpersonal and problem-solving skills.Ability to organize and coordinate multiple concurrent tasks in a team environment.Ability to interact with co-workers and hospital personnel to facilitate positive, productive working relationships.Ability to work independently in a self-directed manner.Capable of working under pressure.Strong proficiency in Microsoft applications.Knowledge/experience in SAS preferred. Educational and Experience Requirements Needed to Perform the Duties of the Job: Bachelor's degree required, and master's degree preferred. Major area of focus in data analytics, statistics, biostatistics, epidemiology, public health or a related field.At least three years of experience working in healthcare-related statistical analysis. Licensing or Other Special Certifications Required: None. ORGANIZATIONAL STRUCTURE: (Positions reporting directly to you, if any, and their areas of responsibility) None. GUIDANCE &amp; DIRECTION: (Policies, precedents or procedures that guide your work) The Tennessee Center for Patient Safety (TCPS) is under the leadership of the Senior Vice President, Clinical Division.The THA Board of Directors and President guide the priorities and initiatives of the TCPS and HIIN.The TCPS Advisory Council and the THA Quality Committee may provide input and recommendations to the TCPS and HIIN. THIS COMPANY RESERVES THE RIGHT TO MODIFY, INTERPRET, OR APPLY THIS JOB DESCRIPTION IN ANY WAY THE COMPANY DESIRES. THIS JOB DESCRIPTION IN NO WAY IMPLIES THAT THESE ARE THE ONLY DUTIES, INCLUDING ESSENTIAL DUTIES, TO BE PERFORMED BY THE EMPLOYEE OCCUPYING THIS POSITION. THIS JOB DESCRIPTION IS NOT AN EMPLOYMENT CONTRACT, IMPLIED OR OTHERWISE. THE EMPLOYMENT RELATIONSHIP REMAINS AT-WILL. THE AFOREMENTIONED JOB REQUIREMENTS ARE SUBJECT TO CHANGE TO REASONABLY ACCOMMODATE QUALIFIED DISABLED INDIVIDUALS. Equal Employment Opportunity Statement The Employer (THA) is an equal opportunity employer and does not discriminate against applicants or employees on the basis of race; color; creed; religion; sex; age; national origin; citizenship status; ancestry; pregnancy; sexual orientation; gender identity or expression; genetic information; or past, present or future membership in a U. S. Uniformed Service. In addition, THA does not discriminate against qualified individuals with physical, visual or mental disabilities. Also, THA does not discriminate against employees or applicants who inquire about, discuss or disclose their compensation or the compensation of other employees or applicants, however, an exception exists where the employee or applicant makes the disclosure based on information obtained in the course of performing their essential job functions.\n<br>\nThe Tennessean. Keywords: Data Analyst, Location: Brentwood, TN - 37027"}