{"job title": "Mid-Level Python Developer - Data Science, Big Data", "company": "Workbridge Associates", "city state": "– Plymouth Meeting, Pennsylvania", "rating": "3.1", "job description": "You are a motivated person who wants to use your technical skills to do more than just create cool websites. The application you will be working on will help make great strides in the advancement of medical solutions. You will also be able to hone your skills, and launch pad your career to wherever you choice.\n<br><br>\nThis is a full time role that can pay up to 100k per year.\n<br><br>\n<strong> Required Skills &amp; Experience</strong>\n<li> 2-4 years of experience developing in Python</li> <li> Experience with a modern framework like Djano or Flask</li> <li> Have an understanding of big data tools like Hadoop, or Splunk</li> <li> Experience with the Python Data Science stack: SciPy, NumPy, and Pandas</li>\n<strong> Desired Skills &amp; Experience</strong>\n<li> BS/MS inputer Science or related field</li> <li> Experience with other languages like Java, Scala, Clojure, or Go</li>\n<strong> What You Will Be Doing</strong>\n<br><br>\nTech Breakdown\n<li> 100% Green field Development</li>\nDaily Responsibilities\n<li> 80% Hands On</li> <li> 20% Team Collaboration</li>\n<strong> The Offer</strong>\n<br><br>\nYou will receive the following benefits:\n<li> Medical, Dental, and Vision Insurance</li> <li> 401(k) 3% match</li> <li> Paid Sick Time Leave</li> <li> Pre-taxmuter Benefit</li> <li> 3 weeks PTO</li> <li> Tuition Reimbursement</li>  <li> Casual Dress Code</li>\nApplicants must be currently authorized to work in the United States on a full-time basis now and in the future.\n<br><br>\nWorkbridge Associates, part of the Motion Recruitment network, provides IT Staffing Solutions (Contract, Contract-to-Hire, and Direct Hire) in major North American markets. Our unique expertise in todays highest demand tech skill sets, paired with our deep networks and knowledge of our local technology markets, results in an exemplary track record with candidates and clients."}