{"job title": "Senior Data Scientist", "company": "American Chemical Society", "city state": "– Columbus, US-OH", "rating": "3.1", "job description": "CAS uses intuitive technology, unparalleled scientific content and unmatched human expertise to help companies create groundbreaking innovations that benefit the world. As the scientific information solutions division of the American Chemical Society, CAS manages the largest curated reservoir of scientific knowledge, and for 111 years, has helped innovators mine, assess and apply that information to keep businesses thriving. The CAS team is global, diverse, endlessly curious and strives to make scientific insights accessible to innovators worldwide.\n<br><br>\n<strong>CAS is currently seeking a Senior Data Scientist. This position will be located in our headquarters in Columbus, Ohio.</strong>\n<br><br>\n<strong>Qualifications:</strong>\n<br><br>\nMaster’s or Ph.D. in Science, Engineering, Statistics, Mathematics, Computer Science or related field. A degree in Science is strongly preferred.\n<br><br>\n5+ years of experience performing statistical models, machine learning, and data analysis (prediction, classification, clustering, time series forecasting, regression models, etc.)\n<br><br>\nExperience using statistical computer languages (R, Python, SQL, etc.) to manipulate data and draw insights from large data sets.\n<br><br>\nExperience working with and creating data architectures.\n<br><br>\nKnowledge of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and deep learning toolkits (CNTK, TensorFlow, etc.)\n<br><br>\nKnowledge of advanced statistical techniques (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with their applications.\n<br><br>\nExperience visualizing and presenting data for stakeholders using Tableau, Periscope, Business Objects, D3, ggplot, etc.\n<br><br>\nExcellent written and verbal communication skills to effectively communicate value and benefits to external customers and internal stakeholders.\n<br><br>\nDemonstrated ability to translate complicated models into actionable business insights.\n<br><br>\nAttention to detail, time management, strong multi-tasking and problem solving skills.\n<br><br>\nProven ability to learn and expand in a fast-paced environment.\n<br><br>\n<strong>Duties:</strong>\n<br><br>\nWork with internal functions including IT, marketing, sales, etc. to establish a content analytics and products &amp; services development process.\n<br><br>\nStandardize a data analytics end-to-end process including methodology of business rules for content preparation with fast iterations, data integration of internal and external content, data cleansing and wrangling, data extraction/transformation/loading (ETL), data discovery of trends/patterns/relationships, data interpretation, hypothesis formulation and testing, and trends/relationship prediction.\n<br><br>\nUnderstand customer’s business problems and illustrate business insights to promote CAS brand and thought leadership in the market and develop products &amp; services offering by extracting meaningful business insights and recommending critical business solutions to guide customers in making data driven business decisions.\n<br><br>\nWork with internal and external customers solving their business problems and deliver high quality products and services.\n<br><br>\nCAS offers a competitive salary and comprehensive benefits package, including a generous vacation plan, medical, dental, vision insurance plans, and employee savings and retirement plans. Candidates for this position must be authorized to work in the United States and not require work authorization sponsorship by our company for this position now or in the future. EEO/Minority/Female/Disabled/Veteran<br><br>Required Skills\n<br><br>\n<strong>Required Experience</strong>\n<br><br>\nJob Location\n<br>\nColumbus, US-OH\n<br>"}