{"job title": "Process Development Data Scientist", "company": "Amgen", "city state": "– Juncos, Puerto Rico", "rating": "3.7", "job description": "Job Description\n<br>\n<strong>SUMMARY</strong>\n<br><br>\nThe Process Development Data Scientist will work with large and complex data sets. Solve difficult, non-routine analysis problems, applying advanced analytical methods as needed. Conduct end-to end analysis that includes data gathering and requirements specifications, processing, analysis, ongoing deliverables, and presentations.This role will conceive, design, implement and execute specific scientific experiments, which contribute to the successful completion of goals and/or projects under general guidance of supervisor. Under general guidance of supervisor,\n\n<ul>\n<li>Conceives and designs, executes or evaluates, and interprets experimental strategies</li><li>Provides input to new processes to generate robust and reliable data</li><li>Ensures that studies are conducted in compliance with the respective protocol and applicable guidelines and regulations</li>\n</ul>\n\n<strong>SPECIFIC RESPONSIBILITIES INCLUDE BUT ARE NOT LIMITED TO:</strong>\n\n<ul>\n<li>Develops and follows timelines for completing project team work.</li><li>Designs, monitors or conducts experimental strategies or projects which significantly contribute to attaining high priority goals.</li><li>Interact cross-functionally with a wide variety of people and teams.</li><li>Partner to develop and implement analysis, forecasting, and optimization methods to improve the quality of Amgen's processes.</li><li>Apply advanced technical principles, theories, and concepts in the development of new principles and concepts.</li><li>Conceive plans and conduct scientific research/investigation in areas of considerable scope and complexity.</li><li>Perform work that involves in-depth investigation of subject area, definition of scope, selection of areas of investigation, and development of novel concepts.</li><li>Provides data analysis and interpretation, and assesses impact of the data on the project.</li><li>Establish leads and/or participate in technical forums for sharing of best practices and application of filling process expertise.</li><li>Support technology transfer projects for the filling operations. Prompt and regular attendance to workplace</li><li>May introduce advanced scientific methods.</li><li>Develops and implements new and novel protocols to address specific issues.</li><li>May support or lead efforts with research, manufacturing, process development, utilities, facilities, quality assurance and validation departments in developing requirements and recommendations for large and/or highly complex system/facility or process modifications.</li><li>May represent the department on project teams under supervision of a senior scientific staff member.</li><li>May initiate productive collaborations within and outside of the department or company.</li><li>Advises or assists others in experimental design and/or interpretation/diagnosis of data and implementing innovative remedies.</li><li>Independently authors scientific reports, summary documents, complex regulatory documents, invention disclosure submissions and/or patents.</li></ul>\n\n<ul>\n<li>May develop supervisory and mentoring skills.</li><li>Interacts effectively with variety of communication and working styles.</li><li>Be flexible to support extended hour, non-standard shifts and manage changes.</li>\n</ul>\n\n<strong>BASIC QUALIFICATIONS</strong>\n<br><br>\n<strong>EDUCATION/LICENSES</strong>\n<br><br>\nDoctorate degree\n<br>\n<strong>OR</strong>\n<br>\nMaster's degree and 3 years of Process Development and/or Technical Services experience in GMP regulated industry\n<br>\n<strong>OR</strong>\n<br>\nBachelor's degree and 5 years of Process Development and/or Technical Services experience in GMP regulated industry\n<br><br>\n<strong>PREFERRED QUALIFICATIONS</strong>\n\n<ul>\n<li>Education discipline/background in Life Sciences and/or Engineering with Statistics, Operations research, Mathematics, Systems engineering and/or Industrial engineering academic degree.</li><li>3+ years of relevant work experience in data analysis or related field (eg as a statistician, data scientist, computational biologist, bioinformatician)</li><li>Relevant work experience in data analysis or related field (eg as a statistician, data scientist, computational biologist, bioinformatician)</li><li>Experience with statistical software (e.g. R, MATLAB, SAS) and database languages (e.g. SQL)</li><li>Experience with statistical data analysis such as linear models, multivariate analysis, and stochastic models</li><li>Experience articulating business questions and using mathematical techniques to arrive at an answer using available data</li><li>Demonstrated skills in selecting the right statistical tools given a data analysis problem</li><li>Demonstrated effective written and verbal communication skills (English and Spanish)</li><li>Demonstrated leadership and self-direction. Demonstrated willingness to both teach others and learn new techniques</li><li>Ability to apply science to production.</li><li>Able to develop solutions to routine technical problems</li><li>Familiarity with documentation in a highly regulated environment.</li><li>Skills in the following areas:\n\n<ul>\n<li>Problem solving</li><li>Project management</li><li>Negotiation, persuasion and facilitation</li><li>Collaboration</li><li>Conflict Resolution</li></ul></li>\n</ul>\n\nAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.\n<br><br>\nAmgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.\n<br>\n<strong> Join Us</strong> \n<br><br>\n<strong>If you're seeking a career where you can truly make a difference in the lives of others, a career where you can work at the absolute forefront of biotechnology with the top minds in the field, you'll find it at Amgen.</strong>\n<br><br>\n<strong>Amgen, a biotechnology pioneer, discovers, develops and delivers innovative human therapeutics. Our medicines have helped millions of patients in the fight against cancer, kidney disease, rheumatoid arthritis and other serious illnesses.</strong>\n<br><br>\n<strong>As an organization dedicated to improving the quality of life for people around the world, Amgen fosters an inclusive environment of diverse, ethical, committed and highly accomplished people who respect each other but compete intensely to win. Together, we live the Amgen values as we continue advancing science to serve patients.</strong>\n<br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n<br><br>\n<strong>.</strong>"}