{"job title": "Sr. Data Scientist/Research Engineer", "company": "Apixio", "city state": "– San Mateo, CA", "rating": "4.0", "job description": "Healthcare has a data problem. Over a billion patient documents are created per year. This data should be used to improve healthcare delivery, but it isn't because it's stored in different places, in different forms, and is of different quality. Apixio's artificial intelligence platform is built specifically to address this problem. Join us, and help change healthcare.\n<br><br>\n<strong>About You:</strong>\n<br><br>\nAs a Senior Research Engineer you will collaborate with other members on Data Science team in developing and improving our machine learning classifiers and infrastructure working towards our goal of building a system that models the true state of a patient from their medical records. You will work on state of the art infrastructure built for the healthcare space and have access to real medical records to build capabilities that have real impact in the healthcare ecosystem.\n<br><br>\nYou will be a significant hands on contributor on a team that is solving hard but interesting problems with tremendous real-world impact.\n<br><br>\n<em>Daily responsibilities include:</em>\n\n<ul>\n<li>Design, coding, testing and monitoring of new classifiers in production environments that drive our analytical and SaaS product platforms</li>\n<li>Maintain our data assets</li>\n<li>Perform large-scale data analysis</li>\n<li>Work closely with other groups like product, engineering and customer operations to acquire requirements and develop new systems that solve their problems</li>\n</ul>\n<strong>Skills &amp; Requirements:</strong>\n<br><br>\n<strong>Must Haves</strong>\n\n<ul>\n<li>Strong working knowledge of a variety of machine learning and analytical techniques and understanding of how and where they are applicable.</li> \n\n<li>Software engineering programing skills with coding experience using Java/Scala or Python, in addition to machine learning and data mining libraries.</li> \n\n<li>Experience working with high performance computing in distributed and parallel systems, e.g. Hadoop, Tez &amp; Spark</li>\n<li> Strong mathematical and statistical background, with thorough understanding of probability</li>\n<li>Experience in data science and machine learning with a degree in Computer Science, Mathematics or another empirical science</li>\n<li>Commercial experience building and deploying scalable software solutions that employ machine learning algorithms in production environments</li>\n<li>Self-starter, comfortable juggling multiple projects, strong communication skills</li>\n</ul>\n<strong>Nice to Haves</strong>\n\n<ul>\n<li>Experience with NLP techniques and tools a plus.</li>\n<li>Have developed production data science solutions in healthcare, ad tech or web search</li>\n<li>Prior experience building recommendation systems and/or natural language processing solutions</li>\n<li>Healthcare Domain expertise</li>\n</ul>\n<strong>About Apixio:</strong>\n<br><br>\nWe are a mission-driven data science company for healthcare. We are passionate about improving the consumption and delivery of healthcare by making the practice of medicine more science than art. We are the technology leader in our space and growing at a 60% year over year rate and show no signs of slowing down. Our success is driven by a team of experienced, passionate and fun engineers, data scientists and business professionals that are working to solve some of the most complex problems, with some of the most innovative technologies and techniques in AI and machine learning. We are well funded by leading organizations such as Bain Capital and SSM, and serve more than 33 national and regional health plan and provider clients, and growing.\n<br><br>\n<strong>What Apixio can offer you:</strong>\n\n<ul>\n<li>Meaningful work to improve the healthcare industry</li>\n<li>Competitive compensation, including meaningful equity</li>\n<li>Exceptional benefits, including medical, dental and vision</li>\n<li>401k</li> \n\n<li>Catered lunches Monday-Thursday</li>\n<li>Parties, picnics and Friday Happy Hour</li> \n\n<li>Generous Vacation Policy</li>\n<li>Free Parking</li>\n<li>Free Onsite Gym</li>\n<li>Modern open office in beautiful San Mateo, CA</li>\n</ul>"}