{"job title": "Scientist", "company": "Arkema", "city state": "– King Of Prussia, PA", "rating": "3.5", "job description": "Req Id 27961 - Posted 12/27/2017 - Research and Development - King of Prussia. Pennsylvania. US\n<br><br>\nArkema's Thiochemicals business provides organosulfur products with applications in electronics manufacture, polymer and monomer manufacture and processing, agrochemicals, oilfield, petroleum refining, mining, and natural gas odorization.\n<br><br>\nBased at Arkema's Corporate Offices and R&amp;D Center in King of Prussia, PA, the Scientist is expected to independently execute against overall project objectives and draw from deep technical expertise and experience. This role includes R&amp;D project development through significant hands-on contributions to laboratory efforts customer interactions and support, and interface with Thiochemical activities on a global basis. The Scientist works closely with the Principal Scientists who will define the objectives, as well as Thiochemical and Arkema R&amp;D groups at other global locations.\n<br><br>\nThe successful incumbent will have demonstrated abilities to:\n\n\n<ul>\n<li>Effectively advance R&amp;D objectives through hands-on contributions as well as interface with internal and external customers, vendors, and other Arkema staff in a direct business or manufacturing support role.</li>\n<li>Develop, execute and lead research two or more efforts directed at technical and commercial application of innovative technologies within a stage-gate protocol. This may include internal or external development of new product/processes/applications at Arkema facilities, external sites, or customers.</li>\n<li>Follow external developments in select technologies, develop and prove out new project proposals and intellectual property.</li>\n</ul>\n\n<strong>EDUCATION/EXPERIENCE REQUIRED</strong>\n\n\n<ul>\n<li>PhD in Chemistry or Chemical Engineering required.</li>\n<li>0-3 years of industrial/post-doc experience with strong and practical knowledge/experience in polymer synthesis and application.</li>\n<li>Knowledge of organic and organosulfur chemistry is a strong plus.</li>\n<li>Excellent verbal and written communication skills, as well as a strong desire to collaborate.</li>\n</ul>\n\n<strong>DEMONSTRATED COMPETENCIES:</strong>\n\n\n<ul>\n<li>Strong knowledge and experience in hands-on polymer synthesis, processing, characterization, and application. Knowledge of polymer degradation and strategies for stabilization packages and organosulfur chemistry a plus.</li>\n<li>Small molecule/organic chemistry synthesis and subsequent characterization (IR, NMR, various chromatography techniques).</li>\n<li>Working knowledge of free radical polymerization including bulk, solution and emulsion polymerizations and optimization of kinetics and feedstocks.</li>\n<li>Understands relationship between chemical formulation and bulk material properties.</li>\n<li>Hands-on lab scale polymer processing including extrusion, compounding, injection molding.</li>\n<li>Characterization and evaluation including: mechanical, optical, thermal, UV and chemical resistance properties.</li>\n<li>Organize, report and give initial analysis of data and suggestions for future experiments based on results.</li>\n<li>Research on and evaluation of formulation changes (additives, co-monomers, polymer) to improve processing, physical or chemical properties of materials.</li>\n</ul>\n\nA designer of materials and innovative solutions, Arkema shapes materials and creates new uses that accelerate customer performance. Our balanced business portfolio spans high-performance materials, industrial specialties and coating solutions. Our globally recognized brands are ranked among the leaders in the markets we serve. Reporting annual sales of ???7.5 billion in 2016, we employ approximately 20,000 people worldwide and operate in close to 50 countries. We are committed to active engagement with all our stakeholders. Our research centers in North America, France and Asia concentrate on advances in bio-based products, new energies, water management, electronic solutions, lightweight materials and design, home efficiency and insulation.\n<br>\nArkema Inc. provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Arkema Inc. complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.\n<br>\nFor more information about the EEOC, please refer to The \"\"EEO IS The Law\"\" poster at http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf\n<br><br>\n<strong>Company Description:</strong>\n<br><br>\nA global chemical company and France's leading chemicals producer, Arkema is building the future of the chemical industry every day. Deploying a responsible, innovation based approach, we produce state-of-the-art specialty chemicals that provide customers with practical solutions to such challenges as climate change, access to drinking water, the future of energy, fossil fuel preservation and the need for lighter materials. With operations in more than 40 countries, 14,000 employees, 80 production facilities and 10 research centers, Arkema generates annual revenue of 8.3 billion and holds leadership positions in all its markets with a portfolio of internationally recognized brands. In North America, Arkema, Inc., a subsidiary of Arkema is headquartered in King of Prussia, PA. Arkema Inc. employs 2,400 people and operates 32 facilities in the US, Canada, Mexico and Brazil."}