{"job title": "Senior Data Scientist", "company": "AXIS Capital", "city state": "– Chicago, IL", "rating": "2.5", "job description": "This is your opportunity to join AXIS Capital – a trusted global provider of specialty lines insurance and reinsurance. We stand apart for our outstanding client service, intelligent risk taking and superior risk adjusted returns for our shareholders. We also proudly maintain an entrepreneurial, disciplined and ethical corporate culture. As a member of AXIS, you join a team that is among the best in the industry.<br><br>Job Description<br><br>AXIS Capital is committed to building a strong Data and Analytics Organization. You will be working with a team of innovators to create products and services that will shape the future of AXIS. We are interested in highly collaborative individuals that are able to translate business problems into data-driven solutions.\n<br><br>\n<strong><strong>Responsibilities</strong></strong>\n<ul>\n<li>Execute on strategy for data and analytics across AXIS Capital, aligning to similar initiatives across the organization where applicable</li><li>Partner with team members, stakeholders, and end users to evaluate key business problems where data and analytics can help solve, along with assisting in potential solution path identification and assessment of recommended priority</li><li>Coordinate with internal and external team members, stakeholders, end users, Operations, IT, and others to build actionable and practical data and analytics solutions including monitoring data and processes as well as change management components</li><li>Collaborate with team members and project leadership to ensure the business problem and potential solution are viable and assist project leadership to attain support and buy-in needed to successfully execute</li><li>Conduct exploratory data analysis, model development, and manage the solution implementation with IT or external vendors</li><li>Communicate the value of data and analytics to stakeholder groups and help showcase successes</li><li>Provide guidance and oversight to less experienced team members, as applicable</li>\n</ul>\n<strong><strong>Required Skills and Qualifications</strong></strong>\n<ul>\n<li>3-5 years of experience with a Bachelor’s degree in quantitative field such as statistics, mathematics or computer science (Masters or PhD preferred)</li><li>Experience in insurance, commercial/specialty insurance preferred</li><li>Ability to conceptualize business problems, execute solutions, and present findings in a simple manner</li><li>Experience implementing data and analytics solutions in production IT environments preferred</li><li>Ability to perform detailed data analysis (i.e. determine the structure, content, quality, and potential uses of the data through examination of source systems and data samples)</li><li>Experience building and implementing statistical models( clustering, regression models)</li> <li>Experience building advanced algorithms (Machine learning, AI, Natural Learning Processing) preferred</li><li>Experience in programming tools such as R and Python</li><li>Experience with relational databases and standard SQL query methods</li><li>Excellent written, verbal and presentation skills; able to communicate complex information to senior management</li><li>Experience in agile project management environment is useful but not required</li><li>Strong communication skills including the ability to explain work to both technical and non-technical audiences</li><li>Experience working with multi-functional teams and managing multiple priorities</li><li>Ability to document and communicate progress against plans, raising risks and issues as necessary</li>\n</ul>"}