{"job title": "Sr Staff Data Scientist", "company": "Baker Hughes, a GE company", "city state": "– Houston, TX", "rating": "3.5", "job description": "<strong>Role Summary:</strong> \n<br>\nThe Sr Staff Data Scientist will work in and lead teams as technical domain expert addressing statistical, machine learning and data understanding problems in a commercial technology and consultancy development environment. In this role, you will contribute to the development and deployment of modern machine learning, operational research, semantic analysis, and statistical methods for finding structure in large data sets.\n<br><br>\n<strong>Essential Responsibilities:</strong> \n<br>\n<strong>In this role you will:</strong>\n\n<li>Partner with GE Software Engagement Managers to shape Statements of Work for Data Science opportunities and GE Software Solutions\n\n</li><li>Participate in Data Science Workouts to shape Data Science opportunities and identify opportunities to use data science to create customer value\n\n</li><li>Develop, verify, and validate analytics to address customer needs and opportunities.\n\n</li><li>Work as part of a cross-functional team to translate algorithms into commercially viable products and services.\n\n</li><li>Work in technical teams in development, deployment, and application of applied analytics, predictive analytics, and prescriptive analytics.\n\n</li><li>Perform exploratory and targeted data analyses using descriptive statistics and other methods.\n\n</li><li>Work with data engineers on data quality assessment, data cleansing and data analytics\n\n</li><li>Generate reports, annotated code, and other projects artifacts to document, archive, and communicate your work and outcomes.\n\n</li><li>Communicate methods, findings, and hypotheses with stakeholders.\n<br><br>\n<strong>Qualifications/Requirements:</strong><br><br>Basic Qualifications:\n\n</li><li>Masters Degree in a STEM major (Science, Technology, Engineering, Mathematics) plus 7 years analytics development for industrial applications in a commercial/industrial setting\n<br>\n<strong>OR</strong>\n<br>\nPh.D. in a STEM major (Science, Technology, Engineering, Mathematics) plus 3 year analytics development for industrial applications in a commercial/industrial setting<br><br>Eligibility Requirements:\n\n</li><li>Legal authorization to work in the U.S. is required. We will not sponsor individuals for employment visas, now or in the future, for this job\n\n</li><li>Must be willing to travel 20%\n\n</li><li>Must be willing to work out of an office located in Houston Tx\n<br><br>\n<strong>Desired Characteristics:</strong><br><br>Desired Characteristics: -\n\n</li><li>Demonstrated skill in the use of one or more analytic software tools or languages (e.g., R, Python, Dataiku, SAS, SPSS,)\n\n</li><li>Demonstrated skill at data cleansing, data quality assessment, and using analytics for data assessment\n\n</li><li>Demonstrated skill in the use of applied analytics, descriptive statistics, feature extraction and predictive analytics on industrial datasets\n\n</li><li>Demonstrated skill at data visualization and storytelling for an audience of stakeholders\n\n</li><li>Demonstrated skills in use of some of the Machine Learning/AI techniques (e.g., Regularization Techniques, Boosting, Random Forests, Ensemble Methods, image/video/audio processing, time series modeling)\n\n</li><li>Demonstrated expertise in the use of one or more analytic software tools or languages (e.g., SAS, SPSS, R, Python)\n\n</li><li>Demonstrated expertise in data visualization and storytelling to translate complex data into customer insight\n\n</li><li>Demonstrated expertise in modeling, feature extraction, and the development and application of descriptive, applied, and predictive analytics on industrial datasets\n\n</li><li>Demonstrated expertise in data science technology and industry trends<br><br>Technical Expertise:\n\n</li><li>Demonstrated skill in data management methods and analytic scaling\n\n</li><li>Demonstrated skill in prescriptive analytics and analytic prototyping\n<br>\n<strong></strong></li><li><strong>Demonstrated skill in solutions integration<br><br>Domain Knowledge:</strong>\n\n</li><li>Demonstrated skill in one or more industry sectors where GE operates\n\n</li><li>Demonstrated skill in defining and delivering customer value<br><br>Leadership:\n\n</li><li>Demonstrated expertise working in team settings in various roles\n\n</li><li>Demonstrated expertise in critical thinking and problem solving methods\n\n</li><li>Demonstrated expertise in presentation and communications skills<br><br>Personal Attributes:\n\n</li><li>Demonstrated skill in serving as a change agent\n\n</li><li>Demonstrated skill in working in ambiguous environments<br><br>#DTR\n<br><br>\n<strong>About Us:</strong> \n<br>\nGE is the world's Digital Industrial Company, transforming industry with software-defined machines and solutions that are connected, responsive and predictive. Through our people, leadership development, services, technology and scale, GE delivers better outcomes for global customers by speaking the language of industry.\n<br>\nGE offers a great work environment, professional development, challenging careers, and competitive compensation. GE is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.\n<br><br>\n<strong>Locations:</strong>  United States; Texas; Houston<br><br>GE will only employ those who are legally authorized to work in the United States for this opening.</li>"}