{"job title": "Data Scientist - SME", "company": "Engility Holdings", "city state": "– Fort Bragg,North Carolina,United States", "rating": "3.4", "job description": "<strong>About Engility:</strong>\n<br><br>\nEngility delivers innovative solutions to critical challenges facing the nation and the world. As a premier provider of integrated services for the U.S. government, we support the Department of Defense, intelligence community, space communities, federal civilian agencies and international customers. Engility is dedicated to making lives better, safer and more secure.\n<br><br>\n<strong>Description:</strong>\n<br><br>\nEngility is seeking a Data Scientist SME to i nterpret and analyze data using exploratory and statistical techniques.\n<br><br>\n<strong>This position will:</strong>\n\n<ul>\n<li>Lead the development, implementation and use of data systems and other strategies that optimize statistical efficiency and data quality</li><li>Lead the development of innovative data analysis techniques for 'Big Data'</li><li>Lead the analysis and interpret trends or patterns in large complex data sets</li><li>Lead the development of data modeling methods</li><li>Analyze and interpret trends or patterns in complex data sets</li><li>Conduct quantitative analysis</li> \n</ul>\n\n<strong>Qualifications:</strong>\n\n<ul>\n<li>Must have a current/active TS/SCI security clearance</li><li>Prior deployment experience supporting IC, DoD, or Law Enforcement Agency in a COCOM AOR</li><li>6-10 years recent experience</li><li>Proficient in algorithms for data science, probability &amp; statistics, machine learning for data science, and data analysis and visualization</li><li>Extensive experience working with unstructured data</li><li>Ability to clearly translate technical findings to a non-technical team</li><li>In depth-knowledge of SAS and/or R (prefer R)</li><li>Ability to code in Python</li><li>Experience with Hive or Pig, as well as Hadoop</li><li>Ability to write and execute complex queries in SQL</li><li>Certified Analytics Professional - INFORMS preferred</li>\n</ul>\n\n<strong>EEO Statement:</strong>\n<br><br>\nEngility Corporation is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action employer, making decisions without regard to race, color, religion, creed, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. U.S. citizenship is required for most positions. For our complete EEO/AA and Pay Transparency statements, please click here ."}