{"job title": "Data Scientist, Infrastructure", "company": "Facebook", "city state": "– Menlo Park, California", "rating": "4.4", "job description": "Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.How would Facebook scale to the next billion users? The Infrastructure Strategy group is responsible for the strategic analysis to support and enable the continued growth critical to Facebooks infrastructure organization. The ideal candidate will be passionate about Facebook, highly analytical, have strong mathematical aptitude and has experience using data to drive cost effective decision making. This is a full-time position with opportunities in Menlo Park, CA, Seattle WA, and Boston MA.\n<br><br>\n<strong>Responsibilities:\n<br>\n</strong>\n\n<ul>\n<li>Leverage data and business principles to solve large scale web, mobile and data infrastructure problems.</li><li>Work cross functionally to define problem statements, collect data, build analytical models and make recommendations.</li><li>Build and maintain data driven optimization models, experiments, forecasting algorithms and capacity constraint models.</li><li>Leverage tools like R, PHP, Python, Hadoop &amp; SQL to drive efficient analytics.</li><li>Communicate final recommendations and drive decision making.</li>\n</ul>\n\n<strong>Mininum Qualifications:\n<br>\n</strong>\n\n<ul>\n<li>Degree in an analytical field (e.g. Computer Science, Engineering, Mathematics, Statistics, Operations Research, Management Science).</li><li>5+ years of Scripting with one of these languages (PHP, R, PYTHON).</li><li>5+ years of SQL experience.</li><li>Experienced with packages such as NumPy, SciPy, pandas, scikit-learn, dplyr, ggplot2.</li><li>5+ years of data mining / analytics.</li>\n</ul>\n\n<strong>Preferred Qualifications:\n<br>\n</strong>\n\n<ul>\n<li>2 plus years of industry or graduate research experience.</li><li>Hands-on experience with datasets (i.e. data extraction, cleaning, analysis and presentation).</li><li>Demonstrated ability to provide insights from data sets.</li><li>Understanding of statistics and optimization techniques.</li>\n</ul>"}