{"job title": "Data Scientist Senior", "company": "Freddie Mac", "city state": "– McLean, VA", "rating": "3.7", "job description": "<div>As a Data Scientist Senior on the Investment Portfolio and Analytics team at Freddie Mac, you will join a group of skilled professionals who use data science to solve important business problems. You will apply statistics and machine learning to build tools that Freddie Mac will use daily to make decisions related to mortgage securities in its portfolio. You will make efficient use of distributed computing to sharpen those tools on the latest structured and unstructured big data available.\n<br><br>\n<strong>Responsibilities include:</strong>\n\n\n<ul>\n<li>Use methods from computer science and numerical analysis for solving quantitative problems.</li>\n<li>Use techniques from statistics and machine learning to build data quality controls for predictive models on numeric, categorical, textual, geographic, and other features</li>\n<li>Write programs to clean and analyze large volumes of structured and unstructured data</li>\n<li>Support presenting research results to both technical and non-technical audiences</li>\n<li>Support writing model documentation and research reports</li>\n<li>Visualize data to communicate complex ideas</li></ul></div><br>\n<div>* Doctorate degree (or master's degree with equivalent work experience)in statistics, data science or a related quantitative field.).\n<li>Coursework or work experience applying predictive modeling techniques from data science, statistics, machine learning, and econometrics to large data sets. Qualifying coursework may include--but is not limited to--data science, statistics, machine learning, optimization, numerical analysis, scientific programming, computational methods, supervised learning, unsupervised learning, text mining, and image analysis.</li>\n<li>Coursework or work experience writing computer programs to implement data science pipelines and predictive algorithms. Programming languages may include--but are not limited to--Python, R, SQL, Java, SAS, and MATLAB.</li>\n<li>Coursework or work experience using technologies for manipulating structured and unstructured big data. Big data technologies may include--but are not limited to--Hadoop, Hive, Pig, Spark, relational databases, and NoSQL.</li></div><br>\n<div>* Experience with and/or training in algorithmic design and implementation\n<li>Experience with and/or training in text mining for predictive analytics</li>\n<li>Experience using Hadoop and related technologies (Spark, Hive, etc.)</li>\n<li>Experience with Python-especially the Python data science stack</li>\n<li>Experience querying relational databases via SQL</li></div><br>\n<div>Today, Freddie Mac makes home possible for one in four home borrowers and is one of the largest sources of financing for multifamily housing. Join our smart, creative and dedicated team and you'll do important work for the housing finance system and make a difference in the lives of others. Freddie Mac is an equal opportunity and top diversity employer. EOE, M/F/D/V.</div>\n\n"}