{"job title": "Entry-Level Data Scientist", "company": "IBM", "city state": "– Washington DC&nbsp;", "rating": "3.6", "job description": "<strong>Job Description</strong>\n<br>\nAt IBM we have an amazing opportunity to transform the world with cognitive technology. By using the vast amounts of information available today to identify new patterns and make new discoveries, we are helping cities become smarter, hospitals transform patient care, financial institutions minimize risk, and pharmaceuticals find cures for rare diseases. Join the forward-thinking teams at IBM solving some of the worlds most complex problems there is no better place to grow your career!\n<br><br>\nEntry-Level Data Scientists extract knowledge or insights from structured or unstructured data. They draw upon the practice of data analysis, using predictive analytics, data mining, pattern recognition, data modeling, machine learning and various statistical methods in order to solve large scale optimization problems and to understand the meaning behind vast data sets\n<br><br>\nEntry-Level Data Scientists are in demand across IBM's growth areas. You'll be matched and deployed to a team in a strategic business, based on your offered location and fit.\n<br>\n<strong>What Youll Do:</strong>\n\n\n<ul>\n<li>You will implement and validate predictive models, and create and maintain statistical models with a focus on big data.</li>\n<li>Youll communicate with internal and external clients to understand business needs and provide analytical solutions.</li>\n<li>You will use statistical concepts such as regression, time series, mixed model, Bayesian methods, clustering, etc., to analyze data and provide insights.</li>\n<li>Youll work in an Agile, collaborative environment, partnering with other scientists, engineers, and database administrators of all backgrounds and disciplines to bring analytical rigor and statistical methods to the challenges of predicting behaviors.</li>\n</ul>\n\n<strong>Who You Are:</strong>\n\n\n<ul>\n<li>You are great at solving problems, debugging, troubleshooting, and designing &amp; implementing solutions to complex technical issues.</li>\n<li>You thrive on teamwork and have excellent verbal and written communication skills.</li>\n<li>You have strong technical and analytical abilities, a knack for driving impact and growth, and some experience with programming/scripting in a language such as Java or Python.</li>\n<li>You have a basic understanding of statistical programming in a language such as R, SAS, or Python.</li>\n<li>You have an interest in, understanding of, or experience with Design Thinking Methodology</li>\n<li>You have an interest in, understanding of, or experience with Agile development methodology</li>\n</ul>\n\nRequired Technical and Professional Expertise\n<br><br>\nMust have basic knowledge of statistical concepts such as regression, time series, mixed model, Bayesian methods, clustering, etc., to analyze data and provide insights.\n<br><br>\nPreferred Tech and Prof Experience\n<br><br>\nSome work experience using statistical concepts such as regression, time series, mixed model, Bayesian methods, clustering, etc., to analyze data and provide insights.\n<br><br>\nEO Statement\n<br>\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n<br><br>"}