{"job title": "Senior Data Scientist- Modeling &amp; Simulation", "company": "Ingersoll-Rand", "city state": "– Davidson, NC", "rating": "3.6", "job description": "<div>\n<div>At Ingersoll Rand we are passionate about inspiring progress around the world. We advance the quality of life by creating comfortable, sustainable and efficient environments. Our people and our family of brands-includingClub Car®, Ingersoll Rand®,Thermo King®, Trane®, American Standard® Heating &amp; Air Conditioning and ARO® - work together to enhance the quality and comfort of air in homes and buildings; transport and protect food and perishables; and increase industrial productivity and efficiency. We are a global business committed to a world of sustainable progress and enduring results. For more information, visitwww.ingersollrand.com.\n<br><br>\nIngersoll Rand is a diverse and inclusive environment. We are an equal opportunity employer, dedicated to hiring a diverse workforce; including individuals with disabilities and United States qualified protected veterans.\n<br><br>\n<strong>Job Summary</strong></div>\n<br>Ingersoll Rand Modeling and Simulation NoE is seeking a<strong> Senior Data Scientist</strong>to join a world-class team applying innovative analytic approaches to extremely complex problems in the areas of industrial internet (IoT), equipment performance management and related engineering domains. The <strong>Senior</strong> <strong>Data Scientist M&amp;S</strong> designs, develops and maintains data based models applicable to IR products as well as improves and standardizes application of tools and applications across different business units, providing sound guidance to end-users and sharing best practices globally. This position is focused on developing models to improve Ingersoll Rand products, including models, data richness and quality. The incumbent is responsible for model management, integrating with existing systems, as well as identifying and implementing improvements to these processes.<br>\n<div>\n<strong>Responsibilities:</strong></div><strong>\n\n<br></strong>\n\n\n<ul>\n<li>Development and implementation of state of the art statistical and machine learning models to enable predictive and prescriptive strategies</li>\n<li>Develop performance models using machine learning for any instrumented piece of equipment, including specific components/subsystems (compressors, heat exchangers, pumps, coils and/or fans).</li>\n<li>Test and evaluate the quality of algorithms using statistical methods.</li>\n<li>Interface with engineers and modelers to create and improve understanding of predictive and descriptive models.</li> \n\n<li>Network across the organization to identify and communicate opportunities to apply data science and machine learning to product design and processes</li>\n<li>Develop and maintain external collaborations to build and leverage cutting-edge capabilities.</li>\n<li>Mentor and guide other team members and colleagues in the domain area.</li>\n<li>Promote the use of data based modeling and simulation within the organization via value benefit analysis and similar demonstrations.</li>\n<li>Participate and present in internal and external forums and conferences, related to data science and analytics.</li>\n<li>Works closely with global team members, cross-functional associates and internal customers in dynamic environment, to gather requirements, provide updates/reports, etc.</li>\n<li>Improves and standardizes application of tools and models across business units, providing sound guidance and training to end-users and sharing best practices.</li>\n<li>Documents work per established internal standards and suggest improvements to procedures.</li>\n<li>Develop a clear understanding of customer requirements and meet or exceed those expectations.</li>\n<li>Conceptualize &amp; develop project ideas leading to new advanced capability development in related domain areas to keep IR to the leading edge of technology.</li>\n<li>Leads internal tactical and strategic projects and reports project progress for quality, deliverables and cost.</li>\n<li>Travel - 10%</li> \n</ul>\n\n<strong><div>\nQualifications:</div>\n\n<br></strong>\n\n\n<ul>\n<li>Master's Degree in Mathematics, Computer Science, Data Science or Statistics and least 5 years of experience applying data-driven modeling required</li>\n<li>Demonstrated work or educational history in engineering and/or engineering related disciplines, including but not limited to differential equations, heat transfer, electrical engineering, controls, HVAC, IoT or embedded technologies</li>\n<li>Management experience is a plus</li>\n</ul>\n\n<strong><div>\nKey Competencies:</div>\n<br>\n</strong>\n<br>\n<div>\n\n\n<ul>\n<li>Intermediate knowledge in at least two of the following technologies: R, Python, SQL, MATLAB and ability to adapt to new technologies, as necessary. Familiarity with tools such as Alteryx, SAS, Tableau, RapidMiner is a plus.</li>\n<li>Understanding of engineering data and physics-based models and simulations.</li>\n<li>Sufficient knowledge of machine learning modeling techniques, and experience visualizing model outputs for engineers, customers and stakeholders.</li>\n<li>Communicate compellingly. Convert insights from analytics to stories. Be an advocate for data science and machine learning, and how to create new capabilities and drive transformation.</li>\n<li>Experience in statistical inference, unsupervised machine learning, supervised machine learning, reliability/survivability models, and/or predictive maintenance. Basic experience with neural nets, cross validation, hyperparameter tuning is desired.</li>\n<li>Good understanding of large-scale data mining and machine learning techniques for clustering, classification, regression, and anomaly detection.</li>\n<li>Ability to manipulate and visualize both structured and non-structured datasets.</li>\n<li>Advanced knowledge of database systems including relational, column store and data marts</li>\n<li>Strong written &amp; verbal English communication skills to interface effectively with team members, customers and stakeholders (senior leaders) in North America and other parts of the world.</li>\n</ul>\n\nWe are committed to helping you reach your professional, personal and financial goals. We offer competitive compensation that aligns with our business strategies and comprehensive benefits to help you live your healthiest. We are committed to building an inclusive and diverse culture that engages as well as values the different backgrounds and experiences of our employee, which, in turn, spurs innovation, generates creative solutions and enhances our customer relations.\n<br><br>\nIf you share our passion for inspiring progress-for bringing about bold shifts in how people, economies and societies operate-then you belong with Ingersoll Rand. Progress begins with you.</div></div>"}