{"job title": "Sr. Data Scientist", "company": "National Oilwell Varco", "city state": "– US Texas Houston", "rating": "3.4", "job description": "Responsibilities:\n\n<ul>\n<li>Collaborate in a corporate group that develops, researches, and conducts strategic analytics projects that have a companywide impact on engineering practices and field operations.</li>\n<li>Candidates will have the opportunity to develop data driven prognostic models that will lay the foundation for NOV’s Condition Based Maintenance Program, and Optimized Operations.</li>\n<li>Leverage past experience and track record in implementing data analytics solutions for challenging engineering and reliability problems on NOV’s product lines</li>\n<li>Work with Big Data infrastructure, Engineering, and Operations in order to develop a scalable and sustainable analytics process.</li>\n<li>Data Science responsibilities include: Data mining, Feature Extractions, Model Selection, Model Optimization, Validation, and Model Deployment.</li>\n<li>Model experience include but are not restricted to: Neural Networks, Support Vector Machine, Genetic Algorithms, Fuzzy logic, Kalman filtering, Weibull Distribution.</li>\n<li>Develop experience on NOV’s various project specific product lines.</li>\n<li>Knowledge management and effective solution delivery.</li>\n<li>Risk, benefit, and cost assessments of pre-existing and suggested engineering practices.</li>\n</ul>\nJob Requirements:\n\n<ul>\n<li>Ph. D. in a quantitative discipline (Engineering, Computer Science,..) with 2-5 years of experience, with a proven track record in the domain of Artificial Intelligence and predictive analytics.</li>\n<li>A proven track record in data driven reliability and operation efficiency is a plus.</li>\n<li>Skills in parallel computing (Hadoop, Spark), R, Python.</li>\n<li>Skills in advanced visualization using open source tools.</li>\n<li>Experience in industrial equipment is a large plus. (Rotating machinery, Hydraulic systems, structural components...).</li>\n<li>Solid technical, analytical, and empirical skills.</li>\n<li>Project Management Experience.</li>\n<li>Proven record in conducting research and producing viable solutions for engineering problems.</li>\n</ul>"}