{"job title": "Sr. Data Scientist", "company": "Nielsen", "city state": "– Chicago, IL", "rating": "3.6", "job description": "<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong><br>\n<div><strong>Sr. Data Scientist - 24755</strong>\n<br><br>\nData Science - USA Chicago, Illinois\n<br><br>\n<strong>Nielsen is the largest market research company in the world with unique measurement technologies, assets, and data that make it one of the most interesting and challenging places for a data scientist to work. We focus on what consumers watch, listen to, and buy and are present in over 95 countries.</strong>\n<br><br>\n<strong>Job Purpose:</strong>\n<br><br>\n<strong>The Senior Data Scientist is responsible for supporting data and software engineering needs of the Data Integration team in the Methods Center.</strong>\n<br><br>\n<strong>Job Responsibilities:</strong>\n<ul>\n\n<li><strong>Create, maintain, and support data pipelines across diverse systems (Azure/AWS, Netezza, Oracle).</strong></li>\n<li><strong>Support automation of business-critical, large-scale manual processes into cloud platforms and python.</strong></li>\n<li><strong>Support cloud migration of statistical processes currently being converted from SAS into Python.</strong></li>\n<li><strong>Support automation of testing and validation.</strong></li>\n<li><strong>Conduct analyses to support Methods programs.</strong></li>\n<li><strong>Facilitate collaboration between Data Science and Application Development Centers.</strong></li>\n<li><strong>Lead prototyping (what-ifs) as well as support pilot programs for R&amp;D purposes. The primary areas include data integration, automation, generalization, harmonization as well as working with different data sources.</strong></li>\n<li><strong>Address major quality escapes.</strong></li>\n<li><strong>Ensure documentation of new methodologies and pipelines.</strong></li>\n<li><strong>Work with cross-functional teams to design, implement, and test new consumer and audience measurement methodologies.</strong></li>\n\n</ul>\n<strong>Role Requirements E=essential, P=preferred.</strong>\n<ul>\n\n<li><strong>E- Senior Data Scientist: 1-2 years of experience in data engineering/software engineering.</strong></li>\n<li><strong>E- Bachelors degree in Computer Science, Information Systems, Statistics, Social Science, Operation Research, or other hard sciences (e.g. Engineering, Computer Science, Biology, Physics etc.) with outstanding analytical expertise and evidence of strong technical leadership.</strong></li>\n<li><strong>P- Advanced degree in Computer Science, Information Systems, Statistics, Social Science, Operation Research, or other hard sciences (e.g. Engineering, Computer Science, Biology, Physics etc.).</strong></li>\n<li><strong>E- Experience in data pipelines, data aggregation techniques, automation, generalization.</strong></li>\n<li><strong>E- Experience in creating stored procedures, triggers, performance issues etc.</strong></li>\n<li><strong>E- Proficient in Python, Scala, Julia, Spark or other statistical/data processing packages.</strong></li>\n<li><strong>E- Knowledge of and experience with Hadoop, Hive/SparkSQL and PySpark</strong></li>\n<li><strong>E- Proficient in Linux and cloud environments.</strong></li>\n<li><strong>E- Expert in SQL, MapReduce, working with algorithms, data lakes and other large-scale databases.</strong></li>\n<li><strong>E- Knowledge of and experience with data modelling and warehouse architecture.</strong></li>\n<li><strong>E- Team player with flexible, proactive and pragmatic attitude.</strong></li>\n\n</ul>\n<strong>#LI-US</strong>\n<br><br>\n<strong>About Nielsen:</strong>\n<br><br>\nNielsen N.V. (NYSE: NLSN) is a global performance management company that provides a comprehensive understanding of what consumers Watch and Buy. Nielsen’s Watch segment provides media and advertising clients with Total Audience measurement services across all devices where content — video, audio, and text — is consumed. The Buy segment offers consumer packaged goods manufacturers and retailers the industry’s only global view of retail performance measurement.\n<br><br>\nBy integrating information from its Watch and Buy segments and other data sources, Nielsen provides its clients with both world-class measurement as well as analytics that help improve performance. Nielsen, an S&amp;P 500 company, has operations in over 100 countries that cover more than 90 percent of the world’s population. For more information, visit www.nielsen.com\n<br><br>\n<em>Nielsen is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class.</em>\n<br><br>\n<strong>Job Type:</strong> Regular\n<br><br>\n<strong>Primary Location</strong>: Chicago,Illinois\n<br><br>\n<strong>Secondary Locations:</strong> FL - Tampa - Oldsmar, , ,\n<br><br>\n<strong>Travel:</strong> Yes, 10% of the Time</div>"}