{"job title": "Analytic Insights - Data Scientist Sr Associate", "company": "PwC", "city state": "– OR-Portland", "rating": "3.8", "job description": "A career in National Special Functions, within Internal Firm Services, will provide you with the opportunity to support service, sector, and market leaders deliver the unique PwC client experience to our clients. You’ll play an important part in continuously innovating and improving Firm operations so that we can continue to provide the highest quality of services to our current and prospective clients.\n<br><br>\nOur Data and Analytics Delivery Services team is responsible for serving as a strategic business partner for an assigned customer to identify and pursue new opportunities, conduct market analysis, and prepare revenue projections. You’ll also develop new service offerings and solutions, enhance existing delivery capabilities, and support the delivery of solutions on engagements.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nAs a Senior Associate, you’ll work as part of a team of problem solvers with extensive consulting and industry experience, helping our clients solve their complex business issues from strategy to execution. Specific responsibilities include but are not limited to:\n<ul>\n<li>Proactively assist in the management of several clients, while reporting to Managers and above</li><li>Train and lead staff</li><li>Establish effective working relationships directly with clients</li><li>Contribute to the development of your own and team’s technical acumen</li><li>Keep up to date with local and national business and economic issues</li><li>Be actively involved in business development activities to help identify and research opportunities on new/existing clients</li> <li>Continue to develop internal relationships and your PwC brand</li>\n</ul>\n<strong><u>Job Requirements and Preferences</u></strong>:\n<br><br>\n<strong><u>Basic Qualifications</u></strong>:\n<br><br>\n<strong>Minimum Degree Required</strong>:\n<br>\nBachelor Degree\n<br><br>\n<strong>Minimum Years of Experience</strong>:\n<br>\n2 year(s)\n<br><br>\n<strong><u>Preferred Qualifications</u></strong>:\n<br><br>\n<strong>Preferred Knowledge/Skills</strong>:\n<br><br>\nDemonstrates thorough knowledge and/or a proven record of success in the following areas:\n<br><br>\n- Working with information technology and business intelligence platforms;\n<br><br>\n- Understanding and developing scientific approaches to extract insights from data and developing predictive models;\n<br><br>\n- Developing differentiated points of view through predictive analytics;\n<br><br>\n- Leveraging modeling, analytics, statistical capabilities, and statistical software (R, Python, SAS) including SQL;\n<br><br>\n- Creating and contextualizing analytic modeling and monitoring of key business drivers;\n<br><br>\n- Managing activities around client support, risk mitigation on a product, deliverable and project basis, and the quality of delivered products by adhering to the unit's quality review protocol; and,\n<br><br>\n- Taking an active part in building a personal knowledge base through proactive data analysis activities and efforts to build product deliverables either individually or with client service teams.\n<br><br>\nDemonstrates thorough abilities and/or a proven record of success in the following areas:\n<br><br>\n- Delivering relevant and value added insights from data;\n<br><br>\n- Leveraging multiple software packages to efficiently execute appropriate analytic techniques and execute in both standard point-and-click and customized code-based settings;\n<br><br>\n- Leveraging both traditional statistical techniques as well as machine learning and artificial intelligence approaches, with thorough ability to understand when and how to apply all approaches to deliver optimal solutions;\n<br><br>\n- Integrating analyses from multiple angles;\n<br><br>\n- Navigation of statistical software after cleaning dirty data from multiple sources;\n<br><br>\n- Leveraging analytics methodologies and tools;\n<br><br>\n- Establishing personal networks relevant to the industry;\n<br><br>\n- Exhibiting team commitment and the willingness to support the team in the attainment organizational goals; and,\n<br><br>\n- Guiding and developing others in the group and across the Analytic Insights organization and the Firm who are new to the industry or subject matter.<br><br>All qualified applicants will receive consideration for employment at PwC without regard to race; creed; color; religion; national origin; sex; age; disability; sexual orientation; gender identity or expression; genetic predisposition or carrier status; veteran, marital, or citizenship status; or any other status protected by law. PwC is proud to be an affirmative action and equal opportunity employer.\n<br><br>\n<em>For positions based in San Francisco, consideration of qualified candidates with arrest and conviction records will be in a manner consistent with the San Francisco Fair Chance Ordinance.</em>"}