{"job title": "Scientist", "company": "Rose International", "city state": "– Tarrytown, NY", "rating": "4.4", "job description": "<div>Position Title: Scientist</div> \n<br>\n<div>Position Number: 293013</div>\n<br>\n<div>Location: Tarrytown, NY</div><br>\n\n<div><strong>Desired Skill Set:</strong></div><div> Clinical, Compliance, Design, Documentation, FDA</div><br>\n\n<div><strong>Position Description:</strong></div><div> **C2C and STEM-OPT are not available**\n\n\n<ul>\n<li>*Only U.S. Citizens and those authorized to work in the U.S. can be considered as W2 candidates.**</li>\n</ul>\n\nJob Title: Clinical Application Specialist\n<br>\nLocation: Tarrytown, NY, 10591\n<br>\nDuration: 6+ Months; potential to go permanent\n<br>\nSchedule: Shift 1; M-F (8:30 AM - 5:00 PM w/ 1/2 hour lunch)\n<br><br>\n<strong>Description:</strong>\n\n\n<ul>\n<li>Reports to a Sr. Clinical Study Manager and assists in the preparation and execution of clinical study tasks, including: documentation (clinical plan, protocol and report), site initiation, monitoring, and completion of clinical studies for verification and/or validation of in vitro diagnostic products.</li>\n<li>Ensures adherence to Good Clinical Practice (GCP) and company standard operating procedures for conducting clinical studies.</li>\n<li>With minimum supervision, completes all activities related to the set-up, initiation, execution and close-out of in vitro diagnostic device clinical studies including collection, timely review and analysis of generated data.</li>\n<li>Communicates with study investigators and site personnel regarding activities in all phases of the study.</li>\n<li>Develops and maintains ongoing relationships with investigators and institutions with access to specimens needed in clinical studies.</li>\n<li>Coordinates with biostatisticians and data managers to manage incoming clinical site data and may assist in the design and maintenance of study databases. Provides up-to-date reports on clinical study progress.</li>\n<li>May negotiate site specific study budgets, and initiate/oversee contract origination, compliance approval, and execution.</li></ul></div>\n\n\n<div> #CBRose#</div>\n<br>\n<div> \n<div>\nSend me a reminder to complete this application</div>\n </div><br>\n\n<div>\n<strong>Rose International is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender (expression or identity), national origin, arrest and conviction records, disability, veteran status or any other characteristic protected by law. Positions located in San Francisco and Los Angeles, California will be administered in accordance with their respective Fair Chance Ordinances.\n<br><br>\nRose International has an official agreement (ID #132522), effective June 30, 2008, with the U.S. Department of Homeland Security, U.S. Citizenship and Immigration Services, Employment Verification Program (E-Verify).\n<br><br>\n(Posting required by OCGA 13/10-91.)</strong></div>\n<br>"}