{"job title": "Data Scientist and Integration Developer", "company": "Vitamin T", "city state": "– Ft. Worth, TX", "rating": "4.8", "job description": "Our Fortune 100 client is looking for a freelance<strong><em> Data Scientist and Integration Designer with Qlikview</em> </strong>to join their small creative agency environment (within a corporation). This role is for 4 months with opportunity to extend and/or convert, 40 hours a week, Ft. Worth TX, healthcare benefits, 401k provided.\n<br><br>\nOur client is a pioneer in the retirement programs industry, receives 45 Best-in-Class awards for <em>PLANSPONSOR</em> magazine and is proud to embrace diversity as a pillar of their business principles.\n<br><br>\n<strong><em><u>What You Will Do:</u></em></strong>\n\n<ul>\n\n\t<li>This is a unique role - which is a combination of Business Intelligence Developer, UX Designer and Business Analyst. In essence, you will focus on agile development methodologies leveraging capacity management, configuration management, storage, and distributed technologies data.</li> \n\n<li>You will also be responsible for taking a look at a large set of data, understanding it and structuring it to design a UI dashboard. Some of the features of this application is built to allow management to look at the amount of applications available, equipment distributed amongst teams (computers, cell phones, patches, etc.), and see the costs, amongst these variables. This person will be responsible for designing those dashboards and determining how do we translate this data into a story on the app.</li>\n\n<li>You will work with system reporting, data visualization, and identify actionable activates to maintain an acceptable service level for the associated environments and applications, e.g. Qlikview development, design and web deployment, data modeling and architecture at scale, UIX design, including graphic design and UI integration with large data-sets.</li> \n\n<li>Engage with vendor, application and system resources to plan for configuration, performance and capacity requirements for a variety of systems</li> \n\n<li>Identify and schedule maintenance events, monitor performance characteristics on a regular basis and implement configuration change that provides consistent performance, audit and remediation of discrepancies from standards</li> \n</ul>\n<strong><em><u>What You Need:</u></em></strong>\n\n<ul>\n\n\t<li>Bachelor’s Degree or related degree or equivalent work experience</li> \n\n<li>Experience in an enterprise class IT or managed service organization, fundamental understanding of the Hadoop Data Lake, experience with OCI, DPA, Densify, VMware products such as vSphere, experience with Qlikview or Tableu visualization products required. Experience with SQL and database management principles experience with security methodologies and datasets, experience with automated script scheduling, various automations tools, and scripting languages</li> \n\n<li>Ability to analyze requirements delivered by system and application administrators and develop a management strategy, ability to mine authoritative data from sources and formulate valuable analysis, advanced technical knowledge of server hardware, operating systems and applications</li> \n\n<li>Familiar with fundamentals of ITIL framework v3</li> \n</ul>\n<strong><em><u>What is it like working with AQUENT</u></em>?</strong> I’m glad you asked! Freelancing long-term with AQUENT gets you access to some pretty cool things including:\n\n<ul>\n\n\t<li>Subsidized health &amp; dental benefits after your first (4) weeks of work (averaging at least 20 hrs/wk)</li>\n\n<li>Access to Fidelity 401(k), access to FSA Program; direct deposit for your paycheck; access to our Talent Rewards Program (we reward for referrals!)</li>\n\n<li>Free online courses via Aquent’s Gymnasium, to help you develop your skills: http://gymnasium.aquent.com; free online courses via Lynda.com</li>\n\n<li>AQUENT support: your AQUENT Agent checks in with you during the course of your contract to make sure you’re happy and progressing according to your expectations (we’re also there to be looking for new opportunities for you when you’re close to wrapping up)</li>\n</ul>\nThat’s it! The rest is up to you, if you are interested in this amazing opportunity please send your resume and cover letter to: jward@aquent.com"}