{"job title": "Machine Learning Scientist", "company": "Amazon", "city state": "– Austin, TX", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nDo you want to help build a highly personalized homepage that greets each of our millions of customers worldwide every time they visit Amazon.com? Are you interested in implementing scalable machine learning and recommendation models using petabytes of customer and product data?<br><br>Amazon’s Homepage Personalization team develops and supports personalization and recommendations for Amazon customers across music, books, movies, fashion, and everything else that Amazon offers. We analyze petabytes of implicit and explicit feedback data on our hundreds of millions of customers and billions of products in order to guide the development of a meaningful and highly personalized homepage experience. <br><br>We are looking for an experienced and forward thinking Machine Learning Scientist to join our team. This person will work closely with software engineers, data engineers, and other Amazon research scientists to design and implement predictive, scalable models for everything from product recommendations to personalized mobile content layouts. You will train massive collaborative filtering models on retail purchases, Prime Video views, Prime Music streams, and other Amazon data to deeply understand our customers.<br><br>This is one of the foremost roles in consumer facing machine learning with the opportunity to reach millions of customers on one of the highest traffic consumer websites in the world. If you are passionate about machine learning and personalization at scale then we encourage you to apply.<br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n- Ph.D. or M.S. in Computer Science, Statistics, or related field. <br>- Proficient with at least one major programming language (Java, Scala, C++, Python).<br>- Experience with supervised and unsupervised machine learning algorithms.<br>- Strong grasp of data structures and algorithms.<br>- Good communication skills with both technical and business people. Ability to speak at a level appropriate for the audience. <br>- Cares deeply about agile software practices, data driven development, and collaborating with other researchers and engineers. <br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n- Experience with big data technologies such as Hadoop, Spark, Redshift, and NoSQL.<br>- Experience implementing machine learning models at web scale. <br>- Experience with collaborative filtering and recommender systems.<br>- Strong research background with publications at major Machine Learning conferences (NIPS, ICML, KDD, AISTATS, RecSys).<br>- Experience running and evaluating AB Tests.\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}