{"job title": "Data Engineer", "company": "Abbott", "city state": "– Waukegan, IL", "rating": "3.5", "job description": "At Abbott, we're committed to helping people live their best possible life through the power of health. For more than 125 years, we've brought new products and technologies to the world -- in nutrition, diagnostics, medical devices and branded generic pharmaceuticals -- that create more possibilities for more people at all stages of life. Today, 99,000 of us are working to help people live not just longer, but better, in the more than 150 countries we serve.\n\n\n<ul>\n<li>*Abbott is looking for a savvy data engineer responsible for expanding and optimizing our NextGen datawarehousing architecture in cloud. The data engineer will support the software developers, database architects, data analysts and data scientists on data initiatives and will ensure optimal data delivery architecture through the ongoing projects. They must be self-directed and comfortable supporting the data needs of multiple teams, systems and products. The right candidate will be excited by the prospect of optimizing and redesigning our data architecture to support our next generation of products and solutions**</li>\n<li>*Job responsibilities**</li>\n</ul>\n\n+ Create and maintain optimal data architecture and data management solutions.\n<br><br>\n+ Assemble large, complex data sets that meet functional / non-functional business requirements.\n<br><br>\n+ Identify, design, and implement internal process improvements: automating manual processes, optimizing data delivery and re-designing infrastructure for greater scalability.\n<br><br>\n+ Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources using sql and aws big data technologies.\n<br><br>\n+ Build analytics tools that utilize the data pipeline to provide actionable insights into customer acquisition, operational efficiency and other key business performance metrics.\n<br><br>\n+ Work with stakeholders including the executive, product, data and design teams to assist with data-related technical issues and support their data infrastructure needs.\n<br><br>\n+ Keep our data separated and secure across national boundaries through multiple aws regions.\n<br><br>\n+ Create data tools for analytics and data scientist team members that assist them in building and optimizing our product into an innovative industry leader.\n<br><br>\n+ Work with data and analytics experts to strive for greater functionality in our data systems.\n\n\n<ul>\n<li>*Qualifications**</li>\n</ul>\n\n+ Advanced working sql knowledge and experience working with relational databases, query authoring (sql) as well as working familiarity with a variety of databases.\n<br><br>\n+ Experience performing root cause analysis on internal and external data and processes to answer specific business questions and identify opportunities for improvement.\n<br><br>\n+ Strong analytic skills related to working with unstructured datasets.\n<br><br>\n+ Build processes supporting data transformation, data structures, metadata, dependency and workload management.\n<br><br>\n+ Working knowledge of message queuing, stream processing, and scalable big data stores.\n<br><br>\n+ Strong project management and organizational skills.\n<br><br>\n+ Experience supporting and working with cross-functional teams in a dynamic environment.\n<br><br>\n+ 5+ years of experience in a data engineer role, with a graduate degree in computer science, statistics, informatics, information systems or another quantitative field.\n<br><br>\n<strong>+ Experience using the following software/tools:</strong>\n<br><br>\n+ Big data tools: hadoop, spark, kafka.\n<br><br>\n+ Relational sql and nosql databases, including postgres and cassandra.\n<br><br>\n+ Data pipeline and workflow management tools.\n<br><br>\n+ Aws cloud services: ec2, emr, rds, redshift is a plus\n<br><br>\n+ Stream-processing systems: storm, spark-streaming.\n<br><br>\n+ Object-oriented/object function scripting languages: python, java, c++, scala\n<br><br>\nAn Equal Opportunity Employer\n<br><br>\nAbbot welcomes and encourages diversity in our workforce.\n<br><br>\nWe provide reasonable accommodation to qualified individuals with disabilities.\n<br><br>\nTo request accommodation, please call 224-667-4913 or email corpjat@abbott.com"}