{"job title": "Data Engineer", "company": "Baker Technologies", "city state": "– Denver, CO", "rating": "5.0", "job description": "Baker Technologies, Inc. | TILT Holdings, Inc.\n<br><br>\nWe are looking for a savvy Data Engineer to join our growing team of analytics experts. The hire will be responsible for expanding and optimizing our data and data pipeline architecture, as well as optimizing data flow and collection for cross functional teams. The ideal candidate is an experienced data pipeline builder and data wrangler who enjoys optimizing data systems and building them from the ground up. The Data Engineer will support our software developers, database architects, data analysts and data scientists on data initiatives and will ensure optimal data delivery architecture is consistent throughout ongoing projects. They must be self-directed and comfortable supporting the data needs of multiple teams, systems and products. The right candidate will be excited by the prospect of optimizing or even re-designing our company's data architecture to support our next generation of products and data initiatives.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Create and maintain optimal data pipeline architecture,</li>\n<li>Assemble large, complex data sets that meet functional / non-functional business requirements.</li>\n<li>Identify, design, and implement internal process improvements: automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc.</li>\n<li>Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources using SQL and Google Cloud Platform's 'big data' technologies.</li>\n<li>Build analytics tools that utilize the data pipeline to provide actionable insights into customer acquisition, operational efficiency and other key business performance metrics.</li>\n<li>Work with stakeholders including the Executive, Product, Data and Design teams to assist with data-related technical issues and support their data infrastructure needs.</li>\n<li>Keep our data separated and secure across national boundaries through multiple data centers and GCP regions.</li>\n<li>Create data tools for analytics and data scientist team members that assist them in building and optimizing our product into an innovative industry leader.</li>\n<li>Work with data and analytics experts to strive for greater functionality in our data systems.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>Advanced working SQL knowledge and experience working with relational databases, query authoring (SQL) as well as working familiarity with a variety of databases.</li>\n<li>Experience building and optimizing 'big data' data pipelines, architectures and data sets.</li>\n<li>Experience performing root cause analysis on internal and external data and processes to answer specific business questions and identify opportunities for improvement.</li>\n<li>Strong analytic skills related to working with unstructured datasets.</li>\n</ul>\n\nBuild processes supporting data transformation, data structures, metadata, dependency and workload management.\n\n\n<ul>\n<li>A successful history of manipulating, processing and extracting value from large disconnected datasets.</li>\n<li>Working knowledge of message queuing, stream processing, and highly scalable 'big data' data stores.</li>\n<li>Knowledge of graph databases and graph theory</li>\n<li>Strong project management and organizational skills.</li>\n<li>Experience supporting and working with cross-functional teams in a dynamic environment.</li>\n</ul>\n\nWe are looking for a candidate with 5+ years of experience in a Data Engineer role, who has attained a Graduate degree in Computer Science, Statistics, Informatics, Information Systems or another quantitative field. They should also have experience using the following software/tools:\n<br><br>\nExperience with big data tools: Hadoop, Spark, Kafka, etc.\n<br><br>\nExperience with relational SQL and NoSQL databases, including Postgres and Neo4j.\n<br><br>\nExperience with data pipeline and workflow management tools: Azkaban, Luigi, Airflow, etc.\n<br><br>\nExperience with GCP cloud services\n<br><br>\nExperience with stream-processing systems\n<br><br>\nExperience with object-oriented/object function scripting languages: Python, Java, C++, Scala, etc.\n<br><br>\nSalary: $50-70,000\n<br><br>\nMust be willing to relocate to Denver.\n<br><br>\nAbout Baker and TILT\n<br><br>\nUnder a combination agreement signed on July 9, 2018, Baker plans to merge with Briteside, Sea Hunter Therapeutics, and Sante Veritas Therapeutics (SVT) to form TILT Holdings, Inc. (\"TILT\") after obtaining all regulatory approvals and satisfying all closing conditions. Post closing, the merged company, TILT, expects to establish operations in every state where cannabis laws exist, for both infrastructure as well as technology. At present, Baker, Briteside and Sea Hunter operate in 24 states collectively and have licenses for cannabis operations in a portion of those. TILT is expected to be a multinational infrastructure and technology platform delivering solutions to the legalized cannabis industry. TILT will enable businesses the opportunity to interact, communicate and operate with a greater degree of efficiency with their patients and consumers. Consisting of four leading cannabis companies, TILT will maintain competencies across the entire spectrum of the industry, from vertically integrated operations to cutting-edge genetics and business technology solutions, all supported by robust data-driven insights.\n<br><br>\nAbout the companies that will combine to become TILT:\n<br><br>\n? Baker Technologies (Denver, CO) - The cannabis industry's largest software company, helps dispensaries generate more revenue and build relationships with their customers through a variety of products, featuring online\n<br><br>\nordering, customer loyalty, messaging, and analytics. The company works\n<br><br>\nwith over 1,000 dispensaries across the U.S. and Canada.\n<br><br>\n? Briteside (Bend, OR) - Briteside produces a diverse range of products and\n<br><br>\nservices, from prefabricated modular cultivation units to home delivery and subscription based services. All Briteside products are predicated on\n<br><br>\nproprietary algorithms designed to improve yields and efficiencies while\n<br><br>\nreducing costs and time.\n<br><br>\n? Sea Hunter Therapeutics (Boston, MA) - Established as a service provider and franchisor, Sea Hunter provides retail license holders with intellectual\n<br><br>\nproperty, operating expertise, capital, and a diverse range of products and\n<br><br>\ndifferentiated brands. The company also operates proprietary, vertical\n<br><br>\noperations which allows it to deliver a more knowledge-based product to\n<br><br>\ncustomers.\n<br><br>\n? Sante Veritas Therapeutics - One of the few licensed producers in\n<br><br>\nCanada that has a developed facility and robust portfolio of wholesale\n<br><br>\ncontracts. SVT's subsidiary, Santé Veritas Therapeutics Inc. (\"SVT Subco\"), is at the final stage of obtaining a cultivation license under the Access to\n<br><br>\nCannabis for Medical Purposes Regulations.\n<br><br>\nThis listing is for a job opportunity with Baker Technologies, Inc."}