{"job title": "Scientist - Medicinal Chemistry", "company": "BlackThorn Therapeutics", "city state": "– San Francisco, CA", "rating": "5.0", "job description": "<strong>Who We Are:</strong>\n<br><br>\nBlackThorn Therapeutics is dedicated to improving the lives of people with neurobehavioral disorders, such as depression, schizophrenia and autism, through the discovery and development of novel, targeted therapeutic agents. BlackThorn applies data-driven approaches (INFORM™) to create an understanding of the core underlying pathophysiology of neurobehavioral disorders and uses these insights to generate objective neuromarkers that support target identification and localization, patient stratification and objective trial endpoints. We are committed to fostering our chemical expertise and applying it to the successful progression of projects at various stages in the drug discovery and development process.\n<br><br>\n<strong>The Position:</strong>\n<br><br>\nApply your synthetic and medicinal chemistry skills and put them into practice alongside the expert chemists on our small but growing team. Your responsibilities will include the preparation (synthetic organic, microwave, and array-style chemistry), purification (normal and reversed phase, automated flash chromatography), and characterization (HPLC, LCMS, NMR) of small molecule, CNS targeted, focused libraries. You will contribute to the evaluation of biological data and participate in an iterative cycle of “design and synthesize,” using state of the art software to optimize molecular properties within our chemical space.\n<br><br>\nThe major responsibilities will encompass:\n\n<ul>\n<li>Synthetic chemistry and purification techniques</li>\n\n<li>Evaluation of structure activity and structure property relationships</li>\n\n<li>Reporting experimental results to supervisor / chemistry team</li>\n\n<li>Working with the team to ensure finely tuned laboratory operations</li>\n</ul>\n<br><br>\n<strong>Who You Are:</strong>\n\n<ul>\n<li>Expert synthetic organic medicinal chemist with excellent scientific judgement</li>\n\n<li>Team-oriented and biased to action with a commitment to active learning</li>\n\n<li>Budding Drug Hunter with experience in lead optimization and compound design using state of the art techniques and medicinal chemistry strategies</li>\n\n<li>Independent thinker capable of design and execution of highly creative synthetic routes</li>\n\n<li>Intrinsically motivated to continuously improve knowledge and skills in medicinal chemistry and drug discovery</li>\n\n<li>Eager to share learnings from your own intellectual curiosity with the chemistry team and the research organization as a whole</li>\n\n<li>Broadly schooled in medicinal chemistry principles, biology, drug metabolism and pharmacokinetic concepts and data interpretation</li>\n\n<li>Passionate about multi-parametric optimization and informed design of small molecule lead candidates</li>\n\n<li>An innovator; willing to take on challenges whilst striving for personal excellence</li>\n\n<li>Mindful and committed to the maintenance of a safe and effective laboratory environment</li>\n\n<li>Active contributor to scientific discussions and group meetings</li>\n\n<li>Clearly impactful through independent and innovative contributions to synthetic organic and/or medicinal chemistry projects</li>\n\n<li>Compassion for patients with neurobehavioral disorders and passionate about discovering and developing new therapies to improve their lives</li>\n</ul>\nPhD in organic chemistry is preferred."}