{"job title": "Biological Scientist", "company": "Department of the Air Force", "city state": "– Fort Sam Houston, TX", "rating": "4.2", "job description": "<ul>\n<li>Videos</li>\n<li>Duties</li>\n</ul>\n\nHelpDuties Summary\n<br><br>\nClick on \"Learn more about this agency\" button below for IMPORTANT additional information.\n<br><br>\nThe primary purpose of this position is to serve as a Biological Scientist participating in project management, execution, and operations responsibility in assigned project(s) within an assigned program element.\n<br><br>\nLearn more about this agency\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Identify, develop, implement, and revise Interagency and Intergovernmental Coordination for Environmental Planning(IICEP), Environmental Baseline Survey (EBS) to satisfy and legally or organizational mandated requirements.</li>\n<li>Develops, institutionalizes and uses programs performance measures and monitoring processes to assess the ability of the Commandand field units to meet stated program goals and mission essential tasks.</li>\n<li>Provides advisory services on specific problems, projects, programs, and functions in assigned program area</li>\n<li>Troubleshoot biological science problems requiring investigation of unsanitary or questionable conditions in assigned program(s) area</li>\n</ul>\n\nTravel Required\n<br><br>\nOccasional travel - You may be expected to travel for this position.\n<br><br>\nSupervisory status\n<br><br>\nNo\n<br><br>\nPromotion Potential\n<br><br>\n<strong>14</strong>\n\n\n<ul>\n<li>Job family (Series)</li>\n</ul>\n\n0401 General Natural Resources Management And Biological Sciences\n<br><br>\nSimilar jobs\n\n\n<ul>\n<li>Biological Scientists</li>\n<li>Requirements</li>\n</ul>\n\nHelpRequirements Conditions of Employment\n\n\n<ul>\n<li>Please read this Public Notice in its entirety prior to submitting your application for consideration.</li>\n<li>U.S. Citizenship is required</li>\n<li>Males must be registered for Selective Service, see www.sss.gov</li>\n<li>Total salary varies depending on location of position</li>\n<li>PCS expenses if authorized will be paid IAW JTR and Air Force Regulations</li>\n<li>Recruitment incentives may be authorized</li>\n<li>Position may be subject to random drug testing</li>\n<li>Employee may be required to work other than normal duty hours, to include evenings, weekends and/or holidays</li>\n<li>Shift work and emergency overtime may be required</li>\n<li>Employee may be required to maintain current certifications</li>\n<li>A security clearance may be required</li>\n<li>Disclosure of Political Appointments</li>\n<li>Per National Defense Authorization Act (NDAA) of fiscal year (FY) 2017. Section 1111 modifies 5 United States Code (U.S.C.) 3326; Veterans who are retiring within 180 days of appointment effective date may require a 180 day waiver package.</li>\n<li>This position is subject to provisions of the DOD Priority Placement Program</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\n<strong>Specialized experience:</strong>\n<br><br>\nGS-11: One year of specialized experience equivalent to the GS-09 grade level in the Federal service. Examples of specialized experience is experience which involves professional knowledge of environmental biological concepts, principles, methodology, and practices as well as the ability to apply standard environmental biological practices, methods, and techniques to perform, following specific instructions, relatively routine projects or a portion of a larger and more complex project.\n<br><br>\nGS-12: One year of specialized experience equivalent to the GS-11 grade level in the Federal service. Example of specialized experience is experience which involves experience in engineering or scientific theories, principles, concepts, standards, and methods to determine and/or execute actions for a wide range of environmental assignments involving combinations of complex features pertaining to control or reduction of air, water, and land pollution, site remediation, natural and cultural resource management, environmental impact analysis, hazardous and solid waste management, and resource recovery and recycling.\n<br><br>\nGS-13: One year of specialized experience equivalent to the GS-12 grade level in the Federal service. Example of specialized experience is experience which includes experience in relation to knowledge of climate and hydrological science methods, guidelines, standards, research techniques, and state of the art capabilities and ability to resolve highly complex and difficult meteorological and climate science problems and issues.\n<br><br>\nGS-14: one year of specialized experience equivalent to the GS-13 grade level in the Federal service. Example of specialized experience is professional knowledge of environmental biological scientific concepts, principles, methodology, and practices and familiarity with other professional disciplines (e.g., engineering, community planning, and environmental science) to independently perform routine projects with complete responsibility, or portions of large and complex projects.\n<br><br>\n<strong>AND</strong>\n<br><br>\nClick on the following link to view occupational requirements for this position:\n<br><br>\nhttp://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/0400/general-natural-resources-management-and-biological-sciences-series-0401/\n<br><br>\n<strong>OR</strong>\n<br><br>\nTo view qualifying educational requirements and/or combination of education and specialized experience click on the following link:\n<br><br>\nhttp://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/#url=GS-PROF\n<br><br>\nKNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas:\n\n\n<ul>\n<li>Ability to demonstrate the highest degree of judgment, resourcefulness, management skills, and oral and written communications.</li>\n<li>Mastery of advanced concepts, principles and practices of environmental engineering that enables the employee to serve as the technical authority in the development of guidance, criteria, and standards for implementing and managing Environmental Analysis.</li>\n<li>Knowledge of environmental protection concepts, principles, techniquesand practices to enable the incumbent to make reasoned</li>\n</ul>\n\njudgements on process improvement.\n\n\n<ul>\n<li>Mastery of written of oral communications and ability to prepare and present written and oral presentations to superior and subordinate</li>\n</ul>\n\norganizations and assemblies.\n\n\n<ul>\n<li>Knowledge and skill to apply the latest developments in management practices to resolve problems for which accepted methods are not</li>\n</ul>\n\napplicable.\n\n\n<ul>\n<li>Knowledge in environment quality that involve Federal, state, DoD and Air Force policies, directives, and regulations. Knowledge of safety and security regulations, practices, and procedures.</li>\n</ul>\n\nPART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n<br><br>\nVOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n<br><br>\n<strong>Education</strong>\n<br><br>\nIF USING EDUCATION TO QUALIFY: You MUST provide transcripts to support your educational claims. Education must be accredited by an accrediting institution recognized by the U.S. Department of Education.\n<br><br>\nFOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying."}