{"job title": "Research Scientist", "company": "Intel Corporation", "city state": "– Hillsboro, Oregon", "rating": "3.8", "job description": "<strong> Job Description</strong><br><br>As a Research Scientist with the Extreme Scale Computing team you will be on the leading edge of compute innovation and design.\n<br><br>\nWe are looking for an individual with strong background in one or multiple of the following areas:\n<li> Algorithms workload analysis and optimization</li> <li> Machine learning performance modeling</li> <li> computer architecture</li>\nIf you are excited about a mix of research and development effort on the leading edge of compute development, this is a great opportunity!\n<br><br>\n<strong> Qualifications</strong>\n<br><br>\nYou must possess the below minimum qualifications to be initially considered for this position. Relevant experience can be obtained through school work, classes and project work, internships, military training, and/or work experience. This is an entry level position and will be compensated accordingly.\n<br><br>\nThis position requires US Citizenship, or Permanent Right to Work in US. and government security clearance is highly desired. The selected candidate must undergo a security investigation which will take several months to adjudicate. Preferred candidates will have, or are willing to obtain,\n<br><br>\nan interim and/or final (e.g., confidential/secret/top secret, etc.) security clearance AND must be able to maintain the required level of clearance while employed in the subject position.\n<br><br>\n<strong> Minimum requirements:</strong>\n<li> PhD or MSc in computer science, computer engineering, electrical engineering, applied mathematics, or a related field.</li> <li> This U.S. position is open to U.S. Workers Only. A U.S. Worker is someone who is either a U.S. Citizen, U.S. National, U.S. Lawful Permanent Resident, or a person granted Refugee or Asylum status by the U.S. Government. Intel will not sponsor a foreign national for this position.</li> <li> Minimum 1 year of experience/knowledge with:Programming skills C/C++Algorithm understanding/optimization/development</li>\n<strong> Preferred Requirements:</strong>\n<li> Publications in Tier-1 conferences and journals.</li> <strong> Inside this Business Group</strong><br><br>The Data Center Group (DCG) is at the heart of Intels transformation from a PC company to a company that runs the cloud and billions of smart, connected computing devices. The data center is the underpinning for every data-driven service, from artificial intelligence to 5G to high-performance computing, and DCG delivers the products and technologiesspanning software, processors, storage, I/O, and networking solutionsthat fuel cloud, communications, enterprise, and government data centers around the world.\n<br><br>\nUS, California, Folsom;US, California, Santa Clara;US, Texas, Austin\n<br><br>\n<strong> Posting Statement.</strong> Intel prohibits discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status."}