{"job title": "Research Scientist Machine Learning", "company": "Intel Corporation", "city state": "– Santa Clara, California", "rating": "3.8", "job description": "<strong> Job Description</strong><br><br><strong> Business Group</strong>\n<br><br>\nIntel Labs is the company's world-class, industry leading research organization, responsible for driving Intel's technology pipeline and creating new opportunities. The mission of Intel Labs is to deliver breakthrough technologies to fuel Intel's growth. This includes identifying and exploring compelling new technologies and high risk opportunities ahead of business unit investment and demonstrating first-to-market technologies and innovative new usages for computing technology. Intel Labs engages the leading thinkers in academia and industry in addition to partnering closely with Intel business units.\n<br><br>\nIntel Labs is seeking motivated researcher in the area of machine learning and cybersecurity research. This is a full-time position with the Parallel Computing Lab.\n<br><br>\nThe Parallel Computing Lab researches new algorithms, architectures, and approaches to address the most challenging compute- and data-intensive applications. We are focused on delivering new Intel software and hardware technologies that will transform the enterprise and technical computing experience. We work in close collaboration with leading academic and industry partners to accomplish our mission.\n<br><br>\nIn this position, you will be responsible for conceiving, researching, and prototyping new machine learning and cybersecurity techniques, and you will develop relevant software and hardware technologies with the goal of converting these into products and fueling Intels growth. You will identify and research promising technologies typically 3-5 years prior to product development. This requires a understanding of state-of-the-art techniques in machine learning and cybersecurity, optimization of algorithms, and benchmarking, along with understanding of computer architecture. You may also participate in the development of intellectual property.\n<br><br>\n<strong> Behavioral Traits:</strong>\n<li> You must possess strong verbal and written communication skills and the demonstrated ability to work in a demanding team-oriented environment.</li>\n<strong> Qualifications</strong>\n<br><br>\nYou must possess the minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum qualifications and are considered a plus factor in identifying top candidates. Experience would be obtained through your educational level research and/or relevant job/internship experiences.\n<br><br>\n<strong>Minimum Qualifications:</strong>\n\n\n<ul>\n<li>PhD in Electrical/Computer Engineering, Computer Science, or a relevant engineering discipline</li>\n<li>3 years of school and/or internship experience in the development of machine learning and cybersecurity techniques</li>\n<li>3 years of school and/or internship experience in functional and/or object-oriented programming (e.g., C++, Java, etc.)</li>\n</ul>\n\n<strong> Preferred Qualifications:</strong>\n<br><br>\n<strong> 1 year of Experience in the following:</strong>\n<li> Middleware/runtime systems.</li> <li> Computer architecture.</li> <li> Performance profiling and characterization</li> <strong> Inside this Business Group</strong><br><br>Intel Labs is the company's world-class, industry leading research organization, responsible for driving Intel's technology pipeline and creating new opportunities. The mission of Intel Labs is to deliver breakthrough technologies to fuel Intel's growth. This includes identifying and exploring compelling new technologies and high risk opportunities ahead of business unit investment and demonstrating first-to-market technologies and innovative new usages for computing technology. Intel Labs engages the leading thinkers in academia and industry in addition to partnering closely with Intel business units.\n<br><br>\nUS, Oregon, Hillsboro;\n<br><br>\n<strong> Posting Statement</strong>\n<br>\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance."}