{"job title": "Entry Level Biology Scientist", "company": "Momentum Scientific", "city state": "– Chicago, IL", "rating": "5.0", "job description": "A large pharmaceutical company is looking for entry level microbiologists to join their team. This position leaves room for upward mobility and provides an opportunity to gain experience in microbiological testing with an energetic company culture. Some microbiologist responsibilities would include:\n\n<ul>\n <li>Environmental monitoring and endotoxin testing.</li> <li>Analyze testing through data and reports.</li> <li>Plating, staining and streaking.</li> <li>Adhere to cGMP/cGLP laboratory procedures.</li>\n</ul>\n\n<strong>Some qualities that would be preferred:</strong>\n\n<ul>\n <li>A degree in Microbiology, Biology, Biochemistry or another related science.</li> <li>Recent graduates preferred, or recent laboratory experience.</li> <li>Understanding of microbial techniques.</li> <li>Strong work ethic and a desire to grow.</li>\n</ul>\n\n<strong>Why Momentum?</strong>\n<br><br>\nWe partner with Chicago's top employers and match them with top talent. We represent many of Chicago's most desirable employers in their hiring efforts. They turn to Momentum for our industry specific expertise and ability to match them with the industries best candidates. Our boutique approach has made us the fastest growing scientific staffing company in Chicago.\n<br><br>\nAt Momentum, we work with you to develop a job search strategy that suits your unique aspirations and skills. Our recruiting approach sets us apart from other staffing agencies by gaining a greater degree of partnership with you - the candidate. We attribute our success as a company to the relationships weve fostered with our candidates and contractors.\n<br><br>\nReady to be a part of the Momentum revolution? Good idea. Here are some of the top reasons to work with Momentum:\n\n<ul>\n <li><strong>Full Time Healthcare</strong> - When you work with Momentum you're eligible for the same healthcare packages we have. All of our healthcare plans are Affordable Care Act compliant, don't have waiting periods and avoid federal tax penalties. Youll be able to choose between Gold, Silver and Bronze plans. Better yet, we cover 50% of the monthly premium. Why should you be treated like a second class employee just because you are a contractor? Crazy.</li>  <li><strong>Industry Expertise</strong> - All we do is science. Period. Our industry focus gives us a greater degree of insight into what you should expect your career decision. We're experts at getting your career to where you want it to go. We'll help you understand your career options and work with you to determine the path that suits you. Why would you want to work with an agency that only does science on the side?</li> <li><strong>Permanent Results</strong> - Last year 94% of our contractors were converted to permanent employees. Pretty impressive huh? Getting you a permanent job is our priority as an agency. No other agency in the scientific space can boast such a high conversion rate.</li>  <li><strong>No Charge</strong> - With Momentum there are no hidden fees. We don't take any money out of your paycheck or charge a conversion fee. Our clients pay for what we do, not our employees.</li>  <li><strong>Consultative Approach</strong> - When you work with Momentum, we start by learning a lot about your career direction. Only then do we propose a path that will help you achieve your career goals. We share a lot of our industry expertise with you so that you are informed about your options.</li> \n</ul>\nSDL2017"}