{"job title": "Research Scientist", "company": "Oath", "city state": "– New York, NY", "rating": "3.2", "job description": "Oath, a subsidiary of Verizon, is a values-led company committed to building brands people love. We reach over one billion people around the world with a dynamic house of 50+ media and technology brands. A global leader in digital and mobile, Oath is shaping the future of media. <p><b><strong>A Little About Us</strong></b></p><p>Oath is a leading provider of media and technology brands, reaching over a billion people around the world. Oath's Platforms Engineering organization creates modern, secure, and efficient software platforms to power all of Oath's brands at scale. Our Identity and User Data platforms for consumers and businesses lead the industry in trust and security. Our computer operating systems, languages, build systems, and developer tools drive technical excellence and developer productivity. Our Monitoring, Payments, Cloud Platforms, Mobile SDKs, and many other systems accelerate growth and innovation.</p><p>We have exciting job openings for top Research Scientists who are ready to make a significant impact. Research Scientists are individual contributors to the organization. Through compelling data mining, machining learning, and visualization algorithms, they gain knowledge and make decisions from data, and help our company to build better and more secure platforms and products.</p><p>We hire the best scientific minds who like to roll up their sleeves to make new discoveries that contribute to the success of the business, and can be presented at the top scientific conferences. Our scientists specialize in mining large amount of data from the Oath's scale of billions of global users, to make or inform business decisions. We design and invent algorithms to push the boundary of the intelligence, performance and security of our platforms, to mine huge amount of data to get knowledge and understanding, and to find patterns and anomalies. We evaluate the impact in Web-scale production settings. We actively contribute to the scientific and open source communities in Computer Science and related areas.</p><p><b><strong><b>Platform Engineering's Oath in Three Words: Secure Modern Efficient</b></strong></b></p><p><b><strong><b>Responsibilities:</b></strong></b></p> <ul> <li><p>Deep dive into the data to find patterns and gain knowledge through innovation and application of scalable algorithms.</p></li><li><p>Work closely with colleagues on the engineering team to put research results into action.</p></li><li><p>Provide thought leadership to guide the direction of Oath products and services.</p></li><li><p>Be a leader in your research area and look to influence our products and services with your expertise.</p></li> </ul> <p><b><strong><b>Minimum Qualifications:</b></strong></b></p> <ul> <li><p>PhD in Computer Science or related fields.</p></li><li><p>Strong academic research track record in one of the following areas: Data Mining and Visualization, Applied Machine Learning, and related areas.</p></li><li><p>Strong implementation skills in Java, Scala, Python etc. Experience with large-scale production code development a plus.</p></li><li><p>Ability to conduct research that is justified and guided by business opportunities</p></li><li><p>Strong communication and presentation skills.</p></li> </ul> <p>Oath is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on, age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Oath is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. Please let us know if you need a reasonable accommodation to apply for a job or participate in the application process.</p> <p>Currently work for Oath? Please apply on our internal career site. </p>"}