{"job title": "Research Scientist", "company": "Pharmaceutical Product Development", "city state": "– Middleton, WI", "rating": "3.4", "job description": "<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Conducts and provides technical guidance on scientific method development and validation projects and/or other specialty technologies studies OR performs troubleshooting for own and others instruments, methods, procedures, and in writing protocols and reports.</li>\n<li>Designs and executes method development/validation and/or extractable/leachable studies independently and interprets and reviews analytical data for self and others OR designs and executes multiple stability and inhalation procedures as well as assists others in performing routine maintenance and troubleshooting on multiple instruments (HPLC, GC, UPLC, ICP-MS, LC/MS, GC/MS etc.) and multiple detection techniques (UV, FL, CAD, ELSD, IC etc.), methods and procedures.</li>\n<li>Routinely acts as the technical project leader for multiple projects, provide updates, reviews and evaluates data, writes reports and protocols.</li>\n</ul>\n\n<strong>Education and Experience:</strong>\n\n\n<ul>\n<li>Bachelor's degree or equivalent and relevant formal academic / vocational qualification</li>\n<li>Previous experience that provides the knowledge, skills, and abilities to perform the job (comparable to 8 years') or equivalent combination of education, training,&amp;experience. OR</li>\n<li>Masters degree and previous experience that provides the knowledge, skills, and abilities to perform the job (comparable 6 year)</li>\n</ul>\n\n<strong>OR</strong>\n\n\n<ul>\n<li>PhD and previous experience that provides the knowledge, skills, and abilities to perform the job (comparable 4 year)</li>\n</ul>\n\n<strong>Knowledge, Skills and Abilities:</strong>\n\n\n<ul>\n<li>Broad knowledge of protein and peptide chemistry, biochemistry, and practical experience in testing (ELISA, Gel Electrophoresis, Peptide Mapping, Amino Acid Analysis)</li>\n<li>Full understanding of laboratory requirements, SOPs, ICH guidelines, USP requirements and FDA guidance</li>\n<li>Full theoretical and hands-on understanding and knowledge of general chemistry and separation science</li>\n<li>Full knowledge of technical operating systems</li>\n<li>Ability to independently optimize analytical methods</li>\n<li>Ability to independently perform root cause analysis for method investigations</li>\n<li>Proven ability in technical writing skills</li>\n<li>Proven problem solving and troubleshooting abilities</li>\n<li>Effective written and oral communication skills as well as presentation skills</li>\n<li>Time management and project management skills</li>\n<li>Ability to mentor others on technical operating systems</li>\n<li>Ability to independently review and understand project proposals/plans</li>\n</ul>\n\nWorking Conditions\n\n\n<ul>\n<li>Work is performed in a laboratory and/or a clinical environment with exposure to electrical office equipment.</li>\n<li>Occasional drives to site locations, occasional domestic travel.</li>\n<li>Exposure to biological fluids with potential exposure to infectious organisms.</li>\n<li>Rare exposure to skin and lung irritants, radiation, toxic materials and hazardous waste.</li>\n<li>Personal protective equipment required such as protective eyewear, garments and gloves.</li>\n<li>Exposure to fluctuating and/or extreme temperatures on rare occasions.</li>\n</ul>\n\nPhysical Requirements\n\n\n<ul>\n<li>Ability to work in an upright and /or stationary position for 6-8 hours per day.</li>\n<li>Repetitive hand movement of both hands with the ability to make fast, simple, repeated movements of the fingers, hands, and wrists to operate lab equipment.</li>\n<li>Occasional mobility needed.</li>\n<li>Occasional crouching, stooping, with frequent bending and twisting of upper body and neck.</li>\n<li>Light to moderate lifting and carrying (or otherwise moves) objects including luggage and laptop computer with a maximum lift of 15-20 lbs.</li>\n<li>Ability to access and use a variety of computer software developed both in-house and off-the-shelf.</li>\n<li>Ability to communicate information and ideas so others will understand; with the ability to listen to and understand information and ideas presented through spoken words and sentences.</li>\n<li>Frequently interacts with others to obtain or relate information to diverse groups.</li>\n<li>Works independently with little guidance or reliance on oral or written instructions and plans work schedules to meet goals. Requires multiple periods of intense concentration.</li>\n<li>Performs a wide range of variable tasks as dictated by variable demands and changing conditions with little predictability as to the occurrence. Ability to perform under stress. Ability to multi-task.</li>\n<li>Regular and consistent attendance.</li>\n</ul>\n\nPharmaceutical Product Development, LLC is firmly committed to Equal Employment Opportunity (EEO) and prohibits employment discrimination for employees and applicants based on age, race, color, pregnancy, gender, gender identity, sexual orientation, national origin, religion, marital status, citizenship, disability or protected veteran or other status protected by federal, state, and/or local law."}