{"job title": "Analytical Scientist", "company": "Planet Pharma", "city state": "– Duluth, GA", "rating": "4.1", "job description": "<strong>Summary:</strong>\n<br><br>\nThe role of Contract Analytical Scientist is part of the Quality organization working on a special project for the world's leading contact lens manufacturing site. The role will support a project established to investigate improvements to the material formulation for a leading contact lens brand. The position will conduct analytical method development and testing following established SOP's, methods, and procedures in compliance with cGMP, FDA regulations and Corporate Quality Policies.\n<br><br>\nThis position is semi-independent, with the expectation to complete tasks on time in accordance with agreed deadlines. This position is expected to communicate effectively on needs, challenges and successes; works with a sense of urgency; is highly focused and requires a high attention to detail.\n<br><br>\n<strong>Duties:</strong>\n\n\n<ul>\n<li>Conduct testing and data collection necessary to support development of product enhancement at the JCM Alcon facility.</li>\n<li>Provide technical input on observed issues with analytical methods, procedures, and practices.</li>\n<li>Conduct lab investigations, and special analytical projects as assigned.</li>\n<li>Complete and participate in training activities which maintain or improve analytical skill sets and practices.</li>\n<li>Define and work on resolving technical problems within defined scope and within level of expertise.</li>\n<li>Actively work in a team environment and participate in natural work groups and increase productivity.</li>\n<li>Assist with method implementation and/or method transfer activities</li>\n</ul>\n\n<strong>Requirements:</strong>\n<br><br>\n<strong>Skills:</strong>\n\n\n<ul>\n<li>BS plus 1-2 years relevant experience in cGMP regulated environment with knowledge of FDA and Quality System requirements.</li>\n<li>Must have demonstrated experience in precise and accurate manipulation of extremely small quantities (micro volumes).</li>\n<li>Demonstrated knowledge of Analytical Chemistry.</li>\n<li>Experience with analytical method development and range finding studies preferred.</li>\n<li>Additional experience with other analytical laboratory equipment preferred, such as HPLC, UV-Vis, FTNIR, IR, USP Monograph Testing, Viscometry, Particle Size Analyzer, is also a plus.</li>\n<li>Computer Skills required with working knowledge of MS Office, with excellent written and verbal communication.</li>\n<li>Excellent written and verbal communication and interpersonal skills.</li>\n<li>Highly motivated, goal orientated achiever with ability to prioritize and organize own work semi-independently.</li>\n<li>Proficiency with written and spoken English.</li>\n</ul>\n\n<strong>Education:</strong>\n\n\n<ul>\n<li>Minimum: Bachelor of Science in Chemistry or related field from an accredited university.</li>\n<li>Preferred: MS in Chemistry or related field from an accredited university.</li>\n</ul>\n\nType:Temp/ContractLocation:Duluth, GA"}