{"job title": "Data Architect", "company": "Primerica", "city state": "– Duluth, GA", "rating": "4.1", "job description": "Primerica currently has the following opening at our corporate office in Duluth, Georgia:\n<br><br>\nPrimerica is looking for a Lead Data Architect who will help lead the architecture and design of our big data and digital analytics platform. In this role you will interface with teams of engineers, project managers, other architects, and various department heads to define and deliver best-of-breed architectures in support of our digital initiatives. The platform will include big data capabilities, analytics, machine learning and powerful predictive logic to assist us in achieving specific business outcomes.\n<br><br>\nThe focus will be on architecture of our analytics infrastructure, services &amp; security capabilities to includes scalability of data lakes or hubs, and broker capabilities that allow a team of skills data scientists to produce predictive insights and models. This role will define the flow of data into these systems including ingestion capabilities throughout our enterprise.\n<br><br>\nThis role requires understanding of strategic system design, visionary leadership skills, solid technical knowledge and excellent communication skills. In the position, the ideal candidate will be the owner of the big data &amp; analytics technical domain for several key initiatives and be required to work with Scrum teams, engineering teams, as well as various levels of management.\n<br><br>\nThis role will also be viewed as a leader to educate Primerica's enterprise on key technology initiatives surrounding our solutions.\n<br><br>\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>10+ years related experience with big data and large scale implementations of analytics platforms</li>\n<li>Deep knowledge of HADOOP, Apache Spark and NoSQL</li>\n<li>Deep expertise of technical architectures surrounding big data and analytics</li>\n<li>Experience delivering secure and compliant solutions throughout an enterprise</li>\n<li>Experience with machine learning architectures and technologies</li>\n</ul>\n\n<strong>ABOUT PRIMERICA</strong>\n<br><br>\nPrimerica is a Main Street Company for Main Street North America. Our goal is to create more financially independent families. We are located in Duluth, GA. Primerica employees support our representatives to provide appropriate solutions through term life insurance, mutual funds, annuities and other financial products. We insured more than 5 million lives and have over 2 million client investment accounts. Our stock is traded on The New York Stock Exchange under the symbol \"PRI\".\n<br><br>\nFour years in a row Primerica has been recognized by the Atlanta Journal-Constitution as one of the best workplaces in Georgia! Over the past five years Primerica has consistently been voted Best Employer by Gwinnett Magazine in its special \"Best of Gwinnett\" winner editions.<br><br>SDL2017"}