{"job title": "Principal Scientist, Medicinal Chemistry", "company": "Rheos Medicines", "city state": "– Cambridge, MA, US", "rating": "5.0", "job description": "Company Overview:\n<br><br>\nAt Rheos, we are leading the way in the emerging field of immunometabolism to discover novel medicines to treat inflammatory-mediated diseases, including autoimmune diseases. Our medicines control metabolic pathways of immune cells that influence their activation state, in order to rebalance immune responses that cause inflammation or autoimmunity.\n<br><br>\nThe Role:\n<br><br>\nThe Principal Scientist, Medicinal Chemistry will be working with our internal and external drug discovery groups to design and execute integrated medicinal chemistry strategies in the pursuit of target validation, hit-to-lead, lead optimization and clinical candidate selection. The successful candidate will design and prioritize medicinal chemistry plans and manage external chemistry teams to deliver small molecule development candidates.\n<br><br>\nMajor Responsibilities:\n\n<ul>\n<li>Be accountable for the design and execution of medicinal chemistry strategies that integrate aspects the entire drug R&amp;D process – including hit finding strategy, lead optimization, ADME/PK, pharmacology and toxicology – to successfully deliver development candidates;</li>\n<li>Effectively manage external medicinal chemistry teams;</li>\n<li>Communicate medicinal chemistry strategies, ideas and results to colleagues and management;</li>\n<li>Work collaboratively across diverse drug discovery functions and multidisciplinary project teams;</li>\n<li>Strongly contribute to the identification and prioritization of critical path activities to facilitate decision making and drive project progression;</li>\n<li>Actively follow and integrate scientific advancements within the area of research interest;</li>\n<li>Contribute to development and execution of a publication strategy, i.e. patents, medicinal chemistry literature and scientific presentations.</li>\n</ul>\nRequirements and Qualifications:\n<br><br>\n<u>Education</u>\n\n<ul>\n<li>PhD degree in organic chemistry</li>\n</ul>\n<u>Required Experience</u>\n\n<ul>\n<li>8+ years of drug discovery experience in a pharmaceutical/biotechnology setting;</li>\n<li>Deep experience in implementing medicinal chemistry strategies across all stages of medicinal chemistry from hit identification, through to lead optimization;</li>\n<li>Prior experience acting as project or chemistry team lead with demonstrated success in delivering development candidates;</li>\n<li>Experience functioning within a strong multi-disciplinary, dynamic and highly matrixed environment and utilizing physicochemical, biochemical, ADME/PK, and pharmacological data to drive medicinal chemistry strategies;</li>\n<li>Experience in managing external chemistry teams to high levels of performance;</li>\n</ul>\n<u>Knowledge, Skills &amp; Abilities:</u>\n\n<ul>\n<li>Strong knowledge of the drug discovery process, with</li>\n<li>Demonstrated technical/problem solving skills and scientific creativity in synthetic and medicinal chemistry as evidenced by a significant publication records, filed patents and presentations;</li>\n<li>Team player with strong organizational, interpersonal, verbal and written communication skills.</li>\n</ul>"}