{"job title": "Scientist (MB)", "company": "Summit Partners, L.P", "city state": "– Hopkinton, Massachusetts", "rating": "4.2", "job description": "Description<br><br>LakePharma is a leading biologics company specializing in antibody and protein engineering, cell line development, and production of biomolecules. Our services can be fully integrated, creating a customized solution for all our customers molecular biology, cell line, and biomolecule needs.\n<br><br>\nWe are growing rapidly and are seeking talented individuals to join the LakePharma MicroBiomanufacturing Center in Hopkinton, MA. You will serve as a scientist for process development, production, and characterization of DNA and proteins. The successful candidate will be responsible to do the following:\n<li> Conceive, plan, and perform lab-scale development studies for DNA and protein production in cells and purification.</li>\n<li> Scale-up and implement processes for GMP production of DNA and proteins.</li>\n<li> Write standard operating procedures and manufacturing directions.</li>\n<li> Support Manufacturing through training of personnel, troubleshooting, and process monitoring and improvement using statistical process control.</li>\n<li> Write and maintain thorough records of lab work and observations.</li>\n<li> Operate and maintain analytical equipment which supports Manufacturing.</li>\n<li> Summarize data for clients and colleagues via written and oral reports;</li>\n<li> Represent LakePharma in scientific meetings;</li>\n<li> Review technical publications, articles and abstracts to stay current in the field</li>\n<li> Organize and prioritize work to meet timelines</li>\nThe position represents an excellent opportunity for career development, working closely with experienced scientists in a fast-paced and highly collaborative environment.<br><br>Requirements\n\n<li> BS in Biology, Biochemistry, Chemistry, Chemical Engineering, or a related field;</li>\n<li> At least one year of experience with biomolecule purification;</li>\n<li> Experience in cell culture or fermentation in flasks or culture bags;</li>\n<li> Experience with AKTA systems desired;</li>\n<li> Experience with GMP practices and regulations;</li>\n<li> Willing to work independently and in cross-functional teams, as needed;</li>\n<li> A drive to provide outstanding customer service, meeting or exceeding quality and timeline expectations;</li>\n<li> Must be able to clearly and accurately present data to colleagues and be comfortable with oral presentations.</li>\nThis position provides a unique opportunity for a person aspiring to join and contribute to a fast-paced team at a rapidly expanding company with cutting-edge technology platforms and ample opportunity to grow with the company.\n<br><br>\nIf you have the drive, passion, experience and are excited by this opportunity and ready to take your career to the next level then please Apply Today!"}