{"job title": "Sr. Scientist, Scientist Pharma Assays and Analytics", "company": "Summit Partners, L.P", "city state": "– Hopkinton, Massachusetts", "rating": "4.2", "job description": "Description<br><br>LakePharma is a leading biologics company specializing in antibody and protein engineering, cell line development, and protein production. Our services can be fully integrated, creating a customized solution for all our customers molecular biology, cell line, and protein needs. We just raised $30m in growth equity from Summit Partners &amp; Ampersand Capital Partners for expansion purposes.\n<br><br>\nWe are rapidly growing and seeking a talented individual to join our Pharma Assays &amp; Analytics department as a Senior Scientist / Scientist . The ideal candidate will have the ability to read and understand scientific literature, manage multiple projects and possess a positive can-do and enthusiastic attitude.\n<br><br>\n<strong> Job responsibilities will include the following:</strong>\n<li> Validate and Perform Cell-based and Enzyme-based assays and related procedures using manual and automated liquid handling equipment, including but not limited to:</li>\n- Enzyme Activity Analysis\n<br><br>\n- Cytotoxicity Determination\n<br><br>\n- Quantitative PCR Analysis\n<br><br>\n- Radiometric Binding Analysis\n<br><br>\n- High Content Cell Screening\n<br><br>\n- Flow Cytometry\n<li> Participate in management of client projects from quote writing to final deliverables</li>\n<li> Manage client-provided assay materials</li>\n<li> Provide timely project updates and data reports to Project Manager or Client</li>\n<li> Schedule work with internal resources to maximize efficiency and meet project timelines</li>\n<li> Manage materials ordering for client projects</li>\n<li> Provide oversight and mentorship of junior team members/contractors/interns</li>\n<li> Participate in management of consumable inventory, service and maintenance of equipment</li>\n<li> Assist with development of new service offerings and introduction of new equipment and/or techniques.</li>\n\n<strong>Requirements</strong>\n\n<li> MS/PhD in Biology/Biochemistry or related field with 5-7 years work experience</li>\n<li> Proven experimental design skills a prerequisite</li>\n<li> Plate-Based, manual liquid handling experience required, automation experience preferred</li>\n<li> Cell culture/handling experience required and familiarity with IPSC and primary cells/experimental design preferred.</li>\n<li> Competence in using Microsoft Excel/Statistics software for data analysis and competence in data analysis methodology</li>\n<li> Attention to detail and ability to solve problems/troubleshoot</li>\n<li> Ability to work in a fast-paced, matrix environment without compromising quality or timelines</li>\n<li> Can work independently and in a group setting</li>\n<li> Can multi-task and is organized</li>\n<li> Strong time management skills</li>\nThis position provides a unique opportunity for a person with aspiration to join and contribute to a fast-paced team at a rapidly expanding company with ample opportunity to grow. If you have the <strong> drive, passion, experience</strong> and are excited by this opportunity and ready to take your career to the next level then <strong> Apply Today!</strong>"}