{"job title": "Social Scientist", "company": "U.S. Department of the Interior", "city state": "– Anchorage, Alaska", "rating": "3.4", "job description": "<li> <p> </p><p> <b> Summary</b> </p> <p></p> <p> The Bureau of Ocean Energy Management (BOEM) manages the exploration and development of the nation's offshore resources. It seeks to appropriately balance economic development, energy independence, and environmental protection through oil and gas leases, renewable energy development and environmental reviews and studies. For information about our bureau go to: <br> <br> This vacancy may be used to fill additional positions as vacancies become available. </p> <p> </p><p> <b> Responsibilities</b> </p> <p></p> <p> This position is located within the Department of the Interior, Bureau of Ocean Energy Management, Alaska Outer Continental Shelf (OCS) Region, Environmental Sciences Management Section, in Anchorage, AK.</p> <p> Salary Information</p> <p> GS-11: $67,930-$88,312 per annum, GS-12: $81,421-$105,847 per annum, GS-13: $96,819-$125,865 per annum. First time hires to the Federal government normally start at the lower salary range of the grade level.</p> <p> This vacancy is also announced as BOEM-MMJJ-18-RD-087(MP) for those applicants who wish to apply and be considered under Merit Promotion procedures.</p> <p> At the full performance level GS-13 the major duties of this position include, but are not limited to the following:</p> <p> 1. Serves as a technical authority on social science studies (economics, sociology, anthropology, archaeology, and/or public administration) in the Alaska region office with an emphasis on issues pertaining to the economy, fisheries, subsistence, sociocultural systems, community health, historic and prehistoric resources, tourism and recreation, visual resources, land use and environmental justice.</p> <p> 2.Works with Federal, State, and local agencies, as well as elected officials from Tribes, Alaska Native Regional Corporations (ANCSA Corporations), and Alaska communities regarding the development and review of environmental studies.</p> <p> 3. Provides scientific advice and oversees coordination, planning, budgeting, and initiation of important scientific investigations (i.e. research, studies, and projects) which are categorized under the subjects of social science research.</p> <p> 4. Reviews and assists in the development of Statements of Work (SOW); requests for proposals (RFPs) developed from the SOWs; proposals submitted in response to RFPs; draft and final reports resulting from the technical work conducted for BOEM and other project deliverables.</p> <p> 5. Makes inspections of contracted research facilities and OCS development activities in the field to assess the effectiveness of the existing policies and/or techniques are deficient or inadequate and require additional study or revision.</p> <p> 6. Serves as the Regions Historic Preservation Officer and, as such, conducts National Historic Preservation Act Section 106 consultations and coordinates the Alaska Regions participation in BOEMs historic preservation program.</p> <p> 7. Reviews, comments, or provides information or support to the BOEM National ESP and Alaska Region Environmental Sciences Management Section (i.e. Studies Plans, SOWs, proposals, etc.), the Alaska Region Environmental Analysis Sections- (review of Environmental Impact Statements, Environmental Assessments, Cumulative Impacts etc.), and other BOEM offices and divisions, and the Directorate.</p> <p> 8. Participates in both the conceptualization and preparation of Environmental Impact Statements (EIS) and Environmental Assessments (EA) concerning archeological and cultural resources. Reviews technical quality of environmental analyses performed and reported by others.</p> <p> </p><p> <b> Travel Required</b> </p> <p></p> <p> Occasional travel - Occasional travel of 1-5 nights per month may be required.</p> </li> <li> Requirements <p> </p><p> <b> Requirements</b> </p> <p></p> <p> </p><p> <b> Conditions of Employment</b> </p> <p></p> You must be a U.S. Citizen. You will be subject to a background/suitability investigation/determination You will be required to have federal payments made by Direct Deposit. You must submit ALL required documents and a completed questionnaire. <p> Selective Service: If you are a male applicant born after December 31, 1959, you must certify that you have registered with the Selective Service system, or are exempt from having to do so under the Selective Service Law. See . </p> <p> </p><p> <b> Qualifications</b> </p> <p></p> <p> Minimum Qualification Requirements:</p> <p> To qualify for this position you must meet the (1) Basic Educational Requirements AND (2) Specialized Experience for the series/grade to which you are applying. <br> <br> (1) Basic Educational Requirements:<br> </p> <p> In addition to the specialized experience requirements for this position, applicants must meet the Education Requirements described below:<br> <br> A. Degree: behavioral or social science; or related disciplines appropriate to the position.</p> <p> -OR- </p> <p> B. Combination of education and experience that provided the applicant with knowledge of one or more of the behavioral or social sciences equivalent to a major in the field.</p> <p> -OR-</p> <p> C. Four years of appropriate experience that demonstrated that the applicant has acquired knowledge of one or more of the behavioral or social sciences equivalent to a major in the field.</p> <p> (2) Specialized Experience:<br> <br> GS-11<br> To qualify for the GS-11, you must possess at least one full year of specialized experience equivalent to the GS-09 level in the Federal service, or comparable experience not gained through Federal service. Specialized experience is experience that equipped the applicant with the particular knowledge, skills, and abilities to perform successfully the duties of the position, and that is typically in or related to the work of the position to be filled. Specialized experience is defined as demonstrated experience: 1) planning and executing social science studies; and 2) analyzing and evaluating scientific data in order to make recommendations for improvement in processes.</p> <p> -OR-</p> <p> Education: 3 years of progressively higher level graduate education leading to a Ph.D. degree or Ph.D. or equivalent doctoral degree</p> <p> -OR-</p> <p> Combination of education and experience: appropriate combination of education and experience that totals 100%. Note: Only graduate level education in excess of 36 semester hours may be applied toward the combination at this grade level.</p> <p> *Note: You may not substitute education for experience at the GS-12 and GS-13 levels.*</p> <p> GS-12</p> <p> To qualify for the GS-12, you must possess at least one full year of specialized experience equivalent to the GS-11 level in the Federal service, or comparable experience not gained through Federal service. Specialized experience is experience that equipped the applicant with the particular knowledge, skills, and abilities to perform successfully the duties of the position, and that is typically in or related to the work of the position to be filled. Specialized experience is defined as demonstrated experience: 1) planning and executing social science studies; 2) analyzing and evaluating scientific data in order to make recommendations for improvement in processes; and 3) drafting reports resulting from research conducted on marine resource management and/or ocean energy development.</p> <p> GS-13</p> <p> To qualify for the GS-13, you must possess at least one full year of specialized experience equivalent to the GS-12 level in the Federal service, or comparable experience not gained through Federal service. Specialized experience is experience that equipped the applicant with the particular knowledge, skills, and abilities to perform successfully the duties of the position, and that is typically in or related to the work of the position to be filled. Specialized experience is defined as demonstrated experience: 1) planning and executing social science studies; 2) analyzing and evaluating scientific data in order to make recommendations for improvement in processes; 3) drafting reports resulting from research conducted on marine resource management and/or ocean energy development; and 4) executing and leading major studies/projects to measure the impacts of conventional or renewable energy development and/or sand/gravel mining activities.</p> <p> Additional information on the qualification requirements is outlined in the OPM Qualification Standards Handbook of General Schedule Positions and is available at OPM's website: <br> <br> All qualification requirements must be met by the closing date of this announcement.</p> <p> </p><p> <b> Education</b> </p> <p></p> <p> Education: If this position requires specific educational course work to qualify, or you are qualifying based in whole or part on education, you are required to provide transcripts as proof of meeting the requirements. <br> <br> Foreign Education: Education completed in colleges or universities outside the United States may be used to meet the specific educational requirements as stated above. You must provide acceptable documentation that the foreign education is comparable to that received in an accredited educational institution in the United States. For more information on how foreign education is evaluated, visit: </p> <p> </p><p> <b> Additional information</b> </p> <p></p> <p> Applicants who include vulgar, offensive, or inappropriate language or information in their application package will be ineligible for further consideration for this position. <br> <br> Identification of promotion potential in this announcement does not constitute a commitment or an obligation on the part of management to promote the employee selected at some future date. Promotion will depend upon administrative approval and the continuing need for and performance of higher-level duties.<br> <br> The application contains information subject to the Privacy Act (P.L. 93-579, 5 USC 552a). The information is used to determine qualifications for employment, and is authorized under Title 5, USC, Section 3302 and 3361.<br> <br> Important Note: All Department of the Interior (DOI) employees are subject to the conflict of interest restrictions imposed upon all employees of the Executive Branch of the Federal Government and may be required to file a Financial Disclosure Report. In addition, DOI employees, GS-15 and above, who work in the Office of the Secretary; along with the Bureau of Ocean Energy Management (BOEM) and the Bureau of Safety and Environmental Enforcement (BSEE) employees (at ALL grade levels), are further restricted concerning their interests in Federal lands and resources administered or controlled by the Department of the Interior. This includes holding stock in energy corporations which lease Federal lands (e.g.: oil, gas, coal, alternative energy resources, etc.). If you have any such investments you should contact the DOI, BOEM or BSEE Ethics Office before accepting employment. DOI employees are held to the highest level of integrity. Employees must be objective and impartial in the performance of their work. All potential issues (e.g.: work-related interactions with friends, family members, or previous employers) must be disclosed at the time of application or during the interview process.<br> <br> NOTICE: This employer participates in E-Verify and will utilize your Form I-9 information to confirm you are authorized to work in the U.S.</p> <p> A preliminary background check must be completed before a new employee can begin work with the U.S. Department of the Interior. The preliminary background check consists of a search of Office of Personnel Management and Department of Defense background investigation files and an FBI National Criminal History Fingerprint Check; it may take up to 3 weeks to complete. If selected for this position, you will be extended a tentative offer of employment pending a satisfactory background check. Current Federal employees or individuals with an existing completed background investigation may not be required to undergo another background check; these will be handled on a case-by-case basis in coordination with the Bureau security office.</p> <p> </p><p> <b> How You Will Be Evaluated</b> </p> <p></p> <p> You will be evaluated for this job based on how well you meet the qualifications above.</p> <p> Once the application process is complete, we will review your application to ensure you meet the job requirements. To determine if you are qualified for this job, a review of your resume, supporting documentation and responses to the online questionnaire will be made. Your responses to the online assessment will be used to measure the degree to which your background matches the requirements for this position. You are being evaluated under the Category Rating method, which means, if you are determined to be qualified you will be placed in one of three pre-defined categories. These categories are Platinum, Gold, and Silver. However, your resume must support your responses to the scored occupational questionnaire, or your score may be lowered. Candidates placed in the Platinum category will be identified for referral to the hiring manager and may be invited for an interview. Veterans' preference rules for category rating will be applied.<br> <br> Your answers to the on-line assessment will be used to evaluate your competencies in the following areas:</p> Gather and Analyze Data- Skill in collecting, analyzing, interpreting and portraying technical data and information on key sociocultural factors and analyzing the potential impacts from the operation of conventional and renewable energy activities and other impact producing agents. Technical Knowledge- Knowledge of the principles, methods, or tools for developing, scheduling, coordinating social science research and consultations. Written Communication- Skill in scientific and technical writing to enable preparation and review of objective and appropriate scientific reports, documents, and correspondence. <p> If you are a status applicant (current career or career-conditional Federal employee or former permanent Federal employee with reinstatement eligibility in the competitive service), or are eligible under a special appointing authority and you are selected under this vacancy, you may be subject to serving a new one-year probationary period.</p> <br> To preview questions please . <p> </p><p> <b> Background checks and security clearance</b> </p> <p></p> <p> </p><p> <b> Drug test required</b> </p> <p></p> <p> No </p> </li>"}