{"job title": "Staff Scientist", "company": "Vanderbilt University Medical Center", "city state": "– Nashville, TN", "rating": "3.7", "job description": "<strong>Staff Scientist (biomedical Informatics)</strong>\n<br><br>\n<strong>Discover Vanderbilt University Medical Center:</strong><br><br>Located in Nashville, Tennessee, and operating at a global crossroads of teaching, discovery and patient care, VUMC is a community of individuals who come to work each day with the simple aim of changing the world. It is a place where your expertise will be valued, your knowledge expanded and your abilities challenged. It is a place where your diversity of culture, thinking, learning and leading is sought and celebrated. It is a place where employees know they are part of something that is bigger than themselves, take exceptional pride in their work and never settle for what was good enough yesterday. <strong>Vanderbilt's</strong> mission is to advance health and wellness through preeminent programs in patient care, education, and research.\n<br><br>\nClick Here To View The VUMC Promise of Discovery<br><br><strong> <strong>About the Department:</strong></strong>  <strong>The mission</strong> of the Vanderbilt Department of Biomedical informatics has complementary themes that include education, research, service, and a commitment to our colleagues in our own institution and around the world.\n<br>\n<strong>Educational Mission</strong> is to educate undergraduate, graduate, and postgraduate trainees in the theory and practice of biomedical informatics.\n<br>\n<strong>Research and Service Missions</strong> is to develop and evaluate innovative technologies for the storage, retrieval, dissemination, and application of biomedical knowledge, in order to support clinical practice, biomedical research, life-long learning, and administration and as a result, to contribute to the professional body of knowledge in the field of biomedical informatics.\n<br>\n<strong>Professional and Ethical Mission</strong> is to maintain cooperation and collegiality with all those who learn and work with us locally, nationally, and internationally; and, to develop and disseminate ethical and professional standards for the conduct of biomedical informatics research and for the use and evaluation of health care informatics applications. <strong>About the job:</strong>\n<br>\nJob Summary<br><br>Perform as an independent scientist: design and pursue computationally-focused biomedical research, assist with manuscript and grant writing, prepare and give scientific presentations, mentor and train other lab members, help shape the research directions and culture of the lab.\n<br><br>\nIt is expected that the research will be primarily focused on using computation (e.g., machine learning, bioinformatics, and mathematical modeling) to better understand the mammalian circadian system. The successful candidate will play a critical role in fulfilling the broad goals of the lab's recently funded NIH grant:\n<br><br>\n(1) develop new methods to measure the circadian system in single cells and in humans living in the real world\n<br><br>\n(2) use publicly available data to understand how the circadian clocks in each organ communicate with one another\n<br><br>\n(3) use data from electronic medical records to explore the link between the circadian system and human phenotypes.\n<br><br>\nThe lab has a rich set of collaborators, from experimental biologists to clinical researchers. Depending on the candidate's background and interest, there is the opportunity to help design wet-lab experiments or human studies and to analyze the resulting data.\n<br><br>\nThe Hughey Lab is part of the Department of Biomedical Informatics and the Vanderbilt Center for Precision Medicine.<br><br>Basic Qualifications<br><br>Strong candidates will have a PhD or equivalent in a quantitative / computational field and experience with biological or clinical data.\n<br><br>\nIndividuals with a PhD in the biological sciences and a strong quantitative background will also be considered.\n<br><br>\nPrevious experience in circadian rhythms is not necessary. More important than having any particular technical skills, the individual must be hard-working, creative, and eager to learn.<br><br>Key Functions and Expected Performances<br><br>1. Oversee research projects and perform near to totally independent research.\n<br><br>\na. Supervise, plan, design and implement research projects.\n<br><br>\nb. Establish highly complex protocol(s). Define data collection, evaluation, and analysis procedures.\n<br><br>\nc. Create plots, tables, and other visualizations of research findings.\n<br><br>\n2. Supervise scientific data collection and analyses for research project(s) requiring independent interpretation of complex research data.\n<br><br>\n3. Contribute to research so as to merit serving as author or co-author on research publications, etc.\n<br><br>\na. Assist principal investigator in writing research grants and contract proposals.\n<br><br>\nb. Assist PI in manuscript preparation for scientific journals.\n<br><br>\nc. Present research findings as needed.\n<br><br>\n4. Provide supervisory responsibility to staff.\n<br><br>\na. Mentor and provide feedback to graduate students and postdoctoral fellows on their projects and on specific techniques and protocols.\n<br><br>\nb. Train and supervise technical staff, medical, and graduate students.\n<br><br>\nc. Provide technical guidance to students, postdoctoral fellows, and faculty as required.\n<br><br>\n5. May provide budget responsibility.\n<br><br>\na. Make recommendations to principal investigator regarding staff, supply, and equipment needs for research projects.\n<br><br>\nb. May monitor expenditures of funds.\n<br><br>\n6. Maintain open communication between department and others.\n<br><br>\n<strong>Benefits:</strong><br><br>In addition to offering a lively community that encourages learning and celebrates diversity, Vanderbilt University Medical Center provides its faculty and staff members with a benefits package that is comprehensive and flexible. Components for benefits-eligible employees include:<br><br>PTO\n<br>\nHealth Plan\n<br>\nParental Leave\n<br>\nLife Insurance\n<br>\nRetirement\n<br>\nShort-Term Disability\n<br>\nLong-term Disability\n<br>\nAccidental Death &amp; Dismemberment (AD&amp;D)\n<br>\nDental Insurance\n<br>\nGroup Discounts\n<br>\nFlexible Spending Accounts (FSAs)\n<br>\nVision<br><br><strong>***Minimum Qualifications Required***</strong>\n<br><br>\nDoctorate/PhD (or equivalent experience) and 2 years experience\n<br><br>\n<strong>VUMC Recent Accomplishments:</strong>\n<br>\nBecause we are committed to providing the best in patient care, education and research, we are proud of our recent accomplishments:\n<ul>\n<li><strong>US News &amp; World Report:</strong> #1 Hospital in Tennessee, #1 Health Care Provider in Nashville, #1 Audiology (<strong>Bill Wilkerson Center</strong>), 9 adult and 9 pediatric clinical specialties ranked among the nation's best, #15 Education and Training</li><li><strong>Truven Health Analytics:</strong> among the top 100 hospitals in the US</li><li><strong>Becker's Hospital Review:</strong> one of the \\\"100 Greatest Hospitals in America\\\"</li><li><strong>The Leapfrog Group:</strong> grade \\\"A\\\" in Hospital Safety Score</li><li><strong>National Institutes of Health:</strong> among the top 10 grant awardees for medical research in the US</li><li><strong>American Association for the Advancement of Science:</strong> 12 faculty members elected fellows in 2014</li><li><strong>Magnet Recognition Program:</strong> Vanderbilt nurses are the only group honored in Middle Tennessee</li><li><strong>Nashville Business Journal:</strong> Middle Tennessee's healthiest employer</li><li><strong>American Hospital Association:</strong> among the 100 \\\"Most Wired\\\" medical systems in the US</li></ul>\n\n\n<ul>\n<li>CA</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\n<strong></strong><ul><strong>Physical Requirements/Strengths needed &amp; Physical Demands:</strong>\n<br><br>\n<strong>Movement</strong>\n\n<ul>\n<li>Occasional: Sitting: Remaining in seated position</li><li>Occasional: Standing: Remaining on one's feet without moving.</li><li>Occasional: Walking: Moving about on foot.</li><li>Occasional: Lifting under 35 lbs: Raising and lowering objects under 35 lbs from one level to another</li><li>Occasional: Push/Pull: Exerting force to move objects away from or toward.</li><li>Occasional: Bending/Stooping: Trunk bending downward and forward by bending spine at waist requiring full use of lower extremities and back muscles</li><li>Occasional: Reaching below shoulders: Extending arms in any direction below shoulders.</li><li>Occasional: Handling: Seizing, holding, grasping, turning or otherwise working with hand or hands.</li>\n</ul>\n\n<strong>Sensory</strong>\n\n<ul>\n<li>Occasional: Vision: Clarity of near vision at 20 inches or less and far vision at 20 feet or more with depth perception, peripheral vision, color vision.</li><li>Frequent: Noise: May include exposure to occupational noise levels which equal or exceed an 8-hr time-weighted average of 85 decibels, requiring enrollment in VUMC's Hearing Conservation Program which includes training, use of hearing protection, and periodic audiometry.</li><li>Continuous: Communication: Expressing or exchanging written/verbal/electronic information.</li>\n</ul>\n\n<strong>Environmental Conditions</strong>\n</ul>\n\nAssociated topics: biopharma, cytometry, drug development, histology, histotechnologist, immunoassay, injury, medical, pharmacology, vaccine"}