{"job title": "Scientist II", "company": "Varite", "city state": "– Austin, TX", "rating": "4.1", "job description": "Scientist IIReq I D\n<br><br>\n<strong>TMO-REQ-006882</strong>\n<br><br>\nRate\n<br><br>\nPrimary Skills\n<br><br>\nDescription\n<br><br>\nScientist II or III, Molecular Biology\n<br><br>\n<strong>Required responsibilities:</strong>\n\n\n<ul>\n<li>Will apply technical knowledge to develop kits/reagents/instruments for nucleic acid purification from various sample types, which include FFPE, blood, plasma, cells and tissues</li>\n<li>Will conduct experiments and/or evaluation of specific products</li>\n<li>Will contribute as a team member to meet pre-defined goals</li>\n<li>Modify experimental procedures to suit the particular needs of experiments</li>\n<li>Develop a hypothesis and then design the necessary set of experiments to test the hypothesis with limited guidance</li>\n<li>Analyze the data derived and explain the outcome of their experiments</li>\n<li>Has expertise with one or two specific scientific procedures and areas of research</li>\n<li>Has general textbook knowledge</li>\n<li>Maintain accurate and detailed lab notebooks and appropriate documentation based on the scientific method enabling other scientists to reproduce their experiments</li>\n<li>May assist in preparing material for manuals, articles for the newsletter, patents or scientific publications</li>\n<li>Prepares regular reports documenting experiments</li>\n<li>Presents research data and conclusions in 10-30 minute sessions</li>\n<li>Ability to read a scientific paper, reproduce the experiments described and understand the conclusions</li>\n<li>Able to exercise independent judgment within generally defined procedures, laboratory methods and techniques</li>\n<li>Able to recognize need for deviation from set procedures</li>\n</ul>\n\n<strong>Skills and attributes:</strong>\n\n\n<ul>\n<li>Strong laboratory and technical hands on skills required:</li>\n</ul>\n\no Pipet and perform procedures reproducibly\n<br><br>\no Perform a dilution series to create a standard curve\n<br><br>\no Perform lab calculations needed to make solutions from powder or from stock solutions and ability to make the buffers from recipes\n<br><br>\no Operate most basic lab equipment such as computers, centrifuges, UV light box and camera, quantitation instruments, Agilent Bioanalyzer, PCR and qPCR instruments, plate reader.\n<br><br>\no Routine experience with most common molecular procedures such as nucleic acid isolation, PCR, RT-PCR\n\n\n<ul>\n<li>Level of comfort with complex biological instrumentation such as microtomes and homogenizers</li>\n<li>Familiarity with next-generation technologies such as library prep, sequencing, digital PCR. Working experience a plus</li>\n<li>Experience with nucleic acid purification automation</li>\n<li>Experience working with BSL2 sample types</li>\n<li>Strong theoretical understanding of the procedures</li>\n<li>Basic knowledge of word processing, spreadsheet programs, powerpoint, e-mail and searching the internet.</li>\n<li>Creative and innovative</li>\n<li>Good writing&amp;presentation skills</li>\n<li>Strong documentation skills</li>\n<li>Strong organizational skills</li>\n<li>Works well in a team setting</li>\n<li>Strong multi-tasking skills</li>\n<li>Shows initiative by taking on new tasks, beyond what is generally expected</li>\n</ul>\n\n<strong>Requirements:</strong>\n<br><br>\nBachelors or Masters degree in Biological Science, chemistry, biochemistry, biomedical engineering or related field.\n<br><br>\nAt least 3 years laboratory experience in either academic or industry setting. Industrial experience in product development environment a plus.\n<br><br>\n<strong>Skill/Experience/Education:</strong>\n<br><br>\nMandatoryScientist II/III\n<br><br>\nDesiredContingent Hourly (CWHR)-TEM.CWHR.A00"}