{"job title": "Silviculture Scientist", "company": "Weyerhaeuser Company", "city state": "– Madison, GA", "rating": "3.3", "job description": "As a Silviculture Scientist, you will be a member of the SouthernTimberlands Technology (STT) Team that develops and implements new technologyfor growing Southern pine plantations. The STT Team is responsible for researchplanning, coordination of activities with area foresters, managing plotinstallation and measurement, data handling and analysis and developingoperating guidelines for the business.\n<br><br>\n<strong>In this role you will:</strong>\n\n\n<ul>\n<li>Design,lead, and implement research projects to improve plantation performancein a cost-effective way across Southern Timberlands and other timberlandsregions.</li>\n<li>Work with other scientists andproject leaders. Strong coordination is required with the entire Strategy andTechnology Team to ensure proper scientific rigor, experimental design,hypothesis testing, data analysis and documentation of all research projects.</li>\n<li>Utilize different sources ofinformation (internal and external) to understand and solve complex challengesin plantation management using ecophysiological principles, and be able to understandand manipulate variables that impact forest productivity across the differentlandscapes.</li>\n<li>Communicate and seek input from operations to alignresearch to business and operational needs.</li>\n<li>Have the capacity to work in collaboration with external scientists fromuniversities and government agencies while protecting Weyerhaeuser'sintellectual property.</li>\n<li>Transfer technological information in a practical manner to managers,early- and mid-rotation foresters, harvesting foresters, planners, and otherrelevant parties. This transfer ofinformation may be in the form of group presentations, field tours, and writtenreports.</li>\n<li>Assist in all aspects of theProduction Forestry Field Research Program as well as other related areas ofresearch (Environmental and Tree Improvement) as needed.</li>\n<li>In addition to formal research activities, stay abreast of current science to understandoperational practices, and recognize research needs and challenges as theyarise.</li>\n<li>Master's degree in forest management, silviculture, or a closelyrelated field; PhD in forest management, silviculture, or closely related field is strongly preferred</li>\n<li>At least 3 years of relevant experience.</li>\n<li>Knowledge of ecophysiological principles in pine plantation</li>\n<li>Strong math, analytical and financial analysis skills including but notlimited to interpreting research data, generating discounted cash flows tocompare alternative regimes, understanding forest inventory data andinterpreting growth and yield model outputs</li>\n<li>Basic understanding of a broad range of core competencies including:plantation nutrition, tree physiology, tree genetics, soils, growth and yield,vegetation management, and silvicultural systems</li>\n<li>Field forestry experience</li>\n<li>Ability to manage multiple projects with competing deadlines</li>\n<li>Excellent working knowledge of MS Office applications</li>\n<li>Excellent computer and GIS skills</li>\n<li>Knowledge of statistical software: SAS and R</li>\n<li>Excellent knowledge of experimental design and the importance of dataquality</li>\n<li>Excellent team working and communication skills</li>\n<li>The ability to work alone safely, often in remote areas and duringperiods of change, prepared to do field-intensive work.</li>\n<li>Proactive problem solving skills</li>\n<li>Ability to travel up to 40% of the time, sometimes 1-2 weeks at a time, often requiring irregular work hours</li>\n</ul>\n\nDesired Attributes\n\n\n<ul>\n<li>Familiarity with spatial and tabular data in GIS and databases</li>\n<li>Familiarity with remotely sensed data and how it correlates with standconditions</li>\n<li>Herbicide, pesticide and fertilizer application management</li>\n<li>Demonstrated ability to work safely in forestry or related operations</li>\n</ul>\n\nAboutTimberlands\n<br><br>\nWebelieve trees are a remarkable resource that can and should be managedresponsibly to make a range of products that meet human needs, while alsoproviding recreation, wildlife habitat, and other important ecosystembenefits.\n<br><br>\nFormore than a century, we've been taking care of forests to make life better.\n<br><br>\nAbout Weyerhaeuser\n<br><br>\nWesustainably manage forests and manufacture products that make the world abetter place. We're serious about safety, driven to achieve excellence, andproud of what we do. With multiple business lines in locations across NorthAmerica, we offer a range of exciting career opportunities for smart, talentedpeople who are passionate about making a difference.\n<br><br>\nWeknow you have a choice in your career. We want you to choose us.\n<br><br>\nWeyerhaeuser is an equalopportunity employer. We are committedto taking affirmative action to employ and advance in employment women,minorities, qualified individuals with disabilities and protected veterans.\n\n\n<ul>\n<li>M</li>\n</ul>"}