{"job title": "Data Scientist", "company": "Cerner", "city state": "– United States Kansas City, Missouri", "rating": "3.6", "job description": "Job Description<br><br>Cerner Intelligence is a new, innovative organization within Cerner focusing on creating contextual, intelligent experiences by leveraging the power of data to discover new evidence-based insights and workflow interventions that drive client value and help achieve the quadruple aim in healthcare. We seek the best and brightest talent to join the team – individuals who thrive on analytical problem solving and data-driven analysis who are smart, ambitious, and inquisitive.\n<br><br>\nAs a Data Scientist, you will discover and develop mathematical models to improve clinical, financial, or operational outcomes at an individual, facility, or population level using advanced mathematical, computational, and machine learning techniques. A few of the responsibilities include supporting feasibility studies, applying modern data storage techniques, discovering explanatory features in high-dimensionality collections of data, exploring data using scientifically valid techniques to applying a modern software or analytic development lifecycle methodology.<br><br>Qualifications\n<br>\n <strong>Basic Qualifications</strong>\n\n<ul>\n<li>Master’s Degree in Statistics, Computer Science, Analytics, Biostatistics, Applied Mathematics, Software Engineering, or equivalent relevant work experience.</li><li>At least 3 years of data mining, quantitative analysis, and/or statistical modeling including predictive performance and algorithm optimization work experience</li><li>Experience working with data mining algorithms including decision trees, probability networks, association rules, clustering, and neural networks</li><li>Experience programming in multiple languages (ideally Python and/or R)</li><li>Experience with MapReduce programming (Hadoop)</li><li>Experience with data warehousing and business intelligence systems, cluster and grid computing</li>\n</ul>\n\n<strong>Preferred Qualifications</strong>\n\n<ul>\n<li>Ph.D. in Statistics, Computer Science, Analytics, Biostatistics, Applied Mathematics, Software Engineering, or equivalent relevant work experience</li><li>At least 3 years of machine learning methods and the principals of visually encoding data work experience</li><li>Experience with relational databases and SQL; NoSQL databases (hBase, Cassandra, MongoDB, Couch DB, Riak) and unstructured data; Spark; Pig and Avro</li><li>Experience with agile software development methodologies</li>\n</ul>\n\n<strong>Expectations</strong>\n\n<ul>\n<li>Must be currently residing in or willing to relocate to the Kansas City metro area</li> <li>Willing to work additional or irregular hours as needed and allowed by local regulations</li><li>Work in accordance with corporate and organizational security policies and procedures, understand personal role in safeguarding corporate and client assets, and take appropriate action to prevent and report any compromises of security within scope of position</li>\n</ul>\nCerner is a place where people are encouraged to innovate with confidence and focus on what is important – people’s health and the care they receive. We are transforming health care by developing tools and technologies that make it more efficient for care providers and patients to navigate the complexity of our health. From single offices to entire countries, Cerner solutions are licensed at more than 25,000 facilities in over 35 countries.\n<br><br>\nCerner’s policy is to provide equal opportunity to all people without regard to race, color, religion, national origin, ancestry, marital status, veteran status, age, disability, pregnancy, genetic information, citizenship status, sex, sexual orientation, gender identity or any other legally protected category. Cerner is proud to be a drug-free workplace.\n<br><br>\nEEO is the Law (English)\n<br>\nE-Verify Participation (English)\n<br>\nRight to Work (English)\n<br><br>\nEEO is the Law (Spanish)\n<br>\nE-Verify Participation (Spanish)\n<br>\nRight to Work (Spanish)"}