{"job title": "Data Scientist", "company": "Microsoft", "city state": "– Cambridge, Massachusetts", "rating": "4.1", "job description": "The Automated Machine Learning team at Microsoft Research New England (located in Cambridge, MA) is looking for a Data Scientist to join us in developing industry leading machine learning solutions.\n<br><br>\nAs a team on the cutting-edge of technology, we work on developing new meta-machine learning models to automate the construction and tuning of machine learning solutions. Our goal is to build automated machine learning tools that can be used by experts and non-experts alike.\n<br><br>\nSuccessful data science candidates will have several years of acadmic and/or professional experience analyzing data and developing models across a breadth of technology platforms. Further, because our team collaborates closely with other internal teams, a great person for this role will be driven by the desire to solve problems for partners whether by leveraging sophisticated custom machine learning models or straightforward data analysis.\n<br><br>\nAbout MSR New England: our lab offers a thriving environment for cutting-edge, multidisciplinary research (both theoretical and applied), with access to a diverse array of big and small data sources, an open publication policy, and close links to top academic institutions around the world. Microsoft Research New England is comprised of thirty full-time researchers, engineers and postdocs working in machine learning, statistics, computational biology, theoretical computer science, algorithmic game theory, economics, social media, cryptography, and mathematics. The lab is collaborative and interdisciplinary and is actively engaged with the local academic and tech communities.<br><br>Responsibilities<br><br>As a data scientist in Auto-ML, you will join a cross-disciplinary team of engineers, data scientists and researchers. Some of your primary responsibilities will include:\n<ul>\n<li><div>the end-to-end execution of the data science process, from understanding business requirements, data discovery and extraction, model development and evaluation, to production pipeline implementation.</div> </li><li><div>assisting researchers in statistical debugging, core algorithm implementation and automated offline experimentation.</div> </li><li><div>applying data analysis, data mining and data engineering to present data clearly and develop experiments.</div> </li><li><div>enforcing strict quality control on the data, understanding how data is generated by experimental design and how these experiments can produce actionable, trustworthy conclusions.</div> </li>\n</ul>\n\nQualifications\n<br>\n<div><strong>Basic qualifications:</strong></div><ul><li><div>Bachelor degree or an advanced degree (Master, PhD) in Computer Science, Engineering, Mathematics, Statistics or related field.</div></li><li><div>1+ years of experience (academic and/or professional) using scientific packages in python (numpy, scipy, pandas, scikit-learn).</div></li><li> Experience writing production level python code</li><li> Experience working in a cross-functional team with software engineers</li>\n</ul>\nPreferred Qualifications:\n<ul>\n<li><div>Experience implementing and debugging deep neural networks.</div> </li><li><div>Experience with tensorflow, pytorch or the Microsoft cognitive toolkit (CNTK).</div> </li><li><div>Experience using Microsoft HPC, Spark or Hadoop.</div></li>\n</ul>\n\n<div>Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n<br><br>\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.</div>"}