{"job title": "Data Scientist", "company": "ADLIB", "city state": "– Bath", "rating": "4.8", "job description": "<ul>\n<li><strong>Opportunity to work with a lovely portfolio of clients.</strong></li><li><strong>Fantastic Company Culture and Working Environment.</strong></li><li><strong>Great Opportunities for Career Progression and Development.</strong></li>\n</ul>\n\nA renowned agency in the data science and analytics space is opening its doors for a Data Scientist to join their team on a permanent basis. This agency is able to boast an impressive client base, allowing you to get your teeth stuck into some nice sized projects! Your work will directly impact on the marketing campaigns of your clients, making this a really exciting opportunity. The majority of this role will be focused on the data, however you'll need to be comfortable and confident communicating with clients as you are going to be the go-to expert they want to learn from!\n<br><br>\n<strong>What you'll be doing</strong>\n<br><br>\nThe beauty of this role is that because you'll be working across a diverse portfolio of clients, your role will be highly varied. However, the core components include using R and Python to develop propensity and machine learning models, apply analyses using regression and clustering, as well as data visualisation and data extraction and querying using SQL. This is an all-encompassing role that will really enable you to develop your skills as a Data Scientist. Although they are open to your academic background, this client is particularly keen on candidates coming from a statistics, maths/applied maths pathway.\n<br><br>\n<strong>What experience you'll need to apply</strong>\n\n<ul>\n<li>Experience in either R or Python (or both!)</li><li>Strong SQL experience</li><li>Data visualisation experience (Power BI, Tableau or Data Studio)</li><li>Strong statistical analysis skills</li><li>Ability to work closely with clients</li>\n</ul>\n\n<strong>What you'll get in return for your experience</strong>\n<br><br>\nYou'll be rewarded with a competitive salary and benefits package, as well as some lovely offices, lovely colleagues, and lots of career development opportunities.\n<br><br>\n<strong>What's next?</strong>\n<br><br>\nGet in touch with Stacey for the finer details. Don't delay; this role will soon be snapped up!\n<br><br>"}