{"job title": "Data Scientist, Machine Learning Intern", "company": "Glassdoor", "city state": "– San Francisco, CA", "rating": "4.0", "job description": "Our mission is to help people everywhere find a job and company they love. We are disrupting an industry by changing how people search for jobs and how companies recruit top talent. In this specific role, you will be a member of the machine learning (ML) team, working towards solutions that help Glassdoor to grow.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nYou'll be part of a very fast-growing and rapidly innovating machine learning team within Glassdoor, building our next generation of products. You will participate into ML projects related to Jobs product, and be the owner of modeling and delivery of certain ML products to support the business. This includes a diverse range of needs covering areas from job/user classification/clustering to search ranking and personalization. A typical week would comprise brainstorming with your manager and the team, prototyping models and improving model features, and collaborating with engineers to deploy ML pipelines and products. All of these activities will be tightly coupled, and will facilitate helping people finding jobs and growing Glassdoor's revenue.\n<br><br>\n<strong>Requirements</strong>\n<br><br>\nThe ideal candidate will be extremely curious, and have a strong scientific background in machine learning, math, statistics, and be obsessed with results. You exercise very sound judgment and have the ability to balance sophistication with simplicity, scientific rigor with pragmatism, and agility with quality.\n\n<ul>\n<li>Deep understanding of machine learning and statistical methods with their underlying theory and math.</li>\n<li>Proficiency in Python. Familiarity with SQL. In addition, Java or other programming language experience would be valuable.</li>\n<li>Strong communication skills.</li>\n<li>BS, MS, or PhD in a quantitative discipline like Computer Science, Electrical &amp; Computer Engineering, Statistics, Math, Neuroscience, Operations Research, Physics, etc. (MS/PhD is preferred, but strong candidates with BS will also be considered.)</li>\n</ul>\n<strong>What you will gain?</strong>\n<br><br>\nThis position will help you to grow! In particular, you will have the following experiences.\n\n<ul>\n<li>Experience with modern ML algorithms and solid software development, including translating ML models into production software.</li>\n<li>Experience in working with large data-sets, from prototyping to business impact.</li>\n<li>Experience with distributed machine learning frameworks, like Spark, Hive, Presto, etc.</li>\n<li>Experience in extracting business value from predictive models and data products.</li>\n</ul>\n<strong>Why Glassdoor?</strong>\n\n<ul>\n<li>Work with purpose join us in creating transparency for job seekers everywhere</li>\n<li>Conveniently located office in the heart of downtown San Francisco (Embarcadero)</li>\n<li>Fully-stocked break rooms with complimentary food and drinks</li>\n<li>Your choice between Mac or PC</li>\n</ul>\nGlassdoor is committed to equal treatment and opportunity in all aspects of recruitment, selection, and employment without regard to gender, race, religion, national origin, ethnicity, disability, gender identity/expression, sexual orientation, veteran or military status, or any other category protected under the law. Glassdoor is an equal opportunity employer; committed to a community of inclusion, and an environment free from discrimination, harassment, and retaliation."}