{"job title": "Predictive Analytics - Senior Data Scientist", "company": "KAISER", "city state": "– Oakland, CA", "rating": "3.9", "job description": "The Predictive Analytics, Sr. DataScientistprovides support in making strategic data-related decisions by analyzing, manipulating, tracking, internally managing and reporting data. These positions function both as a consultant and as a high-level data analyst. The position works with clients to develop the right set of questions/hypotheses, using the appropriate tools/skills to derive the best information to address customer needs.\n<br><br>\n<strong>Preferred:</strong>\n\n<li> Statisticalmodeling(including use of panel data)and predictive modeling experience (including logistic regression, decisiontree, random forest, neural network, clustering analysis)\n\n</li><li> Extensive experience with Excel, SAS, R and/or SQL\n\n</li><li> Interest in statistical methods, root cause analysis\n\n</li><li> Degree in mathematics, statistics, economics, or related degree. Prefer Master's degree\n<br><br>\nEssential Functions\n\n</li><li> Lead several projects of moderate to complex nature w/ minimal. feedback / rework from manager/mentor of project.\n\n</li><li> Leads large project teams and/or high priority efforts to actionable, outcomes oriented results.\n\n</li><li> Proactively creates, teaches and checks work, which may include analysis, results, project outcomes, programming, etc. of less senior staff for reasonability and accuracy.\n\n</li><li> Contributes to dept infrastructure (e.g. training, recruiting, client relations)\n\n</li><li> Negotiates with others to achieve deliverables on time and within budget.\n\n</li><li> Identifies the right issues to be communicated, the appropriate audience, vehicle and time.\n\n</li><li> Defines and frames complex multidimensional issues and develops time tables/processes for decision making.\n\n</li><li> Translates needs, issues, and ideas into effective strategies and action plans.\n\n</li><li> Formulates specific implementation plans in partnership w/ constituent groups (internal and external, National and across Regions) and evaluates the effectiveness of actions/programs implemented.\n\n</li><li> Develops creative alternative solutions.\n\n</li><li> Recognizes opportunities by making a connection between seemingly unrelated information.\n<br><br>\n<strong>Basic Qualifications:</strong>\n<br>\nExperience\n\n</li><li> Minimumseven (7) years of work experience.\n<br>\n<strong>Education</strong>\n\n</li><li> Bachelor's degree OR four (4) years work experience in a directly related field.\n\n</li><li> High School Diploma or General Education Development (GED) required.\n<br>\nLicense, Certification, Registration\n\n</li><li> N/A.\n<br>\n<strong>Additional Requirements:</strong>\n\n</li><li> Thorough knowledge of policies, practices and systems.\n\n</li><li> Regularly contributes to the development of new concepts, techniques, and standards.\n\n</li><li> Considered functional expert in field within KP.\n\n</li><li> Frequently contributes to the development of new theories and methods.\n\n</li><li> Employs expertise as a generalist or specialist.\n\n</li><li> Must be able to work in a Labor/Management Partnership environment.\n<br><br>\n<strong>Preferred Qualifications:</strong>\n\n</li><li> Bachelor's degree and seven (7) years of work experience OR a master's degree and five (5) years of work experience preferred.\n\n</li><li> Knowledge of health care industry preferred.\n\n</li><li> Familiarity with Kaiser Permanente healthinsurance system preferred.\n<br></li>"}