{"job title": "Data Scientist", "company": "Kforce", "city state": "– Salt Lake City, UT", "rating": "3.7", "job description": "<strong>RESPONSIBILITIES:</strong><br><br>Kforce has a client that is seeking a Data Scientist in Salt Lake City, Utah (UT).\n<br><br>\nSummary:\n<br>\nThe advanced analytics team is looking to hire a motivated and talented data science engineer who will work on establishing and maintaining the big data processing platform.\n<br><br>\nReporting to the Principal Data Scientist, the Data Science Engineer will be responsible for:\n\n\n<ul>\n<li> Designing and implementing a robust production-grade data processing pipeline</li>\n\n<li> Optimizing the environment for production-ready machine learning models while ensuring scalability</li>\n\n<li> Developing tooling and infrastructure that support data scientists with model deployment in production systems</li>\n\n<li> Working closely with data scientists to help them solve engineering pain points by building scalable platforms</li>\n\n<li> Building the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources using SQL and AWS technologies</li>\n</ul>\n<strong>REQUIREMENTS:</strong>\n\n<ul>\n<li> 3 - 5 years of relevant professional experience in a similar role (no entry level candidates please)</li>\n\n<li> 2+ years of experience with AWS cloud services - EC2, EMR, Lambda, Redshift, S3, etc.</li>\n\n<li> Proven track record of developing and optimizing the environment for production-ready machine learning models while ensuring scalability</li>\n\n<li> Proven track record of developing, maintaining, and deploying data pipelines using Python and Spark</li>\n\n<li> Experience in automating data science models and data pipelines</li>\n\n<li> Experience using and troubleshooting Apache Spark</li>\n\n<li> Understanding of basic machine learning concepts</li>\n\n<li> Aptitude and motivation to learn new technologies</li>\n\n<li> Experience working in small-sized teams and wearing multiple hats at the same time</li>\n\n<li> Strong work ethics and attention to detail</li>\n</ul>\n\nPreferred Skills:\n\n\n<ul>\n<li> Regular contribution to open source code</li>\n\n<li> GitHub/GitLab profile</li>\n\n<li> Experience using Scala</li>\n</ul>\n\nKforce is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status."}