{"job title": "Product Manager - Data", "company": "McClatchy", "city state": "– Raleigh, NC, United States", "rating": "2.9", "job description": "<div><em>McClatchy, a national leader in digital media,</em> is growing rapidly in the digital space and delivering award-winning journalism in innovative ways. We are experiencing the most transformative period in our history.</div><div><strong><em>\n<br>\nCome Join McClatchy – a place where you have a voice and the ability to impact our future!</em>\n<br>\n</strong><br><br>McClatchy is looking for an experienced Product Manager to focus on our use of data to drive business decisions for our product lines. In this position, you will work with data scientists and development teams dedicated to positively impacting the customer experience by creating essential product features based on strategic insights and analysis. This position will help drive the vision, strategy and roadmap for McClatchy’s audience, subscription and marketing business lines and will be a liaison between executives, business stakeholders, and the development team.\n<br><br>\n<strong>Job Responsibilities:</strong>\n<ul>\n<li>Use research, data analysis, user experience analysis and testing, competitive research and other relevant tools to ensure informed decision making and prioritize opportunities</li><li>Effectively collaborate with cross-functional teams and stakeholders to develop and drive an overall strategic plan and roadmap for McClatchy’s data platforms and usage, defining and articulating new opportunities and goals, and aligning the strategy with other areas of the business</li><li>Clearly communicate the strategy and goals to development teams and ensure delivery against them</li><li>Lead projects through the definitional stages, working to ensure that we’re working to solve the right problem and have clearly articulated problem statements and goals identified. Own accountability for the ultimate execution of the project, working cross-functionally to ensure that the solution that is built delivers against the defined problem and goals</li><li>Assist with all aspects of the product lifecycle, including strategy, product requirements definition, design, competitive research, forecasting, launch plans, testing, and future enhancements</li><li>Working with stakeholders to define new products and features, quantify the benefits and prioritize these items</li><li>Create RFIs and drive vendor evaluation process</li><li>Monitor and analyze key performance metrics as well as identify and measure the impact of new features. Regularly track product performance and success metrics, and report them to stakeholders.</li><li>Establish self as subject-matter expert on your products, best practices, competition and the latest industry trends. Define actionable insights from this knowledge and use it to influence the product roadmap, as appropriate</li><li>Create and execute product communication plans</li>\n</ul>\n<strong>Qualifications:</strong>\n<ul>\n<li>Bachelor's degree, or comparable experience, required; Advanced degree a plus</li><li>At least 5 years experience in product management, or comparable experience, with demonstrated success working on data and analytics products or services</li><li>Familiarity and comfort in working with data, including the ability to use data to analyze and monitor product health, set goals and metrics, and aid in the prioritization of initiatives and features. Strong analytical skills, ability to use hard data and metrics to back up assumptions, recommendations, and drive action.</li><li>Strong technical or product expertise, including the ability to analyze business problems effectively and work cross-functionally to prioritize and ultimately drive appropriate and even game-changing solutions</li><li>Experience with A/B testing a plus</li><li>Experience working in an Agile environment and an understanding of how that impacts the role of Product Management</li><li>An effective understanding of technology and how to use it to deliver outstanding and innovative products</li><li>An ability to analyze quantitatively, problem-solve, think creatively and strategically, with a corresponding ability to execute strategies methodically</li><li>Ability to perform analysis then defend findings to drive business decisions</li><li>Track record of success in fast-paced organizations with matrixed reporting environments, using collaborative approaches to drive effective solutions when no direct reporting relationship exists</li><li>Demonstrated collaboration skills, working across a broad organization</li><li>Excellent verbal and written communication and presentation skills</li><li>Ability to weigh competing priorities, manage tradeoffs and evaluate opportunistic new ideas with stakeholders, driving to consensus while maintaining a clear focus on overarching business priorities</li><li>Some travel may be necessary - 0-20%</li> \n</ul>\n\n#LI-MK1</div>\n<br><strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}