{"job title": "Research Scientist", "company": "Pixar Animation Studios", "city state": "– Emeryville", "rating": "4.3", "job description": "The position of Research Scientist performs world-class research for the development of advanced computer graphics techniques for use in the production of Pixar’s films and across the The Walt Disney Company. Research Scientists collaborate with artists and technical users to create innovative solutions that expand creative reach and technical capability, while maintaining connections to the external research community through publication and leadership of academic and industrial research communities.<br><br><strong>SAMPLE OF RESPONSIBILITIES:</strong>\n<ul>\n<li>Identify important research problems relevant to Pixar and the broader Walt Disney Company</li><li>Lead research projects to determine solutions to the above problems</li><li>Work directly with artists and technical directors to solve practical, real world problems</li><li>Publish results in peer-reviewed conferences and journals</li><li>Maintain connections to the external research community</li><li>Keep apprised of recent research and developments, as well as current technology that may be beneficial, and provide recommendations on the adoption of such technology</li>\n</ul>\n<strong>QUALIFICATIONS:</strong>\n<ul>\n<li>PhD in Computer Science, Mathematics, Data Science or equivalent</li><li>Communication skills and the ability to work well with a wide range of personality types</li><li>Ability to demonstrate creativity and collaboration</li><li>Sustained track record of innovation and significant original research including publications in top conferences and journals</li><li>Ability to work well both independently and in a group, and be able to handle a variety of tasks in an efficient manner</li><li>Appreciation of the benefits derived from diverse POVs, voices and demographics</li>\n</ul>\nFor more information about Research at Pixar, visit https://graphics.pixar.com/research/\n<br><br>\nPixar is an Equal Opportunity Employer. | Follow us on Twitter @PixarRecruiting."}