{"job title": "Data Scientist", "company": "Rakuten", "city state": "– Salt Lake City", "rating": "2.5", "job description": "<div><div><div><div><div><p>Rakuten Marketing is specialized in performance Marketing. Most of the e-commerce big players are using the Rakuten technology to power their online advertising campaigns, especially the user re-engagement (Retargeting) and customer acquisition (Prospecting). The company aggregates a lot of behavioral data from various sources. Given the massive volume of that needs to be processed and the various formats, traditional data processing methods are limited. This complexity calls for new technologies that enable to effectively analyze large sets of data and determine the statistical models that could predict the performance of online marketing campaigns.</p><p><b><br></b></p><p><b>The development of such technology allows studying several fields:</b></p><p>•\tModeling and simulation</p><p>•\tBehavioral analysis and performance prediction</p><p>•\tData Management</p><p>•\tData Analytics</p><p><br></p><p><b>Responsibilities and Capabilities:</b></p><p>•\tCoordinate the communication between the data science team and the development teams.</p><p>•\tAnalyze data and study the system to provide meaningful insights on the product performance and the ways to improve it.</p><p>•\tBuild predictive models to improve the advertising campaigns performances.</p><p>•\tCross-collaborate with engineers on building statistical models, applying machine learning techniques for targeted solutions and effectively communicating the analysis and findings through interactive visualizations, documents and presentations.</p><p>•\tCross-collaborate with the account management and sales teams to conduct dedicated studies for some of our big customers or demonstrate in client meetings the benefit of Rakuten technology.</p><p><br></p><p><b>Some of the capabilities should include:</b></p><p>•\tStrong interpersonal, oral and written communication and presentation skills, ability to communicate complex findings in a simple manner.</p><p>•\tAbility to communicate with Developers or Data-Analysts to describe complex algorithms in a simple manner.</p><p>•\tEnjoy discovering and solving problems; proactively seeking clarification of requirements and direction; being a self-starter who takes responsibility when required.</p><p>•\tAbility to explore different directions based on data and be able to quickly change direction based on the analysis.</p><p><br></p><p><b>Minimum requirements:</b></p><p>•\t2+ years of work experience in a Data-Science team.</p><p>•\tProven ability and experience in using data science, statistical computing, and modeling to improve business KPIs.</p><p>•\tExperience with statistical, predictive modeling, machine learning with big-data using tools like R, Hadoop, Spark</p><p>•\tStrong mathematical skills.</p><p>•\tSolid communication skills</p><p>Preferred Qualifications:</p><p>•\tMS/ PhD in fields like computer science, mathematics, statistics, machine learning, operations research, data mining, AI.</p><p>•\tUnderstanding of public cloud design patterns and considerations in the areas of distributed systems, distributed storage systems, big-data, data mining, cluster computing.</p><p>•\tBasic understanding of the distributed concepts behind Hadoop and Spark Data-Analysis frameworks.</p><p>•\tStrong ability to learn new concepts quickly.</p><p><br></p><p><b>RM uses the following tech:</b></p><p>•\tPostgreSQL, Hadoop, Cassandra, Aerospike, Redis, LevelDB</p><p>•\tGolang; Java; JavaScript; Python; C; C#</p><p>•\tAWS; Google Cloud; OpenStack</p><p>•\tNSQ, Kafka, Flume, GCP Pub/Sub</p><p>•\tConsistently trying out new possibilities</p><p><br></p>\n \n \n\n \n \n\n \n\n \n </div>\n </div>\n </div>\n\n \n </div>\n\t</div>"}