{"job title": "Data Scientist", "company": "Vevo", "city state": "– San Francisco, CA", "rating": "3.2", "job description": "<div>Vevo is the worlds leading all-premium music video and entertainment platform with over 25 billion monthly views globally. Vevo delivers an expertly curated experience for audiences to explore and discover music videos, exclusive original programming and live performances from the artists they love.</div><br>\n<div>Take a look inside Vevo</div><br>\n<div>The Data Science team at Vevo is part of the Product &amp; Growth group, alongside the Product, Biz Ops &amp; Strategy and Research/Insights teams.</div><div>The Data Science teams mission is to harness the power of Vevos data to provide better experiences for Vevos end users, advertisers, artist &amp; label partners, along with deep insights for internal business groups.</div> <div>This team is also the champion of experimentation and the scientific method, helping to bring data science methodologies to an ever-growing number of business domains.</div><br>\n<div>This is a full-time position and is based at our office in San Francisco. We are in a convenient location right next to a Muni &amp; Bart station entrance on Market Street.</div>As a member of our team, you will\n\n<ul>\n<li>Work as an embedded team member of one or more product squads focused on tackling some of Vevos most important challenges</li><li>Be given a huge potential to innovate in a green-field space: music video offers a unique opportunity for experimentation at scale, building on learnings gleaned from both the music and video verticals</li><li>Have a big impact on decisions across all areas of Vevos business, including content development, marketing &amp; promotion, advertising and monetization</li><li>Become a trusted advisor to our senior leadership team, and help grow Vevos industry profile through targeted public speaking opportunities</li>\n</ul>\n\nThis describes you\n\n<ul>\n<li>You have a successful track record deploying data science frameworks and approaches in green field environments, working with a range of stakeholders</li><li>Proven experience in utilizing various ML packages in Python such as Scikit Learn, TensorFlow, numpy and pandas</li><li>Youre not shy about handling your data needs and have a solid grasp of SQL and distributed data ETL processes (preferably in Scala / Spark) such as Mapreduce, filters, aggregations and joins.</li><li>You have a solid grasp of statistics and how it enables data scientists to solve business problems</li><li>You thrive on working in an agile team environment</li> <li>You enjoy music and internet video, and possess a deep curiosity for creating music entertainment experiences as well as harnessing the power of data to unlock growth opportunities on global distribution platforms such as YouTube</li><li>Passionate about making a business impact</li>\n</ul>\n\n<strong>Requirements</strong>\n\n<ul>\n<li>PhD and/or other advanced academic study in relevant data-centric field</li><li>3+ years of applied data science experience within fast-paced corporate or start-up environment</li><li>Excellent written and verbal communication skills, with a successful track record of collaboration and influence within a fast-paced environment</li><li>Passion for data science advocacy and education</li>\n</ul>\n\nInterested? Great! You might like to know\n\n<ul>\n<li>We are a fun energetic tight knit team with a passion for music and technology</li><li>In office/external happy hours</li><li>Remain up to date with new technology including hosting/attending meetups</li><li>Excellent benefits package</li><li>Competitive compensation packages</li><li>Premier access to music content and new releases of original media content</li><li>Concert ticket giveaways</li><li>401k Match</li><li>Fully stocked kitchen and bar with catered lunches everyday</li>\n</ul>\n\n<div>Vevo considers applicants for all positions without regard to race, color, creed, religion, national origin or ancestry, sex, age, disability, genetic information, veteran status, or any other legally protected status under local, state, or federal law.</div>"}