{"job title": "Engineer-RF - II", "company": "Axelon, Inc.", "city state": "– Folsom, California", "rating": "3.5", "job description": "<ul>\n<li>RF Design Engineer is responsible for contributing in the RF Design of the regional cellular network with emphasis on modifying existing sites and antenna/RF path theory.</li>\n<li>Responsibilities include: working with the performance team to understand the area and any issues within the cluster, researching previous projects and in-flight projects, creating short-term and long-term designs to meet sites design criteria, creating new projects within their geographic area of responsibility. Other responsibilities include: analyzing network metrics, analyzing drive tests to evaluate search area candidate as necessary, preparing FCC/FAA submissions in a timely manner, performing design evaluations for planning, and evaluating coverage/capacity issues.</li>\n<li>BS in Engineering or Computer Science or equivalent work experience required. 3 plus years of experience in the cellular or telecommunications industry as an RF Design Engineer required.</li>\n<li>Must be experienced in RF propagation tools (Atoll) and data analysis. Experience in analyzing network performance/metrics and selecting antenna/radio solutions for capacity and/or coverage requirements. Experience in pulling data from multiple sources into one format (excel or database), analyzing and processing the data, and generating evaluation/solution reports. The selected candidate will need to work well in small groups and independently and will need to be able to take the lead on certain projects. Must be well organized, communicate well, and be able to handle multiple tasks/projects. Ericsson LTE network experience is a plus.</li>\n<li>Must have a good understanding of engineering concepts, and must show aptitude and desire to learn and advance in a technical field. Proficient in office computer applications: Excel, Word, PowerPoint, Access, and Outlook.</li>\n</ul>\n\nShift is M-F, 8-5, WC office."}