{"job title": "Jr. Data Integration Engineer", "company": "Fitbit", "city state": "– San Francisco, CA", "rating": "3.3", "job description": "At Fitbit, our mission is to help people lead healthier, more active lives by empowering them with data, inspiration and guidance to reach their goals.\n<br><br>\nWe started our journey in 2007as a team of two with one big idea. Since then, we've grown to over 1,500 employees, sold over 60mm devices, and built a health and fitness community across the globe. In fact, the Fitbit Community has taken enough steps to walk from the Sun to Pluto! Offering award-winning products, a top-rated mobile app and an easy-to-use online dashboard, Fitbit provides personalized experiences that help our users reach their goals. With a reenergized focus on innovative devices, interactive experiences, and enterprise health we are transforming the way consumers and businesses see health &amp; fitness.\n<br><br>\nFrom your first steps as a Fitbitter, you will be at the forefront of developing new products. Our culture combines the spirit of startup with the perks of being public. We offer a competitive benefits package and amazing perks like unlimited snacks, Friday happy hours, onsite workout classes, and a strong focus on a healthy work-life balance. As part of our team, you'll have the opportunity to grow your career, contribute your ideas to life-changing products and services, andabove allhave fun doing it.\n<br><br>\nFitbit's HQ campus is located in the heart of San Francisco with office locations in Boston, San Diego and around the world. Think you've found your fit?\n<br><br>\nFitbit is seeking an eCommerce Analytics Manager who will lead web analytics, Fitbit.com sales forecasting, eCommerce sales analyses, as well as oversee web and email testing efforts. This individual will be responsible for leading a team of direct reports to produce insightful and actionable recommendations to optimize Fitbit.com. This position based in San Francisco, CA which is Fitbit's headquarters and will report to the Director of Marketing Analytics &amp; Operations.\n<br><br>\n<strong>Key Responsibilities:</strong>\n<br><br>\nThe Jr. Data Integration Engineer will partner with the Sr. Data Integration Engineer in the development of solutions to integrate both internal and external 3rd party partner data into Fitbit's data ecosystem. This includes data exploration, data mapping, and data integration to support Marketing department projects. The role will work cross-functionally with multiple internal and external teams. This position based in San Francisco, CA which is Fitbit's headquarters and will jointly report to the Sr. Data Integration Engineer and the Director of Marketing Analytics &amp; Operations.\n<br><br>\n<strong>Data Exploration</strong>\n\n<ul>\n<li>Define, analyze, and validate data objects</li>\n<li>Explore multiple data models and relationships among data elements</li>\n<li>Design the internal data model and data warehouse schema to support business objectives</li>\n<li>Continually seek data elements and logic to support future Marketing campaigns</li>\n</ul>\n<strong>Solution Development</strong>\n\n<ul>\n<li>Evalute tools for data integration, transformation, and transfer</li>\n<li>Develop multiple viable solutions to discuss with the business stakeholders that considers timing, performance expectations, scalability, interdependencies (both internal and external) and business value</li>\n<li>Assess scope and determine sizing for slotting into the project roadmap</li>\n<li>Draft test plans and scenarios, which will involve validation of data design, tool design, data extract/transform, networks, and hardware</li>\n<li>Engage in technical solution discussion with other Engineering teams, including partner Engineering teams to obtain necessary details for creating data feeds</li>\n</ul>\n<strong>Data Integration</strong>\n\n<ul>\n<li>Implement solution across legacy systems, new legacy systems</li>\n<li>Develop data interfaces as needed to launch the solution</li>\n<li>Write stored procedures to extract, transform, and load data into internal data environments</li>\n<li>Document project details for future use, which may include edits for additional data elements or changes due to upstream or downstream systems</li>\n<li>Escalate any data issues to the Sr. Data Integration Engineer and other Engineering teams (internal, external) as well as business stakeholders</li>\n</ul>\n<strong> Requirements:</strong>\n\n<ul>\n<li>Development of scalable and resilient data pipelines to support Marketing initiatives primarily in the cloud</li>\n<li>Development of new and Enhancement of existing pipelines connecting to 3rd party platforms like Salesforce</li>\n<li>Experience working on Cloud environments (AWS, Google)</li>\n<li>Development experience with Spark/Scala, Hive, Python and the data lake environments</li>\n<li>ETL best practices</li>\n<li>Database concepts and connectivity (Relational and NoSQL), including a working knowledge of SQL</li>\n<li>Linux environments</li>\n<li>Take personal responsibility for driving initiatives forward</li>\n<li>Work effectively with stakeholders</li>\n<li>Display top notch written and verbal communication skills</li>\n<li>At least 2 years of Data Engineering experience</li>\n<li>Strong proficiency with MS Office</li>\n<li>BA/BS degree</li>\n</ul>\n<em>Fitbit is proud to be an equal opportunity employer. We recruit, hire, train, promote, pay, and administer all personnel actions without regard to race, color, ancestry, national origin, citizenship, religion, age, sex (including pregnancy, childbirth, and medical conditions related to pregnancy, childbirth, or breastfeeding), sex stereotyping (including assumptions about a person's appearance or behavior, gender roles, gender expression, or gender identity), sexual orientation, gender, gender identity, gender expression, marital status, medical condition, mental or physical disability, military or veteran status, genetic information or other statuses protected by law. We interpret these protected statuses broadly to include both the actual status and any perceptions and assumptions made regarding these statuses.</em>\n<br><br>\n<em>San Francisco applicants: Pursuant to the San Francisco Fair Chance Ordinance Fitbit will consider for employment qualified applicants with arrest and conviction records.</em>"}