{"job title": "Chemical Manufacturing Engineer", "company": "General Dynamics Mission Systems", "city state": "– USA--CA-Torrance", "rating": "3.6", "job description": "<div><div>\n<div>\n<p>Bachelor's degree in Chemical Engineering or Industrial Engineering; or the equivalent experience is required plus a minimum of 5 years of relevant experience; or Master's degree plus a minimum of 3 years of relevant experience</p>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\nResponsibilities for this Position\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<p>General Dynamics Mission Systems has an immediate opening for a Chemical Manufacturing Engineer with a manufacturing background in chemical plating and electro-forming processes. The position provides an opportunity to enhance the performance and profitability of an organization that supports some of our nation’s fundamental defense services. General Dynamics Mission Systems employees work closely with esteemed customers to develop solutions that allow them to carry out high-stakes national security missions.</p><p> </p><p><strong>REPRESENTATIVE DUTIES AND TASKS:</strong></p><div><ul><li>Primary focus in the electro-forming and chemical plating processes which require knowledge, understanding and passion for chemical solutions, processes and process control</li><li>Leads research, development and implementation of Chemical processes required to produce a variety of products</li><li>Leads research of organic or inorganic substances</li><li>Studies the relationship between chemical and physical properties</li><li>Guides the designing of new chemical production processes, testing production techniques and materials, and using computer models to evaluate efficiency of production processes</li><li>Oversees production facilities, conducting technical audits and inspections, supporting quality assurance and coordinating the management and disposal of chemical waste</li><li>Works on problems of diverse scope where analysis of data requires evaluation of identifiable factors</li><li>Demonstrates good judgment in selecting methods and techniques for obtaining solutions</li><li>Networks with senior internal and external personnel in own area of expertise</li><li>Normally receives little instructions on routine work, general instructions on new projects or assignments</li><li>May provide direction to other employees</li><li>Delegates work to less experienced employees and provides mentoring in key areas</li></ul><p> </p></div><p><strong>KNOWLEDGE SKILLS AND ABILITIES:</strong></p><ul><li>Fully proficient leadership skills</li><li>Fully proficient interpersonal skills</li><li>Fully proficient communication skills, both verbal and written</li><li>Fully proficient problem solving skills</li><li>Fully proficient presentation skills</li><li>Time management skills</li><li>Ability to participate on cross-functional teams</li><li>Ability to clearly recognize and report information relevant to sound manufacturing engineering design</li><li>Fully proficient computer skills</li></ul><p><br><br><strong>CLEARANCE REQUIREMENTS:</strong></p><p> </p><p>Applicants selected will be subject to a U.S. Government security investigation and must meet eligibility requirements for access to classified information. Due to the nature of work performed within our facilities, U.S. citizenship is required.<br><br></p>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\nCompany Overview\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<p>General Dynamics Mission Systems (GDMS) engineers a diverse portfolio of high technology solutions, products and services that enable customers to successfully execute missions across all domains of operation. With a global team of 13,000+ top professionals, we partner with the best in industry to expand the bounds of innovation in the defense and scientific arenas. Given the nature of our work and who we are, we value trust, honesty, alignment and transparency. We offer highly competitive benefits and pride ourselves in being a great place to work with a shared sense of purpose. You will also enjoy a flexible work environment where contributions are recognized and rewarded. If who we are and what we do resonates with you, we invite you to join our high performance team!</p><p> </p><p>General Dynamics is an Equal Opportunity/Affirmative Action Employer that is committed to hiring a diverse and talented workforce. EOE/Disability/Veteran</p>\n\n</div>\n</div>\n</div><b><br></b>"}