{"job title": "Senior Software Engineer (DevOps)", "company": "Next Century", "city state": "– Annapolis Junction, MD", "rating": "4.8", "job description": "<strong>What We Need</strong>\n<br><br>\nNext Century Corporation is looking for a seasoned Senior Software Engineer to join a stellar team in Annapolis Junction, MD. This role will be focused on DevOps tasking and responsibilities for a mission critical project for the intelligence community.\n<br><br>\n<strong>Duties and Responsibilities</strong>\n\n<ul>\n<li>Work collaboratively with software engineering to deploy and sustain our products/systems.</li>\n\n<li>Help automate and streamline our operations and processes.</li>\n\n<li>Build and maintain tools for deployment, monitoring, operations and sustainment.</li>\n\n<li>Troubleshoot and resolve issues in our development, test and production environments.</li>\n\n<li>Manage IAVA updates for systems.</li>\n\n<li>Manage user accounts on systems (often through Ansible scripts)</li>\n\n<li>Update Ansible to deploy new software to meet new security requirements (for instance virus scanning software).</li>\n\n<li>Plan and accomplish goals and complicated tasks and provide consultation on complex projects as top-level contributor or specialist.</li>\n\n<li>Manage Virtual Machines through Infrastructure/Platform as a Service resource.</li>\n\n<li>Communicate directions and provide guidance to junior programmer/analysts, as required.</li>\n</ul>\n<strong>If you meet the following requirements, we encourage you to apply:</strong>\n\n<ul>\n<li>Active TS/SCI clearance with polygraph.</li>\n\n<li>At least ten (10) years in software development/engineering, including requirements analysis, software development, installation, integration, evaluation, enhancement, maintenance, testing, and problem diagnosis/resolution.</li>\n\n<li>At least six (6) years developing software using the Java programming language.</li>\n\n<li>At least four (4) years demonstrated experience developing software for Windows (2000, 2003, XP, Vista), UNIX and Linux (Redhat versions 3-5) operating systems.</li>\n\n<li>At least six (6) years in programming and development of application software for complex systems and software testing.</li>\n\n<li>Experience architecting, designing, developing, testing, and supporting integration of software systems with functional requirements within a CMMI Level 2 process structure.</li>\n\n<li>Experience \"wrapping\" legacy systems or components as Web Services within a SOA framework.</li>\n\n<li>Experience developing solutions integrating and extending COTS products.</li>\n\n<li>Experience developing framework infrastructures and services within one of the SOA design patterns.</li>\n\n<li>Experience with performance tuning and optimization of service-based Framework infrastructure and services.</li>\n\n<li>Experience developing custom adapters allowing the integration of legacy (i.e., capabilities not developed as services) capabilities with service-based Framework infrastructure and services.</li>\n\n<li>Experience in development within the Eclipse Integrated Development Environment (IDE).</li>\n\n<li>Experience architecting, designing, developing, testing, and supporting integration of Hadoop and Map Reduce frameworks.</li>\n\n<li>Experience architecting, designing, developing, testing, and supporting integration of software as a component of SIGINT solutions.</li>\n</ul>\n<strong>Highly Desired Skills:</strong>\n\n<ul>\n<li>Familiarity with the software development process described in the MIL-STD498, J-STD-016, and/or US 12207 and possess at least two (2) years of experience developing software in accordance with these standards.</li>\n\n<li>Flexibility to be called in after hours to help restart applications/systems or to troubleshoot.</li>\n\n<li>Broad understanding of technologies and tools in the following areas:\n\n\n<ul>\n<li>Source Control (like Git, Bitbucket, etc)</li>\n\n<li>Continuous Integration (like Jenkins) ¿ Infrastructure Automation (like Ansible)</li>\n\n<li>Deployment Automation &amp; Orchestration (like Jenkins, VSTS)</li>\n\n<li>Container Concepts (like LXD, Docker)</li>\n\n<li>Orchestration (like Kubernetes)</li>\n</ul>\n\n</li>\n</ul>\n<strong>About Next Century</strong>\n<br><br>\nWe were founded as a direct result of the 9/11 attacks and provide solutions that integrate situational awareness, at a glance analysis, decision support, collaboration, and other core capabilities utilizing our expertise in data visualization, user interface design, GIS, image exploitation, and mobile computing.\n<br><br>\n<strong>Who We Are Seeking</strong>\n<br><br>\nAt Next Century, we are committed to growing our team of high performers to accomplish our mission of saving lives and protecting our country. We are not a body shop; we avoid staff augmentation, and we are totally committed to excellence in all that we do. Joining our team is not just a position, but a journey with a team of world class software engineers who share a passion for using their skills and experience to make a difference.\n<br><br>\n<strong>What We Offer</strong>\n\n<ul>\n<li>Company paid benefits</li>\n\n<li>Board game nights, happy hours, parties, and other fun activities</li>\n\n<li>Work/life balance</li>\n\n<li>Comprehensive program for self-development in your field</li>\n\n<li>Challenging work &amp; life-saving software opportunities</li>\n</ul>\nIn compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification form upon hire."}