{"job title": "Mid-Level Software Engineer", "company": "Next Century", "city state": "– Annapolis Junction, MD", "rating": "4.8", "job description": "Next Century Corporation, a growing technology services company with offices in Annapolis Junction, MD and in Falls Church, VA. We are seeking mid-level Software Engineers to join our team. We’re searching for those rare individuals who share our passion for using their skills to make a difference in this world with an unwavering commitment to high performance, integrity, and customer satisfaction.\n<br><br>\n<strong>Who we are seeking?</strong>\n<br><br>\nWe expect individuals to be team-orientated, self-motivated, high performers who have the aptitude and desire to learn and contribute. Our primary focus is to develop life-saving, mission-critical application solutions that integrate situational awareness, at-a-glance analysis, decision support, collaboration, and other core capabilities utilizing our expertise in data visualization, user interface design, GIS, image exploitation, and mobile computing.\n<br><br>\nYou will work closely with senior engineers and architects, to design and implement new features and new core capabilities. Must have a passion for Java programming, a very strong understanding of its core concepts and ability to write quality code and meet deadlines. You will be participating in all phases of the development life-cycle.\n<br><br>\n<strong>Requirements:</strong>\n\n<ul>\n<li>Proficiency with Java or JavaScript coding and debugging skills.</li>\n\n<li>Good programming practices with solid object-oriented development experience.</li>\n\n<li>Strong analytical and problem-solving skills.</li>\n\n<li>Able to demonstrate initiative.</li>\n\n<li>Superior time management skills.</li>\n\n<li>Detail-oriented, results-oriented, and action-oriented.</li>\n\n<li>Able to set priorities and undertake complex tasks with minimal supervision.</li>\n\n<li>Strong written and verbal communication skills.</li>\n</ul>\nIn compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification form upon hire."}