{"job title": "Quality and Process Engineer", "company": "Novolex", "city state": "– Ft. Madison, IA (FTM)", "rating": "3.1", "job description": "<div>Novolex™ employs over 10,000 people across the globe. We strive to be the employer of choice in the global packaging industry. Novolex™ Careers include manufacturing, engineering, procurement, supply chain, finance, HR, product development, sales, marketing and an ever-expanding array of others to support our continuing rapid growth. Our team is rich in diversity and our culture encourages continuous personal growth and teamwork in all we do.\n<br><br>\n<strong>Job Title:</strong>\n<br><br>\nQuality and Process Engineer\n<br><br>\n<strong>Position Summary:</strong>\n<br><br>\nThe Quality and Process Engineer will utilize problem solving techniques to lead projects in order to improve safety, quality, delivery, productivity, thru put, or inventory. They will lead and participate in ongoing improvements in safety, quality, OpEx and capacity through strong partnerships with Operations leadership, as well as by engaging all Operations employees. They will serve as the point person in our SQF Certification and Compliance.\n<br><br>\n<strong>Essential Functions &amp; Key Responsibilities:</strong>\n\n<ul>\n\n\t<li>Analyze operational data such as cycle time, equipment downtime, scrap, process capability, product and people flow to design workspace layouts following Lean manufacturing principles.</li>\n<li>NPI and Cost Reduction projects completed on time with all required documentation and actions regarding PFMEA, Safety, Quality and Productivity targets, following our BOS processes.</li>\n<li>Drive equipment uptime by engaging with Maintenance team.</li>\n<li>Partner with Operations leadership on containment actions to achieve takt time attainment goals and restore flow while driving to root cause solutions for permanent corrective action with all available lean manufacturing tools.</li>\n<li>Collaborate with EHS team to identify and implement processes, procedures, and equipment to enhance site environmental, health, and safety practices including workplace ergonomics.</li>\n<li>Collaborates with Operations leadership, as well as production employees, to develop Standard Work and Job Breakdown Sheets.</li>\n<li>All other duties as assigned.</li>\n<li>Investigate all customer and internal quality complaints to determine ‘root cause’ and solicit the necessary resources to determine disposition and implement an effective corrective action, while clearly documenting all activities relating to the corrective action.</li>\n<li>Establish and maintain first-piece and in-process Inspection Characteristics for all manufacturing operations.</li>\n<li>Assist in determining receiving inspection characteristics for purchased items.</li>\n<li>Provide Initial Sample Inspection Reports and Process Capability Studies using statistical techniques for supplied parts and when applicable internally.</li>\n</ul>\n<strong>Audits / Training:</strong>\n\n<ul>\n\n\t<li>Create effective work instructions such as Standard Operating Procedures, Department Work Instructions, rework instructions and quality related instructions to assist manufacturing departments.</li>\n<li>Administer and / or Develop miscellaneous trainings as needed for new process, procedure, equipment, etc.</li>\n<li>Direct the daily activities of the Quality SQF Coordinator</li>\n</ul>\n<strong>Candidate Requirements:</strong>\n\n<ul>\n\n\t<li>Bachelor’s Degree</li>\n<li>1-3+ years of relevant experience in manufacturing environment preferred.</li>\n<li>Analytical skills and understanding of problem solving techniques/tools.</li>\n<li>Data-driven, disciplined, objective and detail oriented.</li>\n<li>Strong communication skills. Demonstrated ability to act as a business partner, “see the big picture,” and work through ambiguity and change.</li>\n<li>Advanced computer knowledge with MS Office applications and other computer tools and software.</li>\n<li>Must be legally authorized to work in the United States without Company sponsorship.</li>\n<li>Successful completion of pre-employment background and drug screen.</li>\n</ul>\n<strong>About the Company</strong>\n\n<ul>\n\n\t<li>Novolex™ is North America’s leader in packaging choice and sustainability.</li>\n<li>Novolex™ is headquartered in Hartsville, SC and has 62 facilities around the globe, including the worlds’ largest closed loop plastic bag recycling plant located in Indiana. The company has over 10,000 employees in the US, Canada, Mexico and Europe.</li>\n<li>The family of historic Novolex™ brands includes Bagcraft® Packaging, Hilex Poly®, Fortune Plastics®, Duro Bag®, De Luxe® Packaging, Burrows Paper, Novolex Custom Film &amp; Bag™, International Converter®, General Packaging® Products, Heritage Bag®, Burrows Packaging, Sheilds and The Waddington Group.</li>\n<li>Each of the Novolex™ brands brings a unique sustainability and product story in plastic, paper, foil, recycling, or composting applications. The Novolex™ brands are unified by four common values: Manufacturing Innovation and Quality; Service; Packaging Choice; and Sustainability.</li>\n<li>Novolex™ focuses on customers within the retail, grocery, convenience store, deli, food service, hospitality, institutional, processor and industrial markets. The Novolex™ product portfolio and our engineered solutions are designed to meet customer packaging application needs in the areas of food contact, customer experience, resale items, checkout systems, can liners and packaging operations.</li>\n</ul>\n<strong>Our Mission</strong>\n\n<ul>\n\n\t<li>Novolex’s™ mission is to continue a tradition of leadership established by our historic brands in the areas of packaging choice, customer service, manufacturing innovation, quality, and sustainability.</li>\n</ul>\n<strong>Our Vision Statement</strong>\n\n<ul>\n\n\t<li>To be a leading provider of packaging solutions that are environmentally friendly, create value for the customer and Novolex™, have excellent quality, and provide superior service.</li>\n<li>We want to accomplish this with an entrepreneurial culture which drives operational excellence and proactively creates ecological solutions.</li>\n</ul>\n<strong>Our Environmental Mission</strong>\n<br>\nNovolex's sustainability goal is to establish a viable environmental program and product line that:\n\n<ul>\n\n\t<li>Reduces the impact of plastic and paper on the environment through recycling and increased recycled content</li>\n<li>Sets a high standard of industry leadership and corporate citizenship</li>\n<li>Creates meaningful benefits for the environment and the community</li>\n<li>Facilitates environmental action by retailers and the community</li>\n</ul>\nFor more information on Novolex™, visit our website at: www.novolex.com\n<br><br>\nNovolex does not publically post salary information on job boards.\n<br><br>\n<em>The Company has reviewed this job description to ensure that essential functions and basic duties have been included. It is not intended to be construed as an exhaustive list of all functions and responsibilities. Additional functions and requirements may be assigned by supervisors as deemed appropriate. Pre-employment, as well as post-hire substance testing, is required for specified positions through Novolex. Must be legally authorized to work in the United States without Company sponsorship.</em>\n<br><br>\n<em>Novolex™ is committed to providing equal employment opportunity in all employment practices, including but not limited to, selection, hiring, promotion, transfer, and compensation to all qualified applicants and employees without regard to age, race, color, national origin, sex, pregnancy, sexual orientation, gender identity, religion, handicap or disability, genetics, citizenship status, service member or veteran status, or any other category protected by federal, state, or local law. Any individual, who because of his or her disability, needs an accommodation in connection with an aspect of the Company’s application process should contact Jamie Wells at 800-845-6051</em><em>.</em>\n<br>\n<em><em><em>Novolex is an E-Verify Employer.</em></em></em>\n<br>\nFollowing GMP in compliance with all food safety requirements.\n<br><br>\n<em><em><em>#INDHP #CB #GD #MON #LI-JO1</em></em></em>\n<br><br>\n<em></em>\n<br><br>\n<em></em>\n<br><br>\n<em></em>\n<br><br>\n<em></em></div>\n<br>"}