{"job title": "System Software Engineer", "company": "NVIDIA", "city state": "– US, CA, Santa Clara", "rating": "4.4", "job description": "We at NVIDIA are looking for a Systems Software Engineer to join the GameStream technology team -- the technology that powers peer to peer and cloud based services to stream games. Keeping our services highly available and reliable, lean and performant and conducive to continuous addition of bigger and better features are at the center of serving the best gaming experience to our discerning end users.\n<br><br>\nIf you are passionate about developing products that drive technology to its edge, love complex design problems and take pride in simple solutions, are a self starter and an out of box thinker who challenges status quo and has the persistence to see initiatives through, we are keen to hear from you.\n<br><br>\nAs a member of this core team, you will work with highly talented and driven engineers to architect core-technology improvements and drive addition of features across products powered by the core technology.\n<br><br>\n<strong>What you will be doing</strong>\n<ul>\n<li>Drive end-to-end software development cycle for your modules and new product features using agile development methodologies</li><li>Design and develop product features with an emphasis on reliability, performance, scalability and sustainability</li><li>Collaborate with teams owning other services to design features, define interfaces between services</li><li>Define and develop tracking metrics and performance indicators for components, interfaces and features you own</li><li>Be an active participant in review and contribute actively to quality of designs and code across the team</li><li>Contribute to the evolution of team processes and methodologies</li>\n</ul>\n<strong>What we need to see</strong>\n<ul>\n<li>Highly proficient in C/C++, Multi-threaded programming</li><li>Excellent system software testing (white box) and sharp debugging skills</li><li>Ability to dive deep through multiple software components and layers</li><li>Knowledge of Python or other scripting languages, keen learner of useful tools and tricks</li><li>BS or MS in Computer Science or a related discipline</li><li>1+ years of experience</li>\n</ul>\n<strong>How can you stand out from the crowd</strong>\n<ul>\n<li>Experience in developing, installing and deploying high availability and highly reliable cloud services and micro services</li><li>Knowledge of concepts of windows services, users, sessions and Linux users and user groups</li><li>Have used telemetry and visualization tools, have exposure to data analysis and data driven decision-making</li> <li>Experience in working on low latency video streaming services and products</li><li>Experience writing and / or using windows/ Linux io drivers, Audio/ video driver interfaces</li>\n</ul>\n\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression , sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law."}