{"job title": "Principal Software Engineer", "company": "Reflektion Inc.", "city state": "– San Mateo, CA", "rating": "3.8", "job description": "<b>Responsibilities</b>\n<ul>\n<li>You will build innovative search platform used to power Reflektion best-in-class text, voice-text, conversational and image search.</li>\n<li>You will provide technical mentorship to other members of the team, and leverage your experiences to vocalize best practices and ensure proper sustainable engineering standards are followed.</li>\n<li>You will strive to continually improve and simplify the search infrastructure, and will apply your love of tackling challenging problems to innovate on core search areas such as indexing, query execution, metrics tracking, maintaining 5 9s of uptime, and scaling for the future.</li>\n<li>You will design and code massively scalable services to provide a continually improving search experience, and your work will be seen by millions of customers daily.</li>\n<li>You will experiment with various algorithms to optimize for customer’s goals including revenues, engagement, etc.</li>\n</ul>\n<b>Basic Requirements</b>\n<ul>\n<li>Bachelor’s Degree in a technical discipline such as Computer Science, Computer Engineering, etc.</li>\n<li>At least 5 years experience working on Search Performance, Search Relevance, Query Understanding and Information Retrieval. An excellent understanding of information retrieval, established skill at search relevance and query understanding.</li>\n<li>At least 8 years of experience building large distributed web based systems and experience in Python, Java, Go or C++ programming</li>\n<li>Track record of delivering complex search systems and cross-functional projects</li>\n<li>Excellent written and verbal communication skills with the ability to present complex technical information in a clear and concise manner to a variety of audiences</li>\n<li>Passionate about writing and maintaining high-quality software that solves real-world meaningful problems at scale.</li>\n<li>Passionate about helping your teammates grow, and continually expanding the team’s technical knowledge</li>\n<li>Experience deep diving and solving complex issues in a distributed system.</li>\n<li>Enjoy optimizing system performance of a large distributed system.</li>\n<li>Able to shepherd projects from prototype stage into production</li>\n<li>Background in test-driven development</li>\n</ul>\n<b>Preferred Requirements</b>\n<ul>\n<li>Experience with Elasticsearch / Lucene, AWS a big plus</li>\n<li>Experience in international language support</li>\n<li>Experience in eCommerce vertical</li>\n</ul>"}