{"job title": "Electronic Controls Engineer - Systems", "company": "Rheem Manufacturing", "city state": "– US-AL-Montgomery", "rating": "3.4", "job description": "<div><b>A Career at Rheem: Where Comfort Is Your Calling</b></div>\n<div> </div>\n<div>At Rheem, we’re dedicated to bringing comfort to people’s lives. And, as a leading global manufacturer of heating, cooling and water heating equipment, we’re innovating all-new ways to deliver just the right temperature while saving energy, water and supporting a more sustainable future. It’s an exciting challenge that requires a team of talented, passionate people with a diverse set of skills. From engineers to accountants, sales professionals to support experts, Rheem depends on people to power our innovations. Join Rheem, and help shape the future of products that impact people’s lives—every day.</div>\n<div> </div>\n<div>The <b>Electronic Controls Engineer – Systems</b> position will be responsible for planning, implementing, executing and documenting systems engineering activities for Rheem electronic controls. </div>\n<div> </div>\n<div>This position will serve our Water Heater Division, located in Montgomery, AL. </div>\n<div><b></b> </div>\n<div><b>WHAT YOU’LL DO</b></div>\n<ul>\n<li>\n<div>Implement and extend a common controls platform strategy within Rheem and implement a common approach for collection and analysis of product data from development and production units.</div></li></ul>\n<div><b>WHAT YOU NEED</b></div>\n<ul>\n<li>\n<div>Bachelor’s or foreign equivalent degree in electrical engineering, mechanical engineering or a related engineering field and 2 years of experience in the job offered or 2 years of experience performing engineering for electronics controls and test equipment including analog and digital circuit design, prototyping, qualifying and commercialization planning. </div></li>\n<li>\n<div>Requires 2 years of experience: collecting data and performing inferential statistical analysis; performing costs analysis of electronic controls and designs to meet cost targets; creating and reviewing electronic schematics and electrical diagrams; and designing tests with National Instrument LabView on Compact Field Point, Compact DAQ, and cRIO. </div></li>\n<li>\n<div>Requires 1 year of experience: conducting electronics failure analysis; designing construction of first prototypes of new design concepts; analyzing and interpreting technical procedures and government and agency regulations; conducting and participating in product and component level Design Failure Mode and Effect Analysis (DFMEA) for water heating products; and designing electronics and software. </div></li></ul>\n<div> </div>\n<div><b>Rheem is an Equal Opportunity Employer</b></div>\n<div><b></b> </div>\n<div><b>Notice to Third Party Recruitment Agencies:</b></div>\n<div><b> </b></div>\n<div>Please note that Rheem and its subsidiaries do not accept unsolicited resumes from recruiters or employment agencies. In the absence of an executed Recruitment Services Agreement, there will be no obligation to any referral compensation or recruiter fee.</div>\n<div> </div>\n<div>In the event a recruiter or agency submits a resume or candidate without an agreement, Rheem and its subsidiaries shall explicitly reserve the right to pursue and hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, shall be deemed the property of Rheem.</div>\n<div> </div>\n<div>If your agency would like to be considered as a potential future recruiting partner, please leave your contact information at TalentAcquisition@rheem.com</div>\n<div>#L1-EM2</div>\n<div> </div>"}