{"job title": "Splunk Pre-Sales Engineer", "company": "RHONDOS LLC", "city state": "– Portland, OR", "rating": "NA", "job description": "Seeking a strong technical SAP &amp; Splunk pre-sales engineer to properly advise customers on PowerConnect. <br><br> Role: Pre-Sales Engineer <br><br> Location: remote <br><br> Note: <br><br> This Splunk Pre-sales engineer role is ideal for a SAP or Splunk Professional Services consultant who can explain the value of the two technologies working together. This role provides you the ability to apply your Splunk expertise in a consultative and advisory capacity to customers, and leverage your SAP background. <br><br> The ideal candidate is certainly not limited to this background, however. We will consider people that work in SAP or Splunk presales role currently, or those that work as a Splunk Admin or Architect role. Out of respect for our close relationship with Splunk, we will not consider candidates that are currently employed at Splunk. <br><br> Role: <br><br> RHONDOS is seeking a highly motivated, results oriented individual to join our growing team as a Splunk/PowerConnect Pre-Sales Engineer. You will work together with sales reps from both RHONDOS and Splunk on the solution and technical aspects of selling Splunk, across several use cases to include IT security and IT Ops for SAP data. This role will, however, have a heavy emphasis in SAP data so domain expertise is required in this area. Our clients span all use SAP. <br><br> In this role, you will have the responsibility for actively driving and leading the technology evaluation for external customers. You’ll work closely with the RHONDOS sales team, Splunk sales reps and customers and prospective customers as their key technical advisor, properly advocating both PowerConnect and Splunk’s products and services. <br><br> Responsibilities:\n<ul>\n<li>Ability to effectively demonstrate PowerConnect and Splunk products and services to customers on-site, remotely via webinar sessions, and at field events such as conferences and trade shows.</li>\n<li>Extremely detail oriented, with the ability to document proper SOWs.</li>\n<li>Experience responding to functional and technical elements of RFIs/RFPs.</li>\n<li>Strong presentation skills and top-notch verbal and written communication skills.</li>\n<li>Possess intellectual and technical curiosity about what is possible with Splunk and SAP and how customers can leverage this powerful platform to drive business value.</li>\n</ul>\nRequirements:\n<ul>\n<li>5+ years related experience in selling and supporting software products to IT organizations</li>\n<li>Subject Matter Expertise with the SAP &amp; Splunk platform</li>\n<li>Domain expertise with SAP</li>\n<li>Comfortable approaching total strangers and quickly extracting technical know-how from them.</li>\n<li>Strong written and verbal communications skills.</li>\n<li>Additional technology expertise including:</li>\n</ul>\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which you are applying. <br><br> Travel Requirement: <br><br> Approximately 60% including a combination of customer visits and ongoing training opportunities. <br><br> Why RHONDOS\n<ul>\n<li>Exclusive Master Distributor for PowerConnect</li>\n<li>Company-paid Splunk training and certification, both initial and ongoing</li>\n<li>Exposure to a broad set of customer, technical challenges, use cases and different technologies that integrate with Splunk</li>\n<li>Excellent technical leadership as well as the ability to collaborate with a team members that, like you, are passionate about Splunk</li>\n<li>Competitive salary</li>\n<li>100% employer-paid health insurance</li>\n</ul>\nAbout RHONDOS <br><br> RHONDOS, hires and invests in the best and brightest Splunk &amp; SAP resources available. Senior consultants who are recognized experts in architecting, deploying, configuring, and customizing PowerConnect Splunk Enterprise, Splunk ITSI, and Enterprise Security. The founders of RHONDOS are industry veterans with experience working at companies including Splunk, Microsoft, and SAP."}