{"job title": "Sales Engineer - New England Region", "company": "SecurityScorecard", "city state": "– Boston, MA", "rating": "4.4", "job description": "<strong>About the Role</strong>\n<br><br>\nSecuityScorecard's Sales Engineering team are trusted security advisors and business partners both internally and to prospective clients, offering deep knowledge about the market and our solution. We are intellectually curious, find great reward in delivering valuable solutions to customers, and are passionate about cybersecurity.\n<br><br>\nAs a Sales Engineer, you will partner with Field Sales Directors in New England and Eastern Canada throughout the sales relationship lifecycle to build solutions to address specific customer security needs. Key to the role is communicating the value proposition of SecurityScorecard's platform and suite of solutions, positioning SecurityScorecard effectively against competing offerings. You'll also collaborate cross functionally, providing customer feedback to product teams to inform roadmap.\n<br><br>\nSuccess in this role requires security and technical acumen to develop a deep understanding of SecurityScorecard's architecture and services and a consultative approach to understanding customer business needs. You'll leverage your strategic communication skills to engage in technical and business discussions with engineers and senior decision makers alike, translating customer needs into technical requirements and conveying the merit of SecurityScorecard's solutions throughout.\n<br><br>\n<strong>Key Responsibilities</strong>\n\n<ul>\n<li>Serve as the domain expert on SecurityScorecard solutions throughout the sales lifecycle</li>\n<li>Provide specific solution/technology/product consulting, technical and sales support for major potential accounts</li>\n<li>Perform in-depth and high-level technical presentations for customers, partners and prospects</li>\n<li>Maintain area or operation responsibilities for selected major account opportunities</li>\n<li>Maintain product roadmaps and alignment between the customer and relevant business entities</li>\n<li>Devise, present and document technical solutions</li>\n<li>Keep up-to-date on relevant competitive solutions, products and services</li>\n</ul>\n<strong>Experience</strong>\n\n<ul>\n<li>Bachelor's degree</li>\n<li>Minimum 3+ years of technical sales or pre-sales experience in cybersecurity, or as a cybersecurity practitioner who desires to grow a career in a client facing role</li>\n<li>Industry recognized certifications such as a CISSP, GIAC, etc. a plus</li>\n<li>Demonstrated presentation and interpersonal skills; communicate in front of large groups with a mixed audience of technical and non-technical</li> \n</ul>\n<strong>Traits</strong>\n\n<ul>\n<li>Highly motivated self starter who works well independently</li>\n<li>Intellectually curious; seeks to continually self-educate and evolve domain specific knowledge</li> \n\n<li>Willing to travel on day and overnight trips in New England, and occasionally to NE Canada</li>\n</ul>\n<strong>Why SecurityScorecard</strong>\n<br><br>\nSecurityScorecard is revolutionizing the cybersecurity industry with our platform, data, and insights. We've built a new category of enterprise software which enables companies to rate and understand the security risk of any company. Our customers span a variety of sectors and use cases, including compliance, cyber insurance, and vendor risk management. We are proud to be backed by Sequoia, Google Ventures, and Moody's.\n<br><br>\nSecurityScorecard is growing tremendously and targeting talent who can contribute to the next phase in our company's development. A successful Scorecarder exemplifies our S(CORE) values: Solutions Focused, Customer Centric, operate as One Team, Resilience and Embody #SecurityDNA. Your interest in making an impact in our organization and alignment with these values is as important as your skills.\n<br><br>\n<em>SecurityScorecard embraces diversity. We believe that our team is strengthened through hiring and retaining employees with diverse backgrounds, skillsets, ideas, and perspectives. We make hiring decisions based upon merit and do not discriminate based on race, religion, national origin, gender identity or expression, sexual orientation, age, or marital, veteran, or disability status.</em>"}