{"job title": "Data Engineer", "company": "Slalom LLC.", "city state": "– Houston", "rating": "4.4", "job description": "Overview\n<br><br>\nThe Data Engineer has to be an expert in SQL development further providing support to the Data and Analytics in database design, data flow and analysis activities. The position of the Data Engineer also plays a key role in the development and deployment of innovative big data platforms for advanced analytics and data processing.\n<br><br>\nThe Data Engineer defines and builds the data pipelines that will enable faster, better, data-informed decision-making within the business.\n<br><br>\nDeep experience in developing enterprise data management strategies including operational data stores, data warehouse implementations, data movement, data services, data acquisition, data conversion, and archive/recovery.\n<br><br>\nBasic Qualifications:\n<ul>\n<li>3+ years in working experience as a database engineering support personnel or a database engineering administrator within a fast-paced a complex business setting. The candidate will also have had experience working with MySQL databases and Microsoft SQL.</li><li>The candidate must demonstrate experience working with large and complex data sets as well as experience analyzing volumes of data.</li><li>Experience in the creation and debugging of databases critical to the business’s mission. The candidate will have strong working and conceptual knowledge of building and maintaining physical and logical data models and experience with Tableau, Power BI, or other business intelligence tools.</li><li>The Data Engineer must also have exceptional analytical skills, showing fluency in the use of tools such as MySQL and strong Python, Shell, Java, PHP, and T-SQL programming skills.</li><li>Develop databases using SSIS packages, T-SQL, MSSQL, and MySQL scripts.</li><li>Developed data strategies that define how the data will be stored, consumed, integrated and managed by different data entities and IT systems, as well as any applications using or processing the data (Ground and Cloud)</li><li>Ability to design, build, and maintain the business’s ETL pipeline and data warehouse.</li><li>Demonstrate expertise in data modeling and query performance tuning on SQL Server, MySQL, Redshift, Postgres or similar platforms.</li><li>Designed and managed repositories that supports, at a minimum, the business, information, technology and solution viewpoints along with their relationships</li><li>Experience with one of the following toolsets: AllFusion, Aris, ERwin, Data Architect, Power Designer technologies</li><li>Hands on experience with data integration technologies – Scoop, Impala, etc. for batch along with real-time streaming services, Stream sets, Kinesis, Kafka, etc.</li><li>Identify impact and opportunities to reuse data structures through services oriented architecture (Data as a Service – Daas)</li><li>Leading data engineering teams for large BI, Cloud and / or ERP projects</li>\n</ul>\nPreferred Skills:\n<ul>\n<li>Focus in Oil &amp; Gas with Hadoop technology stack</li><li>AWS, MS Azure and other Cloud RDBMS experience is a PLUS</li><li>Experience with Enterprise Architecture Tools (Mega, Troux, IBM, Opentext etc)</li><li>Data Archiving, Disaster Recovery and DBA</li>\n</ul>\nProfessional Skills:\n<ul>\n<li>Eagerness to contribute in a team-oriented environment</li> <li>Ability to work creatively and analytically in a problem-solving environment</li><li>Desire to work in an information systems environment</li><li>Excellent leadership, communication (written and oral) and interpersonal skills</li>\n</ul>"}