{"job title": "Supply Chain Engineer", "company": "TMC", "city state": "– Chicago, Illinois", "rating": "3.4", "job description": "The Supply Chain Engineer (SCE) is responsible for identifying, developing and implementing end-to-end supply chain solutions for TMC clients. A successful candidate will be an expert in supply chain management, logistics engineering, transportation, and network design/optimization.\n<br><br>\nThe SCE will work independently on projects in the areas of, but not limited to, Analytics and Data mining, Supply Chain Design, Procurement, and Transportation Analysis. In addition to the solution design and development, the candidate should be well versed in project management, Client communication, Implementation, and execution support.\n<br><br>\nThis role will require basic level of database handling, querying and reporting. Ability to read, learn, and modify codes, scripts, and macros will be critical for success.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n\n<li>Review historical and forecasted data to identify cost and service improvement opportunities</li>\n<li>Design and develop supply chain solutions aligned to our strategic roadmap</li>\n<li>Develop scenario-based models of possible solutions and be capable of leading a modeling team for more complex solution design</li>\n<li>Communicate complex solutions to a variety of stakeholders in a simple and concise manner</li>\n<li>Fully and accurately define the supply chain requirements and the solution approach while ensuring the gathering of accurate information and performing detailed solution design</li>\n<li>Follow a PDCA based process for every project</li>\n<li>Support implementation of solutions as needed by operations or procurement teams</li>\n<li>Develop metrics and dashboards to track results of implemented solutions</li>\n<li>Develop value-add approach to supply chain challenges employing analysis, innovation and experience within the target market.</li>\n<li>Understand the use of optimization/decision support tools to perform global supply chain studies, routing optimization and transportation rate analyses</li>\n\n</ul>\n<strong>Qualifications:</strong>\n<ul>\n<li>\n\n<ul>\n\n<li>Bachelor’s Degree in Supply Chain Management or Engineering or any quantitative discipline / Masters preferred</li>\n<li>Equivalent work experience may be considered</li>\n<li>3- 5 years’ experience in Supply Chain Engineering, Project Management, and/or Supply Chain Operations preferred</li>\n<li>Ability to understand the “story in the data”, and ability to coach others in seeing and telling the story.</li>\n<li>Proficiency in using Microsoft Excel, which includes Macros, VBA, Solver models etc.</li>\n<li>Experience with network modeling tools such as Supply Chain Guru, ILOG, CAPS, etc. is preferred.</li>\n<li>Working knowledge of Database tools like SQL, MS Access is preferred.</li>\n<li>Experience working and thriving in a team-based continuous improvement environment.</li>\n<li>Very strong communication and presentation skills: strong listener with the ability to read between the lines as well as presentation skills that have the ability to tell the story and connect to your audience.</li>\n<li>Experience and comfort in dealing with ambiguity and able to deliver results with minimal oversight.</li>\n<li>Contribute to our culture focused on trust and respect for all team members, Customer-first strategies, and continuous improvement.</li>\n<li>Proven ability to learn new software at an accelerated pace.</li>\n<li>Ability to simplify the complex and come up with innovative solutions approaches.</li>\n<li>Up to 20% travel may be required (domestic and/or international)</li>\n\n</ul>\n</li>\n</ul>\n\n<div><strong>Benefits</strong>\n<br><br>\nWe offer a competitive compensation package and excellent benefits including medical, dental, and vision insurance, prescription drug coverage, paid holidays and vacation, disability insurance, life insurance, 401K with company match, profit sharing, Employee Stock Purchase Plan, and the opportunity to prosper in a growing Fortune 500 company.\n<br><br>\n<strong>About TMC</strong>\n<br><br>\nCareer opportunities at TMC, a division of C.H. Robinson, allow you to collaborate closely with shippers that have complex global logistics networks. Help them improve their processes and drive efficiencies throughout their supply chain. Become an extension of your customers’ logistics team, make decisions, and drive execution through Managed TMS® solutions for immediate and long-term results for your customers.\n<br><br>\nTMC is a global division with offices in Chicago, Amsterdam, Shanghai, São Paulo, and Mumbai. Join a passionate team of thought leaders that drive innovation and solve problems for shippers all over the world by integrating services and technology. Become a part of a team where respect, honesty, and passion are valued—and your decisions truly make an impact. To learn more, please visit www.mytmc.com.\n<br><br>\n<strong>Equal Opportunity Employer</strong>\n<br><br>\nC.H. Robinson - Affirmative Action Employer/EOE/M/F/Disabled/Veteran</div>"}