{"job title": "Pre-Sales Engineer II", "company": "TriNet Group", "city state": "– Bradenton, Florida, United States", "rating": "3.3", "job description": "<div><div><div><div><div><div>\n \n \n \n \n \n \n \n\n \n </div>\n \n\n \n \n \n TriNet is a leading provider of comprehensive human resources solutions for small to midsize businesses (SMBs). We enhance business productivity by enabling our clients to outsource their HR function to one strategic partner and allowing them to focus on operating and growing their core businesses. Our full-service HR solutions include features such as payroll processing, human capital consulting, employment law compliance and employee benefits, including health insurance, retirement plans and workers’ compensation insurance. <br><br>TriNet has a nationwide presence and an experienced executive team. Our stock is publicly traded on the NYSE under the ticker symbol TNET. If you’re passionate about innovation and making an impact on the large SMB market, come join us as we power our clients’ business success with extraordinary HR. \n \n \n\n \n \n \n \n \n <div>\n <p><strong>Job Summary/Overview</strong></p>\n<p>The Pre-Sales Engineer is an integral part of the Sales team with a focus on delivering pre-sales demonstrations and technical leadership to enhance the prospecting experience in the sales process. The Pre-Sales Engineer will focus on selling and demoing our technology platforms in addition to TriNet’s applications. This individual is responsible for answering technical inquiries from prospects regarding technology, features, solutions, applications as well as articulate TriNet’s technology and product positioning. The Pre-Sales Engineer will be responsible for working hand in hand with the sales consultants on driving ACV for the company across all verticals and regions. This individual will have well rounded experience and expertise in demoing technology platforms and handling high profile, mid to large size prospects. This person will also be responsible for delivering training webinars and process documentations for the Sales team. The Pre-Sales Engineer is required to effectively document and communicate customer needs for the implementation and sales teams to ensure a positive customer experience. <br></p>\n<p><strong>Essential Duties/Responsibilities</strong></p>\n<p>• Complete technology demonstrations and delivery high level communication with C-level Executives<br>• Communicate effectively across multiple departments<br>• Process creation and documentation<br>• Manage and interpret prospect requirements<br>• Provide coaching and professional development to Sales Consultants and leadership, to enhance their product knowledge, technical acumen and technical sales skills. <br>• Coordinates and collaborates with internal sales teams to understand customer requirements, promote product recommendations for prospects, and provide sales support<br>• Strong ability to quickly comprehend and explain complex engineering concepts in simple, effective terms<br>• Strategize and plan prospect presentations with sales team and other technical experts<br>• Provide prospects insights on how TriNet can improve their operational effectiveness<br>• Time and territory management<br>• Manage data in the SalesForce CRM system <br>• Other projects and responsibilities may be added at the manager’s discretion<br></p>\n<p><strong>Job Requirements &amp; Qualifications</strong><br>Education: Bachelor’s degree; or equivalent combination of education and experience.<br>Training Requirements (licenses, programs, or certificates): None<br>Experience: <br>• 1 – 3 years’ experience in Sales, Sales support or Sale Engineer <br>• Experience with SalesForce and Customer Relationship Management (CRM) preferred<br>• Experience in consultative selling and/or delivery of demos to C-level prospects<br>• Experience with selling technology platforms/applications<br>Other Knowledge, Skills and Abilities: <br>• Excellent presentation skills <br>• Excellent verbal and written communication skills<br>• Excellent interpersonal and problem-solving skills <br>• Meets assigned targets for profitable sales growth in assigned product lines, markets or teams supported<br>• A demonstrated commitment to high professional ethical standards and a diverse workplace<br>• Ability to adapt to a fast paced continually changing business and work environment while managing multiple priorities <br>• Ability to communicate with employees at all levels of the organization, including C-level communication<br>• Outstanding phone presence and business acumen<br>• Computer skills with Word, Excel, PowerPoint and preferably with CRMs<br>• Solution oriented<br>• Must be detail oriented with effective organizational and time management skills.<br><br><strong>Work Environment/Other Info</strong></p>\n<p>• Work in clean, pleasant, and comfortable office setting <br>• 25% travel maybe required </p>\n<p><em><br>The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. <br><br></em></p>\n<p><em>Please Note: TriNet reserves the right to change or modify job duties and assignments at any time. The above job description is not all encompassing. Position functions and qualifications may vary depending on business necessity. <br><br>TriNet is an Equal Opportunity Employer and does not discriminate against applicants based on race, religion, color, disability, medical condition, legally protected genetic information, national origin, gender, sexual orientation, marital status, gender identity or expression, sex (including pregnancy, childbirth or related medical conditions), age, veteran status or other legally protected characteristics. Any applicant with a mental or physical disability who requires an accommodation during the application process should contact a company manager, a company officer or a TriNet HR representative to request such an accommodation.</em></p>\n<p><em></em> </p>\n<p>#LI-AS1</p>\n </div>\n \n \n\n \n\n \n </div>\n </div>\n </div>\n\n \n </div>\n\t</div>"}