{"job title": "Engineer-Manufacturing 4", "company": "Triumph Group", "city state": "– US-GA-Milledgeville", "rating": "2.7", "job description": "<div><div>\n<div>Triumph Group designs, engineers, manufactures, repairs and overhauls a broad portfolio of aviation and industrial components, accessories, sub-assemblies, systems and aircraft structures. We partner with original equipment manufacturers (OEMs) and operators of commercial, regional, business and military aircraft worldwide, to provide products and services that solve their hardest problems. So whatever the part, component or complexity of assembly, Triumph is committed to quality, service and meeting the specialized needs of each customer.\n<br><br>\nTriumph participates at all levels of the aerospace supply chain – from single components, to complex systems, to aerospace structures and their contents. We provide solutions for the entire product life cycle of an aircraft – from raw material to aftermarket service. Our unique ability to integrate a broad range of products and capabilities is our competitive advantage.</div>\n</div>\n</div>\n\n<br>Responsibilities<br>\n\n<div>\n<div>\n<div>Under minimal direction of Technical Operations Director\n<ul>\n<li>Plan, develop, and establish initial manufacturing concepts, tooling and equipment requirements for assigned projects.</li> <li>Continuous improvement of current manufacturing tooling, techniques, fabrication processes, and assembly operations for production operations.</li> <li>Provide technical assistance to Operations, Quality, and other Technical Operations disciplines to resolve tooling and manufacturing problems.</li> <li>Coordinate and control engineering changes, and maintain effective liaison within department and with production.</li> <li>Review and approve tool design drawings for accuracy and quality.</li> \n</ul>\nRequires the ability to conceive and create tool designs for entire tool families utilizing CATIA V5, CATIA V4, and 2D engineering datasets. Lead Technical Operations proposal effort including NR estimates and all technical data support required. Composite fabrication (bonding &amp; assembly) experience is required. May be required to perform other related duties as assigned.</div>\n</div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div>Bachelors Degree in Mechanical, Manufacturing Engineering or related curriculum plus 10 years of experience. Composite manufacturing (bonding &amp; assembly) experience required.</div>\n</div>\n</div>\n<br>"}