{"job title": "Cloudera Data Engineer", "company": "Turnberry Solutions", "city state": "– Philadelphia, PENNSYLVANIA", "rating": "4.6", "job description": "<strong><u>Cloudera Data Engineer in Philadelphia, PA 19103</u></strong>\n<br><br>\n<strong>Interview Logistics:</strong><br><br>Demonstrated hands-on experience using technologies like Scala and Python using Spark. Candidate should have extensive experience designing and implementing software solutions in support of data warehousing or data lake.\n<br><br>\nHealthcare knowledge is a definite plus since some of the data formats are related to standards like HL7.<br><br><strong>Required Skills Set:</strong><br><br><strong>Years of Experience:</strong> 7-9 years of experience\n<br><br>\n<strong>Education Required:</strong> Bachelors Degree\n<br><br>\nThis is less of a data science role and more of a data engineering role.\n<br><br>\nWe are looking for a lead developer is familiar working with HBase, Solr and Hive using Spark to manipulate and ingest data inbound to the data lake.\n<br><br>\nExperience with the architecture of Cloudera or similar Hadoop build is required.<br><br><strong>Additional Preferred Skills:</strong><br><br>The candidate should have excellent written, and presentation skills, with the ability to translate complex technical ideas in to understandable business terminology.\n<br><br>\nKnowledge of Python/Scala development for data engineering in Cloudera environment.<br><br><strong>Project Description:</strong><br><br>Our team supports data ingestion and automation of data movement and transformation in the service of business users and data scientists in the organization. The data is healthcare related and we are processing delimited files, XML, images, structured and unstructured data.\n<br><br>\nThe candidate should be prepared to actively be involved in development as well as designing different data engineering processes.<br><br><strong>Physical Environment and Working Conditions:</strong><br><br>Must be able to work on a large team."}