{"job title": "Lead Software Engineer", "company": "Two Bulls", "city state": "– Brooklyn, New York", "rating": "4.3", "job description": "At Two Bulls we look at the landscape of emerging technology and create innovative products that become tomorrow’s solutions. We are a band of roughly 100 people with offices in Melbourne, New York, and Berlin. We ship early and we ship often, believing that experiences are better off in the hands of real people than on a whiteboard. We make important things with a playful mindset and attract brands who share our ambitions.\n<br><br>\nProducts we’re working on include: a global telco’s smart cities infrastructure initiative, a multi-country industrial IoT system that connects and monitors remote sensors over a low power, wide-area LAN (LPWAN), a European high-end kitchen provider’s smart appliance ecosystem. In addition, we’re rethinking &amp; building new technology to improve the school food ecosystem for a company that covers over half of all the children in America. For each of these platforms, we connect intelligent edge devices to each other, to the cloud, and to front-end interfaces on mobile, web, and custom hardware.\n<br><br>\nWe develop strategy, design, and systems in house as fully-integrated teams. We push our clients to embrace the latest technologies and embrace an Agile methodology so that we can deliver client value iteratively.\n<br><br>\n<strong>THE ROLE:</strong>\n<br><br>\nTwo Bulls is growing its New York office to handle our expanding client portfolio. We are currently seeking a lead software engineer who is passionate about working with new technologies and shipping code. Be part of a fast moving team where you can make a difference, solve challenging engineering problem and focus on your craft.\n<br><br>\nAs a Two Bulls engineer you will be responsible for working with an Engineering Manager to scope, build and deliver products for our clients. You will also be responsible for ensuring that we are up to date with the latest technology trends, libraries and best practices.\n<br><br>\nWe are interested in talking with Software Engineers who have experience with some of the following technologies:\n<ul>\n <li>JavaScript, TypeScript, Angular, React</li> <li>Serverless architecture</li> <li>AWS, GCP, Azure</li> <li>Go, Python</li> <li>OAuth, OIDC</li> <li>SQL, NoSQL</li>\n</ul>\n<strong>Requirements</strong>\n<ul>\n <li>6+ years of relevant industry experience</li> <li>BS degree in Computer Science or a similar technical field of study</li> <li>Experience with Git</li> <li>Working knowledge of design patterns and architecture design</li> <li>Working proficiency and communication skills in verbal and written English</li> <li>Interest in learning and working outside of your core area of expertise</li>\n</ul>\n<strong>Benefits</strong>\n<br><br>\nBased in our DUMBO studio, we are excited by beautiful solutions, solving difficult problems, creating great user experiences and being at the forefront of everything that we do.\n<br><br>\nTwo Bulls will provide you with a small company work culture, big company clients, and the ability to work on cutting-edge projects. You will be working within a team of highly talented engineers and designers to help build amazing products.\n<br><br>\nTwo Bulls embraces diversity and equal opportunity in a serious way. We are committed to building a team that represents a variety of backgrounds, perspectives, and skills. The more inclusive we are, the better our work will be. If there is anything we can do to create a more comfortable interview experience for you, please let us know."}