{"job title": "Customer Support Engineer", "company": "Unitrends", "city state": "– Columbia, South Carolina", "rating": "3.7", "job description": "<div>Are you Crazy Committed to customers and customer service?</div><div>Want to have an immediate impact?</div><div>Like the idea of a quarterly bonus structure?</div><div>Looking for upward mobility that ends where your drive, motivation and brilliance do?</div><div>Like the idea of an Open-Door policy all the way up to the CEO?</div><div>If you answered yes to all of the questions above then you may have just found your next job!</div><br>\n<div>Join the winning Unitrends team! We are one of the fastest-growing providers of comprehensive data protection and disaster recovery solutions in the industry today! Our unique multi-environment arsenal of backup, archiving and disaster recovery solutions gives our customers the industry-leading technology needed to protect and preserve their physical, virtual, and cloud environments with the lowest total cost of ownership in the industry. To learn more, visit us at <strong>www.unitrends.com</strong></div><div>How important is what we do at Unitrends?</div>\n<br>\n<strong><div>Well, consider the following facts:</div>\n<br>\n</strong>\n\n<li>93% of all companies that lost their data center for 10 days or more due to a disaster filed for bankruptcy within one year of the disaster.</li>\n<li>60% of companies that lose their data will shut down within 6 months of the disaster.</li>\n\n<div>Come work in a production server environment ensuring protection of business critical data and timely recovery in disaster scenarios where you can make THE difference.</div><div>Unitrends offers an exhilarating, professional yet casual work environment best suited to technically adept minds with a natural curiosity and eagerness to learn.</div><div>Come join the award-winning team of technical support geniuses at Unitrends! Dont just come to work; come make a difference!</div><br>\n<div>Work with a team of dedicated, creative, analytical problem solvers to not only tackle technical problems but astound customers.</div>\n<br><strong>Essential Tasks, Duties and Responsibilities:</strong>\n\n<ul>\n<li>Experience new challenges daily</li><li>Learn and be a part of bleeding edge technologies</li><li>Collaborate with technical professionals from small to enterprise size environments; from health care to financial institutions, from DOD to education, from low-tech industries to high-tech industries.</li><li>Make customers into raving fans by providing a superior customer experience while building life-long relationships.</li><li>Understand and communicate in-depth technical concepts, including but not limited to backup strategies, backup types, storage deduplication, WAN bandwidth utilization and maximization, hardware <strong>peripherals</strong>, LAN networking and advanced networking, NAS/SAN storage and networking, cloud-related concepts.</li> <li>Be a specialist in one technology but work with many</li><li>Keep your edge as new technologies emerge daily.</li><li>Understand virtualization concepts and experience working within one or many hypervisors, specifically VMware, Hyper-V and Xen.</li> <li>Work with common storage devices such as NetApp, EqualLogic, Buffalo, Synology, QNAP and more</li><li>Understand Windows server environments, including but not limited to MS Exchange, MS SQL Server, MS SharePoint, cluster technology, networking, VSS snapshot technology, Windows services and agent application software updates. Be ready for any version, from Windows NT to 2012 clusters.</li><li>Work with CentOS, Ubuntu and FreeNAS OS.</li> <li>Understand Linux concepts including but not limited to disk utilization, file editing, networking, software updates, hardware diagnostics including reading and interpreting log files, work with Postgres SQL database, work with open source Linux tools such as openVPN, ipmiuntil, fuse, docker, apcuspd, flashcache, btier and enhancedIO.</li><li>Perform in a production environment, partnering with customers, end users and resellers to implement best fit backup strategies, resolve backup and recovery related technical errors, implementing solutions tailored for each customers need and desire.</li><li>Listen, understand customer perspective, take ownership of issue(s), set proper and realistic expectations and deliver prompt solution.</li> \n</ul>\n\n<div>Unitrends is an Equal Opportunity Employer and does not discriminate on the basis of race, ancestry, national origin, color, religion, gender, age, marital status, sexual orientation, disability, or veteran status.</div><br>\n<div>Upon conditional offer of employment, candidates are required to complete a criminal background check and drug test per Unitrends employment policy.</div>"}