{"job title": "Plant Engineering Specialist", "company": "UPS", "city state": "– LOUISVILLE, KY", "rating": "3.4", "job description": "<div>Plant Engineering Specialist</div>\n<br><strong>Job Summary</strong>\n<br><br>\nThe Plant Engineering (PE) Specialist assists with maintaining facility environmental compliance, conveyor system reliability, housekeeping, and facility safety. This position creates and drafts package handling systems. He/She drafts conveyor design options using computerized drawing software (i.e., AutoCAD), computes cost estimates of design alternatives, and documents the design process. The P.E. Specialist is also responsible for supporting the Systems Design Project Engineer in communicating the design options to internal stakeholders. He/She assists in creating mechanical design drawings to bid for outside contracts, producing mechanical standards.\n<br><br>\nThe P.E. Specialist communicates assigned work status to colleagues to determine potential impact on the department's schedule. This position communicates the status of developing designs to Project Engineers to coordinate upcoming and ongoing projects.\n<br><br>\n<strong>Other Duties</strong>\n<ul>\n <li>Analyzes Industrial Engineering data to understand the parameters of projects and the business need for developing, expanding, or retrofitting conveyor systems.</li> <li>Assists Project Engineers in presenting design alternatives to the PE Feasibility Committee for their feedback and approval of options.</li> <li>Generates a set of feasibility drawings for each proposed solution to distribute to region/district stakeholders for their feedback and selection of appropriate conveyor systems.</li> <li>Generates feasibility cost estimates for each proposed solution to assist region/district stakeholders in their selection of appropriate conveyor systems.</li> <li>Reviews feasibility cost estimates with Project Engineers to elicit recommendations for making the designs more cost effective.</li> <li>Generates cost estimates of the final conveyor drawings to assist region/district stakeholders in requesting the allocation of resources from Corporate.</li> <li>Scans approved project drawings into a PDF format for distribution to the regions/districts, Corporate Coordinators, vendors, and other PE departments.</li> <li>Archives approved project documents to assist in the design process of future projects and for use in responding to questions that may arise.</li>\n</ul>\n<strong>Preferred Competencies</strong>\n<ul>\n <li>Facility Design: Identifies problems or inefficiencies with current buildings or plants; modifies or adjusts existing facility blueprints to resolve recurring building or plant failures; recommends new facility design specifications.</li> <li>Legal, Regulatory, and Compliance Knowledge: Demonstrates a basic understanding of the functions, regulations, and procedures of compliance agencies or governing bodies; takes a leadership position in programs that reduce risk and enhance safety.</li> <li>Project Management: Demonstrates understanding of implementation objectives, project plan, and one's role within a project; participates in the implementation of a project; provides timely, thorough, and concise updates for area of responsibility; identifies areas of risk and properly communicates them to the project manager.</li> <li>Solicits and Gathers Information: Demonstrates a general knowledge of techniques for soliciting and gathering information.</li> <li>Technical Writing: Demonstrates a general understanding and use of grammatical rules; expresses ideas clearly and concisely; explains the relationship of effective writing to business objectives.</li> <li>Technology Implementation: Able to communicate designed and developed technology solutions and their desired outcome in general terms; expresses the importance of an effective implementation; develops implementation plans.</li>\n</ul>\n<strong>Minimum Qualifications</strong>\n<ul>\n <li>Bachelor’s degree – Mechanical Engineering – Preferred</li> <li>Experience with 3D software – Preferred</li> <li>Experience using Navisworks Manage – Preferred</li>\n</ul>\n\nUPS is an equal opportunity employer. UPS does not discriminate on the basis of race/color/religion/sex/national origin/veteran/disability/age/sexual orientation/gender identity or any other characteristic protected by law"}