{"job title": "Sales Engineer", "company": "Windstream", "city state": "– Austin TX 1011 San Jacinto Blv (6464) 1011 San Jacinto Blvd Ste 100 Austin, 78701", "rating": "2.6", "job description": "<div>The Sales Engineer role partners with Sales Teams to uncover new or incremental, margin rich, revenue opportunities. The role requires the ability to communicate detailed technical, architectural, engineering and product deliverables to all levels inside a customer organization. This role is highly influential in leading customers to make purchasing decisions based on solutions designed to solve the customer’s technical and financial requirements. Their blend of technical and professional skills foster a collaborative environment with internal and external customer teams, providing a unique customer experience.</div><div> </div><div><b>Job Responsibilities</b></div><div> </div><div>• Engages customers in a consultative manner in order to understand the technical and business challenges facing our prospective and current customers. </div><div>• Designs, sells, and supports solutions to customers utilizing the entire suite of Windstream products in order to drive, maintain and increase profitable revenue.</div><div>• Supports Sales and Account Development teams with proposal generation for all Windstream solutions. Including, but not limited to, pricing assistance, equipment design, Visio documentation, and technical documentation necessary during the pre-sale and post signature “hand off” event to Engineering and Service Delivery during implementation phase. </div><div>• Clearly articulates value statements and network designs to internal and external customers.</div><div>• Assists in preparing, completing and presenting all technical designs and paperwork to the Engineering and Service Delivery teams for hand off during the Project Management and Implementation phase of the lifecycle. Engagement post “hand off” event should be the exception, and will require approval from the SE Director in that Region.</div><div>• Creates and delivers focused technical product training for the sales teams they support.</div><div>• Conducts product seminar focused training to customers in collaboration with Sales teams to drive new or incremental profitable revenue</div><div>• Represents Windstream on customer appointments as a subject matter technology expert specializing in network services including TDM solutions, LAN/WAN technologies, LAN/WAN applications, SIP, customized fiber, data center and associated hardware. </div><div>• Develops collaborative relationships via daily interaction with all functional teams at all levels. </div><div>• Stays current with technology as it pertains to the industry.</div><div>• Other duties may be assigned.</div><div> </div><div> </div><div><b>Knowledge, Skills or Abilities </b></div><div> </div><div>• Communication: Intermediate written and verbal communication skills. Must have the ability to build relationships over the phone and in person. Must have a proactive communication style ensuring timely status updates to account team and customer. Able to develop relationships and communicate with both internal and external customers.</div><div>• Technical Skills: Strong understanding of voice/data/internet applications, communications technology and network design. IP Routing and Switching, IP V4/V6, MPLS, VPN, SIP and TDM Voice, Data Center, Cloud Solutions, Virtualization, Managed Services, UCaaS, Solid understanding of technical terminology related to company products &amp; services. Requires general knowledge of voice and data communications equipment. Understanding of sales cycles and the solution selling process, preferably at multiple levels, i.e., Internet &amp; Enterprise. Solid presentation skills. </div><div>• Problem Solving: Strong analytical skills. Must be able to work through complex issues with a methodical approach. Solid ability to graphically depict solutions in a compelling manner. </div><div>• Work Style: Ability to work independently and as part of a team. Ability to work under pressure with tight deadlines. Ability to work on multiple projects simultaneously. Must be detail oriented. </div><div>• Computer Skills: Strong MS Office Suite knowledge and usage. Ability to learn internal company systems and applications.</div><div>• Business Acumen: Intermediate understanding of company financial measures. Must have an intermediate understanding of telecommunications industry and sales cycles.</div>\nMinimum Requirements:College degree in Engineering or a related field and 3-5 years professional level experience; or 7 years professional level related Engineering/Technical experience; or an equivalent combination of education and professional level related Engineering/Technical experience required."}