{"job title": "Data Scientist, Junior", "company": "Booz Allen Hamilton Inc.", "city state": "– Rockville, MD", "rating": "3.7", "job description": "<strong>Job Number: R0035071</strong>\n<br><br>\nData Scientist, Junior<br><br>Key Role:\n<br><br>\nLeverage technical and analytical expertise to explore and examine data from multiple disparate sources with the goal of discovering patterns and previously hidden insights, which in turn can provide a competitive advantage or address a pressing business problem. Use expertise in computer science, software development, and the latest technologies to design and implement analysis infrastructure and tools, analytic workflow processes, and complex data visualizations. Leverage knowledge of mathematical and statistical concepts, computer science, and domain expertise to bridge the gap between technologists and mathematicians, ensuring software solutions meet analytic requirements.\n<br><br>\nBasic Qualifications:\n<br><br>\n-Experience with machine learning, data mining, statistics, or graph algorithms in an academic environment or internship\n<br><br>\n-Experience with using R, Perl, Python, SAS, or SPSS for analysis of data\n<br><br>\n-Knowledge of an object-oriented language, including Java, C++, C#, or Python\n<br><br>\n-Knowledge of Hadoop, MapReduce, or HDFS\n<br><br>\n-Ability to obtain a security clearance\n<br><br>\n-Scheduled to obtain a BS degree in Winter 2018 or Spring 2019\n<br><br>\nAdditional Qualifications:\n<br><br>\n-Pursuing a BS degree in CS, Computer Engineering, Systems Engineering, or a related field preferred; pursuing an MS degree in CS, Computer Engineering, Systems Engineering, or a related field a plus\n<br><br>\nClearance:\n<br><br>\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information.\n<br><br>\nWere an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change."}