{"job title": "Senior Data Scientist", "company": "Coherent", "city state": "– CA-Richmond", "rating": "3.7", "job description": "<div>\n<div>\n<div>\n<div>Job Description and Responsibilities:\n<br><br>\nThe Coherent Integrated Optical Systems business unit is a precision optics and optical assemblies design and manufacturing group, which specializes in high-precision aspheres for applications including semiconductor and flat-panel display manufacturing, ground and space-based telescopes, defense systems and other exotic scientific and government-sponsored programs. The business encompasses the Tinsley Custom Optics product line, and is located in Richmond, CA.\n<br><br>\nWe are seeking a data scientist to assist us in executing the most demanding technical projects in aspheric systems manufacturing and development. State of art algorithms are needed for a wide range of challenges in aspherical optical metrology, surface data processing, and testing methods development. We anticipate the individual contributing amongst the following areas.\n<ul>\n<li>Develop and program data processing algorithms and measurement algorithms, to support optical component and systems fabrication and characterization.</li><li>Develop and program novel machine control algorithms.</li><li>Analyze process and metrology data.</li></ul></div><br>\n\n <div>Education and Work Experience:\n<ul>\n<li>MS or PhD (preferred) in physics, optical engineering, or applied mathematics.</li><li>Demonstrated ability to concept and implement novel data processing algorithms.</li><li>Working knowledge of C++ and Matlab.</li><li>Experience with optical systems specifications and characterization methods.</li><li>Experience with Code V and/or Zemax is desirable.</li></ul></div>\n</div>\n<br>We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.</div>\n</div>\n\n<br>"}