{"job title": "Research Scientist (Toxicologist)", "company": "Colgate-Palmolive", "city state": "– Piscataway, NJ", "rating": "3.9", "job description": "Colgate-Palmolive is a leading global consumer products company, tightly focused on Oral Care, Personal Care, Home Care and Pet Nutrition. Colgate sells its products in over 200 countries and territories around the world under such internationally recognized brand names as Colgate, Palmolive, Speed Stick, Lady Speed Stick, Softsoap, Irish Spring, Protex, Sorriso, Kolynos, elmex, Tom’s of Maine, Sanex, Ajax, Axion, Fabuloso, Soupline and Suavitel, as well as Hill’s Science Diet, Hill’s Prescription Diet and Hill’s Ideal Balance.\n<br><br>\nFor more information about Colgate’s global business, visit the Company’s web site at http://www.colgatepalmolive.com. To learn more about Colgate Bright Smiles, Bright Futures® oral health education program, please visit http://www.colgatebsbf.com. To learn more about Hill's and the Hill’s Food, Shelter &amp; Love program please visit hillspet.com. To learn more about Tom’s of Maine please visit http://www.tomsofmaine.com.\n<br><br>\nLocation: Piscataway, New Jersey, United States\n<br>\nRelocation Assistance Offered Within Country\n<br>\n#&nbsp;67933\n<br><br>\nColgatePalmolive invites applications for the (Senior) Research Scientist (Toxicologist) position based at our Piscataway, NJ location.\n<br><br>\n&nbsp;\n<br><br>\nThe responsibilities of this role will be to provide technical expertise in safety assessments for ingredients, formulas and packaging and will develop strategies to complete special projects. In addition, this position will work closely with internal entities such as the Product Development, Legal and Regulatory departments as well as external groups including subsidiaries, trade associations and governmental agencies to ensure product safety.\n<br><br>\n&nbsp;\n<br><br>\nSuccessful candidates will demonstrate a broad knowledge of toxicology and its application to ingredient safety assessments and provide safety clearance reviews for:\n<br><br>\n&nbsp;\n<br><br>\n1) formulas for national launch,\n<br><br>\n2) experimental formulas in the pilot plants and\n<br><br>\n3) human use protocols from a product safety perspective.\n<br><br>\n&nbsp;\n<br><br>\nSpecific responsibilities are as follows:\n<br><br>\n&nbsp;\n<ul>\n<li>Conduct safety assessments of new raw materials used in Colgate's formulas including, assessment of the scientific literature, evaluation of the toxicological database, determination of the appropriate toxicological endpoints, exposure assessments, and written documentation.</li><li>Prepare Product Safety Reports for Colgate's Finished Products.</li><li>Communication of Product Safety positions to key internal customers, including, Product Development, Consumer Affairs, Legal Department, Government Affairs, and Regulatory Affairs.</li><li>Representation of Colgate's key business interests on trade association task forces.</li><li>Respond to regulatory inquiries as requested by the legal authorities in the local countries in which Colgate has products in the market place.</li>\n</ul>\n&nbsp;\n<br><br>\nQualifications:\n<br><br>\n&nbsp;\n<ul>\n<li>Doctorate Degree in Toxicology, Pharmacology, or related discipline required</li><li>0-4 years of toxicology experience required</li><li>Strong computer skills (Microsoft Office) required</li><li>Strong project management skills required</li><li>Strong communication skills both written and verbal required</li><li>Strong math skills for the preparation of risk assessments required</li>\n</ul>\n&nbsp;\n<br><br>\nAre you interested in working for Colgate-Palmolive? You can apply to work with us using this online application. Attach all relevant documents such as a cover letter and resume or CV. Applications received by e-mail are not considered in the selection process.\n<br><br>\nBecome part of our team. We look forward to your application.\n<br><br>\nEqual Opportunity Employer\n<br>\nColgate is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, ethnicity, age, disability, veteran status, marital status, or any other characteristic protected by law."}