{"job title": "Machine Learning | Data Scientist", "company": "Gradient.io", "city state": "– Seattle, WA", "rating": "NA", "job description": "Want to define the next generation of ML to transform how brands can grow through ecommerce? Gradient is building a revolutionizing ML platform that accelerates sales and improves profitability of brands ecommerce channels.\n<br><br>\nGradient is building machine-learning technology to help brands maximize their digital shelf presence and sales. Point-of-purchase marketing represents a multi-hundred-billion dollar industry that is just moving into digital. Gradient is positioned to help Brands thrive in ecommerce by having access to tools and insights that drive better purchase outcomes for their products.\n<br><br>\nGradient seeks a Machine Learning/Data Scientist to drive fast-paced research and development projects while working closely with the CTO and CEO/founder, and engineers in a start-up environment. The candidate will be responsible for applying both analytic, numerical, ML and AI methods to improve ecommerce performance, optimize sales and enhance ecommerce and sales system efficiency for clients in multiple verticals.\n<br><br>\nThe successful candidate will demonstrate the ability to think creatively and to operate within a flexible, rapid development program dedicated to expanding Gradient’s platform to transform ecommerce marketing, sales and profitability.\n<br><br>\n<strong>Responsibilities</strong>\n<ul>\n <li>Collaborate across business teams</li></ul> \n\n<ul>\n <li>Understand business needs and apply Data Science, Artificial Intelligence (AI), Machine Learning (ML), Machine Vision (MV) technology and methods to architect and apply to an ecommerce marketing platform</li></ul> \n\n<ul>\n <li>Build and optimize models using Data Science, Artificial Intelligence, Machine Learning, including method selection to apply to engineering challenges</li></ul> \n\n<ul>\n <li>Improve rapid marketing optimization strategies for ecommerce</li></ul> \n\n<ul>\n <li>Develop algorithms for optimal exploitation of a marketing initiatives for next-generation ecommerce channels</li></ul> \n\n<ul>\n <li>Be a thought leader for the company to provide technical guidance in the above areas for experiments and projects</li>\n</ul>\n<strong>Requirements</strong>\n<ul>\n <li>At least MSc. (PhD preferred) degree in Math, Applied Maths, Electrical Engineering, Computer Science, or related field</li> <li>Experience leveraging Software Development and Machine Learning</li> <li>3+ years in Advanced Analytics (AI, Graph Theory, Numerical Analysis, etc.)</li> <li>Strong mathematical background</li> <li>Strong software skills in Python &amp; its numeric/scientific computation libraries (or an equivalent) &amp; query languages like SQL or derivatives used for other datastores (e.g. HiveQL, Bigquery, etc.)</li> <li>Experience using complex data structures and algorithms</li> <li>Experience with implementation of optimization strategies</li> <li>Experience applying machine learning and computational math to topics such as ecommerce, sales and marketing</li>\n</ul>\n<strong>Preferred Qualifications</strong>\n<ul>\n <li>PhD degree in Computer Science, Computer Engineering, Electrical Engineering, or related field</li> <li>Excellent communication and management skill.</li>  <li>Can lead a team towards execution on a product vision</li> <li>Experience evaluating and making decisions around the use of new or existing tools for a project</li> <li>Ready and able to coordinate with cross-disciplinary teams throughout all phases of development</li> <li>Ability to make the right trade-offs between schedule, resources and scope in order to deliver on a project</li>\n</ul>\n<strong>Benefits</strong>\n<ul>\n <li>Competitive Base Salary</li> <li>Equity Stake</li> <li>Competitive benefits</li>\n</ul>"}