{"job title": "Data Scientist", "company": "Precision Solutions", "city state": "– Reston, VA", "rating": "3.6", "job description": "<strong>Location</strong>: Reston, VA\n<br><br>\n<strong>Clearance</strong>: Active TS/SCI\n<br><br>\nWe have an opportunity for you to use your leadership and analytical skills to improve the military operations community. You’ll work closely with your customer to understand their questions and needs, and then dig into their data-rich environment to find the pieces of their information puzzle. You’ll mentor teammates, develop algorithms, write scripts, build predictive analytics, use automation, apply machine learning, and use the right combination of tools and frameworks to turn that set of disparate data points into objective answers to help our military leaders make informed decisions. You’ll provide your customer with a deep understanding of their data, what it all means, and how they can use it. As a technical leader, you’ll identify new opportunities to use data science solutions to help your customers meet their toughest challenges. Join us as we use data science for good in support of operations.\n<ul>\n<li>2+ years of experience as a developer of Java, Python, R, or other high-level languages</li><li>2+ years of experience with designing novel data analytic methods and workflows, including full data pipelines from raw data through analysis results</li><li>2+ years of experience with managing disparate data sources with varying data structures of content, and preparing these for data science and machine learning applications</li><li>Experience in working with big data storage, processing, and computation, including one or more of Accumulo, Spark, Storm, Kafka, and MapReduce</li><li>Ability to both manage and manipulate large data sets, develop data science approaches, and manage data science tasks</li><li>Ability to leverage a wide variety of data science capabilities and languages</li><li>Ability to exhibit flexibility, initiative, and innovation when dealing with ambiguous and fast-paced situations</li><li>TS/SCI clearance</li><li>BA or BS degree</li>\n</ul>\n<strong>Nice If You Have:</strong>\n<ul>\n<li>Experience with developing Java applications, including Apache Spark applications in Java</li><li>Experience with using UNIX or Linux systems, including command-line operation</li><li>Experience with statistical modeling and rigorous statistical inference</li><li>Experience with machine learning algorithm development and application</li><li>Experience in Natural Language Processing or machine learning techniques for processing and analysis of unstructured text</li><li>Experience with professional software development practices, including DevOps and Agile development</li><li>Experience with intelligence or operations analysis in the DoD or intelligence community</li><li>Security+ or CISSP and DoD 8570 Compliance Certifications</li>\n</ul>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}