{"job title": "Lead Data Scientist - Data Science Optimization", "company": "Target", "city state": "– Minneapolis, Minnesota", "rating": "3.4", "job description": "Description:<br><br>Join Targets Data Science and\n<br>\nOptimization team which is a multi-disciplinary team of people skilled in\n<br>\nstatistics, optimization, machine-learning, operations research, distributed\n<br>\nsystems, compilers, and functional programming. \n<br>\nThis is an exciting opportunity where you will:\n<br><br>\n1.\n<br>\nResearch techniques and prototype telemetry tools to detect\n<br>\nanomalies in supply chain performance and diagnose their root causes.\n<br><br>\n2.\n<br>\nEmbed with business teams and understand the supply chain\n<br>\nprocesses to inform the design of these telemetry tools.\n<br><br>\n3.\n<br>\nPartner with a multi-disciplinary team of technologists to develop\n<br>\nand implement these tools to work at scale.\n<br><br>\n4.\n<br>\nTest and learn to influence and drive the creation of new methods\n<br>\nand best practices in the use of statistical data modeling and machine learning\n<br>\ntechniques in a big data environment to build these telemetry tools for\n<br>\nTargets supply chain operations.\n<br><br>\nIt's a very large and interesting\n<br>\nproblem that we have fun thinking through and solving.We'd love to hear from you if you are interested\n<br>\nin the role that calls for a combination of statistical data analysis,\n<br>\nmathematical modelling, programming with Python/R and good software\n<br>\nengineering. Domain expertise in supply chain operations isnt necessary; we'll\n<br>\nhappily teach you that! We emphasize both learning and teaching within the\n<br>\ngroup, we're excited to teach you and to learn from you!\n<br><br>\n<strong>Why work with us at Target?</strong>\n<ul>\n<li><strong>We are a distributed team</strong>. Our company is based in Minneapolis, MN. Our team is\n<br>\n based in Minneapolis, MN and we have partner teams at Sunnyvale, CA and\n<br>\n Bangalore, India and many that work outside these areas.</li> <li><strong>We are using great tools!</strong> We write a lot of code using Python/R/Haskell/Scala\n<br>\n and are trying to push Nix into new directions. We get to be clients on Targets well-run\n<br>\n Kubernetes infrastructure.</li><li><strong>We love open source!</strong> Many\n<br>\n of our team members contribute to open source communities and get to do it\n<br>\n during work time. We try to contribute back to our communities where we can\n<br>\n and are grateful to be able to open source some of our own projects!</li><li><strong>We value diversity.</strong> We\n<br>\n believe that diversity and inclusion is of core importance when try to create\n<br>\n positive in-store experiences for our guests, and we think it is also\n<br>\n critically important when building our teams.</li> <li><strong>We value our team members.</strong> We treat our team members like people, not like\n<br>\n cogs in a machine. We value our team members for who they are, not just\n<br>\n what they can get done. We are parents, hobbyists, enthusiasts, family\n<br>\n members, and community members, and are able to offer flexibility to our\n<br>\n team members' schedules and work arrangements so that they can flourish\n<br>\n both inside and outside of work.</li>\n</ul>\n<strong>What we are looking for:</strong>\n<ul>\n<li>Evidence of strong data analysis and fundamental\n<br>\n statistical modeling skills</li><li>Experience using Python/R/SQL working in a data rich environment</li><li>A strong quantitatively oriented advanced degree with a\n<br>\n passion for empirical research and mathematical thinking</li><li>Very good client facing skills, excellent written and\n<br>\n verbal communication skills</li> <li>Interest in continuous learning across different\n<br>\n fields, especially statistics, optimization, econometrics, functional\n<br>\n programming, clean software engineering and of course supply chain\n<br>\n operations in omni-channel retailing!</li>\n</ul>\n\n<strong>Qualifications:</strong>"}