{"job title": "Scientist, Data Lead", "company": "Acosta, Inc.", "city state": "– Bentonville, Arkansas", "rating": "2.8", "job description": "<strong> Overview</strong>\n<br><br>\nThe Data Science Lead will join the Advanced Analytics team as a senior contributor and leader focused on creating transformational analytics-enabled capabilities across all of Acostas businesses. This can range from using statistical methods, data-mining and machine-learning techniques, or generating novel approaches uniquely suited the challenge. Datasets range in size but will also work with very large datasets regularly in this role.\n<br><br>\n<strong> The incumbent(s) in this position should exhibit the following ACOSTA values:</strong>\n\n<li><strong> People Minded</strong> Must show dignity and respect to all people</li>\n  \n<li><strong> Integrity</strong> Must exemplify the highest degree of ethical behavior</li>\n  \n<li><strong> Results Oriented</strong> Must show passion, pride and commitment to succeed</li>\n  \n<li><strong> Trust</strong> Must be honest, sincere and confident</li>\n  \n<li><strong> Teamwork</strong> Must build trusting relationships</li>\n  \n<li><strong> Innovation</strong> Must progress through a combination of creativity, common sense and vision</li>\n  \n<li><strong> Balance</strong> Must maintain an optimistic attitude and keep perspective on what is important in life</li>\n<strong> Responsibilities</strong>\n<br><br>\n<strong> Essential Functions of this Position:</strong>\n\n<li>Envision and develop analytical capabilities to serve diverse business use cases, in active collaboration with product management and technology counterparts</li>\n  \n<li>Mentor and coach junior team resources on both technical and non-technical competencies</li>\n  \n<li>Advanced competency in cross-functional, internal and external consulting, including discovery/structuring of business problems, and exploratory analysis of candidate methods to identify promising approaches for development</li>\n  \n<li>Creation and maintenance of solution documentation, including data transformation, models, and solution integration</li>\n  \n<li>Ownership and lifecycle management for analytics capabilities working in a production environment, including computational performance, accuracy/validity, and extension to new uses.</li>\n<strong> Qualifications</strong>\n<br><br>\n<strong> Minimum Education Requirements</strong> :\n\n<li>Bachelor of Arts and Science Degree preferred</li>\n  \n<li>4-year college degree in computer science, engineering, mathematics, statistics or related field, or equivalent experience. Masters degree in a quantitative field strongly preferred</li>\n<strong> Experience Requirement:</strong>\n\n<li>Ten years of experience with programming languages like Python (preferred), PySpark, R or SAS to write complex code and implement into a production environment. Must be able to develop independently and guide others within the development team.</li>\n  \n<li>Practical experience with development, tuning, and maintaining Machine Learning capabilities at scale.</li>\n  \n<li>Experience generating linear and/or logistic regression models. Must be able to generate complex analytic models on a large scale with no guidance. Must be able to guide others in the same.</li>\n  \n<li>Experience with Linear / Integer Programming and/or other optimization techniques. Must be able to generate complex solvable optimization models on a large scale with no guidance. Must be able to guide others in the same.</li>\n  \n<li>Experience with data science in Microsoft Azure or cloud environments using Spark or alternative parallel computation capabilities highly desired.</li>\n  \n<li>CPG, sales and/or retail experience highly desired</li>\n<strong> Knowledge, Skill and Ability Requirements:</strong>\n\n<li>An understanding of different data sources, their proper uses, and their limitations. Must be able to identify data that is unclean and/or misapplied and must be able to recommend the proper methodology to fix any issues.</li>\n  \n<li>Excellent written and verbal communication skills that allows story telling. Must be able to clearly speak English and must be able to communicate very technical procedures to a non-technical audience.</li>\n  \n<li>Strong analytical and problem-solving skills with the ability to collect, organize, analyze, and disseminate significant amounts of information residing in large datasets.</li>\n  \n<li>Ability to consult across various business functions to explain analytic functions and how they can be used to drive a business.</li>\n  \n<li>Intellectual curiosity is critical</li>"}