{"job title": "Data Scientist - Amazon Business Payments", "company": "Amazon", "city state": "– US, WA, Seattle", "rating": "3.8", "job description": "Looking for a career at a company that seeks to be Earths most customer-centric company? If so, meet Amazon.\n<br><br>\nOver the past 20 years, Amazon has reinvented on behalf of the consumer and has become the largest internet retailer and marketplace in the world with over $100 billion in revenue globally. Through our entrepreneurial and innovative culture, Amazon has also developed new technologies and products (like our Kindle e-readers and tablets) and, enterprise services (like Amazon Web Services). Amazon is now reinventing on behalf of the business customer and focused on building the largest and most innovative Business-to-Business (B2B) marketplace in the world, and we are recruiting to make this vision a reality within the Amazon Business Payments (ABP) Organization, to make the customers procure to pay experience delightful.\n<br><br>\nThe Role\n<br>\nAre you passionate about leveraging data to deliver actionable insights that impacts the daily business decisions at Amazon? Does the prospect of dealing with massive volumes of data excite you? Do you like getting \"scrappy\" with data to answer challenging product and customer behavior questions?\n<br><br>\nABP is seeking an outstanding Data Scientist/Statistician who will help to build the next generation of credit products by leveraging the power of data. You will generate critical insights to set the strategic direction for product features &amp; processes that will delight our customers.\n<br><br>\nOur ideal candidate thrives in a fast-paced environment, relishes working with large transactional volumes and big data, enjoys the challenge of highly complex business contexts (that are typically being defined in real-time), and, above all else, is a passionate about data and analytics. In this role you will be expected to work with business leaders to understand the problems they need to solve and design the appropriate solution. You will need to collect new data in order to produce 360 degree views of our customers, analyze the results, form strategic opinions, and then publish the data out to all interested teams. Often times, the ideal set of data will not be available and you'll have to think creatively about what is available in order to drive results.\n<br><br>\n<strong>Responsibilities</strong>\n<br>\nYou will help create our data assets, then conduct the necessary and often statistical analysis necessary to derive insights that are critical to business success. You will be responsible for researching insights as well as educating the business, product, marketing, and business development teams on the implementation of those insights to enable data-driven, day-to-day decision making. You will partner with our marketing, product management, global engineering, operations and Finance teams to:\n<br>\n· Contribute to the development and enhancement of business credit products and features.\n<br>\n· Analyze and solve problems at their root, stepping back to understand the broader context.\n<br>\n· Learn and understand a broad range of Amazons data resources and know when, how, and which to use and which not to use.\n<br>\n· Interface with all internal related and ancillary teams to deliver data and analytics as requested.\n<br>\n· Report results in a manner which is both statistically rigorous and compellingly relevant.\n<br>\n· Provide statistical support on experimental design, exploratory data analysis, modeling, and data management using both standard and non-standard methods.\n<br>\n· Triage many possible courses of action in a high-ambiguity environment, making use of both quantitative analysis and business judgment.\n<br><br>"}