{"job title": "Remote Sensing Data Scientist (PhD)", "company": "DuPont", "city state": "– Hayward, CA", "rating": "3.5", "job description": "<ul>\n<li>*Remote Sensing Data Scientist (PhD) (Job Number: 193679W-01)**</li>\n<li>*Description**</li>\n</ul>\n\nCorteva Agriscience?, Agriculture Division of DowDuPont? is\n<br>\nseeking a Remote Sensing Data Scientist to join our global Data Science and\n<br>\nInformatics group working on predictive analytics for digital agriculture. If\n<br>\nyou are interested in analyzing one of the largest collections of farm data; optimizing\n<br>\nmanagement practices for one of the largest farming operations; or developing analytical\n<br>\nsolutions that will enable next generation of genetics/crop-protection/farm-management-practices\n<br>\nfor millions of farm-acres across the globe, our opening for Remote Sensing\n<br>\nData Scientist is your opportunity.\n<br><br>\nAt Corteva Agriscience?, you?ll become part\n<br>\nof an interdisciplinary, global work environment in which you will operate as a science leader who will encourage\n<br>\nand promote disruptive advances by applying state-of-the-art methods in remote\n<br>\nsensing, data science and artificial intelligence to mine critical problems\n<br>\nspanning multiple segments of the organization. Your strong and extensive\n<br>\nbackground in remote sensing fundamentals, machine/deep learning, statistics\n<br>\nand optimization will enable you to gain insights from a wide array of structured\n<br>\nand unstructured datasets consisting of global-scale spatio-temporal sources (farm-equipment,\n<br>\nUAV, satellite, weather, soils etc.), proximal sensors and IoT streams. This is a critical position with strategic impact on our\n<br>\nbusiness and you will play a major role by driving innovation in agriculture\n<br>\ntechnology.\n<br><br>\nWorking closely with data\n<br>\nscientists, data engineers, researchers and business collaborators across the\n<br>\norganization, you will develop and deploy sophisticated end-to-end solutions on\n<br>\na wide range of problems in digital agriculture. This will require excellent\n<br>\ninterpersonal communication skills and an aptitude for building networks,\n<br>\nwithin and outside the company.\n\n\n<ul>\n<li>*Qualifications**</li>\n</ul>\n\n+ PhD or similar qualification in a quantitativedata science discipline\n<br><br>\n+ 3+ years of work experience post-PhD\n<br><br>\n+ Strongunderstanding of remote sensing fundamentals, geophysics, computationallearning theory, statistical methods &amp; optimization.\n<br><br>\n+ Experiencein the evaluating and optimizing machine-learning algorithms and/orprocess-based models, towards understating crop-physiology, crop-productivity &amp;environment-characteristics at scale.\n<br><br>\n+ Experiencein dealing with large scale spatio-temporal data (satellites, weather,sensor-networks etc.), preferably on a cloud or high-performance computingenvironment.\n<br><br>\n+ Expert programmingskills in Python, R and C/C++ with the ability to quickly createprototypesolutions on Unix / Linux / Cloud platforms using open source tooling andlibraries as necessary.\n<br><br>\n+ Experiencewith deploying prototype solutions on Google Earth Engine will be preferred.\n<br><br>\n+ Excellentinterpersonal, verbal and communication skills and a can-do attitude with theability to thrive in a fast-paced dynamic environment.\n<br><br>\n+ Excellentanalytical and problem-solving skills with the ability to work as part of aglobal team and, at times, independently while appropriately prioritizing tasks.\n<br><br>\nWe\n<br>\nare excited to announce that Corteva Agriscience? is the name of the\n<br>\nnew Agriculture Division of DowDuPont?. We are bringing together DuPont\n<br>\nCrop Protection, DuPont Pioneer and DowAgroSciences to create a\n<br>\nmarket-shaping, standalone agriculture company with leading positions in seed\n<br>\ntechnologies, crop protection and digital agriculture. We will work across the\n<br>\nglobal agriculture value chain to create a more efficient food system.\n<br><br>\nAt Corteva Agriscience?, we seek to\n<br>\nenrich the lives of those who produce and those who consume. This means we will\n<br>\nhelp rejuvenate the agricultural ecosystem to support people and the planet and\n<br>\nto ensure progress for generations to come.\n\n\n<ul>\n<li>*Primary Location:** _NA-United States-California-Hayward_</li>\n<li>*Organization:** _Pioneer_</li>\n<li>*Schedule:** _Full-time_</li>\n<li>*Education Level:** _Doctorate Degree (over 19 years)_</li>\n<li>*Employee Status:** _Regular_</li>\n<li>*Job Type:** _Experienced_</li>\n</ul>\n\nDuPont is an equal opportunity employer. Qualified applicants will be considered without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability or any other protected class. If you need a reasonable accommodation to search or apply for a position, please visit our Accessibility Page for Contact Information. For US Applicants: See the ?Equal Employment Opportunity is the Law? poster."}