{"job title": "Data Scientist - Pharmacy Shared Services", "company": "Highmark Health", "city state": "– Pittsburgh, PA", "rating": "2.9", "job description": "<ul>\n<li>*Description**</li>\n<li>*General Overview:**</li>\n</ul>\n\nThe Data Scientist ? Pharmacy Shared Services builds new analytical solutions by matrixing with business partners to inform and support Pharmacy strategies and operations. The incumbent will learn business needs and processes around Pharmacy, Specialty Pharmacy and Pharmacy Benefits Management to help develop, lead and inform the creation and implementation of analytic tools andtechniques. The incumbent will also draw on tools and methods from statistics and machine learning to perform analysis, create predictive models, visualize data, and drive projects through to delivery of the intended outcome.\n<br><br>\nThe Data Scientist is a data-driven thought leader and problem solver who continually interfaces between the Pharmacy and Enterprise-wide Analytics teams for bi-directional translation of business problems and analytic requirements. The incumbent will understand and utilize Pharmacy?s strategies, goals and processes to answer critical business questions by leveraging and synthesizing the large volume and variety of data available to them.\n\n\n<ul>\n<li>*Essential Job Functions:**</li>\n</ul>\n\n+ Work directly with the business to understand their questions, business processes, programs and/ or initiatives, then identifying how analytical solutions could help deliver value for them (e.g., more effective and/ or efficient processes). This would include being accountable for, outlining new use cases, creating high level impact estimates, and identifying the necessary data elements (including proxies) to deliver the analytical solution to complex business problems. Assemble data sets using knowledge of where the required data exists within the Organization's source data system, derived production sets or publicly available sources. Includes securing appropriate access and documenting objectives, assumptions and processes.\n<br><br>\n+ Select and apply the appropriate advanced modeling/machine learning techniques to these data sets to deliver business insight, ensuring that the final analysis is well researched, accurate, and documented. This requires technical flexibility, in-depth knowledge and delivery of advanced analytical approaches, for example regression models, tree-based learning, neural networks, clustering techniques, natural language processing.\n<br><br>\n+ Consult with the business to contextualize and translate the results of our analysis in a form which the business can understand and take action on. This will be include written reports, presentation and data visualizations, and draws clear lines between the high-level problem specifications, the analyses performed, and how the results link directly back to business objectives. It requires the incumbent to demonstrate their depth of understanding of many areas of the business, the data and the analytical methods through ongoing engagement with a range of audiences.\n<br><br>\n+ Plan, prepare and deliver/coordinate all elements of the analysis in such a way that it is delivered on time, to a high standard and ready to implement on a production basis (including dissemination through the Organization's user systems). This includes identifying the best route to implementation (developing the analytical solution accordingly).\n<br><br>\n+ Research self- directed new analytical skills and approaches, building relationships internally and externally to transfer knowledge and maintain their position as subject matter experts, consult with follow data scientists and analysts to guide analysis and deliver larger projects.\n<br><br>\n+ Other duties as assigned.\n\n\n<ul>\n<li>*Minimum Qualifications:**</li>\n</ul>\n\n+ Master's Degree in Analytics, Mathematics, Physics, Computer and Information Science or Engineering\n<br><br>\n+ 3 - 5 years in Data Analytics\n<br><br>\n+ 3 - 5 years using Large Datasets\n<br><br>\n+ 3 - 5 years utilizing Statistical Software\n<br><br>\n+ 3 - 5 years in Data Visualization\n<br><br>\n+ 3 - 5 years in Predictive Modeling\n<br><br>\n+ 1 - 3 years in Research and Development\n<br><br>\n+ 1 - 3 years in a Business Analyst role\n<br><br>\n+ 1 - 3 years in Consulting\n\n\n<ul>\n<li>*Preferred Qualifications:**</li>\n</ul>\n\n+ Doctorate degree in Analytics, Mathematics, Physics, Computer and Information Science, or Engineering\n<br><br>\n+ 1 - 3 years working with healthcare (Pharmacy experience highly desired)\n\n\n<ul>\n<li>*Knowledge, Skills &amp; Abilities:**</li>\n</ul>\n\n+ Python and/or R\n<br><br>\n+ Experience using Visual Basic\n<br><br>\n+ Experience with version control systems, such as Gitlab/Github\n<br><br>\n+ Comfortable with using unix/linux servers and basic terminal experience\n<br><br>\n+ Experience with Spark and big data querying tools, such as Hive\n<br><br>\n+ Experience cleaning and transforming data\n<br><br>\n+ Experience with data and feature selection\n<br><br>\n+ Experience with Data Visualization and Dashboard tools such as Tableau, Spotfire, Qlikview, ggplot, Shiny\n<br><br>\n<strong>+ SAS</strong>\n<br><br>\n<strong>+ SQL</strong>\n<br><br>\n+ Collaborative Problem Solving\n<br><br>\n+ Analytical and Logical Reasoning/Thinking\n<br><br>\n+ Analysis of business problems/needs\n<br><br>\n+ Written &amp; Oral Presentation Skills\n\n\n<ul>\n<li>*Referral Award Payout Level: 2**</li>\n</ul>\n\n<strong>REQNUMBER: J128815</strong>\n<br><br>\nEqual Opportunity Employer Minorities/Women/ProtectedVeterans/Disabled/Sexual Orientation/Gender Identity"}