{"job title": "Senior Data Scientist - (R&amp;D)", "company": "Highmark Health", "city state": "– Pittsburgh, PA", "rating": "2.9", "job description": "<ul>\n<li>*Description**</li>\n<li>*General Overview:**</li>\n</ul>\n\nThe Senior Data Scientist (R&amp;D) contributes to scientific research projects, peer-reviewed publications and internal R&amp;D projects at the heart of our Data Science/AI capabilities. The incumbent designs, executes and synthesizes analytic projects to support scientific research questions, business programs and initiatives. The incumbent is a data-driven problem solver who understands healthcare and utilizes diverse resources to answer critical questions by leveraging and synthesizing the large volume and variety of data available to them.Draws on tools and methods from statistics and machine learning to perform analysis, create predictive models, visualize data, and drive projects through to delivery of the intended outcome.The incumbent is a scientist committed to performing high quality scientific research and contributing to the understanding and improvement of healthcare. Continuously scans and tests new data sources, tools, and analytical techniques and partners with leading institutions and experts to contribute to published research and our portfolio of next-generation analytic projects.\n\n\n<ul>\n<li>*Essential Job Functions** **:**</li>\n</ul>\n\n+ Work directly with the business to understand their questions, business processes, programs and/ or initiatives, then identify how analytical solutions could help deliver value for them (e.g., more effective and/ or efficient processes). This includes leading on and being accountable for, outlining new use cases, creating high level impact estimates, and identifying the necessary data elements (including proxies) to deliver the analytical solution to highly complex business problems. Assemble that data set using knowledge of where the required data exist within the Organization's source data system, derived production sets or publicly available sources. Includes securing and overseeing appropriate access and documenting objectives, assumptions and processes.\n<br><br>\n+ Select and apply the appropriate advanced modeling/machine learning techniques to these data-sets to deliver business insight, ensuring that the final analysis is well researched, accurate, and documented. This requires technical flexibility and substantial expertise in, and delivery of, analytical approaches, including regression models, tree-based learning, neural networks, clustering techniques, natural language processing.\n<br><br>\n+ Consult with the business to contextualize and translate the results of our analysis in a form which the business can understand and take action on. This will include leading written reports, presentations and data visualizations, and draws clear lines between the high-level problem specifications, the analyses performed, and how the results link directly back to business objectives for highly complex business problems. It requires the incumbent to demonstrate their depth of understanding of all areas of the business, the data and the analytical methods through ongoing engagement with a range of audiences.\n<br><br>\n+ Plan, prepare and deliver, coordinating all elements of the analysis of highly complex business problems in such a way that it is delivered on time, to a high standard and ready to implemented on a production basis (including dissemination through the Organization's user systems). This includes identifying the best route to implementation (developing the analytical solution accordingly) and coordinating fellow data scientists and analysts to deliver larger projects.\n<br><br>\n+ Self-directed researching new analytical skills and approaches, building relationships internally and externally to transfer knowledge and maintain their position as subject matter experts (including a significant external profile such as presenting at / coordinating external events or publication in professional journals), coordinating fellow data scientists and analysts to guide analysis and deliver larger projects.\n<br><br>\n+ Other duties as assigned.\n\n\n<ul>\n<li>*Minimum Qualifications:**</li>\n</ul>\n\n+ Master's degree in Analytics, Mathematics, Physics, Computer and Information Science, or Engineering\n<br><br>\n+ 5 - 10 years in Data Analytics\n<br><br>\n+ 5 - 7 years utilizing Statistical Software\n<br><br>\n+ 5 - 7 years in Large Datasets\n<br><br>\n+ 5 - 7 years in Data Visualization\n<br><br>\n+ 3 - 5 years in Predictive Modeling\n<br><br>\n+ 1 - 3 years in a Business Analyst role\n<br><br>\n+ 1 - 3 years in Consulting\n<br><br>\n+ 1 - 3 years in Research and Development\n\n\n<ul>\n<li>*Preferred Qualifications:**</li>\n</ul>\n\n+ 3 - 5 years in the Healthcare Industry\n<br><br>\n+ 3-5 years of experience leading Human Subjects Research projects\n<br><br>\n+ Multiple peer-reviewed publications in high impact factor journals\n\n\n<ul>\n<li>*Knowledge, Skills &amp; Abilities:**</li>\n</ul>\n\n+ Analysis of business problems/needs\n<br><br>\n+ Analytical and Logical Reasoning/Thinking\n<br><br>\n+ Collaborative Problem Solving\n<br><br>\n+ Statistical Analysis\n<br><br>\n+ Written &amp; Oral Presentation Skills\n<br><br>\n+ SAS, R, Python, SPSS or related\n\n\n<ul>\n<li>*Referral Bonus Level: 3**</li>\n</ul>\n\n<strong>REQNUMBER: J129093</strong>\n<br><br>\nEqual Opportunity Employer Minorities/Women/ProtectedVeterans/Disabled/Sexual Orientation/Gender Identity"}