{"job title": "Research Analyst - Data Scientist", "company": "Institute for Defense Analyses", "city state": "– Alexandria, VA", "rating": "3.8", "job description": "<div><div><strong>\n<br>\nResearch Analyst - Data Scientist</strong><br>\n\n<div>\n<div>\nDepartment\n<br><br>\n<strong>\n<br>\nCost Analysis &amp; Research Division</strong>\n</div><br>\n\n<div>\nLocation\n<br><br>\n<strong>\n<br>\nAlexandria, VA</strong>\n</div><br>\n\n<div>\nClosing Date\n<br><br>\n<strong>9/9/18</strong>\n</div>\n</div>\n</div>\n\n<br>Apply Now</div><br>\n\n<div><u>Overview</u>\n<br><br>\nThe Institute for Defense Analyses (IDA) is a Federally-Funded Research and Development Center supporting the Department of Defense (DoD) and other federal agencies. IDA takes great pride in the high caliber and timeliness of its analyses, which are produced in an atmosphere that encourages collaboration, independent thinking, and objective results.\n<br><br>\nThe Cost Analysis and Research Division (CARD) at IDA engages in both traditional cost analysis and applied research on a broad range of topics involving resource allocation, forecasting, econometrics, and systems modeling. CARD researchers perform a wide variety of quantitative analyses that clearly illuminate the resource and outcome consequences of government decisions, policies, and actions. As studies often require a multi-disciplinary approach, CARD maintains a highly educated and diverse research staff with advanced degrees in many quantitative fields, including various branches of engineering, operations research, statistics, economics, mathematics, physics, and natural sciences.\n<br><br>\n<u>Responsibilities</u>\n<br><br>\nThe Institute for Defense Analyses (IDA) seeks a data scientist with expertise in machine learning and predictive analytics to join the Research Staff of the Cost Analysis and Research Division (CARD). The Data Scientist will apply modern data analytics techniques in support of CARD projects and analyses. Analytical tasks will include data characterization, clustering, statistical inference, simulation, data mining, forecasting, text analysis, and feature extraction in diverse data sets. The Data Scientist will also be expected to interact with study sponsors, summarize findings for nontechnical audiences, and write reports and present briefings in a clear and concise manner suitable for senior DoD policy makers.\n<br><br>\n<u>Qualifications</u>\n\n<ul>\n<li>A PhD in a quantitative or qualitative program; OR, an MS in a quantitative or qualitative program coupled with 8+ years of relevant experience is required.</li>\n\n<li>Experience in machine learning and predictive analytics is required.</li>\n\n<li>Demonstrated strong communications skills are required</li>\n\n<li>Knowledge of multiple programming languages (e.g., R, Python) is preferred</li>\n\n<li>Training in statistics, simulation, deep learning, text analytics is desired</li>\n\n<li>Experience working with large data sets is preferred</li>\n\n<li>Practical experience with data collection, data normalization, and data visualization is preferred.</li>\n\n<li>Must have the ability to work effectively both independently and collaboratively</li>\n</ul>\n\n<div>\n<div>\n<div>\n\n\n<ul>\n<li>U.S. Citizenship is required</li></ul>\n\n\n<ul>\n<li>Ability to obtain and maintain a security clearance is required</li>\n</ul>\n\n</div>\n</div>\n</div>\n</div>"}