{"job title": "Sr. Data Scientist", "company": "Modiant LLC", "city state": "– Houston, TX", "rating": "NA", "job description": "Modiant, one of Houstons most exciting startups, is seeking energetic, ambitious software engineers and data scientists to develop next-generation transportation management and sports analytics software supporting Crane Capital Group, Inc., the Houston Astros owner Jim Cranes family of companies. The Data Scientist will join Modiant as an integral team member creating a next-generation data science and data visualization product in partnership with a Houston based world championship sports franchise.\n<br><br>\nThe Data Scientist will apply machine learning and data mining techniques, perform statistical analysis, and build high-quality prediction systems to help make smarter decisions and even better products.\n<br><br>\n<strong>PLEASE NOTE</strong>\n\n<ul>\n<li>Modiant will not sponsor applicants for work visas.</li>\n<li>No relocation assistance will be offered.</li>\n</ul>\n<strong>CORE DUTIES AND RESPONSIBILITIES</strong>\n\n<ul>\n<li>Selecting features, building and optimizing various models using state-of-the-art machine learning techniques</li>\n<li>Data mining for domain insights using cutting-edge methods</li>\n<li>Extending companys data with third-party sources of information when needed</li>\n<li>Enhancing data collection procedures to include information that is relevant for building analytic systems</li>\n<li>Processing, cleansing, and verifying the integrity of data used for analysis</li>\n<li>Doing ad-hoc analysis and presenting results in a clear manner</li>\n<li>Communicate status on current data science to team members daily</li>\n<li>Present final findings to team members and stakeholders monthly</li>\n</ul>\n<strong>SKILLS AND EXPERIENCE</strong>\n\n<ul>\n<li>The successful candidate will possess 3-5 years of practical Data Science experience. We appreciate Data Science is a broad discipline and can include many different tools, and are open to candidates with a broad range of experience across multiple tools and technologies.</li>\n<li>Candidates should possess very deep skills in the following key areas: \n\n\n<ul>\n<li>Machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision Forests, Deep Learning, etc.</li>\n<li>Common data science toolkits, such as Weka, Scikit-learn, NumPy, MatLab, Tensorflow, etc</li>\n<li>Data visualization tools, such as D3.js, GGplot, etc.</li>\n<li>Applied statistics skills, such as distributions, statistical testing, regression, etc.</li>\n</ul>\n\n</li>\n\n<strong></strong><li><strong>Education and Data Science Certification Requirements:</strong>\n\n\n<ul>\n<li>Bachelors degree or higher in Computer Science/ Engineering/MIS or any other similar discipline.</li>\n<li>DeepLearning.ai, Data Science Toolbox, etc.</li>\n</ul>\n\n</li>\n\n<strong></strong><li><strong>Other Technical Skills/Requirements:</strong>\n\n\n<ul>\n<li>3-5 years with query languages such as SQL, NOSQL, Hive, Pig, etc.</li> \n\n<li>1-2 years with NoSQL databases, such as MongoDB, Cassandra, HBase, BigQuery etc.</li>\n<li>1-2 years with scripting and programming skills in languages such as Python, R, Java, .NET, Spark, Scala etc. <em>Excellence in at least one of these is highly desirable.</em></li>\n</ul>\n\n</li>\n</ul>\n<strong>GENERAL QUALIFICATIONS</strong>\n\n<ul>\n<li>Strong written and verbal communication skills.</li>\n<li>Ability to communicate both intended process and results to non-technical team members.</li> \n\n<li>Familiarity with and ongoing capacity to learn new technologies and software as needed.</li> \n\n<li>Love of baseball is a plus, but not a requirement!</li>\n</ul>\n<strong>BENEFITS</strong> \n<br>\nModiant offers a generous benefits package including: competitive PTO plan, Health, Dental, and Vision Insurance, 401k plan with company match, employee discount program (including discounted Astros tickets!), and onsite fitness center."}