{"job title": "Research Scientist", "company": "NC State University", "city state": "– Raleigh, North Carolina", "rating": "4.7", "job description": "<div>\n<div>\n<div><strong>Classification Title:</strong></div><div>\nResearch Scientist</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Working Title:</strong></div><div>\nResearch Scientist</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Campus:</strong></div><div>\nNC State University</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Region:</strong></div><div>\nPiedmont/Triangle</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Job Summary:</strong></div><div>\nThe Center for Educational Informatics is seeking a Research Scientist to participate in research and development activities for projects investigating advanced learning technologies, intelligent user interfaces, and learning analytics. This position involves contributing to ongoing research programs and assisting with the development of new research programs. The ideal candidate will have excellent written communication skills and prior experience managing, developing, and improving software systems, as well as experience guiding junior researchers and developers. â?¢ Designs, develops, tests, maintains, and documents artificial intelligence-based software systems. â?¢ Participates in developing system architectures including hardware and software recommendations. â?¢ Works closely with target user populations to identify system requirements. â?¢ Performs detailed systems analysis to develop implementation strategies and scope projects appropriately. â?¢ Actively participates in project planning by creating project schedules as well as monitoring progress according to schedules and providing status reports. â?¢ Assists with collecting, inputting, editing, and analyzing quantitative and qualitative data. â?¢ Analyzes user behavior through qualitative and quantitative techniques using interaction log data, physiological data, behavioral data, and surveys/questionnaires. â?¢ Collaborates with staff and students on solving research problems. â?¢ Stays up-to-date on literature in advanced learning technologies and related areas. â?¢ Leads preparation of papers and reports describing the research. â?¢ Participates in fielding and deploying software at user sites, such as schools, museums, and after-school programs. â?¢ Gives demonstrations and presentations at meetings and conferences as needed. â?¢ Performs other related duties as assigned or requested.</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Minimum Qualifications:</strong></div><div>\nPh.D. degree in Computer Science or closely related field. Prior experience with research and development in educational software, serious games, and artificial intelligence-based software. Strong background in artificial intelligence and machine learning. Extensive programming expertise including experience with languages such as C#, Java, Python, and C++. If no applicants apply who meet the required competencies and education/experience requirements, then other applicants may be considered. Ability to quickly learn and follow established development processes and standards. Ability to take constructive criticism resulting from peer reviews, software testing, and client feedback. Strong written and oral communication skills required, including the ability to work collaboratively with a diverse team.</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Position Number:</strong></div><div>\n00103587</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Posting Date:</strong></div><div>\n08/06/2018</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<strong><div>Closing Date:</div></strong></div><strong>\n </strong></div><strong>\n\n<br></strong><br>\n\n<div>\n<div>\n<div><strong>American Recovery &amp; Reinvestment Act Funded:</strong></div><div>\nNo</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div>\nApply Now</div>\n</div>\n </div>\n\n<br>"}