{"job title": "Scientist", "company": "Rangam Consultants", "city state": "– Abbott Park, IL 60064", "rating": "4.1", "job description": "<div>\n<div>\nEmail\n<br>\n LinkedIn\n<br>\n Twitter\n<br>\n Facebook\n<br>\n Google+</div>\n </div>\n\n<br><strong>Job Description</strong><br><br><strong>Summary:</strong>\n\n<ul>\n<li><strong>Seeking a skilled molecular biologist to perform independent antibody, antigen, and enzyme engineering projects and provide technical support for immunoassay prototyping teams.</strong> </li>\n<li>The candidate must possess strong molecular biology, protein biochemistry and mammalian cell line development background and innovative thinking, as well as strong written and communication skills.</li> \n\n<li>Candidate must be familiar with current technologies in the scientific literature and conduct effective literature searches.</li> \n\n<li>A successful candidate will conduct advanced research on an antibody, antigen, and enzyme engineering, expression, purification, characterization and cell line development.</li> \n</ul>\n<strong>Main Responsibilities:</strong>\n\n<ul>\n<li>Position requires expertise in molecular biology and immunology to conceive, plan, design and conduct advanced independent protein engineering research.</li>\n<li>Design experiments and interpret results with a solid understanding of enzyme and binding kinetics.</li>\n<li>Design experiments, author protocols, and introduce new technologies. Investigate and develops new procedures.</li>\n<li>May act as project leader and provides technical direction and feedback to others. Interact s with other groups and shares information; Participates in team activities. Trains lower-level scientists.</li>\n<li>Submits ideas for inventions; publishes; innovates through patent filings and/or scientific publications</li>\n<li>Performs FTO's (Freedom to Operate).</li>\n</ul>\n<strong>Core Job Responsibilities:</strong>\n\n<ul>\n<li>Responsible for implementing and maintaining the effectiveness of the quality system.</li>\n<li><strong>Designs and conducts experiments, accomplishes established milestones and summarizes data, interprets, results and draws conclusions. Evaluates data using analytical methodologies to achieve results. Recommends options for future experiments</strong>.</li>\n<li>Presents scientific observations to others. Trains lower-level scientists.</li>\n<li>Expertise and Problem Solving: Identifies technical alternatives. Utilizes multiple analytical instruments. Anticipates, recognizes and resolves technical problems.</li>\n<li>Project Planning: Participates in project planning, updates and process improvements. Implements project plans comprehending resource, budget, facility and regulatory requirements.</li>\n<li>Translates top-level goals to specific project level goals for individual team member. Establishes and reviews complex plans for multiple projects or activities. Plans resource allocation and distribution.</li>\n<li>Scientific Leadership: Submits ideas for inventions; publishes; innovates through patent filings and/or scientific publications.</li>\n<li>Perform FTO's (Freedom to Operate).</li>\n<li>Economic Profitability: Provide direction to project team to meet economic profitability (EP) profile for the project (product cost analysis).</li>\n<li>Lab Safety: Participates in lab safety.</li>\n<li>Documentation: Appropriately documents experimental procedures and results according to established guidelines</li>\n</ul>\n<strong>Position Accountability / Scope:</strong>\n\n<ul>\n<li>Accountable across functional areas/programs within division. Contributes to project plan. Responsible for project completion.</li>\n</ul>\n<strong> Minimum Qualifications:</strong>\n\n<ul>\n<li>PhD. in Molecular Biology or Biochemistry with 2+ years research or industrial experience</li>\n<li>Or M.S. degree with research experience sufficient to demonstrate equivalency.</li>\n</ul>"}