{"job title": "Senior Data Scientist - Automatic Labs", "company": "Sirius XM Radio Inc.", "city state": "– San Francisco, CA", "rating": "3.3", "job description": "**Requisition ID**<br> <br>18-987<br> <br>**Job Title**<br> <br>Senior Data Scientist - Automatic Labs<br> <br>**Location**<br> <br>California<br> <br>**Schedule**<br> <br>Full-time<br> <br>**Type of Position**<br> <br>Regular<br> <br>**Job Description**<br> <br><br> <br>**Location: San Francisco, CA**<br> <br><br> <br><br><br> <br>**Position Summary:**<br> <br><br> <br><br><br> <br>The Automatic Connected Car platform is transforming the vehicle ownership ecosystem, from manufacturers, dealerships, insurance &amp; mechanics all the way to the teen driver who just got their learner's permit. We leverage rich telematics and location datasets, generated by our platform, to power data products for all these stakeholders, focused on driving safety, risk analysis, vehicle health, predictive maintenance, driver coaching and fuel efficiency.<br> <br><br> <br><br><br> <br>As a Senior Data Scientist, you have the opportunity to leverage this unique dataset and state-of-art machine learning infrastructure to turn your insights into new data products that propel the growth of our business. You will collaborate with a strong team of engineers, product managers and fellow data scientists to evaluate potential approaches, build features, algorithms, and determine metrics which are critical for machine learning models. We are a small data team and you will get to take on several responsibilities in the product journey, from the whiteboard all the way to efficient, production-quality code receiving live traffic.<br> <br><br> <br><br><br> <br>**Duties and Responsibilities:**<br> <br><br> <br><br><br> <br><br><br> <br>+ Build and iterate on machine learning models to predict and quantify driver risk, component failure etc.<br><br> <br>+ Conceptualize, design and build data products for Automatic's B2C and B2B customers.<br><br> <br>+ Ensure we are storing and filtering high-quality data.<br><br> <br>+ Inform and influence Automatic's product roadmap wrt. data products by identifying and prototyping new research and datasets.<br><br> <br><br> <br><br><br> <br>**Supervisory Responsibilities:**<br> <br><br> <br><br><br> <br><br><br> <br>+ None.<br><br> <br><br> <br><br><br> <br>**Minimum Qualifications:**<br> <br><br> <br><br><br> <br><br><br> <br>+ Master's in computer science, math, physics, engineering, statistics or other technical field or equivalent, relevant experience.<br><br> <br>+ 3+ years of experience developing machine learning models at scale from inception to business impact.<br><br> <br>+ Deep understanding of modern machine learning techniques and their mathematical underpinning, such as classification, recommendation systems, optimization, deep learning and natural language processing.<br><br> <br><br> <br><br><br> <br>**Requirements and General Skills:**<br> <br><br> <br><br><br> <br><br><br> <br>+ Experience communicating the results of analyses with product and leadership teams to influence the strategy of the product.<br><br> <br>+ Ability to define relevant metrics that can guide and influence stakeholders to the appropriate and accurate insights.<br><br> <br>+ Strong desire to take initiative; thrive on change and comfortable with ambiguity.<br><br> <br>+ High skill in data visualization (big plus).<br><br> <br>+ Interest in transportation, road safety, experience with geospatial programming, and diagnosing vehicles are a big plus.<br><br> <br>+ Must have legal right to work in the U.S.<br><br> <br><br> <br><br><br> <br>**Technical Skills:**<br> <br><br> <br><br><br> <br><br><br> <br>+ Strong data-oriented scripting (e.g. SQL) and statistical programming (e.g., R or python) skills.<br><br> <br>+ Solid understanding of probability and statistics (e.g., hypothesis testing, regressions).<br><br> <br>+ Strong data exploration and data mining skills (data visualization, feature reduction, and identification).<br><br> <br>+ Experience working with very large semi-structured data sets using technologies like Spark and Hadoop is a plus.<br><br> <br><br> <br><br><br> <br>**As an EEO/Affirmative Action Employer all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status** .<br> <br><br> <br><br><br> <br>_The requireme_ _nts and duties described above may be modified or waived by the Company in its sole discretion without notice_<br> <br><br> <br>Company EEO Statement<br> <br>Our goal at SiriusXM is to provide and maintain a work environment that fosters mutual respect, professionalism and cooperation. SiriusXM is an equal opportunity employer that does not discriminate on the basis of actual or perceived race, creed, color, religion, national origin, ancestry, alienage or citizenship status, age, disability or handicap, sex, gender identity, marital status, familial status, veteran status, sexual orientation or any other characteristic protected by applicable federal, state or local laws."}