{"job title": "Lead Data Scientist, Category Analytics &amp; Systems", "company": "The J. M. Smucker Company", "city state": "– Cleveland, OH", "rating": "3.5", "job description": "For more than 120 years, The J. M. Smucker Company has been committed to offering consumers quality products that bring families together to share memorable meals and moments. Today, Smucker is a leading marketer and manufacturer of consumer food and beverage products and pet food and pet snacks in North America with annual net sales of approximately $8 billion. In consumer foods and beverages, its brands include Smucker's®, Folgers®, Jif®, Dunkin’ Donuts®, Crisco®, Pillsbury®, R.W. Knudsen Family®, Hungry Jack®, Café Bustelo®, Martha White®, truRoots®, Sahale Snacks®, Robin Hood®, and Bick’s®. In pet food and pet snacks, its brands include Meow Mix®, Milk- Bone®, Kibbles 'n Bits®, Natural Balance®, and 9Lives®. The Company remains rooted in the Basic Beliefs of Quality, People, Ethics, Growth, and Independence established by its founder and namesake more than a century ago. For more information about the Company, visit jmsmucker.com.<br><br><u>TITLE</u> <br><br>Lead Data Scientist, Category Analytics &amp; Systems<br><br><u>LOCATION</u><br><br>Orrville, OH<br><br><u>REPORTS TO</u><br><br>Senior Manager, Category Analytics &amp; Systems<br><br><u>POSITION SUMMARY</u><br><br>The Lead Data Scientist will deliver and/or facilitate the delivery of high-quality customer-facing advanced analytics projects, create proprietary analysis techniques for use in a category leadership / retail setting, and identify opportunities to scale these capabilities across multiple accounts &amp; categories. As an embedded data scientist within Category Leadership, you will define/own the relationship with Smucker’s Centralized Data Science hub and leverage its resources as needed.<br><br><u><strong>KEY RESPONSIBILITIES</strong></u><br><br><u>Projects/Process:</u>\n<ul>\n<li>Create a best-in-class method for identifying, executing, and delivering data science capabilities / ‘big ideas’ to Category customers – including continuous improvement &amp; maintenance</li><li>Identify, scope, &amp; lead advanced analytics projects as required by customer relationships\n\n<ul>\n<li>For larger projects, own the development/assignment of project roles to ensure successful &amp; timely delivery</li></ul></li>\n<li>Prioritize work according to importance of customer relationship and relative size-of-prize.</li><li>Deliver engaging onsite presentations to customers and actively participate in analytics-related components of customer Innovation Center visits</li>\n</ul>\n<u>Tools &amp; Techniques:</u>\n<ul>\n<li>Leveraging data mining, statistics, and machine learning, develop best-in-class analysis techniques &amp; data visualizations that answer strategic customer / category questions</li><li>Productize high-demand techniques to deliver efficiencies and scale across the Category Leadership organization</li><li>Research &amp; evaluate industry best practices / data science innovations; continuously improve by integrating learnings into projects whenever possible</li>\n</ul>\n<u>People/Management:</u>\n<ul>\n<li>Manage data-science focused interns / analysts as needed</li><li>Maintain relationships with top university analytics programs to build a future talent pipeline</li><li>Support MDO analytics initiatives by providing expertise &amp; thought leadership</li>\n</ul>\n\n<u>SELECTION CRITERIA</u><br><br><u>Education</u>\n<ul>\n<li> Bachelor’s Degree is required (Statistics/ Analytics/Mathematics preferred)</li><li>Master’s Degree preferred (MBA or Applied Mathematics/Analytics)</li>\n</ul>\n<u>Experience</u>\n<ul>\n<li>A minimum of 5 years of experience in a quantitative analysis type role is required (internal candidates with 3 or more years of this type of experience will be considered)</li><li>1 or more years of relevant Consumer Package Goods industry experience is preferred</li>\n</ul>\n<u>Other</u>\n<ul>\n<li>Use of advanced predictive analytics tools (SAS, R, SQL, or Python) is a must</li><li>Use of data science techniques (statistical analysis, clustering/segmentation, and time series forecasting and optimization) is required</li><li>Machine learning experience is preferred</li><li>Ability to communicate complex quantitative analysis in a clear, precise, and actionable manner is required</li><li>Ability to solve analytical problems using complex quantitative approaches is a must</li><li>Comfortable manipulating and analyzing complex, high-volume, high-dimensionality data from varying sources is a must</li><li>Self-motivated and ability to handle multiple/diverse tasks</li><li>Ability to build relationships across the Company</li><li>Up to 15% travel required</li>\n</ul>\nIND123\n<br><br>\n#LI-123"}