{"job title": "Product Manager - Data Platforms, Self-Driving", "company": "Uber", "city state": "– Pittsburgh, Pennsylvania, United States", "rating": "4.2", "job description": "We’re changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now we’re a part of the logistical fabric of more than 600 cities around the world. Whether it’s a ride, a sandwich, or a package, we use technology to give people what they want, when they want it.\n<br><br>\nFor the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer.<br>\n<div>And that’s just what we’re doing today. We’re thinking about the future, too. With teams working on new modalities, self-driving cars and even urban air transportation, we’re in for the long haul. We’re reimagining how people and things move from one place to the next.</div>\n<br><strong>About the Role</strong>\n<br><br>\nYour objective is to transform the millions of miles of driving we have done on roads and in simulation into scalable, discoverable, and actionable insights for our data scientists and self-driving system. You will lead lead a product management team that collaborates with engineers, data scientists, and UX designers to build full-stack data platforms. These platforms include Search, Visualization, Data Management, Business Intelligence, and Automation.\n<br><br>\n<strong>What You’ll Do</strong>\n<ul>\n<li>Own the product vision for data platforms at ATG</li><li>Define the roadmap for internal tools and data products across the above areas</li><li>Lead and mentor a technical product management team</li><li>Enable ATG to scale the amount of actionable data it collects at a fraction of the cost</li><li>Develop key performance indicators for your product areas</li><li>Collaborate closely with engineering counterparts to lead high-performing, customer-centric delivery teams</li><li>Own the touchpoints with customers inside the organization (Safety, Software, Hardware, Product, Systems Engineering and others)</li>\n</ul>\n<strong></strong>\n<br><br>\n<strong>What You’ll Need</strong>\n<ul>\n<li>Experience building highly scalable, cloud-based, full-stack data platforms</li><li>Computer science undergraduate degree or equivalent</li><li>Minimum 8 years product management experience delivering highly successful, innovative, and delightful software products</li><li>Exceptional verbal and written communication skills, with experience leading presentations to executives and large groups of people</li><li>Experience leading, recruiting, and mentoring teams of product managers</li><li>Experience with a variety of development processes, including agile / lean startup</li><li>Deep passion for Uber’s mission and self-driving vehicles</li>\n</ul>\n<strong></strong>\n<br><br>\n<strong>Bonus Points If</strong>\n<ul>\n<li>Experience with autonomous systems of any kind</li> <li>Experience building machine learning based products</li><li>Masters or PhD in computer science or equivalent field (with focus on big data, artificial intelligence)</li><li>Professional experience as a software engineer</li>\n</ul>\n<strong></strong>\n<br><br>\n<strong>About the Team</strong>\n<br><br>\nSelf-driving vehicles have the potential to make our roads safer, more connected, and less congested. At Uber ATG, we are building the technologies, teams, and products to bring these benefits to the world."}