{"job title": "Data Pipeline / Analyst", "company": "AliveCor", "city state": "– ", "rating": "4.0", "job description": "Heart disease unfortunately kills more people than anything else in the western world (including all cancers combined). At AliveCor, we build beautiful, FDA-cleared medical grade hardware and software that lets people take control of their own heart health and truly save lives. AliveCor, the creator of the Kardia series of mobile EKG products, which has an unprecedented number of ECG’s from hundreds of thousands of active users, seeks a data analyst.\n<br><br>\nAs a data analyst at AliveCor, you'll be a member of a small elite team who will be responsible for driving the analysis behind decisions related to our user experience. The ideal candidate for this role should have strong analytical skills, excellent time-management and organizational habits, and the ability to clearly communicate and present information for stakeholders at all levels of the business.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Build and manage our stats and data pipelines</li>\n<li>Work with Product and Marketing to extract appropriate data and insights</li>\n<li>Ownership of conceptualizing, developing, and maintaining data pipelines, dashboards and visualization</li>\n<li>Understands our users</li>\n<li>Define and evaluate key metrics and understand what moves them and why</li>\n</ul>\n<strong>Skills &amp; Experience</strong>\n\n<ul>\n<li>Bachelor's degree in CS and/or Statistics</li> \n\n<li>Professional industry experience in a data science or analysis role (4+ years preferred)</li>\n<li>Proficient in SQL and experience with programming, with Go, Python and R a plus</li>\n</ul>\n<strong>The Perks:</strong>\n<br><br>\nAliveCor is located in downtown Mountain View, CA. We are close to Caltrain and supply car and bike parking for employees. We strive to make your life outside work as smooth as possible while you’re at work work, and we offer a long list of benefits to make that happen.\n\n<ul>\n<li>Competitive salary and competitive stock options</li>\n<li>Flexible and generous vacation policy</li>\n<li>Maternity / Paternity Leave</li>\n<li>401K</li>\n<li>TriNet medical coverage, employee 100% covered for medical, dental and vision</li>\n<li>Equipment allowance to build out your ideal workspace</li>\n<li>Mobile reimbursement</li>\n<li>Stocked kitchen + weekly catered lunches</li>\n<li>Offsites and Happy Hours</li>\n<li>A supportive, collaborative group of people who understand that success is a team effort</li>\n</ul>\nAliveCor is an equal opportunity employer and will not discriminate against any employee or applicant on the basis of age, color, disability, gender, national origin, race, religion, sexual orientation, veteran status, or any classification protected by federal, state, or local law."}