{"job title": "Marketing Data Analyst", "company": "Blueocean Market Intelligence", "city state": "– Hillsboro, OR", "rating": "3.1", "job description": "<strong>Job description:</strong>\n<br><br>\nIt has become increasingly apparent that in representing the end-user, a greater emphasis needs to be placed on integrating non-traditional primary research data into its insights generation process (e.g. web behavior, social media listening, search, etc.). Integrating these different (and at times unstructured) data sources with traditional primary research data (e.g. survey-based data, focus groups, etc.) is becoming critical in driving a data driven culture into Intel's marketing efforts, including driving more effective media targeting and spending; and the build out of predictive models designed to increase the sales efficiency of our marketing campaigns.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nThe Marketing Data Analyst position requires in-depth data analytics knowledge and expertise. This position requires experience with extracting data from relational databases (using SAS, SQL or alike) as well as familiarity with enterprise level web analytics tools (e.g., Adobe Omniture, Google Analytics Premium, Web Trends, etc.). Experience with digital media planning, optimization and measurement and familiarity of media tools such as DART, Atlas, MediaMind, etc. is a plus.\n<br><br>\nThis position is also involved in client's pursuit of increasingly using unstructured (so-called \"big data\") and structured data with ultimate goal to connect marketing investments to sales and develop predictive analytics capability. Responsibilities include partnering with Intel IT (or vendors) to translate business requirements into technical data pull requirements. Once initial data extract is performed, further data summarization, manipulation and interpretation is necessary in order to deliver analytical insights and recommendations.\n<br>\nPulling together results in a digestible manner (e.g. not massive amounts of data but a narrative) that outlines key takeaways and recommendations will be extremely important. Equally essential, the ability to present findings [narrative] to internal teams (and at times, senior executives) that drives action, improvements, and accountability.\n<br><br>\n<strong>Desired Skills and Experience:</strong>\n\n<ul>\n<li>Graduate or undergraduate degree with quantitative focus such as Economics, Statistics, Mathematics, Decision Science, Operational Research, or Engineering</li>\n<li>5+ years of experience in analytics used to optimize multi-channel (including on-line) marketing strategy and campaigns</li>\n<li>Experience with data mining software packages such as R, SAS, SPLUS, SQL and statistical algorithms typically used in Marketing Analytics</li>\n<li>Experience and interest in data visualization, reporting, and tool building in order to scale operations and increase visibility to the data/results</li>\n<li>Understanding of enterprise level web analytics tools and underlying data (e.g., Adobe Omniture, Google Analytics Premium, Web Trends, etc.)</li>\n<li>Excellent team player with the ability to build strong working relationships with key partners and business leads.</li>\n<li>Actively listens, understands, and values other's views</li>\n<li>High performance individual with demonstrated ability to manage extremely complex projects with tight deadlines</li>\n<li>Exceptional presentation skills, including proven success in developing presentations that requires taking complex data sets, and boiling down into visual, meaningful and understandable insights and recommendations (e.g. presenting a narrative or story versus dumping large amounts of data)</li>\n<li>A passion for driving insights into action, including genuine excitement about the opportunity that Big Data present</li>\n</ul>"}