{"job title": "Data Analyst - Merchandise Finance", "company": "Brooksource", "city state": "– Deerfield, IL, Illinois", "rating": "4.5", "job description": "<strong>Data Analyst - Merchandise Finance</strong>\n<br><br>\nMy client, a Fortune 100 leader in the retail industry, is looking for a Data Analyst to join their team for a 1-year project in Deerfield, IL.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\n· Responsible for coordinating internal merchants' vendor deals.\n<br><br>\n· Coordinates all aspects of the deal writing process.\n<br><br>\n· Learns to understand aspects of vendor deals, P&amp;L impact, crediting and researching deal performance issues.\n<br><br>\n· Applies defined processes for accurate data entry and provides timely information to merchants, accounting and other stakeholders.\n<br><br>\n· Notifies merchants when terms between parties do not match and recommends corrective action for the merchants.\n<br><br>\n· Ensures data integrity, resolution of system issues, compliance with applicable laws and validation of vendor funding.\n<br><br>\n· Adjusts within rapidly changing environment.\n<br><br>\n· Coordinates vendor deals and timely deal execution with merchant team.\n<br><br>\n· Communicates with merchant team members to ensure billing and calculation terms meet the negotiated intent.\n<br><br>\n· Independently identifies deal exceptions and problem solves issues prior to deal billing.\n<br><br>\n· Reinforces each stakeholder's role to ensure his or her part is played correctly in the multi-step deal process.\n<br><br>\n· Serves as subject matter expert on deal writing process.\n<br><br>\n· Escalates issues when necessary.\n<br><br>\n· Maintains accurate records of individual desk rules and vendor exceptions for billing accuracy.\n<br><br>\n· Reviews and corrects any deals which are not performing correctly.\n<br><br>\n· Participates in training of individual team members as needed.\n<br><br>\n· Maintains knowledge and proficiency on computer systems including Deal Ledger System, Deal Entry System, ADR7, BDRS, Alfresco, and Microsoft Office (Excel and Word).\n<br><br>\nEight Eleven Group provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, national origin, age, sex, citizenship, disability, genetic information, gender, sexual orientation, gender identity, marital status, amnesty or status as a covered veteran in accordance with applicable federal, state, and local laws."}