{"job title": "Analyst, Data Analytics", "company": "Cardinal Health", "city state": "– Dublin, Ohio", "rating": "3.3", "job description": "<strong>What Data Analytics contributes to Cardinal Health</strong>\n<br><br>\nData Analytics is responsible for understanding, preparing, processing and analyzing data to make the data valuable and useful for operational and/or decision making purposes. Data Analytics may need to team with either Business Intelligence, Advanced Analytics and Data Governance positions to create highly useful information.\n<ul>\n<li>Uses knowledge of business objectives, strategies, and needs to identify opportunities where data can be leveraged to achieve the desired business benefits.</li><li>Has an understanding of current data context, processes and availability, and how current data processes and existing data can be leveraged to achieve the desired benefits.</li><li>Prepares and analyzes data. This can include: locating, profiling, cleansing, extracting, mapping, importing, transforming, validating or modeling.</li><li>Applies query, data exploration and transformation, basic statistical methods and visualization techniques to create business insights or improve data quality.</li><li>Performs validation and testing to confirm the accuracy of the information created.</li><li>Interprets results of analyses, identifies trends and issues, and develops recommendations to support business objectives.</li><li>Communicates complex information so that it is easy to understand and influences other to take action based on the useful information provided.</li><li>Implements and maintains decision support or master data management solutions.</li>\n</ul>\n<strong>Qualifications</strong>\n<ul>\n<li>Bachelors Degree in related field, or equivalent work experience</li>\n</ul>\n<strong>What is expected of you and others at this level</strong>\n<ul>\n<li>Applies basic concepts, principles, and technical capabilities to perform routine tasks around CAH Brand Product Data and Strategic Classification/Hierarchy Product Data</li><li>Works on projects of limited scope and complexity</li><li>Follows established procedures to resolve readily identifiable technical problems</li><li>Works under direct supervision and receives detailed instructions</li><li>Develops competence by performing structured work assignments</li>\n</ul>\n<em>Cardinal Health is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status.</em>"}