{"job title": "Data Analyst - Business Intelligence", "company": "Connexion Systems &amp; Engineering", "city state": "– 01730, Massachusetts", "rating": "3.8", "job description": "Connexion Systems &amp; Engineering, a Boston based IT and Engineering Solutions Company immediately seeks individuals with the following skills:\n<br><br>\nJob# bh8968\n<br><br>\nData Analyst, Business Intelligence\n<br><br>\nRequired: Tableau Desktop, TSQL, Working with large datasets\n<br><br>\nPreferred: MSSQL (SSMS/SSRS), Healthcare Information Systems. \n<br><br>\nPurpose\n<br><br>\nThe BI (Business Intelligence) Data Analyst will source, analyze, and report data to enhance business operations. The position will support internal operational and coding teams, with an emphasis on developing visual data models to help spot trends, identify issues, and further optimize internal operational processes.\n<br><br>\nDuties and Responsibilities\n<br><br>\nResponsible for developing data models, advanced visual representation and standards for reporting\n<br>\nDelivers data and dashboards to process owners for maintenance where appropriate\n<br>\nCreates and maintains files and databases, compiling data from multiple sources, running queries, formatting tables/formulas/scripts, analyzing/interpreting/validating results, and developing reports/scorecards/charts/dashboards\n<br>\nAnalyzes and organizes qualitative and quantitative clinical, financial, and administrative data from multiple sources and synthesizes results into meaningful reports and presentations, recommending follow-up actions where appropriate\n<br>\nProduces intuitive graphical interpretations of data sets for trending purposes\n<br>\nAdjusts workload as necessary to prioritize more urgent report and data requests related to quality of care issues or other requests\n<br>\nAbility to run \"what if\" scenarios using analytic tools\n<br>\nAssists with business analysis and workflow documentation\n<br>\nQualifications\n<br><br>\nTo perform this job successfully, an individual must be able to perform each duty satisfactorily. The requirements listed below are representative of the knowledge, skills, and/or ability required. Reasonable accommodation may be made to enable individuals with disabilities perform the duties.\n<br><br>\nEducation (Degrees, Certificates, Licenses, Etc.)\n<br><br>\nBachelors degree or equivalent combination of education and experience preferred.\n<br><br>\nWhen responding to this job posting you MUST include the Job# and Job Title in your subject line.\n<br><br>\nDuration: Contract to Permanent\n<br><br>\nRate 25-35/hr. or 50-65K\n<br><br>\nLocations: Bedford, MA\n<br><br>\nContact Info:\n<br><br>\nConneXion Systems &amp; Engineering\n<br><br>\n490 Boston Post Road\n<br><br>\nSudbury, MA 01776\n<br><br>\njobpostings@csetalent.com"}