{"job title": "Data Analyst, Platform Partnerships", "company": "Facebook", "city state": "– Menlo Park, California", "rating": "4.4", "job description": "Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.The Platform Partnerships team at Facebook comprises Community, Developer, Education and Local partnerships. We work with developers, community leaders, small businesses and other organizations to help them build and optimize their presences across our family of apps and services. In this Data Analyst role, you'll work closely with Strategic Partner Managers, Product teams, and other cross-functional partners to conduct in-depth analyses that inform their work with our partners. The ideal candidate will have a passion for problem solving in a fast-paced environment. The role will report to the Partnerships Analytics team and is based in Menlo Park.\n<br><br>\n<strong>Responsibilities:\n<br>\n</strong>\n\n<ul>\n<li>Enable the Platform Partnerships team to plan, execute, report on and monitor the success of engagement efforts with respect to community, developer, education, and local partnerships</li><li>Track, analyze and communicate key quantitative metrics and ecosystem trends as they relate to partner relationships</li><li>Conduct analyses to identify best practices for partners to build their communities and engagement</li><li>Make recommendations and help guide product decisions through collaborative work with Product teams</li>\n</ul>\n\n<strong>Mininum Qualifications:\n<br>\n</strong>\n\n<ul>\n<li>BA or BS degree</li><li>5+ years of experience working in an analytical capacity developing insights and making recommendations</li><li>2+ years of SQL (Oracle, Vertica, Hive, etc.) or relational database experience (Oracle, MySQL)</li><li>Experience using data access tools and building visualizations using large datasets and multiple data sources</li><li>Knowledge of the Facebook Platform and similar metrics</li><li>Experience navigating and working with cross-functional teams</li>\n</ul>\n\n<strong>Preferred Qualifications:\n<br>\n</strong>\n\n<ul>\n<li>2+ years of experience with packages such as R, Tableau, SPSS, SAS, STATA, etc.</li><li>2+ years of experience managing a team of data analysts</li>\n</ul>"}