{"job title": "Data Analyst-Paralegal", "company": "Hays US", "city state": "– Nashville, Tennessee", "rating": "4.0", "job description": "Data Analyst in Nashville for a Global Investment Bank.\n<br><br>\nYour new company\n<br>\nWe're looking for someone to be a key contributor to the success of our Registration &amp; Licensing Team in Nashville, TN. The ideal person will have excellent attention to detail and organizational skills. They must be a self-starter, with the ability to follow instructions and established procedures. Ability to multi-task within a fast paced atmosphere.\n<br><br>\nYour new role\n<br>\nYou'll be working on the Employee Conduct Registration and Licensing Team in the Nashville Business Solutions Center.supporting UBS business areas within the Americas region, which includes five FINRA Broker Dealers, NFA Regulated entities, including SWAP registration, as well as Insurance and Mortgage licensing.\n\n\n<ul>\n<li>Assist in facilitating the collection, submission and troubleshooting of Registration Applications to regulatory agencies on behalf of registered personnel of UBS;</li>\n<li>Facilitate the submission of firm related registration applications to various self-regulatory and state insurance licensing agencies;</li>\n<li>Coordinate communications with regulatory bodies on various registration related issues;</li>\n<li>Work closely with the Legal Department and other various areas of Compliance to facilitate completion of Form BD regulatory filings;</li>\n<li>Coordinate internal collection, review, and preparation of relevant disclosure documentation required by State Regulatory Agencies and meticulously maintain records;</li>\n<li>Maintain updated procedures documentation relevant to the regulatory environment;</li>\n<li>Prepare and file regulatory submissions;</li>\n<li>Other duties or special projects as assigned.</li>\n</ul>\n\nWhat you'll need to succeed\n\n\n<ul>\n<li>Strong academic background with Paralegal Certificate</li>\n<li>Reviewing and analyzing documents</li>\n<li>Ideally, experienced in handling professional licensing/registration, preferably in securities related field; and</li>\n<li>Working knowledge of FINRA Gateway, WebCRD, ORS and other registration related licensing programs preferred</li>\n<li>Analytic, with the ability to provide practical solutions for minimizing risk</li>\n<li>Result-oriented and assertive (you don't shy away from challenging situations)</li>\n<li>An excellent communicator and highly organized</li>\n<li>Self-motivated and demonstrate solution oriented thinking and independent problem solving skills</li>\n</ul>\n\nWhat you'll get in return\n<br>\nYou will get the chance to work for a very well respected global brand as well as start a position that may grow into a bigger role in the future.\n<br><br>\nWhat you need to do now\n<br>\nIf you're interested in this role, click 'apply now' to forward an up-to-date copy of your CV, or call us now.\n<br>\nIf this job isn't quite right for you but you are looking for a new position, please contact us for a confidential discussion on your career."}