{"job title": "Junior Case/Data Analyst", "company": "Intelliware Systems", "city state": "– Washington, DC", "rating": "4.9", "job description": "<div><div><strong>Overview:</strong> IntelliWare Systems is a growing small business with an immediate need for skilled and energetic Junior Case/Data Analyst.\n<br><br>\n<strong>Description:</strong>\n<br><br>\nThe Junior Case/Data Analyst will input data extracts and retrieve data and run required reports in the customer’s asset tracking system. The Data Analyst will assist with drafting advertising orders, seizure notice letters, petition and claim letters, declarations and miscellaneous letters as needed. The Data Analyst will assist with maintaining physical and electronic seizure files, reconciling inconsistencies and gathering and organizing documentation in seizure files. The Data Analyst will assist with generating ad hoc reports, asset forfeiture statistics and seizure summaries. The Data Analyst will assist with reviewing seizure files prior to closing to ensure compliance and completeness.\n<br><br>\n<strong>Responsibilities and Duties:</strong>\n\n<ul>\n<li>Data input, preparing letters, files, forms, and other required documents.</li>\n\n<li>Expertly input data, prepare letters, files, forms, and other required documents practically error-free.</li>\n\n<li>Analyze and compile confidential documents and records, responsible for keeping and maintaining time sensitive documents in order, and follow a strict deadline procedure which requires precise attention and tracking.</li>\n\n<li>Assertively communicate with appropriate personnel to obtain necessary information coherently and decisively.</li>\n\n<li>Quality assurance in various procedures, including when seized property is being proclaimed and forfeited.</li>\n\n<li>Draft, submit, and monitor petition and claim letters from defendants and victims of seized property.</li>\n\n<li>Train and coordinate new employees with procedure, processes, and expectations of the client.</li>\n\n<li>Communicate with personnel at a variety of levels throughout the organization with the purpose of obtaining necessary information.</li>\n</ul>\n<strong>Experience Requirements:</strong>\n\n<ul>\n<li>Minimum one (1) year of general work experience is preferred.</li> \n\n<li>Excellent communication and written skills.</li> \n\n<li>Working knowledge of MS Office Suite (MS Word, MS Excel, MS Outlook, etc.)</li>\n</ul>\n<strong>Education Requirements:</strong>\n\n<ul>\n<li>Bachelor's Degree. A minimum of 4 years' of experience may be substituted for a Bachelor's Degree.</li>\n</ul>\n<strong>Location:</strong> Washington, DC\n<br><br>\n<strong>Travel:</strong> None\n<br><br>\n<strong>Clearance:</strong> None. Must be a U.S. Citizen and have ability to obtain a Public Trust Clearance.</div> </div><div></div>"}