{"job title": "Research Data Analyst", "company": "Iowa State University", "city state": "– Ames, IA (US)", "rating": "4.3", "job description": "<div>\nClassification Information\n<br>\n <div>University Title Systems Analyst II - 1164</div> <div>Pay Grade 35</div> <div>Salary Commensurate with qualifications</div> <div>Base of Employment P - P&amp;S</div> <div>Job Category Professional and Scientific</div> <div>Pay Frequency Monthly</div> </div><br>\n\n <div>\nPosting Details\n<br>\n <div>Posting Number 80504P</div> <div>Working Title Research Data Analyst</div> <div>Advertised Employing Department Liberal Arts and Sciences Administration</div> <div>Appointment Type Professional &amp; Scientific - Continuous</div> <div>Proposed Start Date 10/15/2018</div> <div>Proposed End Date or Length of Term</div> <div>Number of Months Employed Per Year 12</div> <div>Full or Part Time Full-Time</div> <div>Summary of Duties and Responsibilities<br><br>The College of Liberal Arts and Sciences (LAS) Information Technology team at Iowa State University is accepting applications for a Systems Analyst II. This position will be part of the LAS Research IT team, and will primarily provide systems analysis in the areas of data management, relational databases, and web applications. This position will also assist with other research computing support for the faculty and staff of multiple departments and programs in the college.\n<br>\nThis Systems Analyst II position is part of a multi-person team serving in LAS Research IT and IOPS (Infrastructure and Operations). As a member of this team, the successful candidate will analyze the data needs of research labs on campus, and help craft and implement plans around data architecture, normalization, retention, database queries, etc. Responsibilities include meeting with research labs to understand the way they need to use their data, help writing data management plans, and building out web based databases. The person in this role may also assist faculty, students and staff with finding solutions to technical challenges in the area of Research IT support.\n<br>\nThe Systems Analyst is expected to provide informed input in technology planning and implementation across all programs, administrative units, and technology spaces in the college and assist in the requirements gathering and specifications for databases and associated web applications. The successful candidate will possess excellent interpersonal skills and the ability to communicate with faculty, staff and students; the ability to handle multiple projects; and the ability to interpret and apply complex technical documentation.</div> <div>About Iowa State University and the Ames Community<br><br>Iowa State University is classified as a Carnegie Foundation Doctoral/Research University-Extensive, a member of the Association of American Universities (AAU), and ranked by U.S. News and World Report as one of the top public universities in the nation. More than 36,000 students are enrolled and are served by over 6,200 faculty and staff.\n<br><br>\nIowa State University is a global and culturally diverse university committed to providing an inclusive, equitable, and diverse environment for both learning and employment. We know that diversity in experience and perspective is vital to advancing innovation, critical thinking, solving complex problems, and building an inclusive academic community. At Iowa State, we translate these values into action by seeking individuals who have experience working with diverse students, colleagues, and constituents. The university has an expectation that all employees will demonstrate a contribution to diversity and inclusion as embodied in Iowa State University’s Principles of Community.\n<br><br>\nAmes, Iowa is a progressive community of 60,000, located approximately 30 minutes north of Des Moines, and recently voted one of the best college towns in the nation.\n<br><br>\nIowa State University is an equal opportunity employer committed to excellence through diversity and strongly encourages applications from all qualified applicants, including women, underrepresented populations, and veterans. ISU is responsive to the needs of dual career couples, is dedicated to work-life balance through an array of policies, and is an NSF ADVANCE institution.\n<br><br>\nAll employees are expected to exhibit and convey good citizenship within the program, the department, college, university activities, collegial interactions, and maintain the highest standards of integrity and ethical behavior.</div> <div>Required Education and Experience<br><br>Bachelor’s degree and 3 years of related experience; OR a Master’s degree and 1 year of related experience.</div> <div>Supplemental Required Education and Experience<br><br>•\tDegree in computer science, data science, computer engineering, mathematics, statistics, or closely related field.\n\n\n<ul>\n<li>Experience must include systems analysis, administration and support.</li></ul></div> <div>Preferred Education and Experience<br><br>•\tExperience that demonstrates a high degree of proficiency with SQL and experience with various relational and NoSQL platforms\n<li>Experience that demonstrates scripting/programming skills in a language such as: C, C++, Linux/UNIX shell , PHP, Perl, Python, Julia, or R</li>\n<li>Experience with server virtualization technologies.</li>\n<li>Experience creating web applications using a CRUD framework or CMS</li>\n<li>Experience in a collaborative team programming environment.</li>\n<li>Experience with git version control and some project management / ticketing systems.</li>\n<li>Experience with automated software testing.</li>\n<li>Experience designing, deploying and maintaining database systems.</li>\n<li>Experience writing concise system and usage documentation.</li></div> <div>Location (if other than Ames)</div> <div>Additional Information</div> <div>Department Contact Name Levi Baber</div> <div>Department Contact Phone</div> <div>Department Contact Email baber@iastate.edu</div> <div>Department/Unit Website</div> <div>Application Instructions<br><br>To apply for this position, please click on “Apply for this Job” and complete the Employment Application. Please be prepared to enter or attach the following:\n\n\n1) Resume/Curriculum Vitae\n<br>\n2) Letter of Application/Cover Letter\n<br>\n3) Contact Information for Three References\n<br><br>\nIf you have questions regarding this application process, please email employment@iastate.edu or call 515-294-4800 or Toll Free: 1-877-477-7485.</div> <div>Special Instructions Summary</div> <div>Guaranteed Consideration Date 09/25/2018</div> <div>Pre-Employment Screening<br><br>All offers of employment, oral and written, are contingent upon the university’s verification of credentials and other information required by federal and state law, ISU policies/procedures, and may include the completion of a background check and/or a consumer credit check.</div> <div>Quick Link http://www.iastatejobs.com/postings/35926</div> <div>EO Statement<br><br>Iowa State University is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, age, religion, sex, sexual orientation, gender identity, genetic information, national origin, marital status, disability, or protected veteran status and will not be discriminated against. Inquiries can be directed to the Office of Equal Opportunity, 3410 Beardshear Hall, 515 Morrill Road, 515 294-7612, email eooffice@iastate.edu.</div> </div>\n\n<br>"}