{"job title": "Data Architect/Analyst", "company": "MacB", "city state": "– Dayton, Ohio", "rating": "3.5", "job description": "<div> \n<div> 15638: Data Architect/Analyst</div>\n<br>\n<div> \n<div> Location: Ohio, Dayton</div> <div> Clearance: National Agency Check</div> </div><div> <strong>Description:</strong></div> <div> Apply your data architecture/analyst experience to the transformation of AFRL’s enterprise-wide business system. Designs and builds relational databases for data storage or processing. Develops strategies for operational and reporting database implementation, data acquisition and access, and data archiving and recovery. Builds relational data models from the current AFRL Data Repository (ADR) and defines the structure, relationships, attributes and nomenclature of data elements. May evaluate new data sources for adherence to the organization's quality standards and ease of integration. DoDAF (DIV-1, DIV-2, &amp; DIV-3 views) experience is desired.\n<br><br>\nThis person will work with the Functionals within AFRL and AFRL/RCB personnel to assist in the migration of the legacy DB to modernization along with supporting the on-going enterprise and AFRL Technical Directorate “To Be” processes.</div> <div> <strong>Requirements:</strong></div> <div>\n\n<ul>\n \n<li>Experience with Oracle</li>\n  \n<li>Experience developing logical data models (DoDAF views preferred)</li>\n  \n<li>Experience with transforming legacy data to a modernized platform</li>\n  \n<li>Experience with system architecture, design, and testing</li>\n  <li>Detailed hands-on understanding of medium to large system developments/ modernizations</li> <li>Ability to obtain a favorable NACI to allow base and NIPRNet access</li> <li>Minimum of 15 years of overall experience</li> <li>B.S. in Computer Science or Engineering; M.S. preferred</li> \n</ul>\n<em>For more than 39 years, MacAulay-Brown, Inc. (MacB) has been solving some of the Nation’s most complex National Security challenges. Defense, Intelligence Community, Special Operations Forces, Homeland Security and Federal agencies rely on our advanced engineering services, cyber security, and product solutions to meet the challenges of an ever-changing world. Join MacB where you will work with a team of highly experienced professionals in the areas of Intelligence, Cybersecurity, Research Development Test and Evaluation, Information Operations, fabrication, IT solutions, Logistics and Acquisition Management. MacB has won multiple workplace awards, offers generous salaries and benefits, and has outstanding growth opportunities.</em>\n<br><br>\n<em>\n<br>\nMacB is committed to a policy of equal employment opportunity to all employees and applicants for employment. MacB recruits, trains, compensates and promotes without regard to race, creed, religion, color, sex, gender identity, age, national origin, citizenship, political affiliation, sexual orientation, genetic information, marital status, source of income, protected veteran status, physical or mental disability, military status, or any other consideration made unlawful under applicable federal, state or local law.</em><br><br>#CJ</div> </div>\n\n<br>"}