{"job title": "Data Analyst (SQL, Clarity)", "company": "Mastech", "city state": "– Pasadena, California", "rating": "3.9", "job description": "Job Description: Mastech Digital provides digital and mainstream technology staff as well as Digital Transformation Services for leading American Corporations. We are currently seeking a Data Analyst (SQL, Clarity) for our client in the Healthcare domain. We value our professionals, providing comprehensive benefits, exciting challenges, and the opportunity for growth. This is a Contract-to-Hire position and the client is looking for someone to start immediately.\n<br><br>\nDuration: 6 Months Contract-to-Hire\n<br><br>\nLocation: Pasadena, CA\n<br><br>\nCompensation: Best Market Rates\n<br><br>\nRole: Data Analyst (SQL, Clarity)\n<br><br>\nPrimary Skills: Project Management\n<br><br>\nRole Description: The Data Analyst (SQL, Clarity) would need to have at least 3-6 years of experience. In this role, you will advise and recommend areas of program planning, business management, budget execution and program coordination.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Prepares needs assessment.</li>\n<li>Validates resource requirements and develops cost estimate models.</li>\n<li>Conducts and coordinates financial, product, market, operational, and related research to support strategic and business planning within the various departments and programs of the client group.</li>\n<li>Interprets, evaluates, and interrelates research data, and develops integrated business analyses and projections for incorporation into strategic decision-making.</li>\n<li>Plans and coordinates the development of primary and secondary market research studies in support of strategic planning and specific marketing initiatives, as required, and presents findings of studies to client committees.</li>\n<li>Provides consultative, technical, and staff support, as appropriate.</li>\n</ul>\n\n<strong>Experience and Skill Set:</strong>\n\n\n<ul>\n<li>3-6 years of experience.</li>\n<li>Knowledge of project management principles, practices, techniques, and tools.</li>\n<li>Knowledge and appreciation of business concepts and requirements as applicable to a large academic, research, and/or health care facility.</li>\n<li>Knowledge and understanding of business research principles, processes, and techniques.</li>\n<li>Ability to develop and prepare business analyses and plans.</li>\n<li>Ability to develop and deliver presentations.</li>\n<li>Knowledge of the principles of strategic business decision-making.</li>\n<li>Ability to process computer data and to format and generate reports.</li>\n<li>Ability to create, compose, and edit written materials.</li>\n<li>Consultative and advisory skills.</li>\n<li>Skill in the use of survey and market research methodologies, systems, and techniques.</li>\n<li>Skill in the use of computerized spreadsheet, relational database, and word processing software.</li>\n</ul>\n\nEducation: Bachelors degree in Computer Science, Electrical/Electronic Engineering, Information Technology or another related field\n<br><br>\nExperience: Minimum 3-6 years\n<br><br>\nRelocation: This position will not cover relocation expenses\n<br><br>\nTravel: N/A\n<br><br>\nLocal Preferred: Yes\n<br><br>\nRecruiter Name: Tarun Garg\n<br><br>\nRecruiter Phone: 877.884.8834 (Ext: 2188)\n<br><br>\nEqual Employment Opportunity\n<br><br>\nMinimum Education Required: Bachelor Years of Experience Required: 3-5 Years Expected Travel Time: None"}