{"job title": "Quality Data Analyst - Clinical Integration (West Cancer Center)", "company": "Methodist Le Bonheur Healthcare", "city state": "– Germantown, TN", "rating": "4.2", "job description": "<p><b>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</b></p><div><div><p></p><p>Summary\n</p><p></p><p>Responsible for analyzing medical information that details the clinical assessment of patients. Maintains cancer data management standards as outlined by the American College of Surgeons Commission on Cancer and American Joint Committee on Cancer (AJCC). Models appropriate behavior as exemplified in <strong>West Cancer Center, Vision and Values. </strong></p>\n<p></p><p></p><p></p><p>Education/Experience/Licensure\n</p><p></p><div> <p> </p> <p><strong>Education/Formal Training</strong></p> <p><strong>Work Experience</strong></p> <p><strong>Credential/Licensure</strong></p> </div><div> <p> </p><p><strong>REQUIRED:</strong></p> <p> </p><p>Some college with the inclusion of Human Anatomy and Physiology courses or completion of similar college course hours with an emphasis in science courses that relate to healthcare such as biology, chemistry, physiology, genetics.</p><p> </p> <p>Experience with Microsoft Word and Excel</p> <p>NA</p> </div><div> <p> </p><p><strong>PREFERRED: </strong></p> <p>Associates Degree or Bachelor of science degree with emphasis on courses related to healthcare such as biology, chemistry, physiology, and genetics.</p> <p>Experience in oncology, or in science or healthcare research</p> <p>NA</p> </div><div> <p> </p><p><strong>SUBSTITUTIONS ALLOWED:</strong></p> <p>NA</p> <p>NA</p> <p>NA</p> </div>\n<p></p><p></p><p></p><p>Knowledge/Skills/Abilities\n</p><p></p><ul><li>Ability to understand moderately complex written materials such as patient medical records and technical manuals and to aggregate data reports.</li><li>Possess education, experience or training to work with oncology data abstraction.</li><li>Ability to communicate verbally and in written form with Associates, company leaders, physicians and their staff, patients and others.</li></ul><ul><li>Ability to organize multiple tasks and projects and maintain control of work flow.</li><li>Ability to work with limited supervision.</li></ul>\n<p></p><p></p><p></p><p>Key Job Responsibilities\n</p><p></p><ul><li>Coordinates the retrieval of medical records and other clinical data for patients who meet the criteria for inclusion data submissions or analysis</li><li>Codes the patient information into the oncology database.</li><li>Performs follow up on data for assigned patients.</li><li>Maintains quality and productivity standards set forth for the department.</li><li>Maintains confidentiality of all patient and department information. Understands, applies, and supports departmental policies, procedures and standards.</li><li>Demonstrates initiative in identifying opportunities for self-development and enhancement of professional competency.</li><li>Performs other job functions as needed to fulfill department goals.</li></ul>\n<p></p><p></p><p></p><p>Physical Requirements\n</p><p></p><ul><li>The physical activities of this position may include climbing, pushing, standing, hearing, walking, reaching, grasping, kneeling, stooping, and repetitive motion.</li><li>Must have good balance and coordination.</li><li>The physical requirements of this position are: light work - exerting up to 25 lbs. of force occasionally and/or up to 10 lbs. of force frequently.</li><li>The Associate is required to have close visual acuity to perform an activity, such as preparing and analyzing data and figures; transcribing; viewing a computer terminal; or extensive reading.</li><li>The conditions to which the Associate will be subject in this position: The Associate is not substantially exposed to adverse environmental conditions; job functions are typically performed under conditions such as those found in general office or administrative work.</li></ul>\n<p></p><p></p></div></div>"}