{"job title": "Data Analyst - Frankfort KY", "company": "NTT DATA", "city state": "– Northern Kentucky Industrial Park, Kentucky", "rating": "3.1", "job description": "Job Ref: **********\n<br><br>\nEmployer: NTT DATA\n<br><br>\nCountry: United States\n<br><br>\nCounty/State: Kentucky\n<br><br>\n<strong>Address:</strong>\n<br><br>\nPost Date: 08/09/2018 00:20\n<br><br>\nReq ID: 26885\n<br><br>\nAt NTT DATA Services, we know that with the right people on board, anything is possible. The quality, integrity, and commitment of our employees are key factors in our company's growth, market presence and our ability to help our clients stay a step ahead of the competition. By hiring the best people and helping them grow both professionally and personally, we ensure a bright future for NTT DATA Servicesand for the people who work here.\n<br><br>\nNTT DATAServices currently seeks a Data Analyst - Frankfort KY to join our team in Frankfort , Kentucky (US-KY) , United States (US) .\n<br><br>\nThis candidate will be part of a team made up of Project Managers, Database and Web Developers, Data Modelers, DBAs, Business Analysts, Report Analysts, Technology Specialists, ETL Specialists and Security NA candidate will be working with customers gathering requirements for various projects; utilizing Optum's project management methodology; creating detailed design specifications and then following the project through implementation.\n<br>\n<strong>Responsibilities include:</strong>\n<br><br>\nAnalyze entity relationship diagrams, file specifications, and physical or logical database data models to create detailed ETL mappings, Web API designs or business intelligence report specifications\n<br>\nPerform data analysis, data cleansing, test data creation, and data verification as part of design and testing activities\n<br>\nCreate the testing documents and matrixes, and will be responsible for assisting the customer with user testing\n<br>\nAssist the technical and business teams with project-related formal documentation\n<br>\nMeet with users for clarification and elaboration as may be necessary to clearly define a problem and conceptualize a development plan\n<br>\n<strong>Skills:</strong>\n<br><br>\nMedicaid/Medicare or Healthcare industry experience (especially Kentucky Medicaid)\n<br>\nPrevious experience working with the Data Modelers and developers, facilitate modification of the logical design to create a physical design most suited to the reporting needs of the customer\n<br>\nAbility to design applications taking into consideration data reconciliation (to the source system), query/reporting performance, and analytical business value\n<br>\nBusiness Analyst experience in a state government environment\n<br>\nMedicaid/Medicare or Healthcare industry experience\n<br>\nExperience with Data Profiling\n<br>\nExperience with Data Transformations and Data Cleansing\n<br>\n<strong>Qualifications:</strong>\n<br><br>\n5+ years Data Analyst, Technical Business Analyst, Systems Analyst or Business Analyst experience preferably in a Data Warehouse project environment\n<br>\n5+ years working with technical developers end users/customers to strategize solutions to align with business requirements\n<br>\n4+ years analyzing database structures and developing detailed specifications for ETL, Web API, or reporting requirements\n<br>\n5+ years working knowledge of relational databases/database structures\n<br>\nBachelor's degree or equivalent work experience\n<br>\nThis position is only available to those interested in direct staff employment opportunities with NTT DATA, Inc. or its subsidiaries. Please note, 1099 or corp-2-corp contractors or the equivalent will NOT be considered. We offer a full comprehensive benefits package that starts from your first day of employment.\n<br><br>\nAbout NTT DATA Services\n<br><br>\nNTT DATA Services partners with clients to navigate and simplify the modern complexities of business and technology, delivering the insights, solutions and outcomes that matter most. We deliver tangible business results by combining deep industry expertise with applied innovations in digital, cloud and automation across a comprehensive portfolio of consulting, applications, infrastructure and business process services.\n<br><br>\nNTT DATA Services, headquartered in Plano, Texas, is a division of NTT DATA Corporation, a top 10 global business and IT services provider with 118,000+ professionals in more than 50 countries, and NTT Group, a partner to 88 percent of the Fortune 100. Visit NA to learn more.\n<br><br>\nNTT DATA, Inc. (the 'Company') is an equal opportunity employer and makes employment decisions on the basis of merit and business needs. The Company will consider all qualified applicants for employment without regard to race, color, religious creed, citizenship, national origin, ancestry, age, sex, sexual orientation, genetic information, physical or mental disability, veteran or marital status, or any other class protected by law. To comply with applicable laws ensuring equal employment opportunities to qualified individuals with a disability, the Company will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant or an employee unless undue hardship to the Company would result."}