{"job title": "BI/Data Analyst", "company": "Platinum Enterprise Solutions", "city state": "– Los Angeles, California", "rating": "4.2", "job description": "<strong>Location - 11925, Wilshire Blvd, Los Angeles, CA 90049</strong>\n<br><br>\n<strong>Duration - 6 months, extension 12-18 months</strong>\n<br><br>\n<strong>Start Date - ASAP</strong>\n<br><br>\nThe Advanced Ad Product Business Intelligence Analyst provides reporting and will help maintain reporting solutions which distill complex data sets into readily accessible reports for senior executives. This person possesses an in-depth understanding of digital analytics, reporting, advertising platforms and databases. They will be part of a team responsible for delivering reporting, analysis, and forecasting of key sales and audience delivery of non-linear TV.\n<br><br>\nResponsibilities:\n\n<ul>\n\n\t<li>Support Finance, Sales and other key business areas by providing timely reporting, relevant analysis and insights</li> \n\n<li>Work with multiple data sets to provide regular KPI reports to various cross functional teams</li> \n\n<li>Maintain a high-quality output and exceptional customer service: effectively communicate at all levels, ensure that work gets done well and on time</li> \n\n<li>Efficiently prioritize work to supplement weekly and monthly reporting and insights with ad-hoc analysis, automated reports generation and dashboards</li> \n\n<li>Collate and distributing weekly / monthly performance reports</li> \n\n<li>Create and/or maintaining recurring digital advertising and media reports</li> \n\n<li>Perform Quality Control tests of data and reports as needed</li> \n</ul>\nQualifications:\n\n<ul>\n\n\t<li>Detail-oriented with superior organizational skills. Able to navigate between multiple projects, meet deadlines, and process ad hoc requests.</li> \n\n<li>Excellent communication skills</li> \n\n<li>Fluency in data analysis, including experimentation, data visualization and defining KPIs and communication around data to inform the success of the business and its features.</li> \n\n<li>Experience in the areas of marketing analytics, marketing data science, business intelligence, and data visualization at a TV network or agency, research or digital media services firm</li> \n\n<li>A deep understanding or and experience in non-linear TV and/or digital media metrics</li> \n</ul>\nSkills and Knowledge:\n\n<ul>\n\n\t<li>1.5+ years of reporting and analysis experience in the advertising or Media and Entertainment industry required</li> \n\n<li>Experience working one or more of media analytic platforms: FreeWheel, DFP, Hulu, Rentrak, comScore for building reports is required</li> \n\n<li>Advanced in MS Excel with the ability to do V-lookups, pivot tables, MATCH, IF, and other formulas</li> \n\n<li>Experience with Adobe Analytics a major plus</li> \n\n<li>Experience producing data visualizations with Excel, Tableau, or MicroStrategy is a plus</li> \n\n<li>Experience working with BI Tools Alteryx or Knime is a plus</li> \n\n<li>Experience working with Amazon Web Services Redshift, S3 is a plus</li> \n\n<li>Bachelor’s degree (B.A., B.S.) from an accredited college or university in Marketing, Computer Science, Mathematics, Statistics, Communications, Media or related field</li> \n</ul>\nApplicants must be authorized to work in the U.S.\n<br><br>\nPlease apply directly to by clicking 'Click Here to Apply' with your Word resume!\n<br><br>\nLooking forward to receiving your resume and going over the position in more detail with you.\n<br><br>\nThe Platinum Team!\n<br><br>\nPlatinum is proud to be an Equal Opportunity Employer!\n<br><br>\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\nYour Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\n<br><br>\nCopyright © 2006 - 2018. Platinum ESOL, Inc. All rights reserved."}