{"job title": "Investment Operations Data Analyst", "company": "Putnam Investments", "city state": "– Boston, Massachusetts", "rating": "3.3", "job description": "<div>\n<div>\n<div>\nInvestment Operations Data Analyst<br>\n\n <div>\n<div>\nNew</div>\n\n<br>Boston, Massachusetts</div>\n</div><br>\n\n<div>\n<div>\n<div>\n<div>\nMarket Data Services\n<br><br>\nB51019 - Investment Services and Ops\n<br><br>\n<strong> </strong>\n<br>\n<strong> </strong>\n<br>\n<strong> </strong>\n<br>\n<br>\n 5 hours ago Post Date</div><br>\n\n<div>\n<div>\n<div>Apply for Job</div><br>\n\n<div>\nShare this Job</div><br>\n\n<div>Sign Up for Job Alerts</div></div>\n</div>\n</div><br>\n\n<div>Please note: This opening is for the 6:00 a.m. to 2:00 p.m. shift.\n<br><br>\nThis is a great opportunity to leverage your operations experience and advanced technical skills. The Data Analyst works closely with our Investments team providing superior securities data oversight.\n<br><br>\nAs part of the Market Data Services group, this individual will be responsible for the validation of information from third party sources and internal Putnam sources. The information will be specific to fixed income data required to support portfolio management, trading, research, client reporting and the portfolio construction process. The data analyst will be required to work in Putnam’s Boston office and will have daily interaction with the aforementioned teams.\n<br><br>\nThe data analyst will be focused on security reference and analytical data for the universe of fixed income securities held by Putnam and our respective benchmarks.\n<br><br>\nThe data analyst will interface with external and internal data providers and will also have extensive contact with the investment teams in determining and resolving data requirements. The data analyst will also work closely with the systems groups in identifying and resolving issues. The data analyst will update and maintain data in various databases used by the investment teams and will coordinate resolutions of any problems in a timely manner. This individual will be responsible for knowing what data the vendors provide as well as understanding how the data is used at Putnam. This individual is also responsible for doing analysis and testing when reviewing enhancements that may change any methodology or structures within our systems.\n<br><br>\n<strong>Primary responsibilities:</strong>\n\n<ul>\n<li>Perform timely and accurate review of data according to our set standards and procedures.</li>\n<li>Maintain a high level of customer service by ensuring that all fixed income data issues are resolved, and action is taken to communicate effectively with our internal clients.</li>\n<li>Identify best practices and define procedures for market data validations &amp; controls; streamline and document new processes and guidelines as needed.</li>\n<li>Proactively identify redundant and/or underutilized procedures and/or data validation methods</li>\n<li>Partner with peer team members of the Security Reference Data team to provide ad-hoc data analysis, and/or guidance on fixed income data conventions</li>\n<li>Collaborate with Putnam’s technology group on special projects &amp; database enhancements as needed.</li>\n</ul>\n\n<div>\n\n\n<ul>\n<li>Bachelor’s degree and a minimum of two years of related experience (fund accounting, corporate actions, data, operations etc.)</li> \n\n<li>Strong orientation to and knowledge of investment management information needs</li>\n<li>Strong attention to detail – ability to detect errors &amp; take corrective action</li>\n<li>Aptitude for data mining technologies – Advanced Excel, Access, SQL, VBA, Python</li>\n<li>Knowledge of fixed income market data required</li>\n<li>Understanding of business concepts, basic accounting principles, accrual methodologies desirable</li>\n<li>Exemplary communication, interpersonal, and presentation skills</li>\n<li>Demonstrated ability to work independently and collaboratively with all levels of staff and management</li>\n<li>Superior skill and ability in multi-tasking and appropriate prioritization</li>\n<li>Ability to effectively respond to dynamically changing work environment and to positively influence business outcomes</li>\n</ul>\nAt Putnam we are committed to a diverse workforce and take positive steps to ensure equal opportunity in our recruitment process. We also undertake to hire, develop and retain the most talented individuals by valuing the varied skills that you bring.</div>\n</div>\n</div>\n </div>\n </div>\n</div>\n\n<br>"}