{"job title": "Data Operations Analyst", "company": "RevolutionParts", "city state": "– Phoenix", "rating": "4.7", "job description": "<strong><br><br><strong>About RevolutionParts</strong>:</strong>\n<br>\nRevolutionParts is a rapidly-growing, 50+ employee SaaS company based in sunny Arizona. Were a tech company dedicated to modernizing the auto industry with a revolutionary eCommerce platform thats already helped hundreds of dealerships nationwide sell auto parts online.\n<br><br>\nWere seeking talented individuals who can adapt to a fast-paced environment. Join our team to work with a down-to-earth group of people who stick to our core values and genuinely care about providing a quality experience to customers and employees alike!\n<br><br>\n<strong>About the Role</strong>:\n<br>\nA data operations analyst has three primary areas of responsibility: data operations, data analyst, and data pipeline engineering. This person will work closely with our customer success and software engineering teams. They will be responsible for building and running reports to analyze the data and determine the best course of action to improve our platform.\n<br><br>\n<strong>What youll do</strong>:\n\n<ul>\n<li>Data Operations</li>\n<li>Maintain a list of data sources, what type of data we get from each data source, who/how to contact the data source, and maintain a calendar of when we receive the data from that source to maintain service level agreements.</li>\n<li>Retrieve data on-demand: Respond to ad-hoc requests to retrieve data from a source outside of normal delivery.</li>\n<li>Find new data source: We may discover that we need data; work with stakeholders to help source that data through dealers, auto groups, or OEMs.</li>\n<li>Investigate and fix reported issues from our customers and determine severity of the issue.</li>\n<li>Work with external data providers to resolve data or delivery issues (file tickets, phone calls, emails, etc).</li>\n<li>Data Analysis</li>\n<li>Do root cause analysis discovery on issues that affect more than a single part number.</li>\n<li>Establish parts baseline numbers for data metrics on a per source, per manufacturer basis.</li>\n<li>Analyze order cancellations and establish baselines.</li>\n<li>Establish goals and suggest ways to improve order cancellations rates.</li>\n<li>Analyze dealer overrides and recommend how those overrides should be leveraged by our entire platform.</li>\n<li>Data Design &amp; Engineering</li>\n<li>Define and improve data pipeline for better data outcomes (through Jira stories)</li>\n<li>Define and suggest verifications we are missing (through Jira stories)</li>\n<li>Define automation on new and existing data sources (through Jira stories)</li>\n<li>Automate overrides</li>\n<li>Implement any of the above (stretch goal).</li>\n</ul>\n<strong>What you need</strong>:\n\n<ul>\n<li>Can do attitude</li>\n<li>Great analysis skills</li>\n<li>Good customer support skills</li>\n<li>Ability to communicate across teams and with external parties</li>\n<li>Strong SQL Skills</li>\n<li>Ability to describe projects that could improve our data</li>\n<li>Experience with Atlassian Suite (Jira/Confluence) a plus</li>\n<li>Experience with Google Analytics a plus</li>\n<li>Experience with Amazon Redshift a plus</li>\n</ul>\n<strong>Why youll like working here</strong>:\n\n<ul>\n<li>Top salary and stock options</li>\n<li>Medical, dental, and 401k retirement plan</li>\n<li>Rewards for high-performers (opportunity for bonuses!)</li>\n<li>Opportunity for career advancement</li>\n<li>Collaborative team environment that values multiple perspectives and fresh thinking</li>\n<li>Flexible hours and PTO</li>\n<li>Casual dress code</li>\n<li>Free food! Catered lunch every Friday + fully stocked fridge and snacks</li>\n<li>Drinks on us with team happy hours and beer fridge</li>\n<li>Gym reimbursement</li>\n</ul>"}