{"job title": "Business/Data Analyst", "company": "Sharp HealthCare", "city state": "– San Diego, California", "rating": "3.9", "job description": "<div>Sharp HealthCare</div><div><strong>Facility:</strong>Sharp HealthPlan<br><strong>City</strong>San Diego<br><strong>Department</strong>Finance<br><strong>Job Status</strong><p>Full-Time</p><strong>Shift</strong><p>Day Job</p><strong>FTE</strong><p>1.0</p><strong>Shift Start Time</strong><p>Variable</p><strong>Shift End Time</strong><p>Variable</p><p>\n</p><div>\n<p><strong>Location</strong> \n</p><p>This position is located in Kearny Mesa, San Diego County </p>\n<p></p>\n<p><strong>Hours</strong> \n</p><p>8-hour shift: 8:00 am 5:00 pm, weekends as needed. </p>\n<p> </p>\n<p></p>\n<p><strong>Required Skills and Qualifications</strong> \n</p><ul>\n<li>\n<div>Bachelor's degree in health, business, computers or equivalent work experience</div></li>\n<li>\n<div>Previous experience in a managed care setting</div></li>\n<li>\n<div><strong>SQL skills including stored procedure development in SQL Server/Transact SQL and/or Oracle</strong></div></li>\n<li>\n<div><strong>Experience with SSIS or other ETL solution, reporting tools such as SSRS or Power BI. An understanding of database design concepts, data analysis, </strong><strong>BI development and exposure to data warehousing.</strong><strong> Ability to interact with customers and gather reporting requirements. Ability to meet frequent deadlines and tight schedules</strong>. </div></li></ul>\n<p> \n</p><p></p>\n<p><strong>Preferred Skills and Qualifications</strong> \n</p><ul>\n<li>\n<div>Experience in a managed care environment </div></li>\n<li>\n<div>General hospital, medical or other clinical experience </div></li></ul>\n<p></p></div>\n<p> </p>\n<p><strong>Additional physical requirements of position may be discussed during interview.</strong> \n</p><p></p>\n<p>Sharp HealthCare is proud to be an Equal opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, gender identity, transgender status, sexual orientation, protected veteran status or any other protected class.</p>\n<p> </p>\n<p>Keywords: Business Analyst, Finance, Database Development, Database, Data Analytics, Contracts</p><p></p><p></p><div><p><strong>Summary</strong></p><p>Under the direction of the Director of Medical Economics and Contracts, the Business Data Analyst provides Plan with data, database development and technical support, reporting and analyses that enable data driven decision making. Accesses a variety of databases and data storage devices which requires thorough investigation to ensure data integrity.Utilizes spreadsheets, data links from different sources and databases to include functionality of formulas, queries, importing and exporting of data to other programs, and monitors internal and external data needs on an ongoing basis.Provides summary analyses in written and oral presentation settings. Makes recommendations and/or participates in brainstorming activities related to issues that should be addressed and improvements made that can impact negative financial performance. </p><p></p><p>The Finance division is responsibel for the management of money and processing of reporting of information using a variety of different applications. The Finance division includes many functional areas such as Accounting/Billing, Claims Research, Contracting, Data Analytics, Data and Information Systems and Underwriting/ Actuarial.</p><p></p><div><b>Here's what Sharp Health Plan has to offer you:</b></div><div>Sharp Health Plan is the largest, locally-based commercial health plan in San Diego. We are a not-for-profit organization serving the needs of San Diegans since 1992. As a subsidiary of Sharp HealthCare, San Diegos largest provider of health care services, we not only serve the people of San Diego, we are the people of San Diego. </div><div></div><div>Through our unique integration with Sharp HealthCare, we connect our members to an award-winning network of hospitals, medical groups and physicians. We offer health insurance options for individuals, families, groups and businesses that combine affordability, choice, high-quality health care and personal service. </div><div></div><div>Sharp Health Plan is the highest member-rated Health Plan among reporting California Health Plans.* We're also accredited by the National Committee for Quality Assurance (NCQA) with a status of Commendable which is awarded to organizations with well-established programs for service and clinical quality. We continually strive to improve the quality of our services and benefits, and seek innovative solutions to todays complex health care issues. From helping you find the right health plan to the right doctor to being a great place to work, were here for you!</div><div></div><div>If you like the sound of what it means to be a Sharp Health Plan team member, and you meet the qualifications above, please submit your resume along with a brief explanation about why you would be a good fit for this position. We look forward to hearing from you. </div><div></div><div>*The source for this data is Quality Compass® 2016 and is used with the permission of the National Committee for Quality Assurance (NCQA). Quality Compass® 2016 includes certain CAHPS® data.</div><p></p><p></p><p></p></div><p></p></div>"}