{"job title": "CCPM - Cancer Data Analyst", "company": "University of Colorado", "city state": "– Aurora, CO", "rating": "4.1", "job description": "<div><strong>University of Colorado Denver l Anschutz Medical Campus</strong></div><div><strong>Division of Bioinformatics and Personalized Medicine</strong></div><div><strong>CCPM - Cancer Data Analyst</strong></div><div><strong>Position # 00730024 – Requisition 13938</strong></div><div></div><div><strong>* Applications are accepted electronically ONLY at www.cu.edu/cu-careers *</strong></div><div></div><div>The University of Colorado Denver l Anschutz Medical Campus seeks individuals with demonstrated commitment to creating an inclusive learning and working environment. We value the ability to engage effectively with students, faculty and staff of diverse backgrounds.</div><div></div><div><strong>The Division of Bioinformatics and Personalized Medicine has an opening for a full-time University Staff (unclassified) CCPM - Cancer Data Analyst position.</strong></div><br>\n<div>The University of Colorado Denver | Anschutz Medical Campus is a public research university serving more than 18,000 students. We award nearly 4,000 degrees each year, including more graduate and professional degrees than any other Colorado institution. With our solid academic reputation, award-winning faculty and renowned researchers, we offer more than 140 highly rated degree programs through 13 schools and colleges. The university receives over $400 million in research awards each year. In addition to the wide array of health-related programs and facilities offered at CU Anschutz in Aurora, Colo. a significant number of undergraduate and graduate degree programs are taught at CU Denver, our comprehensive campus in the heart of downtown Denver—one of America’s most vibrant urban centers. CU Denver is located steps from the Denver Center for Performing Arts and the LoDo District affording our students, faculty and staff access to a broad array of academic, professional, community, recreational and cultural outlets.</div><br>\n<div>A national leader in health care and life sciences, CU Anschutz is the only comprehensive academic health sciences center in Colorado and the largest in the Rocky Mountain region. Located in Aurora, Colo., it is one of the newest education, research and patient care facilities in the world. With six schools and colleges, CU Anschutz trains the health sciences workforce of the future by blending education, research and clinical care all in one place. This strategic collaboration among diverse health care fields allows knowledge to travel directly from the research bench to the patient’s bedside.</div> <br>\n<div>The University of Colorado Anschutz Medical Campus ranks among the top institutions nationally in clinical care, education and research. Its 230-acre campus, designed to enhance collaboration and interprofessional education, hosts the College of Nursing; the Schools of Dental Medicine, Medicine, Pharmacy, and Public Health; the Graduate School; a Health Sciences Library; and two hospitals. Strategically located contiguous to the campus are a biosciences research park and the soon-to-be-completed Veterans Hospital. CU Anschutz offers two undergraduate degrees, 35 graduate degrees, and five first-professional programs. More than 4,000 students learn alongside faculty members who also make meaningful medical discoveries and provide expert clinical care through 1.5 million patient-visits annually. A hub for research and innovation, CU Anschutz receives over $400 million in research awards each year and has filed 1,300 patent applications and formed 53 new companies since 2002.</div><br>\n<div><strong><u>Nature of Work</u></strong></div><div>The Center for Biomedical Informatics and Personalized Medicine is seeking a Cancer Data Analyst in support of its precision oncology program at the University of Colorado Denver’s Anschutz Medical Campus in Aurora, CO. This individual will work closely with clinical informaticians, researchers, and data analysts to obtain, curate and analyze cancer data to drive innovation in the field of precision oncology.</div><br>\n<div>To succeed in this mission, our academic partners must be able to depend on the quality and accuracy of the data available for analysis. Therefore, the Data Analyst is an essential member of our strong, highly collaborative team, helping ensure we deliver accurate, reliable data thorough data profiling and mapping. The Data Analyst will work with clinical data generated in the course of cancer treatment, genetic data generated by molecular profiling, and derivative data generated by predictive modeling. The successful candidate will have experience with obtaining and analyzing biomedical data, excellent ability to communicate with other members of the clinical and research teams, and a commitment to improving the care delivered to people diagnosed with cancer.</div><br>\n<div>This position requires a highly motivated individual that can work in a self-directed manner in a team-oriented environment. Attention to detail and excellent interpersonal skills are necessary to succeed in this role.</div> <br>\n<div><strong><u>Examples of Work Performed</u></strong></div><div>\n\n<ul>\n<li>Assist in mapping cancer data sources across clinical and research domains</li><li>Perform cancer-specific data quality checks</li><li>Liaise between clinicians, administrators, and researchers for data requests</li><li>Assist in data analysis</li><li>Assist in manuscript and grant generation</li></ul></div>\n<br>\n<div>This description is a summary only and is describing the general level of work being performed, it is not intended to be all-inclusive. The duties of this position may change from time to time and/or based on business need. We reserve the right to add or delete duties and responsibilities at the discretion of the supervisor and/or hiring authority.</div><br>\n<div><strong><u>Salary and Benefits</u></strong></div><div>The hiring salary for this position is $58,636 to $95,508 and is negotiable and commensurate with skills and experience. This position is not eligible for overtime compensation.</div><br>\n<div>The University of Colorado offers a full benefits package. Information on University benefits programs, including eligibility, is located at https://www.cu.edu/employee-services.</div>\n<br>\n<div><strong><u>Minimum Qualifications</u></strong></div><div>\n\n<ul>\n<li>Bachelor’s degree in any field. A degree in quantitative or life sciences preferred.</li> <li>2 years total of working experience with oncology data, including 1 year in data profiling, data quality, and/or data analysis/reporting.</li><li>Demonstrated success working in an integrated environment and working within a cross-functional team, including outstanding written and verbal communication, documentation, and presentation.</li><li>Experience in any aspect of healthcare data analysis lifecycle: Data Analysis, Data Capture, Data Provisioning</li><li>Experience working with clinical trials management systems and cancer research</li></ul></div>\n<br>\n<div><strong><u>Preferred Qualifications</u></strong></div><div>\n\n<ul>\n<li>Experience with data warehouses and healthcare-related data.</li><li>Education or certifications in technical or health-related fields.</li></ul></div>\n<br>\n<div><strong><u>Knowledge, Skills, and Abilities</u></strong></div><div>\n\n<ul>\n<li>Ability to interface with multiple stakeholder groups within the healthcare data ecosystem (clinicians, administrators, programmers, researchers, analysts)</li><li>Knowledge of at least one scripting or programming language. (SQL, python, R, java preferred)</li><li>Knowledge of precision oncology and related research on biomarkers</li><li>Familiarity with clinical data sources and types, particularly as they relate to cancer</li><li>Strong ability to communicate findings with developers and researchers</li><li>Provide input into tools and processes to improve the overall efficiency and quality of data integration activities.</li><li>Strong analytical skills, critical thinking, and attention to detail and accuracy</li></ul></div>\n<br>\n<div><strong><u>Diversity and Equity</u></strong></div><div>The University will provide reasonable accommodations to applicants with disabilities throughout the employment application process. To request an accommodation pursuant to the Americans with Disabilities Act, please contact the Office of Equity by email at equity_ada@ucdenver.edu or by phone at (303) 315-2567.</div><br>\n<div>The University of Colorado Denver | Anschutz Medical Campus is committed to recruiting and supporting a diverse student body, faculty and administrative staff. The university strives to promote a culture of inclusiveness, respect, communication and understanding. We encourage applications from women, ethnic minorities, persons with disabilities and all veterans. The University of Colorado is committed to diversity and equality in education and employment.</div><br>\n<div>The University of Colorado Denver | Anschutz Medical Campus is dedicated to ensuring a safe and secure environment for our faculty, staff, students and visitors. To assist in achieving that goal, we conduct background investigations for all prospective employees.</div>"}