{"job title": "Data Analyst - Pharmacy - FT 8 Hour Days (Non-Exempt)", "company": "University of Southern California", "city state": "– Los Angeles, CA", "rating": "4.3", "job description": "<p><b>The Pharmacy Business Analyst is responsible for pharmacy systems and outcomes in the following areas: 1) supply chain analysis, product procurement &amp; selection, inventory control, reporting, 2) 340B Program analysis, monthly reporting, dispensing patterns, inventory process, contract pharmacy optimization, 3) billing processes, charge master maintenance, 4) information support systems/technology development. As a member of the Pharmacy team, collaborates with the team to plan, organize and operate the department to achieve unit and organizational goals, meet customer needs and assure high quality services and products.</b></p><p></p><p></p>Minimum Education:<br>-College graduate in a health related field required; advanced degree preferred.<br><br>Minimum Experience/Knowledge:<br>-Education: Bachelor’s Degree in Information Technology, Finance, Business, or Accounting or four years’ equivalent experience.<br>-Experience: Financial operations and/or pharmacy operations experience in healthcare environment at a 340B covered entity preferred.<br>-Demonstrated expertise in pharmacy informatics and technology development and ability to work with teams to achieve specific results.<br>-Knowledge: This position requires a high degree of specialized knowledge in informatics and technology with an emphasis on 340B split billing, charge master databases, and information systems.<br>-Provides a health system coordination function required to assure security and regulatory compliance across all care sites.<br>-Applies a high degree of analytical, interpretive and evaluative skills, frequently dealing with complex concepts and imaginative approaches to problem definition and resolution.<br>-Project management expertise and complex system oversight key job accountability.<br>-Special Skills/Equipment: Demonstrated competencies in the use of information support systems, automated technologies and analytical tools in a health care setting and the ability to synthesize operational flow into a concrete work plan, with implementation oversight a critical component of this role.<br>-Proficient in Microsoft Office (namely Excel).<br>-Technical expertise regarding data models audit processes and database design development.<br>-Experience in data mining techniques and procedures and knowing when to use appropriately.<br><br>Required License/Certification:<br>-Fire and Safety Certification. If no card upon hire, one must be obtained within 30 days of hire, and maintained by renewal before expiration date.<p></p><p><u> </u></p><p><b>USC is an equal opportunity, affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristic protected by law or USC policy. </b><b>USC will consider for employment all qualified applicants with criminal histories in a manner consistent with the requirements of the </b><b>Los Angeles Fair Chance Initiative for Hiring</b><b> ordinance</b>. <b>We provide reasonable accommodations to applicants and employees with disabilities. Applicants with questions about access or requiring a reasonable accommodation for any part of the application or hiring process should contact USC Human Resources by phone at (213) 821-8100, or by email at uschr@usc.edu. Inquiries will be treated as confidential to the extent permitted by law.</b></p><p></p><p><b>Read USC’s Clery Act Annual Security Report</b></p><p><b>Required Legal Notices</b></p><p><b>Certain positions are subject to background screening</b></p><p><u> </u></p><p>If you are a current USC employee, please apply to this USC job posting in Workday by copying and pasting this link into your browser:</p>https://wd5.myworkday.com/usc/d/inst/1$9925/9925$18623.htmld"}