{"job title": "Sales Data Analyst", "company": "UPG Company, LLC", "city state": "– Houston, TX", "rating": "NA", "job description": "Job Description<div><strong>Are you ready for a challenging, yet rewarding career? Are you a Data Analyst professional with EXTENSIVE experience with MS excel, Access and power point? If you answered yes, then let's talk!</strong>\n<br><br>\nUPG Company, LLC IS seeking a <strong>Sales Data Analyst</strong> to provide analytical support to sales and business development teams by performing various technical, and analytical task, and assignments.\n<br><br>\n<strong>REPORTING RELATIONSHIP:</strong>\n<br><br>\nReports to Global Sales Director\n<br><br>\n<strong>KEY SUCCESS FACTORS:</strong>\n<ul>\n<li>Advanced to Expert level experience and knowledge in Microsoft Office, specifically, Excel, PowerPoint, and Word</li><li>Ability to establish and build rapport and relationships with key stakeholders and decision makers.</li><li>Independently motivated, a collaborative teammate with an affinity for adapting to different situations and personalities.</li>\n</ul>\n<strong>COMPENTENCIES:</strong>\n<br><br>\n<strong>1. Data-Driven</strong>\n<br><br>\n<strong>2. Proficient in Microsoft Access – Performing queries</strong>\n<br><br>\n<strong>3. Advance level skills in Microsoft Excel</strong>\n<ul>\n<li>Use advanced functions (Names, VLOOKUP, IF, IS).</li><li>Power Query</li><li>Proficient in Function Formulas</li><li>Work with Pivot Tables.</li>\n</ul>\n<strong>4. Advance level skills in Microsoft PowerPoint</strong>\n<ul>\n<li>Create a template and work with a Design template.</li><li>Work with graphics, animation and multimedia, inserting movies and sound.</li><li>Work with the Office Suite to create slides from an outline and send slides to Microsoft Word.</li><li>Customize PowerPoint toolbars and automate the slide production.</li><li>Use Auto-Correct and the Style Checker.</li><li>Technical Capacity.</li>\n</ul>\n<strong>ESSENTIAL FUNCTIONS:</strong>\n<br><br>\n<strong>1. Data Coordination and Field Reporting</strong>:\n<ul>\n<li>Interpret data and analyze results using statistical techniques and provide ongoing reports across multiple spreadsheets</li><li>Identify, analyze, and interpret trends or patterns in complex data sets</li><li>Maintains existing sales reports and designs new reports as needed.</li><li>Prepares and administers Sales Funnel reporting on a monthly, and quarterly basis.</li><li>Coordinates sales data across all sites.</li><li>Experience with using ODBC Connection and querying Microsoft Access</li><li>Querying AS/400 is a plus.</li>\n</ul>\n<strong>2. Presentations Preparation</strong>:\n<ul>\n<li>Develops and maintains professional PowerPoint presentations in conjunction with global sales teams.</li><li>Build interactive presentations, using hyperlinks, creating interactive objects, working with Slide Show options, and using the Meeting Minder.</li><li>Evaluates third-party solutions for appropriate sales operations functions as needed.</li>\n</ul>\n<strong>3. Technical Capacity</strong>:\n<ul>\n<li>Utilizes the appropriate systems to generate and produce specific user-end reporting.</li><li>Maintains all sales demonstration tools and applications.</li><li>Prepares and track quotes, and contracts for potential and existing customers.</li><li>Maintains all quote documentation with accurate pricing and configurations.</li><li>May assist in New Product Introduction planning and process.</li>\n</ul>\n<strong>4. Other Duties</strong>:\n<ul>\n<li>Maintains up-to-date awareness of company activities, industry trends and government regulations.</li><li>Will provide administrative support as and where needed.</li><li>Coordinates and sends out the daily sales flash reporting.</li><li>Performs other duties as assigned by functional manager.</li></ul></div>\n<br>"}