{"job title": "Workforce Data Analyst", "company": "USfalcon", "city state": "– US-DC-Washington", "rating": "4.4", "job description": "<div><div>\n<div>USfalcon, Inc. recognized as one of the fastest growing, privately held companies in the United States, is seeking a mid-level Statistician to support workforce planning initiatives at the United States Secret Service (USSS), Office of Human Resources (HUM) in Washington, DC. If you have junior to mid level experience in your technical field and some experience with workforce models this is a great opportunity to grow your capabilities and expand your experience! Workforce planning and analysis duties include federal staffing for developing, assessing and forecasting workforce planning models and statistical analysis. You will help our customer collect, maintain and share personnel data unique to function and organizational mission with other divisions and outside the Office of Human Resources. The USSS has many priorities which rely on or are influenced by data gathered within every major aspect of HUM’s portfolio (e.g. space management, workforce planning, IT support, organizational modeling, work/life initiatives, etc.), justifying the critical need to have a coherent and integrated HUM data system that will create efficiency and support reviews and forecasting to advance future change management initiatives. The work you do will enhance the ability of the Service to function efficiently and effectively through achievement of its human resources goals and objectives.</div>\n</div>\n</div>\n\n<br>Responsibilities<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li>Develop, assess and forecast workforce planning models and statistical analysis.</li> <li>Integrate a GUI based portal housing all HUM data especially integrating hiring, existing NFC systems, and employee assessment and performance metrics currently tracked.</li><li>Review and standardize data systems including variable names, coding schemes, and the creation of a common system code book for employees throughout the USSS to be able to identify and locate what data are tracked and available for consumption.</li><li>Provide continued support to integrate future data needs and code management.</li><li>Perform electronic entry and input of data into management system currently existing in outdated mediums</li><li>Create and optimize survey research instruments (e.g. work/life satisfaction surveys, separations surveys, etc.) to ensure standardization and quality of subjective measurements.</li></ul></div>\n</div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li>Bachelor's Degree with 4-10 years of experience.</li> <li>Experience with federal human resources and workforce modeling.</li><li>Experience with data analysis, modeling, and operations analysis.</li><li>Experience with IT systems and data management.</li></ul></div>\n</div>\n</div>\n<br>"}