{"job title": "Data Analyst I", "company": "Zebra Technologies", "city state": "– US-IL-Lincolnshire", "rating": "3.5", "job description": "<div><div>\n<div>This position, among other tasks, is responsible for supporting the leader of the Global Trade Compliance Office (the GTCO) with the standardization of import and export processes globally at Zebra, through analysis of various sources of data and through innovation of the processes via a targeted improvement effort and risk assessment. This role is responsible for data integrity of global HTS and ECCN data; analysis of performance of the service providers, e.g., Customs brokers; creation of metrics and reports, as required. This position is responsible for Power BI dashboard maintenance; Global Trade Management reports' analysis and support of the regional trade compliance teams with the data management tools, aimed at strengthening compliance and ensuring sealess import and export transactions.</div>\n</div>\n</div>\n\n<br>Responsibilities<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li>Policies, Procedures, Processes (Creation &amp; Implementation)</li>\n\n<ul>\n<li>Supports senior specialists and managers, as required, with respect to collecting information for processes and procedures</li><li>May initially draft processes and procedures that are then finalized by the senior specialists or managers.</li>\n</ul>\n\n<li>Systems &amp; Product Database Management / Trade Data Management (e.g., HTS, ECCN, COO)</li>\n\n<ul>\n<li>As assigned, helps with maintainance of HS commodity classification and Export Control Commodity Number (ECCN) databases by obtaining and reviewing technical information for Zebra's items.</li><li>Uses EBS, Agile, Trade Compliance tools, and various reports to maintain data integrity of ECCNs, HTS codes, and COOs, and other elements, as required.</li>\n</ul>\n\n<li>Customs Broker Selection &amp; Management</li>\n\n<ul>\n<li>Supports manager with SOP creation, maintenance, communication with Customs brokers</li><li>Provides information / feedback for Quarterly Broker Reviews (QBR)</li><li>Provides Parts database to the brokers after manager's approval</li>\n</ul>\n\n<li>Clearance / Processes / Export Controls (Export, Import or Both)</li>\n\n<ul>\n<li>Answers routine questions from various stakeholders related to import and export documentation and processes.</li><li>Runs reports for analysis of the KPIs.</li>\n</ul>\n\n<li>Recordkeeping</li>\n\n<ul>\n<li>Maintains library of records and hard copy files, as required by the manager.</li><li>Follows up with various sources, e.g., Customs brokers, Zebra departments, etc., for export and import information.</li>\n</ul>\n\n<li>Trade Compliance Audits &amp; Investigations</li>\n\n<ul>\n<li>As assigned, performs various points of analysis in support of the auditor's sampling.</li></ul>\n</ul>\n\n</div>\n</div>\n</div>\n\n<br>Qualifications\n<br><br>\n<strong></strong><div><strong>\n</strong><div><strong>\n</strong><div><strong>\n\n</strong><ul><strong>\n<li>Required Education:</li>\n\n</strong>\n\n<ul>\n<li>Bachelor’s degree from an accredited U.S. University</li>\n</ul>\n\n<strong><li>Required Work Experience (years):</li>\n\n</strong>\n\n<ul>\n<li>a minimum of 0-1 years of trade compliance experience, such as regulatory work experience with import or export laws &amp; regulations, or both.</li><li>a minimum of 1-2 years of data analysis and management.</li>\n</ul>\n\n<strong><li>Required Skills and Competencies:</li>\n\n</strong>\n\n<ul>\n<li>Advanced Power BI</li><li>Advanced Query Languages (PLSQL, MySQL, OracleSQL, T-SQL, etc.)</li> <li>Advanced Data Mining</li><li>Advanced Data Modeling</li><li>Advanced Microsoft Excel (Data Analytics Expressions, pivot tables, V-Look ups, data visualization)</li><li>Advanced knowledge of MS Word</li> <li>Advanced Project Management Skills</li><li>Resolves a wide range of issues in innovative as well as practical ways</li></ul>\n</ul>\n\n</div>\n</div>\n</div>\n<br>"}