{"job title": "Data Analyst - Alexa", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nYou: “Alexa, I’m looking for a job where I can build products straight out of science fiction.”<br> Alexa: “I have found matching jobs for you in the Alexa Knowledge team in Seattle, Washington. What role are you looking for?”<br> You: “I’d like to work on making you even smarter than you are today.”<br> Alexa: “Wonderful. I found just the right job for you. Here are the details … “<br><br>Our focus in the Canadian Alexa Knowledge team combines natural language understanding, acquiring large volumes of structured knowledge, and building autonomous machine reasoning to allow our customers to get answers to their questions in the most natural way possible. <br> <br> Your new role<br> <br>As a Data Analyst you will work closely with the Canadian Alexa Knowledge team and with teams based at other locations worldwide. The role involves a broad range of data curation and management tasks with direct customer impact. You must be capable of independently delivering high quality work under aggressive time constraints. This will offer you a chance to be part of a fast-paced team building the leading products of the future.<br> <br> Your responsibilities will include:<br> <ul><li>Enhancements to knowledge systems (i.e. teach Alexa more things)</li><li>Content production and maintenance for new knowledge areas</li><li>Data verification &amp; correction to check data conforms to predetermined set of norms and provides a good customer experience</li><li>Data entry, using a range of interfaces to update Amazon systems with new information</li><li>Localization of existing experiences to make the customer experience in Canada truly great</li></ul>In this role, you will get to show your exceptional attention to detail and follow-through. You will also capitalize on your ability to multitask across several domains of data and work autonomously with minimum direction. <br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Native-level proficiency in English/French Canadian</li><li>Prior experience working with language components</li><li>Prior experience working autonomously with minimal supervision</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Interest in linguistics or technology</li><li>Excellent written and verbal communication skills</li><li>Experience with computer linguistics / natural language processing on computers</li><li>Experience with storing structured knowledge for computer access</li><li>Highly efficient with excellent attention to detail; able to maintain quality at a fast pace</li><li>Adaptable; able to learn new tasks quickly and switch between them as required</li></ul>Amazon is an Equal Opportunity Employer – Minority / Women / Disability / Veteran / Gender Identity / Sexual Orientation<br><br>Are you interested? We look forward to receiving your application.<br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}