{"job title": "Data Analyst / Business Intelligence Analyst", "company": "BARK", "city state": "– New York, NY", "rating": "3.5", "job description": "<strong>ABOUT BARK:</strong>\n<br><br>\nBARK is a company building products, experiences, and entertainment for dogs and the people who love them. The lasting brand that Disney has built for kids and families, BARK is building for the fast-growing market of dog people.\n<br><br>\nOur ambition-level is high, the opportunity is huge, and our love for dogs is through the roof! We launched in 2011 with BarkBox, a monthly themed subscription of all-natural treats and clever toys. Since then, we've shipped more than 50 million toys and treats to the dogs across the world and use all of that direct customer feedback to inform new initiatives and ways to make dogs happier.\n<br><br>\nBut what kind of company is BARK? It's a company that has gone to the dogs. We are committed to a culture that is open, inclusive, generous, and enthusiastic just like our pups. United by this dog-obsession, we embrace diversity of all stripes and spots. If your camera roll is 90% pictures of your dog, you belong here.\n<br><br>\nAt BARK, we know that dogs aren't pets; they're family. Our people crazy dog people believe that their dogs deserve the best. The best treats, the best toys, the best seat on the couch. Together, we're driven to be the people our dogs think we are.\n<br><br>\n<strong>WHO WE'RE SNIFFIN' FOR:</strong>\n<br><br>\nCan you give a pup belly scratches until you get carpal tunnel? Listen to squeaky toys until your ears bleed? BARK is a fast-growing business for people who love, (*ruv) dogs.\n<br><br>\nAs a Data Analyst / Business Intelligence Analyst at BARK, you will analyze data to extract insights and meaning and drive decision making in one or more functional areas including growth, marketing, finance, operations/planning/logistics, product, and/or customer service. In this hands-on strategic role, you will work with leadership, collecting and setting priorities within functional area(s) to manage key performance metrics and data reporting.\n<br><br>\n<strong>DOODIES:</strong>\n\n<ul>\n<li>Write and maintain queries or scripts for reporting and performing analysis</li>\n<li>Define and document key metrics and underlying data, providing guidance to business and data science</li>\n<li>Track and communicate business process changes and trends in the data, acquiring and disseminating subject matter expertise in functional area(s) as it relates to data</li> \n\n<li>Communicate with Data Engineers and Data Scientists to surface data integrity issues and scope data requirements</li>\n<li>Design / formulate data visualizations for business stakeholders</li>\n</ul>\n<strong>EXPERIENCE:</strong>\n\n<ul>\n<li>2+ years' experience using data analysis to drive research or decision making</li>\n<li>Degree in quantitative field such as Math, Economics, Statistics, Engineering, Operations Research, Business, or Sciences</li>\n<li>Proficient in SQL, Python, or R</li>\n<li>Excellent written and verbal communication and interpersonal skills</li>\n<li>Strong attention to detail and nuance</li>\n<li>Experience visualizing data for a non-technical audience</li>\n<li>Motivated self-starter</li>\n</ul>\n<strong>BONUS POINTS</strong>\n<br><br>\nThe Data Analyst need not possess these skills on Day 1, but would be encouraged to grow into many of these areas over time, and recognized as an especially strong applicant if any of these points were already met:\n\n<ul>\n<li>Experience using Git or other version control systems</li>\n<li>Demonstrated aptitude in picking up new technologies</li>\n<li>Experience working with BI tools, especially Periscope</li>\n<li>Knowledge of statistical concepts and techniques</li>\n<li>Ability to build machine learning models to serve the business</li> \n\n<li>Moderate grasp of bash / Linux commands</li>\n</ul>\n<em>This position is a full-time, salaried position. It is located on-site at our office in New York, NY. We offer health insurance for both you and your pup, 401k, wonderful team lunches, unlimited PTO and a dog to pet anytime you wish.</em>"}