{"job title": "Senior Business Data Analyst", "company": "BlueVine", "city state": "– Redwood City", "rating": "4.2", "job description": "At BlueVine, were transforming how businesses get access to working capital financing. Founded in 2013, our online lending platform has helped 10,000+ business owners simplify their cashflow management, boost growth, and take advantage of new opportunities. As a leading FinTech company, were backed by Menlo Ventures, LightSpeed Ventures, 83North, Silicon Valley Bank, Citi Ventures, among other notable investors. Our clients love us, the market were going after is huge, and were just getting started.\n<br><br>\nBlueVine is looking for a thoughtful, resourceful, and detail-oriented person to join our growing BI team! We are building an elite team of smart and driven individuals to grow BlueVine's business with insightful, accurate, and actionable data analysis.\n<br>\nAs a Senior Business Data Analyst at BlueVine, you'll work as a member of the BI team with stakeholders across the business to define, scope, and deliver on analytics needs. Working in SQL and Tableau, your analysis will inform decisions across all functions of the company, across our different locations. You'll be a key player of our BI team, as we continue to define our business data structures. You'll be part of a driven, fast-paced team focused on data excellence and thoughtful insights that adapts quickly to the needs of our fast-growing business.\n<br>\n<strong>WHAT YOU'LL DO</strong>:**:\n\n\n<ul>\n<li>Scope, design, and deliver analysis and reporting for teams across the company.</li>\n</ul>\n\nDevelop new analysis in SQL, adapt and improve existing SQL queries.\n<br>\nBuild reports in Tableau, improve existing reports.\n<br>\nCompare reporting outputs to source data, identify data quality issues and resolve.\n<br>\nManage monthly reporting data gathering and outputs using SQL, Tableau, and internal BI team tools.\n<br>\nWork across BlueVines teams to understand their data needs and analytics requirements, find ways to reduce time to decision and improve decision accuracy.\n<br>\nAct as a resource for Tableau and SQL development. Share best practices and lessons learned.\n<br>\nContribute to documentation, best practices, and internal BI trainings.\n<br><br>\n<strong>WHAT WE LOOK FOR</strong>:**:\n\n\n<ul>\n<li>2-5 years in an analytics, reporting, BI, or data science role, with a track record of results.</li>\n</ul>\n\nStrong SQL skills, preferably in Redshift or PostGreSQL.\n<br>\nStrong Tableau skills developing views and dashboards. Publicly available Tableau portfolio a strong plus.\n<br>\nExperience working with Tableau Server or Tableau Online data sources and extracts.\n<br>\nExperience working directly with business teams for requirements gathering and reporting delivery.\n<br>\nExcellent communication and organizational skills, both written and verbal.\n<br>\nFanatical eye for detail, and the desire to roll up your sleeves and resolve issues.\n<br>\nAbility to be flexible and comfortable with changing requirements.\n<br>\nAbility to handle multiple projects in a fast paced, hyper growth environment.\n<br>\nPython experience a strong plus.\n<br><br>\n<strong>BENEFITS &amp; PERKS</strong>:**:\n\n<ul>\n<li>Receive over $1,000 annually for a wellness benefit of your choice</li>\n<li>Free commuter benefits - CalTrain passes for SF employees and a monthly parking allowance for SF/NJ employees</li>\n<li>Weekly catered lunches</li>\n<li>Unlimited snacks in fully stocked kitchens</li>\n<li>Generous PTO and holidays</li>\n<li>Excellent health coverage and life insurance benefits</li>\n<li>Generous, paid parental leave which covers up to 15 weeks</li>\n<li>Pet-friendly offices</li>\n</ul>\nBlueVines mission is to help business owners succeed and thrive by making sure they have convenient access to capital for their everyday funding needs. Weve helped thousands of businesses since we started in 2013, funding more than $1 billion in working capital through our pioneering online platform. Our invoice factoring product allows business to receive cash advances on their outstanding invoices, offering factoring lines of up to $5 million. Our business line of credit product, called Flex Credit, offers financing based on 6-month and 12-month payment terms, and credit lines of up to $250,000. Based in Redwood City, Calif., BlueVine is backed by leading venture capital firms."}