{"job title": "Financial Data Analyst Ii", "company": "Children's Hospital of Philadelphia", "city state": "– Philadelphia", "rating": "4.0", "job description": "Req ID: 20834\n<br><br>\nShift: Days\n<br><br>\nEmployment Status: AF - Active - Regular - Full Time\n<br><br>\n<strong>Job Summary</strong>\n<br><br>\nResponsible for improving financial decision-making across the organization. Maintain financial data related to: budget, long range plan, decision support system, benchmarking &amp; productivity tools, reporting, analytics and modeling. The primary responsibility of the Financial Data Analyst is to drive data analyses/reporting to support decision making.\n<br><br>\n<strong>Responsibilities</strong>:\n\n\n<ul>\n<li>Involved in the following: data analytics, financial decision support, business statistics, benchmarking, budgeting, long term strategic planning, predicative modeling, productivity, dashboard/financial reporting, financial analysis/trending, metric development, data/system quality and ad hoc analysis/projects.</li>\n</ul>\n\nIdentify, analyze, and interpret trends or patterns in complex data sets.\n<br>\nAcquire data from primary or secondary data sources and maintain databases/data systems.\n<br>\nInterpret data, analyze results using statistical techniques and provide ongoing reports.\n<br>\nAdept at queries, report writing and presenting findings.\n<br>\nLeads projects and trains analysts.\n<br><br>\n<strong>Job Responsibilities (Continued)</strong>\n<br><br>\n<strong>Job Responsibilities (Continued)</strong>\n<br><br>\n<strong>Required Licenses, Certifications, Registrations</strong>\n<br><br>\nNone\n<br><br>\n<strong>Required Education and Experience</strong>\n<br><br>\nRequired Education: Bachelors degree\n<br><br>\nRequired Experience: Three (3) of related Financial Analytics &amp; Planning experience required\n<br><br>\n<strong>Preferred Education, Experience &amp; Cert/Lic</strong>\n<br><br>\n<strong>Additional Technical Requirements</strong>\n\n<ul>\n<li>Familiarity with large complex data sets.\n<br>\nStrong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy.\n<br>\nMust be detail oriented and have the ability to learn quickly.\n<br>\nA working knowledge of healthcare finance and accounting.\n<br>\nThis person should have knowledge of complex statistical analysis and strong problem solving skills.\n<br>\nSuperb interpersonal and communication skills with the ability to explain complex finances and statistics to many different audiences.\n<br>\nComputer Skills/Systems: EPIC, Allscripts EPSi, Kronos, KREG, Microsoft Office (Particularly Excel and Access), Lawson, Qlikview, Monarch, Business Objects, Crystal, ProClarity, OLAP, Strata Jazz, Visual Basic Programming, Databases, Complex Query Language, SQL, and SMS related systems.</li>\n</ul>\n<strong>All CHOP employees who work in a patient building or who provide patient care are required to receive an annual influenza vaccine unless they are granted a medical or religious exemption.</strong>\n<br>\n<strong>Children's Hospital of Philadelphia is committed to providing a safe and healthy environment for its patients, family members, visitors and employees. In an effort to achieve this goal, employment at Children's Hospital of Philadelphia, other than for positions with regularly scheduled hours in New Jersey, is contingent upon an attestation that the job applicant does not use tobacco products or nicotine in any form and a negative nicotine screen (the latter occurs after a job offer).</strong>\n<br>\n<strong>Children's Hospital of Philadelphia is an equal opportunity employer. We do not discriminate on the basis of race, color, gender, gender identity, sexual orientation, age, religion, national or ethnic origin, disability or protected veteran status.</strong>\n<br>\n<strong>VEVRAA Federal Contractor/Seeking priority referrals for protected veterans. Please contact our hiring official with any referrals or questions.</strong>\n<br>\n<strong>CHOP Careers Contact</strong>\n<br>\n<strong>Talent Acquisition</strong>\n<br>\n<strong>2716 South Street, 6th Floor</strong>\n<br>\n<strong>Philadelphia, PA 19146</strong>\n<br>\n<strong>Phone: 866-820-9288</strong>\n<br>\n<strong>Email</strong>:TalentAcquisition@email.chop.edu**"}