{"job title": "Product Analyst / Data Scientist", "company": "Khan Academy", "city state": "– Mountain View, CA", "rating": "4.6", "job description": "Khan Academy is looking for an analytics guru to join our Product Analytics team. We’re a small team with big dreams, and we’re only just getting started. We have some of the richest educational data in the world, and we want to leverage that data to develop a clearer picture of who our users are, how they are using the site, and how we could better serve them on their educational journey. We’re looking for a team player who is as excited about empowering others as they are about doing their own high-impact analyses. This is the perfect role for someone who wants to continue to grow their technical data skills as well as the strategic thinking and communication skills required to drive meaningful impact through data.\n<br><br>\nWe currently have one open position that could be filled by either a Product Analyst / Data Scientist or a Senior Product Analyst / Data Scientist. If you have 6+ years of experience in analytics, please apply for the Senior Product Analyst role.<br><br><strong>JOB RESPONSIBILITIES</strong><br><br>Be an independent research powerhouse:\n\n<ul>\n<li>Conduct exploratory analysis and modeling to identify opportunities for improvement - this could range from simple retention calculations to sophisticated predictive modeling</li>\n<li>Work with the product, engineering and design teams to ensure your results have a meaningful impact on product and strategy</li>\n</ul>\nEmpower other teams with data:\n\n<ul>\n<li>You will work with the leadership, product, content and marketing teams (and others) to bring data to their fingertips</li>\n<li>Give each team access to all the tools and data they need, so that every decision they make is backed up with solid data and analysis</li>\n</ul>\nContinually improve our data infrastructure:\n\n<ul>\n<li>Introduce new instrumentation and logging to uncover otherwise invisible user behavior</li>\n<li>Improve our data models and processes</li>\n<li>Develop creative derived features that create new analysis and modeling possibilities</li>\n</ul>\nHelp instill a ‘data driven’/’data informed’ culture:\n\n<ul>\n<li>Be the voice of data within the organization</li>\n<li>Find creative and insightful ways to publish and promote how we’re performing on key metrics</li>\n</ul>\nPlay an integral role in new initiatives and projects across the organization:\n\n<ul>\n<li>Ensure there is strong analytics input into the evaluation and prioritization of new opportunities</li>\n<li>Help set the goals and define the evaluation methodology for each initiative</li>\n<li>Provide objective evaluations post implementation</li>\n</ul>\n<strong>YOU NEED</strong>\n\n<ul>\n<li>A passion for Khan Academy’s vision and a desire to change the world</li>\n<li>3+ years experience in data science or analytics (or related role), ideally in a consumer facing internet business, or an education setting</li>\n<li>To be capable of writing efficient code in at least one programming language</li>\n<li>Advanced SQL skills</li>\n<li>Experience across the entire analytics chain: instrumentation, logging, data modeling, ETL, BI tools and dashboards, various analysis and modeling techniques, etc.</li>\n<li>Strong statistical foundations</li>\n<li>A knack for asking the right questions, then answering them with sound data and analysis</li>\n<li>Excellent communication skills (verbal, written, visual)</li>\n</ul>\n<strong>WE OFFER THE FOLLOWING BENEFITS</strong>\n<br><br>\nWe may be a non-profit, but we reward our talented team well!\n\n<ul>\n<li>Competitive salaries and annual bonuses</li>\n<li>Ample paid time off as needed – we are about getting things done, not face time</li>\n<li>Delicious catered lunch daily plus tons of snacks and beverages</li>\n<li>The opportunity to work on high-impact software and programs that are already defining the future of education</li>\n<li>Great location: walking distance to Caltrain and downtown Mountain View</li>\n<li>Awesome team events and weekly board game nights</li>\n<li>The ability to improve real lives</li>\n<li>A fun, high-caliber team that trusts you and gives you the freedom to be brilliant</li>\n<li>Oh, and we offer all those other typical benefits as well: 401(k) + 4% matching &amp; comprehensive insurance including medical, dental, vision, and life</li>\n</ul>\n<strong></strong>"}