{"job title": "Quality Data Analyst", "company": "Lowell General Hospital", "city state": "– Boston, MA", "rating": "3.5", "job description": "<div>\n\tThe Quality Data Analyst consults with key stakeholders and may act as lead on projects requiring data derived from multiple internal or external sources, to improve processes and outcomes of care and maintain compliance with external regulatory agencies. The position supports analytics and data management across multiple clinical services and systems to create actionable data output through various software solutions. This position requires advanced technical knowledge of database applications; data visualization software, SQL Management Studio, Excel (macros, templates, and pivot tables), and other techniques for automating tasks and productivity.<br>\n <br>\n\t<strong>Responsibilities:</strong><br>\n\tProvides consultation, design, and development services on projects requiring data collection and presentation, reports, and other specialized documents for clinical quality improvement and regulatory compliance.<br>\n\tTranslates analytical findings into easy to follow recommendations and summaries.<br>\n\tDevelops queries and analytical tools for use in quality improvement and decision support.<br>\n\tUtilizes data from internal electronic medical records systems and third party electronic systems such as NHSN and Vizient to provide actionable data through analytical reports.<br>\n\tAutomates the analysis, design, formatting, production and management of reports. Develops and trains staff in gaining insights from reporting applications.<br>\n\tDesigns and trains staff in the use of office productivity tools to increase productivity.<br>\n\tFosters an environment of motivated learning and problem solving through analytics.<br>\n\tPerforms other office functions as needed.<br>\n <br>\n\t<strong>Requirements:</strong><br>\n\tBachelor's degree in health or analytics-related field (informatics, epidemiology, economics, statistics, or other field emphasizing analytics).<br>\n\t2 years of experience with Microsoft Word, Excel (pivot tables, graphs, formulas), Access, PowerPoint.<br>\n\tOne or more years of experience with statistical analysis software.<br>\n\tOne or more years of experience with T-SQL (Microsoft SQL Server) in a healthcare setting.<br>\n\tExcellent oral and written communications skills.<br>\n\tDemonstrable technical experience with query software for accessing and retrieving data from a T-SQL database, and spreadsheet tools for creating, analyzing and managing large data stores. Comprehends complexities of data architecture.<br>\n\tStrong familiarity with Microsoft Office applications, including Microsoft Word, Excel, Access and PowerPoint. Knowledge of macros, pivot tables, query design, and other techniques for automating tasks and increasing productivity.<br>\n\tFamiliarity with data visualization software such as Tibco Spotfire or Tableau.<br>\n\tAbility to work independently with minimal supervision and also as a strong team member.<br>\n\tAbility to prioritize, plan work and function in a fast-paced, multi-project environment and under deadline pressure to multiple stakeholders.<br>\n\tDesire to make an impact in health care with a thirst for complex challenges.<br>\n\tExperience with general programming languages (Python).<br>\n\tFamiliarity in hospital ratings systems (Hospital Compare, Leapfrog, Vizient, US News, etc.) and the metrics utilized by these systems.<br>\n\tKnowledge of medical/clinical terminology (DRGs, ICD/CPT codes). </div>"}