{"job title": "Data Warehouse Analyst - IS Enterprise Reporting", "company": "Maine Medical Center", "city state": "– Portland, ME", "rating": "3.9", "job description": "<div>\n\n\n<ul>\n\n \n<li>\n <div>\n<strong>Position Summary</strong></div>\n\n\n<ul>\n\n \n<li>\n<br>\n<div><strong>The Data Warehouse Analyst role is the second level of a three-level career path. This position will support the implementation and the continued evolution of data warehouses, data stores, and data marts. The incumbent will work with architecture and technical support to design, test, enhance and maintain these systems. The primary areas of focus include:</strong></div>\n<ul>\n\n \n<li>\n <div>\nDesign and develop source to target mappings to support ETL process.</div> </li>\n\n\n<li>\n <div>\nDesign data views; help develop reporting data mart; provide support to reporting teams.</div> </li>\n\n\n<li>\n <div>\nCreate, coordinate, and implement test plans.</div> </li>\n\n\n<li>\n <div>\nHelp verify and reconcile data for accuracy and consistency.</div> </li>\n\n\n<li>\n <div>\nProvide complete and updated documentation; identify training needs.</div></li>\n\n\n</ul>\n\n </li>\n</ul>\n\n </li>\n<li>\n <div>\n<strong>Required Minimum Knowledge, Skills, and Abilities (KSAs)</strong></div>\n\n\n<ul>\n\n \n<li>\n <div>\nBachelor's degree in Information Technology or equivalent work experience.</div></li>\n\n\n<li>\n <div>\nRequires knowledge and experience in data warehousing (ETL, ODS, Star Schemas, OLAP, Dimensional modeling etc.); relational database experience/knowledge preferably SQL server as well as SQL knowledge.</div></li>\n\n\n<li>\n <div>\nDemonstrated experience working with users to identify information system needs.</div></li>\n\n\n<li>\n <div>\nExperience in integrating data from multiple source systems.</div></li>\n\n\n<li>\n <div>\nExperience identifying potential solutions, designing, developing, documenting, testing, and maintaining databases/applications required.</div></li>\n\n\n<li>\n <div>\nAbility to communicate effectively and work collaboratively with disparate clients.</div></li>\n\n\n<li>\n <div>\nAbility to independently lead or facilitate meetings.</div></li>\n\n\n<li>\n <div>\nAbility to identify potential solutions and take initiative.</div></li>\n\n\n<li>\n <div>\nMust be able to work independently and within a team and handle sensitive data professionally.</div></li>\n\n\n<li>\n <div>\nMust be able to work on multiple projects concurrently and work within deadlines.</div></li>\n\n\n</ul>\n\n </li>\n</ul>\n\n\t</div>\n<br>"}