{"job title": "Data Warehouse Analyst", "company": "Massachusetts General Hospital(MGH)", "city state": "– Boston, Massachusetts", "rating": "4.0", "job description": "<strong> GENERAL SUMMARY/ OVERVIEW STATEMENT:</strong> \n<br><br>\nThe MGPO Physician Analytics &amp; Business Intelligence team within the MGPO Finance division is perceived as one of the more advanced and robust analytic groups within the Partners Healthcare umbrella. This team is responsible for managing the platform known as IPORT (Interactive Performance Optimization Reporting Tool) which combines administrative, financial and clinical data sets in a data warehouse and provides the ability to view drivers in volume and reimbursement trends tied to the revenue cycle through comprehensive reports, scorecard capabilities, interactive dashboards and ad hoc OLAP reporting tools.\n<br><br>\nAs a Data Warehouse Analyst II, you will be part of a team of highly technical individuals responsible for enterprise wide data platforms. The successful candidate will positively contribute in the day-to-day responsibilities of the team and will ensure SLAs are met in accordance with the organizational objectives.\n<br><br>\nS/he will work closely with their team members and data warehouse leadership to ensure that appropriate technical and analytical solutions are provided and to meet desired goals.\n<br><br>\n<strong> PRINCIPAL DUTIES AND RESPONSIBILITIES:</strong> \n<br><br>\nResponsible for daily, weekly and monthly execution and monitoring of all scheduled database jobs.\n<br><br>\nPerforms issue assessments and follow appropriate troubleshooting steps in line with departmental standards and procedures as well as industry best practices.\n<br><br>\nPerforms regular file and data archival and data purge steps as scheduled or as deemed necessary.\n<br><br>\nRegularly reviews and proposes updates to current standards and processes to align them with changing organizational policy and procedures or with industry best practices.\n<br><br>\nEnsures parity between development, test and production environments. Performs intra-platform synchronization analysis to generate automated methods of keeping platforms in sync.\n<br><br>\nAdministers, maintains and supports internal systems, software and tools utilized by the team, including, but not limited to, version control, change management, and support ticketing.\n<br><br>\nAble to move large amounts of data in files or within database tables using common data transfer or ETL tools such as Microsoft SSIS.\n<br><br>\nResponsible for the upkeep, configuration, and reliable operation of systems. Accountable to ensure that the uptime, performance, resources, and security of the systems he or she manages meet the needs of the users and established SLAs.\n<br><br>\nMonitors the systems daily and responds to availability, security or usability concerns within the pre-agreed-upon SLA windows\n<br><br>\nAnalyzes system logs, identifies and follows ways to be proactive in identifying potential issues with systems.\n<br><br>\nApplies system updates, patches, and configuration changes.\n<br><br>\nInstalls and configures new versions of the system software.\n<br><br>\nFor the systems s/he is responsible for, adds, removes or updates user account, security or access information. Clearly documents all steps followed for aforementioned actions.\n<br><br>\nHas responsibility for documenting the configuration of the system.\n<br><br>\nPerforms system performance tuning.\n<br><br>\nTroubleshoots any reported problems, in a fast-paced environment under constraints and stress.\n<br><br>\nAble to communicate and coordinate tasks effectively with other team members as well as end users.\n<br><br>\nManages and maintains relationships with vendors and teams from other parts of the organization to provide seamless support to end users on the systems he or she is responsible for.\n<br><br>\nCommunicates technical/complex information well both verbally and in writing. Answers technical queries and assists team members and users whenever needed.\n<br><br>\nAble to establish and maintain cooperation, understanding, trust and credibility.\n<br><br>\nAble to perform multiple tasks concurrently and effectively.\n<br><br>\nMaintains technical knowledge by attending educational workshops; reviewing publications; establishing personal networks; participating in technical societies.\n<br><br>\nMaintains client and user confidence and protects operations by keeping sensitive information confidential.\n<br><br>\n<strong>Qualifications</strong>\n<br>\n<strong> QUALIFICATIONS:</strong>\n<br><br>\nBachelor degree required in Computer Science or directly related field\n<br>\n2+ years of experience required in healthcare/data warehouse or directly related experience required including:<br>\n· Experience in maintaining, administering and supporting various business critical systems preferably database platforms, source control systems (Team Foundation Server is highly preferred) and issue/support tracking/ticketing systems.\n<br><br>\n· Experience in using an industry-standard data transfer or ETL tool (Microsoft SSIS is highly preferred).\n<br><br>\nSystem Administration or System Engineer certification in any one of the Microsoft platforms, components or services is preferred.\n<br><br>\nKnowledge of one or more programming or scripting languages (C#, Java, PowerShell, etc.) and experience with custom software development to assist in internal process automation is preferred.\n<br><br>\nMay need to train staff in following best practices in his or her area of responsibility.\n<br><br>\nResponsibilities sometimes require working evenings and weekends, sometimes with little advanced notice.\n<br><br>\n<strong> SKILLS/ ABILITIES/ COMPETENCIES REQUIRED:</strong>\n<br><br>\nSupports and demonstrates the values of the Massachusetts General Hospital and the Massachusetts Physicians Organization by conducting activities in an ethical manner with integrity, honesty, and confidentiality.\n<br><br>\nShows a positive, open-minded, and can-do attitude.\n<br><br>\nDemonstrates a team orientation, willingness and enthusiasm to collaborate with others.\n<br><br>\nFollows through on commitments and achieves desired results.\n<br><br>\nExhibits sound judgment, obtains the facts, examines options, gains support, and achieves positive outcomes\n<br><br>\nDemonstrates continuing professional growth in knowledge and skills through education, goal setting and personal development\n<br><br>\nConducts self in a professional manner and demonstrates an attitude which inspires staff to a high level of professionalism\n<br>\nHighly self-motivated/disciplined, performs role with minimal supervision, notice or direction to identify and resolve problems and to complete work\n<br><br>\nAbility to interact with people from all organizational levels and builds consensus through negotiation and diplomacy\n<br><br>\nAbility to present to multiple levels of staff from VPs, to EDs, to ADs, to Managers, to Clinical Providers, to Billing Managers to front desk staff\n<br><br>\nAbility to understand the work environment and competing priorities in conjunction with developing/meeting project goals\n<br><br>\nStrong analytical and problem solving skills\n<br><br>\nStrong written and verbal communication skills\n<br><br>\nAbility to plan and prioritize tasks accordingly\n<br><br>\nAbility to manage multiple tasks and issues simultaneously\n<br><br>\nStrong ability to pay attention to detail\n<br><br>\nProficiency in Microsoft Office suite (Excel, Word, Access, Outlook) required, EPIC (or similar) system(s) preferred\n<br><br>\n<strong>EEO Statement</strong>\n<br>\nEEO Statement: Massachusetts General Hospital is an Equal Opportunity Employer. By embracing diverse skills, perspectives and ideas, we choose to lead. Applications from protected veterans and individuals with disabilities are strongly encouraged. Partner's Healthcare is acting as an Employment Agency in relation to this vacancy."}