{"job title": "HR Data/Compensation Analyst", "company": "Milford Regional Medical Center", "city state": "– Milford, MA", "rating": "4.1", "job description": "<div>\n<div>\n<strong>Statement of Purpose:</strong> The HR Data/Compensation Analyst develops, implements, and administers base pay programs, policies, and practices, and makes recommendations to ensure programs are competitively and consistently administered in compliance with all applicable regulations and to fit within the hospital culture; develops and implements metrics and reporting to measure HR program effectiveness; responsible as the functional expert for the implementation of new HR systems, the improvement of HR-related processes, and the development of Human Resources related reports.\n<br><br>\n<strong>Qualifications:</strong>\n<br>\n<strong>Education:</strong> \n<br>\nBachelor’s degree, preferably in a business-related field (Economics, Finance, Business Administration, Statistics, Human Resources) required.\n<br><br>\n<strong>Certification / License:</strong>\n<br>\nCertified Compensation Professional (CCP) and/or SPHR helpful.\n<br><br>\n<strong>Experience and Skills:</strong>\n<br>\n2-3 years of work experience in an analytical role, preferably in the analysis and administration of compensation and HR programs.\n\n\n<ul>\n\n \n<li>\n Must have an understanding of compensation theory and practice including job evaluation, salary administration and knowledge of federal/state regulations related to compensation.</li> \n\n\n<li>\n Must have experience using an HRIS, and Applicant Tracking and Time Management systems, and the ability to report and manipulate large sets of data from multiple sources.</li>\n\n\n<li>\n Analytical, creative, and innovative approaches to solving problems in a fast-paced environment. Must be able to think outside of the box.</li>\n\n\n<li>\n Proficiency using Microsoft Excel (including advanced formulas, vlookups, and pivot tables) to manipulate data for analysis and reporting and using the internet for research related searches.</li>\n\n\n<li>\n Excellent customer service skills required, and the ability to handle sensitive and confidential information with tact and empathy.</li>\n\n\n<li>\n Ability to independently plan, prioritize, and organize work while managing many priorities.At the same time, able to maintain cross-functional working relationships in order to meet goals.</li>\n\n\n<li>\n Excellent project management and organizational skills are important.</li>\n</ul>\n\n </div>\n</div>\n<br>"}