{"job title": "Data Analyst I - Radiology", "company": "Mount Sinai Medical Center", "city state": "– New York, NY", "rating": "3.4", "job description": "Strength Through Diversity\n<br><br>\nGround breaking science. Advancing medicine. Healing made personal.\n<br><br>\nData Analyst l - 2295764\n<br><br>\nThe Data Analyst I oversees activities related to data integrity and enhancement of the value of data. The Data Analyst I may direct the movement of data across multiple systems; oversee its validation and organization and make sure that it is available to appropriate people and systems within an organization.\n<br><br>\n<strong>Roles &amp; Responsibilities:</strong>\n\n\n<ul>\n<li>Implements the best practices in data management to ensure the integrity of the data, the quality of data processes and deliver analyzable or analyzed data to a variety of internal and external clients of the Medical Center.</li>\n<li>Maintains data integrity and supports data analysis as necessary.</li>\n<li>Make recommendations and assist in data capture, data extraction and analysis.</li>\n<li>Develop, maintain or implement procedures for data entry, data cleaning, documentation and other administrative tasks.</li>\n<li>Document, implement, maintain or recommend operating methods to improve processing, distribution, data flow, collection, database editing procedures.</li>\n<li>May define parameters for file or space utilization.</li>\n<li>Assists faculty and staff with queries, statistical analyses, reports and technical difficulties related to data retrieval.</li>\n<li>Designs and writes custom applications needed to ensure the database meets requirements for the entry, management and reporting of data.</li>\n<li>Identifies and recommends solutions to data management issues.</li>\n<li>Trains staff with varying degrees of knowledge to effectively use the database system.</li>\n<li>Maintains knowledge of the current regulations and technologies related to data management.</li>\n<li>May oversee data entry staff and other less experienced Data Coordinators/Analysts.</li>\n<li>May write and prepare manuscripts and other materials for internal and external audiences.</li>\n<li>May access data in the Data Warehouse.</li>\n<li>Performs other related duties.</li>\n</ul>\n\n<strong>Requirements:</strong>\n<br><br>\n<strong>Education:</strong>\n<br><br>\nBachelor's degree or equivalent education/work experience. Master's degree preferred\n<br><br>\n<strong>Experience:</strong>\n<br><br>\n2 years database application/management experience, preferably in a large medical center or healthcare environment OR one year relevant experience with Master's degree.\n<br><br>\nStrength Through Diversity\n<br><br>\nThe Mount Sinai Health System believes that diversity is a driver for excellence. We share a common devotion to delivering exceptional patient care. Yet we're as diverse as the city we call home- culturally, ethically, in outlook and lifestyle. When you join us, you become a part of Mount Sinai's unrivaled record of achievement, education and advancement as we revolutionize medicine together.\n<br><br>\nWe work hard to acquire and retain the best people, and to create a welcoming, nurturing work environment where you can develop professionally. We share the belief that all employees, regardless of job title or expertise, can make an impact on quality patient care.\n<br><br>\nExplore more about this opportunity and how you can help us write a new chapter in our story!\n<br><br>\nWho We Are\n<br><br>\nOver 38,000 employees strong, the mission of the Mount Sinai Health System is to provide compassionate patient care with seamless coordination and to advance medicine through unrivaled education, research, and outreach in the many diverse communities we serve.\n<br><br>\nFormed in September 2013, The Mount Sinai Health System combines the excellence of the Icahn School of Medicine at Mount Sinai with seven premier hospital campuses, including Mount Sinai Beth Israel, Mount Sinai Beth Israel Brooklyn, The Mount Sinai Hospital, Mount Sinai Queens, Mount Sinai West (formerly Mount Sinai Roosevelt), Mount Sinai St. Luke's, and New York Eye and Ear Infirmary of Mount Sinai.\n<br><br>\nThe Mount Sinai Health System is an equal opportunity employer. We promote recognition and respect for individual and cultural differences, and we work to make our employees feel valued and appreciated, whatever their race, gender, background, or sexual orientation.\n<br><br>\nEOE Minorities/Women/Disabled/Veterans<br><br>SDL2017"}