{"job title": "Senior Data Analyst", "company": "Perspecta Inc.", "city state": "– Chantilly, VA", "rating": "NA", "job description": "Senior Data Analyst Apply Job ID 2018-52163 Location Chantilly, Virginia, United States Clearance Top Secret/SCI w/Poly\n<br><br>\n<strong>Overview:</strong>\n<br><br>\nEvery day at Perspecta, we enable hundreds of thousands of people to take on our nation's most important work. We're a company founded on a diverse set of capabilities and skills, bound together by a single promise: we never stop solving our nation's most complex challenges. Our team of engineers, analysts, developers, investigators, integrators and architects work tirelessly to create innovative solutions. We continually push ourselvesto respond, to adapt, to go further. To look ahead to the changing landscape and develop new and innovative ways to serve our customers.\n<br><br>\nPerspecta works with U.S. government customers in defense, intelligence, civilian, health care, and state and local markets. Our high-caliber employees are rewarded in many waysnot only through competitive salaries and benefits packages, but the opportunity to create a meaningful impact in jobs and on projects that matter.\n<br><br>\nPerspecta's talented and robust workforce14,000 strongstands ready to welcome you to the team. Let's make an impact together.\n<br><br>\nPerspecta is an AA/EEO Employer - Minorities/Women/Veterans/Disabled and other protected categories\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nThe Data Analyst supports the Sponsor through the application of programmatic and quantitative methods to identify patterns and relationships in large data sets using mathematical, statistical, or other data-driven analysis to address intelligence questions.\n<br><br>\n<strong>Qualifications:</strong>\n<br><br>\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>TS/SCI with Polygraph</li>\n<li>BS degree in information technology, engineering or equivalent. 8 additional years of related experience may be substituted for a degree on a case-by-case basis.</li>\n<li>8 years of prior SI experience in the IC.</li>\n<li>Ability to work under minimum supervision given a Sponsor objective.</li>\n</ul>\n\n<strong>Desired Qualifications</strong>\n\n\n<ul>\n<li>Prior experience working with cross-cutting IC customers on a single program.</li>\n<li>Systems engineering or project management certification from a recognized provider.<br><br>SDL2017</li>\n\n</ul>"}