{"job title": "Data Analyst in Tampa, FL at Radian Group Inc", "company": "Radian Group", "city state": "– Tampa, FL", "rating": "3.6", "job description": "<div>\n <div>\n Job Description\n The Data Analyst position is an entry level position responsible for monitoring data that is provided to clients.<p></p><p></p><p>1.)Data Upload/Entry<br>• Follow defined procedures to format Excel investor reporting files for proper upload through the investor upload and loss automation tool.<br>• Follow defined procedures to manually enter mortgage insurance claims (system access).<br>• Process servicer data files and distribute SSV information to Servicer Relations (future need).<br>• Continuously adapt to new task responsibilities as defined by management.<br>• Be responsive to changing process and procedures and respond with quickness and diligence to all special requests</p><p>2.)Security (or Deal) Level Review and Reporting <br>• Produce monthly or quarterly reports as required per security documents including investor reports and basic collateral specific reports (ex. NIM reports).<br>• Perform deal specific analysis and reporting as required by client and/or contractual obligation (PPP recalculation, OC review, trigger review, swap verification, cash reconciliation)<br>• Identify and document deal performance issues and/or anomalies. Resolve issues using deal document review and/or knowledge of deal structure and performance expectations. Escalate issues to management where necessary.<br>• Review reports and upload for approval.<br>• Follow defined procedures to manually enter data for non-automated remittance statements.</p><p>3.)Administrative Duties <br>• Identify instances where data entry tasks do not fit a defined procedure and communicate issues to Manager.<br>• Communicate with Manager regarding process issues and improvement recommendations.<br>• Open and close Appian tasks concurrent with workflow timing. </p>\n<br><p>Knowledge:</p><p>6 months – 2 years of financial analysis experience, either through college or previous work experience, preferably in a mortgage based environment. Capable in Microsoft Office, including Excel, Word, PowerPoint and Outlook.</p>\n<br><p>Skills and Abilities:</p><p>• A strong work ethic and good organizational skills.<br>• Strong time management skills.<br>• Proficient in Microsoft Office, including Excel, Word, and Outlook<br>• Critical thinking ability, creativity, problem solving skills and detail oriented.<br>• Must be a team player with effective interpersonal and verbal communication skills.<br>• Work with all levels of employees and escalate issues when needed<br>• Exhibits professionalism with peers and leadership. Acts as a positive agent for the company</p>\n<br><p>Education: Bachelors Degree required</p>\n<br><p></p><p></p><p><b>EEO Statement</b></p><p>Radian complies with all applicable federal, state, and local laws prohibiting discrimination in employment. All qualified applicants will receive consideration for employment without regard to gender, age, race, color, religious creed, marital status, sexual orientation, national origin, ethnicity, ancestry, citizenship, genetic information, disability, protected veteran status or any other characteristic protected by applicable federal, state, or local law.</p><p></p><p>If you are a person with a disability and need assistance in the application process please send an e-mail message to recruitment@radian.biz.</p>\n</div>\n\n </div>\n \n\n <div>\n \n </div>"}