{"job title": "Data Quality Analyst", "company": "Spartanburg Regional Healthcare System", "city state": "– Spartanburg, SC", "rating": "4.1", "job description": "<p> </p>\n<p> <strong>#LI-KM1</strong></p>\n<p> </p>\n<p> </p>\n<p>The Contract Pricing Analyst must have strong analytical skills, good organization and communication skills, and the ability to manage multiple projects to meet aggressive deadlines. He/she will possess a strong intellectual curiosity and desire to learn and tackle new issues daily. The initiative to take ownership of projects and think about the impact of each decision on all organization operations is also a crucial trait for this position.</p>\n<p><b><u>Payor Strategy Support </u></b>(40% of time)<b><u></u></b></p>\n<p>· Maintaining Reimbursement schedules</p>\n<p>o Hospital </p>\n<p>o Physician </p>\n<p>o Ancillary </p>\n<p>o Population Health </p>\n<p>· Maintain Payor / Provider Network and Product Participation Matrix </p>\n<p>· Work closely with the Manager of Payor Strategy, and the VP of Payor Strategy to analyze, develop and implement SRHS's negotiated contracts <b><u></u></b></p>\n<p>· Under the direction of the Manager of Payor Strategy, work closely with other SRHS corporate functions, including but not limited to Finance, Revenue Cycle, Quality Management to provide sound strategic and tactical recommendations for SRHS strategic pricing initiatives</p>\n<p>· Identify and recommend revenue or market share growth opportunities through changes in pricing strategy or new pricing tactics.</p>\n<ul>\n<li>Research pricing trends and recommend new approaches for SRHS such as price transparency, changes in price elasticity, trends in deductibles/co-insurance, new payment models, and value based pricing.</li>\n<li>Develop thorough knowledge of the commercial payer community including M&amp;A and performance research.</li></ul>\n<p><b><u>Payor contract Negotiation Support </u></b>(40% of time)<b><u></u></b></p>\n<ul>\n<li>Analyze the financial impact of existing and proposed contracts and performance programs between SRHS, SEHP, RHP and Payor organizations. Present findings and make proposal recommendations during negotiation process. </li>\n<li>Build analytical models to evaluate financial impact of various other pricing initiatives.</li></ul>\n<p>· Responsible for design and production of contract models to support payor negotiations. </p>\n<p>· Sophisticated models include hospital, physician, home health, SNF, LTAC and outpatient </p>\n<p>surgery centers. </p>\n<p>· Ability to distill data to salient information and recommendations and present findings of all analyses in a logical, concise manner and format required. </p>\n<p>· Modeling will require expert knowledge of commercial reimbursement, Medicaid reimbursement and Medicare reimbursement models.</p>\n<p>· Provide recommendation regarding reimbursement elements to improve overall contract yield to SRHS and SEHP and RHP providers</p>\n<p>· Work with Manager of Payor Strategy and the VP of Payor Strategy on analysis of annual charge master increases and implementation of resultant pricing changes</p>\n<p><b><u>Contract Performance and Modeling </u></b>(10% of time)<b><u></u></b></p>\n<ul>\n<li>Develop and maintain tools to monitor SRHS, SEHP and RHP pricing yield and estimate financial impact.</li></ul>\n<p><b><u>Data Base Management </u></b>(10% of time)<b><u></u></b></p>\n<ul>\n<li>Utilize internal data systems (Trendstar, Epic, Strata, Deerwalk etc) and external data to drive analyses as required. Reconcile and verify data to ensure data integrity and reasonableness. <b></b></li></ul>\n<p>· Insure all databases are up to date, accurate and complete. <b></b></p>\n<p> <b></b></p>\n<p><b>Education</b>: Minimum requirement – BS in Finance/Accounting or business or healthcare related field. </p>\n<p> <b>Experience</b> </p>\n<p>· 3 years' experience in hospital or managed care financial analysis management role. <b></b></p>\n<p>· Excellent analytical skills and ability to manipulate large data sets from multiple systems using MS Office, SQL, SAS, or other database management tool. </p>\n<p>· Familiarity with EPIC, Trendstar, and Strata or other contract management system is preferred. </p>\n<p>· Familiarity with current common coding practices including CPT4, ICD9CM, and DRGs as well as current Medicare reimbursement methodologies. </p>\n<p>· Knowledge of pricing, healthcare finance, managed care, provider incentives, and risk contracting required. </p>\n<p><b> </b></p>"}