{"job title": "Senior Data Analyst", "company": "TD Bank", "city state": "– United States", "rating": "3.7", "job description": "<div><strong>About This Role</strong>\n<br><br>\nWe need someone to provide technical leadership covering a range of data analysis functions. These include data modeling, structured query language (SQL), data quality, data profiling, extract-transform-load (ETL), metadata enrichment and management, data provenance and lineage, report design and other specialized data management functions. You're a solid, independent, senior lead equipped to manage and direct activities related to analysis, design and support of technical data management solutions for larger projects.\n<br><br>\nMeaningful work is fueled by meaningful performance and career development conversations with your manager. <strong>Here are the essential job functions of this position:</strong>\n<ul>\n<li> Elicit, analyze, interpret business and data requirements to develop complete business solutions, includes data models (entity relationship diagrams, dimensional data models), ETL and business rules, data life cycle management, governance, lineage, metadata and reporting elements.</li> <li> Apply automation and innovation on new and on-going data platforms for those development projects aligned to business or organizational strategies.</li> <li> Design, implement reporting platforms (e.g. modeling, ETL, BI framework) and complex ETL frameworks that meet business requirements.</li> <li> Work with technology/project teams to understand the business meaning of data, provide analysis and requirements so that data design is fully understood and the development initiatives are in line with intended design and standards.</li> <li> Deliver business or enterprise data deliverables (that adhere to enterprise frameworks) for various platforms/servers/applications/systems.</li><li> Provide data analysis and requirements within enterprise platform (e.g. Hadoop).</li> <li> Implement processes aligned to data management standards, ensure data quality and requirements are embedded in/adhered to within system development deliverables.</li> <li> Develop, maintain knowledge of data available from upstream sources and data within various platforms.</li> <li> Perform data profiling using TD tooling and ad hoc system query languages to validate data analysis.</li> <li> Help development and testing teams resolve data issues.</li> <li> Support the user community by helping them interpret data.</li> <li> Engage with data managers, stewards and owners to implement, maintain, enhance data governance, quality and related policies, aligning with TD's standards and frameworks.</li> <li> Ensure capture of requirements related to data privacy and security, governance and access controls.</li> <li> Respect TD's technology delivery practices, standards, project management disciplines.</li> \n</ul>\n\nOther duties as assigned\n<br>\n<strong>\n</strong><ul><strong>\n<li>Driving Requirements:</li>\n\n</strong>\n\n<li>Travel Requirements:</li></ul></div> <div> Job Requirements<br><br><strong>What can you bring to TD?</strong> Share your credentials, but your relevant experience and knowledge can be just as likely to get our attention. Here are the minimum requirements for this position:\n\n\n\n\n<ul>\n<li> Undergraduate Degree or Technical Certificate.</li> <li> 5-7 years relevant experience.</li> <li> Advanced knowledge of the technical environment/tools for own area .</li><li> Advanced knowledge of business processes and procedures on a broad, organizational level.</li> <li> Sound to advanced knowledge of business, standards, infrastructure, architecture and technology from a design/support/ solutions perspective.</li> <li> Consulted as expert subject matter expert in at least one area of discipline to support clients/or project teams with research, analysis, design, hardware/ software support, solutions development and testing.</li> <li> History as a collaborative team player, strength in communicating clearly with partners to elicit information/data requirements.</li> <li> Capacity and eagerness to work independently as a senior/lead role on multiple tasks, and also coach/educate/guide/direct others.</li> <li> Ability to assume assignments that are moderate- to highly- complex and multi-faceted, to be performed under management guidance.</li> <li>Must be eligible for employment under regulatory standards applicable to the position.</li></ul></div>\n<br>\n<div> Qualifications Preferred Qualifications - Here are the preferred qualifications for this role:\n<br><br>\n<strong>MUST HAVE:</strong>\n\n\n<ul>\n<li>Oracle DB and platform - 6 years experience</li>\n<li>SQL query construction and usage - 6 years experience</li>\n<li>Data Analyst background in a Financial Services environment - 6 years experience</li>\n<li>Experience with Microsoft Project, Excel, Access and PowerPoint 5 years</li>\n<li>Technology Delivery Manager experience 5 years</li>\n</ul>\n\n<strong>NICE TO HAVE:</strong>\n\n\n<ul>\n<li>Banking/Financial industry experience</li>\n<li>Teradata FSDM knowledge</li>\n<li>Working experience with Project Development Life Cycle and/or Agile/Scrum</li></ul></div> <div> Inclusiveness<br><br>At TD, we are committed to fostering an inclusive, accessible environment, where all employees and customers feel valued, respected and supported. We are dedicated to building a workforce that reflects the diversity of our customers and communities in which we live in and serve, and creating an environment where every employee has the opportunity to reach her/his potential.\n<br><br>\nIf you are a candidate with a disability and need an accommodation to complete the application process, email the TD Bank US Workplace Accommodations Program at USWAPTDO@td.com . Include your full name, best way to reach you, and the accommodation needed to assist you with the application process.\n<br><br>\nEOE/Minorities/Females/Veterans/Individuals with Disabilities/Sexual Orientation/Gender Identity.</div> \n\n<li>*Province/State (Primary) New Jersey</li>\n\n<div> City (Primary) Mount Laurel</div> <div> ProvState 2 Maine</div> <div> City(s) 2 Falmouth</div> <div> ProvState 3 South Carolina</div> <div> City(s) 3 Lexington</div> \n"}