{"job title": "Client Strategy Officer Financial/Data Analyst", "company": "UBS", "city state": "– Weehawken, New Jersey", "rating": "3.5", "job description": "<strong>Your Role</strong><br><br>Are you an analytic thinker? Do you have good relationship management, communication and project management skills? Are you interested in identifying and defining key metrics to optimize performance and enable decision making? We’re looking for someone like that who can:\n\n\n<ul>\n<li>work collaboratively across Finance to provide analytical insights to the Client Strategy Office business to derive actionable insights and outcomes from financial data</li>\n<li>support and review key business financial management reports</li>\n<li>prepare monthly estimate, forecast and track operating plan shifts</li>\n<li>partner with the business, IT and Finance colleagues to design and implement key financial metrics to report client segment performance and track against business case targets</li>\n<li>partner with Client Strategy office Americas business to prepare the 3-year strategic financial plan</li>\n<li>coordinate with Finance colleagues to proactively maintain financial structures</li>\n<li>stay abreast of current business and industry trends<br><br><strong>Your team</strong><br><br>You’ll be working in the Global Wealth Management CFO function located in Weehawken, NJ as part of the global Client Strategy Office Finance business partnering team. The team provides advice and constructive challenge to the Client Strategy Office, focusing on its activities, performance and business cases to optimize the use of the firm's financial resources, as well as acting as the primary point of contact for senior management on Finance matters.<br><br><strong>Your expertise</strong><br><br>You have:</li>\n</ul>\n\n– a degree in finance, economics or accounting, coupled with good written and verbal communication skills\n<br>\n– 3-5 years' experience in a finance or related function, within the financial services industry\n<br>\n– strong analytical, problem-solving and synthesizing skills\n<br>\n– experience in preparing estimates/forecasting/planning/target setting\n<br>\n– interest in designing and implementing key financial metrics using business intelligence tools\n<br>\n– a proven track record of delivering high quality and timely results\n<br>\n– high proficiency in Microsoft Office suite and Essbase, with Think Cell experience a plus\n<br><br>\n<strong>You are:</strong>\n<br>\n– intellectually curious and take ownership to solve problems\n<br>\n– clear, structured and have action-oriented thinking\n<br>\n– able to synthesize analyses and articulate results to the business\n<br>\n– a team player who is self-sufficient and holds yourself accountable for your responsibilities\n<br>\n– comfortable interacting with colleagues at different levels and can build trusted relationships\n<br>\n– someone who embraces collaboration, constructive challenge and shows integrity\n<br>\n– able to work flexible hours, when needed<br><br>What we offer<br><br>Together. That’s how we do things. We offer people around the world a supportive, challenging and diverse working environment. We value your passion and commitment, and reward your performance.\n<br><br>\nKeen to achieve the work-life agility that you desire? We're open to discussing how this could work for you (and us).<br><br><strong>Take the next step</strong><br><br>Are you truly collaborative? Succeeding at UBS means respecting, understanding and trusting colleagues and clients. Challenging others and being challenged in return. Being passionate about what you do. Driving yourself forward, always wanting to do things the right way. Does that sound like you? Then you have the right stuff to join us. Apply now.<br><br><strong>Disclaimer / Policy Statements</strong><br><br>UBS is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce.<br><br><strong></strong>"}