{"job title": "Solution Design Engineer (Ops Systems)", "company": "Amadeus IT Group SA", "city state": "– United States", "rating": "3.8", "job description": "Amadeus Airport IT Americas, Inc. is an air transport information technology solutions firm based in Orlando, Florida. Our comprehensive portfolio of solutions enable airports and airlines to better utilize and manage resources, enhance the passenger experience, reduce costs, and optimize revenue generation.\n<br><br>\nOur operational, passenger processing, intelligent display, and revenue management platforms deliver enterprise-class business intelligence solutions and are the most innovative in the air transport marketplace.\n<br><br>\nAmadeus Airport IT Americas, Inc. solutions are operational in 30 of the top 50 airports in North America, and as a testament to their scalability, these solutions are at home in another 100 airports and at 60 airlines worldwide.\n<br><br>\nWe are currently seeking a self-motivated and experienced individual to fill a full time role as a Solution Design Engineer at our Orlando, FL location.\n<br><br>\nSummary: This position is responsible for collecting requirements and providing functional design of application software. The Solution Design Engineer will coordinate/provide implementation solution documents, user training, and QA testing. This role requires working regularly with other departments in order to coordinate these activities.\n<br><br>\nEssential Duties and Responsibilities: Perform administrative duties for the Executive including, but not limited to:\n\n\n<ul>\n<li>Participates in the functional design, testing, configuration, and documenting software</li>\n<li>Assumes the QA and Product Owner role in the scrum methodology process for AAA (Amadeus Airport IT Americas) regional software development</li>\n<li>Assumes the role of gathering</li>\n</ul>\n\nfor software to be developed\n\n\n<ul>\n<li>Performs GAP analysis of software for new projects</li>\n<li>Supports the sale department with technical information and provides product demos for prospective and existing customers</li>\n<li>Participates in proposal process and supports sales by providing software and hardware cost estimates</li>\n<li>Responsible for providing training of application software.</li>\n<li>Works with R&amp;D to support the development process.</li>\n<li>Consults and analyzes the business/operation objectives of the customers and develops solution design documents to their business issues</li>\n<li>Ability to analyze the entire airport operation including data, goals, process and organization.</li>\n<li>Evaluates information harvested through surveys and workshops, task analysis, and business process description</li>\n<li>Has strong technical skills, business intelligence, and a full understanding of the needs of the customers</li>\n<li>Able to effectively communicate with external clients and internal teams to deliver applications, interfaces and system designs according to the contractual agreements</li>\n<li>Ability to be the interface between technology teams, support teams and business units</li>\n<li>Ensures that the recommended solution is both commercial and competitive</li>\n</ul>\n\nTo apply: https://amadeus.contactrh.com/jobs/9064/26805033"}