{"job title": "Senior Software Engineer, CI Tools, Security", "company": "Anaplan", "city state": "– San Francisco, CA", "rating": "4.1", "job description": "Do you have a passion for security? Do you believe that it is not enough to just lock your house, but also to close every other entryway and to safeguard the key that opens that lock?\n<br><br>\nAre you a creative problem solver who can both give and receive feedback? Do you lead with inclusion, collaboration and openness?<br><br><strong>The Role</strong><br><br>If this sounds like you, then come join us as a Senior Software Engineer in the security team. We are a high-growth startup disrupting how companies do business.\n<br><br>\nWe have a long list of incredible benefits and offer highly competitive packages - we're serious about attracting the best technologists in the industry. You'll be working with super smart people who are pushing Java and the JVM to the limits. We'll also offer you a rewarding career with a company that values diversity and invests in you.\n<br><br>\nDay to day you will contribute to quality and security through code reviews and Agile driven test-based-development, documentation and continuous integration processes.\n<br><br>\nOur customers entrust us with their financial data and intelligence and that's a huge responsibility.<br><br><strong>What we are looking for:</strong>\n\n\n<ul>\n<li>An advocate of TDD, you demand code that is tested and testable</li>\n<li>Hands-on experience as a back end engineer with a proven track record of delivering production quality security services.</li>\n<li>You are passionate about automation and CI/CD.</li>\n<li>Extraordinary communication and collaboration skills. You are pragmatic and know how to build trust.</li>\n<li>A true passion for Security Engineering</li>\n<li>You're not afraid to show off your work, as well as learn new things.</li>\n<li>Positive energy and enthusiasm - cultural fit is a really big deal for uswe're looking for really smart people who love solving big problems and are self-motivated to get things done.</li>\n</ul>\n\n<strong>You must have:\n<br><br>\n</strong>\n\n\n<ul>\n<li>Masters degree or equivalent work experience</li>\n<li>Exceptional developer, proficient with Java (8) or Kotlin as both our main languages</li>\n<li>Deep understanding of OOP and Functional programming.</li>\n<li>Experience working with docker containers / images and Kubernetes as this is our platform for CI</li>\n<li>Testing is a HUGE thing for us you need to have a deep understanding of testing approaches and methodologies.</li>\n<li>You are able to write simple, clean and testable code.</li></ul>\n\n\n<ul>\n<li>Ability to take ownership and full responsibility of the services / products you will deliver.</li></ul>\n\n\n<ul>\n<li>A wide breadth of knowledge in protocols around authentication, authorization, applied cryptography, identity management, and auditing Huge plus</li>\n</ul>\n<br><br><strong>Our preferred tech stack:</strong>\n\n\n<ul>\n<li>Web API based Services (Dropwizard, Jersey, Spring Boot, Jetty)</li>\n<li>Serialization mechanics with current state of services (JSON, Protobuf)</li>\n<li>Relational and/or Non-Relational Databases (MYSQL, Redis)</li>\n<li>Micro-services architecture, Distributed Systems &amp; Scalability, Linux</li>\n<li>Docker and Kubernetes</li>\n</ul>\n<strong>**We are looking for senior security engineers. This position is not an IT or operations</strong><br><br><strong>We offer:</strong>\n\n\n<ul>\n<li>Huge technical problems to solve - you'll have the chance to push boundaries and learn from an excellent team, focused on collaboration and innovation.</li>\n<li>A high-growth, high impact environment at a startup disrupting how companies do business.</li>\n<li>A working environment here in SF where you'll enjoy a long list of incredible benefits.</li>\n<li>Highly competitive packages - we're serious about attracting the very best technologists in the industry.</li>\n<li>Stock options in a market-defining, pre-IPO Unicorn.</li>\n<li>A rewarding career with a company that values diversity and invests in you - you'll be working with super-smart people who are really pushing the limits.</li>\n<li>Fully stocked kitchen, weekly happy hours, seasonal offsite events</li>\n</ul>\n\n<strong>Do you align with Anaplan's Values?</strong>\n\n\n<ul>\n<li>Open</li>\n<li>Creative</li>\n<li>Authentic</li>\n<li>Inclusive</li>\n<li>Collaborative</li>\n</ul>\n<strong>Explore all of our Values on Anaplan.com/careers</strong>\n<br><br>\n#AnaplanLOVE\n<br><br>\n<strong>About the Anaplan San Francisco office</strong>\n<br><br>\nLocated in SOMA district, when you walk into our San Francisco office, you can feel the excitement and energy of what we are doing at Anaplan. Open floor plan, stocked kitchens, and collaboration spaces, we gear our office around making sure you have everything you need to work well. And whether it's a company outing to a Giants game or team happy hour, there are always events for you to connect with your colleagues outside of work. You will join a team of individuals who embrace and respect diverse perspectives, aren't afraid to push boundaries and try new ideas, and are passionate about helping our customers and each other succeed. We work hard, but we also don't wait for an excuse to have fun and we inspire each other!\n<br><br>\n<strong>About Anaplan</strong>\n<br><br>\nAt Anaplan, we're relentlessly passionate about improving the way companies and people do business by empowering them with the technology, insights, and confidence they need to make better-informed plans and decisions.\n<br><br>\nWith 20 offices worldwide, we're building products used by over 850 clients that include some of the world's largest brands and fast-growing companies in every industry, and we're just getting started.\n<br><br>\n<strong>CAN'T FIND THE PERFECT ROLE FOR YOU? NEW OPPORTUNITIES ARE OPENING UP DAILY:</strong>\n<br><br>\n<strong>Anaplan.com/careers</strong>\n<br><br>\n#LI-TP1"}