{"job title": "Senior Systems Engineer", "company": "ASRC Federal Holding Company", "city state": "– Florida, United States", "rating": "3.7", "job description": "<div>ASRC Federal Field Services (AFSS) is seeking a cleared <strong>Senior Systems Engineer</strong> in support of an antenna engineering support contract in Port St. Johns, FL (near Cape Canaveral).</div>\n<br><strong>Role/Responsibilities:</strong>\n<br><br>\nThis senior professional position primarily requires the application of knowledge of systems engineering sciences of complex scientific systems to detect and predict space anomalies which impact the delivery of precise signal transmission and measurement. The primary duties of this position will be:\n\n<ul>\n<li>To perform research and development efforts in (i) system requirements definition and development, (ii) system integration and testing,(iii) system architecture development, (iv) remote instrument controltechnology, (v) data processing techniques, and (vi) calibration equipment and processes as applied to large complex atmospheric research and satellite calibration systes.</li>\n\n<li>To perform concept development efforts utilizing state-of-the-art technology.</li>\n\n<li>To generate advanced processes to detect, measure, analyze and ultimately predict space anomalies to reduce their effects on efficient, timely signaltransmissions.</li>\n\n<li>This position requires the ability to resolve technically challenging problems.</li> \n\n<li>Considerable travel, both CONUS and OCONUS, may be required.</li>\n</ul>\n\n<div><strong><em>ASRC Federal and its Subsidiaries are Equal Opportunity / Affirmative Action employers. All qualified applicants will receive consideration for employment without regard to</em> <em>race, gender, color, age, sexual orientation, gender identification, national origin, religion, marital status, ancestry, citizenship, disability, protected veteran status, or any other factor prohibited by applicable law.</em></strong></div>"}