{"job title": "Field Engineer Technician", "company": "Associated Banc-Corp", "city state": "– Green Bay, WI", "rating": "3.4", "job description": "Associated Bank is looking to expand our Information Technology Field Engineering team.\n<br><br>\nHere are some reasons why our employees made us one of the <strong>best places to work in the Midwest</strong>:\n\n<ul>\n<li>Personal &amp; Professional Development Opportunities</li> \n\n<li>Comprehensive benefit package</li> \n\n<li>401K, Employee Stock Ownership Plan and Pension Plan</li> \n\n<li>Competitive Starting pay</li> \n\n<li>Banking Benefits</li> \n\n<li>Community involvement/volunteer opportunities highly supported and networking opportunities with Company Resource Groups</li> \n\n<li>Leading edge technology</li> \n\n<li>Great training and onboarding</li> \n</ul>\n\n<strong>Now lets talk about the position:</strong>\n<br>\nParticipate in the installation, relocation, maintenance and troubleshooting of PCs, laptops, multifunction printers, network hardware, data circuits, IP telephones, and related equipment. Provide superior hardware maintenance and support services.\n<br><br>\nKey Result Areas\n\n<ul>\n<li>IT Hardware repair and preventive maintenance services</li>\n<li>IT Hardware configuration and installation services</li>\n<li>Provide a high level of customer service</li>\n</ul>\n\nJob Accountabilities\n\n<ul>\n<li>Respond to customer requests for on-site hardware repair services, use company provided parts and tools to resolve such problems to the customers satisfaction. Expedite difficult service issues to appropriate IT support personnel to ensure timely resolution of the problem.</li>\n<li>Participate in the installation and relocation of existing and new IT Technologies as determined by management, maintain pace with the schedule to ensure timely completion of the project.</li>\n<li>Complete the necessary preventive maintenance and inventory audits on all IT equipment following the Field Engineer written procedures/guidelines.</li>\n<li>Review hardware service history and recommend replacement or relocation of equipment with unsatisfactory performance.</li> \n\n<li>Troubleshoot IP telephone and computer connectivity or communication problems.</li>\n<li>Collaborate with other IT support personnel as necessary to resolve the issue.</li>\n<li>Follow project management guidelines when responding to requests for removal, relocation or installations of IT equipment</li> \n\n<li>Participate to any extent necessary in the development and implementation of disaster recovery if it should become necessary</li>\n<li>Daily travel to ABC locations within service region, occasional travel to other service regions with overnight stays.</li> \n\n<li>Review service/technical manuals and online forums to maintain familiarity on the service of all PCs, servers, operating systems, print devices, networking hardware and wiring systems currently deployed at Associated.</li>\n</ul>\n\nOther Duties and Responsibilities\n\n<ul>\n<li>Provide occasional 24/7 on-site Technical Support/Service</li>\n<li>Perform other duties as assigned.</li>\n</ul>\n\nEqual Opportunity Employer\n<br>\nAssociated Bank is an equal opportunity employer committed to creating a diverse workforce. We support a work environment where colleagues are respected and given the opportunity to perform to their fullest potential. We consider all qualified applicants without regard to race, religion, color, sex, national origin, age, sexual orientation, gender identity, disability or veteran status, among other factors. Applicants with a disability who need assistance applying for a position with Associated Bank are asked to email: colleaguecare@AssociatedBank.com or call: (800) 878-3282.\n<br><br>\n<strong>What it takes to be an Associated Field Engineering Technician</strong>\n\n<ul>\n<li> Required Education: Associate's Degree or equivalent combination of education and experience Computer/Network Servicing or Electromechanical Technology Servicing</li>\n<li> Required Experience: 1-2 years computer, fileserver, printer, &amp; multifunction hardware, IP telephone servicing. Software experience on Windows Operating Systems and Microsoft Office Suite. Cisco network hardware and communication troubleshooting/service along with installation of network infrastructure cabling</li>\n<li> Preferred Experience: 2-4 years computer, fileserver, printer, &amp; multifunction hardware, IP telephone servicing. Software experience on Windows Operating Systems and Microsoft Office Suite. Cisco network hardware communication troubleshooting/service along with installation of network infrastructure cabling</li>\n</ul>\n\nLicenses and Certifications\n\n<ul>\n<li> Required: Valid driver's license by start date</li>\n<li> Required: HP &amp; Lexmark Service certification within 1 year</li>\n</ul>\n\n<strong>Special Skill Requirements:</strong>\n\n<ul>\n<li> Microsoft Office</li>\n<li> Attention to detail</li>\n<li> Ability to lift and carry 90 pounds</li>\n<li> Mathematical</li>\n<li> Verbal Communication</li>\n<li> Written Communication</li>\n</ul>\n\nJob Requirements\n\n<ul>\n<li> Adherence to company policy and procedures is required.</li>\n<li> Perform duties in accordance with the Vision &amp; Values of Associated Banc-Corp.</li>\n<li> Regular attendance is required.</li>\n<li> Basic math and reading skills, and attention to detail.</li>\n<li> Use of basic office equipment (e.g., photocopier, voice mail, \"fax\" machine, multiple line telephones, computers etc.).</li>\n<li> Represent the organization in a professional and positive manner.</li>\n</ul>\n\nOperates in full compliance with internal policies and procedures as well as applicable regulations and laws, including but not limited to Bank Secrecy Act/Anti-Money Laundering requirements. Responsible to report any procedure or process that doesnt meet regulatory requirements including fraud, whether suspected or confirmed, to management. This reporting can be done directly to any member of management, including Human Resources or Corporate Security, or can be reported through Associateds anonymous Ethics Hotline.\n<br><br>"}