{"job title": "Software Engineer, Risk Systems", "company": "CME Group", "city state": "– Chicago, IL", "rating": "3.2", "job description": "<strong>Description</strong><br><br>CME Group: Where Futures Are Made\n<br><br>\nCME Group (www.cmegroup.com) is the world's leading and most diverse derivatives marketplace. But who we are goes deeper than that. Here, you can impact markets worldwide. Transform industries. And build a career shaping tomorrow. We invest in your success and you own it, all while working alongside a team of leading experts who inspire you in ways big and small. Joining our company gives you the opportunity to make a difference in global financial markets every day, whether you work on our industry-leading technology and risk management services, our benchmark products or in a corporate services area that helps us serve our customers better. With 2,500 employees located around the world, we're small enough for you and your contributions to be known. But big enough for your ideas to make an impact. The pace is dynamic, the work is unlike any other firm in the business, and the possibilities are endless. Problem solvers, difference makers, trailblazers. Those are our people. And we're looking for more.<br><br><u>About Technology at CME Group</u>\n<br><br>\nThe Technology &amp; Enterprise Computing Division provides systems to support electronic trade matching, inbound and outbound order routing, clearing, market data, trading floor technology and other corporate processes. Critical areas of focus are speed, reliability, functionality and system capacity. Important systems include CME Globex for trade matching, Clearing 21 for clearing systems, iLink for order routing and EFS for fees.\n<br><br>\nWe deliver capacity equal to 1.5 times our system peak and have redundant data center facilities to enable disaster recovery. We support a wide variety of technologies to meet our customer needs including servers, mainframes, networking gear and optical fiber-based networks for fast connectivity worldwide. ​\n<ul>\n<li>Daily mark-to-market calculations</li><li>Real-time monitoring of position\n<br>\nand exposure</li><li>Minimum margin requirements</li><li>Monitoring of risk concerns</li><li>Member and customer account stress testing</li><li>Credit controls for use by clearing members</li>\n</ul>\n<strong>Description</strong>\n<br><br>\nThe <strong>Software Engineer III</strong> should engineer secure, scalable and reliable technology solutions, with minimal supervision, to advance CME Group in the global marketplace and serve risk management needs of customers around the world.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Strong technical and system analysis skills.</li><li>Hands-on, highly competent daily user of C#, .NET and SQL.</li><li>Proficient in MS SQL Server and Transact SQL Development (Writing SQL queries, procedures and triggers) and query tuning.</li><li>Experience in maintaining, extending existing database design and implementation.</li><li>Design and maintain large scale systems (with front end, middle layer and back end).</li><li>Ability to create queries to provide ad-hoc reports, analysis, and data sets based on business needs.</li><li>Work with other teams to understand business rules and interpret data.</li><li>Maintain an ongoing knowledge of both the technical data model and the business strategic needs.</li><li>Conduct system-wide testing and some integration testing.</li><li>Write application modules and unit tests with minimal guidance.</li><li>Perform elementary database modeling and intermediate database tuning.</li><li>Identify potential opportunities for code optimization.</li><li>Provide input for code reviews and help with environment build deployments, release notes and build notices.</li><li>Review code to proactively identify and mitigate potential issues and defects and help to identify sources of defects as well as troubleshoot various forms of code.</li><li>Use design tools to frequently share and communicate design ideas on larger systems.</li><li>Use patterns frequently, contributing to best practice and process enhancements.</li><li>Maintain grid computing and distributed applications.</li>\n</ul>\n<strong>Qualifications:</strong>\n<ul>\n<li>Bachelor's degree: Information Technology (Computer Science, Information Systems, Electrical and Computer Engineering)</li><li>6+ Years relevant experience.</li><li>Proficiency in C# / C++ / .Net / scripting.</li><li>Proficiency in WCF / WPF / Web Services.</li><li>Working experience in UC4 (or Autosys).</li><li>Working knowledge of Windows and Linux.</li><li>Financial domain knowledge is a plus.</li>\n</ul>"}