{"job title": "Sr. Data Engineer", "company": "CyberCoders", "city state": "– Culver City, CA", "rating": "3.9", "job description": "Sr. Data Engineer <div>\nLocated in a beautiful office in Culver City, we are a well-funded post series B start up software development data company that creates world-class sensor technology that is currently on 300+ apps and more than 2 million devices in the US. Our panel generates more than a terabyte of sensor data every single day and provides a detailed view of more than 100 million anonymous user visits a month.\n<br><br>\nThis technology provides our customers with real-time data analytics that is used to better understand the market potential of new products and services. This software helps companies plan, build and distribute creative content that moves across multiple channels. We are a rapidly growing and are currently looking for a stellar addition to our team.\n<br><br>\nThe ideal candidate will have 2+ years of professional experience in Python or Ruby on data driven applications. You will be working on building creative tools within our marketing software. You will have the opportunity to mentor fellow engineers and influence the infrastructure of the application.\n<br><br>\nSo, if you are a Senior Data Engineer with a minimum of 2+ years of professional experience building out data processing or ETL data pipe lines, We want to hear from you!!!</div>\n\n<br>What You Will Be Doing<div>\nWe are looking for a strong engineer to contribute to creating world-class emergency technology by building out and expanding our complex data infrastructure.\n<br><br>\nYou will have the opportunity to shape the evolution of our data pipeline as I see major re-architectures happening in the next 2 years. This would include bringing in new technologies as we scale and add more use cases.\n<br><br>\n<strong>The technologies that we use are:</strong>\n\n\n<ul>\n<li>Apache Spark</li>\n<li>Apache Airflow</li>\n<li>AWS S3/Redshift/EMR</li>\n<li>Python</li></ul></div>\n\n\nWhat You Need for this Position<div>\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>Minimum of 2+ years of professional experience building out data infrastructure</li>\n<li>strong work ethic</li>\n<li>strong CS fundamentals</li>\n<li>nice to have: data processing experience, startup experience, location/sensors experience</li></ul></div>\n\n\nWhat's In It for You<div>\n\n\n<ul>\n<li>Competitive salary DOE</li>\n<li>Annual performance bonus</li>\n<li>Stock option equity component</li>\n<li>Comprehensive benefits package with medical, dental, and vision component</li>\n<li>Creative flexibility and opportunity to impact a growing startup!</li></ul></div>\n\n\n<div>\nSo, if you are a Senior Data Engineer with a minimum of 2+ years of professional experience building out data infrastructure please apply now or send your resume to howard.braithwaite@cybercoders.com for immediate consideration.</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\n<br><br>\nCyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance."}