{"job title": "Software Engineer - Features", "company": "Fitbit", "city state": "– Boston, MA", "rating": "3.3", "job description": "At Fitbit, our mission is to help people lead healthier, more active lives by empowering them with data, inspiration and guidance to reach their goals.\n<br><br>\nWe started our journey in 2007as a team of two with one big idea. Since then, we've grown to over 1,500 employees, sold over 60mm devices, and built a health and fitness community across the globe. In fact, the Fitbit Community has taken enough steps to walk from the Sun to Pluto! Offering award-winning products, a top-rated mobile app and an easy-to-use online dashboard, Fitbit provides personalized experiences that help our users reach their goals. With a reenergized focus on innovative devices, interactive experiences, and enterprise health we are transforming the way consumers and businesses see health &amp; fitness.\n<br><br>\nFrom your first steps as a Fitbitter, you will be at the forefront of developing new products. Our culture combines the spirit of startup with the perks of being public. We offer a competitive benefits package and amazing perks like unlimited snacks, Friday happy hours, onsite workout classes, and a strong focus on a healthy work-life balance. As part of our team, you'll have the opportunity to grow your career, contribute your ideas to life-changing products and services, andabove allhave fun doing it.\n<br><br>\nFitbit's HQ campus is located in the heart of San Francisco with office locations in Boston, San Diego and around the world. Think you've found your fit?\n<br><br>\n<strong>About the Role:</strong>\n<br><br>\nBackend Software Engineer who is strong enough to push development beyond the limits and deliver best-in-class solutions. Being a player of a relatively small team, which is responsible for core features of our product.\n<br><br>\nWe primarily use Java 8, JEE, Spring, Hibernate, Finagle/Finatra, MySQL, Cassandra, Kafka, Zookeeper, Prometheus.\n<br><br>\n<strong>Job Duties:</strong>\n\n<ul>\n<li>Analyse the problem, research, make a proof of concept as needed, discuss with other engineers</li>\n<li>Make a high level estimate of implementation</li>\n<li>Code the implementation and tests that meet functional and nonfunctional requirements, e.g. design patterns, logging, metrics, latency, throughput, scalability etc.</li>\n<li>Maintain and improve the production monitoring and alerting to ensure the quality of the implemented features</li>\n<li>Perform code review of the code written by other engineers</li>\n</ul>\nRequired Skills:\n\n<ul>\n<li>Ability to work and achieve results without daily supervision collaborating with other engineers</li>\n<li>Experience working with Java</li>\n<li>Expertise in Spring, JEE, RDBMS, distributed systems</li>\n<li>Solid understanding of computer science fundamentals (algorithms, data structures)</li>\n<li>Proven experience working on highly scalable, database-backed web applications</li>\n<li>Strong focus on delivering value rather than pure engineering</li>\n</ul>\nWould be a plus:\n\n<ul>\n<li>NoSQL: Cassandra, Redis and others</li>\n<li>Distributed messaging systems: Kafka and others</li>\n<li>Microservices architecture design</li>\n<li>Side projects or open-source contributions</li>\n<li>BS/MS Degree in CS/Math or related field</li>\n<li>Experience in hiring and mentoring team members</li>\n<li>Experience in governance: SOX and\\or HIPAA</li>\n</ul>\nPerks &amp; Benefits:\n\n<ul>\n<li>Competitive salaries and annual bonuses</li>\n<li>Choose your technology. Mac or PC</li>\n<li>Full-time, flexible work schedule</li>\n<li>Ability to grow professionally in a global team</li>\n<li>Comfortable office, fruits and snacks</li>\n<li>Free Fitbit products</li>\n</ul>\n<em>Fitbit is proud to be an equal opportunity employer. We recruit, hire, train, promote, pay, and administer all personnel actions without regard to race, color, ancestry, national origin, citizenship, religion, age, sex (including pregnancy, childbirth, and medical conditions related to pregnancy, childbirth, or breastfeeding), sex stereotyping (including assumptions about a person's appearance or behavior, gender roles, gender expression, or gender identity), sexual orientation, gender, gender identity, gender expression, marital status, medical condition, mental or physical disability, military or veteran status, genetic information or other statuses protected by law. We interpret these protected statuses broadly to include both the actual status and any perceptions and assumptions made regarding these statuses.</em>\n<br><br>\n<em>San Francisco applicants: Pursuant to the San Francisco Fair Chance Ordinance Fitbit will consider for employment qualified applicants with arrest and conviction records.</em>"}