{"job title": "Software Engineer in Test", "company": "Horizontal Integration", "city state": "– Boston, MA", "rating": "4.3", "job description": "<div>\n <div>\n Description\n <p>\n </p>\n<p><b>LOCAL CANDIDATES ONLY</b></p>\n\n<p><b>MUST BE ABLE TO CONVERT TO FULL TIME WITHOUT THE NEED OF SPONSORSHIP</b></p>\n\n<p><b>Primary Responsibilities:</b></p>\n\n<ul>\n\t<li>Partner with Developers, System Analysts, Business Analysts, Delivery Owners, Product Owners, Business SMEs and Quality Engineers to develop a robust Systems Integration test plan in an DevOps agile development environment</li>\n\t<li>Responsible for developing test strategy, test scenarios, QA project plan, coordinating test data setup, environment readiness, test execution and issue resolution</li>\n\t<li>Responsible to System/Integration test REST APIs, User interface, Database, reporting, ETL/Batch application components</li>\n\t<li>Explore new software, tools and capabilities to automate System integration testing to supports continuous delivery/DevOps agenda</li>\n\t<li>Participate and provide input in system analysis, design walkthroughs and code reviews</li>\n\t<li>Come up with innovative ideas/suggestions to resolve complex systems integration issues/defects</li>\n\t<li>Present results to the project teams, Business/IT leaders to help with Go-No Go decisions</li>\n\t<li>Comply with standards of the software development life cycle, DevOps and continuous delivery process</li>\n\t<li>Meet or exceed all defined target test goals and milestone dates for the project in order to ensure its overall success</li>\n</ul>\n\n<p><b>Required Qualifications:</b></p>\n\n<ul>\n\t<li>Bachelors Degree in Engineering or equivalent work experience</li>\n\t<li>5+ years of Quality engineering testing experience in a web application environment Testing User Interfaces, backend database, Web services, APIs, Batch/ETL application components</li>\n\t<li>3+ years of hands-on scripting/coding experience in any one of the below Java automation testing tools such as Spock, Groovy, Selenium, Gatling, Junit, Geb, Cucumber, C++, .Net or other similar tools which uses object oriented programs</li>\n\t<li>2+ years of experience writing Functional/Integration test plans and test cases for complex software application</li>\n\t<li>2+ years of hands-on testing experience in a Continuous Integration/Delivery/DevOps environment supporting weekly or daily production deployments</li>\n\t<li>2+ years of hands-on testing experience working with XML/JSON, MQ interface, EDI X12, SQL transactions</li>\n\t<li>1+ years of hands-on experience working with UNIX operating system and writing DB SQL scripts</li>\n\t<li>Exposure to incremental agile software development methodologies</li>\n\t<li>Prior experience in working closely with Developers and Architects in solving software defects</li>\n\t<li>Experience in creating and implementing testing methodologies, processes to solve testing problem in hand</li>\n</ul>\n\n<p><b>Preferred Qualifications:</b></p>\n\n<ul>\n\t<li>Prior Java/.Net/C++ programming experience</li>\n\t<li>Prior Performance testing experience</li>\n</ul>\n\n<p> </p>\n\n<p>#KRT</p>\n\n \n <p><em>Horizontal Integration is proud to be an Equal Opportunity and Affirmative Action Employer. We seek to provide employment opportunities to talented, qualified candidates regardless of race, color, sex/gender including gender identity and/or expression, national origin, religion, sexual orientation, disability, marital status, citizen status, veteran status, or any other protected classification under federal, state or local law. </em></p>\n<p><em>\nIn addition, Horizontal Integration will provide reasonable accommodations for qualified individuals with disabilities. If you need to request a reasonable accommodation in order to complete the application or interview process, please contact hr@horizontalintegration.com. </em></p>\n<p><em>\nAll applicants applying must be legally authorized to work in the country of employment.<br>\n</em>\n</p>\n<div> </div> </div>\n </div>"}