{"job title": "Software Engineer", "company": "J.B. Hunt", "city state": "– Lowell, AR", "rating": "3.4", "job description": "<strong>Job Opening ID:</strong><br><br>00272088 Software Engineer (Evergreen) (Open)<br><br><strong>Job Title:</strong><br><br>Software Engineer<br><br><strong>Department:</strong><br><br>Engineering and Technology<br><br><strong>Country:</strong><br><br>United States of America<br><br><strong>State/Province:</strong><br><br>Arkansas<br><br><strong>City:</strong><br><br>Lowell<br><br><strong>Full/Part Time:</strong><br><br>Full time<br><br><strong>Shift:</strong>\n<br><br>\n<strong>Job Description Summary:</strong><br><br>A Software Engineer is responsible to assist in determining user requirements and plays a key role in the development and installation of computer applications to fulfill these requirements. Participates in project planning, analysis, design, code and code review, unit and system testing, creating and maintaining test scripts, and installing the applications.<br><br><strong>Job Description:</strong>\n<br><br>\nEssential Functions:\n<ul>\n<li>Produce effective, highly reusable, and maintainable software application design by using best practices, design patterns, and OOAD methodology.</li><li>Resolve critical problems under pressure and significant time constraint.</li><li>Gather requirements effectively, anticipate project risks, and derive an accurate scope based on all information at hand.</li><li>Communicate with all project stakeholders on a regular basis.</li><li>Participate and contribute to code reviews, shared modules, reusable components, and various enterprise architectural decisions.</li><li>Perform unit/system testing and create/maintain test scripts.</li>\n</ul>\nQualifications:\n<br><br>\nBachelor's degree in Computer Science, Information Systems, Computer Engineering, or a related field, or foreign equivalent; or equivalent, and four years of experience in software development.\n<br><br>\nFour years of experience using programs such as: Java/J2EE, Webservices (SOAP or REST), Spring, Tomcat, SQL, Eclipse, IDEA Intellij, Angular JS/Angular 2, EXT JS, Android, or iOS.\n<br><br>\n<strong>Qualifications:</strong>\n<br><br>\n<strong>Company Overview:</strong><br><br><strong>Fortune 500 experience. Career Development. Nation-wide opportunities. We are J.B. Hunt.</strong><br><br>Our success comes from strategically placing you in the most suitable role. Whether you have a passion for operations, sales, engineering, or information technology, we can jump start your career!\n<br><br>\nJ.B. Hunt Transport, Inc. is no stranger to the transportation logistics industry. From our humble beginnings in 1961, with only five tractors and seven refrigerated trailers, we have evolved into one of the largest transportation logistics companies in North America. We provide safe and reliable transportation services throughout the United States, Canada and Mexico. Our four business segments (Intermodal, Dedicated Contract Services, Truckload, and Integrated Capacity Solutions) allow us to provide customized freight solutions for customers big and small. It's no wonder we have been named one of America's Most Admired Companies by Fortune Magazine.\n<br><br>\nJ.B. Hunt Transport, Inc. is committed to basing employment decisions on the principles of equal employment opportunity without regard to race, color, religion, sex, national origin, age, persons with disabilities, protected veterans or other bases by applicable law."}