{"job title": "Junior Developer/Data Analytics - Credit Markets Division", "company": "Macquarie Group", "city state": "– New York", "rating": "3.7", "job description": "Apply your bachelors degree theoretical knowledge and your practical coding skills in a front-office role within our Credit Markets team, closely aligned with revenue generation. Our Portfolio Solutions Group is looking for you to bring your strong technical acumen and genuine interest in developing your skills within a high performing and global organization.\n<br><br>\nIn this highly visible front office role, youll use your development skills with SQL and strong knowledge of various coding languages to calibrate the direction of the credit markets business by providing data-driven insight into daily business activities and our client opportunities pipeline. By successfully building relationships across the business, you will collaborate with colleagues in front-office, data science, and IT teams to turn data collected from various sources into actionable intelligence. Sitting on the trading floor youll be immersed within the day-to-day business operations and have the opportunity to become a subject matter expert in this space.\n<br><br>\nIdeally, you will bring to the team, a bachelors degree in a quantitative field such as math, engineering or computer science, coupled with strong technical acumen across various coding languages (e.g. Python, SQL, Linux, Excel, VBA). Youll also be motivated to learn and hone your technical skills within a supportive and learning environment.\n<br><br>\nIf you're ready to start your career, please apply now.\n<br><br>\nCommodities and Global Markets provides clients with an integrated, end-to-end offering across global markets including equities, fixed income, foreign exchange and commodities.\n<br><br>\nFind out more about Macquarie at www.macquarie.com/about\n<br><br>\nAll qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, national origin, age, disability, protected veteran status, genetic information, marital status, gender identity or any other impermissible criterion or circumstance. Macquarie also takes affirmative action in support of its policy to hire and advance in employment of individuals who are minorities, women, protected veterans, and individuals with disabilities."}