{"job title": "Software Engineer (Backend)", "company": "OpenTable", "city state": "– San Francisco, CA, United States", "rating": "3.8", "job description": "Software Engineer (Backend) (OpenTable, Inc., San Francisco, CA)\n<br><br>\n<strong></strong>\n<br><br>\nBuild robust, scalable and performant backend systems. Design and create services for various restaurant products. Help identify gaps in code quality and improve code quality by writing unit, integration, component and E2E tests and performing code reviews. Participate in design and brainstorming sessions and contribute ideas to the company's technology and products. Use strong communication skills (verbal and written) to work with the product and design teams to understand end-user requirements, formulate user stories and scenarios, and then develop quality solutions with executable tests. Address security risks by identifying solutions to security issues, articulating their importance and driving them to resolution.\n<br><br>\nMinimum Requirements: Master's degree or U.S. equivalent in Computer Science, Engineering, Information Technology, or a related field, plus 3 years of professional experience in performing software engineering (including building, maintaining, and improving software systems). Must also have the following: 3 years of professional experience in developing software using data structures and Object Oriented Design; 2 years of professional experience in performing software product development using C# and its technology stack; 2 years of professional experience in performing Unit testing, Integration testing, Component Testing and E2E Testing; 2 years of professional experience in using relational database management systems or NoSQL databases; 2 years of professional experience in logging, software performance monitoring and analysis. In lieu of a Master's degree plus 3 years of experience, the employer will accept a Bachelor's degree or U.S. equivalent in Computer Science, Engineering, Information Technology, or a related field, plus 5 years of professional experience in performing software engineering (including building, maintaining, and improving software systems). Must also have the following: 3 years of professional experience in developing software using data structures and Object Oriented Design; 2 years of professional experience in performing software product development using C# and its technology stack; 2 years of professional experience in performing Unit testing, Integration testing, Component Testing and E2E Testing; 2 years of professional experience in using relational database management systems or NoSQL databases; 2 years of professional experience in logging, software performance monitoring and analysis.\n<br><br>\nPlease submit resume online at: https://www.opentable.com/careers/technology/?p=job%2FoKY27fwB Please specify ad code GRKP. EOE. MFDV.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}