{"job title": "Software Engineering Manager", "company": "Outreach", "city state": "– Seattle, WA", "rating": "4.4", "job description": "<strong>The Role</strong>\n<br><br>\nWe are looking for a Software Engineering Manager to lead a team owning one of the key areas of Outreach:\n\n<ul>\n<li>Manage, coach, and mentor a team of up to 15 total developers, including 2-5 lead developers and their direct reports</li>\n<li>Own the project backlog for your team, working closely with product management and engineering stakeholders to identify projects and set priorities</li>\n<li>Define and track key performance metrics for your team</li> \n\n<li>Collaborate closely with recruiting to define job requirements, interview candidates, and build the team</li>\n</ul>\n<strong>Why You'll Love It Here</strong>\n\n<ul>\n<li>100% medical, dental, and vision coverage for full-time employees</li>\n<li>Unlimited PTO (and people actually use it!)</li>\n<li>401k to help you save for the future</li>\n<li>Company-organized and personal paid volunteer days to support the community that supports us</li>\n<li>Fun company and team outings because we play just as hard as we work</li>\n<li>Diversity and inclusion programs that promote employee resource groups like OWN (Outreach Women's Network)</li>\n<li>A parental leave program that includes not just extended time off but options for a paid night nurse, food delivery, gradual return to work, and the Gottman Institute's Bringing Home Baby course for new parents</li>\n<li>Employee referral bonuses to encourage the addition of great new people to the team</li>\n<li>Plus, unlimited snacks and beverages in our kitchen</li>\n</ul>\n<strong>What We Do</strong>\n<br><br>\nOutreach is the leading sales engagement platform and triples the productivity of sales teams. It empowers them to drive predictable and measurable revenue growth. Outreach makes customer-facing teams more efficient by prioritizing the right activities and scaling customer engagements with automation. With built-in intelligence guiding every action, teams using Outreach work more effectively. By bringing data about prospects and sales activities into a single system of action, the Outreach user's visibility is improved into what really drives results.\n<br><br>\nThousands of customers, including Cloudera, Glassdoor, Pandora, and Zillow, rely on Outreach to execute a repeatable playbook, drive collaboration between sales and marketing, and deliver higher revenue per sales rep. To learn more, please visit https://www.outreach.io/.\n<br><br>\n<strong>Who We Are</strong>\n<br><br>\nOutreach was founded in 2014, and we are now over 250 employees strong. Our privately-held, venture backed company is headquartered in Seattle, but we also have offices in San Francisco and Tampa (both for sales and marketing). If you speak to us, you'll probably see that across any geography, across all our roles and departments, at our heart we are a large group of customer-obsessed individuals working toward a common goal, pushing each other to be better tomorrow than we were today.\n<br><br>\nWhile we've been busy creating a product that our users cherish, we've also been recognized as:\n\n<ul>\n<li>Forbes Next Billion Dollar Startups 2017</li>\n<li>Inc. Best Places to Work 2017</li>\n<li>Seattle Business Magazine's #1 mid-sized company to work for in Washington State 2017</li>\n<li>Seattle Business Tech Impact SaaS Award 2017</li>\n<li>Business Insider's 51 Enterprise Startups to Bet Your Career On In 2018</li>\n</ul>\nOutreach is one of the fastest-growing SaaS companies in history. We aren't slowing down anytime soon, and we bet you can help us reach our goals!"}