{"job title": "Data Engineer", "company": "Partners HealthCare(PHS)", "city state": "– Boston, Massachusetts", "rating": "NA", "job description": "As a not-for-profit organization, Partners HealthCare is committed to supporting patient care, research, teaching, and service to the community by leading innovation across our system. Founded by Brigham and Women's Hospital and Massachusetts General Hospital, Partners HealthCare supports a complete continuum of care including community and specialty hospitals, a managed care organization, a physician network, community health centers, home care and other health-related entities. Several of our hospitals are teaching affiliates of Harvard Medical School, and our system is a national leader in biomedical research.\n<br><br>\nWe're focused on a people-first culture for our system's patients and our professional family. That's why we provide our employees with more ways to achieve their potential. Partners HealthCare is committed to aligning our employees' personal aspirations with projects that match their capabilities and creating a culture that empowers our managers to become trusted mentors. We support each member of our team to own their personal development-and we recognize success at every step.\n<br><br>\nOur employees use the Partners HealthCare values to govern decisions, actions and behaviors. These values guide how we get our work done: Patients, Affordability, Accountability &amp; Service Commitment, Decisiveness, Innovation &amp; Thoughtful Risk; and how we treat each other: Diversity &amp; Inclusion, Integrity &amp; Respect, Learning, Continuous Improvement &amp; Personal Growth, Teamwork &amp; Collaboration.\n<br><br>\n<strong>General Summary/Overview</strong> \n<br><br>\nThe Center for Clinical Data Science (CCDS) aims to transform healthcare through cutting-edge data science, machine learning, and artificial intelligence (AI). We combine a translational, product-focused, early-stage culture with the world-class researchers, physicians, and data/computing resources at Harvard-affiliated Massachusetts General and Brigham and Women's Hospitals, as well as the broader Partners HealthCare System. Given our direct access to vast stores of biomedical data, decades of clinical experience, and deep expertise in the latest advances in cognitive computing, the CCDS is perfectly positioned to lead AI enabled advancements in medicine.\n<br><br>\nWe are seeking a top-notch data engineer with a passion for creating data driven solutions that are best-in-class. The role of this position will be to help create tools, levering the latest in advances in data science, machine learning and deep learning, to impact healthcare across a spectrum of focus areas including medical imaging, diagnostics, clinical informatics and population health.\n<br><br>\nThe ideal candidate will be a data engineer who is driven by building pipelines that feed data scientists with data and can work both independently as well as part of a competitive and collaborative team. We are seeking a candidate with the demonstrable ability to find solutions where others couldn't, who has the drive, energy and determination to pull the team forward and persevere until the impossible is possible. We're looking for self-starters with a strong sense of urgency, comfort moving forward independently and sourcing input where required, and a tolerance for operating in a fast-paced early stage environment with a high degree of ambiguity.\n<br><br>\n<strong>Principal Duties and Responsibilities</strong>\n\n\n<ul>\n<li>Write clean, maintainable performance code ensuring data is flowing smoothly between source and destination</li>\n<li>Comfortable transforming, normalizing and merging multiple sources of data in both batch and streaming environments.</li>\n<li>Build pipelines that feed data scientists with data: Develop and manage extraction tools, wrap the data, and send it forward in the data pipeline. Correct, transform and enrich the data. Quickly and efficiently load bulk data.</li>\n<li>Work tightly with the broader data science and software teams to identify the path to a successful product</li>\n<li>Strengthen the team by facilitating the adoption of processes that will allow us to work faster and hire exceptional teammates</li>\n<li>Use the Partners HealthCare values to govern decisions, actions and behaviors. These values guide how we get our work done: Patients, Affordability, Accountability &amp; Service Commitment, Decisiveness, Innovation &amp; Thoughtful Risk; and how we treat each other: Diversity &amp; Inclusion, Integrity &amp; Respect, Learning, Continuous Improvement &amp; Personal Growth, Teamwork &amp; Collaboration</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Bachelors degree or equivalent combination of education and demonstrated front-end experience required. Computer science, engineering, or equivalent undergraduate and graduate degrees are preferred, though not strictly required necessary</li>\n<li>A minimum of 5+ years of experience in ETL Data Engineering</li>\n<li>Fluency in Python. Fluency in database software (SQL + variants, MongoDB) and distributed computing (i.e. Hadoop, Spark) are strongly preferred.</li>\n<li>Familiarity with Node.js, Flask, Express, micro services with containers, and .NET are strong pluses</li>\n<li>Familiarity with common tools for machine learning (i.e. Tensorflow, Pytorch) and general scientific computing are pluses</li>\n<li>Knowledge of software team management philosophies (e.g. Agile, Scrum) and various product management/software development tools (e.g., JIRA, Trello, etc.) are pluses</li>\n<li>Experience with software development for healthcare products as well as familiarity with common clinical scenarios, regulatory and quality standards, payer and provider considerations, are beneficial but not necessary</li>\n<li>Clear, demonstrable evidence of exceptional productivity and performance in competitive environments</li>\n</ul>\n\n<strong>Skills/Abilities/Competencies Required</strong>\n<br>\n<ul>\n<li>Strong sense of urgency and proactiveness</li>\n<li>Ability to function effectively and independently in a fast-paced environment, organize and prioritize work independently, and meet tight deadlines</li>\n<li>Self-motivated, with an entrepreneurial mindset and ability to learn quickly</li>\n<li>Strong analytical, planning, organization and time management skills with a strong attention to detail</li>\n<li>Excellent interpersonal skills to effectively communicate with technical teams, cross-functional teams, and staff at all levels of the organization including both technical and non-technical personnel</li>\n<li>Ability to successfully negotiate and collaborate with others of different skill sets, backgrounds and levels within and external to the organization</li>\n<li>Ability to effectively conduct meetings and lead and facilitate large working sessions with all levels of staff and across various stakeholder groups</li>\n<li>Demonstrates strong evidence of algorithmic and structured thinking, with an intuition for logic, pattern matching, what-if analysis, problem decomposition and synthesis.</li>\n<li>Demonstrated ability to organize and incorporate complex systems requirements into product features and prioritize features effectively</li>\n</ul>\n\n<strong>Working Conditions</strong>\n\n\n<ul>\n<li>Working with our team on site as well as traveling to meet collaborators at multiple sites in the local Boston area</li>\n<li>Occasional travel (</li>\n</ul>\n\n<strong>Supervisory Responsibility</strong>\n<br><br>\nNo direct reports; may indirectly provide leadership and guidance to less seasoned and new staff\n<br><br>\n<strong>Fiscal Responsibility</strong>\n<br><br>\nNo direct budgetary responsibility; demonstrates fiscal responsibility by effectively using CCDS and Partners resources\n<br><br>\n<strong>EEO Statement</strong>\n<br>\nPartners HealthCare is an Equal Opportunity Employer &amp; by embracing diverse skills, perspectives and ideas, we choose to lead. All qualified applicants will receive consideration for employment without regard to race, color, religious creed, national origin, sex, age, gender identity, disability, sexual orientation, military service, genetic information, and/or other status protected under law.\n<br><br>\nPartner's Healthcare is acting as an Employment Agency in relation to this vacancy."}