{"job title": "Engineering Support NOC Technician", "company": "Rise Broadband", "city state": "– Loveland, CO", "rating": "2.7", "job description": "<div><b>Imagine a career in a position that offers a generous benefits package and competitive pay. Now imagine yourself in a Company that’s goal is to promote from within, and provides a ladder for success. Do you have passion, commitment, dedication and enthusiasm? Do you like working with the latest technology and providing superb customer service? Our success, personal growth and fun on your list of must haves?</b></div><div><b><br></b></div><div><b>If you answered yes to any of these questions, apply and join Rise Broadband - The nation’s largest fixed wireless network. We are dedicated to providing reliable high-speed Internet and phone service, which enables customers to connect with the people and things they value most.</b></div><div><b><br></b></div><div><b>Providing a great customer experience is what we do here at Rise Broadband. But Rise has more to offer including – benefits, a fun work environment and career advancement opportunities. Many of our supervisors and managers began on our front lines answering calls or performing customer installations. </b></div><div><b><br></b></div><div><b><br></b></div><div><b>General Summary </b> </div><div> </div><div><br></div><div>The Engineering Support NOC Technician position is responsible for Wide Area Network (WAN) engineering and the development and maintenance of a large wireless/wired Internet Service Provider (ISP) network. This position ensures that the Company’s WAN is tuned for optimum performance. The Engineering Support NOC Technician also assists with system administration. This position maintains consistent interaction with the Company’s installation and customer care departments to prevent and proactively address issues concerning direct and indirect impact on customers.</div><div><br></div><div><br></div><div><b>Essential Duties and Responsibilities</b></div><div><br></div><div><br></div><div>* Monitor and optimize local and wide-area networks for optimal performance and maximum availability</div><div>* Troubleshoot, evaluate and resolve WAN performance and capacities; identify problem areas, bottlenecks and network problems; use various network tools to provide resolution for system issues; maintain, monitor and perform WAN configuration backups; prepare WAN system documentation</div><div>* Collaborate on the design and implementation of new technical solutions; provide solution requirements to extend monitoring tools for network devices</div><div>* Administer the WAN, hardware, circuits and carrier relations; assist in the administration of the Local Area Network (LAN), hardware and software</div><div>* Manage and coordinate system administration; configure Email, Domain Name System (DNS) and Dynamic Host Configuration Protocol (DHCP) systems; install and configure systems; assist with security and third party software installation; manage basic system administration tools and processes; oversee machine boot and shut down procedures; assist with user account management, backup and system database maintenance (groups, hosts, aliases, user manager)</div><div>* Provide next level support to the Company’s technicians</div><div>* Coordinate the division’s operating system; assist with user level command/utilities oversight, edit files, issue commands, find users’ home directories, navigate through the file system and use Input/Output (I/O) redirection</div><div>* Communicate and liaise with all other Company departments; notify appropriate parties immediately of any issues which may affect efficient operations including, but not limited to, outages, service disruptions, tower volume and repeated customer complaints</div><div>* Work requires weekend and/or evening work and some travel may be required</div><div><br></div><div><br></div><div><b>Knowledge, Skills and Abilities Required</b></div><div><br></div><div><br></div><div>•Must have a valid driver license to drive within the Company’s geographical footprint</div><div>•Excellent oral, written and interpersonal communication skills</div><div>•Solid knowledge Microsoft Office Suite and other job related software; basic understanding of Microsoft Visio</div><div>•One (1) year of experience with administration, implementation and troubleshooting of Internet Protocol (IP) routers, Layer 2 and Layer 3 switches and firewalls; basic experience with design, implementation and troubleshooting of IP network routing policies; basic experience with Enhanced Interior Gateway Routing Protocol (EIGRP), Border Gateway Protocol (BGP), Open Shortest Path First (OSPF), Multiprotocol Label Switching (MPLS), Network Address Translation (NAT) and IP network Quality of Service (QoS) policies; basic understanding of configuration and installation of routers, switches and other solution components</div><div>•Basic understanding of PHP, Perl, Python, Shell scripting, Cisco Internetwork Operating System (IOS) and Red Hat/Centos; working towards Cisco Certified Network Analyst (CCNA) certification preferred</div><div>•Solid knowledge of data communication concepts and technologies</div><div>•Basic ability to implement network security best practices</div><div>•Basic knowledge of L2 switching and spanning tree technologies</div><div>•Proficient with Network Management Systems (NMS) and monitoring applications</div><div>•Customer service oriented with passion for high customer satisfaction and achieving operational excellence; ability to interact with all levels of staff including senior management, internal and external customers</div><div>•Must be able to demonstrate attention to accuracy on all duties and responsibilities</div><div>•Ability to analyze and define problems, prioritize work flow, multitask, meet deadlines and remain flexible</div><div>•Ability to maintain confidentiality</div><div>•Must comply with Company and Occupational Safety and Health Administration (OSHA) established safety policies and requirements</div><div><br></div><div><b><br></b></div><div><b>Disclaimer</b></div><div><br></div><div> </div><div>This job description is not meant to be an all-inclusive statement of every duty and responsibility which will ever be required of an employee in this position, however, the employee will be held responsible for all duties assigned.</div><div><br></div><div><br></div><div><b>DISCLAIMER</b></div><div><br></div><div><br></div><div>Electronic Application Procedures: Rise Broadband only considers applicants that complete our electronic application through our career center. If, because of a disability, you need special services or facilities in order to apply for this opening, please call the Human Resources Office 3 0 3 – 7 0 5 – 6 5 2 2.</div><div><br></div><div>Diversity creates a healthier atmosphere and Rise Broadband is an Equal Opportunity/Affirmative Action employer. We are firmly committed to non-discrimination and affirmative action and it is the policy of the Rise Broadband to strive to afford equal opportunity to qualified individuals, regardless of their race, color, religion, sex, age, marital status, sexual orientation, gender identity, genetic information, national origin, veteran status, disability or any other legally protected characteristic.</div><div><br></div><div>We are a drug free workplace and all employees must be authorized to work in the US. All offers of employment will be contingent on the successful completion of a drug test, reference and criminal background investigation. Some positions will also require a motor vehicle record check.</div><div><br></div><div>For more information about the company please visit: http://risebroadband.com </div><div></div><div><br></div>"}