{"job title": "Data Engineer", "company": "rposervices", "city state": "– New york, New York", "rating": "NA", "job description": "<strong>Some of the opportunities this role has to offer include</strong>:\n<ul>\n <li>Work closely with our data scientists to help build complex algorithms that provide unique insights into our data.</li> <li>Build data pipelines that clean, transform and aggregate data from many different sources.</li> <li>Develop models that can be used to make predictions.</li> <li>Build complex functions that answer questions for the business.</li> <li>Model data at rest and enable powerful data analysis.</li> <li>Enable machine learning, natural language processing and other data science methods within Weight Watchers.</li> <li>Work with engineers across the organization to identify data quality issues in source systems and help keep the data clean.</li> <li>Provide solutions that help share data with the enterprise.</li> <li>Be an advocate for best practices and continued learning.</li> \n</ul>\n<strong>You should have</strong>:\n<ul>\n <li><strong>Experience with a Cloud Data Platform such as GCP or AWS</strong>\n\n<ul>\n <li>If GCP: Big Query, Cloud Dataflow, Cloud Dataproc, Pub/Sub</li> <li>If AWS: Redshift, EMR, Data pipeline, RDS, Lambda, and Kinesis.</li></ul> </li>\n<li><strong>Experience programming in Scala, Python, or Java</strong>.</li> <li><strong>Experience building data pipelines using Apache Beam or Apache Spark.</strong></li> <li><strong>Experience with some of the following data stores: Big Query, Redshift, Postgres, Cassandra, or Mongo.</strong></li>\n</ul>\n<strong>It would be great if you also have</strong>:\n<ul>\n <li>Experience with real time streaming solutions such as Kinesis, Pub/Sub, or Kafka.</li> <li>Large scale Data Modeling from a Modern Big Data perspective.</li> <li>Experience producing and consuming event driven data.</li> <li>Experience working on a data team building functions, models and complex algorithms.</li>\n</ul>\n\n<div>Likitha\n<br><br>\n646-877-0511</div>"}