{"job title": "SSO Software Engineer, SaaS (Austin, TX only)", "company": "SailPoint Technologies", "city state": "– Austin, Texas", "rating": "4.7", "job description": "<u>This position is based at Austin, TX HQ (remote work not available)</u>\n<br><br>\nSailPoint is seeking a Backend SSO Software Engineer to help re-architect our SSO/Authentication functionality. We are looking for well-rounded backend engineers who are passionate about building and delivering reliable, scalable microservices and infrastructure for SaaS products.\n<br><br>\nAs one of the members on the team, you will be integral in supporting our existing SSO/Authentication framework as well as build out a new framework to support multiple product lines. This is a unique opportunity to participate in the -redesign of our authentication stack.\n<br><br>\nResponsibilities:\n<br><br>\nSupport SSO/Authentication/MFA features within IdentityNow\n<br><br>\nBuild out shared authentication services for multiple SaaS product lines\n<ul>\n<li>Deliver efficient, maintainable, robust Java based microservices.</li><li>Produce designs and rough estimates, and implement features based on product requirements.</li><li>Collaborate with peers on designs, code reviews, and testing.</li><li>Produce unit and end-to-end tests to improve code quality and maximize code coverage for new and existing features.</li>\n</ul>\nRequirements:\n<ul>\n<li>2+ years of professional software development experience</li><li>Strong Java experience</li><li>Great communication skills</li><li>BS in Computer Science, or a related field</li><li>Comprehensive experience with object-oriented analysis and design skills</li><li>Comprehensive experience with an object-oriented programming language and techniques</li><li>Comprehensive understanding of Java Frameworks</li>\n</ul>\nPreferred:\n<ul>\n<li>Hands on experience with SAML and Oauth solutions</li><li>Experience with OpenAM</li><li>Experience with AWS</li><li>Experience with Continuous Delivery</li><li>Experience working on a Big Data/Machine Learning product</li><li>Experience instrumenting code for gathering production performance metrics</li>\n</ul>\nCompensation and benefits:\n<ul>\n<li>Experience a Small-company Atmosphere with Big-company Benefits</li><li>Competitive pay, 401(k) and comprehensive medical, dental and vision plans</li><li>Recharge your batteries with a flexible vacation policy and paid holidays</li><li>Grow with us with both technical and career growth opportunities</li><li>Enjoy a healthy work-life balance with flexible hours, family-friendly company events and charitable work</li>\n</ul>\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.\n<br><br>\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status."}