{"job title": "Sr Scientist - Inflammation Biomarkers", "company": "Amgen", "city state": "– South San Francisco, California", "rating": "3.7", "job description": "Job Description\n<br>\nAmgen is a leading global biotechnology company, with a mission to serve patients around the world. As a science-based, patient-focused organization, we discover and develop innovative therapies to treat serious illnesses. Our medicines have made a dramatic difference in the lives of millions. To underpin our commitment to serve patients, Amgen is developing our Translational Science focus with modern molecular and cellular science and pathology laboratories, designed to discover and develop valuable biomarkers in support of clinical programs.\n<br><br>\nAmgen R&amp;D Medical Sciences/Translational Sciences is looking for a Sr Scientist dedicated to clinical biomarker development. This position will primarily support Inflammation biomarker discovery and development. The successful candidate will work cross-functionally within Amgen and to interact closely with both the clinical and discovery research groups.\n<br><br>\nThe position will focus on the development and execution of clinical biomarker strategies to inform biochemical coverage, pharmacodynamics, and patient selection to support the progression of Amgen's pipeline candidates from late preclinical through all stages of clinical development.\n<br><br>\nThe role is responsible for designing experiments, drafting and implementing protocols, executing studies, organizing data, analyzing results, and drafting technical reports or tech transfer documents.\n<br><br>\nWill interface with discovery research and is expected to work in a highly matrixed environment and drive scientific and technical innovation collaboratively with other members of the group, as well as with Amgen research community.\n<br><br>\nAmgen employees adhere to all corporate and local guidelines and regulations related to compliance and health and safety.\n<br><br>\n<strong>Basic Qualifications:</strong>\n<br><br>\nDoctorate degree and 2 years scientific experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nMaster's degree and 5 years of scientific experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nBachelor's degree and 7 years scientific experience\n<br><br>\n<strong>Preferred Qualifications:</strong>\n<br><br>\nKnowledge and experience in autoimmune, inflammatory diseases\n<br><br>\nStrong immunology background with laboratory experience in preclinical biomarker discovery/validation and/or implementing biomarker assays in a clinical trial setting\n<br><br>\nGood communication and project management skills\n<br><br>\nExperience working in teams and consistently delivering results\n<br><br>\nExperience implementing multiple technology platforms to support a research program\n<br><br>\nExperience with assay development and qualification for analysis of clinical samples\n<br>\n<strong> Join Us</strong> \n<br><br>\n<strong>If you're seeking a career where you can truly make a difference in the lives of others, a career where you can work at the absolute forefront of biotechnology with the top minds in the field, you'll find it at Amgen.</strong>\n<br><br>\n<strong>Amgen, a biotechnology pioneer, discovers, develops and delivers innovative human therapeutics. Our medicines have helped millions of patients in the fight against cancer, kidney disease, rheumatoid arthritis and other serious illnesses.</strong>\n<br><br>\n<strong>As an organization dedicated to improving the quality of life for people around the world, Amgen fosters an inclusive environment of diverse, ethical, committed and highly accomplished people who respect each other but compete intensely to win. Together, we live the Amgen values as we continue advancing science to serve patients.</strong>\n<br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n<br><br>\nAmgen will consider for employment qualified applicants with criminal histories in a manner consistent with the San Francisco Fair Chance Ordinance."}