{"job title": "Director - Data Science Acceleration", "company": "Amgen", "city state": "– Thousand Oaks, CA", "rating": "3.7", "job description": "Amgen is seeking a Director of Data Science Acceleration at its headquarters in Thousand Oaks, CA. The Director will report to the Executive Director of Analytics and Knowledge Management, who in turn reports to the CIO.\n<br><br>\nThe Director of Data Science Acceleration will lead a team of data science and data engineering experts with the mission to enhance Amgen's execution of advanced analytics practices. This team will partner with two cohorts at Amgen: expert data science professionals in areas like epidemiology, biostatistics, computational biology; and Amgen business teams which do not currently use data science methods to aid decision-making. The Director, known internally as a Director of Data Science, will be responsible for partnering with and removing barriers for the first and exploring the art of the possible and developing solutions with the second.\n<br><br>\nThe Director will develop and execute an enterprise-wide strategy to increase Amgen's overall data science capability, including investments in training, recruiting, technology, data engineering, governance processes, etc. Team members will partner and lead CEO-sponsored initiatives requiring machine learning (ML), artificial intelligence (AI), natural language processing (NLP), and advanced statistical methods.\n\n\n<ul>\n<li>*Responsibilities of the** **Director of Data Science Acceleration includes:**</li>\n</ul>\n\n+ Engages deeply with C-level business leadership as a trusted and influential contributor to data-driven decision making, ensuring maximum impact of data science outputs\n<br><br>\n+ Provides and inspires data science innovations that fuel the growth of Amgen\n<br><br>\n+ Recruits and grows a talented team of data scientists and data science managers and establish an internal data science community\n<br><br>\n+ Participates in development of analytical roadmaps with strategic and functional analytics teams\n<br><br>\n+ Collaborates with key technology teams to integrate data collection, data quality and core model output into production systems\n<br><br>\n+ Guides and evangelizes development of projects and technologies that accelerate iterative, rapid experimentation processes, including feature engineering and data sharing across analytics teams\n<br><br>\n+ Supports and showcases a long-term research agenda aimed at generating innovations to solve critical business needs and technical challenges\n<br><br>\n+ Evolves agile / iterative development process to drive timely data science outcomes and reinforce the test-and-learn culture\n\n\n<ul>\n<li>*Basic Qualifications:**</li>\n</ul>\n\nDoctorate degree and 4 years of Information Systems experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nMaster's degree and 8 years of Information Systems experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nBachelor's degree and 10 years of Information Systems experience\n<br><br>\n<strong>AND</strong>\n<br><br>\n4 years of managerial experience directly managing people and/or leadership experience leading teams, projects, programs or directing the allocation of resources\n\n\n<ul>\n<li>*Preferred Qualifications:**</li>\n</ul>\n\n+ 5+ years' biotech / pharmaceutical experience building, managing, mentoring, and inspiring teams with a proven track record of leveraging data to drive business results\n<br><br>\n+ Analytical storytelling -- a strong passion for and knowledge of data science, coupled with the ability to flex between strategic discussions with CEO staff and technical conversations with data science practitioners\n<br><br>\n+ Expertise developing algorithms for advanced analytics and experimental measurement, using artificial intelligence, machine learning and statistics, coupled with software engineering for both rapid prototyping and production systems\n<br><br>\n+ Ability to provide entrepreneurial guidance to business stakeholders, appropriately interpret and build on findings, and fully exploit the insights revealed through research\n<br><br>\n+ Exceptional leadership skills and experience in building and maintaining a high-performing, customer-focused, and fun team culture\n<br><br>\n+ Strong background working with large-scale data in distributed computing environments, including databases, data cleaning, and feature engineering\n<br><br>\n+ Expert user of cloud and big data technologies, statistical platforms and data visualization tools, advanced SQL skills, hands-on experience with machine learning, predictive modeling and statistical analysis techniques\n<br><br>\n+ Significant hiring experience and well-connected in the data science community\n<br><br>\n+ The preferred candidate will have the combined qualities of a good salesperson, a caring teacher and coach, an enthusiastic inventor, a careful analyst, and a knowledgeable engineer\n<br><br>\nAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.\n<br><br>\nAmgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.\n<br><br>\n<strong>\\#DS2018</strong>\n<br><br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status."}