{"job title": "Associate Research Scientist", "company": "Bristol-Myers Squibb Company", "city state": "– New Brunswick, New Jersey", "rating": "3.7", "job description": "Bristol-Myers Squibb is a global biopharmaceutical company whose mission is to discover, develop and deliver innovative medicines that help patients prevail over serious diseases.\n<br><br>\nOne shared journey is moving us forward at Bristol-Myers Squibb. Around the world, we are passionate about making an impact on the lives of patients with serious disease. Empowered to apply our individual talents and ideas so that we can learn and grow together. Driven to make a difference, from innovative research to hands-on community support. Bristol-Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees the resources to pursue their goals, both at work and in their personal lives.\n<br><br>\n<strong>Responsibilities:</strong>\n<li>The candidate will perform basic testing of preclinical animal specimens for clinical chemistry, hematology, coagulation, urinalysis and specialized biomarker assays in accordance with Good Laboratory Practices (GLPs), study protocols, and Standard Operating Procedures (SOPs).</li> <li>The candidate will collect data using state-of-the-art instrumentation interfaced to a comprehensive data management system, enter data into spreadsheets, proofread data entries, tables, and reports for accuracy against source data, and generate data reports.</li> <li>The individual must also have the ability to perform other tasks associated with laboratory functions including calibrating, maintaining, troubleshooting and performing corrective action on laboratory instrumentation, maintaining advanced quality control systems, and performing inventories of laboratory supplies and reagents. Stays current in the field of Clinical Pathology through regular review of literature and participation in professional laboratory organizations and meetings.</li>\nAs a part of the candidates career development, assists the Clinical Pathologist in data interpretation and reporting. With experience, additional tasks may include new method/assay development, validation and troubleshooting, scheduling of clinical pathology lab work, development or revision of SOPs and study protocols, serving as vendor contact for instruments, and identification/communication of new technical information.\n<br><br>\nBMS offers a challenging and collegial working environment, competitive salaries and an excellent compensation package.\n<br><br>\n<strong>Qualifications/Experience Requirements:</strong>\n<li>BS or BA in Medical Technology or one of the life sciences.</li><li>Current MT (ASCP) certification (or MLS, CLS, AVCPT or equivalent).</li><li>Proficiency in the operation and maintenance of chemistry, hematology, coagulation, and/or urine analyzers, use of quality control systems, troubleshooting, identification of blood cells and stages of maturation and performance of high complexity testing.</li> <li>A minimum of 2-4 years of experience in a clinical pathology laboratory.</li><li>Individual must be knowledgeable in blood cell identification and stages of maturation, have a basic understanding of computerized data acquisition and reporting systems, as well as proficiency in the use of quality control systems to monitor and troubleshoot systems.</li> <li>Experience with operation of chemistry, hematology, coagulation, and/or urine analyzers is required; experience with microscopy of preclinical animal blood/urine samples is preferred.</li> <li>Experience in biomarker assay development on novel platforms is preferred, including immunoassay development and/or mass spectrometry.</li><li>Experience working within a GLP environment is a plus.</li><li>The successful candidate will possess strong analytical and problem-solving skills and demonstrate a high level of attention to detail.</li> <li>Other desirable traits include high personal motivation, initiative, accountability, desire to learn, ability to work independently, ability to balance and coordinate workload and prioritize multiple projects.</li>"}