{"job title": "STOPS RESEARCH SCIENTIST 4", "company": "Camris International", "city state": "– US-Bethesda-MD", "rating": "3.4", "job description": "Overview\n<br>\n\n<br>\nCAMRIS International is an international development and research firm that realizes innovative solutions to health and development challenges through high-quality, cost-effective program and research management services. With experience working in more than 80 countries, we combine our proven systems with today’s most effective, evidence-based best practices to improve the lives of people around the world. We apply a customized, customer-centric, cost-effective business approach to offer greater value to our clients and challenge the way things have always been done in our field.\n<br><br>\nCAMRIS clients include U.S. government agencies and multilateral and private organizations. Our core practice areas include public health, agriculture and food security, economic development, education, environment, humanitarian assistance, democracy and governance, and medical research.\n<br><br>\nThis is an opportunity for employment or a contract, but we reserve the right to make no selection or award. Contingent on bid award.\n<br><br>\nCAMRIS is seeking exceptional candidates to provide scientific, technical, and other professional support services to assist the National Institutes of Health (NIH-- which is comprised of the Office of the Director and 27 Institutes and Centers) in meeting its operational objectives.\n<br>\n\n<br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n\n \n<li>\nDevises, conducts and carries out research studies in the context of the laboratory research program.</li>\n<li>\nInterprets results of experiments.</li>\n<li>\nPrepares summaries of results and drafts manuscripts for submission to peer-reviewed journals.</li>\n<li>\nProcesses and analyzes data.</li>\n<li>\nPresents findings at scientific conferences and meetings.</li>\n<li>\nRecommends new experiments to be performed and equipment to be procured.</li>\n<li>\nIndependently trains junior level and/or laboratory technicians.</li>\n<li>\nProvides data analysis.</li>\n<li>\nHypothesizes regarding any discrepancies with data.</li>\n<li>\nPerforms searches for information using the internet and information databases.</li>\n<li>\nDevelops new research protocols and techniques.</li>\n<li>\nInitiates collaborative research ideas, findings and protocol concepts with other Government agencies, academia or the private sector</li>\n<li> May act as a mentor for junior level scientists.</li>\n<li> Presents research papers at scientific meetings and conferences.</li> \n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n\n \n<li>\n6+ years experience in a related field.</li>\n<li>\nComputer skills to include MS Office Suite.</li>\n<li>\nDemonstrates expertise in basic scientific principles, concepts, and theories.\n<br><br>\n<strong>Minimum Education:</strong>\n<br><br>\nPh.D. degree in a science related field. Three (3) years of specialized experience plus a Master’s degree is equivalent to a Ph.D. Five (5) years of specialized experience plus a Bachelor’s degree is equivalent to a Ph.D.</li>\n</ul>\n\nThis effort is for a bid and contingent on award."}