{"job title": "STOPS SCIENTIST 2", "company": "Camris International", "city state": "– US-Bethesda-MD", "rating": "3.4", "job description": "Overview\n<br>\n\n<br>\nCAMRIS International is an international development and research firm that realizes innovative solutions to health and development challenges through high-quality, cost-effective program and research management services. With experience working in more than 80 countries, we combine our proven systems with today’s most effective, evidence-based best practices to improve the lives of people around the world. We apply a customized, customer-centric, cost-effective business approach to offer greater value to our clients and challenge the way things have always been done in our field.\n<br><br>\nCAMRIS clients include U.S. government agencies and multilateral and private organizations. Our core practice areas include public health, agriculture and food security, economic development, education, environment, humanitarian assistance, democracy and governance, and medical research.\n<br><br>\nThis is an opportunity for employment or a contract, but we reserve the right to make no selection or award. Contingent on bid award.\n<br><br>\nCAMRIS is seeking exceptional candidates to provide scientific, technical, and other professional support services to assist the National Institutes of Health (NIH-- which is comprised of the Office of the Director and 27 Institutes and Centers) in meeting its operational objectives.\n<br>\n\n<br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n\n \n<li>\nPlans and executes research experiments in the context of the laboratory’s overall research program.</li>\n<li>\nProvides support and mentors other laboratory staff on research projects and techniques.</li>\n<li>\nAnalyzes and interprets research data, communicates results and methods in reports, presentations, and manuscripts.</li>\n<li>\nCollaborates with industry/academia to apply the results of research.</li>\n<li>\nDevelops new techniques, products, or practices.</li>\n<li>\nPresents research at national scientific meetings/symposia.</li>\n<li>\nCreates new research protocols.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n\n \n<li>\n1-3+ years of experience in a science related field.</li>\n<li>\nDemonstrates experience working in the research laboratory environment.</li>\n<li>\nComputer skills to include MS Office Suite.\n<br><br>\n<strong>Minimum Education:</strong>\n<br><br>\nMaster’s degree in a scientific field. Two (2) years of specialized experience plus a BA/BS degree is equivalent to a Master’s degree.</li>\n</ul>\n\nThis effort is for a bid and contingent on award."}