{"job title": "Postdoctoral Scientist - Kaushansky Lab", "company": "Center for Infectious Disease Research", "city state": "– Seattle, US-WA", "rating": "3.6", "job description": "The Kaushansky Lab is seeking an outstanding <strong>Postdoctoral Scientist</strong> to work as part of a multi-disciplinary team on host-pathogen interactions. The scientist will work on computational analysis of large scale data and employ machine learning and other methods to deconvolve multi-scale data for a variety of projects. Critically, the scientist will be expected to acquire a sense of ownership over the projects, delving into the biology of the host and pathogen and to interpret results in this context. While a background in biology or infectious disease is not required for this position, enthusiasm and interest in learning about infectious disease and other biological systems is essential.\n<br><br>\nThe Center for Infectious Disease Research is a highly collaborative environment and collaboration with other Center scientists will be encouraged and expected.\n<br><br>\nThe scientist will be expected to perform analyses in a transparent manner and to clearly communicate analysis results and methods with collaborating researchers who may or not have computational backgrounds. The scientist will also be expected to develop computational tools and facilities to make data and analysis results easily accessible to other researchers. We are looking for a researcher who is enthusiastic about working as part of a collaborative, multi-disciplinary team to uncover fundamental insights into how pathogens engage and manipulate their hosts.\n<br><br>\n<strong>Required Skills &amp; Experience</strong>\n\n<ul>\n<li>Computational biology/bioinformatics experience</li>\n\n<li>A Ph.D. in bioinformatics, biology, engineering, physics, computer science, mathematics, or a related scientific discipline pertinent to the position</li>\n\n<li>Experience working with and deriving meaning from complex biological datasets</li>\n\n<li>Familiarity with wet-lab experimentation, or a history of working with experimentalists is a plus.</li>\n\n<li>Fluency with basic statistical methods</li>\n\n<li>Experience programming in R, MATLAB, or similar analysis environments</li>\n\n<li>A track record demonstrating scientific creativity, collaboration, and independence</li>\n\n<li>Excellent written and oral communication skills</li>\n</ul>\nPlease note: We are asking that you upload a <strong>CV</strong> and<strong> cover letter</strong> to be considered for this position. The inclusion of a <strong>research statement</strong> which includes your career goals is optional. Please have these documents readily available when you start your application. Applications completed without the required documents will not be considered.\n<br><br>\nOver 40 years ago, the Center for Infectious Disease Research was founded as an independent non-profit organization devoted to the research of global infectious disease. The Center holds true to those roots today, having grown to include over 250 staff members who work collaboratively with one common goal: to eliminate the world’s most devastating infectious diseases. To learn more about the Center for Infectious Disease Research and the remarkable individuals you would support, please visit our website at www.cidresearch.org\n<br><br>\nApply online through our website at https://cidresearchcareers.silkroad.com/. If you need assistance with our online application contact us at jobs@cidresearch.org.\n<br><br>\nIn compliance with the ADA Amendments Act, should you have a disability that requires assistance and/or reasonable accommodation with the job application process, please contact the Human Resources department via e-mail at jobs@cidresearch.org. Additionally, the affirmative action program/plan is available for review upon formal request by employees and applicants for employment in the Human Resources office during regular office hours.\n<br><br>\n<em>The Seattle Biomedical Research Institute dba Center for Infectious Disease Research is an Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, sex, sexual orientation, gender identity, religion, national origin, age, protected veteran status, disability status, or any other characteristic protected by law.</em><br><br>Required Skills\n<br><br>\n<strong>Required Experience</strong>\n<br><br>\nJob Location\n<br>\nSeattle, US-WA\n<br>"}