{"job title": "Sr. Scientist, R&amp;D", "company": "Danaher Corporation", "city state": "– Richmond, VA", "rating": "3.3", "job description": "<ul>\n<li>*Danaher Company Description**</li>\n</ul>\n\nChemTreat operates as a subsidiary of Danaher Corporation, one of the best performing Fortune 500 companies. Our proprietary solutions allow our customers to reduce water, chemical, and energy costs, extend asset life, improve process operations, and reduce downtime. We have expertise in a variety of industries, including automotive, beverage, chemical, food, fuel processing, metals, mining, power, pulp and paper, and textile. We also serve commercial and institutional customers, including data centers, district energy providers, universities, government buildings, and hospitals. Our company has developed a robust product portfolio for the prevention of corrosion; scale and biofouling in critical heat transfer systems and advanced polymers for industrial wastewater.\n<br><br>\n<strong>AT WILL STATEMENT</strong>\n<br><br>\nEmployment with ChemTreat is on an at-will basis, which means that either the employee or ChemTreat can terminate the employment relationship at any time and for any reason (or no reason), with or without notice, unless the employee and ChemTreat have entered a written agreement signed by the employee and a duly authorized representative of ChemTreat.\n<br><br>\n<strong>EQUAL OPPORTUNITY</strong>\n<br><br>\nChemTreat, Inc. is an Equal Opportunity Employer. We evaluate qualified applicants without regard to race, color, national origin, religion, gender, age, marital status, disability, veteran status, sexual orientation, gender identity, or any characteristic protected by law.\n\n\n<ul>\n<li>*Description**</li>\n</ul>\n\nResearch and develop chemical technologies for Cooling water treatment, provide technical support, product management support, and mentoring junior staff.\n<br><br>\n<strong>ESSENTIAL FUNCTIONS &amp; RESPONSIBILITIES</strong>\n\n\n<ul>\n<li>Conduct research to support the development of new products and proprietary technologies in Cooling Water applications with additional responsibilities of supporting product and technology development in mining and RO antiscalant applications;</li>\n<li>Support the product line Champion with New products, customer presentations, conference &amp; seminars;</li>\n<li>Be responsible for reviewing and identifying market technical needs and future trends and liaise with the product champion to fill the product gaps</li>\n<li>Help the Tech Staff team educate the sales force on key product line initiatives. Promote and encourage them to sell the product line.</li>\n<li>Travel to customers as needed and participate in customer presentations.</li>\n<li>Be influential in the State of the Art Seminars to generate interest in the product line and ensure the benefits of our product are clearly understood by our clients</li>\n<li>Mentor technical staff in assigned area of responsibility; provide training</li>\n<li>*Qualification**</li>\n</ul>\n\n<strong>SUPPLEMENTAL RESPONSIBILITIES</strong>\n<br><br>\nProvide support to corporate Tech Staff and Sales; provide strategic input; other duties as assigned.\n<br><br>\n<strong>KNOWLEDGE &amp; SKILLS</strong>\n<br><br>\nTechnical and business knowledge; Communication skills; Interpersonal skills; Teamwork and leadership; Analytical skills; Organizational skills; Self-management; Management and leadership skills.\n<br><br>\n<strong>EDUCATION &amp; EXPERIENCE</strong>\n\n\n<ul>\n<li>Minimum of five years R&amp;D laboratory experience with demonstrated boiler water research proficiency and ability to train less experienced lab personnel</li>\n<li>Advanced familiarity with common laboratory instruments, equipment, and techniques</li>\n<li>Advanced computer skills</li>\n<li>Advanced writing and communication skills</li>\n<li>Ph.D. degree in chemistry or in related science field.</li>\n</ul>\n\n<strong>PHYSICAL DEMANDS</strong>\n<br><br>\nThe Physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is occasionally required to reach with hands and arms. The employee is constantly required to sit. The employee may occasionally squat, turn/twist, or reach. The employee is constantly using hands to finger, handle, feel or operate objects, and computer keyboards. The employee is occasionally required to walk, stand, climb (including stairs), balance, stoop, bend, kneel, crouch or crawl, and talk, hear, and smell. The employee must occasionally lift, carry, push, or pull up to 25 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and the ability to adjust focus.\n<br><br>\n<strong>WORKING CONDITIONS &amp; ENVIRONMENT</strong>\n<br><br>\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. The work environment consists of an indoor work office and lab environment with good ventilation, adequate lighting, and low noise levels.\n\n\n<ul>\n<li>*Danaher Corporation Overview**</li>\n</ul>\n\nDanaher is a global science &amp; technology innovator committed to helping our customers solve complex challenges and improve quality of life worldwide. Our world class brands are leaders in some of the most demanding and attractive industries, including life sciences, medical diagnostics, dental, environmental and applied solutions. Our globally diverse team of 62,000 associates is united by a common culture and operating system, the Danaher Business System, which serves as our competitive advantage. We generated $16.9B in revenue last year. We are ranked #133 on the Fortune 500 and our stock has outperformed the S&amp;P 500 by more than 1,300% over 20 years.\n<br><br>\nAt Danaher, you can build a career in a way no other company can duplicate. Our brands allow us to offer dynamic careers across multiple industries. We?re innovative, fast-paced, results-oriented, and we win. We need talented people to keep winning. Here you?ll learn how DBS is used to shape strategy, focus execution, align our people, and create value for customers and shareholders. Come join our winning team.\n\n\n<ul>\n<li>*Organization:** Chemtreat</li>\n<li>*Job Function:** Science</li>\n<li>*Primary Location:** North America-North America-United States-VA-Richmond</li>\n<li>*Schedule:** Full-time</li>\n<li>*Req ID:** CHE001603</li>\n</ul>"}