{"job title": "Bioinformatics Scientist II", "company": "Integrated DNA Technologies", "city state": "– US-IA-Coralville", "rating": "3.6", "job description": "<div><div>\n<div>The Bioinformatics Scientist II, under minimal supervision, will support a group of experienced scientists to develop novel genomic applications. This individual will be a key contributor to the product development team and report to the NGS Bioinformatics group leader.</div>\n</div>\n</div>\n\n<br>Responsibilities<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li><div>Applies knowledge of computer science to solve domain problems with occasional guidance</div></li><li><div>Plans details required for execution of assigned work, under moderate to minimal oversight</div></li><li><div>Utilizes mathematical and statistical analysis, and other software aids as needed</div></li><li><div>Operates and maintains software development tools while keeping abreast of promising tool advancements</div></li><li><div>Maintains accurate and detailed records of work using version control tools and other documentation artifacts</div></li><li><div>Interacts with and assists other members of the R&amp;D team as needed to meet research objectives</div></li><li><div>Interact with other IDT departments and IDT customers to assist with customer service/technical support and to advance collaborative research projects as directed</div></li><li><div>Presents information at group meetings as directed</div></li><li><div>Introduces new techniques which have not previously been used at IDT</div></li><li><div>Develops and maintains bioinformatics tools and pipelines</div></li><li><div>Demonstrates behavior consistent with the Integrated DNA Technologies Core Values.</div> </li><li><div>Other duties as assigned</div></li></ul></div>\n</div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div><strong>Education:</strong>\n<ul>\n<li>Bachelor’s degree (in Engineering or other related field) with three or more years of experience in bioinformatics, software engineering or other scientific discipline required</li><li>Master’s degree in Bioinformatics, Biology or related field preferred</li>\n</ul>\n<strong>Professional Experience:</strong>\n<ul>\n<li>Minimum of 2 years of experience in the field of Bioinformatics required</li><li>Knowledge and understanding of computational and biological issues required</li><li>Previous experience working in a multidisciplinary, fast-paced and results-oriented environment preferred</li><li>Significant experience in bioinformatics pipeline development preferred.</li> <li>Practical experience exploiting cloud computing resources preferred.</li>\n</ul>\n<strong>Other Job Qualifications</strong>\n<ul>\n<li>Proficiency in Python or other scripting languages</li><li>Programming and data analysis experience in a distributed Unix environment</li><li>Familiarity with public bioinformatics resources and tools</li><li>Knowledge of best-practice data presentation methods for internal and external audiences</li><li>Ability to easily integrate into and collaborate with a multidisciplinary team</li><li>Excellent oral and written communication skills</li><li>Adaptability to performing a variety of duties, often changing from one task to another without loss of efficiency or composure.</li><li>Ability to maintain both a high standard of courtesy and cooperation in dealing with co-workers.</li><li>Adaptability to accepting responsibility for the direction, control or planning of an activity.</li>\n</ul>\n<strong>Physical Requirements:</strong>\n<br><br>\nExert up to 10 lbs. of force occasionally and/or up to a minimal amount frequently\n<br><br>\nIntegrated DNA Technologies is an equal employment and affirmative action employer. Minorities, women, veterans and individuals with disabilities are encouraged to apply.</div>\n</div>\n</div>\n<br>"}