{"job title": "Clinical Lab Scientist (40 hrs, evenings)", "company": "Memorial Hospital Los Banos", "city state": "– California-Peninsula/South Bay and Santa Cruz-Burlingame", "rating": "4.5", "job description": "Performs all laboratory testing covering all levels of complexity necessary for diagnosis and treatment of patients at the request of attending physicians. Responsible for reviewing and releasing laboratory testing performed by a laboratory technician III. Is responsible for reporting results in a timely and accurate manner as substantiated by the concurrent testing of appropriate control materials. Performs tests and demonstrates proficiency and understanding of the procedures in two or more of the three general sections of the clinical laboratory which include Hematology, Chemistry, and Transfusion Service.\n<br><br>\nPrincipal accountabilities include:\n\n<ul>\n<li>Performs and processes specialized laboratory specimens according to procedural requirements</li> \n\n<li>Processes specialized specimens including blood, body fluids and/or tissues according to laboratory procedures and perform with accuracy and efficiency</li>\n<li>Recognizes abnormalities and/or irregularities in test results and refers to treating physician or nurse</li>\n<li>Complies testing and reporting requirement for critical test results</li>\n<li>Responds within appropriate time frame to calls from patients when phlebotomists</li>\n<li>Performs daily maintenance on instruments and equipment according to specific procedures</li> \n</ul>\nBachelor degree in clinical laboratory or related sciences with 1 yr hospital clinical training in an approved program. Valid California Clinical Laboratory Scientist (CLS) license. Additional Specialty licenses or ASCP Certification preferred. 2 years of current working experience as a CLS preferred.\n\n<ul>\n<li>Knowledge of two or more of the three technical sections in the general laboratory; hematology, chemistry and blood bank</li>\n<li>Knowledge of biology, microbiology and immunology at a level required in medical technology</li>\n<li>Knowledge and practice of standard precautions policies related to handling of potentially infectious agents</li>\n<li>Knowledge of safety procedures relating to operation of laboratory equipment and handling of chemicals</li>\n<li>Technical and analytical skills for analysis and interpretation of test procedures and results in order to determine appropriate correction action for abnormal or atypical results</li> \n\n<li>Computer skills to include keyboarding, mouse movement and data entry skills to enter information run reports</li> \n\n<li>Strong verbal/written communication and listening skills; including excellent interpersonal skills and telephone communication</li>\n<li>Must be available to work at different times of the day, night, weekends, share holidays and standby duty. Should be able to adapt to unexpected schedule changes and respond to emergency situations.</li>\n</ul>"}