{"job title": "Scientist, Technical Services – North America", "company": "Novozymes", "city state": "– : Franklinton, NC", "rating": "3.6", "job description": "Scientist, Technical Services – North America\n<br>\n <div>\n<strong>Pioneer a brighter future</strong>\n<br>\nAt Novozymes, we work in close partnership with our customers and the global community to make a sustainable impact. We use science to advance industries, and as part of the Food &amp; Beverages division, you will provide biological solutions that help improve what the world eats and drinks.\n<br><br>\n<strong>Scientist, Technical Services – North America</strong>\n<br>\nAre you an engineer or scientist new in your career and ready to contribute more? Or have you been practicing your craft for 10 or more years and are ready for a new and exciting challenge with a company making a difference in the world? We are seeking energetic, results oriented, collaborative colleagues to join our Grains Technical Services team. In this role you will partner with our customers in the starch industry as a technical expert and help them discover ways to better use our products. To be successful in this role, you should be highly innovative, with the ability to think outside the box to solve technical problems. In addition, you should have a solid understanding of how technologies and process improvements will impact the success of both Novozymes and our customers.\n<br><br>\nAs a TS Scientist, you will help our customers understand and apply the sustainable solutions that Novozymes creates, guiding our customers in exploring new applications and optimizing current production. You’ll join forces to think about future trends and ideas, and work to make them a reality today. You can expect to travel domestically and internationally up to 40% to collaborate with cross functional and international teams on projects and plant trials.\n<br><br>\nLocation: Franklinton, NC, with the possibility of working out of our Ames, IA office after gaining adequate experience.\n<br>\nIn this position you need to have:•At a minimum you must have a BS degree in Chemical Engineering, Biochemistry, or related discipline with at least 4 years of experience.\n\n\n<ul>\n<li>Experience working in the grain processing industry is preferred.</li>\n<li>Solid technical background, including chemistry, process engineering, and data analysis proven by your ability to problem solve and offer innovative and viable solutions.</li>\n<li>You should be good at building trust and rapport at all levels of an organization, and willing to work in full-scale production, laboratory, and conference room environments.</li>\n<li>Experience working in a global setting will prepare you for working effectively and communicating well with our customers.</li>\n</ul>\n\nAre you the next Zymer in our team? Consider a career with Novozymes and let’s realize your potential together.\n<br><br>\n<strong>About Novozymes</strong> \n<br>\nNovozymes is the world leader in biological solutions. Together with customers, partners and the global community, we improve industrial performance while preserving the planet’s resources and helping build better lives. As the world’s largest provider of enzyme and microbial technologies, our bio innovation enables higher agricultural yields, low-temperature washing, energy-efficient production, renewable fuel and many other benefits that we rely on today and in the future. We call it Rethink Tomorrow. www.novozymes.com\n<br><br>\nNovozymes is committed to creating a diverse environment and is proud to be an equal opportunity and affirmative action employer. All employment decisions are based on business needs without regard to race, color, ethnicity, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, age, disability or veteran status.\n<br><br>\nApplication deadline: September 25, 2018</div><br>\n\n <div>\n<div>\nRef: 5187BR</div><br>\n\n <div>\nCity: Franklinton, NC</div><br>\n\n <div>\nCountry: USA</div><br>\n\n <div>\nJob Area: Technical Services</div>\n </div><br>\n\n <div>\nApply for this job</div>"}