{"job title": "Data Analyst II", "company": "PAE Consulting Engineers Inc.", "city state": "– San Francisco, CA", "rating": "4.4", "job description": "<div><div><div>Job Details</div></div><div><div><div>Level <div><div>Experienced</div></div></div><div>Job Location <div><div>All PAE Offices - Portland, OR, San Francisco, CA, Seattle, WA</div></div></div><div>Position Type <div><div>Full Time</div></div></div><div>Education Level <div><div>Bachelors</div></div></div></div><div><div>Travel Percentage <div><div>Up to 25%</div></div></div><div>Job Category <div><div>Finance</div></div></div></div></div><div><div>Description</div></div><div><div> <div><p><strong>Basic Purpose of the Job:</strong></p>\n\n<p>Responsible for managing master data sets; developing and publishing ad hoc and regular reports and BI representations; and standardizing, analyzing and transforming data to support strategic decision making as well as capture performance metrics.<br>\n </p>\n\n<p><strong>Culture Statement:</strong></p>\n\n<p>The success of PAE Engineers, Inc. is based on providing great products and services to our customers, every day. As team members, we are held accountable to putting our Culture Statement and Core Values at the forefront of our daily interactions with our Community members, business partners, and each other. Through deliberate execution we will foster a culture that empowers each team member to constantly improve and deliver the best results.<br>\n </p>\n\n<p><strong>At PAE,</strong></p>\n\n<ul>\n\t<li>\n\t<p>We treat other with dignity and respect.</p>\n\t</li>\n\t<li>\n\t<p>We take individual responsibility and pride in our work.</p>\n\t</li>\n\t<li>\n\t<p>We are responsible for the success of the company.</p>\n\t</li>\n\t<li>\n\t<p>We value and recognize contributions.</p>\n\t</li>\n\t<li>\n\t<p>We promote creativity and growth.<br>\n </p>\n\t</li>\n</ul>\n\n<p><strong>Core Values:</strong></p>\n\n<p>At PAE we strive to</p>\n\n<p> Inspire each other</p>\n\n<p> Interpret the best solutions for our clients</p>\n\n<p> Integrate our designs, our clients' goals and the needs of our planet.</p>\n\n<p><br>\n<strong>Essential Duties &amp; Responsibilities:</strong></p>\n\n<p>The following job description is a general summary of duties typically performed in this position. It is not all-inclusive and is not an employment contract. PAE Consulting Engineers, Inc. employees are expected to perform duties as assigned by management.</p>\n\n<ul>\n\t<li>\n\t<p>Support multiple departments and leadership by generating, reviewing and understanding data, reports and BI representations.</p>\n\t</li>\n\t<li>\n\t<p>Use multiple applications to extract data, perform data integrity audits, transform and combine datasets, and create and publish reports and BI representations.</p>\n\t</li>\n\t<li>\n\t<p>Acquire data from primary or secondary data sources and maintain databases</p>\n\t</li>\n\t<li>\n\t<p>Manage master data, including creation, updating, warehousing, and normalization.</p>\n\t</li>\n\t<li>\n\t<p>May act as Subject Matter Expert (SME) for key systems/processes in subject teams and day-to-day functions</p>\n\t</li>\n\t<li>\n\t<p>Provide quality assurance of imported data, working with team subject matter experts to validate when needed</p>\n\t</li>\n\t<li>\n\t<p>Identify data integrity issues, resolve data integrity gaps to ensure reporting is correct and complete</p>\n\t</li>\n\t<li>\n\t<p>Work with team leaders to maintain data integrity and transparency to increase data confidence across all departments</p>\n\t</li>\n\t<li>\n\t<p>Oversee the design and maintenance of standardized schemas for tracking data</p>\n\t</li>\n</ul>\n\n<p> </p></div></div></div><div><div>Qualifications</div></div><div><div> <div><p><strong>Key Competencies &amp; Skills:</strong></p>\n\n<ul>\n\t<li>\n\t<p>Experience as a data analyst or data scientist and a solid understanding of the popular data analysis tools and databases relied upon for business intelligence, particularly experience querying large data sets</p>\n\t</li>\n\t<li>\n\t<p>Proficiency required in relational databases and design, SQL scripting, MS Access, MS Excel including advanced formulas, charts, pivot tables and calculations, ODBC. Experience preferred in Power BI, SSRS, MS Data Factory, Deltek, and REST APIs.</p>\n\t</li>\n\t<li>\n\t<p>Ability to interpret data, identify relationships, analyze results using statistical techniques and provide ongoing reports</p>\n\t</li>\n\t<li>\n\t<p>Able to identify, analyze and interpret infographics, trends or patterns</p>\n\t</li>\n\t<li>\n\t<p>Ability to collect, organize and analyze large volumes of data with attention to detail and accuracy</p>\n\t</li>\n\t<li>\n\t<p>Professional, able to work with multiple stakeholders including Leadership Team, Project Managers, Accounting, and other departments to prioritize business and information needs</p>\n\t</li>\n\t<li>\n\t<p>Exposure to or experience with project based companies, professional services, architecture and building engineering preferred.</p>\n\t</li>\n\t<li>\n\t<p>Ability to work independently</p>\n\t</li>\n\t<li>\n\t<p>High level of problem solving ability and data analytics ability<br>\n </p>\n\t</li>\n</ul>\n\n<p><strong>Qualifications: </strong></p>\n\n<ul>\n\t<li>\n\t<p>Quantitative degree (Engineering, Math, Economics, Finance, Computer Science, etc.) or equivalent work experience</p>\n\t</li>\n\t<li>\n\t<p>Minimum 5 years experience performing quantitative analysis<br>\n </p>\n\t</li>\n</ul>\n\n<p><strong>Working Conditions:</strong></p>\n\n<p>This job operates in a professional office environment. This role routinely uses standard office equipment such as computers, phones, photocopiers.<br>\n </p>\n\n<p><strong>Physical Demands:</strong></p>\n\n<p>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. The employee must occasionally life and/or move up to 25 pounds. While performing the duties of the job, the employee is regularly required to sit; use hands to finger, handle, or feel; reach with hands and arms and talk or hear. The employee is occasionally required to stand; walk and stoop, kneel, crouch, or crawl.<br>\n </p>\n\n<p><strong>Direct Reports:</strong></p>\n\n<p>This position has no supervision responsibilities.</p>\n\n<p> </p>\n\n<p><strong><em>PAE Consulting Engineers, Inc.</em></strong><em><strong> is proud to be an AA/EEO employer and all qualified candidates will receive consideration without regard to characteristics protected by applicable local, state or federal law, such as race, color, sex, age, religion, national origin, physical or mental disability, pregnancy, marital status, veteran or military status, genetic information or sexual orientation.</strong></em></p></div></div></div></div>"}