{"job title": "Scientist I- Chemistry", "company": "The Norland Group", "city state": "– South San Francisco, CA", "rating": "2.0", "job description": "Job Description<div><strong> Key responsibilities:</strong>\n<br><br>\nPerform biology and chemistry related activities on the Ion Torrent sequencing platforms.\n<br><br>\nThese activities may include production and characterization of samples, instrument support, surface chemistry, sequencing, microscopy and data analysis Interact within Chemistry R&amp;D, Product and Process Development groups, Semiconductor Device Fabrication R&amp;D, and others .\n<br><br>\nDevelop new analytical tools and assays as needed to analyze data, derive conclusions, document findings and prepare reports for sharing within and between R&amp;D groups Conduct experiments and troubleshooting activities to support new product development and resolve technical issues Assist with preparing protocols, reports, and test methods Maintain detailed records and documentation .\n<br><br>\n<strong>Required Skills:</strong>\n<br><br>\nExperience working in a lab environment Experience in a structured workflow (manufacturing, QC, GXP, etc.) is highly desirable.\n<br><br>\nExperience with common molecular biology techniques used with DNA Experience with microscopy and image analysis Knowledge of next generation sequencing techniques is highly desirable .\n<br><br>\nExperience with programming languages (R, python, etc.) Anticipate needs and problems while creating solutions.\n<br><br>\nNot always instruction-based Demonstrates a sense of urgency, contagious optimism and a \"can do\" attitude Is curious, inquisitive, innovative, never satisfied with the status quo Greets challenge and change as opportunity Collaborates with others and strong orientation towards team work Embraces and leverages diversity of culture and thought.\n<br><br>\n<strong>Education/ Experience Requirements:</strong></div>Company Description<div>About us:\n<br><br>\nThe Norland Group has been in operation successfully since 1996. We are a strong believer of people management, professionalism and accountability. We only make promises when we are certain we can fulfill them. Our business focuses on fulfilling the needs of commercial and government customers in administrative services, workforce mobilization, information technology, engineering, project management services.\n<br>\nOur Mission Statement\n<br><br>\nOur main goal is to provide career advancement opportunities to our associates. We are committed to bringing our customers exceptional support services with the highest quality, integrity, and innovation. We believe that we are the stepping stone for our associates to advance their careers and to live a better life. Everyone should have a chance to live a successful and happy life. We operate our business based on those values and we choose employees who value the same principles.</div>"}