{"job title": "Safety Surveillance Scientist", "company": "United Therapeutics", "city state": "– RTP, NC", "rating": "3.2", "job description": "<u><strong>The Job Details are as follows:</strong></u>\n<br><br>\n<strong>Job Title</strong>\n<br><br>\nSafety Surveillance Scientist\n<br><br>\n<strong>Position Overview</strong>\n<br><br>\nProvide scientific support of United Therapeutics product(s), to include signal detection activities involving identification, critical evaluation, analysis, and interpretation of safety data; characterization of risks; and preparation of high quality and accurate documentation relevant to these activities. The Scientist will author safety documents, including safety topic reports. This position will provide scientific support required to Brand Safety Leads (BSL) in management of safety issues throughout lifecycle management of UT products and play a core role in safety governance committees such as PSMTs and PSRC.\n<br><br>\n<strong>Key Accountabilities / Responsibilities</strong>\n<br><br>\n•In collaboration with Brand Safety Leaders (BSLs) drive production and author/edit of aggregate safety reports, including periodic regulatory documents (PBRER, PADER, DSUR, etc.).\n<br><br>\n•Write and edit safety documents/sections, including but not limited to, clinical protocols, IB, subject consent forms, integrated safety and efficacy summaries, presentation materials for PSMT and PSRC and publications to medical/scientific journals.\n<br><br>\n•Produce high quality, accurate and fit- for-purpose evaluation documents with clear conclusion, in response to internal or regulatory authority request for safety reasons.\n<br><br>\n•Conduct routine and ad hoc signal detection for assigned products using available methodologies and publish results of safety governance committees.\n<br><br>\n•In consultation with BSL and clinical development representative, prepare CCSI or DCSI for assigned development products.\n<br><br>\n•Author, write and edit cRMPs and REMS.\n<br><br>\n•Review the worldwide medical/scientific literature to identify signals and applicable information for inclusion in aggregate safety reports. Maintain documentation surrounding all decisions.\n<br><br>\n•Support matrix team with ICSR medical review for designated and assigned product.\n<br><br>\n•Project manage all writing and safety assignments for assigned product and ensure timely delivery. Assist with the execution of CAPAs with respect to compliance gaps/failure from inspection or audit finding\n<br><br>\n•Advise on strategy for the content or safety report and in preparations of license renewal documentation (e.g. PSUR addenda LL, clinical overviews, summary bridging reports etc)\n<br><br>\n•Serve as a SME for pre and post approval inspection for the studies/products under their responsibility.\n<br><br>\n•Responsible for authoring SOPs supporting the business needs.\n<br><br>\n•Draft regulatory response documents, e.g. PRAC assessment reports.\n<br><br>\n•Perform other duties related to the position as necessary and as defined in SOPs and/or at the request of supervisor.\n<br><br>\n•Perform other duties as assigned.\n<br><br>\n<strong>Minimum Education and Experience</strong>\n<br><br>\nBachelor’s degree in life sciences or healthcare (e.g. nursing) requires a minimum of 4 years’ relevant experience, e.g. medical writing, safety scientist within the pharmaceutical/healthcare industry setting\n<br><br>\nOr\n<br><br>\nBS Pharmacy/PharmD, BS/Master’s in nursing with a minimum of 2 years’ relevant experience, e.g. medical writing, safety scientist within the pharmaceutical/healthcare industry setting\n<br><br>\nOr\n<br><br>\nMD/DO or international equivalent with 1 year of relevant experience, e.g. medical writing, safety scientist within the pharmaceutical/healthcare industry setting\n<br><br>\n<strong>Knowledge, Skills, and Abilities</strong>\n<br><br>\n•Strong medical and scientific writing; conveys medical and scientific concepts clearly and effectively\n<br><br>\n•Project management skills and ability to organize and deliver large, complex documents to regulatory specifications and on time.\n<br><br>\n•Intermediate ability to use basic system applications\n<br><br>\n•Advanced Excel skills preferred\n<br><br>\n•Advanced verbal communication skills\n<br><br>\n•The ability to work effectively in ambiguous situations\n<br><br>\n•Willing and able to challenge current state, suggest alternative approaches to improve work practices, and commit to defined changes\n<br><br>\n•Basic understanding of database structure\n<br><br>\n•Intermediate knowledge of MedDRA coding conventions and dictionaries\n<br><br>\n•Ability to apply working knowledge of pharmacovigilance processes and requirements to complex situations\n<br><br>\n•Deep knowledge of drug development processes and activities\n<br><br>\n•Ability to apply s working knowledge of medical concepts, terms, conditions, and associated pathology to identify and analyze potential safety issues\n<br><br>\n•Ability to apply working knowledge of clinical pharmacology and toxicology to interpretation of study information from a safety perspective\n<br><br>\n•Intermediate analytical thinking: diagnoses complex situations, gathers and reviews relevant information from multiple sources, and exercises sound judgment in recommending solutions\n<br><br>\n•Ability to contribute to the characterization, root causes analysis, and prioritization of potential safety risks and the definition of appropriate mitigation actions\n<br><br>\n•Working knowledge of applicable global regulatory requirements\n<br><br>\nUnited Therapeutics Corporation is an Equal Opportunity/Affirmative Action Employer - EOE Minorities / Females / Protected Veterans / Individuals with Disabilities"}