{"job title": "Electrical Process Control Engineer", "company": "AK Steel", "city state": "– Dearborn, MI", "rating": "2.5", "job description": "Our Dearborn Works facility is seeking an <strong>Electrical Process Control Engineer</strong>. The Dearborn Works is located on a more than 350-acre site in southeast Michigan. Its carbon steel melting, casting, hot and cold rolling, and finishing operations are capable of producing 3.6 million net tons of hot rolled, 2.1 million net tons of cold rolled, 1.1 million net tons of galvanized and galvannealed sheet each year.<br><br><u><strong>Primary Responsibilities:</strong></u>\n<ul>\n<li>Develops, designs, maintains and improves Level I (PLC) and Level II computer systems</li><li>Troubleshoots PLC and line-associated failures</li><li>Develops and refines mill setup models. Assist in commissioning and start-up plans and execution starting including written trials and execution performance tests and acceptance</li><li>Diagnoses and implements process design improvements</li><li>Improves quality and productivity and reduces costs</li><li>Analyzes process data and provide reports and recommendations as appropriate.</li><li>Maintain knowledge of state-of-the-art process improvements in the industry, evaluate and incorporate, if applicable</li><li>Collaborates with the Process Technology, Operating, Quality and Safety Personnel to supply reports, data and other information required in the execution of process technology responsibilities</li>\n</ul>\n<strong><u>Qualifications:</u></strong>\n<ul>\n<li>Bachelor's degree in Electrical Engineering required</li><li>Experience with PLCs and troubleshooting strongly preferred</li><li>Good negotiation, interpersonal, and communications skills</li><li>Good computer and organizational skills</li>\n</ul>\n\nAK Steel is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, sexual orientation, gender identity, genetic information, disability, military or protected veteran status.\n<br>"}