{"job title": "Sr. Data Architect, Big Data - Strategic Accounts", "company": "Amazon", "city state": "– Virtual", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAre you a Big Data specialist? Do you have Data Warehousing and/or Hadoop experience? Do you like to solve the most complex and high scale (billion + records) data challenges in the world today? Would you like a career that gives you opportunities to help customers and partners use cloud computing to do big new things faster and at lower cost? Do you want to be part of history and transform businesses through cloud computing adoption? Do you like to work on-site in a variety of business environments, leading teams through high impact projects that use the newest data analytic technologies? Would you like a career path that enables you to progress with the rapid adoption of cloud computing?<br> <br> At Amazon Web Services (AWS), we’re hiring highly technical cloud computing architects to collaborate with our customers and partners on key engagements. Our consultants will develop and deliver proof-of-concept projects, technical workshops, and support implementation projects. These professional services engagements will focus on customer solutions such as HPC, batch data processing, Big Data and Business intelligence. This role will specifically focus on Data processing capabilities and helping our customers and partners to remove the constraints that prevent our customers from leveraging their data to develop business insights.<br> <br> At AWS, we are hiring the best Big Data / Analytics cloud computing consultants, who can help our clients and partners derive business value from Big Data in the cloud. Our consultants will collaborate with partner and client teams to deliver proof-of-concept projects, conduct topical workshops, and lead implementation projects. These professional services engagements will focus on customer solutions such as HPC, batch data processing, Big Data and Business intelligence. This role will specifically focus on Data processing capabilities and helping our customers and partners to remove the constraints that prevent our customers from leveraging their data to develop business insights. <br> Responsibilities include:<br> <ul><li>Expertise - Collaborate with AWS field sales, pre-sales, training and support teams to help partners and customers learn and use AWS services such as Amazon Elastic Compute Cloud (EC2), Amazon Data Pipeline, S3, DynamoDB NoSQL, Relational Database Service (RDS), Elastic Map Reduce (EMR) and Amazon Redshift.</li><li>Solutions - Deliver on-site technical engagements with partners and customers. This includes participating in pre-sales on-site visits, understanding customer requirements, creating consulting proposals and creating packaged Big Data service offerings.</li><li>Delivery - Engagements include short on-site projects proving the use of AWS services to support new distributed computing solutions that often span private cloud and public cloud services. Engagements will include migration of existing applications and development of new applications using AWS cloud services.</li><li>Insights - Work with AWS engineering and support teams to convey partner and customer needs and feedback as input to technology roadmaps. Share real world implementation challenges and recommend new capabilities that would simplify adoption and drive greater value from use of AWS cloud services.</li><li>Push the envelope – Cloud computing is reducing the historical “IT constraint” on businesses. Imagine bold possibilities and work with our clients and partners to find innovative new ways to satisfy business needs through Big Data / Business Intelligence cloud computing.</li></ul>Amazon aims to be the most customer centric company on earth. Amazon Web Services (AWS) provides a highly reliable, scalable, low-cost infrastructure platform in the cloud that powers critical applications for hundreds of thousands of businesses in 190 countries around the world. <br> <br> <br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>BA/BS degree or equivalent experience; Computer Science or Math background preferred.</li><li>12+ years of experience of IT platform implementation in a highly technical and analytical role.</li><li>5+ years’ experience of Big Data platform implementation, including 3+ years of hands-on experience in implementation and performance tuning Hadoop/Spark implementations.</li><li>Customer facing skills to represent AWS well within the customer’s environment and drive discussions with senior personnel regarding trade-offs, best practices, project management and risk mitigation. Should be able to interact with Chief Marketing Officers, Chief Risk Officers, Chief Technology Officers, and Chief Information Officers, as well as the people within their organizations.</li><li>Demonstrated ability to think strategically about business, product, and technical challenges in an enterprise environment. Track record of thought leadership and innovation around Big Data.</li><li>Experience with analytic solutions applied to the Marketing or Risk needs of enterprises</li><li>Highly technical and analytical, possessing 5 or more years of IT platform implementation experience.</li><li>Deep understanding of Apache Hadoop 1/2 and the Hadoop ecosystem. Experience with tools such as Sqoop, Flume, Kafka, Oozie, Hue, Zookeeper, HCatalog, Solr, and Avro.</li><li>Familiarity with SQL-on-Hadoop technologies such as Hive, Pig, Impala, Spark SQL, and/or Presto.</li><li>Experience developing software code in one or more programming languages (Java, JavaScript, Python, etc).</li><li>Current hands-on implementation experience required</li><li>Ability to travel to client locations to deliver professional services when needed.</li></ul><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Masters or PhD in Computer Science, Physics, Engineering or Math.</li><li>Hands on experience leading large-scale global data warehousing and analytics projects.</li><li>Strong verbal and written communications skills and ability to lead effectively across organizations.</li><li>Deep understanding of database and analytical technologies in the industry including MPP and NoSQL databases, Data Warehouse design, BI reporting and Dashboard development.</li><li>Demonstrated industry leadership in the fields of database, data warehousing or data sciences.</li><li>Implementation and tuning experience specifically using Amazon Elastic Map Reduce (EMR).</li><li>Track record of implementing AWS services in a variety of distributed computing, enterprise environments.</li></ul><br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}