{"job title": "Client Reference Data - Sr Application Developer/Lead - Java/Scala", "company": "Bank of America", "city state": "– New York, NY", "rating": "3.6", "job description": "<strong>Job Description:</strong>\n<br><br>\nResponsible for developing, enhancing, modifying and/or maintaining applications in the Global Markets environment. Software developers design, code, test, debug and document programs as well as support activities for the corporate systems architecture. Employees work closely with business partners in defining requirements for system applications. Employees are expected to have in-depth capital markets product knowledge, and manage a high level of risk. Employees typically have in-depth knowledge of development tools and languages. Is clearly recognized as a content expert by peers. Individual contributor role. Typically requires 5-7 years of applicable experience. This job code is only to be used for associates supporting Global Markets.\n<br><br>\nClient Reference Data Senior Application Developer/Lead: This position will be working on requests across multiple Client Reference Data initiatives and regulatory programs. These programs include Corporate Actions Legal Entity Automation, Global Markets Reg W, and Global Recovery and Resolution Planning (GRRP) Reporting. We need top-tier engineers who have a strong and successful track record of solving hard problems and out of the box thinking. We work in a dynamic environment and expect new joiners to be flexible, self-sufficient and learn our business, our data and our technology stack with minimal supervision. Prime role for strong, independent individual contributor with team leadership opportunity mentoring more junior developers.\n<br><br>\n<u><strong>Required Skills</strong></u>\n<br><br>\n1) Java Programming (SCALA is a big plus)\n<br><br>\n2) SQL required (DB2 a plus)\n<br><br>\n3) Graph Technologies (Semantic Web [RDF] and Sparql is a plus)\n<br><br>\n4) CCAR; OTC; Agile\n<br><br>\n<strong>Shift:</strong><br><br>1st shift (United States of America)<br><br><strong>Hours Per Week:</strong><br><br>40"}