{"job title": "Senior Software Engineer - Backend/Cloud", "company": "Carbon Black", "city state": "– Boulder, CO, United States", "rating": "4.4", "job description": "The Senior Software Engineer will co-lead, define and build for performance and scale the next generation of endpoint security applications. This is more than a chance to write amazing code for something at significant scale with talented peers. It is a chance to have a huge impact on how hundreds of companies and governments visualize and neutralize threats to their networks. This is where global politics meet your code and the people who it empowers. Join us to make something that matters.\n<br><br>\nWhat You’ll Do\n<ul>\n<li>Design and optimize the performance of a backend data processing pipeline that is resilient to failures and is highly scalable.</li><li>Plan, monitor and improve the performance of a distributed application to process a lot of streaming data.</li><li>Review and guide development of Restful APIs to query terabytes of data.</li><li>Participate in all phases of the software development cycle as part of a Scrum team.</li><li>Proactively move the technology base to use latest tools and frameworks for best performance; considering costs and scale.</li><li>Collaborate with product management, DevOps, backend, and front-end engineers to deliver the right solution.</li><li>Support existing production code and improve performance enhancements and products.</li>\n</ul>\nWhat You’ll Bring\n<br>\nYou’ll plan for high-performance computing and build and improve a highly scalable and reliable system to process and store terabytes of data.\n<ul>\n<li>7-10 years of experience developing server side applications.</li><li>2-4 years building high performing/data intensive applications running in the cloud.</li><li>Implement changes for performance, scalability and reliability</li><li>Experience with:\n\n<ul>\n<li>Java</li><li>Restful APIs</li><li>JMS, AMQP, SQS</li><li>Git</li><li>Scaling enterprise applications in the cloud</li><li>Reducing costs in production</li><li>Agile Software Development</li></ul></li>\n</ul>\nBonus Points:\n<ul>\n<li>B.S./M.S. in Computer Science or related degree</li><li>NoSQL technologies</li><li>AWS &amp; Elastic Search</li> <li>CI/CD pipeline</li>\n</ul>\n<strong>\n<br>\nWhy you should join us</strong>\n<br><br>\nCarbon Black is a leading provider of next-generation endpoint security, leveraging breakthrough prevention technology to instantly see and stop cyberattacks before they execute. With more than 13 million endpoints under management, and more than 4000 customers—including 30 of the Fortune 100—the opportunities are massive and exciting. With 1000+ employees, offices across the world, and the best-of-the best tools for collaboration from anywhere, now is an ideal time to become part of the Cb Team. See where you fit best at Lifeatcb.carbonblack.com.\n<br><br>\n<em>Carbon Black, Inc. is an EEO/AA employer. Carbon Black is an inclusive employer that believes in workplace equality, supports diversity, creates a welcoming environment, and respects the unique qualities each individual brings to the company.</em>\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}