{"job title": "Data Engineer", "company": "Centizen", "city state": "– Portland, OR", "rating": "4.0", "job description": "<div>\n<div>\n<div>\nPosition Details: Data Engineer - 00547<br>\n\n <div> <strong>Location:</strong> Portland, OR</div> <div> <strong>Openings:</strong> 1</div> \n<br>\n<strong></strong><div><strong>Job Number:</strong></div><div><strong>Description:</strong><br><br><strong>Essential Functions/Responsibilities:</strong>\n<br><br>\no\tContinuously deliver and improve prioritized enterprise data assets that enable the growth of Columbia’s global analytics, reporting and visualization solutions.\n<br>\no\tDesign, build, test and maintain data integration, ETL processes and data management delivery within an global data lake and data warehouse environment\n<br>\no\tIdentify project risks and impediments, notify management, and proactively work with other members of the team to complete assigned tasks as defined by project scope, timelines, and budgets.\n<br>\no\tIdentify data quality issues and support Columbia’s data governance initiative by participating in necessary activities including data profiling.\n<br>\no\tParticipate in the use of Agile practices to elicit and refine requirements through an iterative process of planning, defining acceptance criteria, prioritizing, developing and delivering enterprise data asset solutions\n<br><br>\n<strong>Qualifications</strong> \n\n\n<ul>\n<li>Bachelor’s Degree required Computer Science, Information Systems or a related field. An equivalent combination of education and experience may be considered.</li>\n<li>5+ years of hands-on experience architecting, developing and/or managing the implementation of Business Intelligence solutions</li>\n<li>Expert in SQL and query optimization for data platforms such as Azure SQL DW, HDInsight, Teradata, SAP BW/HANA.</li>\n<li>Expert in database concepts, including normalization, indexing, physical and logical modeling, creation of SQL queries and performance tuning.</li>\n<li>Familiarity with the Kimball methods of data warehousing techniques, standards and best practices.</li>\n<li>2+ years’ experience with programming languages (e.g. Python, C#, JavaScript, DAX, R, .NET or Java) and visualization frameworks such as D3.js preferred.</li>\n<li>Experience with large scale data processing, data structure optimization and scalability of algorithms a plus</li>\n<li>Sound judgment and decision-making, and the appropriate sense of urgency and is a self-starter.</li>\n<li>Experience with Microsoft Azure: Data factory, data lake and data warehouse a bonus</li>\n</ul>\n\n<strong>Job Conditions:</strong> \n<br><br>\nJob requires hours that may occasionally exceed 8 hours per day and/or 40 hours per week during times of peak activity. Evening meetings and/or weekend work occasionally required to collaborate with people in other time zones and to ensure timely project completion. Some job pressure exists in the balancing of several projects with conflicting and sometimes changing deadlines. Physical ability to sit and stand for extended periods of time. Physical ability to walk, bend, stoop, kneel, and occasionally lift to 20 pounds. Ability to operate a computer keyboard. Ability to move freely throughout the department and building.</div>\n\n<br><strong><div>Perform an action:</div></strong></div><strong>\n </strong></div><strong>\n<br>\n</strong>\n</div>\n\n<br>"}