{"job title": "Software Engineer II", "company": "Choice Hotels", "city state": "– Phoenix AZ", "rating": "3.4", "job description": "<strong><u>SOFTWARE ENGINEER II – BIG DATA</u></strong>\n<br><br>\n<strong>In the hospitality industry, people matter.</strong> \n<br><br>\n<strong>That's why here at Choice we're always looking for exceptional people - people who will challenge us, make our team stronger, smarter and more complete. People who know how to roll up their sleeves and tackle the job at hand; who go the extra mile to get the job done - and done well.\n<br><br>\nAt Choice we are looking for employees to connect the world through the power of hospitality - and we offer support, training and a collaborative workplace atmosphere that makes us a great place to bring together people, brands, and technology that enable success.\n<br><br>\nWho are we looking for? Maybe it's you.</strong>\n<br><br>\nWho we are:<br><br>Choice Hotels International is a cutting edge software development company that develops software to manage, reserve and book hotel rooms in its portfolio of 11 branded hotels. Choice provides innovative enterprise SOA solutions based on Open Source and AWS technologies. Choice is a tightknit team where you can enhance your skills in an environment that emphasizes creativity, sharing, teamwork, professionalism, and outstanding quality software. You will work alongside some of the most talented and dynamic professionals as they work to provide exceptional solutions to the many challenges our business and franchises face. If you are bright, driven, enjoy working with the latest technologies and have the right blend of business acumen, technically savvy and customer-facing skills then this opportunity is for you. If you are willing to work hard, looking for a place to learn and grow, and have the skills we would like to hear from you.<br><br><strong>The cool stuff you do:</strong>\n<ul>\n<li>Go-to expert in one area of the codebase; understands the broad software architecture of the entire system.</li><li>Thinks at the enterprise level for reliability, scalability, maintainability, extensibility, portability, and security.</li><li>Provides technical advice and weighs in on technical decisions that impact other teams or the company at large. Researches and proposes new technologies. Starts initiatives for SDP review.</li><li>Scopes and stages work into well-defined milestones to avoid a monolithic deliverable.</li><li>Regularly delivers software on-time and is constantly working to make accurate estimates and deliver on those estimates.</li><li>Known for drama-free launches.</li><li>Owns the technical testing and performance plan for their projects.</li><li>Takes initiative to identify and solve important problems, coordinating with others on cross-cutting technical issues.</li><li>Sets direction at the project/service level and consistently influences decision-making at the top level of team.</li><li>Identifies and proactively tackles technical debt before it grows into debt that requires significant up-front work to resolve.</li><li>Able to provide feedback on projects outside of their core area.</li><li>Identifies and proposes strategies around technical problems affecting their team, communicates standards and gets buy-in on solutions.</li><li>Makes others better through code pull reviews, thorough documentation, technical guidance, and mentoring or serving as a Tech Lead on a project.</li><li>Understands the tradeoffs between technical, analytical and product needs and leads to solutions that take all of these needs into account.</li>\n</ul>\n<strong>You are awesome at:</strong>\n<br><br>\nExpert level proficiency with the following technologies:\n<ul>\n<li>Java (3+ years). Versions 1.6 and beyond are a good start!</li><li>Spring or similar MVC framework.</li><li>Unix/Linux and one of the many shells</li></ul>\n\n<ul>\n<li>Service oriented designs and technologies.</li><li>Web service technologies such as SOAP and REST</li><li>SQL and NoSQL</li><li>Version control such as Git and code review type tools such as Stash.</li><li>Continuous Integration/Delivery toolkits such as Jenkins/Puppet.</li><li>Queuing technologies, JMS, ActiveMQ, RabbitMQ.</li></ul>\n\n<ul>\n<li>Spark, Cloudera, HDFS, Kafka, Hive, Impala. (Not necessarily Hadoop- MapR)</li><li>AWS (S3, SQS, SNS, EC2)</li><li>Cassandra and/or MongoDB</li><li>Experienced in identifying opportunities to add monitoring and alerting where necessary</li><li>Troubleshoot and provide solutions to issues arising in production</li><li>Exceptional analytical skills.</li><li>Excellent written and verbal communication skills with the ability to interface with internal/external people at all levels.</li><li>Exceptional interpersonal skills and demeanor.</li><li>Proficient in the use of MS Office applications, such as Outlook, Word, PowerPoint and Excel</li>\n</ul>\n<strong>You are good at:</strong>\n<br><br>\nAdded value proficiencies in the following technologies:\n<ul>\n<li>HTML, CSS and JavaScript (jQuery), AngularJS a plus.</li><li>Familiar with continuous integration tools such as Jenkins, Sonar, Stash.</li><li>NoSQL</li><li>AppDynamics, ELK, Grafana</li>\n</ul>\n<strong>Your education and experience:</strong>\n<ul>\n<li>Bachelor’s Degree in Computer Science, or related field, from a four-year college or university, or one to two years related experience and/or training; or equivalent combination of education and experience. Relevant industry certification, such as Oracle Java Developer, is preferred.</li> <li>A minimum of 3 years relevant experience in software development, information systems, or equivalent technical environment, including previous experience in the development of highly transactional, mission critical applications in heterogeneous environments/architectures for multi-user systems.</li></ul>\n\n<ul>\n<li>Experience in all aspects of the software development lifecycle: design, functional and technical requirements, coding, debugging, testing, release, and operational support.</li> <li>Knowledge of agile software development methodologies, Service Oriented Architecture and object-oriented programming methodologies.</li><li>Proficient in software development best practices, including coding standards, code reviews, source control management, build processes, testing, and operations.</li><li>Expert level knowledge of relational and non-relational database management system technologies and tools.</li><li>Good experience in reviewing code and providing critical feedback for building secure, stable and scalable applications</li></ul>\n\n<ul>\n<li>We are interested in every qualified candidate who is eligible to work in the United States. However, we are not able to sponsor visas.</li>\n</ul>\nMust be able to uphold Choice's Values &amp; Performance Principles of accountability, collaboration, performance excellence, sense of urgency, innovation, inclusion &amp; diversity, integrity &amp; trust, customer focus, and respect."}