{"job title": "Linux Data Center Engineer", "company": "Eliassen Group", "city state": "– Austin, TX", "rating": "4.6", "job description": "Our innovative client in the Austin area is seeking a Linux Data Center Engineer to join their dedicated team.<br><br><em>This is an exciting full-time, permanent hire position!</em>\n<br><br>\n<strong>Responsibilities of the Linux Data Center Engineer:</strong>\n<ul>\n <li>Assist in the management of several thousand VM servers in an Active Directory environment; ensure AD environment is highly available</li>  <li>Contribute to the configuration, layout, and performance tuning of the production infrastructure</li> <li>Work with application engineers to develop Disaster Recovery application architecture</li> <li>Support upgrade and go-live activities related to new customer onboarding projects</li> <li>Attend and actively participate in weekly meetings</li> <li>Participate in collaborative projects with predetermined timelines</li>  <li>Remediate vulnerabilities identified through internal audits utilizing provided tools</li> <li>Create and update existing documentation of processes and procedures in support of administration tasks</li> <li>Participate in rotating 24x7 on call support coverage for data center related issues</li> <li>Ensure that all activities are performed in accordance with security, availability, confidentiality and privacy policies and controls</li> \n</ul>\n<strong>Requirements of the Linux Data Center Engineer:</strong>\n<ul>\n <li>Bachelors degree in Computer Science or equivalent work experience</li> <li>At least 4 years of directly relevant experience</li> <li>Ability to use professional concepts to solve a variety of problems</li> <li>Ability to work on problems of diverse scope</li>  <li>Ability to exercise sound judgment within defined procedures to determine appropriate course of action</li> <li>Strong organizational and multitasking skills</li> <li>Ability to thrive in a fast-paced, dynamic work environment</li> <li> Solid knowledge and troubleshooting of Windows Server 2008/2012</li> <li>Significant knowledge and troubleshooting of Linux operating systems, particularly Red Hat or CentOS</li> <li>Advanced knowledge and troubleshooting of Microsoft Active Directory and Group Policy</li> <li>Advanced knowledge of Microsoft Internet Information Services and/or NGINX websites</li>\n</ul>\nKeywords: Data Center Engineer, Linux, Active Directory, AD, Windows Server, Linux Red Hat, Linux CentOS, Group Policy\n<br><br>\nJob ID: 308640\n<br><br>\n<strong>About Eliassen Group:</strong>\n<br><br>\nEliassen Group provides strategic talent solutions to drive our clients innovation and business results. Leveraging nearly 30 years of success, our expertise in IT staffing, Agile consulting, creative services, managed services, and life sciences enables us to partner with our clients to execute their business strategy and scale effectively. Headquartered in Reading, MA and with offices from coast to coast, Eliassen Group offers local community presence, deep networks, as well as national reach. For more information, visit http://www.eliassen.com.\n<br><br>\nEliassen Group is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.\n<br><br>\nDont miss out on our referral program! If we hire a candidate that you refer us to then you can be eligible for a <strong><em>$1,000 referral check!</em></strong>"}