{"job title": "Senior Backend Engineer", "company": "Entelo", "city state": "– San Francisco, CA", "rating": "4.8", "job description": "Entelo uses huge amounts of data, AI, and application engineering to help companies build great teams. Our ~30-person engineering team uses technologies like Ruby, Python, JavaScript, Go, React, Kubernetes, Docker, Kafka, Spark, and Redshift, and we have customers like Facebook, Netflix, Slack, and Paypal. We ingest and parse up to 2 TB of social profile data per day, predict when people will change jobs, match people to jobs, and more.\n<br><br>\nTo learn more about us and our work, check out SourceCode. In 2017, we were thrilled to be named one of Glassdoor's Best Places to Work!<br><br>What you'll be doing:\n\n\n<ul>\n<li>Solve difficult technical challenges together with your team, like pulling services out of a monolith</li>\n<li>Enable our customers to take advantage of NLP, ML and our proprietary data models</li>\n<li>Plan, scope, build, and deploy distributed systems</li>\n<li>Generate results that impact all of Entelo's products and customers</li>\n<li>Propose and implement architecture changes that allow us to scale data operations 10-100x</li> \n\n<li>Help the team leverage and extract value from our huge, untapped datastores</li>\n<li>Mentor those around you</li>\n<li>Learn from some of the smartest people in the industry</li>\n</ul>\n\n<strong>About you:\n<br><br>\n</strong>\n\n\n<ul>\n<li>You have 5+ years of significant software engineering experience</li>\n<li>You have a passion for growing your skills and helping those around you grow theirs</li>\n<li>You measure success by the success of your team and the happiness of your customers</li>\n<li>You believe that a diverse workplace makes a company stronger</li>\n<li>You have strong alignment with our existing technologies (e.g. Ruby, Python, Go, Kubernetes, Kafka, Spark, Postgres, Elasticsearch, Redshift, and more) or willingness to learn</li>\n</ul>\nAt Entelo, perks mean so much more than free lunches and unlimited PTO (although we provide both!). We're committed to helping Entelopes grow; we offer opportunities for professional development and a generous learning and development stipend. Entelo is also committed to the community; we partner with impactful nonprofits, volunteer regularly, and provide a charitable match. We perform at a high level while respecting our teammates lives outside of work.\n<br><br>\nWe celebrate diversity and welcome all qualified applicants regardless of race, religion, sex, age, national origin, sexual orientation, disability, veteran status, genetic information or criminal history. We've taken the White House Equal Pay Pledge and are committed to maintaining a welcoming and equitable environment."}