{"job title": "Lead Data Scientist", "company": "Fanatics", "city state": "– San Mateo, CA", "rating": "3.5", "job description": "<div><div><div><strong>\n<br>\nLead Data Scientist</strong><br>\n\n<div>\n<div>\nLocation(s)\n<br><br>\n<strong>\n<br>\nSan Mateo, CA</strong>\n</div><br>\n\n<div>\nJob Code\n<br><br>\n<strong>3485</strong>\n</div><br>\n\n<div>\n# of openings\n<br><br>\n<strong>1</strong>\n</div>\n</div>\n</div>\n\n<br>Apply Now</div>\n\n<br><strong><u>Job description</u></strong>\n<br><br>\nWe are looking for someone who is passionate about leading a team of data scientists to apply machine learning and statistics techniques to solve business problems. You will collaborate closely with engineering teams, PMs, cross functional business units and address a wide range of challenging problems using techniques from applied statistics, machine learning and/or data mining fields. Key problem areas include the following:\n\n<ul>\n\n<li>Product Recommendation and Personalization : providing personalized product recommendations and user experience for sports fans in e-commerce sites as well as on emails.</li>\n\n\n\n<li>Inventory optimization : forecasting demand and optimizing the quantity and location of inventory.</li>\n\n\n\n<li>Product Search and Ranking : developing ranking schemes for products in online search and site landing pages to optimize site experience.</li>\n\n\n\n<li>Pricing and promotions : models and algorithms for relevant pricing and promotions for products and customers over time.</li>\n\n\n\n</ul>\nResponsibilities\n\n<ul>\n\n<li>Recruit new talent, grow, motivate and mentor a team of data scientist</li>\n\n\n\n<li>Define the research vision for data science, and oversee planning, resources, and prioritization to make sure the team is advancing that roadmap. Deliver on concrete work that advances that roadmap.</li>\n\n\n\n<li>Help develop and test predictive algorithms to be implemented as part of internal tools and customer facing applications such as product search, personalization, CRM</li>\n\n\n\n<li>Build solutions all the way from research to delivery on a large scale production system, collaborating along the way with other data engineering and product teams.</li>\n\n\n\n</ul>\nQualifications\n\n<ul>\n\n<li>Professional experience as a data science leader, setting the vision for how to most effectively use data in organization, either through technical leadership as an IC with ownership over a research agenda, or developing a team as a personnel manager in a new area</li>\n\n\n\n<li>Expert-level experience with a wide range of quantitative methods that can be applied to business problems, including personalization, product search, product recommendations, fraud, inventory forecasting</li>\n\n\n\n<li>Strong algorithmic thinking and passion for empirical research to answer hard questions</li>\n\n\n\n<li>Excellent written and verbal communication skills on quantitative topics for a variety of audiences with ability to communicate complex quantitative analysis, analytic approaches and findings in a clear, precise, and actionable manner.</li>\n\n\n\n<li>Expertise in designing and evaluating A/B experiments for new algorithms and monitoring key performance metrics, share the results with a wide audience</li>\n\n\n\n<li>Overall 10+ years of industry experience in data science and machine learning with few years of experience leading and managing data science projects and teams,</li>\n\n\n\n<li>Bachelor’s or Master’s degree is required ( PhD preferred) in relevant fields such as Statistics, Machine Learning, Computer Science with Artificial Intelligence focus is preferred</li>\n\n\n\n</ul>\n\n</div>\n<br>"}