{"job title": "Software Engineer", "company": "Horizontal Integration", "city state": "– Richfield, MN", "rating": "4.3", "job description": "<div>\n<div>\nDescription<br><br><strong>*Upon offer, candidates must complete a background and drug test*</strong>\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n\n\t<li>Main responsibility will be coding</li>\n</ul>\n<strong>Typical day in this role:</strong>\n\n<ul>\n\n\t<li>Code, test, and support deployments and automation as needed</li> \n\n<li>Agile team</li>\n<li>Pair programming-100% of their coding time</li> \n\n<li>TDD</li>\n</ul>\n<strong>How is performance measured in this role?</strong>\n\n<ul>\n\n\t<li>Efficiency and effectiveness supporting the team in their tasks</li> \n</ul>\n<strong>Required Qualifications:</strong>\n\n<ul>\n\n\t<li>Experience with service development, REST, HTTP, Groovy, Java, Spring, NoSQL, XML, JSON.</li>\n<li>1 year + experience with TDD (have used with at least 1 project), Agile, Pair Programming.</li>\n<li>Interest in pair programming</li> \n\n<li>Aggressive Refactoring.</li>\n<li>At least five years of relevant systems software engineering experience and a BS/MS in computer science or engineering (or equivalent professional experience).</li>\n<li>Experience building high-performance, highly-available and scalable distributed systems.</li>\n<li>Experience building complex software systems that have been successfully delivered to customers.</li>\n<li>Knowledge of and working experience with open source software (e.g. Apache, Tomcat, Memcache, etc.).</li>\n<li>Experience working with Linux.</li>\n<li>The ability to prioritize effectively, communicate clearly, and consistently deliver results.</li>\n<li>Keen attention to detail and high level of commitment.</li>\n</ul>\n<strong>Preferred Qualifications:</strong>\n\n<ul>\n\n\t<li>Any level of experience with NoSQL data stores (Riak, Cassandra, etc.) is a plus.</li>\n<li>Experience with RabbitMq, IBM MQ, Docker.</li>\n<li>Ability and aptitude to dig into and solve challenging problems and proactively avoid problems.</li>\n<li>Scripting, automation and troubleshooting of processes and systems; scripting in the shell and at least one of the following: Groovy, Ruby, Perl or Python.</li>\n<li>Networks, security, firewalls, load balancers, DNS and other infrastructure components.</li>\n</ul>\n<strong>Required Soft Skills:</strong>\n\n<ul>\n\n\t<li>You are enthusiastic and excited about technology.</li> \n\n<li>You are flexible, dependable and know how to have fun while getting a lot done.</li>\n<li>You are open and honest and willing to share and accept feedback and ideas.</li>\n<li>You are positive and optimistic. Setbacks and constraints motivate you to work harder.</li>\n<li>You aren't afraid to roll up your sleeves and get your hands dirty with the rest of the team.</li>\n<li>You are pretty darn good at what you do (but don't let it go to your head).</li>\n<li>You listen with your ears and are open to changing your mind (stubborn on vision, but flexible on details).</li>\n<li>You strive to constantly improve yourself and your team.</li>\n</ul>\n#KRT\n<br><br>\n<em>Horizontal Integration is proud to be an Equal Opportunity and Affirmative Action Employer. We seek to provide employment opportunities to talented, qualified candidates regardless of race, color, sex/gender including gender identity and/or expression, national origin, religion, sexual orientation, disability, marital status, citizen status, veteran status, or any other protected classification under federal, state or local law.</em>\n<br><br>\n<em>\n<br>\nIn addition, Horizontal Integration will provide reasonable accommodations for qualified individuals with disabilities. If you need to request a reasonable accommodation in order to complete the application or interview process, please contact hr@horizontalintegration.com.</em>\n<br><br>\n<em>\n<br>\nAll applicants applying must be legally authorized to work in the country of employment.</em></div>\n</div>\n<br>"}