{"job title": "Data Engineer", "company": "J.P. Morgan", "city state": "– Lewisville, TX", "rating": "3.8", "job description": "<div><strong><br>\n<div>Innovators Wanted!!! As a Software Engineer, your mission is to innovate towards creating next-level solutions that improve the way our business is run. Your deep knowledge of design, development, and quality engineering will help your team raise their game, meeting new standards, as well as satisfying both business and functional requirements. Your expertise in various technology domains will be counted on to set strategic direction and solve complex and mission critical problems. Your quest to embracing leading-edge technologies and methodologies inspires your team to follow suit. And best of all, youll be able to harness massive amounts of brainpower through our global network of technologists from around the world.</div>\n<br>\n<div>This is a great opportunity to rebuild one of Chases most successful payment platforms from the ground up using innovative technologies and solutions. Come and join our evolving team for delivering an industry disrupting solutions for our customers.</div></strong></div><strong>\n<br>\n<div><strong>Qualifications</strong></div>\n<br>\n<div>· 5+ years experience with full development lifecycle from inception through implementation</div>\n<br>\n<div>· 2+ years experience with building large scale big data applications</div>\n<br>\n<div>· Experience building Data Lake using Cloudera or Hortonworks distributions</div>\n<br>\n<div>· Hands-on experience in HDFS, MapReduce, Yarn &amp; Hive</div>\n<br>\n<div>· Extensive experience in Spark leveraging Python, Scala or R.</div>\n<br>\n<div>· In depth knowledge of Java 8</div>\n<br>\n<div>· Experience working on 1 or more NoSQL Databases such as Cassandra, HBase, MongoDB, DynamoDB, Elastic Search</div>\n<br>\n<div>· Hands on experience with building CI/CD</div> \n<br>\n<div>· Experience with private cloud PCF</div>\n<br>\n<div>· Experience in developing software solutions leveraging Test Driven Development (TDD)</div>\n<br>\n<div>· Expertise in Data governance and Data Quality</div>\n<br>\n<div>· Experience working with PCI Data is a plus</div>\n<br>\n<div>· Experience working with Data Scientists</div> \n<br>\n<div>· In depth knowledge of OO and SOLID design principles</div>\n<br>\n<div>· Demonstrable experience of successfully delivering big data projects using Kafka, Spark, Cassandra and related stack on premise or cloud</div>\n<br>\n<div>· Able to tune big data solutions to improve performance</div>\n<br>\n<div>· Excellent understand of Spring framework</div>\n<br>\n<div>· Experience with Oracle databases</div></strong>"}