{"job title": "Systems Engineer/RF Communication/Annapolis, MD", "company": "Lockheed Martin", "city state": "– Hanover, Maryland", "rating": "3.6", "job description": "<strong>Description:</strong> At the dawn of a new space age, Lockheed Martin is a pioneer, partner, innovator and builder. Our amazing men and women are on a mission to make a difference in the world and every day we use our unique skills and experiences to create, design and build solutions to some of the worlds hardest engineering problems. Our culture encourages employees to dream big, perform with excellence and create incredible products. We provide the resources, inspiration and focus and if you have the passion and courage to dream big, we want to build a better tomorrow with you.\n\n\n<ul>\n<li>Work location for this position is south of Annapolis MD area.</li>\n<li>Continuous rotating Shift Hardware Engineering &amp; Maintenance Team position supporting operations and maintenance for large scale RF Communications system operating in real time 24x7 environment.</li>\n<li>Primary responsibility will be to provide operations and maintenance shift support for a large, integrated, complex hardware-software communications system.</li>\n<li>Responsibilities include preventative and corrective maintenance support across multiple external interfaces over a robust multi-tiered network.</li>\n<li>Direct interaction with ops customer and mission partners is required to provide technical assessment and operational work around recommendations.</li>\n<li>Daily activities may include, but are not limited to, discrepancy report work off and resolution, O&amp;M training/mentoring, trending, procedure development, data collection, fault isolation, and performing real-time manual actions to restore system capabilities.</li>\n<li>Assistance in development of troubleshooting/recovery plans and execution of associated management and customer briefs may also be required.</li>\n<li>Participation in corrective maintenance will require remove/replace, repair, and testing failed hardware.</li>\n<li>The Systems Engineer will work closely with delivering factories to provide support to development activities, installation efforts, and special test configurations.</li>\n<li>The Systems Engineer should have a solid working knowledge of varied test equipment such as oscilloscopes, spectrum/link/network analyzers, power meters and signal generation equipment.</li>\n<li>Performance of maintenance activities will include climbing multiple sets of stairs, lifting/carrying up to 50lbs, and working in non-environment-controlled work spaces.</li>\n<li>Strict adherence to all applicable administrative, safety and security policies is required.</li>\n</ul>\n\nApplicant selected will be subject to a government security investigation and must meet eligibility requirements for access to classified information.\n<br><br>\n<strong>Typically has 5 - 10 years</strong>\n<br><br>\nTo promote the sharing of ideas, Lockheed Martin fosters an inclusive work environment that encourages differences and big-picture thinking.\n<br><br>\nOur employees play an active role in strengthening the quality of life where we live and work by volunteering more than 850,000 hours annually. Here are some of the benefits you can enjoy:\n\n\n<ul>\n<li>Medical</li>\n<li>Dental</li>\n<li>401k</li>\n<li>Paid time off</li>\n<li>Work/life balance</li>\n<li>Career development</li>\n<li>Mentorship opportunities</li>\n<li>Rewards &amp; recognition</li>\n</ul>\n\nLearn more about Lockheed Martins competitive and comprehensive benefits package.\n<br>\n<strong>Desired Skills:</strong> - Leadership experience on small maintenance teams.\n\n\n<ul>\n<li>Information Technology experience with an IAT level 1 certification</li>\n<li>Knowledge and experience with facility support systems for RF ground terminal systems (power, HVAC, etc.)</li>\n<li>Prior military electronics and/or satellite communications training/experience</li>\n<li>Bachelors degree 2 years of relevant,professional experience. Equivalent experience/combined education may also be considered (10 years of experience with no college degree).</li>\n<li>Minimum of 2 years technical experience with RF communication antennas and associated transmit and receive hardware systems. On the job training (OJT) will be provided to the selected candidate specific to our current unique subsystems and antennas.</li>\n<li>Minimum of 1 year experience with COTs-based high speed networks, IT systems, and real-time software applications supporting communications systems.</li>\n</ul>\n\n<strong>BASIC QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>Current TS/SCI clearance</li>\n<li>Must possess a valid Tier 1 IAWEP industry certification prior to start</li>\n<li>Strong oral and written communication skills</li>\n<li>Must be available to work 1st, 2nd and 3rd shifts through a weekly rotation that includes two weekends a month to support 24x7 staffing requirements.</li>\n<li>Must be able to climb multiple sets of stairs, lift/carry up to 50lbs, and work in non-environment-controlled work spaces</li>\n<li>Knowledge of or ability to understand RF communications antennas</li>\n<li>Knowledge of or ability to understand networks, IT systems, and real-time software applications supporting communications systems.</li>\n</ul>\n\n<strong>Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, or disability status.</strong>\n<br>\nAs a leading technology innovation company, Lockheed Martins team of 113,000 people works with partners around the world to bring proven performance to our customers toughest challenges. Headquartered in Bethesda, Maryland, Lockheed Martin has employees based in all 50 states and more than 570 facilities that span 70 countries.\n<br><br>\nJoin us at Lockheed Martin, where were engineering a better tomorrow."}