{"job title": "Senior Software Engineer", "company": "PowerSchool", "city state": "– Chico, CA, US", "rating": "3.6", "job description": "This position, under the general direction of the Lead and/or Manager, Software Engineering, will be responsible for technical and development support for our award-winning K-12 software. This role will implement, code, build, and test new features, maintain existing features, and develop reports that will include components, data models, customization and reporting features for our products. Additionally, this position will gather and refine requirements, develop designs, implement, test and document solutions to produce the highest quality product and customer satisfaction.\n<br><br>\n<strong>Duties and Responsibilities</strong>\n<br>\n<strong>Essential duties and responsibilities</strong> include the following. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\n<ul>\n<li>Work as part of an Agile SCRUM team in the planning, scoping, estimation and execution of technical solutions</li>\n<li>Develop scalable web applications and services</li>\n<li>Investigate and resolve issues reported for a large web application following best practices such as authoring or updating unit tests, writing maintainable code, applying established patterns and algorithms</li>\n<li>Analyze performance and develop improvements to performance of web application</li>\n<li>Assist with security updates to web application</li>\n<li>Perform upgrades to 3rd party libraries and tools used by the web application</li>\n<li>Implement new web application software features and products following best practices such as authoring of unit tests, writing maintainable code, applying established patterns and algorithms</li>\n<li>Specialize in client or server side web application development as a member of a project team</li>\n<li>Familiarity with the full technical stack</li>\n<li>Develop software to support internal initiatives, tools, update framework and application functionality</li>\n<li>Work within a wide range of new and legacy code and technologies in a mature codebase</li>\n<li>Train and mentor new and more junior software engineers</li>\n\n<strong><li>Other duties as assigned<br><br><strong>Qualifications include:</strong></li><strong>\n\n</strong>\n\n<li>6+ years’ experience in software engineer role</li>\n<li>Bachelor’s degree in Computer Science or Information Technologies required or equivalent experience</li>\n<li>Knowledge of current web client technologies including demonstrable proficiency with HTML, CSS, JavaScript, jQuery, client MVC</li>\n<li>Knowledge of Java, Spring (IoC), Hibernate, JPA, JAX-RS and/or .net</li>\n<li>Proficient in SQL, Oracle experience a plus</li>\n<li>Familiar with OWASP threats and mitigation techniques</li>\n<li>Ability to architect, test, develop, implement and troubleshoot multi-layer web applications</li>\n<li>Strong written and verbal communication skills</li>\n<li>Strong ability to work with current software design principles and concepts such as patterns, algorithms, data structures, dependency injection, MV**, SOA, n-tier architecture</li>\n<li>Strong ability to handle a heavy workload with multiple projects and frequent interruptions</li>\n<li>Strong ability to work in a changing, dynamic environment</li>\n</strong></ul>"}