{"job title": "Software Engineer - GEOINT", "company": "Stratagem Group", "city state": "– Aurora, CO", "rating": "4.0", "job description": "<div> Are you interested in supporting the ever-changing technology needs of the U.S. Government by providing services that support defense initiatives? Come look at <strong>Stratagem,</strong> where we help the U.S. Government solve some of the most difficult and fun problems in the world.\n<br><br>\n<strong>Stratagem</strong> is hiring motivated, creative, and technically-minded individuals with a passion and skill for building the state-of-the-art in emerging technologies. We understand that candidates may not be able to check the boxes for all desired qualifications, but what is most important to us at Stratagem is that candidates have exceptional problem solving skills, creative out-of-the-box thinking, and comfort with quickly learning, evaluating, and deploying new technologies. Successful employees are self-starters, excellent communicators and positive individuals with a passion for delivering uncompromising quality products.\n<br><br>\n<strong>** TS / SSBI Required **</strong>\n<br><br>\nThis is a software engineer position in Aurora,CO, and we are not hiring your average Java Joe’s. We’re looking for the Americano with a double pump. You will be given substantial feature ownership, and we'll expect you to contribute product ideas as well as occasional code. Your ideas will help shape the future of <strong>Stratagem</strong>.\n<br><br>\n<strong><u>Responsibilities &amp; Skills</u></strong>\n<br>\nOur ideal candidate is a software engineer with a love for learning, the ability to pivot directions quickly, and someone with a conceptual understanding of machine learning concepts, tools, and techniques.\n<br>\nAs a software engineer, your responsibilities include:\n\n\n<ul>\n\n\t<li>Integrating with a diverse team to deliver in an agile-like manner</li>\n<li>Implementing new algorithms</li>\n<li>Designing and building aspects of a web-accessible system</li>\n<li>Prototyping ideas/concepts to prove a solution quickly</li>\n</ul>\n\n<strong>Your core skills/experience include:</strong>\n\n\n<ul>\n\n\t<li>Expertise in one of the following: Java, Python, C++, etc.</li>\n<li>Familiarity with containerization - Docker preferred</li>\n<li>Proficiency with cloud Infrastructure - AWS or C2S preferred</li>\n<li>Proficiency with PostgreSQL – or similar GIS database concepts</li>\n<li>Experience with Linux</li>\n<li>Experience building a scalable, web-based application</li>\n<li>Minimum of 6 years’ experience or 4 with Master’s degree</li>\n<li>You are the proud owner of a TS/SCI SSBI clearance</li>\n</ul>\n\nBonus points if you have experience in any of the following:\n\n\n<ul>\n\n\t<li>Experience in OPIR area</li>\n<li>Security+ Certification</li>\n<li>DevOps</li></ul>\n\n\n<ul>\n\n\t<li>Machine Learning, data science or artificial intelligence</li>\n<li>Front-end development</li>\n</ul>\n\n<strong>About you</strong>\n<br>\nYou are an exceptional problem solver, a quick learner, and a creative out-of-the-box thinker who values team work. You are comfortable with the pace and ever changing requirements of a small development company while maintaining a healthy work life balance.\n<br><br>\n<strong>Who is Stratagem</strong>\n<br>\nStratagem is a small and fast-growing technology company built around the idea that we can make a lasting impact for our customers and employees. We believe in a culture of innovation, fun, empowerment, and family. We want you to learn new skills so you can become more fulfilled in both your personal and professional life.\n<br>\nAt Stratagem, our goal is to make our company the last company you work for!</div>\n\n<br>"}