{"job title": "Senior Network Engineer", "company": "Stratasys", "city state": "– Eden Prairie, Minnesota", "rating": "2.7", "job description": "<p>We at Stratasys are passionate believers in the value and power of 3D printing, and in the change it can bring to design, innovation and manufacturing.</p><p>&nbsp;</p><p>The solutions we create are used by over 20,000 enterprises worldwide, and are rapidly changing the way products are imagined, designed, marketed, produced, supplied and sold. We are literally shaping the world that surrounds us – from the products and services in our lives and homes, to our health and quality of life, our transport, security and economies, to how we teach, research and even learn.</p><p>&nbsp;</p><p>The Senior Network Engineer is responsible for developing and deploying \"outstanding\" architectures, which aligns the foundational technology components of LAN, WAN, Security, VoIP, and Collaboration to enable strategic business initiatives, support stable operations and provide reasonable security controls. Will be a member of the Global Network team, which is responsible for the deployment and operation of LAN, WAN, Security, VoIP, and Collaboration for Stratasys globally. </p><p>You will play a significant role in the engineering and management of multiprotocol routers, multilayer switches, network security devices, network management systems, network operating systems, and Cisco VoIP.</p><p>&nbsp;</p><p><strong>Location:</strong> Eden Prairie, MN</p><p>&nbsp;</p><ul><li>Define and maintain solution architectures for network components including but not limited to WAN, LAN, Security, Remote Access, and Wireless based on business requirements.</li><li>Participate with team to design, configure, deploy, analyze, and upgrade network, network subsystems, and VoIP solutions.&nbsp;</li><li>Develop 18 month to 3-year technology road maps aligned to business requirements which will drive investment decisions in Stratasys’s global network.</li><li>Lead network, voice, and collaboration integrations design, planning, and execution for M&amp;A integrations.&nbsp;</li><li>Provide level 2/3 troubleshooting expertise for network problems including software protocol issues, performance analysis, WAN/LAN failures and equipment malfunctions. Operate network requiring 24/7 availability.</li><li>Utilize network tools to diagnose faults and to analyze performance. Monitor, create and analyze real-time and statistical reports (eg. security, usage, performance) for networks.</li><li>Develop, execute, and coordinate complex testing activities for implementation, maintenance, and project assignments. </li></ul><p>&nbsp;</p><p><strong>MINIMUM QUALIFICATIONS:</strong></p><ul><li>BS/BA degree or equivalent work experience.</li><li>Minimum of 4 to 8 years of enterprise level network support, design, and architecture experience required.</li><li>Ability to design and troubleshoot enterprise network architectures that include switching, routing, MPLS, EIGRP, OSPF, BGP, LAN/WAN/WLAN, TCP/IP v4 and v6, Cisco IOS QoS features, and Cisco VoIP.</li><li>Must have experience and expertise in a minimum of 4 of the following areas: Routing, Cisco IOS, Cisco VoIP (Unified Contact Center, Agent Desktop, Unified Comm. Manager, Emergency Responder, Unity), Network Optimization, Remote Access, Enterprise DHCP/DNS, Remote Access, Network Security (NAC, Proxy, Firewalls), LAN, Multi-Vendor MPLS interoperability, Global Proxy management, or Data Center LAN management.</li><li>Experience in developing appropriate security controls, and with Intrusion Prevention Systems (IPS). Experience in firewalls (stateful packet inspection, configuration hardening, host based firewalls). Experience in designing or implementing high availability solutions (dynamic load distribution, redundant connections, dynamic routing protocols, etc...).</li><li>Working knowledge of ITL processes, specifically Incident Management, Change Management, Problem Management</li></ul><p>&nbsp;</p><p><strong>PREFERRED QUALIFICATIONS:</strong></p><ul><li>Preferred experience with Cisco and Cloud based firewalls.</li></ul><p>&nbsp;</p><p>&nbsp;</p><p>Stratasys Ltd.&nbsp;(Nasdaq: SSYS), headquartered in Minneapolis, Minnesota and Rehovot, Israel, is a leading global provider of 3D printing and additive manufacturing solutions. The company's patented FDM® and PolyJet™ 3D Printing technologies produce prototypes and manufactured goods directly from CAD data for the aerospace, automotive, health care, consumer goods and education industries. Stratasys subsidiaries include MakerBot and GrabCAD, and the company operates the digital parts manufacturing service, Stratasys Direct. Stratasys has nearly 3,000 employees, holds over 1,200 granted or pending additive manufacturing patents globally, and has received more than 30 awards for its technology and leadership.</p><p>&nbsp;</p><p><em>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. Stratasys will provide reasonable accommodations for qualified individuals with disabilities.&nbsp;In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification form upon hire. All offers of employment with Stratasys, Inc are contingent upon the successful passing of a background check.</em></p><p>&nbsp;</p><p><em>Stratasys, Inc. is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to their protected Veteran or disabled status and will not be discriminated against for their race, color, religion, sex, age, disability, military status, or national origin or any other characteristic protected under federal, state, or applicable local law. Please view Equal Employment Opportunity Posters provided by OFCCP&nbsp;</em><em>here</em><em>.</em></p>"}