{"job title": "Quality Assurance - Automation Engineer", "company": "Uline", "city state": "– Pleasant Prairie, Wisconsin", "rating": "3.8", "job description": "<div><strong>Wisconsin</strong>\n<br>\n<strong>12575 Uline Dr. Pleasant Prairie, WI 53158</strong>\n<br><br>\n<strong>Uline – Shipping Supply Specialists\n<br><br>\n\"The people I work with are as passionate as I am.\"\n<br>\n\"I came to Uline for a job. Instead, I found a career.\"</strong></div>\n\n<br>Uline is North America's leading distributor of shipping, packaging and industrial supplies. We're a family-owned company known for our incredible customer service and quality products. Our people make the difference.\n<br><br>\nWe're looking for the best and brightest to take our IT department to the next level. If you have passion and expertise in IT quality assurance practices, Uline is the company for you.\n<br><br>\n<strong>Find out how the Uline IT Department is building the future by watching our video.</strong><div>\n<strong>Quality Assurance - Automation Engineer</strong></div>\n<br>\nUline seeks a Quality Assurance - Automation Engineer at its Corporate Headquarters in Pleasant Prairie, WI.\n<br><br>\n<strong>POSITION RESPONSIBILITIES</strong><br>\n\n<div><strong>Test Automation:</strong></div><ul><li>Design, develop and implement automated testing and tooling solutions with a focus on project and application-based automated functional and regression testing.</li><li>Enhance, extend and maintain test automation libraries and frameworks.</li><li>Create, maintain and expand our master regression test bed.</li><li>Define and promote test automation best practices, standards and processes.</li><li>Collaborate with project managers, solution analysts, the Quality Assurance team and developers on project and application-level test automation. Help identifying candidates for inclusion in test automation.</li><li>Coordinate and manage automated testing efforts for concurrent projects.</li><li>Create and maintain data sets to be used in test automation activities.</li><li>Document, evaluate and disseminate test results; collaborate in troubleshooting issues.</li><li>Provide test automation estimates and timelines for assigned projects.</li><li>Participate in continuous integration, release and build management.</li><li>Establish and manage requirement traceability through test plans and cases.</li><li>Communicate and report on status of test automation activities.</li>\n</ul>\n\n<div><strong>QA Practices:</strong></div><ul><li>Align with and contribute to established QA practices for Uline's IT Project Services teams.</li><li>Participate in executing QA roadmaps and strategies.</li><li>Collaborate with QA manager and team to develop, implement and improve innovative QA capabilities, approaches and services.</li><li>Guide and coach teams to adopt and implement applicable testing best practices and expectations.</li><li>Contribute to the awareness of the test automation function throughout IT and the business, communicating applicable testing practices and expectations.</li>\n</ul>\n\n<strong>MINIMUM REQUIREMENTS</strong>\n\n<ul>\n<li>Bachelor's degree in computer science or related technical discipline.</li><li>3+ years experience in test automation development in an SDET (software development engineer in test) role.\n<br>\nJavaScript, C#, JScript and VBScript experience.</li><li>Scripting experience with SmartBear TestComplete or other GUI test automation tools <strong>a plus.</strong></li><li>Experience with source control tools such as GIT, TFS and SVN.</li><li>Foundational understanding of SQL and databases.</li><li>Experience in agile and waterfall methodologies.</li><li>Knowledge of QA processes, practices and systems.</li><li>Ability to manage concurrent projects, activities and tasks under time constraints.</li><li>Experience with Visual Studio Team Foundation Server (TFS) test management tools, Visual Studio Test Professional and / or Microsoft Test Manager <strong>a plus.</strong></li><li>Development background <strong>a plus.</strong></li><li>Experience with automated unit testing <strong>a plus.</strong></li><li>Experience with API testing and tools such as SoapUI and Postman <strong>a plus.</strong></li><li>Experience testing Angular web applications <strong>a plus.</strong></li>\n</ul>\n\n<strong>BENEFITS</strong>\n\n<ul>\n<li>Complete insurance coverage – medical, dental, vision, life.</li> <li>401(k) with company match.</li> <li>Generous paid time off.</li> <li>Tuition reimbursement.</li> <li>3 bonus programs.</li> \n</ul>\n\n<strong>OPEN HOUSE:</strong> <strong>Click here</strong><strong> for detailed information and directions.</strong> \n<br><br>\nEEO/AA Employer/Vet/Disabled\n<br>\nUline is a drug-free workplace\n<br><br>"}