{"job title": "Data Engineer", "company": "Vinsys Information Technology Inc", "city state": "– San jose, California", "rating": "3.9", "job description": "<strong>Position: Data Engineer</strong>\n<br><br>\n<strong>Location: San Jose, CA</strong>\n<br><br>\n<strong>JD: Requirements for Contact Center Business Intelligence Analyst</strong>\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n <li>Work closely with IT business partners and business analysts to understand their data needs and develop reporting solutions to meet those needs.</li> <li>Work with Engineering partners to help shape and drive the development of Client BI infrastructure including data warehousing, reporting and analytics solutions.</li> <li>Own and deliver multiple BI work streams for diverse internal clients, both on an ongoing and ad-hoc basis, providing interpretation, analysis, or insight along with clearly-stated information, representing interests of both team and leadership.</li> <li>Create dashboards, visualizations, and analyses that surface insights and drive key business decisions.</li> <li>Using internal Client tools, build new data pipelines from new sources, and maintain existing pipelines. Respond to and resolve pipeline failures.</li>  <li>Respond to questions from internal client teams, train new users on telephony data warehouse principles.</li>  <li>Maintain playbook, user guide and other data related documentation.</li> \n</ul>\n<strong>Minimum Qualifications:</strong>\n<ul>\n <li>BA/BS degree with quantitative focus or equivalent practical experience</li> <li>Minimum 5 years working with SQL, query optimization, working with large datasets and schemas, scripting, regular expression building.</li> <li>Minimum of 3 years of proven familiarity with data mining, analysis, and visualization; experience in manipulating and curating large, complex data from a variety of systems and creating visualizations that surface business insights.</li> <li>Distinctive problem-solving and analytical skills combined with superb communication skills; demonstrated ability to convey complex concepts and solutions to all levels of an organization.</li> \n</ul>\n<strong>Preferred Qualifications:</strong>\n<ul>\n <li>Data warehousing experience (e.g. storage methods/formats, database design, usage).</li> <li>Experience with Extraction Transformation Load (ETL) optimization and applying business logic to data</li> <li>Strong competency working in web-based tools including Client Sheets and Apps Script.</li>  <li>Genuine excitement and passion for developing and analyzing large, complex data sets and converting them into the information / insights that drive business decisions at all levels of the organization.</li> <li>Knowledge of CRM tools, customer support applications and call center processes and data is a plus.</li>  <li>Familiarity working in a UNIX environment and with version control systems.</li>\n</ul>"}