{"job title": "Associate Scientist", "company": "3 Key Consulting", "city state": "– Thousand Oaks, CA", "rating": "NA", "job description": "<strong>Job Title:</strong> Associate Scientist (JP4459)\n<br>\n<strong>Location:</strong> Thousand Oaks, CA\n<br>\n<strong>Employment Type:</strong> Contract\n<br>\n<strong>Business Unit:</strong>  LM Clinical Release Testing\n<br>\n<strong>Duration:</strong>  3 years\n<br><br>\n3Key Consulting Inc. is looking for an <strong>Associate Scientist</strong> with 3+ years experience in cell biology for a global, CA-based, bio-pharmaceutical company.\n<br><br>\n<strong><u>Job Description:</u></strong>\n<br>\nThis position is M-F, 8 hours per day, however has flexible schedule with occasional weekends and some holiday work as needed.Onsite. Position comprised of about 70% in a laboratory and 30% in an office setting.\n<br>\nOur ideal candidate will have a MS degree in field with 3+ years of experience in cell biology. Average candidate is BS in field with 5-6 years experience is cell biology. Must have lab cell assay experience, cell culture maintenance, reagents/media/buffer preparation and support of analytical testing. Will perform all cell maintenance, assist with cell-based assays, binding assays, ELISA and PCR.\n\n\n<ul>\n<li>Perform routine experiments in a phase-appropriate GMP setting</li>\n\n<li>Generate robust and reliable data, organize and report data in validated system under minimal supervision.</li>\n\n<li>Cell culture maintenance, reagents/media/buffer preparation and support of analytical testing.</li>\n\n<li>Will perform all cell maintenance, assist with cell-based assays, binding assays, ELISA and PCR. Routine laboratory maintenance such as restocking, ordering and assistance in critical reagent management.</li>\n</ul>\n\n<strong><u>Top Must-Have</u> </strong>\n\n\n<ul>\n<li>Cell culture experience.</li>\n\n<li>Self-motivated</li>\n\n<li>Ability to work under minimal supervision GMP experience</li>\n</ul>\n\n<strong><u>Basic Qualifications:</u></strong>\n\n\n<ul>\n<li>Familiarity with GMP laboratory and documentation practices.</li>\n\n<li>Ability to enter data into electronic notebook, perform data integrity checks, verification reviews and effective data communication to the team and into verified systems.</li>\n\n<li>Experience and ability to work in a matrixed, detail-oriented team environment.</li>\n\n<li>Self-motivated and able to work under minimal supervision.</li>\n\n<li>Great communication skills.</li>\n\n<li>Willingness to adhere to timelines and work in a highly regulated environment.</li>\n</ul>\n\n<strong><u>Day to Day Responsibilities</u></strong>:\n\n\n<ul>\n<li>Perform routine experiments in a phase-appropriate GMP setting, generate robust and reliable data, organize and report data in validated system under minimal supervision.</li>\n\n<li>Cell culture maintenance, reagents/media/buffer preparation and support of analytical testing.</li>\n\n<li>Will perform all cell maintenance, assist with cell based assays, binding assays, ELISA and PCR.</li>\n\n<li>Routine laboratory maintenance such as restocking, ordering and assistance in critical reagent management.</li>\n\n<li>Familiarity with GMP laboratory and documentation practices.</li>\n\n<li>Ability to enter data into electronic notebook, perform data integrity checks, verification reviews and effective data communication to the team and into verified systems.</li>\n</ul>\n\n<strong><u>Why This Position Is Open:</u></strong>\n<br>\nSupplement additional workload on team.\n<br><br>\n<strong><u>Employee Value Proposition:</u></strong>\n<br>\nGreat opportunity to be part of a motivated team on cell-based and non-cell based assays.\n<br><br>\n<strong><u>Red Flags:</u></strong>\n<br>\nNo cell culture experience no cell-based assay experience.\n<br><br>\n<strong><u>Interview process:</u> </strong>\n<br>\nPhone interview followed by in-person\n<br><br>\nWe invite qualified candidates to send your resume to resumes@3keyconsulting.com. If you decide that youre not interested in pursuing this particular position, please feel free to take a look at the other positions on our website www.3keyconsulting.com. You are also welcome to share this posting with anyone you think might be interested in applying for this role.\n<br>"}