{"job title": "Senior Applied Scientist", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "Are you passionate about building systems that process massive amounts of data? Are you excited by developing and productionizing machine learning, deep learning and computer vision algorithms? Do you enjoy working with a huge diversity of engineers, machine learning scientists, and user-experience designers? If so, you have found the right match!\n<br><br>\nThe vision for Amazon Fashion is to create services, processes, tools and platforms to support innovative and engaging fashion experiences. The Fashion Science team at Amazon aims to make Amazon the number one online shopping destination for Fashion. We are looking for scientists capable of using machine learning, data mining, computer vision, and natural language processing techniques on large-scale datasets to design, evangelize, and implement state-of-the-art solutions that directly impact millions of Amazon customers.\n<br><br>\nFashion is extremely fast-moving, visual, subjective, and it presents numerous unique challenges in areas such as product recommendations, product discovery and data quality. The Fashion Science team builds large-scale machine learning systems to address these. We leverage the massive computing power of Amazon Web Services as well as big data technologies such as Spark and Hadoop to build data pipelines for hundreds of millions of products. Our data is used by numerous front-end teams to deliver amazing experiences to customers all around the world.\n<br><br>\n<strong>Major Responsibilities:</strong>\n\n\n<ul>\n<li>Analyze and extract relevant information from large amounts of Amazon's product data</li>\n<li>Use machine learning, data mining, and computer vision techniques to generate powerful feature representations and create data driven models and solutions to improve discoverability and customer experience</li>\n<li>Work closely with software engineering teams to implement model solutions</li>\n<li>Work closely with stakeholders to optimize various business objectives</li>\n<li>Track general business activity and provide clear, compelling management reporting on a regular basis</li>\n<li>Research and implement novel machine learning and computer vision approaches</li>\n</ul>"}