{"job title": "Applied Scientist I", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "We are looking for a Applied Scientist to join the Devices Demand Planning team for the entire Amazon device family of products and accessories. We develop scalable and robust state-of-the-art algorithms that involve learning from large amounts of past data, such as customer engagement data (impression, clicks, transactions, etc.), product features (product attributes, price, promotion, etc.), merchandising activities, relevant products and users, in order to drive more efficient customer engagement and business values. This role is central to the continued growth of the Device division as we have grown from the first Kindle e-reader to a vast portfolio of Fire tablets, Fire TVs, Echo, and Dash.\n<br><br>\nYou will have an opportunity to both develop advanced scientific solutions and drive critical customer and business impacts. You will play a key role to drive end-to-end solutions from understanding our business and business requirements, identifying opportunities from a large amount of historical data, building prototypes and exploring conceptually new solutions, running online experiments, to working with partner teams for prod deployment. You will collaborate closely with engineering peers as well as business stakeholders. You will be at the heart of a growing and exciting focus area for Amazon Devices.\n<br><br>\nYou are an individual with outstanding analytical abilities, excellent communication skills, and are comfortable working with cross-functional teams and systems. You will be responsible for researching, prototyping, experimenting, and analyzing predictive and optimization models.\n<br><br>\n<strong>Key responsibilities:</strong>\n<br>\n· Interact with business, product, and engineering teams to understand business requirements and operational processes\n<br>\n· Frame business problems into scalable solutions\n<br>\n· Process and analyze sales data; gather additional data sources that would improve model performance\n<br>\n· Prototype models by using high-level modeling languages such as R or in software languages such as Python. A software team will be working with you to transform prototypes into production.\n<br>\n· Create and track accuracy and performance metrics (both technical and business metrics)\n<br>\n· Create, enhance, and maintain technical documentation, and present to other scientists, engineers and business leaders.\n<br>\n· Drive best practices on the team; mentor and guide junior members to achieve their career growth potential"}