{"job title": "Sr. Scientist", "company": "Axalta", "city state": "– US-MI-Mount Clemens", "rating": "2.8", "job description": "<div><div>\n<div>Due to continued growth, Axalta Coating Systems is looking to hire a Color Chemist for our America's Technology Center located at our facility in Mt. Clemens, MI. This Color Chemist will work with one of our four business divisions and will support one of our two transportation divisions.\n<br><br>\nAxalta is a leading global company focused solely on coatings and providing customers with innovative, colorful, beautiful and sustainable solutions. From light OEM vehicles, commercial vehicles and refinish applications to electric motors, buildings and pipelines, our coatings are designed to prevent corrosion, increase productivity and enable the materials we coat to last longer. With more than 150 years of experience in the coatings industry, the approximately 14,000 people of Axalta continue to find ways to serve our more than 100,000 customers in 130 countries better every day with the finest coatings, application systems and technology. For more information visit axalta.com and follow us @Axalta on Twitter and on LinkedIn.\n<br><br>\nSee link: http://www.axaltacs.com/content/dam/Corporate/Documents/About%20Axalta/Axalta%20Brochure%202018.pdf</div></div>\n</div>\n\n<br>Responsibilities<br>\n\n<div>\n<div>\n<div>Axalta is a global supplier of vehicle OEM, repair (refinish) and liquid industrial coatings and supports these business segments from its Americas Technology Center in Mt Clemens, Michigan. The Coatings Scientist with Color Specialization:\n<br><br>\nLeads technical programs related to color and color development in a team environment.\n<br><br>\nHas a fundamental understanding of color science including color measurement systems and instrumentation.\n<br><br>\nHas knowledge of pigments, pigment durability and in-use performance attributes including application, circulation and storage characteristics.\n<br><br>\nIs responsible for development and implementation of new color formulations in solventborne and waterborne coating systems including initial color definition with the customer, scale-up with Manufacturing and optimization of performance at the customer site.\n<br><br>\nWorks as an active member of cross functional project teams with Manufacturing, Product Management, IT and Sales.\n<br><br>\nApplies statistical methods to investigate problems and analyze results.\n<br><br>\nThe role of Coatings Scientist with Color Specialization would report to a Technology Leader, located in Mt. Clemens, Michigan facility and may require some travel (~10%)</div></div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div><strong>QUALIFICATIONS:</strong>\n<br><br>\nMinimum B.S. in Chemistry, Chemical Engineering or related science degree.\n<br><br>\nMUST HAVE a minimum 2-5 years practical color experience.\n<br><br>\nProduct development experience in color and color measurements.\n<br><br>\nDemonstrated ability to get results.\n<br><br>\nAbility for effective written and oral communications.\n<br><br>\nDemonstrated ability to apply data analysis tools to system development and problem solving. Appropriate skills include theoretical or empirical modeling, statistics, computer systems development and process control. Must be able to interpret, analyze and apply numerical color and appearance measurement.\n<br><br>\nDemonstrated ability to perform efficient experiments to identify issues, develop relationships and validate results using process/product variables in relation to visual or optical measurement responses.\n<br><br>\n<em>As an Equal Opportunity Employer, Axalta is committed to a diverse workforce.</em></div>\n</div>\n</div>\n<br>"}