{"job title": "Postdoctoral Scientist (Pulmonary)", "company": "Cedars-Sinai", "city state": "– Los Angeles", "rating": "3.9", "job description": "The Postdoctoral Scientist will investigate mechanisms of progenitor cell expansion in the healthy lung and in lung cancer. Projects include defining genetic and epigenetic mechanisms that regulate progenitor cell renewal versus differentiation and how this changes in the setting of lung cancer. Experimental approaches employed in the laboratory include disease modeling using genetically modified mice, prospective isolation and cultivation of lung stem cells, isolation and culture of human lung epithelial cells from patient-derived samples and advanced genomics approaches for single cell gene expression profiling and epigenetic analysis.\n<br><br>\nWorking independently but in close cooperation and in consultation with the Principal Investigator and other Research Scientist, the Postdoctoral Scientist will perform routine and complex laboratory procedures throughout training period. May develop, adapt, and implement new research techniques and protocols. Analyzes and interprets data. May assist in preparation of grant proposals. Participates in publications and presentations as author or co-author. Not responsible for generating grant funds.   \n<br><br>\n<strong>ESSENTIAL JOB DUTIES AND RESPONSIBILITIES:</strong>\n<br>\nMay assist in preparation of grant proposals, but is not responsible for generating grant funds.\n<br>\nMay participate in publications and presentations as author or co-author.\n<br>\nDesigns and performs experiments. Will keep appropriate experimental records and documentation and analyze the results with the Principal Investigator.\n<br>\nMay develop, adapt, and implement new research techniques and protocols.\n<br>\nAnalyzes, interprets, summarizes and compiles data.\n<br>\nPerforms routine and complex laboratory procedures throughout training period.\n<br>\nOperates and maintains equipment and instruments.\n<br><br>"}