{"job title": "Postdoctoral Scientist (Immunology)", "company": "Cedars-Sinai", "city state": "– Los Angeles", "rating": "3.9", "job description": "Dr. Helen Goodridge is looking for a postdoctoral scientist to join her research group (www.csmc.edu/goodridgelab) in the Cedars-Sinai Regenerative Medicine Institute (www.csmc.edu/rmi). The Goodridge lab studies the production and functional programming of myeloid cells (neutrophils, monocytes, macrophages and DCs), and their roles in infectious and inflammatory diseases, aging and tissue regeneration. The Goodridge lab works closely with other Cedars-Sinai researchers (including the Berman, Underhill, Koeffler, Svendsen, Baloh and Stripp groups), as well as external collaborators.\n<br><br>\nThe postdoc should have an interest and prior expertise in immunology and/or hematology, with strong experience of flow cytometry, tissue culture, molecular biology (e.g. RNA-seq, ChIP, DNA barcoding) and rodent studies (e.g. adoptive transfer, bone marrow transplantation). Bioinformatics/computational experience would be an advantage. The postdoc will work independently under the direction of the PI (Dr. Goodridge) and cooperatively with a team of other research staff. The postdoc will develop one or more research projects, plan and conduct experiments, and prepare data for publication and grant proposals. The postdoc will also collaborate with other investigators, train junior lab members, participate in lab meetings, and present their research at meetings. Excellent written and oral communication skills are required.\n<br><br>\nDuties will include but are not limited to:\n<br>\nDesigning and performing experiments; analyzing, interpreting and compiling data; maintaining appropriate written and electronic records.\n<br>\nPerforming routine and complex laboratory procedures; developing, adapting and implementing new research techniques and protocols.\n<br>\nAssisting with training of junior lab members and participation in collaborations with other investigators.\n<br>\nParticipation in publications and presentations as a main author or co-author.\n<br>\nSubmitting fellowship proposals and assisting the PI with grant proposals (but not responsible for generating grant funds).\n<br><br>\n<strong>Additional Information:</strong>\n<br>\nScheduling flexibility including evening, weekend and holiday rotation commitment is required. Travel may be required.\n<br><br>"}