{"job title": "Research Scientist - Chemistry", "company": "Corning Incorporated", "city state": "– Painted Post, NY", "rating": "3.6", "job description": "Research Scientist - Chemistry\n\n\n<ul>\n<li>*Date:** Aug 8, 2018</li>\n<li>*Location:** Painted Post, NY, US, 14870</li>\n<li>*Req #:** 32320</li>\n</ul>\n\nCorning is one of the world?s leading innovators in materials science. For more than 160 years, Corning has applied its unparalleled expertise inspecialty glass, ceramics, and optical physics to develop products that have created new industries and transformed people?s lives.\n<br><br>\nAt Corning, our growth is fueled by a commitment to innovation. We succeed through sustained investment in research &amp; development, a unique combination of material and process innovation, and close collaboration with customers to solve tough technology challenges. We are a four-time National Medal of Technology winner thanks to our technology leadership and R&amp;D environment, which attract and enable the best scientific minds in the world. This pipeline of talent has brought life-changing innovation to your fingertips for more than 160 years.\n\n\n<ul>\n<li>*Scope of Position** (i.e. projects involved with and role within group): This position is an individual contributor role where you will be responsible and accountable for running, measuring, interpreting, and reporting out x-ray computed tomography (XCT) samples for a wide range of projects as a scientist within the Characterization Science directorate within Corning Research &amp; Development Division.</li>\n<li>*Summary** : Encompasses the application of scientific, mathematical, and statistical techniques in the determination of dimensions, quantity, or capacity of products or processes, mainly in the area of x-ray computed tomography (XCT) and confocal microscopy. Designs, develops, and implements testing methods and equipment using XCT or confocal microscopy methods. Provides test area with parameters for sample testing and specifies tests to be performed. Compiles data and defines changes required in testing equipment, testing procedures, manufacturing processes, or new testing requirements. Compiles customer reports from the data. Maintains clean and organized lab environment and practices good safety and laboratory practices. Makes requests to other characterization teams for additional testing and follows-up on dissemination of results.</li>\n<li>*Day to Day Responsibilities:**</li>\n</ul>\n\n+ Perform x-ray CT imaging studies (data collection, interpretation, and reporting) for specific projects and businesses\n<br><br>\n+ Analyze data collected and provide interpretation and recommendations to requestor\n<br><br>\n+ Document and communicate results to end users (verbal, written, or presentations)\n<br><br>\n+ Define and develop needed analytical methods\n<br><br>\n+ Work with product development, manufacturing, commercial, and customers to understand and translate needs into measurements\n\n\n<ul>\n<li>*Travel Requirements** (please note if international): Limited travel may be required depending on projects</li>\n<li>*Hours of work/work schedule/flex-time:** minimum 40 hours/week: 8 ? 5 or flex with some night or weekend work</li>\n<li>*Education and Experience** (minimum required for consideration):</li>\n</ul>\n\n+ MS or PhD in Material Science, Physics or Ceramic -Electrical Engineering, or other relevant physical sciences/engineering field.\n<br><br>\n+ Preference for individual with 2+ years' experience using x-ray CT in Material Science applications or microscopy experience..\n\n\n<ul>\n<li>*Required Skills** (These are skills that candidates must possess):</li>\n</ul>\n\n+ Self-starter and flexible, can work independently as needed\n<br><br>\n+ Technical problems solving and experimental design skills ? ability to question, design and carry out experimentation, analyze, and evaluate data/information from multiples sources and provide recommendations.\n<br><br>\n+ Ability to manage multiple tasks and priorities; and analyze large volume of data and reduce to key actionable items\n<br><br>\n+ Ability to work across multiple functions ranging from manufacturing processes to RD&amp;E associated with new product platform development\n<br><br>\n+ Ability to build successful relationships with technical and manufacturing organizations\n<br><br>\n+ Strong communications skills (verbal, written, and presentations)\n<br><br>\n+ Focused, timely, and rigorous application of scientific methods\n\n\n<ul>\n<li>*Desired Skills** (these are the skills that would be nice for candidates to possess):</li>\n</ul>\n\n+ Prior experience in collecting and applying x-ray CT datasets to material science problems\n<br><br>\n+ Experience with Zeiss Versa x-ray CT equipment and software\n<br><br>\n+ Confocal microscopy (optical microscopy) experience for looking at materials\n<br><br>\n+ Strong image processing and analysis skills\n<br><br>\n+ Technical knowledge of Corning Incorporated processes and products\n<br><br>\n+ Prior supervisory experience\n<br><br>\n+ Creativity\n<br><br>\n+ Prior Education and/or Experience in glass and/or ceramics\n<br><br>\n<strong>\n<ul>\n<li>*Soft Skills** (Communication/Team/Leadership):</li>\n</ul>\n\n</strong>\n<br>\n+ Ability and comfort with working on different projects at a time\n<br><br>\n+ Able to establish a strong network across the technology community\n<br><br>\n+ Excellent collaborator and partner within the work\n<br><br>\n+ Comfortable with risk and rapid changes\n<br><br>\nThis position supports immigration sponsorship.\n<br><br>\nWe prohibit discrimination on the basis of race, color, gender, age, religion, national origin, sexual orientation, gender identity or expression, disability, or veteran status or any other legally protected status.\n\n\n<ul>\n<li>*Nearest Major Market:** Corning</li>\n</ul>"}