{"job title": "Senior Data Warehouse Engineer", "company": "Grand Rounds", "city state": "– San Francisco, CA", "rating": "4.8", "job description": "<div><div>Grand Rounds’ mission is to use technology and data to deliver great health and health care for everyone, everywhere. We collect data from companies, insurance networks, national databases, patients’ health records and more and use that data to improve quality of healthcare. Ingesting, processing, correlating and securing this heterogeneous data and enabling real-time analytics is meaningful work, but it’s also technically challenging. We’re excited to continue building our systems and infrastructure into a world class platform for patient care.</div><br>\n<div>You will work on our data engineering team to build our data pipelines and warehousing. These systems power our analytics and empower patients and clinicians to make the most appropriate health care decisions and achieve superior outcomes. You’ll collaborate with data scientists, analysts, growth marketers, and the rest of the company to enable their access to data and improves the quality of their results.</div></div><div><div>Responsibilities:\n\n<ul>\n\n\n<ul>\n<li>Build and launch new data models that provide intuitive analytics to data customers</li><li>Build data infrastructure to route data through our stack and into warehouse</li><li>Build and maintain high-performance, fault-tolerant, secure, and scalable distributed software systems</li><li>Develop expertise on healthcare data sets and lead their modeling to enable insights</li><li>Implement tools that helps your data customers to extract, analyze, and visualize data faster</li><li>Evaluate new technologies and build prototypes for continuous improvements in data infrastructure and engineering</li></ul>\n</ul>\n\n</div>\n<br>\n<div><div>Qualifications:\n<br>\n\n\n<ul>\n\n\n<ul>\n<li>3+ years professional experience as a software developer</li><li>Development experience in data warehouses and related technologies (Plus: Redshift, Looker)</li><li>Experience designing data modelsMastery of SQL and ETL techniques</li><li>Development experience with an interpreted scripting language (e.g. Ruby, Python, Perl)</li><li>Development experience with an object-oriented language (e.g. Java, C++)</li><li>Bachelor’s degree in Computer Science or other technical field</li></ul>\n</ul>\n\n</div>\n</div><div><div>This is a full-time position located in San Francisco, CA. We are willing to relocate candidates, and we encourage you to apply if you feel you meet most but not all of the above requirements.</div><li>----</li>\n\n<br>\n<div>Grand Rounds is an Equal Opportunity Employer and considers applicants for employment without regard to race, color, religion, sex, orientation, national origin, age, disability, genetics or any other basis forbidden under federal, state, or local law. Grand Rounds considers all qualified applicants in accordance with the San Francisco Fair Chance Ordinance.</div></div></div>"}