{"job title": "Variant Scientist", "company": "LabCorp", "city state": "– RTP, NC", "rating": "2.9", "job description": "LabCorp (NYSE: LH), an S&amp;P 500 company,:\n<br>\n<div>is a leading global life sciences company that is deeply integrated in guiding patient care, providing comprehensive clinical laboratory and end-to-end drug development services. With a mission to improve health and improve lives, LabCorp delivers world-class diagnostic solutions, brings innovative medicines to patients faster and uses technology to improve the delivery of care. LabCorp reported net revenues of over $10 billion in 2017.</div>\n\n<br><strong>Shift:</strong>\n<br>\n<strong>1</strong>\n<br><br>\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>PhD in Life Sciences (Molecular Biology/Biochemistry/Genetics)with a strong background in Molecular Genetics</li>\n<li>Minimum of 2 years of post-doctoral and/or other relevant experience</li>\n<li>Strong analytical capabilities, superior scientific writing and communication skills, organization, meticulousness, ability to critically read, understand, and interpret data from scientific publications and online databases on a daily basis</li>\n<li>Ability to meet production timelines with a sense of urgency and ethical responsibility in a rapidly evolving dynamic setting</li>\n<li>Ability to learn and adapt to use of bioinformatics software, proficiency in working with large datasets, <em>in-silico</em> tools, and WES/NGS technologies</li>\n</ul>\n\nDescription:<br><br>The Integrated Genetics division of LabCorp is seeking a Variant Scientist to join its team in RTP, NC. The Variant Scientist is responsible for daily processing, classification and analysis of inherited and somatic genetic variants identified through WES (Whole Exome Sequencing) and Targeted NGS DNA sequencing platforms in a clinical diagnostic laboratory setting. A strong background in Biochemistry/Molecular Biology/Biophysics/Cell Biology/Physiology and/or Human Genetics with experience in DNA sequence analysis, next-generation sequencing (NGS) technologies, and Microsoft Office suite of products is essential.\n<br><br>\nResponsibilities:\n\n<ul>\n<li>Process and classify variants in accordance with company SOPs</li>\n<li>Maintain communication with laboratories located within or outside LabCorp</li>\n<li>Maintain tracking documents in relation to the variant-classification process</li>\n<li>Report to a supervisor/manager on the variant processing status and performance</li>\n<li>Communicate frequently with the Laboratory Directors, Medical Geneticists and Genetic Counselors regarding variant assessment</li>\n<li>Interact with the software vendors/IT/bioinformatics group(s) regarding technology needs as and when required</li>\n<li>Opportunity to take part in company projects, publications and posters at scientific meetings of relevance to the organization</li>\n</ul>\nThe 7,000-acre Research Triangle Park is the largest research park in the United States, and is home to over 140 organizations (Biotechnology, Pharmaceuticals, Healthcare, and Information Technology /Telecommunications) and has around 45,000 full time employees entering the Park each day. The Research Triangle itself is named for the Triangle formed by the three universities: Duke University at Durham, the University of North Carolina at Chapel Hill, and North Carolina State University in Raleigh.<br><br>Schedule:\n<br>\nMonday-Friday, 8:00 a.m. - 5:00 p.m.\n<br><br>\n<strong>Department:</strong>\n<br>\nGenomics-3170\n<br><br>"}