{"job title": "Principal Research Scientist", "company": "Lilly", "city state": "– New York, NY", "rating": "3.8", "job description": "**39075BR**<br> <br>**Responsibilities:**<br> <br><br> <br>We reaffirmed our commitment to invest in R&amp;D facilities across the United States. We're proud to have celebrated the recent opening of our Immuno-Oncology Research and Development Center of Excellence in New York City. Lilly completed an expansion of our site at the Alexandria Center for Life Science. The site houses an immuno-oncology R&amp;D center of Excellence (IOCE) passionate about advancing the next generation of immunotherapies. The research facility represents Lilly?s dedication to developing life-changing medicines, and to improving the care of people living with cancer.<br> <br><br> <br>We are excited to have someone join and help lead our team. We are seeking a highly motivated scientist to assist in the development of cancer therapeutics in the Cancer Immunobiology department at our Lilly NY site. Are you experienced in T-cell biology and vaccine development? Can you effectively lead and take on new projects? You should have a broad knowledge of immunology and pre-clincial vaccine development with prior academic and/or industry experience and publications in the field. Your main responsibility is to establish and lead a focused research group to evaluate the immunological potential of target antigens, including vaccine candidates, and to develop in-vitro assays to isolate and characterize antigen-specific T cells. Do you have experience in this area? If you have excellent communication skills and the ability to work well independently and in a team setting and feel you would integrate well here at Lilly please check out this opportunity.<br> <br><br> <br>**Req ID:**<br> <br><br> <br>39075BR<br> <br><br> <br>**Additional Skills/Preferences:**<br> <br><br> <br>+ Establish a focused research group to evaluate the immunological potential of target antigens<br> <br>+ Oversee a group of technical track reports<br> <br>+ Assist in the discovery and development of new cancer immunotherapeutic targets.<br> <br>+ Understand the mechanism of action of pipeline cancer therapeutics by developing and performing in vitro and in vivo models and assays.<br> <br>+ Antigen-specific T cell isolation and characterization, epitope mapping, in vitro priming and expansion<br> <br>+ Mammalian cell culture: transfections, stable clone selection, flow cytometry<br> <br>+ Cell based assays: cell proliferation, effector function, and reporter assays<br> <br>+ Provide written and oral communication of work, present data and data summaries internally and externally as needed<br> <br>+ Lead and participate in project team meetings<br> <br>+ Ability to multi-task, work independently or as part of a multi-disciplinary team<br> <br>+ Excellent organizational and presentation skills<br> <br>+ Ability to effectively and efficiently handle high throughput of various experiments while maintaining quality results<br> <br><br> <br>**Additional Information:**<br> <br><br> <br>Lilly is an EEO/Affirmative Action Employer and does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.<br> <br><br> <br>**Workplace Arrangement:**<br> <br><br> <br>Local<br> <br><br> <br>**Title:**<br> <br><br> <br>Principal Research Scientist-Immuno-Oncology<br> <br><br> <br>**Job Category:**<br> <br><br> <br>Science<br> <br><br> <br>**Basic Qualifications:**<br> <br><br> <br>+ Ph.D. Degree in Biological Sciences (ex. Immunology, Tumor Immunology, Cell Biology).<br> <br>+ At least 5 yrs prior relevant academic or industry research experience in the Immuno-Oncology setting.<br> <br><br> <br>**Company Overview:**<br> <br><br> <br>At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 39,000 employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We?re looking for people who are determined to make life better for people around the world.<br> <br><br> <br>**City:**<br> <br><br> <br>New York<br> <br><br> <br>**Country:**<br> <br><br> <br>USA<br> <br><br> <br>**State / Province:**<br> <br><br> <br>New York<br> <br><br> <br>**Region:**<br> <br><br> <br>North America"}