{"job title": "Sr Research Scientist-Clinical", "company": "Lilly", "city state": "– Indianapolis, IN", "rating": "3.8", "job description": "<ul>\n<li>*43794BR**</li>\n<li>*Responsibilities:**</li>\n</ul>\n\nClinical Planning\n<br><br>\n+ Communicate and collaborate with BI/Lilly Alliance medical teams to ensure life cycle plans for drugs in development address customer needs or communicate and collaborate such needs as delegated by Medical Director, Alliance to global Development teams, US and Global Health Outcomes (GHO), PRA, Therapeutic Area Program Phase, and Early Phase /Clinical Pharmacology, and Translational Medicine teams.\n<br><br>\n+ Communicate local/regional research needs and collaborate with other regions and the global Development team, GHO, and PRA teams to ensure Phase 3b, and 4 clinical programs meet the needs of local/regional customers.\n<br><br>\n+ Understand and keep updated with the pre-clinical and clinical data relevant to the molecule.\n<br><br>\nClinical Research/Trial Execution and Support\n<br><br>\n+ Review and approve local informed consent documents to ensure appropriate communication of risk to study subjects.\n<br><br>\n+ Plans, collaborates on and reviews scientific content of clinical documents such as protocols, informed consent documents, final study reports, and submissions (e.g., annual reports) according to the agreed upon project timeline.\n<br><br>\n+ Supports the monitoring of patient safety during study and participates in the global product safety reviews including the appropriate tracking and follow-up of adverse events, in alignment with corporate patient safety policies and procedures.\n<br><br>\n+ Collaborate with clinical research staff in the design, conduct and reporting of local clinical trials (e.g., sample size, patient commitment, timelines, grants, and governance review interactions).\n<br><br>\n+ Review and collaborates with CRP on the approval of risk profiles to ensure to ensure appropriate communication of risk to study subjects.\n<br><br>\n+ Participate in investigator identification and selection, in conjunction with clinical teams.\n<br><br>\n+ Ensure that operational team has documented the completion of administrative requirements for study initiation and conduct (i.e., ethical review board, informed consent, regulatory approval/notification) consistent with Good Clinical Practices (GCPs) and local laws and requirements.\n<br><br>\n+ Assist in planning process and participate in study start-up meetings and other activities to provide the appropriate training and information to investigators and site personnel.\n<br><br>\n+ Serve as resource to clinical research staff and clinical research monitors, investigators and ethical review boards to address any questions or clarify issues arising during the conduct of study.\n<br><br>\n+ Understand and actively address the scientific information needs of all investigators and personnel.\n<br><br>\n+ Review IIT proposals and publications, as requested by CRP or Sr. Director-Medical\n<br><br>\nScientific Data Dissemination/Exchange\n<br><br>\n+ Knowledge of and compliance with local laws and regulations, and global policies and procedures, compliance guidelines with respect to data dissemination and interactions with external health care professionals.\n<br><br>\n+ Understand and address the unsolicited scientific information needs of external health care professionals according to guidelines above.\n<br><br>\n+ Participate in reporting of clinical trial data in Clinical Trial Registry activities.\n<br><br>\n+ Support the planning of symposia, advisory board meetings, and and/or the facilitation of other meetings with health care professionals.\n<br><br>\n+ Support medical information associates in preparation and review of medical letters and other medical information materials.\n<br><br>\n+ Support data analysis and the development of slide sets and publications (abstracts, posters, manuscripts).\n<br><br>\n+ Establish and maintain appropriate collaborations and relationships with external experts, thought leaders, and the general medical community on a national and possibly international basis.\n<br><br>\n+ Develop and maintain appropriate collaborations and relationships with relevant professional societies.\n<br><br>\n+ Support the design of customer research as medical expert.\n<br><br>\n+ Support training of medical personnel, including medical liaisons and outcome liaisons and health outcomes personnel as assigned.\n<br><br>\n+ Provide congress support (e.g., availability to answer questions at exhibits, provide oral and poster presentations, staff medical booth, meet thought leaders, and participate in customer events)\n<br><br>\n+ Participate in data analysis, development of scientific data dissemination, and preparation of final reports and publications\n\n\n<ul>\n<li>*Req ID:**</li>\n</ul>\n\n<strong>43794BR</strong>\n\n\n<ul>\n<li>*Additional Skills/Preferences:**</li>\n</ul>\n\n+ 3+ years of clinical experience or 2+ years of pharma industry experience with advanced degree is strongly preferred.\n<br><br>\n+ Strong Commercialization and Launch Readiness Experience for Affiliate teams\n<br><br>\n+ Diabetes expertise\n<br><br>\n+ Previous marketing-medical partnership\n<br><br>\n+ Communication style that can flex to diverse audiences and needs\n<br><br>\n+ Knowledge of drug development process preferred\n<br><br>\n+ Fluent in English; both written and verbal communications\n<br><br>\n+ Interpersonal, organizational and negotiation skills\n<br><br>\n+ Ability to influence others (both cross-functionally and within the function) in order to create a positive working environment.\n<br><br>\n+ Excellent teamwork skills.\n<br><br>\n+ Willing to engage in domestic and international travel to the degree appropriate to support the business of the team\n\n\n<ul>\n<li>*Additional Information:**</li>\n</ul>\n\nAbility to travel to BI in Ridgefield, CT every 4-6 weeks\n<br><br>\nRegulatory Support Activities\n<br><br>\n+ Participate in development and review of label changes and labeling modifications in collaboration with local team/region, brand teams, regulatory, and legal.\n<br><br>\n+ Provide medical expertise to regulatory scientists.\n<br><br>\n+ Support / assist in the preparation of regulatory reports, preparation for regulatory agency advisory committee hearings and label discussions, local registration efforts, and communication and resolution of regulatory issues, including regulatory response, from an affiliate/country perspective.\n<br><br>\n+ Participate in advisory committees.\n<br><br>\n+ Participate in risk management planning along with global Development team(s), business unit, local area, and Global Patient Safety (GPS).\n<br><br>\nBusiness/ customer support (pre and post launch support)\n<br><br>\n+ Understand the scientific information needs of all local/regional customers (payers, patients, health care providers).\n<br><br>\n+ Actively address customer (payer, patient and health care providers) questions in a timely fashion by leading data analyses and new clinical or health outcomes research efforts.\n<br><br>\n+ Contribute to the development of medical strategies to support brand commercialization activities by working closely with brand teams, global PRA and HO, clinical management or personnel and other cross-functional management during the development of the local business plan.\n<br><br>\n+ Contribute as a scientific and medical expert to activities and deliverables of the PRA organization, in particular giving clinical input and insight to develop payer partnership programs and defend the product value.\n<br><br>\n+ Support business-to-business and business-to-government activities as medical expert.\n<br><br>\n+ Support training of sales representatives, and other medical representatives.\n<br><br>\n+ Contribute actively on an ongoing basis to the strategic planning for currently marketed brands.\n<br><br>\n+ Review, offer scientific and creative support for, and approve promotional materials and tactics as needed.\n<br><br>\n+ Become familiar with market archetypes and potential influence on the medical interventions for the product\n<br><br>\n+ Participate in local or national trade associations as appropriate\n<br><br>\nScientific / Technical Expertise and continued development\n<br><br>\n+ Critically read and evaluate the relevant medical literature; know the status and data from competitive products; and keep updated with medical and other scientific developments relevant to the product.\n<br><br>\n+ Responsible for the scientific training of the clinical study team.\n<br><br>\n+ Acts as scientific consultant and protocol expert for clinical study team members and others in medical.\n<br><br>\n+ Be aware of current trends and projections for clinical practice and access in the therapeutic area(s) relevant to the product.\n<br><br>\n+ Explore and take advantage of opportunities for extramural scientific experiences.\n<br><br>\n+ Attend, contribute and participate in medical congresses/scientific symposia\n<br><br>\nLilly is an EEO/Affirmative Action Employer and does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status\n\n\n<ul>\n<li>*Title:**</li>\n</ul>\n\nClinical Research Scientist, US Medical Affairs - Diabetes\n\n\n<ul>\n<li>*Job Category:**</li>\n</ul>\n\nScience\n\n\n<ul>\n<li>*Basic Qualifications:**</li>\n</ul>\n\n+ Advanced medical related graduate degree, such as: DVM, PharmD, PhD, MSN with advanced clinical specialty (Clinical Nurse Specialist/Nurse Practitioner)\n<br><br>\n<strong>OR</strong>\n<br><br>\n+ BS or Masters degree in a health-related or scientific field with 7+ years of clinical experience or pharmaceutical industry experience, that is directly related to Medical Affairs, Medical Information, Scientific Communication, Regulatory Affairs, or other relevant areas\n\n\n<ul>\n<li>*Company Overview:**</li>\n</ul>\n\nEli Lilly and Company has been dedicated to meeting the health care needs of people in the United States and around the world. We address these needs primarily by developing innovative medicines?investing a higher percentage of our sales in research and development than any other major pharmaceutical company. If you are interested in being considered for employment with a ?Best in Class? Pharmaceutical company, please review the following opportunity.\n\n\n<ul>\n<li>*City:**</li>\n</ul>\n\nIndianapolis\n\n\n<ul>\n<li>*Country:**</li>\n</ul>\n\n<strong>USA</strong>\n\n\n<ul>\n<li>*State / Province:**</li>\n</ul>\n\nIndiana\n\n\n<ul>\n<li>*Region:**</li>\n</ul>\n\nNorth America"}