{"job title": "Senior Social Scientist - Qatar", "company": "Northrop Grumman", "city state": "– International, --", "rating": "3.7", "job description": "Northrop Grumman is seeking an experienced Senior Social Scientist with experience working with a diverse team of linguists, analysts, and planners, to serve as the lead of a diverse research team and to achieve operational objectives for SOCOM.\n<br><br>\nThe position is located at Al Udeid AB,Qatar.\n<br><br>\nThe successful candidate will be responsible for overall strategy, research tasking, data validation and program compliance management of IO activities for the contractor's operations in SOCOM including the following duties: prepares status reports, assesses project issues and risks and develops resolutions to meet productivity, quality, and client-satisfaction goals and objectives.\n<br><br>\nRoles and responsibilities for this position include:\n<br><br>\n1. In conjunction with the J2/Intel analysis personnel, OPTs, MISTs, other MISTF-supported elements in the CJOA, and according to current best practices in the domain.\n<br><br>\n2. Develop, refine, or coordinate assessment and collection plans for planned and active MIST series in the CJOA being reported to IOCARS.\n<br><br>\n3. Develop, refine, or coordinate Series Assessment Reports (SARs) for all active series in the CJOA being reported to IOCARS on a quarterly basis.\n<br><br>\n4. Continuously maintain a summary report of all SARs in the CJOA and disseminate as necessary.\n<br><br>\n5. Create, determine funding, and/or coordinate with stakeholders the collection of identified indicators through all available sources to assess approved MIST series in the CJOA.\n<br><br>\n6. Conduct statistical analysis of aggregated data received from contractors, other agencies, or collected by in-house means and produce summary reports of those data as necessary.\n<br><br>\n7. Work with Knowledge Manager to maintain and update the MISO Assessments Intellipedia repository on SIPR and JWICS with all existing MISO assessments, survey data, survey reports, and analytical intelligence reports as they pertain\n<br><br>\nto conducting psychological and influence operations in the CJOA.\n<br><br>\n8. Update a designated Unified Assessment Management system database with current assessment information from supported MISO organizations or other reports<br><br><strong>Basic Qualifications:</strong>\n\n\n<ul>\n\n<li>\n<div>Must possess a Master's degree in Psychology, Sociology, Anthropology, Behavioral Sciences or other related disciplines and a minimum of 7 years of direct relevant experience.</div></li>\n<li>\n<div>Must have knowledge of Microsoft Office products</div></li>\n<li>\n<div>Must be willing and able to immediately deploy to Kuwait and travel as required by the program to both CONUS and OCONUS.</div></li>\n<li>\n<div>Must be willing and able to serve on a 1 year rotation between Kuwait and other possible locations.</div></li>\n<li>\n<div>Must possess a current U.S. Passport.</div></li>\n<li>\n<div>Must possess a Current TS/SCI security clearance.</div></li>\n<li>Must be a U.S. Citizen.</li>\n</ul>\n<strong>Preferred Qualifications:</strong>\n<br><br>\n1. PhD in Psychology, Sociology, Anthropology, Behavioral Sciences.\n<br><br>\n2. Concentration in statistical methods for social sciences.\n<br><br>\n3.Must possess statistical package expertise in IBM SPSS/PASW, R, STATA or even excel.<br><br>Northrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit www.northropgrumman.com/EEO. U.S. Citizenship is required for most positions."}