{"job title": "Senior Clinical Research Scientist", "company": "Pharmacyclics, an Abbvie Company", "city state": "– Sunnyvale, CA", "rating": "NA", "job description": "<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong><br><br>Pharmacyclics is committed to the development and commercialization of novel therapies intended to improve the quality and duration of life and to resolve serious unmet medical needs for cancer patients. Pharmacyclics is a wholly-owned subsidiary of AbbVie (NYSE:ABBV), a global, research-based biopharmaceutical company. Oncology is a key therapeutic area for AbbVie, with a portfolio consisting of three marketed products and a pipeline containing multiple promising new molecules that are being studied in more than 200 clinical trials for over 20 different types of cancer.\n<br><br>\nMore than 1,200 Pharmacyclics and AbbVie research scientists, clinicians, marketing, operations and corporate professionals work in the San Francisco Bay Area. They combine their expertise in immuno-oncology, stem cells, and cell-signaling with their knowledge of bispecific antibodies, antibody-drug conjugates (ADCs), and covalent-inhibitor technologies to discover and develop novel cancer treatments. Together, we are striving to outsmart cancer.\n<br>\nTo learn more about us, please visit us at http://www.pharmacyclics.com/\n<br>\n<strong> General Position Summary/Purpose:</strong> \n<br>\nThis position is responsible in conjunction with the Medical Monitor for the scientific planning, monitoring and reporting of assigned clinical trials. The Senior Clinical Research Scientist assists the cross-functional study team (SMT) addressing protocol questions, including preparation of clinical study protocols, patient informed consents, and other core documents which are central to clinical and scientific trial conduct. This position reports to a Clinical Science Project Lead.\n<br>\n<strong>Key Accountabilities/Core Job Responsibilities:</strong>\n\n<ul>\n <li> Assist the medical monitor with regular and ad-hoc data reviews and interpretation; prepare and present summaries/documentations of these reviews</li>  <li> Support the medical monitor with the development of program-level documents, including but not limited to clinical protocols, clinical study reports, abstract and manuscripts, presentations, investigator brochures, and various other internal and external documents and communications as needed</li>  <li> Collaborate with the medical monitor to identify any trial-related safety trends, and as needed, generate reports to interpret, analyze and summarize the data and trends</li>  <li> Support the medical monitor with review and contributions to trial-related documents such as the statistical analysis plan, the data management plan, the medical monitoring plan</li>  <li> Assist the medical monitor with protocol deviation review</li>  <li> Assist Clinical Operations with developing the operational strategies for clinical research studies and development programs (e.g. PI selection, CRO selection, budgets)</li>  <li> As agreed with the medical monitor, manage trial-related committees such as Safety Review Committees, Steering Committee meetings as well as independent DMC meetings, and serve as the clinical representative on various project sub-teams</li>  <li> Assist with protocol and study conduct training of CRAs, study coordinators, and investigators</li>  <li> Assist with responding to regulatory questions as well as respond to site IRB or EC questions</li>  <li> Assist in preparation of Clinical and/or Regulatory submissions (e.g. INDs, IND Annual Reports, Safety Updates, NDAs, CTDs, Investigator Brochure updates and protocol writing).</li>  <li> Effectively collaborate with cross-functional internal groups and external partners, as well as work effectively with external key opinion leaders and investigators.</li>  <li> Ensures that the clinical elements of documents are of quality, accuracy and format and comply with laws, regulations, and corporate standards.</li>  <li> As agreed with the medical monitor, manage trial-related committees such as Safety Review Committees</li>  <li> Provide timely and regular updates to the Cross-Portfolio safety team</li>  <li> Travel: Up to 20%, primarily domestic</li> \n</ul>\n\n<strong> Competencies:</strong> \n\n<ul>\n <li> Strong team player with excellent interpersonal skills and ability to work effective in a cross-functional team environment.</li>  <li> Capable of managing multiple priorities, and able to exercise sound judgment, work under pressure and produce accurate and timely work within a highly-regulated environment.</li>  <li> Strong verbal and written communication skills a must, and ability to present scientific study data and results (clinical and non-clinical) to internal and external audiences required.</li>  <li> Strong organizational skills and an ability to take the initiative and be flexible in resolving problems as necessary.</li>  <li> An ability to interpret, discuss, and report trail / program level data effectively and identify trends is also required.</li> \n</ul>\n\n<strong> Required Education:</strong> \n\n<ul>\n <li> BS/BA in Sciences/Pharmacy/Nursing (Master's or PhD is preferred).</li> \n</ul>\n\n<strong> Required Experience:</strong> \n\n<ul>\n <li> Post Graduate training in a health-related field and/or equivalent experience is desirable.</li>  <li> Minimum of 3 years' industry or industry related experience including working on clinical trials.</li>  <li> Experience in analyzing, interpreting, and summarizing clinical trial data for internal and external audiences.</li> \n</ul>\n\nEqual Opportunity Employer Minorities/Women/Veterans/Disabled\n<br><br>"}