{"job title": "Scientist, Process Chemistry", "company": "Seattle Genetics, Inc.", "city state": "– Bothell, WA, United States", "rating": "3.6", "job description": "<div><div>Summary:\n<br><br>\nThe Process Chemistry team at Seattle Genetics is growing and is seeking a highly motivated individual to join our group. The successful candidate will be responsible for developing novel synthetic routes and chemical processes for anti-cancer drugs and proprietary drug linkers used for antibody conjugation, in support of our pre-clinical, clinical and commercial programs. Candidates will have to demonstrate creativity and independence in solving synthetic problems and will ultimately have to develop robust chemical processes that can be transferred to third party manufacturers. If you are looking for a stimulating environment, in the vibrant surroundings of the Pacific Northwest, where discovery and development of therapies to treat cancer patients is the central goal we are interested in hearing from you!\n<br><br>\nResponsibilities:\n<ul>\n<li>Design and perform synthetic organic chemistry experiments efficiently and independently; monitor chemical reactions and product quality using various chromatographic and spectroscopic techniques</li><li>Define parameters for robust and efficient chemical processes to attain a fundamental understanding of process performance and capabilities</li><li>Generate high quality experimental data, detailed protocols of chemical processes and technical documents to support CMC activities and regulatory submissions</li><li>Collaborate with analytical chemists to develop optimal methods for quality determination of process products</li><li>Assist in the transfer of chemical processes to third party manufacturers, and develop novel and creative solutions to overcome process and manufacturing difficulties</li><li>Provide technical recommendations based upon in-depth analyses of experimental results and process performance data</li><li>Present scientific findings to project/program cross-functional teams in a concise and impactful manner</li><li>Ability to articulate issues to upper management in a timely manner</li>\n</ul>\nQualifications:\n<ul>\n<li>Ph.D. degree in organic chemistry or B.S./M.S. degree in chemistry with 8-10 years of industrial experience in process development of small molecule drugs</li><li>In-depth knowledge of organic chemistry, reaction mechanisms, and familiarity with modern synthetic and analytical methods and techniques</li><li>Extensive experience in multi-step organic synthesis including reaction design, execution, and development of workup, isolation, and crystallization procedures</li><li>Experience collecting key experimental and analytical data to support research and development decisions</li><li>Experience applying spectroscopic methods (NMR, LC-MS, IR, etc) for structure determination and utilizing various analytical techniques (HPLC, NMR, GC, etc.) for quantitative data collection</li><li>Proficient with software programs such as MS Office suite (Word, Excel, PowerPoint), SciFinder, Reaxys and ELN systems</li><li>Excellent written and oral communication skills; enthusiasm, integrity, self motivation, and ability to interact within a multi-disciplinary team</li>\n</ul>\nAdditional Skills:\n<ul>\n<li>Experience and expertise in peptide synthesis desirable</li><li>Experience in executing small molecule chemical processes in scale up facilities a plus</li>\n</ul>\nAs the leading employer in our industry in the Pacific Northwest, Seattle Genetics is proud to offer a competitive total compensation package as well as a comprehensive benefits program designed to support the whole lives of our employees and their families. Benefits include medical, vision and dental coverage, group and supplemental life insurance, 401(k) with company match, tuition reimbursement, relocation assistance and much more. To learn more about Seattle Genetics, please visit <strong><u>www.seattlegenetics.com</u></strong>.<br><br>Seattle Genetics is an equal opportunity employer. All qualified applications will receive consideration for employment without regard to race, age, gender identity, sexual orientation, color, religion, sex, marital status, national origin, protected veteran status, disability status, or any other status protected by federal, state, or local law.</div> </div>\n<br><strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}