{"job title": "Data Scientist", "company": "Amazon", "city state": "– Atlanta, GA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAre you interested in applying your strong quantitative analysis and big data skills to world-changing problems? Are you interested in driving the development of methods, models and systems for state-of-the-art robotics, transportation and fulfillment systems? If so, then this is the job for you. <br> <br> The Amazon Transportation Services team is responsible for developing an in-depth understanding of our current network and designing our future networks. We are looking for motivated experienced and motivated Data Scientist/Business Intelligence Engineer with outstanding leadership skills, proven ability to develop, automate, and manage analytical models of our systems. The successful candidate will have strong modeling skills and is comfortable owning their own data and working from concept through to execution. This role will also build tools and support structures needed to analyze data, dive deep into data to determine root cause of forecast/buying systems errors &amp; changes, and present findings to business partners to drive improvements. <br> <br> A qualified candidate must have demonstrated ability to manage medium-scale modeling projects, identify requirements and build methodology and tools that are statistically grounded. The ideal candidate will have experience collaborating across organizational boundaries.\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\nThe qualified candidate will have a proven history of driving critical research and development through modeling and machine-learning methods in developing predictive models as well as methods for building in-depth analytical understanding of systems. <br> <ul><li>Advanced degree (M.S. or Ph.D.) in Engineering, Math, Statistics, Finance, Computer Science, or related industry experience.</li><li>3+ years of quantitative experience in Logistics/Supply Chain, Transportation, Engineering or related Businesses.</li><li>3+ years of experience with statistical tools (e.g. R) and analysis, regression modeling and forecasting, time series analysis. Able to write SQL scripts for analysis and reporting ( SQL, MySQL)</li><li>Experience using one or more programming languages (e.g. Python, Java, C++, C#, Ruby)</li><li>Experience with big data: processing, filtering, and presenting large quantities (100K to Millions of rows) of data.</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Experience in advanced machine-learning methodologies (e.g. supervised and unsupervised learning, deep learning etc.)</li><li>Experience with clustered data processing (e.g. Hadoop, Spark, Map-reduce, Hive)</li><li>Experience in communicating technically, at a level appropriate for the audience.</li></ul><br> Amazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation.<br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}