{"job title": "Data Scientist", "company": "Horizontal Integration", "city state": "– Minneapolis, MN", "rating": "4.3", "job description": "<div>\n<div>\nDescription<br><br><strong>Minneapolis, MN\n<br>\nData Scientist\n<br>\n3 months</strong>\n<br><br>\n<strong>*upon offer, candidates must complete a background check*</strong>\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Lead the design, development, implementation and documentation of a predictive modeling solution that drive growth and value to the business, in particular with respect to acquisition.</li>\n<li>Identify, develop and implement practical decision science solutions such as predictive regression modeling, decision trees and supervised and unsupervised machine learning techniques.\n<br><br>\n<strong>Required</strong>:</li>\n<li>Masters degree (or equivalent) in Economics, Statistics, Mathematics, Finance or related field.</li>\n<li>Experience in statistical modeling and the collating processes necessary to create modeling data.</li>\n<li>Competence in using the various analytic and reporting tools available for medium to large date sets (e.g., SAS, Enterprise Guide, R, Python, MS Office).</li>\n<li>Proven flexibility and adaptability in effectively driving results.\n<br><br>\n#KRT\n<br><br>\n<em>Horizontal Integration is proud to be an Equal Opportunity and Affirmative Action Employer. We seek to provide employment opportunities to talented, qualified candidates regardless of race, color, sex/gender including gender identity and/or expression, national origin, religion, sexual orientation, disability, marital status, citizen status, veteran status, or any other protected classification under federal, state or local law.</em>\n<br><br>\n</li></ul>\n\nIn addition, Horizontal Integration will provide reasonable accommodations for qualified individuals with disabilities. If you need to request a reasonable accommodation in order to complete the application or interview process, please contact hr@horizontalintegration.com.\n<br><br>\n<em>\n<br>\nAll applicants applying must be legally authorized to work in the country of employment.</em></div>\n</div>\n<br>"}