{"job title": "Senior Data Analyst - Ad Systems", "company": "AdColony", "city state": "– Bellevue, WA, US", "rating": "2.3", "job description": "<div>\nAs <strong>Senior Data Analyst</strong> for<strong> Ad Systems,</strong> you are a passionate and experienced data navigator and information storyteller. You turn data into information, information into insight and insight into business recommendations that the business will use to drive decisions. You'll partner with the Product and Engineering teams to develop new processes for measuring and reporting on business KPIs based on system changes, data experiments, and overall system health.</div><br>\n<div>\nAs a technical-creative, you will dissect ambiguous data reports to help identify anomalies, patterns, and trends. Communication across teams is integral to the company, and your attention to detail, accuracy, and timely reporting will be essential to production. Your expertise both in the technical tools and business applications will position you as a natural leader and consultant in our Product and Engineering teams.</div><br>\n<div>\nWith an SDK footprint of over 1.3 billion users globally, AdColony has built an Ad Server Platform that runs at high scale and generates tremendous volumes of data. The Ad Server Platform receives requests from our mobile ad SDK and server-to-server ad exchanges communicate with our data science engine to predict the quality of users and respond with a relevant ad, all within very tight latency constraints.</div><br>\n<div>\nYou will utilize experience with cloud-based data stores (<strong>Google Big Query, S3, Amazon Redshift, HDFS</strong>) to work with big data in an agile development environment. You'll monitor certain systems, features, and/or KPIs according to a fixed schedule (hourly, daily, weekly), analyze results, and report on a daily basis. Youll further analyze and summarize data to report at different levels of granularity on a weekly, monthly, and quarterly cadence.</div><br>\n<div>\nIn this critical role, you will drive full lifecycle analysis to include requirements, activities and experiment design. You will develop analysis and reporting capabilities, and you will monitor performance and quality control plans to identify improvements.</div><br>\n<div>\n<strong>\n<br>\nResponsibilities</strong></div><div>\nDevelop processes to Interpret data, analyze results use statistical techniques to provide ongoing reports</div>\n\n<ul>\n\n<li>\nLead efforts to unify our data reporting and promote one source of truth</li>\n<li>\nDevelop and implement databases, data collection systems, data analytics and other strategies that optimize statistical efficiency and quality</li>\n<li>\nAcquire data from primary or secondary data sources and maintain databases/data systems</li>\n<li>\nIdentify, analyze, and interpret trends or patterns in complex data sets</li>\n<li>\nFilter and clean data by reviewing computer reports, printouts, and performance indicators to locate and correct code problems</li>\n<li>\nWork with management to prioritize business and information needs</li>\n<li>\nDrive new process improvement opportunities</li>\n</ul>\n\n<br>\n<div>\n<strong>\n<br>\nQualifications</strong></div><div>\n<strong>Minimum Qualifications</strong></div>\n\n<ul>\n\n<li>\nBachelors degree or foreign equivalent in Mathematics, Statistics, Economics, Information Management, related fields or equivalent practical experience.</li>\n<li>\nAdept at SQL queries, report writing and presenting findings</li>\n<li>\nExperience working with engineering, sales and marketing teams in cloud computing or related technical fields.</li>\n<li>\nExperience as an analyst.</li>\n<li>\nStrong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy</li>\n</ul>\n\n<div>\n<strong>Preferred Qualifications</strong></div>\n\n<ul>\n\n<li>\nProven working experience as a data analyst or business data analyst</li>\n<li>\n7+ years of industry experience with technical subjects and emerging technologies working with data, analyzing, and reporting results.</li>\n<li>\nTechnical expertise regarding data models, database design development, data mining and segmentation techniques</li>\n<li>\nStrong knowledge of and experience with reporting packages (Business Objects etc), databases (SQL etc), programming (XML, Javascript, or ETL frameworks)</li>\n<li>\nKnowledge of statistics and experience using statistical packages for analyzing datasets (Excel, SPSS, SAS etc)</li>\n<li>\nAbility to craft a compelling message and tailor it for a given audience. Ability to blend technical topics with simple, everyday language to deliver a story that is memorable and useful.</li>\n<li>\nComfortable talking about technical matters with business people and business matters with technical people. Able to express complex concepts in plain language to reach broader audiences.</li>\n</ul>\n\n<br>\n<div>\n<strong>Perks and Benefits</strong></div>\n<br>\n<div><strong>At AdColony, we believe that the health of our company mirrors the health and happiness of our people. Accordingly, our employees enjoy:</strong></div><ul>\n<li>\nA competitive compensation package with performance-based bonus incentives</li>\n<li>\nThe opportunity to make meaningful contributions from day one</li>\n<li>\nA strong company culture where contributions are recognized and achievements are celebrated</li>\n<li>\nGreat Medical, Dental, Vision, Life, and AD&amp;D insurance</li>\n<li>\nA 401(k) program with employer match</li>\n<li>\nWellness/gym stipend</li>\n<li>\nWeekly catered lunches and fully-stocked kitchens with unlimited snacks and drinks</li>\n<li>\nOffice outings and events (i.e. ball games, happy hours, company off-sites, and more)</li>\n<li>\nBest-in-class equipment to work with on a daily basis</li>\n<li>\nAn informal work environment where you will be part of a talented, fun, and collaborative team</li>\n</ul>\n\n<br>\n<div>\n<strong>AdColony Goals</strong></div><div>\nAdColony is on a mission to make mobile advertising experiences more meaningful and rewarding for users, app publishers, and advertisers. Were building a company that cares deeply about the way users encounter and interacts with ads to help them find new apps that theyll enjoy and to connect with brands they value. That is reflected in our company values of transparency, empowerment, one team, and doing the right thing, and were looking for more like-minded people to help us iterate, solve problems, and invent.</div>"}