{"job title": "Data Analyst", "company": "Assent Compliance Inc", "city state": "– Rochester, NY", "rating": "4.4", "job description": "Come join us! Are you a rock-star <strong>Data Analyst</strong> ? Show us!\n<br><br>\nAssent is the leader in cloud-based compliance automation software. We are a rapidly growing, energetic and engaged team with a mission to make the world a better place with our software. As a result of our success and growth we are expanding once again by adding to our Development Team. We are looking for a permanent, full-time <strong>Data Analyst</strong> .\n<br><br>\n<strong>Position Summary:</strong>\n<br><br>\nReporting to the System Infrastructure Manager, the Data Analyst will provide support for processing data within the ACM systems. Primary will be the building of packages to load data into the client ACMs. This role may also provide support to the Service Delivery team providing a view into the customer data.\n<br><br>\n<strong>Key Requirements &amp; Responsibilities:</strong>\n\n<ul>\n<li>Receive, analyze and prepare client bill of materials and supplier lists;</li>\n\n<li>Build the appropriate SSIS package to load the data to client database;</li>\n\n<li>Load the data into development systems and production systems;</li>\n\n<li>Provide reporting to SD team as required either using office tools or SSRS;</li>\n\n<li>Provide support to migration of data between client systems and the Assent Master database;</li>\n\n<li>Managing a high volume of routine tasks;</li>\n\n<li>Provide data support to other divisions of Assent, including Sales &amp; Marketing</li>\n</ul>\nReasonable Accommodations Statement: To perform this job successfully, an individual must be able to perform the aforementioned duties and responsibilities satisfactorily. Reasonable accommodations may be made to enable qualified individuals with disabilities to perform these essential functions.\n<br><br>\n<strong>Your Knowledge, Skills and Abilities:</strong>\n<br>\nWe strongly value your talent, energy and passion. It will also be valuable to Assent if you have the following qualifications:\n\n<ul>\n<li>Excellent oral and written communication skills in English;</li>\n\n<li>A University, College and/or Post Graduate Certificate;</li>\n\n<li>3+ Years of experience in analyzing data;</li>\n\n<li>3+ years of experience with Microsoft SQL Server and SQL Server Integration Services;</li>\n\n<li>You are proficient in the use of MS Office Suite and Google Applications;</li>\n\n<li>You are incredibly organized and can suggest, implement, and support efficient and effective operations;</li>\n\n<li>You are diligent and detail-oriented- you pay high attention to detail and you double-check everything;</li>\n\n<li>You are highly adaptable and flexible- you thrive in a fast-paced, ever-changing environment;</li>\n\n<li>You have a strong work ethic- you are self-motivated and are always ready to lend a helping hand;</li>\n\n<li>You are able to juggle multiple priorities to conduct multiple activities for multiple people;</li>\n\n<li>You are a critical thinker and will always work towards providing solutions over excuses.</li>\n</ul>\nAn equivalent combination of education and experience, which results in demonstrated ability to apply skills will also be considered.\n<br><br>\n<strong>What We Offer:</strong>\n<br><br>\nAssent endeavors to build an engaged, energetic and excited workforce as we grow into one of Ottawas and Canadas best employers. Our culture is integral to our success. We provide the programs and rewards that one would expect from a highly successful and growing technology company in Ottawa.\n<br><br>\nWe invite interested applicants to forward their detailed resume.\n<br><br>\nAssent is an equal opportunity employer. All applicants will need to fulfill the requirements necessary to obtain a background check."}