{"job title": "Data Analyst", "company": "Beacon Hill Staffing Group, LLC", "city state": "– Los Angeles, California", "rating": "4.5", "job description": "One of our clients in Los Angeles area is looking for a Data Analyst with the following skills and experience:\n<br><br>\n<strong>JOB SUMMARY</strong>\n<br><br>\nHighly organized, motivated individual with comprehensive understanding of Distribution Licensing, advanced Excel skills, and working knowledge of databases.\n<br><br>\n<strong>KEY RESPONSIBILITIES</strong>\n<ul>\n<li>Compile high volumes of material data sets in Excel. Map, migrate, and validate data sets in system. Accountable for the integrity of all sales data in database.</li><li>Audit deal terms of licensed product in the system and reconcile against the license agreement.</li><li>Assist with pre/post sale activity. Extract material deal points and create ad-hoc reports (targeted packages of available product, strategically selected for a particular licensee) and initial deal structure for the sales team.</li><li>Review counter offers and revise the deals accordingly for the sales team.</li><li>Maintain option trackers for all active deals. Prepare and distribute notices.</li></ul>\n\n<ul>\n<li>Provide Sales team with a comprehensive avails/status of licensed content to maximize sales avails and future sales opportunities.</li></ul>\n\n<ul>\n<li>Review and approve monthly invoice entries.</li></ul>\n\n<ul>\n<li>Interact with Sales executives, Legal, Operations, Finance and Accounting on a frequent basis</li><li>One-off analytic projects as required.</li>\n</ul>\n<strong>REQUIRED SKILLS &amp; ABILITIES</strong>\n<ul>\n<li>Strong database and project management skills.</li><li>Advanced Excel skills required. Experience with data manipulation and Excel formulas (Date functions, V-lookup, Pivot Tables, etc).</li><li>Comprehensive understanding of underlying distribution rights and music rights, coupled with strong analytical skills to be able to perform analysis of exclusive vs. non-exclusive grant of rights, exclusivities, restrictions/holdbacks.</li><li>Excellent oral and written communication skills for interaction with legal team and sales staff.</li><li>Self-starter with ability to prioritize. Excellent time management skills.</li><li>Ability to multi-task doing analytical, detail-oriented, high volume work, in support of multiple teams</li>\n</ul>\nInterested candidates may submit their resumes online or call at 310-906-4780 for further information regarding the position.\n<br><br>\nFind Us on Facebook!\n<br><br>\nFollow Us on Twitter!\n<br><br>\nBeacon Hill is an Equal Opportunity Employer that values the strength diversity brings to the workplace. Individuals with Disabilities and Protected Veterans are encouraged to apply.\n<br><br>\n<strong>Company Profile:</strong>\n<br><br>\nBeacon Hill Technologies, a premier National Information Technology Staffing Group, provides world class technology talent across all industries on a contract, direct (permanent), contract-to-direct and project basis. Beacon Hill Technologies' dedicated team of recruiting and staffing experts consistently delivers quality IT professionals to solve our customers' technical and business needs.\n<br><br>\nBeacon Hill Technologies covers a broad spectrum of IT positions, including Project Management and Business Analysis, Programming/Development, Database, Infrastructure, Quality Assurance, Production/Support and ERP roles.\n<br><br>\nLearn more about Beacon Hill Staffing Group and our specialty divisions, Beacon Hill Associates, Beacon Hill Financial, Beacon Hill HR, Beacon Hill Legal, Beacon Hill Pharma and Beacon Hill Technologies by visiting www.beaconhillstaffing.com.\n<br><br>\nWe look forward to working with you.\n<br><br>\nBeacon Hill. Employing the Future"}