{"job title": "Data Analyst", "company": "Cisco Systems", "city state": "– San Francisco, California", "rating": "4.0", "job description": "<div>Cisco Meraki is revolutionizing the way IT administrators manage their infrastructure by providing simple and secure cloud-managed solutions. With a large install base of customers and rich, multi-dimensional data sets, the potential for data science to improve business performance for both our customers and our own business is enormous.\n<br><br>\nWe are searching for a Data Analyst to join our Data Science &amp; Analytics department in San Francisco. This is a growing department that works closely with Executive, Strategy, Product, and Support leadership to drive business impact for Meraki and our customers. You will align with one of these departments, applying rigorous quantitative approaches on our business and product data to drive decision-making.\n<br><br>\nThis is an excellent role if you are looking to build your career in the analytics and data science domain.<br><br><strong>What will you do:</strong>\n\n<ul>\n <li>Prepare regular reporting analyses and dashboards to help your stakeholders track key business metrics, including recommending future courses of action</li> <li>Analyze data to answer strategic business questions – work with stakeholders to define business requirements, pull and clean data, mine it for insights, undertake quality checks, build visualizations, and present results</li> <li>Gain accurate access to additional data sources by delving into Meraki’s data systems and meeting with stakeholders to understand the nuances of our data, how it can be used effectively, and then organize and document findings</li>\n</ul>\n\n<strong>What qualifications you possess:\n<br>\n</strong>\n\n<ul>\n <li>0-2 years of relevant experience</li> <li>Excellent analytical and critical thinking skills</li> <li>Previous experience crafting, implementing, and automating regularly scheduled reports</li> <li>Working proficiency with SQL – joins, aggregate functions, subqueries, etc.</li> <li>Experience in R and/or Python to clean, organize, and mine data (tidyverse, numpy/pandas/matplotlib, etc.)</li> <li>Ability to translate quantitative findings into meaningful insights</li>\n</ul>\n\n<strong>Who you are:\n<br>\n</strong>\n\n<ul>\n <li>You have a real passion for data-driven decision making and desire for continuous learning</li> <li>Desire and persistence to solve challenging problems</li> <li>Keen sense for data accuracy and quality</li> <li>You have strong organizational skills; able to keep track of multiple opposing priorities without losing track of details</li> <li>Ability to communicate the results of analysis</li> <li>You remain curious and hungry to understand all components of your work</li>\n</ul>\n\n<strong>Bonus Points For:\n<br>\n</strong>\n\n<ul>\n <li>Additional experience with programming, data visualization and/or data engineering</li>\n</ul>\nAre you wondering what it is like to work at Cisco Meraki? Picture a breathtaking office, healthy catered meals, fully stocked kitchens, onsite gym and paid time off to volunteer. Meraki Cisco has crafted an amazing equal opportunity focused office where employees thrive. With that said, we are confident you will love it here. Check out more of our benefits on our job page, at https://meraki.cisco.com/jobs, and we look forward to talking with you soon.\n<br><br>\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.</div>"}