{"job title": "Data Analyst", "company": "E3 Federal Solutions", "city state": "– Washington, DC", "rating": "4.4", "job description": "Defense - E3s Defense Division supports customers across the Department of Defense, including the Office of the Secretary of Defense, Department of the Navy, National Guard Bureau, Office of the Inspector General, and Washington Headquarters Services. By providing program assistance and technical innovation to ensure our nations security, E3 employees help our clients navigate through dynamic environments. Our Defense Division offers a variety of career paths, including program management, systems engineering and technical assistance (SETA), financial analysis, operational support, financial analysis, facilities management, and more.<br><br>E3 is seeking a Data Analyst to support Commander Navy Installations Command, Facilities and Environmental Directorate onboard the Washington Navy Yard. The Data Analyst will be responsible for the following:\n<ul>\n<li>Provide Facilities Planning (FP) Analytical support focused on tracking FP funds, project approvals, overall program budget execution tracking</li><li>Track and develop project backlog tracker to identify candidates for end of year funding</li><li>Support the Navy sale and lease program</li><li>Develop, create and update the Data Analysis Solution and Model to assist in validating program requirements</li><li>Compile data and maintain information in various databases</li><li>Query data bases and work independently with business intelligence products.</li><li>Research and transcribe data, run quality control reports, track unfinished reports, print reports, and distribute to appropriate parties.</li></ul>\n\n<ul>\n<li>Master's in related field and minimum 8 years of relevant experience</li><li>Proficient in MS Office Suite applications (Outlook, Word, Excel, Access, Project)</li><li>Experience providing data analytics support to Department of the Navy or Department of Defense organizations (or similar).</li><li>Advanced data management and expert spreadsheet skills to include (VLookup,Forms Management and Creation, Pivot Table creation, Pivot Chart Creation and management) anddatabase query capability (SQL, Microsoft data management products and COGNOS).</li><li>Must be an expert in quantitative methods, business and financial statistics using Microsoft technologies toscrub big data, and produce data visualization products that tell the story that the data analysis provides</li></ul>\n\n<ul>\n<li>Knowledge of Program Budget Information System (PBIS), Standard Accounting, Budgeting and Reporting System (SABRS), Command Financial Management System (CFMS), eProjects, Maximo and other websites and databases</li><li>Familiarity with CNIC Operations</li><li>Balanced ability to manage funding and display trends visually</li>\n</ul>\n\nE3 Federal Solutions (E3) is an award winning Veteran Owned business specializing in helping Federal clients solve their most challenging business problems. Our motivated and technology-enabled workforce utilizes proven management and technical consulting practices and applies agile principles and data-driven decision making to enable our clients to better meet mission requirements. We create significant value for our clients by bringing subject matter expertise across the Federal marketplace in the disciplines of Acquisition Lifecycle Management, Program Management Support Services, Systems Engineering and Technical Assistance, and Facilities and Engineering Management. Excellence, Accountability, Community, Humility and Integrity are the core values of E3 as we become recognized leaders in the management consulting community as trusted partners to Federal agencies and to industry. We are an organization that offers both our employees and clients an exceptional experience; our culture is contagious, and we always maintain a genuine reputation.\n<br>\nAs an Equal Employment Opportunity / Affirmative Action employer, E3 Federal Solutions (E3) is dedicated to making all employment decisions without regard to race, color, sex (including gender and transgender status), age, religion, national origin, disability, marital status, veteran status, registered domestic partner or civil union status, gender identity, medical condition, genetic information, sexual orientation, or any other protected status in accordance with applicable federal, state, and local laws. E3 hires and promotes individuals solely on the basis of their qualifications for the job to be filled.<br><br><strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}