{"job title": "Data Analyst", "company": "Emory", "city state": "– Atlanta, GA", "rating": "3.5", "job description": "JOB DESCRIPTION: Creates and maintains a data dictionary and meta data. Supports efforts to ensure that data standards are developed and maintained. Ensures that the uses of data through reports and queries are accurate. Supports business and system re-engineering and architecture development to define future data needs. Serves as an organizational consultant on matters relating to databases by providing expertise to assist users in meeting their needs.\n<br><br>\nMINIMUM QUALIFICATIONS: Two years of experience in processes and standards related to data OR a bachelor's degree.\n<br><br>\n<strong>Required Qualifications</strong>:\n<br><br>\nMaster’s degree in Epidemiology, Biostatistics, or an equivalent amount of experience to perform statistical analysis of high-throughput biomedical and health data. Experience with analysis of large health science databases. Demonstrated ability to participate in the design, execution, and analysis to study the genomics of human disease in large population-based samples. Demonstrated interpersonal skills and oral and written communication. R and/or SAS programming experience, working knowledge of Unix/Linux file system and environment.\n<br><br>\n<strong>Job Function/Duties:</strong>\n<ul>\n<li>Plan and coordinate the advanced statistical analysis of research projects providing technical expertise in novel and/or revised analytical methodologies and techniques and plan the processing and analysis of research data obtained.</li><li>Design analysis strategies to perform genomic and multi-omic analyses of large population databases. Generate documentation related to analysis. Develop and prepare research goals and/or research work to attain specific goals of various projects.</li><li>Assist in the development of proposals for new funding. Assure compliance with safety programs and institutional review boards. Evaluate research findings and assist in reporting of results to sponsoring agencies. Assist in preparation of progress reports for funding agencies.</li> <li>Co-author research papers and manuscripts for publication and collaborate in the development of posters and data presentations at conferences and workshops.</li>\n</ul>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}