{"job title": "Data Analyst", "company": "General Dynamics", "city state": "– USA--AR-Little Rock", "rating": "3.2", "job description": "Job Description<br><br>General Dynamics Information Technology (GDIT), a leading provider of systems engineering, integration, IT service operations and support solutions, is seeking talented professionals to deliver valuable services and solutions to our customers.\n<br><br>\nGDIT has a great team consisting of experienced and knowledgeable managers who lead and support the career development objectives of our employees. Our employees consider the company to be a solid partner in their career, with an abundance of opportunities for advancement.\n<br><br>\nWe are seeking a Data Analyst:\n\n<ul>\n\n <li>Performs data analysis, interpretation and management duties. Develops rules and methodologies for data collection and analysis.</li> \n\n<li>Performs data collection, analysis, interpretation and management duties.</li> \n\n<li>Develops rules and methodologies for data collection and analysis.</li> \n\n<li>Ensures the integrity of project data, including data extraction, storage, manipulation, processing and analysis.</li> \n\n<li>Consults with the external clients and internal staff to determine data management needs and objectives.</li> \n\n<li>May be responsible for database design, administration, security, and maintenance.</li> \n\n<li>Prepares presentations that reflect the results of the data analysis.</li> \n\n<li>Provides data-related training to staff.</li> \n\n<li>Coordinates with scientists and other technical experts to design and develop statistical analyses methodologies.</li> \n\n<li>Maintains current knowledge of relevant technologies as assigned.</li> \n\n<li>Participates in special projects as required.</li>\n</ul>\n\n<strong>Education</strong>\n\n\n<ul>\n\n <li>Bachelors Degree in a Computer Science, Statistics or a related technical discipline, or the equivalent combination of education, technical certifications or training, or work experience.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n\n <li>2-5 years of related statistics/data analysis experience.</li> \n</ul>\nFor more than 50 years, General Dynamics Information Technology has served as a trusted provider of information technology, systems engineering, training and professional services to customers across federal, state, and local governments, and in the commercial sector. Over 40,000 GDIT professionals deliver enterprise solutions, manage mission-critical IT programs and provide mission support services worldwide. GDIT is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status, or any other protected class."}