{"job title": "Data Analyst", "company": "MarshBerry", "city state": "– Woodmere, OH", "rating": "3.8", "job description": "<strong><u>Data Analyst</u></strong>\n<br><br>\nMarshBerry is currently seeking a Data Analyst for our Beachwood, OH office. The Data Analyst will be responsible for administration of MarshBerry’s proprietary database, assisting with product development and research projects. The Data Analyst enters client data, produces reports, analyzes reports and reviews results with clients. Collaborates with Data Administrators, Senior Data Analysts and Consultants on client projects and enhancements to performance benchmarking reports. Supports the Senior Data Analyst and Senior Vice President of Intellectual Capital with market research, surveys and various data analytics projects.\n<br><br>\n<strong>The main responsibilities include:</strong>\n<ul>\n<li>Serve as project manager for assigned clients and responsible for data collection, formatting and report generation on a quarterly or annual basis.</li><li>Answer client inquiries regarding Intellectual Capital products and services.</li><li>Extract data and generate reports for special requests and projects.</li><li>Establish and maintain positive client relationships.</li><li>Assist with market research, surveys, client presentations, and various data analytics projects.</li><li>Assist with product development and enhancements to MarshBerry products &amp; services.</li><li>Develop and update procedures on a continual basis.</li><li>Analyze client data and perform consulting calls with clients.</li><li>Qualify leads through reactive methods to introduce our services and opportunities.</li><li>Provide guidance to Analysts and Consultants on formatting of accounts, calculations of ratios, etc.</li><li>Train new Data Administrators and Interns in Intellectual Capital processes and knowledge.</li><li>Completes projects in desired time frame utilizing prioritization skills to keep multiple projects progressing on target.</li><li>Special projects and other tasks as assigned.</li>\n</ul>\n<strong>Qualifications we are seeking:</strong>\n<ul>\n<li>Bachelor’s Degree in Business, Accounting, Finance, Economics or Mathematics preferred or equivalent combination of education and experience.</li><li>At least 1 – 3 years of prior relevant experience including experience collecting and analyzing data.</li><li>High level of computer and software competency; proficient with database administration and infrastructure. Proficient in Microsoft Office Word, Excel, Access and PowerPoint.</li><li>Analytical, proactive problem solving skills; techniques to identify and resolve issues in a timely manner, gathers and analyzes information skillfully.</li><li>Confidentiality; maintains confidentiality of proprietary information and that of clients.</li><li>Strong communication skills; both written and verbal with demonstrated creativity with regard to work. Excellent spelling, grammar as well as good phone skills.</li><li>Exceptional organizational skills; using systematic methods to perform work and creativity to recommend or create new work methods or procedures.</li><li>Ability to multi task; able to complete projects and responsibilities with extreme attention to detail according to required timelines and deadlines, along with capacity to work under pressure to create accurate results, demonstrating accuracy and thoroughness and monitors works to ensure quality.</li><li>Limited overnight travel as needed.</li>\n</ul>\n<strong>About MarshBerry:</strong>\n<br><br>\nMarsh, Berry &amp; Company Inc. (MarshBerry) was founded in 1981 to provide consulting services in the financial services industry primarily to independent insurance agents, brokers and carriers. MarshBerry’s services include but are not limited to financial, operational, sales management, merger and acquisition advisory, peer-to-peer exchange and information services. We are primarily a domestic company with clients throughout all 50 states and have been the leading advisor for insurance broker merger and acquisition deals each year for more than a decade.\n<br><br>\nWe are recognized in the insurance industry for providing innovative and customized solutions to our clients. Our mission is to help our clients learn, improve and realize their value. Our clients credit us for providing the vision, tools, and discipline to help them reach their strategic goals.\n<br><br>\nOur team of talented and driven employees has made us the successful, growing company we are today. MarshBerry strives to provide an environment where employees can learn, improve and realize their career goals. We offer our employee’s competitive benefits, new challenges, learning experiences and ownership opportunities.\n<br><br>\nTo learn more about MarshBerry, visit www.marshberry.com."}