{"job title": "Data Analyst", "company": "Marys Center For Maternal and Child Care", "city state": "– Washington, DC, DC", "rating": "3.3", "job description": "<div><div><div><div></div></div></div><div><div>Description</div></div><div><div> <div>The Data Analyst is responsible for running routine quality and outcomes reports, responding the requests for data, producing routine patient panels for chronic disease management as well as grant reporting. This position requires strong excel skills, including creating and using complex formulas and manipulating large datasets.\n<br><br>\n<strong>ESSENTIAL DUTIES &amp; RESPONSIBILITIES:</strong>\n<br><br>\n<em>Include the following. Other duties may be assigned.</em>\n\n<ul>\n\n\t<li>Runs routine quality and outcomes reports by scheduled due dates, validates and analyzes data, sends data to staff responsible for programs.</li>\n\n<li>Prepares patient panels for chronic disease management and group care</li>\n\n<li>Produces quality, outcome and utilization data related to chronic disease management and group care and coordinates with group care team on data needs</li>\n\n<li>Manages health maintenance reminder messages</li>\n</ul>\n<strong><u>Competencies:</u></strong>\n<br><br>\nTo perform the job successfully, an individual should demonstrate the following competencies:\n\n<ul>\n\n\t<li><strong>Teamwork</strong> – Contributes to building a positive team spirit; Puts success of the team above own interests; Supports everyone’s efforts to succeed; Must be able to work well in multidisciplinary team setting.</li>\n\n<li><strong>Interpersonal Skills</strong> – Focuses on solving conflict in cooperative manner; Must have excellent written and verbal communication skills.</li>\n\n<li><strong>Cost Consciousness –</strong> Contributes to profits and revenue.</li>\n\n<li><strong>Computer Competency-</strong> Shows ability to utilize technology to meet the requirements of the position<strong>.</strong></li>\n\n<li><strong>Diversity</strong> – Shows respect and sensitivity for cultural differences.</li>\n\n<li><strong>Ethics</strong> – Treats people with respect.</li>\n\n<li><strong>Organizational Support</strong> – Follows policies and procedures.</li>\n\n<li><strong>Professionalism</strong> – Treats others with respect and consideration regardless of their status or position.</li>\n\n<li><strong>Safety and Security</strong> – Observes safety and security procedures; Reports potentially unsafe conditions; Uses equipment and materials properly.</li>\n\n<li><strong>Attendance/Punctuality</strong> – Is consistently at work and on time, which is pre-determined between the employee and the person(s) he/she reports to.</li>\n\n<li><strong>Dependability</strong> – Follows instruction and responds to management direction; Takes responsibility for own actions; Commits to long hours of work when necessary to meet the needs of Mary’s Center’s clients and participants.</li>\n\n<li><strong>Flexibility</strong> - Willingness to be flexible with work schedule to participate in weekend and/or evening schedules as determined necessary.</li>\n</ul>\n\n</div>\n</div></div><div><div>Qualifications</div></div><div><div> <div>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skills, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<br><br>\n<strong>Education and/or Experience –</strong> Undergraduate degree in social science research and evaluation field and/or one to two years’ experience working in a research/evaluation setting. Extensive experience with Microsoft Excel, including creating and using complex formulas and large datasets. Knowledge of Word, and PowerPoint is essential, knowledge of SQL, SPSS, preferred, as well as a thorough understanding and working knowledge of patient/client confidentiality issues and HIPAA compliance/regulations. Knowledge of SQL or Electronic Health Records preferred. Individual must be detail-oriented and able to coordinate multiple tasks at once.\n<br><br>\n<strong>Reasoning Ability –</strong> Ability to apply common sense understanding to carry out moderately complex, multi-step instructions and make appropriate independent decisions as necessary\n<br><br>\n<strong>Physical Demands –</strong> Regularly required sitting; frequently required to reach with hands and arms, walk, stoop, kneel, crouch, talk or hear; must be able to lift objects up to twenty-five (25) pounds. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<br><br>\n<strong>Work Environment –</strong> Mostly in a typical office setting with quite to moderate noise level. May be exposed to wet and/or humid conditions. Individual may be exposed to cold and heat due to outside weather conditions.</div></div></div></div>"}