{"job title": "Data Analyst", "company": "MHR Partners", "city state": "– Englewood, CO, US", "rating": "NA", "job description": "<div>\n<strong>\n<br>\nJob Duties and Responsibilities</strong>\n</div>\n<br>\n<div>\nWork hands-on with systems and enterprise data to identify and prevent fraud. As a member of the Information Security group (InfoSec), work closely with Enterprise Data Warehouse (EDW) and other business units within to gather fraud-relevant data and maintain the data for analysis. Prepare data quality analysis (DQA) artifacts, including data profiles and recommendations used in the analysis and interpretation of data as appropriate. Ensure quality control of databases through the development and maintenance of test plans and quality control procedures. The ideal candidate will be a self-starting individual who is able to dive into details and quickly provide summary level readouts and have creative ideas in displaying data.</div>\n<br>\n<div><strong>Primary responsibilities for the position include:</strong></div><ul>\n<li>\nWork closely with EDW personnel to gain working knowledge of enterprise systems and leverage enterprise data to help identify fraud patterns and contribute towards ideas for prevention.</li>\n<li>\nConsume data from multiple sources and create an analysis process to identify when fraud patterns are observed. Data sources include Teradata, RedShift, SQL and Hadoop. Most data collection will be driven by ETL and SSIS development.</li>\n<li>\nMaintain fraud-relevant database(s) in SQL and/or RedShift and create new data structures as necessary. As data points are identified that are be determined to be indicative of fraud, create new tables and data collection processes.</li>\n<li>\nCustom development of scripts, ETL jobs, and SSIS packages.</li>\n</ul>\n\n<div>\n<strong>\n<br>\nSkills - Experience and Requirements</strong>\n</div><br>\n\n<div><strong>A successful Data Analyst will have:</strong></div><ul>\n<li>\nAn interest in fraud prevention and be able to take on the mindset of thinking like a bad guy.</li>\n<li>\nSelf-discipline and a strong desire to succeed, as much of your work will be done independently.</li>\n<li>\nStrong communication skills. Fraud Prevention is a growing group and requires interaction with many other groups to develop new processes.</li>\n<li>\nBachelor's degree from four-year College or University; or two years related experience within an IT Department, preferably within a Data Warehouse / Business Intelligence Team and/or equivalent combination of education and work experience.</li>\n<li>\nExtensive experience in data analysis and creating data sets from multiple source systems.</li> \n<li>\nStrong SQL skills. ETL and SSIS experience is necessary. Experience with Teradata, Netezza, Redshift, Oracle, MS SQL Server, are highly desired.</li>\n<li>\nPrevious experience working within the Telco/Cable/Satellite industry a definite plus.</li>\n</ul>"}