{"job title": "Data Analyst", "company": "Nippon Life Benefits", "city state": "– New York, NY", "rating": "NA", "job description": "Job Description<div><strong>Position Purpose:</strong>\n<br><br>\nProvide financial reporting, valuation, business plan projection and analytical and business support to the actuarial department.\n<br><br>\n<strong>Nature and Scope of Responsibilities:</strong>\n<br><br>\n<em><strong>Financial Support &amp; Reporting</strong></em>\n<ul>\n\n<li>Produce reliable actuarial reports using both internal and external databases on a scheduled and ad hoc basis including but not limited to:</li>\n</ul>\n\n<ul>\n\n<li>Compliance Reporting</li>\n<li>Management Reporting</li>\n<li>Statutory Reporting</li>\n</ul>\n\n<ul>\n\n<li>Assume a leading role in development, testing, and loading of the company-wide Data Warehouse.</li>\n<li>Serve as a subject matter expert on functionality, content and data elements of data sources and reports.</li>\n<li>Design, program, maintain, and produce ongoing production reports.</li>\n<li>Improve and streamline the current reporting process and enhance reporting efficiency</li>\n<li>Create controls to enhance data reconciliation, validations, and the peer review process.</li>\n<li>Work with the IT Department and third party administrators on an ongoing basis to ensure quality data reporting.</li>\n<li>Help bring the current statutory and compliance reporting process into compliance with the NAIC Model Audit Regulation</li>\n<li>Other duties as assigned by the Chief Actuary</li>\n\n</ul>\n<strong><em>Support Corporate Actuarial Function</em></strong>\n<ul>\n\n<li>Assist with modeling required to support the Appointed Actuary’s annual statement of actuarial opinion and associated memorandum.</li>\n<li>Update monthly and quarterly claims and premium reports to support valuation and assist in experience reporting.</li>\n<li>Other duties as assigned by the Chief Actuary</li>\n\n</ul>\n<em><strong>Support the Group Segment Accounting Process</strong></em>\n<ul>\n\n<li>Assist with loading data into the accounting system tables, e.g. group investment allocation entries, group and corporate segment quarterly transfers</li>\n<li>Other duties as assigned by the Chief Actuary</li>\n\n</ul>\n<strong>Qualifications / Requirements:</strong>\n<ul>\n\n<li>Bachelor’s degree in Math/Computer Science/Business or equivalent business experience. Actuarial Exams P, FM, M(LC) a plus, but not required.</li>\n<li>3-6 years of work experience in performing analytics in the Health Insurance Industry using claims, premium, and enrollment data.</li>\n<li>At least 1-2 years of SQL server, query, and relational database design. Ability to work with Cubes a plus.</li>\n<li>Excellent analytical/advanced level database and spreadsheet experience.</li>\n<li>Excel, Access, and SQL a must, Visual Basic Applications a plus.</li>\n<li>Proficiency in MS Office products (Word, PowerPoint &amp; Outlook)</li>\n<li>Ability to work independently; excellent problem solving skills.</li>\n<li>Strong communication, time management, organization, and interpersonal skills</li>\n\n</ul>\n<br><br>\n<strong>Competencies:</strong>\n<ul>\n\n<li><strong>Professionalism</strong> - Approaches others in a tactful manner; Reacts well under pressure; Treats others with respect and consideration regardless of their status or position; Accepts responsibility for own actions; Follows through on commitments.</li>\n<li><strong>Judgment</strong> - Displays willingness to make decisions; Exhibits sound and accurate judgment; Supports and explains reasoning for decisions; Includes appropriate people in decision-making process; Makes timely decisions.</li>\n<li><strong>Teamwork</strong> - Balances team and individual responsibilities; Exhibits objectivity and openness to others' views; Gives and welcomes feedback; Contributes to building a positive team spirit; Puts success of team above own interests; Able to build morale and group commitments to goals and objectives; Supports everyone's efforts to succeed.</li>\n<li><strong>Analytical</strong> - Synthesizes complex or diverse information; Collects and researches data; Uses intuition and experience to complement data; Designs work flows and procedures.</li>\n</ul></div>\n<br>"}