{"job title": "Data Analyst", "company": "Omnigon", "city state": "– Los Angeles, CA", "rating": "3.2", "job description": "This person will create and maintain source to target designs and mappings, provide detailed data analysis, and manage metadata in support of the development and/or implementation of new or enhanced systems projects or programs. The Data Analyst works with subject matter experts from the project team to determine data requirements for analytical systems, develop these requirements into functional specifications and detailed data flow design documents, and participates in the full development process life-cycle from concept, through testing, to implementation. This includes identifying necessary data, reconciling with the new application and the legacy data sources and ensuring a successful implementation. This will include communicating business term definitions, establishing data quality rules, researching and analyzing data in support of business functions, process and workflow knowledge, and user acceptance testing.\n<br><br>\n<strong>This is a contract position.</strong>\n<br><br>\n<strong>Responsibilities</strong>:\n\n<ul>\n<li>Own the design, development, validation, and maintenance of ongoing metrics, reports, analyses, dashboards, etc. to drive key business decisions</li>\n<li>Develop and maintain the Core Data Dictionary and MDM</li>\n<li>Conduct hands-on modeling/analytics retrieving, compiling, and analyzing large volumes of data from disparate databases into distilled, actionable information and insights</li>\n<li>Develop and own business intelligence dashboards for operational aspects of the business</li>\n<li>Analyze data, including utilization, turns, lifetime value and profitability</li>\n<li>Supports data engineering team to help define business metrics and to close data gaps in our data warehouse</li>\n<li>Collaborate with data scientists to help build advanced analytical models</li>\n<li>Find ways to use data to empower team members across the business to take action in real time</li>\n</ul>\n<strong>Qualifications/Requirements</strong>:\n\n<ul>\n<li>3-5 years of experience as a data analyst, preferably with an entertainment or digital media company</li>\n<li>Exceptional analytical and quantitative skills with ability to interpret and summarize complex data that drive actionable plans that add value to the business</li>\n<li>Expert in MS Excel</li>\n<li>3-5 years of professional experience using advanced SQL in a cloud data warehouse environment (such as Redshift, Snowflake or Hive), including window functions and CTEs</li>\n<li>Experience with AWS Stack (S3, RedShift, Spectrum, Glue, etc)</li>\n<li>2-3 years of experience with BI tools such as Looker, Tableau or AWS QuickSight</li>\n<li>Bachelor's degree with a major in Math, Statistics, Finance, Economics, etc. is strongly preferred</li>\n<li>Knowledge of various software development processes, including SDLC, Agile methodologies, tools and technologies</li>\n<li>Detail-oriented and exceptional organizational skills</li>\n<li>Excellent verbal and written communication skills with the ability to interact at all levels of the organization</li>\n<li>Experience with Python or R is a plus, but not required</li>\n<li>Experience with Big Data (Hadoop, Spark, EMR, Streams, etc.) is a plus but not required</li> \n</ul>\n<strong>About OMNIGON</strong>\n<br><br>\nOMNIGON is a team of digital strategists, artists and technologists working exclusively in the areas of consumer loyalty, audience growth and digital content delivery. Since its founding in 2008, OMNIGON has established itself as a market leader, focused on helping clients achieve returns on the strategic, creative and technical investments they've made. OMNIGON, headquartered in New York and with teams in Los Angeles, London, Toronto, Kiev and St. Petersburg, works with celebrated, global brands including Fox Broadcasting, Verizon, the PGA TOUR, FC Bayern Munich, AS Roma, the German Football Association (DFB), IRONMAN, NASCAR, World Rugby, the United States Golf Association and countless others."}