{"job title": "Data Analyst", "company": "PLACERS", "city state": "– Elkton", "rating": "5.0", "job description": "Our award-winning manufacturing client in the Elkton and Newark area is seeking a talented data analyst to join their time. This position requires the utilization of a variety of reporting applications in order to analyze the operations and manufacturing performance. Analysis will include communicating trends and opportunities for the operations and manufacturing team.\n<br><br>\nResponsibilities Include:\n\n\n<ul>\n<li>Following SOPs to develop backlog vs. capacity graphs</li>\n\n</ul>\n\n\n\n<ul>\n\n<li>Analyzing and reporting equipment downtime trends</li>\n<li>Identifying and communicating key trends in manufacturing performance to plan</li>\n<li>Entering and recording data into systems and spreadsheets</li>\n<li>Performing additional analyses per the request of the plant operations team</li>\n<li>Learning Work Space Advanced to generate custom reports</li>\n\n</ul>\nQualifications:\n\n\n<ul>\n<li>Two year college degree in a technical discipline</li>\n\n</ul>\n\n\n\n<ul>\n\n<li>Ability to think critically and draw conclusions based on data</li>\n<li>Experienced with Microsoft Office: Excel and Power Point especially</li>\n<li>Experience learning and using new software applications</li>\n\n</ul>\nDesired Qualifications:\n\n\n<ul>\n<li>Previous experience as a data analyst\n<br><br>\nDaily Activities:</li>\n<li>Backlog and capacity graphs twice per week including qualitative assessment (8-16 hours of work per week)</li>\n\n</ul>\n\n\n\n<ul>\n\n<li>Shipments per month including breakout of planned and last minute/expedited shipments (2 hours per week)</li>\n<li>Work Space Advanced traning</li>\n<li>Manufacturing Yields including process and Seam Tape yields (8 hours per week)</li>\n<li>Down time tracking and analysis (8 hours per week)</li>\n\n</ul>\n<strong>Experience</strong>:\n\n\n<ul>\n<li>Data Analysis: 1 year (Required)- Microsoft Office: 3 years (Required)\n<br><br>\n<strong>Education</strong>:</li>\n<li>High school (Required)</li>\n\n</ul>"}