{"job title": "Data Analyst", "company": "PRA Health Sciences", "city state": "– United States-Massachusetts-Boston", "rating": "3.5", "job description": "<strong>Do you want to watch clinical development change, or do you want to be the one to shape it?</strong>\n<br><br>\n<strong>Because we’re hoping you’re here for the latter.</strong>\n<br><br>\n<strong>Who are we?</strong>\n<br><br>\nWe Are PRA.\n<br><br>\nWe are 15,000+ employees strong, operating in more than 85 countries. We are committed to saving lives and we are constantly striving to be the best at what we do. Our impact is real and we see it every single day. We are getting live saving drugs into the hands those who need them most.\n<br><br>\n<strong>Who are you?</strong>\n<br><br>\nYou are a forward thinker. You are an innovator that refuses to settle. You want to push the boundaries and change not just what it means to be an Data Analyst, you want to change the future. You want to learn from the best, grow your knowledge and your skill set, and you want to build your career here. You want to use the latest technology and tools in the industry to push the momentum of an already growing company forward. You want to find a balance that still lets you be, well, you. Most of all, you want to do it in a place where you’re more than an employee number. A place you love working.\n<br><br>\nStill here? Good. Because if this is you, we’d really like to meet you.<br><br>Required Experience:\n\n<ul>\n<li>1-3 years’ experience of working in a Global Regulatory Affairs function, demonstrating an awareness of global Regulatory authority procedures.</li>\n</ul>\n\n<strong>Preferred Experience:</strong>\n\n<ul>\n<li>Experience of working with data in RIM systems and performing advanced queries in such systems.</li><li>Experience of working with external data standards (pharmacopeia, standard terms, ISO, MedDRA, etc.).</li><li>Some background in Global Regulatory Affairs as well as understanding of European, US, and international regulations relative to RIM.</li>\n</ul>\n\n<strong>Required Education and Skills:</strong>\n\n<ul>\n<li>High School Diploma/GED required. In lieu of High School Diploma/GED, 4 years of experience in an office environment</li><li>Ability to remain focused while performing repetitive tasks to a high standard of quality</li><li>Good understanding of general IT tools (Microsoft Office, Window’s Explorer, file management, etc.)</li><li>Good understanding of Microsoft Excel</li><li>An awareness of database principles (e.g., entity relationships, referential integrity)</li><li>Ability to work accurately and efficiently in a pressured environment whilst continuing to meet tight deadlines</li><li>Ability to work autonomously with appropriate guidance from management</li><li>Excellent listening, presentation, communication and time management skills</li><li>Excellent team working and interpersonal skills</li><li>Excellent spoken and written English</li><li>High attention to detail</li>\n</ul>\n\nTo qualify, applicants must be legally authorized to work in the United States, and should not require, now or in the future, sponsorship for employment visa statusPRA is an EEO/AA employer and is committed to providing opportunities to minorities, women, veterans and individuals with disabilities.\n<br>\nWhat will you be doing? Overview:The Data Analyst is part of the Regulatory Information Management (RIM) team and it is your responsibility to ensure that data stored and maintained in the Global Regulatory Affairs (GRA) RIM environment is current, accurate, reliable, and generally fit for purpose at any given point in time. The function secures the integrity of data that is used internally for business intelligence / reporting purposes, and externally to comply with global Regulatory agency information requests and obligations. This function acts as the custodian of GRA’s information management landscape, and will input to / align with Global Master Data Management strategies as appropriate. The Data Analyst role is focused on maintenance of key Regulatory Information as required by the business. Responsibilities:\n\n<ul>\n<li>Develops a good understanding of the RIM system and reports from the system to enable them to update the data.</li><li>Develops a good understanding of other GRA systems to the level needed to perform the role.</li><li>Works with RIM (Snr) Information Analysts to ensure data supplied to RIM is in accordance with data standards &amp; governance.</li><li>Works thoroughly and consistently through the allocated work load to ensure complete and accurate entry/ loading of data/ documents into GRA systems.</li><li>Ensures that data is entered into the company’s GRA system(s) in accordance with processes and data quality standards as documented in the relevant Job Aids / WIs / Data Governance Plan.</li><li>Consults within SIM and with information suppliers to resolve ad-hoc quality issues and queries on the data/ documents provided.</li><li>Applies business rules consistently and in line with relevant Job Aids / WIs; raises all exceptions to RIM (Sr.) Information Analysts for resolution.</li>\n</ul>\n\nPRA Health Sciences"}