{"job title": "Data Analyst", "company": "QuEST Global", "city state": "– Windsor Locks, CT", "rating": "2.9", "job description": "Job Description<div>Data Analyst\n<br><br>\nJob Responsibilities\n<br><br>\nData analysis and reporting for supplier performance, new orders, commitments of parts, overdue parts, and turnbacks.\n<br><br>\nGather and maintain data. Pull raw data and convert it into a presentable, usable format.\n<br><br>\nUpdate daily, weekly and monthly reports by gathering data, and analyzing meaning of the data. Reports are typically in MS Powerpoint.\n<br><br>\nParticipate in data audits\n<br><br>\nRequirements\n<br><br>\nA.S degree in business or technical field\n<br><br>\n2+ years-experience in data analytics\n<br><br>\nSkilled in MS Excel\n<br><br>\nSkilled in MS Powerpoint\n<br><br>\nAs the job is in an engineering environment, some exposure or interest in the engineering field preferred\n<br><br>\nExperience in supply chain a plus\n<br><br>\nSAP experience a plus</div>Company Description<div>QuEST is driven by the unlimited potential of engineering to bring new possibilities, new experiences, and even new hope into the homes, communities, and daily lives of the people around us.\n<br><br>\nWe help pioneer the future of flights that are safer, faster, and reliable by streamlining engineering and manufacturing processes and innovating efficiencies that help our clients lead the way in the marketplace.\n<br><br>\nWe are leaving cleaner air in our wake by partnering with manufacturers to design and introduce the next generation of greener, super-efficient Aero Engines.\n<br><br>\nWe are advancing technologies that help make self-driving cars reliable and affordable.\n<br><br>\nWe help oil producers find the competitive edge they need to sustain success in the digital oil fields with asset-optimization. We are innovating ways to make renewable energy affordable and the world around us more liveable.\n<br><br>\nWe are advancing the surveillance and data technologies to pioneer new ideas that provide expertise on-site and on-the-job worldwide.\n<br><br>\nWe partner with the world’s leading medical device manufacturers to improve outcomes by accelerating innovations that empower doctors with the timely advantage.\n<br><br>\nWe are a global team of passionate engineers engaging with leading, innovation-driven Fortune 500 brands.\n<br><br>\n“What’s next?” That’s the question we ask ourselves every day.\n<br><br>\n<strong>WHAT’S THE NEXT CHALLENGE, THE NEXT INNOVATION, THE NEXT TRANSFORMATIONAL IDEA THAT WILL ADVANCE AND IMPROVE THE HUMAN CONDITION — AND ABOVE ALL, WHAT CAN WE DO TO HELP DRIVE IT?</strong>\n<br><br>\nThis is the mindset that motivates everything we do for the indispensable companies we count as our partners. Every day, we’re helping these companies realize their vision to elevate the ways people live, work, travel, relax, and engage with each other and world at large. And we welcome the opportunity to do the same for you.\n<br><br>\nCREATE THE FRONTIER.</div>"}