{"job title": "Data Analyst", "company": "Rose International", "city state": "– Littleton, CO", "rating": "4.4", "job description": "<div>Position Title: Data Analyst</div> \n<br>\n<div>Position Number: 295279</div>\n<br>\n<div>Location: Littleton, CO</div><br>\n\n<div><strong>Desired Skill Set:</strong></div><div> ETL, SAP, Tableau</div><br>\n\n<div><strong>Position Description:</strong></div><div> **C2C and STEM-OPT are not available**\n\n\n<ul>\n<li>*Only U.S. Citizens and those authorized to work in the U.S. can be considered as W2 candidates.**</li>\n</ul>\n\nTitle: Data Analyst - Level 2\n<br>\nWork Location: LITTLETON/WATERON, CO\n<br>\nContract-6 months\n<br><br>\n<strong>Job Description:</strong>\n<br>\nThis is a data engineering position, which will be primarily responsible for working with project managers/leads to develop database views, data modeling requirements, as well as functional and technical documentation. They will need to understand the existing legacy code and convert it into corresponding HANA models, using best practices. Will also need to participate in all levels of testing, including integrated testing, performance testing, security testing, and user acceptance testing. Required to apply best practices and recommend solutions by identifying the advantages and disadvantages of the proposed solutions. Applicant must have excellent oral and writing communication skills.\n<br><br>\n<strong>Mandatory Skills:</strong>\n\n\n<ul>\n<li>SQL Development</li>\n<li>STRONG SAP HANA Data Modeling, Building Views, Creating Stored Procedures and Table Function</li>\n<li>STRONG SAP HANA Performance Analysis</li>\n<li>ETL (e.g. SAP Data Services)</li>\n</ul>\n\n<strong>Desired Skills:</strong>\n\n\n<ul>\n<li>Celonis</li>\n<li>Tableau</li>\n<li>SAP BOBJ Reports / Web Intelligence</li>\n<li>SAP SLT, SDA and SDI Interface</li>\n<li>SAP ECC on Financial and Controlling and Supply Chain (Operations)</li>\n<li>MS PowerPoint / Presentation Skills</li></ul></div>\n\n\n<div> #CBRose#</div>\n<br>\n<div> \n<div>\nSend me a reminder to complete this application</div>\n </div><br>\n\n<div>\n<strong>Rose International is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender (expression or identity), national origin, arrest and conviction records, disability, veteran status or any other characteristic protected by law. Positions located in San Francisco and Los Angeles, California will be administered in accordance with their respective Fair Chance Ordinances.\n<br><br>\nRose International has an official agreement (ID #132522), effective June 30, 2008, with the U.S. Department of Homeland Security, U.S. Citizenship and Immigration Services, Employment Verification Program (E-Verify).\n<br><br>\n(Posting required by OCGA 13/10-91.)</strong></div>\n<br>"}