{"job title": "Data Analyst", "company": "The Judge Group, Inc.", "city state": "– O Fallon, IL", "rating": "3.6", "job description": "<strong>GENERAL WORK DESCRIPTION:</strong>\n<br>\nThe work required by the Cost Analysis and Program Assessment Task Area of the Comprehensive Financial Service Support (CFSS) supports the client by performing budget execution analysis (comparing budgeted numbers to execution numbers), providing USTRANSCOM customers with timely and accurate cost estimates for their transportation requirements, developing USTRANSCOM billing rates, and answering ad hoc requests. We help the client in each one of these areas by automating where possible and then using our consulting skills to offer business insights.\n<br><br>\n<strong>SKILLS:</strong>\n<br>\nMust possess at least intermediate skills and abilities in the following applications and areas:\n\n\n<ul>\n<li>Microsoft Excel</li>\n<li>Statistical analysis (mean/median/mode, deviations, probability distributions, and regression analysis)</li>\n<li>Problem solving ability which will be evidenced by interview and resume</li>\n<li>Other applications in the Microsoft Suite (e.g., PowerPoint, Word, Access)</li>\n</ul>\n\nJudge Group Job Order ID: 583319\n<br><br>\nSalary: Open\n<br><br>\n<strong>Company Description:</strong>\n<br><br>\nWorking at the crossroads of people and transformative technologies, The Judge Group delivers innovative business solutions powered by top talent to help organizations reach their strategic goals and realize opportunities now and in the future.\n<br><br>\nThe Judge Group is a leading professional services firm specializing in technology, talent, and learning solutions. Our services are successfully delivered through a network of more than 35 offices in the United States, Canada, China, and India. The Judge Group serves more than 40 Fortune 100 companies and is responsible for the placement of more than 4,500 professionals annually across a wide range of industries. To learn more, visit www.judge.com."}