{"job title": "Data Analyst", "company": "United Fire Group", "city state": "– Cedar Rapids, Iowa", "rating": "3.5", "job description": "<strong>Job ID</strong> 2018-1808\n<br>\n<strong># of Openings</strong> 1\n<br>\n<strong>Job Locations</strong> US-IA-Cedar Rapids\n<br>\n<strong>Posted Date</strong> 2018-07-24\n<br>\n<strong>Category</strong> Enterprise Analytics\n<br>\n<strong>Travel</strong> None\n<br>\n<strong>Company Car Provided</strong> No\n<br><br>\n<strong>Overview</strong>\n<br><br>\nUFG offers you an award-winning workplace and a trustworthy, financially stable company. While we've always known our commitment to employees and financial stewardship, it is good to have others recognize our dedicated efforts. We've been named an Iowa Top Workplace by the <em>Des Moines Register</em> for four consecutive years, and included on <em>Forbes'</em> \"America's Most Trustworthy Financial Companies\" every year since 2014. Additionally, UFG is a super-regional property and casualty insurer rated \"A\" (Excellent) by A.M. Best Company.\n<br><br>\nThe UFG Enterprise Analytics Department is focused on delivering strategically-impactful results by building analytically based solutions that integrate a wide range of internal and external data assets. The ultimate objective of the Enterprise Analytics organization is to help UFG gain and maintain a competitive advantage in how it prices risk and identifies potential loss.\n<br><br>\nWe are seeking a Data Analyst to facilitate the development of Analytics solutions in support of UFG's strategic plan. This individual will work closely with business units throughout the organization to develop and implement strategies that leverage data to enable enhanced decision making. The ideal candidate will possess strong technical and communication skills, as well as proven experience in analytics, and information management, and the insurance industry in general.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Interpret data, analyze results using statistical techniques and provide ongoing reports</li><li>Identify, analyze, and interpret trends or patterns in complex data sets</li><li>Prototyping the development of databases, data collection systems, data analytics, and other strategies that optimize statistical efficiency and quality</li><li>Work with management to prioritize business and information needs</li><li>Design and build comprehensive reports/dashboards and other tools to assist business managers in making business decisions</li><li>Support the enterprise data warehouse in identifying and revising reporting requirements</li><li>Train end users on new reports and dashboards</li><li>Research opportunities for data acquisition and new uses for existing data</li><li>Recommend ways to improve data reliability, efficiency and quality</li><li>Collaborate with data architects, modelers and IT team members on project goals</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n<ul>\n<li>BS in Mathematics, Economics, Finance, Computer Science, Information Management or Statistics</li><li>Master's Degree in a quantitative field preferred</li><li>Proven working experience as a data analyst</li><li>Technical expertise regarding data models, data mining and segmentation techniques</li><li>Strong knowledge of and experience with reporting packages (Tableau, etc.) and databases (SQL, etc.)</li><li>Knowledge of statistics and experience using statistical packages for analyzing datasets (SAS, R, Python, etc.)</li><li>Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy</li><li>Adept at queries, report writing and presenting findings</li><li>Ability to translate business requirements into non-technical, lay terms</li><li>Ability to create content rich and concise data visualization outputs for easy consumption by business users</li><li>Experience in methodologies and processes for managing large scale databases</li><li>Demonstrated experience in handling large datasets, structured and semi-structured data formats</li><li>Understanding of star/snowflake schemas as general data warehousing methodologies (i.e. Kimball)</li><li>Strong analytical thinking and verbal communication skills</li><li>Ability to deliver incremental value via an Agile Development Methodology</li><li>P&amp;C Insurance and Consulting experience preferred</li>\n</ul>\nPI104311937"}