'{"job title": "Data Analyst", "company": "22nd Century Technologies", "city state": "– Springfield, IL", "rating": "4.1", "job description": "<br>\n<ul>\n<li>The Ed360 project provides educators with near real-time instructional support using data from the data warehouse.</li>\n</ul>\n<br><br><br><strong>Qualifications:</strong><br>\n<ul>\n<li>Candidate demonstrates experience using Microsoft SQL Server to model data into datasets for consumption of business intelligence software.</li>\n<li>Candidate demonstrates expertise of data administration and management functions (collection, analysis, distribution etc.)</li>\n<li>Candidate demonstrates expertise conducting statistical analyses of data using standard statistical techniques.</li>\n<li>Candidate demonstrates expertise gathering functional specification requirements for the development of dashboards and reports.</li>\n<li>Candidate demonstrates expertise with modern data warehouse and information system technologies.</li>\n<li>Candidate demonstrates experience with data security and privacy by anonymizing datasets.</li>\n</ul>\n<br><strong>Job Responsibilities:</strong><br>\n<ul>\n<li>The Data Analysts will work with the Lead Data Analyst to provide data analysis support of agency initiatives revolving around the data warehouse.</li>\n<li>These projects may include support of Evidence-based Funding, Illinois Report Card, State assessments, Data Quality Dashboard, IL-EMPOWER IBAM rubric, ESSA summative designations, holistic district plans, and Ed360 instructional support.</li>\n<li>The data warehouse team is developing reporting capabilities for the new Evidence-based Funding formula in support of public school districts funding.</li>\n<li>The Illinois Report Card is undergoing a major rewrite to report district and school report cards from the data warehouse.</li>\n<li>State assessment data including PARCC, SAT, KIDS, ISA, ACCESS, and DLM-AA are high-stakes reporting metrics for a number of reporting initiative for the agency and inform education stakeholders of statewide progress.</li>\n<li>The Data Quality Dashboard is a tool developed for districts to review data quality reports in an effort to improve the State's reporting of data.</li>\n<li>The IL-EMPOWER IBAM rubric will be used by districts to assess their needs for IL-EMPOWER school improvement services.</li>\n<li>The ESSA summative designations are used to place schools into groups of similar strengths and opportunities.</li>\n<li>The holistic district plans project is new development to collect and collaborate on strategic planning and coordination of support to prepare students for success.</li>\n<li>The Ed360 project provides educators with near real-time instructional support using data from the data warehouse.</li>\n</ul>\n<br><strong>Systems Environment:</strong><br>\n<ul>\n<li>Currently operates and supports a multitude of applications to conduct its business processes on various platforms using mainframe, client server, and web-based technologies.</li>\n<li>Initiatives have incorporated the use of web-based tools utilizing Microsoft®.NET as the primary application development tool and Microsoft® SQL Server as the relational database management system (RDBMS).</li>\n<li>Operates a Windows-based environment using the Microsoft® Office Suite for staff in its Springfield and Chicago offices.</li>\n<li>Web-based applications at must be browser independent and run on a Windows-based PC or MAC operating systems. In addition, the selected Offered will be required to follow all current application development standards and procedures while ensuring maximal security.</li>\n<li>All technical solutions related to this RFSP must use Microsoft Visual Studio 2010/2012/2013/2015, Visual Basic.NET, C#, ASP.NET, AJAX, JQUERY, Microsoft SQL Server, SQL Server Integration Services (SSIS), SQL Server Reporting Services (SSRS) or Crystal Reports, Microsoft Power BI Business Intelligence, and Microsoft SharePoint 2016.</li>\n<li>Team Foundation Server (TFS) will be used for version control.</li>\n<li>Secure access to all web applications requires the Offer or to use the current application development framework to integrate into the current Single Sign-On (SSO) or the sign in portal (Web Application Security (IWAS)).</li>\n<li>Web-based applications at must run under Internet Information Server (IIS) 7 or higher on one or more servers running Windows Server 2012 R2 Datacenter Edition.</li>\n<li>All servers run as virtual machines under VMware ESXi 6.</li>\n</ul>\n<br>\n<p><strong>About our Company: </strong></p>\n<p><em>Connecting people’s aptitude &amp; ambitions with our opportunities to deliver results.</em></p>\n<p>22nd Century Technologies was established in 1997 and is headquartered in McLean VA. We are one of the leading IT services and solutions firm in the country with 12 regional offices and presence in all 50 states. We bring a mix of innovative technology and sector expertise to customers in defense, intelligence, civil, and healthcare markets. As our name implies, we are a forward thinking company with the ultimate goal of helping our customers implement innovative IT solutions that will satisfy their business needs. We combine real-world experience, specialized skills, innovative thinking, and industry knowledge to deliver quality IT solutions. At our core, we are about people - our customers and our employees.</p>\n<p><strong>“22nd Century Technologies is an Equal Opportunity Employer\" and “US Citizens &amp; all other parties authorized to work in the US are encouraged to apply.\"</strong></p>"}'