{"job title": "Data Analyst", "company": "Acuity INC", "city state": "– US-DC-", "rating": "3.8", "job description": "Overview<br><br>Acuity is seeking to hire a Data Analyst.\n<br><br>\nIn this role you will support the Enterprise Architecture team in several ways to include assessment and validation of new and existing informational needs and requirements in order to construct Power BI dashboards and publishing of routine BI Dashboards (weekly, monthly, quarterly, annually) supporting both the Knowledge Management (KM) and Enterprise Architecture (EA) program.<br><br>Responsibilities<br><br>The primary responsibilities of the Data Analyst include:\n\n<ul>\n\n <li>Ability to work independently and manage/prioritize multiple work assignments while completing frequent requests for ad hoc reports.</li>\n<li>Assess and validate new and existing information needs and requirements in order to construct Power BI dashboards. Some requests will relate to new analytic reports, creation of governance briefing presentations, and publishing of routine BI Dashboards (weekly, monthly, quarterly, annually) supporting both the Knowledge Management (KM) and Enterprise Architecture (EA) program.</li>\n<li>Create and execute Microsoft SQL Server Integration Services (SSIS) Packages to Extract, Transform and Load data from N number of data sources.</li>\n<li>Aggregate and Normalize Data Results from N number of data sources.</li>\n<li>Write executive summaries having potential valuable insights and conclusion regarding analysis projects for leadership briefings.</li>\n<li>Create and update Data Architecture Taxonomy and definitions for the KM and EA program.</li>\n<li>Participate in the development data dictionaries for new and existing data sources supporting the EA and KM program and Open Data initiative.</li>\n<li>Participate in internal QA to validate data normalization and alignment of results with EA Reference Models and Data Taxonomies with the KM and EA team.</li>\n<li>Publish Power BI Dashboards for multiple Service Areas in the EA Repository.</li>\n<li>Presenting findings, conclusions and recommendations to senior management.</li>\n</ul>\n\nQualifications<br><br>Required\n\n<ul>\n\n <li>Active DOD/DSS SECRET security clearance or higher.</li>\n<li>Bachelor’s Degree or Masters in Computer Science or Information Systems.</li>\n<li>At least 8 (eight) years of professional experience in quantitative analysis, data management, data quality and report development.</li>\n<li>Demonstrated ability to conduct quantitative analysis, strong analytical and problem solving skills with the ability to analyze and interpret data.</li>\n<li>Experience producing dashboard reports using Power BI, Tableau or similar tool.</li>\n<li>Experience with relational data bases (Oracle, SQL Server).</li>\n<li>Experience with a database language such as SQL, SAS, Oracle or Microsoft Access.</li>\n<li>Ability to create and manage large datasets.</li>\n<li>Demonstrates ability to work without technical oversight.</li>\n<li>Solid verbal and written communication skills.</li>\n<li>Shows initiative, presents ideas to overcome challenges, self-starter.</li>\n<li>Positive attitude, willingness to learn and apply, team player.</li>\n</ul>\nPreferred:\n\n<ul>\n\n <li>Familiarity with State Department and the Managing State Projects for Information Technology (MSP-IT) project cycle.</li>\n<li>Experience with one or more of: MS Azure, AWS, Google Cloud, or ServiceNow.</li>\n<li>Experience in developing and supporting web front-end technologies.</li>\n<li>Bachelor’s degree in information systems, database or related fields.</li>\n</ul>"}