{"job title": "Data Analyst", "company": "Arizona State University", "city state": "– Tempe, AZ (US)", "rating": "4.2", "job description": "<strong>ASU Job Title</strong>\n<br>\nData Analyst\n<br><br>\n17-Sep-2018\n<br><br>\n<strong>Department Name</strong>\n<br>\nRes Life Tech Students\n<br><br>\n<strong>Campus/Location</strong>\n<br>\nCampus: Tempe\n<br><br>\n<strong>Job Description</strong><br><br>Develops and manages policies and procedures relating to the entry, storage, maintenance, and security of personal and demographic data relating to students, staff, and affiliates of the university in all corporate systems.<br><br><strong>Requisition ID</strong>\n<br>\n<strong>45701BR</strong>\n<br><br>\n<strong>Working Environment</strong>\n\n<ul>\n<li>Sit or stand for prolonged periods of time</li> <li>Use computers effectively including inputting, reviewing and retrieving information, extended periods of viewing screen, using mouse and keyboard, and sitting</li><li>Position may work nights and weekends and travel to support duties and operational functions on all campuses</li> <li>Walk throughout campus for meetings or events, regardless of the weather conditions</li> <li>Ability to lift up to 35 pounds</li><li>Supervise staff and students</li><li>Work collaboratively across various departments within the University as well as with diverse populations and groups</li><li>Use critical thinking to make decisions and/or analyze data</li><li>Communicate effectively both orally and in writing</li>\n</ul>\n\n<strong>Minimum Qualifications</strong><br><br>Bachelor's degree in Business Administration, Education, or related field AND two (2) years previous software support experience; OR, Any combination of education and/or experience from which comparable knowledge, skills and abilities have been achieved.<br><br><strong>Department Statement</strong>\n<br>\nUniversity Housing strives to be a global leader in university student housing - building dynamic, innovative, and inclusive Residential Colleges that foster academic and personal success, empower students to create social value and lasting impacts, facilitate connection to the broader community, and support individual student persistence. ASU University Housing houses 13,000 students at four campus locations in Maricopa County. In support of the University's philosophy of access, excellence, and impact, University Housing promotes academic success and student learning, supports the development of community among our residents, provides student-centered processes and services, and develops and maintains quality accommodations.\n<br><br>\n<strong>Category</strong>\n<br>\n<strong>02</strong>\n<br><br>\n<strong>VP Code</strong>\n<br>\n<strong>EDUC OUTRCH &amp; STDT SVCS</strong>\n<br><br>\n<strong>Scope of Search</strong>\n<br>\nOpen\n<br><br>\n<strong>Desired Qualifications</strong>\n\n<ul>\n<li>Evidence of a Master’s degree and two years of related experience in a higher education environment</li><li>Experience working independently, as well as contribute to a highly driven, forward moving team</li> <li>Experience meeting tight timelines while providing accurate information and service, with high attention to detail</li><li>Experience developing queries and interpreting results to solve issues</li> <li>Experience with residential system software, StarRez, RMS, Blackboard, and PeopleSoft software packages</li> <li>Experience with budgeting, accounting, and/or financial reconciling</li><li>Experience with Microsoft Office applications (e.g., Word, Excel, Outlook, and Access).</li>\n</ul>\n\n<strong>Close Date</strong>\n<br>\n05-October-2018\n<br><br>\n<strong>Grant Funded Position</strong>\n<br>\nThis is not a grant funded position and is not contingent on future grant funding.\n<br><br>\n<strong>ASU Statement</strong><br><br>Arizona State University is a new model for American higher education, an unprecedented combination of academic excellence, entrepreneurial energy and broad access. This New American University is a single, unified institution comprising four differentiated campuses positively impacting the economic, social, cultural and environmental health of the communities it serves. Its research is inspired by real world application blurring the boundaries that traditionally separate academic disciplines. ASU serves more than 90,000 students in metropolitan Phoenix, Arizona, the nation's fifth largest city. ASU champions intellectual and cultural diversity, and welcomes students from all fifty states and more than one hundred nations across the globe.\n<br><br>\nASU is a tobacco-free university. For details visit www.asu.edu/tobaccofree\n<br><br>\nAmeriCorps, Peace Corps, and other national service alumni are encouraged to apply.\n<br><br>\nArizona State University is a VEVRAA Federal Contractor and an Equal Opportunity/Affirmative Action Employer. All qualified applicants will be considered without regard to race, color, sex, religion, national origin, disability, protected veteran status, or any other basis protected by law.<br><br><strong>Full-Time/Part-Time</strong>\n<br>\nFull-Time\n<br><br>\n<strong>Essential Duties</strong>\n\n<ul>\n<li>Develops and manages policies and procedures relating to the entry, storage, maintenance, and security of personal and demographic data relating to students, staff, and affiliates of the university in all corporate systems.</li><li>Works with functional areas to develop policies, standards, definitions, and conventions governing the creation and use of enterprise bio/demo data.</li><li>Implements system administration procedures such as data validation processes, duplicate resolution processes, system change requests and system integration / user acceptance testing, to ensure ongoing integrity and security of people data in line with university policy and procedure.</li><li>Establishes definitions, standards, and naming conventions for enterprise administrative data to ensure ongoing integrity, accuracy, and internal consistency of administrative data.</li><li>Prepares and disseminates reference sources containing pertinent policies, definitions, and other information necessary to use administrative data.</li><li>Audits data and reports results to functional areas for reinforcement of established policies, standards, definitions, and conventions.</li><li>Supports the applicable systems and databases for access, error resolution, and processes to keep data in sync with a variety of inter-related systems.</li><li>Coordinates testing of new releases of the application to identify impacts to and across data libraries and/or databases to ensure data integrity.</li>\n</ul>\n\nWork Schedule: Monday – Friday, 8:00 am – 5:00 pm with extended hours as needed\n<br><br>\n<strong>Employment Verification Statement</strong>\n<br>\nASU conducts pre-employment screening which may include verification of work history, academic credentials, licenses, and certifications.\n<br><br>\n<strong>Fingerprint Check Statement</strong>\n<br>\nThis position is considered safety/security sensitive and will include a fingerprint check. Employment is contingent upon successful passing of the fingerprint check.\n<br><br>\n<strong>Salary Range</strong>\n<br>\n$44,640 - $52,000 per year; DOE\n<br><br>\n<strong>Instructions to Apply</strong><br><br>Application deadline is 3:00PM Arizona time on the date indicated.\n<br><br>\nPlease include all employment information in month/year format (e.g., 6/88 to 8/94), job title, job duties and name of employer for each position.\n<br><br>\nResume should clearly illustrate how prior knowledge and experience meets the Minimum and Desired qualifications of this position.\n<br><br>\nASU does not pay for travel expenses associated with interviews, unless otherwise indicated.\n<br><br>\nOnly electronic applications are accepted for this position.<br><br><strong>Job Title</strong>\n<br>\nData Analyst\n<br><br>\n<strong>Job Family</strong>\n<br>\nInformation Technology\n<br>"}