{"job title": "Data Analyst", "company": "Broadridge", "city state": "– ", "rating": "3.4", "job description": "Broadridge Access Data is looking for a skilled Data Analyst to help support the FundFile data source.\n<br>\nData Analyst FundFile\n<br>\nIn today's highly competitive financial environment, the financial services industry is faced with significant challenges including -- client retention, transparency, operational efficiency, regulatory change, and emerging digital strategies. Accessing the most up-to-date information is therefore crucial to the success and development of this industry. AccessData, a Broadridge company, offers data-driven solutions on a leading-edge platform to mutual fund manufacturers and distributors to manage those challenges in order to drive business growth maximize operational efficiencies and manage risk.\n<br>\nBroadridge Access Data is looking for a skilled Data Analyst to help support the FundFile data source.\n<br>\n<strong>General Responsibilities:</strong>\n\n\n<ul>\n<li>Work with member's data providers to collect monthly files.</li>\n<li>Work with FundFile data team to add / remove funds, companies and to apply any data changes requested by the SalesWatch members.</li>\n<li>Upload members formatted processed macro files into Phoenix Data Input database.</li>\n<li>Carry out basic monthly data checks.</li>\n<li>Support FundFile and SalesWatch operations for implementing client projects.</li>\n<li>Work collaboratively with all data providers to ensure the quality and timeliness of their contributions.</li>\n<li>Work with SalesWatch product director to ensure data is accurate and timely and product and operations is evolving in conjunction with the FundFile and SalesWatch product roadmap.</li>\n</ul>\n\n<strong>Requirements:</strong>\n<br><br>\n<strong>Key competencies:</strong>\n\n\n<ul>\n<li>University educated</li>\n<li>Good numerical skills and attention to detail</li>\n<li>Able to work against deadlines</li>\n<li>Strong written and verbal communication skills</li>\n<li>Ability to combine information from various sources</li>\n<li>Excel, Word, PowerPoint,</li>\n</ul>\n\n<strong>Benefits:</strong>\n\n\n<ul>\n<li>Private healthcare</li>\n<li>Life Insurance</li>\n<li>MultiSport card</li>\n<li>Fruit Day</li>\n</ul>"}