{"job title": "Product Data Analyst", "company": "C+A Global", "city state": "– Edison - Edison, NJ", "rating": "3.3", "job description": "<div><div><div>Job Details</div></div><div><div><div>Level <div><div>Experienced</div></div></div><div>Job Location <div><div>Edison - Edison, NJ</div></div></div><div>Position Type <div><div>Full Time</div></div></div><div>Education Level <div><div>4 Year Degree</div></div></div></div><div><div>Travel Percentage <div><div>None</div></div></div><div>Job Shift <div><div>Day</div></div></div><div>Job Category <div><div>Business Development</div></div></div></div></div><div><div>Description</div></div><div><div> <div>+A Global is a leading international manufacturer based in Central New Jersey, who is the supplier of thousands of cool and unique electronics, cameras, photography equipment and accessories in the consumer marketplace. It has the exclusive licenses of private brands such as Polaroid, Zink, Skymall, Ivation and LyxPro, and KODAK just to name a few! With our outstanding, award-winning products being released every year, our brands attract the attention of well-known media outlets such as the Ellen DeGeneres Show, The Today Show, and The New York Times!\n<br><br>\nOur company continues to expand in growth and as one of the world's largest and most diverse online retailers we are excited to create new opportunities for job seekers! Apply now and Join our team!​\n<br><br>\n<strong>JOB POSITION TITLE:</strong> Product Data Analyst\n<br><br>\n<strong>SHIFT TYPE:</strong> Full-Time, Day\n<br><br>\n<strong>HOURS:</strong> Monday- Thursday 9:00am-6:00pm; Friday 9:00am-2:00pm\n<br><br>\nThe Product Data Analyst is a tech savvy and future thinking individual. We are looking for a detail orientated individual to access various consumer electronic products focusing on market research of competitors in the same categories. This would be someone who has the interest in improving variety of consumer electronics.\n\n<ul>\n\n\t<li>Some of our products work with apps so the Product Data Analyst will compare on a constant basis our products and apps to other apps and learn how we can improve functionally via look and feel.</li> \n\n<li>Analyze our new and current UX for hardware, firmware and software and give insight how we can enhance.</li>\n\n<li>Present the data to management and be instrumental with brainstorming and next steps.</li>\n\n<li>Test and confirm new designs that were implemented by the developers or factories.</li>\n\n<li>Generate user experience feedback from different sources by following a pre set process.</li>\n\n<li>Communicate with writers about user manuals.</li>\n</ul>\nSkills and qualifications:\n\n<ul>\n\n\t<li>Product Data Analyst much enjoy being tech savvy and have knowledge with the latest apps in the market.</li>\n\n<li>Ability to do market research and user feedback</li>\n\n<li>Understand in design and able to think how users will react.</li>\n\n<li>Product Data Analyst will be successful on being able to work on multiple projects via strong organization skills</li>\n</ul>\n\n</div>\n</div></div><div><div>Qualifications</div></div><div><div> <div><strong>Requirements:</strong>\n\n<ul>\n\n\t<li>Must be able to read, write and speak English</li>\n\n<li>Must be computer savvy and knowledgeable in Microsoft Office (Word, Excel, etc.)</li>\n\n<li>Must be able to lift 30 lbs, sit for extended periods of time, stairs, reach, twist, bend, stretch, climb, walk and/or run</li> \n\n<li>Must be able to report to work in a timely fashion</li> \n</ul>\n<strong>Desired Skills and Abilities:</strong>\n\n<ul>\n\n\t<li>Solid technical skills and knowledgeable of electronics and terminologies</li>\n\n<li>Must be detail oriented, accurate and well organized</li>\n\n<li>Professional, polite, well-mannered and outgoing personality</li>\n\n<li>Must be resourceful, work as a team player as well as independently</li> \n\n<li>Strong computer skills and internet savvy</li>\n\n<li>Professional demeanor</li>\n\n<li>Punctual and strong time management skills</li>\n\n<li>Thorough, organized and attention to detail</li>\n\n<li>Excellent written and verbal skills</li>\n\n<li>Excellent interpersonal skills</li> \n\n<li>Ability to meet urgent deadlines, organize and prioritize projects</li>\n\n<li>Proficient in Microsoft Office Suite applications</li>\n\n<li>Ability to work independently as well as with a team</li>\n</ul>\n<strong>What We Offer!</strong>\n\n<ul>\n\n\t<li>Benefits Program (Health, Vision, Dental)</li>\n\n<li>10-15 Paid Holidays Off!</li>\n\n<li>Short/Long Term Disability 100% Company Paid</li>\n\n<li>Life Insurance 100% Company Paid</li>\n\n<li>401K Options!</li>\n\n<li>Great Employee Discounts!</li>\n</ul>\n<strong><em>Great opportunity to work for a growing and exciting company!</em></strong>\n<br><br>\n<strong><em>All applicants are subject to a background screening.</em></strong>\n<br><br>\nCA Global is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</div>\n</div></div></div>"}