{"job title": "Data Analyst", "company": "Cisco Systems", "city state": "– San Jose, CA (US)", "rating": "4.0", "job description": "<strong>What You'll Do</strong><br><br>Cisco Digital Customer Listening team is looking for a full-stack Data Scientist/analyst. You will help Cisco identify various actions required to improve market penetration through deep data analysis &amp; insights that will feed in to driving various success motions, designed to drive Cisco’s top/bottom line. Your analytical insights will help Cisco’s various persona &amp; leaders identify actions to improve product features, quality &amp; margins, understand customer sentiment to drive different success motions to increase market penetration. Cisco's rich data landscape is an incredible playground for Data Scientists and enthusiasts.\n<br><br>\nAs part of the insights team, you will be technically hands on implementing architecturally sound systems and processes that will bring out the insights on the state of Cisco’s business along with the associated actions required to improve the business further. You will be measured on how you many insights you bring out that positively impacts business growth. You will also be part of the team responsible for integration of the insights you generate in to different workflows used by various persona.<br><br><strong>Who You'll Work With</strong><br><br>You will work with cross-functional teams with senior leadership, engineers, analysts, and product owners to define problems, scope projects, and deliver intelligent data solutions. You will have the opportunity to work with some of the newest technologies, work on the most transformative projects, and join a select Data Science team passionate about identifying actions using data-driven insights, applying technology and continuous learning.<br><br><strong>Who You Are</strong><br><br>You have experience communicating with diverse teams including data scientists, engineers, product managers, and executives as well as a proven track record of accomplishment of delivering high quality analytics insights with ability to derive actions that can be integrated in to different workflows. You are experienced in different kinds of structured and unstructured data sets. You have deep expertise in machine learning &amp; artificial intelligence, Statistical Modeling, Data Mining, and Natural Language Processing techniques.<br><br><strong>Your responsibilities will be to:</strong>\n\n<ul>\n<li>Collaborate with business and IT teams to understand the different persona specific use cases, the related business insight, consolidate use cases across persona, and drive a common approach towards solving multiple use cases</li><li>Hands-on analysis of use cases, different data &amp; subject areas to draw trends that can be connected to derive relationships to provide different interpretation paths and insights</li><li>Partner and lead cross-functional teams to realize data relationships through proper threading</li><li>Define data privacy &amp; protection processes required and implement systems and workflows that enforces security</li>\n</ul>\n\n<strong>Our minimum qualifications for this role are:</strong>\n\n<ul>\n<li>MS in Computer Science or equivalent + 4 years of related experience, or PhD + 1 year of related experience</li><li>Previous 3 – 5 years experience focused on Machine Learning / Artificial Intelligence.</li><li>Understanding of technology &amp; data schemas in Oracle, SFDC and other new data sources, with advanced SQL skills used in combinations of large data sets.</li><li>Deep knowledge and expertise in two or more of the following areas: machine learning/AI algorithms, computations/statistical learning theory, scalable systems (e.g. Spark, Hadoop), large scale data analysis, optimization, functional analysis and deep learning.</li><li>A demonstrable track record of developing novel algorithms, solutions and delivered/deployed projects in the area preferred</li><li>Experience in deep learning frameworks (e.g., Tensorflow, MxNet, Caffe, Torch, Theano, Keras, etc.), and large-scale optimization preferred.</li><li>Demonstrable proficiency in coding in Python, Java &amp; R, with a passion to code</li><li>Experience in Hadoop or other MapReduce paradigms and associated languages such as Pig and Hive</li><li>A sense of ambition and passion to change the world using AI and machine Learning</li><li>Experience in creating insights by combining large disparate data sets, such as Telemetry, customer transactions, customer sentiments etc. and application of AI/ML in the context of these domains</li><li>The ability to understand and accelerate the use of new data formats</li><li>The ability to aggressively build upon / identify new business use cases using data analysis</li><li>Deep understanding of business analytics and impact of data genealogy on analytics</li><li>Self-driven individual, demonstrating continuous learning and creativity, and is naturally collaborative</li>\n</ul>\n\n<strong>Why</strong> <strong>Cisco</strong><br><br>At Cisco, each person brings their unique talents to work as a team and make a difference.\n<br><br>\nYes, our technology changes the way the world works, lives, plays and learns, but our edge comes from our people.\n<ul>\n<li>We connect everything – people, process, data and things – and we use those connections to change our world for the better.</li><li>We innovate everywhere - From launching a new era of networking that adapts, learns and protects, to building Cisco Services that accelerate businesses and business results. Our technology powers entertainment, retail, healthcare, education and more – from Smart Cities to your everyday devices.</li><li>We benefit everyone - We do all of this while striving for a culture that empowers every person to be the difference, at work and in our communities.</li>\n</ul>\nColorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Be you, with us! #WeAreCisco"}