{"job title": "Network Engagement Data Analyst", "company": "Clover Health", "city state": "– Jersey City, NJ", "rating": "3.7", "job description": "<em>Clover is reinventing health insurance by working to keep people healthier.</em>\n<br><br>\nThe Network Engagement team is accountable for developing and executing the provider contracting, engagement, and implementation strategy for all Clover markets. Overall, the team is accountable for the development of specific markets and for participating in the development of the network management strategy which includes aspects of technology, product, utilization management, value-based care, membership growth, marketing, compliance, and the member and provider experience.\n<br><br>\nAs a Network Engagement Data Analyst, you will be responsible for ensuring Clover maintains a high quality network of providers and is compliant with CMS network adequacy standards in all markets. The Network Engagement Data Analyst will be responsible for all required submissions of network data to CMS, in addition to supporting provider data reporting functions internally. The successful candidate will drive compliance with network adequacy standards through ongoing monitoring and compiling key provider data and coordinating with network engagement managers to resolve any open gaps.\n<br><br>\nYou will be joining a fast-growing &amp; fast-moving startup at the intersection of healthcare &amp; technology.\n<br><br>\nCome be at the heart of the action!\n<br><br>\n<strong>As a Network Engagement Data Analyst, you will...</strong>\n\n<ul>\n<li>Be the primary individual responsible for ongoing monitoring of network adequacy and submission of network status to CMS.</li>\n<li>Track all network adequacy requirements for Medicare product and completing Exception Reports for CMS when necessary.</li>\n<li>Manage the partnership with Quest analytics and maintain updated provider data within the platform.</li>\n<li>Develop network adequacy reports including GeoAccess data extracting and mapping, comparing to Medicare Adequacy standards, and applying to current network status to identify gaps in the Clover network.</li>\n<li>Analyzes, extracts, and concatenates data from multiple sources, including the company's enterprise data warehouse (EDW).</li>\n<li>Performs provider data analysis and reporting in response to internal and external request from network engagement managers, providers, and/or regulatory agencies.</li>\n<li>Serve as a dedicated intra-Clover resource for the Network Engagement team to perform network analysis, reporting, and other ad hoc network data requests.</li>\n<li>Help coordinate workflow and assist with special projects as necessary.</li>\n</ul>\n<strong>You will love this job if:</strong>\n\n<ul>\n<li>You are <strong>highly organized</strong>, <strong>efficient</strong> and demonstrate superior<strong> attention to details.</strong></li>\n<li>You are <strong>self-motivated</strong>. You have great follow-up skills &amp; can <strong>prioritize &amp; self-manage</strong> your work.</li>\n<li>You are capable of relying on <strong>experience</strong> and <strong>judgment</strong> to plan, make decisions and accomplish goals.</li>\n<li>You are a proficient <strong>problem solver</strong> and will do what it takes to make the puzzle pieces fit together.</li>\n<li>You love to work with <strong>healthcare data sets</strong>.</li> \n\n<li>You want to <strong>make a difference</strong>. You feel fulfilled when you can help members live healthier lives.</li>\n<li>You like to <strong>learn</strong>. Healthcare &amp; technology is complicated. You are <strong>passionate</strong> about understanding how these two things come together.</li>\n</ul>\n<strong>You should get in touch if:</strong>\n\n<ul>\n<li>You have excellent data analytics skills and a familiarity with health plan data analytics, particularly CMS network adequacy HSD table submission experience.</li>\n<li>You have strong analytical, logic, and organizational skills.</li>\n<li>You are proficient in SQL, MS Excel, and MS Access.</li>\n<li>You have excellent time management and organizational skills.</li>\n<li>You are interested in healthcare &amp; want to contribute to tackling one of society's greatest challenges.</li>\n</ul>\n<em>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest &amp; conviction records. We are an E-Verify company.</em>\n<br><br>\nAbout Clover: We are reinventing health insurance by combining the power of data with human empathy to keep our members healthier. We believe the healthcare system is broken, so we've created custom software &amp; analytics to empower our clinical staff to intervene &amp; provide personalized care to the people who need it most.\n<br><br>\nWe always put our members first, &amp; our success as a team is measured by the quality of life of the people we serve. Those who work at Clover are passionate &amp; mission-driven individuals with diverse areas of expertise, working together to solve the most complicated problem in the world: healthcare."}