{"job title": "Data Analyst", "company": "Crossfire Consulting", "city state": "– Jersey City, NJ", "rating": "5.0", "job description": "We are looking for a Business Analyst to support client's Security Master Model Redesign initiative. Candidate will play a vital role in ensuring business objectives are satisfied by supporting the discovery, analysis, clean up and coordination efforts associated with this vital initiative. Principal Responsibilities: Analyze, evaluate, define, document, maintain and track business requirements Analyze, evaluate, define and document business and system processes and identify and document underlying business requirements and rules Perform data discovery, analysis and modeling - analyze, evaluate and define data requirements, usage and structure Own and develop relationship with partners, working with them to optimize and enhance integration Report on common sources of technical issues or questions and make recommendations to product team Constantly be on a lookout for ways to improve monitoring, issue discovery and the delivery of better value to the customer Define and perform user acceptance testing Able to convey and employ Master Data Management concepts and best practices Experience: Minimum of 5 years of experience in business data analysis Emphasis on data profiling and dimensions of data quality Thorough understanding of Master Data Management, Data Analysis and Data Modeling Experience in running meetings with business and technology stakeholders Familiarity with security instruments &amp; financial industry Knowledge &amp; Skills: Self-motivated; works well both independently and collaboratively Detail oriented Exceptional analytical and conceptual thinking skills Excellent documentation and communication skills Own results to completion and anticipates needs, sets realistic expectations Familiar with different software development methodologies (Waterfall, Agile, Scrum) Competency in in MS Word, PowerPoint, Visio, Excel, MSProject and Jira. Ability to understand conceptual, logical and physical data models. Erwin Data Modeling is a plus. Familiarity with Master Data Management concepts (e.g.: Suspect Duplicate Processing, Rules of Visibility, \\\"Who Wins rules, etc.) Knowledge of Client Master Data and Reference Data a plus Familiarity with Data Quality Dimensions (valid, accurate, complete, consistent, conformity, coverage and timeliness) a plus Education, Training &amp;/or Certification: Degree in a business or related field. - provided by Dice MDM, Data Analysis, Erwin\n<br>\nAssociated topics: data analyst, data analytic, data center, data quality, data scientist, etl, mongo database, mongo database administrator, sql, teradata"}