{"job title": "Data Analyst", "company": "Exegy", "city state": "– Saint Louis, Missouri", "rating": "4.1", "job description": "Company Description<br><br>Exegy provides ultra-high performance hardware-accelerated computing appliances that efficiently process and enrich market data for the world's leading financial organizations. Exegy's unique market data products respond to financial organizations' growing demands for low latency, reduced cost of ownership and flexibility.<br><br>Job Description<br><br>Exegy is seeking a full-time internal Data Analyst in St. Louis MO. Candidates must be local to St. Louis MO metro area and have 2+ years of work experience. The Data Analyst will join a highly strategic research team building and improving new data products. You will be developing support tools for data analysis, quantitative model implementations, recording, collecting, and replaying market data, data visualization, and reporting.\n<br><br>\nIf you are interested, please apply via the following link:\n<br>\nhttps://exegy.bamboohr.com/jobs/view.php?id=51\n<br><br>\nNo phone calls please.\n<br><br>\nNo third party resumes please.<br><br>Qualifications<br><br>The aim of our research division is to deliver unique and differentiated data content for market participants with a focus on equities. Like us, you thrive in a complex data environment. We like getting our hands into the data, focusing on insights which drive actions and product improvements. We extract data and make sense of it using Python, R, Excel and quantitative techniques (such as regression, statistical testing, and machine learning programs). You will be joining a small but highly strategic team of data scientists and a lead product manager where you will have the unique ability to work on some of the most insightful data.\n<br><br>\nThe groups quantitative research insights are used to develop innovative real-time and historical market data products. We build products for clients with latency sensitivity to those with long-term outlooks. We combine these views with the specific needs of clients to develop a growing portfolio of products.\n<br><br>\nMust be local to St. Louis MO metro area. Relocation not provided for this role.\n<br><br>\nWe are looking for someone who:\n<ul>\n<li>Is passionate about modeling and enjoys building software solutions to assist with quantitative research.</li><li>relishes the opportunity to learn the equity trading/investment business</li><li>Is hungry for an opportunity to advance ones technical skills involving statistical programming, web development, machine learning and database management.</li><li>will juggle pre-planned projects while providing support for ad-hoc data and research requests. Expect frequent changes and requirements.</li>\n</ul>\n<strong>Responsibilities</strong>\n<ul>\n<li>Data Collection</li>\n</ul>\no Management/ maintenance of data collection, transfer etc.\n<br><br>\no Unix scripting\n<br><br>\no Data preprocessing\n<br><br>\no Create and maintaining a database\n<ul>\n<li>Preparation of data sets for modeling</li><li>Preliminary data analysis</li><li>Fully automating data processing pipeline</li>\n</ul>\no Data collection, archival, data management, preprocessing\n<br><br>\no Managing transfers to AWS (and/or any backup alternatives)\n<ul>\n<li>Improved test suite for data preprocessing (if we add to/change preprocessing, minimize risk of breaking existing models and how to manage the process)</li><li>Automatic summarization of collected data</li><li>Detection of data collection issues</li><li>Automated modeling</li><li>Assist in the establishment of technical standards / best practices by communicating with the team and contributing to the internal WIKI</li><li>Create visualization methods to communicate data in a meaningful manner</li><li>Participate in daily scrum meetings, backlog reviews and sprint planning</li><li>Build and maintain data visualizations and websites</li>\n</ul>\n<strong>Requirements:</strong>\n<ul>\n<li>Bachelors degree in Computer Science (or equivalent), math, statistics or similar</li><li>Strong in Python, JavaScript</li><li>Comfortable with R, Excel, Unix</li><li>Strong analytical and data visualization skills</li><li>Experience with development of web based front end tools to aid quantitative and research analysis with an emphasis on data visualization.</li><li>Experience with implementation and automation of existing manual or inefficient processes</li>\n</ul>\n\nAdditional Information<br><br>All your information will be kept confidential according to EEO guidelines."}