{"job title": "Business Analyst - Data &amp; Reporting", "company": "First Republic Bank", "city state": "– US-CA-San Francisco", "rating": "3.7", "job description": "Overview<br><br>The Business Analyst - Data &amp; Reporting is primarily responsible for analyzing data and creating business insights in our Eagle Lending Group. Eagle Lending is leading the bank on how to leverage data and technology to acquire and engage the next generation of First Republic clients. This is a foundational role that will empower Eagle Lending to move faster with making data-based decisions. We're looking for a high-energy Business Analyst with a high attention to detail, and desire to develop higher-order analytical skills.<br><br>Responsibilities\n\n\n<ul>\n\n <li>Develop, manage, and maintain reports on operational, risk, and performance metrics with a focus on automation for scale</li>\n<li>Work with stakeholders throughout the organization to identify opportunities for leveraging internal and external data to drive business solutions</li>\n<li>Partner with managers to develop and execute various reporting packages and ad hoc requests</li>\n<li>Deliver on various data and reporting projects end-to-end, including requirements identification, timeline / milestone establishment, inter-departmental coordination and risk assessment / monitoring</li>\n<li>Formulate business insights on how to grow the business, improve efficiency and/or deepen relationships based on data</li>\n</ul>\n\nQualifications\n\n\n<ul>\n\n <li>BS or MS in Engineering, Computer Science, Math, Physics, Statistics or related quantitative field</li>\n<li>Strong experience creating and evolving dimensional data models and schema designs to improve accessibility of data and provide intuitive analytics</li>\n<li>Strong SQL skills, ability to perform effective querying involving multiple tables and subqueries</li>\n<li>Advanced Tableau coding skills with a track record of developing visualizations that drive and optimize business outcomes</li>\n<li>Demonstrated ability to think strategically about business, product, and technical challenges</li>\n<li>Experience developing scripts and tools to enable faster data consumption</li>\n<li>Experience using data visualization tools to convey quantitative results clearly</li>\n</ul>"}