{"job title": "Data Analyst", "company": "HG Data", "city state": "– Santa Barbara, CA", "rating": "4.5", "job description": "HG Data is a growing data services company delivering key insights to sales and marketing departments. We're powered by a group of highly intelligent data scientists and engineers with a mandate of having the largest and highest quality technology install database in the world.\n<br><br>\nHG Data is experiencing significant growth and in need of a Data Analyst to work directly with our customers on their utilization of our data solutions. This role will challenge you to think creatively and ask questions about data leading to better solutions for our customers and enhancements to our internal processes that create the data.\n<br><br>\nWe're looking for someone who is passionate about data and can analyze and translate technical concepts to a sales and marketing audience.\n<br><br>\nWe offer a competitive salary, 401K, growth potential, great benefits, and a casual yet professional environment. We are passionate about our jobs with a get-it-done attitude, yet we don't take ourselves too seriously. This is a great opportunity for an experienced, aspiring individual to join a fantastic team and make an immediate impact on our company by helping bring big data to life.\n<br><br>\nThis role is located at our headquarters in Santa Barbara, CA just a few blocks from the beautiful Santa Barbara beach.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Perform triage, root cause analysis, and corrections to data issues reported by customers or exception reports.</li>\n<li>Support the sales and Customer Success teams' data requests.</li>\n<li>Explain best practices associated with HG Data points to customers via Email and phone.</li>\n<li>Prep and Deliver data to customers.</li>\n<li>Assist with inbound customer support queue.</li>\n<li>Oversee user data permissions and access levels.</li>\n<li>Become a resident expert on HG Data's data sets, products, and markets - including Big Data, Data-as-a-Service, Predictive and Analytical Markets.</li>\n<li>Explore additional ways in which HG can activate data sets for customers.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>SQL Experience</li>\n<li>Proficient in Excel - Vlookups, Pivot Tables</li>\n<li>Experience with a BI tool like Tableau desired</li>\n<li>Excellent listener and problem solver capable of recommending solutions to customer requests and technical issues.</li>\n<li>0 to 3 years professional experience.</li>\n<li>BA/BS in Computer Science, Electrical Engineering, Mathematics, Statistics, or a related technical field.<br><br>SDL2017</li>\n\n</ul>"}