{"job title": "Data Analyst", "company": "iSpace", "city state": "– Santa Monica, CA", "rating": "3.7", "job description": "JOB DETAILS: Title: Data AnalystLocation: Santa Monica, CAType: 03 - 06 Months contract (Extendable) Job Description: Summary: he data analyst specializes in Cerner EHR data model. The data analyst has responsibility for writing, reviewing, executing queries that return data from the Cerner EHR database. All job duties specific to working Cerner EHR data at the database level: Proven working experience as a Cerner EHR database data analyst or business data analyst.Technical expertise regarding Cerner EHR data models, database design development, data mining and segmentation techniques.Interpret data, analyze results using statistical techniques and provide ongoing reports.Filter and clean data by reviewing computer reports, printouts, and performance indicators to locate and correct code problemsStrong knowledge of and experience with databases (SQL etc), programming (ETL frameworks)Knowledge of statistics and experience using statistical packages for analyzing datasets (Excel, SPSS, SAS etc)Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracyAdept at queries, report writing and presenting findings To indicate your desire to be considered for this role, please complete and return this very brief questionnaire:Full Name:Work Authorization/VISA Status:Contact No.:E-mail:Current Location:Travelling (%):Relocation Interest:Availability:Expected Pay rate on C2C/W2:Updated Resume and your experiences with above job description. Thank you for your time and consideration. Please remember the iSpace Referral Policy. If you refer your friends and we place them in any type of position, we will pay you a referral fee. When you refer someone, your names are linked in our data base. If we place them next week or 5 years from now, we will pay you a referral fee. There is no expiration date. We find our best people this way, so please assist your friends and make some money at the same time. M. Lokesh (Luke) | Talent Acquisition Specialist Tel: 310-###-#### (Preferred) | 310-###-####www.ispace.com | ...@ispace.comiSpace Inc | Suite 110, 2381 Rosecrans Ave, El Segundo, California 90245 - provided by Dice Data Analysis, ETL, SQL, Cerner EHR, Excel\n<br>\nAssociated topics: data administrator, data integrity, data manager, data management, data warehouse, data warehousing, database, database administrator, mongo database administrator, sql"}