{"job title": "Data Analytics and Operational Analyst", "company": "ManTech", "city state": "– USA MARYLAND Hanover", "rating": "3.5", "job description": "<div>Req ID 100065BR</div> <div> Business Title Data Analytics and Operational Analyst</div> <div> Group MCIS</div> <div> Location USA MARYLAND Hanover</div> <div> Clearance Level Needed TS/SCI</div> <div> Category Facilities</div> <div> Job Duties and Responsibilities At ManTech International Corporation, you will help protect our national security while working on innovative projects that offer opportunities for advancement. Currently, ManTech is seeking a motivated, career and customer oriented Data Analytics and Operational Analyst to join our team in the Annapolis Junction area to provide unparalleled support to our customer and to begin an exciting and rewarding career within ManTech.<br><br>The Enterprise Information Systems GW program will facilitate an enterprise-wide capability for effective and integrated operations, oversight, responsibility, and accountability for a consolidated enterprise IT services business model.\n<br><br>\n<strong>Responsibilities include but not limited to:</strong>\n<br><br>\nYou will serve as the Data Analytics and Operational Analyst for our new award of GW RIS II to anticipate possible adverse events, evaluates probabilities of occurrence, and recommend cost effective steps to limit impact. Duties will include:\n<ul>\n<li>Developing requirements formulation and assessment capabilities. You will analyze documents, statistics, reports and market trends pertinent to our IC Customer’s mission to assess and identify potential risks that may hinder the mission’s success.</li><li>Develop and implement processes and procedures in conjunction with our Service Delivery Operations team, Customer Success Team and Program Management to ensure that we are prepared to avoid or operate with up to date information to improve success and deliver on SLA's.</li><li>Identify where to best deploy resources for the greatest impact based on data driven analytics</li>\n</ul>\n<strong>Position Requirements:</strong>\n<ul>\n<li>Bachelor's degree or equivalent in business, information systems, information technology, engineering, or a related field or 5 years additional general experience</li><li>Experience with metric’s analysis and mitigation tools for evaluating large scale ticketing information and task completion</li><li>ITIL Foundations experience for baseline understanding of IT Tech Refresh Requirements</li><li>Ability to communicate messaging through verbal and written communications, and drive operational effectiveness with data and analytical proof points.</li>\n</ul>\n<strong>Security Clearance:</strong>\n<br><br>\n· Candidate must have active TS SCI Clearance with Polygraph and investigation of SSBI within last five years.</div><div> Qualifications Requires Bachelor’s degree or equivalent in business administration, finance or related field and seven to nine years related experience including risk management experience with a major property/liability insurance broker, agency or company</div> <div> Degrees Equivalent Experience/Education\n<br>\nBachelor's Degree</div>\n<br>\n<div> Years of Experience 13-15 years w/High School Diploma\n<br>\n07-09 years w/Bachelors Degree\n<br>\n04-06 years w/Masters Degree</div>\n<br>\n<div> Position Type Full-Time</div> <div> Shift Day</div> <div> Overview ManTech International Corporation is comprised of approximately 7,300 talented employees who use advanced technology to help government and industry meet some of their greatest challenges around the world. We adhere to the simple, no-nonsense values on which ManTech was founded more than four decades ago, aligning squarely with the mission objectives of our customers. As our customer base continues to expand and diversify, we continue to diversify our workforce and solutions. Nearly half our employees have a military background, and approximately 70 percent hold a government security clearance. As a leading provider of innovative technology services and solutions for the nation's defense, security, health, space, and intelligence communities; we hold nearly 1,100 active contracts with more than 50 different government agencies.</div>"}