{"job title": "Data Analyst", "company": "Memorial Sloan-Kettering", "city state": "– New York", "rating": "4.0", "job description": "Company Overview<br><br>At Memorial Sloan Kettering (MSK), we’re not only changing the way we treat cancer, but also the way the world thinks about it. By working together and pushing forward with innovation and discovery, we’re driving excellence and improving outcomes. For the 28th year, MSK has been named a top hospital for cancer by U.S. News &amp; World Report. We are proud to be on Becker’s Healthcare list as one of the 150 Great Places to Work in Healthcare in 2018, as well as one of Glassdoor’s Employees’ Choice Best Place to Work for 2018. We’re treating cancer, one patient at a time. <em><strong>Join us and make a difference every day.<em><strong><em><strong><em><strong><strong></strong></strong></em></strong></em></strong></em></strong></em><br><br>Job Description<br><br><strong>Are you interested in pursuing a career in healthcare or health informatics and have academic or professional experience in software development?</strong>\n<br><br>\n<strong>We are:</strong> A team of data analysts and programmers in the Health Outcomes group at Memorial Sloan Kettering Cancer Center. We have two platforms that help support patient care. We take information provided by patients throughout the course of their cancer journey and build electronic reports to optimize the care they receive. The team also developed a surgeon platform that allows surgeons to get feedback on their surgical outcomes.\n<br><br>\n<strong>You will:</strong>\n\n<ul>\n\n <li>Learn to analyze and visualize data, providing decision support for doctors</li>\n<li>Design digital tools for data collection, analysis, and visualization of patient outcomes</li>\n<li>Build interactive reports for doctors</li>\n<li>Create tools to assess surgeon performance</li>\n<li>Have clinical exposure and the opportunity to work closely with doctors and clinicians from diverse clinics</li>\n<li>Receive unparalleled training and experience, in one of the most productive and innovative groups in one of the world’s leading medical research institutions</li>\n</ul>\n<strong>You are:</strong>\n\n<ul>\n\n <li>Passionately committed to our mission of cancer research and clinical care</li>\n<li>Motivated to work collaboratively with doctors to help them meet their patients’ needs</li>\n<li>Committed to high standards of productivity</li>\n<li>Eager to take on new opportunities and tough challenges with a sense of urgency, high energy, and enthusiasm</li>\n<li>Adaptable in your approach and demeanor in real time to match the shifting demands of different situations</li>\n<li>Adept at planning and prioritizing work to meet commitments aligned with organizational goals</li>\n<li>Collaborative with teammates of diverse backgrounds</li>\n</ul>\n<strong>You need:</strong>\n\n<ul>\n\n <li>Bachelor's degree that includes coursework in front or back end development or a Bachelor's degree in an unrelated field with professional experience one of these key areas</li>\n<li>Prior experience required in programming language (C#, SQL, Javascript, CSS, HTML)</li>\n<li>A plus if you have data analysis using a professional software package such as Stata or R</li>\n</ul>\n<em><strong>Please submit a cover letter with your application.</strong></em>\n<br><br>\nSome of the work we do has been featured in the press. See https://medium.com/backchannel/should-surgeons-keep-score-8b3f890a7d4c\n<br><br>\n#LI-POST<br><br>Closing<br><br>MSK is an equal opportunity and affirmative action employer committed to diversity and inclusion in all aspects of recruiting and employment. All qualified individuals are encouraged to apply and will receive consideration without regard to race, color, gender, gender identity or expression, sexual orientation, national origin, age, religion, creed, disability, veteran status or any other factor which cannot lawfully be used as a basis for an employment decision.\n<br><br>\nFederal law requires employers to provide reasonable accommodation to qualified individuals with disabilities. Please tell us if you require a reasonable accommodation to apply for a job or to perform your job. Examples of reasonable accommodation include making a change to the application process or work procedures, providing documents in an alternate format, using a sign language interpreter, or using specialized equipment."}