{"job title": "Data Analyst", "company": "Primus Software Corporation", "city state": "– Atlanta, GA", "rating": "3.5", "job description": "Title &amp; Job number: Data Analyst\n<br><br>\nDuration: 20-Nov-2017 - 19-May-2018\n<br><br>\nLocation: 3003 Summit Boulevard, Suite 200, Atlanta GA 30319\n<br><br>\nDescription:\n<br><br>\n· This role will be responsible for managing customer data within a master data management platform. Specifically, the core focus will be on investigating matches or mismatches of individual accounts to customer entities and making/initiating corrective actions as appropriate. Daily progress against deadlines will be tracked using Excel, and status will be reporting using PowerPoint and Word. Strong candidates will be action-focused, detail-oriented, have a high focus on quality, and able to communicate progress and issues clearly.\n<br><br>\n· Requirements:\n<br>\nThis is an immediate need so manager will look to make a decision quickly. If you have pre screened candidates via infomart that have completed the cox screenings those candidates will be considered first.\n<br><br>\n· Experience with managing master data (customer master data specifically preferred)\n<br><br>\n· Strong analytical and critical thinking skills\n<br><br>\n· Demonstrated high-level attention to detail and accuracy\n<br><br>\n· High proficiency with Excel, PowerPoint and Word\n<br><br>\n· Ability to apply established scenarios and business rules to determine how to resolve master data exceptions\n<br><br>\n· Ability to identify new scenarios and determine when additional business rules are needed\n<br><br>\n· Ability to produce at a high level while maintaining quality\n<br><br>\n· Confirmed ability to work in a team-based environment as well as independently with initiative.\n<br><br>\n· Illustrated time management, multi-tasking, decision making, and analytical skills.\n<br><br>\n· Proven ability to identify and solve root causes\n<br><br>\n· Strong communications skills (verbal and written)\n<br><br>\nPuja Chawla\n<br><br>\nPrimus Software Corporation\n<br><br>\nDirect: 678 -466- 6853 | Fax: 770-234-4163\n<br><br>\nEmail: puja.chawla@primussoft.com\n<br><br>\nwww.primussoft.com | 3061 Peachtree Industrial Blvd, Suite 110 Duluth, GA - 30097"}