{"job title": "SAP Master Data Governance-Associate Analyst", "company": "Reynolds Consumer Products", "city state": "– Lake Forest, IL", "rating": "3.3", "job description": "\n<br><br>\nJoin Reynolds Consumer Products… a world of opportunities! At Reynolds Consumer Products we are passionate about achieving results and have fun winning as a team! We provide amazing job opportunities for growth with competitive salaries and benefits in an exciting, dynamic, fast-paced, and fun workplace environment. Are you looking to build a strong career and make a positive impact? Then we have an opportunity for you! We are searching for an SAP Master Data Governance-Associate Analyst to join our team located at our headquarters in Lake Forest, IL. (northern suburbs of Chicago, IL)\n<br><br>\n<strong>Your Role:</strong>\n<br><br>\nAs an SAP Master Data Governance-Associate Analyst, you will develop and communicate key documentation related to internal Data Governance rules regarding acceptable attribute values and processes. You will have the opportunity to:\n<ul>\n <li>Identify patterns, trends and inconsistencies, draw conclusions and provide recommendations in the form of remediation, corrective actions and preventative actions.</li> <li>Manage large spreadsheets of data to improve data quality</li> <li>Develop reports to extract data from SAP</li> <li>Maintain and prioritize project work plans</li>\n</ul>\nUltimately, you will collaborate directly with the business data owners to establish the quality business rules that will provide the foundation for data quality improvement plan.\n<br><br>\n<strong>You will love it here if…</strong>\n<ul>\n <li>You are analytic and an expert problem-solver</li> <li>You are results oriented</li> <li>You thrive under pressure in a fast-paced environment</li> <li>You can successfully juggle multiple tasks at once</li>\n</ul>\n<strong>We need you to have:</strong>\n<ul>\n <li>Bachelor's Degree in Information Technology, Computer Science or Management Information Systems</li> <li>2+ years as a Master Data Analyst or Supply Chain Analyst with reporting analytics experience</li> <li>Advanced experience using Microsoft Excel (pivot tables,) and Access</li> <li>Experience providing a consolidated view of data for analysis and decision making purposes</li> <li>2+ year’s SAP ECC 6.0 experience</li> <li>2+ years’ SAP Master Data maintenance experience</li>\n</ul>\n<strong>Icing on the cake:</strong>\n<ul>\n <li>SAP Business Warehouse (BW) experience</li>  <li>Winshuttle experience</li> \n</ul>\nWant to know more? Check out our website or connect with us on LinkedIn!\n<br><br>\n<strong></strong>"}