{"job title": "Data Analyst", "company": "TeamSnap", "city state": "– Boulder", "rating": "3.4", "job description": "We are looking for a Data Analyst who will work cross functionally in business intelligence, financial analysis and operations reporting. You will play a crucial role in the continued success of TeamSnap, working closely with stakeholders across the company, including Finance, Sales, Marketing, Ad Sales, and Product Management. Your time will be split between digging into the data, analyzing the findings, and presenting recommendations.<b>How You Will Spend Your Day:</b>\n\n-Analyzing the key SaaS metrics that help drive revenue and the overall business\n-Youll be part of process design and implementation, performance measurement and ongoing enhancements across these areas.\n-You will synthesize insights through the vast amount of data captured by TeamSnap, Google Analytics and other systems to develop actionable reports that will help us grow our SaaS business while increasing our efficiency.\n-Apply your expertise in quantitative analysis, data mining to effectively translate analytical findings into the language of decision makers.\n-Present findings effectively supported by visual representations to see beyond the numbers and understand behavior of customers.\n-Proactively review information, identifying inconsistencies, trends and issues.\n-Work to increase the efficiency and effectiveness of our data analysis infrastructure.\n-Leverage strong business acumen and business domain knowledge to anticipate business inquiries.\n\n<b>Skills and Attributes Wed Like You To Have:</b>\n\n-A Bachelors Degree in Statistics, Math, Engineering, Computer Science, Economics, Business, or a related technical field\n-3+ years of work experience in user and systems-level analytics, management consulting, or business strategy\n-You live and breathe data - gathering it, analyzing it, applying it to the real world &amp; utilizing it to solve real problems\n-Prior experience analyzing marketing or customer data with some experience doing statistical analysis and a basic understanding of statistical modeling concepts\n-Experience working with imperfect data sets that, at times, will require improvements to process, definition, and collection. After all, life isnt perfect.\n-Prior experience in SaaS or technology company highly preferred\n-Strong SQL skills combined with experience of:\n-Web tracking solutions like Google Analytics and additional marketing platforms within the Google 360 suite\n-Big Query\n-BI tools (Tableau experience is a bonus)\n-Python and/or ETL experience\n-Ability to create dashboards and reports that support analysis\n-The ability to clearly communicate results to team members and leadership team\n-Ability to succeed in a collaborative, distributed environment\n\n<b>Why TeamSnap?</b>\n\n-This is a unique opportunity for an ambitious, creative professional to join a revolutionary, award-winning company that has been named Outside Magazines Best Places To Work since 2016.\n-Leverage your strengths to build an incredible hiring and employee focused organization.\n-Work with an energetic, rapidly-growing organization as we continue our quest to hire the best and brightest\n-While were still relatively small, were not a fly-by-night startup. Were an established player in a massive market. We have a proven revenue model, an experienced management team, solid funding and a strong plan moving forward.\n\n<b>Location</b>\n\nWe are headquartered in Boulder, Colorado, but as a distributed company we have employees all over the US. Ultimately we are looking for the right person, regardless of where you live."}