{"job title": "Senior Financial Data Systems Analyst", "company": "Tokio Marine HCC", "city state": "– Houston, TX", "rating": "3.6", "job description": "<div>\n <div>\n Job Description\n <div><p>Tokio Marine HCC is a leading specialty insurance group with offices in the United States, the United Kingdom, Spain and Ireland, transacting business in approximately 180 countries and underwriting more than 100 classes of specialty insurance. Tokio Marine HCC products and capabilities set the standard for the industry, and many of the Company’s almost 3,000 employees are industry-leading experts.</p> <p>We have an exciting opportunity for a <b>Sr. Financial Systems Data Analyst</b> in our Corporate Headquarters located in Houston, TX. This role Coordinates and supports programs/projects involving multiple departments or cross-functional teams that focus on the integration of technology with business requirements and processes that meet both company and regulatory guidelines and principles. This pertains to Reinsurance, General Ledger and Data warehouse systems and any other systems that will come into the responsibility of this team. </p> <p>The position carries out responsibilities in the following key areas: </p> <ul> <li>Define business user needs and system requirements for department and communicate to IT department.</li> <li>Analyze, design, modify and develop processes that balance business needs and legal requirements.</li> <li>Coordinate the collection of data with the applicable department and IT for system implementation.</li> <li>Provide assistance and work with IT personnel to ensure technical side of implementation is being properly addressed.</li> <li>Oversee testing of programs and analysis of financial results.</li> <li>Ensure systems are maintained and data integrity is not compromised.</li> <li>Anticipate bottlenecks and provide escalation to management.</li> <li>Identify and make recommendations for improvements in business and departmental processes.</li> <li>Provide analytical support to various business units from data warehouse records</li> <li>Coordinate training of company personnel in the use of new systems and processes.</li> </ul></div>\n</div>\n\n </div>\n \n\n <div>\n <div>\n Job Requirements\n <br><br><b>Qualifications:</b><br><br> <ul> <li>Experience: Ideally, the successful candidate will have minimum of five years of relevant and progressive professional experience with accounting/finance systems including system implementations for medium- to large-size companies.</li> <li>Experience in the insurance industry is preferred</li> <li>Ability to build trust and relationships on an enterprise level is essential</li> <li>Optimization of work processes. Knows the most effective and efficient methods to get things done, with a focus on continuous improvement</li> <li>Understanding and experience of customer service approach</li> <li>Flexibility and a willingness to learn</li> <li>Sound analytical skills, as well as strong decision-making and problem-solving aptitude</li> <li>Communication: Must be an exceptional communicator and able to make connections across the organization while working with employees and managers in multiple locations</li> <li>Educational and skills requirements: <ul> <li>The ideal candidate will have a Bachelor’s degree in Accounting, Finance, a related field, or the equivalent education and/or experience.</li> <li>Experience writing SQL queries preferred</li> <li>Experience developing and delivering training on Financial / Accounting Systems</li> <li>Nice to have experience with PeopleSoft Financials, MicroStrategy or similar systems </li> </ul> </li> </ul> <ul> <li>Overtime hours may be required</li> <li>Will require travel outside normal work location </li> </ul> <p>The Tokio Marine HCC Group of Companies offers a competitive salary and employee benefit package. We are a successful, dynamic organization experiencing rapid growth and are seeking energetic and confident individuals to join our team of professionals. The Tokio Marine HCC Group of Companies is an equal-opportunity employer. Please visit www.tokiomarinehcc.com for more information about our companies.</p>\n</div>\n\n </div>"}