{"job title": "Data Scientist", "company": "CBS Corporation", "city state": "– New York, New York", "rating": "3.5", "job description": "<strong> DESCRIPTION:</strong><br><br>This Data Scientist role requires experience in predictive and exploratory analytics, querying data systems, performing research and data manipulation. The Data Scientist will work closely with Digital Services, Research, Marketing, IT and Strategy &amp; Analysis teams to use data to help build research and digital analytic platform. We are looking for someone with strong statistical background who is passionate about analytics, thrives in an evolving environment, and brings an enthusiastic and collaborative attitude.\n<br><br>\nJob Responsibilities:\n\n<li>Build and execute analytics and reporting across platforms to identify user behavior and analyze trends, patterns, and shifts in user behavior, both independently and in collaboration with product managers and data analytics resources.</li>\n  \n<li>Develop best practices for configuring analytics technology, for analyzing user behavior on multiple platforms, and for collecting and interpreting data from multiple sources.</li>\n  \n<li>Develop experimental data models/ designs to help answer unforeseen questions that will influence decision-making in a rapidly changing business environment.</li>\n  \n<li>Communicate technical results to a wide variety of audiences.</li>\n<strong> QUALIFICATIONS:</strong>\n\n<li>Bachelor's degree in a quantitative field (e.g., Mathematical, Statistics etc.).</li>\n  \n<li>Strong background in statistics.</li>\n  \n<li>Experience creating models/analysis using machine learning techniques like clustering, association rules, sequential pattern matching etc.</li>\n  \n<li>Experience in data integration and modeling is required.</li>\n  \n<li>3 plus years of experience in digital analytics with a solid understanding of interactive marketing channels (e.g., search, social listening, paid and earned media, website, mobile apps, email marketing, mobile messaging).</li>\n  \n<li>Proficient in Omniture site catalyst reporting, Google Analytics, Flurry and social media platforms in addition to Nielsen data etc.</li>\n  \n<li>Demonstrated ability to query data sources directly (SQL and other query languages).</li>\n  \n<li>Proven ability to use R (or another statistical package).</li>\n  \n<li>Expertise in crafting presentations for specific or broad audiences.</li>\n  \n<li>Comfortable working both as part of a team, and independently.</li>\n  \n<li>Experience working with big data technologies is a plus.</li>\n  \n<li>Experience in text mining is a plus.</li>\n<strong> EEO STATEMENT:</strong>\n<br><br>\nEqual Opportunity Employer Minorities/Women/Veterans/Disabled"}