{"job title": "Data Scientist", "company": "DiverseLynx", "city state": "– Seattle, Washington", "rating": "4.0", "job description": "<strong> Job Description: Data Scientist</strong>\n<br>\n<strong> Job Location: Seattle, WA</strong> \n<br>\n<strong> Full time, Permanent</strong>\n<br><br>\nData Scientist with 5+ years' experience, including experience in implementing end to end large Analytics programs.\n<br>\nManufacturing and Aerospace domain experience will be preferred.\n<br>\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>Experience with Manufacturing data sets from Product Development, ERP, CRM, PLM, MES</li>\n<li>Experience in manufacturing domain</li>\n<li><strong> Strong working experience in Text Analytics, Machine Learning, Artificial Intelligence, Neural Network and Big data</strong></li>\n<li><strong> Knowledge of SQL, Cognos, Tableau R, Python, and Denodo, Talend, MongoDB, etc</strong> </li>\n<li><strong> Heavy use of SQL query language for complex database queries as well as data analysis, manipulation, and transformation.</strong></li>\n<li>Excellent communication &amp; team management skills</li>\n<li>Good written and verbal skills &amp; team skills</li>\n<li>Strong problem solving skills &amp; proactive attitude</li>\n</ul>\n\n<strong>Key Skills:</strong>\n\n\n<ul>\n<li>Experience on Text analytics model</li>\n<li>Experience in writing complex SQL queries.</li>\n<li>Data Mining and Web Scraping through real time data feeds.</li>\n<li>Evaluating the Cloud Infrastructure</li>\n<li>Implement Machine Learning and Forecasting analytics methods.</li>\n<li>Collaboration with other Data Scientists</li>\n</ul>\n\nDiverse Lynx LLC is an Equal Employment Opportunity employer. All qualified applicants will receive due consideration for employment without any discrimination. All applicants will be evaluated solely on the basis of their ability, competence and their proven capability to perform the functions outlined in the corresponding role. We promote and support a diverse workforce across all levels in the company.\n<br><br>"}