{"job title": "Data Scientist - Investment Team", "company": "Foresite Capital", "city state": "– San Francisco, CA, US", "rating": "4.8", "job description": "<div>\n<strong>About Us</strong> </div><br>\n\n<div>\nForesite Capital is a multi-stage healthcare and life sciences investment firm that applies rigorous scientific and data-driven approaches to investment analysis. The firm has $2.2 billion under management. Foresite Capital takes a collaborative approach to investing with its portfolio companies by providing a multidisciplinary team of scientists, engineers, analysts, and clinicians who understand the unique business models in healthcare in addition to capital. The company aims to address areas of great unmet clinical need over the long term by funding promising healthcare and life sciences businesses at all stages of their life cycles. Foresite Capital is based in San Francisco with an office in New York.</div><br>\n<div>\n<strong>Description</strong>\n<br><br>\nForesite is seeking a talented Data Scientist to join our growing investment-focused data team. This person will work closely with our research analysts, clinical group, and broader investment team to build models, analyses and tools that materially impact the business. The ideal candidate will be comfortable across the full data stack, and have the ability to take projects through to completion independently.</div><div>\n<strong>Responsibilities</strong> </div>\n\n<ul>\n\n<li>\nBuild reproducible backtests for proposed models / algorithms</li>\n<li>\nInvestigate, identify, and acquire internal / external datasets</li>\n<li>\nContribute to the deployment and implementation of internal-facing investment services</li>\n<li>\nDevelop and improve forecast models</li>\n<li>\nAssist the team with improvements to existing data infrastructure</li>\n<li>\nWork closely with the investment team to manage priorities</li>\n</ul>\n\n<div>\n<strong>Qualifications</strong></div>\n\n<ul>\n\n<li>\nBachelors degree in computer science, or related field, or equivalent training, fellowship, or work experience</li>\n<li>\n4+ years experience in data science, analytics and software engineering</li>\n<li>\n4+ years experience writing and optimizing SQL queries</li>\n<li>\nExpert knowledge of Python, Scala, or comparable programming language</li>\n<li>\nExpert understanding machine learning fundamentals</li>\n<li>\nFamiliarity and experience working with cloud databases</li>\n</ul>\n\n<div>\n<strong>Additional Relevant Skills</strong></div>\n\n<ul>\n\n<li>\nDistributed computing platforms (Spark, Hadoop)</li>\n<li>\nCloud computing platforms (AWS, Google Cloud Platform)</li>\n<li>\nData warehouses (Redshift, BigQuery)</li>\n<li>\nData modeling and visualization</li>\n<li>\nExperience in finance and accounting</li>\n<li>\nUnderstanding of healthcare and life sciences industry</li>\n</ul>"}