{"job title": "Data Scientist", "company": "Greene, Tweed &amp; Co.", "city state": "– Kulpsville, PA", "rating": "3.0", "job description": "Data Scientist\n<br><br>\nTracking Code\n<br><br>\n<strong>20121495</strong>\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nAt Greene, Tweed, you'll find the cutting-edge technology, world-class polymer expertise and endless advancement opportunities you'd expect from a multi-national industry leader. You'll find them all in an environment that embraces diversity in people and opinions, moves decision making to the point of impact, and celebrates your success.\n<br><br>\nIf you enjoy continuous learning and are excited about working with and creating technological solutions, explore career opportunities with Greene, Tweed.\n<br><br>\nWe are currently searching for a Data Scientist, based in our Kulpsville, PA headquarters, to help reinvent the way we collect, analyze and take appropriate business action upon our data.\n<br><br>\nResponsibilities include but are not limited to the following:\n<br><br>\n+ Develop predictive models that are insightful &amp; actionable - testing &amp; validating the accuracy &amp; functionality before transitioning to production environment\n<br><br>\n+ Manipulate and transform data into information that can be used by Managers to drive better business decisions\n<br><br>\n+ Define algorithms, validates &amp; deploys models to achieve business results\n<br><br>\n+ Use machine learning methods and advanced mathematical techniques to model &amp; predict business outcomes\n<br><br>\n+ Identify appropriate methods to conduct analyses on corporate data\n<br><br>\n+ Partner with Functional Managers to provide recommendations &amp; solutions that accelerate &amp; optimize operations procedures and actions\n<br><br>\n+ Collaborates with Data Architect &amp; Data Analysts to implement Business Intelligence tools for the Company\n<br><br>\n<strong>Required Skills</strong>\n<br><br>\n<strong>Required Skills:</strong>\n<br><br>\n+ Minimum 10 years of demonstrated analytical skills, including the ability to collect, organize, analyze &amp; disseminate significant amounts of information with attention to detail &amp; accuracy\n<br><br>\n+ A minimum of 5 years? experience working with BI tools required; Preference given to candidates who have worked with Qlik Sense/Qlik View\n<br><br>\n+ Proven experience manipulating data sets, designing databases, applying statistical analysis and developing predictive models to make strategic business recommendations required\n<br><br>\n+ Advanced programming skills (VBA, R, Python, etc.) required\n<br><br>\n+ Strong communication skills and the ability to collaborate effectively in a team environment required\n<br><br>\n<strong>Qualifications:</strong>\n<br><br>\n+ BS Degree required; Ideal candidate will have completed advanced degree, inclusive of coursework in Mathematics and/or Computer Science\n<br><br>\nNote: This Job Description in no way states or implies that these are the only duties to be performed by the employee occupying this position. Employees will be required to follow any other job-related instructions and to perform any other job-related duties requested by the Supervisor. All requirements are subject to change and updates.\n<br><br>\nWe offer a competitive benefits package that includes medical, dental, vision, life insurance, short term and long term disability insurance, 401K savings plan, paid time-off, tuition assistance and more, to meet the diverse needs of all employees and their family members.\n<br><br>\nGreene, Tweed, a Federal Contractor, is an equal opportunity employer of protected veterans and individuals with disabilities. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of disability or their protected veteran status.\n\n\n<ul>\n<li>*EOE Minorities/Females/Protected Veterans/Disabled**</li>\n</ul>\n\nNOTE: Greene, Tweed is not seeking assistance or accepting unsolicited resumes from search firms for employment opportunities, unless they have a written agreement for the position they are contacting us about. Regardless of past practice, all resumes submitted by search firms to any employee at GT without a valid written search agreement in place for that position will be deemed the sole property of Greene, Tweed, and no fee will be paid in the event the candidate is hired by Greene, Tweed as a result of the referral or through other means.\n<br><br>\nJob Location\n<br><br>\nKulpsville, Pennsylvania, United States\n<br><br>\nPosition Type\n<br><br>\nFull-Time/Regular"}