{"job title": "Data Scientist - Marketing", "company": "HelloFresh", "city state": "– New York, NY", "rating": "3.6", "job description": "HelloFresh delivers \"cook from scratch\" meal plans straight to your door, with easy to follow recipe cards and high quality, pre-portioned fresh ingredientssaving time and money that you can instead spend with your loved ones!\n<br><br>\nHelloFresh is the world's leading meal kit company and is expanding rapidly. Founded in November 2011, HelloFresh now operates in the U.S., the United Kingdom, Germany, the Netherlands, Belgium, Luxembourg, Australia, Austria, Switzerland, and Canada. HelloFresh delivers millions of meals to millions of customers across the globe. and listed in November 2017 at the German Stock Exchange in Frankfurt.\n<br><br>\n<strong><em><u>Data Science Department:</u> </em></strong>\n<br><br>\n<em>Embedded in the NYC Tech Hub, we are building a cross-functional team of data scientists, analysts and engineers with the mission to bring the modeling capabilities of our marketing organization to the next level.</em> <em>At HelloFresh believe that automation and Machine Learning can take our marketing efforts to the next level by marrying the right customer with the proper advertisement. We will accomplish this using technology on a large scale instead of using manual processes. We are actively investing in the right people, data, and infrastructure to support this vision.</em>\n<br><br>\n<strong><u>JOB DESCRIPTON:</u></strong>\n<br><br>\nWe are hiring a Data Scientist to work alongside marketing. Our vision is to build an automated platform directing our marketing initiatives on delivering the right food box at the desired price point to the front door of all our customers.\n<br><br>\nWe are currently developing 2 projects:\n\n<ul>\n<li>Optimization of audiences and targeting across our foodtech platforms</li>\n<li>A data-driven and ROI based, campaign testing machine</li>\n</ul>\n<strong>As a data scientist in NYC will</strong><strong><em>.</em> </strong>\n\n<ul>\n<li>Translate business problems into quantitative terms and present the results in a clear and effective manner through visualization and prototyping</li>\n<li>Collaborate closely with top management, data scientists and engineers from the larger international team to discover innovative ways of leveraging vast repositories of user generated data.</li>\n<li>Promote a data smart and data aware culture within a large international organization</li>\n</ul>\n<strong><em>At minimum, you have</em></strong>\n\n<ul>\n<li>M.Sc in a quantitative discipline, such as mathematics or computer science</li>\n<li>2 + years of relevant professional experience, ideally with an application to marketing. Ph.D. is a plus.</li>\n<li>A deep understanding of state of the art in machine learning and statistics (such as Generalized Additive Models (GAMs), Extreme Gradient Boosting Machines, Multivariate Hypothesis Testing, Clustering), in an applied commercial context</li>\n<li>A passion for using and developing open source software and a solid programming background ideally in <strong>Python / R</strong>.</li>\n<li>The skills to query, analyze and cluster data over huge datasets (e.g. EC2, Spark, S3, Spark-SQL)</li>\n<li>A sense of ownership: you take responsibility for your projects, and you make the difference working within a talented cross-functional team.</li>\n<li>Our team is diverse, high-performing and international, helping us to create a truly inspiring work environment in which you will thrive!</li>\n</ul>\n<em>It is the policy of HelloFresh not to discriminate against any employee or applicant for employment because of race, color, religion, sex, sexual orientation, gender identity, national origin, age, marital status, genetic information, disability or because he or she is a protected veteran.</em>"}