{"job title": "Data Scientist", "company": "mckesson", "city state": "– United States-Arizona-Scottsdale", "rating": "3.3", "job description": "<p>McKesson is in the business of better health and we touch the lives of patients in virtually every aspect of healthcare. At McKesson Specialty Health, our products and services span the full continuum of specialty patient care. From the initial phases of a product life cycle and the distribution of specialty drugs, to fully integrated healthcare technology systems, practice management support, and ultimately to patient care in the communities where they live, we empower the community patient care delivery system by helping community practices advance the science, technology and quality of care.</p>\n<p><br>We have a vision —that the long-term vibrancy of community care will be achieved through the leadership of physicians committed to clinical excellence and innovation, enabled by close collaboration with our organization and our deep clinical, operational and technological expertise.Every single McKesson employee contributes to our mission—by joining McKesson Specialty Health you act as a catalyst in a chain of events that helps millions of people all over the globe. You’ll collaborate on the products and solutions that help us carry out our mission to improve lives and advance healthcare. Working here is your opportunity to shape an industry that’s vital to us all.</p>\n<p><br>Join our team of leaders to begin a rewarding career.</p>\n<p> </p>\n<div><b>Position Summary</b></div>\n<div>The Data Scientist will provide in-depth advanced analytical insights while working in a cross-functional team environment to solve business problems. By providing critical analytics support, this person will work with the team to develop insights and analytics models to help the main stakeholders across Accumulator, Payer Intelligence, and Anomalous Activity. The role will require analytical skills and tactical responsibilities to provide insights and recommendations.</div>\n<div><b> </b></div>\n<div><b>Key Responsibilities: </b></div>\n<div><b> </b> </div>\n<div><b> </b> </div>\n<ul>\n<ul>\n<li>\n<div>Rapidly perform exploratory data analysis, generate and test working hypotheses, and uncover interesting trends and relationships </div></li>\n<li>\n<div>Analyze and model structured data and implement algorithms to support analysis using advanced statistical and mathematical methods from statistics, data mining, econometrics, and operations research</div></li>\n<li>\n<div>Develop Custom data models and use machine learning algorithms to appropriately address business problems. Must be comfortable deploying these models into a productionable software environment and be able to iteratively optimize these models to produce better results </div></li>\n<li>\n<div>Perform Advanced analytics techniques to mine unstructured data, using methods such as document clustering, topic analysis, named entity recognition, and document classification (machine learning and natural language processing is a plus) </div></li>\n<li>\n<div>Strong understanding of large database mining tools and statistical languages utilized to efficiently build approaches and execute on analytical use cases. Specific experience with Python, R, Spark, Hadoop (MapReduce, HBASE), Hive, Pig, Java, Trifacta, H2O, or Tableau. Knowledge of relational databases and SQL is required.</div></li>\n<li>\n<div>Communicate results and educate others through reports and presentations. Maintain a growth mindset and be open to learning about new technologies and methodologies in the data science/machine learning space. </div></li></ul></ul>\n<p><b>Minimum Requirements</b><br>5 years relevant experience.</p>\n<p><br><br><b>Additional Knowledge &amp; Skills</b><br></p>\n<ul>\n<li>Strong quantitative analysis background and experience in working with large, complex data systems to aggregate, organize, and prepare data for use in business analysis </li>\n<li>\n<div>Strong mathematical background with strong knowledge in at least one of the following fields: statistics, data mining, statistics, operations research, econometrics, and/or information retrieval (machine learning and natural language processing is a plus) </div></li>\n<li>\n<div>Deep experience in extracting, cleaning, preparing and modeling data </div></li>\n<li>\n<div>Knowledge of the healthcare industry</div></li></ul>\n<p><br><b>Education</b></p>\n<ul>\n<li>\n<div>Bachelor degree in Physics, Computer Science, Engineering, Statistics, Mathematics, Econometrics, or related fields</div></li></ul>\n<p><br><b>Benefits &amp; Company Statement</b><br>McKesson believes superior performance – individual and team – that helps us drive innovations and solutions to promote better health should be recognized and rewarded. We provide a competitive compensation program to attract, retain and motivate a high-performance workforce, and it’s flexible enough to meet the different needs of our diverse employee population.<br><br>We are in the business of better health and we touch the lives of patients in virtually every aspect of healthcare. We partner with payers, hospitals, physician offices, pharmacies, pharmaceutical companies and others across the spectrum of care to build healthier organizations that deliver better care to patients in every setting.<br><br>But we can’t do it without you. Every single McKesson employee contributes to our mission—whatever your title, whatever your role, you act as a catalyst in a chain of events that helps millions of people all over the globe. Talented, compassionate people are the future of our company—and of healthcare. At McKesson, you’ll collaborate on the products and solutions that help us carry out our mission to improve lives and advance healthcare. Working here is your opportunity to shape an industry that’s vital to us all.<br><br>McKesson is an equal opportunity and affirmative action employer – minorities/females/veterans/persons with disabilities.<br><br>Qualified applicants will not be disqualified from consideration for employment based upon criminal history.<br><br><b>Agency Statement</b><br>No agencies please.</p>"}