{"job title": "Data Scientist Intern", "company": "Monsanto Company", "city state": "– Saint Louis, Missouri", "rating": "4.0", "job description": "<p>We are seeking a motivated Data Scientist Intern. This position will be located in Chesterfield, Missouri, reporting to our Asia-Africa Pipeline Enablement Lead. </p><p></p><p>This position will develop solutions and accelerate breeding product testing and deployment. As part of our diverse and highly dynamic group, the intern will work side-by-side with teams of exceptional data analytics, data scientists, data manager, pipeline managers and breeders with diverse backgrounds. </p><p></p><p>The dates for this summer internship are May 3 August 2 of 2019. </p><p></p><p>Key Responsibilities: </p><ul><li>Build and validate predictive models incorporating key breeding data, soil, weather, and environmental data </li><li>Demonstrate the application of the models and deploy them to stakeholders</li></ul> <br> <div>Required Skills/Experience:</div>\n<ul>\n<li>\n<div>Advanced degree PhD/MS candidate in Computer Science, Statistics, Data Science, Mathematics, Computational Biology or related discipline</div></li>\n<li>\n<div>Proficiency in Machine learning and Statistics algorithms and concepts (Mixed Models, Random Forest, Deep Learning, SVM, etc.) </div></li>\n<li>\n<div>Strong programming skills in R, Python, SQL, Linux</div></li>\n<li>\n<div>Experience with cloud computing, such as Hadoop, Spark</div></li>\n<li>\n<div>Problem-solving ability and experience analyzing and presenting complex data </div></li>\n<li>\n<div>Organizational, interpersonal, and written and communication skills</div></li>\n<li>\n<div>Strong commitment to achieving results</div></li></ul>\n<p>Desired Skills/Experience:</p>\n<ul>\n<li>\n<div>Willingness to extend own data science and statistical interests to agriculture and/or experience working with agricultural/biological scientific data</div></li>\n<li>\n<div>Ability to solve challenging and complex analytical problems</div>\n<div> </div></li></ul>\n<p>Bayer successfully completed the acquisition of Monsanto in June 2018, bringing together Monsantos leadership in seeds and plant traits with Bayers leadership in chemical and biological crop protection. By joining forces, we will create even more extensive career opportunities for talent around the world. Were a global team working to shape agriculture through breakthrough innovation that will benefit farmers, consumers, and our planet.</p>\n<p> </p>\n<p>While we are now Bayer, we will continue to hire using separate career sites until we can integrate our career platforms. We invite you to explore the career opportunities available at the combined company by visiting advancingtogether.com/careers.</p>"}