{"job title": "Data Scientist", "company": "Nielsen", "city state": "– Tampa, FL", "rating": "3.6", "job description": "<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong><br>\n<div><strong>Data Scientist - 23258</strong>\n<br><br>\nData Science - USA Tampa, Florida\n<br><br>\n<strong>The Nielsen Company is the largest global measurement company in the world with unique measurement technologies, assets, and data that make it one of the most interesting and challenging places for a measurement or data scientist to work. We focus on what consumers watch, listen to, and buy in over 95 countries.</strong>\n<br><br>\n<strong>Data Science is core to what Nielsen does, and our research projects have high visibility in directly impacting the results of our business and our clients. This position is in the Behavioral Methods team within Nielsen’s Global Data Science organization. The Behavioral Methods team provides leadership and expertise across The Nielsen Company to develop innovative, statistically sound, and cost effective research methodologies in support of the strategic business initiatives. We play a pivotal role in designing best practices and approaches for data collection, respondent recruitment, and panelist retention.</strong>\n<br><br>\n<strong>Job Purpose:</strong>\n<br><br>\n<strong>Responsible for analyzing data and supporting the development of methodologies that will improve existing products or deliver new products to clients. Give input on test plan and analysis approach. Must be able to run all aspects of data validation. Will conduct data reviews with cross-functional teams. These products are associated with television, audio and mobile device measurement.</strong>\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n\n<li><strong>Give input and write test plans associated with the delivery of new client offerings. Attend team meetings and provide input on rules and edits associated with the processing of client data.</strong></li>\n<li><strong>Complete all aspects of data analysis as defined in the test plan. Share data cross-functionally throughout the data validation period. Where required, provide data summaries and documentation for external client review and Ernst and Young auditing review.</strong></li>\n<li><strong>Provide recommendations and reasoning for enhancements to core business products.</strong></li>\n<li><strong>Demonstrate proficiency using Python software and automate daily reporting of data throughout the data validation period.</strong></li>\n<li><strong>Attend team meetings and provide status throughout the course of product development. Work closely with engineering and operations personnel to define business and system requirements.</strong></li>\n<li><strong>Lead frequent data reviews with other Data Science teams to ensure that data validation has been thoroughly performed.</strong></li>\n<li><strong>Expand core competencies associated with statistical analysis and visualization of data results.</strong></li>\n<li><strong>Routinely create white papers outlining data validation outcomes and recommendations that will be shared with senior leaders in Data Science and Engineering.</strong></li>\n\n</ul>\n<strong>Required Qualification:</strong>\n<ul>\n\n<li><strong>BA/BS degree in statistics or mathematics.</strong></li>\n<li><strong>Strong quantitative analysis skills using statistical software such as Python or R.</strong></li>\n<li><strong>Working knowledge of Structured Query Language. (SQL)</strong></li>\n<li><strong>Experience working with databases and large data sets.</strong></li>\n<li><strong>Extensive knowledge of statistical methodologies including hypothesis testing, linear regression, modeling, simulation and analysis of variance.</strong></li>\n<li><strong>Proficient knowledge in project management required including ability to prioritize and manage multiple projects.</strong></li>\n<li><strong>High motivation with demonstrated capacity to work on multiple projects with set deadlines, under pressure.</strong></li>\n<li><strong>Collaborative team player with willingness and desire to work with cross-functional teams of varying sizes.</strong></li>\n<li><strong>Creative aptitude and ability and desire to explore opportunities for new research innovations.</strong></li>\n<li><strong>Excellent oral and written communication skills required for presenting to and collaborating with groups of diverse backgrounds.</strong></li>\n<li><strong>Ability to explain complex research concepts to individuals without a research background.</strong></li>\n<li><strong>Extensive knowledge of Microsoft Office and Google Suite applications (Docs, Sheets, Slides, Excel, and Powerpoint)</strong></li>\n\n</ul>\n<strong>Desired Qualification:</strong>\n<ul>\n\n<li><strong>MBA/MS or higher in a statistical, mathematical or technical field.</strong></li>\n<li><strong>Internship or employment experience associated with statistical data analysis associated with media/market research.</strong></li>\n<li><strong>Knowledge of large-scale, complex multi-stage surveys in Market Research or Government setting.</strong></li>\n\n</ul>\n<strong>#LI-US</strong>\n<br><br>\n<strong>About Nielsen:</strong>\n<br><br>\nNielsen N.V. (NYSE: NLSN) is a global performance management company that provides a comprehensive understanding of what consumers Watch and Buy. Nielsen’s Watch segment provides media and advertising clients with Total Audience measurement services across all devices where content — video, audio, and text — is consumed. The Buy segment offers consumer packaged goods manufacturers and retailers the industry’s only global view of retail performance measurement.\n<br><br>\nBy integrating information from its Watch and Buy segments and other data sources, Nielsen provides its clients with both world-class measurement as well as analytics that help improve performance. Nielsen, an S&amp;P 500 company, has operations in over 100 countries that cover more than 90 percent of the world’s population. For more information, visit www.nielsen.com\n<br><br>\n<em>Nielsen is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class.</em>\n<br><br>\n<strong>Job Type:</strong> Regular\n<br><br>\n<strong>Primary Location</strong>: Tampa,Florida\n<br><br>\n<strong>Secondary Locations:</strong> , , ,\n<br><br>\n<strong>Travel:</strong> Yes, 10% of the Time</div>"}