{"job title": "Data Scientist", "company": "Xylem", "city state": "– Morrisville, NC", "rating": "3.0", "job description": "Xylem (XYL) is a leading global water technology company committed to developing innovative technology solutions to the world?s water challenges. The Company?s products and services move, treat, analyze, monitor and return water to the environment in public utility, industrial, residential and commercial building services settings. Xylem also provides a leading portfolio of smart metering, network technologies and advanced infrastructure analytics solutions for water, electric and gas utilities. The Company?s more than 16,500 employees bring broad applications expertise with a strong focus on identifying comprehensive, sustainable solutions. Headquartered in Rye Brook, New York with 2017 revenue of $4.7 billion, Xylem does business in more than 150 countries through a number of market-leading product brands.\n<br><br>\nThe name Xylem is derived from classical Greek and is the tissue that transports water in plants, highlighting the engineering efficiency of our water-centric business by linking it with the best water transportation of all ? that which occurs in nature. For more information, please visit us at www.xylem.com .\n<br><br>\nSensus, a Xylem brand, helps a wide range of public service providers ? from utilities to cities to industrial complexes and campuses ? do more with their infrastructure to improve quality of life in their communities. We enable our customers to reach farther through the application of technology and data-driven insights that deliver efficiency and responsiveness. We partner with them to anticipate and respond to evolving business needs with innovation in sensing and communications technologies, data analytics and services. Learn more at sensus.com and follow @SensusGlobal on Facebook, LinkedIn and Twitter.\n\n\n<ul>\n<li>*The Role:** Sensus, a Xylem brand seeks to hire a Data Scientist with a desire to join a team delivering Big Data applications in the Cloud. We?re focused on helping utility companies visualize and make use of the petabytes of data coming in from their smart meters so they can lower costs and reduce consumption. This is a market poised for explosive growth and this team is ready to take advantage of it.</li>\n\n<strong><li>*Essential Functions** :</li>\n</strong></ul><strong>\n\n</strong>\n<br>\n+ Data curation\n<br><br>\n+ Develop statistical modeling techniques for pattern recognition problems.\n<br><br>\n+ Develop code in R, Python, Java, or other languages for statistical analysis, optimization, and simulation.\n<br><br>\n+ Build models that maximize performance and accuracy.\n<br><br>\n+ Strategic planning and project management.\n\n\n<ul>\n<li>*Minimum Qualifications:**</li>\n</ul>\n\n+ MS Statistics, Machine Learning, Operations Research, Applied Math; or equivalent.\n<br><br>\n+ 2 ? 5 years of data science experience.\n<br><br>\n+ Experience with statistical and mathematical software\n<br><br>\n+ Proven ability to develop system prototypes.\n<br><br>\n+ SQL skills\n<br><br>\n+ Excellent oral and written communication skills.\n<br><br>\n+ Strong documentation skills.\n<br><br>\n+ Understanding of machine learning techniques and the ability to invent.\n<br><br>\n+ Big data experience- Hadoop, Spark, Map-reduce, Hive, etc.\n<br><br>\n+ Experience with Agile methodology or similar lean startup approach to building software.\n\n\n<ul>\n<li>*Preferred Qualifications:**</li>\n</ul>\n\n+ Experience with time series or signal processing analytics.\n\n\n<ul>\n<li>*Physical Demands:**</li>\n</ul>\n\n(The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.)\n<br><br>\n+ Light lifting (20-25 lbs.), office environment\n<br><br>\n+ Regularly required to sit or stand, reach, bend and move about the facility\n\n\n<ul>\n<li>*Work Environment:**</li>\n</ul>\n\n(The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.)\n<br><br>\n+ Office: Standard office equipment; work usually performed in an office setting free from any disagreeable elements.\n<br><br>\n+ Standard weekly job hours: 40 hours\n\n\n<ul>\n<li>*EOE/Females/Minorities/Protected Veterans/Disabled**</li>\n</ul>"}