{"job title": "Senior Data Scientist", "company": "Amazon", "city state": "– San Francisco, CA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAmazon Music<br> <br> Imagine being a part of an agile team where your ideas have the potential to reach millions. Picture working on cutting-edge consumer-facing products, where every single team member is a critical voice in the decision-making process. Envision being able to leverage the resources of a Fortune-500 company within the atmosphere of a start-up. Welcome to Amazon Music, where ideas are born and come to life as Amazon Music Unlimited, Prime Music, and so much more. <br> <br>As a Senior Data Scientist in Music, you'll discover insights that drive marketing, content and product strategy for our Amazon Music streaming service. You will have the opportunity to work with a huge and rapidly growing data set generated by mobile, desktop and home music streaming application usage interactions and music consumption behaviors.<br><br>Come innovate with the Amazon Music team!<br><br> As a successful data scientist at Amazon Music, you need to understand the streaming music industry and the meanings of data across Marketing, Product, Finance, Curation and Content. You will expose and measure current performance in marketing acquisition and product engagement. You will identify specific and actionable opportunities to solve existing business problems at Amazon Music, and collaborate with engineering, research, and business teams for future innovation. You need to be a sophisticated user of advanced quantitative techniques for answering specific business questions, and an expert at synthesizing and communicating insights and recommendations to audiences of varying levels of technical sophistication. <br><br> Major responsibilities include:<br><br>Translate / Interpret<ul><li>Complex and interrelated datasets describing customer behavior, messaging, content, product design and financial impact.</li></ul>Measure / Quantify / Expand<ul><li>Retrieve, synthesize, and present critical data in a format that is immediately useful to answering specific questions or improving system performance.</li><li>Analyze historical data to identify trends and support decision making.</li><li>Improve upon existing methodologies by developing new data sources, testing model enhancements, and fine-tuning model parameters.</li><li>Provide requirements to develop analytic capabilities, platforms, and pipelines.</li><li>Apply statistical or machine learning knowledge to specific business problems and data.</li></ul>Explore / Enlighten<ul><li>Formalize assumptions about how users are expected to behave, create statistical definition of the outlier, and develop methods to systematically identify these outliers. Work out why such examples are outliers and define if any actions needed.</li><li>Given anecdotes about anomalies or generate automatic scripts to define anomalies, deep dive to explain why they happen, and identify fixes.</li><li>Make Decisions and Recommendations</li><li>Build decision-making models and propose solution for the business problem you defined</li><li>Conduct written and verbal presentation to share insights and recommendations to audiences of varying levels of technical sophistication.</li><li>Utilize code (Python/R/SQL) for data analyzing and modeling algorithms</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Bachelor’s Degree in Statistics, Applied Mathematics, Operation Research, Economics or a related quantitative field.</li><li>5+ years of experience with data querying languages (e.g. SQL), scripting languages (e.g. Python), or statistical/mathematical software (e.g. R, Weka, SAS, Matlab)</li><li>Experience articulating business questions and using quantitative techniques to arrive at a solution using available data</li><li>Demonstrable track record of dealing well with ambiguity, prioritizing needs, and delivering results in a dynamic environment</li><li>Depth and breadth in quantitative knowledge. Excellent quantitative modeling, statistical analysis skills and problem-solving skills. Sophisticated user of statistical tools.</li><li>Experience processing, filtering, and presenting large quantities (Millions to Billions of rows) of data</li><li>Combination of deep technical skills and business savvy enough to interface with all levels and disciplines within our customer’s organization</li><li>Excellent verbal and written communication skills with the ability to effectively advocate technical solutions to research scientists, engineering teams and business audiences</li><li>Ability to develop experimental and analytic plans for data modeling processes, use of strong baselines, ability to accurately determine cause and effect relations</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Masters Degree in Statistics, Applied Mathematics, Operation Research, Economics or a related quantitative field.</li><li>Experience in music industry</li><li>Experience in analyzing user behavior in a subscription business model</li></ul><br>Amazon.com is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. <br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}