{"job title": "Data Scientist", "company": "Booz Allen Hamilton Inc.", "city state": "– Charlottesville, VA", "rating": "3.7", "job description": "<strong>Job Number: R0034457</strong>\n<br><br>\nData Scientist, Mid<br><br><strong>The Challenge:</strong>\n<br><br>\nAre you excited at the prospect of unlocking the secrets held by a data set? Are you fascinated by the possibilities presented by the IoT, machine learning, and artificial intelligence advances? In an increasingly connected world, massive amounts of structured and unstructured data open up new opportunities. As a data scientist, you can turn these complex data sets into useful information to solve global challenges. Across private and public sectors from fraud detection, to cancer research, to national intelligence you know the answers are in the data.\n<br><br>\nWe have an opportunity for you to use your analytical skills to improve critical science and technology intelligence analysis for National Ground Intelligence Center. This role entails the development and application of data mining, analysis, aggregation, fusion, and visualization in order to process, analyze, and integrate data and information that facilitates research, analysis, production and dissemination of Scientific and Technical Intelligence (S&amp;TI), and General Military Intelligence (GMI) assessments relating to foreign ground forces weapons and C4ISR systems; including research &amp; development, current and emerging technologies, current and future capabilities, operations and vulnerabilities. The work involves the application of intelligence principles in concert with a practical knowledge of information technology to provide technical mission support.\n<br><br>\nYoull work closely with your customer to understand their questions and needs, and then dig into their data-rich environment to find the pieces of their information puzzle. Youll implement innovative methodologies that make data available in actionable, standard, and usable forms and use the right combination of tools and frameworks to turn sets of disparate data points into objective answers to help that enable and enhance data-driven, all-source ST&amp;I research, analysis, assessment, production and dissemination and assist both tactical and strategic leaders make informed decisions. Youll provide your customer with a deep understanding of their data, what it all means, and how they can use it. Join us as we use data science for good in support of Army Intelligence and the warfighter.\n<br><br>\nEmpower change with us.\n<br><br>\n<strong>Build Your Career:</strong>\n<br><br>\nAt Booz Allen, we know the power of analytics and were dedicated to helping you grow as a data analysis professional. When you join Booz Allen, you can expect:\n<ul>\n<li>access to online and onsite training in data analysis and presentation methodologies, and tools like Hortonworks, Docker, Tableau, and Splunk</li><li>a chance to change the world with the Data Science Bowlthe worlds premier data science for social good competition</li><li>participation in partnerships with data science leaders, like our partnership with NVIDIA to deliver Deep Learning Institute (DLI) training to the federal government</li>\n</ul>\nYoull have access to a wealth of training resources through our Analytics University, an online learning portal specifically geared towards data science and analytics skills, where you can access more than 5000 functional and technical courses, certifications, and books. Build your technical skills through hands-on training on the latest tools and state-of-the-art tech from our in-house experts. Pursuing certifications? Take advantage of our tuition assistance, on-site bootcamps, certification training, academic programs, vendor relationships, and a network of professionals who can give you helpful tips. Well help you develop the career you want, as you chart your own course for success.\n<br><br>\n<strong>You Have:</strong>\n<br><br>\n-3+ years of experience with statistics, math, or data analysis and science\n\n\n<ul>\n<li>Experience with processing, tagging, and indexing unstructured, semi-structured, and structured classified and unclassified data sets\n<br><br>\n-Experience with developing research designs, including formulating testable questions, identifying and defining key concepts and variables, and matching appropriate methods to problems\n<br><br>\n-Experience with data project management, including cleaning and preparing data, and creating, structuring, and maintaining data sets\n<br><br>\n-Knowledge of data analysis, including manipulating datasets and interpreting findings using a mix of programs and environments, such as R, Python, and Matlab and techniques, such as text and pattern analysis, classification, change and anomaly detection, time-series, regression, geospatial, or social network analysis\n<br><br>\n-Experience with creating mathematical models and coding in R, Python, and Matlab\n<br><br>\n-Experience with using text and Web analytics for establishing and expanding keyword searches and using bibliometric analysis tools to perform horizon scans and deep dives into identified S&amp;T research fields\n<br><br>\n-Active TS/SCI clearance\n<br><br>\n-BA or BS degree and 8 years of experience in a professional work environment or MA or MS degree</li>\n</ul>\n\n<strong>Nice If You Have:</strong>\n\n\n<ul>\n<li>BA or BS degree in Statistics, Mathematics, or Data Analytics or Science preferred; MA or MS degree in Statistics, Mathematics, or Data Analytics or Science a plus\n<br><br>\n<strong>Clearance:</strong></li>\n</ul>\n\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; TS/SCI clearance is required.\n<br><br>\nWere an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change."}