{"job title": "Senior Data Scientist", "company": "Bounce Exchange", "city state": "– New York, NY", "rating": "4.7", "job description": "We are working on a blend of e-commerce applications of predictive modeling, recommendation systems, test/control studies, and identity resolution. To do this, the team is using the cutting edge technology and machine learning. Today, the team works at internet scale, with access to data coming from the interaction of hundreds of millions of users with a large number of e-commerce and best-known news media sites.\n<br><br>\nEach team member is a creative self-starter, who loves working with driven, smart peers. Does this sound like you? Let's chat.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n<li>Work both independently and collaboratively with other data scientists, engineers, designers, UX researchers, and product managers to accomplish complex tasks that deliver demonstrable value to BounceX clients</li> \n\n<li>Develop and implement machine learning framework(s) to power various BX products</li> \n\n<li>Prototype, build and productize machine learning predictive models to optimize BX email product and to expand BX identity solution.</li>\n</ul>\n<strong>Qualifications:</strong>\n\n<ul>\n<li>MS degree in a quantitative field with 3+ years of relevant experience, or Ph.D. degree in a quantitative field</li> \n\n<li>Working knowledge and experience with machine learning in academic settings</li>\n<li>At least 1-year active work implementing ML in a non-academic environment</li>\n<li>Experience analyzing small datasets using languages like R, Python or Matlab</li> \n\n<li>Experience implementing algorithms from scratch in a low-level language like C, C++, Java, or similar</li>\n<li>Experience analyzing large structured and unstructured datasets using tools like Hive, Spark, or similar</li>\n</ul>\nBounceX is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status.\n<br><br>\n<strong>About Us:</strong><br>\n<div>Founded in 2012, BounceX's People-Based Marketing (PBM) cloud is the first new revenue channel with scale in 10 years. With offices in NYC and London and named the fastest growing software company in America by Inc Magazine in 2016, we currently power thousands of digital properties, expanding across a multitude of industries. For the first time, brands and publishers have a meaningful paid channel outside of Google and Facebook. We are trusted by global enterprises such as Forever21, Avis, Lufthansa, CNN, Uniqlo, Comcast and many more.\n<br><br>\nBounceX is built on the belief that the success of a company is rooted in the strength of its team, so we've created a collaborative, inclusive environment that encourages employees to love coming to work. World-class benefits like paid family leave, career coaching and donation matching are just a few of the things that make BounceX different. But it's the people who truly stand out, each owning their piece of the company with unrivaled dedication, creativity, and tenacity.</div><br>\n\n<div>\n<div>Ryan Urban (CEO) on the Future of Digital Marketing</div>\n<br>\n<div>Startups to Watch in 2018\n<br><br>\nInc. 5000 Fastest Growing Software Companies\n<br><br>\nDeloitte Tech Fast 500\n<br><br>\nFortune's Best Workplaces in Tech\n<br><br>\nCrain's Best Places to Work in NYC</div>\n</div>\n<br>"}