{"job title": "Data Scientist", "company": "CyberCoders", "city state": "– Berkeley, CA", "rating": "3.8", "job description": "Data Scientist <div>\nIf you are a Data Scientist with experience, please read on! Located in beautiful Berkeley, CA, we have a passion for healthcare and are singularly focused on improving our healthcare system for all stakeholders - especially patients - by helping our clients make sense of complex data so they can answer their most challenging questions. We also believe that our distinctive capabilities shouldn't perpetuate the inertial 'zero sum game' where success is measured by how much the winners take from the losers. Only in this way we will be able to positively impact the delivery of healthcare while building a successful company.</div>\n<br>\nTop Reasons to Work with Us<div>\n\n\n<ul>\n<li>HUGE room for Growth</li>\n<li>Very Competitive Salary</li>\n<li>Great Work/Life Balance</li></ul></div>\n\n\nWhat You Need for this Position<div>\nAt Least 3 Years of experience and a Phd knowledge of:\n\n\n<ul>\n<li>Minimum 2-5 years work experience as a Data Scientist or Fellow working with Structured and Unstructured Data.</li>\n<li>PhD in a quantitative discipline: Computer Science, Statistics, Applied Mathematics, Operations Research, Engineering.</li>\n<li>Strong programming experience in Python.</li>\n</ul>\n\nPrevious Experience with TB to PB size Databases and Lakes.\n\n\n<ul>\n<li>Working knowledge of healthcare systems and healthcare terminology</li>\n<li>Expert in analyzing large complex, multi-dimensional data sets with a variety of tools</li>\n<li>Ability to thrive and demonstrate constant applied learning in highly complex, interdisciplinary, and dynamic work environment</li></ul></div>\n\n\nWhat's In It for You<div>\nFor your hard work, you will be rewarded with a strong compensation package that includes a competitive base salary (D.O.E), excellent medical, dental and health benefits and other cool perks.\n<br>\nInterviews are ongoing so, please FULLY COMPLETE THE APPLICATION QUESTIONS INCLUDING THE SELF ASSESSMENT ASAP! Complete applications will receive priority!</div>\n<br>\n<div>\nSo, if you are a Data Scientist with experience, please apply today!</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}