{"job title": "Staff Data Scientist", "company": "Ellie Mae", "city state": "– Pleasanton, CA", "rating": "4.5", "job description": "<div>Ellie Mae (NYSE:ELLI) is the leading cloud-based platform provider for the mortgage finance industry. Ellie Maes technology solutions enable lenders to originate more loans, reduce origination costs, and reduce the time to close, all while ensuring the highest levels of compliance, quality and efficiency. Visit EllieMae.com to learn more.</div><br>\n<div>We have a gold mine of over ten years and petabytes of historic data for the mortgage industry waiting to be turned into insights and innovative data products. The company is very well positioned to introduce innovative AI solutions that would disrupt the mortgage industry.</div><div>We are looking for an experienced data scientist to push the boundaries of excellence as part of the new Data Science group at Ellie Mae. Its a ground floor opportunity that will have an industry-wide impact.</div>As a Staff Data Scientist, you will:\n\n<ul>\n<li>Lead discovery processes with key stakeholders to identify the problem definition at a technical level based on business requirements and expected outcomes. Lead the process to define business-specific performance metrics.</li><li>Reach out to mortgage lending process experts to develop domain knowledge needed for a given project.</li><li>Dive into mining our extensive data. Conduct comprehensive data analysis.</li><li>Engineer features with high predictive power.</li> <li>Design experiments, test hypotheses, and build models. Conduct advanced data analysis and design highly complex algorithms using advanced statistical, predictive and machine learning modeling techniques.</li> <li>Develop efficient Machine Learning (ML) solution architectures and workflows.</li><li>Work with the larger project team to produce fast prototypes or proof-of-concept demos during data product development.</li><li>Collaborate with development teams on deploying models to production environment to support ML-driven product features.</li> <li>Monitor and improve or maintain performance over time for models deployed in production.</li><li>Communicate project status and results to technical and non-technical audiences.</li><li>Evangelize adoption of Machine Learning and Artificial Intelligence within the company and across the industry.</li><li>Participate in the definition and refinement of Ellie Maes data engineering strategy informing the companys overall product development strategy.</li>\n</ul>\n\nQualifications and Skills\n\n<ul>\n<li>Programming experience using Python (preferred) and/or R. Strong experience with common Machine Learning tools and development platforms.</li><li>Strong background in Machine Learning, Data Mining and Statistical Analysis.</li><li>Experience in Image Processing and Natural Language Processing.</li><li>A keen understanding of Data Science workflows and methodologies.</li><li>Masters or Ph.D. degree in Mathematics, Statistics, Computer Science, Machine Learning or a related field.</li><li>Excellent oral and written communication skills.</li><li>Unending enthusiasm to learn.</li><li>5-8 years of relevant quantitative and qualitative research and analytics experience.</li>\n</ul>\n\nWant to go above and beyond? Here are a few other things you may have:\n\n<ul>\n<li>Experience with Data Visualization tools and Query languages.</li> <li>Prior exposure to Mortgage Lending process</li>\n</ul>\n\n<div>##LI-TM1</div><br>\n<div>Ellie Mae is an equal opportunity and affirmative action employer. Women, minorities, people with disabilities, and veterans are encouraged to apply.</div><br>\n<div>We do not accept resumes from headhunters, placement agencies, or other suppliers that have not signed a formal agreement with us.</div>"}