{"job title": "Data Science Manager", "company": "KeepTruckin", "city state": "– San Francisco, CA", "rating": "4.7", "job description": "<div><strong>About Us</strong>:</div><br>\n<div>KeepTruckin is on a mission to connect the worlds trucks. With the leading ELD and fleet management platform, we are bringing the trucking industry online and fundamentally changing the way freight is moved on our roads.</div><br>\n\n<div><strong>The numbers tell the story:</strong></div><li>The KeepTruckin network is composed of more than 200,000 trucks and is expected to grow to 400,000 by end of 2018.</li>\n<li>We grew from $1 million to more than $50 million in annual recurring revenue in 12 months, among the fastest growing SaaS companies ever.</li>\n<li>Our Glassdoor rating is 4.8 stars. We have built an incredible culture with high trust and transparency, where people feel empowered to do their best work.</li>\n\n<br>\n<div><strong>About the job</strong>:</div><br>\n<div>Were looking for a Data Science Manager to establish and grow our in-house data science team. As the first data scientist, you would be responsible for identifying opportunities where data can be analyzed in meaningful ways and use the results to guide corrective and/or optimization efforts. You would help identify and implement tools to effectively analyze data and in the long run steer the organization towards adopting a more data-driven approach.</div>Responsibilities:\n\n<ul>\n<li>Work with product and business teams to identify important questions and answer them with data</li><li>Apply statistical models and quantitative analysis on large datasets to measure and identify areas for improvement/optimization in the product</li><li>Lead the effort for collection of new data and refinement of existing data sources</li><li>Identify and help implement tools to analyze this data effectively</li><li>Educate and steer the organization towards adopting a more data-driven approach</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n<ul>\n<li>Bachelor's degree in Computer Science or a quantitative field (e.g., Maths, Economics, Statistics)</li><li>4+ years experience in Data Science, Machine Learning and Data Analysis</li><li>Expert in applied statistics such as distributions, statistical testing, regression, etc</li><li>Excellent understanding of machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision Forests, etc.</li><li>Expert in data-oriented scripting (e.g. SQL) and statistical programming (e.g., R, Python)</li><li>Working knowledge of Amazon Web Services is a big plus</li>\n</ul>\n\n<div>KeepTruckin is a rapidly growing startup headquartered in San Francisco. We offer fantastic benefits, a phenomenal office culture, unlimited PTO, and a stocked kitchen. As an equal opportunity employer, we are committed to diversity in the workforce. We consider qualified applicants without regard to sexual orientation, gender identity, race, veteran or disability status.</div>"}