{"job title": "Data Scientist", "company": "Performics", "city state": "– Chicago, Illinois", "rating": "2.8", "job description": "Company Description<br><br>Are you ready to re-invent digital marketing? At Performics, were accelerating the great missions of our clientsbrands like Allstate, Toyota, Verizon, and Kohlsin the ever-evolving world of search engine marketing, display media, social media and affiliate marketing.\n<br><br>\nIf youre ready to move at the speed of Google, Facebook, and Twitter, have an entrepreneurial spirit, and get excited about finding smarter ways to do things, wed love to meet you. Well give you the tools, support, and freedom to lead, innovate and grow. In fact, Advertising Age, Crain's and Tribune have named Performics a \"Best Place to Work,\" and Forrester Research dubbed us one of 2012's \"Top Digital Agencies.\" We hire exceptional people for our global headquarters in Chicago and U.S. locations in Atlanta, Los Angeles, New York, Seattle, and San Francisco. Our international presence spans 31 markets (and growing) including regional hubs in London and Singapore.<br><br>Job Description<br><br>Performics is looking for a talented Data Scientist for an exciting opportunity on our Analytics &amp; Technology team. You will participate in designing data models for a wide array of clients across several industries. Novel statistical approaches developed to solve business challenges will contribute to client solutions via in-house proprietary applications. Candidates will be considered based on their experience in statistical analysis, programming capabilities among several software packages, and success in independently managing large-scale client projects to delivery.<br><br><strong>Responsibilities:</strong>\n\n<ul>\n<li>Collaborate with Performics teams to define and answer clients most pressing business questions to drive meaningful analytical results</li>\n<li>Performing analyses such as data model development, attribution modeling, advertising performance analysis, website analytics, text analysis, etc.</li><li>Work directly with Performics teams to design, implement, and execute data solutions, learning agendas, and roadmaps improve marketing performance</li><li>Work directly on updating and maintaining back-end models for analytics products</li><li>Participate and contribute to practice development sessions with new approaches and innovations in data science and associated fields.</li><li>To enjoy being challenged and solve complex problems on a daily basis</li><li>Excellent oral and written communication skills</li><li>Ability to work in teams and collaborate with others to clarify requirements</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n<ul>\n<li>Bachelor's Degree in Mathematics, Computer Science/Engineering, Statistics or related quantitative field</li>\n<li>5-7 years of data engineering or data science experience in R; SAS and Python are a plus</li>\n<li>Proficiency SQL and/or NoSQL; Tableau is a plus</li>\n<li>Experience in retail, health insurance and/or financial services preferred</li>\n<li>Proven leadership ability and strong, impactful client relationship experience</li>\n<li>Strong knowledge of one or more analytics disciplines including CRM, Predictive Modeling, Marketing Mix Modeling and Attribution, Business Intelligence &amp; Data Warehousing</li>\n<li>Active interest / knowledge in disciplines such as Artificial Intelligence, Neural Networks, Machine Learning, Big Data etc. is a plus</li>\n<li>Strong consulting experiences. Able to quickly evaluate complex client issues and demonstrate experiences in solving clients business challenges with analytic solutions</li>\n<li>Excellent communication skills including the ability to influence senior decision makers within agencies and clients</li>\n</ul>\n\nAdditional Information<br><br>All your information will be kept confidential according to EEO guidelines."}