{"job title": "Data Scientist", "company": "RELX Group", "city state": "– Raleigh, NC", "rating": "3.5", "job description": "Data Scientist\n\n\n<ul>\n<li>*Category:**</li>\n<li>*Location:** Raleigh, North Carolina, United States</li>\n<li>*What you?ll do:**</li>\n</ul>\n\n+ Drive product decisions using data, working closely with the product team\n<br><br>\n+ Teach the product team how to access, use, and make decisions based on data\n<br><br>\n+ Design core metrics to serve as guidance for product team\n<br><br>\n+ Communicate on high-level goals to stakeholders in the executive team\n<br><br>\n+ Mine data for insights\n<br><br>\n+ Analyze experiments using statistical rigor to ensure confidence\n<br><br>\n+ Propose experiments using insights\n<br><br>\n+ Define data structures for maximum effectiveness\n<br><br>\n+ Communicate complex ideas about our product through visual aids like dashboards\n<br><br>\n+ Use models to make predictions about user behavior\n<br><br>\n+ Design and execute human evaluation tasks for search, recommendations, or other algorithmic content\n\n\n<ul>\n<li>*About us:**</li>\n</ul>\n\nWe?re a small, scrappy data science team that is trying to change the culture at LexisNexis to be more data driven. We?ve already proved the value of AB testing, now we need to go to the next level. We need someone who understands product, user experience, and engineering, as well as serious data science chops. We?re looking for someone with a proven track record of delivering insights and using those insights to change the business in some meaningful way. This role is really about setting the direction of data-driven decision making at LexisNexis for years to come. Join us and we can really have a huge impact on how LN does business.\n\n\n<ul>\n<li>*What we?re looking for:**</li>\n</ul>\n\n+ Determination, focus, attention to detail, and motivation to succeed\n<br><br>\n+ The ability to communicate complex ideas clearly and succinctly\n<br><br>\n+ Experience with SQL, R and/or Python, and dashboarding tools\n<br><br>\n+ Experience with Elasticsearch, Tag Managers, Google Analytics (or similar analytics packages)\n<br><br>\n+ Experience designing tasks for crowdsourcing or human evaluation\n<br><br>\n+ Keen statistical sensibilities\n<br><br>\n+ The ability to explain why this is funny: https://xkcd.com/1132/ (or not)\n<br><br>\n+ Can see all sides of an argument and use data to settle the difference\n<br><br>\n+ Experience with machined learned models (can you see the random forest for the gradient boosted decision trees?)\n<br><br>\n+ Product experience\n<br><br>\n+ 2+ years in industry\n<br><br>\n+ Masters+ in CS, Stats, Psychology, Economics, or some other field where you worked with lots of data\n<br><br>\n+ Proven track record of driving business outcomes through data"}