{"job title": "Data Scientist", "company": "Shift Technologies", "city state": "– San Francisco, CA", "rating": "4.1", "job description": "<div><div><strong>About Shift</strong></div><div>We believe car buying should be fun, fair, and accessible to everyone. We’ve set out to transform an industry, using technology to bring transparency and convenience to the car buying process.</div> <br>\n<div>And we aren’t stopping there. We aim to bring that same transparency and convenience to car ownership too, with payments, maintenance, and insurance in one easy app. At Shift, we’re building the tools that empower people to buy, own, and sell the cars that make life go.</div><br>\n<div>Shift is bringing transparency and trust to the used car industry. Data is core to this transformation, from building best-in-class pricing, to loan decisioning, to logistics optimization, to in-product recommendations. If you’re passionate about using data to fix an enormous, antiquated industry, you’ll fit right in.</div><br>\n<div><strong>The Data</strong></div><div>Millions of cars are bought and sold in the US every year, but knowing exactly how much your car is worth is a challenge. We believe that fixing the used car industry requires providing customers with fair, detailed pricing reports in beautiful, easy-to-understand interfaces. By combining as much data as we can get our hands on, from the millions of listings available online, to car auction sales, to every vehicle’s specific repair history, we’re building the most accurate, transparent pricing tool in the industry.</div><br>\n<div><strong>The Impact</strong></div><div>As a two-sided marketplace, serving both car buyers and sellers, our vehicle data and pricing models are core to the business. As the first data scientist at Shift, you’ll have a direct, immediate impact on the success of the company. Initial projects will include exploring data, building models, informing product decisions, overseeing experiments, and collaborating closely with engineers on our pricing team. Over time, you’ll play a crucial role in growing and mentoring a team of data scientists that will be involved in nearly every initiative at Shift, including lending, fraud, lead scoring, user acquisition, optimal resource allocation, vehicle routing, and more!</div><br>\n<div><strong>The Team</strong></div><div>We are a friendly, helpful community of engineers with a diverse background of experience. We espouse autonomy, trust, and learning from each other. The engineering team is excited to have grown to the capacity to support our first full-time data scientist. We believe that embedding data science into our engineering team provides a unique opportunity for significant autonomy and influence fully supported by the engineering resources you need.</div></div><div><div>We're looking for someone who will:\n\n<ul>\n\n\n<ul>\n<li>Build and own data science models in collaboration with the engineering and business teams</li><li>Suggest, run, and analyze experiments across the company</li><li>Be part of a team…Help develop our data architecture, and work with our engineering team to guide our build out of data pipelines and machine learning infrastructure</li><li>Use strong academic background to build high performing machine learning models</li></ul>\n</ul>\n\n</div>\n<br>\n<div><div>The ideal candidate will have:\n<br>\n\n\n<ul>\n\n\n<ul>\n<li>Knowledge of machine learning techniques, especially intuition for their benefits and drawbacks in real-world applications</li><li>Experience wrangling data to explore new model features, build visualizations, and clean data</li><li>0- 3 years of experience working as a data scientist and experience working with multiple data architectures in production</li><li>Proficiency in a statistical computing language (such as R or Python) and SQL.</li><li>Strong knowledge of statistics and experimental design</li><li>Curiosity, desire to learn, passion for providing a great product to customers</li><li>Experience mentoring other data scientists, as well as excitement at being an individual contributor to start</li><li>B.A. / B.S. / M.Sc. or equivalent degree in quantitative field. PhD a plus</li></ul>\n</ul>\n\n</div>\n</div><div><div>Bonuses (but please still apply even if you don’t have them!):\n\n<ul>\n\n\n<ul>\n<li>Production engineering experience. If you have engineering experience, that’s great, and basic coding skills are a must, but you’ll also be strongly supported by engineering for the heavy lifting, code-wise.</li><li>Experience with automotive data. Love cars? Great! Never bought or owned a car? Also great! We’ve got car experts you can learn from.</li><br>\n<div>If you’re not sure you fit all these descriptions, please still apply! We hire people, not lists of requirements, and we’d love to talk to you!</div></ul>\n</ul>\n\n</div>\n</div><div><div><strong>On diversity</strong></div><div>Our company depends on balance and equality — between buyers and sellers, among employees, and in our relationships with customers.</div><br>\n<div>Our mission to evolve car ownership and transform an industry is a challenging one. It can only be achieved by a team of diverse problem-solvers — engineers, designers, business people — from the same broad demographics as our customers.</div><br>\n<div><strong>Why join now?</strong></div><div>We’ve built a small but highly talented team backed by $120 million in funding from investors like DFJ, Goldman Sachs, and BMW iVentures. We’ve got product-market fit, but there’s still a ton of room to innovate and make your mark on the product and on the company.</div> <br>\n<div>Shift is the Bay Area’s #1 seller of used cars with $100 million in cars sold per year. We’re serving most of California and are gearing up to scale to new markets. With a solid business model and no clear winner in our space yet, this is a hugely exciting time to join the team.</div></div></div>"}