{"job title": "Data Scientist", "company": "Telenor", "city state": "– ", "rating": "3.6", "job description": "Advanced Analytics&amp; AI at Telenor Sweden is looking for a passionate Data Scientist. As a key player in the team you will part of Data Product team. You work closely with Data Engineers and other Data Scientists to solve interesting challenges:\n<ul>\n<li>Privacy anonymization techniques</li><li>Exploring and applying statistical modeling over very interning internal and external data sources.</li><li>Developing analytical data products for internal and external customers</li><li>Collaboration with Telenor and external research institutes and companies</li>\n</ul>\nIn fact, what makes this role interesting is the fact that in Data Product team you will face a number of analytical challenges that no one has solved before. You will be part of a startup like products while you get corporate support.\n<br><br>\n<strong>Who are we?</strong>\n<br><br>\nAnalytics and AI is providing analytics as a service to the whole company, but is also working independently with new ideas such as data products, predictive modeling, and AI. Most of the team members are data scientists or data analysts with strong background in statistics, Machin Learning. All dedicated to transforming Telenor into a data-driven, well-informed company, with smart solutions for everything from customer service to product development and marketing. We are dedicated, long-experienced, helpful, and fun, and we expect you to challenge us every day!\n<br><br>\n<strong>What will you do?</strong>\n<br><br>\nTo become a successful Data Scientist in this role you need hands on knowledge in developing predictive models, applying both supervised and unsupervised techniques. We work in small, highly collaborative agile cross-functional teams. You should feel comfortable to overcome uncertainties with experimenting and prototyping. Your mission and goals will be clear yet you will have high level of autonomy to find proper solution. You should be self-driven, proactive, and ambitious to find the way to reach them.\n<br><br>\n<strong>You?</strong>\n<ul>\n<li>Relevant university degree (Engineering, Statistics or Physics)</li><li>3 - 5 years of experience in working with machine learning techniques (classification and regression models, clustering, boosted trees, experience with deep learning is a merit)</li><li>Having worked with large spatiotemporal datasets and/or in the telco domain is an advantage</li><li>Hands-on experience in data technologies and programming language such as SQL, Spark, Python, Scala, R preferably in AWS cloud environment</li><li>Basic data engineering skills</li><li>Good communication skills</li><li>Have personal interest to learn and evolve in Analytics and AI</li><li>We are solving real life problem. Therefore, having common sense about Scandinavian society and businesses is essential</li>\n</ul>\nYou will have high level of autonomy. This comes together with responsibility and accountability. We inspire, we keep what we promise, we show respect to customers and colleagues and we make things easier - we are Telenor. We expect you to share same principle values.\n<br><br>\n<strong>We Offer</strong>\n<ul>\n<li>Telenor continuously works for improved diversity. It is important for us that our employees reflect our customers' diversity. Therefore, Telenor strives for diversity among our employees in terms of gender and nationality</li><li>International experience in other parts of the Group and Telenor Research</li><li>The employee program allows you to become a shareholder in Telenor by buying shares at a discounted price</li><li>6 weeks holiday</li><li>You will have access to huge number of courses and development programs</li><li>Healthcare benefits, health tests, discounted prices for home cleaning services, babysitter, food bags and several gym chains.</li>\n</ul>\n<strong>Do you want to create the future with us?</strong> \\\"Apply Now\\\". We work continuously with this recruitment and therefore want your application as soon as possible. We look forward to receiving your application before October 1st.\n<br><br>\n<strong>Do you have a question?</strong> Contact me (Aminreza Pournorouz), recruiting manager, Aminreza.Pournorouz@telenor.se.\n<br><br>\n<strong>Location:</strong> Stockholm\n<br><br>\n<strong>Employment:</strong> Full time employment"}