{"job title": "Data Scientist", "company": "Thumbtack", "city state": "– San Francisco", "rating": "4.5", "job description": "Thumbtack is a local services marketplace that connects customers with the right professionals for anything they need done. Every day we rally around the impact Thumbtack has on people’s lives - from house cleaners, to yoga instructors to general contractors, we’re helping small businesses grow and thrive. Join our growing team in the quest to build THE destination for anything you need done.<br><br><strong>About the Data Science Team</strong><br><br>At Thumbtack, the Data Science team combines big data with innovative modeling and analysis techniques to shape the system logic that serves millions of customers and professionals. Challenging problems include:\n\n<ul>\n<li>Design innovative A/B testing techniques. Understanding the true impact of a test in Thumbtack’s marketplace requires well-designed separation among millions of interconnected customers and professionals, and sound methodology to interpret test results in the face of such extensive interconnection.</li>\n<li>Model complex relationships in the presence of many confounding factors. Predictive modeling problems are everywhere across our product. Our team works to scope, design and implement machine learning models to support Thumbtack’s products.</li>\n</ul>\n\n<strong>About the Role</strong><br><br>We're looking for data scientists with deep expertise in statistics, machine learning, optimization, and/or building data products. Our process gives you full ownership over the projects you tackle, so you should be a person who dreams big, then executes well.<br><br><strong>Responsibilities</strong>\n\n\n<ul>\n<li>Design and execute experiments, collect and analyze test data to guide launch decisions</li>\n<li>Architect and deploy machine learning systems to production</li>\n<li>Design and implement metrics that align with company goals</li>\n<li>Analyze a wide variety of data: structured and unstructured, observational and experimental, with the goal of influencing system designs and implementations</li>\n<li>Advise engineering and product teams on sound statistical practices</li>\n\n</ul>\n\n<strong>Must-Have Qualifications</strong> \n\n\n<ul>\n<li>M.S. or equivalent experience in Computer Science, Engineering, Statistics, or other relevant technical field</li>\n<li>Minimum of 4 years of industry experience in engineering</li>\n<li>Expert knowledge of probability and statistics, including experimental design, predictive modeling, optimization, and causal inference</li>\n<li>Familiarity with machine learning concepts: regression and classification, clustering, feature selection, feature engineering, curse of dimensionality, bias-variance tradeoff, neural networks, SVMs, etc.</li>\n<li>A strong sense of connecting technical work to product impacts</li>\n<li>Expert knowledge of a statistical computing language such as R or Python/pandas</li>\n<li>Excellent written and verbal technical communication skills</li>\n<li>Familiarity with a scripting language and/or shell scripting</li>\n</ul>\n\n<strong>Nice-to-Have Qualifications</strong>\n\n\n<ul>\n<li>Preferred: Ph.D. in Computer Science, Engineering, Statistics, or other relevant technical field</li>\n<li>Preferred: Experience with large-scale distributed systems</li>\n<li>Preferred: Experience with tools in the Hadoop ecosystem such as Hive, Pig, or Spark</li>\n</ul>\n\n<strong>More About Us</strong><br><br>Thumbtack is a local services marketplace that connects customers who need to get things done with local, skilled professionals who can help. From plumbers and painters to DJs and personal trainers, Thumbtack helps millions of customers find the right professional for their project in over 1,000 categories. Founded in 2009 and headquartered in San Francisco, Thumbtack is backed by over $250 million in investment from Sequoia Capital, CapitalG, Tiger Global Management, Javelin Investment Partners and Baillie Gifford.\n\n<ul>\n<li>Learn more about our culture, benefits, and perks</li>\n<li>Learn more about engineering at Thumbtack</li>\n<li>Follow Thumbtack on LinkedIn</li>\n</ul>\nThumbtack embraces diversity. We are proud to be an equal opportunity workplace and do not discriminate on the basis of sex, race, color, age, sexual orientation, gender identity, religion, national origin, citizenship, marital status, veteran status, or disability status. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\n<br><br>\n#LI-POST"}