{"job title": "Senior Data Scientist, Revenue Optimization", "company": "Unity Technologies", "city state": "– San Francisco, CA", "rating": "3.8", "job description": "The Unity Monetization Team builds advertising and In-App Purchasing solutions and technologies used in hundreds of thousands of apps. Our Monetization team creates the technology infrastructure and systems that manages the delivery of relevant content to hundreds of millions of users every day, making tens of thousands of decisions every second. Our data systems process massive data sets to develop machine-learning models and analytics that maximize the effectiveness and profitability of unified in-app purchase and advertisement solution. We are continuously striving to build disruptive and powerful solutions to enable game developers to be more successful.\n<br><br>\nWe are looking for a Senior Data Scientist who has a keen business sense and an exceptional background in science and programming. In this role, you will work as a part of an international data science team to create best-in-class targeting and decision-making mechanisms. You will get to develop the processing, services and algorithms on various machine learning aspects, from providing ideas to developing procedures in production. You are comfortable with quick-paced cycle of development and you have the business acumen to understand what needs to be done and why.\n<br><br>\nThis role is located onsite at the Unity office in San Francisco, CA.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Working machine learning challenges in implementing algorithms and building infrastructure to run these in production environments in scalable and reliable way</li>\n<li>Implementing algorithms, knowing and understanding Python/Scala + Tensorflow/PyTorch/Keras, Spark/Samza/Flink, Druid/Cassandra/Redshift, and Data structures, data distribution and storing</li>\n<li>Understanding and applying probabilistic methods, different deep learning and reinforcement learning concepts</li>\n<li>Working closely with the product team to come up with areas of improvement</li> \n</ul>\n<strong>Requirements</strong>\n\n<ul>\n<li>BS/MS/PhD in Computer Science, Data Science, Machine Learning, Math, Physics or equivalent experience</li> \n\n<li>Minimum 3 to 7 years of relevant work experience</li>\n<li>Knowledgeable about the machine learning trade-offs and model evaluation</li>\n<li>Interest in emergent technologies, machine learning and AI</li>\n<li>Experience implementing in machine learning algorithms, predictive modeling, and decision making systems in real-time environment is a plus</li>\n<li>Experience in programmatic, mobile advertising and games is preferred</li>\n</ul>\n<strong>Who We Are // About Unity</strong>\n<br><br>\nUnity is the creator of the world's most widely-used real-time 3D (RT3D) development platform, providing content creators around the world with the tools they need to build rich, interactive 2D, 3D, VR and AR experiences. In fact, apps made with Unity reach 2.7 billion devices worldwide, and were installed more than 24 billion times in the last 12 months.\n<br><br>\nThe global engineering team keeps Unity at the forefront of technology and working alongside partners like Magic Leap, Google, Facebook, Oculus and Microsoft ensures optimized support for the latest technology and platforms. Unity is powering the real-time revolution, expanding beyond games and breaking into other industries including automotive, film, architecture, engineering, construction and more.\n<br><br>\n<em>Unity is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. Therefore, we provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, or any other protected status in accordance with applicable law. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know.</em>\n<br><br>\n<em>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</em>\n<br><br>\n<em>Headhunters and recruitment agencies may not submit resumes/CVs through this Web site or directly to managers. Unity does not accept unsolicited headhunter and agency resumes. Unity will not pay fees to any third-party agency or company that does not have a signed agreement with Unity.</em>\n<br><br>\n<em> #LI-MH1</em>"}