{"job title": "Data Scientist", "company": "Worldpay", "city state": "– Cincinnati, OH", "rating": "3.0", "job description": "GENERAL FUNCTION: Join team dedicated to providing actionable insights and identifying emerging risks, trends and opportunities for Finance and business leaders across the organization. Conduct high-impact research and analytics using sophisticated testing and modeling techniques to address most pressing business issues and questions. Provide thought leadership in navigating ambiguity and solving problems. Will take a lead role in testing and modeling in a big data environment.\n<br><br>\n<strong>ESSENTIAL DUTIES &amp; RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>Play a lead role in developing emerging financial analytics to drive results and help influence business decisions.</li>\n<li>Serve as thought leader and analytic partner to address high priority issues across lines of business, both proactively and as requested.</li>\n<li>Create insightful financial reviews and reporting to identify and illustrate the key stories and trends in the numbers and supplement financial schedules.</li>\n<li>Analyze business performance, make recommendations for improvements and measure progress.</li>\n<li>Help guide sound financial forecasting and planning reflecting identification and projection of key drivers.</li>\n<li>Prepare presentations and discussion documents to highlight business issues and opportunities.</li>\n<li>Establish and foster working relationships with peers and leadership in Finance and across lines of business.</li>\n<li>Partner with Business Intelligence team and Finance leads to drive towards the most accurate data possible.</li>\n<li>Help share learnings and best practices across portfolios.</li>\n<li>Provide guidance and mentorship to junior analysts and team members less experienced in analytics.</li>\n</ul>\n\n<strong>MINIMUM KNOWLEDGE, SKILLS AND ABILITIES REQUIRED:</strong>\n<br><br>\nEducation: Bachelor's degree required. Relevant Masters preferred.\n<br><br>\nExperience: Typical hire requires minimum of three years of experience with proven results using analytics to drive business decisions, ideally in a Finance role.\n<br><br>\n<strong>Other Skills:</strong>\n\n\n<ul>\n<li>Strong self-starter who can drive forward individually and as part of a team.</li>\n<li>Experience with advanced methods for testing and validation, market segmentation, A/B testing, multi-level mixed effects modeling, advanced time series analysis, SEM, GMM, DS/GE, constrained optimization</li>\n<li>Preferred tools: Hadoop, SQL, R, Stata, Matlab.</li>\n<li>Demonstrated ability to navigate ambiguity and excel in a fast-pasted environment with few established processes or frameworks. Resourceful and can-do attitude.</li>\n<li>Passion for using problem solving skills to drive towards accurate and actionable business insights.</li>\n<li>Proven ability to tailor approach in order to partner effectively across the organization.</li>\n<li>Excellent communication and team skills necessary to influence across the organization, especially without formal authority.</li>\n</ul>\n\n<strong>WORKING CONDITIONS:</strong>\n\n\n<ul>\n<li>Normal office environment with little exposure to dust, noise, temperature and the like.</li>\n<li>Extended viewing of CRT screen.</li>\n</ul>\n\nEqual Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}