{"job title": "Data Scientist", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\n<br>Do you want to bring \"science\" to a full stack team that builds cool data visualizations and insights for advertisers? Imagine building a metric that advertisers obsess about. Amazon Self Service Performance Ads is one of the fastest growing business. Our mission is to help advertisers understand the value of their advertising in Amazon. We are tasked to build new metrics that will help advertisers to reach their goals whether they want to measure their customers' value, reach new customers, improve sales or expand their brands. It doesn't stop here, we are looking into cohort or peer benchmarking as well.<br><br>To support this growth and mission, we are looking for a an awesome data scientist to help us derive new actionable insights and metrics. We are looking for someone to help us differentiate our adverising business through data vs our competitors. Our ideal candidate will complement the entrepreneurial spirit of our team by inventing new insights with even more cooler data visualizations. On top of this, the candidate should possess good commnunication and writing skill to convey the idea clearly as cross team collaboration would be frequent for this role. And of course, have a proven track record of utilizing various techniques of unsupervised and supervised learning on large scale data sets to define and scope business problems.<br><br>This is a chance to get in on the ground floor for what is becoming a huge area of growth for Amazon’s advertising business. Join Amazon's advertising team today, make history, and transform customer’s experiences.<br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>B.S. in Computer Science, Information Retrieval, Machine Learning, Statistics, Mathematics, or related discipline</li><li>At least 3 years of utilizing various techniques such as attribution modeling, feature selection, clustering, pattern recognition, time series</li><li>Strong foundation in data mining and data analytics techniques</li><li>Writes and communicates well,</li><li>Familiarity with big data tools such as Hadoop, Spark, SQL, etc.</li><li>Experience on data visualization like Tableau or Amazon QuickSight.</li><li>Comfortable with Python/Java/R/Hive/Matlab/SQL</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Experience in deep learning</li><li>At least 3 yrs of domain experience in online advertising</li><li>Published paper on descriptive, prescriptive or predictive analytics</li><li>Experience with Jupyter</li><li>Interest on user experience</li></ul><br><br>Amazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation. <br><br><br><br><br><br><br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}