{"job title": "Principal Applied Scientist", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAre you passionate about leveraging data to deliver actionable insights that impact daily marketing activities at Amazon? The Customer Targeting team in Amazon is seeking a Research Scientist to join our team to develop models for optimizing the performance of Amazon’s marketing initiatives across channels and advertising formats. You have experience applying modern machine learning methods to answer key business questions, make strategic and tactical recommendations for change, and work with business leaders to drive these to production. You are entrepreneurial and able to work in a highly collaborative environment. <br> <br> This role requires an individual with strong quantitative modeling skills and experience using statistical methods. The successful candidate will be a self-starter comfortable with ambiguity, with strong attention to detail, an ability to work in a fast-paced and ever-changing environment. You will be expected to:<br> · Leverage knowledge of statistics and optimization to frame decision-making problems for determining marketing spends across channels.<br> · Build statistical models required to measure the impact of cross-channel spend<br> · Predict future customer behavior and business conditions through machine learning and predictive modeling. <br>· Use optimization tools to recommend optimal spend across channels<br>· Use analytical and predictive techniques to build models for optimizing targeting. <br> · Present proposals and results in a clear manner backed by data and coupled with actionable conclusions.\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· Graduate degree (MS or PhD) in statistics or engineering.<br> · Ability to research, identify, evaluate, and implement potential changes to complex algorithms.<br>· Expertise applying statistical modeling and optimization theory it to solve business problem.<br>· Ability to simplify complex technical concepts and explaining modeling approaches and outcomes to business leaders with the right level of detail. <br> · Experience using R, MATLAB, and/or Python is required.<br>· Hands-on experience using Big Data Technologies<br> · Comprehensive and deep knowledge of a relevant field of research, such as machine learning. <br>· Familiarity with one modern programming language such as C, C++, C#, Java, or Perl.<br> · 4+ years of experience presenting data-focused research to upper management.\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· Programming skills in Java, C/C++.<br> · Proven ability at looking at solutions in unconventional ways; sees opportunities to innovate and can lead the way.<br> · An eye towards continuous process improvement, including the ability to innovate and simplify.\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}