{"job title": "Applied Scientist, Home Innovation Team", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nIn the US 65% of households (or 79.7 million homes) own a pet. 60% of these pet owners consider their pets to be family members. We are the Pets Tech Team - a group of engineers, product managers and designers focused on helping pet owners discover and purchase the right products for their pets. Our customers care for their pets, and Amazon cares too. The business is growing fast, and most important the team is building features that impact hundreds of millions of customers!<br> <br> THE CHALLENGES WE WILL TACKLE <br> As with every project within Amazon, we work backwards from our customer's needs, address the problems they meet and innovate on new technologies. Our team will tackle some tough problems such as: <br> * Simplify the process of choosing the right products for your pet through searching, browsing, and recommendations. <br> * Personalize customers' search and shopping experiences to help them find useful products for their pets. These preferences will be automatically inferred or directly declared by our customers. <br> * Make Amazon a trusted resource for all the pet products, by better understanding pet product attributes. <br> * Provide expert advice and information to help guide our customers in their decision making process.<br> <br> We are a tightly knit group that share our experiences and help each other succeed. We love hard problems and like to move fast in a growing team and changing environment. We use data to guide our decisions and we always push the technology and process boundaries of what is feasible on behalf of our customers. The most successful members of our team are obsessed with helping our customers in creative ways, bring clarity to ambiguity through data driven experimentation and have bias for action. If that sounds like an environment you like, join us.<br> <br> You will be an Applied Scientist. The work that we will do in our team will succeed only if we make full use of the Amazon data and help our customers find the right products for their preferences &amp; needs. You will be at the core of this effort - working to improve the product descriptions, the search algorithms, creating new experiences and personalization algorithms. It will require skill in understanding complex user scenarios, finding and implementing the right algorithms and ultimately a data driven approach to deliver results.<br> <br><br>Major responsibilities:<br><ul><li>Develop machine learning and analytical techniques for intelligent information retrieval/classification system to solve business problems.</li><li>Design, develop and deploy highly scalable machine learning models.</li><li>Analyze and understand large amounts of Amazon’s historical business data.</li><li>Working closely with software engineering teams to build machine learning based features &amp; products</li><li>Establish scalable, efficient, automated processes for large scale data analyses, model development, model validation and model implementation</li><li>Track business impact of the science work and providing clear updates</li><li>Mentor others in the use of ML techniques</li></ul><br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>A PhD in CS machine learning, Operational research, Statistics or in a highly quantitative field</li><li>5+ years of hands-on experience in predictive modeling and large data analysis</li><li>5 years SAS/R/Python/Matlab/SQL experience</li><li>2+ years industrial experience in an analysis or research role with progressively increasing responsibility</li><li>2+ years of experience in scripting for data analysis (Perl, Awk, Python, etc)</li><li>Eager to learn new algorithms, new application areas and new tools.</li><li>Excellent communication skills</li><li>Strong skills in problem solving, programming and computer science fundamentals</li><li>Strong algorithm development experience</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Ph.D. in an analytical area such as Mathematics, Statistics, Computer Science, Physics, Engineering or similar</li><li>10+ years of industry experience in predictive modeling and large data analysis</li><li>Experience with personalization, ranking, NLP and information retrieval algorithsm</li><li>Strong skills with SAS/R/Matlab and SQL</li><li>Strong skills with Spark/Perl/Python(or similar scripting language) and Java/C++</li><li>Solid knowledge of statistics and probability</li><li>Experience in designing and implementing information retrieval, web mining and neural network and other classification algorithms.</li><li>Experience with large scale data analysis tools such as Spark, Hadoop, etc. AWS experience is a plus.</li><li>Big thinker that can take broad visions and concepts and develop structured plans, actions and measurable metrics and then execute those plans</li></ul>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}