{"job title": "Machine Learning Scientist, Amazon Alexa", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAlexa is the Amazon cloud service that powers Echo, the groundbreaking Amazon device designed around your voice. We believe voice is the most natural user interface for interacting with the web services and applications. Alexa uses a suite of foundational machine learned (ML) classifiers such as Conditional Random Fields, Hidden Markov models, and Deep Neural Networks (DNNs). <br> <br> A Senior Machine Learning Scientist with our Alexa team will help drive Alexa’s core deep learning technologies. A successful candidate will be expected to: <br> <br> · Innovate and execute on foundational ML algorithms that spans Deep Learning and data-efficient learning techniques such as Transfer Learning (i.e. applying learning from one task to another), Single-/Zero-Shot learning (i.e. learning from a small number of labeled samples), and Unsupervised Learning<br> · Partner with engineering teams to productize enhancements and new ML algorithms for large-scale application<br>. Help interview and hire other scientists and engineers<br><br>. Mentor other scientists and engineers, review and guide their work, help develop roadmaps for the team, provide coaching for career development<br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· Bachelor's, Master's, or PhD in Computer Science or equivalent field<br> · 12+ years of combined academic and industry experience <br> · 5+ years experience in fundamental ML and Deep Learning\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· PhD with a strong academic record<br> · Deep knowledge in speech or natural language understanding<br> · Proven track record for the successful delivery of results<br> · Demonstrated experience as technical lead<br> · Excellent written and verbal communication skills with the ability to present complex technical information in a clear and concise manner to a variety of audiences<br> <br> Amazon is an Equal Opportunity-Affirmative Action Employer - Women/Minority/Disability/Veteran/Gender Identity/Sexual Orientation<br> <br> <br><br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}