{"job title": "Data Scientist, Senior", "company": "American Bureau of Shipping", "city state": "– Houston, TX", "rating": "2.6", "job description": "<strong><u>Job Capsule:</u></strong><br>\n\n<div>The Senior Data Scientist analyzes complex and unstructured data using state-of-the-art data science methods for data driven decision making. This role uses knowledge of data science methods and applies analytics to solve real world problems. He/She will develop applications, collaborate actively across the organization and with senior management to accomplish various objectives.</div> <br>\n<div>Company: American Bureau of Shipping\n<br><br>\n#LI-DNP\n</div>\n<br>\n<div><strong><u>Job Duties/Roles:</u></strong></div> <br>\nApply advanced data science concepts to deliver data driven digital offerings and insights\n<br>\nUtilize knowledge of modern data driven methods and domain understanding to support the creation of new product and services\n<br>\nCollaborate with digital team and with other departments such as digital, services, class, engineering, etc. to develop digital products in the areas such as maintenance services improvement, event prediction\n<br>\nBe able to write independent source code, validate and test for model quality assessment and improvement\n<br>\nKnowledge of data architectures and database design\n<br>\nExperienced in applying system identification methods like kalman filters, particle filters, etc. to real world problems\n<br>\nKnowledge and applied experience in machine learning and artificial intelligence methods\n<br>\nDevelop data collection efforts for data quality improvement, in both existing and new data streams to support overall business goals\n<br>\nSupport organizational decision-making based on the results of data analytics efforts\n<br>\nBe able to think independently and work as part of a matrix team to achieve common goals\n<br>\nComfortable working independently on data engineering, pre-processing and data preparation tasks to prepare data for further analysis\n<br>\nGenerate Intellectual Property for the company\n<br>\nEvaluate and partner with external customers, vendors, university relations, and other teams\n<br>\nStay current in the field of advanced analytics and take initiative to apply new technologies\n<br>\n<div><strong></strong>\n</div><div><strong><u>Qualifications:</u></strong></div> <br>\nMaster’s Degree in Data Science, Business, Computer Science or other relevant field\n<br>\n5-8 years of relevant experience in data / analytics\n<br>\nStrong written and verbal communications skills\n<br>\nExperienced in working as part of multi-faceted teams\n<br>\nExperienced in System Identification, Machine Learning and other data science technologies like Artificial Intelligence, Risk Analysis and Statistical methods\n<br>\nSpecialties in utilizing data in developing physics-based and time-series models\n<br>\nExperience should include work with applications such as Python, Matlab, R, or similar\n<br>\nExperience using database architectures such as SQL, NoSQL, or similar\n<br>\nFamiliarity with distributed storage and processing for Big Data (e.g. Hadoop or similar)\n<br>\nAbility to quickly adapt and learn new domain\n<br>\nDisplay an entrepreneurial mind set and think practical, ‘out of box’ solutions<br>\n\n<div>We are proud to be an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status\n<br><br>\nCompany: American Bureau of Shipping\n<br><br>\n#LI-DNP\n</div>"}