{"job title": "Data Scientist - Hedge Fund", "company": "Averity", "city state": "– New York, NY", "rating": "5.0", "job description": "Are you an established Data Scientist looking to lead all data science functions at a brand-new hedge fund here in NYC? Do you want to have enormous impact on a company’s business decisions and growth?\n<br><br>\n<strong>What's the Job?</strong>\n<br><br>\nAs the first Data Scientist at our organization, you will be using your hands-on model building, algorithm development, extensive coding experience and Machine Learning techniques to develop advanced algorithms to generate insights that will be used to drive business decisions across our company. You will report directly to our Head of Strategy as well as having a direct line with the CEO, and will collaborate closely with other senior level executives.\n<br><br>\nProjects will be wide ranging, but the initial focus on domains such as real estate acquisitions, asset management, private equity, and re-insurance. The ideal candidate is able to work on these projects end to end, from identifying solutions, preparing the data, performing analysis from that data, and discussing the insights generated with both internal and external stakeholders as well as investors. Out-of-the-box thinkers will enjoy the opportunity to look at things that they didn’t think to look at as you will be constantly tapping into untouched resources.\n<br><br>\n<strong>Who are we?</strong>\n<br><br>\nStill in “stealth mode,” we’re a new hedge fund that led by veterans in the investment management space. Our current pipeline is focused on the types of industries that have led us to our initial successes, and we have fully fleshed out plans to explore new and emerging markets as we continue to expand. We have a vast amount of resources and capital at our disposal, and are at the genesis of our first stage of hyper-growth.\n<br><br>\n<strong>What Skills Do We Need?</strong>\n<ul>\n<li>Hands-on experience building machine learning algorithms in Python</li> </ul>\n\n<ul>\n<li>Willing and able to be hands on with prepping data sets to be used for analysis through traditional data engineering methods, ETL</li></ul>\n\n<ul>\n<li>Strong business acumen, with a track record of consulting with non-technical audiences, including internal and external stakeholders</li> \n</ul>\n<strong>Compensation</strong>\n<ul>\n<li>$150,000 - $200,000 (depending on experience)</li> </ul>\n\n<ul>\n<li>Full Benefits (medical, dental, vision)</li> </ul>\n\n<ul>\n<li>Retirement/401(k) Plan</li> </ul>\n\n<ul>\n<li>Unlimited PTO</li> </ul>\n\n<ul>\n<li>Great work / life balance</li> \n</ul>\n<strong>What's In It For You?</strong>\n<br><br>\nWe’re a nose to the grindstone hedge fund with a startup mentality. We just opened our brand-new office right in midtown Manhattan, an entire floor with many empty desks that need to be filled. We’re planning on tripling in size by the end of the year, and looking for those who want to enter in at the ground floor of something really special. The possibilities are endless, and the impact of your work will reverberate across our entire company."}