{"job title": "Digital Insights Data Scientist", "company": "CGI Technologies and Solutions, Inc.", "city state": "– New York, NY", "rating": "NA", "job description": "<ul>\n<li>*Digital Insights Data Scientist**</li>\n<li>*CGI-experience the commitment**</li>\n</ul>\n\nFind similar career opportunities\n<br><br>\nCategory:Analytics and Emerging Digital Technologies\n<br><br>\nCity:New York, New York, United States\n<br><br>\nPosition ID:J0218-1383\n<br><br>\nEmployment Type:Full Time\n\n\n<ul>\n<li>*Meet our professionals**</li>\n<li>*CGI: An employer of choice**</li>\n<li>*Position Description:**</li>\n</ul>\n\nWe are looking for an experienced data architect with in-depth, hands-on knowledge of foundational data architectures such as data warehouses, ETLs and in-memory OLAP models, as well as experience in NoSQL and cloud implementations. In this role, you will work directly with client stakeholders and an team of engineers, architects and thought leaders to discover, design, build and implement an exciting variety of mission critical, line of business applications as well as cutting-edge cloud, big data and predictive analytics solutions\n\n\n<ul>\n<li>*Your future duties and responsibilities:**</li>\n</ul>\n\n? Data Lake and Big Data Analytics Architecture\n<br><br>\n? Modernization of existing Data Warehouse Platform to new generation architecture\n<br><br>\n? Data Architecture implementation on various cloud platforms such as Azure, AWS and Google\n<br><br>\n? Architecture experience with Hadoop/Oracle/SAS implementation\n<br><br>\n? Cross Functional industry experience desired\n\n\n<ul>\n<li>*Required qualifications to be successful in this role:**</li>\n</ul>\n\n? 15+ years of professional solution development and design experience\n<br><br>\n? Experienced with NoSQL topologies using tools like Hadoop, Cassandra, Mongo, etc\n<br><br>\n? In-depth knowledge of data warehousing, ETL/ELT and in-memory/cube use cases and patterns\n<br><br>\n? Comfortable using self-service reporting solutions such as Tableau, Qlikview and Business Objects\n<br><br>\n? Knowledgeable of cloud and hybrid-cloud implementations including IaaS, PaaS and SaaS\n<br><br>\n? Strong analytical and reasoning skills that result in clear, robust, flexible architectures\n<br><br>\n? Proven ability to drive complex design and development efforts in an agile environment\n<br><br>\n? Skill at crystalizing requirements into clear priorities, estimates, tasks and deliverables\n<br><br>\n? Drive to make others great though collaboration, example and mentoring\n<br><br>\n? Passion to deliver craftsman-quality work both individually and as part of a team\n<br><br>\n? Exemplary communication skills with both technical and non-technical stakeholders\n<br><br>\n? Desire to rapidly grow competencies use new skills to design and implement solutions\n<br><br>\n? Requires travel to East Coast Clients (NY, NJ, CT and MA)\n<br><br>\n<strong>\\#L1-JD1</strong>\n\n\n<ul>\n<li>*Skills:**</li>\n</ul>\n\n+ Data Warehousing\n<br><br>\n+ Hadoop Hive\n\n\n<ul>\n<li>*What you can expect from us:**</li>\n<li>*Build your career with us.**</li>\n</ul>\n\nIt is an extraordinary time to be in business. As digital transformation continues to accelerate, CGI is at the center of this change?supporting our clients? digital journeys and offering our professionals exciting career opportunities.\n<br><br>\nAt CGI, our success comes from the talent and commitment of our professionals. As one team, we share the challenges and rewards that come from growing our company, which reinforces our culture of ownership. All of our professionals benefit from the value we collectively create.\n<br><br>\nBe part of building one of the largest independent technology and business services firms in the world.\n<br><br>\nLearn more about CGI at www.cgi.com .\n<br><br>\nNo unsolicited agency referrals please.\n<br><br>\nCGI is an equal opportunity employer.\n<br><br>\nQualified applicants will receive consideration for employment without regard to their race, ethnicity, ancestry, color, sex, religion, creed, age, national origin, citizenship status, disability, medical condition, military and veteran status, marital status, sexual orientation or perceived sexual orientation, gender, gender identity, and gender expression, familial status, political affiliation, genetic information, or any other legally protected status or characteristics.\n<br><br>\nCGI provides reasonable accommodations to qualified individuals with disabilities. If you need an accommodation to apply for a job in the U.S., please email the CGI U.S. Employment Compliance mailbox at US_Employment_Compliance@cgi.com . You will need to reference the requisition number of the position in which you are interested. Your message will be routed to the appropriate recruiter who will assist you. **Please note, this email address is only to be used for those individuals who need an accommodation to apply for a job. Emails for any other reason or those that do not include a requisition number will not be returned** .\n<br><br>\nWe make it easy to translate military experience and skills! Click here at https://cgi-veterans.jobs/ to be directed to our site that is dedicated to veterans and transitioning service members.\n<br><br>\nAll CGI offers of employment in the U.S. are contingent upon the ability to successfully complete a background investigation. Background investigation components can vary dependent upon specific assignment and/or level of US government security clearance held.\n<br><br>\nCGI will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with CGI?s legal duty to furnish information.\n<br><br>\nHave you been referred by a CGI Member for this position?* **Yes** **No**\n\n\n<ul>\n<li>*CGI member?s email (@cgi.com)** *****</li>\n<li>*First Name**</li>\n<li>*Last Name**</li>\n<li>*I agree to allow CGI to contact the CGI member who referred me to obtain additional information about my application and to confirm my referral.** *****</li>\n<li>** This field is required.**</li>\n</ul>\n\nCGI is committed to the principles of equal employment opportunity and to compliance with US laws and regulations. Click here at http://documents.njoyn.com/homebase/cgi/AMSDocs/EEO_Policy_-_Signed_2017.pdf to access our US EEO/Affirmative action policy.\n<br><br>\nApplicants have rights under Federal Employment Laws:\n\n\n<ul>\n<li>EPPA at https://www.dol.gov/whd/regs/compliance/posters/eppac.pdf</li>\n<li>FMLA at https://www.dol.gov/whd/regs/compliance/posters/fmlaen.pdf</li>\n<li>Consolidated EEO Is The Law at http://documents.njoyn.com/homebase/cgi/AMSDocs/EEO_Poster.pdf</li>\n</ul>\n\nCGI provides reasonable accommodations to qualified individuals with disabilities. If you need an accommodation to apply for a job in the U.S., please email the CGI U.S. Employment Compliance mailbox at US_Employment_Compliance@cgi.com . You will need to reference the requisition number of the position in which you are interested. Your message will be routed to the appropriate recruiter who will assist you. **Please note, this email address is only to be used for those individuals who need an accommodation to apply for a job. Emails for any other reason or those that do not include a requisition number will not be returned.**\n<br><br>\nWe make it easy to translate military experience and skills! Click here at http://cgi-veterans.jobs/ to be directed to our site that is dedicated to veterans and transitioning service members."}