{"job title": "Director, Data Scientist", "company": "Chicago Search Group", "city state": "– - New York, NY", "rating": "4.6", "job description": "<div><div>Location\n<br>\nNew York, NY</div><br>\n\n<div>Job Type\n<br>\nDirect Hire</div><br>\n\n <div>Date\n<br>\nAug 27, 2018</div>\n<br>\n <div>Job ID\n<br>\n2621986</div></div><br>\n\n<div>\n<div><strong>Director, Data Science &amp; Advanced Anlytics (Reports into the Marketing Department)</strong>\n<br><br>\nPosition Summary:\n<br><br>\nOur client is looking for a candidate to join their analytics, research &amp; insight team as their Director of Data Science. Leveraging class-leading data and analytics, this role will play an integral part in the next phase of growth for our client. For this full-time position, they seek a person that combines strong programming, data management and statistical skills with strategic thinking, intellectual tenacity and the ability to translate complex concepts into impactful insights and visualizations. In this role, you will lead data science projects that drive product personalization, content recommendations, marketing effectiveness, channel optimization, better customer experience, and operation efficiency. You will work closely with a team of data scientists and big data engineers, and play a key role in developing and delivering the next generation of advanced analytics and machine learning solutions to the business.\n<br><br>\nDuties and Responsibilities:\n<br><br>\n· Lead advanced analytic projects and deliver innovative technical solutions to solve problems and improve business outcomes.\n<br><br>\n· Lead the design and development of machine learning/statistical models and ensure rigorous validation procedures and best performance.\n<br><br>\n· Develop an enterprise capability to 'build versus buy,' working with partners cross-functionally to define and build impactful and appropriate data products (from sophisticated models to user-friendly assets).\n<br><br>\n· Work closely with engineers to deploy models in production both in near-real-time and in batch process and systematically track model performance.\n<br><br>\n· Lead key data science projects including the use of new streams of enterprise data and analytics/data governance cross-enterprise.\n<br><br>\n· Assist engagement with key business stakeholders in discussion on business strategies and opportunities.\n<br><br>\n· Build strong working relationships and develop deep partnership with the business.\n<br><br>\n· Be a subject matter expert on machine learning and predictive modeling.\n<br><br>\n· Drive technical innovation through active research and applications of new theories, techniques, and technologies.\n<br><br>\n· Execute sophisticated quantitative analyses and advanced modeling that translates data from multiple sources and of multiple varieties into actionable insights.\n<br><br>\n· Prepare presentations and clearly communicate findings from initiatives to senior management and to the broader organization.\n<br><br>\nSupervisory Responsibilities:\n<br><br>\n· Will be responsible for managing 1 junior data scientist.\n<br><br>\nMinimum Qualifications:\n<br><br>\n· Master's degree or PhD in computer science, statistics, operations research, engineering, mathematics, economics, physics, or a related quantitative field.\n<br><br>\n· 7+ years of experience in data science or related analytical field.\n<br><br>\nRequirements and General Skills:\n<br><br>\n· Strong public speaking and presentation skills.\n<br><br>\n· Interpersonal skills and ability to interact and work with staff at all levels.\n<br><br>\n· Excellent written and verbal communication skills.\n<br><br>\n· Ability to work independently and in a team environment.\n<br><br>\n· Ability to pay attention to details and be organized.\n<br><br>\n· Ability to project professionalism over the phone and in person.\n<br><br>\n· Commitment to \"internal client\" and customer service principles.\n<br><br>\n· Willingness to take initiative and to follow through on projects.\n<br><br>\n· Excellent time management skills, with the ability to prioritize and multi-task, and work under shifting deadlines in a fast-paced environment.\n<br><br>\n· Must have legal right to work in the U.S.\n<br><br>\nTechnical Skills:\n<br><br>\n· Expert knowledge of machine learning and statistical modeling methods for supervised and unsupervised learning, understanding of underlying algorithms, ability to tune and analyze algorithms and extract actionable insights. These methods include (but are not limited to) regression analysis, cluster analysis, outlier detection, novelty detection, decision trees, recommendation engines (e.g, collaborative filtering, ALS, association), nearest neighbors, support vector machines, ensemble methods (e.g, bagging, boosting, Random Forests), neural networks and deep learning, feature selection, feature importance and factorization methods.\n<br><br>\n· Experience working with raw data (including Big Data), knowledge of preprocessing procedures and ability to prepare data for modeling; experience in feature engineering.\n<br><br>\n· Exceptional programming skills in R and/or Python ('and' preferred).\n<br><br>\n· Strong knowledge of databases and related languages/tools such as Teradata and SQL.\n<br><br>\n· Extensive experience wrangling/cleaning data.\n<br><br>\n· Experience in database design (preferred).\n<br><br>\n· Experience working with massive datasets and parallel processing optimization for data preparation, manipulation, analytics and advanced analytics.\n<br><br>\n· Experience with Big Data technologies (e.g, Teradata, Hadoop, Hive, PIG, Cloudera, Apache Spark).\n<br><br>\n· Experience working with the latest advanced analytics and deep learning libraries and tools (e.g, Tensorflow, PyTorch).\n<br><br>\n· Formal or academic training in project management for teams and cross-organization.\n<br><br>\n· Experience in leading or contributing to a Big Data architecture stack implementation project (preferred).</div>\n </div>\n\n<br>"}