{"job title": "Senior Data Scientist", "company": "CyberCoders", "city state": "– New York City, NY", "rating": "3.8", "job description": "Senior Data Scientist <div>\nLocation: Remote with 25% travel\n<br>\nSkills: Python, Machine Learning, Teaching experience\n<br>\nRole: Senior Data Scientist - corporate training, personal passion projects and business projects.\n<br><br>\nWe are passionate about Data Science and education and are looking for a Data Scientist who feels the same! We are a Data Science education company with customers across the globe. We offer training to corporations from start ups to Fortune 500s and everything in between.</div>\n<br>\nTop Reasons to Work with Us<div>\n\n\n<ul>\n<li>Work with like minded people who are super passionate about data science and education</li>\n<li>This role provides a unique mix of teaching, business projects and passion projects</li>\n<li>We are a startup company owned by a global giant so you get the best of both worlds - that startup vibe but with security.</li>\n<li>Competitive annual salary and full benefits.</li>\n<li>Work REMOTE! (With 25% travel).</li></ul></div>\n\n\nWhat You Will Be Doing<div>\nAs our Corporate Senior Data Scientist your role will be as follows:\n<br><br>\n<strong>Instruction/Product Development:</strong>\n\n\n<ul>\n<li>Creating data science curriculum for corporate training clients</li>\n<li>Delivering corporate training to small groups</li>\n<li>Create pre-training skills assessments and methods to measure student learning outcomes</li>\n</ul>\n\n<strong>Passion projects:</strong>\n\n\n<ul>\n<li>On an ongoing basis you will be able to spend approximately 20% of your time working on personal passion projects. Ever wanted to write a book, work on a personal research project? Maybe you'd like to learn a new skill? We give our data scientists time (usually at least 3 months per year) to work on projects in order to stay current in the industry, remain hands on and to drive role fulfillment. What's the catch? There is none - seriously.</li></ul></div>\n\n\nWhat You Need for this Position<div>\n<strong>Must haves:</strong>\n<br><br>\nMachine Learning Algorithms\n<br>\nPython\n<br>\n3+ years INDUSTRY experience of data science\n<br>\nA passion for teaching\n<br>\nExperience teaching technical topics\n<br><br>\n<strong>Preferred (NOT essential):</strong>\n<br><br>\nIdeally Masters or PhD in quantitative field</div>\n<br>\nWhat's In It for You<div>\n<strong>Perks of the Role:</strong>\n\n\n<ul>\n<li>Part of a team that is transforming education</li>\n<li>Three paid months per year to sharpen skills and pursue passion projects</li>\n<li>Competitive compensation package</li>\n<li>Opportunity to network and develop, both among our internal Data Science speaker community, as well as through our parent company which is a global organization</li></ul></div>\n\n\n<div>\nSo, if you are a Data Scientist who wants to teach AND get paid to work on data science projects of your choice 20% of the time, please apply today!</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}