{"job title": "Senior Data Engineer", "company": "Eventbrite", "city state": "– Nashville, Tennessee", "rating": "4.5", "job description": "<div><div><strong>THE CHALLENGE</strong></div><div>The data engineering team is building the next generation of data infrastructure. We work with cutting-edge big data technologies to power the most efficient, secure, and performant data ecosystem to power live experiences. Operating at the base of Eventbrite's infrastructure, we feed data to analysts, customers, engineers, and the platform alike. Our core foundation is modular and strong. We hope you can help us extend its use across the company as we explore and implement new technologies.</div><br>\n<div><strong>THE TEAM</strong></div><div>The Data Foundry squad is charged with building and maintaining all streaming and batch data pipelines across the company. We also support and empower analysts, engineers and data scientists with the tools they need to create a data-driven product and power data-driven decision making. We are pragmatic and meritocratic. We work hard. We play hard. We are strongly connected to each other. Eventbrite engineers perform frequent demos of the code we ship. We also hone our skills through code reviews and tell the world about it on Eventbrite’s Engineering Blog. We value community, we believe in the power of live experiences, and we regularly host free events with top technical speakers. Learn more about the team from some of our engineers here.</div> <br>\n<div><strong>THE ROLE</strong></div><div>We are hiring someone to help us build a scalable, reliable, secure, and highly performant data platform. You'll help reinforce and extend the infrastructure that powers the use of data at Eventbrite. From infrastructure development to data analysis to ETL jobs, you will need a broad range of big-data engineering skills. The team has strong and versatile engineers. You will grow. We hope to grow with you.</div><br>\n<div><strong>TECH STACK</strong> </div><div>Our primary stack includes usual suspects in big data engineering: Spark, Hadoop, Presto, Spark SQL, Hive, Spark Streaming, Kafka, MySQL, Redis, AWS, Yarn, Ansible, Terraform, Python, Git, and more.</div></div><div><div>THE SKILL SET\n\n<ul>\n\n\n<ul>\n<li>5-10 years of experience building high quality software in Python, Java, or Scala.</li><li>3+ years of experience designing Data Warehouse and ETL architectures with Hadoop ecosystem, such as Spark, Hive, Storm, Presto, Kafka, Hbase, MySQL databases, and HDFS</li><li>Understanding of Data Engineering, Data Science, Machine Learning, Business Analytics, and the relevant technologies that support them</li><li>Familiarity with a server-side framework, such as Django, Express, Rails, or .Net</li><li>Deep expertise in cloud computing, preferably AWS, security, cluster sizing, and performance tuning. Ability to setup process and systems to monitor and reduce cloud computing costs for a large organizationExcellent customer service skills</li><li>Experience building systems to instrument, collect and process billions of events, such as clickstream data. Deep understanding of measuring and ensuring data quality at scale</li><li>Outstanding verbal, written, presentation, and facilitation skills. In particular, a demonstrated ability to effectively communicate technical and business issues and solutions to multiple organizational levels</li><li>Ability to teach and mentor engineers with a variety of skill levels and backgrounds</li><li>Strong analytical and problem solving skills and attention to detail</li><li>Familiarity with database optimization and scaling approaches including indexing, partitioning, sharding, clustering, in-­memory tables, horizontal and vertical scaling</li><li>Vision to define the future of how big data and analytics intersect at Eventbrite. The analytics community at Eventbrite will rely on you to build &amp; maintain a data environment built for speed, accuracy, consistency and ‘up’ time</li><li>Skills to support analytics by building a world-class data warehousing environment that empowers analysts to deliver insights to their stakeholders at world-class speed</li></ul>\n</ul>\n\n</div>\n</div><div><div>BONUS POINTS\n\n<ul>\n\n\n<ul>\n<li>Bachelor’s degree or higher in a technical field (CS/Math/Stats/Engineering)</li><li>Passionate about live entertainment, and eager to help build Eventbrite into the world’s leading event technology platform</li></ul>\n</ul>\n\n</div>\n</div><div><div><strong>ABOUT EVENTBRITE</strong></div><div>Eventbrite is the world’s largest ticketing and event technology platform, powering millions of live experiences around the globe. We build technology that allows anyone to create, share, find and attend events of all kinds. Music festivals, marathons, conferences, hackathons, political rallies, fundraisers, gaming competitions— you name it, we power it. Meet some of the team.</div> <br>\n<div><strong>IS THIS ROLE NOT AN EXACT FIT?</strong></div><div>Sign up to keep in touch and we’ll let you know when we have new positions on our team.</div><br>\n<div>Eventbrite is a proud equal opportunity/affirmative action employer supporting workforce diversity. We do not discriminate based upon race, ethnicity, ancestry, citizenship status, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), marital status, registered domestic partner status, caregiver status, sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, genetic information, military or veteran status, mental or physical disability, political affiliation, status as a victim of domestic violence, assault or stalking, or other applicable legally protected characteristics.</div><br>\n<div>FLSA Status: Exempt</div><br>\n<div>Please read our Applicant Privacy Notice to understand how we process your personal information when you apply for a job with us.</div></div>"}