{"job title": "Data Scientist- Marketing Analytics", "company": "Hawaiian Airlines", "city state": "– Honolulu, HI", "rating": "4.0", "job description": "Requisition Number 18-1553\n<br><br>\nPost Date 8/16/2018\n<br><br>\nTitle Data Scientist- Marketing Analytics\n<br><br>\nDepartment Marketing &amp; Sales\n<br><br>\nCity Honolulu\n<br><br>\nState HI\n<br><br>\nPart-Time No\n<br><br>\nPart-Time Weekend No\n<br><br>\nDescription\n<br><br>\n<strong>\n<ul>\n<li>_Position Overview_*:</li>\n</ul>\n\n</strong>\n<br>\nHawaiian Airlines Marketing Analytics is seeking a high-performing individual and team player to lead mathematical modeling and optimization projects across teams department-wide. This position provides advanced analytical products and services, specializing in creating innovative data-driven decision-support tools to optimize business decisions, through application of statistical and mathematical modeling.\n<br><br>\n<strong>\n</strong><ul><strong>\n<li>_Key Responsibilities_*:</li>\n\n</strong>\n\n<li>Provide analytical consultation, statistical/mathematical modeling, and solutions to achieve business objectives</li>\n<li>Research, design, develop, implement, and support decision-science models.</li>\n<li>Drive commercial customer data integration initiatives from ideation to production.</li>\n<li>Conduct research on analytical techniques and translate that research into usable, sustainable, and scalable solutions for users of production systems</li>\n<li>Perform data collection, data cleaning, data validation, and reporting tasks for analytical systems and applications</li>\n<li>Perform exploratory data analysis to identify patterns and trends in customer behavior</li>\n<li>Lead the analysis and validation of statistical, forecasting, and optimization models</li>\n<li>Communicate analytical results to business partners and clients</li>\n<li>Serve as technical consultant in the fields of marketing analytics, data science, and decision analytics.</li>\n<li>Design and develop advanced data mining, forecasting, estimation, simulation, and/or optimization models</li>\n<li>Provide science calibration support for decision-science models</li>\n<li>Identify and apply best practices in field of advanced analytics</li>\n</ul>\n\n<strong>Requirements</strong>\n<br><br>\n<strong>\n</strong><ul><strong>\n<li>_Minimum Qualifications_*:</li>\n\n</strong>\n\n<li>Master?s degree in Statistics, Industrial Engineering/Operations Research, Applied Mathematics, Machine Learning, Decision Science, Computer Science, Computational Economics, or related field</li>\n<li>5+ years of experience in applying advanced analytics to support business decisions, yielding measured outcomes improvement</li>\n<li>Expert-level fluency in applying advanced multivariate statistical analysis (logistic &amp; linear regression, decision tree, cluster analysis, ANOVA) to categorize, classify, and detect relationships in large datasets</li>\n<li>Proficiency in extracting and cleansing large datasets from different data sources</li>\n<li>Proficiency in programming with knowledge of SQL, R, SAS, Python, or other similar languages</li>\n<li>Ability to understand complex business requirements and define key performance metrics to measure benefits and communicate complex quantitative analysis in a clear, precise, and actionable manner</li>\n\n<strong><li>_Preferred Qualifications_*:</li>\n\n</strong>\n\n<li>Ph.D. in Statistics, Industrial Engineering/Operations Research, Applied Mathematics, Machine Learning, Decision Science, Computer Science, Computational Economics, or related field</li>\n<li>Strong grasp of marketing analytics theory and concepts</li>\n<li>Experience leading diverse teams and interacting with vendors\\</li>\n<li>Demonstrated familiarity with the airline or transportation industries</li>\n<li>About Hawaiian Airlines*</li>\n</ul>\n\nHawaiian? has led all U.S. carriers in on-time performance for each of the past 14 years (2004-2017) as reported by the U.S. Department of Transportation. Consumer surveys by Cond? Nast Traveler, Travel + Leisure and TripAdvisor have placed Hawaiian among the top of all domestic airlines serving Hawai?i.\n<br><br>\nNow in its 89th year of continuous service, Hawaiian is Hawai?i?s biggest and longest-serving airline. Hawaiian offers non-stop service to Hawai?i from more U.S. gateway cities (11) than any other airline, along with service from Japan, South Korea, China, Australia, New Zealand, American Samoa and Tahiti. Hawaiian also provides approximately 170 jet flights daily between the Hawaiian Islands, with a total of more than 250 daily flights system-wide.\n<br><br>\nHawaiian Airlines, Inc. is a subsidiary of Hawaiian Holdings, Inc. (NASDAQ: HA). Additional information is available at HawaiianAirlines.com. Follow Hawaiian?s Twitter updates (@HawaiianAir), become a fan on Facebook (Hawaiian Airlines), and follow us on Instagram (hawaiianairlines). For career postings and updates, follow Hawaiian?s LinkedIn page.\n<br><br>\nFor media inquiries, please visit Hawaiian Airlines? online newsroom.\n\n\n<ul>\n<li>Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities.</li>\n<li>Please view Equal Employment Opportunity Posters provided by OFCCP.</li>\n<li>The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information. 41 CFR 60-1.35(c)</li>\n</ul>"}