{"job title": "Advanced Data Analyst I -- Jr. Data Scientist", "company": "HMSA", "city state": "– Honolulu, HI", "rating": "2.4", "job description": "<strong>Employment Type:</strong>\n<br>\nFull-time\n<br><br>\n<strong>Exempt or Non-Exempt:</strong>\n<br>\nExempt\n<br><br>\n<strong>Job Summary:</strong>\n<br>\n<div>Works independently with internal and external customers to clearly articulate and define business problem(s) to be solved; reviews data sources and preps needed data; performs required analysis; applies accepted statistical methodologies where applicable; documents the process that was followed and data sources/tools used; ensures results have been validated (statistically, if necessary); and prepares/presents findings that are informative and audience appropriate to drive decision making across various levels of the organization.</div>\n\n<br><strong>Minimum Qualifications:</strong>\n\n\n<ul>\n<li>Bachelor's degree and four years of demonstrated analytics experience or equivalent combination of education and related work experience.</li>\n<li>Proficiency in Microsoft Word, Excel, PowerPoint and Outlook.</li>\n<li>Proficiency with Online Analytical Processing (OLAP) tools and databases.</li>\n<li>Knowledge of one or more of the following: SQL, R or SAS.</li>\n<li>Demonstrated understanding of data (types, content reliability, etc.).</li>\n<li>Demonstrated problem solving and data collection, analysis, and interpretation.</li>\n<li>Demonstrated understanding/use of dashboards, data visualization tools, and advanced and custom graphics.</li>\n<li>Demonstrated organization and time management skills where individual worked on multiple projects simultaneously and meet project deadlines.</li>\n</ul>\n\n<strong></strong>\n<br><br>\n<strong>Duties and Responsibilities:</strong>\n\n\n<ul>\n<li>Data Management: Reviews data sources and preps needed data\n\n\n<ul>\n<li>Identifies existing and new data sources</li>\n<li>Performs data prototyping, if necessary, to agree what data can/not be used</li>\n<li>Preps data for use in analysis, goes back to source if problems are found, and identifies other options/alternatives if problems cannot be resolved</li>\n<li>Performs review of data to ensure completeness/accuracy/timeliness for the purpose of the analysis</li>\n<li>Ensures existing, approved, corporate tools used can accept/integrate the data</li>\n<li>Where necessary (and if practical to be done within the delivery timeframe of a project), facilitates the identification and use of new tools and works with the Technical Review Committee to authorize its use</li>\n</ul>\n\n\n\n</li><li>Analytics and Technical Acumen : Performs required analysis, applies accepted statistical methodologies where applicable, and documents the process that was followed and data sources/tools used\n\n\n<ul>\n<li>Determines what kind of analytics will be performed (descriptive, predictive, prescriptive) and defines/documents overall framework.</li>\n<li>Where appropriate, applies linear regression (correlation, contingency table, ANOVA, inference, chi-square, t-test) and/or time series methods (data set-up, conversions, trends, decomposition, models, forecasts, confidence).</li>\n<li>Utilizes appropriate tools to load, integrate, and analyze data</li>\n<li>Conducts analysis and documents findings, identifies unexpected anomalies and root cause (if possible) and determines if analysis can continue, identifies alternatives if anomalies cannot be resolved</li>\n<li>Ensures reproducibility of outcomes</li>\n<li>Documents entire analysis process, including business problem, data sources, methods and tools used, project reference, and outcomes</li>\n<li>Implements pre-emptive actions, where possible.</li>\n</ul>\n\n\n\n</li><li>Project Definition and Coordination: Lead meetings with internal and external customers to clearly articulate and define business problem(s) of medium/high complexity and impact (department/function specific, external customer centric, or part of a corporate project)\n\n\n<ul>\n<li>Types of projects include descriptive and predictive analytics</li>\n<li>Applies a whole company perspective, draws upon previous knowledge and experience, and -- where necessary -- researches new/other approaches to identify and agree upon objectives, approach, and success measures</li>\n<li>Works with customer to submit appropriate paperwork (ISS, TPDR, etc.) and ensures necessary agreements are in place for external customers</li>\n<li>Defines delivery milestones and negotiates timeframes, monitors progress, and periodically notifies customer of status</li>\n</ul>\n\n\n\n</li><li>Effective Communication: Works primarily with department heads or function leads to prepare/present findings that are informative and audience appropriate\n\n\n<ul>\n<li>Reviews findings and outcomes with customer, ensures business problem/objectives have been met, and prepares documentation of the analysis</li>\n<li>Where necessary, manage divergent views in the audience and advises the internal/external customer on any recommendations or options that will facilitate data and analysis driven decision making.</li>\n<li>Prepares a presentation of the analysis, process followed, and reviews it with the customer to ensure the results are audience appropriate.</li>\n</ul>\n\n\n<br><br>\n<strong></strong></li><li><strong>Other duties/functions:</strong>\n\n\n<ul>\n<li>Trains others on Microstrategy and Excel</li>\n<li>Functions as a team player within the department and embodies collaboration</li>\n<li>Performs other duties as assigned.</li>\n</ul>\n\n\n\n\n</li></ul>"}