{"job title": "Senior Data Scientist", "company": "IAC", "city state": "– New York, New York", "rating": "3.5", "job description": "<strong> About the Role:</strong> Dotdash has been a top 20 site on the internet, since the internet was born. We have data stretching back before the existence of Google. We are looking to add a motivated and experienced member to the Dotdash data science team. In order to grow revenue through affiliate partnerships, we are working to understand the needs of millions of visitors a day, and to match each visitor to the best product or article for them. As a Senior Data Scientist in the group, it will be your responsibility to develop and deploy user models to drive these initiatives forward. <strong> About Your Contributions</strong> Drive high-visibility and high-impact projects that drive revenue and help match users to products. Possible projects include attribution modeling, user conversion modeling, and ad revenue optimization. Innovate rapidly to build proofs of concept that can take an idea and prove that it will work across a huge content company. Work closely with stakeholders across the company to move initiatives forward and support data-driven decision-making. Attend and present at conferences to keep the team up to date with innovations in data science and relevant technology <strong> About You:</strong> Masters/PhD Degree in a quantitative field, and 2+ years of experience as a data scientist. Industry experience with e-commerce, ad tech, and/or conversion modeling strongly preferred. Proven history of leading projects from start to finish and shipping quality code (Be prepared to show us something youve built.). Able to independently and fluently translate business needs to data problems Excellent capacity to communicate results and progress to non-technical and technical audiences. Strong research, analytical and problem-solving skills. Solid grasp of statistics and predictive modeling techniques. Strong programming skills in Python and familiarity with SQL, noSQL, and/or ElasticSearch <strong> About Us:</strong><br><br>For more than 20 years, Dotdash brands have been helping people find answers, solve problems, and get inspired. We are one of the top-20 largest content publishers on the Internet according to comScore, a leading Internet measurement company, and reach more than 30% of the U.S. population every month. Our brands collectively have won more than 20 industry awards in the last year alone and, most recently, Dotdash was named Publisher of the Year by Digiday, a leading industry publication. Our brands include Verywell, The Spruce, The Balance, Investopedia, Lifewire, TripSavvy and ThoughtCo.<br><br>Dotdash embraces inclusivity and values our diverse community. We are committed to building a team based on qualifications, merit and business need. We are proud to be an equal opportunity employer and do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}