{"job title": "Sr. Data Scientist", "company": "Illumina", "city state": "– Foster City, CA", "rating": "4.2", "job description": "As the world leader in DNA sequencing technology, Illumina is building a world class cloud operations team to deliver best in class genomic SaaS solutions world-wide. Our DevOps organization is optimizing the deployment, production management, and front-line developer support of Illumina’s Genomic SaaS assets: BaseSpace Sequence Hub, Variant Interpreter, Cohort Analyzer, and Correlation engine.\n<br><br>\nThis role is for an experienced data scientist, ideally with a background in cloud DevOps and/or Observability Engineering to monitor and optimize cloud production software performance. The job level will be adjusted to match the candidate’s skills and experience.\n<br><br>\nTasks and Responsibilities:\n<br><br>\nApply and extend professional data science skills and expertise to the AWS cloud ecosystem and big data processing to monitor and derive insights on customer usage of our cloud platform.\n<br>\nApply a data-driven approach to drive optimization of cloud operations around cost management, time to market, security and privacy, and delivery of worldwide capability.\n<br>\nDeploy executive and engineer facing dashboards and reports of SaaS operational performance KPI’s.\n<br>\nRequired Skills &amp; Experience:\n<br><br>\nBachelor’s, Master’s, or Ph.D. degree in math, statistics, econometrics or similar, or comparable experience.\n<br>\n5+ years’ experience with a focus on data analysis ideally applied to SaaS observability engineering and optimization.\n<br>\nExpertise delivering breakthrough cost, robustness, response time, and time-to-market global capability in the AWS cloud.\n<br>\nA passion to apply modern cloud computing to the transformation of human health with genomics\n<br>\nStrong enthusiasm about working globally across a diverse set of coworkers and customers to deliver best in class solutions providing compelling value to our customers\n<br>\nDemonstrated ability to communicate data clearly and effectively to an executive audience.\n<br>\nDemonstrated success collaborating in a fast-paced team environment and delivering solutions using established agile development methodologies (such as Scrum and Kanban)\n<br>\nPreferred Skills &amp; Experience:\n<br><br>\nUse of large scale data processing tools such as R, Jupyter, Hadoop, Elastic Search.\n<br>\nAWS Certifications\n<br>\nKnowledge of scripting and programming languages\n<br>\nSoftware Development/Maintenance experience in an environment like C#/TypeScript or Java/JavaScript\n<br>\nDevOps experience with Cloud SaaS products, ideally in AWS\n<br>\nExperience in a regulated field, such as Healthcare, Diagnostics or Finance\n<br>\nExperience working cross culturally, with geographically distributed teams spanning multiple time zones"}