{"job title": "Staff Data Scientist", "company": "Intuit", "city state": "– Mountain View, CA", "rating": "4.2", "job description": "Overview<br><br>Fuel small business success! Intuit is looking for innovative and hands-on data scientists to focus on Smart Money Services. Our team leverages data mining/machine learning techniques to manage credit and fraud risk in payments and payroll. We are looking for team members that love new challenges, cracking tough problems and working cross-functionally. If you are looking to join a fast-paced, innovative and incredibly fun team, then we encourage you to apply. Come do the best work of your life!\n<br><br>\nThe Staff Data Scientist will be responsible for developing analytical solutions for the detection of fraud and credit risk across the Intuit payments and payroll ecosystem. The goal of these solutions is to protect Intuit and our customers from losses. The ideal candidate will bring deep expertise in predictive &amp; behavioral modeling for risk management while enabling a great customer experience and business growth. Preferably, the candidate will have previous experience in risk management with a merchant acquirer.<br><br>Responsibilities\n\n<ul>\n<li>Oversee the design, development, deployment and management of batch and real-time fraud and credit risk models for both onboarding and monitoring purposes</li><li>Work closely with key business stakeholders</li><li>Communicate key analytic findings within the business and to senior stakeholders</li><li>Research, explore, and enable new quantitative techniques and technologies in data science</li><li>Drive thought leadership and embrace emerging industry innovation</li><li>Mentor more junior team members</li>\n</ul>\n\nQualifications\n\n<ul>\n<li>5+ years data science experience, preferably with fraud and credit risk detection solutions</li><li>MS or PhD in Statistics, Mathematics, Computer Science, Economics, Operations Research, or equivalent</li><li>Hands-on expertise with data mining and statistical modeling techniques such as clustering, classification, regression, tree based methods, neural nets, support vector machines, anomaly detection, and natural language processing\n<br>\nExpertise in modern advanced analytical tools and programming languages such as Python, Scala, Java and/or R.</li><li>Efficient in SQL, Hive, SparkSQL, etc</li><li>Comfortable working in a Linux environment</li><li>Experience with building end-to-end reusable pipelines from data acquisition to model output delivery</li><li>Quick learner, adaptable, with the ability to work independently in a fast-paced environment</li><li>Strong oral and written communication skills. Ability to conduct meetings and make professional presentations, and to explain complex concepts and technical material to non-technical users</li><li>Strong project management and stakeholder management skills</li>\n</ul>"}