{"job title": "Principal Data Scientist", "company": "Intuit", "city state": "– Mountain View, CA", "rating": "4.2", "job description": "Overview<br><br>Intuit is hiring a Principal Data Scientist to focus on our Customer Success technology, reporting directly to the director of data science in customer success. We are looking for some exceptional talent to help improve the bottom line of our Customer-facing technology. We expect our Principal Data Scientist to be able to draw insights from data and apply them to all our products (TurboTax, QuickBooks, Mint, etc.) Also expected to lead engineers and data scientists to deliver new business value and personalized customer experience for our products.<br><br>Responsibilities\n\n<ul>\n<li>Conduct data analysis and build large-scale machine-learning models/pipelines</li></ul>\n\n<ul>\n<li>Work side-by-side with business unit partners on detailed requirements, technical designs, and implementation of end-to-end solutions from prototype to production</li>\n<li>Design experiments (such as A/B test), collect data, perform statistical analysis, and present solutions to senior management including executives</li>\n<li>Provide technical leadership and drive Intuits scientific innovation (publish papers, patents, etc.)</li>\n<li>Build scalable, efficient, automated processes for large-scale data analysis and machine-learning models (including development, validation, and serving)</li>\n<li>As a member of the Intuit data science community, present in internal and external conferences</li></ul>\n\n<ul>\n<li>Mentor and lead other data scientists and/or engineers</li></ul>\n\n<ul>\n<li>Work with business planners to identify the need for new data platforms and associated product/service functionality and to propose innovative products and services that fully utilize the power of big data</li><li>Set self-initiated research objectives and exercise discretionary judgment when exploring advances in artificial intelligence and applying innovative machine learning techniques to Intuit's data science initiatives</li><li>Collaborate with infrastructure architects in building more automated streamlined systems and in setting up the necessary data governance for agile and responsive data processing</li><li>Apply industry-leading ideas, research, and insights to solve complex problems or to power new business opportunities</li><li>Act as an advisor to oversee and mentor team members in building a vibrant community of practice</li>\n</ul>\n\nQualifications\n\n<ul>\n<li>\n\n<ul>\n<li>M.S. in Computer Science, Information Retrieval, Machine Learning, or a related discipline</li><li>At least 8 years experience in applying Machine Learning techniques to solve business problems</li><li>At least 5 years experience with major programming languages such as in Java, Python, Scala</li><li>At least 3 years' of experience with most of the following Big Data technologies: AWS EMR or Hadoop, Spark, and Lucene/SOLR</li> <li>Track records of publishing work in academic conferences or industry circles (presented at least once at a conference in the last 24 months)</li><li>Experience in statistical modeling tools, deep learning techniques, and/or leading cross-org projects is a plus</li>\n</ul>\n<strong>Strongly Preferred Experiences and Skills:</strong>\n<ul>\n<li>Ph.D. Degree in Computer Science, Information Retrieval, Machine Learning, or a related discipline</li><li>Published high-quality work in academic conferences or industry circles</li><li>2+ years experience in AWS technology</li> <li>Experience with Internet-scale distributed systems such as recommendation, personalization, search, demand forecasting, etc.</li><li>Excellent oral and written communication skills, with the ability to communicate complex technical concepts to all levels of the organization</li></ul></li>\n</ul>"}