{"job title": "Sr Data Scientist - Vision", "company": "SparkCognition", "city state": "– Austin, TX", "rating": "4.6", "job description": "SparkCognition is looking for innovative Data Scientists to join our team to help create the next\n<br>\ngeneration of analytics and artificial intelligence solutions. At SparkCognition, you will immerse\n<br>\nyourself in cutting-edge research and work with the latest technologies to deliver value in\n<br>\nobject detection and recognition for defense, security, and maintenance applications\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nBuilding models to solve specific problems. This includes, but is not limited to:\n\n<ul>\n<li>Processing, cleansing, and verifying the integrity of data used for analysis</li>\n<li>Feature engineering using various techniques for the enhancement of data</li>\n<li>Performing feature selection on original and generated data</li>\n<li>Using machine learning tools to develop and train models</li>\n<li>Performing efficacy testing of the models</li>\n<li>Building automated tools that enable data scientists to more effectively perform tasks such as data cleaning, feature generation, feature selection, or model building</li>\n<li>Performing ad-hoc analysis and presenting results in a clear manner</li>\n<li>Working with a team to help solve new, never-before- solved challenges in computer vision object detection, recognition, and tracking from images and videos.</li>\n</ul>\n<strong>Skills and qualifications</strong>\n\n<ul>\n<li>Understanding and experience using machine learning techniques and algorithms,including but not limited to: Linear Models, Neural Networks, Decision Trees, BayesianTechniques, Clustering, Anomaly Detection, and more</li>\n<li>Experience with data science languages, such as Python, R, MatLab, etc</li>\n<li>Experience with machine learning frameworks, such as TensorFlow, PyTorch, Theano,Keras, etc</li> \n\n<li>Experience using deep learning convolutional neural networks (CNNs) for image recognition and object detection (e.g.</li>\n<li>Experience with toolkits like OpenCV and object detection algorithms</li>\n<li>Experience managing large volumes of data (terabytes or more)</li>\n<li>Great communication skills</li>\n<li>Good scripting and programming skills, especially Python</li>\n<li>Graduate degree (or equivalent industry experience), Ph.D. preferred, in Computer Science, Statistics, Physics, Mathematics, or a related scientific discipline</li>\n<li><strong>US citizenship required</strong></li>\n</ul>\n<strong>Desirable skills and qualifications</strong>\n\n<ul>\n<li>Active US security clearance</li>\n<li>Experience with developing application on full stack of HTTP, JSON, REST, React,Java/C#, SQL and no-SQL databases.</li>\n</ul>\n<em>SparkCognition is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity and/or expression, national origin, protected veteran status, disability, genetics, or citizenship status (when otherwise legally authorized to work) and will not be discriminated against on the basis of such characteristics or any other status protected by the laws or regulations in the locations where we operate. If you need assistance or an accommodation due to a disability, you may contact us at accommodations@sparkcognition.com</em>"}