{"job title": "Sr. Data Scientist, Lead - Product Platform", "company": "Uber", "city state": "– San Francisco, California", "rating": "4.2", "job description": "We’re changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now we’re a part of the logistical fabric of more than 600 cities around the world. Whether it’s a ride, a sandwich, or a package, we use technology to give people what they want, when they want it.\n<br><br>\nFor the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer.<br>\n<div>And that’s just what we’re doing today. We’re thinking about the future, too. With teams working on new modalities, self-driving cars and even urban air transportation, we’re in for the long haul. We’re reimagining how people and things move from one place to the next.</div>\n\n<br><strong>About the Role</strong>\n<br><br>\nWe’re looking for an experienced data scientist on our Marketing Data Science team to help optimize investment decisions for Uber’s multi-million dollar marketing budget using cutting edge machine learning and statistical models. You will be responsible for developing actionable analytical solutions and productionizing models in a scalable manner to inform decisions across Uber’s global marketing efforts, accelerating both demand and supply growth within Uber’s 600+ cities worldwide!\n<br><br>\nThe right person for this role has a passion for driving impact by leveraging predictive modeling, machine learning, experimentation and technology to power decisions across our marketing organization. Though prior management experience is not required, candidates with management experience are strongly preferred. You will be a technical lead for a few data scientists and build a bigger team over time. You will be technical lead for a small team and build a bigger team over time.\n<br><br>\n<strong>What You’ll Do</strong>\n<ul>\n<li>Build production grade models on large-scale datasets to optimize marketing performance by utilizing advanced statistical modeling, machine learning, or data mining techniques.</li><li>Leverage models to address key growth challenges such as cross-channel spend allocation, response modeling, advertising partner quality measurement, customized content recommendation and ad serving.</li><li>Build models to derive insights from current Uber’s customers to improve communications, retention, engagement, LTV and develop methods for efficient targeting for prospecting customers at scale.</li><li>Act as a technical lead for a few data scientists and build a bigger team over time. analytical solutions by providing data-driven recommendations.</li><li>Leverage large scale data processing such as Spark, Hive, and Uber’s proprietary machine learning platform, and more.</li><li>Work with cross-functional teams to implement and deploy models and enhance</li> <li>Collaborate with marketing and finance leadership, design, product and engineering teams. Participate in project planning/prioritization meetings, stakeholder meeting, data prioritization meeting, etc.</li><li>Translate data-driven learnings into actionable insights.</li>\n</ul>\n<strong>What You’ll Need</strong>\n<ul>\n<li>5+ years of experience as a data scientist at a company with global operations</li><li>Prior peoples management experience is strongly preferred</li> <li>Expertise with R and Python</li><li>Experience with machine learning techniques and advanced analytics (e.g. regression, classification, clustering, time series, econometrics, mathematical optimization).</li><li>Advanced SQL skills - comfortable working with very large data sets.</li><li>Experience with big data using technologies like Hadoop, Hive, and Spark a plus.</li><li>Previous experience in advertising tech is a plus</li><li>Great communication skills, organized, able to multitask and be a team player</li><li>Balance attention to detail with swift execution</li> <li>Hunger and drive to learn complex topics</li> <li>Enthusiasm about Uber!</li>\n</ul>"}