{"job title": "Clinical Scientist", "company": "BlackThorn Therapeutics", "city state": "– San Francisco, CA", "rating": "5.0", "job description": "<strong>Who We Are</strong>\n<br><br>\nBlackThorn Therapeutics is dedicated to improving the lives of people with neurobehavioral disorders, such as depression, schizophrenia and autism, through the discovery and development of novel, targeted treatments. BlackThorn applies data-driven approaches (INFORM™) to create an understanding of the core underlying pathophysiology of neurobehavioral disorders and uses these insights to generate objective neuromarkers that support target identification, patient stratification and objective trial endpoints.\n<br><br>\n<strong>The Position</strong>\n<br><br>\nThe successful clinical scientist candidate will play a pivotal role in ensuring alignment between clinical strategy and clinical study protocols, operational structure, formalized processes, and tactical execution.\n<br><br>\nUnder the oversight of the VP, Clinical Development, the Clinical Scientist is responsible for directing the design and execution of clinical studies in order to successfully move programs through the clinical research process in a timely manner, in adherence with GCP, appropriate SOPs, and government regulations. S/he will collaborate with the clinical team to develop clinical plans and protocols, investigational brochures, clinical study reports and documents that support development and execution of clinical studies.\n<br><br>\nThe Clinical Scientist will be a key contributor in building an integrated development plan and will provide support to new development activities, as well as clinical guidance and assessment of future opportunities to advance the science.\n<br><br>\nEssential Job Functions\n\n<ul>\n<li>Design, oversee and/or execute, as needed and as appropriate, clinical deliverables and clinical/translational strategy for collaborative studies and programs</li>\n\n<li>Support the VP of Clinical Development in the evaluation of new project opportunities presented by member researchers across consortia and external partners</li>\n\n<li>Develop approaches and study concepts for clinical programs to support therapeutic advancements using innovative approaches and new therapeutic initiatives</li>\n\n<li>Clinical support to implementation teams: providing subject matter expertise, clinical science support and functional representation</li>\n\n<li>Key clinical deliverables include document development: Study concepts/ synopses, clinical protocols, investigator’s drug brochures (IB), clinical study reports (CSR), ICF, and other regulatory documents</li>\n\n<li>Review, analyze, interpret, and present both clinical and translational data both internally and externally</li>\n\n<li>Write and/or review collaborative abstracts, posters, and content for scientific meetings, conferences and publications. Support publication strategy execution including collaboration with investigators, KOLs, and other internal/external stakeholders. Present at investigator meetings, advisory boards and scientific conferences</li>\n\n<li>Ensure the appropriate reporting of the events to the Clinical Development Department and applicable Regulatory Authorities throughout the life of the trial</li>\n\n<li>Responsible for understanding and implementing the regulatory requirements related to the clinical studies and global drug development and accountable for complying with those requirements. May be asked to contribute to regulatory responses and discussions.</li>\n\n<li>May be responsible for oversight of study and overall timelines for key deliverables</li>\n</ul>\nKnowledge, Skills, and Experience\n\n<ul>\n<li>Undergraduate degree required with specialization in biological sciences, immunology, chemistry, chemical engineering, biomedical engineering or related is required. An advanced degree is a plus.</li>\n\n<li>Clinical Research Certificate is desirable</li>\n\n<li>Drug development experience highly desirable</li>\n\n<li>Strong background in clinical trial design and execution in an industry setting. The ideal candidate will have at least 10 years’ experience at a leading pharmaceutical, CRO or biotechnology company or academic center.</li>\n\n<li>Passion for advancing patient care and working in a collaborative team environment</li>\n\n<li>Committed to the values of integrity, collaboration, accountability, transparency and drive</li>\n\n<li>The skills required for success in the job include scientific and analytic ability</li>\n\n<li>Ability to think strategically and tactically with an interest in applied clinical research</li>\n\n<li>Demonstrated ability to evaluate, interpret and present complex scientific data</li>\n\n<li>Ability to work and deliver results in a fast-paced environment</li>\n\n<li>Be able to identify challenges and provide solutions in a proactive manner</li>\n</ul>"}