{"job title": "Scientist", "company": "Brookhaven Science Associates", "city state": "– Upton, NY", "rating": "NA", "job description": "Brookhaven National Laboratory is a multipurpose research institution funded primarily by the U.S. Department of Energy's Office of Science. Located on the center of Long Island, New York, Brookhaven Lab brings world-class facilities and expertise to the most exciting and important questions in basic and applied sciencefrom the birth of our universe to the sustainable energy technology of tomorrow. We operate cutting-edge large-scale facilities for studies in physics, chemistry, biology, medicine, applied science, and a wide range of advanced technologies. The Laboratory's almost 3,000 scientists, engineers, and support staff are joined each year by more than 4,000 visiting researchers from around the world. Our award-winning history, including seven Nobel Prizes, stretches back to 1947, and we continue to unravel mysteries from the nanoscale to the cosmic scale, and everything in between. Brookhaven is operated and managed by Brookhaven Science Associates, which was founded by the Research Foundation for the State University of New York on behalf of Stony Brook University, and Battelle, a nonprofit applied science and technology organization.\n<br><br>\nOrganizational Overview\n<br><br>\nBrookhaven National Laboratory (BNL) is the scientific, extreme scale Data Laboratory in the US. With over 125 PB of archived data, we host the largest scientific data archive in the US and the 3rd largest worldwide. In contrast to many others, this is an active archive were we continuously reuse all the data in the archive. In 2017 we analyzed 500PB of data on site. This data comes largely from the many scientific user facilities that we support at BNL such as: the unique nuclear physics experiment RHIC, the brightest synchrotron in the world NSLS II, the largest Tier 1 center for the LHC Atlas experiment, the Japanese particle physics experiment Belle II, the Center for Functional Nano Materials and the Atmospheric Radiation Measurement program.\n<br><br>\nAs a result we have a lively, fast growing data science research program at BNL, with a specific focus on the challenges presented by the analysis, interpretation and use of data at extreme scales and in real time. The data science program is accompanied by significant computational modeling research effort, in support of the design, planning, analysis and interpretation of experiments and their results. The Computational Science Initiative (CSI - https://www.bnl.gov/compsci/) provides the laboratory wide umbrella for these activities, bringing together computer scientists, applied mathematicians and domain scientists to carry out leading edge research, convert research results into practical solutions that advance domain science and provide the necessary computing infrastructure services and training to support efficient operation.\n<br><br>\nPosition Description\n<br><br>\nCSI is currently looking to strengthen its Quantum Computing efforts with experienced researchers at various levels. BNL's Quantum Computing program is leveraging efforts across BNL from novel materials R&amp;D, to quantum testbeds and the exploitation of quantum computing to advance domain sciences such as high energy physics, nuclear physics, chemistry, materials and biology.\n<br><br>\nWe are looking for a Scientist with experience in quantum information science and/or quantum computing. The position will involve application of knowledge on quantum information and computing to solving a myriad of DOE problems.\n<br><br>\nThe candidate will be expected to seek funding from federal and commercial agencies and grow an effort at Brookhaven in Beyond-Moore's Law computing with a focus on quantum systems.\n<br><br>\nPosition Requirements\n<br><br>\n<strong>Required Knowledge, Skills and Abilities:</strong>\n\n\n<ul>\n<li>A PhD in one of the following: Physics, Electrical Engineering, Mathematics, or closely related field.</li>\n<li>At least five years' experience in quantum information science.</li>\n<li>Proven track record of developing state-of-the-art quantum devices for computing and/or contributions to the theory and applications of quantum computing and quantum information.</li>\n<li>Ability to lead a team of scientists, engineers and technical staff in executing research in quantum information science.</li>\n</ul>\n\n<strong>Preferred Knowledge, Skills, and Abilities:</strong>\n<br><br>\nAbility to receive and maintain a Q clearance\n<br><br>\n<strong>Other Information:</strong>\n<br><br>\nTravel, domestic and foreign, to conferences and collaboration meetings.\n<br><br>\nAt Brookhaven National Laboratory we believe that a comprehensive employee benefits program is an important and meaningful part of the compensation employees receive. Our benefits program includes, but is not limited to:\n\n\n<ul>\n<li>Medical Plans</li>\n<li>Dental Plans</li>\n<li>Vacation</li>\n<li>Holidays</li>\n<li>Life Insurance</li>\n<li>401(k) Plan</li>\n<li>Retirement Plan</li>\n<li>Paid Parental Leave</li>\n<li>Swimming Pool, Weight Room, Tennis Courts, and many other employee perks and benefits</li>\n</ul>\n\nWe invite you to consider Brookhaven National Laboratory for employment. To be considered for this position, please apply online at BNL Careers and enter the job title into the Keyword Search.\n<br><br>\nBrookhaven National Laboratory (BNL) is an equal opportunity employer committed to ensuring that all qualified applicants receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, status as a veteran, disability or any other federal, state or local protected class.\n<br><br>\nBNL takes affirmative action in support of its policy and to advance in employment individuals who are minorities, women, protected veterans, and individuals with disabilities.\n\n\n<ul>\n<li>VEVRAA Federal Contractor<br><br>SDL2017</li>\n\n</ul>"}