{"job title": "Computer Vision Scientist", "company": "CyberCoders", "city state": "– Atlanta, GA", "rating": "3.8", "job description": "Computer Vision Scientist <div>\nIf you are a Computer Vision Software Engineer with object tracking experience and interest in working with Medical Devices, please read on!\n<br><br>\nComputer Vision Engineer\n<br>\nLocation: Atlanta, GA\n<br>\nWe are a privately held medical device company focused on the design of innovative solutions for the treatment of specific degeneration deformities. Want to get involved and help make a difference? We are looking for a Computer Vision Scientist to develop sophisticated algorithms to join our team today!</div>\n<br>\nTop Reasons to Work with Us<div>\n\n\n<ul>\n<li>Company led by start-up extraordinaire!</li>\n<li>Un-paralleled, innovative technology!</li>\n<li>Competitive Salary</li>\n<li>Generous Health Benefits</li>\n<li>401k</li></ul></div>\n\n\nWhat You Will Be Doing<div>\n\n\n<ul>\n<li>Develop advanced algorithms for feature detection and tracking, balancing performance requirements such as accuracy, hardware size, and speed.</li>\n<li>Responsible for hardware selection, calibration, and integration to achieve desired performance.</li>\n<li>Develop algorithms for fusion of different data sources.</li>\n<li>Develop advanced algorithms for 3D reconstruction of anatomy using pre-operative and/or intra-operative information.</li>\n<li>Develop algorithms and/or techniques for medical image segmentation and registration.</li></ul></div>\n\n\nWhat You Need for this Position<div>\n<strong>MUST HAVE:</strong>\n\n\n<ul>\n<li>Experience in feature detection and object pose tracking using monocular and/or stereo cameras.</li>\n<li>Experience with object oriented programming languages such as C/C++, Python, and/or other languages.</li>\n<li>Experience with Open Source computer vision libraries such as OpenCV.</li>\n<li>Experience in 3D reconstruction and registration of 3D datasets.</li>\n<li>Experience with visual-inertial fusion preferred.</li>\n<li>Experience with image segmentation preferred.</li>\n<li>Experience with algorithm development and implementation using Matlab and/or python.</li>\n<li>Expertise in CMake and Linux OS preferred.</li></ul></div>\n\n\n<div>\nSo, if you are a Computer Vision Software Engineer with experience, please apply today!\n<br>\nor simply e-mail your resume to Madeline@cybercoders.com\n<br>\nI look forward to hearing from you!</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}