{"job title": "Principal Data Scientist - Secureworks - Columbia, MD or Remote", "company": "Dell", "city state": "– Maryland City, Maryland", "rating": "3.8", "job description": "Principal Data Scientist - Secureworks - Columbia, MD or Remote at Dell Careers<br>\n<br>\nSkip to main content<br>\n<br>\n-<br>\n<br>\nLife at Dell<br>\n<br>\n- How We Work and Lead<br>\n- Who We Are<br>\n- How We Hire<br>\n- FAQs<br>\n<br>\n-<br>\n<br>\nWorking at Dell<br>\n<br>\n- Why Work Here<br>\n- Diversity &amp; Inclusion<br>\n- Growing Your Career<br>\n- Work Flexibility<br>\n<br>\n-<br>\n<br>\nOur Opportunities<br>\n<br>\n- Students<br>\n- Internships<br>\n- Graduates<br>\n- Global Sales<br>\n- Military &amp; Veterans<br>\n- Events<br>\n<br>\n- Our Locations<br>\n- Saved Jobs<br>\n<br>\nSearch Jobs<br>\n<br>\nKeyword<br>\n<br>\nCategorySelectAccountingBusiness SupportCommunicationsCorporate Development &amp; StrategyCybersecurityDell Career ReStartDell DesignDigital ITEngineeringFinanceGeneral ManagementGraduatesHuman ResourcesIndia R &amp; DIndia SalesInformation TechnologyInside Product SpecialistInside SalesInside Sales Account ManagerInside Sales Account RepresentativeInside Sales RepInternshipLegalManufacturingMarketingMaterials &amp; ProcurementMedium BusinessNew GraduatesOutside Sales - Product SpecialistOutside Sales - Regional Sales ManagerOutside Sales Data Center Sales ExecutiveProduct ServicesProductionProfessional ServicesRemoteRSASalesSecureworksSROVirtustream<br>\n<br>\n Kong , Republic RicoQatarRomaniaRussiaSaudi ArabiaSerbiaSingaporeSlovakiaSouth AfricaSpainSri Arab EmiratesUnited KingdomUnited StatesVietnam<br>\n<br>\nCitySelectAdelaideAhmedabadAl AiresBukit of PeoriaEast RochesterEden PrairieEdinburghEdmontonEislingenEl PasoEl SegundoEldorado do SulExeterFairfieldFarmington HillsFrankfurtFranklinFranklinFrenchs ForestGenevaGeorge Chi Minh CityHong CityKaunasKawasakiKievKuala LumpurKunmingKuwait CityLahoreLas VegasLilleLimaLimerickLisledLondonLos ViewMumbaiMunichNagoyaNanningNashuaNashvilleNew DelhiNew YorkNewportNewtonNieuwegeinNorth RydeNurembergOklahoma CityOsloOttawaOverland ParkPalo AltoPanama CityRaleighRaunheimRedmondResearch Triangle ParkRestonRichardsonRichmondRio de JaneiroRiyadhRocky HillRomeRosevilleRound RockSaint-DenisSalt Lake CitySan AntonioSan DiegoSan FranciscoSan JoseSanta ClaraSantiagoSo LeonardsSt LouisSt PetersburgStockholmStuttgartTaipeiTampaTel DCXi'anZurichSearchReset<br>\n<br>\nDell flexible work options encourage employees to find new ways to work.Flexible Work Opportunities<br>\n<br>\nUse your LinkedIn profile to find the right job match for you. Job Match<br>\n<br>\nSerious about success.<br>\n<br>\nEspecially yours.<br>\n<br>\nPrincipal Data Scientist - Secureworks - Columbia, MD or Remote<br>\n<br>\nMaryland 08/30/2018<br>\nSave this jobJob saved now<br>\n<br>\nSecureworks (SCWX-NASDAQ) is a global leader in intelligence-driven information security solutions. We help organizations confidently pursue business goals in a digitally-connected world. Consistently recognized by industry analysts and readers' polls, we are one of the best in the world at understanding and anticipating threat behavior. We see 250 billion events every day across 4400 clients in more than 55 countries, and our solutions work across all the layers of a client's security environment, including 330 different vendor technologies. Join a talented, dedicated, and diverse team of researchers, analysts, engineers, consultants and business professionals who are focused 100% on protecting our clients from cyber threats. We seek out the brightest minds and empower our teams with the tools and support they need to fight the bad guys and maintain our company's leadership in the cyber security industry.<br>\n<br>\nUniquely positioned to adapt as the industry evolves, we are also proud to be part of the Dell Technologies family. We enjoy competitive compensation and benefits packages, and reward and recognize our employees for exceptional results. A constant focus on continued learning and growth keeps our team members engaged and excited about what's next. We offer flexible work options when available, and emphasize the importance of work-life balance. We know that when our people are rewarded, recognized, and rejuvenated, we win as a team.<br>\n<br>\nRole Overview<br>\n<br>\nWe are looking for a senior data scientist to advance the state-of-the-art in network defense, developing new solutions from research to production on massive, multi-modal data sets. If you're a data scientist with experience applying machine learning to challenging real-world problems, we need your help to push the boundaries of artificial intelligence and bring the most innovative security products to life. You will work on the next generation Secureworks platform, demonstrating the power that data science can bring to cyber security.<br>\n<br>\nResponsibilities<br>\n<br>\n- data science and machine learning to threat intelligence, network situational awareness, intrusion detection and prevention, incident response, and malware analysis.<br>\n- Verify and validate the utility of these methods towards definitively improving computer security.<br>\n- Research the latest algorithms and academic techniques and present them to the team.<br>\n- Give technical presentations and discuss both theoretical and practical specifics of machine learning algorithms and analytic methodologies.<br>\n- Prototype new approaches to extract information from large volumes of structured and unstructured data and correlate events across multiple sources.<br>\n- Collaborate closely with software engineers to productize your prototypes and deploy them in secure, scalable, and fault-tolerant solutions across a distributed architecture.<br>\n- Drive the collection of new data and the refinement of existing data sources including novel ways of getting it labeled.<br>\n- Work effectively in a distributed, startup-like, collaborative team of product managers, software engineers, and security researchers.<br>\n<br>\nRequirements<br>\n<br>\n- BA/BS degree in Computer Science, Machine Learning, or related technical field.<br>\n- 5+ years of relevant work experience with machine learning or data science.<br>\n- Proficiency in R, Python, and/or Scala.<br>\n- Experience with problems and projects that depart from your average academic or Kaggle project and address real-world issues like severe class imbalance.<br>\n- Excellent understanding of machine learning techniques in high-dimensional spaces including kernels, ensembles, regularization, dimensionality reduction, and clustering.<br>\n- Extensive experience with a variety of machine learning algorithms, ideally with a focus on information security, detection tasks, recommender systems, or natural language processing.<br>\n- Strong understanding of the limitations of various architectural approaches when applied to machine learning algorithms when confronting complex, high-volume, high-dimensionality data from varying sources.<br>\n- Superior verbal and written communication skills, ability to convey rigorous mathematical concepts and considerations to non-experts.<br>\n- Passion about machine learning and a desire to constantly learn as the field evolves.<br>\n<br>\nPreferences<br>\n<br>\n- MS or PhD degree in Computer Science, Machine Learning, or related technical field.<br>\n- 3+ years developing and deploying machine learning solutions in a production environment.<br>\n- Experience developing end-to-end solutions on big data platforms, such as Hadoop or Spark.<br>\n- Experience with a machine learning library, such as scikit-learn, MLlib, TensorFlow, Caffe/2, Keras, Pytorch/Torch, MxNet, etc.<br>\n- Exposure to packet captures, network flows, log data, malware analysis, a plus.<br>\n- Experience with Amazon AWS, Google GCP, or similar cloud provider.<br>\n- Prior experience working at a startup or in an entrepreneurial environment.<br>\n<br>\nThis is a remote position with potential travel up to 5%<br>\n<br>\nSecureworks (A Dell Technologies Company) is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Secureworks are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Secureworks will not tolerate discrimination or harassment based on any of these characteristics. Learn more about Diversity and Inclusion at Secureworks here.<br>\n<br>\nJob Family: Secureworks Remote Job ID: R64952<br>\nnow<br>\n<br>\nRelated Job Opportunities<br>\n<br>\n- Sr. Product Manager - Secureworks - Austin, TX, Atlanta, GA, D.C. Metro, or Remote Multiple Locations<br>\n- Project Program Management Consultant - Secureworks - Atlanta, GA, DC Metro or Remote Multiple Locations<br>\n- UI/UX Software Engineer - Secureworks - Austin, TX, Columbia, MD, or Remote Multiple Locations<br>\nView All Opportunities<br>\n<br>\nPro Tips<br>\n<br>\nExplore this location<br>\n<br>\nthis job<br>\n<br>\n- Facebook<br>\n- Twitter<br>\n- LinkedIn<br>\n- Google+<br>\n- Email<br>\n<br>\n-<br>\n<br>\nFrequently Asked Questions Read More<br>\n<br>\n-<br>\n<br>\nMilitary and Veterans Read More<br>\n<br>\n-<br>\n<br>\nGraduates Read More<br>\n<br>\nJoin Our Talent Network<br>\n<br>\nReceive alerts with new job opportunities that match your interests.Sign Up<br>\n<br>\nClose<br>\n<br>\nJoin Our Talent Network<br>\n<br>\nReceive alerts with new job opportunities that match your interests.<br>\n<br>\nEmail AddressInterested InSelect locations and/or categories of interest below and click the plus symbol.<br>\n<br>\nCategory<br>\n<br>\nLocationAdd<br>\n<br>\n- Secureworks, Maryland, United StatesRemove<br>\n- Remote, Maryland, United StatesRemove<br>\n- Remove<br>\n<br>\nConfirm Email<br>\n<br>\nConnect With Us<br>\n<br>\n- Facebook<br>\n- Twitter<br>\n- LinkedIn<br>\n- Glassdoor<br>\n- YouTube<br>\n- Instagram<br>\n<br>\n-<br>\n- Life at Dell<br>\n- Working at Dell<br>\n- Our Opportunities<br>\n- Our Locations<br>\n<br>\nNotice of filing of labor condition applications<br>\n<br>\nSee Listings &gt;<br>\n<br>\nU.S. Employment Rights<br>\n<br>\nDell is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin or protected veteran status and will not be discriminated against on the basis of disability. See Federal Employment Poster &gt;<br>\n<br>\n- Dell's Diversity &amp; Equal Employment Opportunity Policy<br>\n- Dell participates in E-Verify<br>\n- Dell's Pay Transparency Nondiscrimination Statement<br>\n<br>\nRequest an Accommodation<br>\n<br>\nDell strives to reasonably accommodate its employees and applicants in accordance with federal, state and local laws. If you need assistance to navigate Dell's Career website or to apply for a position, please email *******************. Please note that only those inquiries concerning a request for reasonable accommodation will be responded to.<br>\n<br>\nIf you are selected for further consideration and need an accommodation for any part of the application or interview process, please notify your Talent Acquisition Representative.<br>\n<br>\nPrivacy Statement for Job Applicants<br>\n<br>\nIndia Employment Rights<br>\n<br>\nDell is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind<br>\n<br>\nAll employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages.<br>\n<br>\nImportant information about an email scam directed at potential candidates<br>\n<br>\nDell does not have any policy of demanding money from candidates for attending interviews or for providing job offers. Genuine job openings in Dell are posted on the Dell career website and any job applications received by Dell will be reviewed and taken forward on merit based on the requirement within the company.<br>\n<br>\nThe general public is hereby cautioned not to respond to or interact with any individual/entity who/which issues any emails/letters making demand for money from people on the pretext of being called for interviews/employment in Dell. Dell is not in any way connected/associated with such emails/letters, and therefore, cannot be held liable for the actions of either the perpetrators or the victims. Any person dealing with such individual/entities shall do so at his/her/their own risk and Dell shall not be responsible for any loss/injury arising therefrom. The public in general are also advised not to be attracted or lured by any communications that solicits payment and promises for interviews/employment."}