{"job title": "Associate Scientist |", "company": "Kelly Services", "city state": "– Juncos, PR", "rating": "3.5", "job description": "Associate Scientist\n\n<ul>\n\n\t<li>To perform experiments, organize data and analyse results under minimal supervision.</li>\n\n<li>With minimal supervision plans, conducts or monitors experiments, records and organizes data, analyses results.</li>\n\n<li>Generates robust and reliable data and/or ensures that contracted studies are conducted in compliance with the respective protocol and applicable guidelines and regulations. Monitors or follows established experimental design and protocols and performs routine tasks and studies to obtain reproducible and reliable results with limited supervision.</li>\n\n<li>Plans, monitors or conducts, analyzes and records experiments, and provides interpretation of data.</li>\n\n<li>Effectively transfers experimental methods from literature to the lab and makes modifications as necessary.</li>\n\n<li>Develops and implements new protocols with moderate review Engages coworkers in scientific discussions.</li>\n\n<li>Contributes to internal/external reports, papers, presentations, regulatory documents, invention disclosure submissions and/or patents.</li>\n</ul>\nMasters degree or Bachelors degree BS in Science (Chemistry, Biology, Biotechnology, General Science) and 2 years of Scientific experience\n<br><br>\nExperience in HPLC, analytical methodologies and analytical instruments qualification programs. Excellent computer technical writing skills.<br>\n<div>Why Kelly®?</div>\n<br><br>\nAt Kelly \n<br><br>\nServices®, we work with the best. Our clients include 95 of the Fortune \n<br><br>\n100™ companies, and more than 70,000 hiring managers rely on Kelly annually to access \n<br><br>\nthe best talent to drive their business forward. If you only make one career connection today, connect \n<br><br>\nwith Kelly.<br>\n\n<div>About \n<br><br>\nKelly Services®</div>\n<br><br>\nAs a workforce advocate for over 70 years, we are proud to directly employ nearly 500,000 people \n<br><br>\naround the world and have a role in connecting thousands more with work through our global network of \n<br><br>\ntalent suppliers and partners. Revenue in 2017 was $5.4 billion. Visit <u>kellyservices.com</u> and connect with us on <u>Facebook</u>, <u>LinkedIn</u> and <u>Twitter</u>.<br><br>Kelly Services is an equal opportunity employer including, but not limited to, Minorities, Females, \n<br><br>\nIndividuals with Disabilities, Protected Veterans, Sexual Orientation, Gender Identity and is \n<br><br>\ncommitted to employing a diverse workforce. <u>Equal Employment Opportunity \n<br><br>\nis The Law.</u>"}