{"job title": "Marine Mammal and Sea Turtle Rescue Data Management Intern", "company": "New England Aquarium - Interns", "city state": "– Boston, MA", "rating": "NA", "job description": "<strong>Time commitment: 2-3 Days per week for 12 weeks</strong>\n<br><br>\n<strong>Summary:</strong>\n<br><br>\nThe New England Aquarium Rescue and Rehabilitation Team seek an intern to assist with administrative tasking related to marine mammal and sea turtle rescue operations. The intern will be engaged in many aspects of daily office tasking related to the needs of a wild animal rescue program. The position will entail assistance with an animal stranding hotline, field calls, and data entry.\n<br><br>\n<strong>Duties/Responsibilities include, but are not limited to</strong>:\n<ul>\n<li>Assist the Rescue and Rehabilitation Department by maintaining Sea Turtle digital data</li><li>Aid in managing the Stranding Hotline, including response to incoming phone calls, gathering information related to the animal, and assessing the needs of each case</li><li>Maintaining records including water quality, daily food intake, swim charts, and treatment sheets</li><li>Assistance with animal stranding response in a field setting</li><li>Occasionally assist with necropsies of deceased sea turtles and marine mammals</li><li>Attend two professional development lunches with the Volunteer Programs and Internships Office</li>\n</ul>\n<strong>Skills/Qualifications</strong>:\n<ul>\n<li>Proficiency with computer software, including database systems and spreadsheets</li><li>Experience with Microsoft Access and Excel preferred</li><li>Must be able to work independently and as part of a team</li><li>Must be at least 18 years of age and have access to a car</li><li>This position requires physical tasks; Applicant must be able to lift and carry 50 lbs</li>\n</ul>\nNote: This internship does not contain direct animal husbandry. This position is not available for January term.\n<br><br>\n*PLEASE NOTE: This position has occurs in our Animal Care Center in Quincy, MA.\n<br><br>\n<strong>Required Events:</strong>\n<ul>\n<li>Orientation (takes place prior to first training or shift with department)</li><li>Meet and Greet</li><li>Two Professional Development Lunches</li><li>Intern Celebration</li><li>Exit Interview</li>\n</ul>\n<strong>Organizational Description:</strong>\n<br><br>\nThe New England Aquarium's mission is to protect the blue planet through hands-on programs, live animal and interactive exhibits, public lectures and forums, and research and conservation projects.\n<br><br>\nThis mission is fulfilled through exhibits, and through education, conservation and research programs. Exhibits showcase the diversity, importance and beauty of aquatic life and habitats, and highlight critical aquatic conservation issues. Programs emphasize species, habitats and issues critical to New England. The Aquarium is also a pioneer in marine animal rescue, and a leading ocean conservation organization with research scientists working around the globe.\n<br><br>\nThe New England Aquarium serves as a responsive community resource that attracts and involves the broadest possible audience; seeks a culturally diverse staff and governing board that reflect our community; adheres to the highest standards of animal stewardship; and is committed to delivering the highest quality visitor experience in a welcoming and enjoyable manner that evokes wonder, curiosity, understanding, caring and action.\n<br><br>\n<strong>Department Description:</strong>\n<br><br>\nMarine Animal Rescue responds to calls to provide medical treatment for whales, dolphins, porpoises, seals and sea turtles. Established in 1968, the Marine Animal Rescue Team has responded to thousands of calls providing medical treatment to stranded, injured and diseased marine animals throughout the New England coastal region. Interns provide support for Rescue staff in all aspects of the program.<br><br>0\n<br><br>\n<strong>Job Posted by ApplicantPro</strong>\n<br>"}