{"job title": "Risk &amp; Underwriting Data Scientist - Requisition #: 445831900", "company": "New York Life", "city state": "– New York, New York", "rating": "3.5", "job description": "New York Life Insurance Company (“New York Life” or “the company”) is the largest mutual life insurance company in the United States*. Founded in 1845, New York Life is headquartered in New York City, maintains offices in all fifty states, and owns Seguros Monterrey New York Life in Mexico.\n<br><br>\nNew York Life is one of the most financially strong and highly capitalized insurers in the business. The company reported 2016 operating earnings of $1.954 billion. Total assets under management at year end 2016, with affiliates, totaled $538 billion. As of year-end 2016, New York Life’s surplus was $23.336 billion**. New York Life holds the highest possible financial strength ratings currently awarded to any life insurer from all four of the major ratings agencies: A.M. Best, A++; Fitch AAA; Moody’s Aaa; Standard &amp; Poor’s AA+. (Source: Individual Third Party Ratings Report as of 8/17/16).\n<br><br>\nFinancial strength, integrity and humanity—the values upon which New York Life was founded—have guided the company’s decisions and actions for over 170 years.\n<br><br>\n<strong>Lead Data Scientist</strong>\n<br><br>\n<strong>New York Life</strong>, the largest writer of retail life insurance in the U.S. and a top player in annuities, long-term care and mutual funds, is seeking a Lead Data Scientist in its Center for Data Science and Analytics.\n<br><br>\nThe company has over 150 years of history and while usable data does not quite go back this far, we have a wealth of internal information on consumers, policies and their performance, as well as applicants, prospects and our 10,000 agents. We also have a multitude of external data from a great variety of sources. New York Life is likely the most data-rich company in the life insurance industry. Analytical challenges range from mortality risk (with a number of both medical and non-medical components) to agent recruiting decisions, consumer analytics (segmentation, response, conversion, retention, up-sell), fraud detection and digital advertising placement.\n<br><br>\nThe <strong>Center for Data Science and Analytics</strong> is the innovative corporate Analytics group within New York Life. We are a rapidly growing entrepreneurial department which aims to design, create and offer innovative data-driven solutions for many parts of the enterprise. We are aided by New York Life's existing business with a large market share in individual life insurance. We have the freedom to explore external data sources and new statistical techniques, and are excited about delivering a whole new generation of Analytical solutions.\n<br><br>\nIn fact, we are designing and will build one of the first multivariate model-based continuous risk differentiations in the industry. This model will incorporate current underwriting best practices (including medical rules) as features and add other data sources, patterns/ideas and variables to essentially create a rating plan to support the next generation underwriting process at New York Life. This is just one of several projects with large business value. Geographic analytics on agents and customers, application fraud detection, agent success prediction and client prospecting analytics (off-line and on-line) are other exciting examples of enormous incremental value from analytics. Our products will be implemented into real-time core business processes and decisions that drive the company (e.g. underwriting, pricing, agent recruiting, prospecting, new product development).\n<br><br>\nWe work with data ranging from demographics, credit and geo data to detailed medical data (medical test results, diagnosis, prescriptions) and social media information. We have a modern computing environment with a solid suite of data science/modeling tools and packages, and a large (but manageable) group of well-trained professionals at various levels to support you. Life insurance is on the verge of huge change. This is a chance to be part of, actually to drive, the transformation of an industry. Is this not why we became data scientists?\n<br><br>\n<strong>You will</strong> apply your highly developed analytical skills to work on all aspects of the life insurance value chain, ranging from risk models, fraud detection, process triaging, and marketing predictions to a variety of other analytics solutions.\n<br><br>\n<strong>You will</strong> apply your leadership experience, high energy level and business sense to communicate with internal stakeholders and external vendors while effectively leading complex analytics projects.\n<br><br>\n<strong>You will</strong> also ingest and wrangle data, propose analytics strategy, create related business cases, drive several large initiatives, build and implement solutions at scale and give presentations as a subject matter expert.\n<br><br>\n<strong>Responsibilities</strong>\n<li>Independently leads data analysis and modeling projects from project/sample design, business review meetings with internal and external clients deriving requirements/deliverables, reception and processing of data, performing analyses and modeling to final reports/presentations, communication of results and implementation support.</li> <li>Demonstrates to internal and external stakeholders how analytics can be implemented to maximize business benefits. Provides technical support, which includes strategic consulting, needs assessments, project scoping and the preparation/presentation of analytical proposals.</li> <li>Utilizes advanced statistical techniques to create high-performing predictive models and creative analyses to address business objectives and client needs.</li>  <li>Tests new statistical analysis methods, software and data sources for continual improvement of quantitative solutions. Shares knowledge within Analytics group.</li> <li>Proactively and effectively communicates in various verbal and written formats with internal stakeholders on product design, data specification, model implementations, with partners on collaboration ideas and specifics, with clients and account teams on project/test results, opportunities, questions. Resolves problems and removes obstacles to timely and high-quality project completion.</li> <li>Create project milestone plans to ensure projects are completed on time and within budget. Provides high quality ongoing customer support; answering questions, resolving problems and building solutions.</li> <li>Actively contributes to analytics strategy by contributing ideas, preparing presentation material for internal stakeholders, and product design/business case materials for NYL leadership.</li> <li>Follows industry trends in insurance and related data/analytics processes and businesses. Functions as the analytics expert in meetings with other internal areas and external vendors. Actively participates in proof of concept tests of new data, software and technologies.</li> <li>Assures compliance with regulatory and privacy requirements during design and implementation of modeling and analysis projects.</li> <li>Travels to events and vendor meetings as needed (<br><br><strong>Required qualifications</strong>\n<ul>\n <li>Graduate-level degree with concentration in a quantitative discipline such as statistics, computer science, mathematics, economics, or operations research OR Associateship/Fellowship in one of the Actuarial Societies.</li> <li>5+ years of experience with statistical modeling using large and complex datasets in a business setting.</li> <li>3+ years of experience in the insurance industry (life, health or P&amp;C).</li> <li>Strong verbal and written communications skills, listening and teamwork skills, and effective presentation skills. This is absolutely essential since you will have a lot of exposure to different internal groups (data, IT, actuarial, medical, underwriting, Legal, Agency, government relations, etc.) as well as third-party data partners.</li> <li>Strong expertise in statistical modeling techniques such as linear regression, logistic regression, survival analysis, GLM, tree models (Random Forests and GBM), cluster analysis, principal components, feature creation, and validation.</li> <li>Strong expertise in regularization techniques (Ridge, Lasso, elastic nets), variable selection techniques, feature creation (transformation, binning, high level categorical reduction, etc.) and validation (hold-outs, CV, bootstrap).</li> <li>Substantial programming experience with almost all of the following: SAS (STAT, macros, EM), R, H2O, Python, SPARK, SQL, other Hadoop. Exposure to GitHub.</li> <li>Experience with data visualization (e.g. R Shiny, Spotfire, Tableau)</li> <li>Proficiency in creating effective and visually appealing PowerPoint presentations.</li>\n</ul>\n<strong>Location:</strong> Manhattan (midtown, walking distance from Penn Station and Grand Central)\n<br><br>\nSF: LI-TK1\n<br><br>\nSF: EF-TK1\n<br><br>\n<strong>v\\</strong>\n<br><br>\nEOE M/F/D/V\n<br><br>\nIf you have difficulty using or interacting with any portions of this Web site due to incompatibility with an Assistive Technology, if you need the information in an alternative format, or if you have suggestions on how we can make this site more accessible, please contact us at: (212) 576-5811.\n<br><br>\n* Based on revenue as reported by “Fortune 500, ranked within Industries, Insurance: Life, Health (Mutual),” Fortune Magazine, June 17, 2016. See http://fortune.com/fortune500/ for methodology.\n<br><br>\n** Total surplus, which includes the Asset Valuation Reserve, is one of the key indicators of the company’s long-term financial strength and stability and is presented on a consolidated basis of the company.\n<br><br>\n1. Operating earnings is the key measure use by management to track Company’s profitability from ongoing operations and underlying profitability of the business. This indicator is based on generally accepted accounting principles in the US (GAAP), with certain adjustments Company believes to be appropriate as a measurement approach (non GAAP), primarily the removal of gains or losses on investments and related adjustments.\n<br><br>\n2. Assets under management represent Consolidated Domestic and International insurance Company Statutory assets (cash and invested assets and separate account assets) and third party assets principally managed by New York Life Investment management Holdings LLC, a wholly owned subsidiary of New York Life Insurance Company.\n<br><br>\n<strong>Job Segment:</strong>  Database, Risk Management, Scientific, Underwriter, Accounting, Technology, Engineering, Finance, Insurance<br><br>Requisition #: 445831900</li>"}