{"job title": "Chief Data Scientist – Demand Sensing, Enterprise Data &amp; Analytics", "company": "NIKE", "city state": "– Beaverton, Oregon", "rating": "3.9", "job description": "Become a Part of the NIKE, Inc. Team\n<br><br>\nNIKE, Inc. does more than outfit the world's best athletes. It is a place to explore potential, obliterate boundaries and push out the edges of what can be. The company looks for people who can grow, think, dream and create. Its culture thrives by embracing diversity and rewarding imagination. The brand seeks achievers, leaders and visionaries. At Nike, it’s about each person bringing skills and passion to a challenging and constantly evolving game.<br><br><strong>Description</strong>\n<br>\n<div><div>Nike is looking for a Chief Data Scientist who can lead and grow teams of machine learning engineers and data scientists to deliver high quality advanced analytics solutions to customers across our business. You will work on a variety of complex business problems specifically focused on inventory optimization, demand sensing and forecasting. You will lead teams test new and interesting hypotheses, explore new methods to increase the forecast accuracy, and extract signals from new data. You will leverage big data, parallel processing technologies, advanced analytics, machine learning, and deep learning techniques to quantitatively plan product demand, allocate resources, and target the right customers with the best products. You will foster partnerships with best of breed open source communities, commercial vendors, and universities. Above all, your work will accelerate Nike's core mission of serving Athletes*.</div> <div></div><div></div>\n<br><strong>What you’ll do</strong>\n<ul>\n<li>Collaborate with key stakeholders to explore opportunities to develop data driven solutions by developing and utilizing statistical modeling and machine learning algorithms</li><li>Translate ambiguous statements into structured problem statements and testable hypotheses</li><li>Analyze and profile available, reliable, and relevant data (internal and external) to uncover insights in support of scalable solutions</li><li>Select and validate appropriate models to discover meaningful patterns and insights for a wide variety of business problems</li><li>Define and track model accuracy, ensuring model relevance and reliability; enhance the model as needed</li><li>Create clear and structured deliverables to communicate meaningful insights and prescribe actionable data driven business solution recommendations</li><li>Build trust and drive business adoption by demystifying solution intricacies for stakeholders</li><li>Collaborate with a team of data scientists, solutions delivery managers, engineers, and business stakeholders to take an opportunity or pain point from concept to scaled solution</li> <li>Create awareness of industry and technology trends as well as emerging tools &amp; techniques relevant to the discipline, encouraging application within Nike</li><li>Cultivate a continuous learning environment within the organization and advanced analytics community through persistent development of new skills and sharing of knowledge through mentorships and contributions to the open source community</li><li>Define and establish best practices</li><li>Influence and drive the strategy for one or more products; identify requirements, create development plans and interface with business stakeholders</li><li>Lead the team’s development and application of new methodologies; identify and solve for roadblocks</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br>\n<div><strong>Who you are</strong></div>\n\n<ul>\n<li>Thought leader</li><li>Strong background in mathematics, statistics, or a related field</li><li>Expert knowledge of applied data science</li><li>Expert in machine learning algorithms and data science methods</li><li>Expert in various programming and scripting languages</li><li>Expert understanding and experience with CRISP-DM and Agile data\n<br>\nscience framework</li> <li>Expert knowledge and experience with a diversity of tools and\n<br>\nplatforms</li><li>Proven experience creating new, useable algorithms</li><li>Expert understanding of data structures and algorithms</li><li>Expert understanding of solution and technical design</li><li>Has a strong problem solving and analytical mindset</li><li>Able to influence and communicate effectively, both verbally and\n<br>\nwritten, with team members, business stakeholders and leadership</li><li>Able to quickly pick up new programming languages, technologies, and\n<br>\nframeworks</li></ul></div>\n<br>NIKE, Inc. is a growth company that looks for team members to grow with it. Nike offers a generous total rewards package, casual work environment, a diverse and inclusive culture, and an electric atmosphere for professional development. No matter the location, or the role, every Nike employee shares one galvanizing mission: To bring inspiration and innovation to every athlete* in the world.\n<br><br>\nNIKE, Inc. is committed to employing a diverse workforce. Qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, veteran status, or disability.\n<br><br>\n<strong>Job ID</strong> 00408364"}