{"job title": "Data Science Lead", "company": "Nutrien LTD", "city state": "– Loveland, CO", "rating": "2.5", "job description": "<strong>Digital Data Science Lead, Loveland, CO</strong>\n<br><br>\nWhy work at Nutrien Ag Solutions? Great question!\n<br><br>\nSafety is a core value at Nutrien Ag Solutions. Keeping every employee safe, healthy and secure is our top priority. Nothing is more important than seeing our people go home safe at the end of every single day.\n<br><br>\nWhile working here you will have the opportunity to grow your career while helping us feed the future. We pride ourselves in hiring from a variety of backgrounds and truly believe that it is our differences that make us stronger so we hope you will join us.\n<br><br>\nIn addition to exciting and challenging opportunities, Nutrien Ag Solutions offers competitive salaries, great benefits and performance based incentives.\n<br><br>\nOutside of the skills and necessary qualifications, you will be committed to sustaining our safe and positive work environment while welcoming working side by side others in a diverse culture. Culture at Nutrien Ag Solutions is the core of everything we do and all employees are respectful of diverse opinions and views.\n<br><br>\nThe newly created Digital Solutions team at Nutrien Ag Solutions is responsible for creating a best in class digital experience for employees and customers. This is the team that ideates, executes, and delivers digital technology for Nutrien Ag Solution's customers and our people who service them. We partner with business leaders and IT to build custom software that powers a $12 billion agriculture retailer. The Customer &amp; Employee experience Business Owner works closely with the business creating and setting the strategy and vision for the development and implementation of product portfolio as we expand our platform to enhance omni-channel capabilities, optimize mobile and tablet experiences, and support the digital experience of our customers and our salesforce.\n<br><br>\nNutrien Ag Solutions is looking for a Data Scientist / Engineer that has a deep understanding of Big Data and Advanced Analytics, and will help the team in discovering and building features valuable to end customers. Works with and alongside the Digital team and the business users to continuously generate insight from data. This position reports to the Nutrien Ag Solutions VP of Digital.\n<br><br>\n<strong>Base location</strong>: Loveland, Colorado\n<br><br>\n<strong>Travel</strong>: Intermittent Travel may be required (less than 20%)\n<br><br>\n<strong>Key Tasks:</strong>\n<ul>\n<li>Lead the Data Science team, perform team performance reviews, mentor, and manage team resource commitments</li><li>Using corporate strategy as a guide this role will be responsible for developing and managing a vision for the following:\n\n<ul>\n<li>Designing, developing, and implementing end-to-end cloud based machine learning production pipelines (data exploration, sampling, training data generation, feature engineering, model building, and performance evaluation)</li><li>Ensuring that data pipelines are scalable, repeatable, and secure, and can serve multiple users within the company</li><li>Enabling big data and batch/real-time analytical solutions that leverage emerging technologies</li><li>Develops standards and processes for integration projects and initiatives</li></ul></li>\n<li>Promoting corporate and technical innovation in the area of data science</li><li>Working with business stakeholders to understand how to best leverage, enhance, and monetize Agrium’s corporate data</li>\n</ul>\n<strong>Qualifications:</strong>\n<ul>\n<li>Minimum of 7 years of experience in data science</li><li>Master’s or PhD Degree in Information Technology, Computer Science, or a related discipline preferred, or extensive and comparable experience exhibiting measurable results in the area of Data Science</li><li>Understanding of high performance algorithms and R statistical software</li><li>Experience in agricultural industry data science (e.g. machine learning, predictive maintenance) preferred</li><li>Capability to architect highly scalable distributed systems, using different open source tools</li><li>Excellent problem solving and critical thinking skills</li><li>Demonstrated experience with agile or other rapid development methods</li><li>Expert knowledge of data modeling and understanding of different data structures</li><li>Experience using big data batch and streaming tools</li><li>Able to build a sense of trust and rapport that creates a comfortable &amp; effective workplace</li><li>Passion for innovation and “can do” attitude</li>\n</ul>\nNutrien Ag Solutions is committed to creating an inclusive workplace. We encourage applications from all well qualified candidates who reflect the diversity of the regions where we operate. This includes recognizing the voluntary identification of status such as gender, sexual orientation, visible minority, Indigenous status, persons with disabilities, and veterans, where applicable.\n<br><br>\nIf this sounds like a good match, apply now. You may be required to undergo a background check and substance test in accordance with Nutrien Ag Solutions' policies.\n<br><br>\nWhile we appreciate all applications we receive, we advise that only candidates under consideration will be contacted.\n<br><br>\n**EOE race/color/sex/sexual orientation/gender identity/disability/vet\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}