{"job title": "Lead Data Scientist - (JOIN OCI Networking", "company": "Oracle", "city state": "– Seattle, WA", "rating": "3.4", "job description": "<ul>\n<li>*Lead Data Scientist - (JOIN OCI Networking**</li>\n<li>*Preferred Qualifications**</li>\n<li>*Oracle CloudInfrastructure (OCI)**</li>\n<li>*Network Backbone&amp; Capacity Planning Group**</li>\n<li>*Lead Data Scientist**</li>\n<li>*Seattle, WA**</li>\n</ul>\n\nThe Oracle Cloud\n<br><br>\nInfrastructure (OCI) team can provide you the opportunity to build and operate\n<br><br>\na suite of massive scale, integrated cloud services in a broadly distributed,\n<br><br>\nmulti-tenant cloud environment. OCI is committed to providing the best in cloud\n<br><br>\nproducts that meet the needs of our customers who are tackling some of the\n<br><br>\nworld's biggest challenges\n<br><br>\nWe offer unique\n<br><br>\nopportunities for smart, hands-on engineers with the expertise and passion to\n<br><br>\nsolve difficult problems in distributed highly available services and\n<br><br>\nvirtualized infrastructure. At every level, our engineers have a significant\n<br><br>\ntechnical and business impact designing and building innovative new systems to\n<br><br>\npower our customer's business critical applications **.**\n<br><br>\nhttps://www.google.com/#q=Oracle Bare Metal Cloud\n<br><br>\nAre you interested in building\n<br><br>\nlarge-scale distributed networking solutions for the cloud? Do you love the\n<br><br>\nidea of working in an autonomous environment with the excitement of a start-up,\n<br><br>\nbut the financial backing of a Fortune 500 company? You?ll be joining\n<br><br>\nnear the ground floor of a fast-growing new venture that offers a ton of\n<br><br>\nautonomy and a lot of variety. This role offers huge upside potential,\n<br><br>\nhigh visibility, and fast career growth without the risk of a typical\n<br><br>\nstart-up. It is a unique opportunity to work with smart people who are\n<br><br>\nsolving complex problems in distributed systems, networking, multi-tenant\n<br><br>\nInfrastructure-as-a-Service (IaaS), and Software Defined Networking (SDN)\n<br><br>\noperating at massive scale.\n<br><br>\nWe are looking for a **Lead Data Scientist** to join\n<br><br>\nOracle Cloud Infrastructure Network Backbone &amp; Capacity Planning Team in\n<br><br>\nSeattle. This role will provide thought leadership in the implementation of\n<br><br>\napplied analytical solutions relevant to solving the business and end user\n<br><br>\nneeds\n<br><br>\nCollaborating with other developers (both data scientists\n<br><br>\nand engineers) to design, research, integrate, and implement solutions\n<br><br>\nCollaborating with other analysts, product and client-facing\n<br><br>\nstakeholders to determine the feasibility of specific client requests given our\n<br><br>\ndata and capability\n<br><br>\nCommunicating with team members, project management and\n<br><br>\nbusiness stakeholders to understand requirements and strategically implement\n<br><br>\nrobust software and machine learning design\n<br><br>\nIdentifying opportunities for improvement within existing\n<br><br>\nsoftware applications and frameworks\n\n\n<ul>\n<li>*MandatoryQualifications:**</li>\n</ul>\n\n8 years of experience in\n<br><br>\nquantitative analysis\n<br><br>\nExperience Data Science, Predictive,\n<br><br>\nand Advanced Analytics as an individual contributor\n<br><br>\nExperience working with big data and\n<br><br>\nbig data tools such as Spark\n<br><br>\nExperience manipulating data sets through statistical software (ex. R, SAS) or\n<br><br>\nother methods\n<br><br>\nExperience with database\n<br><br>\noptimization, query optimization\n<br><br>\nExperience with distributed computing\n<br><br>\n(Hive/Hadoop)\n<br><br>\nDevelopment experience in any\n<br><br>\nscripting language (PHP, Python, Perl, etc.)\n<br><br>\nAbility to communicate the results of analyses with product and leadership\n<br><br>\nteams to influence the strategy of the product\n<br><br>\nUnderstanding of statistics (e.g., hypothesis testing, regressions)\n\n\n<ul>\n<li>*PREFERRED QUALIFICATIONS**</li>\n</ul>\n\nAdvanced degrees\n<br><br>\nBA/BS in Computer Science, Math,\n<br><br>\nPhysics, Engineering, Statistics or other technical field\n<br><br>\nOracle is an Equal Employment\n<br><br>\nOpportunity Employer. All qualified applicants will receive consideration for\n<br><br>\nemployment without regard to race, color, religion, sex, national origin,\n<br><br>\nsexual orientation, gender identity, disability and protected veteran status or\n<br><br>\nany other characteristic protected by law.\n\n\n<ul>\n<li>*Detailed Description and Job Requirements**</li>\n</ul>\n\nDesign, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.\n<br><br>\nAs a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. Define specifications for significant new projects and specify, design and develop software according to those specifications. You will perform professional software development tasks associated with the developing, designing and debugging of software applications or operating systems.\n<br><br>\nProvide leadership and expertise in the development of new products/services/processes, frequently operating at the leading edge of technology. Recommends and justifies major changes to existing products/services/processes. BS or MS degree or equivalent experience relevant to functional area. 8 or more years of software engineering or related experience.\n\n\n<ul>\n<li>*Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.**</li>\n<li>*Job:** Product Development</li>\n<li>*Location:** US-WA,Washington-Seattle</li>\n<li>*Job Type:** Regular Employee Hire</li>\n<li>*Organization:** Oracle</li>\n</ul>"}