{"job title": "Consulting Solution Manager - Data, Data Analyst, Data Scientist (US-NSG)", "company": "Oracle", "city state": "– Reston, Virginia", "rating": "3.4", "job description": "No Visa Sponsorship is available for this position.\n<br><br>\n<strong><br><br>Preferred Qualifications</strong>\n<br><br>\n<strong> Consulting Solution Manager / Data/Data Analyst/Data Scientist</strong>\n<br><br>\nUS Citizenship and TS/SCI/FSP Security Clearance is required.\n<br><br>\nNo Visa Sponsorship is available for this position.\n<br><br>\nConsulting Solution Manager - National Security Group (NSG)\n<br><br>\n<strong> Preferred Geography Northern Virginia and Washington Metropolitan Area. Alternative Geography Maryland</strong>\n<br><br>\nWe are searching for a data and data analyst (or data scientist) with experience supporting the U.S. Intelligence Community who has functional knowledge in leveraging data and analytics to support mission needs. This individual should also have demonstrated experience in translating customer needs into requirements that are supportable with technology and analytical solution.\n<br><br>\nThe individual should also possess experience as an individual contributor and in leadership roles.Finally, this individual should have some knowledge of adapting machine learning techniques and technology to deliver upgraded capability and support the Cloud roadmap in our Consulting support to the IC.\n<br><br>\n<strong> Qualifications:</strong>\n<br><br>\nCandidates should be passionate about the customers mission and supporting that mission through the application of data, data analytics, automation and consulting, cloud computing, and customer satisfaction.\n<br><br>\nCandidates will need to possess product knowledge, development / programming expertise, and consulting experience. They will also need to excel at both written and verbal communication.\n<br><br>\nWe are looking for:\n<br><br>\n·A seasoned engineer or data scientist who has extensive experience working with algorithms and COTS tools; scaling, storing, and analyzing data; and translating customer needs and requirements to operational outcomes.\n<br><br>\n·A Senior Software Engineer or data scientist with distributed systems and Big Data experience who wants to dream up new data possibilities and come up with creative solutions to utilize and analyze massive data streams.\n<br><br>\n·A self-starter who is able to work equally well as an individual contributor, a team member, or a team leader to achieve specific customer objectives.\n<br><br>\n·Someone who can imagine new mission solutions to address the most complex customer analytical issues and adapt emerging technologies such as machine learning, Internet of Things, Bloc Chain, and more.\n<br><br>\nWe are looking for highly accomplished data scientists to join the NSG National Security Consulting team supporting the civil agencies. You will adapt Oracle analytical tools and technology to meet existing mission needs and define, design, and implement new approaches to emerging mission needs.his individual will also build and manage an analytical team supporting multiple opportunities across the customer territory.\n<br><br>\n<strong> Responsibilities</strong>\n<br><br>\nDesigns, develops and programs methods, processes, and systems to consolidate and analyze structured, unstructured, diverse small, medium, and big data sources to generate actionable insights and solutions for client services and product enhancement.\n<br><br>\nInteracts with product and service teams to identify questions and issues for data analysis and experiments. Leverages COTS tools to address immediate analytical needs.Develops and codes software programs (or works with developers and engineers), algorithms and automated processes to cleanse, integrate and evaluate datasets from multiple disparate sources.\n<br><br>\nIdentifies meaningful insights from data and metadata sources; interprets and communicates insights and findings from analysis and experiments to product, service, and business managers. Leading contributor individually and as a team member, providing direction and mentoring to others. Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization.\n<br><br>\nIs a functional expert, assisting customer staff and analyst to use the delivered analytical technology.Provides direct onsite engagement, training, and support to mission staff.\n<br><br>\nThis position will require:\n<br><br>\n·A combination of Development skill and consulting delivery capabilities\n<br><br>\n·Ability to mentor and guide junior level professionals, and translate customer needs to technical developers and DBAs\n<br><br>\n·Familiarity with Oracle database and Oracle analytical tools\n<br><br>\n·8+ years relevant work experience.\n<br><br>\n·-MSor BS in Applied Mathematics, Physics, Computer Science, Statistics or related technical field\n<br><br>\n·- Hands-on experience in data mining and predictive analytics with machine learning/statistical modeling techniques\n<br><br>\n·- Advanced data science tools such as R or Python\n<br><br>\n·- Experience with wrangling large datasets with big data tools such as Hadoop, Hive and Spark\n<br><br>\n·- Experience applying computational algorithms and statistical methods to structured and unstructured data\n<br><br>\n·- Flexibility, adaptability and the ability to learn quickly in various technical and creative environments, while delivering quality work by tight deadlines\n<br><br>\n·- Ability to perform thorough analysis of complex data, draw sound conclusions, and devise actionable strategies\n<br><br>\nNice to have:\n<br><br>\n·Experience deploying and configuring Java applications on WebLogic server\n<br><br>\n·Advanced knowledge of JET development. Or advanced knowledge of Java scripting frameworks such as JQuery, JQueryUI Require, Knockout\n<br><br>\n·- Neural networks experience is a plus, especially with RNNs and CNNs\n<br><br>\n·- Experience with Tensorflow, Keras APIs etc. is a plus\n<br><br>\n·Experience with public clouds like Oracle, AWS or Azure.\n<br><br>\n·Previous experience coding automation tools\n<br><br>\n<strong> POSITION RESPONSIBILITIES</strong>\n<li> Design, develop, implement, support and maintain complex Java applications.</li> <li> Perform object-oriented analysis and design applying industry best practices and techniques.</li> <li> Work with architects to define architecture models and design critical integrations.</li> <li> Create technical specifications for detailed application design.</li> <li> Troubleshoot and resolve software-related issues.</li> <li> Help Maintain code quality through unit testing.</li> <li> Document code appropriately for maintainability.</li> <li> Conduct design and code reviews to ensure design principles are followed and customer expectations are met.</li> <li> Act as mentor to others on data and analytics issues.</li> <li> Work with team members from beginning of product lifecycle through application release.</li> <li> Available for travel.</li>\nAs a part of Oracles employment process, candidates will be required to complete a pre-employment screening process, prior to an offer being made. This will involve identity and employment verification, salary verification, professional references, educational verification , professional qualifications and memberships (if applicable), and security clearance verification.\n<br><br>\n<strong> Detailed Description of Additional Job Requirements</strong>\n<br><br>\nAs a recognized authority and leading contributor within the practice, this senior-level consulting professional has broad understanding of solutions, industry best practices, multiple business processes or technology designs across multiple product/technology families. Works directly with consulting sales and Project Managers to analyze customer business needs.\n<br><br>\nExercises judgment and business acumen in selecting methods and techniques to design non-routine and complex business solutions utilizing Oracle products and technology to meet customer needs. Influences customer leadership in acceptance of Oracle solutions and services to facilitate the closing of consulting deals.\n<br><br>\nContributes to statements of work, work breakdown structures and/or level of effort and staff plans. Presents and demonstrates solutions to customers. Builds and maintains a network and up-to-date specific industry or product knowledge. Responsible for transitioning deal knowledge to implementation team. Leads the domain specific solution design aspects of engagement(s) ensuring high quality and integrated business solutions. Anticipates project risks and suggest risk mitigation to project manager. Resolves complex customer issues by recommending solutions. Demonstrates expertise in multiple business processes across two or more product families or ability to architect and design technology solutions encompassing multiple products.\n<br><br>\n8-10 years of relevant experience including 4 years of consulting experience. Prior team lead or manager experience. Undergraduate degree or equivalent experience. Broad product, technology or industry expertise. Ability to craft and articulate strategic solutions. In-depth knowledge of implementation methodologies and best practices. Knowledge of competitive &amp; partner products, technology and solutions. Ability to travel as needed."}