{"job title": "Scientist", "company": "Parsons Commercial Technology Group Inc.", "city state": "– Silver Spring, MD", "rating": "NA", "job description": "Biological Technicians II\n<br><br>\na) MS or BS degree in the biological sciences\n<br><br>\nb) Familiarity developing, troubleshooting, and conducting experiments in the area of molecular, biochemical, malaria parasitology or immunological assays. Technical skills and knowledge of molecular, biochemical, malaria parasitological or immunological assays as well as knowledge operating instrumentation required for this task.\n<br><br>\nThe employee shall, either work alone or with a multidisciplinary team of military, civilian and/contractor research scientists and technicians to plan and perform in vitro and in vivo research using molecular biology, biochemistry, structural biology and molecular immunology to generate candidate malaria vaccines/research antigens and investigate immune responses to these antigens in pre-clinical (lab rodents, New Zealand White rabbits, nonhuman primates) and from clinical (human) vaccine trials. Specifically, the employee shall have knowledge and/or experience with:\n<br><br>\na. perform all steps associated with molecular engineering;\n<br><br>\nb. perform all steps associated with protein expression, purification and characterization to include (but not limited to) fermentation, microfluidization, chromatography, methods for protein quality and quantitation assessment; gels and Western blots, and immunochemistry;\n<br><br>\nc. perform all assays associated with immunochemical and immunological characterization of recombinant proteins;\n<br><br>\nd. perform specialized humoral assays to include subunit, avidity, and isotyping ELISAs, IFA, Multiplex-based assays;\n<br><br>\ne. perform and develop functional assays that determine the biological function of antibodies.;\n<br><br>\nf. perform research on cellular immune responses using standard techniques such as ELISPOT, Multiplex based assays, Flow-Cytometry and shall perform aseptic tissue culture;\n<br><br>\ng. prepare standards and solutions as tasked;\n<br><br>\nh. maintain an accurate log of reagents, laboratory supplies and equipment;\n<br><br>\ni. perform general laboratory administrative duties;\n<br><br>\nj. perform standard animal handling techniques (rodents and nonhuman primates) as required;\n<br><br>\nk. prepare oral and poster presentations for presenting at approved conference;\n<br><br>\nl. give oral presentations at laboratory meetings;\n<br><br>\nm. provide assistance with preparation of progress reports/technical reports and standard operating procedures;\n<br><br>\nn. perform work closely with other Government, Military and Contractor personnel to develop, and gain approval of human and animal use protocols asare required for the performance of this task;\n<br><br>\no. perform laboratory tasks according to established Standard Operating Procedures (SOP's);\n<br><br>\np. establish Standard Operating Procedures (SOP's) for assays;\n<br><br>\nq. maintain and update laboratory notebooks and computer electronic files with detailed experimental plans, data and data analysis;\n<br><br>\nr. maintain a clean and safe laboratory;\n<br><br>\ns. maintain and operate Government owned equipment (ELISA plate washers and readers, Malverns Nanosight and DLS instruments, BIAcore affinity measurement equipment (such as the Attana), flow cytometers, cell counters, cell sorters, array readers, microfluidizers, fermentors, centrifuges, imaging systems, microscopes);\n<br><br>\nt. maintain a safe workplace ensuring that he/she is aware of and observes appropriate safety and occupational health rules and regulations;\n<br><br>\nu. attend institutional safety training and report any infractions of safety procedures to the facility Safety Officer; and\n<br><br>\nv. maintain an appropriate, professional demeanor at all times and be able to work as a team member.\n<br><br>\nIt may be necessary for the employee to travel off site to perform experiments. These locations are to be determined. Functions shall include: assist with immunizations and challenges; discussion of study with off-site scientists; training of off-site investigators on specimen collection and processing, performing challenges; learning techniques at offsite laboratories; and/or retrieval of specimens and documents.\n<br><br>\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>4-year degree in a science curriculum related to the assigned discipline</li>\n<li>3-5 years of related work experience</li>\n<li>Working knowledge of software packages typically associated with the discipline is required.</li>\n<li>A familiarity with environmental rules and regulations is preferred.</li>\n</ul>\n\nReady for action? We're looking for the kind of people who see this opportunity and don't hesitate to act. Parsons is a leader in the world of Engineering. We hire people with a broad set of technical skills who have proven experience tackling some of the greatest challenges. Take your next step and apply today.\n<br><br>\nParsons Referral Plan\n<br><br>\nMaybe this opportunity isn't the right fit for you, but you know someone who is? Why not join our Parsons external referral program? When you refer other top professionals and they are hired, you are rewarded with an incredible financial incentive. Help us find top talent!"}