{"job title": "RESEARCH SCIENTIST", "company": "University of Washington", "city state": "– Seattle, Washington", "rating": "4.1", "job description": "Posting Date: 08/31/2018 Closing Info: Open Until Filled Salary: Salary and benefits are competitive. Salary is commensurate with qualifications and experience. Limited Recruitment: <b> Open to UW Employees only </b> <br> If you are a UW employee and would like to be considered for this position, please to apply. Shift: First Shift Notes: As a UW employee, you will enjoy generous benefits and work/life programs. For a complete description of our benefits for this position, please visit our website, <br> <br> <b> First consideration will be given to those who apply by September 7, 2018</b> As a UW employee, you have a unique opportunity to change lives on our campuses, in our state and around the world. UW employees offer their boundless energy, creative problem solving skills and dedication to build stronger minds and a healthier world. <br> <br> UW faculty and staff also enjoy outstanding benefits, professional growth opportunities and unique resources in an environment noted for diversity, intellectual excitement, artistic pursuits and natural beauty. All of which has allowed the UW to be nationally recognized as a Great College to Work For for five consecutive years. <br> <br> <b> The Department of Psychology has an outstanding opportunity for a Research Scientist 4. </b> In this position, you will work with Dr. Stephanie Fryberg, her research coordinator, and members of her lab on new and existing projects focused on creating cultural change within educational systems. These projects involve experimental and quasi-experimental methods used to explore innovative ways to create top-down cultural change within educational contexts by shifting the way teachers and administrators understand and respond to diverse students. Your primary job duties will include:<br> <br> General Project Management Activities<br> <br> •overseeing ongoing grant activities (e.g., data collection, data analysis, summary and dissemination of findings)<br> •reporting project progress and findings to funders<br> •communicating with educators, administrators, and school district leaders participating in ongoing research<br> •writing grants to secure additional funding<br> <br> Advancing Existing Research and Developing New Research<br> <br> •planning, running, and summarizing complex statistical analyses to examine multifactorial, multi-level influences on diverse intervention outcomes<br> •developing and testing empirically-derived curricula for training educators to create culturally inclusive, growth minded learning environments<br> •scaling up interventions developed in Dr. Frybergs lab for online dissemination<br> •designing new lab and field studies<br> <br> Communicating with Diverse Lay and Scientific Audiences<br> <br> •identifying and building relationships with leaders in schools and districts interested in participating in future research<br> •visiting research sites (i.e., schools, district offices) as a representative of the research team to collect data, lead professional development workshops, and present research findings to lay audiences<br> •presenting findings at meetings of professional organizations<br> •pitching research to potential funders<br> <br> Mentoring and Supervising Junior Scholars<br> <br> •collaborating with senior lab members (e.g., post-docs and advanced graduate students)<br> •mentoring graduate students<br> •overseeing and mentoring research coordinator<br> •attending weekly lab meetings<br> <br> <b> Requirements :</b> <br> <br> •PhD in social or cultural psychology or related field<br> •1-2 years of related experience post-graduate school<br> •Demonstrated success obtaining funding for large-scale research projects<br> •Experience with lab, online, and field studies<br> •Experience collecting data from teachers, students (K-12), and parents<br> •Experience with diverse research methodologies<br> •Experience working as part of an interdisciplinary team<br> •Advanced statistical skills<br> •Knowledge of multiple statistical analysis programs (e.g., SPSS, R, HLM, MPlus)<br> •Strong communication and leadership skills<br> <p> Equivalent education/experience will substitute for all minimum qualifications except when there are legal requirements, such as a license/certification/registration.<br> <br> <b> Desired:</b> <br> <br> Experience building and maintaining relationships with research partners inside and outside of academia<br> <br> Experience with research in educational settings<br> <br> Experience working with diverse research subjects (e.g., college students, adults, children, professionals)<br> <br> Experience working with interdisciplinary research partners<br> <br> <b> Application Process:</b> <br> The application process for UW positions may include completion of a variety of online assessments to obtain additional information that will be used in the evaluation process. These assessments may include Work Authorization, Cover Letter and/or others. Any assessments that you need to complete will appear on your screen as soon as you select Apply to this position. Once you begin an assessment, it must be completed at that time; if you do not complete the assessment you will be prompted to do so the next time you access your My Jobs page. If you select to take it later, it will appear on your \"My Jobs\" page to take when you are ready. <b> Please note that your application will not be reviewed, and you will not be considered for this position until all required assessments have been completed.</b> </p> <p> The University of Washington is a leader in , and committed to becoming climate neutral. </p>"}