{"job title": "Assistant Scientist", "company": "University of Florida", "city state": "– Gainesville, FL", "rating": "4.2", "job description": "<strong>Classification Title:</strong>\n<br><br>\n<strong>AST SCTST</strong>\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nThe Department of Physiological Sciences is seeking an Assistant Scientist to participate in an NIH-funded preclinical study on the pathophysiology of osteonecrosis of the jaw. Major duties include animal surgeries, planning and implementing treatment protocols, collection of bone histomorphometric data by computer-assisted quantitative microscopy, statistical analyses, and data interpretation with publication of results. The individual will be responsible for laboratory animal work and animal procedures including anesthesia, surgeries, necropsies and collection of tissues. Processing decalcified and undecalcified jaws and bone samples and other tissues using histology techniques including fixation, embedding, staining and immunohistochemistry will also be expected.\n<br><br>\nThe individual will also be responsible for collecting and measuring data obtained from various sources including computer based data acquisition software. Training students and other relevant personnel in laboratory procedures, additional experimental protocols and data analysis, and the personnel management and supervision of OPS staff will also be expected. Molecular biology will also be performed to determine the effects of novel osteoporosis therapies on gene expression in bone.\n<br><br>\nThe candidate is expected to apply for federal-funded research awards, to participate in future federal-funded research, and to develop his/her own research projects.\n<br><br>\n<strong>Advertised Salary:</strong>\n<br><br>\n$48,000 - $54,000 Annually\n<br><br>\n<strong>Minimum Requirements:</strong>\n<br><br>\nA Ph.D. degree or equivalent is required. Bone and dental research as well as molecular biology experiences are required. Such experience may consist of bone and dental histomorphometry in animal models for bone and dental disorders, and molecular biology in dental/bone cells.\n<br><br>\n<strong>Preferred Qualifications:</strong>\n<br><br>\nA publication record in bone/dental research is highly desirable. The position requires an individual who will contribute positively to the lab environment and is capable of taking direction and following it. Must be open to constructive feedback and able to carry out research independently.\n<br><br>\n<strong>Special Instructions to Applicants:</strong>\n<br><br>\nAll applicants must apply for requisition number 507985 online through Careers at UF in order to be considered for the position. For full consideration, applicants must submit the following items as a PDF file: (1) a letter outlining your research experiences as well as your professional goals, (2) a current curriculum vitae, and (3) three professional references who are able to speak to all aspects of your abilities as they relate to the responsibilities of this position.\n<br><br>\nFinal candidate will be required to provide official transcript to the hiring department upon hire. A transcript will not be considered \"official\" if a designation of \"Issued to Student\" is visible. Degrees earned from an education institution outside of the United States are required to be evaluated by a professional credentialing service provider approved by National Association of Credential Evaluation Services (NACES), which can be found at http://www.naces.org/.\n<br><br>\nThe University of Florida is an equal opportunity institution dedicated to building a broadly diverse and inclusive faculty and staff. If an accommodation due to a disability is needed to apply for this position, please call 352/392-2477 or the Florida Relay System at 800/955-8771 (TDD). Hiring is contingent upon eligibility to work in the US. Searches are conducted in accordance with Florida's Sunshine Law.\n<br><br>\nApplication must be submitted by 11:55 p.m. (ET) of the posting end date.\n<br><br>\nHealth Assessment Required:Yes"}