{"job title": "Data Engineer", "company": "VanderHouwen", "city state": "– Beaverton, Oregon", "rating": "4.1", "job description": "<div>Job ID: 36578</div>\n\n<br><strong>***Not able to use 3rd Party Agencies***\n<br><br>\nData Engineer</strong>\n<br><br>\nOur client is seeking a Data Engineer to join their team in Beaverton, OR. We are looking for a senior engineer with cloud infrastructure experience to join our Big Data Platform Operations team. We provide cloud infrastructure to over 500 internal engineering and technical business users (Data Scientists and Analysts).\n<br><br>\n<strong>Data Engineer Responsibilities</strong>\n<br><br>\nSupport Data scientist with Cloud based captivations\n<br><br>\nSupport data finders within the data movement\n<br><br>\nServe as a leader in supporting and operating key aspects of our infrastructure services.\n<br><br>\nImprove our infrastructure by developing and improving automation tools.\n<br><br>\nProvide advanced engineering support services to end users:\n<br><br>\nGather technical details.\n<br><br>\nProvide status updates to users and stakeholders.\n<br><br>\nTrack all details in the issue tracking system (JIRA).\n<br><br>\nProvide issue review and triage problems for new service/support requests.\n<br><br>\nAgile environment – Will interact with stake holders\n<br><br>\n<strong>Data Engineer Qualifications</strong>\n<br><br>\nMS/BS in Computer Science or related field.\n<br><br>\n2-3 years of AWS and Python\n<br><br>\nHadoop: Experience with Hadoop (Hive, Spark, Sqoop)\n<br><br>\nETL: Job scheduler experience like Oozie or Airflow. Nice to have Airflow experience.\n<br><br>\nSecurity: Experience implementing role-based security, including AD integration, security policies, and auditing in a Linux/Hadoop/AWS environment.\n<br><br>\nELK stack: Experience with setting up ELK stack for Analytics.\n<br><br>\nResearch and deploy new tools and frameworks to build a sustainable big data platform.\n<br><br>\n<strong>Benefits</strong>\n<br><br>\nBenefits are available to eligible VanderHouwen contractors and include coverage for medical, dental, vision, life insurance, short and long term disability, and matching 401k.\n<br><br>\n<strong>About VanderHouwen</strong> \n<br><br>\nVanderHouwen is an award-winning, Women-Owned, WBENC certified professional staffing firm. Founded in 1987, VanderHouwen has been successfully placing experienced professionals throughout the Pacific Northwest and nationwide. Our recruitment teams are highly specialized in either Technology and IT, Engineering, or Accounting and Finance career markets. Our recruiters value building meaningful, professional relationships with each candidate as well as developing honed knowledge of companies' staffing needs and workplaces. Partner with us to land your next exciting career.\n<br><br>\n#vhdi"}