{"job title": "Scientist", "company": "WuXi AppTec", "city state": "– Philadelphia, PA", "rating": "2.6", "job description": "Overview\n<br><br>\nIndependent scientist who demonstrates innovative technical knowledge and significantly contributes to the overall operations of the lab. Demonstrates strong oral and written communication skills and actively contributes to training, report generation and documentation. Demonstrates strong supervisory skills and contributes to the achievement of company and departmental goals and objectives. Performs and directs assays according to and in compliance with current Good Manufacturing Practice (cGMP), Code of Federal Regulations (CFR) and/or Points to Consider (PTC) guidelines and Standard Operating Procedures (SOPs).\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Conducts and directs assays and lab procedures according to and in compliance with cGMP, CFR and/or PTC guidelines and SOPs.</li>\n<li>Accurately completes batch records and other required documentation according to and in compliance with cGMP, CFR and/or PTC guidelines and SOPs.</li>\n<li>Demonstrates innovative and independent scientific technical expertise.</li>\n<li>Works with Lab Supervisor in scheduling and coordinating day-to-day laboratory operations.</li>\n<li>Contributes independently to overall scientific rigor through objective laboratory investigation.</li>\n<li>As assigned by Management, supervises personnel and assumes all associated responsibilities.</li>\n<li>As assigned by Management, acts as Technical Reviewer, Area Manager, or Principal Investigator for assays and assumes all associated responsibilities.</li>\n<li>Demonstrates proficiency in scientific theory and rigorous practical application in the completion of lab procedures.</li>\n<li>Designs and independently conducts scientific development projects from inception to completion.</li>\n<li>Conducts critical review of results and reports data to Technical Reviewer, Area Manager or Principal Investigator.</li>\n<li>Initiates, prepares and revises technical documents and reports.</li>\n<li>Effectively communicates and defends science through written and verbal communication.</li>\n<li>Maintains laboratory notebook and follows all general and laboratory SOPs.</li>\n<li>Performs assays using appropriate laboratory techniques for lab group assigned to.</li>\n<li>Reports observations of ongoing tests to Technical Reviewer, Area Manager or Principal Investigator.</li>\n<li>Communicates with supervisor and other colleagues re: daily lab activities.</li>\n<li>Reviews and signs lab notebooks.</li>\n<li>Provides training on areas of technical expertise and compliance issues relevant to the lab setting and trains new personnel in lab procedures.</li>\n<li>Effectively interacts with clients as required.</li>\n<li>Documents test article information on temperature charts for monitored equipment and gives copy to Quality Assurance as needed.</li>\n<li>Completes all requisite training (i.e. Bloodborne Pathogen, Quality Assurance, safety, etc.).</li>\n<li>Ability to work in a team environment and independently as required</li>\n<li>May be required to work Holidays and weekends</li>\n<li>Contributes to the overall operations and to the achievement of departmental goals</li>\n<li>Perform job specific tasks in compliance with applicable Regulations, International Standards, and WuXi AppTec Policies and Standard Operating Procedures.</li>\n<li>Thorough understanding of Good Manufacturing Practices</li>\n<li>Other duties as assigned</li>\n<li>May be required to assist in other departments</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\nExperience / Education\n\n\n<ul>\n<li>A minimum of 5 years of relevant experience or equivalent with a Master's degree with a major in Biological Sciences or science related major or equivalent training and/or experience; or a minimum of 7 years of relevant experience or equivalent with a Bachelor's degree with commensurate experience.</li>\n</ul>\n\n<strong>Knowledge / Skills / Abilities:</strong>\n\n\n<ul>\n<li>Ability to explain unexpected results and find solutions to solve the technical issues</li>\n<li>Specialized training in laboratory techniques used in assigned laboratory is required.</li>\n<li>Knowledge of cGMP guidelines is preferred.</li>\n<li>Ability to use judgment as dictated by complexity of situation.</li>\n<li>Ability to work under limited supervision and to handle problems of a more difficult nature.</li>\n<li>Ability to accomplish the described duties through the use of appropriate laboratory equipment (i.e. biohazard hood, centrifuge, incubator, and autoclave) and computer equipment and software. (i.e. Microsoft Word, Outlook).</li>\n<li>Ability to accurately and reproducibly perform arithmetic calculations including fractions, decimals and percentages and basic algebraic and geometric calculations.</li>\n<li>Clarity of vision at near and mid-ranges (less than 20 feet), depth perception and ability to identify and distinguish colors</li>\n<li>Proficient in Verbal&amp;Written communication skills</li>\n<li>Need to be able to read, write and understand English</li>\n<li>Proficient in Microsoft (Excel, Word, Outlook)</li>\n<li>No travel is required</li>\n</ul>\n\nEqual Opportunity Employer Minorities/Women/Veterans/Disabled"}