{"job title": "Data Scientist Ld", "company": "Alion Science &amp; Technology", "city state": "– San Diego, CA", "rating": "3.4", "job description": "<strong>Responsibilities/Qualification</strong>\n<br><br>\n<strong>Position Summary</strong>\n<br><br>\nThe Lead Data Scientist designs, develops and programs methods, processes, and systems to consolidate and analyze unstructured, diverse \"Big Data\" sources to generate actionable insights and solutions for client services and product enhancement. Plans and performs the determination of which methods are appropriate in order to creatively explore, mine, analyze, and manipulate extremely massive data sets. Develops and analyzes modeling and measuring techniques using inquisitive creativity along with mathematics, \"machine learning\", statistical, and engineering methods to discover many possible solutions to a given problem.\n<br><br>\n<strong>Duties and Responsibilities</strong>\n<br><br>\nApplies advanced principles, theories, and concepts to job assignments, and contributes to the development of new ideas and principles. Solves uniquely complex problems, working under consultative direction.\n<br><br>\nFrequently interfaces with internal/external customers and makes significant contributions to department goals and planning efforts.\n<br><br>\nInterfaces directly with internal/external customers and works on long-range programs and objectives.\n<br><br>\nDevelops and codes software programs, algorithms and automated processes to cleanse, integrate and evaluate large datasets from multiple disparate sources.\n<br><br>\nDesigns and implements processes and solutions associated with a wide variety of data sets used for data/text mining, analysis, modeling, and predicting to enable informed business decisions.\n<br><br>\nWork with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business solutions.\n<br><br>\nImplement new statistical or other mathematical methodologies as needed for specific models or analysis.\n<br><br>\nLeads in creating various Machine Learning-based tools or processes within the company.\n<br><br>\nDetermine new ways to improve data and search quality, and predictive capabilities.\n<br><br>\nExcels at extracting the meaning from and interpret data, which requires both tools and methods from statistics and machine learning.\n<br><br>\nDevelop data models and algorithms to apply to data sets.\n<br><br>\nCoordinate with different functional teams to implement models and monitor outcomes.\n<br><br>\nProduces written deliverables to include reports, spreadsheets, databases, formal process mapping, technical design, system testing and implementation activities explaining their findings and recommendations for managers, executives and other officials.\n<br><br>\nKeep up-to-date with latest technology trends.\n<br><br>\nProvides guidance/leadership to less experienced Data Scientists.\n<br><br>\n<strong>Education and Experience</strong>\n<br><br>\nBachelor’s degree in Computer Science, Math, Statistics, Management Information Systems, Engineering or related field plus 8 to 10 years of experience or Master’s degree preferred.\n<br><br>\nIn some cases, educational requirements may be adjusted or waived for comparable work experience. Work experience may be adjusted for highly specialized knowledge or uniquely applicable experience for positions involving new technology or labor market shortages as reflected by\n<br>\nmarket survey data.\n<br><br>\n<strong>Knowledge, Skills, Abilities</strong>\n<br><br>\nExtensive background in Statistics, Machine Learning, Data Intuition, Data Visualization and Communication.\n<br><br>\nKnowledge of a variety of machine learning techniques and their real-world advantages/drawbacks.\n<br><br>\nKnowledge of advanced statistical techniques and concepts and experience with applications.\n<br><br>\nExcellent written and verbal communication skills for coordinating across teams.\n<br><br>\nMust be able to attain a Secret Clearance upon employment.\n<br><br>\n<strong>Diversity Statement</strong>\n<br><br>\nWomen, minorities, individuals with disabilities and veterans are encouraged to apply. Alion will provide a reasonable accommodation to individuals with disabilities and disabled veterans who need assistance to apply. Please visit the Alion Careers site for more information\n<br><br>\nU.S. Citizenship Required."}