{"job title": "Weather Data Scientist", "company": "BASF", "city state": "– Bellefonte, PA", "rating": "3.8", "job description": "At BASF , we create chemistry through the power of connected minds. By balancing economic success with environmental protection and social responsibility, we are building a more sustainable future through chemistry. As the world?s leading chemical company, we help our customers in nearly every industry meet the current and future needs of society through science and innovation. We achieve this through our commitment to continuous improvement and operational excellence, which gives us the opportunity to set and deliver on ambitious, long-term goals.\n<br><br>\nWe provide a challenging and rewarding work environment with a strong emphasis on process safety, as well as the safety of our employees and the communities we operate in, and are always working to form the best team?especially from within, through an emphasis on lifelong learning and development. This allows for our employees to innovate and generate new ideas, put them into action, and gain insights from them to further advance our collective expertise.\n<br><br>\nAnd we are constantly striving to become an even better place to work. BASF has been recognized by Forbes Magazine as one of America?s Best Employers in 2017. We strongly support the spirit of collaboration through effectively involving team members and colleagues from other relevant units when developing and executing strategies and projects. Come join us on our journey to create solutions for a sustainable future!\n<br><br>\n_Where the Chemistry Happens?_\n<br><br>\nWe are currently seeking a Weather Modeling and Data Scientist to join our team. The selected individual will use and apply spatio-temporal statistics, machine learning, mechanistic modeling and other approaches to continuously improve our weather and agricultural models. The Weather Modeling and Data Scientist serves as an expert on physical models, and their output data, for use in agricultural applications. He or she will interface with the company?s weather analytics and agricultural modeling teams. Position seniority and compensation will depend on the level of a candidate?s expertise and experience. The position will require occasional short-term travels in the United States and internationally.\n<br><br>\nAbout ZedX\n<br><br>\nZedX Inc., now part of BASF group, has been a leader in the development of information technology (IT) products and services for the agriculture sector since 1987. ZedX is known for its innovation and custom solutions for growers, consultants, universities, government and industry. It is globally recognized for its integration of weather, plant, pest, and management models in support of agricultural decisions. ZedX has stayed true to its mission for thirty years to build advanced knowledge systems and IT tools to ensure abundant food and a healthy environment for a growing population, and to support the foundations of sustainability.\n<br><br>\nAbout BASF\n<br><br>\nAt BASF, we create chemistry for a sustainable future. We combine economic success with environmental protection and social responsibility. The approximately 114,000 employees in the BASF Group work on contributing to the success of our customers in nearly all sectors and almost every country in the world. Our portfolio is organized into five segments: Chemicals, Performance Products, Functional Materials &amp; Solutions, Agricultural Solutions and Oil &amp; Gas. BASF generated sales of about ?58 billion in 2016. BASF shares are traded on the stock exchanges in Frankfurt (BAS), London (BFA) and Zurich (BAS). Further information at www.basf.com.\n<br><br>\nZedX ? Weather Data Scientist (1803972) ? Bellefonte, PA\n<br><br>\n_Formula for Success: You Will?_\n<br><br>\n+ You will use your advanced degree (MS) in Atmospheric Science, Meteorology, Oceanography, Engineering or related physical sciences. BS degree with sufficient background and qualifications will be considered.\n<br><br>\n+ Use your 3 years of experience operating, evaluating, and/or developing physical numerical models for the atmosphere, ocean, or other disciplines\n<br><br>\n+ Use your 3 years of experience using advanced statistical analysis techniques to improve, compare, and validate output data from physical numerical models\n<br><br>\n+ Use your 3 years of using big data and cloud computing solutions to manipulate large spatial gridded data in the most efficient manner\n<br><br>\n+ Experience with regional and/or global numerical weather prediction models (WRF, HRRR, NAM, GFS, ECMWF, etc.) for research and/or operational applications\n<br><br>\n+ Fluent in at least one programing language appropriate to the needs of the weather department, e.g., C, C , Python, FORTRAN, Perl, or shell scripting\n<br><br>\n+ Strong working knowledge and experience using R, SAS, MATLAB, or similar packages for statistical analysis\n<br><br>\n+ Ability to write well-structured, easily maintainable, and well-documented code that executes very efficiently as part of overall data processing optimization\n<br><br>\n+ A drive to solve problems, meet deadlines, and build whatever is necessary along the way\n<br><br>\n+ Familiarity with observational and model data quality control, analysis, interpretation, integration, and visualization using various tools and methods\n<br><br>\n_For further information on Agricultural Products with BASF, please select:_\n<br><br>\nBASF: Create Chemistry with the Agricultural Products Division\n<br><br>\n_Create Your Own Chemistry: What We Offer You?_\n<br><br>\nAdding value to our customers begins with adding value to you. You@BASF is the suite of benefits, perks, programs and unique opportunities we offer to support you?the whole you?in all stages of your life and career. With you@BASF, you create your own chemistry.\n<br><br>\nThe total rewards that you receive as a BASF employee go way beyond a paycheck. From competitive health and insurance plans, to robust retirement benefits that include company-matching contributions, to making sure you never stop learning, we believe investing in you is investing in our success. Working for a large, global organization, you?ll have a chance to grow professionally and personally, expand your network and build a rewarding and dynamic career.\n<br><br>\nBASF provides interesting and challenging learning and development opportunities to help you make the most of your talents and your job.\n\n\n<ul>\n<li>*Job:** _REDE - Research &amp; Development_</li>\n<li>*Organization:** _N-APN-Crop Protection North America-60000060_</li>\n<li>*Title:** _Weather Data Scientist, Bellefonte, PA_</li>\n<li>*Location:** _PA-Bellefonte_</li>\n<li>*Requisition ID:** _1803972_</li>\n</ul>"}