{"job title": "Senior Data Scientist", "company": "BB&amp;T", "city state": "– Winston-Salem, NC US", "rating": "3.3", "job description": "Specific information related to the position is outlined below. To apply, click on the button above. You will be required to create an account (or sign in with an existing account). Your account will provide you access to your application information.<br><br>Should you have a disability and need assistance with the application process, please request a reasonable accommodation by emailing or by calling 866-362-6451. This email inbox is monitored for reasonable accommodation requests only. Any other correspondence will not receive a response.\n<br><br>\n<strong>Regular or Temporary:</strong><br><br>Regular<br><br><strong>Language Fluency:</strong> English (Required)\n<br><br>\n<strong>Work Shift:</strong><br><br>1st shift (United States of America)<br><br><strong>Please review the following job description:</strong>\n<br><br>\nYou will work as member of the larger Enterprise Data Office team to understand business goals, operations and objectives in order to leverage your knowledge and experience in developing sustainable approaches to achieving a broad spectrum of outcomes that improve business performance across the organization. To do this you will leverage raw data (structured and unstructured) to create and deploy analytic solutions that relate actions to outcomes and deliver forward guidance with the goal of improving customer experience and business performance. Critical thinking and problem-solving skills are essential as this role requires the ability to simultaneously draw upon high-level quantitative training, experience accessing and manipulating data and the use of effective data-driven problem solving.\n<br><br>\nYou should have deep experience with data analysis, modeling, visualization and/or experimental design. You should have an ability to communicate and work effectively among individuals with varying levels of technical experience. This role requires independent thought and self-direction. Successful individuals are highly results-oriented and demonstrate desire for growth and continuous learning.\n<br><br>\n<strong>Essential Duties:</strong>\n<br><br>\nCreatively achieve a broad spectrum of end results by leveraging skills across multiple disciplines of mathematics, computer science and business management. Direct business owners toward value-adding activities and initiatives. Recognize valuable patterns, trends and actionable insights in raw data. Develop custom tools to solve novel problems. Create deployable predictive models. Present and communicate complex findings in a readily interpretable fashion using appropriate visualization and communication techniques. Collaborate with cross-functional teams within the Enterprise Data Office.\n<ul>\n<li>Support the Enterprise Data Office in driving improved business performance across the organization</li><li>Partner with lines of business to understand goals and objectives and work with teams across the EDO in creating and deploying solutions that support these needs</li><li>Develop, deploy, analyze and validate performance of predictive models that enhance business performance</li><li>Distill and communicate data-driven insights and actionable recommendations</li><li>Consult on set-up of campaigns, marketing test design and performance measurement.</li><li>Evaluate effectiveness, impact and value of business actions with mathematical rigor</li><li>Institutionalize test-and-learn culture</li><li>Elevate analytics and data science practices within the EDO</li><li>Employ advanced statistical techniques to produce in-depth exploratory and predictive analyses</li><li>Champion new technologies to improve operational efficiencies and increase marketing return.</li><li>Grow and manage an analytic team as needed</li>\n</ul>\n<strong>Required Skills:</strong>\n<ul>\n<li>Undergraduate degree with post graduate studies in a quantitative area of focus is strongly desired</li><li>10 years' experience using large datasets and quantitative reasoning to drive business solutions</li><li>10 years of progressive team management in multiple areas of business</li><li>Experience successfully leading strategic and transformative initiatives</li><li>Ability to balance blue sky R&amp;D activities and POC development with sustainable improvements to current business activities</li><li>Fluency with SQL, R or a comparable programming language (such as Python, SAS, SPSS, or MATLAB) and distributed processing</li><li>Working knowledge of Hadoop, Pig, Hive, Netezza, NoSQL and MapReduce</li><li>Hands-on experience in model development, statistical methodologies and/or quantitative analysis</li><li>Advanced knowledge and experience applying machine learning, classification models, clustering, decision trees, time series regression, ensemble models and stochastic statistics to deliver improved business performance</li><li>Experience using A/B testing, lift modeling, multitouch attribution and marketing mix modeling</li><li>Experience using digital services such as Redshift, S3, Spark, AWS, Azure, Google Analytics, Adwords, Site Catalyst, Crimson Hexagon etc.</li><li>First-hand experience using customer, product, geographic, demographic, behavioral or quantitative data to identify trends and produce novel insights in a non-academic environment</li><li>Excellent communication (verbal and written), organizational, and interpersonal skills</li>\n</ul>\n<strong>BB&amp;T is an Equal Opportunity Employer and considers all qualified applicants regardless of race, gender, color, religion, national origin, age, sexual orientation, gender identity, disability, veteran status or other classification protected by law.</strong>\n<br><br>\nEEO is the Law Pay Transparency Nondiscrimination Provision"}