{"job title": "Cognitive and Digital Services Data Scientist", "company": "Credit Suisse", "city state": "– United States-NC-Raleigh", "rating": "3.6", "job description": "<p>IT GCTO End User Services in the Cognitive and Digital Services (CDS) offers an end-to-end service in the development and implementation of Amelia (AI virtual agent), Contact Center Modernization, data science, machine learning and advanced analytics out to the firm. This role sits within the ‘Cognitive Implementation’ organization that is comprised of highly skilled data scientists, neuroscientists, and natural language processing experts, machine learning engineers, computational linguist, integration and user experience experts. Within CDS the ‘Cognitive Implementation’ organization is building a cognitive analytics capability charged with delivering advanced data science, natural language understanding, and machine learning capabilities to deliver business intelligence and automation through MLaaS solutions.</p>\n<p> </p>\n<p><br>The role provided here will lead the Cognitive Analytics team comprised of machine learning engineers, computational linguists, data scientists, and business intelligence experts. This team is responsible for developing and implementing solutions in the below areas of focus:</p>\n<ul>\n<li>\n<div>NLP/NLU systems</div></li>\n<li>\n<div>Predictive analytics ML models</div></li>\n<li>\n<div>Intelligent Process Automation systems</div></li></ul>\n<p> </p>\n<p>The role will entail:</p>\n<ul>\n<li>\n<div>Overseeing NLU support and development for Amelia (The banks Cognitive Agent).</div></li>\n<li>\n<div>Building MLaaS solutions by using existing IT resources and investments.</div></li>\n<li>\n<div>Utilizing full potential of both as-a-service and custom ML applications.</div></li>\n<li>\n<div>Liaising with ‘Platform Technology’ engineers and developers to assure a stable and reliable service.</div></li>\n<li>\n<div>Assuming joint ownership of solutions/services in the spirit of DevOps.</div></li></ul>\n<p> </p>\n<p>Success in Cognitive Implementation entails:</p>\n<ul>\n<li>\n<div>Meeting a demanding Agile project schedules on time.</div></li>\n<li>\n<div>Enhancing the CDS reputation as a consultant for the Bank for topics including Artificial Intelligence, Automation, and Machine Learning.</div></li>\n<li>\n<div>Enjoying your work.</div></li></ul>\n<p> </p>\n<p>We offer:</p>\n<ul>\n<li>\n<div>You will have exposure to new technologies (AI/ML, MLaaS platforms, cognitive technologies).</div></li>\n<li>\n<div>You will have an exciting and challenging work.</div></li>\n<li>\n<div>You will be a fantastic team spirit and inspirational department head.</div></li></ul>\n<p> </p>\n<p>Credit Suisse maintains a Working Flexibility Policy, subject to the terms as set forth in the Credit Suisse United States Employment Handbook.</p>\n<p>We welcome candidates looking to work in a fast-paced exciting environment on the leading edge of IT technology and Artificial Intelligence in the financial industry. We can train on the specific technologies, but look to the candidate to bring:</p>\n<p> </p>\n<p><br>Required:</p>\n<ul>\n<li>\n<div>Leadership – you have the ability to be an effective communicator and inspire.</div></li>\n<li>\n<div>Ownership and Accountability – you have readiness to pick up and own tasks and be responsible for the future outcome.</div></li>\n<li>\n<div>Innovation – you do have an eye for innovation and the vision to execute on it.</div></li>\n<li>\n<div>Genuine Enthusiasm – you have a love of and pride in your work.</div></li>\n<li>\n<div>Collaboration – you have a collaborative approach to leadership. </div></li></ul>\n<p> </p>\n<p>You should also possess the following industry experience or knowledge: </p>\n<ul>\n<li>\n<div>Do you have experience leading advanced technology teams?</div></li>\n<li>\n<div>Are you knowledgeable and experienced with machine learning, NLP/NLU, and MLaaS systems?</div></li>\n<li>\n<div>Do you understand data analytics, statistics, and data visualizations?</div></li>\n<li>\n<div>Do you have an advanced degree or equivalent experience?</div></li></ul>\n<p> </p>\n<p>For more information visit Technology Careers.</p>"}