{"job title": "Systems Engineer Data Scientist", "company": "DRS Technologies, Inc.", "city state": "– Dallas, TX", "rating": "3.6", "job description": "<ul>\n<li>LEONARDO DRS*</li>\n</ul>\n\nLEONARDO DRS is a leading supplier of integrated products, services and support to military forces, intelligence agencies and prime contractors worldwide. Focused on defense technology, we develop, manufacture and support a broad range of systems for mission critical and military sustainment requirements, as well as homeland security.\n<br><br>\nHeadquartered in Washington, DC, the Company is a wholly owned subsidiary of Leonardo, which employs more than 70,000 people worldwide. We offer a competitive compensation package and a business culture that rewards performance. For additional information on DRS, please visit our website at www.leonardodrs.com.\n\n\n<ul>\n<li>Company Overview*</li>\n</ul>\n\nLEONARDO DRS Electro Optical Infrared Systems (EOIS) has locations in Dallas, TX, Melbourne, FL, and Cypress, CA. We develop, manufacture, and support infrared and electro-optical solutions for soldiers, ground vehicles and airborne platforms. We offer an exciting and challenging work environment, a competitive salary and benefits package, and a business culture that rewards performance.\n<br><br>\nEmploying the world?s brightest. Supporting the world?s bravest.\n\n\n<ul>\n<li>Location*</li>\n</ul>\n\nDallas, TX\n\n\n<ul>\n<li>Position Summary*</li>\n</ul>\n\nAs a Systems Engineering Data Scientist, Analist and Algorthm Developer at DRS, you will be responsible for analyzing and improving all aspects of the functional performance of complex aircraft survivability systems. You will analyze very large data sets including IR video files from flight tests, counter measure responses to threats and simulations of flights and threats. You will be responsible for evaluating the effectivity of current systems and designing improvements to system performance as well as increasing the simultation capacities for evaluating the effectiveness of possible enhancements. This will require developing an expertise in threat operations and performance.\n<br><br>\nYou will work with all aspects of the system including defining requirements, giving input into and reviewing hardware and software designs and authoring and conducting tests to demonstrate system performance. You will provide technical leadership in root causing problems and implementing corrective actions. You will also work with key partners in developing responses to new threats to aircraft survivability.\n\n\n<ul>\n<li>Basic Qualifications and Required Skills*</li>\n<li>Bachelor?s Degree or higher in engineering or related technical field</li>\n<li>5+ years of experience analyizing data sets and solving technical problems; an advanced degree can be counted toward years of experience</li>\n<li>Experience developing models useful in analyzing large data sets</li>\n<li>Experience using analysis to improve products and algorithms</li>\n<li>Ability to use evaluate the accuracy of simulations and apply correct judgement on their effectiveness</li>\n<li>Experience with programming and scripting languages and environments (C/C++, Python, MATLAB, Linux)</li>\n<li>Ability to plan activities and drive for results</li>\n<li>Working knowledge of Microsoft Office applications</li>\n<li>Strong written and oral communication skills</li>\n<li>Must currently possess or be able to obtain a security clearance</li>\n<li>Desired Skills*</li>\n<li>_ESSENTIAL DUTIES AND RESPONSIBILITIES_*</li>\n<li>Advanced degree in an engineering, physics or related field</li>\n<li>Experience working with government agencies or labs on development projects</li>\n<li>Understanding of IR technologies and applications</li>\n<li>Strong coding skills in developing models useful in simulation</li>\n<li>Knowledgeable in debugging techniques for hardware and software</li>\n<li>Experience with failure analysis, root cause development, and validation of corrective actions</li>\n<li>Ability to work independently or in a dynamic team environment as conditions warrant</li>\n<li>Review customer documentation and requirements and develop modeling methodologies for predictive verification of system and subsystem performance</li>\n<li>Support the enhancement of simulations and algorithms</li>\n<li>Support the enhancement of overall system performance</li>\n<li>Develop and conduct verification plans to verify the accuracy of predictive models</li>\n<li>Perform overall planning of data analysis and performance improvements</li>\n<li>Provide technical consulting to product development teams</li>\n<li>Troubleshoot failures and support root cause determination and the development and validation of corrective actions</li>\n<li>Ability to work independently, with regular reporting of progress and status of the testing of systems and subsystems</li>\n<li>Responsible for technical activity and completion of assigned tasks on time and within budget</li>\n<li>Communicate clearly (written and oral) with other company personnel and the customer as required</li>\n<li>Participate in preparation of proposals as required</li>\n<li>Support, communicate, reinforce and defend the mission, values and culture of the organization</li>\n<li>Attend appropriate engineering, customer or business meetings</li>\n<li>Execute other duties as assigned</li>\n<li>Duties and Responsibilities*</li>\n<li>Review customer specifications and requirements and develop test methodologies for validation/verification of system and subsystem performance.</li>\n<li>Support the integration of hardware and software systems and subsystems in the lab and potentially on aircraft.</li>\n<li>Develop and conduct testing plans and procedures based on system requirements.</li>\n<li>Support testing of products, systems or subsystems; analyze test data and results; and document test results in formal test reports.</li>\n<li>Troubleshoot test failures and support root cause determination and the development and validation of corrective actions.</li>\n<li>Use computer-aided engineering or other design/analysis software in the performance of assignments.</li>\n<li>Ability to work independently, with regular reporting of progress and status of the testing of systems and sub systems.</li>\n<li>Responsible for technical activity and completion of assigned tasks on time and within budget.</li>\n<li>Communicate clearly (written and oral) with other company personnel and the customer as required.</li>\n<li>Participate in preparation of less complex proposals.</li>\n<li>Support, communicate, reinforce and defend the mission, values and culture of the organization.</li>\n<li>Attend appropriate engineering, customer or business meetings.</li>\n<li>Other duties as assigned.</li>\n<li>Physical Conditions*</li>\n<li>Ability to work in long periods at a computer</li>\n<li>Working Conditions*</li>\n<li>Travel up to 25%</li>\n</ul>\n\nOnly candidates that meet the qualifications as outlined above will be contacted for further information.\n<br><br>\nApplicants selected for this position will be subject to a government security investigation and must meet eligibility requirements for access to classified information. *Only US citizens are eligible for a Security Clearance.*\n<br><br>\nLEONARDO DRS is an equal opportunity/affirmative action employer. We consider applicants without regard to race, color, religion, creed, gender, national origin, age, disability, genetic information, marital or veteran status, or any other category protected by federal, state or local law. #EOIS"}