{"job title": "Supply Chain Data Scientist", "company": "Ford Motor Company", "city state": "– Dearborn, MI", "rating": "3.9", "job description": "**31252BR**<br> <br>**Job Title:**<br> <br><br> <br>Supply Chain Data Scientist<br> <br><br> <br>**Job Description &amp; Qualifications:**<br> <br><br> <br>**Job description:**<br> <br>(Supply Chain Data Scientist) positions offered by Ford Motor Company (Dearborn, MI). As part of Ford Motor Company's Global Data, Insight, and Analytics (GDIA) organization, collaborate with partners in product development, purchasing, warranty, material planning and logistics to define problems, identify data, establish predictive and prescriptive models, and deliver optimal solutions. Support the development and delivery of analytic models, and acquire deep understanding of business problems and translate them into appropriate mathematical representations. Encode mathematical abstractions into prototype computer programs or models. Ensure overall quality of the data and solutions throughout the analytic development process. Interpret results and communicate them to technical and non-technical audiences, cross-functional teams and executive leadership.<br> <br><br> <br>**Minimum Requirements:**<br> <br><br> <br>+ Requires a PhD or foreign equivalent degree in mechanical engineering, industrial engineering, operations research, statistics or related quantitative field<br> <br>+ 2 years of experience in the position offered or 2 years of experience using mathematical programming, optimization techniques, data mining, or statistical analysis<br> <br>+ 2 years of experience using analytic languages and frameworks, including Python, MATLAB, SAS, R, CPLEX or Java<br> <br>+ 1 year of experience using database query and management tools, including SQL and Alteryx<br> <br><br> <br>The distance between imagination and ?. Creation. It can be measured in years of innovation, or in moments of brilliance. And, it can be a road you start traveling right now. When you join Ford Motor Company, your journey begins. You become part of a team that is already leading the way, with ingenious solutions and attainable products ? and it is always ready to go further.<br> <br><br> <br>At Ford Motor Company, the distance between you and an amazing career has never been shorter. Join the Ford team today, and discover the benefits, rewards and development opportunities you?d expect from a diverse global leader.<br> <br><br> <br>Ford Motor Company is an equal opportunity employer committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, disability status or protected veteran status. Ford Motor Company also is committed to take affirmative action to employ and advance in employment such persons.<br> <br><br> <br>**Auto req ID:**<br> <br><br> <br>31252BR<br> <br><br> <br>**Company:**<br> <br><br> <br>Ford Motor Company<br> <br><br> <br>**Function:**<br> <br><br> <br>GDIA<br> <br><br> <br>**Skill Team:**<br> <br><br> <br>GDI&amp;A<br> <br><br> <br>**Sub-Component:**<br> <br><br> <br>Manufacturing &amp; Supply Chain Analytics<br> <br><br> <br>**State:**<br> <br><br> <br>Michigan<br> <br><br> <br>**Location:**<br> <br><br> <br>Dearborn"}