{"job title": "Senior Data Scientist AeroSpace", "company": "Honeywell", "city state": "– USA-Phoenix", "rating": "3.3", "job description": "Senior Data Scientist AeroSpace<br><br>Driving Infinite Possibilities Within A Diversified, Global Organization\n<br><br>\nHoneywell Aerospace products, services and digital environments collect millions of events per day and as a data driven company believe our data has great stories to tell us. As such, we are investing heavily in our data science capabilities and establishing a Data Science &amp; Analytics team, chartered to build our predictive analytics capabilities for condition monitoring, predictive aircraft maintenance, optimize product performance &amp; build recommendation systems for end customers. The system will ingest machine data from various aircraft systems, maintenance and other operations data including unstructured data, use machine learning and advanced analytics techniques to identify and predict failure patterns and provide recommendations to end customers to avoid unplanned maintenance.\n<br><br>\nWork on all stages of data science projects from understanding data to implementing the solutions into products and service offerings\n<br><br>\nLead projects both as a principal investigator and project manager, responsible for meeting project requirements on schedule and on budget\n<br><br>\nDrive the interaction with Honeywell internal business partners to define, design, and develop solutions to customer problems using data insights derived from quick prototyping of multiple ideas\n<br><br>\n<strong>You Must Have</strong>\n<ul>\n<li>Master’s degree in computer science, applied mathematics, statistics, software engineering, physics, or related discipline in marketing and analytics</li><li>3+ years of data science work experience, including a demonstrated high-level of proficiency in applying data techniques to solving customer problems</li><li>3+ years of experience in machine learning, predictive analytics, and statistical modeling</li><li>3+ years of experience in programming and scripting languages</li><li>2+ years of experience in data visualization (e.g. Tableau, Qlik, Ploty)</li>\n</ul>\n<strong>We Value</strong>\n<ul>\n<li>Experience working with large datasets using Hadoop framework and tools</li><li>Ability to communicate and present complex quantitative analyses in clear and precise manner to leadership team</li><li>PhD in computer science, applied mathematics, statistics, software engineering, physics, or related discipline in marketing and analytics</li> <li>Experience with moving prototypes to production environment and optimizing models in production environment</li><li>Experience in condition monitoring and predictive failures</li><li>Aerospace knowledge or experience</li>\n</ul>\n\nDue to US export control laws, must be a US citizen, permanent resident or have protected status.\n<br><br>\nExempt\n<br><br>\nCreated with SnapUnderstand Bus Requirements, Define Analytics SolutionData ExplorationDevelop Advanced Analytics ModelsData VisualizationMentor, Provide Technical Direction to Data ScientistsINCLUDES\n\n\n<ul>\n\n <li>Some Travel Required</li>\n<li>Continued Professional Development</li>\n<li>Relocation Provided</li>\n</ul>\n\n<strong>ADDITIONAL INFORMATION</strong>\n\n<ul>\n<li><strong>Job ID:</strong> req153710</li> <li><strong>Category:</strong> Engineering</li> <li><strong>Location:</strong> 1944 E Sky Harbor Circle, Phoenix, AZ 85034 USA</li> \n</ul>\nHoneywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, or veteran status."}