{"job title": "Scientist", "company": "Illumina", "city state": "– San Diego, CA", "rating": "4.2", "job description": "Summary\n<br><br>\nWe are looking for a talented, experimentalist to become a member of the technical staff within the Nanofabrication Group within the Department of Research and Technology Development. Experimentalists with a proven track record in the areas of bio-sensor device fabrication and characterization, chemical patterning, fabrication of microfluidic devices, chemical analysis, surface metrology, single-molecule biophysics, electronic and optical biomolecule sensing, and surface functionalization will be considered. A strong background in metrology is required.\n<br><br>\nThis is an extremely exciting opportunity to contribute to future generations of Illumina’s products. The individual will be a key contributor to the development, characterization, and utilization of novel substrate formats, flowcells and sensors for future generations of Illumina’s sequencing platforms. This new team member will be responsible for contributing to the evolution of Illumina’s existing technologies as well as help pave the path for future platforms. He/She will be part of multidisciplinary teams, performing experiments aimed at answering basic scientific questions and solving complex problems with a primary focus on developing products that change lives and have profound commercial implications.\n<br><br>\nResponsibilities:\n<br>\nJob duties will include, but are not be limited to\n<br><br>\nConceive, design and develop innovative substrate formats and sensing technologies for highly parallel DNA sequencing.\n<br>\nDevice characterization with emphasis on extremely thorough analysis of surface properties and tests to ensure compatibility with illumina’s sequencing chemistries.\n<br>\nPhysical device characterization (for example, SEM, AFM, TEM, high resolution spectroscopy and microscopy) to understand the interface between the device and Illumina’s surface chemistry.\n<br>\nFabrication of nanoscale devices and features in university and in-house facilities as well as with external partners.\n<br>\nExtremely strong understanding of the fundamentals of electrodynamics, specifically within optics and nanophotonic devices.\n<br>\nServe as technical lead and primary technical point of contact with external partners.\n<br>\nContribute to ongoing projects in related disciplines in fast-paced multidisciplinary research and product development environments.\n<br>\nEngage in collaborative research, both internal and external.\n<br>\nMaintain detailed lab notebooks, prepare reports, invention disclosures, updates and summaries for managers and teams as directed.\n<br>\nEducation, Qualifications and Experience:\n<br><br>\nPh.D. in a science or engineering discipline (Physics, Physical Chemistry, nanoengineering, etc.) with a focus on fabrication and characterization of chemical sensors.\n<br>\nDeep understanding of nanofabrication, metrology, analysis of nucleic acids is a plus.\n<br>\nInterdisciplinary experience combining nanofabrication, surface chemistry and molecular biology to address biological problems highly desired.\n<br>\nStrong data analysis skills, ability to interpret and draw conclusions from limited to large amounts of data.\n<br>\nExcellent laboratory skills, meticulous design and execution of experiments for unstable and highly variable systems.\n<br>\nExperience with one or more of the following is beneficial but not required: nanofabrication; microfluidics; common wet lab protocols; nucleic acid chemistry; optics; fluorescence assays for biomolecule characterization, surface analysis, signal processing skills relevant to low-SNR data.\n<br>\nAnalytical, detail-oriented, organized, problem solver, self-starter, self-motivated, independent but can work well in a cross-functional team.\n<br>\nExcellent verbal and written communication skills.\n<br>\nAbility to multitask on projects with aggressive timelines.\n<br>\nStrong work ethic with flexible schedule, may be required to travel domestically and internationally from time to time"}