{"job title": "Data Scientist (Ft.", "company": "KBRwyle", "city state": "– Fort Bragg, NC", "rating": "3.0", "job description": "<ul>\n<li>*Data Scientist (Ft. Bragg, NC)**</li>\n<li>*Description**</li>\n</ul>\n\n<strong>POSITION IS CONTIGENT UPON CONTRACT AWARD</strong>\n<br><br>\nThe data scientist shall be responsible for entering, cleaning, and conducting basic data manipulation and analysis. Operating in consultation with POTFF program staff and the Government?s POTFF biostatistician, the data scientist shall build and disseminate databases and spreadsheets designed to record POTFF related programmatic data. The contractor shall provide consultation and assistance to supported units and POTFF staff to identify opportunities and methods for capturing data relating to POTFF programs and initiatives. The contractor shall prepare reports and presentations that accurately convey data trends and associated analysis. The contractor will be granted access to Government systems to enter and analyze data.\n\n\n<ul>\n<li>*Qualifications**</li>\n</ul>\n\nRequires a Bachelor?s degree in quantitative science, social science or related discipline. The contractor shall be proficient with the suite of Microsoft Office programs, including Word, Excel and Access. The contractor shall have a basic proficiency with commonly used statistical software application (e.g. SPSS, SAS, and R). The contractor shall possess excellent communication skills and shall be highly detail oriented and organized. Proficiency may be demonstrated through work history or a history of publications or a combination thereof.\n<br><br>\nKBR is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, disability, sex, sexual orientation, gender identity or expression, age, national origin, veteran status, genetic information, union status and/or beliefs, or any other characteristic protected by federal, state, or local law.\n\n\n<ul>\n<li>*Job:** Engineering Operations</li>\n<li>*Primary Location:** US-US-NC-Ft Bragg</li>\n<li>*Req ID:** 1072150</li>\n</ul>"}