{"job title": "Principal Data&amp;Applied Scientist", "company": "Microsoft Corporation", "city state": "– Bellevue, WA", "rating": "4.1", "job description": "What if your job description were simply \"Make tomorrow better?\" That's the essence of roles within our Bing Team. Every day, we bring an insatiable curiosity to the table, challenging ourselves to reimagine what is and what can be. We build on what's come before to create what's next. We drive machine intelligence. We help shape the future. We empower billions of people around the globe. Online Advertising is one of the fastest growing businesses on the Internet today, with about $70 billion of a $600 billion advertising market already online. Search engines, web publishers, major ad networks, and ad exchanges are now serving billions of ad impressions per day and generating terabytes of user events data every day. The rapid growth of online advertising has created enormous opportunities as well as technical challenges that demand computational intelligence. Computational Advertising has emerged as a new interdisciplinary field that involves information retrieval, machine learning, data mining, statistics, operations research, and micro-economics, to solve challenging problems that arise in online advertising. The central problem of computational advertising is to select an optimized slate of eligible ads for a user to maximize a total utility function that captures the expected revenue, user experience and return on investment for advertisers.\n<br><br>\n<strong>Skills&amp;Qualifications:</strong>\n\n\n<ul>\n<li>Outstanding expertise and hands-on experience on machine learning, text analysis, data mining, and NLP</li>\n<li>8+ years experience in software development</li>\n<li>Knowledge of C#, C++, Java or Python</li>\n<li>MS/PhD degree in CS/EE or related areas is preferred</li>\n<li>Passionate, self-motivated</li>\n<li>Effective communication skills, both verbal and written</li>\n<li>Familiarity with distributed data processing/analysis and modeling paradigm, such as Map-Reduce and MPI is a plus</li>\n</ul>\n\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, sex, sexual orientation, gender identity or expression, religion, national origin or ancestry, age, disability, marital status, pregnancy, protected veteran status, protected genetic information, political affiliation, or any other characteristics protected by local laws, regulations, or ordinances.\n<br><br>\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n<br><br>\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.\n<br><br>\nMicrosoft is innovating rapidly in this space to grow its share of this market by providing the advertising industry with the state-of-the-art online advertising platform and service. Bing Ads Marketplace and Serving (MPS) team is at the core of this effort, responsible for research&amp;development of all the algorithmic componentsin our paid search advertising technology stack, including:\n\n\n<ul>\n<li>User/query intent understanding, document/ad understanding, user targeting</li>\n<li>Relevance modeling, IR-based ad retrieval</li>\n<li>User response (click&amp;conversion) prediction using large scale machine learning algorithms</li>\n<li>Marketplace mechanism design and optimization, and whole-page experience optimization</li>\n<li>Rich and innovative Ad products that add relevant and personalized information</li>\n<li>Network protection, fraud detection, traffic quality measurement</li>\n<li>Advertising metrics and measurement, including relevance and ad campaign effectiveness</li>\n<li>Data mining and analytics</li>\n<li>Supply-demand forecasting</li>\n<li>Ad campaign planning and optimization</li>\n<li>Experimentation infrastructure including tools for configuring and launching experiments, dashboard, live marketplace monitoring, and diagnosis.</li>\n</ul>\n\nWe heavily use the recent advances in grid or cloud computing infrastructure to harness huge volume of data for solving many of the above mentioned problems. We love big data! The MPS team is a world-class R&amp;D team of passionate and talented scientists and engineers who aspire to solve challenging problems and turn innovative ideas into high-quality products and services that can help hundreds of millions of users and advertisers, and directly impact our business. Our experimentation infrastructure allows us to innovate and test new algorithms rapidly with live traffic to measure their effectiveness, and launch them in production as soon as they produce positive results, which makes our work environment productive and rewarding. We are looking for an Applied Scientist or Machine Learning Scientist to incubate technologies from end to end to make product impact. The candidate will engage in high potential projects grounded in applications to improve our ad, query and web page understanding."}