{"job title": "Data Scientist - Genomic Prediction", "company": "Monsanto", "city state": "– Saint Louis, MO", "rating": "4.0", "job description": "We are seeking\n<br><br>\nexceptionally talented individual with a passion for innovation to lead a data\n<br><br>\nscience team in our Global Analytics Team within the Breeding Organization. The\n<br><br>\nglobal analytics team is a cutting edge group that analyzes big data to develop\n<br><br>\npredictive/prescriptive models to accelerate Bayer?s product development. As\n<br><br>\npart of our diverse, highly dynamic group, you will be driving big data\n<br><br>\nchallenges and will lead a team of exceptional data scientists with diverse\n<br><br>\nbackgrounds (Mathematicians, Statisticians and Engineers) to foster your career\n<br><br>\ngrowth and development while delivering next-generation scientific\n<br><br>\nbreakthroughs. You will provide strategic technical and project leadership\n<br><br>\nin a fast paced R&amp;D team environment to accelerate our efforts on building\n<br><br>\na data-driven product pipeline\n\n\n<ul>\n<li>*Responsibilities:**</li>\n</ul>\n\n+ Driving big data challenges in our diverse, highlydynamic group.\n<br><br>\n+ Providing technical contributions in a fast-pacedR&amp;D team environment to accelerate our efforts on building adata-driven product pipeline.\n<br><br>\n+ Using latest advances in machine learning, predictiveanalytics and optimization algorithms. Identify and drive the developmentand deployment of new methodologies globally, to accelerate our pipelineand product development efforts\n<br><br>\n+ Predicting and optimizing our product pipeline andimprove probability of success of our products.\n<br><br>\n+ Developing sustainable, consumable, accurate, andimpactful reporting on model inputs, model outputs, observed outputs,business impact, and key performance indicators.\n<br><br>\n+ Communicating research with peers, and with appropriatecalibration to stakeholders in small and large group settings. Acquiringsupport and partnership from cross functional teams in the company,including engineering and IT teams at Bayer globally.\n\n\n<ul>\n<li>*Minimum Qualifications:**</li>\n</ul>\n\n+ PhD -OR- Master?s Degree with 3+ years in industryexperience in Animal or Plant Breeding, Quantitative Genetics, StatisticalGenetics, Statistics, Biostatistics, or related field.\n<br><br>\n+ Strong programming skilsl (R, Python or Scala)\n<br><br>\n+ Deep understanding of genomic prediction modelingand/or model machine learning techniques and their mathematicalunderpinning\n<br><br>\n+ 2+ year experience in SQL development skills writingqueries.\n<br><br>\n+ Proven ability to tailor machine learning algorithmsand/or complex linear mixed models (GBLUP, Bayesian Genome-wideRegression, Ensembles, Deep Learning, etc.) to business problems in crossfunctional team.\n<br><br>\n+ Proven ability to communicate complex qualitativeanalysis in clear, precise and actionable manner.\n\n\n<ul>\n<li>*Preferred Qualifications:**</li>\n</ul>\n\n+ Proficiency in at least one complied language (i.e.C/C++, Java, Fortran and etc.).\n<br><br>\n+ Proficiency in complex matrix algebra and highdimensional predictive models (thousands+ of features).\n<br><br>\n+ 2+ years of experience with data visualization tools.\n<br><br>\n+ Experience productionizing machine learning/statisticalmodel is a plus.\n<br><br>\n+ 5+ years experience with building R/Python packageswith foreign language interfaces.\n<br><br>\n+ Experience with distributed computing and big dataplatforms\n<br><br>\n+ Experience with working in Linux environment and/orAWS.\n<br><br>\n+ Experience with linear mixed model software/packages(ASREML, lme4, BLUPF90 and etc.).\n<br><br>\n+ Experience with machine learning and deep learningpackages (i.e. TensorFlow, Keras etc.).\n<br><br>\nBayer successfully completed the acquisition of\n<br><br>\nMonsanto in June 2018, bringing together Monsanto?s leadership in seeds and\n<br><br>\nplant traits with Bayer?s leadership in chemical and biological crop\n<br><br>\nprotection. By joining forces, we will create even more extensive career\n<br><br>\nopportunities for talent around the world. We?re a global team working to shape\n<br><br>\nagriculture through breakthrough innovation that will benefit farmers,\n<br><br>\nconsumers, and our planet.\n<br><br>\nWhile\n<br><br>\nwe are now Bayer, we will continue to hire using separate career sites until we\n<br><br>\ncan integrate our career platforms. We invite you to explore the career\n<br><br>\nopportunities available at the combined company by visiting advancingtogether.com/careers .\n\n\n<ul>\n<li>*Organization:** _GLB Breeding - Analytics &amp; Pipeline Des_51190876_</li>\n<li>*Title:** _Data Scientist - Genomic Prediction_</li>\n<li>*Location:** _North America-USA-Missouri-St. Louis_</li>\n<li>*Requisition ID:** _01SR1_</li>\n<li>*Job:** _Research &amp; Development_</li>\n<li>*Schedule:** _Full-time_</li>\n</ul>\n\nAt Monsanto, we value a diverse combination of ideas, perspectives and cultures. All qualified applicants will receive consideration for employment without regard to, among other things, race, religion, color, national origin, age, sex, sexual orientation, gender identity, gender expression, status as a protected veteran, or status as a qualified individual with a disability. If you need a reasonable accommodation to access the information provided on this website, please for further assistance.access our disability accommodations process\n<br><br>\nU.S. Employment Law (applicable for U.S. jobs ONLY): EEO Employer Minorities/Females/Protected Veterans/Disabled. For information about equal employment opportunity rights, please refer to this information from the U.S. federal government: ; .\n<br><br>\nEEOC PosterEEOC Supplement"}