{"job title": "Machine Learning Engineers for next-generation Medical Imaging Robotics", "company": "OSI Engineering", "city state": "– San Diego, CA", "rating": "4.9", "job description": "<strong>JOB DESCRIPTION:</strong>\n<br>\nMachine Learning Engineers for next-generation Medical Imaging Robotics in San Diego, CA\n<br>\n\n<br>\nYou will develop a universal Machine Learning engine for Medical Imaging Robots used for Neurosurgery and Ear, Nose &amp; Throat operations (from the neck up).\n<br>\nThis will include building revolutionary 3D imaging technologies used to assist Surgeons in life saving surgeries.\n<br>\nYou will be part of a new Artificial Intelligence Research and Design Center from the ground-up in San Diego.\n<br>\n\n<br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Research and develop scalable machine learning solutions</li>\n<li>Investigate and solve exciting and difficult challenges in image recognition/classification, object detection/tracking/recognition, 3D scan and deep learning</li>\n</ul>\n\nMust Have\n\n\n<ul>\n<li>Strong understanding of Machine learning algorithms and applications</li>\n<li>Experience in algorithm modifications and optimizations for efficient processing</li>\n<li>Experience with Caffe, Torch, Tensorflow or OpenCV desired</li>\n<li>Strong C/C++ programming skills</li>\n<li>Master's degree in Computer Science or Electrical Engineering</li>\n</ul>\n\nDesired\n\n\n<ul>\n<li>PhD in Computer Science or Electrical Engineering</li>\n<li>Experience with object detection, tracking and recognition; multiple view geometry, 3D SfM/SLAM; activity recognition</li>\n<li>Experience with CNN/deep learning, and their optimizations for efficient implementation on embedded systems</li>\n<li>Experience with fixed point conversion, exploiting parallelism, balancing data transfer and computation</li>\n<li>Embedded environment experience with DSP and GPU</li>\n<li>Medical Imaging Background</li>\n</ul>\n\nLocation: San Diego, CA\n<br>\nType: Fulltime (relocation assistance is available)\n<br><br>\n<strong>CONTACT INFORMATION:</strong>\n<br>\nAlan Bui\n\n\n<ul>\n<li>550.2800</li>\n</ul>\n\n<strong>OSIJOBS</strong>"}