{"job title": "Senior Data Scientist", "company": "Picarro", "city state": "– Santa Clara, CA", "rating": "2.6", "job description": "<strong>The Opportunity:</strong>\n<br><br>\nPicarro is seeking an accomplished individual to join our data analytics team in the role of Senior Data Scientist. We are looking for an analytical thinker and self starter with a passion for finding patterns in data that can be leveraged to add value to our enterprise-class energy solution that is transforming the natural gas industry.\n<br><br>\nThe Picarro cloud analytics platform is a fully-integrated solution that translates the measurements taken onboard our mobile platform into actionable information. Our end-to-end solution helps our customers manage their leak survey resources, identify and quantify risks to the gas pipeline system, and plan infrastructure upgrade decisions.\n<br><br>\nAs a key member of the data analytics team, you will:\n\n<ul>\n<li>analyze large and diverse datasets including time-series and geospatial data and interpret results using atmospheric and other physical models</li>\n<li>translate business needs into models and kickstart commercial implementation of data-analytics products</li>\n<li>become a domain expert in methane detection technologies and the natural gas industry</li>\n<li>provide technical guidance to managers, executives, and customers that will drive the direction of the product</li>\n</ul>\n<strong>Required Skills and Experience:</strong>\n\n<ul>\n<li>3+ years of full-stack experience in data collection, algorithm design, development, testing and productization</li>\n<li>5+ years experience writing production-quality code in Python</li>\n<li>Strong backround in statistical analysis (Bayesian methods, random processes, probability distributions, hypothesis testing, time-series analysis)</li>\n<li>Proficient with SQL and experience working with unstructured data</li>\n<li>Ability to effectively and concisely communicate data-driven insights to a diverse audience of scientists, engineers, managers and executives</li>\n<li>An advanced degree (M.S., Ph.D.) in a quantitative discipline with 2+ years of industry experience</li>\n</ul>\n<strong> Pluses:</strong>\n\n<ul>\n<li>Experience with geospatial analysis using ArcGIS or other open-source GIS tools</li>\n<li>Research experience in atmospheric science</li>\n<li>Domain knowledge in methane detection technologies</li>\n<li>Experience building applications using AWS</li>\n</ul>\nAll qualified applicants will receive consideration for employment without regard to race, sex, color, religion, national origin, protected veteran status, gender identity, social orientation, nor on the basis of disability.\n<br><br>\n<em><strong>Posted positions are not open to third party recruiters/agencies and unsolicited resume submissions will be considered free referrals.</strong></em>"}