{"job title": "Lead Data Scientist, Computer Vision", "company": "ShopRunner", "city state": "– Chicago, IL", "rating": "4.0", "job description": "<strong>ABOUT US:\n<br>\n</strong>\n<br>\n<div>As the premier e-commerce network, ShopRunner offers its members free two-day shipping, free returns, and seamless checkout at hundreds of retailers. Spending billions of dollars in the network annually, ShopRunner's millions of members prove every day that retailers can attract high-value customers by tailoring their shipping and checkout options. ShopRunner's network of leading retailers includes Neiman Marcus Group, Hudson's Bay Company, Kate Spade &amp; Company, Cole Haan and over one hundred more. With people in offices in Chicago and Conshohocken, PA, we're perpetrators of good vibes and great experiences for our customers, our merchants and each other.</div>\n\n<br><strong>ABOUT THE ROLE:</strong><br><br>Are you interested in the intersection of fashion and computer vision? If so, come join us at ShopRunner! We need help turning roughly 50 million product images into compelling consumer features across our website, mobile app, and browser extension.\n<br><br>\nYou'll join a diverse data science team in Chicago. We love learning from each other and solving problems. In addition to your favorite data science work, you'll get to interact with other departments at ShopRunner including, for example, participating in design ideation sessions and partnering with analysts.<br><br><strong>ABOUT WHAT YOU'LL DO:</strong>\n\n\n<ul>\n<li>Develop a taxonomy and metadata system to characterize apparel and accessory items with our product team and outside fashion experts</li>\n<li>Design a system with internal and external engineering teams and vendors to crowdsource label generation for your computer vision tasks</li>\n<li>Own the end-to-end training and deployment of computer vision models and visual similarity algorithms</li>\n<li>Discover and implement cutting-edge computer vision and multi-modal vision and text algorithms from the academic literature</li>\n</ul>\n\n<strong>ABOUT WHAT WE'RE LOOKING FOR:\n<br><br>\n</strong>\n\n\n<ul>\n<li>5+ years as a Data Scientist or Master's/PhD-level candidates with the right research experience and expertise. If you have experience doing computer vision work for a company, you should apply.</li>\n<li>Interest in current deep learning algorithm research. You're curious, love to read research papers, and are excited to participate in our Journal Club.</li>\n<li>Experienced communicator who will speak up about their insights and ideas and work to get their ideas into production.</li>\n<li>Strong Python coding ability, working with libraries such as NumPy, pandas, scikit-learn, and Jupyter.</li> \n\n<li>Deep experience with at least one neural network framework, such as Tensorflow/Keras, MXNet/Gluon, CNTK, Torch/PyTorch, Theano, or Caffe. Familiarity with more than one framework and ability to discuss their tradeoffs would be ideal.</li>\n<li>Experience with GPU computing. You've installed CUDA/cuDNN drivers and know the ins-and-outs of using cloud GPU's vs. building on-prem boxes. You can tell your Teslas from your Titans from your Pascals.</li>\n<li>Experience serving deep learning models using something like Tensorflow Serving or custom-built, dockerized workflows.</li> \n</ul>\n<em>We want you to bring your whole human self to work every single day. We accept you for who you are and consider everyone on an equal opportunity basis without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</em>"}