{"job title": "Senior Data Scientist", "company": "Spaceflight Industries", "city state": "– Herndon, VA", "rating": "3.2", "job description": "<strong>Senior Data Scientist</strong>\n<br><br>\n<strong>Clearance Requirement:</strong> TS/SCI Clearance Desired\n<br><br>\n<strong>US Citizenship Required</strong>\n<br><br>\n<strong>BlackSky Geospatial Solutions,</strong> a division of Spaceflight Industries, is a geospatial intelligence solutions provider that enables organizations to task, collect, and transform data from earth observation, global sensor networks, mobile devices, and social media to deliver on-demand insights about places, events, and assets that are critical to their operations. Blacksky provides satellite collection, data, and cloud based -processing and analytic solutions to organizations that are capitalizing on the exponential growth of a wide range of sensor and collection platforms for delivering the next generation of GEOINT and location intelligence solutions. BlackSky has extensive expertise and capabilities in commercial remote sensing, multi-source analytics, cloud computing, open source software development, Amazon Web Services, and big data geospatial analytics. BlackSky provides solutions to commercial and government organizations with relevant programs with the National Geospatial Intelligence Agency (NGA), US. Army, and U.S. Air Force Research Labs.\n<br><br>\nBlackSky is seeking innovative Data Scientists with a passion for unlocking new insights through disruptive big data analytics. As a member of our solutions team you will help drive our product and solutions strategy and formulate business solutions around time and space analytics. Successful candidate will possess hands on experience in working as a data scientist solving challenging business problems, bringing a strong background in exploiting next generation big data technologies to drive disruptive market solutions.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n<li>Design and implement solutions for internal and external customers that exploit time space analytics for next generation business intelligence solutions</li>\n\n<li>Plan and conduct research projects related to data mining, content curation, machine learning, and predictive analytics</li>\n\n<li>Collaborate with management and technical team on product strategy</li>\n\n<li>Develop algorithms, models, and analytical tools for solving domain specific business problem</li>\n\n<li>Collaborate with software developers to plan and construct the architecture surrounding model deployment.</li>\n</ul>\n<strong>Basic Qualifications:</strong>\n\n<ul>\n<li>5 to 15+ Years of experience as a data scientist</li>\n\n<li>US Citizenship Required</li>\n\n<li>PhD/Master's Degree or equivalent in one of the following fields: computer science, mathematics, physics, statistics, or another computational field with a strong background of using machine learning/data mining for predictive modeling</li>\n\n<li>Hands on experience working with very large data sets, including data cleansing/transformation, statistical analyses, and visualization.</li>\n\n<li>Working knowledge of a wide range of machine learning concepts including: Deep Learning, including Convolutional and Recurrent Neural Networks, Regression and Classification Methods, Graphical Models, Bayesian Analysis, and Unsupervised Learning Methods.</li> \n\n<li>Extensive experience developing software solutions including: Developing machine learning models in Python 3, NumPy, Scipy, Scikit-Learn, Tensorflow, and Keras. Experience developing asynchronous processing algorithms, Cloud-based solutions (especially AWS services like EC2 &amp; S3), and implementing algorithms directly from research papers.</li>\n\n<li>Experience performing research in both groups and as a solo effort.</li>\n\n<li>Strong ability to communicate concepts and analytical results with customers, management, and the technical team, highlighting actionable insights.</li>\n</ul>\n<strong>Desired Skills and Experience:</strong>\n\n<ul>\n<li>Experience with mobile, geospatial or mapping technologies</li>\n\n<li>Experience with big data technologies such as MongoDB (or other NoSQL data stores), Redis and ElasticSearch</li>\n</ul>\n<strong>Spaceflight Industries is an Equal Opportunity and Affirmative Action Employer- EOE AA M/F/Vet/Disability</strong>"}