{"job title": "Senior Data Scientist", "company": "Vectrus", "city state": "– United States-VA-Alexandria", "rating": "3.5", "job description": "Senior Data\n<br>\nScientist\n<br><br>\nJob Description\n<br><br>\nWe are expanding in\n<br>\ndata science to provide the best information possible utilizing the latest\n<br>\ntechniques in Machine Learning (including Deep Learning, Neural network). We\n<br>\nare on the forefront of CBRN defense and we are looking for talented Data\n<br>\nScientists that have applied experience in the fields of artificial\n<br>\nintelligence, machine learning and/or natural language processing to join our\n<br>\nteam. Our data scientists work closely everyday with project managers, subject\n<br>\nmatter experts and software engineers to work on challenges in machine\n<br>\nintelligence, data mining, and machine learning, and work together with agility\n<br>\nto build capabilities that impress our customers. We partner and collaborate\n<br>\nwith universities to being best minds together.\n<br><br>\nData scientists will\n<br>\nhave opportunities to work on projects with highest priority to our business.\n<br>\nVital to success in this role is the ability to determine, define and deploy\n<br>\npredictive/prescriptive analytic solutions to identify and perform root cause\n<br>\nanalysis on adverse trends, by choosing best fit methods, defining algorithms,\n<br>\nand validating and deploying models to achieve results.\n<br><br>\nEssential Duties and Responsibilities:\n\n<ul>\n\n <li>Partner with our development teams to solve problems and\n<br>\n identify trends and opportunities to leverage data from multiple sources.</li> \n\n<li>Collaborate across multiple teams</li>\n<li>Passionate about working with large and complex unstructured\n<br>\n and structured data sets.</li>\n<li>Strong communication and interpersonal skills. You should be\n<br>\n able to work across functions and effectively present, recommend and\n<br>\n communicate a position by demonstrating its value and tradeoffs.</li>\n<li>Comfortable conducting design, algorithm, and code reviews.</li>\n<li>Able to self-direct and succeed with minimal guidance.</li>\n</ul>\nMinimum Qualifications:\n\n<ul>\n\n <li>Ability to obtain a US DoD Security Clearance</li> \n\n<li>Bachelor’s degree in a computer, engineering or quantitative\n<br>\n discipline (e.g., statistics, operations research, bioinformatics,\n<br>\n economics, computational biology, computer science, mathematics, physics,\n<br>\n electrical engineering, industrial engineering).</li> \n\n<li>Programming experience in one or more of the following: R,\n<br>\n MATLAB, C, C , Java, Python, Scala</li>\n<li>Experience in Natural Language Understanding, Computer\n<br>\n Vision, Machine Learning, Algorithmic Foundations of Optimization, Data\n<br>\n Mining or Machine Intelligence (Artificial Intelligence).</li>\n<li>5 years of relevant work experience in data analysis or\n<br>\n related field. (e.g., statistician, data analyst, data scientist)</li>\n<li>Experience with statistical software (e.g., R, Octave, Julia,\n<br>\n MATLAB, pandas) and database languages (e.g., SQL).</li>\n</ul>\nPreferred\n<br>\nqualifications:\n\n<ul>\n\n <li>Master’s or Ph.D. in a quantitative discipline.</li> \n\n<li>Experience with machine learning related open source\n<br>\n libraries including, but not limited to: Hadoop, Spark, SciKit-Learn,\n<br>\n TensorFlow, etc.</li> \n\n<li>Contribution to research communities and/or efforts,\n<br>\n including publishing papers at conferences such as NIPS, ICML, ACL, CVPR,\n<br>\n etc.</li>\n</ul>"}