{"job title": "Data Scientist (Quantitative) - 157416", "company": "Veritude", "city state": "– Boston, Massachusetts", "rating": "3.9", "job description": "<strong>Veritude is seeking a Quantitative Data Scientist for Fidelity Investments. This position is based in Boston, MA.</strong>\n<br><br>\nFidelity’s Investment and Technology Solutions group is seeking a hands-on experienced data scientist with financial services industry experience. As part of a small, nimble team, the associate’s key differentiating abilities will be exceptional analytical skills, and an ability to conceive of and develop differentiated products for the benefit of Fidelity’s customers. Absolutely critical is the associate’s ability to carry an initiative from idea through to execution.\n<br><br>\nThe <strong>Expertise</strong> We’re Looking For\n\n<ul>\n\n\t<li>5+ years of financial industry experience</li>\n\n<li>Education– At least one advanced degree (Master or PhD level) in a technical discipline (including coursework in fields such as statistics, computer science, applied math, econometrics, etc)</li>\n\n<li>Natural programmer, and demonstrated industry experience with statistics and data modeling</li>\n\n<li>Extensive experience in written and oral communications/presentations, and ability to produce a variety of business documents (business requirements, technical specs, slide presentations, etc.) that demonstrate command of language, clarity of thought, and orderliness of presentation</li>\n\n<li>Industry contacts and an ability to hold a deep conversation in one or more of the following areas: electronic trading, asset management, consumer finance, and the Fintech industry landscape</li>\n\n<li>Specific certifications – CFA is a plus</li>\n\n<li>Experience with financial data sets is a plus</li>\n</ul>\nThe <strong>Purpose</strong> of Your Role\n<br><br>\nWithin the Platform Analytics group in the Investment and Technology Solutions organization, you will be responsible for providing Project/Program Management oversight and direction for Artificial Intelligence and other analytics projects across Fidelity Institutional. You will work with a variety of partners and stakeholders to help identify, execute, and track the progress of multiple projects at the same time.\n<br><br>\nAs part of a Product organization, you will also have the opportunity to work closely with Product Managers on various aspects of product rollout. As a member of an analytics group, there may be opportunities to “get your hands dirty” developing analytics solutions from time to time.\n<br><br>\nThe <strong>Skills</strong> You Bring\n\n<ul>\n\n\t<li>Self-motivated, with a strong desire to learn new skills and technology.</li>\n\n<li>Comfort managing multiple complex projects with a variety of stakeholders, including internal partners and external clients</li>\n\n<li>A knack for identifying and improving process inefficiencies.</li>\n\n<li>Ability to effectively prioritize work.</li>\n\n<li>A working knowledge of analytics techniques and tools.</li> \n\n<li>Ability to bring clarity and direction to ambiguous situations.</li> \n\n<li>Strong analytical and problem solving skills.</li>\n\n<li>Ability to proactively execute on identified opportunities</li>\n</ul>\nThe <strong>Value</strong> You Deliver\n\n<ul>\n\n\t<li>Ensuring that Artificial Intelligence and other analytics use cases are optimally identified, prioritized, and executed on.</li>\n\n<li>Tracking and reporting on progress related to Artificial Intelligence initiatives.</li>\n\n<li>Communicating timely and appropriate updates to key stakeholders</li>\n\n<li>Collaborating closely with partners throughout Fidelity to identify synergies, efficiencies, and economies of scale</li>\n</ul>\nHow Your Work <strong>Impacts</strong> the Organization\n<br><br>\nArtificial Intelligence solutions present opportunities for Fidelity Institutional to increase revenues, improve operations, manage risk, and create a better client experience. Your work will ensure that Fidelity Institutional is well positioned to identify and execute on these opportunities.<br><br>Apply"}