{"job title": "Principal Data Scientist", "company": "ZF", "city state": "– Livonia, MI", "rating": "3.1", "job description": "<ul>\n<li>*Principal Data Scientist**</li>\n</ul>\n\nGDF - Information Systems\n<br><br>\n<strong>37138BR</strong>\n\n\n<ul>\n<li>*Job Description**</li>\n<li>*Purpose &amp; Overall Relevance for the Organization:**</li>\n</ul>\n\nThis role will be responsible for researching, designing, engineering, and scaling advanced analytics models (statistical, neural networks, genetic algorithms, and others) in a designated area such as ?customer?, ?quality?, ?plant? etc. The role will be tightly interlinked to ZF?s divisions / functions and IT, closely partnering with respective technical and business teams and data subject matter experts to deliver a comprehensive model strategy, roadmap, and actual models leveraging data sets synthesized from multiple data sources by the data engineering teams. The Principal Data Scientist will constantly seek to improve the performance and business impact of Advanced Analytical Models, as well as support the Digital Monetization team in monetization of Data and Analytics.\n<br><br>\n+ **Principal Subject Matter Expert for Data Science:**\n<br><br>\n+ Serve as an expert internal consultant for Data Science and Advanced Analytics and its integration with Enterprise IT systems, IoT, I4.0, Data, and Analytics across all ZF Divisions and Function\n<br><br>\n+ Strong background, knowledge and understanding of Data Science both in ?traditional? statistical based methods as well as ?machine learning? methods such as neural networks, genetic algorithms, etc. Ph.D. or similar level of accomplishment evidenced by patents or papers.\n<br><br>\n+ Proven track record of working across the enterprise and with IT.\n<br><br>\n+ **Data Science Management:**\n<br><br>\n+ Serve as the Single Point of Contact (SPOC) for Data Science and Advanced Analytics in a designated functional domain.\n<br><br>\n+ Work with Senior technology stakeholders to articulate opportunities for Advanced Analytics across the ZF portfolio.\n<br><br>\n+ Identify and facilitate x-division/function synergies and collaborative Data Science opportunities ? deliver ?whole is greater than the sum of the parts? in the designated area.\n<br><br>\n+ Manage the technical content, education, best practices, and technical competency in data science and advanced analytics in designated domain.\n<br><br>\n+ **Manage and Oversee Lighthouse Data Science Initiatives:**\n<br><br>\n+ Overall responsibility for achieving the quality outcomes of the lighthouse Data Science projects to create large scale Advanced Analytics models that provide significant business outcomes.\n<br><br>\n+ Develop modules and implementation patterns on the ZF platforms to accelerate delivery of Lighthouse Data Science and Advanced Analytics and other capabilities.\n<br><br>\n+ **Manage the Transformational Change:**\n<br><br>\n+ Foster company-wide commitment for Data Science and Advanced Analytics as part of the digital strategy and prioritize initiatives per the company needs, and align it with the overall strategy of the company.\n<br><br>\n+ Act as the ambassador within the company for Digital transformation\n<br><br>\n+ Act as a spokesperson in the external community helping ZF positioning as a Digital leader, attracting highly talented workforce\n\n\n<ul>\n<li>*Key Responsibilities:**</li>\n</ul>\n\n+ Relationship management with Divisions/Functions to ensure buy in to Data Science and Advanced Analytics.\n<br><br>\n+ Coordination work and relevant communication with other cross functional teams within the broader ZF organization (IT, R&amp;D, ?) to assure seamless and ?Team Beats Silos? delivery.\n<br><br>\n+ Act as the change agent in building credibility for the Digital organization by consistently delivering to business expectations\n<br><br>\n+ Work with the internal teams (Digital Labs, Digital Factory, ?) to maximize synergy.\n<br><br>\n+ Support the build-up of an efficient organization that allows for realization of ZF?s Digital goals\n<br><br>\n+ Lead and manage necessary project teams to successfully deliver the stated objectives for lighthouse Data Science and Advanced Analytics projects.\n<br><br>\n+ Use appropriate and effective communication methods to engage and manage stakeholder expectations.\n<br><br>\n+ Hands on development of key models leveraging data wrangling required and Analytical Data Assets delivered by Data Engineering.\n\n\n<ul>\n<li>*Authorities:**</li>\n</ul>\n\n+ Technical leadership in Data Science and Advanced Analytics\n<br><br>\n+ Business Relationship Management\n<br><br>\n+ Life cycle ownership for models\n<br><br>\n+ Responsibility for realizing stated objectives for Data Science\n\n\n<ul>\n<li>*Key Relationships:**</li>\n</ul>\n\n+ Divisional / Functional technical leaders, decision makers, and subject matter experts\n<br><br>\n+ Project teams within the ZF Digital Organization\n<br><br>\n+ Project vendors for development\n<br><br>\n+ Cross Functional Coordination with IT, R&amp;D\n\n\n<ul>\n<li>*Required Education and Experience**</li>\n</ul>\n\nA technical degree from an accredited college or university is required; an advanced degree or equivalent technical standing\n\n\n<ul>\n<li>*Experience and Skill Requirements**</li>\n</ul>\n\n?Demonstrated experience working both at either an OEM or the supply base, or equivalent\n<br><br>\n? Passion for technology with the requisite operations expertise and an entrepreneurial spirt\n<br><br>\n? A builder, not just a refiner, who is versatile and agile in an evolving environment\n<br><br>\n? Minimum of 10-20 years of experience in Data Science with at least 3 years of technical leadership experience with function-wide responsibility preferably in a complex organization\n<br><br>\n? Strong managing, organizing and evaluating skills with a track record of developing and implementing sophisticated advanced analytics models and managing their lifecycle.\n<br><br>\n? Demonstrated capability to communicate findings, orally and visually, to senior leadership members and outside partners and customers in the technology ecosystem\n<br><br>\n? Deep technical understanding of Data Science as well as a demonstrated track record of envisioning the application of these methods to achieve documented results.\n<br><br>\n? Ability to impact outcomes via influence versus authority\n<br><br>\n? Effective negotiation and influencing skills, including strong written and verbal communication and strong presentation abilities\n<br><br>\n? Develops loyalty and commitment in others by articulating an appealing vision for the future, communicating high expectations and leading by example\n<br><br>\n? A player/coach who is focused on mentorship and development\n<br><br>\n? Can ?work the matrix? and gain credibility quickly with internal and external constituents\n<br><br>\n? A technical degree from an accredited college or university is required; an advanced degree or equivalent technical standing a plus\n<br><br>\n? Creative and organized problem solver who is passionate about driving strategy through technology\n<br><br>\n? Strategic mind-set to maintain enterprise-level vision, while driving daily operational goals and controls\n<br><br>\n? Inspires heartfelt engagement, a collaborator with the ability to influence and build consensus\n<br><br>\n? Consistently achieves results, even under tough circumstances\n<br><br>\n? Clear and efficient communicator\n<br><br>\n? Leader and collegial team player with strong interpersonal skills balancing low ego with management capabilities\n\n\n<ul>\n<li>*Position Status**</li>\n</ul>\n\nSalaried Full-Time\n\n\n<ul>\n<li>*Functional Area**</li>\n</ul>\n\nInformation Systems\n\n\n<ul>\n<li>*City**</li>\n</ul>\n\nLivonia\n\n\n<ul>\n<li>*State**</li>\n</ul>\n\nMichigan\n\n\n<ul>\n<li>*Country**</li>\n</ul>\n\nUnited States\n<br><br>\nEqual Employment Opportunity/Affirmative Action Employer M/F/Disability/Veteran"}