{"job title": "Engineer- Decatur or Peoria", "company": "Ameren", "city state": "– Saint Louis, MO", "rating": "3.8", "job description": "Ameren Illinois delivers energy to 1.2 million electric and 812,000 natural gas customers in Illinois. Our mission is to power the quality of life. Our service area covers more than 1,200 communities and 43,700 square miles. For more information, visit AmerenIllinois.com or find us on Twitter @AmerenIllinois. For more on the ActOnEnergy program, visit actonenergy.com.\n<br><br>\n<strong><em>About The Position</em></strong>\n<br><br>\n<em>The Engineer is responsible for the identification, stratification and implementation of reliability improvement and Advanced Distribution Automation opportunities in Illinois.</em>\n<br><br>\nJob Location is open to either Decatur IL or Peoria IL dependent on successful candidate selected.\n<br><br>\n<strong><em>Key responsibilities include:</em></strong>\n\n<ul>\n\n\t\n<li>\n Support the integration of the Volt-Var Optimization (VVO) program and Distributed Energy Resources (DER's) into the distribution electric operations system both for reliability and economic purposes.</li>\n<li>\n Provide support, technical expertise and guidance to Illinois Distribution Control staff as well as Division engineering staff.</li>\n<li>\n Provide expertise in the area of data analysis, outage management, SCADA, distribution automation (DA), circuit coordination, post disturbance analysis, etc.</li>\n<li>\n Consult collaboratively with all Illinois Distribution Control and Reliability stakeholders on projects that will help drive performance excellence across Ameren Illinois Operations.</li>\n<li>\n Provide management oversight of turn-key DA projects for Illinois Operations.</li>\n<li>\n Provide analysis and recommendations to maximize the positive impact of Illinois budgetary allocations for reliability-based projects and initiatives.</li>\n<li>\n Work as part of a team to develop and implement a long-term plan for overall reliability improvement within Illinois.</li>\n<li>\n Support the Ameren Illinois Emergency Operations Center during significant events.</li>\n<li>\n Provide on call support for the various software systems utilized in Distribution Control and the DA areas. Work location is primarily in an office environment, although construction site visits/inspections involving outside activities are required periodically.</li>\n</ul>\n<em><u>Qualifications</u></em>\n<br><br>\nBachelor of Science Degree in Engineering from an accredited college or university required. Fundamentals of Engineering (FE) certification or Professional Engineer (P.E.) registration preferred. Engineering experience preferred.\n<br><br>\n<strong>In addition to the above qualifications, the successful candidate will demonstrate:</strong>\n<br><br>\n<em>Good organization, decision-making, communication, and human relations skills required. Must have ability to function well in a collaborative, team-building environment. Must be able to work under limited supervision. Must be proficient in the use of the Microsoft Office suite. Ability to think strategically required.</em>\n<br><br>\n<em><u>Additional Information</u></em>\n<br><br>\nAmeren’s selection process includes a series of interviews and may include a leadership assessment process. Specific details will be provided to qualified candidates.\n<br><br>\n<strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability or protected veteran status.</strong>"}