{"job title": "Database Administrator", "company": "Atlas RFID", "city state": "– Birmingham, AL, United States", "rating": "4.0", "job description": "<p>Currently, we are seeking a world class Database Administrator to be a shared resource between our Jovix® development team and our Information Services team who design, create, deploy and maintain our product line on a rapid, agile development schedule.</p><p>This is one of those rare opportunities where you have the opportunity to join a world-class team who are all dedicated to doing quality work. We believe that iron sharpens iron and are constantly challenging each other to achieve the exceptional.</p><p>The Database Administrator uses industry-standard practices to conduct database related tasks during new application development and systems maintenance.</p><ul><li>Serves as subject matter expert in design reviews and assists with platform selection and allocation of functionality to specific system components</li><li>Serves as subject matter expert to the full-stack development team</li><li>Participates in development, testing and optimization of database applications</li><li>Analyses existing logical and physical database architecture for the purpose of identifying opportunities for improved performance</li><li>Develops and maintains data migration scripts</li><li>Recognizes and identifies potential areas where existing policies and procedures require change</li><li>Recommends and implements database related disaster recovery procedures</li><li>Recommends and implements database related processes/configurations to increase system availability</li><li>Monitors production databases for efficiency, availability, and redundancy</li><li>Recommends and performs regular database maintenance activities</li><li>Recommends and implements improvements to database hosting infrastructure</li><li>Develops and maintains database documentation</li><li>Troubleshoots SQL Server outages and database performance issues</li><li>Tunes queries to improve performance</li></ul><p>We'll also rely on you for:</p><ul><li>Assisting with integration activities</li><li>Assisting support resources with loading data from external sources</li><li>Refreshing databases as needed by developers or functional teams</li><li>Creating/maintaining database queries for business intelligence tools</li></ul><p>Desired Skills &amp; Experience</p><ul><li>5+ years of progressive experience</li><li>Advanced knowledge of Microsoft SQL Server 2012-2016</li><li>Experience with Azure SQL database</li><li>Experience with SSIS</li><li>Experience developing data warehouses</li><li>Relevant certifications are viewed favorably</li><li>.Net/C# development experience is a plus</li></ul><p><strong>Even more important, we are seeking someone who aligns with our Core Values and Culture:</strong><br><br><strong>Integrity</strong>. Even when it's hard, we act with honesty and integrity. We are respectfully candid in our communications. Our decisions are made with empathy and fairness. We honor our commitments.<br><br><strong>Passion</strong>. With innate curiosity and entrepreneurial spirit, we bring new ideas to life. We see the world not as it is, but as it could be. The biggest challenges energize us. We value hard work, adaptability, and a can-do attitude. We are tenacious problem solvers determined to ensure customer success. We act with optimism and confidence. We strive to accomplish the exceptional.<br><br><strong>Teamwork</strong>. We are a team of teams and will, therefore, succeed or fail as a team. We believe good teamwork is the most powerful force multiplier available to us. We believe nothing is more professionally satisfying that working with a team of selfless, dedicated, and highly competent individuals united toward a common goal. We also recognize that to be a part of a great team, you must be a great teammate and, as individuals, strive to be such. <br><br><strong>Accountability</strong>. We own our mistakes and address them with urgency. We measure performance to drive improvement. We are inspired by each other and the results we deliver. We have a sense of ownership and take great pride in our work. We don’t make excuses; instead we find resourceful ways to get things done.</p><p><strong>Learning</strong>. We crave knowledge and feedback. We are humble learners. We seek continuous improvement as individuals and as an organization. We listen to our clients and teammates. We value self-awareness and recognize that constructive criticism is the key to growth. We learn from our mistakes.</p><p><strong>Leadership</strong>. We believe good leadership is rooted in selflessness and initiative. We hold ourselves to a higher standard and realize that we influence others through our words and actions. We offer more solutions than problems to each other. We initiate the change we want to see. We believe everyone can be a leader, regardless of rank or role.</p><p><b>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</b></p>"}