{"job title": "Advanced Quality Engineer", "company": "Challenge Manufacturing", "city state": "– Pontiac, MI", "rating": "2.8", "job description": "Our Pontiac Automation &amp; Assembly facility is searching for an Advanced Quality Engineer. The Advanced Quality Engineer's ultimate measure of success is acceptably completing all APQP Quality deliverables on-time and meeting the Quality Objective Targets and PPAP by Start of Production (SOP).\n<br><br>\n<strong>RESPONSIBILITIES AND RESULTS:</strong>\n<br><br>\nReasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\n<ul>\n<li>Coordinate the preparation and on-time delivery of Launch APQP / PPAP deliverables.</li>\n<li>Assist in developing the DFMEA and/or PFMEA. Ensure development of the Prototype, Pre-Production and Production Control Plans (for DV Release, PV Release and Customer Part Approval key measures).</li>\n<li>Develop the Measurement System Analysis Plan for the program:</li>\n<li>Ensure the Manufacturing Quality Systems for the Prototype and Pre-Production builds (e.g., Operation Instructions, Incoming Inspection Instructions, Containment Instructions, etc.) are specified on the Control Plan.</li>\n<li>Ensure an Appearance Manual / Boundary Book associated with known acceptable / unacceptable product conditions. Ensure known unacceptable product conditions are listed on the Containment / Safe Launch Checklist for End-of-Line and Containment Inspections.</li>\n<li>Review completed Inspection Reports for components and assemblies for the Prototype and Pre-Production builds. This includes identifying the parts required to be built, ensuring defect data is properly gathered in accordance with the Inspection Instructions and product drawings, compile the data into useful prioritized trends and develop root causes and corrective actions with the development team to counteract any resulting issues.</li>\n<li>Assist Engineering and Program Managers to Develop Design Verification Plan &amp; Reports (DVPR). Review test results / analysis, develop root causes and corrective actions with the development team to counteract any resulting issues, and obtain Engineering concurrence.</li>\n<li>Review Capability Studies and document for all program critical characteristics, and ensure that Engineering requirements are met.</li>\n<li>Manage/support the appearance approval process from pre-grain to PPAP, including identifying the parts required to be built.</li>\n<li>Ensure dimensional verification. This includes identifying the parts required to be built, ensuring dimensional data is properly gathered in accordance with the Engineering requirements and product drawings / GD&amp;T / gaging / fixturing / CMM-Metrology, compile the data into useful acceptable / unacceptable conditions, and develop root causes and corrective actions with the development team to counteract any resulting.</li>\n<li>Deliver approved PPAP packages to development team. (Also may be required for initial PPAP of Service parts.)</li>\n<li>Assist with Supplier and Internal Readiness Reviews.</li>\n<li>Ensure that appropriate statistical methods are utilized throughout the Product and Process Development process and comprehended, where necessary, into the Control Plan.</li>\n<li>Complete all other Customer-specific Advance Product Quality Planning requirements.</li>\n<li>Negotiate, together with our Engineering and Program Managers, acceptable GD&amp;T targets and acceptances.</li>\n<li>Evaluate the gaging strategy required to meet the GD&amp;T.</li>\n<li>Ensure that Gage Studies (Gage R&amp;R, Bias, Linearity and Stability) are conducted on all gaging used on the program and that appropriate corrective actions are taken to improve Gage R&amp;R where data indicates.</li>\n</ul>\n\n<strong>BEHAVIORAL REQUIREMENTS:</strong>\n\n\n<ul>\n<li>Has high standards of performance for self.</li>\n<li>Takes responsibility for actions, results, and mistakes.</li>\n<li>Is thorough, accurate, and reliable when performing and completing job tasks; demonstrates honesty and integrity in all aspects of work.</li>\n<li>Takes positive action to objectively resolve conflict by listening, staying focused on issue to find resolution, and monitoring progress.</li>\n<li>Maintains positive relationships by constructively resolving conflicts.</li>\n<li>Uses feedback from others to continuously improve performance and work relationships.</li>\n<li>Moves within own and/or other work areas (flexes) to support plant flow.</li>\n<li>Works with sense of urgency to meet needs of customers.</li>\n<li>Has necessary experience, skills, and knowledge to perform all aspects of job; rotates through all job responsibilities.</li>\n<li>Maintains knowledge and skills to perform job effectively.</li>\n<li>Has ability to focus on benefits of change and see it as positive; approaches change or newness in constructive/objective manner; views change as learning opportunity.</li>\n<li>Looks for good in others; works collaboratively with others; shares information and knowledge.</li>\n<li>Is at work when scheduled and ensures coverage when absent; takes timely breaks/lunches; uses time wisely.</li>\n</ul>\n\n<strong>REQUIRED EDUCATION AND EXPERIENCE:</strong>\n\n\n<ul>\n<li>A BS degree (preferably in a technical field of study) and 3 or more years of post-degree Quality Engineering experience.</li>\n<li>ASQC/CQM/CQE certification preferred.</li>\n<li>Specific education / training and applied experience in Quality disciplines is required, including (at a minimum):IATF16949, Continuous Improvement, Total Quality Management, AIAG Advanced Quality Planning, PPAP, D/PFMEAs, Control Plans, DOEs, MSA/gaging/fixturing, Dimensional layouts, Manufacturing Quality Systems and SPC.</li>\n<li>Must demonstrate solid skills in communication, interpersonal relations, ability to work well in several teams at once, and ability to inspire individuals to improve performance.</li>\n</ul>\n\n<strong>Other Duties:</strong>\n<br><br>\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.\n<br><br>\nEqual Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}