{"job title": "Director Customer Data &amp; Growth Analytics, Global Consumer Payments and Loyalty", "company": "Gap Inc", "city state": "– San Francisco, California, United States", "rating": "3.5", "job description": "<div>Our past is full of iconic moments but our future is going to spark many more. We're looking for the people who'll help make our next decade just as revolutionary as our first five. If you're one of the super-talented who thrive on change, aren't afraid to take risks and love to make a difference, you're the right fit. Come grow with us.</div> \n<br>\n The Customer Data and Analytics organization is a critical component of the Customer and Strategy Team at Gap Inc. This team is chartered with unlocking the power of customer data and analytics to drive customer obsession across Gap Inc. Additionally, this organization is responsible for building the Customer Data and Analytics Platform on behalf of the entire organization in partnership with GapTech.\n<br><br>\nReporting to the Senior Director Decision Support and Analytics, the Director, Customer Data &amp; Growth Analytics is focused on leveraging customer data and analytics methods to drive customer and business outcomes for key stakeholders across the Global Consumer Payments and Loyalty (GCP) organization.\n<br><br>\n<strong>Key Responsibilities:</strong>\n\n\n<ul>\n<li>Partner with key stakeholders within the GCP organization to leverage customer data and analytics to drive customer and business outcomes with a specific focus on our Gap Inc. loyalty programs</li>\n<li>Perform analytics and leverage existing internal analytical tools to improve decision making and customer strategy development for key stakeholders across GCP</li>\n<li>Build and manage delivery of a roadmap for customer data science and analytics to support the key growth initiatives for GCP</li>\n<li>Proactively identify opportunities to evolve the customer data and analytics roadmap based on needs of key stakeholders</li>\n<li>Translate complex quantitative analysis and concepts in a concise and compelling way to various audiences to gain organizational alignment around project results</li>\n</ul>\n\n<strong>Key Experiences:</strong> \n\n\n<ul>\n<li>7+ years of experience in customer analytics</li>\n<li>5+ years of building and leading high performing teams</li>\n<li>Deep knowledge of retail and ecommerce customer domains required</li>\n<li>Strong business acumen, and superior written, verbal and presentation skills</li>\n<li>Able to deliver near-term wins while building towards a larger strategic vision</li>\n<li>Proficient in data access methods for large customer and transaction databases</li>\n<li>Proficient in leveraging customer analytical methods to drive customer and business outcomes</li>\n<li>Bachelors degree (preferably in a quantitative field such as math, statistics, physics, chemistry, engineering, economics, computer science, operational research); Masters degree highly desired, but not required.<br><br><strong>KEY BENEFITS:</strong></li>\n\n</ul>\n\n\n\n<ul>\n\n <li>Merchandise discount for our brands: 50% off regular-priced merchandise at Gap, Banana Republic and Old Navy, 30% off at Outlet and 25% off at Athleta.</li>\n\n<li>One of the most competitive Paid Time Off plans in the industry.*</li>\n\n<li>Employees can take up to five on the clock hours each month to volunteer at a charity of their choice.*</li>\n\n<li>Extensive 401(k) plan with company matching for contributions up to four percent of an employees base pay.*</li>\n\n<li>Employee stock purchase plan.*</li>\n\n<li>Employees receive medical, dental, vision and life insurance.*</li>\n\n<li>Employees can apply for tuition reimbursement.*</li>\n\n<li>Family care programs.</li>\n\n<li>Commuter benefits.</li>\n\n<li>Pet Discount Program.</li>\n</ul>\n*For eligible employees<br>\n<div>Gap Inc. is an equal-opportunity employer and is committed to providing a workplace free from harassment and discrimination. We are committed to recruiting, hiring, training and promoting qualified people of all backgrounds, and make all employment decisions without regard to any protected status. In 2016, Gap Inc. was named one of the Best Places to Work by the Human Rights Campaign for the thirteenth consecutive year and was the sole winner of the Catalyst award for equality in the workplace in 2016.</div>"}