{"job title": "Genesys Routing Engineer", "company": "Horizontal Integration", "city state": "– Hartford, CT", "rating": "4.3", "job description": "<div>\n<div>\nDescription<br><br><strong>Responsibilities:</strong>\n\n<ul>\n\n\t<li>Develop new and/or enhance existing application or system code as assigned or provided in technical specifications</li>\n<li>Perform the day to day functions such as running of existing programs, applications, jobs, reviewing logs for errors, writing or editing software and code, performing testing activities, and updating documentation</li>\n<li>Coordinate activities with other technical and functional areas as required</li>\n<li>Work may include sensitive healthcare information, data, trends, or claims</li>\n<li>Support other team members, removing technical road blocks, and suggest new technical solutions</li>\n</ul>\n<strong>Must Have:</strong>\n\n<ul>\n\n\t<li>5+ years of Routing Development Experience in Contact Center Solutions (Voice, IVR and Multi-channel)</li>\n<li>5+ years of Configuration management tools</li>\n<li>Experience in developing Routing workflows using Composer / IR</li>\n<li>Experience in designing, developing and debugging routing solutions implemented using Genesys Orchestration Server, Genesys Rules Engine and URS</li>\n<li>Working knowledge of Genesys/Cisco Framework, reporting, routing and multi-channel components</li>\n<li>Ability to architect routing design and development for new solutions that will be implemented for the customer</li>\n<li>Clear understanding of reporting (GIM/ICON) schema and impacts to reporting with respect to routing changes</li>\n<li>Experience in troubleshooting routing issues in production on call</li>\n<li>Excellent Communication and interpersonal skills</li>\n</ul>\n<strong>Nice to have:</strong>\n\n<ul>\n\n\t<li>Experience on Build automation tools such as Anthill Pro, XL Deploy, and Jenkins to support CI / CD approach</li>\n<li>Experience using Cyara for call flow automation testing</li>\n<li>Genesys certification in Routing</li>\n</ul>\n#Priority\n<br><br>\n<em>Horizontal Integration is proud to be an Equal Opportunity and Affirmative Action Employer. We seek to provide employment opportunities to talented, qualified candidates regardless of race, color, sex/gender including gender identity and/or expression, national origin, religion, sexual orientation, disability, marital status, citizen status, veteran status, or any other protected classification under federal, state or local law.</em>\n<br><br>\n<em>\n<br>\nIn addition, Horizontal Integration will provide reasonable accommodations for qualified individuals with disabilities. If you need to request a reasonable accommodation in order to complete the application or interview process, please contact hr@horizontalintegration.com.</em>\n<br><br>\n<em>\n<br>\nAll applicants applying must be legally authorized to work in the country of employment.</em></div>\n</div>\n<br>"}