{"job title": "Android Engineer", "company": "KeepTruckin", "city state": "– San Francisco, CA", "rating": "4.7", "job description": "<div><strong>About Us</strong>:</div><br>\n<div>KeepTruckin is on a mission to connect the worlds trucks. With the leading ELD and fleet management platform, we are bringing the trucking industry online and fundamentally changing the way freight is moved on our roads.</div><br>\n\n<div><strong>The numbers tell the story:</strong></div><li>The KeepTruckin network is composed of more than 200,000 trucks and is expected to grow to 400,000 by end of 2018.</li>\n<li>We grew from $1 million to more than $50 million in annual recurring revenue in 12 months, among the fastest growing SaaS companies ever.</li>\n<li>Our Glassdoor rating is 4.8 stars. We have built an incredible culture with high trust and transparency, where people feel empowered to do their best work.</li>\n\n<br>\n<div><strong>About the Job:</strong></div><br>\n<div>As a key member of our team, you will play an active part in designing, and managing our next generation KeepTruckin Android app. Your expertise will be contributed to redefining our architecture and building a world class offline-first mobile application with an enthusiastic team. We are looking for candidates who have a familiarity with Java and Kotlin, and a good understanding of system architectures (MVC, MVVM, Redux) and a forward thinking mindset aimed at high readability (declarative) code, as well as identifying problems or bottlenecks before they become issues.</div>Responsibilities:\n\n<ul>\n<li>Develop new features for our Android (Java &amp; Kotlin) KeepTruckin App for Fleets</li><li>Improving one of our many existing features, including GPS tracking (Geofencing), Bluetooth and USB comms, Camera APIs, etc</li><li>Work with product team to refine feature specs</li><li>Communicate with back end engineers about API requirements or refinements</li><li>Help support team to diagnose user problems</li><li>Analyze our user's data to identify bugs</li><li>Be able to work as part of a small, tightly knit team</li>\n</ul>\n\n<br>\n<strong>Qualifications:</strong>\n\n<ul>\n<li>3+ years experience working on Android apps</li><li>Proficiency in Java, Kotlin, Android lifecycle, custom views, database/persistance</li><li>An understanding of Android UI/UX and application design paradigms</li> <li>An appreciation and understanding of automated app testing</li><li>Knowledge in RxJava2, Dagger2 is a plus!</li><li>Knowledge or interest in commercial vehicles/trucking is a plus!</li>\n</ul>\n\n<br>\n<div>KeepTruckin is a rapidly growing startup headquartered in San Francisco. We offer fantastic benefits, a phenomenal office culture, unlimited PTO, and a stocked kitchen. As an equal opportunity employer, we are committed to diversity in the workforce. We consider qualified applicants without regard to sexual orientation, gender identity, race, veteran or disability status.</div>"}