{"job title": "Junior Embedded Software Engineer", "company": "KeepTruckin", "city state": "– Buffalo, NY", "rating": "4.7", "job description": "<div><strong>About Us</strong>:</div><br>\n<div>KeepTruckin is on a mission to connect the worlds trucks. With the leading ELD and fleet management platform, we are bringing the trucking industry online and fundamentally changing the way freight is moved on our roads.</div><br>\n\n<div><strong>The numbers tell the story:</strong></div><li>The KeepTruckin network is composed of more than 200,000 trucks and is expected to grow to 400,000 by end of 2018.</li>\n<li>We grew from $1 million to more than $50 million in annual recurring revenue in 12 months, among the fastest growing SaaS companies ever.</li>\n<li>Our Glassdoor rating is 4.8 stars. We have built an incredible culture with high trust and transparency, where people feel empowered to do their best work.</li>\n\n<br>\n<div><strong>About the Job:</strong></div><br>\n<div>As a Junior Embedded Software Engineer, you have an amazing opportunity to shape the way we develop our products. We are looking for candidates with a software development background and hands-on experience developing complex systems to join our Embedded team. This role offers immense career advancement and the opportunity to work with cutting edge technology. Reporting to the Director of Embedded Software Engineering, you will work with collaborative and agile team.</div>Responsibilities:\n\n<ul>\n<li>Create tools to analyze Electronic Logging Device data</li><li>Improve the stability and quality of our product</li><li>Develop and diagnose network facing software</li><li>Create automated and manual functional tests</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n<ul>\n<li>Software Engineering degree or equivalent</li><li>1 year internship or direct product experience</li><li>Proficiency in C / C++ / Python</li><li>Expertise implementing specifications including precise timing and data packaging</li><li>Proficient with embedded systems tools such as emulators, compilers, simulators, etc.</li><li>Experience writing unit tests</li><li>Experience writing tests to validate software in automated test environments</li>\n</ul>\n\n<div>KeepTruckin is a rapidly growing startup headquartered in San Francisco. We offer fantastic benefits, a phenomenal office culture, unlimited PTO, and a stocked kitchen. As an equal opportunity employer, we are committed to diversity in the workforce. We consider qualified applicants without regard to sexual orientation, gender identity, race, veteran or disability status.</div>"}