{"job title": "Embedded QA Engineer", "company": "KeepTruckin", "city state": "– Buffalo, NY", "rating": "4.7", "job description": "<div><strong>About Us</strong>:</div><br>\n<div>KeepTruckin is on a mission to connect the worlds trucks. With the leading ELD and fleet management platform, we are bringing the trucking industry online and fundamentally changing the way freight is moved on our roads.</div><br>\n\n<div><strong>The numbers tell the story:</strong></div><li>The KeepTruckin network is composed of more than 200,000 trucks and is expected to grow to 400,000 by end of 2018.</li>\n<li>We grew from $1 million to more than $50 million in annual recurring revenue in 12 months, among the fastest growing SaaS companies ever.</li>\n<li>Our Glassdoor rating is 4.8 stars. We have built an incredible culture with high trust and transparency, where people feel empowered to do their best work.</li>\n\n<br>\n<div><strong>About the Job:</strong></div><br>\n<div>As an Embedded QA Engineer you have an amazing opportunity to shape the way we develop and execute our QA strategy. Reporting to the Senior QA Manager, you will oversee the quality of our flagship product. If you are collaborative and have the gift of meticulous detail, we want to hear from you.</div>Responsibilities:\n\n<ul>\n<li>Testing our Electronic Logging Device</li><li>Develop and execute full system regression test plans</li><li>Test implementation, unit testing results analysis, and data validation</li><li>Develop QA artifacts such as defects, enhancements, and requirement traceability matrices</li><li>Define, estimate, track, and report progress of S/W quality assurance efforts</li><li>Collaborate with other departments and facilitate escalation and/or triage of issues</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n<ul>\n<li>5+ years experience in S/W quality assurance</li><li>Thorough understanding of software development life cycle</li><li>Experience creating detailed regression and incremental test plans</li><li>Knowledge of Agile methodologies, KANBAN, and S/W testing life cycles</li><li>Knowledge of issue tracking tools (JIRA preferable)</li><li>Knowledge of test management tools</li><li>Familiarity with embedded linux systems and testing of hardware devices are a plus</li>\n</ul>\n\n<br>\n<div>KeepTruckin is a rapidly growing startup headquartered in San Francisco. We offer fantastic benefits, a phenomenal office culture, unlimited PTO, and a stocked kitchen. As an equal opportunity employer, we are committed to diversity in the workforce. We consider qualified applicants without regard to sexual orientation, gender identity, race, veteran or disability status.</div>"}