{"job title": "Systems Engineer", "company": "ManTech", "city state": "– USA IDAHO Bayview", "rating": "3.5", "job description": "<div>Req ID 100621BR</div> <div> Business Title Systems Engineer</div> <div> Group MSS</div> <div> Location USA IDAHO Bayview</div> <div> Clearance Level Needed Secret</div> <div> Category Systems Development</div> <div> Job Duties and Responsibilities<br><br><strong>Target Education &amp; Overall Experience</strong>:\n<ul>\n<li>Bachelor’s Degree in engineering or computer programming with seven years of experience in data acquisition and control system operation and maintenance, with knowledge of system control applications.</li>\n</ul>\n<strong>Target Experience: Experience within the past five years in the following:</strong>\n<ul>\n<li>Acoustic Data Acquisition and Signal Processing Systems – Operation &amp; Maintenance.</li> <li>Development of software for: real time acquisition and analysis of acoustic data from ships and submarines; and underwater tracking systems or for command and control and information management systems.</li> <li>Integrating VME, PCI, PXI and PC/104 system hardware at circuit board and back-panel level, VME PCI, PXI and PC/104 network system support.</li> <li>Integrating COTS signal processing components into data acquisition and control systems, including control software.</li> <li>Component level troubleshooting of integrated data acquisition systems.</li> <li>Digital signal processing for high bandwidth, real-time data acquisitions and control systems.</li> <li>Working knowledge of Windows, Linux and HPUX operating systems and software development in C/C#/C++, Java, Unix/Unix scripts, Labview, MATLAB, Visual Basic and database programming. Instrument control via GPIB, VXI, MXI, RS232, TCP/IP.</li> <li>Management of system hardware and/or software development including system requirement analysis, documentation, configuration control and cost estimating.</li> <li>Guidance, navigation or ship control electronic systems.</li></ul></div>\n<br>\n<div> Qualifications Requires Bachelors degree (in Computer Science or related field) or equivalent, and five to seven years of related experience.</div> <div> Degrees Bachelor's Degree\n<br>\nSee Qualifications</div>\n<br>\n<div> Years of Experience See Qualifications</div> <div> Position Type Full-Time</div> <div> Shift Day</div> <div> Overview ManTech International Corporation is comprised of approximately 7,300 talented employees who use advanced technology to help government and industry meet some of their greatest challenges around the world. We adhere to the simple, no-nonsense values on which ManTech was founded more than four decades ago, aligning squarely with the mission objectives of our customers. As our customer base continues to expand and diversify, we continue to diversify our workforce and solutions. Nearly half our employees have a military background, and approximately 70 percent hold a government security clearance. As a leading provider of innovative technology services and solutions for the nation's defense, security, health, space, and intelligence communities; we hold nearly 1,100 active contracts with more than 50 different government agencies.</div>"}