{"job title": "Automation Controls Engineer 4", "company": "Matrix Technologies, Inc.", "city state": "– Maumee, OH", "rating": "3.9", "job description": "<div>\n<div><strong>Automation Controls Engineer 4</strong></div><br>\n\n<div>Industrial Systems Division</div><br>\n\n<div><strong>Location:</strong> Maumee, OH</div><br>\n\n<div><strong>Job Type:</strong> Full Time, Direct Hire</div><br>\n\n<div><strong>Job Status:</strong> Exempt, STOT eligible</div>\n\n<br><strong><div>Reports To:</div>\n\n<br></strong>\n<br>\n<div>Department Manager, Industrial Systems</div>\n\n<br><strong><div>Description:</div>\n\n<br></strong>\n<br>\n<div>The Controls Engineer works on a variety of automation projects, performing as a team member and on occasion a team leader. This position interacts with clients to understand and develop automation requirements and transform them into effective software solutions. This is done through the use of software engineering techniques, procedures, and criteria; using judgment in making minor adaptations and modifications. This position establishes client relationships and mentors less experienced engineers. Strong knowledge of PLC: Rockwell, Schneider, Siemens; HMI: Rockwell, Wonderware, Proficy; strong written and verbal communication skills, must be team-oriented. A combination of experience in process and motion control systems is ideal.</div>\n\n<br><strong><div>Specifications:</div>\n\n<br></strong>\n\n\n<ul>\n\n\t<li>Bachelors of Science Degree in Electrical Engineering, Computer Science Engineering or related field from an ABET accredited college or university</li>\n<li>Five to ten years of controls, automation, and electrical troubleshooting and start-up experience.</li>\n<li>Engineer In Training (EIT) or Professional Engineering (PE) certification preferred</li>\n<li>Varied industrial background is a plus. Key industries include food, chemical, pharmaceuticals, steel, glass, and manufacturing.</li>\n<li>Ability to travel approximately 25-30%, both locally and overnight</li>\n</ul>\n\n<strong><div>Duties and Responsibilities:</div>\n\n<br></strong>\n\n\n<ul>\n\n\t<li>Perform design and engineering functions in accordance with accepted practices and company standards.</li>\n<li>Prepare project scopes of work, preliminary design concepts, and cost estimates for small projects. Assist in gathering field data and preparing project specifications.</li>\n<li>Develop high-quality, error-free industrial software programs in keeping with the defined project requirements.</li>\n<li>Coordinate design with other members of the project team.</li>\n<li>Prepare scopes of work, bills of material, specifications, cost estimates, and other necessary projects documents.</li>\n<li>Prepare project correspondence as required.</li>\n<li>Maintain positive client relationships on projects assigned.</li>\n</ul>\n\n<strong><div>Physical Requirements:</div>\n\n<br></strong>\n\n\n<ul>\n\n\t<li>While performing the duties of this job, the employee is occasionally required to stand; walk; sit; use hands to finger, handle, or feel objects, tools or controls; reach with hands and arms; talk, and hear.</li>\n<li>Specific vision abilities required by the job include close vision, distance vision, color vision, peripheral vision, depth perception, and the ability to adjust focus.</li>\n<li>This position must also be able to perform industrial field work which may include hazardous locations, ladders, and stairs.</li>\n</ul>\n\n</div>\n<br>"}