{"job title": "Navigation Systems Engineer", "company": "MITRE", "city state": "– Bedford, Massachusetts", "rating": "3.2", "job description": "<div><div><div><div><div><div>Why choose between doing meaningful work and having a fulfilling life? At MITRE, you can have both. That's because MITRE people are committed to tackling our nation's toughest challenges—and we're committed to the long-term well-being of our employees. MITRE is different from most technology companies. We are a not-for-profit corporation chartered to work for the public interest, with no commercial conflicts to influence what we do. The R&amp;D centers we operate for the government create lasting impact in fields as diverse as cybersecurity, healthcare, aviation, defense, and enterprise transformation. We're making a difference every day—working for a safer, healthier, and more secure nation and world. Our workplace reflects our values. We offer competitive benefits, exceptional professional development opportunities, and a culture of innovation that embraces diversity, inclusion, flexibility, collaboration, and career growth. If this sounds like the choice you want to make, then choose MITRE—and make a difference with us.</div>\n\n<br>Early career position working as part of a team of experts and multi-disciplinary engineers in developing, applying, and evaluating state-of-the-art Positioning, Navigation, and Timing (PNT) techniques and technologies with a focus on Navigation Warfare (“Navwar”). Navwar includes Counter-PNT, PNT resilience, and PNT situational awareness.\n<br><br>\nExample technical focus areas include radio frequency signal processing, satnav receiver hardening and exploitation, inertial navigation system design and implementation, end-to-end prototype development, and field test data collection, processing, and analysis. \n<br>\n<strong></strong><div><strong>\nKey Functions:</strong>\n\n\n<ul>\n<li>Postulate, develop, and test threats to PNT systems, methods for countering threats, and methods for detecting and characterizing threats</li>\n<li>Advance work from the concept to real-time system-level demonstration phase (i.e. DoD technology readiness level (TRL) 1 to TRL6)</li> \n\n<li>Influence the short, mid, and long-term Navwar and PNT work programs within MITRE and sponsors</li> \n\n<li>Influence sponsors on key PNT R&amp;D and acquisition decisions via demonstration and documentation</li> \n</ul>\n\nTo do this, the successful candidate will:\n\n\n<ul>\n<li>Apply electrical engineering, systems engineering, computer science, and aerospace engineering disciplines to a diverse set of challenges</li> \n\n<li>Learn quickly on the job</li> \n\n<li>Interface directly with defense and intelligence community sponsors and other contractors</li></ul></div><br>\n\n<div>\n<strong>Required Qualifications:</strong>\n<br>\n<strong>Candidates must exhibit:</strong>\n\n\n<ul>\n<li>An exceptionally clear and structured thought process and coherent decision making skills</li> \n\n<li>The ability to adapt and expand one’s skillset to solve the problem at hand</li>\n<li>A desire to focus on technical and high impact work above all other factors</li> \n\n<li>A desire and ability to work in classified environments</li> \n\n<li>The candidate shall have academic and/or professional experience with:</li> \n\n\n<ul>\n<li>digital signal processing and stochastic processes</li> \n\n<li>state-space modeling and linear systems theory</li> \n\n<li>wireless communications</li> \n\n<li>basic antenna and radio propagation theory</li> \n\n<li>writing technical and non-technical briefings, memos, and formal reports</li> \n\n<li>Matlab or equivalent mathematical computation, modeling, and simulation tool</li> \n\n<li>real-time and non-real-time embedded systems design and programming</li> \n\n<li>basic software development, debugging, and support</li> \n\n<li>mastery of spectrum analyzers, network analyzers, oscilloscopes, frequency counters, etc.</li></ul>\n</ul>\n\n<strong></strong><div><strong>Preferred Qualifications:</strong>\n<br>\nThe ideal candidate will have academic and/or professional experience with:\n\n\n<ul>\n<li>Satellite navigation (Satnav) (Global Positioning Systems (GPS), Galileo, GLONASS, etc.) systems</li> \n\n<li>Satnav receiver design and algorithm implementation</li> \n\n<li>Applied electronic warfare, e.g. RF jamming and more sophisticated threats</li> \n\n<li>Kalman filter implementation, tuning, and augmentation</li> \n\n<li>Non-linear system theory, detection, and estimation</li> \n\n<li>Orbital mechanics</li> \n\n<li>Computer science, including theory, algorithms, and cryptography</li>\n<li>Electromagnetics</li> \n\n<li>Image and video processing</li> \n\n<li>Inertial measurement unit design, error modeling, and integration</li> \n\n<li>Formal large-scale systems engineering</li> \n\n<li>Field testing (in any engineering discipline)</li> \n\n<li>Hardware, software, firmware, and integrated system prototyping</li> \n\n<li>BS and 2 years of related experience, or MS</li></ul></div>\n\n<br><strong><div>Minimum Qualifications:</div>\n\n<br></strong>\n\n\n<ul>\n<li>BS or equivalent</li>\n</ul>\nLevel2\n<br><br>\nSecret</div>\n </div>\n</div>\n </div>\n </div>\n</div>\n<br>"}