{"job title": "Software Systems Engineer", "company": "MITRE", "city state": "– Colorado Springs, Colorado", "rating": "3.2", "job description": "<div><div><div><div><div>Why choose between doing meaningful work and having a fulfilling life? At MITRE, you can have both. That's because MITRE people are committed to tackling our nation's toughest challenges—and we're committed to the long-term well-being of our employees. MITRE is different from most technology companies. We are a not-for-profit corporation chartered to work for the public interest, with no commercial conflicts to influence what we do. The R&amp;D centers we operate for the government create lasting impact in fields as diverse as cybersecurity, healthcare, aviation, defense, and enterprise transformation. We're making a difference every day—working for a safer, healthier, and more secure nation and world. Our workplace reflects our values. We offer competitive benefits, exceptional professional development opportunities, and a culture of innovation that embraces diversity, inclusion, flexibility, collaboration, and career growth. If this sounds like the choice you want to make, then choose MITRE—and make a difference with us.<br><br><h3>Key Description:</h3><br><br>MITRE’s Systems Performance Engineering department seeks a Systems Engineer with a emphasis on Systems Engineering from a performance perspective.\n<br><br>\nThe focus of the work will be to provide technical expertise in the area of performance improvements in support of DoD and Federal Agencies. The incumbent will be required to work in a collaborative team environment. Performance will be addressed from infrastructure to the System of Systems level.<br><br><h3>Key Functions:</h3><br><br>Work as a strong contributor, and provide technical expertise. Stay abreast of emerging trends in information technology and help shape the work for the System Engineering Tech Center. Work with sponsors to understand their requirements and evaluate possible technical solutions. The successful candidate should be familiar with the systems engineering process, and data as a fundamental building block for performance improvement. Participation in working groups, design reviews and system tests. The successful candidate will help generate assessments and develop and implement actionable recommendations based on reviews.<br>\n<div>\n<h3>Required Qualifications:</h3><br><br>Bachelor's Degree in Electrical Engineering, Computer Science or Computer Engineering or similar field with a strong academic record of 3.0 GPA or higher. Willingness to focus on engineering from a performance perspective.\n<br><br>\nCandidate should possess the ability to be responsible for deliverables or parts of deliverables to MITRE customers.\n<br><br>\n• Higher level programming language such as Java, C++\n\n\n<ul>\n<li>Web based languages such as JEE, .NET, Java Script, JQuery</li>\n<li>Knowledge of data structures and relational database systems such as MySQL, SQL Server, PostGres</li>\n<li>Working knowledge of information exchange technologies such as RESTful and SOAP</li>\n<li>System Engineering Processes and Techniques</li>\n<li>Excellent collaboration and communication skills</li>\n<li>Strong Technical writing skills\n</li></ul></div>\n\n\n\n</div>\n</div>\n </div>\n </div>\n</div>\n<br>"}