{"job title": "Lead Networking Technology and Security Engineer", "company": "MITRE", "city state": "– Bedford, Massachusetts", "rating": "3.2", "job description": "<div><div><div><div><div>Why choose between doing meaningful work and having a fulfilling life? At MITRE, you can have both. That's because MITRE people are committed to tackling our nation's toughest challenges—and we're committed to the long-term well-being of our employees. MITRE is different from most technology companies. We are a not-for-profit corporation chartered to work for the public interest, with no commercial conflicts to influence what we do. The R&amp;D centers we operate for the government create lasting impact in fields as diverse as cybersecurity, healthcare, aviation, defense, and enterprise transformation. We're making a difference every day—working for a safer, healthier, and more secure nation and world. Our workplace reflects our values. We offer competitive benefits, exceptional professional development opportunities, and a culture of innovation that embraces diversity, inclusion, flexibility, collaboration, and career growth. If this sounds like the choice you want to make, then choose MITRE—and make a difference with us.<br>\n<div>The\n<br>\nkey roles of Lead Network Technology and Security engineer are:\n<br><br>\nProvide networking and\n<br>\nnetwork security engineering support to a variety of operational and R&amp;D\n<br>\nprojects involving design, development, integration, and implementation\n<br>\nactivities\n<br><br>\nSolve complex networking\n<br>\nand security problems in areas spanning enterprise IT networks, data center\n<br>\ninfrastructure, critical infrastructure, network operations, network security,\n<br>\nand more\n<br><br>\nCollaborate with MITRE,\n<br>\ncommercial industry, and government sponsor teams to investigate solutions to\n<br>\nchallenging problems\n<br><br>\nAs a Lead\n<br>\nEngineer in the Networking and Infrastructure Technology Center, you might\n<br>\nexpect to:\n<br><br>\nProvide technical\n<br>\nexpertise on topics related to networking and network security to wide-ranging\n<br>\nprojects across MITRE\n<br><br>\nEngage with technical\n<br>\nexperts from commercial industry, academia, government agencies, and FFRDCs to\n<br>\nidentify problems, investigate solutions, and develop consensus on best\n<br>\nsolution approaches\n<br><br>\nLead efforts that\n<br>\nroutinely involve tasks such as tradeoff analyses, design assessments,\n<br>\nlab-based prototyping, and technology/product assessments\n<br><br>\nDevelop written products\n<br>\nand technical reports that highlight findings and recommendations\n<br><br>\nWork closely with industry to understand best practices and maintain a pulse of\n<br>\ninnovations in the networking and network security area\n<br><br>\nConduct hands-on lab\n<br>\nanalysis to solve technical issues, consider potential integration\n<br>\nopportunities, and understand performance/scalability issues.\n<br><br>\nSupport innovation by identifying areas for research, developing proposals, and leading funded research\n<br><br>\nEnable good business growth by Leveraging technical expertise to enhance business opportunities with government sponsors<br>\n\n<div>\n</div></div><br>\n\n<div>\nMinimum Qualifications:<div>Bachelor’s\n<br>\ndegree in Electrical, Computer or Systems engineering disciplines and eight\n<br>\nyears of technical experience.\n<br><br>\nApplicants selected for\n<br>\nthis position will be subject to a government security investigation and must\n<br>\nmeet eligibility requirements for access to classified information\n<br><br>\nStrong written and verbal communications skills</div>\n</div>\n </div>\n</div>\n </div>\n </div>\n</div>\n<br>"}