{"job title": "Aviation Safety Systems Engineer", "company": "MITRE", "city state": "– McLean, Virginia", "rating": "3.2", "job description": "<div><div><div><div><div><div>Why choose between doing meaningful work and having a fulfilling life? At MITRE, you can have both. That's because MITRE people are committed to tackling our nation's toughest challenges—and we're committed to the long-term well-being of our employees. MITRE is different from most technology companies. We are a not-for-profit corporation chartered to work for the public interest, with no commercial conflicts to influence what we do. The R&amp;D centers we operate for the government create lasting impact in fields as diverse as cybersecurity, healthcare, aviation, defense, and enterprise transformation. We're making a difference every day—working for a safer, healthier, and more secure nation and world. Our workplace reflects our values. We offer competitive benefits, exceptional professional development opportunities, and a culture of innovation that embraces diversity, inclusion, flexibility, collaboration, and career growth. If this sounds like the choice you want to make, then choose MITRE—and make a difference with us.\n<br><br>\nThe Airport/Airspace Analysis, Model and Design department has an ongoing commitment to conduct quantitative risk assessments, such as the analysis of aviation events involving loss of required separation, and the quantitative risk calculations associated with the various hazards identified in the runway and terminal environment. The individual will be involved in quantitative risk modeling and the analysis of the output of the simulations using such models. The individual will also be involved in the analysis of hazards associated with proposed operations and changes to existing operations in the national airspace system in general and in the airport runway environment in particular.\n<br><br>\nKey Functions:\n<br><br>\n• Analyze historical and simulated operational data to draw conclusions about the efficacy of the National Airspace System.\n\n\n<ul>\n<li>Draw conclusions from data and clearly and concisely articulate key findings in both written and verbal form.</li>\n<li>Apply basic data analysis skills: exploratory data analysis, time series analysis, distribution fitting, linear regression<br><br></li></ul>\n\n<div>Required Qualifications:\n<br><br>\nA bachelor's degree is required, but Master's and above would be welcome in an aviation related field, Operations Research, Mathematics/Statistics, Computer Science, Systems Engineering, Aeronautical Engineering, other physical science/engineering field, or equivalent experience. Experience in the field of aviation safety is highly desired.</div> </div>\n </div>\n</div>\n </div>\n </div>\n</div>\n<br>"}