{"job title": "Lead Networking Research Engineer", "company": "MITRE", "city state": "– McLean, Virginia", "rating": "3.2", "job description": "<div><div><div><div><div>Why choose between doing meaningful work and having a fulfilling life? At MITRE, you can have both. That's because MITRE people are committed to tackling our nation's toughest challenges—and we're committed to the long-term well-being of our employees. MITRE is different from most technology companies. We are a not-for-profit corporation chartered to work for the public interest, with no commercial conflicts to influence what we do. The R&amp;D centers we operate for the government create lasting impact in fields as diverse as cybersecurity, healthcare, aviation, defense, and enterprise transformation. We're making a difference every day—working for a safer, healthier, and more secure nation and world. Our workplace reflects our values. We offer competitive benefits, exceptional professional development opportunities, and a culture of innovation that embraces diversity, inclusion, flexibility, collaboration, and career growth. If this sounds like the choice you want to make, then choose MITRE—and make a difference with us.<br>\n<div>MITRE’s Communications\n<br>\nNetwork Engineering and Analysis Department, T861, which is part of MITRE’s\n<br>\nInfrastructure and Networking Technical Center, has as its mission to provide\n<br>\npremier communications network engineering services for our customers at all classification\n<br>\nlevels. Our core competencies are as follows:\n<ul>\n<li>Information Technology (IT) &amp; Operational Technology (OT) Enterprise Networks</li><li>Commercial and Tactical Wireless Networks</li><li>Secure and High Availability Networking</li><li>Network Protocol Design &amp; Development</li><li>Prototyping and Proof-of-Concept Implementations</li><li>Network Performance Monitoring and Management</li><li>Network Performance Analysis, Modeling, and Simulation</li>\n</ul>\n\n<div>Our engineers have\n<br>\nexpertise in research, design, analysis, modeling and simulation, lab\n<br>\nexperimentation, field testing, and implementation of networks across a diverse\n<br>\nset of networked communication environments including virtual, wired, and\n<br>\nwireless. We are adept at combining networking research and innovation with\n<br>\npractical hands-on experience to provide risk reduction and deployable\n<br>\nsolutions for our customers.</div>\n<br>Our lab facilities in McLean, VA are equipped to meet the requirements of\n<br>\nprojects at any scale. The lab is furnished with state-of-the-art carrier\n<br>\ngrade LTE infrastructure, commercial routers and switches, accelerators,\n<br>\ncryptographic devices, networking test equipment (e.g. Ixia, BreakingPoint),\n<br>\nvirtualization environments, network and data center management tools, IoT and ICS devices, military\n<br>\nradios, modeling and simulation software and custom network emulation and\n<br>\nwireless network planning products. There is an additional lab facility at the\n<br>\nMITRE San Diego site with targeted capabilities and connectivity to the lab in\n<br>\nMcLean and other MITRE locations.\n<br><br>\nWe are seeking a driven\n<br>\nand experienced lead networking engineer with an applied research mindset and a\n<br>\nbalance of hands-on technical, project management and business development\n<br>\nskills. The ideal candidate will have deep subject matter expertise in\n<br>\nnetworking protocols and technologies with insights to understand and translate\n<br>\ncustomer challenges into actionable, impactful outcomes in support of the\n<br>\ncustomer’s mission. Once hired, the candidate will be expected to lead\n<br>\none or more large-scale, complex networking-related projects.\n<br><br>\nKey Functions:\n<br><br>\nSpecific duties will\n<br>\nvary by project but will generally include a combination of research, design,\n<br>\nanalysis, testing, experimentation, and/or modeling and simulation of to\n<br>\naddress complex questions regarding security, design, and performance of\n<br>\ncommunications networks that are faced by MITRE’s customers.\n<br><br>\nAs the government’s\n<br>\nnot-for-profit, trusted, unbiased advisor, MITRE performs advanced networking\n<br>\nresearch that is very different from operational networking support. Our\n<br>\nwork does not involve administering, operating, troubleshooting, or otherwise\n<br>\nmaintaining a production network.\n<br><br>\nExample functions of\n<br>\ntechnical leaders in our organization are below:\n<ul>\n<li>Perform systems engineering, design, analysis, and experimentation\n<br>\nof networks.</li><li>Serve as a thought leader in advanced networking concepts through\n<br>\npublication in technical journals, conferences, external exhibitions, standards\n<br>\nbodies, panels, patent applications, etc.</li><li>Willingness to mentor early career staff, contributing to their\n<br>\ndevelopment technically and professionally.</li><li>Develop technical research ideas and craft proposals for research\n<br>\ninitiatives.</li><li>Engage with customers to analyze operational requirements, address\n<br>\nnetworking challenges, apply sound technology solutions, and advance the state\n<br>\nof networking to benefit the sponsor mission.</li><li>Design and analyze complex networks to align with requirements.</li><li>Evaluate, validate, integrate, and design new protocols and\n<br>\ntechnologies to meet sponsors missions.</li><li>Lead red-team efforts to uncover the root cause of performance\n<br>\nissues in complex operational environments.</li><li>Rapid lab prototyping, field testing, technical benchmarking, and\n<br>\nmodeling and simulation.</li><li>Develop additional project opportunities to expand the technical\n<br>\nwork portfolio of the organization.</li> </ul></div><br>\n\n<div>\n<div><strong>Minimum Qualifications:</strong></div><div>\n\n<ul>\n<li>Bachelor’s Degree and 8+ years of experience in network research and engineering.</li><li>Applicants selected for this position will be subject to a government security investigation and must meet eligibility requirements for access to classified information.</li>\n</ul>\n\n<div><strong>Required Qualifications:</strong></div></div><div>\n\n<ul>\n<li>Obtain and maintain a Secret level security clearance</li><li>Deep understanding in the theory and implementation of network routing and transport protocols, systems, and standards with the ability to derive operational implications (implementation, interoperability, performance, security).</li><li>Knowledge of network security standards and architectures, including Multi-Level Security issues and solutions.</li><li>Demonstrated hands-on skills in a lab environment for rapid prototyping and testing.</li><li>Familiarity with network performance testing, measurement, and analysis techniques and tools.</li><li>Demonstrated thought leadership and customer engagement skills.</li><li>Excellent written and verbal communication and presentation skills.</li><li>Desire to grow and foster relationships and collaborative opportunities with academia and industry.</li><li>Passionate about staying up-to-date with emerging technologies through continued learning, active engagement with academia and industry, and a desire to remain hands-on.</li><li>Willingness to mentor early career staff, contributing to their development technically and professionally.</li> \n</ul>\n\n<div><strong>Preferred Qualifications:</strong></div></div><div>\n\n<ul>\n<li>MS or PhD in Computer Science or Electrical Engineering and 15+ years of experience in network research and engineering.</li><li>Active TS/SCI Clearance.</li>\n</ul>\n\n<div><strong>Experience in one or more of the following areas:</strong></div></div><div>\n\n<ul>\n\n<li>\nTactical or commercial wireless protocols, networks, systems, and standards derivation of operational implications (implementation, interoperability, performance, security)</li><li>Industrial control systems (ICS) design, deployment, and operations, with emphasis in ICS communication protocols, architecture design, data management, and security.</li><li>Network time synchronization protocols, time-dependent applications, and precise measurement of time intervals.</li><li>Global Positioning System (GPS) fundamentals, synchronous networks, frequency standards, and counters.</li><li>Embedded system programming, including Linux kernel/module development, IP packet processing, or TCP/UDP/IP sockets programming.</li></ul></div>\n</div>\n</div>\n</div>\n </div>\n </div>\n</div>\n<br>"}