{"job title": "Database Administrator", "company": "Peraton", "city state": "– US-VA-Herndon", "rating": "3.2", "job description": "<div><div>\n<div>We are seeking a SQL Server Database Administrator at our HQ office in Herndon, VA.</div>\n</div>\n</div>\n\n<br>Responsibilities<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li>Demonstrate extensive knowledge of all aspects Microsoft SQL Server including administration, replication, backup/restore procedures and related components such as Reporting Services, Analysis Services and Integration Services.</li> <li>Install, configure, monitor and maintain databases in the production, development, and quality assurance environments.</li><li>Recommend and implement solutions for SQL performance monitoring and tuning.</li><li>Assist with Windows Server configuration and management as it relates to MS SQL Server installation and performance.</li><li>Understand SAN based storage and related technologies, specifically as applicable and useful to MS SQL Server installations.</li><li>Process database change requests, including the creation and modification of databases, tables, views, stored procedures, triggers, jobs, etc. in accordance with change control policies.</li><li>Analyze problems, anticipate future problem areas and implement solutions.</li><li>Work outside of normal business hours as required for completing projects, working on deployments and resolving system outages.</li></ul></div>\n</div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div><strong>REQUIRED:</strong>\n<ul>\n<li>5 years of experience with Microsoft SQL Server 2008 / 2012 / 2014 supporting high traffic websites.</li><li>Experience with the implementation and support of database replication.</li><li>Experience working with very large databases.</li><li>Understanding of Windows Server (2008 R2/2012 R2) configuration and management, specifically as it relates to MS SQL Server installations and mission critical systems.</li><li>Excellent understanding of coding with Microsoft T-SQL and stored procedures.</li><li>Experience with SANs (NetApp/EMC), specifically with aspects related to MS SQL Server.</li><li>Understands and is able to properly implement backup and disaster recovery procedures.</li><li>Excellent work ethic and willingness to put in significant extra time as needed.</li><li>Experience with PowerShell scripting, TFS/Visual Studio Database Projects and SSDT is a plus.</li></ul></div>\n</div>\n</div>\n\n<br>About Peraton<br>\n\n<div>\n<div>\n<div>Peraton provides innovative, reliable solutions to the nation’s most sensitive and mission-critical programs and systems. Peraton has significant experience providing highly differentiated secure communications, space, and technology solutions to key customers, and has become a trusted partner on missions that are critical to the security priorities of the United States. Capabilities include complex software and technology services and solutions, as well as end-to-end mission operations abilities, including Software Systems Development, Cyber, Modeling &amp; Simulation, Mission Operations, Signal Intelligence (SIGINT), and Quick Reaction Capabilities (QRC) / Research &amp; Development. The company is headquartered in Herndon, VA, with approximately 3,500 employees across the U.S. and Canada.</div>\n</div>\n</div>\n\n<br>EEO Statement<br>\n\n<div>\n<div>\n<div><em>We are an Equal Opportunity/Affirmative Action Employer. We consider applicants without regard to race, color, religion, age, national origin, ancestry, ethnicity, gender, gender identity, gender expression, sexual orientation, marital status, veteran status, disability, genetic information, citizenship status, or membership in any other group protected by federal, state, or local law.</em></div>\n</div>\n</div>\n<br>"}