{"job title": "Electrical Engineer -- Project Lead", "company": "Sargent Lundy", "city state": "– Santa Ana, CA", "rating": "3.3", "job description": "Sargent &amp; Lundy provides comprehensive consulting, engineering, design, and analysis for electric power generation and power delivery projects worldwide. With a highly experienced staff solely dedicated to the energy business, we have the ability and know-how to take on the smallest tasks as well as the largest projects.\n<br><br>\n<strong>Our Core Values</strong>\n<br>\nWe are a company of principled professionals guided by core values that have fundamentally shaped our business practices and culture. They provide us with guidance in the day-to-day performance of our work, and adherence to these values is our compass in all business conduct:\n<ul>\n<li>Exercise uncompromising integrity and ethics in the conduct of all business</li><li>Focus on client satisfaction in all activities</li><li>Maintain a highly competent and satisfied staff</li><li>Communicate openly and honestly</li><li>Improve continuously</li>\n</ul>\nDue to continued growth, our Power Delivery Services business unit currently has a new opportunity for a Protection and Controls Engineering Project Lead in its Pomona, California office.\n<ul>\n<li>This position will offer you the ability to directly apply your knowledge of protective relaying and controls systems for HV and EHV substations. As a Project Lead of an engineering and design team, you will work on a wide range of substation modifications and upgrades to support client requirements and reviews including creating calculations, document designs, and specifications.</li> <li>You will be responsible for preparing relaying philosophies, including selecting relay, control, and communications equipment, developing SCADA and telecommunication concepts and configurations, and overseeing the preparation of I/O assignments and connection diagrams.</li> <li>As the Protection and Controls Engineering Project Lead, you will be responsible for guiding junior and senior-level engineers and designers in protection and controls engineering design efforts, including providing guidance with the coordination of detailed design phases for all aspects of the engineering work.</li><li>You will work on challenging assignments that include investigating, trouble-shooting, and solving a wide variety of engineering issues.</li><li>You will perform analysis and design of single line diagrams, substation relaying &amp; metering diagrams (i.e. A.C. schematic diagrams), and D.C. Schematic diagrams.</li><li>Prepare engineering studies for client and peer review.</li><li>Perform independent reviews of work performed by others including calculations and drawing preparation.</li><li>Coordinate and provide guidance to other engineers, project managers, client personnel, and suppliers to ensure a complete and timely design.</li> <li>Perform reviews of existing facilities to propose upgrades and replacements, and present findings and recommendations to clients and peers.</li><li>Develop your career via peer-learning through sharing of knowledge with other experienced engineers by way of Sargent &amp; Lundy’s systems of process and associated “Communities of Practice.”</li> <li>Provide guidance as a mentor in the development of less experienced engineers.</li><li>There is the potential for you to travel to client and vendor offices for design reviews and to plant site locations for construction coordination and field verification of designs.</li>\n</ul>\nDependent upon your location, this opportunity offers a generous relocation package.\n<br><br>\nEssential skills and experience:\n<ul>\n<li>This position requires a BSEE with a power systems or controls emphasis from an ABET-accredited engineering program</li><li>10 or more years experience with a focus on protection / control / telecommunications for high voltage substations; including design, installation, and coordination.</li><li>PE license.</li> <li>Experience with serving as firm/client liaison in a support or lead engineering role.</li><li>Experience in writing and providing support documentation for relay calculations.</li><li>Experience with the design techniques, tools, and principles involved in the production of technical plans, blueprints, drawings, and models.</li><li>Proficiency with any of the following programs: SKM, ETAP, ASPEN, CDEGS, or vendor software.</li><li>Familiarity with design codes and standards, such as NEC, NESC, NEMA, IEEE and ANSI.</li> <li>Experience with various vendor protective relay equipment typically used in substation protection, including SEL, ABB, GE, Areva, and Basler.</li><li>Proficiency with MS Office applications.</li> <li>Excellent written and verbal communication skills.</li>\n</ul>\nValued but not required skills and experience:\n<ul>\n<li>Prior experience is desirable to include in-line, bus and equipment protection, breaker, transformer and similar equipment control, RTU and data concentrator based SCADA systems, telemetering and communications (fiber optics, microwave, power line carrier, etc.).</li><li>AutoCAD or MicroStation experience.</li><li>Construction and start-up experience.</li><li>Testing or commissioning experience.</li>\n</ul>\nSargent &amp; Lundy is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any protected status as defined by law.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}