{"job title": "Sr Systems Engineer", "company": "Summit Technical Solutions", "city state": "– Colorado Springs, US-CO", "rating": "3.8", "job description": "Are you a <strong>problem solver</strong>?\n<br><br>\nDo you strive to make a <strong>positive difference</strong>?\n<br><br>\nDo you enjoy being a contributor to a <strong>world class team</strong>?\n<br><br>\nSummit Technical Solutions (STS) is seeking a Senior Systems Engineer to provide enterprise knowledge and technical skills support on the Command Information Management Systems (CIMS III) contract in Colorado Springs, CO.\n<br><br>\nProvide enterprise knowledge and technical skills to implement technical strategies, evaluate products and provide a superior level of technical support. Provide leadership support in the development, documentation and maintenance/management of operations concepts, requirements (system, element, segment, or subsystem level), external and internal interfaces, and other systems engineering work products/artifacts. Perform configuration management and release engineering tasks to ensure changes to the baseline are documented, comply with standard configurations, and are logistically sustainable. Design, develop, automate, and maintain productivity tools using programming, database or scripting languages. Develop configuration standards and policies for program-wide use. Work under consultative direction towards predetermined long-range goals and objectives. Work checked through consultation and agreement with others rather than by formal review of superior. Apply advanced technical principles, techniques, theories and concepts. Contribute to the development of new principles and theories. Work on unusually complex technical problems and provides highly innovative solutions.\n<br><br>\nJob duties include, but are not limited to:\n\n<ul>\n<li>Requirements analysis/definition/management.</li>\n\n<li>Functional analysis, performance analysis.</li>\n\n<li>System design, trade studies, systems integration and test (verification) of all software.</li>\n\n<li>Perform interface definition studies of system components and products under direct supervision.</li>\n\n<li>Support the generation of technical engineering products by using the appropriate standards, processes, procedures, and tools through the integration, test, readiness and operations life cycle.</li>\n\n<li>Develop concept of operations, design, and implementation plans.</li>\n\n<li>Provide support in the areas of technology enhancements and graphics support.</li>\n\n<li>Identify and recommend the latest technologies.</li>\n\n<li>Webhosting, design, posting, re-engineering.</li>\n\n<li>Assist in the management of all specification and software baseline data (classified and unclassified), provide the baseline for modification and efforts, support major milestone reviews (e.g. PDR, CDR, FCA/PCA), and ensure all data is updated as approved.</li>\n\n<li>Support audits to verify that requirements of all baselines have been met by the as-built software.</li>\n</ul>\n\n<strong>Required Skills</strong>\n<br><br>\nRequired Experience<br><br>Qualified candidates will have the following experience and qualifications:\n\n<ul>\n<li>Bachelor's degree in related technical field and 8+ years of related experience; OR Master's degree and 5+ years of experience</li>\n\n<li>Security+ CE or equivalent IAT Level II certification</li>\n\n<li>Experience designing and developing custom workflows and customer forms.</li>\n\n<li>Current Secret clearance</li>\n</ul>\n<strong>What makes STS great?</strong>\n<br><br>\nSTS is a services-based organization that relies on the exceptional results our workforce delivers to customers every day. We realize that our customers’ high regard for our consistently high performance is only possible because of the talents, exceptional work ethic, and commitment of our people. We promote and live by a strong and inclusive company culture that places the focus on customer and employee satisfaction, communication, and respect.\n<br><br>\n<strong>What to expect from STS:</strong>\n\n<ul>\n<li>Competitive total compensation plan, with immediate eligibility for most benefits and a 401(k) plan with matching contributions!</li>\n\n<li>A work environment that emphasizes the safety of our workforce</li>\n\n<li>An organization that is committed to upholding the highest level of business ethics and workplace conduct</li>\n\n<li>A company that supports \"paying it forward\" with involvement in several deserving organizations and encourages volunteerism in the employee's community</li>\n\n<li>Generous paid time-off program that starts on the first day of employment!</li>\n\n<li>Tuition and certification cost reimbursement programs for qualifying employees</li>\n</ul>\nSTS is actively committed to employment of Veterans, whom we regard as one of our Nation’s greatest resources. Today, you will find Veterans at every level of our organization, continuing their service to our country by supporting our government contracts and customers. STS is proud of their dedication, work ethic, loyalty, and commitment to duty, and we will continue to promote career opportunities for Veterans who are sincerely deserving of our appreciation.\n<br><br>\n<em>We are an affirmative action/equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, gender identity, sexual orientation or any other characteristic protected by law.</em><br><br>Job Location\n<br>\nColorado Springs, US-CO\n<br>"}