{"job title": "Data Analytics Oracle Developer (OBIEE, Discoverer) - 14884", "company": "The Syllogisteks Company", "city state": "– Eureka, MO", "rating": "4.1", "job description": "<u><strong>Primary Responsibility:</strong> </u>\n<br><br>\nThis position is responsible for medium to high complexity data modeling, mining, and warehouse initiatives. In addition, this position utilizes business and industry knowledge to obtain business requirements from end users, design solutions, and document and communicate the solution for both business and technical audiences in Discoverer, OBIEE, and XML publisher. Additionally, the individual will assist in supporting the daily operation of Oracle E-Business Suite 12.1.\n<br><br>\n<u><strong>Duties &amp; Responsibilities:</strong> </u><br><br><u> <li>Acts as data tech lead on data centric projects. Works on multiple concurrent projects guiding a team of architects. Works in a consultative manner with end users to gather modeling requirements, define modeling needs, design solutions, recommend proper analytical methodologies, and execute projects.</li> <li>Develops statistical models, data-driven analyses, and relational, informational and operational models from start to finish.</li> <li>Utilizes complex data mining techniques and queries to gather business intelligence in regard to data acquisitions and conversions to support the organization's business and growth initiatives.</li> <li>Have a working knowledge of over-all architecture of software applications and the systems on which those applications run.</li> <li>Assist business analysts in defining new application requirements and updates to existing applications by extracting logic and data needed for their analysis.</li> <li>Design new application architectures and make application design modifications based on functional requirements.</li> <li>Support Oracle with PL/SQL and forms development.</li> <li>Provide software-related cost/benefit tradeoff analysis to management.</li> <li>Implement new software architectures and applications based on industry and organization best practices.</li> <li>Watch for opportunities and make recommendation for improvements to existing applications and architectures.</li> <li>Monitor technologies relevant to the applications and systems in use by the company and make recommendations to management regarding possible options to improve performance and/or ROI.</li> <li>Provide mentoring/training/advice to Software Engineers/Programmers.</li> <li>Support production operations on a daily basis.</li> <li>Assist in evaluation of potential employment candidates.</li>\n<u><strong>Minimum Qualifications</strong></u>\n<br><br>\n<strong>Required Technical Proficiencies:</strong><br><br><u> <li>Strong knowledge of PL/SQL, SQL</li> <li>Solid knowledge of logical/physical models for data warehouse</li> <li>Oracle Applications: E-Business Suite Management/Customization/API Programming</li> <li>Oracle Forms and Reports development/modification/support</li> <li>Knowledge and implementation experience in Oracle Financials, Manufacturing, Inventory &amp; Order Management</li> <li>Experience with ETL and Dimensional Modeling (Star Schema)</li> <li>Proficient in Analysis and Problem Solving skills</li>\n<strong>Preferred Technical Proficiencies:</strong>\n<ul>\n <li>Programming languages: Visual Basic, VB.NET, Java</li> <li>Office Applications: MS Office (Word, Access, Excel, PowerPoint, Outlook), Lotus Notes</li>\n</ul>\n<u><strong>Knowledge/Skills/Abilities</strong></u><br><br><u> \n<li>Strong project management skills with a demonstrated ability to manage projects from inception through completion. Ability to work independently on and lead projects, distribute work to team members and manage multiple priorities/deadlines.</li>\n  \n<li>Strong interpersonal skills and written and verbal communication skills are needed to effectively collaborate and communicate with team members, business users, database administrators, project leaders, developers and managers.</li>\n  \n<li>Self-motivation to accomplish assigned objectives and pursue options that will benefit the company.</li>\n  \n<li>Bachelor's degree in Computer Science degree or related field or equivalent combination of industry related professional experience and education</li>\n  \n<li>Experience in building and scaling Business Intelligence and Data Warehousing solutions</li>\n  \n<li>Proficiency in data modeling, integration technologies and business intelligence platform such as Discoverer and OBIEE and familiar with Data Visualizations tools.</li>\n  \n<li>Numerical / analytical abilities.</li>\n  \n<li>Capability to grasp \"big picture\" down to minute details of systems/software.</li>\n  \n<li>Flexibility to effectively switch between support of production environment and development projects.</li>\n  \n<li>Solid understanding of object-oriented programming and business rule management systems.</li>\n<u><strong>Education/Experience</strong></u>\n<ul>\n \n<li>Bachelor's Degree with 10 years of IT or business/industry work experience.</li>\n  \n<li>Minimum 5 years of experience in data analytics, data mining, data visualization or data management.</li>\n </ul> </u>\n<br>\n</u></u>"}