{"job title": "Firmware Design Engineer", "company": "Valtronic Technologies (Suisse) SA", "city state": "– Solon, OH", "rating": "3.6", "job description": "The Firmware Design Engineer will be involved in all aspects of the firmware development life cycle: concept development and feasibility assessment, firmware architecture and design, writing test protocols, verification on prototype hardware, and documentation. Broad experience in microprocessors, embedded operating systems, wireless technologies such as Bluetooth or MICS, data acquisition and processing is required. Previous experience in firmware design and testing for Class II and III medical devices under IEC 62304 guidelines is highly desirable.\n<br><br>\n<strong>Essential Functions:</strong>\n<br><br>\nKey responsibilities will include, but are not limited to:\n<br><br>\n· \n<br>\nAssist in the generation of proposals for feasibility, development, and verification\n<br><br>\n· \n<br>\nParticipate in the development of system architecture and detailed electrical design to meet customer requirements.\n<br><br>\n· \n<br>\nDocumentation of firmware requirements and architecture, block diagramming of code\n<br><br>\n· \n<br>\nEstimation and scheduling of firmware tasks\n<br><br>\n· \n<br>\nWriting firmware functions in a well-documented, modular style with debug capability and proper error handling\n<br><br>\n· \n<br>\nConfiguration of u-boot for loading an OS onto a 32-bit microcontroller from FLASH\n<br><br>\n· \n<br>\nConfiguration of the OS Kernel Device Tree\n<br><br>\n· \n<br>\nDevelopment or configuration of software drivers for communication protocols (USB, BLE, I2C, SPI, UART, etc.)\n<br><br>\n· \n<br>\nWriting interrupt service routines and configuration of an RTOS to meet latency requirements\n<br><br>\n· \n<br>\nSolid understanding of TCP/IP protocol layers and experience working with common MAC/PHY devices\n<br><br>\n· \n<br>\nWorking knowledge of scripting languages such as Python, BASH, or Perl\n<br><br>\n· \n<br>\nWriting build scripts\n<br><br>\n· \n<br>\nWorking knowledge of development environments such as MPLAB, Gnu tools\n<br><br>\n· \n<br>\nTroubleshooting experience with logic analyzers, oscilloscopes, microprocessor debuggers, communication protocol analyzers\n<br><br>\n· \n<br>\nExperience writing “bare metal” firmware for 8 and 16-bit microcontrollers.\n<br><br>\n· \n<br>\nAbility to understand electrical schematics for digital systems\n<br><br>\n· \n<br>\nAssist in the failure mode analysis of the hardware/firmware device.\n<br><br>\n· \n<br>\nParticipation in design reviews\n<br><br>\n· \n<br>\nCollaborate effectively with other engineers, sales, quality, purchasing, mechanical, system test, and manufacturing departments to assist in manufacturing transfer efforts.\n<br><br>\n·\n<br>\n<strong>Access software</strong> — Citrix software\n<br><br>\n·\n<br>\n<strong>Administration software</strong> — Cisco Systems CiscoWorks\n<br><br>\n·\n<br>\n<strong>Business intelligence and data analysis software</strong> — IBM Cognos Business Intelligence\n<br><br>\n·\n<br>\n<strong>Calendar and scheduling software</strong> — Scheduling software\n<br><br>\n·\n<br>\n<strong>Computer aided design CAD software</strong>\n<br><br>\n— Autodesk AutoCAD\n<br><br>\n·\n<br>\n<strong>Data base management system software</strong> — Apache Cassandra\n<br><br>\n; Apache Pig\n<br><br>\n·\n<br>\n<strong>Data base reporting software</strong> — SAP BusinessObjects Crystal Reports\n<br><br>\n<strong>Education and Skills</strong>\n<br><br>\nBachelor or Master’s Degree in Electrical Engineering, Software Engineering or Computer Science with 5+ years of relevant work experience with embedded firmware design for 32-bit microcontrollers. Experience should include embedding operating systems such as Linux, developing software drivers for peripherals, and troubleshooting communications protocols such as Gigabit Ethernet, USB, Bluetooth, I2C, and SPI. Previous experience under ISO 62304 and FDA design controls is highly desirable"}