{"job title": "Data Engineer", "company": "VanderHouwen", "city state": "– Portland, Oregon", "rating": "4.1", "job description": "<div>Job ID: 37085</div>\n<br><strong>Data Engineer</strong>\n<br><br>\nThe Data Engineer is a member of the Enterprise Information Management team and is responsible for the design, development, testing, maintenance, and support of our client’s enterprise data assets.\n<br><br>\nThe Data Engineer will be dedicated to a single scrum team, providing technical design, development and analytical support for the companies Enterprise Data and Analytics program. The successful candidate will have a deep understanding of complex organizational analytical and data needs to enable improvements in environment design, efficiency, controls and the overall user experience of enterprise data assets. This resource will lead activities that include: dimensional modeling, package creation, SQL script creation, stored procedure development, data lake and data warehouse development, integration services support and more. In addition to working closely the Enterprise Information Management team, the Data Engineer will also coordinate frequently with senior leadership, several enterprise support organizations and end users.\n<br><br>\nThe Data Engineer will possess strong communication skills and demonstrate an ability to work with all ranges of an organization to advance the company’s vision for information management and analytics. The Data Engineer will bring demonstrated capabilities in business intelligence design, development and implementation, drawn from previous experience working on BI programs. He or she should be highly conversant in the culture and changing landscape of information technology. This professional should also present superior interpersonal and collaboration skills; a keen sense of creativity and intellectual curiosity; and the ability to deliver with the support of a small scrum team.\n<br><br>\n<strong>Data Engineer Responsibilities</strong>\n<br><br>\nContinuously deliver and improve prioritized enterprise data assets that enable the growth of global analytics, reporting and visualization solutions.\n<br><br>\nDesign, build, test and maintain data integration, ETL processes and data management delivery within an global data lake and data warehouse environment.\n<br><br>\nIdentify project risks and impediments, notify management, and proactively work with other members of the team to complete assigned tasks as defined by project scope, timelines, and budgets.\n<br><br>\nIdentify data quality issues and support data governance initiative by participating in necessary activities including data profiling.\n<br><br>\nParticipate in the use of Agile practices to elicit and refine requirements through an iterative process of planning, defining acceptance criteria, prioritizing, developing and delivering enterprise data asset solutions.\n<br><br>\n<strong>Data Engineer Qualifications</strong>\n<br><br>\nBachelor’s Degree required Computer Science, Information Systems or a related field. An equivalent combination of education and experience may be considered.\n<br><br>\n5+ years of hands-on experience architecting, developing and/or managing the implementation of Business Intelligence solutions.\n<br><br>\nExpert in SQL and query optimization for data platforms such as Azure SQL DW, HDInsight, Teradata, SAP BW/HANA.\n<br><br>\nExpert in database concepts, including normalization, indexing, physical and logical modeling, creation of SQL queries and performance tuning.\n<br><br>\nFamiliarity with the Kimball methods of data warehousing techniques, standards and best practices.\n<br><br>\n2+ years’ experience with programming languages (e.g. Python, C#, JavaScript, DAX, R, .NET or Java) and visualization frameworks such as D3.js preferred.\n<br><br>\nExperience with large scale data processing, data structure optimization and scalability of algorithms a plus.\n<br><br>\nSound judgment and decision-making, and the appropriate sense of urgency and is a self-starter.\n<br><br>\nExperience with Microsoft Azure: Data factory, data lake and data warehouse a bonus.<br><br>Benefits\n<br><br>\nBenefits are available to eligible VanderHouwen contractors and include coverage for medical, dental, vision, life insurance, short and long term disability, and matching 401k.\n<br><br>\nAbout VanderHouwen\n<br><br>\nVanderHouwen is an award-winning, Women-Owned, WBENC certified professional staffing firm. Founded in 1987, VanderHouwen has been successfully placing experienced professionals throughout the Pacific Northwest and nationwide. Our recruitment teams are highly specialized in either Technology and IT, Engineering, or Accounting and Finance career markets. Our recruiters value building meaningful, professional relationships with each candidate as well as developing honed knowledge of companies' staffing needs and workplaces. Partner with us to land your next exciting career.\n<br><br>\n#VHDi"}