{"job title": "Sr. Software Engineer-Ruby on Rails Developer (VitalSource)", "company": "VitalSource Technologies", "city state": "– Raleigh, NC", "rating": "4.1", "job description": "<strong>Posting Title</strong>\n<br>\nSr. Software Engineer-Ruby on Rails Developer (VitalSource)\n<br><br>\n14-Jun-2018\n<br><br>\n<strong>Job Description</strong>\n<br>\nDo you love to learn new technologies and have a passion for technology focused on education? <strong>VitalSource®,</strong> an <strong>Ingram Content Group Company</strong>, is the preferred and most used e-textbook platform in higher education today. We are looking for the next generation of high-aptitude and competitive Software Engineers to join our Raleigh team.\n<br><br>\nAs a <strong>Senior Software Engineer</strong> <strong>(Ruby on Rails Developer)</strong> for our <strong>VitalSource Technologies (VST)</strong> team in Raleigh, NC, you would be able to enhance and build e-commerce solutions for students and instructors around the world and play a part in leading this booming revolution in the educational technology industry!\n<br><br>\nThis role will build and maintain global, high-scale business-critical applications and API’s which are core components of the VitalSource® e-textbook platform.\n<br><br>\n<strong>What We Offer:</strong>\n\n<ul>\n<li>An opportunity to be part of dynamic, continually growing company where your contributions make a real difference and new ideas are always welcome<strong>.</strong> </li><li>Amazingly smart and dedicated teammates, Senior Software Engineer mentors to collaborate with, and a management team invested in your success at <strong>VitalSource</strong>.</li> <li>A competitive compensation package with generous benefits</li><li>A fantastic HQ location in beautiful, historic downtown <strong>Raleigh, NC</strong> with an entrepreneurial “start-up” environment vibe and the talent to match!</li><li>Job security, career growth, and enterprise operational support from <strong>Ingram Content Group LLC</strong>, one of the world's largest and most trusted distributors of physical and digital content.</li><li>An experience to develop high volume global transactions that have a massive positive impact on students, classrooms, and institutions of higher learning</li> \n</ul>\n\n<strong>Main Responsibilities for Success:</strong>\n\n<ul>\n<li>Work in a team environment developing solutions for our core products and platforms</li><li>Develop creative and innovative solutions for the next generation of educational learning products</li><li>Develop and modify internal and external facing software as part of an Agile/SCRUM team.</li><li>Provide full application development life cycle service, including research, prototypes, development, and support.</li><li>Communicate effectively with SCRUM team members and other Product Managers and Engineering Staff.</li> \n</ul>\n\n<div>The world is reading and <strong>Ingram Content Group</strong> (“Ingram”) connects people with content in all forms. Providing comprehensive services for publishers, retailers, libraries and educators, Ingram makes these services seamless and accessible through technology, innovation and creativity. With an expansive global network of offices and facilities, Ingram’s services include digital and physical book distribution, print-on-demand, and digital learning. Ingram Content Group is a part of Ingram Industries Inc. and includes Ingram Book Group LLC, Ingram Publisher Services LLC, Lightning Source LLC, VitalSource Technologies LLC, Ingram Library Services LLC, and Tennessee Book Company LLC.\n<br><br>\n<strong>VitalSource Technologies LLC</strong>, part of Ingram Content Group LLC, is improving the learning experience by making it easier to create and deliver effective and affordable content. The preferred choice among educational institutions and companies for digital learning materials, VitalSource® helps over 1,000 educational content providers create and deliver seamless interactive learning experiences through its exclusive Bookshelf® platform to millions of learners at 7,000 institutions. Bookshelf users opened more than 20 million digital textbooks last year and read more than 3.4 billion pages. For more information about VitalSource, visit https://get.vitalsource.com/. #dicepost\n<br><br>\n<em>Ingram Content Group LLC is an affirmative action/equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, work related mental or physical disability, veteran status, sexual orientation, gender identity, or genetic information.</em>\n<br><br>\n<em>EEO/AA Employer/Vet/Disabled</em>\n<br>\n<em>We participate in EVerify.</em>\n<br>\n<em>EEO Poster in English</em>\n<br>\n<em>EEO Poster in Spanish</em></div> \n\n<br><strong>Auto req ID</strong>\n<br>\n<strong>4895BR</strong>\n<br><br>\n<strong>Preferred Qualifications</strong>\n<br>\n<strong>We’ll be excited to hear about your previous and current projects in areas such as:</strong>\n\n<ul>\n<li>Full-stack web development in Ruby on Rails, React, MySQL and Linux</li><li>Experience building e-commerce web applications</li><li>Experience with large-scale web applications</li><li>Experience integrating with 3rd party systems via APIs</li><li>Experience with HTML, CSS, JavaScript, Ajax, etc.</li><li>Deploying apps using Docker</li><li>Experience with cloud-based environments</li><li>Experience with relational database (MySQL) design and development</li><li>Experience with Agile/SCRUM development environments</li>\n</ul>\n\n<strong>Minimum Qualifications</strong>\n<br>\n<strong>We would like our talented associate for this role to have at least these minimum skills &amp; experience:</strong>\n\n<ul>\n<li>Bachelor’s Degree OR related year for year experience</li><li>6+ years of experience with a modern web development language</li><li>3 years of software development experience with Ruby on Rails (which can include school experience, internships, externships, or post graduate projects)</li>\n</ul>\n\n<strong>State</strong>\n<br>\nNorth Carolina\n<br><br>\n<strong>Country</strong>\n<br>\nUnited States\n<br><br>\n<strong>City</strong>\n<br>\nRaleigh\n<br>"}