{"job title": "Marketing Data Scientist", "company": "CyberCoders", "city state": "– Union City, CA", "rating": "3.9", "job description": "Marketing Data Scientist <div>\nIf you are a Marketing Analytics Scientist with experience, please read on!</div>\n<br>\nTop Reasons to Work with Us<div>\nWe are an online pet goods retailer committed to promoting healthy pets and healthier pet-owner relationships! Having been around since the new millennium we are focused on growth and capturing market share!</div>\n<br>\nWhat You Will Be Doing<div>\nMonitor KPIs using web reporting tools in order to optimize marketing efforts and measurements.\n<br>\nUse analytics to create actionable recommendations for the marketing team.\n<br>\nPerform short-term and ad-hoc analyses.\n<br>\nActively be involved in the design, set up, and evaluation of A/B testing procedures.\n<br>\nCreate and maintain the distribution of web analytics reports to provide insights to support senior management with decision making.</div>\n<br>\nWhat You Need for this Position<div>\n<strong>Experience and knowledge of:</strong>\n\n\n<ul>\n<li>Omniture</li>\n<li>Google Analytics</li>\n<li>A/B Testing</li>\n<li>Web Analytics</li>\n<li>Marketing</li>\n<li>Finance</li>\n<li>Statistics</li>\n<li>Multivariate Testing</li>\n<li>Data Science</li></ul></div>\n\n\nWhat's In It for You<div>\nCompetitive compensation including benefits.\n<br>\nVeterinarian discounts.\n<br>\nBring your pet to work days.\n<br>\nLarge and furnished game/break rooms.\n<br>\nHigh tech working environment.</div>\n<br>\n<div>\nSo, if you are a Marketing Data Scientist with experience, please apply today!</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}