{"job title": "Senior Data Scientist", "company": "ESRI", "city state": "– Redlands, CA", "rating": "3.7", "job description": "Machine learning is the top focus of almost every technology company--from the Silicon Valley to New York to around the world. What makes this type of technology so powerful? Context. Focusing on the where allows us to make sense of our businesses, lives, and world, whether that’s through automating portions of workflows to save companies millions of dollars or predicting life-altering events.\n<br><br>\nWe are looking for talented machine learning engineers to help build industry-leading predictive geospatial solutions for our customers in 160+ countries. We need a data scientist who is an individually driven, passionate professional to help us create machine learning best practices, not only within Esri but also for the broader GIS community. This game-changing opportunity requires someone with strong hands-on, proven experience with statistical analysis, machine learning, predictive analytics, and software engineering.\n<br><br>\nIf you are passionate about changing the world, literally, through machine learning you are in the right place. <strong>Where</strong> will you leave your mark?\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li><strong>Identify and solve problems.</strong> Apply data mining and machine learning techniques, perform statistical analysis, and build high-quality prediction systems that solve our customers' business problems. Explore, interpret, and analyze datasets for patterns of interest.</li><li><strong>Understand our customers.</strong> Work closely with various teams to understand our customers’ needs, eventually crafting and pitching machine learning use cases to them.</li><li><strong>Deliver results.</strong> Model business problems to supervised/unsupervised learning algorithms, map business data to features, perform proper feature engineering, iterate with different models, and conduct hyper parameter optimization to yield highest model performance.</li><li><strong>Impact change.</strong> Help build the data science and machine learning capability inside Esri by developing best practices and patterns for geospatial machine learning, developing reusable technical components for demos and POCs, and identifying and helping establish the needed technology stack and infrastructure. Keep up-to-date with latest technology trends in machine and deep learning and quickly learn about new frameworks/techniques to be used in projects delivery.</li></ul>\n\n<ul>\n<li>4+ years of practical machine learning experience</li><li>Deep understanding of machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision Forests, etc.</li><li>Experience with deep learning techniques, mainly CNNs and RNNs (GANs and RL experience is a plus)</li><li>Experience with spatial data and/or GIS</li><li>Experience in at least one of these toolkits: R, Weka, SciKitl-learn, MATLAB</li><li>Familiarity with machine learning frameworks/libraries/packages/APIs (e.g., Theano, Spark MLlib, H2O, TensorFlow, PyTorch, etc.)</li><li>Proven experience in ETL, data processing, transformation, cleaning, and data warehousing techniques</li><li>Experience with applied statistics skills, such as distributions, statistical testing, and regression</li><li>Experience with widely used probability methods (conditional probability, Bayes rule, likelihood, independence, etc.)</li><li>Experience with time series analysis</li><li>Experience with data visualization techniques and tools (e.g., ggPlot2)</li><li>Strong software engineering background (OOP, data structures, algorithms, computability, and complexity)</li><li>Excellent conversation and communication skills</li><li>Bachelor’s in a relevant quantitative field, such as statistics, operations research, or computer science, depending on position level (master's or PhD preferred)</li>\n</ul>\n<strong>Recommended Qualifications:</strong>\n<ul>\n<li>Proven understanding of multivariable calculus and linear algebra</li><li>Experience dealing with massive data sets, using big data tools (Hadoop HDFS, MapReduce, Accumulo, Presto, MongoDB, Cassandra, HBase, R, Mahout, Pig, and Hive, DC/OS)</li><li>Hands-on experience and expertise with cloud computing services (AWS, Azure, etc.)</li>\n</ul>\nOur passion for improving quality of life through geography is at the heart of everything we do. Esri’s geographic information system (GIS) technology inspires and enables governments, universities, and businesses worldwide to save money, lives, and our environment through a deeper understanding of the changing world around them.\n<br><br>\nCarefully managed growth and zero debt give Esri stability that is uncommon in today's volatile business world. Privately held, we offer exceptional benefits, competitive salaries, 401(k) and profit-sharing programs, opportunities for personal and professional growth, and much more.\n<br><br>\nEsri is an equal opportunity employer (EOE) and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law.\n<br><br>\nIf you need a reasonable accommodation for any part of the employment process, please email humanresources@esri.com and let us know the nature of your request and your contact information. Please note that only those inquiries concerning a request for reasonable accommodation will be responded to from this e-mail address.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}