{"job title": "Sr. Data Scientist", "company": "Extron Electronics", "city state": "– Anaheim, CA", "rating": "2.8", "job description": "<div>\n<div>\n\n\n<ul>\n\n <li><strong>Office:</strong> Extron USA</li>\n<li><strong>Location:</strong> Anaheim, CA</li>\n</ul>\n\n </div><br>\n\n <div>\n\n\n<ul>\n\n <li><strong>Department:</strong> Information Technologies</li>\n<li><strong># of Openings:</strong> 1</li>\n</ul>\n\n </div>\n</div>\n\n<br>SR. DATA SCIENTIST<br><br>Responsibilities include the design and development of predictive models using machine learning techniques. Work with key stakeholders to define business questions, success criteria, and model deployment plans. Conducts exploratory data analysis and prepares visualizations summarizing key features of the data. Develops program plans and road maps for Data Science.<br><br>Qualified Candidates will have:\n\n\n<ul>\n<li> BS Degree or equivalent experience required</li>\n<li>5+ years of machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision Forests, Boosting, Ensembling, Neural Networks, etc.</li>\n<li> 5+ years of scripting and programming skills in Python with focus on clarity, reproducibility, and reusability.</li>\n<li> 5+ years of SQL ETL processes (SSIS, SSAS).</li> \n\n<li>Experience with Azure based development.</li>\n<li> Experience with the ability to consume and deploy data via APIs.</li>\n<li> Experience applying supervised, unsupervised, and semi-supervised learning techniques.</li>\n<li> Experience analyzing large data sets to draw conclusions about data integrity, accuracy, and general relationships</li>\n<li> Experience with common data science / ML toolkits, such as NumPy, SciPy, Scikit-Learn, TensorFlow, Caffe2, MxNet, Torch, etc.</li>\n<li> Expertise in data mining algorithms and statistical modeling techniques such as clustering, classification, regression, decision trees, neural nets, support vector machines, anomaly detection, sequential pattern discovery, and text mining.</li>\n<li>Ability to work with pre-existing guidelines, standard operating procedures in a fast-paced professional environment.</li>\n<li> Excellent communication skills (written and verbal)</li>\n<li> Strong attention to detail, highly organized, computer literate</li>\n<li> Ability to work well in a fast-paced professional office environment</li>\n</ul>"}