{"job title": "Network Data Scientist", "company": "Facebook", "city state": "– Menlo Park, California", "rating": "4.4", "job description": "Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.Every day we strive to provide best possible experience to our users that are now numbered in billions, and to make that possible, we have deployed an ultra-high capacity backbone network that spans the Globe. We are looking for a Network Data Scientist to join our Backbone Planning Team to evaluate network usage and develop traffic growth forecasts. This is an ideal role for a Network Data Scientist that wants to work on a purpose built and ever expending network that touches and changes lives of billions for the better every day.\n<br><br>\n<strong>Responsibilities:\n<br>\n</strong>\n\n<ul>\n<li>Develop tools to analyze network traffic levels</li><li>Develop key metrics to track demand accuracy and overall service efficiency</li><li>Derive correlation models, mapping demands to one another</li><li>Develop tools to measure SLA metrics set per service, track and report trends</li><li>Create bottom-up and top-down traffic forecasting matrices to be inserted into capacity modeling.</li><li>Establish short-term and long-term forecasts taking into consideration historical data, planned services, and network and datacenter resources</li><li>Work with service owners to improve demand management and develop a resource allocation processes</li>\n</ul>\n\n<strong>Mininum Qualifications:\n<br>\n</strong>\n\n<ul>\n<li>3+ years of experience in data analysis</li><li>Programming skills in Python or similar for data analysis and tools development</li><li>Database skills and knowledge of query languages</li><li>Statistical modeling skills</li><li>Ability to communicate across the organization including network planning and service owners</li><li>BS or MS in Mathematics, Computer Science, Physics or related field</li><li>Ability to facilitate network performance and develop new KPIs.</li>\n</ul>\n\n<strong>Preferred Qualifications:\n<br>\n</strong>\n\n<ul>\n<li>Experience in a production network environment</li>\n</ul>"}