{"job title": "Accounting Data Scientist", "company": "IBM", "city state": "– Armonk", "rating": "3.6", "job description": "Do you have a passion to drive transformation and innovation and expand your skills to lead IBM accounting to new levels of technology driven processes? Are you ready to join the company that is the leader in Cognitive and Cloud solutions to enable that passion?\n<br><br>\nThe Accounting Data Scientist will implement new technologies to deliver innovative analytics solutions based on business intelligence, big data and insightful reporting technologies. The ideal candidate will transform data into analytical solutions delivering business value and improved outcomes. Someone who can interpret large and varied data sources, leverage visualizations tools to aide in understanding data, build models to use the data (machine learning techniques), and discover relationships across data elements. We are looking for an experienced professional with experience working with tools such as SPSS, Python and R, combining that with IBM Watson and BlueMix services to deliver business value and insightful outcomes.\n<br><br>\nIBM Accounting has the responsibility to accurately record the company's financial performance using Generally Accepted Accounting Principles, IBM Accounting Practices and Local Statutory Principles. Professionals working in this area are involved in some or all of the following activities: accounting for complex business transactions, advising the business on technical accounting matters, and performing financial performance reporting and analysis.\n<br><br>\n<strong>Required Technical and Professional Expertise</strong>\n\n\n<ul>\n<li>3-5 years of analytics experience ideally in an accounting or finance area.\n<br><br>\n<strong>Preferred Tech and Prof Experience</strong></li>\n<li>Project management, Agile experience and leadership skills preferred</li>\n</ul>\n\n<strong>EO Statement</strong>\n<br>\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status."}