{"job title": "Data Science Software Engineer", "company": "Klaviyo", "city state": "– Boston, MA", "rating": "4.0", "job description": "<div>We love programming and the excitement that comes with building something people use. We are the kind of people that love talking to users and can find the balance between solving a problem quickly and thinking about how your code will work in the future. We love to move fast, keep learning and get stuff done.</div><br>\n<div>Our data science team is analyzing large data sets (were collecting billions of individual actions every month) and building products that enable our customers to grow faster and communicate more effectively with their customers. Were looking for data science software engineers to build production features, models and pipelines.</div><br>\n<div>Our data science team is still in its early days and youll have a big impact on our direction and how we operate. Youll be central to shipping products that help our customers learn and grow from their data. Were looking for people who could play any number of different engineering roles in a cloud-scale SaaS company and are specifically excited by working in data science.</div>You:\n\n<ul>\n<li>Are a strong software engineer with a passion for data science.</li><li>Can write scalable and robust production code.</li><li>Know how to achieve cloud-scale data processing through parallel, elastic, streaming and similar techniques.</li><li>Have experience working on features from conception to deployment to ongoing enhancements.</li><li>Are skilled at working with data science packages and tools.</li><li>Have experience with or a strong desire to learn statistical, modeling and machine learning techniques.</li><li>Aspire to correctness (e.g. in your code, in drawing conclusions from data)</li><li>Have a bachelors or advanced degree in computer science or other relevant quantitative discipline, or equivalent industry experience.</li>\n</ul>\n\n<strong>Technologies we use (not comprehensive!):</strong>\n\n<ul>\n<li>Python</li><li>Numpy, Scipy, Pandas</li><li>Aurora, Cassandra, Kafka</li><li>HTML, JavaScript, React</li><li>SageMaker</li>\n</ul>\n\n<br>\n<div>About Us</div><br>\n<div>Klaviyo is a team of people who are crazy motivated by growth.</div><br>\n<div>Its what we help our customers do: grow their businesses by making it possible and easy for them to use their data to power better marketing.</div><br>\n<div>Its how we behave as individuals: were all deeply passionate about learning.</div><br>\n<div>Its how we manage our business: we have thousands of paying customers, were profitable, and were growing insanely fast.</div><br>\n<div>And its what our culture is all about. Working at Klaviyo means youll work on things you never imagined you would; youll grow in ways you didnt consider possible; and youll do the best work of your career with people who are just as motivated and talented as you are.</div> <br>\n<div>If this sounds like your ideal place to work, drop us a note!</div>"}