{"job title": "SR Data Scientist", "company": "Microsoft", "city state": "– Redmond, Washington", "rating": "4.1", "job description": "<div>Do you want to be at the heart of cloud computing? Azure Compute is the core of our cloud platform and is growing incredibly fast. We build fault tolerant distributed systems on top of commodity datacenter hardware, to deliver an infrastructure for hosting customer applications. The platform provides millions of virtual machines for customers to run their workload in the cloud. We are a globally available foundational service that hosts other high scale services like Bing/Skype/SQL as well hosting millions of multiplayer gaming sessions and allow solving large computational problems in seconds.\n<br><br>\nIntelligent Compute Support is a new initiative to build intelligent and smart diagnostics infrastructure to auto detect and fix problems that our customers face with respect to their virtual machines and containers. It involves building large scale low latency service, building framework for adding diagnostics to make inferences, using Machine Learning to predict problems, all of them leveraging big data that encompass large and numerous event streams for the various changes that happen in the system. The goal is to build services that delights our customers and solves their problems as quickly as possible and prevent them proactively.\n<br><br>\nThe engineers have opportunity to do deep distributed services development while also being able to influence scenarios and work with customers. We work at a fast pace with a focus on shipping early and iterating. Our team fosters collaborative environment and builds upon one-another's ideas, to deliver world-class customer value at a rapid pace. We empower engineers to deliver creative solutions through bottoms-up innovation. This is a fun environment and a great opportunity to work on something highly strategic to Microsoft and extremely relevant in the industry.\n<br><br>\nWe are looking for strong developers who have a penchant to learn and utilize their broad skill sets to produce great customer impact. If you love dealing with ambiguity, solving challenging problems and writing high quality code, we want to talk to you. If you have experience designing and implementing large scale distributed, highly available services, that would be a huge plus.\n<br><br>\nJoin the Azure Compute team and contribute to the backbone of Microsoft Cloud. Help us innovate and grow the cloud further!</div> Responsibilities<br><br>We are looking for strong developers who have a penchant to learn and utilize their broad skill sets to produce great customer impact. If you love dealing with ambiguity, solving challenging problems and writing high quality code, we want to talk to you. If you have experience designing and implementing large scale distributed, highly available services, that would be a huge plus. Join the Azure Compute team and contribute to the backbone of Microsoft Cloud. Help us innovate and grow the cloud further!<br><br>Qualifications<br><br>A successful candidate will have:\n<ul>\n<li>6+ years of software development experience using C#, Java, C++, or C</li><li>Demonstrated problem solving, coding and debugging skills</li><li>Ability to debug and optimize code, and identify new areas of automation</li></ul>\n\n<ul>\n<li>Strong leadership skills to drive clarity on ambiguous problems</li><li>Customer empathy and strong collaboration skills are a must</li><li>Excellence in software engineering practices and coding</li><li>Experience building and operating scalable distributed systems would be a huge plus</li>\n</ul>\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n<br><br>\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n<br><br>\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work."}