{"job title": "Sr. Data &amp; Applied Scientist", "company": "Microsoft", "city state": "– Sunnyvale, California", "rating": "4.1", "job description": "Our team focuses on understanding, predicting, and incentivizing how the advertisers and users interact with our marketplace through algorithm development, optimization, and experimental analysis of advertiser strategies and auction mechanisms. Scientists on our team work at the edge of artificial intelligence and economics developing in the online stack as well as offline workflows. At its core, our team determines which ads are allocated and at what price.<br><br>Responsibilities<br><br>A successful candidate should be passionate about artificial intelligence and optimization at web scale. They will play a key role in driving algorithmic improvements to online and offline systems, develop and deliver robust and scalable solutions, make direct impact to both user and advertisers experience, and continually increase the revenue for Bing ads. The candidate should also have excellent communication, collaboration and analytical skills.<br><br>Qualifications<br><br>1) M.S. in Computer Science (or related discipline). Ph.D. Preferred.\n<br><br>\n2) Solid software development and engineering experience. (Minimum 5 years)\n<br><br>\n3) Great design and problem solving skills, with a strong bias for quality and engineering excellence at scale.\n<br><br>\n4) Most successful candidates will possess the ability to learn new techniques from textbooks or research papers and apply them to the business problem at hand.\n<br><br>\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n<br><br>\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work."}