{"job title": "Data Engineer/ Technical Data Scientist", "company": "Net2Source", "city state": "– Phoenix, AZ", "rating": "3.2", "job description": "Net2Source, Inc. is one of the fastest growing IT Consulting company across USA. N2S is headquartered at NJ, USA with its branch offices in Asia Pacific Region. N2S offers a wide gamut of consulting solutions customized to client needs including staffing, training and technology.\n<br><br>\n<strong>ADDITIONAL JOB DETAILS:</strong>\n<br>\nCome join our client as a Technical Analyst in the Small Business Group Data Analytics &amp; Science team. We are looking for creative problem solvers with a passion to deliver results. This position works alongside analysts and data partners to deliver quality data, utilities and frameworks for analyst use.\n<br>\nThe Role: The SBG Data Analytics &amp; Science team is looking for a seasoned Data Engineer/Technical Analyst, with experience in AWS, to don two hats: developing data ingestion &amp; processing pipelines and building automated frameworks for development, deployment &amp; testing, for Analysts. As a Data Engineer/Technical Analyst, you'll need to work with analysts for their raw data processing needs, understand the requirements, build and maintain processing pipelines. You'll also help analysts migrate to AWS seamlessly by working with them, maintaining an inventory of analytics jobs, scripts and queries to ensure smooth migration. You'll also help to build frameworks and utility tools that'll make analyst life easy in AWS. The ability to not only code and configure tools, but also assemble &amp; integrate technology across different platforms is critical to success. This includes a deep understanding of AWS platforms, scripting and enterprise level languages as well as open source tools that can and should be leveraged to solve problems. You'll work in a rapid environment where there aren't always clear specifications or rules about how something should be done and you'll be responsible to figure things out and keep things moving.\n<br><br>\n<strong>Primary Responsibilities:</strong>\n\n\n<ul>\n<li>Develop and maintain existing ingestion &amp; processing pipelines that processes raw data into shareable data layers for wider analyst consumption • Work with analysts and our larger data engineering group to ensure smooth migration of data, analytics tools and our jobs and scripts to AWS</li>\n<li>Design and build automated code development &amp; deployment systems that simplify analyst work and make our work more consistent and predictable. Eg: Maintaining GitHub and using Jenkins for automate code deployment in AWS</li>\n<li>Analyze data-related systems integration opportunities and challenges, validating data models from a data integration perspective for current projects as well as other impacted projects and drive quality improvements</li>\n<li>Help Proof-of-Concept tools &amp; technologies that can ease analyst work</li>\n<li>Train/guide larger analytics community about best practices, usage of tools &amp; technologies</li>\n<li>Communicate progress frequently; Escalate critical issues that block progress and resolve in a timely manner</li>\n<li>Experience working with AWS platform and tools like EMR, S3, Data Pipelines etc.</li>\n<li>Advanced knowledge of SQL, Python or other scripting languages, Shell scripting</li>\n<li>Knowledge of Big Data and related technologies: HDFS, Hive etc. (Spark, Presto etc. would be awesome!)</li>\n<li>Understanding of Big Data tech stack and architecture</li>\n<li>Great product/project management skills</li>\n<li>Great communication skills - both at technical level, as well as to leadership</li>\n<li>Have the right attitude to get things done</li>\n<li>Have strong communication and negotiation skills</li>\n</ul>\n\nWant to read more about Net2Source? , Visit us at www.net2source.com\n<br><br>\nNeetu Singh\n<br>\nSenior Technical recruiter\n<br>\nNet2Source Inc.\n<br>\nDesk: (201) 340 8700 Ext 576- D: (201) 297 1579-\n<br>\nEmail: neetu.singh@net2source.com\n<br>\nAddress: 317 George St. Suite 220, New Brunswick, NJ 08901\n<br>\nWebsite: www.net2source.com\n<br><br>\n<strong>Company Description:</strong>\n<br><br>\nNet2Source Inc. is a Global Workforce Management Solutions Company, headquartered in Jersey City, NJ with its local offices in Texas, California, Florida, Illinois, Colorado and Michigan and its global operations in Canada, UK, Europe, UAE, Malaysia, Australia, China, Singapore and India. Net2Source offers a wide gamut of consulting solutions customized to specific client needs including but not limited to Application Development, Workforce Management and Project Consulting."}