{"job title": "Research Data Associate (Per Diem)", "company": "NYU Langone Health", "city state": "– New York, NY", "rating": "3.8", "job description": "<p><strong>NYU School of Medicine</strong> is one of the nation's top-ranked medical schools. For 175 years, NYU School of Medicine has trained thousands of physicians and scientists who have helped to shape the course of medical history and enrich the lives of countless people. An integral part of NYU Langone Health, the School of Medicine at its core is committed to improving the human condition through medical education, scientific research, and direct patient care. For more information, go to med.nyu.edu, and interact with us on Facebook, Twitter and Instagram.</p><p><strong>Position Summary:</strong></p><p><br>We have an exciting opportunity to join our team as a Research Data Associate.</p><p><br> <br> In this role, the successful candidate Research assistant for exploring the mental and cognitive experience of cardiac arrest, including near-death experiences with Dr. Sam Parnia.<br> The NYU Resuscitation Research Group is a newly established multi-disciplinary group that aims to identify novel methods to save the lives and brains of people who undergo cardiac arrest resuscitation. The complications of cardiac arrest include brain injury, disorders of consciousness and neurocognitive deficits. However, it is increasingly recognized that a systematic approach to cardiac arrest and post-resuscitation care can significantly improve survival, neurological and neurocognitive outcomes. This knowledge, combined with the significant social and medical impact of this condition on human lives, has led to the development of a clinical and research program towards combatting this condition.<br> Following the advent of modern cardiopulmonary resuscitation (CPR) for cardiac arrest (CA), millions of people have survived CA, and many people have provided anecdotal reports of lucid well-structured thought processes with memory formation from a period during CA, including so called near death experiences. In recent years, the accuracy of these reports, have been further supported by evidence from case studies, and more recently large scale prospective CA studies. The occurrence of consciousness at the time CA is highly significant, as data from independent studies indicate that brain function ceases during CA. We are one of the few centers with an established track record of research into real-time non-invasive monitoring of brain resuscitation during CA, as well as the study of consciousness/awareness and the cognitive and mental experience of CA.</p><p><br> This multi-centered, prospective and retrospective study investigates the detailed cognitive recollections of cardiac arrest survivors using a mixed methods approach that integrates quantitative and qualitative research. This study aims to understand conscious awareness and/or mental cognitive states during cardiac arrest/circulatory standstill while examining their relationship with markers of brain resuscitation. Furthermore, we plan to establish themes that relate to the experience of cardiac arrest and their impact on neuropsychological outcomes and quality of life.</p><p><strong>Job Responsibilities:</strong></p><ul><li>collaborate with the Resuscitation Research team in attending cardiac arrest events where real-time brain monitoring data is collected. After such an event, the student will be responsible for follow up and interviews of cardiac arrest survivors to determine the mental and cognitive experience of cardiac arrest and its impact on neuropsychological outcomes and the quality of life in survivors. The student will be involved with patient recruitment, interviews, and data analysis</li><li>Provide material for and/or initiate IRB correspondence.</li><li>Aware of study regulatory status and keep an up to date copy of regulatory documents.</li><li>Record, update, edit and maintain confidential information onto paperwork or web-based forms in a neat, accurate and timely manner and ensure subsequent data collection as required.</li><li>Respond to requests in a timely manner, give/receive correct information, encourage required dialogue/follow-through.</li><li>Maintain files in an organized and up-to-date manner in order to facilitate their retrieval and maintains copies of all required on-going documentation and forms for the files.</li><li>Completes filing in accordance with department procedures.</li><li>Duplicates and collates materials upon request.</li><li>Thorough knowledge of research study, study rationale, study subject, and clinical procedures associated with the study.</li><li>Recruitment capabilities and the screening of potential patients/subjects for eligibility to the study.</li><li>Review all the elements of the screening process with the Principal Investigator.</li><li>Collaborate with various personnel that may be involved in assisting with specific aspects in the study.</li><li>Demonstrate knowledge of policies and procedures of the host institution where the study is being conducted and the regulatory requirements such as IRB and other approvals if necessary.</li><li>Utilize available resources and established procedures to identify problems for quick resolution.</li><li>Conduct study visits, obtain and document information within the time frame specified.</li><li>Monitor any outward effects or issues regarding patient/subject safety and report this to the Principal Investigator, Physician and Research Nurse.</li><li>Works with the principal investigators and research nurses on monitoring the overall conduct of the study.</li><li>Tracks study milestones and patient accruals to help evaluate the progress of studies.</li><li>Reviews data with supervisor and provides reports to the data and safety monitoring committee.</li><li>Works with departments, labs, other personnel and areas as needed, to ensure the timely transfer of items and biological materials: study drugs; histology slides; serum, urine, blood samples, etc., using appropriate precautions at all times.</li><li>Responds to requests in a timely manner, gives and receives correct information, encourages required dialog and follow through.</li><li>Follow-ups to ensure that requested materials are delivered according to all appropriate procedures and policies.</li><li>Collects, prepares, ships, and/or stores biological materials using universal precautions.</li><li>Attends appropriate trainings in the proper handling and collection of biological substances and the packaging and shipment of samples as well as required IRB and HIPAA tutorial.</li><li>May complete assessments on study subjects/patients per protocol (with proper training); continue to follow-through with items and patients as part of research study.</li><li>May (if proper training has occurred) draw patients/subjects blood, perform EKG, and or take vital signs.</li><li>May be required to travel to study initiation (that is, where sponsor teaches protocol to PI and CRC).</li><li>Utilizes the necessary tools to ensure protocol compliance to conduct direct data research.</li><li>Utilizes established methodologies to collect patient information for the research project(s).</li><li>Extracts data for publications, or provides data collection from outside physicians offices.</li><li>Formats and uses tools to facilitate data collection (e.g., calendars, schedules, tracking logs, etc).</li><li>Ensures protocol compliance, that is, that standard steps regarding eligibility criteria, follow-up, and required documentation is consistently followed in the time frame specified.</li><li>Secures accurate signatures and forwards documents and or forms to the appropriate destination based on prescribed policies and procedures.</li><li>Compiles data and assists in consolidating and analyzing data for presentation to sponsoring and regulatory agencies.</li><li>Reviews any issues that deviate from standard policy and procedure with supervisor.</li><li>Reviews data with supervisor and then provides reports to all parties (e.g., data and safety monitoring committee, the principal investigator, sponsoring agency, etc.) on the progress of the study.</li><li>Completes report forms and records following set protocol from the beginning of a research/study through the end.</li><li>Utilizes appropriate sources, gathers and compiles data, statistics and other materials as needed.</li><li>Inputs clinical and non-clinical data into the database and or case report forms; ensures data entered is correct and consistent with the source document and completed in a timely and organized manner.</li><li>Suggests changes and additions to established data fields as needed, to supervisor.</li><li>Processes incoming and outgoing documents by transcribing data, figures, statistics, codes and other information.</li><li>Completes paperwork and forms in a neat, accurate, timely manner and ensure subsequent data collection as required.</li><li>Maintains copies of all required on-going documentation and forms for the files.</li><li>Reviews data to be entered, edits obvious errors and obtains missing information.</li><li>Prepares requested data and numbers thoroughly and accurately for statistical analyses and required reporting.</li><li>Ensures that information in computer database is accurate, entered and maintained on a timely basis.</li><li>May perform library searches and retrieve reference materials from various sources using Medline and PubMed.</li><li>May request articles from medical journals.</li><li>May prepare presentation for lectures and symposium, utilizing PowerPoint for slides.</li><li>Coordinates, Facilitates and Communicates with Staff and Non-Staff to Produce Required Results.</li><li>Interfaces with varied persons, such as, School of Medicine and or Medical Center staff (e.g. physicians, nurses, CTO).</li><li>Initiates and continues regular contact with patients; encourages visit reminders and compliance to research; ensures contact with patients and their families is courteous, effective, professional and cooperative.</li><li>Works with research nurses as part of a team to coordinate clinical trials.</li><li>Demonstrates knowledge of and follows proper clinical study processes within current policies and procedures.</li><li>Recognizes and identifies problems, appropriately escalate issues to supervisor as needed.</li><li>Utilizes available resources and established procedures in order to rectify problems, communicates all changes.</li></ul><p><strong>Minimum Qualifications:</strong></p><p><br>To qualify you must have a Associate's Degree plus one year related experience or equivalent combination of education and experience. Computer literate with good interpersonal, writing and verbal communication skills</p><p><strong>Preferred Qualifications:</strong></p><p><br>- University graduates, Medical graduates, particularly in neurology, emergency, critical care, anesthesia, Nursing graduates and/or PhD students in related fields with dedicated research time or graduate level students working towards a thesis. <br>- Enthusiasm to actively participate in research related activities including patient recruitment and further project involvement<br>- Previous experience writing protocols, with qualitative research, and/or data management is a plus<br>- Previous experience interviewing patients/subjects is a plus</p><p><em>Qualified candidates must be able to effectively communicate with all levels of the organization.</em><br><br>NYU School of Medicine provides its staff with far more than just a place to work. Rather, we are an institution you can be proud of, an institution where you'll feel good about devoting your time and your talents.<br><br>NYU School of Medicine is an equal opportunity and affirmative action employer committed to diversity and inclusion in all aspects of recruiting and employment. All qualified individuals are encouraged to apply and will receive consideration without regard to race, color, gender, gender identity or expression, sex, sexual orientation, transgender status, gender dysphoria, national origin, age, religion, disability, military and veteran status, marital or parental status, citizenship status, genetic information or any other factor which cannot lawfully be used as a basis for an employment decision. We require applications to be completed online. <br>If you wish to view NYU School of Medicine's EEO policies, please click here. Please click here to view the Federal \"EEO is the law\" poster or visit https://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm for more information. To view the Pay Transparency Notice, please click here.</p>"}