{"job title": "Enterprise Data Scientist", "company": "Parkland Health and Hospital System", "city state": "– Dallas, TX", "rating": "3.3", "job description": "Looking for your next opportunity? If so, choose Parkland and discover what a meaningful job feels like. Whether you work directly with patients or use your talent to support our care, you?ll be part of a team that?s providing valuable health services to Dallas County residents. And here, you?ll have the opportunity to put all your skills to work, and the support to grow and advance in your job and your field. Step into a career that will make a substantial difference for our patients?and for you. We blend cultures, talents, and experience into an exemplary health and hospital system.? Parkland has earned distinction as one of America?s Best Hospitals by U.S News and World Report every year since 1994.\n<br><br>\n<strong>PRIMARY PURPOSE</strong>\n<br><br>\nThe enterprise data scientist will transform health care by analyzing, designing, implementing, evaluating information and communication systems that enhance individual and population health outcomes, improve patient care, and strengthen the clinician-patient relationship. Creates and maintains a business liaison relationship with appropriate clinical units and users of technological services and assists Information Services management in managing the vendor relationships for appropriate products and services. This position demonstrates knowledge of clinical practice and electronic clinical information systems functionality; its implementation in a clinical setting, and the ongoing maintenance and growth of the system.\n<br><br>\n<strong>MINIMUM SPECIFICATIONS</strong>\n<br><br>\n<strong>Education:</strong>\n\n\n<ul>\n<li>Must have a Masters in Statistics, Applied Mathematics, Computer Science, Computer Engineering, Physics, or a related field.</li>\n<li>Prefer (PhD) in above field(s).</li>\n</ul>\n\n<strong>Experience:</strong>\n\n\n<ul>\n<li>Minimum of 4 years of experience in a hospital or clinic setting working with physicians and staff involved in patient care.</li>\n<li>Minimum of 4 years of experience working in the area of information systems and knowledge of standards, system configuration, decision support and information systems as well as all regulatory requirements of a medical institution.</li>\n<li>Must have experience in working with projects that resulted in the melding of multiple business cultures and significant organizational change related to the automation of clinical and administrative functions.</li>\n<li>Must have experience in conducting evaluations and assessments, i.e. change readiness assessments, workflow optimization assessments, etc.</li>\n<li>Must have experience in clinical system implementations throughout the project life-cycle, performing workflow analysis, testing, training, go-live support, system upgrades, and issues management.</li>\n</ul>\n\n<strong>Equivalent Education and/or Experience:</strong>\n\n\n<ul>\n<li>May have an equivalent combination of education and experience to substitute for both the education and the experience requirements.</li>\n<li>May have experience as a principle investigator or in clinical research analytics capacity.</li>\n</ul>\n\n<strong>Skills or Special Abilities:</strong>\n\n\n<ul>\n<li>Must be recognized by peers as an outstanding conceptualizationist and solutions architect.</li>\n<li>Must have working knowledge of hospital organization and operations, administrative standards, regulations and practices. Must have working knowledge of Parkland and Medicine Services/Care Management organization and operations, administrative standards, regulations and practices within three months of job assignment.</li>\n<li>Must have expert level knowledge regarding EMR, word processing, database, and spreadsheet software.</li>\n<li>Must have strong analytic and computer skills in addition to an extensive knowledge of database management and data analysis.</li>\n<li>Must be fluent in advanced data programming language and statistical analysis software (be able to program in R, STATA, SPSS, or SAS statistical software).</li>\n<li>Must be able to demonstrate a working knowledge of program evaluation methods, statistical analysis, research skills, management information systems, and strategic planning.</li>\n<li>Exceptional planning skills with a results-oriented record of achievement and the ability to set goals, meet deadlines and evaluate results particularly in regard to significant changes within an organization and with respect to the organization?s relationship with the community or marketplace.</li>\n<li>Must have strong written and verbal communication skills, have a high level of attention to detail, and have the ability to manage multiple projects at once.</li>\n<li>Must be a quick learner. Good analytical and problem-solving skills</li>\n<li>Must be able to work in a team environment.</li>\n<li>Sets high standards of performance for self.</li>\n<li>Must be able to demonstrate a high skill level in the use of Microsoft Word, Excel, and PowerPoint software.</li>\n</ul>\n\nParkland Health and Hospital System prohibits discrimination based on age (40 or over), race, color, religion, sex (including pregnancy), sexual orientation, gender identity, gender expression, genetic information, disability, national origin, marital status, political belief, or veteran status.\n<br><br>\n<strong>Company Description:</strong>\n<br><br>\nAs the community hospital for Dallas, Parklands tradition of providing exceptional care stretches back for more than a century. Many of Parkland's specialty areas have garnered national praise for excellence in care, research and technological innovation. Every step of the way, our talented professionals have maintained the highest standards of service and performance, recognizing the intrinsic worth of each patient and the importance of every interaction.\n<br><br>\nParkland Health &amp; Hospital System first opened its doors in 1894 and is now one of the largest public hospital systems in the country. Services include a Level I Trauma Center, the second largest civilian burn center in the U.S. and a Level III Neonatal Intensive Care Unit. Parkland is the primary teaching hospital for the University of Texas Southwestern Medical Center. Despite our growth, our mission and vision remain the same to care for you and your family. At Parkland, our patients are at the heart of everything we do."}