{"job title": "Senior Data Scientist", "company": "Veeva Systems", "city state": "– Pleasanton, CA", "rating": "3.5", "job description": "Our Company\n<br><br>\nAt 2,200 employees and growing, and consistently strong financials (NYSE:VEEV), Veeva was named among the top fastest growing public technology companies on Forbes' annual Fast Tech 25 list. We build innovative cloud solutions for some of the world's largest pharmas and biotechs, and we need great people like you to make it happen.\n<br><br>\nOur Culture&amp;People\n<br><br>\nOur core values are Employee Success, Customer Success, and Speed. We are innovators, collaborators, and thought leaders out to create best-in-class solutions that help our customers improve and extend human life. It's genuine, straight-forward, and no fuss.\n<br><br>\n<strong>Job Summary:</strong>\n<br><br>\nAs a Senior Data Scientist at Veeva, you'll work with the Veeva Nitro analytics team to develop next generation analytics for our Veeva Life Science customers. Our ideal candidate is statistician / data engineer / problem solver that can not only is expert in using statistical analysis methods and tools (R, Matlab, SAS), large scale data management platforms / pipelines (Redshift, Hive, Kafka, S3), but also is adept in modern clustered analytic platforms (Spark/PySpark, Tensorflow, etc).\n<br><br>\nAs a senior member of our analytics team, you will work side by side with other analytically focused engineers, product managers, and architects, to deliver new suites of data focused applications on Veeva Life Science customers. If you relish data challenges, play well on smart teams, enjoy exploration and discovery of the needle in the haystack, and are looking for an opportunity to work with a fast-growing company let's talk!\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nWhat will your day look like?\n\n\n<ul>\n<li>Develop new models to analyze Life Science commercial usage and behaviors, for use in customer facing applications.</li>\n<li>Work with large, complex Life Sciences data sets, mixing customer specific operational data to regulatory content</li>\n<li>Research + prototype new analytic platforms and methods, for use for improving the way we collect and derive analytic processing.</li>\n<li>Give commercial leadership visibility to analytic opportunities, identifying behavioral, demographic and product trends in industry sales teams</li>\n</ul>\n\n<strong>Qualities we Value:</strong>\n\n\n<ul>\n<li>Ability to make complicated things very simple</li>\n<li>Curiosity to explore new ways to solve problems, make our products awesome</li>\n<li>Creativity and a willingness to learn modern technologies</li>\n<li>Tenacity and technical brilliance</li>\n<li>Pride in work through attention to detail</li>\n</ul>\n\n<strong>Requirements:</strong>\n<br><br>\n<strong>Minimum Qualifications:</strong>\n\n\n<ul>\n<li>BS in Quantitative Field (Stat, Math, Computer Science, or Engineering)</li>\n<li>5+ years experience with enterprise data technologies, large scale DB management (DBMS or Hadoop), streaming models.</li>\n<li>3+ years experience in statistical analysis, data science, or experience in a suitable advanced analytic domain (analytic-driven research, market analysis, etc.)</li>\n<li>Strong knowledge of Python / Spark / R bonus points for data analytics packages such as PySpark + MLLib.</li>\n<li>Good understanding of high performance Machine Learning techniques such as: classification, clustering, deep learning, fuzzy matching, sentiment analysis, A/B testing</li>\n<li>Advanced semi-structured data manipulation skills (Web scraping, Event parsing, text mining)</li>\n</ul>\n\n<strong>Nice to Have:</strong>\n<br><br>\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Experience working in SaaS cloud based world, tools, and access models.</li>\n<li>Experience working within Agile Software Development Lifecycles</li>\n<li>Experience with AWS</li>\n</ul>"}