{"job title": "Data Analytics Business Analyst", "company": "Allstate", "city state": "– Charlotte, NC", "rating": "3.5", "job description": "<strong>Where good people build rewarding careers.</strong>\n<br><br>\nThink that working in the insurance field can’t be exciting, rewarding and challenging? Think again. You’ll help us reinvent protection and retirement to improve customers’ lives. We’ll help you make an impact with our training and mentoring offerings. Here, you’ll have the opportunity to expand and apply your skills in ways you never thought possible. And you’ll have fun doing it. Join a company of individuals with hopes, plans and passions, all using and developing our talents for good, at work and in life.<br>\n<div>Job Description\n<br><br>\nThe Business Analyst applies knowledge and facilitative expertise to gather and define requirements, in order to achieve business objectives and provide innovative solutions to business problems.\n<br><br>\nThe Business Analyst (BA) Sr Consultant I leads the analysis of business requirements and requests from the business, operations, and other users of IT services. Acts as a lead and contact for the business divisions and technology solution providers for all aspects of solution identification. The BA Sr Consultant I supports projects of moderate to high complexity.\n<br><br>\n<strong>Key Responsibilities:</strong>\n\n<ul>\n\n\t<li>Provides expertise for one or more areas of the business through analysis and understanding of business needs; applies a broad knowledge of programs, policies, and procedures in a business area or technical field gained through experience and training</li>\n<li>Provides business knowledge and support for resolving technology issues across one or more areas of the business and across multiple projects</li>\n<li>Uses appropriate tools and techniques to elicit and define requirements that address more complex business processes or projects of moderate to high complexity</li>\n<li>Analyzes requirements and creates or contribute to functional designs, leveraging more advanced technical skills; may help design application prototypes</li>\n<li>May assist with project initiation for projects with moderate to high complexity</li>\n<li>Follows change control process to manage changes to base lined deliverables and scope for projects of moderate to high complexity</li>\n<li>Leads information gathering sessions</li>\n<li>Learns to understand current and potential customer needs</li>\n<li>Uses customer feedback and other data gathering and analysis techniques to provide recommendation and guide decision-making.</li>\n<li>Works with the business owner to help define and manage metrics</li>\n<li>Assists with managing the product backlog</li>\n</ul>\nJob Qualifications\n\n<ul>\n\n\t<li>College degree preferred</li>\n<li>3-5 years working experience in insurance, project management, or technology preferred</li>\n<li>Experienced in writing technical requirements</li>\n<li>Ability to use data analysis techniques to allow informed decision making</li>\n<li>Understanding of and experience working in an Agile environment</li>\n<li>Working knowledge of JIRA, SQL, Visio, and Excel</li>\n<li>Ability to work effectively with offsite business or technology partners</li>\n</ul>\n\n</div>\n<br>The candidate(s) offered this position will be required to submit to a background investigation, which includes a drug screen.\n<br><br>\n<strong>Good Work. Good Life. Good Hands®.</strong>\n<br><br>\nAs a Fortune 100 company and industry leader, we provide a competitive salary – but that’s just the beginning. Our Total Rewards package also offers benefits like tuition assistance, medical and dental insurance, as well as a robust pension and 401(k). Plus, you’ll have access to a wide variety of programs to help you balance your work and personal life -- including a generous paid time off policy.\n<br><br>\nLearn more about life at Allstate. Connect with us on Twitter, Facebook, Instagram and LinkedIn or watch a video.\n<br><br>\n<strong>Allstate generally does not sponsor individuals for employment-based visas for this</strong> <strong>position.</strong>\n<br><br>\nEffective July 1, 2014, under Indiana House Enrolled Act (HEA) 1242, it is against public policy of the State of Indiana and a discriminatory practice for an employer to discriminate against a prospective employee on the basis of status as a veteran by refusing to employ an applicant on the basis that they are a veteran of the armed forces of the United States, a member of the Indiana National Guard or a member of a reserve component.\n<br><br>\nFor jobs in San Francisco, please click \"here\" for information regarding the San Francisco Fair Chance Ordinance.\n<br><br>\nFor jobs in Los Angeles, please click \"here\" for information regarding the Los Angeles Fair Chance Initiative for Hiring Ordinance.\n<br><br>\nIt is the policy of Allstate to employ the best qualified individuals available for all jobs without regard to race, color, religion, sex, age, national origin, sexual orientation, gender identity/gender expression, disability, and citizenship status as a veteran with a disability or veteran of the Vietnam Era."}