{"job title": "Data Analyst/Data Integration Specialist", "company": "Assent Compliance Inc", "city state": "– Rochester, NY", "rating": "4.4", "job description": "<strong>Come join us!</strong>\n<br><br>\nAssent Compliance “Assent” is the leader in cloud-based compliance automation software. We are a rapidly growing, energetic and exciting company with the mission to make the world a better place with our software. We are looking for a full-time, permanent Data Analyst/Data Integration Specialist to join our fast-paced Development Team.\n<br><br>\nReporting to the Manager, Data Management the Data Analyst / Data Integration Specialist will provide support for processing data within the Assent Compliance Platform. The primary role will be the building of packages to load data into the clients Assent Compliance Platform. This role also provides support to the Customer Success team providing a view into the customer data.\n<br><br>\n<strong>What You'll Do:</strong>\n\n<ul>\n<li>Build the appropriate SSIS package to load the data to client database</li>\n\n<li>Provide reporting to CS team as required either using office tools or SSRS</li>\n\n<li>Provide support to migration of data between client systems and the Assent Master database</li>\n\n<li>Analyze and cleanse incoming and existing data</li>\n\n<li>Provide data support to other divisions of Assent, including Sales &amp; Marketing</li>\n\n<li>Follow guidance set out by corporate security policies and standards</li>\n\n<li>Ensure departmental security processes and procedures are followed where applicable</li>\n\n<li>Due to this position’s requirement that ITAR controlled data is handled, the employee must be a US Person, which is defined as a U.S. citizen or national, lawful permanent resident, person granted asylum or refugee status in the United States or a U.S. Temporary Resident (granted under Amnesty or Special Agricultural Worker provisions);</li>\n\n<li>You must fulfill the screening requirements of the ITAR Global Technical Data Control Plan including a background check since work includes ITAR controlled technical data;</li>\n\n<li>Supports security audits of Assent Platforms;</li>\n\n<li>Follow guidance set out by corporate security policies and standards;</li>\n\n<li>Ensure departmental security processes and procedures are followed where applicable.</li>\n</ul>\n<em>This is not an exhaustive list of duties. Responsibilities may be altered and/or added from time to time to meet business needs.</em>\n<br><br>\n<strong>Who You Are:</strong>\n\n<ul>\n<li>You are incredibly organized and can suggest, implement, and support efficient and effective operations</li>\n\n<li>You are diligent and detail-oriented- you pay high attention to detail</li>\n\n<li>You are highly adaptable and flexible- you thrive in a fast-paced, ever-changing environment</li>\n</ul>\n<strong>What You Should Bring:</strong>\n\n<ul>\n<li>A University, College and/or Post Graduate Certificate</li>\n\n<li>3+ years of experience in analyzing data with strong database SQL/procedural SQL development</li>\n\n<li>3+ years of experience with Microsoft SQL Server and SQL Server Integration Services;</li>\n\n<li>Experience with various data formats - XML, CSV, RDBMS and other apps such as CRM and public databases</li>\n\n<li>Forward/reverse engineering and database refactoring skills</li>\n\n<li>Data migration/conversion and ETL experience</li>\n\n<li>Knowledge of scripting languages (ex: Python)</li>\n</ul>\n<strong>Nice To Have:</strong>\n\n<ul>\n<li>Some experience with Java</li>\n\n<li>Experience with Talend</li>\n\n<li>You are proficient in the use of MS Office Suite and Google Applications</li>\n</ul>\n<em>Reasonable Accommodations Statement: To perform this job successfully, an individual must be able to perform the aforementioned duties and responsibilities satisfactorily. Reasonable accommodations may be made to enable qualified individuals with disabilities to perform these essential functions.</em>"}