{"job title": "Sr Data Analyst", "company": "Diverse Lynx", "city state": "– Bradenton, FL", "rating": "4.0", "job description": "<strong>Position: Sr Data Analyst</strong>\n<br>\n<strong>Location: <strong>Bradenton, FL</strong></strong>\n<br>\n<strong>Type: <strong>Contract</strong></strong>\n<br><br>\n<strong>Job description:</strong>\n<br>\nThe Data Engineer will be responsible for building, maintaining data pipelines and data products to ingest, process large volume of structured / unstructured data from various sources. The Data engineer will work on analyzing the data needs, migrating the data into an Enterprise data lake, build data products and reports. The role requires experience with building real time and batch based ETL pipelines with strong understanding of big data technologies and distributed processing frameworks with.\n<br><br>\n<strong>Competencies</strong>\n<br>\nDigital : Python, Digital : Apache Spark, Digital : Hadoop and its related products, Digital : Scala\n<br><br>\n<strong>Essential Skills</strong>\n<br>\no Expertise working with large scale distributed systems (Hadoop, Spark).\n<br>\no Strong understanding of the big data cluster, and its architecture\n<br>\no Experience building and optimizing big data ETL pipelines.\n<br>\no Advanced programming skills with Python, Java, Scala\n<br>\no Good knowledge of spark internals and performance tuning of spark jobs.\n<br>\no Strong SQL skills and is comfortable operating with relational data models and structure.\n<br>\no Capable of accessing data via a variety of API/RESTful services.\n<br>\no Experience with messaging systems like Kafka.\n<br>\no Experience with No SQL databases. Neo4j, mongo, etc.\n<br>\no Expertise with Continuous Integration/Continuous Delivery workflows and supporting applications.\n<br>\no Exposure to cloud environments and architectures. (preferably Azure)\n<br>\no Ability to work collaboratively with other teams.\n<br>\no Experience with containerization using tools such as Docker.\n<br>\nO Strong knowledge of Linux and Bash. Can interact with the OS at the command line and create shell scripts to automate workflows.\n<br>\no Advanced understanding of software development and collaboration, including experience with tools such as Git.\n<br>\no Excellent written and verbal communication skills, comfortable presenting in front of non-technical audiences.\n<br><br>\n<em>Diverse Lynx LLC is an Equal Employment Opportunity employer. All qualified applicants will receive due consideration for employment without any discrimination. All applicants will be evaluated solely on the basis of their ability, competence and their proven capability to perform the functions outlined in the corresponding role. We promote and support a diverse workforce across all levels in the company.</em>\n<br>"}