{"job title": "Quantitative Data Analyst (SF)", "company": "Flatiron Health", "city state": "– New York, NY", "rating": "3.8", "job description": "Flatiron Health has built a unified data set that is unparalleled in its depth and accuracy and gives our partners the capability to ask questions about real world data that weren't answerable until now. Our Quantitative Sciences team answers these questions.\n<br><br>\nWe are looking for team members who are excited to make an immediate impact in a critical space. This position requires outstanding problem-solving, analytical and communication skills; experience with multitasking and prioritizing; and the tenacity to execute against deliverables in a timely, high-quality fashion. You will collaborate with a team of oncologists, product managers, data scientists, and software engineers to help develop, commercialize, and deliver our analytics products.\n<br><br>\nImportant logistical note: Given this will be a new team in our San Francisco office, you will spend ~3 months in our NYC office to support your onboarding and ensure a successful ramp-up on Flatiron products, data and organization overall. After the onboarding period, there will be occasional travel to NYC on a business need basis.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Become a subject matter expert on our data and its capabilities</li>\n<li>Transform real-world data into actionable insights using robust statistical methods and compelling data visualizations in formats accessible to a wide range of end users</li>\n<li>Work with a cross-functional team to define and clarify analytic requirements, develop analysis plans, ensure data quality standards, and create publication-ready methods and results</li>\n<li>Generate ideas for analyses to shape future projects, contributing to a pipeline of opportunities that will help Flatiron achieve its ambitious growth goals</li>\n</ul>\n\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Become a subject matter expert on our data and its capabilities</li>\n<li>Transform real-world clinical data into actionable insights using robust statistical methods and compelling data visualizations in formats accessible to a wide range of end users</li>\n<li>Work with a cross-functional team to define and clarify analytic requirements, develop analysis plans, ensure data quality standards, and create publication-ready methods and results</li>\n<li>Generate ideas for analyses to shape future projects, contributing to a pipeline of opportunities that will help Flatiron achieve its ambitious growth goals</li>\n</ul>\n\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>You hold a Bachelor's or Master's degree in a quantitative discipline, such as biostatistics, epidemiology, applied statistics, or health economics, or equivalent experience</li>\n<li>You have 1-3 years of relevant work experience analyzing real-world clinical data</li>\n<li>You love working with data and have experience exploring data with a critical and thoughtful eye</li>\n<li>You are proficient in a statistical programming language (we primarily use R, but are open to people with experience in any language)</li>\n<li>You are an effective communicator, both oral and written</li>\n<li>You are self-motivated and flexible, thrive in highly uncertain situations, and enjoy coming up with elegant and innovative solutions to challenging problems</li>\n<li>You are a \"do-er\"-- you know how to balance attention to detail with execution against tight timelines</li>\n<li>You are passionate about our mission to improve healthcare through technology</li>\n<li>You are a highly-effective collaborator and are motivated by the opportunity to work with oncologists, software engineers, product managers, and other members of the Flatiron team</li>\n</ul>\n\n<strong>Bonus Points:</strong>\n\n\n<ul>\n<li>Oncology experience</li>\n<li>Consulting experience</li>\n<li>Experience working with longitudinal EMR data</li>\n</ul>"}