{"job title": "Culinary Data Analyst", "company": "Home Chef", "city state": "– 400 N. Michigan Ave. Chicago, IL 60611 (Downtown)", "rating": "4.1", "job description": "<div>Home Chef is building new ways to navigate the booming meal kit delivery industry. Our team is a unique mix of creators, chefs, entrepreneurs, and trailblazers and were growing quickly. Our customer-first mentality, combined with a zest for supporting our peers, helped us bring home Built in Chicagos Startup of the Year Moxie award in 2017. If youre ready to be part of the action, were ready to connect with you. There are no limits to where we can go together.</div><br>\n<div>The Culinary Data Analyst will be responsible for using data to answer key business questions for the culinary department and communicating results to key decision makers. You will work closely with our culinary and data engineering teams to collect, organize, and draw insights from our data. The role will be expected to go beyond the typical data analyst role by not only finding an effective way to communicate results but also supporting teams in implementing the business changes that will result in real value generation for the business.</div><br>\n<strong><div><u>Detailed Responsibilities:</u></div>\n<br>\n</strong>\n<br>\n<div><strong>The Culinary Data Analyst will be expected to wear several hats and will have the opportunity to work on a variety of projects. Although different projects will require different skills, the high-level responsibilities and expectations for this role are outlined below:</strong></div>Tool Development &amp; Tech Enablement:\n\n<ul>\n<li>Partner with our culinary team to develop, manage, and continually improve tools used in regular culinary processes</li> <li>Understand challenges in the current technology landscape and work with product management, data team and culinary team leads to develop potential solutions</li><li>Examples of past projects include: developing, maintaining, and troubleshooting culinary to dashboards, reports and forms</li>\n</ul>\n\n<strong>Data Analysis &amp; Reporting:</strong>\n\n<ul>\n<li>Develop models and methodologies to monitor success of multiple facets of the business (menu planning, test kitchen scheduling and capacity, costing tools, meal score prediction, etc.)</li><li>Find innovative ways to make data actionable for our culinary team- build processes to better collect, store, and visualize data in a meaningful and impactful way</li><li>Enable data-driven decision making by reporting on core KPIs and performing ad-hoc analyses</li><li>Examples of past projects include: performing analysis for our Produce SWAT team initiative, such as a deep-dive analysis into top produce quality errors and identification of root cause issues</li>\n</ul>\n\n<strong>Implementation Support:</strong>\n\n<ul>\n<li>Work with key decision makers across the business to take answers to key business questions and use them to change the way things are done at Home Chef for the better</li><li>Support leaders that are implementing changes to their everyday work based on your recommendations</li><li>Examples of past projects include: analyzing correlation between in-house tasting scores and customer meal reviews and using results to implement changes to tasting process to usefulness of data for our R&amp;D Chefs</li>\n</ul>\n\n<strong>Workplanning &amp; Project Management:</strong>\n\n<ul>\n<li>Work independently to develop project plans and timelines to drive progress forward, while working with multiple cross-functional stakeholders</li>\n</ul>\n\nQualifications: The requirements listed below are representative of the knowledge, skill, ability and/or other characteristics needed for this role. Reasonable accommodations may be made to enable individuals with disabilities.\n\n<ul>\n<li>Entrepreneurial mindset: energetic and able to lead change, create vision, and inspire people to achieve goals in a fast-paced environment</li><li>Problem solver: Identify issues quickly and bring recommended solutions backed by logic to the discussion</li><li>Interpersonal savvy: Develop rapport across the organization in order to build consensus for implementing new processes and tools</li><li>Results-oriented: Deal with ambiguity and make timely decisions to get to impact quickly</li> <li>Attention to detail: Organizational skills and ability to manage details of complex systems and operational processes</li><li>Embody the Home Chef core values of customer first, pursuing excellence, taking ownership, and building a best-in-class team</li><li>2-3 years work experience in management consulting or data analysis role; top-ranked candidates strongly preferred</li><li>Technical ability: While experience using data analysis programs (e.g. Excel and Google Business Apps) are a must, experience using Looker, SQL, Python, and/or JavaScript highly desired</li><li>Willingness to eat everything! We strongly prefer candidates who do not have allergies or dietary restrictions so that they can participate in the tasting and feedback processes that are core to the culinary team</li><li>Completion of a four-year degree program in business or related field</li>\n</ul>\n\n<strong>Perks/Benefits:</strong>\n\n<ul>\n<li>Candidates can experience Home Chef as a customer - enter promo code PEOPLE30 for $30 off your first order!</li><li>Direct access to senior management our leadership team works alongside our team members every day</li><li>Comprehensive medical, dental, and vision insurance</li><li>Generous paid time off (PTO) policy</li><li>401k program</li><li>Flexible spending accounts for qualified medical, dependent care, parking, or transit expenses</li><li>Free water taxi, discounted gym membership, and daily bike storage for Wrigley building employees</li><li>Cold brew coffee on tap at no charge</li><li>Employee discounts for Home Chef meal kits</li><li>Free lunch every Friday and snacks and beverages on hand every day</li><li>Casual dress</li> \n</ul>\n\n<br>\n<div>Home Chef is an equal employment opportunity employer</div> \n<br>"}