{"job title": "Business Data analyst", "company": "ICONMA", "city state": "– Mountain View, California", "rating": "3.4", "job description": "<div><strong><u>Business Data analyst</u></strong>\n<br><br>\nLocation: Mountain View, CA\n<br>\nDuration: 1 year\n<br><br>\n<strong>Project Overview:</strong> \n<br>\nThe GBO Sales Mastery Team focuses on the development and delivery of product &amp; skills training to client sales teams. We use our knowledge of learning best practices and client business priorities to build effective learning experiences for sellers, enabling them to know and represent our products to customers. Responsibilities Partner with the Sales Mastery Analytics and Insights team to define key metrics, how to compute them and build high-visibility dashboards. Collaborate with PMs and leads to interpret the data, teasing apart the truly actionable data from 'what it just interesting'. Synthesize that information in a clear and impactful way and share widely across the entire org. Champion the use of experimentation, become 'the expert' to drive good experimentation and assist the teams in designing/analyzing feedback sessions, conducting deeper dives when necessary. Collaborate with the analytics infrastructure engineers to identify needs and influence future development. Develop a deep understanding of the Sales Mastery ecosystem and our many data sources, most of which are enormous. Become an analytics ninja, gathering and analyzing massive amounts of information at the speed of light, or faster.\n<br><br>\n<strong>Requirements:</strong> \n<br>\nBA/BS degree or equivalent experience 3+ years' work experience in data analytics or program management Basic competence in SQL and a scripting language (Python/Javascript) Excel at conveying complex results in a simple way, often building intuitive dashboards Strong communication skills and thrive in ambiguity Nice to have/ not required You have the ability to establish a clear process to operationalize and activate programs Know how to design and execute an A/B experiment Exceptional stakeholder management skills (communication, consulting, influencing skills)</div>"}