{"job title": "Data Analyst, Compensation", "company": "Jackson National Life", "city state": "– MI-Lansing", "rating": "4.0", "job description": "<div>\n<div><b><u>Job Purpose</u></b></div>\n<div>The Data Analyst is responsible for supporting the administration of compensation programs and processes, which includes annual salary, bonus, and survey planning and administration. Primary responsibilities include analyzing, testing, and validating complex compensation data to ensure data accuracy, evaluating and approving pay changes, and assisting with job evaluations (e.g. creating/editing job descriptions). Additionally, this requires evaluating internal equity compensation and analyzing market pricing data. The Analyst will work with HR stakeholders to ensure data is maintained accurately in the HR Information System (HRIS), Workday, and will develop, analyze, and maintain spreadsheets and reports generated from compensation-related systems. </div>\n<div> </div>\n<div><b><u>Essential Job Duties &amp; Responsibilities</u></b></div>\n<ul>\n<li>\n<div>Responsible for administration of annual compensation processes (e.g. merit, bonus, etc.) which involves consolidating, testing, and analyzing large volumes of compensation data.</div></li>\n<li>\n<div>Performs audits, calculations, and reconciliation activities to identify and resolve data issues.</div></li>\n<li>\n<div>Reviews and approves pay transactions; follows up on issues and resolves as necessary.</div></li>\n<li>\n<div>Performs complex analysis through validation processes to ensure quality and accuracy.</div></li>\n<li>\n<div>Responsible for preparing salary survey data for the annual survey submission process.</div></li>\n<li>\n<div>Creates and maintains job codes/titles and job survey matches in Workday and MarketPay.</div></li>\n<li>\n<div>Produces reports, communications, charts, and summaries based on data analysis. </div></li>\n<li>\n<div>Evaluates and documents compensation policies, procedures and processes.</div></li>\n<li>\n<div>Conducts market studies and internal equity reviews to determine job value and pay.</div></li>\n<li>\n<div>Extracts and studies data from salary surveys to identify appropriate market pricing matches.</div></li>\n<li>\n<div>Creates, edits, and finalizes job descriptions in conjunction with HR partners and customers.</div></li>\n<li>\n<div>Assists in the job analysis process by evaluating exemption status, identifying appropriate salary bands, and provides pay guidance.</div></li>\n<li>\n<div>Works with HR stakeholders to ensure information stored in Workday is accurate.</div></li>\n<li>\n<div>Proactively identifies opportunities to enhance Workday capabilities and increase functionality.</div></li>\n<li>\n<div>Performs testing activities in Workday to validate changes prior to implementation.</div></li>\n<li>\n<div>Assists with additional compensation system enhancements, as necessary.</div></li></ul>\n<u>Other duties</u>\n<ul>\n<li>\n<div>Responsible for tracking and ensuring compensation payments and invoices are paid, in accordance with timing requirements.</div></li>\n<li>\n<div>Other duties as assigned</div></li></ul></div>\n<u>Job Requirements (Knowledge, Skills &amp; Abilities)</u>\n<ul>\n<li>\n<div>Advanced analytical skills and mathematical aptitude, with a high level of attention to detail.</div></li>\n<li>\n<div>Strong working knowledge of Microsoft Office, with advanced Excel skills to develop complex formulas, perform advanced functions and logic calculations.</div></li>\n<li>\n<div>Superior ability to identify errors and meet strict quality standards.</div></li>\n<li>\n<div>Ability to build reports by extracting information from databases and software applications. </div></li>\n<li>\n<div>Excellent verbal and written communication skills; demonstrated ability to use proper grammar and punctuation.</div></li>\n<li>\n<div>Solid organization, prioritization, multi-tasking, and problem solving skills.</div></li>\n<li>\n<div>Ability to learn applicable HR laws such as the Fair Labor Standards Act.</div></li>\n<li>\n<div>Strong interpersonal skills; customer service orientation with effective consulting ability.</div></li>\n<li>\n<div>A strong team player who builds highly effective professional relationships, with the ability to effectively work with and communicate with various levels across the organization.</div></li>\n<li>\n<div>Results oriented; ability to work independently and collaboratively to meet deadlines.</div></li>\n<li>\n<div>Ability to take initiative and manage projects from start to finish.</div></li>\n<li>\n<div>Ability to develop and master compensation processes, programs, and systems quickly.</div></li></ul>\n<u>Education and Experience Required</u>\n<ul>\n<li>\n<div>Bachelor’s degree or equivalent experience required.</div></li>\n<li>\n<div>Demonstrated experience performing calculations and advanced formulas/functions in Excel. </div></li>\n<li>\n<div>Experience evaluating data, and performing complex quantitative analysis and validation.</div></li>\n<li>\n<div>1 or more years of Human Resources experience preferred.</div></li></ul><div><br></div><div>*LI-LB1</div>"}