{"job title": "CW Business Data Analyst", "company": "Kforce", "city state": "– Tucson, AZ", "rating": "3.7", "job description": "<strong>RESPONSIBILITIES:</strong><br><br>Kforce has a client in search of a CW Business Data Analyst in Tucson, Arizona (AZ).\n<br><br>\nSummary: \n<br>\nOur Consumer Tax group is seeking a CW Business Data Analyst to manage routing and classification utilizing analytic insights. Your ultimate goal is to provide relevant information and insights, so we can provide our customers with 1st contact resolution. You will be focused on solving customer needs through data, ultimately helping us drive growth. We are looking for that rare individual who has the passion and experience to participate with us in changing the total customer experience and is energized by the challenges that a customer care organization generates. \n<br><br>\nResponsibilities include:\n\n\n<ul>\n<li> Experience writing Boolean logic (if/then statements) or regular expressions, Excel spreadsheets, SQLs, or other types of Boolean logic statements</li>\n\n<li> Cross team collaboration to understand transfer rates, skills and classification for customer questions</li>\n\n<li> Design and implement the E2E customer contact experience and call routing experience in IVR and Web Contact systems</li>\n\n<li> Utilize various analytical methods to provide all stakeholders with analysis, insight and direction that will move the needle on our key business metrics of success</li>\n\n<li> Documentation of business logic/requirements to ensure other contributors are able to step in to manage the business</li>\n\n<li> Drive routing reviews to understand root cause of call routing issues</li>\n\n<li> Translate business requirements into functional requirements/specifications</li>\n\n<li> Ability to manage, write, communicate changes to 'rules' driven systems</li>\n\n<li> Plan and manage numerous projects and ensure change requirements and target outcome are well defined</li> \n\n<li> Preferred location is Tucson, can also sit in San Diego, California (CA)</li>\n</ul>\n<strong>REQUIREMENTS:</strong>\n\n<ul>\n<li> Requires a Bachelor's degree</li>\n\n<li> 3-5 years of relevant business and project management in end customer care experience space for online products</li>\n\n<li> Experience working in customer care/service domain such as Call Center/IVR systems/call routing systems is a must</li> \n\n<li> Demonstrated ability to collaborate with teams across the company and across levels of management</li>\n\n<li> Strong business analysis skills (planning, feasibility assessments, requirements development, testing, problem solving, working across business and operations)</li>\n\n<li> Excellent attention to detail and results oriented with a track record demonstrating strong problem solving and analytical skills</li>\n\n<li> Strong oral, written and presentation skills; ability to communicate across all levels</li>\n\n<li> Ability to quickly learn complex business processes and understand the underlying transactional systems</li> \n\n<li> Linguistics or natural</li> \n</ul>\n\nKforce is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status."}