{"job title": "Risk Data Analyst", "company": "Kforce", "city state": "– West Valley City, UT", "rating": "3.7", "job description": "<strong>RESPONSIBILITIES:</strong><br><br>Kforce has a client in search of a Risk Data Analyst in West Valley City, Utah (UT).\n<br><br>\nEssential Job Functions: \n\n\n<ul>\n<li> Analytical Tools - Proficient with R or Python for statistics, and SQL for querying databases</li>\n<li> Analytical Approach - Synthesizes ideas and information required for process improvement into a manageable form</li>\n<li> Predictive Analytics - Knowledge of, experience with and ability to use the tools, processes and practices for predicting business trends and providing forecasts that drive business decisions and business planning</li>\n<li> Risk Management Banking - Knowledge of and ability to use tools, regulations, and business practices to assess and control an organization's exposure to risk</li>\n<li> Credit Risk - Knowledge of processes, tools, and techniques used to determine the degree of credit risk in a given transaction or customer relationship; ability to assess, rate and manage exposure to credit risk</li>\n<li> Performance Measurement - Knowledge of and ability to utilize a variety of methods to measure the performance on a particular portfolio against industry benchmarks and related parameters</li>\n<li> Business Analytics - Knowledge of technologies, techniques and practices for the evaluation of business performance data; ability to analyze business performance using advanced statistical methods to justify and drive future business planning decisions</li>\n<li> Mathematics of Financial Instruments - Knowledge of and ability to perform the mathematical calculations that underlie various financial instruments</li>\n<li> Operational Risk - Knowledge of policies and processes for operational risk management; ability to use tools, data, and best practices to identify, assess, and manage operational risk exposures</li>\n<li> Pricing Models and Analytics - Knowledge of pricing tools, techniques and methods; ability to assess analytical and pricing models through the use of statistical principles</li>\n</ul>\n<strong>REQUIREMENTS:</strong>\n\n<ul>\n<li> M.S. degree or Ph.D. in a related field preferred</li> \n\n<li> B.S. degree combined with robust experience and certifications will be considered</li>\n<li> Experience - 3-5 years, credit or portfolio risk</li> \n</ul>\n\nKforce is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status."}