{"job title": "Data Analyst Intern", "company": "Kforce", "city state": "– Marietta, GA", "rating": "3.7", "job description": "<strong>RESPONSIBILITIES:</strong><br><br>Kforce has a client that is looking to hire a Data Analyst Intern in Marietta, Georgia (GA). This is an immediate need. This internship could turn into a full-time position. The hiring manager will be interviewing candidates as early as next week. The manager is open to both full-time resources (working 40 hours a week) and part-time resources (working 25 - 30 hours a week). The manager will work with your schedule.\n<br><br>\nOverview:\n<br>\nThe Global Brand &amp; Product Development team is looking for a Data Analyst to dive into its data and identify problems and insights that can help improve product quality. In this role, you will be deployed to our cross-functional product teams and be responsible for connecting team members with data/analytics to help define problem, make decisions about product development, monitor/measure results &amp; KPIs, set goals, and communicate results.\n<br><br>\nIn this role, you will leverage tools like Tableau, SQL to acquire, analyze, and present data. You will do data deep dives to find meaning in the data, you will answer questions of the day, collaborate with the engineering team to translate the insight or voices of customer into product specifications.\n<br><br>\nMajor Tasks and Responsibilities:\n\n\n<ul>\n<li> 40%: Serve as a data/analytics resource on a cross-functional product team (work includes, but not limited to: query writing; defining &amp; documenting data/reporting requirements; analyze complex problems)</li>\n\n<li> 40%: Data mining of online review comments to generate insight of customer pain point, present data/findings in a meaningful and easily digestible way to engineering team to be incorporated in the product development and quality improvement</li>\n\n<li> 10%: Develop new data insight that can help identify the customer dis-satisfaction</li>\n\n<li> 10%: Support the business through ad-hoc inquiries and tasks</li>\n</ul>\n<strong>REQUIREMENTS:</strong>\n\n<ul>\n<li> Strong SQL skills</li>\n\n<li> Strong Excel skills</li>\n\n<li> Passion for data/analytics</li>\n\n<li> Data Visualization is preferred</li>\n</ul>\n\nKforce is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status."}