{"job title": "Team Expansion Data Analyst", "company": "KnowBe4", "city state": "– Clearwater, FL", "rating": "4.6", "job description": "KnowBe4, Inc. is a high growth information security company. We are the world’s largest provider of new-school security awareness training and simulated phishing. KnowBe4 was created to help organizations manage the ongoing problem of social engineering. Tens of thousands of organizations worldwide use KnowBe4’s platform to mobilize their end users as a last line of defense and enable them to make better security decisions, every day.\n<br><br>\n<strong>We are ranked #3 best place to work in technology nationwide by Fortune Magazine and have placed #1 or #2 in The Tampa Bay Best Workplaces Survey for the last three years. We also just had our 21st record-setting quarter in a row!</strong>\n<br><br>\nProvides analytical reporting, project management and recruitment support to the Team Expansion department. Researches and analyzes recruitment data to make recommendations, draw conclusions and create plans of actions.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n<li>Fully learn, understand and master KnowBe4’s recruitment process</li>\n<li>Become a Greenhouse SME so accurate data can easily be pulled from it and used to improve recruitment results</li>\n<li>Develop weekly, monthly, quarterly, annual and specialty reports and analysis as needed for the Team Expansion Department</li>\n<li>Track and analyze key metrics, like cost per hire, retention by referral source, time to fill, sourcing and channel effectiveness, diversity, etc.</li>\n<li>Analyze and report on the referral sources of candidates so spending can be optimized</li>\n<li>Reviews recruitment processes and recommends improvements based on statistical analysis and Greenhouse’s capabilities</li>\n<li>Develops, interprets and creates presentation materials for HR metrics, including turnover, retention, recruitment activities, etc.</li>\n<li>Examines and assists with identification of key trends in the data and create statistical summaries and special reports for functions and/or business units as needed</li>\n<li>Other duties assigned by the VP Expansion</li>\n</ul>\n<strong>Required Skills:</strong>\n\n<ul>\n<li>Bachelor's degree in related field or other equivalent degree required</li>\n<li>1-2 years of analytic and reporting experience</li>\n<li>Strong statistical, analytical and problem solving skills</li>\n<li>Demonstrated ability to analyze data and make appropriate recommendations</li>\n<li>Strong follow-through skills</li> \n\n<li>Excellent planning, organizational and prioritization skills; strong attention to detail.</li>\n<li>Excellent verbal and written communication skills required</li>\n<li>Advanced knowledge of Excel, Word, PowerPoint and other applications as needed for report preparation</li>\n</ul>\n<em>Note: An applicant assessment, background check and drug test may be part of your hiring procedure.</em>\n<br><br>\n<em>No recruitment agencies, please.</em>"}