{"job title": "Technical Data Analyst", "company": "Mattson Resources, LLC", "city state": "– Irvine, California", "rating": "4.5", "job description": "Aviation company in Irvine is seeking a Technical Data Analyst to join their team in Irvine, CA! This is a direct hire opportunity.\n<br><br>\nDuties:\n<br><br>\nFleet Utilization Tracking:\n<ul>\n<li>Load all monthly utilizations for MCAPs, Vermillions, and 3rd-party fleets to enable maintenance reserve billing, as well as, creating periodic Maintenance Reserve status reports and quarterly status reports to both MCAP and Vermillion and 3rd-party managed fleet owners.</li>\n</ul>\nMaintenance Reserve Invoicing:\n<ul>\n<li>Manage all office related Maintenance Reserve activities within the department.</li><li>Calculate and verify aircraft Maintenance Reserve adjustments and escalations and update the Company database accordingly.</li><li>Resolve any questions or differences regarding adjustments and escalations with our customers; if any arise.</li>\n</ul>\nResolve as required any discrepancies in MR payments with lessees and/or 3rd-party customers updating database to reflect payments:\n<ul>\n<li>Resolve any open issues with our customers about possible differences between invoiced amount and payment amount; if any arise.</li>\n</ul>\nMaintenance Letter of Credit Adjustment:\n<ul>\n<li>Calculate and verify aircraft Letters of Credit (LC) amounts and update the Company database accordingly.</li>\n</ul>\nProvide ad-hoc advice related to your area of control as required by Technical Department.\n<br><br>\nCash Flow Forecasting:\n<ul>\n<li>Assist in managing and directing all maintenance cash flow forecasting requested by the Sales, Marketing, and PPM departments by way of providing a comprehensive financial analysis of the maintenance cash flows in support of all leasing transactions.</li><li>Provide fleet maintenance cash flow forecasting to the Finance department using the companys Technical Cash Flow forecasting program to assist with the Cash In, Cash Out visibility for possible investment opportunities.</li>\n</ul>\nRequired Skills and Experience:\n<ul>\n<li>Minimum of 3 to 5 years experience in working with Excel sheets and/or financial analysis.</li><li>Intermediate to advanced level of Microsoft Excel.</li><li>Ability to read and understand fundamental contractual concepts.</li><li>A positive, team-based attitude.</li><li>Ability to effectively prioritize, multi-task and manage time.</li><li>Degree is preferred but not required.</li><li>Aviation industry experience and/or interest is preferred but not required.</li>\n</ul>\nJob Type: Full-time"}