{"job title": "Analyst - Data", "company": "Molex", "city state": "– Lisle, IL 60532", "rating": "3.6", "job description": "<strong>Job Title</strong>\n<br>\nAnalyst - Data\n<br><br>\n14-Aug-2018\n<br><br>\n<strong>Job Description</strong>\n<br>\n<strong>Position Overview:</strong> \n<br>\nMolex is seeking a dynamic and proactive Data Analyst that will add significant value in the area of SAP Master Data Management and SAP Vendor Data Management analysis on a global level. The Data Analyst will be part of a local and global team that is passionate about data analysis and data management to help support procurement related initiatives in our business and our business systems.\n<br><br>\nContacts for the Data Analyst will be Molex Internal team members, Supply Chain, external Suppliers, and IT personnel areas. Contact will be with all levels of the organization on data analysis and maintenance assignments.\n<br><br>\n<strong>Essential Functions:</strong>\n\n<ul>\n<li>Develop and implement data analysis collection systems (SharePoint List, Excel, Access, etc.) and other strategies that optimize statistical efficiency and master data quality.</li><li>Analyze procurement related master data (validation, business needs, etc.) to locate and define new process improvement opportunities. Work with team to implement and execute on new business rules.</li><li>Maintain procurement related master data in Procurement Systems.</li><li>Proficient with tables/relational database concepts and skills to analyze data.</li><li>Interpret data, analyze results using statistical techniques and provide ongoing reports. This also includes identification, analysis, and interpretation of trends or patterns within complex data sets.</li><li>Acquire data from primary or secondary data sources and maintain databases/data systems</li><li>Filter and “clean” data, and review computer reports, printouts, and performance indicators to locate and correct problems</li><li>Develop and Train the Indian (GTC) Master Data Team in master data requirements and techniques.</li><li>Lead the transfer of master data projects into the Indian Team (GTC).</li><li>Work closely with management to prioritize business and information needs</li><li>Utilize MS Office Skills, most importantly Excel and Word</li><li>Perform other related duties as assigned by management.</li>\n</ul>\n\n<strong>Job Number</strong>\n<br>\n<strong>6303BR</strong>\n<br><br>\n<strong>Career Field</strong>\n<br>\nProcurement / Buyer\n<br><br>\n<strong>Position Qualifications</strong>\n<br>\n<strong>Required Qualifications:</strong> \n\n<ul>\n<li>Bachelor’s Degree or 10+ years experience in master data analysis and management</li> <li>3+ years data analyst experience interfacing with business functional areas</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong> \n\n<ul>\n<li>SAP Procurement Master Data and Vendor Data applications experience, Supply Chain experience or master data experience in a large scale multi-national SAP ERP system</li> <li>Experience with SAP applications and SAP subsystems to obtain data extractions and provide analytics</li> \n</ul>\n\n<strong>Skills and Abilities:</strong> \n\n<ul>\n<li>Adept at queries, report writing, and presenting findings</li><li>Good knowledge of reporting tools, preferably SAP BW/BO or any other reporting tool knowledge</li><li>Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy</li><li>Critical Thinking: ability to look at the numbers, trends, and data and come to new conclusions based on the findings</li><li>Comprehensive knowledge of the business procurement processes around purchase order processing, supplier acknowledgments, ASNs, and reporting</li><li>Ability to grasp business problems, goals, objectives, and provide alternative solutions</li> <li>Good interpersonal skills to work effectively with different teams within the organization to achieve common goals and respond quickly and positively to opportunities</li> <li>Effective communication skills (verbal and written) for clear and concise communications</li> <li>Good organizational skills to prioritize and manage workload within changing environment and meet deadlines in a timely manner</li>\n</ul>\n\n<br>\n<strong><em>About Molex…</em></strong><em>\n<br>\nMolex brings together innovation and technology to deliver electronic solutions to customers worldwide. With a presence in more than 40 countries, Molex offers a full suite of solutions and services for many markets, including data communications, consumer electronics, industrial, automotive, commercial vehicle and medical.</em> \n<br><br>\n<strong><em>Learn more...</em></strong>\n<br>\nVisit us: www.molex.com\n<br>\nTwitter: www.twitter.com/molexconnectors\n<br>\nYouTube: www.youtube.com/molexconnectors\n<br>\nFacebook: www.facebook.com/molexconnectors\n<br>\nLinkedin: www.linkedin.com/company/molex\n<br>\nOur Blog: www.connector.com\n<br>\nMolex History: http://history.molex.com/\n<br><br>\n<strong>Location</strong>\n<br>\nLisle, IL 60532\n<br><br>\n<strong>Molex, LLC is an affirmative action/equal opportunity employer.</strong>\n<br>\nWe are an equal opportunity employer. Minority/Female/Disabled/Veteran\n<br>\nExcept where prohibited by state law, all offers of employment are conditioned upon successfully passing a drug test.\n<br>\nThis employer uses E-Verify. Please visit the following website for additional information: E-Verify\n<br>"}