{"job title": "Business Data Analyst", "company": "Prospect 33", "city state": "– Morrisville, North Carolina", "rating": "4.8", "job description": "Prospect 33 is looking to add a number of analytically minded professionals to a growing team within Global Markets in Raleigh, NC. The team is co located across New York and North Carolina with senior management across both offices.\n<br><br>\nAs we help define the current state of the organizations Data Strategy it is important that the candidates have strong interpersonal skills coupled with a background comfortable dealing with large data sets. As you will be working in a global environment, documentation skills will be at the forefront. It is highly preferred that you bring prior FS knowledge, preferably working for a larger banking organization.\n<br><br>\nThe role is for a data analyst within the Data Analytics team who will be focused on;\n<ul>\n<li>You will be designing and building business intelligence report and visualizations to meet business stakeholders requirements.</li> <li>You will be co-ordinating and supporting education, training and up-skilling of wider GM Operations team around data and analytics.</li> <li>You will be collaborating with a variety of business and IT departments to overcome challenges faced through the implementation and maintenance of this capability.</li> <li>You will be implementing new statistical or other mathematical methodologies as needed for specific models or analysis.</li> <li>You will be optimizing joint development efforts through appropriate database use and project design.</li>\n</ul>\nResponsibilities include;\n<ul>\n<li>Design and build business intelligence report and visualizations to meet business stakeholders requirements.</li> <li>Co-ordinate and support education, training and up-skilling of wider GM Operations team around data and analytics.</li> <li>Collaborate with a variety of business and IT departments to overcome challenges faced through the implementation and maintenance of this capability.</li> <li>Keep up-to-date with latest technology trends.</li><li>Implement new statistical or other mathematical methodologies as needed for specific models or analysis.</li><li>Optimize joint development efforts through appropriate database use and project design.</li>\n</ul>\n\n<strong>#LI-CF1</strong>"}