{"job title": "Environmental Scientist I", "company": "Advantage Engineers, LLC", "city state": "– West Chester, PA", "rating": "3.2", "job description": "<strong>ENVIRONMENTAL SCIENTIST I IN WEST CHESTER, PENNSYLVANIA WITH ADVANTAGE ENGINEERS, LLC</strong>\n<br><br>\n<strong>WHAT YOU'LL DO</strong>\n<br><br>\nCompany Overview\n<br><br>\nAdvantage Engineers is a rapidly expanding and dynamic professional engineering consulting firm within the fields of telecommunications, environmental, geotechnical, construction observation and materials testing. Advantage Engineers designs, develops, and implements a wide-array of innovative, high-quality and effective specialty solutions that deliver turn-key results with full-scope consultation services. The firm consists of 15 offices from New York to California.\n<br><br>\nAdvantage Engineers is dedicated to evolving its technical services in conjunction with the future advancements in the field and is continuously looking to better serve its clients. Our people have a passion for solving problems and are committed to taking initiative and providing on-demand services. We are dedicated to working as a team, making customer service and fulfillment a personal mission, and operating in the best interest of our customers and fellow coworkers. If you want to develop as a part of a team that is in growth-mode, then we're looking for the best to join us.\n<br><br>\nJob Overview\n<br>\nUnder direction of the supervisor, the Environmental Scientist I is responsible for learning the practical application of engineering, scientific, and regulatory principles through application of these principles; participating in the collection, processing, and evaluation of data; and assisting in the initial preparation of technical reports and applications, and other project documents (as this entry level). The individual's degree of involvement will be based upon his/her exposure and experience with respect to the assigned work.\n<br><br>\nJob Specifics\n<br><br>\nThe specific responsibilities of the Environmental Scientist I include, but are not limited to, the following:\n<br><br>\nCollect, analyze, and prepare raw data into workable form for engineering/scientific project reports, plans, specifications, permits, cost estimates, and other project documents.\n<br>\nParticipate in field work as necessary/required in order to accomplish tasks assigned by project team leadership.\n<br>\nHelp to coordinate assigned tasks with staff to successfully complete discreet tasks as assigned on projects.\n<br>\nReport progress to team leadership.\n<br>\nMaintain and utilize working knowledge of accepted engineering design, scientific principles, regulatory programs, and field standards and practices in the execution of design work as directed by supervisor and conform to industry standards.\n<br>\nProvide input and assistance in investigating new techniques and methods that may increase the Company's efficiency and incorporate cutting edge applications to arrive at the desired result on projects."}