{"job title": "Scientist - Pivotal Drug Substance Technologies", "company": "Amgen", "city state": "– Thousand Oaks, CA", "rating": "3.7", "job description": "Amgen's Process Development organization is seeking a Scientist to join the Pivotal Drug Substance Technologies team responsible for developing innovative solutions to prepare our small molecule and hybrid drug candidates. The scientist will be principally concerned with translating developmental processes into commercial manufacturing reality using synthetic organic chemistry through scientific expertise, engineering innovation and deployment of manufacturing technologies.<br> <br><br> <br>Scientific/Technical<br> <br><br> <br>*Develops technology to manufacture drug candidates in a practical, efficient, and safe manner.<br> <br><br> <br>*Champions innovative applications of synthetic chemistry, pharmaceutical manufacturing, process analytical technologies (PAT), automation and data analysis.<br> <br><br> <br>*Provides significant contributions to drug substance development teams (e.g., product and process development teams, product quality teams) by providing drug substance updates, documentation, data interpretation, technical recommendations, etc.<br> <br><br> <br>*Serves as a technical expert and keeps current in organic chemistry and applications of process technology in pharmaceutical development including literature and technology development.<br> <br><br> <br>*Improves the technical or scientific capabilities of the department and routinely answers questions on or resolves scientific/technical issues.<br> <br><br> <br>*Collaborates in cross-functional CMC teams to develop Amgen's pipeline.<br> <br><br> <br>*Works cross-functionally to deliver CMC regulatory documents and supporting documentation in support of Amgen's regulatory filings.<br> <br><br> <br>*Delivers processes amenable to cGMP operation and carry out deliveries of drug substance in a cGMP manufacturing environment.<br> <br><br> <br>**Basic Qualifications:**<br> <br><br> <br>Doctorate degree or Doctorate degree by October 2018<br> <br><br> <br>OR<br> <br><br> <br>Master's degree and 4 years of scientific experience<br> <br><br> <br>OR<br> <br><br> <br>Bachelor's degree and 6 years of scientific experience<br> <br><br> <br>**Preferred Qualifications:**<br> <br><br> <br>*Doctorate degree in Organic Chemistry, Medicinal Chemistry or Synthetic Chemistry<br> <br><br> <br>*Post-doctoral research experience<br> <br><br> <br>*Track record of demonstrated scientific accomplishments in the field of organic chemistry<br> <br><br> <br>*Ability to champion new technologies<br> <br><br> <br>*Experience in the pharmaceutical / biotech or related industry that includes participation and contribution to scientific project teams<br> <br><br> <br>*Familiarity with common industrial unit operations including crystallization (batch and continuous mode), filtration and drying<br> <br><br> <br>*Familiarity with the use of design of experiments (DoE) and Process Analytical Technology (PAT) techniques<br> <br><br> <br>*Familiarity with laboratory automation, data analysis and visualization techniques and tools<br> <br><br> <br>*Familiarity with Environmental Health and Safety expectations for chemical laboratories<br> <br><br> <br>*Familiarity with current Good Manufacturing Practices for preparing drug substances and intermediates<br> <br><br> <br>*Demonstrated ability to effectively work in a fast-paced team environment<br> <br><br> <br>*Excellent interpersonal, presentation, written and verbal skills<br> <br><br> <br>*Knowledge of basic office and chemistry software including Microsoft Word, Excel, PowerPoint, ChemDraw, and SciFinder<br> <br><br> <br>Amgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status."}