{"job title": "Scientist II, Translational Genome Sciences", "company": "Biogen", "city state": "– US-MA-Cambridge", "rating": "3.4", "job description": "<br><b></b><br>Scientist II, Translational Genome Sciences<br><br><b></b><br>10-Jul-2018<br><br><b>Location</b><br>US-MA-Cambridge <br><br><b>Job Description</b><br>The successful candidate will work closely with disease area biologists, genomics wet lab scientists, and computational and systems biology colleagues to design and analyze data from genomics projects in support of drug programs at all stages of the discovery and development pipeline. <br>Requirements and desired traits:<br>-Hands-on experience with RNA-Seq transcriptome analysis to address biological problems of importance to human disease is required. <br>-Hands-on experience with analysis of both short and long read DNA-Seq data (e.g., Illumina, Pac-Bio, Nanopore) for mutation and genome mapping is required.<br>-Extensive experience developing statistical analysis workflows in R or Python is required.<br>-Experience with genomics data visualization tools such as genome browser is required. Knowledge of either R or Python programming is required.<br>-Knowledge of UNIX command line is required.<br>-Experience in the application of computational, mathematical, and statistical approaches towards understanding problems in biology is required.<br>-Training in statistics and machine learning is desired. Experience with network analytics and integration of multi-omic data is desired.<br>-Experience with single cell / nuclear RNA-Seq and epigenomic analysis workflows (e.g., ATAC-Seq, DNA methylation analysis) is highly desired. <br>-Expertise with gene network analysis algorithms (e.g., WGCNA, Speakeasy) and multi-omic data integration (e.g., RNA-Seq, proteomic, metabolomic) is desired.<br>-Direct experience applying these analysis methods to neuroscience research is highly desired.<br>-A solid understanding of experimental molecular biology and biochemistry, particularly high-throughput methods such as next generation sequencing, is required.<br>-Hands-on experience with the information technology aspects of data collection, organization, and integration, as well as the systems and tools required for data analysis, is required.<br>-Demonstrated ability to work collaboratively within multi-disciplinary teams is required.<br>-Excellent communication and presentation skills are required, including the ability to translate the technical terminology of quantitative sciences into language understandable by scientists with expertise in other disciplines. A demonstrated track record of creativity, innovation, and delivery of real world value, including at least one relevant peer-reviewed scientific publication, is required.<br><br><b>Requisition Number</b><br>35290BR<br><br><b>Employment Category</b><br>Full-Time Regular <br><br><b>External Posting Title</b><br>Scientist II, Translational Genome Sciences<br><br><b>Job Category</b><br>Research &amp; Development<br><br><b>Qualifications</b><br>Bachelors or equivalent degree in quantitative scientific disciplines and/or technology areas such as computer science, bioinformatics, physics, engineering, or chemistry, or in biology / neuroscience with significant emphasis on genomics and bioinformatics, is required. Bachelors-level applicants will be expected to have 6 to 8 years of post-graduate work experience and a solid publication record.<br><br><b>Education</b><br>M.S. with 6 to 8 years post-graduate experience, and/or Ph.D with 5 years post-graduate experience, is highly desired.<br><br><b>Experience Level</b><br>Mid-Senior Level <br><br><b>Summary</b><br>We seek a talented and highly collaborative computational biologist that has extensive experience with 1) RNA Sequencing for transcriptome analysis, and 2) applying short and long read DNA-Seq methods for mutation mapping and viral genome characterization, and a keen interest in applying these methods to the discovery and development of novel therapeutics for the treatment of neurodegenerative diseases.<br>"}