{"job title": "Data Science Director", "company": "Black &amp; Veatch", "city state": "– KS-Overland Park", "rating": "3.6", "job description": "<div>Business Title Data Science Director</div> <div> Requisition Number 36465BR</div> <div> Salary Plan ITS</div> <div> Grade 008</div> <div> Division Corporate-Finance</div> <div> Employee Type Full Time</div> <div> Visa Sponsorship Available? No</div> <div> Relocation Available? No</div> <div> Division Marketing Statement NextGen Digital is a new and growing team within Black &amp; Veatch focused on innovation and the use of emerging technology around data and automation. We focus on ensuring that Black &amp; Veatch is disrupting ourselves and setting the course for the future of doing work at Black &amp; Veatch. At NextGen Digital, we believe that data and automation fuel innovation.</div> <div> Primary Purpose NextGen Digital is a new and growing team within Black &amp; Veatch focused on innovation and the use of emerging technology around data and automation. We focus on ensuring that Black &amp; Veatch is disrupting ourselves and setting the course for the future of doing work at Black &amp; Veatch. At NextGen Digital, we believe that data and automation fuel innovation.\n<br><br>\nWe are looking for a results-driven technology leader who is passionate about applying technology to transform our businesses. He/She will be responsible for developing and managing the end-to-end Data Strategy for NextGen Digital, including technology, analytics, data science, and talent. He/She will also have a strong understanding of the latest trends and how to incorporate relevant emerging technologies. He/she will be a key evangelist for the applied use of data and insights to systematically drive efficient decision-making and optimization against agreed upon performance metrics.</div> <div> Principal Duties and Responsibilities • Lead the development of organization-wide capability in the use of data analytics, machine learning and artificial intelligence for evidence-based decision making, including for business performance metrics. Create and sponsor the Machine Learning UserX group at B&amp;V. Create a training program around machine learning using open source tools such as Orange to generate the skills for “machine learning” that are being developed currently around “data visualization” via PowerBI.\n\n\n<ul>\n<li>Bridge the role of business and technology and align a coherent data and automation framework to the strategic needs of the organization.</li>\n<li>Collaborate with the business technology vision and planning process that will regularly evaluate existing technology, information systems, and staffing, research new solutions and technologies, and recommend changes.</li>\n<li>Collaborate with business leaders and the CIO support team in planning and implementing enterprise information systems to support both distributed and centralized machine learning and augmented intelligence. Fill in gaps by converting important but “messy” data into usable data.</li>\n<li>Provide an environment where data and information are accessible and appropriately shared across enterprise.</li>\n<li>Lead and manage a team of data analysts, data engineers and data scientists in data and analytic projects.</li>\n<li>Identify new opportunities pertaining to the use of information assets and exploit these to achieve efficiency and effectiveness and represent data as a strategic business asset.</li>\n<li>Work closely with key internal stakeholders to identify and meet data needs and analysis to support operational needs throughout the organization.</li>\n<li>Enhance the stability of the data environment through innovation, and work to eliminate manual inputs and data manipulations.</li>\n<li>Help to simplify and update an extremely complex legacy environment and articulate long-term vision in a way to create buy-in and following.</li>\n<li>Review potential 3rd party software acquisitions for technology, business requirements, and maintenance, soliciting involvement and participation of others as appropriate.</li>\n<li>Maintain knowledge of current technology. Evaluate alternatives, perform appropriate cost-benefit analysis, and recommend solutions that maximize effectiveness and minimize costs commensurate with acceptable risk.</li>\n<li>Ensure the protection of company IT application assets, their integrity, security and privacy.</li>\n<li>Foster and promote an environment of superior business partner collaboration.</li></ul></div> <div> Minimum Qualifications Bachelor's Degree required. At least 12-15 years of similar experience in industries further along in their data maturity such as healthcare, banking, or manufacturing. Must be able to develop and manage a team of data engineers and scientists, converting ideas from the business unit into work that can be delivered, then managing the delivered data tools once in production. NextGen Digital's data activities will involve varying levels of ease relative to data mining and this role needs to be able to triage the data and bring it into a form that allows for higher level functions. This role will also be scanning the horizon for new AI based tools that will make our data activities more effective.\n\n\nAll applicants must be able to complete pre-employment onboarding requirements (if selected) which may include any/all of the following: criminal/civil background check, drug screen, and motor vehicle records search, in compliance with any applicable laws and regulations.</div> <div> Preferred Job Qualifications • Master’s Degree a plus.\n\n\n<ul>\n<li>Relevant certifications preferred.</li>\n<li>Proven experience in driving transformational change at global scale and positioning the company to incorporate emerging technologies around the use of cloud, machine learning, augmented intelligence, and data analytics platforms.</li>\n<li>Collaborative leadership orientation; must be able to build consensus.</li>\n<li>Strong business acumen; demonstrates willingness to deeply understand the B&amp;V business; understands the dynamics of projects and their impact on B&amp;V success. Also understands businesses on a global scale.</li>\n<li>Strong communication skills; must also be able to effectively communicate technical concepts to executives and general audiences. Has experience interfacing with and presenting to C-level executives.</li>\n<li>Demonstrates innovative forward thinking; has good judgment about which creative ideas work and suggestions will work, has a sense about managing the creative process of others, can facilitate effective brainstorming, and can project how potential ideas may play out in the marketplace.</li>\n<li>Demonstrates strategic agility; sees ahead clearly, can anticipate future consequences and trends accurately, has broad knowledge and perspective, is future oriented, can articulately paint credible pictures and visions of possibilities and likelihoods.</li>\n<li>Is a change agent; demonstrates the ability to research, design, and build organizational support for and implementation of corporate practices/programs and cross functional initiatives.</li></ul></div> <div> EEO Statement Equal Opportunity Employer – Minority/Disabled/Veterans/Females</div> <div> Locations KS-Overland Park</div> <div> Recruiter Joseph Raschke</div> \n"}