{"job title": "Associate Research Scientist 1 or 2", "company": "Bristol Myers Squibb", "city state": "– Redwood City, CA", "rating": "3.7", "job description": "Bristol-Myers Squibb is a global biopharmaceutical company whose mission is to discover, develop and deliver innovative medicines that help patients prevail over serious diseases.\n<br><br>\nOne shared journey is moving us forward at Bristol-Myers Squibb. Around the world, we are passionate about making an impact on the lives of patients with serious disease. Empowered to apply our individual talents and ideas so that we can learn and grow together. Driven to make a difference, from innovative research to hands-on community support. Bristol-Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees the resources to pursue their goals, both at work and in their personal lives.\n<br><br>\nResearch associates required to execute preclinical studies to provide in vivo data on drug candidates\n<br><br>\nThis individual contributor role will collaborate across groups to plan, execute and analyze in vivo studies.\n<br><br>\nWithin a dynamic and engaging environment, you will interact with scientific investigators to plan and execute preclinical mouse studies. Strong technical skills and excellent communication ability are required. We value both what you do and how you do it.\n<br><br>\n<strong>Requirements:</strong>\n<br><br>\nExperience with preclinical mouse models - oncology, immuno-oncology or immunology models using biologics and small molecules.\n<br><br>\nBlood collection techniques\n<br><br>\nDosing techniques\n<br><br>\nTissue collection\n<br><br>\n<strong>Data Analysis:</strong>\n<br><br>\nExcel\n<br><br>\nStudyLog\n<br><br>\nSpotfire\n<br><br>\nPrizm\n<br><br>\nand similar software\n<br><br>\nBachelor's degree with 4+ years experience working with mouse models required.\n<br><br>\nCompensation commensurate with qualifications\n<br><br>\nBristol-Myers Squibb is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status."}