{"job title": "Senior Research Scientist (Pharmacology )", "company": "Charles River Laboratories", "city state": "– Ashland, OH", "rating": "3.0", "job description": "Senior Research Scientist (Pharmacology )\n<br><br>\nReq ID #: 38536\n<br><br>\n<strong>Location:</strong>\n<br><br>\nAshland, OH, US, 44805\n<br><br>\nFor 70 years, Charles River employees have worked together to assist in the discovery, development and safe manufacture of new drug therapies. When you join our family, you will have a significant impact on the health and well-being of people across the globe. Whether your background is in life sciences, finance, IT, sales or another area, your skills will play an important role in the work we perform. In return, we?ll help you build a career that you can feel passionate about.\n<br><br>\nJob Summary\n<br><br>\nWe are seeking a experienced Senior Research Scientist for our Safety Assessment group, site located in Ashland, Ohio.\n<br><br>\nServe as a scientist in the conduct of assigned nonclinical research studies at all levels of complexity, to include study management, interpretation and reporting of study data, and assuring the regulatory compliance of these projects, as appropriate. Additional responsibilities include serving as a primary scientific contact for key clients and the on-site support of their programs, as well as the support of specialty studies.\n<br><br>\n<strong>ESSENTIAL DUTIES AND RESPONSIBILITIES:</strong>\n<br><br>\n+ Function independently as a study director in the direction and execution of assigned studies in compliance with GLP regulations as they apply to the conduct of nonclinical research.\n<br><br>\n+ Participate in the proposal management and bid development process, serving as a key scientific contact for new business generated from established business relationships.\n<br><br>\n+ Participate in and coordinate all phases of the study planning process with appropriate departments.\n<br><br>\n+ Design preclinical studies, generate high-quality protocols, amendments, reports, and develop appropriate changes to study design for assigned projects and programs.\n<br><br>\n+ Review, interpret, integrate, and present data on assigned studies.\n<br><br>\n+ Provide technical and scientific guidance to the research staff.\n<br><br>\n+ May supervise research and/or scientific staff, as appropriate for scope of responsibilities.\n<br><br>\n+ May direct activities of assigned group(s) to ensure effective performance of function.\n<br><br>\n+ Interview and select qualified exempt-level departmental personnel. Recommend, review, and approve personnel actions, including hiring, promotions and raises. Partner with Human Resources in the handling of disciplinary issues. Prepare and/or approve appropriate personnel action paperwork.\n<br><br>\n+ Perform testing facility management duties for the site as delegated by PCS senior management.\n<br><br>\n+ Perform all other related duties as assigned.\n<br><br>\n<strong>QUALIFICATIONS:</strong>\n<br><br>\n+ Education:Bachelor's degree (B.S./B.A.) or equivalent in a scientific related discipline. Related Master's degree (M.S./M.A.) or Ph.D./D.V.M. preferred.\n<br><br>\n+ Experience: Minimum of 9 to 12 years related experience in the contract research, academic, or pharmaceutical industry. Prefer 20 years? experience in the CRO and10 years? experience in safety pharmacology with a focus on telemetry set up and data collection and ECG analysis.\n<br><br>\n+ Experience conducting data acquisition software validations\n<br><br>\n+ An equivalent combination of education and experience may be accepted as a satisfactory substitute for the specific education and experience listed above\n<br><br>\nAbout Safety Assessment\n<br><br>\nCharles River is committed to helping our partners expedite their preclinical drug development with exceptional safety assessment services, state-of-the-art facilities and expert regulatory guidance. From individual specialty toxicology and IND enabling studies to tailored packages and total laboratory support, our deeply experienced team can design and execute programs that anticipate challenges and avoid roadblocks for a smooth, efficient journey to market. Each year approximately 120 investigational new drug (IND) programs are conducted in our Safety Assessment facilities.\n<br><br>\nAbout Charles River\n<br><br>\nCharles River is an early-stage contract research organization (CRO). We have built upon our foundation of laboratory animal medicine and science to develop a diverse portfolio of discovery and safety assessment services, both Good Laboratory Practice (GLP) and non-GLP, to support clients from target identification through preclinical development. Charles River also provides a suite of products and services to support our clients? clinical laboratory testing needs and manufacturing activities. Utilizing this broad portfolio of products and services enables our clients to create a more flexible drug development model, which reduces their costs, enhances their productivity and effectiveness to increase speed to market.\n<br><br>\nWith over 13,000 employees within 80 facilities in 23 countries around the globe, we are strategically positioned to coordinate worldwide resources and apply multidisciplinary perspectives in resolving our client?s unique challenges. Our client base includes global pharmaceutical companies, biotechnology companies, government agencies and hospitals and academic institutions around the world.\n<br><br>\nAt Charles River, we are passionate about our role in improving the quality of people?s lives. Our mission, our excellent science and our strong sense of purpose guide us in all that we do, and we approach each day with the knowledge that our work helps to improve the health and well-being of many across the globe. We have proudly supported the development of 80% of the drugs approved by the FDA in 2017.\n<br><br>\nFor more information, please visitwww.criver.com.\n<br><br>\nEqual Employment Opportunity\n<br><br>\nCharles River Laboratories, Inc. is an Equal Opportunity Employer M/F/Disabled/Vet"}