{"job title": "Application Development Scientist, Adhesives", "company": "CPS, Inc.", "city state": "– Johnson City, TN", "rating": "3.9", "job description": "<strong>Application Development Scientist, Adhesives</strong>\n<br><br>\nThe Application Development Scientist, Adhesives will have responsibility for applications research and development supporting existing and developing businesses within company related to polymers, adhesives and tackifier resins. This position will also provide direct customer technical service for company’s polymers, adhesives and tackifier resins product portfolio. The ideal candidate will also have working knowledge of thermoplastic elastomer compounding markets and materials, and extrusion and injection molding applications. The selected individual for this position will also be responsible to translate market needs into product concepts and subsequently develop the concepts into commercial products. Candidates should be able to communicate effectively and function in an innovative, fast-paced, multidisciplinary team environment. This will be the 7th scientist in this group along with 6 technicians. The technicians will do most of the hands-on work. Stage Gate is used extensively in this group. Projects run from 3 months to 1 year and each person has about 2 projects at a time. This person will be a project leader on some projects and a project member on others.\n<ul>\n <li>Have a deep understanding of the functional attributes of a wide range of polymers, adhesives and tackifier resins materials relevant to company’s technologies</li> <li>Translate fundamental knowledge to the development of new applications and the identification of new market platforms</li> <li>Develop an understanding of end-user requirements and testing procedures to determine how company product offerings can enhance adhesive applications and performance</li> <li>Identify needs and opportunities through direct interactions with customers, sales and marketing teams with the ability to translate those unmet needs into differentiated new product or service solutions</li> <li>Ability to work with and connect seemingly unrelated pieces of information</li> <li>Translate ideas and concepts into detailed technical work plans that allow a Technician resource to safely and effectively execute process chemistry or applications development</li> <li>Provide technical support for customer inquiries and complaints</li> <li>Assist customers with Adhesives application development and scale up</li> <li>Provide plant support for manufacturing and process optimization of existing and new products</li> <li>Prepare technical presentations and supporting literature to enable customer engagement</li> <li>Protect intellectual property through patent applications and communicate relevant technical data through presentations at external customers’ sites</li> <li>Represent the company at industry events and other forums</li> <li>Lead multidisciplinary new product development project teams</li> <li>Travel (up to 25% of the time) to Domestic and International locations under short notice. This scientist will be giving presentations to customers. The Applications Scientist will also be supporting sales / marketing</li>\n</ul>\n**If you’d like to hear more about this opportunity and others we are currently working on, please contact Larry Riederer at 815.756.1221 / larry@cps4jobs.com.\n<br><br>\nJO: 289.18LR\n<br>\n#LI-LR1\n<br><br>\n<strong>Requirements:</strong>\n<ul>\n <li>MS/PhD degree in Polymer Science / Engineering, Materials Science, Chemical Engineering, Chemistry or related field from an accredited college or university</li> <li>Minimum of 3 years of experience with a PhD, or 5 years of experience with a Master’s degree, of industrial experience in the adhesives or polymers industries. A broad range of adhesives would be best. They would prefer someone from a customer instead of a competitor. End use knowledge is important</li> <li>Broad working knowledge in a wide range of polymer science skills including: structure-property relationships, polymer physics, characterization, mechanics of materials, and polymer testing. Besides adhesives these tackifiers go into power tools, shoes and toothbrushes</li> <li>Excellent judgment and relational abilities. Able to collaborate with peers of various technical backgrounds and fields of expertise to enable effective product development</li> <li>Must demonstrate excellence around professional follow-through and achieving timely closure on issues and assignments. Must be customer focused and have leadership potential</li> <li>Strong interpersonal and communication skills</li> <li>Previous project leadership in an industrial setting is preferred</li> <li>Quickly assimilates new information</li> <li>High level of motivation, initiative and sense of urgency</li> <li>Flexible to provide first-hand presence and effective support in multiple labs and facilities</li> <li>Complete fluency in English, including good verbal and written technical communications</li>\n</ul>\n**If you’d like to hear more about this opportunity and others we are currently working on, please contact Larry Riederer at 815.756.1221 / larry@cps4jobs.com.\n<br><br>\nJO: 289.18LR\n<br>\n#LI-LR1\n<br><br>\n<strong>Requirements:</strong>\n<ul>\n <li>MS/PhD degree in Polymer Science / Engineering, Materials Science, Chemical Engineering, Chemistry or related field from an accredited college or university</li> <li>Minimum of 3 years of experience with a PhD, or 5 years of experience with a Master’s degree, of industrial experience in the adhesives or polymers industries. A broad range of adhesives would be best. They would prefer someone from a customer instead of a competitor. End use knowledge is important</li> <li>Broad working knowledge in a wide range of polymer science skills including: structure-property relationships, polymer physics, characterization, mechanics of materials, and polymer testing. Besides adhesives these tackifiers go into power tools, shoes and toothbrushes</li> <li>Excellent judgment and relational abilities. Able to collaborate with peers of various technical backgrounds and fields of expertise to enable effective product development</li> <li>Must demonstrate excellence around professional follow-through and achieving timely closure on issues and assignments. Must be customer focused and have leadership potential</li> <li>Strong interpersonal and communication skills</li> <li>Previous project leadership in an industrial setting is preferred</li> <li>Quickly assimilates new information</li> <li>High level of motivation, initiative and sense of urgency</li> <li>Flexible to provide first-hand presence and effective support in multiple labs and facilities</li> <li>Complete fluency in English, including good verbal and written technical communications</li>\n</ul>\n**If you’d like to hear more about this opportunity and others we are currently working on, please contact Larry Riederer at 815.756.1221 / larry@cps4jobs.com.\n<br><br>\nJO: 289.18LR\n<br>\n#LI-LR1"}