{"job title": "Senior Scientist Pharmacovigilance", "company": "Daiichi Sankyo Inc.", "city state": "– Basking Ridge, NJ", "rating": "3.0", "job description": "**9222BR**<br> <br>**Auto req ID:**<br> <br><br> <br>9222BR<br> <br><br> <br>**Job Description:**<br> <br><br> <br>**Join a Legacy of Innovation 110 Years and Counting!**<br> <br><br> <br>With over 100 years of scientific expertise and a presence in more than 20 countries, Daiichi Sankyo and its 15,000 employees around the world draw upon a rich legacy of innovation and a robust pipeline of promising new medicines to help people. In addition to a strong portfolio of medicines for hypertension and thrombotic disorders, under the Group?s 2025 Vision to become a ?Global Pharma Innovator with a Competitive Advantage in Oncology,? Daiichi Sankyo research and development is primarily focused on bringing forth novel therapies in oncology, including immuno-oncology, with additional focus on new horizon areas, such as pain management, neurodegenerative diseases, heart and kidney diseases, and other rare diseases.<br> <br><br> <br>**Job Summary**<br> <br><br> <br>This position performs and functions as the subject matter expert in ICSR processing. This position has primary responsibility for the daily triage of incoming ICSRs, bulk reporting assignment, and daily ICSR inquiries from CROs/vendors. This position may also include serving as PV Representative on study teams, compiling SAE section of IND report and oversight and review of assigned NDA PADERs. This level interacts with the CSPV team and has interactions with other DS affiliate sites. This level also interacts and participates on interdepartmental teams and reviews and troubleshoots CRO/vendor case processing. This position is responsible for handling complex spontaneous and clinical ICSR issues, internal and external case processing inquiries according to experience, escalating problems to Level III as needed. Supervisory/management/project manager experience preferred. This position performs SAE reconciliation, workflow monitoring for partner/regulatory compliance, and ICSR CAPA management.<br> <br><br> <br>**Responsibilities**<br> <br><br> <br>1. Case Processing: Serves as the subject matter expert for this area, conducts complex case processing, review, and submission of ICRs; and performs Triage and review of Local Labeling and Bulk Reporting Argus functions. Adverse event case processing for clinical and spontaneous cases, including case data collection and entry into the global safety database. Entry includes medical history, laboratory data and concomitant and co-suspect drug products. Includes the review and evaluation of event(s) to determine seriousness criteria and listedness according to DSI product information. Requires knowledge and use of MedDRA and WHO-Drug dictionaries for coding of adverse events, medical history, lab data and co-suspect and concomitant medications. Ensures case details are complete, initiates follow up on reports as needed, and prepares adverse event reports, including Analysis of Similar Events (AOSE) as applicable, and submissions to partners, investigators, and as required ensuring compliance with regulatory reporting. Review of cases processed by vendors.<br> <br>2. CRO/Vendor Case Processing Oversight: In addition to review of vendor prepared cases assigned, is daily point of contact for ICSR case processing inquiries from vendors on coding and data entry conventions. May collaborate with PV sub teams to develop and present vendor training (and retraining as indicated) according to business need and experience.<br> <br>3. PV Representative on Study Teams: Ad hoc representative on Phase 2?3 study teams which includes attendance and participation in multidisciplinary study team meetings, providing updates to team and CSPV group as needed and escalating PV issues identified by the study team as required. May participate in study startup activities including case review and feedback. This assignment would include query oversight and SAE reconciliation as applicable.<br> <br>4. Case Processing Training: Participates in developing and delivering case processing training to case processing staff , mentoring new hires and vendors as needed.<br> <br>5. Aggregate Reports: Review and oversight of the SAE section of IND report(s) and oversight and review of assigned NDA PADERs.<br> <br>6. Case Processing Policies and Procedures: Participates in development and update of case processing process guides.<br> <br><br> <br>**Qualifications**<br> <br><br> <br>Education and Experience<br> <br><br> <br>+ Bachelor?s in nursing, pharmacy, or healthcare related field, minimum of four (4) years of senior level PV experience and strong knowledge of FDA regulations, clinical, and safety databases<br> <br><br> <br>Competencies<br> <br><br> <br>+ Consistently monitors individual and vendor/CRO work to ensure timely completion of high quality deliverables.<br> <br>+ Suggests innovative solutions to improve efficiency at the functional level.<br> <br>+ Investigates complex issues thoroughly and formulates multiple potential solutions.<br> <br>+ Possesses a proficient knowledge of pharmacology, clinical research and medical terminology, global data entry conventions and systems for application in daily work and within study teams.<br> <br>+ Communicates effectively within team, cross functionally and consistently demonstrates clear verbal and written communication skills with internal and external stakeholders.<br> <br>+ Effectively manages shifting priorities.<br> <br>+ Demonstrates a comprehensive understanding of the functional roles within the clinical trial process.<br> <br><br> <br>Daiichi Sankyo, Inc., is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected veteran status, age, or any other characteristic protected by law.<br> <br><br> <br>**Job Title:**<br> <br><br> <br>Senior Scientist Pharmacovigilance<br> <br><br> <br>**City:**<br> <br><br> <br>Basking Ridge<br> <br><br> <br>**Functional Area:**<br> <br><br> <br>GDSI CS &amp; PV<br> <br><br> <br>**State:**<br> <br><br> <br>New Jersey"}