{"job title": "Clinical Scientist, Assoc Dir -", "company": "IQVIA", "city state": "– Research Triangle Park, NC", "rating": "3.4", "job description": "<div><div>Job Description\n<br>\n <strong>Join us on our exciting journey!</strong> IQVIA™ is The Human Data Science Company™, focused on using data and science to help healthcare clients find better solutions for their patients. Formed through the merger of IMS Health and Quintiles, IQVIA offers a broad range of solutions that harness advances in healthcare information, technology, analytics and human ingenuity to drive healthcare forward.\n<br><br>\n<strong>Description</strong>\n<br><br>\n<strong>PURPOSE</strong>\n<br>\n<strong>&nbsp;</strong>\n<br>\nThe Clinical Scientist position is intended for an individual aspiring to lead full product development programs within the pharmaceutical industry. To this end, the incumbent will have responsibility for preparation of various work products of the Strategic Drug Development group that are part of product development process (including preparation of integrated product development plans, clinical trial applications, sections of Investigational New Drug applications, preclinical and clinical study protocols, investigator brochures, supporting statistical documents, integrated clinical/statistical final study reports, and sections of marketing applications.)&nbsp;\n<br>\n<strong>&nbsp;</strong>\n<br>\n<strong>&nbsp;</strong>\n<br>\n<strong>RESPONSIBILITIES</strong>\n<br>\n<strong>&nbsp;</strong>\n<br>\nDuties of the Clinical Scientist include but are not limited to:\n\n<ul>\n\n<li>\nLeading in the development of proposals for potential clients</li>\n<li>\nProviding standardized templates for proposals and key deliverable outputs</li>\n<li>\nResearching current literature to assist in the drug development lead in preparation for all deliverables, including current product label, treatment guidelines, competitive landscape assessments and standard of care.&nbsp;</li>\n<li>\nContributing to various sections of investigational brochures; summarizes animal and clinical studies, and draws conclusions as to the potential safety of the drug under study.</li>\n<li>\nAssisting in writing documents to support regulatory submissions including, but not limited to, protocol synopses, clinical trial authorizations (INDs, CTAs), marketing authorization applications (NDAs, BLAs, NDSs, MAAs), device authorizations (IDEs, 510Ks, PMAs).</li>\n</ul>\n</div>\n</div>\n\n<br>"}