{"job title": "Principle R&amp;D Scientist&amp;Engineer - Sensor Fusion", "company": "JD.com", "city state": "– Santa Clara, CA", "rating": "3.8", "job description": "<strong>Principal / Senior /</strong> <strong>Applied</strong> <strong>Research Scientist&amp;Engineer Sensor Fusion</strong>\n<br><br>\nJD-X Research and Development Center (RDC), Santa Clara, CA\n<br><br>\nJD.com, Inc. one of the world largest e-commerce companies is developing the next generation, fully automated fulfillment infrastructure. JD's X Division (JD-X) is responsible for the development of automated fulfillment capabilities including autonomous ground delivery vehicles, autonomous aerial delivery vehicles (i.e. delivery drones) and warehouse automation technologies including warehouse transportation and manipulation robots.\n<br><br>\nJD-X Research and Development Center (Santa Clara, CA) is seeking motivated individuals to join our team and make fully automated fulfillment solution a reality. We have multiple openings in our Multi-Modal Perception Team at Principal Scientist, Senior Scientist and Research Scientist levels in the areas of Computer Vision and Machine Learning.\n<br><br>\nJD-X RDC, as a fast-growing research and development organization, provides an entrepreneurial environment for motivated and result-driven individuals and gives them the freedom to create and to innovate in the area of robotics and automation. We also have the resources and financial backing of a Fortune 500 company, so you can focus on developing novel automation solution and revolutionizing product delivery and fulfillment process. If you are an individual who has the passion and the drive to handle complex problems, get things done, create innovative solutions and make impacts to the real-world, JD-X RDC is the place for you.\n<br><br>\nJD-X RDC Autonomous Driving group is focused on innovating self driving technology for logistics. We are currently working on multiple vehicle platforms.\n<br><br>\n<strong>You will be responsible for:</strong>\n\n<ul>\n<li>Development of sensor fusion and object tracking algorithms and software to model the world using data from imagery, point cloud, radar, and other tactical sensors.</li>\n<li>Screen and apply the state-of-the-art perception algorithms from both industry and the research community.</li>\n<li>Design system architecture, software API, and data requirements.</li>\n<li>Implement metrics related to algorithm performance evaluation.</li>\n<li>Draft technical documents and presentations.</li>\n</ul>\n<strong>Required Qualifications</strong>:\n\n<ul>\n<li>MS/PhD degree (MS&gt;10years or PhD&gt;6years) in a relevant field of study (e.g., Computer Science, Electrical Engineering).</li>\n<li>The ability to write good C++ code and use a debugger.</li>\n<li>Experience working within Linux.</li>\n<li>Proactive and rigorous, with strong problem solving capability.</li>\n<li>Strong mathematical skills, especially in statistics and estimation.</li>\n<li>The ability to communicate technical topics effectively.</li>\n</ul>\n\n<strong></strong><div><strong>Preferred Qualifications</strong>:</div>\n<br>\n\n<br>\n<div>\n\n\n<ul>\n<li>A doctorate degree with specialization in state estimation or sensor fusion.</li>\n<li>Experience with Bayesian filters (Kalman, EKF, particle filters) and their implementation.</li>\n<li>Experience with target detection/segmentation using deep neural network.</li>\n<li>Experience with point cloud processing, scan matching, and target extraction.</li>\n<li>Experience with automotive radar detection and tracking.</li>\n<li>Experience with implementation of high-quality real-time production software in C++.</li>\n<li>Python and graphics programming is a plus.</li>\n<li>Familiarity with source control such as git.</li> \n</ul>\n\n</div>\n<br>JD.com is an Equal Opportunity Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class."}