{"job title": "Engineering Scientist 3", "company": "KBRwyle", "city state": "– Charleston, SC", "rating": "3.0", "job description": "<ul>\n<li>*Engineering Scientist 3**</li>\n<li>*Description**</li>\n</ul>\n\nEngineering Scientist 3\n<br><br>\n<strong>WHO WE ARE</strong>\n<br><br>\nKBRwyle is a global government services organization delivering full life cycle professional and technical services from over 60 U.S. and 40 international locations. Our core capabilities include logistics, engineering, science, cyber, intelligence and security services.\n<br><br>\n<strong>WHAT TO EXPECT</strong>\n<br><br>\nWhen you become part of the KBR team, your career opportunities are endless. We offer challenging assignments on some of the world's largest and most complex projects where our customers have come to value us, because they know, We Deliver!\n<br><br>\n<strong>ABOUT THIS POSITION</strong>\n<br><br>\nResearches, develops, designs, and tests electrical components, equipment, systems, and networks.\n<br><br>\nDesigns electrical equipment, components, products, and systems for commercial, industrial, and domestic purposes. Uses standard procedures in carrying out assignments associated with research, design or development of specific parts, components, or minor phases of a project. Coordinates with other technical personnel in solving technical problems, fabricating equipment, gathering information, formulating plans, designs, cost estimates and specifications. Provides assistance to higher level engineers in most of the detail work and translates technical guidance and data received into usable information applicable to the particular assignment. Directs the work of lower level technical personnel as required.\n<br><br>\nAssists in compiling and preparing comprehensive technical reports and proposals. May participate as a team member of multiple teams; may act as primary intra-organizational liaison. Performs all other duties as assigned.\n<br><br>\nLocal candidates preferred; relocation package not available.\n\n\n<ul>\n<li>*Qualifications**</li>\n</ul>\n\n<strong>BASIC QUALIFICATIONS</strong>\n<br><br>\nEducation:Bachelor of Sciences degree in engineering, physics, computer science, information security or other technically oriented curricula.\n<br><br>\nClearance: Must be able to obtain a SECRET clearance within 12 months.\n<br><br>\n<strong>ADDITIONAL QUALIFICATIONS</strong>\n<br><br>\nExperience:Six (6) years of experience working with Closed Circuit Television and Networked Video Management Systems, to include: Systems Analysis, Systems Architecture, Systems/Equipment Support, Test and Evaluation, and Logistics support of C4ISR requirements.\n<br><br>\n<strong>INCLUDES:</strong>\n<br><br>\nCompetitive health, wellness &amp; lifestyle benefits\n<br><br>\nInclusive, flexible and supportive company culture\n<br><br>\nOngoing training and development opportunities\n<br><br>\nLEARN MORE ABOUT KBRwyle:https://www.kbr.com/markets/government\n<br><br>\nKBR is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, disability, sex, sexual orientation, gender identity or expression, age, national origin, veteran status, genetic information, union status and/or beliefs, or any other characteristic protected by federal, state, or local law.\n\n\n<ul>\n<li>*Job:** Engineering Operations</li>\n<li>*Primary Location:** US-US-SC-Charleston</li>\n<li>*Req ID:** 1069260</li>\n</ul>"}