{"job title": "Space RF System Scientist", "company": "KeyW", "city state": "– US-MD-", "rating": "3.5", "job description": "Overview<br><br>We are Innovative Space, a rapidly growing business within the Surveillance and Exploration Sector of KeyW that is leading the design and development of next generation satellite payloads and ground processing systems. We have the corporate investment, infrastructure, subject matter experts, and strategic focus to enable you to be successful.<br><br>Responsibilities<br><br>Design and develop novel RF sensor and communication payload concepts, designs, and implementations to solve challenging problems.<br><br>Qualifications<br><br><strong>Required</strong>:\n\n<ul>\n\n <li><strong>ABILITY TO OBTAIN AND MAINTAIN A TS/SCI CLEARANCE</strong>.</li>\n<li>Bachelors, Masters, or Ph.D. in electrical engineering, computer engineering, physics, math, or a related discipline.</li>\n<li>10+ years’ experience in RF.</li>\n<li>Strong background in RF concepts and applications.</li>\n<li>Familiarity with one or more of the following fields: communications, radar, electronic warfare, and/or SIGINT.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Experience leading the design and development of advanced concepts.</li>\n</ul>\n<strong>Preferred</strong>:\n\n<ul>\n\n <li>Previous successful payload development efforts.</li>\n</ul>\n<strong>Location</strong>: Severn, MD\n<br><br>\n<strong>KeyW is an EEO employer</strong>. We are committed to providing fair and equal employment consideration, regardless of race, color, religion, national origin, gender, sexual orientation, age, marital status or disability.<br><br>About the Organization<br><br>KeyW is a pure-play national security solutions provider for the Intelligence, Cyber and Counterterrorism Communities' toughest challenges. We support the collection, processing, analysis and dissemination of information across the full spectrum of their missions. We employ and challenge more than 2,000 of the most talented professionals in the industry with solving such complex problems as preventing cyber threats, transforming data into intelligence and combating global terrorism.\n<br><br>\nKeyW, together with its direct and indirect subsidiaries, encourages and actively supports a policy of Equal Employment Opportunity and commits to provide equal opportunity to everyone, regardless of race, color, religion, gender, sexual orientation, age, national origin or ancestry, marital status, veteran status, disability or any other classifications protected by Federal, State or local law. In fact, we foster an environment that promotes diversity, balance and fun—because we believe in the importance of having a workplace as unique as the challenges we solve.<br><br>Clearance<br><br>Ability to obtain and maintain a TS/SCI clearance."}