{"job title": "Senior Research Scientist - Thoracic and Cardiovascular Surgery Research", "company": "MD Anderson Cancer Center", "city state": "– United States, Texas, Houston, Houston", "rating": "4.1", "job description": "<div><div><div><div><div><p>The University of Texas MD Anderson Cancer Center in Houston is one of\nthe world's most respected centers focused on cancer patient care, research,\neducation and prevention. It was named the nation's No. 1 hospital for cancer\ncare in U.S. News &amp; World Report’s 2017 rankings. It is one of only 49\ncomprehensive cancer centers designated by the National Cancer Institute.</p>\n\n<div> </div>\n\n<div><b>ESSENTIAL JOB FUNCTIONS</b></div>\n\n<p><b>Research Projects, Scientific Publication and\nGrant Applications</b> </p>\n\n<p>Conduct independent research to identify and\nvalidate novel immune-oncology targets utilizing a variety of cell biology,\nbiochemical and genetic approaches. Plans, organizes, coordinates and\nparticipates in research projects under the direction of PI. Functions in an\nindependent manner in the design and initiation of research experiments. Utilize\ninitiative and inventive skills in planning and executing the details of\nexperiments. Prepare manuscripts for scientific publications. Presents findings\nof research projects to professional groups and prepares scientific documents\nand manuscripts for publication. Functions in an independent manner in the\ndesign and initiation of research experiments. Prepares preliminary data\nand drafts documents for grant applications.<br>\n<br>\n<b>Laboratory Analysis of Clinical\nSpecimens</b><br>\nPerform laboratory analysis of gene and protein expression on clinical tumor\nand serum/plasma samples by immunohistochemical staining, immunofluorescence\nstaining, gene and protein expression microarrays and other required\nbiochemical analysis. Coordinate intramural and extramural collaborating\nresearch activities. Assist in the preparation of grant applications,\nespecially, in performing experiments for collecting preliminary data. Present\nfindings of research projects to professional groups and prepares scientific\ndocuments and manuscripts for publication.<br>\n</p><p><br></p>\n\n<div><b>Regulatory Compliance and Safe Lab Practice</b> </div>\n\n<p>Coordinates and oversees the safety programs\nwithin the department to remain in regulatory compliance. Complies with\nregulatory agencies and national guidelines. Performs testing of equipment.\nSupervises inspection of all areas where hazardous materials are used or\nstored. Assists in developing standard operating procedures for receiving,\nstoring, use and disposal of hazardous materials. Maintains equipment inventory\nand maintenance. Coordinates information technology and communication\nrequests. Uses laboratory knowledge and expertise to identify and resolve\noverall research laboratory operational issues and interacts with all levels of\ninternal and external sources to resolve problems. </p>\n\n<div> </div>\n\n<div><b>Record Keeping and Progress Consultation</b> </div>\n\n<p>Record keeping and data maintenance to meet\nsupervisor, department/institute directives. Records experimental data by\nmanually writing in a notebook or enter into a computer database. Collects\nand accurately calculate experimental data under the guidance of\nsupervisor. Prepares graphs and charts by using computer.</p>\n\n<div> </div>\n\n<p><b>The ideal candidate will\nhave 5-7 years of professional research experience. Experience at MD Anderson Cancer Center is a\nplus. Candidate will also have immunotherapy experience and the ability to\ndesign and carry out research projects independently.</b></p>\n\n<div> </div>\n\n<div><b>SALARY RANGE</b></div>\n\n<div>Minimum: $59,200 – Midpoint: $74,000 – Maximum: $88,800</div>\n<p><br></p>\n \n \n\n \n \n \n \n \n <div>\n <div><p><b>EDUCATION</b><br>\n<b>Required:</b> PhD in one of the\nnatural sciences or related field or Medical degree.<br>\n<br>\n<b></b></p><p>\n\n</p><p><b>EXPERIENCE</b><br>\n<b>Required:</b> Five years of experience in\nexperimental or scientific work.<br></p><p><br></p><p>It is the policy of The University of Texas MD Anderson Cancer Center to provide equal employment opportunity without regard to race, color, religion, age, national origin, sex, gender, sexual orientation, gender identity/expression, disability, protected veteran status, genetic information, or any other basis protected by institutional policy or by federal, state or local laws unless such distinction is required by law. http://www.mdanderson.org/about-us/legal-and-policy/legal-statements/eeo-affirmative-action.html</p><p><br></p><p><br></p></div>\n </div>\n \n \n \n \n\n <div>\n \n \n\n \n \n \n\n \n \n \n \n \n \n \n </div>\n </div>\n </div>\n </div>\n\n \n </div>\n\t</div>"}