{"job title": "Senior Scientist, Vaccine Process Development and Commercialization", "company": "Merck and Co.", "city state": "– West Point, PA", "rating": "3.7", "job description": "The Vaccine Process Development and Commercialization (V-PDC) group within the Merck Manufacturing Division (MMD) focuses on late stage process development, technology transfer, and in-line support of vaccine products. We seek an energetic, people-oriented leader with strong scientific and technical skills to lead the development and commercialization activities supporting multiple vaccine programs. In this role, you will be responsible for:\n<br><br>\nLeading process development activities to execute large molecule upstream and/or downstream processing including lab-scale process development, in-process assay support, and process scale-up/scale-down.\n<br>\nExecution of lab scale experiments and authoring associated technical reports and documents.\n<br>\nCollaborating with commercial manufacturing teams to support facility start-up activities and provide on-the-floor support for drug substance manufacturing, both within the Merck network and at contract manufacturing organizations (CMOs).\n<br>\nLeading assignment execution against accelerated, critical-path timelines in a right-first-time manner.\n<br>\nAuthoring and/or reviewing technical documents to support Process Performance Qualification (PPQ) and licensure.\n<br>\nProvide mentorship and technical direction to other members of the team which may include dotted-line reporting relationships.\n<br>\nQualifications\n<br><br>\nRequired:\n<br><br>\nB.S. in Chemical Engineering, Biochemical Engineering Bioengineering, Pharmaceuticals, Biochemistry, Microbiology plus 6 years of experience OR an MS plus 4 Years of experience\n<br>\nLarge molecule process development, or relevant, experience including scaling (up and down) and tech transfer of large molecule drug substance processes.\n<br>\nHands-on expertise in execution of process development with multiple programs and unit operations across upstream and/or downstream unit operations.\n<br>\nExpertise in lab scale experimental execution and experience with Design of Experiments (DOE), statistical data analysis and presentation of results/conclusions.\n<br>\nExperience authoring technical documentation to support regulatory submissions.\n<br>\nOutstanding communication and people skills.\n<br>\nAbility to foster a collaborative work environment focused on mentorship, coaching, and Subject Matter Expert development.\n<br>\nExperience with project strategic planning.\n<br><br>\nPreferred:\n<br><br>\nKnowledgeable in Drug Substance, end-to-end process development experience.\n<br>\nExperience with upstream and/or downstream unit operation mathematical modeling, theoretical scaling calculations, computational fluid dynamics (CFD) modeling.\n<br>\nExperience with large molecule assay development and execution (HPLC, UPLC, MS).\n<br>\nExperience with Quality by Design (QbD) and Lean Six Sigma principles.\n<br>\nStrong cross-functional background, enabling teams to reach peak performance.\n<br>\nAbility to provide scientific mentorship and guidance to technical coworkers and colleagues within and outside of Merck.\n<br>\nExperience supporting/writing regulatory filings (IND, MAA, BLA) and inspections with multiple agencies (FDA, EMA, JNDA, TGA) .\n<br>\nExperience with on-the-floor GMP manufacturing support including providing immediate responses on the shop floor to deviations and potential deviations.\n<br>\ncGMP experience."}