{"job title": "Data Analyst and Modeler", "company": "Verizon", "city state": "– Ashburn, VA", "rating": "3.5", "job description": "<strong>What you’ll be doing...</strong>\n<br><br>\nOur Business Transformation Team has an immediate opening for Data Modeler/Analyst, who can provide business solutions by analyzing varying, large data sets. You will help in Data analysis, data interpretations, and turn data into meaningful information, which gives insight into business.\n<ul>\n<li>Collaborating with your various LOBs (Line of Business) to understand business needs and market strategies staying up to date on all the product initiatives and plans.</li><li>Performing ETL and integrating multiple data sources and software tools with business line specific decision support and data analysis.</li><li>Developing and implementing SPSS based predictive models that will balance the needs of the various LOBs.</li><li>Interpreting data, analyze results using statistical techniques.</li><li>Working with management to prioritize business and information needs.</li><li>Locating and defining new process improvement opportunities.</li><li>Willingness to work in an interdisciplinary field, together with computer scientists, business SMEs, and engineers, and will require excellent interpersonal and communication skills.</li>\n</ul>\n<strong>What we’re looking for...</strong>\n<br><br>\nYou’ll need to have:\n<ul>\n<li>Bachelor’s degree in statistics, mathematics, data science, computer science, or four or more years of work experience.</li><li>Four or more years of relevant work experience.</li><li>Two or more years of experience in SPSS model building.</li>\n</ul>\nEven better if you have:\n<ul>\n<li>MS in Statistics, Data Science, Data Analytics or double major Bachelor’s degree in marketing and data science.</li><li>Good interpersonal and communication skills. Ability to convey complex information to management.</li><li>Ability to adapt to quickly changing business environment and requests, that come in related to management requests.</li><li>Comfort working in a dynamic and fast-paced environment.</li><li>Strong analytical and problem solving technical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with accuracy and developing algorithms.</li>\n</ul>\n<strong>When you join Verizon...</strong>\n<br><br>\nYou’ll be doing work that matters alongside other talented people, transforming the way people, businesses and things connect with each other. Beyond powering America’s fastest and most reliable network, we’re leading the way in broadband, cloud and security solutions, Internet of Things and innovating in areas such as, video entertainment. Of course, we will offer you great pay and benefits, but we’re about more than that. Verizon is a place where you can craft your own path to greatness. Whether you think in code, words, pictures or numbers, find your future at Verizon.\n<br><br>\n<strong>Equal Employment Opportunity</strong>\n<br><br>\nWe're proud to be an equal opportunity employer- and celebrate our employees' differences,including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. Different makes us better."}