{"job title": "Associate Scientist", "company": "3 Key Consulting", "city state": "– Thousand Oaks, CA", "rating": "NA", "job description": "<strong>Job Title:</strong>  Associate Scientist (JP4674)\n<br>\n<strong>Location:</strong> Thousand Oaks, CA.\n<br>\n<strong>Employment Type:</strong> Contract\n<br>\n<strong>Business Unit:</strong>  Pre-Pivotal DP Synthetic Enabling Technology\n<br>\n<strong>Duration:</strong> 2+ yeas (likely extensions or conversion to permanent full-time)\n<br><br>\n3Key Consulting Inc. is recruiting for an <strong>Associate Scientist</strong> with B.S. or M.S. degree in chemistry, chemical engineering or biotechnology and 1+ years experience in HPLC analysis for a global, CA-based, bio-pharmaceutical company.\n<br><br>\n<strong><u>Job Description:</u></strong>\n<br>\nWe are looking for an associate scientist with:\n\n<ul>\n <li>Proficiency in liquid chromatography and common laboratory techniques (i.e. pH, microscopy).</li> <li>A fundamental understanding of drug formulation and physicochemical characterization.</li> <li>Attention to detail, adaptability to new techniques and multi-tasks, ability to solve problem and meet deadline, and effectiveness to work independently and as a team member.</li> <li>Strong computer skills in instrumentation and data processing in a client-server environment.</li> <li>Excellent communication (verbal and written) and organizational skills.</li>\n</ul>\n\n<strong><u>Top Must-Have Skill Sets:</u></strong>\n\n<ul>\n <li>HPLC analysis.</li> <li>Chemistry background.</li> <li>Data processing skills.</li>\n</ul>\n\n<strong><u>Day to Day Responsibilities</u></strong>\n\n<ul>\n <li>Prepare formulations and perform dose analysis to support nonclinical pharmacokinetic, pharmacodynamic and toxicological studies.</li> <li>Design and conduct experiments for formulation development and molecule assessment including solubility, stability and solid-state characterization per guidelines and instructions from project representatives.</li> <li>Analyze data, maintain timely documentation (i.e. electronic notebooks), and contribute to technical reports and presentations in a matrixed team environment.</li> <li>Participate in lab housekeeping, maintain lab equipment and supplies, and comply with lab safety guidelines.</li> <li>May work occasionally on flexible schedule, i.e. starting early morning or finishing late evening, depending on the project need.</li>\n</ul>\n\n<strong><u>Basic Qualifications:</u></strong>\n\n<ul>\n <li>B.S. or M.S. with 0-2 year experience with degree in Chemistry, Chemical Engineering, Pharmaceutics, Life Science or related scientific background. Pharmaceutical/biotech industry experience preferred.</li> <li>Skill in HPLC method and data analysis is essential. Experience in formulation development and/or solid state characterization is a plus.</li>\n</ul>\n\n<strong><u>Why This Position Is Open:</u></strong>\n<br>\nBack fill for a worker moving to a different role.\n<br><br>\n<strong><u>Employee Value Proposition:</u></strong>\n<br>\nlearning multiple techniques and analytics work. Possibility of becoming an FTE.\n<br><br>\n<strong><u>Red Flags:</u></strong>\n<br>\nfrequently job hopping, no Science background field.\n<br><br>\n<strong><u>Interview process:</u> </strong>\n<br>\nPhone screening followed by in-person interview.\n<br><br>\nWe invite qualified candidates to send your resume to resumes@3keyconsulting.com. If you decide that youre not interested in pursuing this particular position, please feel free to take a look at the other positions on our website www.3keyconsulting.com. You are also welcome to share this posting with anyone you think might be interested in applying for this role.<br><br>SDL2017"}