{"job title": "Senior Research Scientist * âž", "company": "3m", "city state": "– Maplewood, New Jersey", "rating": "3.9", "job description": "<strong> Job Description:</strong>\n<br><br>\n<strong> 3M is seeking a Senior Research Scientist for the Inorganic and Ceramics Cluster of the Corporate Research Materials Laboratory located in Maplewood, MN.</strong>  <strong> At 3M, you can apply your talent in bold ways that matter. Here, you go.</strong>\n<br><br>\n<strong> Job Summary</strong> :\n<br><br>\nThe person hired for the position of <strong> Senior Research Scientist</strong> will develop advanced technologies and products in Inorganic and Ceramics Cluster of 3Ms Corporate Research Materials Laboratory. The primary focus of this position will be to develop new ceramic materials.\n<br><br>\nAt 3M, our researchers leverage our 46 technology platforms and capabilities to develop new technologies and products that solve customer problems across many businesses and markets. 3M offers over 55,000 products that are helping customers are used in consumer electronics, hospitals and clinics, industrial manufacturing, and safety products. 3M core material technologies and expertise include advanced polymers, nanotechnology, biotechnology, and ceramics that are used in adhesive tapes, protective coatings, film technologies, non-wovens, abrasives, and respirators. 3M is applying Science to Life.\n<br><br>\n<strong> This position provides an opportunity to transition from other private, public, government or military environments to a 3M career.</strong>\n<br><br>\n<strong> Primary Responsibilities</strong> include but are not limited to the following:\n<li> Leverage expertise to develop and advance technologies that can be used for new product commercialization opportunities in the areas of inorganic and ceramic materials</li> <li> Protect 3M intellectual property through the filing of new patent applications, publish in top-tier journals, and present at appropriate conferences</li> <li> Collaborate with research teams from corporate research and business labs on building capabilities and applications that use his/her scientific, mathematical, and computational skills</li> <li> Active participation in 3Ms Tech Forum</li> <li> Collaboration with international laboratories for technology and product transfers</li>\n<strong> Basic Qualifications:</strong>\n<li> Possess a Ph.D. degree in a science or engineering discipline (completed and verified prior to start) from an accredited institution</li>\n<strong> Preferred Qualifications:</strong>\n<li> Ph.D. degree in material science, ceramic engineering, inorganic chemistry or related discipline with an emphasis on ceramic materials</li> <li> Good skills in data analysis and the use of designed experiments</li> <li> Strong scientific and technical acumen, with demonstrated interest and ability to make connections between science/technology and real-world concerns</li> <li> Strong problem-solving skills</li> <li> Ability to deal with the ambiguity of early-stage scouting and evaluation of new opportunities and the flexibility to change direction as additional information becomes available</li> <li> Leadership and networking skills</li> <li> Self-motivated and self-directed</li> <li> Excellent communication skills (oral, written and presentation)</li>\n<strong> Location:</strong>  <strong> Maplewood, MN</strong>\n<br><br>\n<strong> Travel:</strong>  <strong> May include up to 10%</strong>  <strong> domestic/international</strong>\n<br><br>\n<strong> Relocation:</strong>  <strong> Is</strong>  <strong> authorized</strong>\n<br><br>\n<strong> Must be legally authorized to work in country of employment without sponsorship for employment visa status (e.g., H1B status).</strong>\n<br><br>\nResponsibilities of this position may include direct and/or indirect physical or logical access to information, systems, technologies subjected to the regulations/compliance with U.S. Export Control Laws.\n<br><br>\nU.S. Export Control laws and U.S. Government Department of Defense contracts and sub-contracts impose certain restrictions on companies and their ability to share export-controlled and other technology and services with certain \"non-U.S. persons\" (persons who are not U.S. citizens or nationals, lawful permanent residents of the U.S., refugees, \"Temporary Residents\" (granted Amnesty or Special Agricultural Worker provisions), or persons granted asylum (but excluding persons in nonimmigrant status such as H-1B, L-1, F-1, etc.) or non-U.S. citizens.\n<br><br>\nTo comply with these laws, and in conjunction with the review of candidates for those positions within 3M that may present access to export controlled technical data, 3M must assess employees' U.S. person status, as well as citizenship(s).\n<br><br>\nThe questions asked in this application are intended to assess this and will be used for evaluation purposes only. Failure to provide the necessary information in this regard will result in our inability to consider you further for this particular position. The decision whether or not to file or pursue an export license application is at 3M Company's sole election."}