{"job title": "Principal Clinical Research Scientist", "company": "Abbott AG", "city state": "– Plano, Texas", "rating": "3.5", "job description": "At Abbott, we're committed to helping people live their best possible life through the power of health. For more than 125 years, we've brought new products and technologies to the world -- in nutrition, diagnostics, medical devices and branded generic pharmaceuticals -- that create more possibilities for more people at all stages of life. Today, 99,000 of us are working to help people live not just longer, but better, in the more than 150 countries we serve.\n<br><br>\n<strong> <strong> JOB DESCRIPTION:</strong></strong>\n<br><br>\nThe Principal Clinical Scientist provides scientific expertise throughout the development and implementation of clinical evaluations, risk management, and /or clinical studies. Writes/manages clinical evaluation (plans and reports), clinical trial protocols, protocol amendments, risk master lists, clinical trial registrations and results postings, and scientific publications. Interacts with various study support groups cross-functional teams in order to assist in clinical strategy, the development of study plans, reports and project clinical deliverables. Interacts with regulatory agencies as needed, and will use his/her scientific and medical knowledge in order to provide directives to staff as well as study sites as directed by your manager. The principal clinical scientist will be supporting Clinical studies in the Cardiac Arrhythmias and Heart Failure Business unit, and will be specifically focused on Heart Failure Studies.\n<br><br>\n<strong> Main Responsibilities:</strong>\n<li> Will be the scientific lead on clinical studies and Clinical Strategy development and execution. Owns clinical science deliverables for projects</li> <li> Facilitates communication between Clinical Science and Sales and Marketing, R&amp;D, Clinical R&amp;D, Regulatory Affairs, Library Services, Product Performance Group (PPG), Quality Engineering, Risk Management, Clinical Project Management, external CROs or Medical Writers, Training, Senior Management and investigational sites as directed by your manager on clinical science deliverables. Supports regulatory submissions during the submission process.</li> <li> Participates in the development of clinical strategy and trial design by conducting meetings with the appropriate departments and individuals to obtain feedback/direction.</li> <li> Writes clinical evaluation plans and reports, study protocols, protocol amendments, informed consents, study reports, risk master lists, and scientific papers for publication by evaluating scientific literature, analyzing scientific data and staying abreast of current clinical practice.</li> <li> Interprets results in preparation for product applications by evaluating clinical and scientific and risk data and literature, and staying abreast of current clinical practice.</li> <li> Presents scientific data by communicating accurate, succinct summaries of clinical results at industry gatherings, investigational meetings and regulatory agency meetings.</li> <li> Participates in and supports audits. May actively participate in root cause analysis. May participate in root cause analysis, preventive or corrective actions, and effectiveness monitoring.</li>\n<strong> Qualifications:</strong>\n<li> Masters degree required. PhD degree or equivalent in the sciences, medicine, or similar discipline highly preferred.</li> <li> Minimum of 8+years of related work experience with a complete understanding of specified functional area, or an equivalent combination of education and work experience.</li> <li> Medical Device research experience required; Cardiovascular device research experience preferred.</li> <li> Uses in-depth knowledge of business unit functions and cross group dependencies/ relationships. Is recognized as an expert in work group and across functions.</li> <li> Will perform this job in a quality system environment.</li> <li> Works on complex problems where analysis of situations or data requires an in-depth evaluation of various factors.</li> <li> Exercises judgment within broadly defined practices and policies in selecting methods, techniques and evaluation criteria for obtaining results.</li>\n<strong> <strong> JOB FAMILY:</strong></strong>\n<br><br>\nResearch and Discovery\n<br><br>\n<strong> <strong> DIVISION:</strong></strong>\n<br><br>\nCAHF Cardiac Arrhythmias &amp; Heart Failure\n<br><br>\n<strong> <strong> LOCATION:</strong></strong>\n<br><br>\nUnited States &gt; Texas : 6901 Preston Road\n<br><br>\n<strong> <strong> ADDITIONAL LOCATIONS:</strong></strong>\n<br><br>\nUnited States &gt; Massachusetts : 168 Middlesex Turnpike\n<br><br>\n<strong> <strong> WORK SHIFT:</strong></strong>\n<br><br>\nStandard\n<br><br>\n<strong> <strong> TRAVEL:</strong></strong>\n<br><br>\nYes, 5 % of the Time\n<br><br>\n<strong> <strong> MEDICAL SURVEILLANCE:</strong></strong>\n<br><br>\nNot Applicable\n<br><br>\n<strong> <strong> SIGNIFICANT WORK ACTIVITIES:</strong></strong>\n<br><br>\nContinuous sitting for prolonged periods (more than 2 consecutive hours in an 8 hour day), Keyboard use (greater or equal to 50% of the workday)Abbott is an Equal Opportunity Employer of Minorities/Women/Individuals with Disabilities/Protected : :"}