{"job title": "Principal Scientist Clinical Research", "company": "Abbott AG", "city state": "– Santa Clara, California", "rating": "3.5", "job description": "At Abbott, we're committed to helping people live their best possible life through the power of health. For more than 125 years, we've brought new products and technologies to the world -- in nutrition, diagnostics, medical devices and branded generic pharmaceuticals -- that create more possibilities for more people at all stages of life. Today, 99,000 of us are working to help people live not just longer, but better, in the more than 150 countries we serve.\n<br><br>\n<strong> <strong> JOB DESCRIPTION:</strong></strong>\n<br><br>\n<strong> PRIMARY JOB FUNCTION</strong>\n<br><br>\nWe have an exciting opportunity for the right candidate to join our rapidly growing clinical team within the Abbott Structural Heart division. The Principal Clinical Scientist will provide scientific expertise throughout the development and execution of clinical strategies (, scientific publications) to support evidence generation for transcatheter mitral and tricuspid programs. He/she will design clinical trials from concept to execution by working collaboratively with biostatistics, medical affairs, regulatory affairs, global clinical operations, and other cross-functional team members. The individual will also take the lead in interacting with regulatory agencies, reimbursement agencies and clinical trial investigators to ensure successful execution of clinical strategies to meet corporate goals.\n<br><br>\n<strong> Core Job Responsibilities</strong>\n<br><br>\nThis position will work closely within the clinical study team including the medical director, biostatistician, project management, data management, and other clinical study personnel. This position will have significant interaction with executive leadership, physicians and regulatory authorities. Furthermore, this position will be required to execute their job responsibilities within the corporate policies and standard operating procedures. This position will:\n<li> Design clinical trials and studies in collaboration with internal stake holders including clinical project management, clinical operations, clinical science, biostatistics data management, regulatory affairs, medical affairs as well as external stake holders including steering committees, and national principal investigators (if applicable).</li> <li> Lead the generation of study-related documents and/or contribute content and oversight of such documents, including, but not limited to, clinical study protocols, case report forms, clinical study reports, and informed consent forms</li> <li> Develop the scientific podium and publication strategy in close collaboration with cross-functional teams, and lead the execution of the publication strategy</li> <li> Lead publications for clinical study data through coordination with investigator authors and project management of reviews and revisions for abstracts and manuscripts</li> <li> Support the Clinical Program Director in developing clinical evidence generation plans</li> <li> Serve as an active member of study teams and provide scientific support to justify trial design and ongoing scientific analysis during protocol development. May include generation of pre-protocol documentation of scientific information</li> <li> Synthesize literature and competitive information across multiple products and/or therapies within the assigned therapeutic area</li> <li> Review and critically analyze statistical analysis plans</li> <li> Lead study level (and franchise level where applicable) publication planning</li> <li> Generate documents to support regulatory submissions for Abbott products and/or respond to questions from regulatory authorities about existing submissions</li> <li> Contribute to the optimization of internal processes and workflows</li> <li> Develop new ideas for both external and internal projects.</li> <li> Attend, present at, and leads meetings with FDA.</li> <li> Mentor junior team members</li> <li> Performs other related duties and responsibilities, on occasion, as assigned.</li>\n<strong> Minimum Education</strong>\n<br><br>\nBachelor's degree required, advanced degree preferred. Degree in the sciences, medicine, or similar discipline highly preferred. Minimum of 8+years of related work experience with a complete understanding of specified functional area, or an equivalent combination of education and work experience\n<br><br>\n<strong> Minimum Experience / Training Required</strong>\n<br><br>\nComprehensive knowledge of a particular technological field. Uses in-depth knowledge of business unit functions and cross group dependencies/ relationships. Is recognized as an expert in work group and across functions. Will perform this job in a quality system environment. Failure to adequately perform tasks can result in noncompliance with governmental regulations. Works on complex problems where analysis of situations or data requires an in-depth evaluation of various factors. Exercises judgment within broadly defined practices\n<br><br>\nand policies in selecting methods, techniques and evaluation criteria for obtaining results. Has broad knowledge of various technical alternatives and their potential impact on the business\n<br><br>\n<strong> <strong> JOB FAMILY:</strong></strong>\n<br><br>\nClinical Affairs / Statistics\n<br><br>\n<strong> <strong> DIVISION:</strong></strong>\n<br><br>\nCAHF Cardiac Arrhythmias &amp; Heart Failure\n<br><br>\n<strong> <strong> LOCATION:</strong></strong>\n<br><br>\nUnited States &gt; Santa Clara : Building A - SC Floor-2\n<br><br>\n<strong> <strong> ADDITIONAL LOCATIONS:</strong></strong>\n<br><br>\n<strong> <strong> WORK SHIFT:</strong></strong>\n<br><br>\nStandard\n<br><br>\n<strong> <strong> TRAVEL:</strong></strong>\n<br><br>\nYes, 20 % of the Time\n<br><br>\n<strong> <strong> MEDICAL SURVEILLANCE:</strong></strong>\n<br><br>\nYes\n<br><br>\n<strong> <strong> SIGNIFICANT WORK ACTIVITIES:</strong></strong>\n<br><br>\nContinuous sitting for prolonged periods (more than 2 consecutive hours in an 8 hour day), Keyboard use (greater or equal to 50% of the workday)Abbott is an Equal Opportunity Employer of Minorities/Women/Individuals with Disabilities/Protected : :"}