{"job title": "Principal, Scientist", "company": "CoreLogic", "city state": "– Oakland, California", "rating": "2.8", "job description": "<strong>Job Duties</strong>\n\n<ul>\n<li>Develop seismic vulnerability and fragility functions for different classes of structures using the latest science and engineering techniques.</li> <li>The vulnerability will cover the performance of buildings, contents and business interruption. Perform a variety of professional-level model development and consulting tasks, including development and/or validation of hazard, fragility/vulnerability, and/or financial model components.</li> <li>This work involves literature review, research, developing scientific algorithms, statistical data analysis, simulation, etc. Work closely with software developers to communicate software needs and ensure that coding aligns with hazard, fragility/vulnerability, and financial algorithms/models.</li> <li>Produce technical documentation covering assigned tasks, and review documentation produced by others.</li> <li>Provide and manage model-related support for various internal clients, e.g. consulting projects.</li> <li>Provide model-related client support, including investigation/debugging, explanation/interpretation of results, provision of further details about the models, and participation in meetings with clients.</li> <li>Provide model-related sales support, including analytic support, preparation of presentation slides, participation in meetings with clients and prospects, etc.</li> <li>Provide model-related support for and present on webinars presented to clients and prospects.</li> <li>Develop and present presentations given at client conferences and external industry and scientific conferences.</li> <li>Project management responsibilities: directly perform assigned model development and consulting tasks, in accordance with CoreLogic quality standards and the project budget and schedule.</li> <li>Partnering with team, develop project plans to achieve the outlined goals, and report status to the project manager.</li> <li>Provide risk management and issue resolution.</li> <li>Detect, report, and resolve situations that may cause risk to the project and its completion.</li> <li>Manage smaller projects or subtasks directly.</li> <li>Participate in professional organizations and stay current with latest research and literature.</li> <li>Research best practices.</li> <li>May write white papers or scientific papers on catastrophe modeling methods and solutions to catastrophe modeling challenges.</li>\n</ul>\n\n<strong>Auto req ID</strong>\n<br>\n<strong>12460BR</strong>\n<br><br>\n<strong>Position Type</strong> \n<br>\nFull Time\n<br><br>\n<strong>Posting Job Summary</strong>\n<br>\nJoin the team that powers the global real estate economy - CoreLogic is an innovative, future focused company whose vision is to deliver unique property-level insights that power the global real estate economy.\n<br>\nWe are a $1.95 billion in sales company with more than 6,000 employees globally serving the financial services and insurance industries. We are evolving at a rapid pace and the clients we serve are challenged from every direction, which means we are growing and innovating to help drive their success. Working together, and differentiated by our superior data, analytics and data-enabled solutions, we empower our clients to make smarter business decisions through data-driven insights. We take initiative, are fully accountable, build respect and trust, make transparency a must - and engage, include and collaborate at every turn.\n<br>\nWe take pride in our work and believe in cultivating a work environment that supports and values our greatest asset: our talented employees.\n<br><br>\n<strong>State/Region/Province</strong>\n<br>\n<strong>CA</strong>\n<br><br>\n<strong>% Travel Involved</strong>\n<br>\nNone\n<br>\n,{\"QuestionName\":\"Posting Job Requirements\",\"<strong>Education, Experience, Knowledge and Skills</strong> PhD degree or foreign equivalent in Structural Engineering, Civil Engineering, or closely related field plus Two (2) years of experience in job offered or closely related occupation; Will accept foreign equivalent. Employer will accept any suitable combination of education, experience, or training.\n<br><br>\n<strong>REQUIRED SKILLS:</strong> Must possess expertise/knowledge sufficient to adequately perform the duties of the job being offered. Expertise/knowledge may be gained through employment experience or education. Such expertise/knowledge cannot be \\\"quantified\\\" by \\\"time.\\\" Required expertise/knowledge includes:\n<br><br>\nCoursework in Earthquake Engineering; U.S. building design code; Experience with one of the finite-element modeling packages and pushover analysis; Probability and statistics; Cat modeling; Earthquake fragility functions; Asia earthquake vulnerability functions; Nonlinear dynamic analysis;\n<br><br>\nCoreLogic offers an empowered work environment that encourages creativity, initiative and professional growth and provides a competitive salary and benefits package. CoreLogic is an Equal Opportunity/Affirmative Action employer committed to attracting and retaining the best-qualified people available, without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, disability or status as a veteran of the Armed Forces, or any other basis protected by federal, state or local law. CoreLogic maintains a Drug-Free Workplace. We are fully committed to employing a diverse workforce and creating an inclusive work environment that embraces everyone's unique contributions, experiences and values. Please apply on our website for consideration.\n<br>\n\",\"VerityZone\":\"formtext18\",\"QuestionType\":\"textarea\",\"ActualValueFromSolar\":null}\n<br>\n<strong>Category</strong>\n<br>\nInformation Technology\n<br><br>\n<strong>City</strong>\n<br>\nOakland\n<br><br>\n<strong>Business Segment</strong>\n<br>\nProperty Intel &amp; Risk Mgmt Sol\n<br><br>\n<strong>Country</strong>\n<br>\nUnited States\n<br>"}