{"job title": "IVD Bioinformatics Scientist", "company": "CyberCoders", "city state": "– San Carlos, CA", "rating": "3.8", "job description": "IVD Bioinformatics Scientist <div>\nIf you are a Bioinformatics Scientist with experience, please read on!</div>\n\n<br>What You Will Be Doing<div>\n\n\n<ul>\n<li>Work closely with molecular biologists to design and analyze feature development and feasibility experiments under design control</li>\n<li>Develop and execute bioinformatics analysis plans with testable acceptance criteria</li>\n<li>Conduct feasibility analyses and write development reports</li></ul></div>\n\n\nWhat You Need for this Position<div>\nAt Least 3 Years of experience and knowledge of:\n\n\n<ul>\n<li>As a competitive candidate, you will have many of the the following training, skills, and experience:</li>\n<li>IVD and/or Companion Diagnostic (CDx) development experience essential</li>\n<li>Molecular diagnostics experience, with an emphasis on NGS approaches, desirable</li>\n<li>Experience designing, analyzing, troubleshooting, and visualizing wet lab experiments</li>\n<li>Demonstrable expertise in genome scale data analysis</li>\n<li>Bioinformatics skills in genomics, sequence analysis, python or R scripting under version control</li>\n<li>Awareness and experience with current landscape of bioinformatics tools</li>\n<li>Working knowledge of statistical methods, including: conditional probability, linear modeling, goodness-of-fit tests, maximum likelihood, and bayesian models.</li>\n<li>IVD- Companion Diagnostic- NGS- Genome- Python- R- Bioinformatics- Statistical Methods- Linear Modeling- Bayesian</li></ul></div>\n\n\n<div>\nSo, if you are a Bioinformatics Scientist with experience, please apply today!</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}