{"job title": "R&amp;D Scientist", "company": "Del Monte Foods", "city state": "– Walnut Creek, CA", "rating": "2.8", "job description": "<strong>POSITION FUNCTION &amp; SCOPE:</strong>\n<br><br>\nTo conduct food research projects leading to the development of new products, product improvements, cost reductions, or development of new technology.\n<br><br>\n<strong>PRIMARY RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>This position is responsible to independently conduct product development projects leading to the introduction of new food products, product improvements, or cost reductions, as assigned by the Lead Scientist/Director. The Product Development Scientist will develop formulas and manufacturing processes, write manufacturing directives, and oversee production line start-ups as well as perform troubleshooting for, and at, various Company, Copack, or ingredient supplier's manufacturing facilities.</li>\n<li>The functions performed by this position are the execution of projects by conducting experiments, recording of experimental data, and communicating of results to the Lead Scientist/Director and cross functional teammates by means of product cuttings and written reports. The incumbent in the Product Development Scientist position is expected to have project planning skills to independently plan and coordinate assigned project(s).</li>\n<li>The challenges most often encountered in this position are technically related to the development or modification of food and problems related to manufacturing processes.</li>\n<li>The greatest challenge is to achieve the desired research results within the product image, financial targets and time guidelines set forth for the projects. The incumbent may at times be required to travel to various Company or Copack manufacturing facilities or supplier' places of business.</li>\n<li>The Product Development Scientist's performance is measured on the incumbent's ability to efficiently and scientifically conduct research projects as well as their ability to work with other technologists within the food group, other laboratory groups and a broad spectrum of cross functional personnel at the other Del Monte Foods facilities.</li>\n<li>The incumbent may be asked to prepare and conduct special cuttings of samples of Del Monte products for comparison to competitors and collect product data.</li>\n<li>The incumbent's most significant contacts within the Company are daily contacts with other groups within the Walnut Creek Research Center and cross functional teammates in Marketing, Operations, Finance, and Contract Manufacturing. Contacts with outside supplier representatives also occur frequently.</li>\n<li>The incumbent must exhibit technical competence in the planning and completion of assigned projects leading to the development and implementation into production of new or revised products, including the training of Plant Production personnel.</li>\n<li>Other duties as assigned.</li>\n</ul>\n\n<strong>QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>Must be able to perform as a technical team member and leader.</li>\n<li>Must be able to work in a factory environment dealing with equipment and raw ingredients.</li>\n<li>Must be able to conduct plant tests and product/production commissioning.</li>\n<li>BS degree in Food Science, Chemistry, or Biology.</li>\n<li>3-5 years of relevant experience within the food industry.</li>\n<li>Must be able to travel by plane and be capable of travel for extended periods of time.</li>\n<li>Physical Labor (some lifting and maneuvering around of equipment in plant locations).</li>\n</ul>\n\nDel Monte Foods is one of the country's largest and most well-known producers, distributors and marketers of premium quality, branded food products for the U.S. retail market. With a powerful portfolio of brands, Del Monte products are found in six out of ten U.S. households. Brands include Del Monte®, Contadina®, S&amp;W®, College Inn®, and other brand names. The Company also produces and distributes private label food products. For more information on Del Monte Foods, visit the Company's website at www.delmontefoods.com.\n<br><br>\n<strong>WE OFFER:</strong>\n\n\n<ul>\n<li>Competitive salary</li>\n<li>Comprehensive benefits package including Medical, Dental, Vision, and 401(k)</li>\n</ul>\n\nDel Monte Foods, Inc. is an Equal Opportunity Employer. All qualified applicants will be considered without regard to race, color, religion, gender, national origin, sexual orientation, age, marital status, medical condition, disability, protected veteran status, or any other legally protected status.\n<br><br>\nALL RESUMES NEED TO BE SUBMITTED THROUGH WWW.DELMONTEFOODS.COM TO BE CONSIDERED. (https://www.delmontefoods.com/careers/). Please be advised that your application is not complete until you fill out, sign, and submit an Application for Employment for a specific position for which Del Monte Foods, Inc. is actively recruiting. Your application must reflect that you possess the required qualifications for the position.\n<br><br>\nNo sponsorship is available for this position.\n<br><br>\nNo agencies or 3rd party vendors<br><br>SDL2017"}