{"job title": "Physical Scientist", "company": "Department of Labor", "city state": "– Salt Lake City, UT", "rating": "2.9", "job description": "<ul>\n<li>Videos</li>\n<li>Duties</li>\n</ul>\n\nHelpDuties Summary\n<br><br>\nThis position is located with Department of Labor, Occupational Safety and Health Administration, Salt Lake Technical Center, Sandy, Utah.\n<br><br>\nThis position has promotion potential to GS-11. There is no obligation to provide future promotions to you upon selection. Future promotions are dependent on your ability to perform the duties at a higher level, the continuing need for an employee assigned to the higher level, and supervisory approval.\n<br><br>\nThis position is inside the bargaining unit.\n<br><br>\nLearn more about this agency\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nPerform professional work in chemistry in a developmental capacity performing assignments designed to further develop applicable analytical and evaluative skills and techniques. Perform selected tasks and phases of routine studies and projects. Perform preliminary analytical processes following established laboratory accreditation quality system and legal chain of custody requirements. Provide assistance in planning, monitoring, and conducting analytical projects. Assist senior Chemist(s) in determining the validity, feasibility, achievability, and efficiency of studies and projects. Performs preliminary analyzes and reports results to the senior Chemist or supervisor. Use standard methods and procedures to perform air and bulk sample analysis. Contact field staff to fill in data gaps on sampling forms and clarify analytical request. Employs established methods and procedures for analyzing environmental conditions and analyzing quality assurance samples. Refer problems in analytical process or out of control results to the senior Chemist. Support operations by processing and preparing samples, performing routine instrument maintenance and monitoring, ordering, and maintaining laboratory supplies and equipment.\n<br><br>\nTravel Required\n<br><br>\nOccasional travel - Occasional Travel\n<br><br>\nSupervisory status\n<br><br>\nNo\n<br><br>\nPromotion Potential\n<br><br>\n<strong>11</strong>\n\n\n<ul>\n<li>Job family (Series)</li>\n</ul>\n\n1301 General Physical Science\n\n\n<ul>\n<li>Requirements</li>\n</ul>\n\nHelpRequirements Conditions of Employment\n\n\n<ul>\n<li>U.S. Citizenship.</li>\n<li>Must be at least 16 years of age.</li>\n<li>Appointment to this position may require a background investigation.</li>\n<li>Requires a probationary period if the requirement has not been met.</li>\n</ul>\n\nApplicants must meet all legal and regulatory requirements. Reference the \"Required Documents\" section for additional requirements.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nA) Degree: physical science, engineering, or mathematics that included 24 semester hours in physical science and/or related engineering science such as mechanics, dynamics, properties of materials, and electronics.\n<br><br>\n<strong>OR</strong>\n<br><br>\nB) Combination of education and experience - education equivalent to one of the majors shown in A above that included at least 24 semester hours in physical science and/or related engineering science, plus appropriate experience or additional education.\n<br><br>\nFOR GS-9: At least one year of specialized experience equivalent to at least the GS-7 level in the Federal service, which has equipped the applicant with the particular knowledge, skills, and abilities to perform successfully the duties of the position, and that is typically in or related to the work of the position to be filled. To be creditable, specialized experience must have been equivalent to at least the next lower grade level in the normal line of progression for the occupation in the organization.\n<br><br>\nFOR GS-11: At least one year of specialized experience equivalent to at least the GS-9 level in the Federal service, which has equipped the applicant with the particular knowledge, skills, and abilities to perform successfully the duties of the position, and that is typically in or related to the work of the position to be filled. To be creditable, specialized experience must have been equivalent to at least the next lower grade level in the normal line of progression for the occupation in the organization.\n<br><br>\n<strong>Education</strong>\n<br><br>\nCollege Transcript and Evaluation of Foreign Education - The Department of Labor does not recognize academic degrees from unauthorized secondary schools or post-secondary institutions that are not accredited by an accrediting body recognized by the Department of Education. Any applicant falsely claiming an academic degree from an accredited school will be subject to actions ranging from disqualification from federal employment to removal from federal service. If your education was completed at a foreign college or university, you must show comparability to education received in accredited educational institutions in the United States and comparability to applicable minimum course work requirements for this position. Click Evaluation of Foreign Education for more information."}