{"job title": "Senior Environmental Scientists", "company": "Jacobs", "city state": "– Yakima, Washington", "rating": "3.4", "job description": "<strong><br><br>Description</strong><br><br>The Buildings &amp; Infrastructure Line of Business is a global network of employees, which serves both the private and public sector. Our employees work to shape the communities we live in by creating world-class projects that transform the future development patterns of those communities. We provide our clients award-winning planning, engineering, architectural and interior design, construction and program management, and design-build project delivery. The Jacobs business model allows us to successfully service our clients, leverage our integrated services, and provide our employees with growth opportunities while delivering global solutions to our clients local programs.We consistently receive high rankings from Engineering News-Record (ENR) in many classifications, including the categories of Top Design Firms, Top Contractors, Top Green Buildings Design Firms, and Top Transportation Companies.<strong> Job Summary:</strong> Jacobs is hiring three part-time temporary positions that are Senior Environmental Scientist(s) providing technical, scientific support and evaluation of engineering design concepts on natural systems. These evaluations may be focused on hydraulic modeling, preliminary to advanced designs, environmental resources, and may involve input during phases of planning, policy development, habitat and/or hydrologic characterization, data analysis, work planning and report writing. These positions will aid Jacobs in working within an interagency team to develop solutions to problems of unusual complexity that require a high degree of innovation and ingenuity. Work performed under the direction of the Jacobs management and/or directly with clients or their representative(s). This direction will focus on the long-range goals and objectives of projects in the Yakima and Kittitas Valley and may have substantial client interaction. This position is based out of our Yakima, WA office. It requires knowledge and understanding of:<li> Policy development/implementation</li> <li> Hydraulic/hydrologic processes</li> <li> Biological processes</li> <li> Review procedures for compliance with environmental regulations</li> <li> Understanding and coordination of project concepts that effect fish, aquatic life, and the aquatic environment/habitat</li> <li> Preparing technical memorandum(s) and/or report(s) based on information and concepts provided by others and assisting in the preparation of cost estimates related to these concepts</li> <li> Performing technical tasks and assisting with the execution of scientific programs under the supervision of a project manager and/or government agency staff</li> <li> Interact with project managers project controls, administrative and safety staff; as well as subcontractors and agency staff</li>\n<strong><br><br>Qualifications</strong>\n<li> A Bachelor's degree in Hydraulics, Biology, Geosciences, or Environmental Sciences is preferred</li>  <li> A minimum of 20 years of experience in a field related to the degrees listed is required</li> <li> Computer literacy in software typical of discipline is preferred</li> <li> Strong technical writing, interpersonal, and client relation skills are preferred</li> <li> Familiarity with government and public sector projects are preferred</li> <li> Understanding and familiarity related to the policy, habitat, riverine systems, and water issues in the Kittitas and Yakima Valleys is required</li> At Jacobs, we help prepare people for new opportunities and challenges. With positions at every level, openings in multiple disciplines, expertise in a range of markets and offices around the globe, we create an environment where you can learn, grow, and thrive. From our competitive benefits program to our Health and Safety initiative of Beyond Zero workplace injuries, we believe that you'll find a flourishing career here at Jacobs.Jacobs is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status or other characteristics protected by law. Jacobs is a background screening, drug-free workplace."}