{"job title": "Senior Director, Data and Technology transformation", "company": "Kinetix Technology", "city state": "– MD - Lanham-Seabrook", "rating": "4.7", "job description": "Category : Information Technology\n<br>\nLocation/City : MD - Lanham-Seabrook\n<br>\nDate Created : 11/28/2015 8:39:54 PM\n<br><br>\nOpportunity\n<br>\nA Senior Director is sought to guide a significant Federal Agency through the application of data-centric security concepts for securing enterprise data. This individual will interface directly with the CTO, ACIOâ?'s, and other senior leadership. The employer influences organizational IT strategy of the agency, while working directly with the client staff to deliver transformative systems and capabilities.Our ability to span both strategy and tactical execution or be â?'stracticalâ? is what we are known for with the client. We are already in the process of modernizing the agencies analytical platform simultaneously: migrating to MPP, inaugurating deep ad hoc analytics through data scientists, and creating a customer service model upon a new foundation. By adopting new technology, the agency is effecting a conversion which will provide more flexibility and efficiency the agency is working to drive flexibility and efficiency. Ultimately using new technologies, data testing methods, delivery service to transforming IT servicing by adopting new technology, new methods in data testing, and new service delivery models, to provide unique solutions to business problems.Position Overview\n<br>\nWith experience derived from several corners, the ideal candidate will have the skills and experience inherent in executives, senior program managers, business development support, as well as being a technologist well versed in data centric systems, and iterative development and delivery. In this new opportunity for us, and enterprise transformation for the client, the Senior Director will work in concert with our executive staff and the senior and exceptionally talented team on the ground delivering systems and capabilities. On the client end interaction will range from ACIOâ?'s to senior technical staff. The Senior Director will report directly to our President.Key Responsibilities - Responsible for account teams Â­ composition and staffing (contractor and employee). Manage P&amp;L. Drive the advancement and maturity of staff. Materially use, promote, and advance the Computech service delivery model. Incremental delivery of software and technology capabilities (code and systems). Identify new opportunities and engage with Computech executive staff to drive acquisition. - Guide customer and staff in improving iterative and agile delivery, client engagement, and interaction. Manage key project variables to ensure constant forward progress. - Coach and mentor customer with new technologies, transformation challenges, staff skills, et cetera.Demonstrated Qualifications Â­ Accomplishments &amp; Skills\n<br>\nThe ideal candidate will show early hands on development experience, iterative delivery of frequent working capability, to executive level engagement. A proven track record delivering the entailed capabilities must be shown. Bachelorâ?'s Degree in Computer Science or other technical track. Advanced degree a plus. Minimum 15 years of experience in software and dataÂ­centric technology delivery. Familiarity with government contracting; Expertise a plus but not required. Has had direct responsibility for 2Â­5 delivery teams, staff size of 20 to 60 people. Significant data experience Â­ MPP (big data) a plus, DW, BI, Agile Data. - Navigating enterprise class organizations and driving specific initiatives within them. - Ability to conceptualize technology roadmap and create a full lifecycle engagement and execution plan.\n<br><br>"}