{"job title": "Senior Research Scientist - Immunology", "company": "MD Anderson", "city state": "– Houston, TX", "rating": "4.1", "job description": "The goal of the department of Immunology is to perform multidisciplinary research and educational activities in basic and cancer immunology.\n<br><br>\nThe salary range is min $ 59,200 mid $ 74,200 max $ 88,800.\n<br><br>\n<strong>Research Projects:</strong>\n<br><br>\nWorking in collaboration with clinical coordinators.\n\n\n<ul>\n<li>Independently plans, organizes, coordinates, directs and participates in scientific research projects.</li>\n<li>Organizes and analyzes data from the different clinical trials to be</li>\n</ul>\n\npresented at different meetings.\n\n\n<ul>\n<li>Assigns and reviews work of subordinates.</li>\n<li>Attends day-to-day meetings pertaining to the Immunotherapy</li>\n</ul>\n\nPlatform and informs superior about meeting outcomes.\n\n\n<ul>\n<li>Supervises the design, development, or adapting of equipment used in experiments or research to obtain desired results. Plans and</li>\n</ul>\n\nsupervises the training of technicians and other laboratory personnel\n<br><br>\nwith respect to proper laboratory techniques, the use of laboratory\n<br><br>\nequipment, and safety procedures.\n\n\n<ul>\n<li>Other duties as assigned</li>\n</ul>\n\n<strong>Flow Analysis:</strong>\n\n\n<ul>\n<li>Optimizes and establishes new immunomonitoring technologies</li>\n</ul>\n\n(such as Cytometry by time-of-fight or CyTOF, UV-mediated ligand\n<br><br>\nexchange of peptide-MHC class I complexes) to be used at the\n<br><br>\nImmunotherapy Platform; High dimensional analysis of successful cancer immunotherapy such as R programming, VisNE, Phenograph, Scaffold, SPADEand CITRUS); Single cell gene expression and TCR sequencing.\n\n\n<ul>\n<li>Monitor patients' tissues (blood and tumor) using cutting edge</li>\n</ul>\n\ntechnologies including Flow Cytometry (18 colors), CyTOF and high order ELISPOT\n<br><br>\n(3 colors or more), serum analysis using protein/peptide microarrays, etc.\n<br><br>\n<strong>Standard Operating Procedures:</strong>\n<br><br>\nWrites SOP's to be used in the lab.\n<br><br>\n<strong>EDUCATION:</strong>\n<br><br>\nRequired: PhD in Natural Science, related field or medical degree.\n<br><br>\n<strong>EXPERIENCE:</strong>\n<br><br>\nRequired: Five years of experience in experimental or scientific work.\n<br><br>\nIt is the policy of The University of Texas MD Anderson Cancer Center to provide equal employment opportunity without regard to race, color, religion, age, national origin, sex, gender, sexual orientation, gender identity/expression, disability, protected veteran status, genetic information, or any other basis protected by institutional policy or by federal, state or local laws unless such distinction is required by law. http://www.mdanderson.org/about-us/legal-and-policy/legal-statements/eeo-affirmative-action.html"}