{"job title": "Lead Data Eng-Demand Sensing, Enterprise Data", "company": "Nike", "city state": "– Beaverton, Oregon", "rating": "3.9", "job description": "<strong>Job Description</strong>\n<br><br>\nDescription\n<br><br>\nNike is looking for a seasoned engineer who can lead and grow teams of data engineers and developers to support machine learning engineers and data scientists to deliver scalable machine learning and advanced analytics solutions to customers across our business. You will work on a variety of complex business problems such as forecasting, personalization, and inventory optimization. You will productionalize and scale solutions in the cloud as APIs, stream processing, or massive batch processing. You will leverage big data, parallel processing technologies, advanced analytics, machine learning, and deep learning techniques to quantitatively plan product demand, allocate resources, and target the right customers with the best products. You will foster partnerships with best of breed open source communities, commercial vendors, and universities. Above all, your work will accelerate Nike's core mission of serving Athletes*.\n<br><br>\nWhat you'll do\n\n\n<ul>\n<li>Design and build reusable components, frameworks and libraries at scale to support analytics products</li>\n<li>Design and implement product features in collaboration with business and Technology stakeholders</li>\n<li>Identify and solve issues concerning data management to improve data quality</li>\n<li>Clean, prepare and optimize data for ingestion and consumption</li>\n<li>Collaborate on the implementation of new data management projects and re-structure of the current data architecture</li>\n<li>Implement automated workflows and routines using workflow scheduling tools</li>\n<li>Build continuous integration, test-driven development and production deployment frameworks</li>\n<li>Collaboratively review design, code, test plans and dataset implementation performed by other data engineers in support of maintaining data engineering standards</li>\n<li>Analyze and profile data for the purpose of designing scalable solutions</li>\n<li>Troubleshoot data issues and perform root cause analysis to proactively resolve product and operational issues</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Experience building cloud scalable, real time and high-performance data lake solutions</li>\n<li>Experience with relational SQL</li>\n<li>Experience with scripting languages such as Shell, Python</li>\n<li>Experience with source control tools such as GitHub and related dev process</li>\n<li>Experience with workflow scheduling tools</li>\n<li>Understanding of micro service architecture</li>\n<li>Preferred: Strong understanding of developing complex data solutions</li>\n<li>Willing to learn new skills and technologies</li>\n<li>Has a passion for data solutions</li>\n<li>Understands data structures and algorithms</li>\n<li>Understands solution and technical design</li>\n<li>Has a strong problem solving and analytical mindset</li>\n<li>Able to influence and communicate effectively, both verbally and written, with team members</li>\n<li>Able to quickly pick up new programming languages, technologies, and frameworks</li>\n</ul>"}