{"job title": "Senior Scientist, Downstream Process Development", "company": "Pfizer", "city state": "– Andover, MA", "rating": "3.9", "job description": "A Senior Scientist position is available in the Purification Process Development group, Bioprocess R&amp;D. The successful applicant will have experience in laboratory research, and a desire to continue in a laboratory-focused role. This position will join a larger team of scientists across multiple sites focused on developing and optimizing recovery and purification processes for recombinant proteins and biological macromolecules for early- and late-phase clinical trials. The Senior Scientist will be responsible for working with fellow scientists to develop robust, efficient, scalable strategies for improving process performance.\n<br><br>\nResponsibilities will include small-scale studies, and pilot plant and manufacturing downstream purification studies. Based on the analyses of these studies, this position will be expected to develop and test new hypotheses to improve the fundamental understanding of recovery and purification processes. This position will support process validation, quality by design, regulatory approaches, and quality systems. This position will be expected to prepare internally reviewed technical reports, make oral presentations to scientists and management, and publish externally. The Senior Scientist will be responsible for executing operational efficiency improvements and planning and implementing improvements across Bioprocess R&amp;D work processes. The successful candidates must be able to endorse change to business infrastructure to ensure pipeline, legacy and technology success.\n<br><br>\nThis position requires a highly motivated individual with the ability to work closely with other members of the laboratory and the department in a matrix team environment to also drive novel innovative technology strategies. This position will collaborate with pilot plant and manufacturing staff on experimental studies, clinical manufacturing, and process validation, including work with external contract manufacturing organizations.\n\n\n<ul>\n<li>*BASIC QUALIFICATIONS**</li>\n</ul>\n\n+ Bachelor's Degree with 5-8 years of experience, Master's Degree with 3-6 years of experience or Ph.D. degree with 0-4 years experience in a biological or engineering discipline (Biotechnology, Biochemistry, Chemical/Biochemical Engineering, or equivalent).\n<br><br>\n+ Experience in recombinant protein purification process development, technology transfer and/or bioprocess manufacturing required.\n<br><br>\n+ Demonstrated ability to drive for results and drive innovative research programs independently.\n<br><br>\n+ A good understanding of protein chemistry and protein analytics, including the recent scientific literature, is required.\n<br><br>\n+ Applicants should be bright, organized, self-motivated, and capable of working independently, and in a collaborative environment.\n<br><br>\n+ The successful candidate will possess strong oral and written communication skills.\n<br><br>\n+ Strong analytical and computer skills are required.\n\n\n<ul>\n<li>*PREFERRED QUALIFICATIONS**</li>\n</ul>\n\n+ Diverse work experience recovering recombinant proteins from mammalian and microbial/yeast cultures.\n<br><br>\n+ Experience transferring biologics processes to pilot plants or manufacturing organizations, and knowledge of data acquisition and controls systems in these environments is desirable.\n<br><br>\n+ Experience taking a late-stage project through process validation and commercialization is desired.\n<br><br>\n+ Sound understanding of statistical experimental design and analysis is a benefit.\n<br><br>\n+ Strong working knowledge of the drug development process for progression of a biological candidate.\n\n\n<ul>\n<li>*OTHER JOB DETAILS**</li>\n</ul>\n\n+ **Last Date to Apply for Job: September 14, 2018**\n<br><br>\n+ Additional Location Information: Andover, MA\n<br><br>\n+ Eligible for Employee Referral Bonus: Yes\n\n\n<ul>\n<li>*EEO &amp; Employment Eligibility**</li>\n</ul>\n\nPfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.\n\n\n<ul>\n<li>*Sunshine Act**</li>\n</ul>\n\nPfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider's name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.\n<br><br>\nPfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates."}