{"job title": "Clinical Development Scientist - Philips", "company": "Philips", "city state": "– ", "rating": "3.4", "job description": "Job Description<br><br><strong> In this role, you have the opportunity to:</strong>\n<br><br>\nClinical Scientist leading in design of clinical strategies that may support premarket submission/approvals for neurological monitoring and stimulation devices employing AI and computational algorithms, by defining strategies for evidence generation, data and documentation requirements and managing any related reporting. Tasks may include but not be limited to: clinical evidence scan and analyses, clinical strategy as well as clinical development plan.\n<br><br>\n<strong> You are responsible for</strong>\n<li> Will provide strategic input into clinical aspects related to the end-to-end (E2E) BG portfolio, from ideation through post-marketed products</li> <li> Works closely together with internal (project owners, regulatory, clinical study managers, statisticians, business leaders, etc.) and external (clinical consultants such as Key Opinion Leaders (KOL) and subject matter experts (SMEs)) stakeholders to ensure that studies will yield well-founded conclusions.</li>  <li> Responsible for professional collaboration with, investigators, IRBs/ECs, Regulatory Agencies, societies, and associations</li>  <li> Additional collaboration may occur to support claims, reimbursement, health economic outcomes and / or market access.</li>  <li> Through active cooperation with physicians and / or medical researchers, the clinical scientist will work with scientific writing personnel or take a leading role to support the publication of study results.</li>  <li> Will ensure appropriate interpretation and dissemination of all evidence generated, including Clinical Study Reports (CSRs), Clinical Evaluation Reports (CERs), abstracts, peer reviewed manuscripts, as assigned.</li>  <li> Will lead or support scientific discussions with regulatory agencies / notified bodies to drive support of the clinical and regulatory strategy, including proposed clinical investigations; review process of clinical evidence generated for marketing authorization, line extensions, including during sponsor regulatory inspections.</li> <li> Design clinical studies that result in scientifically sound and valid data o Ensure that studies (clinical and non-clinical) are appropriately designed, and that the results are appropriately analyzed and accurately reported</li>  <li> Develop study protocols in compliance with project standards and specifications and regulatory guidelines (GCP, ICH, FDA, ISO)</li>  <li> Keep current with regulatory guidance and requirements in the global environment</li> <li> Contribute to applications for registration purposes by providing leadership in standardizing and optimizing strategic clinical study input</li>\n<strong> You are a part of</strong>\n<br><br>\nThe Clinical Development Scientist reports to the Director of Clinical Affairs. This position offers the opportunity to impact lives through the development and testing of quality Philips products and solutions that help countless people all over the world. We have a fantastic work environment and culture that is respectful and rewarding, that offers opportunities to develop and grow both personally and professionally. These opportunities are limited only by ones initiative and desire to succeed. The ability of this position to work with both internal and external customers promotes a broader vision to additional opportunities across Philips as a global company.\n<br><br>\n<strong> To succeed in this role, you should have the following skills and experience</strong>\n<li> Scientific education (preferably Masters or PhD degree preferred in BioMedical Science or Health related field), with extensive experience in doing research for industry</li> <li> A demonstrated working knowledge of GCP, ICH guidelines, FDA regulations (21CFR812) and EU (ISO14155) regulations</li> <li> Extensive clinical research knowledge and cross-functional understanding of clinical trial methodology and operational experience is a must</li> <li> 7+ years of experience in a similar role in the Medical Device industry</li> <li> Excellent verbal and written communication skills (English); multiple languages is a plus</li> <li> Ability to collaborate effectively with various teams - clinical operations, engineering, cross functional team members, as well as external partners</li>  <li> Self-directed with a strong work ethic, with an ability to work in a goal-oriented environment</li> <li> Strong writing skills to produce quality clinical documents, including final reports</li> <li> Analytical thinking, able to present statistical methods and results to a variety of audiences, especially non-statisticians Proficient computer skills across multiple applications (MS Office, with experience in and an aptitude for clinical trial software, proven ability to apply statistics into method development and sample analysis, experience with SAS / SPSS statistical software is a plus</li> <li> Remote position - Only WEST COAST candidates will be considered plus 25% travel</li>\n<strong> In return, we offer you</strong>\n<br><br>\nWorking in the medical industry brings much fulfillment, as well as unique challenges. As part of our HealthTech focused company, you will be responsible for successfully dealing with and managing Philips relationships with approval agencies such as the US Federal Drug Administration (FDA).\n<br><br>\n<strong> Why should you join Philips?</strong>\n<br><br>\nWorking at Philips is more than a job. Its a calling to create a healthier society through meaningful work, focused on improving 3 billion lives a year by delivering innovative solutions across the health continuum. Our people experience a variety of unexpected moments when their lives and careers come together in meaningful ways. Learn more by watching this video."}