{"job title": "Research Scientist", "company": "Spark Therapeutics", "city state": "– Philadelphia, PA", "rating": "2.3", "job description": "Join the Spark Team\n<br><br>\nWe were born of innovation, springing from the curiosity, imagination and dedication of remarkable scientists and healthcare visionaries. Our shared mission is to challenge the inevitability of genetic disease by discovering, developing, and delivering treatments in ways unimaginable until now.\n<br><br>\nWe don't follow footsteps. We create the path.\n<br><br>\nSummary\n<br><br>\nThe Research Scientist is a member of the Liver Therapeutic Area within the Translational Research Department. S/he will be responsible for:\n\n\n<ul>\n<li>Design and construction of optimized AAV gene therapy vectors to drive therapeutic transgene expression derived from liver cells.</li>\n<li>Experimental design, execution and data analysis for liver-directed research programs.</li>\n<li>Write study reports, manuscripts and present results at appropriate scientific meetings.</li>\n<li>Initiate and oversee joint programs with internal and external collaborators.</li>\n</ul>\n\n<strong>Responsibilities</strong>\n<br><br>\n<strong>80%</strong>\n\n\n<ul>\n<li>Identify and validate new indication targets and optimize gene expression cassettes to support both existing and new programs in the pipeline. This includes executing experiments on the bench, extensive literature review, championing product candidate development from proof of concept to IND submission, etc.</li>\n</ul>\n\n<strong>20%</strong>\n\n\n<ul>\n<li>Prepare sample analysis reports, present results to various internal teams, and write parts of regulatory submissions to regulatory agencies.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Experience in general and advanced lab techniques such as molecular cloning and plasmid design and construction, qPCR, ELISA, cell culture, plate-based luciferase and/or enzymatic activity assays, SDS-PAGE/western blotting, etc.</li>\n<li>Experience with studies in laboratory animals.</li>\n<li>Familiarity with IND enabling studies, regulatory filings, and GLP studies is a plus</li>\n<li>Strong analytical skills and problem-solving capabilities</li>\n<li>Proven ability to work independently in hands-on laboratory setting, self-motivated to learn and develop new techniques, perform multiple tasks simultaneously, keep accurate records, follow instructions, and comply with company policies.</li>\n<li>Excellent communication skills (both oral and written)</li>\n<li>Familiar with computer software commonly used in bio/pharma industries.</li>\n<li>Works with colleagues as a team player.</li>\n<li>Strong organizational skills.</li>\n<li>Strong publication record is a plus.</li>\n</ul>\n\n<strong>Requirements</strong>\n\n\n<ul>\n<li>Typically has a PhD in a scientific discipline and 3 years of related experience. May also have a Bachelor's Degree or Master's degree and 3 years of related experience.</li>\n<li>Hands-on research experience, ideally with gene therapies targeting the liver</li>\n<li>Familiarity with target lead identification/optimization using a combination of molecular, cellular and in vitro/in vivo techniques.</li>\n<li>Experience with studies in laboratory animal models</li>\n<li>Experience with AAV vectors and hepatic gene therapy is preferred, but not required</li>\n</ul>"}