{"job title": "Associate Scientist, Process Development", "company": "Summit Partners, L.P", "city state": "– Hayward, California", "rating": "4.2", "job description": "Description<br><br>LakePharma is a leading biologics company specializing in antibody and protein engineering, cell line development, and protein production. Our services can be fully integrated, creating a customized solution for all our customers molecular biology, cell line, and protein needs. We just raised $30m in growth equity from Summit Partners &amp; Ampersand Capital Partners for expansion purposes.\n<br><br>\nWe are rapidly growing and seeking a talented individual to join our Process Development team as a full-time <strong> Associate Scientist</strong> . The candidate will provide support to the Process Development group.\n<br><br>\nMajor duties include but are not limited to:\n<li> The position focusing on CHO cell culture and continuous harvesting process</li>\n<li> Operating glass or different scales of single use bioreactors</li>\n<li> Performing various scale of protein production and purification</li>\n<li> Supporting small to large scale cell culture media preparation work</li>\n<li> Requiring using Novaflex analyzer, cell counters and other analytical equipment</li>\n<li> Performing execution of experiment with different types of small scale bioreactors</li>\n<li> Assisting with data recording and analysis</li>\n<li> Maintaining accurate laboratory notebook and relevant documentation</li>\n<li> Maintaining equipment and instrument</li>\n\nRequirements<br><br>The ideal candidate will possess:\n<li> B.S., M.S.in biochemistry, chemical engineering or related field (salary will depend on education and experience)</li>\n<li> B.S with 3+ years or Master with 1+ year experience on mammalian cell culture and bioreactor operation</li>\n<li> Excellent oral and written communication skills</li>\n<li> Excellent record keeping skills</li>\n<li> Excellent attention to detail</li>\n<li> Strong ability to work on multiple projects at once</li>\n<li> Strong ability to manage work independently while working effectively in a team</li>\n<li> Strong ability to interact constructively with a diverse client base</li>\n<li> Ability to adapt to rapidly changing projects</li>\nThis position provides a unique opportunity to join and contribute to a fast-paced team, with a cutting-edge technology platform, and ample opportunity to grow with the company. The job function includes scientific research and collaboration with LakePharma's biotech partners and clients.\n<br><br>\nIf you have the <strong> drive</strong> , <strong> passion</strong> , <strong> experience</strong> and are excited by this opportunity and ready to take your career to the next level then <strong> Apply Today!</strong>"}