{"job title": "Data Engineer", "company": "TrueCar", "city state": "– Santa Monica, CA", "rating": "3.3", "job description": "Job Description:<br><br>TrueCar is seeking to add Engineers to our Data team. This team applies subject matter expertise to source, analyze and validate the automotive data required from internal and external sources. These data engineers are also responsible for data modeling and structuring and aggregating the data in an efficient, accurate and customer relevant manner. Implementing in the following technologies but not limited to:\n<br><br>\n<strong>ABOUT THE JOB:</strong>\n<ul>\n<li>Design and develop efficient and scalable data processing pipelines using big data technologies ( Hadoop, Spark, HBase, Kinesis etc...) on large scale structured/unstructured data sets.</li><li>Build complex workflows and orchestrate data dependencies.</li><li>Work within state of the art engineering practices (i.e. SCRUM, unit/integration testing, design review, code reviews, continuous integration, etc.).</li><li>Work productively together and learn from other top-level players.</li><li>Ability to learn and adapt to continually evolving technologies in the big data ecosystem.</li>\n</ul>\n<strong>WHAT YOU NEED:</strong>\n<ul>\n<li>4 + years of experience programming in Java.</li><li>2+ years of experience in the Big Data technologies.</li><li>Experience in big data technologies: MapReduce, Spark, ElasticSearch, HBase, Pig, Hive etc.</li><li>Proficient in SQL and experience with RDBMS/NoSQL databases.</li><li>Experience working with Cloudera/Hortonworks/EMR distribution in AWS.</li><li>Ability to self-manage tasks and be proactive in working with other teams to accomplish them while taking pride and ownership in their work.</li><li>Has strong interpersonal communication skills; effectively communicates in verbal and written form.</li>\n</ul>\n<strong>NICE TO HAVE:</strong>\n<ul>\n<li>Experience in Scala</li><li>Experience in AWS Machine Learning, DataRobot or other Machine Learning technologies.</li><li>BA/BS in related field.</li>\n</ul>\n\nLocation(s): Santa Monica Offices\n<br>\nAssociated topics: data engineer, data integrity, data manager, data management, data scientist, data warehousing, erp, hbase, mongo database, teradata"}