{"job title": "Staff Scientist - Computational Genetics - Cardiology", "company": "Washington University In St. Louis", "city state": "– Saint Louis, Missouri", "rating": "4.2", "job description": "Job Type/Schedule<br><br>This position is full-time and works approximately 40 hours per week.<br><br>Department Name/Job Location<br><br>This position in the Stitziel Laboratory located in the Cardiovascular Division of the Department of Medicine. Our lab is affiliated with both the Center for Cardiovascular Research and The Genome Institute, one of only three NIH-funded large-scale genome centers in the United States. The position is located within the Genome Institute at the 4444 Forest Park Avenue Building on the Washington University School of Medicine campus.<br><br>Essential Functions<br><br><strong> POSITION SUMMARY:</strong>\n<br><br>\nOur lab focuses on gene mapping for complex and Mendelian forms of cardiovascular disease in addition to statistical methods development for the analysis of complex genetic data. We study these problems in hopes of applying genetic findings and techniques to improve clinical care and human health.\n<br><br>\n<strong> PRIMARY DUTIES AND RESPONSIBILITIES:</strong>\n<br><br>\nA staff scientist position is immediately available with a primary focus on the analysis of large genomic datasets in the context of cardiovascular disease. Roles of the staff scientist include:\n<li> Following instructions and discussions with principal investigator, designs research protocols, including developing procedures for the collection, verification and management of data.</li> <li> Assists with grant preparation and reporting.</li> <li> Performs complex statistical analysis of data collected and writes interpretative reports. Verifies the correctness of the data submitted and makes recommendations based on these analyses.</li> <li> Documents research topics and prepares and submits papers based on research work to publications and committees for publication or presentation to peers.</li> <li> Solves practical problems relating to difficulties with equipment or test subjects. Suggests technical or procedural improvements in testing methods.</li> <li> Conducts literature searches related to research project.</li>\n\nRequired Qualifications<br><br>Masters degree with 4 years of experience in research lab operations or equivalent combination of education and experience equaling 9 years required.<br><br>Preferred Qualifications\n\n<li> Analytical, reasoning and problem solving skills.</li> <li> Ability to analyze and interpret statistical data and to communicate data in a clear, concise manner.</li>  <li> Computer literacy including the ability to use a variety of software packages to analyze data.</li> <li> Ph.D. in a genomics-related field.</li> <li> Extensive computational skills.</li> <li> Strong communication skills.</li> <li> Independent and self-motivated.</li> <li> Experience analyzing large genetic datasets.</li> <li> Statistical genetics experience.</li>\n\nSalary Range<br><br>The hiring range for this position is $45,864 to $61,921 annually.<br><br>Benefits<br><br>This position is eligible for full-time benefits. Please visit our website at http://hr.wustl.edu to view a summary of benefits.<br><br>Applicant Special Instructions\n\n<li> Works in laboratory environment with potential exposure to biological, chemical and radioactive hazards.</li>  <li> Must be physically able to wear protective equipment.</li>  <li> Must be able to provide standard care to research animals.</li>\n\nEOE Statement<br><br>Washington University is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity or expression, national origin, genetic information, disability, or protected veteran status."}