{"job title": "Staff Scientist - Molecular Microbiology - St.", "company": "Washington University In St. Louis", "city state": "– Saint Louis, Missouri", "rating": "4.2", "job description": "Job Type/Schedule<br><br>This position is full-time and works approximately 40 hours per week.<br><br>Department Name/Job Location<br><br>This position is in the Department of Molecular Microbiology. This position is for the Medical School Campus.<br><br>Essential Functions<br><br><strong> POSITION SUMMARY</strong> :\n<br><br>\nThe <strong> Khader Lab in the Department of Molecular Microbiology at Washington University</strong> in St. Louis has an immediate opening for a highly motivated candidate to join a fast-paced environment. The laboratory <strong> of Dr. Shabaana Khader</strong> is interested in investigating parameters that mediate protective immunity to the pulmonary infectious disease, tuberculosis. Assists in developing and conducting research projects, including experimental design, data analysis and documentation of experimental results. The primary focus of the work includes, but is not limited to:\n<li> Studying immune parameters using gene deficient mice and mouse models of tuberculosis.</li> <li> Testing vaccine strategies and host direct therapeutics that protect against tuberculosis.</li> <li> Characterizing the role of granulomas in immunity to tuberculosis.</li>\n<strong> PRIMARY DUTIES AND RESPONSIBILITIES:</strong>\n<li> Following instructions and discussions with principal investigator, designs research protocols, including developing procedures for the collection, verification and management of data.</li> <li> Assists with grant preparation and reporting.</li> <li> Performs complex statistical analysis of data collected and writes interpretative reports. Verifies the correctness of the data submitted and makes recommendations based on these analyses.</li> <li> Documents research topics and prepares and submits papers based on research work to publications and committees for publication or presentation to peers.</li> <li> Solves practical problems relating to difficulties with equipment or test subjects. Suggests technical or procedural improvements in testing methods.</li> <li> Conducts literature searches related to research project.</li>\n\nRequired Qualifications<br><br>Masters degree with 4 years of experience in research lab operations or equivalent combination of education and experience equaling 9 years required.<br><br>Preferred Qualifications\n\n<li> The successful applicants will have prior experience working with mouse models and have exceptional organizational skills.</li> <li> Candidates with extensive prior experience in cell, molecular biology or related fields are encouraged to apply.</li>  <li> Candidates with a PhD and at least three years of applicable experience preferred.</li> <li> Analytical reasoning and problem solving skills.</li>  <li> Demonstrated working knowledge of standard laboratory policies, procedures and equipment.</li>  <li> Ability to communicate in oral and written form with all levels of personnel and technical publications.</li>  <li> Able to work well independently or as a team member.</li>\n\nSalary Range<br><br>The hiring range for this position is $46,779 - $63,170 annually.<br><br>Benefits<br><br>This position is eligible for full-time benefits. Please visit our website at http://hr.wustl.edu to view a summary of benefits.<br><br>Applicant Special Instructions<br><br>Works in laboratory environment with potential exposure to biological, chemical and radioactive hazards. Must be physically able to wear protective equipment. Must be able to provide standard care to research animals.<br><br>EOE Statement<br><br>Washington University is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity or expression, national origin, genetic information, disability, or protected veteran status."}