{"job title": "Associate Scientist, In Vivo Specialist", "company": "Arrowhead Pharmaceuticals, Inc.", "city state": "– Madison, WI", "rating": "3.5", "job description": "Arrowhead Pharmaceuticals, Inc. is a Nasdaq listed (ARWR) company that develops medicines to treat intractable diseases by silencing the genes that cause them. Using a broad portfolio of RNA chemistries and efficient modes of delivery, Arrowhead therapies trigger the RNA interference mechanism to induce rapid, deep and durable knockdown of target genes. RNA interference, or RNAi, is a mechanism present in living cells that inhibits the expression of a specific gene, thereby affecting the production of a specific protein. Arrowhead's RNAi-based therapeutics leverage this natural pathway of gene silencing. Arrowhead's dynamic and innovative environment offers our employees the opportunity to advance revolutionary treatments for serious and intractable diseases. Our employees are smart, creative, professionals who work collaboratively to meet our business and scientific challenges. Arrowhead's R&amp;D facility is located in the University Research Park in Madison, WI.\n<br><br>\nThe Position\n<br><br>\nArrowhead Pharmaceuticals is seeking an experienced Associate Scientist to join the In Vivo Testing and Non-Clinical Development Department. S/He will be joining a team of highly motivated and experienced chemist and biologists and contribute to the success of Arrowhead. S/He will be expected to:\n\n\n<ul>\n<li>Research relevant disease models and assist with experimental design</li>\n<li>Utilize a wide range of in vivo techniques to validate targets for therapeutic indications</li>\n<li>Design, plan and perform rodent surgical procedures including micro-surgical techniques (catheter implantation, telemetry implantation, organ perfusion, myocardial ischemia)</li>\n<li>Collect and analyze physiological data (blood pressure, cardiac function, pulmonary function)</li>\n<li>Perform routine animal handling, surgery, recovery, care, dosing, blood collection and euthanasia</li>\n<li>Conduct drug dose calculations and prepare drug mixtures/dilutions</li>\n<li>Develop and conduct ex vivo assays (tissue and blood analysis)</li>\n<li>Maintain and organize data to effectively communicate experimental procedures and results</li>\n<li>Write IACUC protocols and generate data for study reports</li>\n<li>Maintain/calibrate instrumentation and troubleshoot experimental problems</li>\n</ul>\n\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>BS or MS in Pharmacology, Physiology or other Biological Science with 4+ years of experience in small animal surgery research</li>\n<li>Well organized and ability to multi-task and take on new duties as needed</li>\n<li>Great technical skills and willingness to spend a majority of their time in the laboratory conducting experiments</li>\n<li>Strong computer skills including Microsoft office, data acquisition software and Prism GraphPad</li>\n<li>A strong track record of accomplishments</li>\n<li>Excellent interpersonal, verbal and written communication skills</li>\n</ul>\n\nPlease submit a resume and cover letter to careers@arrowheadpharma.com.\n<br><br>\nArrowhead provides competitive salaries and an excellent benefit package.\n<br><br>\nAll applicants must have authorization to work in the U.S. for a company.<br><br>SDL2017"}