{"job title": "Senior Clinical Scientist - Respiratory GMed", "company": "AstraZeneca", "city state": "– Gaithersburg, Maryland", "rating": "3.8", "job description": "<strong>Location: Gaithersburg, Maryland</strong>\n<br><br>\nThe Clinical Scientist will provide scientific and clinical input to all aspects of late stage product development. This includes but is not limited to the, design, delivery and interpretation of pivotal clinical trials and of studies that further characterize the overall benefit and risk and value of Respiratory products in late stage development. The Clinical scientist ensures that the safety evaluation process for the pivotal phase III trials is seamless and complete.\n<br><br>\nIn this role the clinical scientist would seek input from the appropriate functional experts and coordinates these activities in support of clinical studies and programs. The objectives of the Clinical Scientist will be set by the Group Director in agreement with Global Clinical Lead(s). The current role will have a special focus on late stage clinical trials within the respiratory where the Clinical scientist will work in close collaboration with the study team physician with all aspects of scientific input, clinical data quality metrics and safety evaluation.\n<br><br>\n<strong>Major Responsibilities</strong>\n<ul>\n<li>You will have an important role providing scientific leadership in the innovative design, execution and interpretation of clinical trials in one or more development programs.</li><li>You will work closely with colleagues in other functions including Patient Safety, Regulatory Affairs, and Clinical Operations.</li><li>You will be involved primarily in late stage (Ph2b and Phase 3) clinical programs, but will be expected to collaborate with clinical colleagues supporting early stage programs as well as medical affairs colleagues.</li><li>You will provide expert scientific input into the preparation of regulatory documents and interactions with regulatory authorities.</li><li>You will provide expert scientific analysis and interpretation of data from ongoing studies and in the literature.</li><li>Lead development of quality metrics and data review plan for assigned studies</li><li>Support and contribute to medical monitoring of trials</li><li>Assumes other duties as assigned by the Group Director.</li>\n</ul>\n<strong><strong>Key accountabilities:</strong></strong>\n<ul>\n<li>Lead and participate in acitivities that ensure quality, consistency and integration of clinical study related deliverables and ensure safety evaluation process within the clinical team.</li><li>Ensure scientific input to TA standards</li>\n</ul>\n<strong>Minimum Requirements:</strong>\n<ul>\n<li>Scientific doctoral level degree (e.g. PhD or PharmD), relevant equivalent clinical qualification, or other relevant university degree with extensive experience from clinical development.</li><li>Five or more years of relevant pharmaceutical industry experience (multi-country clinical trials) is required.</li> <li>Understanding of scientific and clinical issues related to the design and implementation of clinical trials and interpreting trial results.</li><li>Proven ability to work collaboratively in a cross-functional setting, particularly with patient safety, vendors, CRAs, Site staff and clinical operations.</li>\n<li>Experience, particularly Phase II and Phase III clinical development and experience with regulatory submissions, life cycle management, advisory boards, annual safety updates</li>\n\n</ul>\n<strong>Customers:</strong>\n<br><br>\nWorks with internal and external customers, including Clinical Study Teams, Patient Safety, Clinical Project Teams, Global Product Teams, Therapy Areas, Global Marketing and Business Development, Regulatory, and FDA to accomplish tasks related to the product development, to improve clinical development processes, and to ensure satisfaction of these customers.\n<br><br>\n<strong>Next Steps Apply today!</strong>\n<br><br>\nDo you have what it takes? Welcome to join one of the best teams on the planet!\n<br><br>\nWelcome with your application no later than <strong>11th of April 2018</strong>.\n<br><br>\nAstraZeneca is an equal opportunity employer. AstraZeneca will consider all qualified applicants for employment without discrimination on grounds of disability, sex or sexual orientation, pregnancy or maternity leave status, race or national or ethnic origin, age, religion or belief, gender identity or re-assignment, marital or civil partnership status, protected veteran status (if applicable) or any other characteristic protected by law. AstraZeneca only employs individuals with the right to work in the country/ies where the role is advertised."}