{"job title": "Senior Data Engineer", "company": "bowmo", "city state": "– Jersey City, NJ", "rating": "4.2", "job description": "<div><strong>PURPOSE</strong></div><div>The candidate in this role must also have strong working experience on Big Data platforms to manufacture and engineer data processes.</div><br>\n<div>This role interfaces with the internal IT teams, Data Scientist, Enterprise Architecture, Line Architects and the broader company subsidiaries. The ideal candidate will work to manage data ingest and data distribution using various Big Data technologies but primarily Hadoop.</div><div>This is a hands on role and may have few direct reports. As a data engineer, the candidate will be working to build core internal data processing capabilities and help deliver data driven insights to our internal technology and trading teams. He/She will also help build critical infrastructure used in preparing data sets for business insights. While this role is data focused, it is also technology heavy. The candidate should have strong expertise in log ingestion, ETL and data analytics using various modern technologies, including Apache Spark, ElasticSearch, SQL, etc.</div> <div>The ideal candidate should have strong expertise in Capital Markets data types, like trades, market data, reference data, etc. This person should have knowledge of FpML and FIX protocols. This candidate should also have strong knowledge of technical formats within the Hadoop technology stack.</div>PRIMARY RESPONSIBILITIES\n\n<ul>\n<li>This candidate will write code for data manufacturing, data ingest into the database, and data orchestration within. This candidate will also write code to process the data inside and outside of the Data Lake and work with stakeholders to serve up data in various technical constructs.</li><li>Strong Python, Scala and Java experience</li><li>Self-management: candidate should be a self-starter, with an ambition to work autonomously, passion to learn, ability to grasp new skills and technologies</li><li>The ideal candidate should have excellent communications kills and be able to articulate their point of view.</li> <li>Must have experience with scalable SQL/Hive queries and data transformation jobs</li><li>Must have experience with \"big-data\" frameworks such as Hadoop, HBase, Hive, Oozie, Cassandra, ArangoDB, Spark, MongoDB, etc.</li>\n</ul>\n\n<br>\n<div> Customer and End-User Support</div>\n\n<ul>\n<li>Manage product-related support, feedback and inquiries from users</li><li>Participate in level 2 support on ad-hoc basis</li>\n</ul>\n\n<strong>EDUCATION &amp;/OR EXPERIENCE</strong>\n\n<ul>\n<li><strong><u>Required</u></strong></li><li>Participate in, and execute a product road map with input from the delivery team, stakeholders, and leadership</li> <li>Develop and code the data management services that will core to new products, working with the leadership from Architecture</li> <li>7+ years of demonstrated experience as a software development, with hand on technical leadership, and mentor-ship</li> <li>Experience building and supporting mission critical applications, running in a highly distributed manner.</li><li>Experience with multi-tier system development for large enterprises</li><li>Strong interpersonal communication and organizational skills required to operate as a leading member of global distributed technical teams that deliver world class services</li> \n</ul>\n\n<ul>\n<li><strong><u>Preferred</u></strong></li><li> Experience in financial services, across both front and back office</li><li> BS/MS or PhD in Statistics, Math, Computer Science/Engineering, or related quantitative discipline</li><li> Knowledge of contemporary technologies</li>\n</ul>\n\n<strong>COMPETENCIES</strong>\n\n<ul>\n<li>Detail oriented and obsessed with technology excellence, both individually as well as holding accountable to that vision colleagues and vendors.</li><li>Must be goal oriented and self-managing</li><li>Excellent interpersonal, negotiating, and marketing skills to work with users, senior management, and external personnel on significant matters, often requiring coordinated activity across organizational lines.</li><li>Logical framework approach to solve technical challenges, with the ability to explore many solution alternatives in parallel</li></ul>\n\n<ul>\n<li><strong><u>Technical</u></strong></li> <li>Strong Open Source &amp; Big Data Experience in Scala, Spark, Mesos, Cassandra, Kafka etc.</li> <li>2-5+ years of experience with both relational database design (SQL), non-relational (NoSQL), big data, real-time technologies</li><li>Experience in web application development and associated skills (REST, HTTP, web services</li>\n</ul>\n\n<strong>WORKING CONDITIONS</strong>\n\n<ul>\n<li>NJ location with some travel.</li> <li>Extensive collaboration with teams located in different geographical locations, and time zones</li><li>Engagement with highly technical resources as well as business management</li>\n</ul>"}