{"job title": "Scientist, QC Cell Therapy Bioanalytics", "company": "Celgene Corporation", "city state": "– Warren, NJ", "rating": "3.6", "job description": "<div><strong>Other Locations:</strong>US- NJ- Warren</div>\n<br>\nDescription<br><br>Celgene is a global biopharmaceutical company leading the way in medical innovation to help patients live longer, better lives. Our purpose as a company is to discover and develop therapies that will change the course of human health. We value our passion for patients, quest for innovation, spirit of independence and love of challenge. With a presence in more than 70 countries, and growing - we look for talented people to grow our business, advance our science and contribute to our unique culture.<br><br><strong>QC Scientist, Cell Therapy Bioanalytics</strong><strong>Summit, NJ</strong><br><br><strong>Manager</strong>\n<br><br>\nSenior Manager, QC Analytics\n<br><br>\n<strong>1. Purpose and Scope of Position</strong>\n<br><br>\nThe QC Scientist is responsible for supporting Quality Control bioanalytical testing for release of clinical and commercial products. This includes the ability to interface with multiple groups, the ability to independently perform tasks, interpret results, and troubleshoot. Additionally, when needed, this position will be able to assist with training and assay transfer.\n<br><br>\n<strong>2. Required Competencies: Knowledge, Skills, and Abilities</strong>\n<ul>\n<li>Advanced hands on experience with various analytical techniques including ELISA, qPCR, FACS and scientific knowledge in the characterization and transfer of pharmaceutical products.</li><li>Advanced ability to accurately and completely understand, follow, interpret and apply Global Regulatory and cGMP requirements.</li><li>Advanced technical writing skills.</li><li>Advanced problem-solving ability/mentality, technically adept and logical.</li><li>Ability to represent the interests of the group on cross-functional teams.</li><li>Ability to set priorities of the group and manage timelines.</li><li>Ability to work with management locally and globally.</li><li>Advanced ability to communicate effectively with peers, department management and cross- functional peers.</li>\n</ul>\n<strong>3. Duties and Responsibilities</strong>\n<br><br>\nPerform testing of in-process, final product, and stability samples.\n<ul>\n<li>Utilize scientific principles to assist in analytical testing methods and the proper use of laboratory equipment.</li><li>Capable of handling complex issues and solving problems with only general guidance.</li><li>Prepare and present continuous improvement projects to management.</li><li>Comprehensive understanding of regulatory guidelines and can independently develop, write and execute methods, protocols, reports and other related documents.</li><li>Complete all work in a timely manner.</li>\n</ul>\nPerform peer review of testing data.\n<ul>\n<li> Review all data in accordance with applicable procedures and cGMP requirements.</li><li> Apply technical knowledge and abilities to ensure all testing is performed in a compliant manner.</li><li>Complete all reviews in accordance with required release timelines.</li><li>Communicate effectively with peers, and demonstrate teamwork, with regards to results of review and corrections required.</li>\n</ul>\nTrain new analysts to general job duties.\n<ul>\n<li>Complete necessary training to become a qualified trainer.</li><li>Perform training effectively.</li><li>Document training per procedural and cGMP requirements.</li>\n</ul>\nSupport document revision, project, CAPA, and investigation/deviation tasks.\n<ul>\n<li> Perform assigned tasks within a CAPA, deviation, or project</li><li>Participate in complex projects and continuous improvement efforts.</li><li>Take a leadership role, as required, for projects.</li><li>Draft and review technical documents, such as SOPs and protocols/reports.</li><li>Communicate effectively with management regarding task completion, roadblocks, and needs.</li><li>Demonstrate initiative, courage, and continuous improvement throughout investigation/corrective action lifecycles.</li><li>Performs other tasks as assigned.</li>\n</ul>\n<strong>4. Education and Experience</strong>\n<ul>\n<li>Bachelors degree required, preferably in Science.</li><li>Advanced Degree preferred.</li><li>5-8 years of relevant work experience, preferably in a regulated environment.</li><li>An equivalent combination of education and experience may substitute.</li>\n</ul>\n<strong>5. Working Conditions</strong>\n<ul>\n<li>The incumbent should be able to distinguish colors and possess correctable vision to 20/20, annual eye exam is required.</li><li>The incumbent must analyze numerical values on a daily basis.</li><li>The incumbent will be working a laboratory setting up to six (6) hours per day.</li><li>The incumbent will be working around biohazardous materials, including chemical agents up to six (6) hours per day.</li>\n</ul>\nThis job description is intended to describe the general nature and level of work being performed by the person assigned to this position. The primary duties and responsibilities are intended to describe those functions that are essential to the performance of this job.\n<br><br>\nThis job description does not state or imply that the above are the only duties and responsibilities assigned to this position. There are other duties and responsibilities that are considered incidental or secondary to the overall purpose of this job. Employees holding this position will be required to perform any other job-related duties as requested by management.<br><br>Celgene is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Celgene complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must have authorization to work for Celgene in the U.S."}