{"job title": "Machine Learning Engineer", "company": "CyberCoders", "city state": "– Boston, MA", "rating": "3.8", "job description": "Machine Learning Engineer <div>\nBased in downtown Boston we are a rapidly growing, well-financed, AI powered and dynamic start-up(been around for a few years) looking to build our engineering team.\n<br><br>\nIf you are a Data Scientist with 5+ years of experience, please read on!</div>\n<br>\nTop Reasons to Work with Us<div>\n\n\n<ul>\n<li>Get in early with a growth mode start-up in the AI space</li>\n<li>Our product helps and saves millions of company's hours per year in finding key contract data for audits and other diligence</li>\n<li>Competitive Base + Bonus + The chance to work closely with the CTO to shape the technical direction of our company moving forward</li></ul></div>\n\n\nWhat You Will Be Doing<div>\nDevelop NLP systems that help our customers understand their contracts\n<br>\nWork with a wide range of structured and unstructured data sets and sources\n<br>\nDesign and build customized, large scale cloud-based machine learning systems</div>\n<br>\nWhat You Need for this Position<div>\nStrong software development skills and background\n<br>\nBackground and experience in NLP\n<br>\nStrong programming background in Python or similar scripting / programming language\n<br>\nObject-oriented programming\n<br>\nIn-depth knowledge of testing frameworks</div><br>\n\n<div>\nSo, if you are a Senior Data Scientist with 5+ years of experience, please send over an updated resume to me at ben.stehle@cybercoders.com to learn more!</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}