{"job title": "Senior Data Engineer", "company": "Cypress HCM", "city state": "– Los Gatos, CA", "rating": "4.3", "job description": "<div><strong>S</strong><strong>enior</strong><strong> Data Engineer</strong></div><div>In this role, you’ll partner closely with software engineers, and data scientists to power analytical data products, experimentation, and machine learning models. The best person will have a strong communication, and engineering background to tie initiatives to business impact.</div><div><strong>What you will do?</strong></div>\n\n<ul>\n<li>Partner with engineering teams and internal data consumers on new projects or enhancements</li><li>Build highly scalable data pipelines and continuously experiment with different patterns</li><li>Evolve our data architecture to balance scale and performance</li><li>Build and improve internal tools, and contribute findings to the larger team</li> \n</ul>\n\n<div><strong>Here are some examples of our work</strong></div>\n\n<ul>\n<li>Data Modeling - Partner with data consumers to improve existing data models and build different facets of the business for analytics</li><li>Data Pipelines - Rewrite existing pipelines using Spark (Scala) to make them more efficient in terms of latency and compute</li><li>Data Quality and Anomaly Detection - Improve existing tools to measure data quality through metrics and automatically alert on change</li><li>Analytic Data Products - Engineer storage layers using Druid, Hive, Redshift to power interactive JavaScript applications</li><li>Experimentation - As business evolves, redesign the infrastructure to capture additional metrics for AB experimentation or new feature rollouts</li><li>Machine Learning - In addition to feature engineering, build feedback loops in a Pub/Sub model between ML models and production applications</li>\n</ul>\n\n<div><strong>Who are you?</strong></div>\n\n<ul>\n<li>Analytical mindset to bring together engineering solutions and business impact</li><li>Software engineering mindset and ability to write elegant, maintainable code, and follow engineering best practices</li><li>Experienced in scalable data architectures and schema design</li><li>Expertise in building data pipelines on large complex datasets</li><li>Expertise in one or more programming languages (Scala, or Python)</li><li>Knowledge and familiarity with other distributed data stores (Elasticsearch, Druid)</li><li>Strong SQL (Presto, Spark SQL, Hive) skills</li><li>Excellent communication to collaborate with partners and independently drive decisions</li>\n</ul>"}