{"job title": "Sr. Machine Learning Scientist (Architect)", "company": "Expedia", "city state": "– USA - Washington - Bellevue", "rating": "3.8", "job description": "Expedia<br><br>Are you passionate about the idea of solving real world problems with advanced machine learning methods, at one of the largest online travel companies in the world? If so, we’d like to hear from you!\n<br><br>\nExpedia’s Machine Learning team helps our customers make better travel decisions by transforming raw data into insights that power many of the products and features available on our website. Our team develops mathematical models to resolve complex business problems, and our work is essential to many areas. As a member of our group, your contributions will affect millions of customers and will have a direct impact on our business results. You will have many opportunities to collaborate with other talented machine learning scientists and move the business forward using novel approaches and rich sources of data. If you’re looking to apply your love of problem solving to real-world problems in a stimulating and data-rich environment, we should talk.\n<br><br>\nWe are looking for a Sr. Machine Learning Scientist who is grounded with a strong background in machine learning theory and who is also passionate about model building to be architect for a large portion of our business. In this position, you will research leading edge technologies such as deep learning, and help the greater team apply these technologies as part of their models. You will also work with senior business unit managers and executives to know the business and re-cast it in a way that is can be solved with machine learning.\n<br><br>\nThis is a highly visible role that will provide leadership for an important part of Expedia’s business. You will present results to senior executives in periodic reviews and be consulted as a trusted authority in areas related to machine learning and advanced analytics. This is an amazing opportunity for someone that wants to grow into a distinguished ML researcher or chief algorithm office role.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Understand business and technical challenges and transform them to a machine learning / analytics problem</li><li>You will write concise, well documented modeling code</li><li>You will debug and correct your modeling assumptions though testing</li><li>You will collaborate with business owners and engineers / developers to design and deploy complete solutions that comprise model building, runtime scoring and performance monitoring</li><li>You will document and manipulate large volumes of data; build new and improved techniques and/or solutions for data collection, management, and usage</li><li>You will communicate results in a comprehensible manner to all levels of the company (field teams up to Snr. Management)</li><li>You will develop a keen understanding of the internal technology stack, and how it can influence meta marketing competitiveness.</li><li>You will be an authority in our flights shopping and technology stack</li><li>You will communicate and collaborate with our team of data scientists and externally</li>\n</ul>\n<strong>Qualifications:</strong>\n<ul>\n<li>3 to 5 years experience building predictive models in a production environment</li><li>Advanced degree (PhD preferred) in a quantitative field like computer science, engineering, or statistics.</li><li>Deep understanding of probability, statistics and machine learning theory and standard methodologies.</li><li>Hands-on experience with various machine learning and data mining algorithms, such as logistic regression, random forest, gradient boosting, support vector machines, and neural networks for prediction and recommendation.</li><li>Excellent command of Python and related ML libraries (pandas, scikit-learn, etc.).</li><li>Facility with SQL-like query languages to do data extraction, transformation, and loading.</li><li>Comfort with at least one additional programming language, for example R, Scala, Java, or C++.</li><li>Experience working with large data sets in a distributed computing environment such as Hadoop or Spark.</li><li>Ability to understand the business problem, identify the key challenges, formalize the problem algorithmically, and prototype solutions.</li><li>Passion for solving interesting and meaningful real-world problems using principled techniques and practices.</li><li>Strong attention to detail.</li><li>Consistent experience with documenting, synthesizing, and communicating results.</li><li>Willingness to think through ambiguous problems with others</li>\n</ul>\n*LI-CS1<br><br>Expedia is committed to creating an inclusive work environment with a diverse workforce. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. This employer participates in E-Verify. The employer will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS) with information from each new employee's I-9 to confirm work authorization."}