{"job title": "Senior Scientist - Biopharm Process Analytical", "company": "GlaxoSmithKline", "city state": "– King of Prussia, PA", "rating": "3.7", "job description": "Position Title: Senior Scientist - Biopharm Process Analytical\n<br><br>\n Working Location: Pennsylvania\n<br><br>\n Employment Status: Full time\n<br><br>\n Required Experience: 4 years\n<br><br>\n Required Education: Bachelors\n<br><br>\n Travel Required: 0%\n<br><br>\n Job Description:\n<br>\nThe Advanced Manufacturing Technology (AMT) team, R&amp;D, GSK is currently looking for a highly skilled scientist with a demonstrated track record of developing and implementing innovative novel process analytical technologies (PAT) to support innovation related activities in the biopharmaceutical analytical sciences area. The AMT group was created to deliver GSKs Manufacturing Technology Roadmap with the global objective to transform the way GSK manufacturers its pharmaceutical products over the next 5-10 years. The Biopharm workstream of the AMT group has identified a portfolio of new technology platform opportunities with the potential to transform biopharmaceutical development and manufacturing within GSK. Activities fall into the seek, select, learn, integrate and incubate phase of the Manufacturing Technology Roadmap.\n<br><br>\n It is envisaged that the longer-term impact of this role will be to drive the development of new process analytical technologies which help transform and fundamentally change the way biopharmaceutical drugs are manufactured, analyzed and released. If successful, these roles will leave a lasting impression, not just on GSK, but the broader biopharmaceutical industry as well. The holder will require a unique blend of scientific credibility in the analytical technologies space, personal charisma, as well as very high levels of resilience and bravery to continually challenge the status quo. The role will also require interactions with internal GSK stakeholders, technology partners and academic institutions to drive the development of new process analytical methodologies to transform biopharmaceutical analytics and release.\n<br><br>\n Highly visible position with above average level of accountability. The job holder will be required to take direction from scientific leaders and investigators within Biopharm AMT to identify, collate and lead a portfolio of opportunities in the analytical technologies area. The candidate will also be expected to integrate with the broader analytical and control technologies teams within the Advanced Manufacturing Technology group.\n<br><br>\n<strong>THE SPECIFIC DUTIES OF THE POSITION:</strong>\n<br>\nKey accountability and responsibility will be to execute elements of the approved business plan that includes:\n\n\n<ul>\n<li>Identifying the needs for process analytical technology innovation based on interactions with stakeholders in the biopharmaceutical upstream and downstream process development and pilot/manufacturing teams</li>\n<li>Hands on work in the laboratory with different analytical instruments, along with working in laboratory scale upstream, downstream and formulation processes for continuous biopharmaceutical manufacturing</li>\n<li>Coordinating the seeking, learning, and incubating of new transformative ideas, science and technology within the analytical and process analytical technologies area for biopharmaceuticals,</li>\n<li>Collaborate with existing technology development efforts in the Biopharm R&amp;D community and the wider Manufacturing Technology Roadmap in the process analytical technologies area</li>\n<li>Coordinating external collaborations to access technology, leverage funding and spread risks</li>\n<li>Assist in the evaluation of technologies against Commit to Technology Industrialisation Milestone criteria</li>\n<li>Assist in ensuring smooth transition and embedding of technologies into the relevant business groups.</li>\n\n</ul>\n\n<strong>Essential Skills:</strong>\n\n\n<ul>\n<li>A Bachelors degree OR Masters in analytical chemistry, chemical engineering, biotechnology or related field.</li>\n<li>Candidates with a Bachelors degree must have at least 4 years of hands-on experience at an academic laboratory or manufacturing plant environment. Candidates with a Masters degree must have at least 1 year of hands-on experience at an academic laboratory or manufacturing plant environment.</li>\n<li>2+ years of experience in process analytical technology tools in small or large molecule space (including design of experiments, modeling, chemometrics, and/or statistical data analysis)</li>\n<li>Excellent scientific and working knowledge in at least two of the following areas:</li>\n</ul>\n\no Spectroscopy (UV-Vis, NIR, FTIR, Fluorescence, capacitance, Raman, and others)\n<br>\no Large molecule analytical and characterization methods (e.g. HPLC, CE, process residuals; glycan analysis, peptide mapping)\n<br>\no Advanced data analysis on real time spectroscopic data (NIR, FTIR, Raman, UV, IR etc)\n<br>\nWe are an Equal Opportunity Employer and do not discriminate against\n<br>\nany employee or applicant for employment because of race, color, sex,\n<br>\nage, national origin, religion, sexual orientation, gender identity,\n<br>\nstatus as a veteran, and basis of disability or any other federal,\n<br>\nstate or local protected class.\n<br><br>\n<strong> .</strong>"}