{"job title": "Formulation Scientist I", "company": "Integrated DNA Technologies", "city state": "– Coralville, IA", "rating": "3.6", "job description": "<strong>Integrated DNA Technologies</strong>\n<br><br>\n<strong>ID</strong> 2018-4064\n<br>\n<strong>Job Locations</strong> US-IA-Coralville<strong>Category</strong> Manufacturing Operations\n<br>\n<strong># of Openings</strong> 1\n<br>\n<strong>Posted Date</strong> 15 hours ago\n<br>\n<strong>Shift/Schedule</strong> TWThF 8:30P-7:30A (United States of America)\n<br><br>\n<strong>Overview</strong>\n<br><br>\nThe Formulation Scientist I formulates custom oligonucleotides according to the customer's specifications. This generally includes quantification, final packaging, and QC sampling of the products being made.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\n<strong><u>Job Specific Essential Functions:</u></strong>\n\n<ul>\n<li>Uses automated and manual lab equipment accurately; including limited maintenance and troubleshooting activities</li><li>Uses custom software packages to complete tasks and create final product</li><li>Utilizes stoichiometry to convert measurement units and creates custom solutions</li><li>Translates order requirements into a process to formulate oligos to the customer's specifications</li><li>Quantifies and samples oligos for quality control tests</li><li>Assesses QC data accurately and makes pass/fail decisions for oligos</li><li>Maintains daily ship deadlines for all products</li><li>Maximizes automation for all processes</li><li>Incorporates new products and processes continuously</li><li>Adheres to safety regulations, lab SOPs, and contamination controls</li><li>Demonstrates behavior consistent with the Integrated DNA Technologies Core Values</li><li>Performs other duties as assigned</li>\n</ul>\n\n<strong><u>Position Specific Essential Functions:</u></strong>\n\n<ul>\n<li>Completes replication of plate and/or tube orders</li> <li>Utilizes ERP system to order lab supplies and fulfill work orders, as needed</li><li>Assists with writing and double checking scripts and mapping for liquid handlers</li><li>Assists with creating and following custom flows for special processing orders</li><li>Completes backend checks on final product, as required</li>\n</ul>\n\n<strong><u>Education:</u></strong>\n\n<ul>\n<li>Associate's degree in science related field plus 2 years of applicable lab experience required</li><li>Bachelor's degree in science related field preferred</li>\n</ul>\n\n<strong><u>Experience:</u></strong>\n\n<ul>\n<li>Proficiency in a variety of PC software programs with strong working knowledge of Microsoft Office (and an emphasis on Excel) required</li>\n</ul>\n\n<strong><u>Required Skills:</u></strong>\n\n<ul>\n<li>Skill to calculate concentrations with provided formulas required</li><li>Ability to operate pipette required</li>\n</ul>\n\n<strong><u>Other Job Qualifications</u></strong>\n\n<ul>\n<li>Strong attention to detail</li><li>Uses aids and SOPs to make decisions about the proper production path per product</li><li>Ability to prioritize and organize workload to efficiently accomplish departmental goals</li><li>Ability to work in a team environment, remaining attentive to ideas, recognizing responsibilities, and actively participating with others to accomplish assignments and achieve desired goals.</li><li>Ability to manage time and works independently</li><li>Ability to communicate with peers and all levels of management</li><li>Ability to perform under stress when confronted with emergent, critical, unusual, or dangerous situations, or situation in which working speed and sustained attention are make-or-break aspects of the job.</li> <li>Ability to perform a variety of duties, often changing from one task to another without loss of efficiency or composure.</li><li>Ability to maintain both a high standard of courtesy and cooperation in dealing with co-workers.</li> <li>Ability to accept responsibility for the direction, control or planning of an activity.</li> <li>Adaptability to situations requiring the precise attainment of set limits, tolerances or standards.</li> <li>Ability to perform repetitive work or to perform continuously the same work, according to set procedures sequence or pace.</li>\n</ul>\n\n<strong><u>Physical Requirements:</u></strong>\n<br><br>\nExert 20-50 lbs. of force occasionally and/or 10-15 lbs. of force frequently\n<br><br>\n<em>Constant (67%-100% of work day)</em>\n\n<ul>\n<li><strong>Reaching</strong>: extending hand(s) and arm(s) in any direction.</li> <li><strong>Using Fingers/Grasping/Feeling</strong>: writing or otherwise working, primarily with fingers rather than with the whole hand or arm as in handling. Applying pressure to an object with the fingers or palm and perceiving attributes of objects such as size, shape, temperature or texture by touch.</li> <li><strong>Talking</strong>: expressing or exchanging ideas by means of the spoken work- those activities in which they must convey detailed or important spoken instructions to other workers accurately, loudly, or quickly.</li><li><strong>Hearing</strong>: perceiving the nature of sounds at normal range; ability to receive detailed information through oral communication, and to make fine discriminations in sound, such as when auscultating and percussing.</li> <li><strong>Repetitive Motion</strong>: substantial movements (motion) of the wrists, hands, and/or fingers.</li> \n</ul>\n\n<em>Frequently (34-66% of work day)</em>\n\n<ul>\n<li><strong>Sitting</strong>: to assume a position in which the weight is largely supported by the buttocks, usually with the body vertical and the thighs horizontal.</li><li><strong>Standing</strong>: maintaining an upright position.</li> <li><strong>Walking</strong>: moving about on foot to accomplish tasks.</li> <li><strong>Lifting</strong>: raising objects from a lower to a higher position or moving objects horizontally from position to position.</li><li><strong>Bending</strong>: bending body downward and forward by bending spine at the waist and/or bending leg; bending legs at knee to come to rest or kneel.</li> <li><strong>Pushing/Pulling</strong>: using upper extremities to press against something with steady force in order to thrust forward, downward or outward/using upper extremities to exert force in order to drag, haul or tug objects in a sustained motion.</li>\n</ul>\n\n<em>Occasional (33% or less of work day)</em>\n\n<ul>\n<li><strong>Climbing</strong>: stairs, stools, ramps, ladders.</li>\n</ul>\n\n<strong><u>Visual Acuity:</u></strong>\n\n<ul>\n<li>Work requires close vision, distance vision, peripheral vision, depth perception and ability to adjust focus.</li> <li>Ability to read pertinent printed material and distinguish colors.</li><li>Ability to accurately read measurements on equipment.</li><li>Ability to prepare and read written documentation; use of computer.</li>\n</ul>\n\nIntegrated DNA Technologies is an equal employment and affirmative action employer. Minorities, women, veterans and individuals with disabilities are encouraged to apply.<br><br>PI104220072"}