{"job title": "Research Scientist II", "company": "Integrated DNA Technologies", "city state": "– Coralville, IA", "rating": "3.6", "job description": "We are looking for a highly motivated scientist to join the Verification and Validation team in Coralville, IA. The new team member will aid in the development and characterization of new genomics products mainly in the NGS and qPCR to help create cutting edge, robust new products and assays for basic research, agricultural, and clinical applications.\n<br><br>\nThe preferred Research Scientist II candidate will have a strong working knowledge and bench level experience in next generation sequencing and amplification based products. Previous experience in the development and the validation of new genomics products is preferred.\n<br><br>\n<strong>Position Specific Duties/Essential Functions</strong>\n<ul>\n<li>Aids in creating, planning and executing verification and validation test plans.</li><li>Analyzes data using appropriate statistical tests, summarizes data, and reports results. Aids in determining next steps.</li><li>Acts as a member of product development teams, supporting verification and validation activities.</li><li>Operates and maintains NGS, qPCR, and general laboratory equipment. Participates in maintenance of laboratory cleanliness and organization.</li>\n</ul>\n<strong>Job Specific Duties/Essential Functions</strong>\n<ul>\n<li>Applies knowledge of basic science and employs solid laboratory skills to execute bench experiments using variety of molecular biology, cell biology, biochemical and general laboratory techniques as directed.</li> <li>Analyzes raw data, reports results and plans the next steps.</li><li>Utilizes mathematical, graphical, imaging, nucleic acid analysis, and other software aids as needed.</li><li>Operates and maintains laboratory equipment.</li><li>Maintains accurate and detailed records of experimental work.</li><li>Assists in the preparation of technical reports for internal use.</li><li>Interacts with and assists other members of the R&amp;D team as needed to meet research objectives.</li><li>Interacts with internal departments and IDT customers to assist with customer service/technical support and to advance collaborative research projects as directed.</li><li>Presents information at group meetings as directed.</li><li>Demonstrates behavior consistent with the Integrated DNA Technologies Core Values.</li><li>Performs other duties as assigned.</li>\n</ul>\n<strong>Education</strong>\n<ul>\n<li>Bachelor’s degree (in Biology, Genetics, Chemistry or a related life sciences field) with three or more years relevant lab experience required</li> <li>Master’s degree (in Biology, Genetics, Chemistry or a related life sciences field) with one or more years relevant lab experience preferred</li> \n</ul>\n<strong>Professional Experience</strong>\n<ul>\n<li>Technical knowledge and bench level experience in NGS and/or qPCR required.</li><li>Previous experience in functional verification and validation testing of products or processes preferred.</li><li>Experience in the application of statistical principles required.</li><li>Experience in using JMP or other software for statistical analysis and DOE experiments preferred</li><li>Proficiency in a variety of PC software programs with strong working knowledge of Microsoft Office required.</li><li>Previous experience with primer/probe design and statistical tools for DOE preferred.</li>\n</ul>\n<strong>Other Knowledge, Skills, and Abilities</strong>\n<ul>\n<li>Ability to train others in basic laboratory techniques and equipment operation.</li><li>Strong organizational skills and attention to detail.</li><li>Ability to multitask and maintain several projects at one time.</li><li>Good verbal and written communication skills.</li><li>Ability to communicate with peers and all levels of management.</li>\n</ul>\nIntegrated DNA Technologies is an equal employment and affirmative action employer. Minorities, women, veterans and individuals with disabilities are encouraged to apply.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}