{"job title": "Res Scientist-Statistician-Bus Analytics", "company": "Lilly", "city state": "– Indianapolis, IN", "rating": "3.8", "job description": "**43219BR**<br> <br>**Responsibilities:**<br> <br><br> <br>You will be part of a growing and dynamic team of advanced analytics professionals whose main goal is to help our marketing, finance, and business leadership partners achieve their business goals through advanced data analytics. Key responsibilities include:<br> <br><br> <br>+ Partner with commercial teams to identify, scope, and execute analytic efforts that answer business questions, solve business needs, and add business value<br> <br>+ Maintain a broad understanding of sales and marketing and be fully engaged with business teams, bringing an objective voice to the table, and facilitating decisions grounded in data<br> <br>+ Collaborate with other analytics team members to review and provide feedback on the analytics work being done, and be willing to seek feedback from other team members about your own work<br> <br>+ Stay current with respect to statistical/mathematical/informatics modeling methodology, to maintain proficiency in applying new and varied methods, and to be competent in justifying methods selected<br> <br><br> <br>**Req ID:**<br> <br><br> <br>43219BR<br> <br><br> <br>**Additional Skills/Preferences:**<br> <br><br> <br>+ Deep and broad knowledge of statistical modeling and data mining methods and tools<br> <br>+ Proficiency with analytic tools (SAS, JMP, R etc.)<br> <br>+ Interpersonal communication skills for effective customer consultation<br> <br>+ Teamwork and leadership skills<br> <br>+ Self-management skills with a focus on results for timely and accurate completion of competing deliverables<br> <br>+ Make the impossible possible in your quest to make life better.<br> <br>+ Bring Analytics to life by giving it zeal and making it applicable to our business.<br> <br>+ Know, learn, and keep up-to-date on the statistical and scientific advances to maximize your impact.<br> <br>+ Bring an insatiable desire to learn, to innovate, and to challenge yourself for the benefit of patients.<br> <br><br> <br>**Additional Information:**<br> <br><br> <br>+ Make the impossible possible in your quest to make life better.<br> <br>+ Bring Analytics to life by giving it zeal and making it applicable to our business.<br> <br>+ Know, learn, and keep up-to-date on the statistical and scientific advances to maximize your impact.<br> <br>+ Bring an insatiable desire to learn, to innovate, and to challenge yourself for the benefit of patients.<br> <br>+ Lilly is an EEO/Affirmative Action Employer and does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.<br> <br><br> <br>**Workplace Arrangement:**<br> <br><br> <br>Local<br> <br><br> <br>**Title:**<br> <br><br> <br>Research Scientist - Business Analytics (JSM)<br> <br><br> <br>**Job Category:**<br> <br><br> <br>Marketing<br> <br><br> <br>**Basic Qualifications:**<br> <br><br> <br>+ Ph.D. in Statistics, Biostatistics, Analytics, Econometrics, or Operations Research<br> <br>+ 3 Years of academic or professional experience in SAS and/or R<br> <br><br> <br>**Company Overview:**<br> <br><br> <br>At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 39,000 employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We?re looking for people who are determined to make life better for people around the world.<br> <br><br> <br>**City:**<br> <br><br> <br>Indianapolis<br> <br><br> <br>**Country:**<br> <br><br> <br>USA<br> <br><br> <br>**State / Province:**<br> <br><br> <br>Indiana<br> <br><br> <br>**Region:**<br> <br><br> <br>North America"}