{"job title": "Research Scientist-Global Cattle PD", "company": "Lilly", "city state": "– Greenfield, IN", "rating": "3.8", "job description": "**41057BR**<br> <br>**Responsibilities:**<br> <br><br> <br>**Position Description:**<br> <br><br> <br>Design and manage multifaceted pre-clinical, clinical and non-clinical efficacy and target animal safety research studies; generate and implement trial protocols; ensure compliance with protocols and regulatory requirements; compile and analyze study data; and write reports for submission to licensing authorities.<br> <br><br> <br>**Functions, Duties, Tasks:**<br> <br><br> <br>+ Design implement and oversee research programs to accomplish business goals<br> <br>+ Identify and select Contract Research Organizations (CRO?s) and establish contract agreements, maintain a positive business collaboration<br> <br>+ Ensure scientific integrity and animal welfare in all activities<br> <br>+ Direct involvement in discussions with global regulatory authorities in planning and implementation of development programs<br> <br>+ Author protocols and reports<br> <br>+ Determine needs and procure necessary study supplies for all studies<br> <br>+ Coordinate, supervise and/or conduct study activities and collaborator efforts as necessary<br> <br>+ Proactively search for solutions<br> <br>+ Work effectively and flexibly within and across all Elanco R&amp;D teams and external collaborators to achieve overall Elanco R&amp;D deliverables<br> <br>+ Create a positive work environment that is aligned with company objectives<br> <br>+ Provide and accept challenge to deliver innovative technical solutions and create an innovative culture<br> <br>+ Identify and utilize methods to deliver individual objectives in a high quality, timely, cost-effective manner<br> <br>+ Provide information to facilitate accurate and timely project and budget forecasts<br> <br>+ Manage project timeline and budget deliverables to facilitate delivery of the Elanco pipeline<br> <br><br> <br>**Req ID:**<br> <br><br> <br>41057BR<br> <br><br> <br>**Additional Skills/Preferences:**<br> <br><br> <br>GCP and clinical trial experience<br> <br><br> <br>**Additional Information:**<br> <br><br> <br>Lilly is an EEO/Affirmative Action Employer and does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.<br> <br>This job can support telecommuting arrangement<br> <br><br> <br>**Title:**<br> <br><br> <br>Research Scientist-Global Cattle Product Development<br> <br><br> <br>**Job Category:**<br> <br><br> <br>Science<br> <br><br> <br>**Basic Qualifications:**<br> <br><br> <br>DVM &amp; PhD degree with 3 years product development in pharma/animal health or health care industry<br> <br><br> <br>**Company Overview:**<br> <br><br> <br>Elanco is a global research-based company that develops and delivers product and services to enhance animal health and production. We value innovation, both in scientific research and daily operations, and strive to cultivate a collaborative work environment for more than 7,000 employees worldwide. Founded in 1954, Elanco is a division of Lilly. Our worldwide headquarters and research facilities are in Greenfield, Indiana.<br> <br><br> <br>**City:**<br> <br><br> <br>Greenfield, telecommuter<br> <br><br> <br>**Country:**<br> <br><br> <br>USA<br> <br><br> <br>**State / Province:**<br> <br><br> <br>Indiana<br> <br><br> <br>**Region:**<br> <br><br> <br>North America"}