{"job title": "Data Integration Intern", "company": "Monsanto", "city state": "– Saint Louis, MO", "rating": "4.0", "job description": "We are seeking a motivated Data Integration Intern. This position will be located in Chesterfield, Missouri, reporting to our Data Engagement and Integration Lead.\n<br><br>\nThe Data Integration Intern will work with a team of data scientists and software engineers to support building automated data loading pipelines and to integrate and publish data to hubs from a variety of sources including database tables, composite views, and API calls. The published messages will then be consumed by topic subscribers for model building and API development.\n<br><br>\nDates for this internship are May 13-August 2 of 2019\n<br><br>\n<strong>Responsibilities may include:</strong>\n<br><br>\n+ Analysis of software architecture and systems for novel data integration &amp; messaging capabilities\n<br><br>\n+ Development of cloud based data integration processes aggregating data and automating the publication\n<br><br>\n+ Development of data validation processes to ensure data quality and integrity\n<br><br>\n+ Development of data analytics &amp; visualization tools for data consumers\n<br><br>\n<strong>Required Skills/Experiences:</strong>\n<br><br>\n+ Currently enrolled at a university within the U.S. pursuing an undergraduate or graduate degree in Computer Science or related programs\n<br><br>\n+ At least 3.0 GPA on a 4.0 scale.\n<br><br>\n+ Must be returning to school to continue program of study upon completion of internship.\n<br><br>\n+ Programming skills in: Java, R or Python\n<br><br>\n+ Experience with version control systems such as Git\n<br><br>\n+ Experienced with Relational Databases such as Oracle and PostgreSQL, and Graph Database (Neo4j)\n<br><br>\n<strong>Desired Skills/Experiences:</strong>\n<br><br>\n+ Experience with cloud computing platforms such as AWS, Google Cloud or Microsoft Azure.\n<br><br>\n+ Experience with data hub\n<br><br>\n+ Experience with front-end applications such as Shiny and Spotfire\n<br><br>\nBayer successfully completed the acquisition of Monsanto in June 2018, bringing together Monsanto?s leadership in seeds and plant traits with Bayer?s leadership in chemical and biological crop protection. By joining forces, we will create even more extensive career opportunities for talent around the world. We?re a global team working to shape agriculture through breakthrough innovation that will benefit farmers, consumers, and our planet.\n<br><br>\nWhile we are now Bayer, we will continue to hire using separate career sites until we can integrate our career platforms. We invite you to explore the career opportunities available at the combined company by visiting advancingtogether.com/careers.\n\n\n<ul>\n<li>*Organization:** _US Biotech-API- Data Science and Analyti_51192425_</li>\n<li>*Title:** _Data Integration Intern_</li>\n<li>*Location:** _North America-USA-Missouri-St. Louis_</li>\n<li>*Requisition ID:** _01SRK_</li>\n<li>*Job:** _Research &amp; Development_</li>\n<li>*Schedule:** _Full-time_</li>\n</ul>\n\nAt Monsanto, we value a diverse combination of ideas, perspectives and cultures. All qualified applicants will receive consideration for employment without regard to, among other things, race, religion, color, national origin, age, sex, sexual orientation, gender identity, gender expression, status as a protected veteran, or status as a qualified individual with a disability. If you need a reasonable accommodation to access the information provided on this website, please for further assistance.access our disability accommodations process\n<br><br>\nU.S. Employment Law (applicable for U.S. jobs ONLY): EEO Employer Minorities/Females/Protected Veterans/Disabled. For information about equal employment opportunity rights, please refer to this information from the U.S. federal government: ; .\n<br><br>\nEEOC PosterEEOC Supplement"}