{"job title": "Scientist (non-PhD), Tumor Immunology", "company": "Pfizer", "city state": "– United States - New York - Pearl River", "rating": "3.9", "job description": "<strong>About Pfizer.</strong>  A career at Pfizer offers opportunity, ownership and impact. All over the world, Pfizer colleagues work together to positively impact health for everyone, everywhere. Our colleagues have the opportunity to grow and develop a career that offers both individual and company success; be part of an ownership culture that values diversity and where all colleagues are energized and engaged; and the ability to impact the health and lives of millions of people. Pfizer, a global leader in the bio-pharmaceutical industry, is continuously seeking top talent who are inspired by our purpose to innovate to bring therapies to patients that significantly improve their lives.\n<br><br>\n<strong>A Scientist position (non-PhD)</strong> is available for a highly motivated scientist with a solid background in immunology and/or tumor immunotherapy to join the Targeted Therapeutics Discovery Unit in the Oncology R&amp;D Group. The successful candidate will have a laboratory-focused role to explore anti-tumor immune responses via activation of innate immunity including Pattern Recognition Receptor (PRR) signaling or related pathways. In addition, the candidate will support target identification and validation on dendritic cells via a novel in vitro culture system. The ideal applicant should be able to participate in a highly matrixed and innovative research environment. The candidate should have a desire to build on their knowledge of immunology and learn new technologies and methodologies.\n<br><br>\n<strong>Responsibilities</strong>\n<ul>\n<li>Under minimal supervision, design and execute experiments using cellular and molecular immunological assays to investigate target biology and therapeutic mechanisms of action.</li><li>Assist with developing and performing in vitro culture/assays that are predictive of in vivo biology in order to identify novel targets on dendritic cells for anti-tumor immunotherapy.</li><li>Demonstrate initiative and ability in troubleshooting experiments and accurate data analysis.</li><li>Effectively collaborate with other members of the Oncology group and supporting partner lines.</li><li>Present research plan and on-going progress at weekly/monthly group meetings.</li>\n</ul>\n<strong>Qualifications</strong>\n<ul>\n<li>Bachelor’s degree with a minimum of 6+ years research experience in an academic or industrial setting, or Master’s degree with a minimum of 5+ years research experience.</li><li>Track record of contributions to successful research projects in the field of Immunology, Immune-Oncology, and/or Cancer Cell Biology with substantial experience in multi-color flow cytometry and cell culture is highly preferred;</li><li>Experience in innate immunity and dendritic cell biology will be a plus;</li><li>Demonstrated research experience with a focus on basic immunology techniques, such as mammalian cell culture, multi-channel flow cytometry, MACS enrichment, FACS sorting, ELISA, ELISPOT, and molecular biology techniques.</li><li>Excellent communication skills, both written and oral, and highly organized in terms of goal setting and achieving for multiple experiments/tasks.</li>\n</ul>\n<strong>EEO &amp; Employment Eligibility</strong>\n<br><br>\nPfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.\n<br><br>\n<strong>Sunshine Act</strong>\n<br><br>\nPfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider’s name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.\n<br><br>\n<strong>Other Job Details:</strong>\n<ul>\n<li>Eligible for Employee Referral Bonus</li>\n</ul>\nPfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates."}