{"job title": "Marketing Analytics Decision Scientist", "company": "Regions Bank", "city state": "– Birmingham, AL", "rating": "3.3", "job description": "Thank you for your interest in a career at Regions. At Regions, we believe associates deserve more than just a job. We believe in offering performance-driven individuals a place where they can build a career --- a place to expect more opportunities. If you are focused on results, dedicated to quality, strength and integrity, and possess the drive to succeed, then we are your employer of choice.\n<br><br>\nRegions is dedicated to taking appropriate steps to safeguard and protect private and personally identifiable information you submit. The information that you submit will be collected and reviewed by associates, consultants, and vendors of Regions in order to evaluate your qualifications and experience for job opportunities and will not be used for marketing purposes, sold, or shared outside of Regions unless required by law. Such information will be stored for a set period of time. You may review, modify, or update your information by visiting and logging into the careers section of the system.\n\n\n<ul>\n<li>*Job Description:**</li>\n</ul>\n\nAt Regions, the Big Data/Predictive Analytics Analyst answers deep-lying questions and uncovers new opportunities by leveraging analytic practices to design, build new, creative, high impact analytic solutions. Researches, designs, implements and validates algorithms to analyze diverse sources of data to achieve targeted outcomes.\n\n\n<ul>\n<li>*Responsibilities**</li>\n</ul>\n\n+ Works with business leaders to identify high impact opportunities\n<br><br>\n+ Manages projects to timely conclusions\n<br><br>\n+ Communicates analytic findings to diverse audiences\n<br><br>\n+ Works with Information Technology (IT) to access, explore and condition data\n<br><br>\n+ Implement and validate analytic solutions\n<br><br>\n+ Develop and deploy solutions using data analysis, data mining, optimization tools, machine learning techniques and statistics\n<br><br>\n+ Associates at this level are typically exhibiting strong basic executional capabilities and will begin to take on more responsibility; may partner with more experienced staff for complex issues\n<br><br>\nThis position is exempt from timekeeping requirements under the Fair Labor Standards Act and is not eligible for overtime pay.\n\n\n<ul>\n<li>*Minimum Requirements**</li>\n</ul>\n\n+ Masters degree in operations research, applied statistics, data mining, machine learning or related quantitative discipline\n<br><br>\n+ Seven (7) years experience with big data, data management platform (DMP), and real-time decision systems\n\n\n<ul>\n<li>*Preferences**</li>\n</ul>\n\n+ Ph.D. in operations research, applied statistics, data mining, machine learning or related quantitative discipline\n\n\n<ul>\n<li>*Skills and Competencies**</li>\n</ul>\n\n+ Strong business acumen with the ability to communicate with both business and IT leaders\n<br><br>\n+ Deep understanding of statistical and predictive modeling concepts, machine learning approaches, clustering and classification techniques, and recommendation and optimization algorithms\n<br><br>\n+ Expertise in analyzing large, complex, multi-dimensional datasets using a variety of tools like Statistical Analysis System (SAS), R or Statistical Package for the Social Sciences (SPSS)\n<br><br>\n+ Comfortable with both relational databases and Hadoop-based data mining frameworks\n<br><br>\n+ Advanced SQL skills and familiarity with Python, Java, C/C++, etc.\n<br><br>\n+ Strong communication skills through data visualizations, written and oral presentations\n<br><br>\n+ Experience interacting with business, technical and quantitative groups\n<br><br>\n+ Ability to work closely with internal and external partners\n<br><br>\n+ Focus is on resolution of complex problems or transactions, where expertise is required to interpret against policies, guidelines or processes\n\n\n<ul>\n<li>*Additional Preferences**</li>\n</ul>\n\n+ Five years statistical analysis or analytic modeling experience\n<br><br>\n+ Experience developing and delivering executive level presentations summarizing outcomes and future recommendations for marketing programs.\n<br><br>\n+ Experience mining transaction streams\n<br><br>\n+ E-Commerce experience\n<br><br>\n+ Experience with real-time decision systems working with stakeholders in the implementation, monitoring and optimization of real-time, inbound marketing strategies and capabilities.\n\n\n<ul>\n<li>*Location:**</li>\n</ul>\n\nBirmingham, Alabama\n<br><br>\nEEO/AA/Minorities/Females/Disabled/Veterans\n\n\n<ul>\n<li>*About Regions**</li>\n</ul>\n\nAt Regions, our culture focuses on five core values that are a commitment to how we will do business:\n<br><br>\n+ Put people first\n<br><br>\n+ Do what is right\n<br><br>\n+ Focus on your customer\n<br><br>\n+ Reach higher\n<br><br>\n+ Enjoy life\n<br><br>\nThrough these values, our mission to make life better drives our desire to improve and make a positive difference in the communities where we work and live through financial investments and volunteering.\n<br><br>\nEEO/AA/Minorities/Females/Disabled/Veterans"}