{"job title": "Principal Scientist", "company": "Shire", "city state": "– Cambridge, MA", "rating": "2.7", "job description": "<ul>\n<li>*Responsibilities**</li>\n</ul>\n\n<strong>50%</strong>\n<br><br>\nManage bioanalytical and biomarker support on multiple drug development programs by providing scientific leadership that encompasses but is not limited to development and implementation of appropriate bioanalytical and biomarker strategies, development, transfer to CRO and validation of bioanalytical and biomarker assays, overseeing sample testing, review assay validation and sample testing results, data transfers, and authoring corresponding reports.\n<br><br>\n<strong>20%</strong>\n<br><br>\nRepresent BBD at cross-functional non-clinical and clinical drug development teams. Manage external vendors/CROs and assess progress relative to objectives and communicate progress periodically to supervisor and key stakeholders within and outside Group.\n<br><br>\n<strong>10%</strong>\n<br><br>\nSchedule technical work and perform high-level review of assay results/interpretation/reports to ensure technical excellence and compliance with appropriate regulatory standards\n<br><br>\n<strong>10%</strong>\n<br><br>\nReview assay validation, bioanalytical/biomarker or immunogenicity protocols, reports.\n<br><br>\n<strong>10%</strong>\n<br><br>\nAuthor or contribute to Clinical Study Report sections, regulatory documents and abstracts/manuscripts for publication. Review assay validation and bioanalytical reports. May provide training and mentorship to internal staff.\n\n\n<ul>\n<li>*Education and Experience Requirements**</li>\n</ul>\n\n+ PhD in molecular biology, life sciences or equivalent with 5+ years of industry experience in drug development or MS with 10+ years of relevant industry experience.\n<br><br>\n+ Strong experience in developing and validating regulated bioanalytical and biomarker assays using variety of technology platforms.\n<br><br>\n+ In-depth knowledge of global regulatory guidelines, expectations and corresponding industry?s best practices and working experience in a regulated laboratory environment are required.\n<br><br>\n+ Experience placing and managing external work at CROs/CMOs is required.\n<br><br>\n+ Hands-on experience with immunoassays and contemporary genetic technologies/ or Flow-cytometry and immunological assays is a must.\n<br><br>\n+ Experience in leading biological molecule PK and bio-distribution, biomarker studies in various matrices (serum, CSF, urine) and tissues (brain, spinal cord, liver, kidney, spleen, lymph nodes) to support both non-clinical and clinical studies.\n<br><br>\n+ Experience in managing others is a plus\n\n\n<ul>\n<li>*Key Skills, Abilities, and Competencies**</li>\n</ul>\n\n+ Significant experience in a regulated environment (pharmaceutical/biotech industry and/or CRO), in the design, development, validation, documentation and administration of bioanalytical and biomarker assays for large or small molecules is required.\n<br><br>\n+ Excellent assay troubleshooting skills and experience in providing bioanalytical and biomarker support for pre-clinical and clinical studies in drug development is required\n<br><br>\n+ Expertise in immunogenicity assessment and developing appropriate immunogenicity testing mitigation strategies to support drug development and expertise in immunology especially B cell biology and regulation of immune response is highly preferred.\n<br><br>\n+ Excellent management and organizational skills, and attention to detail, are essential.\n<br><br>\n+ Excellent written and oral communication skills are required.\n\n\n<ul>\n<li>*Other Job Requirements**</li>\n</ul>\n\n+ Domestic and international travel may be required\n\n\n<ul>\n<li>*_Notice to Employment / Recruitment Agents:_**</li>\n</ul>\n\n_Employment / Recruitment agents may only submit candidates for vacancies only if they have written authorization to do so from Shire?s Talent Acquisition department. Any agency candidate submission may only be submitted to positions opened to the agency through the specific Agency Portal. Shire will only pay a fee for candidates submitted or presented where there is a fully executed contract in place between the Employment / Recruitment agents and Shire and only if the candidate is submitted via the Agency Portal. Candidates submitted or presented by Employment / Recruitment Agents without a fully executed contract or submitted through this site shall not be deemed to form part of any Engagement for which the Agency may claim remuneration._\n<br><br>\nEqual Employment Opportunity\n<br><br>\nShire is an Equal Opportunity Employer committed to a diverse workforce. Shire will not discriminate against any worker or job applicant on the basis of race, color, religion, gender, national origin, ancestry, age, sexual orientation, marital or civil partnership status, pregnancy, gender reassignment, non-job related mental or physical disability, genetic information, veteran status, military service, application for military service, or membership in any other category protected under law.\n<br><br>\nEEO is the Law - https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf\n<br><br>\nEEO is the Law ? Supplement - https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\n<br><br>\nPay Transparency Policy - https://www.dol.gov/ofccp/pdf/pay-transp_formattedESQA508c.pdf\n<br><br>\nReasonable Accommodations\n<br><br>\nShire is committed to working with and providing reasonable accommodation to individuals with disabilities. If, because of a medical condition or disability, you need a reasonable accommodation for any part of the application process, or in order to perform the essential functions of a position, please call 484-595-8400 and let us know the nature of your request and your contact information.\n<br><br>\nShire is the leading global biotechnology company focused on serving people with rare diseases and other highly specialized conditions. We strive to develop best-in-class products, many of which are available in more than 100 countries, across core therapeutic areas including Hematology, Immunology, Neuroscience, Ophthalmics, Lysosomal Storage Disorders, Gastrointestinal/Internal Medicine/Endocrine and Hereditary Angioedema; and a growing franchise in Oncology.\n<br><br>\nOur employees come to work every day with a shared mission: to develop and deliver breakthrough therapies for the hundreds of millions of people in the world affected by rare diseases and other high-need conditions, and who lack effective therapies to live their lives to the fullest."}