{"job title": "Associate Scientist, Clinical Innovation", "company": "The Estee Lauder Companies", "city state": "– Melville, NY", "rating": "3.5", "job description": "**Associate Scientist, Clinical Innovation**<br> <br><br> <br>**Brand:** Est?e Lauder Companies Corporate Departments<br> <br><br> <br>**Description**<br> <br><br> <br>This position is primarily responsible for conducting clinical testing on human subjects in accordance with Good Clinical Practices and company's SOPs. This position's responsibilities include performing testing on pre-marketed brand ready products or early stage prototypes and new technology for clinical claims substantiation or proof of principle studies under the supervision of a clinical team leader. In addition, this position's responsibility will be accurate data collection and analysis and maintaining detailed records under GCP guidelines. This position reports to an Executive Director.<br> <br><br> <br><br><br>* Function as a clinical sub-investigator which includes follow clinical testing protocols to ensure accurate testing parameters, conducting biophysical testing and collecting consistent data on human subjects in accordance with GCP and company's SOPs<br> <br><br> <br><br><br>* Perform data entry and analysis of raw data<br> <br><br> <br><br><br>* Maintain detailed data logs for clinical studies and provide data on a timely basis<br> <br><br> <br><br><br>* Prepare protocols, study report forms, informed consents and reports<br> <br><br> <br><br><br>* Instruct panelists on proper use of test products to assure compliance<br> <br><br> <br><br><br>* Respond to requests from management, as necessary<br> <br><br> <br><br><br>* Stay current on cosmetic field trends, skincare technologies and technological developments of data collection instrumentation.<br> <br><br> <br><br><br>* Maintain a professional clinical atmosphere, demonstrate an excellent level of customer service, and ensure diversity sensitivity all for panelists on a daily basis.<br> <br><br> <br><br><br>* Maintain awareness of panelist issues, i.e. product adverse reactions, questionable compliance, etc, and escalate issues to Supervisor to ensure proper testing results.<br> <br><br> <br><br><br>* Demonstrate an excellent level of service and provide results on a timely basis.<br> <br><br> <br>**Qualifications**<br> <br><br> <br>Bachelor's degree in Science (Chemistry, Biology or related)<br> <br><br> <br>15% Travel<br> <br><br> <br>Strong technical and analytical skills<br> <br><br> <br>Strong organization skills - Ability to manage multiple projects in a fast paced setting while maintaining attention to details and precision in testing techniques<br> <br><br> <br>Excellent written and verbal communication skills; customer service skills.<br> <br><br> <br>Knowledge of a second language a plus<br> <br><br> <br>**Job:** Research &amp; Development<br> <br><br> <br>**Primary Location:** Americas-US-NY-Melville<br> <br><br> <br>**Job Type:** Standard<br> <br><br> <br>**Schedule:** Full-time<br> <br><br> <br>**Shift:** 1st (Day) Shift<br> <br><br> <br>**Travel:** No<br> <br><br> <br>We are an equal opportunity employer. Minorities, women, veterans, and individuals with disabilities are encouraged to apply. **Job Number:** 187132"}