{"job title": "Sr Data Engineer", "company": "The Walt Disney Company", "city state": "– New York, NY", "rating": "3.8", "job description": "BAMTECH Media is a place for the creative and the bold. We?re seeking talent across disciplines to join our team. Whether New York City, San Francisco, Manchester or Amsterdam we provide opportunities to elevate your career and transform an industry.\n<br><br>\nBAMTECH software engineers develop premium digital media products for Major League Baseball and our partners. The products we build, such as MLB.TV, NHL.TV, HBO NOW and PlayStation Vue are paving the way for the next-generation media and sport technologies. BAMTECH engineering is headquartered in the Chelsea area of New York, NY with an office in the SoMo area of San Francisco, CA and team members based around the world.\n<br><br>\nIf you are interested in joining BAMTECH in the pursuit of not only crafting new media products but enjoying the products you build, we are interested in hearing from you.\n<br><br>\nAt BAMTECH data is central to measuring all aspects of the business, and critical to its operations and growth. The data engineering team is responsible for collecting, analyzing and distributing data using public cloud and open source technologies and offers transparency into customer behavior and business performance.\n\n\n<ul>\n<li>*Responsibilities :**</li>\n</ul>\n\n+ Collaborate with product teams, data analysts and data scientists to design and build data-forward solutions\n<br><br>\n+ Build and deploy streaming and batch data pipelines capable of processing and storing petabytes of data quickly and reliably\n<br><br>\n+ Integrate with a variety of data metric providers ranging from advertising, web analytics, and consumer devices\n<br><br>\n+ Build and maintain dimensional data warehouses in support of business intelligence tools\n<br><br>\n+ Develop data catalogs and data validations to ensure clarity and correctness of key business metrics\n<br><br>\n+ Drive and maintain a culture of quality, innovation and experimentation\n\n\n<ul>\n<li>*Basic Qualifications :**</li>\n</ul>\n\n+ 3-5 years of experience developing in object orient Python\n<br><br>\n+ Engineering big-data solutions using technologies like EMR, S3, Spark\n<br><br>\n+ Loading and querying cloud-hosted databases such as Redshift and Snowflake\n<br><br>\n+ Building data pipelines using Kafka, Spark, Flink, or Samza\n\n\n<ul>\n<li>*Preferred Qualifications :**</li>\n</ul>\n\n+ Familiarity with binary data serialization formats such as Parquet, Avro, and Thrift\n<br><br>\n+ Experience deploying data notebook and analytic environments such as Jupyter and Databricks\n<br><br>\n+ Knowledge of the Python data ecosystem using pandas and numpy\n<br><br>\n+ Experience building and deploying ML pipelines: training models, feature development, regression testing\n<br><br>\n+ Experience with graph-based data workflows using Apache Airflow\n\n\n<ul>\n<li>*Job ID:** 573792BR</li>\n<li>*Location:** New York,New York</li>\n<li>*Job Posting Company:** The Walt Disney Company (Corporate)</li>\n</ul>"}