{"job title": "Data Architect", "company": "United Technologies Corporation", "city state": "– Brooklyn, NY", "rating": "3.3", "job description": "<ul>\n<li>*Job ID:** 60143BR</li>\n<li>*City:** Brooklyn</li>\n<li>*State:** New York</li>\n<li>*Country:** United States</li>\n<li>*Category:** Information Technology</li>\n<li>*Job Type:** Full Time</li>\n<li>*Description:**</li>\n</ul>\n\nUnited Technologies Corporation (UTC) has a deep history of innovation that brings together big thinkers, problem solvers and a culture for pushing the boundaries of what?s possible. Our global reach and rich history uniquely positions us to succeed in the new digital economy. Our investment in digital innovations will make travel better, people safer and urbanizing cities more comfortable and connected.\n<br><br>\nUTC is committed to leading in the digital era and will unleash the size and scale of its businesses on the digital world of big data and the Internet of Things. We are looking for the very best thought and technology leaders who will help grow our Digital Accelerator in Brooklyn, New York ? In a vibrant, urban, oasis overlooking the iconic Brooklyn Bridge. Come join us in this journey.\n\n\n<ul>\n<li>*About United Technologies ? NYSE UTX:**</li>\n</ul>\n\nWith revenues of approximately $57 billion, United Technologies Corporation (UTC) is a Fortune 50 company that provides high technology products and services for the aerospace and commercial building industries. Our aerospace businesses include Pratt &amp; Whitney and UTC Aerospace Systems. Pratt &amp; Whitney is a world leader in the design, manufacture and service of aircraft engines. UTC Aerospace Systems is one of the world?s largest suppliers of technologically advanced, aerospace and defense products.\n<br><br>\nOur commercial building businesses include Otis Elevator and Climate, Controls &amp; Security. Otis is the world?s largest manufacturer and maintainer of people-moving products, including elevators, escalators and moving walkways. UTC Climate, Controls &amp; Security is a leading provider of heating, air conditioning and refrigeration systems, building controls and automation, and fire and security systems. These companies are leading to safer, smarter, sustainable and high-performance buildings.\n<br><br>\nRanked among the world?s greenest companies, we do business in virtually every country of the world and have over 200,000 employees globally.\n\n\n<ul>\n<li>*Position:**</li>\n</ul>\n\nWe are seeking highly motivated data architects to join our Digital Accelerator in Brooklyn, NY. We are looking for people who have a passion for building systems that analyze and uncover digital insights from large, complex streams of data derived from the worlds most advanced aerospace, aviation and building management systems.\n<br><br>\nAs a member of a cross-functional team of product managers, software engineers, data scientists and designers, you will combine your problem solving and analytical skills to identify, quantify, and solve real world problems leveraging best of breed digital technologies. This role will also work closely with UTC?s engineering, design, operations, marketing and service delivery teams to challenge the boundaries of what?s possible.\n<br><br>\nThis position will provide the unique opportunity to operate in a start-up-like environment within a Fortune 50 company. Our digital focus is geared towards releasing the insights inherent UTC?s best-in-class products and services. Together we aim to achieve new levels of productivity by changing the way we work and identifying new sources of growth for our customers.\n\n\n<ul>\n<li>*Job Responsibilities include:**</li>\n</ul>\n\n+ Design solutions that will improve how we design, manufacture, monitor, and maintain industrial assets such as jet engines, aviation systems, elevators, HVAC, and other commercial systems\n<br><br>\n+ Create, coordinate, and execute proposals, pilots, proofs of concept, and projects for large scale data and analytics solutions, working as a liaison between the members of the data science team and other stakeholders including product management and business owners\n<br><br>\n+ Lead major data- and analytics- driven initiatives and business transformations around key strategic business drivers\n<br><br>\n+ Design (and, working with engineering teams, instantiate) solutions that will capture, integrate, organize, centralize, and maintain data\n<br><br>\n+ Design and develop large scale data processing systems such as data lakes\n<br><br>\n+ Develop scalable mechanisms that take data from multiple business and IoT systems and make them available for data science and analysis.\n<br><br>\n+ Build learning systems that monitor data flows and react to changes in customer preferences, network constraints, and business objectives\n<br><br>\n+ Design and implement mechanisms to operationalize machine learning models with feedback loops in production environments\n<br><br>\n+ Work with vendors to ensure quality and appropriateness of proposed work and delivered solutions\n<br><br>\n+ Collaborate with product managers, data scientists, and other engineers to design, implement and deploy scalable solutions that address customer problems\n<br><br>\n+ Provide thought leadership by researching best practices, conducting experiments, and collaborating with industry leaders\n<br><br>\n+ Results-oriented with a strong sense of ownership in delivering for our customer and businesses\n\n\n<ul>\n<li>*Qualifications &amp; Requirements**</li>\n</ul>\n\n+ Advance degree in computer science, statistics, or operations research or related technical discipline\n<br><br>\n+ 7+ years related experience designing data science and analytical solutions.\n<br><br>\n+ Deep knowledge of machine learning, statistics, optimization or related field\n<br><br>\n+ Experience with R, Python, Perl, Matlab\n<br><br>\n+ Experience working with large data sets and distributed computing tools including Spark, Hadoop, Hive, etc\n<br><br>\n+ Experience with industrial/commercial applications of data science including prognostic and health management, supply chain optimization, and human capital management is a significant plus\n<br><br>\n+ Excellent written and verbal communication skills along with the ability to well work in cross functional teams\n<br><br>\n+ Work experience in programming, data engineering, and machine learning\n<br><br>\n+ Motivated self-starter with a strong enthusiasm to learn\n<br><br>\n+ Results-oriented with strong communication and customer focus\n<br><br>\n+ Ability to deal well with ambiguous and undefined problems\n\n\n<ul>\n<li>*Qualification:**</li>\n</ul>\n\n+ 7+ years related experience designing data science and analytical solutions.\n<br><br>\n+ Deep knowledge of machine learning, statistics, optimization or related field\n<br><br>\n+ Experience with R, Python, Perl, Matlab\n<br><br>\n+ Experience working with large data sets and distributed computing tools including Spark, Hadoop, Hive, etc\n<br><br>\n+ Experience with industrial/commercial applications of data science including prognostic and health management, supply chain optimization, and human capital management is a significant plus\n<br><br>\n+ Excellent written and verbal communication skills along with the ability to well work in cross functional teams\n<br><br>\n+ Work experience in programming, data engineering, and machine learning\n<br><br>\n+ Motivated self-starter with a strong enthusiasm to learn\n<br><br>\n+ Results-oriented with strong communication and customer focus\n<br><br>\n+ Ability to deal well with ambiguous and undefined problems\n\n\n<ul>\n<li>*Education:**</li>\n</ul>\n\n+ Advance degree in computer science, statistics, or operations research or related technical discipline\n<br><br>\nUnited Technologies Corporation is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class.\n\n\n<ul>\n<li>*Qualification:**</li>\n</ul>\n\n+ 7+ years related experience designing data science and analytical solutions.\n<br><br>\n+ Deep knowledge of machine learning, statistics, optimization or related field\n<br><br>\n+ Experience with R, Python, Perl, Matlab\n<br><br>\n+ Experience working with large data sets and distributed computing tools including Spark, Hadoop, Hive, etc\n<br><br>\n+ Experience with industrial/commercial applications of data science including prognostic and health management, supply chain optimization, and human capital management is a significant plus\n<br><br>\n+ Excellent written and verbal communication skills along with the ability to well work in cross functional teams\n<br><br>\n+ Work experience in programming, data engineering, and machine learning\n<br><br>\n+ Motivated self-starter with a strong enthusiasm to learn\n<br><br>\n+ Results-oriented with strong communication and customer focus\n<br><br>\n+ Ability to deal well with ambiguous and undefined problems\n<br><br>\nUnited Technologies Corporation is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class."}