{"job title": "Staff Scientist ~ Vanderbilt Eye Institute", "company": "Vanderbilt University Medical Center", "city state": "– Nashville, TN", "rating": "3.6", "job description": "<ul>\n<li>*Discover VanderbiltUniversity Medical Center:**</li>\n</ul>\n\nLocated in Nashville,\n<br>\nTennessee, and operating at a global crossroads of teaching, discovery and\n<br>\npatient care, VUMC is a community of individuals who come to work\n<br>\neach day with the simple aim of changing the world. It is a place where your\n<br>\nexpertise will be valued, your knowledge expanded and your abilities\n<br>\nchallenged. It is a place where your diversity ? of culture, thinking, learning\n<br>\nand leading ? is sought and celebrated. It is a place where employees know they\n<br>\nare part of something that is bigger than themselves, take exceptional pride in\n<br>\ntheir work and never settle for what was good enough yesterday. **Vanderbilt?s** mission\n<br>\nis to advance health and wellness through preeminent programs in patient care,\n<br>\neducation, and research.\n<br><br>\nClick Here To View The VUMC Promise of Discovery\n<br><br>\nAt the Vanderbilt Eye\n<br>\nInstitute, we strive to make life better for adults and children with eye conditions\n<br>\nincluding glaucoma, vision loss and diseases of the retina. We treat patients\n<br>\nfrom across Tennessee and the Southeast. Our doctors, researchers and support\n<br>\nstaff use the latest technologies and methods, and we conduct vital vision\n<br>\nresearch that translates to better treatments.\n<br><br>\nThe Vanderbilt Eye Institute is a\n<br>\nleader in quality eye care. We offer the latest technologies and methods\n<br>\nwhile conducting innovative research to improve patients' lives and prevent\n<br>\nvision loss.\n\n\n<ul>\n<li>*_We work hard each day because your eyes areimportant to us._**</li>\n</ul>\n\nThe Vanderbilt Eye Institute attracts\n<br>\nsome of the most talented doctors and researchers in the country. Our\n<br>\nsubspecialty ophthalmologists have completed a minimum of one year of\n<br>\nfellowship training after residency and are board eligible or board certified\n<br>\nby the American Board of Ophthalmology.\n<br><br>\nVanderbilt Eye Institute's\n<br>\naward-winning research staff collaborates with our doctors as well as other\n<br>\nVanderbilt departments to pursue discoveries that enhance the vision of\n<br>\npatients everywhere.\n\n\n<ul>\n<li>*Shift Hours:**</li>\n</ul>\n\nDays\n\n\n<ul>\n<li>*Your Role:**</li>\n</ul>\n\nAssists the Principal Investigator with grant and\n<br>\nmanuscript preparation. Independently carry out and design highly sophisticated\n<br>\nand independent experiments. Mentor and train graduate students and post-doctoral\n<br>\nfellow in developing their research projects.\n\n\n<ul>\n<li>*Key Responsibilities:**</li>\n</ul>\n\n+ Independently oversee researchprojects and perform near to totally independent research.\n<br><br>\n+ Supervise, plan, design andimplement research projects\n<br><br>\n+ oEstablish highly complexprotocol(s); define data collection, evaluation and analysis procedures\n<br><br>\n+ Exercise discretion andindependent judgment to develop methods and procedures for operation ofcomplex scientific equipment\n<br><br>\n+ Supervise set-up and operationof various scientific experiments involving complex apparatus andequipment\n<br><br>\n+ Contribute to research so as tomerit serving as author or co-author on research publications, etc.\n<br><br>\n+ Assist principal investigatorin writing research grants and contract proposals\n<br><br>\n+ Assists PI in manuscriptpreparation for scientific journals.\n<br><br>\n+ Present research findings asneeded\n<br><br>\n+ Responsible for plan andcoordination of literature and library searches and data collectionprograms\n<br><br>\n+ Develop reports of results,graphs, charts, tables, etc. of research findings\n<br><br>\n+ Supervise writing, reviewingand editing of various materials for publication\n<br><br>\n+ Provide supervisoryresponsibility to staff\n<br><br>\n+ Mentor and teach graduatestudents and post doctoral fellows in developing their projects and onspecific techniques and protocols.\n<br><br>\n+ Train and supervise technicalstaff, medical and graduate students\n<br><br>\n+ Provide technical guidance tostudents, pos-doctoral fellows and faculty as required\n<br><br>\n+ May provide budgetresponsibility\n<br><br>\n+ Make recommendations toprincipal investigator regarding staff, supply and equipment needs forresearch projects\n<br><br>\n+ May monitor expenditures offunds\n<br><br>\n+ Maintain open communicationbetween department and others\n<br><br>\n+ Open contact as needed withprincipal investigator, collaborating professionals, Purchasing, HumanResource Services, Space and Facilities Planning, asset managementpersonnel, Environmental Health and Safety, Institutional Review Boardstaff, administrative staff relating to budget capabilities\n<br><br>\n+ Contact as required withsponsoring agencies and/or cooperating facilities (e.g. V.A.),collaborating professionals and vendors\n\n\n<ul>\n<li>*VUMC Recent Accomplishments**</li>\n</ul>\n\nBecause we are committed\n<br>\nto providing the best in patient care, education and research, we are proud of\n<br>\n<strong>our recent accomplishments:</strong>\n<br><br>\n+ **US News &amp;World Report:** \\#1 Hospital in Tennessee, #1Health Care Provider in Nashville, #1 Audiology ( **Bill Wilkerson Center** at http://www.vanderbilthealth.com/billwilkerson/ ),12 adult and 10 pediatric clinical specialties ranked among the nation's best,\\#15 Education and Training\n<br><br>\n+ **Truven HealthAnalytics:** among the top 50 cardiovascularhospitals in the U.S.\n<br><br>\n+ **Becker's HospitalReview:** one of the \"100 GreatestHospitals in America\"\n<br><br>\n+ **The LeapfrogGroup:** grade \"A\" inHospital Safety Score\n<br><br>\n+ **NationalInstitutes of Health:** among the top 10 grantawardees for medical research in the US\n<br><br>\n+ **Magnet RecognitionProgram:** Vanderbilt nurses are the onlygroup honored in Tennessee\n<br><br>\n+ **NashvilleBusiness Journal:** Middle Tennessee's healthiestemployer\n<br><br>\n+ **American HospitalAssociation:** among the 100 \"Most Wired\"medical systems in the US\n\n\n<ul>\n<li>*Download the Vanderbilt University Medical CenterFacts 2016-2017** at https://www.vanderbilthealth.com/main/39107 to learn more about our</li>\n</ul>\n\nservices and facilities.\n<br><br>\nThis position requires a Doctorate/PhD (or equivalent experience) and 2 years experience.\n\n\n<ul>\n<li>*Physical Requirements/Strengths needed &amp; Physical Demands:**</li>\n<li>*Movement**</li>\n</ul>\n\n+ Occasional: Sitting: Remaining in seated position\n<br><br>\n+ Occasional: Standing: Remaining on one's feet without moving.\n<br><br>\n+ Occasional: Walking: Moving about on foot.\n<br><br>\n+ Occasional: Lifting under 35 lbs: Raising and lowering objects under 35 lbs from one level to another\n<br><br>\n+ Occasional: Push/Pull: Exerting force to move objects away from or toward.\n<br><br>\n+ Occasional: Bending/Stooping: Trunk bending downward and forward by bending spine at waist requiring full use of lower extremities and back muscles\n<br><br>\n+ Occasional: Reaching below shoulders: Extending arms in any direction below shoulders.\n<br><br>\n+ Occasional: Handling: Seizing, holding, grasping, turning or otherwise working with hand or hands.\n\n\n<ul>\n<li>*Sensory**</li>\n</ul>\n\n+ Occasional: Vision: Clarity of near vision at 20 inches or less and far vision at 20 feet or more with depth perception, peripheral vision, color vision.\n<br><br>\n+ Frequent: Noise: May include exposure to occupational noise levels which equal or exceed an 8-hr time-weighted average of 85 decibels, requiring enrollment in VUMC's Hearing Conservation Program which includes training, use of hearing protection, and periodic audiometry.\n<br><br>\n+ Continuous: Communication: Expressing or exchanging written/verbal/electronic information.\n\n\n<ul>\n<li>*Environmental Conditions**</li>\n<li>*Job** _Research_</li>\n<li>*Organization:** _Vanderbilt Eye Institute 104450_</li>\n<li>*Title:** _Staff Scientist ~ Vanderbilt Eye Institute_</li>\n<li>*Location:** _TN-Nashville-Medical Research Bldg IV (MRB)_</li>\n<li>*Requisition ID:** _1808149_</li>\n</ul>"}