{"job title": "Senior Scientist", "company": "Abcore", "city state": "– Ramona, CA", "rating": "NA", "job description": "<strong>Senior Scientist</strong> <br><br> We are seeking a motivated candidate to join our antibody discovery team, contributing to the generation of polyclonal, monoclonal, and single domain antibodies. The candidate will be required to generate and manipulate antibody phage libraries in order to isolate antibodies against a number of targets for in house and customer projects, participate in design and execution of selection and screening strategies, and isolate and generate high affinity antibodies and single domain antibodies. Initial focus will be on phage display, with the potential for yeast two-hybrid and mammalian display in the future. Sufficient experience is required to result in working in an independent fashion in the design, analysis, and troubleshooting of experiments, as well as reporting of data and progress with management, customers, and team members. Candidate will also help in generation of SOPs to maintain ISO compliance and customer quotations. Demonstrated excellence with both written and oral communication are therefore required. This position will be both supervisory, administrative, and laboratory based. This position will be actually doing the experimentation, research and development, as well as overseeing the implementation of these techniques by others in the lab. <br><br> <strong>Laboratory Techniques:</strong>\n<ul>\n<li>Phage display (phage library construction, panning, etc.)</li>\n<li>Cloning and molecular biology including primer design, PCR, and sequence analysis, electrophoresis (DNA, SDS-PAGE), DNA transformations</li>\n<li>Performing sterile cell culture techniques for maintaining cell lines and cell based ELISAs</li>\n<li>Protein expression and purification</li>\n<li>Generation and manipulation of antibody phage libraries</li>\n<li>Antibody fragment expression and analysis</li>\n<li>Monoclonal hybridomas</li>\n<li>Antibody purification</li>\n<li>Antibody validation techniques including ELISA, western blot, and microscopy</li>\n</ul>\n<strong>Requirements:</strong>\n<ul>\n<li>Ph.D. degree in immunology, biochemistry, or other biological science with 2-4 years of industry experience is required.</li>\n<li>Experience in molecular biology cloning techniques is required.</li>\n<li>Experience in phage display and/or yeast two-hybrid <em>in vitro</em> display technology is highly preferred.</li>\n<li>Working knowledge of antibody techniques (ELISA, western blot, flow cytometry, IHC) is required.</li>\n<li>Ability to Independently perform and troubleshoot complex experiments with attention to quality, details and documentation.</li>\n<li>Ensure that all safety guidelines are followed and maintain a clean and orderly environment</li>\n<li>Ability to handle and prioritize multiple projects simultaneously.</li>\n</ul>\nWe offer a casual startup environment with high expectations. Come and do research where you can have a huge impact on the direction and success of a small, fast growing biotech company. We offer competitive salary and benefits. <br><br> Qualified candidates must be legally authorized to be employed in the United States. No sponsorship for employment visa status (e.g., H-1B or TN) for this position. No relocation available, residence in the San Diego area required. We are located in Ramona."}