{"job title": "Data Scientist - Marketing", "company": "HomeAway", "city state": "– Austin, TX, United States", "rating": "3.7", "job description": "We are looking for excellent Data Scientists to join our growing 20+ strong team. This position focuses on the measurement and optimization of advertising expenditure, so it is a good fit for those with backgrounds such as operations research, economics and marketing science, however we will consider qualified candidates from any technical background. This role will work closely with our marketing team to drive traffic to our massive e-commerce marketplace. The statistical learning algorithms you develop will impact tens of millions of dollars of advertising each year.\n<br><br>\n<strong>What youll do:</strong>\n<ul>\n<li>Understand media mix modeling, data driven attribution supporting TV, SEM, Display, Social.</li> <li>Understand how programmatic marketing advertising works.</li> <li>Optimize advertising based on user feedback from online ads.</li> <li>Build machine learning-based segmentation/cohort models.</li> <li>Develop novel marketing relevant testing strategies.</li> <li>Stay at the state of the art in advertising measurement by attending at the top conferences.</li>\n</ul>\n<strong>Day-to-Day responsibilities include:</strong>\n<ul>\n<li>Work on larger programs/initiatives encompassing several projects that have a company-wide impact.</li> <li>Apply best-in-class machine learning techniques to solve the business problem at hand.</li> <li>Produce novel insights with machine learning to inform company strategy.</li> <li>Assist others with data discovery and data preparation phase.</li> <li>Help build the core feedback loops to optimize advertising expenditure.</li> <li>Work end-to-end on studio projects that you conceive, develop and land as a winner in the company.</li>\n</ul>\n<strong>Who You Are:</strong>\n<ul>\n<li>3+ years of experience in Data Science and analytics fields.</li> <li>Experience in Experience with programming languages such as R, Python, or Scala</li><li>Experience in processing and analyzing large scale data volumes, semi-structured and unstructured data and near real-time throughput.</li> <li>Experience applying the right ML model to solve business problems.</li> <li>Ability and passion to learn new techniques to stay on the cutting edge.</li> <li>Experience working in Hadoop ecosystem.</li> <li>Strong database knowledge and expertise in SQL.</li> <li>Good storytelling and presentation skills i.e be able to present business side of the story that data presents to c-team and business leaders.</li> <li>Masters or Ph.D in Statistics, Math, Computer Science or other quantitative field.</li>\n</ul>\n<strong>Required Skills and Qualifications:</strong>\n<ul>\n<li>BS or MS in Computer Science or equivalent experience</li><li>You should have 5+ years of professional software development experience</li><li>Ability to mentor junior engineers</li><li>Good foundation of Agile principles and practices</li><li>Excellent interpersonal skills with ability to work well across multiple departments</li><li>An analytical problem solver that is passionate about delivering a high quality user experience</li>\n</ul>\n<strong>Benefits &amp; Perks:</strong>\n<ul>\n<li>Competitive health and insurance benefits.</li><li>Competitive salary.</li><li>Annual target bonus or commission.</li><li>Parental leave for up to 20 weeks (dependent on eligibility).</li><li>Paid vacation and sick time.</li><li>Vacation rental on a yearly basis (taxable benefit).</li><li>Employee Stock Purchase Program.</li><li>Free snacks and beverages.</li><li>Frequent company update talks with our leadership team.</li><li>Free listing on HomeAway.com.</li><li>Electronic, adjustable stand-up desk.</li><li>Discounted Metro &amp; Rail pass.</li><li>Casual dress.</li>\n</ul>\n<strong>Why join us:</strong>\n<br><br>\nExpedia Group recognizes our success is dependent on the success of our people. We are the world's travel platform, made up of the most knowledgeable, passionate, and creative people in our business. Our brands recognize the power of travel to break down barriers and make people's lives better that responsibility inspires us to be the place where exceptional people want to do their best work, and to provide them to tools to do so.\n<br><br>\nWhether you're applying to work in engineering or customer support, marketing or lodging supply, at Expedia Group we act as one team, working towards a common goal; to bring the world within reach. We relentlessly strive for better, but not at the cost of the customer. We act with humility and optimism, respecting ideas big and small. We value diversity and voices of all volumes. We are a global organization but keep our feet on the ground so we can act fast and stay simple. Our teams also have the chance to give back on a local level and make a difference through our corporate social responsibility program, Expedia Cares.\n<br><br>\nOur family of travel brands includes: Brand Expedia®, Hotels.com®, Expedia® Partner Solutions, Egencia®, trivago®, HomeAway®, Orbitz®, Travelocity®, Wotif®, lastminute.com.au®, ebookers®, CheapTickets®, Hotwire®, Classic Vacations®, Expedia® Media Solutions, CarRentals.com, Expedia Local Expert®, Expedia® CruiseShipCenters®, SilverRail Technologies, Inc., ALICE and Traveldoo®.\n<br><br>\n<strong>About HomeAway:</strong>\n<br><br>\n<strong>HomeAway</strong>, a world leader in the vacation rental industry, is the place to book beach houses, cabins, and condos with more than two million places to stay in 190 countries. The site makes it easy to find and book the perfect vacation rental for any getaway, often for less than the cost of traditional hotel accommodations. HomeAway is part of the Expedia Group family of brands.\n<br><br>\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}