{"job title": "Scientist", "company": "Johnson &amp; Johnson", "city state": "– Skillman, New Jersey", "rating": "4.0", "job description": "Johnson &amp; Johnson Consumer Inc., a member of the Johnson &amp; Johnson Family of Companies, is recruiting for a Scientist located in Skillman, NJ. \n<br>\n<div>\nJohnson &amp; Johnson Family of Companies touches more than a billion peoples lives each day through our health care products and services, our corporate giving, and the volunteer efforts of our employees. The Johnson &amp; Johnson Family of Consumer Companies develop and market beloved brands that address the needs of consumers and health care professionals worldwide. Our portfolio ranges across several distinct business units: Baby Care, Oral Care, Compromised Skin Care, Beauty, Feminine Care, and OTC products.</div> \n<br>\n<div>\nThriving on a diverse company culture, celebrating the uniqueness of our employees and committed to inclusion, Johnson &amp; Johnson Consumer Inc. is proud to be an equal opportunity employer.</div>\n<br>\n<div>\nThis is an exciting opportunity to work in a global, dynamic, highly networked environment to improve the lives and healthcare of others.</div>\n<br>\n<div>\nAs a Scientist, working within Global Oral Care / Wound Care R&amp;D, Microbiology you will:\n\n\n<ul>\n<li>Be responsible for Method design and execution of in vitro and ex vivo experiments assessing efficacy of new technologies and new products to support the long-term growth of the Oral Care and Wound Care franchises</li>\n<li>Be part of a core team of microbiology experts, executing and creating novel models that are predictive of clinical outcomes, provide mechanistic insights of new technologies, and/or establish the basis for new product claims</li>\n<li>Develop and execute lab experiments, collaborating closely with internal and external R&amp;D partners</li>\n<li>Communicate results of research regularly, internally to upper management, and externally at appropriate scientific conferences</li>\n<li>Patent Intellectual Property when feasible</li>\n<li>Be encouraged to publish scientific discoveries, to help share the outcomes of our research initiatives</li>\n<li>Conduct literature and patent searches</li>\n<li>Collaborate on design of experiments with project partners</li>\n<li>Execute experiments, data acquisition and analysis</li>\n<li>Interpret and support lab operations</li></ul></div>\n\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Minimum of a BS Degree with 3 years of experience OR a MS Degree with 0-2 years of experience is required</li>\n<li>Applied method development research experience is preferred</li>\n<li>Excellent aseptic technique handling bacteria, microbial biofilms and cell cultures is required</li>\n<li>Must be able to operate in and leverage resources in a highly networked team environment</li>\n<li>Ability to collaborate, independently manage routine processes, take measured risks, and make well informed decisions to drive project progress is required</li>\n<li>Hands-on experience with high-throughput experimentation tools (e.g. micro-well plates, liquid handing instruments or spectrophotometers) is required</li>\n<li>Working knowledge of microbiome analysis tools, fluorescence microscopy, and/or antimicrobial efficacy testing is required</li>\n<li>Ability to manage multiple complex projects is required</li>\n<li>Microbiome related research experience is preferred</li>\n<li>Confocal or digital imaging microscopy is preferred</li>\n<li>Microbial biofilm research is preferred</li>\n<li>Experience with image analysis software programs such as MATLAB or other statistical analysis software is preferred</li>\n<li>Up to 10% domestic travel is required</li>\n</ul>\n\n<strong>Primary Location</strong>\n<br>\nUnited States-New Jersey-Skillman\n<br>\n<strong>Organization</strong>\n<br>\nJ &amp; J Consumer Inc. (6101)\n<br>\n<strong>Job Function</strong>\n<br>\n<strong>R&amp;D</strong>\n<br>\n<strong>Requisition ID</strong>\n<br>\n<strong>5207180627</strong>\n<br>"}