{"job title": "Data Scientist", "company": "PayPal", "city state": "– San Jose", "rating": "3.6", "job description": "Job Description Summary:<br><br>This role is responsible of creating automation products to be adopted by partner teams to achieve better analytical quality and efficiency as well as operational excellence.<br><br>Job Description:<br><br>Responsibilities\n\n<ul>\n<li>Understand the process of decision optimization, data analysis, as well as analytical and operational partners' work</li><li>Create pipelines (data processing, data analysis, optimization, implementation) for automated strategy development</li><li>Collaborate closely with analytical and operational partners in creating and maintaining tools to reduce their repeated manual effort, and improve decision quality and process efficiency</li><li>Communicate efficiently and frequently with partners to gather requests and feedback, then quick adopt these requests and feedback into products your are building</li><li>Interest and ability in learning new techniques and research on how to apply them into daily work</li>\n</ul>\n\nQualifications\n\n<ul>\n<li>BA degree (MS is a plus) in Computer Science, Computer Engineering, Electric Engineering, Mathematics or equivalent practical experience</li><li>2+ years of Data Scientist experience required.</li><li>Experience with data manipulation and analysis tools (SQL, Python, R or similar languages)</li><li>Familiar with typical data mining and machine learning algorithms such as linear regression, decision tree, logistic regression, and clustering's representation and implementation</li><li>Effective communication skills</li>\n</ul>\nSubsidiary:<br><br>PayPal<br><br>Travel Percent:<br><br>0<br><br>Primary Location:<br><br>San Jose, California, United States of America<br><br>Additional Locations:\n<br><br>\n<strong>We're a purpose-driven company whose beliefs are the foundation for how we conduct business every day. We hold ourselves to our One Team Behaviors which demand that we hold the highest ethical standards, to empower an open and diverse workplace, and strive to treat everyone who is touched by our business with dignity and respect. Our employees challenge the status quo, ask questions, and find solutions. We want to break down barriers to financial empowerment. Join us as we change the way the world defines financial freedom.</strong>\n<br><br>\n<strong>Paypal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities.</strong>"}