{"job title": "Data Scientist (various level)", "company": "PayPal", "city state": "– San Jose", "rating": "3.6", "job description": "Job Description Summary:<br><br>PayPal Global Data Sciences San Jose Team is seeking a highly motivated Data Scientist to join the team. The candidate will obtain practical work experience in Big Data, learn about PayPal business, and receive mentorship from his/her manager and team. The ideal candidates are problem solvers, equipped with strong analytical, mathematical, and programming skills suited to approach various kinds of challenges in complex environments. Candidates must be quick learners with a strong sense of personal responsibility and a technical orientation.<br><br>Job Description:\n<br><br>\nPayPal Global Data Sciences San Jose Team is seeking a highly motivated Data Scientist to join the team. The candidate will obtain practical work experience in Big Data, learn about PayPal business, and receive mentorship from his/her manager and team. The ideal candidates are problem solvers, equipped with strong analytical, mathematical, and programming skills suited to approach various kinds of challenges in complex environments. Candidates must be quick learners with a strong sense of personal responsibility and a technical orientation. The level will be determined based on the level of experience with the minimum requirements as follows.\n<ul>\n<li>Masters in CS, Stats, or related field with for Associate Data Scientist role</li><li>Masters with 1+ years of experience or PhD for Data Scientist role</li><li>Masters with 3+ years of experience or PhD with 2+ years for Lead Data Scientist role</li><li>Masters with 5+ years of experience or PhD with 4+ years for Principal Data Scientist</li>\n</ul>\nThe role will involve the following tasks.\n<ul>\n<li>Extract and analyze very large volume of data covering a wide range of information from user profile to transaction history.</li><li>Build state-of-the-art statistical procedures, algorithms and models to solve a range of problems in diverse domains including: Marketing &amp; Sales, Customer Engagement, and Customer Services</li><li>Proficient code writing capability in a major programming language such as Python, R, Java and C++.</li><li>Proficient in model building, machine learning, and data mining. NLP experience is a plus</li><li>Experience in data manipulation language such as SQL</li><li>Experience in Big Data such as MapReduce, PIG, or HIVE is a plus</li><li>Ability to work independently and proficiently. Accountable for own results, and is seen as clear subject matter expert within group / geography</li><li>Demonstrates excellent verbal and written communication skills</li>\n</ul>\nSubsidiary:<br><br>PayPal<br><br>Travel Percent:<br><br>0<br><br>Primary Location:<br><br>San Jose, California, United States of America<br><br>Additional Locations:\n<br><br>\n<strong>We're a purpose-driven company whose beliefs are the foundation for how we conduct business every day. We hold ourselves to our One Team Behaviors which demand that we hold the highest ethical standards, to empower an open and diverse workplace, and strive to treat everyone who is touched by our business with dignity and respect. Our employees challenge the status quo, ask questions, and find solutions. We want to break down barriers to financial empowerment. Join us as we change the way the world defines financial freedom.</strong>\n<br><br>\n<strong>Paypal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities.</strong>"}