{"job title": "Salesforce Data Analyst", "company": "Acumen Solutions", "city state": "– New York", "rating": "4.2", "job description": "<p></p><div>Desired: XMLSQLMicrosoft OfficeData WarehouseData AnalysisAcumen Solutions drives excellence - not only in our performance, but also in the results we deliver for our clients. We are a global cloud consultancy that combines the insight of our strategists, the vision of our innovators, and the ingenuity of our engineers to achieve this extraordinary impact. The Fortune 500 trust us to build solutions focused on growing revenue and profits by amplifying competitive advantage and strengthening customer relationships. Our groundbreaking solutions in the public sector streamline operations and improve productivity. We apply this same focus on excellence to our unparalleled social responsibility program, generating sustainable impact across our local communities. Engage with us at www.acumensolutions.com or on Twitter @AcumenSolutions.<p></p>\n\n<p>We are looking to grow our team and currently have entry to manager level opportunities for a Salesforce Data Analyst in our New York, NY, location.</p>\n\n<p><strong>Specific Duties</strong>:\n- Specialize in collecting, organizing, and analyzing data from various systems\n-Develop an in-depth understanding of the interrelationships of data and multiple data domains\n-Create thorough documentation artifacts and maintain same for duration of project\n-Identify and document data migration paths and processes\n-Maintain industry/technical knowledge base and facilitate/maintain industry relationships\n-Demonstrate commitment to providing customer-focused quality service\n-Support assigned systems through transition period\n-Perform other duties as deemed relevant based upon experience to fulfill customer needs\n-Develop and perform standard queries to ensure data quality, identify data inconsistencies, missing data and resolve as needed\n-Standardize data naming, data definitions and modeling\n-Perform data extraction, storage, manipulation, processing, and analysis\n-Collect, profile, collate, and map appropriate data for usage in new or existing solutions as well as for ongoing data analysis activities\n-Interpret Customers functional and information needs and turn them into functional or data requirements, process models, etc.</p>\n\n<p><strong>Desired Skills and Experience</strong>:\n- Bachelors Degree or equivalent in Computer Science, Information Systems, Engineering, Business, Mathematics, or other related scientific or technical discipline with two (2) or more years of experience related to this position\n-Must be willing to travel up to 50%\n-1-5 years of demonstrated experience in data analysis, data manipulation, and decision support\n-Knowledge and application of relational database concepts\n-Experience or exposure to Extract/Transform/Load (ETL) and/or Business Intelligence\n-Strong SQL skills\n-Skilled at completing technical design via iterative mockups\n-High proficiency in MS Office Suite (esp. Word and Excel)\n-Openness to learning new skills and software as necessary\n-Demonstrated ability to manage simultaneous work flows while maintaining quality output and meeting deadlines\n-Demonstrated ability to learn new and exciting technologies with little assistance</p>\n\n<p><strong>Preferred Experience</strong>:\n- Experience with ETL tools and procedures (any tool)\n-Prior experience working in the Cloud\n-Strong verbal and written communication skills with demonstrated ability to communicate at different levels of the organization\n-Ability to perform ad-hoc analysis and maintain clear and comprehensive documentation of decision-making, data preparation, and processes\n-Relevant IT certifications</p>\n\n<p><strong>Critical Skills</strong>:\n- High aptitude in analytical and logical thinking\n-Demonstrated experience with data models and data mapping\n-Experience with Unified Modeling Language (UML), including Entity-Relationship Diagrams (ERD), Sequence Diagrams, and Data Flow Diagrams (DFD)\n-Understanding of XML, SQL, Data Modeling Language (DML), and Data Definition Language (DDL)\n-Strong communication skills, both written and spoken\n-Demonstrated ability to produce highly detailed, comprehensive documentation artifacts\n-Client-focused attitude\n-High-level knowledge of enterprise IT organizational, business, and technical environments\n-Ability to analyze processes and recommend improvements as needed</p>\n\n<p><strong>Benefits</strong>\nAcumen Solutions offers the opportunity for growth and advancement, as well as a competitive base salary, annual performance based incentives, medical, dental, and vision benefits, Paid Time Off, 401k, and more.</p></div>"}