{"job title": "Healthcare Data Analyst - Atlanta, GA - PS", "company": "Anthem", "city state": "– GA-Atlanta", "rating": "3.7", "job description": "<div>Your Talent. Our Vision.<strong> At Anthem, Inc.,</strong> it’s a powerful combination, and the foundation upon which we’re creating greater access to care for our members, greater value for our customers, and greater health for our communities. Join us and together we will <strong>drive the future of health care</strong>.</div> \n<br>\n<div>This is an exceptional opportunity to do innovative work that means more to you and those we serve at one of America's leading health benefits companies and a Fortune Top 50 Company.</div><br>\n\n<div><strong>Responsible for analyzing, reporting and developing recommendations on data related to multiple, varied business metrics. Primary duties may include, but are not limited to:</strong></div>\n<ul>\n<li>Creates and maintains databases to track business performance.</li> \n\n<li>Analyzes data and summarizes performance using summary statistical procedures.</li>\n<li>Develops and analyzes business performance reports (e.g. for claims data, provider data, utilization data) and provides notations of performance deviations and anomalies.</li> \n\n<li>Creates and publishes periodic reports, makes necessary recommendations, and develops ad hoc reports as needed.</li> \n\n<li>May require taking business issue and devising best way to develop appropriate diagnostic and/or tracking data that will translate business requirements into usable decision support tools.</li> </ul>\n\n\n<ul>\n<li>Requires a BS/BA degree in related field</li>\n<li>SQL experience required</li>\n<li>2-4 years related operational and/or data analysis experience; experience in database structures, and standard query and reporting tools; or any combination of education and experience, which would provide an equivalent background. EOE.M/F/Disability/Veteran</li>\n</ul>\n\n<div><strong>Anthem, Inc. is ranked as one of America’s Most Admired Companies among health insurers by Fortune magazine and is a 2017 DiversityInc magazine Top 50 Company for Diversity. To learn more about our company and apply, please visit us at antheminc.com/careers. EOE. M/F/Disability/Veteran.</strong></div>\n<br>\n<div></div>"}