{"job title": "IT Data Analyst", "company": "BIC Graphic", "city state": "– Clearwater, FL", "rating": "2.5", "job description": "<strong>Job Description</strong><div><strong>Summary:</strong>\n<br><br>\nWe are looking to hire a Data Analyst to join our data team. You will take responsibility for managing our master data design and modeling, troubleshooting data issues, and developing processes for managing the data. To do well in this role you need experience as a data analyst, attention to detail, and the ability to translate business needs into the data model.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Managing master data design and modeling</li>\n<li>Provide quality assurance of imported data, working with quality assurance analyst if necessary.</li>\n<li>Provide quality assurance of imported data, working with quality assurance analyst if necessary.</li>\n</ul>\n\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>Bachelor's degree, preferred in computer science</li>\n<li>5+ years work experience as a data analyst or in related field</li>\n<li>Demonstrated experience in handling large data sets</li>\n<li>Ability to translate business requirements into non-technical terms</li>\n<li>Background in a manufacturing business preferred</li>\n</ul>\n\n<strong>Job Description:</strong>\n<br><br>\nThis position will be responsible for overall design, modeling, and use of our product data. This data is used to enter orders, configure them for manufacture, and serve to our customers.\n<br><br>\n<strong>Duties:</strong>\n\n\n<ul>\n<li>Design and standardize data formats for Product Data</li>\n<li>Create and manage the Data change control process</li>\n<li>Document data standards for dissemination to all users of the data</li>\n<li>Document ownership and processes to update data sets</li>\n<li>Work with teams from all areas of the business to make sure data sets meet the needs of all areas of the business</li>\n<li>Be an advocate for clean data across the company</li>\n</ul>\n\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>Bachelor's degree, preferred in computer science</li>\n<li>5+ years work experience as a data analyst or in related field</li>\n<li>Demonstrated experience in handling large data sets</li>\n<li>Ability to translate business requirements into non-technical terms</li>\n<li>Background in a manufacturing business preferred</li>\n</ul>\n\nEqual Opportunity Employer Minorities/Women/Protected Veterans/Disabled</div>Company Description<div>BIC Graphic is one of the largest suppliers in the promotional products industry offering the most comprehensive item assortment with the widest variety of decoration methods. Our focus on innovation helps our network of distributors explore endless possibilities in promotional campaigns and advertising specialties. We are proud to be an industry leader in product safety, quality assurance, social responsibility, supply chain security and environmental stewardship.\n<br><br>\nBIC Graphic sells exclusively through distributors that serve a variety of industries including the majority of the Fortune 500® list, government agencies, educational institutions and thousands of other diverse companies worldwide. We offer over 55 proprietary and partner brands including promotional classics like KOOZIE® and Triumph® calendars as well as prestigious retail brands like myCharge®, adidasTM and Cool Gear®.\n<br><br>\nOur operation consists of five facilities in the United States and a highly strategic product sourcing division in Hong Kong and mainland China. This global team works together to launch hundreds of new products each year, develop innovative decoration methods, provide best-in-class service and be an influential force in our industry.</div>"}