{"job title": "DATA ANALYST STOPS", "company": "Camris International", "city state": "– US-Bethesda-MD", "rating": "3.4", "job description": "Overview\n<br>\n\n<br>\nCAMRIS International is an international development and research firm that realizes innovative solutions to health and development challenges through high-quality, cost-effective program and research management services. With experience working in more than 80 countries, we combine our proven systems with today’s most effective, evidence-based best practices to improve the lives of people around the world. We apply a customized, customer-centric, cost-effective business approach to offer greater value to our clients and challenge the way things have always been done in our field.\n<br><br>\nCAMRIS clients include U.S. government agencies and multilateral and private organizations. Our core practice areas include public health, agriculture and food security, economic development, education, environment, humanitarian assistance, democracy and governance, and medical research.\n<br><br>\nThis is an opportunity for employment or a contract, but we reserve the right to make no selection or award. Contingent on bid award.\n<br><br>\nCAMRIS is seeking exceptional candidates to provide scientific, technical, and other professional support services to assist the National Institutes of Health (NIH-- which is comprised of the Office of the Director and 27 Institutes and Centers) in meeting its operational objectives.\n<br>\n\n<br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n\n \n<li>\nCollects and analyzes data for a variety of studies.</li>\n<li>\nOrganizes data to provide functional reporting.</li>\n<li>\nCreates and maintains a variety of reports.</li>\n<li>\nManages storage and backup systems.</li>\n<li>\nParticipates in the developmental design of databases for tracking and statistical purposes that incorporate multiple data fields required by scientists.</li>\n<li>\nCoordinates statistical data analysis for numerous ongoing studies by collecting, organizing, and tracking information.</li>\n<li>\nManages projects and quickly responds to inquiries about status.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n\n \n<li>\n1-5+ years experience in a related field.</li>\n<li>\nKnowledge of research protocols, organizing data, and performing analyses.</li>\n<li>\nExperience interacting with patient populations and strong interpersonal skills.</li>\n<li>\nExcellent organizational and time management skills.</li>\n<li>\nStrong oral and written communication skills.\n<br><br>\n<strong>Minimum Education:</strong>\n<br><br>\nBachelor’s degree in a related field. Four (4) years of specialized experience plus an Associate’s degree is equivalent to a Bachelor’s degree.</li>\n</ul>"}