{"job title": "Supply Chain Data Analyst (air &amp; Ocean Freight)", "company": "CS-recruiting", "city state": "– Chicago", "rating": "4.7", "job description": "Our client specializes in data analytics relative to transportation. Their cloud based data warehouse that enables real time analytics and benchmarking allowing companies to easily manage complex global supply chains, as well as, has capabilities span across all modes of transportation; Full Truckload, Less than Truckload, Ocean Freight, Air Freight, Intermodal, Parcel and Courier. Their clients rely on accurate data and modeling from their cloud base date to drive business decisions and outcomes. As a global leader in logistics analytics in conjunction with their proprietary analytical software, our client is able to develop a total logistics model that is customized according to the needs of each company and the companies clients. They have devised a strategy that will enable them to capture every aspect of a company's supply chain. For more than 13+ years, they have been capturing and identifying supply chain and logistics savings opportunities for Fortune 500 companies around the world.\n<br><br>\n<strong><em>Supply Chain Data Analyst (Air &amp; Ocean Freight):</em></strong>\n<br>\nOur client is seeking a Supply Chain Data Analyst specialized in Air &amp; Ocean Freight to analyze billing data, assist in the fulfillment of requirements for Supply Chain Data analytics projects and maintain production, validation and analysis measurement tools. The ideal candidate will bring a positive attitude, experience working with Air &amp; Ocean Freight pricing, excellent analytical and Excel skills, possess excellent written and verbal communication skills and demonstrate the ability to multi-task and meet deadlines in a fast-paced environment.\n<br><br>\n<strong>Responsibilities</strong>:\n\n\n<ul>\n<li>Analyze and understand the data contained in individual Carrier data files.</li>\n</ul>\n\nAnalyze and manage multiple Clients shipping patterns.\n<br>\nInvestigate all report, data and contract inquiries.\n<br>\nMaintain a weekly task schedule, define all tasks and resource requirements.\n<br>\nTrack project task deliverables using appropriate tools.\n<br>\nManage all Excel output files and maintain quality assurance.\n<br>\nIdentify opportunities to improve efficiencies through automation and help implement solutions.\n<br>\nEnsure that Company procedures and processes are followed and maintained.\n<br>\nWork overtime as needed to meet Project deadlines.\n<br>\nValidate output from other analysts and work as a team to ensure projects meet clients needs and expectations.\n<br><br>\n<strong>Experience</strong>:\n\n\n<ul>\n<li>Bachelors Degree in Computer Science, Information Technology or related technical field required; Graduate Degree preferred.</li>\n</ul>\n\nPrevious experience in the Transportation or Logistics Industry.\n<br>\nExperience working with Air &amp; Ocean Freight Data and Pricing agreements.\n<br>\nAdvanced Excel skills.\n<br>\nExperience working in other Modes of Transportation (Parcel, LTL, TL, etc.).\n<br>\nExperience with additional elements of the Microsoft Office Suite.\n<br>\nPrior experience with: OneNote, TMS or OMS and Excel PowerMaps.\n<br>\nStrong analytical and investigative skills with emphasis on multitasking.\n<br>\nExperience with SQL.\n<br>\nAbility to work as part of a team.\n<br>\nEffective time management skills and ability to meet deadlines.\n<br>\nExperience with Tableau Desktop and Online.\n<br>\nExcellent communication and organizational skills.\n<br><br>\nThis position offers a Competitive Base Salary and Standard Benefits."}