{"job title": "Senior Data Analyst", "company": "Delphi-US", "city state": "– Chicago, IL", "rating": "2.5", "job description": "Job Description<div>Our Client is a leading healthcare organization and its mission is to promote the art and science of medicine and the betterment of public health. They are currently looking for a Senior Data Analyst on a contract to hire basis.\n<br><br>\nSr. Data Analyst\n<br><br>\n<strong>Primary Purpose:</strong>\n<br><br>\nManage the development, execution, analysis and reporting of strategic analytics/big data initiatives that support product and program development for specific business units. Collaborate with internal clients, to define analytics objectives, strategies and tactics to understand business needs and identify solutions.\n<br><br>\n<strong>Essential Functions/Responsibilities:</strong>\n<br><br>\nCollaborate with relevant business managers and other stakeholders, as appropriate, to execute all aspects of project as assigned. This includes defining analytics objectives, methodology and approach; designing analysis plan; synthesizing data from multiple data sources into understandable and actionable information; developing applicable predictive analytics models; and packaging and presenting reports to relevant business unit / broader organization. 50%\n<br><br>\nConsult with internal business clients and define/refine analytics goals and plans that support business unit’s decision-making process. 30%\n<br><br>\nBuild client relationships across the organization, promoting contribution of analytics/big data to strategic product and program development and distribution. Represent organization in enterprise data and analytics initiatives. 20%\n<br><br>\nRequirements:\n<br><br>\nBachelor’s degree required. Master’s degree in statistics, social sciences or an MBA; PhD preferred.\n<br><br>\nMinimum 8 years experience in database analysis, relational database extraction and manipulation, database query with client interface/account management responsibilities working with or in health care or related service organizations.\n<br><br>\nStrong statistical and conceptual analysis skills; mastery of traditional analytical tools, such as SPSS/SAS, UNICA, Business Objects, etc; able to manage and integrate insights from multiple data sources, such as Masterfile, CRM database, customer database, custom primary market research and purchased/appended data if available.\n<br><br>\nMust be very strong in SQL as the environment is DB/2 with a SQL interface.\n<br><br>\nMust exhibit proficiency in the following competencies: quantitative/financial modeling, advanced analytics, predictive modeling, data management (data mining, data cleaning, data analysis, data visualization/presentation).\n<br><br>\nDemonstrated marketing skills and proven ability to translate analytics results into strategic implications.\n<br><br>\nInnovative thinker with ability to manage multiple and varied projects concurrently, solve problems and maximize resource utilization, including selection, negotiation and management of external service providers.\n<br><br>\nStrong client service orientation and related interpersonal skills, including negotiation and consensus building. Excellent written and oral communications skills, including ability to work effectively across all levels of an organization\n<br><br>\nProject and financial management/stewardship experience with bias toward maximizing value.\n<br><br>\n<strong>ABOUT DELPHI-US</strong>\n<br><br>\nDelphi-US provides world class talent acquisition solutions to our clients nationwide. We are experts in Information Technology, Engineering, Professional, and select specialized talent recruitment. With a collective 30+ years in our field, Delphi-US brings true best practices to the industry, and a fundamental approach that drives excellence in results for our clients and consultants. Known as 'The Peacemakers in The Talent War', Delphi-US seeks to join the best and brightest of our knowledge workforce to select employers of choice throughout the United States.\n<br><br>\nFor Immediate Consideration Please Contact:\n<br><br>\n<strong>Rich Braun, EVP Talent: rbraun@delphi-us.com (855) 863-0464 x.1001</strong></div>Company Description<div>ABOUT DELPHI-US\n<br>\nDelphi-US provides world class talent acquisition solutions to our clients nationwide. We are experts in Information Technology, Engineering, Professional, and select specialized talent recruitment. With a collective 30+ years in our field, Delphi-US brings true best practices to the industry, and a fundamental approach that drives excellence in results for our clients and consultants. Known as 'The Peacemakers in The Talent War', Delphi-US seeks to join the best and brightest of our knowledge workforce to select employers of choice throughout the United States.</div>"}