{"job title": "Reporting Data Analyst", "company": "FLEETCOR", "city state": "– Norcross, Georgia", "rating": "2.9", "job description": "Summary<br><br>FLEETCOR is seeking a Reporting Data Analysts that will support strategic business decisions through providing database querying, data analysis, and report production.<br><br>Package<br><br>If you are looking for a GREAT work environment with a GROWTH- ORIENTED company, look no further!\n<ul>\n<li>Benefits on the first of the month following your hire date- no matter when you are hired during the month!</li><li>Automatic enrollment into the 401k plan within your first thirty (30) days on the job: no more waiting until you've been with the company for 1 year!</li><li>Projected company growth trajectory that shows double-digit year over year growth through both organic growth as well as acquisitions.</li><li>Fun environment with contests and prizes!</li><li>Inclusive environment that promotes career growth!</li><li>Monthly employee appreciation and wellness events!</li><li>An on-site gym and weekly discounted onsite car wash services</li><li>Robust PTO policy including: major holidays, vacation, sick days, and personal days</li><li>Discounts at major wireless providers, wholesale grocery stores, and gyms</li><li>Philanthropic support with both local and national organizations</li>\n</ul>\n\nMain Responsibilities<br><br>Primary duties and responsibilities will be to gather data, analyze data, and deliver accurate reports in a timely manner. Must be an Excel guru capable of swimming in an ocean of data without system support. This role will have considerable exposure to senior managers and executive level staff due to the nature of the work.<br><br>Ideal Candidate<br><br>Looking for a candidate who is 1-3 years out of school, preferably familiar with data analysis type work. The ideal candidate will have: the ability to independently develop, execute, and manage highly complex reports; strong problem-solving skills with some experience with database software/tools.\n<br><br>\n*Not required but preferred fluency in SQL, Salesforce, Alteryx, Host Analystics, and/or Tableu."}