{"job title": "Sr. Analyst - Data Visualization", "company": "Georgia-Pacific", "city state": "– ATLANTA, Georgia", "rating": "3.5", "job description": "<div><div><div><div><div><div>\n<div><br>Who is Georgia-Pacific?<u>Watch to find out!</u></div><br><br>\n<div>\n<p>This is a role in the CPG Business Technology &amp; Information Governance team. Position will play a key role in executing key strategies that include:</p>\n<p><br></p>\n<p>Improve data confidence </p>\n<p>Support consolidated/consistent reporting </p>\n<p>Improve efficiency in getting information to business and capability teams</p>\n<p> </p>\n<p>Minimize waste by leveraging data and tools</p>\n<p><br></p>\n<p> </p>\n<p>Position will work across a variety of functional stakeholders (marketing, category, supply chain, etc.) to translate business needs into data and visualization requirements. Works closely with peer team to ensure data governance processes are followed. This position is a key resource in the transformation to minimize manual reporting tools and redefine how key measures are leveraged for well-informed business decisions. </p><br>\n<p>Responsibilities:</p>\n<ul>\n<li>Defining &amp; documenting stakeholder requirements</li>\n<li>Document process flows</li>\n<li>Collaborate with IT team to recommend, develop, and implement enhancements </li>\n<li>Build visualization that supports the required knowledge for business decisions</li>\n<li>Develop and maintain training materials and conduct training sessions </li></ul><br>\n<p>What You Will Need:</p><br><b><u>Basic Qualifications:</u></b> \n<ul>\n<li>Bachelor's degree</li>\n<li>Experience using Hadoop or SQL Server</li>\n<li>Experience using Tableau</li>\n<li>Experience with Microsoft Office </li></ul><br>\n<p>What Will Put You Ahead?</p><br><b><u>Preferred Qualifications:</u></b> \n<ul>\n<li>Experience with Hadoop data structures, linking multiple tables and other data sources together, leveraging Alteryx to join multiple tables/data sources</li>\n<li>Experience with creating advanced visualization leveraging Tableau </li>\n<li>Experience working in an organization with established data governance structure and procedures</li>\n<li>SAP knowledge</li>\n<li>Consumer Products knowledge</li></ul>\n<p>Why Work For GP?</p><br>\n<ul>\n<li>A <u>culture</u> that places top priority on integrity and compliance</li>\n<li>Opportunity for career growth at one of the largest, financially stable companies in the world</li>\n<li>Encouragement to <u>challenge</u> the status quo and share knowledge</li>\n<li>Responsibilities and rewards based on contributions</li>\n<li>Continued <u>company growth</u> due to reinvesting 90% of our earnings</li>\n<li>Competitive pay and benefits that help you manage your personal and financial <u>wellness</u></li></ul><br>\n<p>Want to learn more about <u>Georgia-Pacific?</u></p><br>\n<p>Georgia-Pacific and its subsidiaries are among the world's leading manufacturers and marketers of tissue, paper-based packaging, office papers, cellulose, specialty fibers, non-woven fabrics, building products and related chemicals. Our familiar consumer brands include: Quilted Northern®, Angel Soft®, Brawny®, enMotion®, Sparkle®, Mardi Gras®, and Vanity Fair®, as well as the Dixie® brand of disposable cups, plates and cutlery. Its Harmon subsidiary is among the world's largest recyclers of paper, metal and plastics. The company employs approximately 35,000 people directly.</p>\n<p><br></p><br>\n<div>Salary and benefits commensurate with experience.<br>We are an equal opportunity employer. Minority/Female/Disabled/Veteran<br>Except where prohibited by state law, all offers of employment are conditioned upon successfully passing a drug test.<br><br>This employer uses E-Verify. Please visit the following website for additional information: <u>www.kochcareers.com/doc/Everify.pdf</u><br><br>\n<div>Follow us </div></div></div></div><br>\n \n \n\n \n \n\n \n <div>\n \n </div>\n \n\n \n </div>\n </div>\n </div>\n\n \n </div>\n\t</div>"}