{"job title": "Senior Data Analyst", "company": "Halfaker and Associates", "city state": "– Chantilly, Virginia, United States", "rating": "4.2", "job description": "Tracking Code\n<br><br>\n1113-219\n<br><br>\nJob Description<br><br>Halfaker and Associates LLC, an award winning high growth small business, creates innovative and customer-centric technology solutions in the areas of Cyber Security, Data Analytics, Software Engineering and IT Infrastructure to improve the health, security and well-being of all Americans. Our commitment to excellence and our vision to “Continue to Serve” has resulted in steady growth and an expanding client base across government agencies in the health, defense, security and intelligence sectors. Headquartered in Arlington, VA, we have employees nationwide and were recently named a <strong>2018 Top Work Place</strong> by the Washington Post. Please take a moment to browse through our website and learn more about what it means to serve with Halfaker.\n<br><br>\nHalfaker has an opening for a <strong>Senior Data Analyst</strong> to join our talented, dynamic team. The key responsibilities for this position include:\n\n<ul>\n<li>Write HiveQL queries to populate databases or creating reports</li>\n\n<li>Work closely with the delivery teams to ensure solutions are developed to meet/exceed our customer expectations</li>\n\n<li>Mine data from a relational database in Hive and xml files for the purpose creating reports</li>\n\n<li>Review data diagrams to understand entity relationships and data values that define uniqueness</li>\n\n<li>Analyze data to confirm relationships and identify potential data quality issues</li>\n\n<li>Analyze large IT systems and identify metrics to measure and improve business efficiency</li>\n\n<li>Define the scope of the effort, the key resources and critical activities to contribute to LOE discussions</li>\n\n<li>Proactively research new government policies, work with Subject Matter Experts, and read project material to develop a full understanding of the business, the data, and both the operational and executive reporting needs</li>\n\n<li>Communicate with multiple teams to ensure requirements are clear and understood from both a functional and technical perspective</li>\n</ul>\n\nRequired Skills\n\n\n<ul>\n<li>Strong Unix and Big Data skills (i.e. Hadoop, Hive, Impala)</li>\n\n<li>Ability to conduct in-depth data analysis to assist in validating business assumptions and investigating issues</li>\n\n<li>Firm understanding of database concepts, entity relationships, and advanced SQL.</li>\n</ul>\n\nRequired Experience\n\n\n<ul>\n<li>Bachelor’s degree or equivalent.</li>\n\n<li>7 years of experience in Enterprise Data Analytics Warehouse environment supporting business and data analysis</li>\n</ul>\nHalfaker and Associates is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. U.S. Citizenship is required for most positions<br><br>Job Location\n<br><br>\nChantilly, Virginia, United States\n<br><br>\nPosition Type\n<br><br>\nFull-Time/Regular"}