{"job title": "Healthcare Business &amp; Data Analyst", "company": "HealthPartners", "city state": "– Bloomington, MN", "rating": "3.9", "job description": "We currently have an exciting opportunity for a Healthcare Business and Data Analyst. This position combines the skills of a business analyst with the technical skills of a data analyst. This person will work directly with our business partners to understand their needs and elicit business requirements to meet those needs. This person would then perform data analysis, participate in design sessions and write program specifications to deliver a solution. At HealthPartners, you’ll find a culture where we live our values of excellence, compassion, integrity and most importantly, partnership. By working together, we will improve health and well-being, create exceptional experiences for those we serve and make care and coverage more affordable.\n<br><br>\n<strong>ACCOUNTABILITIES</strong><strong>:</strong>\n\n<ul>\n<li>Works with business partners to define and document detailed business requirements and use cases</li><li>Perform the necessary data analysis to ensure the business requirements can be met</li><li>Drafts functional requirements and technical specifications based on identified business requirements</li><li>Works with ETL developer to ensure efficient design that meets standards</li><li>Drafts test plans based on identified business requirements and ensures the test plans are successfully executed.</li><li>Understand and document data flows</li><li>Assists or coordinates user acceptance testing</li><li>Assesses and provides estimates for various requests</li><li>Ensure deadlines are understood and met</li><li>Manage small projects</li><li>Performs troubleshooting of data or process issues as needed</li><li>Works with business partners to resolve any process issues or incidents</li> \n</ul>\n\n<strong>SKILLS/EXPERIENCE:</strong>\n\n<ul>\n<li>Strong SQL skills (Oracle, SQL Server)</li><li>Strong experience in data analysis and troubleshooting data issues</li><li>Experience in gathering business requirements and creating related requirement documents</li><li>Experience in transforming business requirements into functional and technical requirements</li><li>Experience in design process</li><li>Proven ability to write technical documentation in a clear manner</li><li>Ability to understand data models and data relationships</li><li>Excellent analysis and problem solving skills</li><li>Ability to communicate across business and technical teams, clearly and concisely.</li><li>Strong communication skills in technical and non-technical vernacular.</li> <li>Experience participating on project teams, preferably from initiation through successful implementation and acceptance of application changes.</li><li>Experience with Microsoft Office tools</li> \n</ul>\n\n<strong>REQUIRED QUALIFICATIONS</strong><strong>:</strong>\n\n<ul>\n<li>4 year degree or equivalent experience</li><li>4+ years IT analysis and technical design experience</li><li>Oracle/SQL experience writing queries</li><li>Experience in Business Analysis and Data Analysis</li>\n</ul>\n\n<strong>PREFERRED QUALIFICATIONS</strong><strong>:</strong>\n\n<ul>\n<li>Healthcare experience</li><li>Knowledge of data warehousing</li> \n</ul>\n\nHealthPartners is recognized nationally for providing outstanding care and experience for patients and members. We offer an excellent salary and benefits package. For more information and to apply go to www.healthpartners.com/careers and search for job ID #49536.\n<br><br>\n, FLD_JPM_CLINIC_DEPARTMENT=HP - Bloomington 8170 Office&nbsp;Bldg"}