{"job title": "Benefits Data Analyst - Retirement", "company": "HP Inc.", "city state": "– Houston, Texas", "rating": "4.1", "job description": "<p>This position will assist in the administration of the HP US Retirement programs and Financial Wellness program, which includes the HP 401(k) Plan, Executive Deferred Compensation Plan and various legacy plans. The HP 401(k) Plans services more than 50,000 active, terminated, and retired participants. The HP Financial Wellness program strives to promote the financial wellbeing of all HP employees by helping them plan for and achieve their financial goals.</p><p><b>Responsibilities:</b></p><ul><li>With guidance, supports plan program managers with respect to data analysis</li><li>Prepare and deliver business relevant reports/analyses for use at all levels of the global benefits organization (e.g. leadership, support, project team).</li><li>Validate and model data from internal and external sources in support of team members in retirement and benefit design strategies and plans.</li><li>Develop efficiencies and streamline operational processes through database or system innovation.</li><li>Complete ad-hoc reporting requests and track metrics for various projects.</li><li>Support benefits initiatives with analytics and insight analysis</li><li>Act as technical support for department</li><li>Develop test plans for new application or system development as well as conduct user acceptance testing for projects such as Workday upgrades, payroll system testing, and interface file testing.</li><li>Miscellaneous projects assigned</li></ul><p></p><p><b>Education</b></p><ul><li>First-level university degree or equivalent experience.</li><li>Typically 1 or more years related systems experience in compensation, benefits, finance, and/or human resources.<p></p><p></p><p><b>Knowledge and Skills: </b></p></li></ul><ul><li>Systematic knowledge of total rewards disciplines and its link to overall HR and HP business strategy and the business environment.</li><li>Strong research and analytical skills.</li><li>Basic financial and business acumen.</li><li>Basic project management skills.</li><li>Strong familiarity with Microsoft Office tools, particularly Excel and PowerPoint.</li></ul><p></p><p></p><p>#LI-POST</p>"}