{"job title": "Data Analyst Business Intelligence", "company": "iSpot.tv, Inc.", "city state": "– Bellevue, WA", "rating": "3.8", "job description": "<strong>Data Analyst-Business Intelligence</strong>\n<br><br>\nThe leader in real-time TV ad data and analytics is currently seeking a Data Analyst – BI who will design and develop custom reports for iSpot clients. We are seeking a talent who will share our obsession for data accuracy; someone with an insatiable appetite for learning new things and accomplishing challenging goals in a fast-paced (and not always structured) environment. We are looking for someone that is highly motivated and knows how to get things done quickly and efficiently.\n<br><br>\nWe have a product that is changing how brands, agencies and networks measure and assess the impact of TV advertising campaigns. Our software uses proprietary audio and video analysis to monitor and extract TV commercials, movie trailers and other promotional content from TV. At the same time, our software analyzes consumer interactions with TV ads on the digital screen across search, video and social. Interactions are matched with specific ads and attributed back to airings on TV. Our platform collects and analyzes massive amounts of data in real-time.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nAs a key member of the custom analytics team, you will be responsible for a variety of business-critical work that includes, but not limited to:\n<ul>\n<li>Gathering data from multiple data sources, aggregating and manipulating data for analysis, performing analysis, and creating analysis deliverables in Tableau or other BI tools.</li><li>Communicating with internal iSpot teams (including Engineering, Customer Success, and Sales) to clarify requirements, resolve technical roadblocks, manage priorities, and summarize insights from analysis.</li> <li>Query from large, complex data sets (using a combination of SQL and Python) to get data that is most relevant for analysis related to TV advertisement measurement. Be proficient in knowing how to join and aggregate potentially large data sets to make sense and provide valuable insight. Be curious about results and have a desire to understand how the data tells a story.</li> <li>Create visualizations and/or tables that organize data in a way that is digestible and makes sense based on the request. Leverage Tableau or other BI tools (Excel, Qlik, etc) to create a customer-ready deliverable.</li> <li>Work closely with data engineering and other technical experts to ask questions about data accuracy and validity. You should gain a sense for data that potentially doesn’t look right and communicate concerns whenever you see them.</li> <li>Document project status, updates, roadblocks, resolutions, dependencies, and deliverables in project tracking tool (JIRA).</li><li>As part of a very collaborative engineering team, you will have access to technical experts that can help you optimize code, point you to the right data, and brainstorm about how to visualize a data set. You should be an open communicator and have a desire to participate in team discussions and help troubleshoot when you have knowledge that a team member might need.</li> <li>You will be expected to manage multiple projects at the same time…not too many, but usually not just one. You should be able to communicate roadblocks and risks proactively…we will have your back when you do!</li> <li>Ideally you have some curiosity for the TV ad measurement space and think that tying ad measurement to business outcomes leads to some very interesting, sometimes exploratory, analysis.</li> \n</ul>\nRequirements to be successful in this role:\n<ul>\n<li>3-5 years of professional experience and bachelor’s degree, including:\n\n<ul>\n<li>3-5 years as a data analyst, focused on hands-on data gathering, analysis, and visualization.</li> <li>2-3 years in a role that required communication to clarify requirements, summarize results, or advise clients on analysis.</li> </ul></li>\n<li>At least 2 years of experience with Tableau or a similar BI tool is required, including high proficiency in data loading, variable creation, visualization creation and adjustment, and report publishing (both online and via desktop or local channels).</li> <li>Proficiency in SQL, and R or Python is required. Ability to break down queries to run under processing and memory constraints. You will need to know how to both initiate your own query and also edit/debug an inherited query in some cases.</li> <li>Must be able to communicate risks and roadblocks for analysis projects to team leads or VP of Reporting and Analytics.</li> <li>Must be able to communicate status of projects clearly for technical and non-technical audiences and independently manage and prioritize assignments.</li><li>Strong attention to detail.</li><li>Strong quantitative, analytical, process development, facilitation and organizational skills required.</li><li>Ability to multi-task and work well under deadlines in a changing environment.</li>\n</ul>\niSpot.TV is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard for race, color, religion, sex, age, disability, military status, or national origin or any other characteristic protected under federal, state, or applicable local law.\n<br><br>\nSDL2017"}