{"job title": "Vendor Master Data Analyst", "company": "LANXESS Corporation", "city state": "– Pittsburgh", "rating": "3.4", "job description": "<strong><br><br><strong>Who we are</strong>:</strong>\n<br>\nLANXESS Corporation in the USA\n<br><br>\nLANXESS is a leading specialty chemicals company with sales of EUR 9.7 billion in 2017 and about 19,200 employees in 25 countries. The company is currently represented at 74 production sites worldwide. The core business of LANXESS is the development, manufacturing and marketing of chemical intermediates, additives, specialty chemicals and plastics. Through ARLANXEO, the joint venture with Saudi Aramco, LANXESS is also a leading supplier of synthetic rubber. LANXESS is listed in the leading sustainability indices Dow Jones Sustainability Index (DJSI World) and FTSE4Good.\n<br><br>\nIn the United States, LANXESS employs more than 2,000 people at 21 locations in 10 states.\n<br><br>\n<strong>What we can offer you</strong>:\n<br>\nLANXESS is a young company with strong roots! We derive our strength from global presence, management excellence and most importantly our people! Our employees are the pillars of our success.\n<br><br>\nWe offer exciting career opportunities regionally as well as internationally, educational assistance programs, competitive pay and benefits, language training programs, and many other personal and professional development programs that are a part of our vision and values that drive our ongoing success.\n<br><br>\n<em>*As Vendor Master Data Analyst you will *</em>centralize the Vendor MDM process and ensure the standardized processing is being followed for all vendor creations and change requests. The position will review and enter all Vendor Master Data requests from Accounts Payable and Global Procurement &amp; Logistics for completeness and accuracy into to MDM. Research and resolve questions from the Global MDM Team and identify and perform ongoing Vendor Master Data cleansing.\n<br><br>\n<strong>Main Responsibilities</strong>:\n\n<ul>\n<li>Review and Enter all New Vendor requests and Vendor changes from AP and GPL</li>\n<li>Research and resolve questions from Global MDM</li>\n<li>Perform ongoing Vendor Master Data Cleansing</li>\n</ul>\n<strong>In order to accomplish this you will</strong>:\n\n<ul>\n<li>High School diploma required. Bachelors degree in business preferred</li>\n<li>Demonstrated analytical and conceptual thinking skillsDemonstrated effective verbal and written communication required</li>\n<li>Demonstrated ability to lead and manage a small team of clerks</li>\n<li>Experience with SAP or other enterprise software required</li>\n<li>Excel and Microsoft Office skills required</li>\n</ul>\n<strong>Must include a resume.</strong>\n<br><br>\nLANXESS is an Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, veteran status or disability."}