{"job title": "Senior Customer Data Analyst", "company": "Looker", "city state": "– Santa Cruz", "rating": "4.8", "job description": "<div><div>WHO WE ARE</div> <div>Looker is on a mission to bring better insights and data-driven decisions to every business. Everything we do is aimed at making sure our customers love every aspect of Looker, from our products and technologies to our ease of doing business and our support. We are looking for curiously brilliant individuals to join our team as we reinvent data analytics. Get data-driven and see yourself at Looker.</div> <br>\n<div>WHAT WE’VE GOT GOING ON</div><div>Looker is building a new Customer Experience team and you will be at the heart of driving this engine with data. As our first Customer Data Analyst you should be passionate about customer data and excited to influence the business through offering thoughtful analysis and meaningful insights.</div><br>\n<div>Our ideal candidate is a highly analytical thinker who enjoys solving complex and nuanced problems through the exploration of data. You will collaborate with marketing and customer success leaders to understand the insights and intelligence they require to engage, manage and grow their business.</div>\n</div><div><div>WHAT WE NEED YOU TO DO\n\n<ul>\n\n\n<ul>\n<li>Access and synthesize data using appropriate tools and technology while leveraging knowledge of data sources, data quality and business context</li><li>Build trust and an advisory relationship with the customer experience team to help them better measure and understand campaign performance</li><li>Apply analytical/statistical methods to provide stakeholders with analysis, insight and direction that will move the needle on key performance indicators and metrics</li><li>Effectively translate and visualize analytical findings into the language of business stakeholders</li><li>Evangelize data stewardship, pursue data quality and relentlessly drive data issues to resolution</li><li>Document and communicate analytics processes, modeling, and methodology to improve user experience</li><li>Master Looker for your analytical needs. Learn what’s happening next with the product and help customer experience leverage its capabilities</li><li>Empower others internally to understand and leverage data</li></ul>\n</ul>\n\n</div>\n</div><div><div>WHAT YOU BRING TO LOOKER\n\n<ul>\n\n\n<ul>\n<li>5+ years of related experience with a proven history of driving insights</li><li>Strong technical skills:</li><li>Demonstrated use of SQL and working with large datasets in a business environment. Working knowledge of R, python preferred.</li><li>Experience with one or more data analysis or data visualization tools</li><li>Demonstrated understanding of enterprise data warehouse, big data, BI &amp; analytics, data management, Salesforce, marketing automation (Marketo preferred), CMS, SEO, Web analytics (GA360).</li><li>Comfortable and hands-on experience with Javascript/HTML/CSS.</li><li>Understanding of testing methodology and statistical techniques</li><li>Superb communication skills, written and oral, with ability to turn data into compelling stories and insights, influencing both technical and non-technical audiences</li><li>Exceptionally organized, with project management capabilities. A self-starter who can work well independently and in a team environment</li><li>Familiarity with the B2B Saas ecosystem and deep understanding of KPI development and attribution methodologies</li> <li>Experience managing, manipulating and setting up large data sets (e.g., Transaction data, CRM data, Analytics data) for analyses at different levels of sophistication</li> </ul>\n\n</ul>\n\n</div>\n</div><div><div>#LI-LM1</div><br>\n<div>A LITTLE MORE ABOUT LOOKER</div><div>Looker is a complete data platform that offers data analytics and business insights to every department, and easily integrates into applications to deliver data directly into the decision-making process. Over 1,600 industry-leading and innovative companies such as Sony, Amazon, The Economist, IBM, Spotify, Etsy, Lyft and Kickstarter have trusted Looker to power their data-driven cultures. The company is headquartered in Santa Cruz, California, with offices in San Francisco, New York, Chicago, Boulder, London and Dublin, Ireland. Investors include CapitalG, Kleiner Perkins Caufield &amp; Byers, Meritech Capital Partners, Redpoint Ventures, First Round Capital, Sapphire Ventures and Goldman Sachs. For more information, connect with us on LinkedIn, Twitter, Facebook and YouTube or visit looker.com.</div><br>\n<div>Looker aspires to be a workplace that is not only free of discrimination, but one that fosters inclusion and belonging. We strongly believe that diversity of experience, perspective, and background lead to a better environment for our employees and a better product for our users. We encourage you to join us in changing the way businesses use data.</div></div>"}