{"job title": "Fiscal Information Data Analyst", "company": "State of Washington", "city state": "– Olympia, WA", "rating": "3.7", "job description": "Description\n<br><br>\nFiscal Information Data Analyst\n<br><br>\nWMS Band 2\n<br><br>\nOlympia,\n<br><br>\n<strong>WA</strong>\n<br><br>\nWe are looking for someone with a strong curiosity to explore large and raw administrative data to inform policy decisions.\n<br><br>\nThis position is located in the Financial Analytics Section (FAS) within Financial Services Division (FSD) of the Washington State Health Care Authority (HCA). The HCA manages medical assistance programs for lowincome and disabled individuals including Medicaid, Children's Health Insurance Program, Affordable Care Act expansion, and Public Employee Benefits (PEB) programs. Beginning in 2020, HCA will also purchase health care for Washington residents through the School Employees Benefits Board (SEBB) Program. The FSD manages nearly $20 billion to fund these programs each biennium.\n<br><br>\n<strong>Financial Analytics Section's mission:</strong>\n<br><br>\nTo inform decision-making, we provide data, data analysis, and relevant consultation to HCA stakeholders by leveraging knowledge of relevant programs and policies.\n<br><br>\n<strong>Position objective:</strong>\n<br><br>\nThe FIDA will perform assigned tasks of a highly specialized and technical nature. The tasks will include the responsibility of determining methodologies and conducting dataintensive analyses in various areas including, but not limited to, services provided to medical assistance clients, state and national health care trends, and efficient healthcare budgeting. The majority of the work will be done using PL/SQL and Excel. The most challenging task for a FIDA is to understand the healthcare business, policies, and HCA data systems, and to find the correct information in support of decision-making.\n<br><br>\nSome of the tasks this position will perform:\n<br><br>\nThis position develops analytical models and conducts data analysis for HCA and its medical assistance and PEB programs. This position is responsible for:\n\n\n<ul>\n<li>extracting data using PL/SQL Developer and Microsoft SQL Server Management Studio</li>\n<li>analyzing medical services and PEB data which are used to guide the agency's budget request and policy decisions</li>\n<li>organizing and coordinating adhoc analyses in order to detect trends, correlations, or any other patterns in financial data pertinent to the operations of the HCA or value based purchasing decisions</li>\n<li>developing procedures for reporting analyses and providing expert level advice on data elements that are used to create databases</li>\n<li>analyzing reports prepared by other state and federal agencies to evaluate their impact on, or relationship to, the HCA's goals, objectives, and budget</li>\n<li>establishing project data requirements and collection methods, downloading from data warehouse, interpreting and analyzing data using multiple applications, etc.</li>\n<li>providing expert advice to inform and guide HCA budget and decision packages, fiscal notes, bill analyses, and other ad hoc financial analyses requests</li>\n<li>collaborating with other divisions within HCA, partner agencies, and stakeholders to support the goals of Healthier Washington, HCA realignment, and efforts to introduce valuebased purchasing options to Washington's health care system</li>\n<li>working closely with internal and external staff, including senior management and legislative staff, on ad hoc projects requiring information and analysis</li>\n</ul>\n\n<strong>Required Qualification/Experience:</strong>\n<br><br>\nMaster's Degree in economics, statistics, public administration, or a related field.\n<br><br>\nOr,\n<br><br>\nBachelor's degree in economics, statistics, public administration, or a related field, and three or more years of experience working with large and complex data.\n<br><br>\n<strong>Preferred Qualification/Experience:</strong>\n\n\n<ul>\n<li>Experience in using data to inform decision-making in government</li>\n<li>Experience in data querying protocols/software such as PL/SQL</li>\n<li>Effective communication skills, including the ability to translate complex analytical information for nonanalytical audiences</li>\n<li>Education/experience in medical coding and/or billing</li>\n<li>Experience in developing financial models using advanced tools in Microsoft Excel</li>\n<li>Experience communicating to elected government officials and federal auditors</li>\n<li>Experience working with Medicaid and health care administrative data</li>\n<li>Experience with protocols and processes of the executive and legislative branches of state and local government</li>\n</ul>\n\n<strong>How to Apply:</strong>\n<br><br>\nTo apply for this position you will need to complete your profile and attach:\n\n\n<ul>\n<li>A cover letter</li>\n<li>Current resume</li>\n<li>Three professional references</li>\n</ul>\n\nIf you have questions about the process, or need reasonable accommodation, please contact the recruiter before the posting closes. The candidate pool certified for this recruitment may be used to fill future similar vacancies for up to the next six months.\n<br><br>\nWashington State is an equal opportunity employer. Persons with disabilities needing assistance in the application process, or those needing this job announcement in an alternative format may call the Human Resources Office at 360.725.1180 or email Sanyu.Tushabe@hca.wa.gov.\n\n\n<ul>\n<li>Prior to a new hire, a background check including criminal record history will be conducted. Information from the background check will not necessarily preclude employment but will be considered in determining the applicant's suitability and competence to perform in the position. *</li>\n</ul>"}