{"job title": "Business Data Analyst", "company": "Underwriters Laboratories", "city state": "– ", "rating": "3.5", "job description": "Careers | UL |Business Data Analyst\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<div>\n<div>Please Enable Cookies to Continue</div>\nPlease enable cookies in your browser to experience all the personalized features of this site, including the ability to apply for a job.</div>\n\n\n\n\n<div>\n\n\n\n\n<div>\n<div>\n<div>\n\n<div>\n\nWelcome page\n\n</div>\n\n\n</div>\n</div>\n<div>\n<div>\n<div>\n<div>Returning Candidate?</div>\n<div>\nLog back in!\n</div>\n</div>\n<div></div>\n</div>\n</div>\n</div>\n\n\n\n\n<div>\n<div>\n\n\n<div>\n<li>\n<div>\n<div>\n\nBusiness Data Analyst\n</div>\n</div>\n<div>\nLocation\n\nUS-IL-Northbrook</div>\n<div>\n</div>\n<div>\n<div>\n\nJob ID\n\n2018-10510\n\n\n# of Openings\n\n1\n\n\nJob Category\n\nAccounting/Finance\n\n</div>\n</div>\n</li>\n</div>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOverview\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<p><strong>Contribute to a Safer, More Secure, and More Sustainable World.</strong></p><p>At UL, we know why we come to work. Thousands of us around the world wake up every day with one common purpose – to make the world a safer, more secure, and more sustainable place to live. We clear the way for our customers to introduce the latest products, technological advances, and systems in an increasingly complex world so they can provide peace of mind to the market. Our integrity is woven throughout our company and shapes the way we approach deliver our solutions. We are proud that the work we do every day has a meaningful contribution to society. We continue to build upon our legacy of trusted expertise and partnership to keep our communities safe and secure as we march forward into the future. This helps us to sleep better at night, and we are confident that the millions of people we touch rest easier too.</p><p> </p><p> </p><p>Responsible for cleaning, evaluating and compiling data in a manner coincident with meaningful results. Conducts analysis of datasets to assist in areas of research, development, product enhancement or other targeted business objectives. Use advanced mathematical methods to analyze and interpret data from various sources. Use established statistical methods to determine data sources, sample sizes and appropriate methods to create and interpret reports. Incumbents are gaining exposure to some of the complex tasks within the job function. Incumbents are still occasionally directed in several aspects of their work. However more straightforward tasks are accomplished without assistance.</p><p> </p>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\nResponsibilities\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li><div>Assists with the definition and development of user-friendly reports and graphics that integrate and convey complex data/information and maintains data catalog to provide key data sources to internal and external stakeholders.</div></li><li><div>Conducts in-depth data analyses using traditional and advanced statistical methods. Works within established guidelines and policy.</div></li><li><div>Aggregates data to test hypotheses, prepares and analyzes data to meet the needs of efficient data analysis, using technical experience and judgement.</div></li><li><div>Assists with developing programming solutions to conduct data preparation, analysis and visualization in support of statistical modeling, data analytics and interpretation.</div></li><li><div>Transforms complex data into creative graphs, tables, charts and other graphics in order to present and/or share the data in a comprehensive and concise manner.</div></li><li><div>Assesses trends and provides analysis to identify emerging business critical issues.</div></li><li><div>Identifies and defines opportunities for safety solutions by analyzing historical patterns.</div></li><li><div>Assists in defining, developing and deploying data, analytics and reporting products and services.</div></li><li><div>Conducts data validation, statistical analyses, and data mapping.</div></li><li><div>Performs other duties as directed.</div></li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\nQualifications\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li><div>University Degree (Equivalent to Bachelor’s degree) in Mathematics, Statistics, Finance or a related discipline and generally three plus years of experience in data and statistical analysis strongly preferred.</div></li><li><div>Strong in Microsoft Excel and Power BI, data management and data integration skills with an ability to organize, analyze and correlate data information</div></li><li><div>Strong interpersonal skills with the ability to communicate with technical and non-technical stakeholders</div></li><li><div>Previous experience doing large scale data analysis preferred</div></li><li><div>Ability to organize, analyze and correlate data information.</div></li></ul><p>#CB</p>\n\n</div>\n</div>\n</div>\n\n\n<div>\n\nOptions\n\n<div>\n\n\n\n\n<div>Apply for this job onlineApply</div><div>Share</div><div>Email this job to a friendRefer</div>\n\n\n\n\n\n\n</div>\n<div>\n\n\n<div>Sorry the Share function is not working properly at this moment. Please refresh the page and try again later.</div>\n\n<div></div>\n<div>Share on your newsfeed</div>\n<div></div>\n\n</div>\n</div>\n\n\n\n\n\n\n\n\nConnect With Us!\n\n<div>\n<div>\n<div>\nNot ready to apply? Connect with us for general consideration.\n<br>\n<br><br><br>\n<b>EEO is the Law</b><br>\nE-Verify Poster (English)<br>\nRight to Work Poster (English)\n\n</div>\n</div>\n</div>\n\n\n\n\n<div>\nUL is committed to hiring and retaining a qualified diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class U.S. Citizenship is required for most positions.\n</div>\n\n<div>If you experience technical difficulties during the application process, please click here<p>Software Powered by iCIMS<br>www.icims.com</p></div>\n\n</div>\n<div></div>\n</div>\n\n</div>"}