{"job title": "Digital Data Analyst", "company": "Union Bankshares", "city state": "– Richmond, VA", "rating": "2.8", "job description": "<div></div><div> Requisition Number 18-0402 </div><div> Post Date 8/14/2018 </div><div> Title Digital Data Analyst </div><div> Location Richmond HQ </div><div> City Richmond </div><div> State VA </div><div> Description Position Description <br>\n<br>\nThe Digital Data Analyst will support Union’s Digital Strategy Team by leveraging analytic and technical skills to provide reporting on digital capabilities, analyze data to identify opportunities for customer experience and operational improvements, and drive\n business requirements for building out internal data architecture. This role will also utilize business data to provide insight into use of digital capabilities and tools within customer assisted channels.<br>\n<br>\nPosition Accountabilities:<br>\n<br>\n• In conjunction with key stakeholders, define the reporting required to actively monitor digital capabilities and progress towards key performance measures<br>\n• Lead the development, improvement, automation, and/or conversion of reporting/dashboard routines<br>\n• Create and maintain regular reporting cadences for socializing digital performance across the company<br>\n• Create reports to share findings and recommendations with the internal team and other stakeholders<br>\n• Develop analytical approaches and methodologies that provide insight into business performance<br>\n• Create statistical models that depict company-wide trends<br>\n• Provide analytical support to the Digital Strategy team to identify opportunities to progress forward the digital customer experience and to leverage digital to reduce expenses<br>\n• Collaborate with external vendors and internal partners to define requirements for integrating data into Union’s enterprise data warehouse<br>\n• Act as the liaison to the enterprise data warehouse program for the Digital Strategy team, driving digital needs and requirements for data capture and reporting<br>\n• Identify gaps in digital data capture activates and drive continuous improvements in data storage and access<br>\n• Perform testing and validation of data sets<br>\n• QA and advise on analytics data collection tagging in internal development environments as needed<br>\n• Serve as the subject matter expert on digital analytics and stay abreast of industry best practices and methodologies<br>\n<br>\nOrganizational Relationship:<br>\n<br>\nThis position reports to the Head of Digital Strategy. </div><div> Requirements Position Qualifications<br>\n<br>\nEducation &amp; Experience:<br>\n<br>\n• Bachelor’s Degree required <br>\n• Prior experience in either Banking or Financial Services required<br>\n• 5-8 years of experience in a position with primary responsibilities involving development of strategic management reports, data analysis, and the development of key conclusions and recommendations, preferably in banking , financial services, market related\n field<br>\n<br>\nKnowledge &amp; Skills:<br>\n<br>\n• Five years of experience working with Microsoft Office suite with an emphasis on Excel required<br>\n• One year of experience working with SQL and writing SQL queries required<br>\n• Experience working with SSIS, SSMS, and SSRS preferred <br>\n• Proficient in business / data analysis and the creation of strategic management reporting<br>\n• Strong working knowledge of Microsoft Excel and Microsoft Access and experience in using these program to manipulate information databases to prepare user-friendly tracking reports and supporting graphics<br>\n• Experience using Microsoft PowerPoint to create management presentations<br>\n• Excellent communication and writing skills including ability to present analytical concepts, results and conclusions in an easily understandable and logical manner<br>\n• Strong interpersonal skills and ability to work well in a team environment<br>\n• Ability to exercise sound business judgment<br>\n• Ability to handle multiple tasks with attention to details<br>\n• Flexible, able to adapt to change<br>\n<br>\nNo search.<br>\n<br>\nWe are proud to be an EEO/AA employer, Minority/Female/Disability/Veteran. We maintain a drug-free workplace. </div><div></div>"}