{"job title": "Master Data Analyst (Data Quality)", "company": "Wagner Spray Tech", "city state": "– Plymouth, MN", "rating": "4.2", "job description": "Minneapolis-based Wagner SprayTech Corp., a wholly-owned subsidiary of Wagner Holding, Inc., is a market leader in advanced paint applicators. We develop and market a wide array of painting and decorating products used in home improvement, commercial painting and industrial fine finishing. Wagner supports its customers through innovation, high tech engineering, quality manufacturing and service.\n<br><br>\nWagner Spray Tech believes that people represent a company's most important asset. At Wagner, we strive to create an organization where everyone participates and efforts are focused toward continuous improvement. These improvements are driven by dedication, teamwork, and the innovation of Wagner people.\n<br><br>\nOur company participates in the US government's E-Verify process. In addition, all offers of employment are contingent on a drug test and background check. Our benefits package includes 401(k), health, dental, life, disability, long term care insurance, as well as tuition reimbursement.\n<br><br>\n<strong>Position Objective:</strong>\n<br><br>\nThe individual is expected to outline the importance of data quality in today's business environment, manage data as an asset, provide data quality processes and infrastructure to support all US based businesses and functions, help identify data cleansing opportunities, and support in executing a global master data governance framework.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Develop and implement data quality assessment and improvement programs. Develop and implement Data Quality Scorecard/Dashboard and data quality reporting to support all businesses, functions, and regions per data class.</li>\n<li>Oversee and support data cleanup initiatives, data migration activities-and projects on functional level. Focal point for data management quality issues. Raising awareness of the costs of non-quality data.</li>\n<li>Initiate and drive quality improvement initiatives.</li>\n<li>Facillitate definition and implementation of data quality standards.</li>\n<li>Recommend improvements to process and application owners and facilitating improvements.</li>\n<li>Assure compliancy with in-and external data standards and value sets, Internal Control System/SOX; initiate improvement actions.</li>\n<li>Facilitate analysis of data quality problem root causes.</li>\n</ul>\n\nBackground\n<br><br>\n<strong>Education</strong>\n\n\n<ul>\n<li>Bachelor degree in a technical discipline, computer sciences, business information management or related discipline</li>\n</ul>\n\nExperience\n\n\n<ul>\n<li>5+ years of SAP Master Data experience</li>\n<li>Experience implementing and supporting SAP in global organizations</li>\n<li>Experience in a number of the following areas: SAP ERP, MDM, data quality tools (Informatica, Infosphere, Trillium) SAP BO, BI, CRM, ETL tools, SAP Information Steward)</li>\n<li>Experience in IT and (project) management, preferably with data management processes, data quality management and data quality improvement projects in a complex global environment</li>\n</ul>"}