{"job title": "Sales Data Analyst", "company": "Crown Laboratories", "city state": "– Johnson City", "rating": "3.0", "job description": "Crown Laboratories, along with our affiliated companies, has a long-standing heritage in skin care, and we are passionate about providing consumers and clinicians with innovative solutions for the skin. As our mission states, we are committed to developing and providing a diverse portfolio of pharmaceutical and consumer products that improve the quality of life for our customers.\n<br><br>\nWith consumer brands like Blue Lizard Australian Sunscreen, Vita Liberata, and more, we offer best-in-class sunscreens, self-tanning lotions, moisturizers, cleansers and oral care products. Our prescription products provide healthcare professionals with solutions for managing a variety of skin conditions. We are excited about our future, as we grow to become an innovative leader in the dermatology, skin care, and aesthetics industries while enriching the lives we touch.\n<br><br>\nWe are currently recruiting for a Sales Data Analyst to play a key role in helping the organization understand its customers through the analysis of various data sources and to support the functional operations of the commercial operations team and enable quicker and smarter business decisions.\n<br><br>\nKey Responsibilities:\n\n\n<ul>\n<li>Responsible for CRM administration, data loads and field support. Conduct ad-hoc and routine analysis on OTC and Rx product sales and promotional activity with appropriate communication to internal staff, sales, and marketing personnel. Design and develop sales support reporting for field and internal partners. Responsible for performing data analysis in a complex healthcare environment- Provide assistance with PDMA Sample Accountability Requirements- Brainstorm with functional teams and recommend optimal way to collect, store, retrieve and analyze data- Migrate former data platforms and integrate data into useful data warehouses/cubes from a variety of sources- To work with field territory managers, regional managers and internal partners responding to reporting questions, current rep sales status, etc. Work with internal departments as needed (customer service, finance, etc.)</li>\n</ul>\n\nRequires any combination of education and experience equivalent to BA/BS in Economics, Finance, or related field, and 1-3 minimum years experience in a comparable role. Must have strong analytical and problem solving skills and advanced proficiency in Excel (VBA a plus), Access, SQL. Prefer candidates with strong understanding of Syndicated Retail Data and/or Pharmaceutical Industry data Sources. Previous experience with CRM applications desired. Must have excellent written and oral communication skills, with ability to convey technical information to a non-technical audience for actionable business decisions.\n<br><br>\nNOTE: This job profile is intended to provide an overview of expected job duties and requirements. It is not intended to be a contract of employment, explicit or implicit. All contents are subject to change at the sole discretion of the company. Cooperation is expected of all employees. Other duties may be assigned as needed.\n<br><br>\nWe offer a competitive benefits package including vacation, medical, dental, vision, short/long term disability and 401(k) w/match.\n\n\n<ul>\n<li>an Equal Opportunity Employer_\n<br><br>\nFor other career opportunities, please visit our careers page:</li>\n</ul>\n\nhttps://www.crownlaboratories.com/employment-opportunities/\n<br><br>\nTo learn more about our company and our brands, please visit our websites:\n<br>\nwww.crownlaboratories.com\n<br><br>\nwww.bluelizard.net\n<br><br>\nwww.vitaliberata.com\n<br><br>\nwww.nkdskn.com"}