{"job title": "ANALYST, IT (Data Analyst, Security Solutions)", "company": "Duke University", "city state": "– Durham", "rating": "4.0", "job description": "<br><b>Position Title</b><br>ANALYST, IT (Data Analyst, Security Solutions)<br><br><b></b><br>14-Aug-2018<br><br><b>Auto req ID</b><br>103685BR<br><br><b>Duke Entity</b><br>CENTRAL ADMIN MANAGEMENT CTR<br><br><b>Job Code</b><br>2423 ANALYST, IT <br><br><b>Job Description</b><br>The IT Security Office (ITSO) is responsible for the overall coordination, implementation, and assessment of information security at Duke University. The overall goal of ITSO is to achieve the optimal level of confidentiality, integrity and availability of Duke's information assets and systems while providing a safe and secure computing environment for research, teaching, learning, and the everyday conduct of university business. <br> <br>The incumbent will be embedded in the OIT Data Analytics team and work with ITSO on both small and large-scale projects requiring analysis of diverse and large data sets to answer security and operational questions. The position will be responsible for working with the analytics and security teams to analyze network and system log data for signs of anomalous activity. Duties include:<br> <br>Support data collection and reporting tools (e.g. Splunk, Spark, etc).<br> <br>Participate in a variety of duties involved in collecting, interpreting, documenting, and summarizing descriptive, analytical, and evaluative data in support of information security activities.<br><br>Participate in efforts to analyze, study, and interpret the information to find patterns and trends, validate data quality, and disregard irrelevant data.<br><br>Work with appropriate resources to establish procedures and protocols for the procurement of data via a variety of methods<br> <br>To be successful requires excellent oral and writing skills, time management skills, strong people skills, and a results-oriented attitude. In all endeavors the incumbent must demonstrate the highest degree of ethics and professionalism. <br> <br><strong>Skills/Qualifications</strong><br> <br>Experience with a log aggregation and analytics platform such as Splunk, Apache Spark or ELK is a must.<br> <br>Experience performing data analysis.<br><br>Demonstrated technical expertise regarding data mining techniques.<br><br>Knowledge of or experience with reporting packages (Business Objects, Tableau etc.), databases (SQL etc.), programming (XML, Javascript, or ETL frameworks)<br><br>Knowledge of statistics and experience using statistical packages for analyzing large datasets (Excel, SPSS, SAS etc.)<br><br>Analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy<br> <br>Excellent verbal and written skills.<br><br>Maintain technical knowledge by attending educational workshops; reviewing publications; establishing personal networks; participating in technical societies.<br> <br>Background in information security a plus.<br><br><br><strong>EDUCATION</strong><br><br>Required: B.S. in Computer Science, Engineering or related field plus 3 years of experience in security, networking, systems administration, or data analytics; or 5 or more years of experience.<strong>BENEFITS</strong>Duke’s comprehensive benefits package includes paid time-off (vacation, holidays, sick leave), health, dental, vision, disability and life insurance, educational assistance, and support for professional development and training. As an employee of Duke University you would also enjoy numerous discounted services such as health club memberships, movie tickets, and cell phone services. <strong>ENVIRONMENT</strong>The Office of Information Technology (OIT) is responsible for managing Duke campus’ IT infrastructure, service and support including academic research and enterprise applications. OIT provides leadership and expertise in many areas of Information Technology to Duke entities, including faculty, staff, and students. Specific services delivered include voice, data &amp; video communications, institutional email and administrative applications (payroll, financial ledger, student systems etc.), database, web infrastructure, desktop &amp; helpdesk support, student computing, data center services, and high-performance computing &amp; academic software systems. OIT is also responsible for developing/upgrading the physical IT infrastructure around campus and maintaining 23 student computer labs.<br><br>Duke University and Durham are located in the Research Triangle, a region that encompasses one of the nation's premier concentrations of academic, corporate, and public research. The Triangle region is rated among the most desirable areas in North America to live and work and has been identified by Money magazine as one of the \"Best Places to Live\" in the U.S. <br> <br><strong><em>Trustworthiness, respect, diversity, learning and teamwork are the hallmarks of Duke's guiding principles. Our accomplishments are dependent on the dedication and expertise of all who work to support Duke's mission.</em></strong><br> <br><br><b>Location</b><br>Durham<br><br><b>Exempt/Non-Exempt</b><br>Exempt<br><br><b>Requisition Number</b><br>401467825<br><br><b>Shift</b><br>First/Day<br><br><b>Job Family Level</b><br>C<br><br><b>Full Time / Part Time</b><br>FULL TIME<br><br><b>Regular / Temporary</b><br>Regular <br><br><b>Department Name</b><br>Duke OIT - Security Solutions<br><br><b>Minimum Qualifications</b><br>Duke University is an Affirmative Action/Equal Opportunity Employer committed to providing employment opportunity without regard to an individual's age, color, disability, gender, gender expression, gender identity, genetic information, national origin, race, religion, sex, sexual orientation, or veteran status. <br>Duke aspires to create a community built on collaboration, innovation, creativity, and belonging. Our collective success depends on the robust exchange of ideas—an exchange that is best when the rich diversity of our perspectives, backgrounds, and experiences flourishes. To achieve this exchange, it is essential that all members of the community feel secure and welcome, that the contributions of all individuals are respected, and that all voices are heard. All members of our community have a responsibility to uphold these values. <br>Essential Physical Job Functions: Certain jobs at Duke University and Duke University Health System may include essential job functions that require specific physical and/or mental abilities. Additional information and provision for requests for reasonable accommodation will be provided by each hiring department. <p><b>Education</b> </p>Refer to Job Description<br>"}