{"job title": "Data Entry Analyst", "company": "Kforce", "city state": "– Jersey City, NJ", "rating": "3.7", "job description": "<strong>RESPONSIBILITIES:</strong><br><br>Kforce has a client in search of a Data Entry Analyst in Jersey City, New Jersey (NJ).\n<br><br>\nOverview:\n<br>\nThe Cybersecurity &amp; Technology organization's objective is to ensure that the company is able to effectively detect, prevent, and respond to cyber threats against our technology infrastructure. The scope of Cybersecurity comprises detection and monitoring of threats and vulnerabilities, managing security incidents, and evolving our preventive infrastructure to keep ahead of the threat. We accomplish this through strong information security leadership and active collaboration with line of business information risk managers to provide high quality security solutions and services that are focused on improving the Firm's risk posture.\n<br><br>\nThis role sits within the Cyber Control Assessments function, more specifically within the Penetration Testing function. This team conducts in depth security assessments across the firms' applications, infrastructure &amp; Mobile solutions as well as mandated regulatory tests.\n<br><br>\nWe are currently undertaking a transformational project to move our demand, workflow and reporting tools onto new strategic and integrated capabilities. To ensure continued data integrity we need to migrate historical data from the old to the new system and require a data entry analyst to support this effort over a 2-3 month period.\n<br><br>\nKey Tasks:\n\n\n<ul>\n<li> Normalization of multiple data formats</li>\n\n<li> Identification and removal of duplicate entries</li>\n\n<li> Error free entry of data into new data repository</li>\n</ul>\n<strong>REQUIREMENTS:</strong>\n\n<ul>\n<li> Excellent Excel/data mining skills</li>\n\n<li> Self-starter, ability to work with minimal supervision</li>\n\n<li> Attention to detail and ability to accurately migrate data from multiple document/DB formats a must</li>\n\n<li> Knowledge/understanding of cyber security vulnerabilities a plus</li>\n\n<li> SQL experience a plus</li>\n</ul>\n\nCan you picture yourself working for one of -America's Ideal Employers-? Our client has received numerous awards and accolades due in part to their commitment to diversity, veterans, and fostering innovation. They've been named one of Fortune Magazine's -World's Most Admired Companies- of 2018 and are included in the -Top 50 Most Innovative Companies- named by Boston Consulting Group. With on-site training and mentoring, they are committed to your professional development as well.\n<br><br>\nKforce is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status."}