{"job title": "Intern/Co-op Data Analyst - Current Students", "company": "Zynga", "city state": "– San Francisco, CA, United States", "rating": "3.6", "job description": "Intern/Co-op Data Analyst - Current Students (Summer 2019) <div>\n<div>\n<div>\n<div>\n<div><div><div>Intern/Co-op Data Analyst - Current Students (Summer 2019)</div></div></div><div>\n<div><strong>Careers Category:</strong></div><div><div>Students: New Grads &amp; Interns</div></div></div><div>\n<div><strong>Careers Region:</strong></div><div><div>North America</div></div></div><div>\n<div><strong>Careers Location:</strong></div><div><div>San Francisco, CA, United States</div></div></div><div><div><div><strong>ABOUT US</strong>\n<br><br>\nZynga is a leading developer of the world's most popular social games that are played by millions of people around the world each day. We are headquartered in San Francisco and have additional offices in the U.S., Canada, U.K and India. This position is for our Toronto studio. Since our founding in 2007, our mission has been to connect the world through games and delight consumers with social gaming experiences. To-date, more than one billion people have played our games across Web and mobile, including FarmVille, Zynga Poker, Words With Friends, Hit it Rich! Slots and CSR.<br><br><strong>OUR TEAM</strong>\n<br><br>\nWe are looking for a Data Analytics Intern with experience in solving large-scale practical Machine Learning problems. You will be working closely with game teams to identify and formalize problems around user modeling and user experience. You will be responsible for designing and implementing models and algorithms for new problems in Social Gaming and work with the game teams to put those models into production in our games. You will have the opportunity to have impact on the fun that millions of players have every day in Zynga’s network.\n<br><br>\n<strong>ABOUT YOU</strong>\n<ul>\n<li>Execute quantitative analyses that translate data into actionable insights. Provide analytical and data-driven decision-making support for key projects.</li>\n<li>Develop new insights and analyses that inform decisions and help us continue to delight the people playing our games.</li>\n<li>Provide reporting and performance monitoring to game studios using data drawn from diverse sources.</li>\n<li>Must be currently enrolled in an accredited university, working towards a degree in math, statistics, comp sci, economics, engineering or other related quantitative field</li>\n</ul>\n<strong>WHAT WE ARE LOOKING FOR</strong>\n<ul>\n<li>Fluency in the languages of data manipulation (e.g. SQL) and statistical analysis (R or Python)</li>\n<li>Ability to communicate analysis and results to any audience</li>\n<li>Interest in using tools like Tableau or Jupyter Notebooks for creating dashboards, reports and data exploration</li>\n</ul>\n\n</div>\n</div></div><div><div><div>Apply Now</div></div></div><div>\n<div><strong>Jobvite ID:</strong></div><div><div>oril8fwW</div></div></div></div></div>\n </div>\n</div> \n\n<br>"}