{"job title": "Data Scientist I", "company": "AbbVie", "city state": "– North Chicago, USA", "rating": "3.7", "job description": "<div><div><div><div><div><p>Be a part of the revolution to integrate data-driven solutions to enable AbbVie’s approach to better medicines through machine learning (ML) and artificial intelligence (AI). This position will join a rising team of technical experts dedicated to enabling the R&amp;D pipeline – from identifying the right molecular target to supporting patient selection. The Information Research Team is looking for an intellectually curious and experienced data scientist who can easily communicate across disciplines, champion modern approaches, and develop technological solutions in a high-speed environment. This position is responsible for understanding stakeholder’s needs and implementing solutions through various AI techniques like Natural Language Processing (NLP), Neural Networks, and Deep Learning. </p>\n<p> </p>\n<p> </p>\n<p><b>Key Responsibilities Include:</b><b> </b></p>\n<ul>\n<li>\n<div>Independently design and develop business technology solutions to answer scientific or business questions by applying modern machine intelligence and data analysis technologies on complex data sets.</div></li>\n<li>\n<div>Think creatively to solve specific business problems and champion new technologies in achieving project goals.</div></li>\n<li>\n<div>Act as an internal resource in AI/ML. Explore future directions of machine intelligence and keep abreast of the latest developments. Produce high-quality analyses and codebases that extend the capabilities and impact of the team as a whole.</div></li>\n<li>\n<div>Work collaboratively alongside other technical experts to rapidly advance agile, impactful, and cost-effective solutions.</div></li>\n<li>\n<div>Effectively organize and present project objectives and progress. Contribute to technical publications and presentations.</div></li>\n<li>\n<div>Understand and adhere to corporate standards regarding applicable Corporate and Divisional Policies, including code of conduct, safety, GxP compliance, and data security.</div></li></ul>\n \n \n \n\n \n \n \n \n \n <div>\n \n<p><b>Basic:</b></p>\n<ul>\n<li>\n<div>Degree in a quantitative discipline applying mathematical and computational approaches. BS in Computer Science or related field and 5+ years of experience in pharmaceutical or life science preferred. Experience with image classification or natural language processing a plus.</div></li>\n<li>\n<div>Aptitude and proficiency in using AI platforms, technologies, and techniques (e.g. TensorFlow, Apache MXnet, Theano, Keras, CNTK, scikit-learn, H2O, Spark MLlib, etc).</div></li>\n<li>\n<div>Understanding of technical architectures and current state of the market in several technology areas. Comfortable in both Windows and Unix environments.</div></li>\n<li>\n<div>Experience developing, testing and deploying APIs.</div></li>\n<li>\n<div>Passionate about the application of artificial intelligence techniques to tackle difficult technical problems in an agile manner.</div></li>\n<li>\n<div>Demonstrated ability in one or more programming languages like Python, Java, or R.</div></li>\n<li>\n<div>Exceptional ability to clearly communicate ideas and findings to both technical and non-technical audiences.</div></li>\n<li>\n<div>Excellent interpersonal skills - enthusiastic about sharing knowledge and collaborating with other teams</div></li></ul>\n<p><b>Equal Opportunity Employer Minorities/Women/Veterans/Disabled</b></p>\n<p> </p>\n<p></p>\n </div>\n \n \n\n \n <div>\n \n </div>\n \n\n \n </div>\n </div>\n </div>\n\n \n </div>\n\t</div>"}