{"job title": "Research Data Scientist", "company": "Booz Allen Hamilton Inc.", "city state": "– Washington, DC", "rating": "3.7", "job description": "<strong>Job Number: R0033170</strong>\n<br><br>\nResearch Data Scientist<br><br><strong>The Challenge:</strong>\n<br><br>\nAre you excited at the prospect of unlocking the secrets held by a data set? Are you fascinated by the possibilities presented by the IoT, machine learning, and artificial intelligence advances? In an increasingly connected world, massive amounts of structured and unstructured data open up new opportunities. As a data scientist, you can turn these complex data sets into useful information to solve global challenges. Across private and public sectors from fraud detection, to cancer research, to national intelligence you know the answers are in the data.\n<br><br>\nWe have an opportunity for you to use your analytical skills to improve the public and private sector. Youll work closely with your customer to understand their questions and needs, and then dig into their data-rich environment to find the pieces of their information puzzle. Youll develop algorithms, write scripts, build predictive analytics, use automation, apply machine learning, and use the right combination of tools and frameworks to turn that set of disparate data points into objective answers to help senior leadership to make informed decisions. Youll provide your customer with a deep understanding of their data, what it all means, and how they can use it. Join us as we use data science for good in public and private industries.\n<br><br>\nEmpower change with us.\n<br><br>\n<strong>Build Your Career:</strong>\n<br><br>\nAt Booz Allen, we know the power of analytics and were dedicated to helping you grow as a data analysis professional. When you join Booz Allen, you can expect:\n<ul>\n<li>access to online and onsite training in data analysis and presentation methodologies, and tools like Hortonworks, Docker, Tableau, and Splunk</li><li>a chance to change the world with the Data Science Bowlthe worlds premier data science for social good competition</li><li>participation in partnerships with data science leaders, like our partnership with NVIDIA to deliver Deep Learning Institute (DLI) training to the federal government</li>\n</ul>\nYoull have access to a wealth of training resources through our Analytics University, an online learning portal specifically geared towards data science and analytics skills, where you can access more than 5000 functional and technical courses, certifications, and books. Build your technical skills through hands-on training on the latest tools and state-of-the-art tech from our in-house experts. Pursuing certifications? Take advantage of our tuition assistance, on-site bootcamps, certification training, academic programs, vendor relationships, and a network of professionals who can give you helpful tips. Well help you develop the career you want, as you chart your own course for success.\n<br><br>\n<strong>You Have:</strong>\n<br><br>\n-5+ years of experience with programming, including at least some of: database,\n<br><br>\nscripting, Object Oriented Principles (OOP), or high-performance computing (HPC)\n<br><br>\n-Experience with computer vision, deep learning, and image processing\n<br><br>\n-Experience with computer vision tools, techniques, and implementations\n<br><br>\n-Ability to perform innovative machine learning research and software development\n<br><br>\n-Experience with developing software to train leaning algorithms on large and intricate datasets\n<br><br>\n-Ability to effectively communicate results to both technical and non-technical\n<br>\naudiences\n<br><br>\n-Ability to work independently on complex tasks\n<br><br>\n-Secret clearance\n<br><br>\n-MA or MS degree, required\n<br><br>\n<strong>Nice If You Have:</strong>\n<br><br>\n-Experience working with quantum computers to help solve problems in optimization or quantum mechanics\n<br><br>\n-Experience with Cloud systems, including AWS, Azure, and GCP\n<br><br>\n-Experience with developing with source control and dependency management software\n<br><br>\n-Experience with building complex data extraction, transformation, and loading, including ETL into structured databases, data warehouses, and data processing\n<br><br>\n-PhD in physics, CS, mathematics or a similar technical field\n<br><br>\n<strong>Clearance:</strong>\n<br>\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; Secret clearance is required.\n<br><br>\nWere an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change.<br><br>SIG2017\n<br><br>"}