{"job title": "Lead Data Scientist", "company": "Centene Corporation", "city state": "– Saint Louis, Missouri", "rating": "3.1", "job description": "Professional\n<br>\n<div><strong>Position Purpose:</strong></div><br>\n<div>We are working to improve the health of our members by using data science and artificial intelligence to personalize and accelerate the ways we serve our members. We are building predictive and prescriptive models for healthcare services and building the infrastructure to develop and scale model deployment. We are looking for innovative thinkers, life-long learners, and practically minded technophiles to help build the future of healthcare.</div><div>\n\n<ul>\n<li>Responsible for advanced and predictive data analytics from complex and high value projects using big data and data science technology for healthcare innovation and outcomes.</li> <li>Responsible for conducting complex statistical and algorithmic data analyses and development of technologies to improve the health of members.</li><li>Hire, manage, and develop a team of data scientists</li><li>Identify and develop new opportunities for predictive analytics across the business</li><li>Drive full implementation of predictive analytics models from problem definition to production deployment.</li> <li>Design and develop analysis tools that extract, prepare, and analyze data and store analytical results for downstream analysis and reporting for business needs</li><li>Build key data sets to empower operational and exploratory analysis and designing and evaluating experiments monitoring key product metrics, understanding root causes of changes in metrics</li><li>Develop tools to convert unstructured data to partially or fully structured representations as well as process large sets of data to derive statistical information.</li><li>Apply expertise in quantitative analysis, data mining, and the presentation of data to understand how users interact with business products</li><li>Develop of mathematical and statistical models for distinguishing relevant from irrelevant content or events.</li><li>Participate in developing presentations and communicate results of research analysis and findings.</li><li>Participate in the design of automated, operational analytics processes to achieve scale and durability of analysis processes.</li><li>Measure and validate the outcomes of health management programs using R, Python and other tools, to include provider data, claims data, membership data, etc.</li><li>Coordinate analysis and development initiatives and capabilities with health plans.</li><li>Manage multiple projects as assigned and assist with training Data Analysts.</li><li>Responsible for development efforts with technical team liaisons, including gathering business requirements, documentation, testing, delivery and user adoption, and communicate expectations to the Health Plan.</li></ul></div><br>\n\n<div><strong>Education/Experience:</strong></div><div>\n\n<ul>\n<li>Masters degree in Statistics, Mathematics, Computer Science, Informatics, Econometrics, Engineering, or Experimental Science or related degree and 8+ years of experience; or Bachelors Degree in a quantitative discipline and 10+ years of experience in data science capabilities including data mining, predictive modeling, machine learning, statistical modeling, large scale data acquisition, transformation, and cleaning structured and unstructured data.</li> <li>Ph.D. degree in a quantitative discipline preferred.</li> <li>Experience working with large databases, data verification and data management.</li> <li>Experience with SQL and noSQL database technologies, including Oracle, Teradata, MySQL, and MongoDB. Experience with streaming and big data technologies like Kafka and Spark.</li></ul></div><br>\n\n<div>Centene is an equal opportunity employer that is committed to diversity, and values the ways in which we are different. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other characteristic protected by applicable law.</div>"}