{"job title": "Data Scientist I", "company": "Centene Corporation", "city state": "– Chicago, Illinois", "rating": "3.1", "job description": "ProfessionalPosition Purpose: Responsible for advanced and predictive data analytics using big data and data science technology for healthcare innovation. Perform analysis using data science techniques on structured and unstructured data sets, and develop algorithms for targeted business needs.\n<br><br>\nDesigns and develops data models to predict member outcomes or future impact of key member decisions.\n<br>\nDesign and construct analysis tools that extract, and analyze data and store analytical results in an appropriate format for business needs.\n<br>\nConduct exploratory data analysis from complex data sources and build key data sets to support company mission operational analysis.\n<br>\nEvaluate and design experiments to monitor key metrics and identify improvement opportunities.\n<br>\nDevelop of mathematical and statistical models to distinguish relevant content or events and recognize patterns.\n<br>\nParticipate in presentations and communicate results of research analysis and findings.\n<br>\nParticipate in the design of automated, operational analytics processes to achieve scale and durability of analysis processes.\n<br>\nCreate analysis and data reconciliation through SAS, R and other tools, to include healthcare provider data, claims data, membership data.\n<br>\nKnowledge/Experience: Masters degree in Statistics, Mathematics, Computer Science, Informatics, Econometrics, Engineering, Experimental Science with 1+ years of experience or Bachelors degree and 3+ years of quantitative analysis experience in data science capabilities including data mining, predictive modeling, machine learning, statistical modeling, large scale data acquisition, transformation, and structured and unstructured data analysis. Experience with database technologies, including Oracle, SAP, DB2, Teradata, MS SQL Server, SAP HANA, MySQL. Advanced knowledge of machine learning and statistical techniques such as hypothesis testing, regression, decision trees and ensemble techniques like random forests and boosting and the corresponding libraries in R or Python is strongly preferred. Proven ability to quickly research and understand relevant business subjects and new statistical and data modeling techniques appropriate to achieve business goals and priorities is preferred.\n<br><br>\nCentene is an equal opportunity employer that is committed to diversity, and values the ways in which we are different. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other characteristic protected by applicable law."}