{"job title": "Data Scientist - Contract to Hire", "company": "CyberCoders", "city state": "– Austin, TX", "rating": "3.9", "job description": "Data Scientist - Contract to Hire <div>\nIf you are a Data Scientist with experience, please read on!\n<br><br>\nLocated in North Austin, TX (in between downtown and Round Rock, TX) we are a global end-to-end computing solutions company empowering people to do more all around the world!</div>\n\n<br>What's In It for You<div>\nWe offer an amazing compensation package including:\n\n\n<ul>\n<li>A competitive base hourly rate (DOE)</li>\n<li>Strong potential to get converted to full time (we intend this to be full time but start as contract to hire for faster onboarding)</li>\n<li>Full benefits once converted (Medical, Dental, Vision)</li>\n<li>Bonuses!! (when converted)</li>\n<li>Generous PTO/Sick time</li>\n<li>Unlimited growth potential</li>\n<li>-Local candidates or candidates serious about quickly relocating to Austin only!--</li></ul></div>\n\n\nWhat You Need for this Position<div>\nMinimum education requirements, one of the below:\n\n\n<ul>\n<li>Bachelors in Engineering, Computer Science, or Statistics with 2-3 year of industry experience in Data Science</li>\n<li>OR Fresh Masters or Ph.D. graduate in Engineering, Computer Science, or Statistics with internship and/or strong project experience in data science</li>\n</ul>\n\n<strong>Knowledge of:</strong>\n\n\n<ul>\n<li>Solid analytical skills and understanding of descriptive and predictive statistical methods with implementation experience in R and/or Python</li>\n<li>Hands-on experience with datasets (i.e. data extraction, cleaning, analysis and visualization) using R and/or Python</li>\n<li>SQL coding for querying</li>\n<li>Experience building web dashboards for providing insights from data sets</li>\n</ul>\n\n<strong>Nice to have (but not required):</strong>\n\n\n<ul>\n<li>Python for data (Numpy, Pandas, Scikit-Learn)</li></ul></div>\n\n\n<div>\nSo, if you are a Data Scientist with experience, please apply today!</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}