{"job title": "Senior Data Scientist", "company": "ERPi", "city state": "– Washington, DC", "rating": "4.3", "job description": "<div><strong>ERPi is currently seeking a full-time Senior Data Scientist to provide onsite support at our Washington, DC site.</strong>\n<br><br>\n<strong>The Role:</strong>\n<br>\nERPi is seeking experienced consulting leaders to provide thought leadership and consulting advisory support for this counter fraud and data quality program, while also building ERPis overall analytics portfolio. The successful candidate will be a thought leader in statistics and quantitative methods, with demonstrated experience as a data science practitioner. Preferable candidates include experienced leaders within the Federal consulting domain (e.g., Big Four consultancies) with demonstrated ability to build a sustainable business portfolio in analytics.</div><br>\n\n<div><strong>Required Skills and Experience:</strong></div>\n<ul>\n<li>MA/MS in related field (Data Science, Operations Research, Statistics, Applied Mathematics, etc.)</li>\n\n<li>10+ years of relevant experience</li>\n\n<li>Experience using analytical tools, such as R/R Studio, Python, SAS, SQL, or advanced data quality/fraud analysis toolkits</li>\n\n<li>Understanding of statistical concepts such as stochastic processes, Bayesian statistics, and stationarity</li>\n\n<li>Strong analytical skills with a focus on critical thinking, problem-solving, numeric reasoning, and creativity</li>\n\n<li>Ability to think big picture strategy in assessing client business problems/situations and shaping/developing corresponding solutions</li>\n\n<li>Proactive and collaborative leadership style focused on driving client thought leadership as well as developing next tier consulting leaders</li>\n\n<li>Ability to be an innovative, resourceful, and collaborative problem solver</li>\n\n<li>Strong analytical skills with a focus on attention to detail</li>\n\n<li>Strong organization, prioritization, team-work and communication skills</li>\n</ul>\n\n<div><strong>Desired Skills and Experience:</strong></div>\n<ul>\n<li>PhD in a quantitative discipline</li>\n\n<li>3+ years of experience in market shaping activities (e.g. capture and account planning, proposal and white paper development)</li>\n\n<li>Experience working with data quality, fraud detection/prevention, and business improvement initiatives strongly preferred</li>\n\n<li>Experience designing and developing analytic algorithms and techniques in support of robotic processing automation, machine learning, and/or other forms of artificial intelligence</li>\n\n<li>Experience working with Veterans Affairs (VA), Veterans Benefits Administration (VBA), and/or Veterans Health Administration (VHA) preferred</li>\n\n<li>Experience using data visualization tools, such as Power BI or Tableau</li>\n\n<li>Experience with AWS is a plus</li>\n</ul>\n\n<div><strong>Clearance:</strong> Public Trust</div>\n\n<br><strong></strong><div><strong>ABOUT ERPi:</strong>\n<br>\nERPi, a Service-Disabled Veteran Owned Small Business (SVDOSB) specializing in management consulting for the federal government (www.erpi.net). ERPi is undergoing a period of significant growth and offers talented candidates a chance to perform project management, strategic planning, process improvement, quality management, data analysis, and human capital planning on some of the Federal governments largest and most complex business challenges. Our work environment is highly entrepreneurial and is staffed with some of the brightest and most capable technical and management consultants in the industry. ERPis compensation and benefits plan are designed to attract and retain the industrys most capable professionals and executives. We offer tuition reimbursement for selected graduate schools, 401(k) profit sharing, awards to recognize exceptional performance immediately, customized health plans, and charitable donation matching, in addition to competitive base salaries.\n<br><br>\n<strong>EEO Statement:</strong>\n<br>\nIt has been and will continue to be a fundamental policy of ERPi not to discriminate on the basis of race, color, religion, sex, gender, sexual orientation, gender identity or expression, pregnancy, parental status, marital status, citizenship, national origin, age, disability, genetic information, military status, veteran status, or any other protected category with respect to recruitment, hiring, training, promotion, and other terms and conditions of employment.</div>"}