{"job title": "Senior Digital Analytics Manager", "company": "Intuitive Surgical", "city state": "– US-CA-Sunnyvale, California", "rating": "4.6", "job description": "<b>Job:</b> Marketing &amp; New Business Development<br><b>Primary Location:</b> United States-California-US-CA-Sunnyvale<br><b>Schedule:</b> Full-time<br><b>Requisition ID:</b> 181586<br><br><b>Description</b><br><br><p><b><u>Company Description:</u></b></p>\n<p>Who is Intuitive Surgical? The numbers tell an amazing story. Learn more about our company.</p>\n<div></div>Joining Intuitive Surgical means joining a team dedicated to using technology to benefit patients by improving surgical efficacy and decreasing surgical invasiveness, with patient safety as our highest priority. <br><br><b><u>Responsibilities: </u></b> \n<div><br>We are seeking a passionate, hand-on Digital Marketing Analytics professional to lead the development and delivery of digital marketing analytics capabilities and closed loop reporting across multiple, B2B digital properties support sales, marketing, operations, and other business areas. The incumbent will lead delivery of end-to-end digital insights to drive well-informed business decisions that positively impact customer engagement, conversion and growth efforts. You should possess a strong analytical approach to understanding challenges and opportunities, have a strong grasp of digital analytics technology infrastructure and deployment, and possess the ability to translate data into both meaningful and actionable insights that help guide stakeholder decision-making and increase program ROI.</div>\n<div><br></div>\n\n<div>• Implement digital marketing analytics tools, dashboards and cadence of reporting: Lead development of tracking and measurement strategies to aid decision making by tactic, campaign, geo, product, etc. Develop key insights across digital tactics and channels including websites, email, social, search and media. Help our marketing teams better understand our user behavior and how to better connect with them. </div>\n<div>• Consolidate and automate reporting: Develop reporting processes and integrate across the enterprise to maximize opportunities for digital marketing analytics to inform future strategy and decision making. Ritualize performance reports, communications and recommendations to optimize marketing results and efficiencies from digital marketing channels. Collaborate with web, marketing operations and data teams to integrate and simplify marketing analytics delivery via data visualization. Train marketing teams how to leverage marketing data to improve campaign performance. </div>\n<div><br>The ideal candidate will be self-motivated and results driven, demonstrate a real passion for discovery and leaning, optimization, and recognizing and proactively acting on opportunities, and continuously strive to raise the bar on results and expectations. <br><br><br><b><u>Key Functional Areas of Responsibility:</u></b></div>\n<div><br></div>\n\n<div>• Collaborate with cross-functional teams and key stakeholders to identify internal reporting needs and develop analytics &amp; attribution strategy and implementation plan to support business goals and objectives. Deploy, adjust and grow as needed.</div>\n<div>• Define, lead development of and deliver ritualized cadence of reports and standardized dashboards for digital channels and tactics including but not limited to websites, email, social, search and paid media.</div>\n<div>• Synthesize data from multiple sources enhance value of performance reporting capabilities and deliverables.</div>\n<div>• Create and communicate in-depth data findings and insights to influence adoption of digital and optimization of mix of marketing programs across paid, owned, and earned experiences including campaigns, media, content, website, apps, media and social marketing.</div>\n<div>• Collaborate with marketing and sales to connect digital analytics with Marketing Automation and CRM to deliver closed loop reporting including revenue impact.</div>\n<div>• Lead creation of, implementation and governance of attribution &amp; measurement systems for digital programs, content marketing and lifecycle management.</div>\n<div>• Coordinate with colleagues and vendors to drive refinement or creation of required systems, workflows and business practice disciplines.</div>\n<div>• Train marketing teams to access, read, understand and embrace digital metrics and tools.</div>\n<div>• Host regular consultative sessions with key stakeholders at multiple levels to share insights and recommendations to improve business results.</div>\n<div>• Create and maintain internal and external benchmarks.</div>\n<div>• Provide ad hoc reporting as needed.</div>\n<div>• Set-up attribution models to measure and analyze multi-channel effectiveness.</div>\n<div>• Identify and share key trends and opportunities.</div>\n<div> </div><b>Qualifications</b><br><br><b><u>Job Requirements:</u></b> \n<div><br></div>\n\n<div>• 5+ years of experience in B2B digital marketing and metrics</div>\n<div>• Proven experience creating and implementing digital measurement discipline and customer insights in B2B environment </div>\n<div>• Demonstrated in-depth, up to date knowledge of digital marketing and measurement</div>\n<div>• Experience using various digital measurement tools and technologies such as: Adobe Analytics, Google Analytics, Conductor, DMPs, etc.</div>\n<div>• Outstanding ability to think creatively and strategically, identify opportunities, and identify and resolve problems</div>\n<div>• Strong problem solving, business analysis and quantitative skills</div>\n<div>• Demonstrated proficiency in Microsoft Excel and Data Mining</div>\n<div>• Detail-oriented, organized, and excellent verbal and written communication skills</div>\n<div>• Ability to foster strong, professional relationships across all levels</div>\n<div>• BS/BA degree required.</div>\n<div><br><br>We are an AA/EEO/Veterans/Disabled employer.<br>We will consider for employment qualified applicants with arrest and conviction records in accordance with fair chance laws.<br></div>\n<div><br></div>\n<div><br></div>"}