{"job title": "Director of Analytics and Data Science", "company": "MasterClass", "city state": "– San Francisco, CA", "rating": "4.6", "job description": "<strong>Who we are:</strong>\n<br><br>\nMasterClass is transforming online education by enabling anyone in the world to learn from the very best. We are deconstructing what makes an actor able to cry on demand, how an athlete defies gravity, and what it takes to write a bestseller. Our online learning content is available to students anywhere anytime, which supports our mission to democratize education.\n<br><br>\nWe are a quickly growing VC-funded startup based in San Francisco and have created online classes taught by famous mastersSerena Williams, James Patterson, Annie Leibovitz, Usher, Christina Aguilera and many more to come.\n<br><br>\nSince launching in 2015, we are growing our team. Apply now to find out more about what we are doing behind the scenes.\n<br><br>\n<strong>What we are looking for:</strong>\n<br><br>\nMasterClass is seeking a Director of Analytics and Data Science to build and lead a new Analytics &amp; Data Science team. As the founding member of the team, you will have the opportunity to establish how we process and analyze data throughout the company. You will build your team of analysts and data scientists from the ground up. You will own all recurring reporting and business intelligence systems and work with leaders throughout the company. This is a strategic role for MasterClass as data is at the center of our operations and decisions.\n<br><br>\n<strong>Responsibilities of the role:</strong>\n\n<ul>\n<li>You will be responsible for all recurring reporting across the business</li>\n<li>You will be responsible for driving data insights for various teams</li>\n<li>You will be responsible for driving our data science strategy, including creating recommendation engines, predictive churn models, and other high leverage models</li>\n<li>You will partner with other leaders across the company, including product, engineering, marketing, strategy &amp; insights, operations, and content to understand their analytical needs and then develop the reports/dashboards that meet those needs</li>\n<li>You will build-out a team of analysts and data scientists who will partner with various organizations on their specific needs</li>\n<li>You will be selecting and implementing the visualization and reporting tools for the organization &amp; defining the processes from the ground up</li>\n<li>You will drive ad-hoc analysis and reporting when needed</li>\n</ul>\n<strong>Requirements:</strong>\n\n<ul>\n<li>You have 7+ years of experience in analytics with increasing responsibility and strong track record of managing teams</li>\n<li>You have previous experience in SQL and R or Python skills</li>\n<li>You are excited to join a fast growing team where data is at the center of what we do</li>\n<li>You are as comfortable talking deeply about data/statistics as you are with describing the results to executives</li>\n<li>You thrive on empowering your team and view the team's success as your own</li>\n<li>Experience in e-commerce and/or subscription media businesses is a major plus</li>\n</ul>\n<strong>At MasterClass, we believe we put our best work forward when our employees bring together ideas that are diverse in thought. We are proud to be an equal opportunity workplace and are committed to equal employment opportunity regardless of race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, genetic information, veteran status, gender identity or expression, sexual orientation, or any other characteristic protected by applicable federal, state or local law. In addition, MasterClass will provide reasonable accommodations for qualified individuals with disabilities. If you have a disability or special need, we would like to know how we can better accommodate you.</strong>"}