{"job title": "RESEARCH DATA SPECIALIST", "company": "Moffitt Cancer Center", "city state": "– Tampa, FL", "rating": "3.7", "job description": "<div>Location\n<br>\n <div>Magnolia Campus, 12902 Magnolia Drive, Tampa, FL 33612</div>\n </div><br>\n\n<div>\nDepartment\n<br>\n <div>GYN Data Mgmt</div>\n </div><br>\n\n<div>\nEmployment Status\n<br>\n <div>Full Time</div>\n </div><br>\n\n<div>\nHours per Pay Period\n<br>\n <div>40</div>\n </div><br>\n\n<div>\nShift\n<br>\n <div>Day Shift</div>\n </div><br>\n\n<div>\nHours\n<br>\n <div>Mon to Frid 8 to 4:30</div>\n </div><br>\n\n<div>\nEducation\n<br>\n <div>High School/GED</div>\n </div><br>\n\n<div>\nJob Details\n<br>\n <div>\n<div>\n<div>Moffitt Cancer Center is internationally recognized for our focus on personalized cancer care and translational research. The mission of Moffitt is clear, focused, and fully stated in nine words, \"To contribute to the prevention and cure of cancer.\" With a tradition of excellence that began with the first patient admission in 1986, dedicated Moffitt physicians, scientists, and staff members have remained committed to excellence in an atmosphere characterized by kindness, caring, and hope.</div>\n </div><br>\n\n<div>The Clinical Trials Office-GYN Data Management program is looking for a Research Data Specialist I.\n<br><br>\nH. Lee Moffitt Cancer and Research Institute is a modern facility in Tampa, Florida. We strive to be the leader in understanding in the complexity of cancer through team science and applying those insights for human benefits. Be part of the cure by joining Moffitt's team of over 800 research faculty scientists, career staff scientists, postdocs, graduate students and support staff dedicated to cancer research.\n<br><br>\n<strong><u>Position Highlights:</u></strong>\n<ul>\n <li>Responsible for entering data pertaining to clinical trials accurately and timely. </li><li>Works under the direction of senior staff and manager to assess data workload and to ensure all required data is collected and entered correctly. </li><li>Assists with scheduling of patients.</li>\n</ul>\n<strong><u>Ideal Candidate:</u></strong>\n<ul>\n <li>Engaged, organized individual with strong critical thinking skills who has the ability to work efficiently under pressure. </li><li>Highly motivated, shows initiative, is proactive and able to work independently as well as in a team.</li>\n</ul>\n<strong><u>Responsibilities:</u></strong>\n<ul>\n <li>Must be able to interpret components of medical records, including pathology, radiology, history and physical, operative and discharge reports. </li><li>Be familiar with confidentiality requirements and be able to maintain security of subject data. </li><li>Generate routine reports as needed from the database.</li>\n</ul>\n<strong><u>Credentials and Qualifications:</u></strong>\n<br><br>\n· High School diploma/GED required.\n<br><br>\n· Associate's degree preferred\n<br><br>\n· A minimum of one (1) year experience in using automated data processing techniques; experience using data base software programs.\n<br><br>\n· Medical terminology; components of medical record\n</div>\n </div>\n </div><br>\n\n<div>\nEqual Employment Opportunity\n<br>\n <div>Moffitt Cancer Center is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, or protected veteran or disabled status. We seek candidates whose skills, and personal and professional experience, have prepared them to contribute to our commitment to diversity and excellence.</div>\n </div>\n\n<br>"}