{"job title": "Data Scientist: NLP Specialist", "company": "pymetrics", "city state": "– New York, NY", "rating": "4.9", "job description": "Using neuroscience-based assessments and machine learning algorithms, pymetrics is reinventing the recruiting industry by matching candidates to jobs where they are most likely to succeed. We are leading the charge in an evolving industry and growing our amazing team to support the mission of using data to unleash one's full potential.\n<br><br>\nWe are looking for a talented data scientist to develop NLP algorithms for gathering insights spanning all stages of the hiring process from resumes to interviews. The ideal candidate would bring experience building scalable algorithms using audio and text data, have the ability to communicate with a bright team from diverse backgrounds, and be able to tackle interesting problems independently and with scientific rigor.\n<br><br>\nResponsibilities:\n<ul>\n <li>Plan, implement and improve new and existing data products relating to hiring, including resume review, behavioral assessment and video interviews</li> <li>Build models to parse documents for client-relevant information</li> <li>Advise product and science teams on use of text analysis in future job assessments</li> <li>Extract insights from audio channels of video interviews</li> <li>Generate aggregated reports from text and audio data (e.g., the typicality of words in a work sample)</li> <li>Collaborate with and train other members of the data science team</li>  <li>Write production level code for practical application of data products</li> <li>Interact with data scientists, analysts, engineers and product managers on other data products implemented at pymetrics, including computer vision, behavioral assessment, statistical analysis and clustering techniques</li>\n</ul>\n<strong>Requirements</strong>\n<ul>\n <li>MS/PhD preferred</li> <li>2+ years experience in data science preferred</li> <li>Experience with making predictions and extracting insights from audio/text data</li> <li>Practical knowledge of Python and its scientific libraries SciPy, Scikit, Pandas, and NumPy, with extensive knowledge of programming best practices.</li> <li>Familiarity with common tools for NLP, especially NLTK and Word2Vec</li> <li>Solid foundation in machine learning models, processes, and theories, with the ability to evaluate different algorithmic approaches</li> <li>Specific knowledge of foundational techniques within NLP, such as text processing, document classification, sentiment analysis, etc.</li> <li>Working knowledge of statistics and probability (statistical inference, Bayesian statistics).</li> <li>Embodiment of our core company values of motivation, positivity, curiosity, humility and integrity, and buy-in for our company mission of eliminating bias in hiring</li>\n</ul>\nNice to Haves:\n<ul>\n <li>Knowledge of psych/cogsci/neuroscience research</li> <li>Interest in issues of transparency and fairness in AI</li> <li>Experience with deep learning using python</li> <li>Eye for data visualization and presentation of data-driven insights</li>\n</ul>\n<strong>Benefits</strong>\n<ul>\n <li>Health care plan (medical, dental &amp; vision)</li> <li>Unlimited paid time off (including vacation, sick &amp; public holidays)</li> <li>Family leave (maternity, paternity)</li> <li>401k</li> <li>Team budget for training &amp; development</li>  <li>Stock option plan</li> <li>Commuter transportation reimbursement</li> <li>Fun, diverse and intellectually eager coworkers</li> <li>Team happy hours and retreats</li> <li>Dog-friendly workplace</li>\n</ul>"}