{"job title": "Data Scientist: Computer Vision Specialist", "company": "pymetrics", "city state": "– New York, NY", "rating": "4.9", "job description": "Using neuroscience-based assessments and machine learning algorithms, pymetrics is reinventing the recruiting industry by matching candidates to jobs where they are most likely to succeed. We are leading the charge in an evolving industry and growing our amazing team to support the mission of using data to unleash one's full potential.\n<br><br>\nWe are looking for a talented data scientist to develop computer vision algorithms to gather insights from recorded job interviews, in addition to contributing to broader data science products. The ideal candidate would bring experience building computer vision projects to scale, have the ability to communicate with a bright team from diverse backgrounds, and be able to tackle interesting problems independently and with scientific rigor.\n<br><br>\nResponsibilities:\n<ul>\n <li>Plan, implement and improve new and existing data products relating to video interviewing</li> <li>Build predictive models that operate independently or interact with existing models to predict job relevant skills from video interviews</li> <li>Advise engineering teams on best practices in regards to video data pipelines for optimization of computational processing time, data storage and user interfaces</li> <li>Generate real-time insights from video data, such as keyframing video for moments of interest to interviewers</li> <li>Generate aggregated reports from video data, such as the frequency of gestures or expressions in video</li> <li>Collaborate with and train other members of the data science team</li> <li>Write production level code for practical application of data products</li> <li>Interact with data scientists, analysts, engineers and product managers on video and other data products, including NLP, behavioral assessment, statistical analysis and clustering techniques</li>\n</ul>\n<strong>Requirements</strong>\n<ul>\n <li>MS/PhD preferred</li> <li>2+ years experience in data science preferred</li> <li>Experience with making predictions and extracting insights from video data</li> <li>Practical knowledge of Python and its scientific libraries SciPy, Scikit, Pandas, and NumPy, with extensive knowledge of programming best practices.</li> <li>Extensive knowledge of core computer vision libraries (e.g. OpenCV) and databases (e.g. ImageNet)</li> <li>Knowledge of computer vision modelling techniques and at least one major framework for deep learning in python (e.g., Tensorflow or PyTorch)</li> <li>Solid foundation in general machine learning models, processes, and theories, with the ability to evaluate different algorithmic approaches.</li> <li>Working knowledge of statistics and probability</li> <li>Embodiment of our core company values of motivation, positivity, curiosity, humility and integrity, and buy-in for our company mission of eliminating bias in hiring</li>\n</ul>\nNice to Haves:\n<ul>\n <li>Knowledge of psych/cogsci/neuroscience research</li> <li>Interest in issues of transparency and fairness in AI</li> <li>Experience in software or database engineering</li> <li>Eye for data visualization and presentation of data-driven insights</li>\n</ul>\n<strong>Benefits</strong>\n<ul>\n <li>Health care plan (medical, dental &amp; vision)</li> <li>Unlimited paid time off (including vacation, sick &amp; public holidays)</li> <li>Family leave (maternity, paternity)</li> <li>401k</li> <li>Team budget for training &amp; development</li>  <li>Stock option plan</li> <li>Commuter transportation reimbursement</li> <li>Fun, diverse and intellectually eager coworkers</li> <li>Team happy hours and retreats</li> <li>Dog-friendly workplace</li>\n</ul>"}