{"job title": "Data Architect", "company": "Red Ventures", "city state": "– Charlotte, NC", "rating": "2.9", "job description": "A Data Architect at Red Ventures has the end-to-end vision of conceptual, physical, and logical storage of data and how analysts, applications, and data scientists consume it. We'll look to you to recognize and identify patterns in data relationships from disparate systems and create data management solutions. You will design and build scalable infrastructure platforms to collect and process large amounts of structured and unstructured data that will be consumed in near real-time.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nOn a day-to-day basis, you will work on a team responsible for all aspects of Red Ventures' data including timeliness, accuracy, consumption, and security. You will work on automating data pipelines, creating data models, and monitoring and ensuring performance. You will communicate with business analysts, data scientists, and business leaders to understand and meet their data needs. You will be tasked with identifying and executing on best practices. You will work on a team with a focus on continuous learning and will have an opportunity to provide mentor and guidance. You will work on designing and implementing Red Ventures' next generation data solution.\n<br><br>\n<strong>Preferred Background</strong>\n\n<ul>\n<li>Experience in application development, ETL development, report development and/or other data warehouse projects to bring a well-rounded perspective of the big picture</li> \n\n<li>Thorough understanding of dimensional modeling and data warehouse</li>\n<li>Experience with Query, Database, Cube tuning</li>\n<li>Knowledge of Big Data technologies</li>\n<li>An in-depth understanding of algorithms</li> \n</ul>\n<strong>T</strong><strong>echnology stack</strong>:\n\n<ul>\n<li>Scala and Spark</li>\n<li>NoSQL, event streams</li>\n<li>Microsoft BI Stack: Sql Server 2014 and 2016, SSIS, SSAS (cubes and tabular), Power BI, SSRS</li>\n<li>MySQL</li>\n<li>Both on-premise and in the cloud</li>\n</ul>\n<strong>About Red Ventures:</strong>\n<br><br>\nRed Ventures is a multi-billion-dollar portfolio of digital companies that specializes in bringing consumers and brands together. Through bespoke technology, integrated digital commerce and sales, distinguished partnerships, data science and original content from the company's proprietary brands and marketplaces, Red Ventures provides better end-to-end consumer experiences throughout the buying cycle. Headquartered in the Charlotte metro area, Red Ventures has more than 3,600 employees globally in offices across the US, UK and Brazil"}