{"job title": "Data Modeler", "company": "Trinity Industries", "city state": "– Dallas, TX", "rating": "3.3", "job description": "<strong>Description</strong>\n<br>\n<div><strong>Trinity Industries</strong> is seeking a <strong>Data Modeler</strong> for our <strong>Dallas, TX</strong> office. The Data Modeler will responsible for developing a high performance data warehouse for use with various Business Intelligence tools. The position will drive the development of the data warehouse from several sources and assist in the development and roll out of the Business Intelligence capability at Trinity.</div><br>\n<div><strong>What you'll do:</strong></div><br>\n<div>\n\n<ul>\n<li>Work with the Business Intelligence team to implement data strategies, build data flows and develop conceptual data models.</li><li>Create logical and physical data models using best practices to ensure high data quality and reduced redundancy specifically in a Qlik environment</li><li>Optimize and update logical and physical data models to support new and existing projects.</li><li>Maintain conceptual, logical and physical data models along with corresponding metadata.</li><li>Develop best practices for standard naming conventions and coding practices to ensure consistency of data models.</li><li>Recommend opportunities for reuse of data models in new environments.</li> <li>Perform reverse engineering of physical data models from databases and SQL scripts.</li> <li>Evaluate data models and physical databases for variances and discrepancies.</li><li>Validate business data objects for accuracy and completeness.</li><li>Analyze data-related system integration challenges and propose appropriate solutions.</li><li>Develop data models according to company standards.</li><li>Guide System Analysts, Engineers, Programmers and others on project limitations and capabilities, performance requirements and interfaces.</li><li>Review modifications to existing software to improve efficiency and performance.</li><li>Examine new application design and recommend corrections if required.</li><li>Lead the roll out of existing Business Intelligence tools and propose new tools focused on self-service capabilities within the user community.</li></ul></div>\n\n<br><strong>Qualifications</strong>\n<br>\n<strong></strong><div><strong><div>What you'll need:</div>\n<br>\n</strong>\n\n<ul>\n<li>Bachelor of Science degree in Software Engineering, Computer Science, Electrical Engineering or an equivalent technical field or equivalent work experience</li><li>7+ years system integration and data management within a software development/engineering environment preferred</li><li>5+ years data modeling and data warehouse experience</li><li>1 year of Agile development</li><li>3+ years with the development and management of QlikView / Qlik Sense</li><li>3+ years in data integration across disparate application environments (Microsoft, Unix, AS400, cloud, Oracle, composite services)</li><li>5+ year experience with SQL Server or Oracle with strong SQL skills</li><li>1 year experience with data modeling tools such as Erwin.</li><li>3+ years with various data warehouse concepts (Star, Snowflake, Columnar vs. row, In-Memory)</li><li>Clear communicator (written and verbal) to ensure ability to capture data requirements and use cases</li><li>Demonstrated strong analytical/problem-solving skills</li><li>3+ years developing and implementing analytics and reporting</li><li>Thrive in a fast moving, multi-tasking environment</li></ul></div>\n\n<br>"}