{"job title": "Senior Data Scientist", "company": "VTS3", "city state": "– New York, NY", "rating": "5.0", "job description": "We have a great contract opportunity for a <strong>Senior Data Scientist Consultant in New York City!</strong> The candidate should be an experienced Senior Data Scientist with a minimum of 8 years of experience and 10 years in IT with expert knowledge in applying data mining techniques, performing data and statistical analysis, building high-quality analytics and prediction platforms to support our business processes. Good leadership skills required. <u>The consultant should have experience from project initiation to implementation.</u> Responsible for applying innovative analytical and research approaches to help Major Utility Company tackle complex and strategically important problems.\n<br><br>\n<strong>This is an hourly position with opportunity for overtime.</strong>\n<br><br>\n<strong> **All Candidates Must be Authorized to Legally Work in the US Without Sponsorship**</strong>\n<br><br>\n<strong>Mandatory Qualifications:</strong>\n\n<ul>\n<li>Must have a minimum of 7 years' of relevant work experience in applied quantitative and qualitative analysis. Utility industry experience preferred.</li> \n\n<li>Candidate must have a proven track record leading the development and delivery of creative, advanced, actionable analytic products and services</li>\n<li>Must have experience managing vendor engagements to understand business problems/opportunities, translating needs into analytic projects and applying results. The applicant must have a command of analytics methods, tools and data wrangling techniques</li>\n<li>Must demonstrate the ability to quickly acquire in-depth knowledge of new IT technologies.</li> \n\n<li>Must have the ability to present technical topics to non-technical audience and have a command of analytic methods, tools, and data wrangling techniques</li>\n<li>Must demonstrate the ability to quickly acquire in-depth knowledge of new IT technologies. Must have the ability to present technical topics to non -technical audience and have demonstrated ability to handle multiple assignments and changing priorities</li> \n</ul>\nTechnical Skills Needed:\n\n<ul>\n<li>Strong ability to code in Python (5+years)</li>\n<li>Have full stack experience in data cleaning, collection, aggregation, analysis, and visualization</li>\n<li>Experience in real-time and streaming data process and machine learning model</li>\n<li>Strong understanding and experience on Neural Network/Deep Learning/XGboost and other machine learning methods</li>\n<li>Knowledge and hands-on experience on GPU calculation like CUDA</li>\n<li>Experience with R, SPark, Hadoop/MapReduce and machine learning frameworks preferred</li>\n<li>Experience on NoSQL database and Big Data processing</li>\n<li>Experience in data visualization, like Tableau/PowerBI</li>\n</ul>\n<strong><em>Additional Information:</em></strong>\n<br><br>\n<u><strong>$500 Referral Fee Program</strong></u>\n<br><br>\nEarn extra cash while helping your friends!\n<br><br>\nVTS3 will pay you up to $500.00 for each person you refer to us and we place into a contract or full-time position. If you know someone who's a good candidate for any of our openings, use the \"Refer a friend\" button on this page and earn extra cash.\n<br><br>\nThe rules are simple:\n\n<ul>\n<li>The referral must be made by using the \"Refer a friend\" button on this page</li>\n<li>The person you refer must be placed within 90 days of being referred</li>\n<li>The person you refer must complete 480 billable hours</li>\n<li>Cannot be someone we already have on our team or are currently working with</li>\n</ul>\n<u><em><strong>VTS3 ONLY works directly with candidates.\n<br>\nAll candidates registered must be able to legally work in the United States.</strong></em></u>"}