{"job title": "Data Scientist", "company": "Arby's", "city state": "– Atlanta, Georgia", "rating": "3.4", "job description": "PURPOSE OF THE POSITION:\n<br><br>\nThis position is critical to understanding drivers of Arby's current and future business performance in order to develop strategies and recommendations.\n<br><br>\nThe Data Scientist will own the development of a sales forecasting model using numerous existing datasets. I.e., how much of Arby's sales performance is impacted by variables such as media spend, promotions, competitive data, year-on-year trends, external variables, and macroeconomic factors. The Data Scientist will also own the modeling and forecasting of additional key business metrics.\n<br><br>\nThe outputs from these models will be used to develop business strategies and recommendations.\n<br><br>\nKEY RESPONSIBILITIES:\n\n<ul>\n<li>Statistical modeling -- develop models to describe the relationship between any business-relevant independent and dependent variables\n\n</li><li>Sales forecast development - analyze all available existing data sets to determine which variables are more predictive of Arby's sales performance\n\n</li><li>Identification of opportunities for process improvement and innovative solutions to business challenges\n\n</li><li>Data cleansing/processing -- work with IT to create automated processes to ingest and cleanse data from multiple data sources and vendors\n\n</li><li>Data management -- work with IT to develop and maintain databases that support marketing and sales analysis\n</li></ul>\nEDUCATION QUALIFICATIONS:\n<br><br>\n<em>Required Minimum</em>: An undergraduate degree in Computer Science, Statistics, Engineering, Science, or Mathematics\n<br><br>\n<em>Preferred</em>: A graduate degree, Master's or PhD, in Computer Science, Statistics, Engineering, Science, or Mathematics\n<br><br>\nEXPERIENCE QUALIFICATION:\n<br><br>\n<em>Required Minimum:</em> 7+ years of practical experience with data mining and analytics, database structure and ETL, predictive modeling, machine learning, and statistical programming languages\n<br><br>\nREQUIRED KNOWLEDGE, SKILLS OR ABILITIES:\n\n<ul>\n<li>Deep expertise with statistical programming languages (e.g., R, python), database querying (SQL), and machine learning\n\n</li><li>Expertise with fundamental statistical analysis\n\n</li><li>Prior experience with non-theoretical \"messy\" datasets, i.e., datasets with missing values, inconsistent formatting, etc.\n\n</li><li>Ability to solve problems using data and clearly communicate the results\n\n</li><li>Personal integrity, humility, an appreciation for the power of true teamwork, and a sense of humor\n\n</li><li>Passion for the restaurant industry and desire to train in our restaurants to learn operations. A strong desire to help shape the future at Arby's\n\n</li><li>Minimal travel required\n</li></ul>"}