{"job title": "Data Scientist", "company": "CALNET", "city state": "– St. Louis, MO,US", "rating": "3.6", "job description": "Careers &gt; Jobs List &gt; Job Detail<br>\n\n<div> \n<strong>\n<br>\n<br>\n Data Scientist</strong><br>\n\n<div>\n<div> <strong>Job Code</strong> - JC1237 <strong>Job Location</strong> - Various - Springfield, VA; St. Louis, Mo,US</div> <div> <strong>Division</strong> - Intelligence <strong>Security Clearance</strong> - Top Secret/SCI</div> <div> <strong>Skills</strong> -</div> </div>\n </div>\n\n<br><div>Founded\n<br>\nin 1989, CALNET, Inc. has become one of the fastest growing privately held\n<br>\ncompanies in the Technology, Intelligence Analysis, and Language Services\n<br>\nconsulting arena. Headquartered in Reston, VA and with a branch office in San Diego, CALNET employees deliver true\n<br>\nvalue to our customers by employing best practices, world class technologies\n<br>\nindustry expertise in every project. CALNET is a CMMI-Level III (SVC and DEV),\n<br>\nISO 20000 and ISO 9001:2008 certified.\n<br><br>\nWe are currently looking for experienced, professional <strong>Data Scientist</strong> with the following skill levels:\n\n\n<ul>\n<li><strong>Journeyman</strong> - Minimum of 3-10 years of experience</li> \n\n<li><strong>Senior</strong> - Minimum of 10-20 years of experience</li> \n\n<li><strong>Expert</strong> – 20+ years of experience</li>\n</ul>\n\n<strong>Job Requirements</strong>\n\n<ul>\n<li><div>Current and active TS/SCI security clearance</div> </li>\n<li>\nConceive and prepare thorough, well-articulated tactical or strategic data science products (e.g. technical articles, years of this experience visualizations, graphics, intelligence reports)that summarize the methods and results of data science solutions.</li>\n<li>\nDesign a range of research projects, data collection and methodologies.</li>\n<li>\nIdentify, retrieve, manipulate, relate and/or exploit multiple structured data sets from various sources.</li>\n<li>\nIdentify problems to which data science can be applied and initiate appropriate solutions.</li>\n<li>\nIdentify and appropriately evaluate a wide range of existing methods, models and algorithms in familiar domains for a variety of mission driven problems; recognizing the capabilities and limitations of methods.</li>\n<li>\nDemonstrated good oral and written communication skills.</li>\n</ul>\n\nThis opportunity is\n<br>\nlocated in the Washington, DC metro area. To be considered for this\n<br>\nopportunity, please send your Word resume to helena@calnet.com.\n<br><br>\nCALNET, Inc. offers\n<br>\na competitive salary and a generous benefits package. This package includes\n<br>\nmedical, dental, vision, life, short and long term disability insurances, a\n<br>\n401(k) retirement savings plan, and generous leave time.\n<br><br>\nCALNET, Inc. is an\n<br>\nEqual Opportunity Employer; all qualified applicants are encouraged to apply.www.calnet.com\n<br><br>\n<strong>EEO/M/F/D/V</strong></div>\n\n<br>"}