{"job title": "Data Scientist", "company": "Crossover Health", "city state": "– San Clemente, California", "rating": "2.5", "job description": "Description<br><br><strong>About Us:</strong>\n<br><br>\nCrossover Health is a healthcare organization attempting to redefine how healthcare is practiced, delivered, and financed. We design and deliver the inspiring environments, experiences, and relationships that mobilize people to engage and excel in their health. A passionate commitment to the patient experience Creates the magic behind what we do. Crossover Health is currently seeking an experienced Data Scientist Il for our corporate office in Aliso Viejo.\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nDesigns, develops and programs methods, processes, and systems to consolidate and analyze unstructured, diverse \"big data\" sources to generate actionable insights and solutions for client services and product enhancement. Constructs forecasts and advance modeling to recommend strategic tactical plans based on business data and market knowledge. Interacts with product and service teams to identify questions and issues for data analysis and experiments. Develops and codes software programs, algorithms and automated processes to cleanse, integrate and evaluate large datasets from multiple disparate sources. Identifies meaningful insights from large data and metadata sources, interprets and communicates insights and findings from analysis and experiments to product, service, and business managers.\n<br><br>\n<strong>Job Duties:</strong>\n<ul>\n<li>Build models, quantitative analysis and design queries for all clients and internal teams. Add incremental value and extend capabilities of the packages</li><li>Manage weekly, monthly, and quarterly reporting packages for all clients and internal</li><li>teams.</li><li>Manage population health analysis program based on claims and other data sets. Be able to translate gaps in care into clinically actionable information.</li><li>Help design and implement online version of reporting tools</li><li>Collaborate with clinical team on population health workflows.</li><li>Manage reporting process to help clinicians track and follow at-risk patients.</li><li>Inform, influence, support, and execute Crossovers stakeholders.</li>\n</ul>\n<strong>Required Education, Experience and Skills:</strong>\n<br><br>\n<strong>Education and Experience</strong>\n<ul>\n<li>Bachelor's Degree in Mathematics, Physics, Economics or Computer Science, or</li><li>equivalent experience. Master's Degree preferred.</li><li>Minimum of 5 years of experience in data science and/or data analytics.</li>\n</ul>\n<strong>Skills</strong>\n<ul>\n<li>Experience with analytic software Python (libraries such as Pandas, Scikit-learn and SciPy) as well as data visualization experience (Tableau and Keynote).</li><li>Experience in data extraction, transformation and loading. . Must have excellent Excel and data analytics skills.</li><li>Must have a passion for organizing and representing data in valuable ways.</li><li>Demonstrated ability to quantify and present results in laymen's terms.</li><li>Must have the ability to work with complex data sets from multiple sources.</li><li>Demonstrated ability to represent healthcare return on investment and compare patient cohorts by multiple groupings (e.g., disease, zip, age, gender, health plan, etc.)</li><li>Must have working understanding of the healthcare industry.</li><li>Working knowledge of Salesforce or similar CRM to manage workflows.</li><li>Must have excellent interpersonal skills; especially the ability to present complex ideas in a fun and creative format.</li><li>Ability to quickly learn new procedures and processes.</li><li>Strong organizational and follow-through.</li><li>High level of ownership, accountability and initiative</li><li>Comfort and efficiency in multi-tasking, unflappable in times of high stress, and comfortable with ambiguity</li>\n</ul>\n<strong>Reporting</strong>\n<br><br>\nThe Data Scientist II reports to the Manager, Business Intelligence."}