{"job title": "Data Scientist", "company": "Directly Software", "city state": "– San Francisco, CA", "rating": "4.8", "job description": "<strong>Company</strong>\n<br><br>\nAt Directly, we believe the fundamental nature of work is changing from fixed to fluid, as AI and the gig economy transform how people and companies work in the next economy. We're leading this shift with an enterprise platform that changes the way companies deliver customer service. Our platform helps companies like Airbnb, Autodesk, LinkedIn, Microsoft, Pinterest, SAP, and Samsung look beyond the traditional contact center and deliver better answers to customers in the moments that matter. We're based in San Francisco and backed by top firms including Microsoft Ventures, True Ventures, Costanoa Ventures, and Northgate. www.directly.com\n<br><br>\n<strong>Role</strong>\n<br><br>\nWe are looking for new members of our Data Science team to help build augmented intelligence systems that allow humans and machines to work together to redefine customer support. Our work spans many disciplines, such as information retrieval, natural language processing, and machine learning. Directly was granted several patents on our innovative technology, and we are constantly expanding the science and inventing new processes for optimizing the benefits of our platform.\n<br><br>\n<strong>Core Responsibilities</strong>\n\n<ul>\n\n\t\n<li>Conduct ad-hoc analysis on the data set and present patterns and trends to the team.</li>\n\n\n\n<li>Extract, combine, clean, pre-process, and analyze a corpus of questions and answers from internal and external data sets.</li>\n\n\n\n<li>Perform feature extraction for the data set and create a training set for a classifier model.</li>\n\n\n\n<li>Optimize hyperparameters of a classifier from an existing machine learning library.</li>\n\n\n\n<li>Analyze performance of a data product and come up with suggestions for scaling it.</li>\n\n\n\n<li>Suggest enhancements for a data product and articulate them from a systems approach.</li>\n\n\n\n<li>Find potential opportunities for building new capabilities into the product as well as develop prototypes of new internal tools to make our operations more efficient.</li>\n\n\n\n<li>Help the operations team to improve the service we provide to our customers.</li>\n\n\n\n<li>Collaborate with Engineering to ship new capabilities of data products to production.</li>\n\n\n\n<li>Work with Data Engineering and DevOps teams to improve data pipelines and analytics.</li>\n\n\n\n<li>Investigate if an algorithm from a scientific paper can be applied to our domain.</li>\n\n\n\n<li>Implement a new machine learning algorithm in TensorFlow and evaluate its efficacy.</li>\n\n\n\n<li>Work on a patent application and/or conference submissions.</li>\n\n\n\n</ul>\n<strong>Requirements</strong>\n\n<ul>\n\n\t\n<li>Academic background in a technical/quantitative field (graduate degree a plus) or equivalent experience.</li>\n\n\n\n<li>Working knowledge of statistics as pertains to machine learning, such as distributions, statistical testing, regression, etc.</li>\n\n\n\n<li>Proficiency in using SQL with several major DBMS and DW engines.</li>\n\n\n\n<li>Experience with a variety of Big Data technologies, distributed machine learning and computing frameworks (S3, Spark, Hadoop, Elasticsearch, TensorFlow, etc.).</li>\n\n\n\n<li>Good scripting and programming skills in Python and UNIX shell.</li>\n\n\n\n<li>Data manipulation skills -- extract data from relational and non-relational databases, files of multiple formats, clean it, join it, slice/dice it, organize it, analyze it, and explain it.</li>\n\n\n\n<li>Experience in the Python data science ecosystem: Pandas, NumPy, SciPy, scikit-learn, NLTK, Gensim, etc. You should be able to hit the ground running with these tools fast.</li>\n\n\n\n<li>Experience with partitioning and clustering techniques (K-Means, DBSCAN, etc.).</li>\n\n\n\n<li>Experience with text mining, parsing, and classification using state-of-the-art techniques.</li>\n\n\n\n<li>Experience with information retrieval, Natural Language Processing, Natural Language Understanding, Neural Language Modeling, and Chat and Dialog Modeling technologies.</li>\n\n\n\n<li>Strong background in machine learning (unsupervised and supervised techniques). In particular, excellent understanding of machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision Forests, logistic regression, MLPs, RNNs, etc.</li>\n\n\n\n<li>Ability to evaluate quality of ML models and to define the right performance metrics for models in accordance with the requirements of the business.</li>\n\n\n\n<li>Quantitative, metrics-driven, data-oriented personality.</li>\n\n\n\n</ul>\nDirectly is an equal opportunity employer. We believe in diversity and inclusion as a strength."}