{"job title": "Data Scientist", "company": "Even", "city state": "– ", "rating": "5.0", "job description": "<div>\n<div>The problem</div>\n<br>\n<div>More than half of American workers live paycheck-to-paycheck. Stuck in this cycle, they collectively lose over $120 billion each year on payday loans, bank overdrafts, and fees. We’re trying to fix that by building new financial services that make it easier to plan ahead, pay down debt, and save. And we’re doing it as a transparent, straightforward business that only profits when our members do.</div><br>\n\n<div>The role</div>\n<br>\n<div>As a data scientist at Even, you’ll build models, perform analyses, and run experiments to help us better understand our members and design more intelligent financial products. You’ll do so as part of a mission-driven organization defined by its high engineering standards.</div></div><br>\n\n<div>\n<div>\nWhat you’ll do\n\n<ul>\n\n\n\n<ul>\n<li>Work on a wide range of complex data science problems at Even, from measuring our member impact to building artificially intelligent product features.</li>\n<li>Own and lead data science projects independently from start to finish. You’ll design projects, perform the technical work, and deliver impactful end products.</li>\n<li>Partner with and empower teams across the company, from Product to Operations. Your work will influence and guide the decisions of your coworkers and the company.</li></ul>\n\n\n</ul>\n\n</div>\n</div><br>\n\n<div>\n<div>\nWhat you’ll need\n\n<ul>\n\n\n\n<ul>\n<li>At least 1 year of experience as an applied scientist, ideally, but not necessarily, as a data scientist building and shipping digital products in the fintech space.</li>\n<li>Skill in 1 or more technical domains, e.g., statistical analysis, machine learning, experimentation, natural language processing.</li>\n<li>Expertise in manipulating large, messy data. Whether crawling logs, parsing text, or analyzing location data, you can query databases and manipulate data efficiently.</li>\n<li>Proficiency in Python, Scala, or R. You pick up whatever tools get the job done, but are comfortable joining a Python team big on numpy, pandas, scikit-learn, and stats models.</li>\n<li>Effective communication skills to explain your requirements, methods, findings, and analytical decisions to cross-functional teams of various technical backgrounds.</li></ul>\n\n\n</ul>\n\n</div>\n</div><br>\n\n<div>\n<div>\nSigns that you’re a great fit\n\n<ul>\n\n\n\n<ul>\n<li>You thrive in a passionate, mission-driven environment. You measure your success by your impact on people’s lives.</li>\n<li>You know that a successful product requires more than great data science. You think deeply about our members’ problems, our product vision, and our design approach.</li>\n<li>You hold yourself and those around you to high standards. You know that achieving excellence is a continuous process, not an accident.</li>\n<li>You are pragmatic and carefully weigh tradeoffs on a case-by-case basis to achieve the most value for our team and members.</li>\n<li>You understand that the road to a great product is paved with candid, but respectful, feedback. You care more about finding the truth than being right.</li>\n<li>You love to proactively help those around you grow. You unsparingly offer your time to mentor colleagues.</li>\n<li>You bring positivity and optimism to the team each day. You care deeply but don’t take yourself too seriously.</li></ul>\n\n\n</ul>\n\n</div>\n</div><br>\n\n<div>\n<div>\nWhat you'll get from us — great work\n\n<ul>\n\n\n\n<ul>\n<li>Impact: We are laser-focused on tackling huge societal problems. You’ll be on the front lines, visibly improving people’s lives. Just look at our app store feedback.</li>\n<li>Autonomy: We reward holistic thinking and individual initiative. You’ll tackle large-scope projects by working directly with stakeholders across the company.</li>\n<li>Growth: We know that our future rests in the hands of our teammates so we invest generously in mentorship. You can expect extensive internal transparency, 1:1 coaching with senior staff, and proactive career planning.</li></ul>\n\n\n</ul>\n\n</div>\n</div><br>\n\n<div>\n<div>\nWhat you'll get from us — great benefits\n\n<ul>\n\n\n\n<ul>\n<li>Competitive compensation, equity, healthcare, and retirement packages.</li>\n<li>A $5,000 annual educational stipend to invest in your learning and development.</li>\n<li>A $500 annual financial advice stipend.</li>\n<li>A $100 monthly stipend for health and wellness expenses.</li>\n<li>A flexible vacation policy and a team that understands building a company is a marathon, not a sprint.</li> \n\n<li>12 weeks of paid parental leave.</li></ul>\n\n\n</ul>\n\n</div>\n</div><br>\n\n<div>\n<div>\nWhat you'll get from us — a great workplace\n\n<ul>\n\n\n\n<ul>\n<li>Carefully defined anti-perks that create a focused and inclusive office.</li>\n<li>A pleasant, easily-accessible workspace in downtown Oakland with lots of natural light.</li>\n<li>Coworkers you can bring home to your parents. We do our best work in a close-knit, supportive environment.</li>\n<li>A team that values substance over style.</li></ul>\n\n\n</ul>\n\n</div>\n</div><br>\n\n<div>\n<div>Even is used by people of all backgrounds, and we believe the best products are built by teams that represent their users. We value unique contributions and actively welcome people of all backgrounds, experiences, and perspectives to join us at Even.</div></div>\n<br>"}