{"job title": "Data Scientist, Forecasting", "company": "Geli", "city state": "– San Francisco, CA", "rating": "2.0", "job description": "<strong>Job Summary</strong>\n<br><br>\nGeli is looking for an experienced Data Scientist with a strong software development background in Python to join a driven data analytics team. Your primary responsibility will be to lead the development of our time series forecasting models for solar and energy consumption using machine learning techniques. Our data analytics and cloud platforms use state-of-the-art technologies to set you up for success. As data science is at the core of Geli, you will have plenty of opportunities to contribute to the software development of our other energy storage products.\n<br><br>\n<strong>Role</strong>\n<br><br>\nYou will work closely with software and analytics engineers focusing on these topics:\n\n<ul>\n<li>Lead the development of our time series forecasting algorithms, which includes:</li>\n<li>Feature engineering</li>\n<li>Prototyping new algorithms</li>\n<li>Benchmarking performance across various load profiles</li>\n<li>Integrating new forecasting algorithms into our production code base with robust test coverage</li>\n<li>Collaborate with the rest of the team to assess how forecasts can be adjusted for various economic objectives.</li>\n<li>Proactively identify opportunities within Geli that can benefit from data science analysis and present those findings.</li>\n<li>Work collaboratively in a diverse environment. We commit to reaching better decisions by respecting opinions and working through disagreements.</li>\n<li>Gain in depth experience in an exciting industry as you work with storage sizing, energy financial models, energy tariffs, storage controls &amp; monitoring.</li>\n</ul>\n<strong>Growth Opportunity:</strong>\n<br><br>\nGelis engineering is a flat organization and you will directly report to the VP of Engineering.\n<br><br>\nThere are opportunities to lead teams, projects and/or become a scrum master.\n<br><br>\n<strong>Your Profile</strong>\n<br><br>\nWe are looking for a motivated self-starter that thrives in a dynamic start-up environment. A strong work ethic with excellent problem solving skills are equally important as being a team player who enjoys to learn and teach.\n<br><br>\nThese skills will additionally help you to excel in the position:\n\n<ul>\n<li>BS or higher degree with 2+ years of relevant experience</li>\n<li>Knowledge of machine learning algorithms (time series forecasting, clustering algorithms, probabilistic models, supervised and unsupervised learning)</li>\n<li>Experience with time series analysis and forecasting (LSTM, ARIMA, GARCH)</li>\n<li>Strong background in linear algebra and statistics</li>\n<li>Advanced Python skills, as well as familiarity with pandas and scikit-learn</li>\n<li>Software design experience and ability to write clean, maintainable and shippable production code</li>\n</ul>\n<strong>Bonus Points</strong>\n<br><br>\nExperience in some of these fields will give you a jump start:\n\n<ul>\n<li>PyTorch, Keras, Tensorflow</li>\n<li>Training models on AWS</li>\n<li>PostgreSQL, Redis</li>\n<li>Slack, Bitbucket, Jira</li>\n<li>Jenkins, Buildkite</li>\n<li>Knowledge of Cloud, IoT technologies, and scalable platforms</li>\n</ul>\nAs a member of the team you will have significant influence on the direction of our technology stack.\n<br><br>\n<strong>Benefits</strong>\n\n<ul>\n<li>Make a difference: join a group of people who are passionate about renewable energy</li>\n<li>Have an impact: the company is still small enough that everyones contribution has a significant impact to the success of the company</li>\n<li>Growth: leading international energy OEMs, developers and utilities trust us to modernize the trillion dollar energy industry with them and we need to grow to keep up with the demand</li>\n<li>Casual working environment: theres no need to dress up.</li>\n<li>Competitive salary and equity compensation plan</li>\n<li>401K with company matching</li>\n<li>Medical, dental &amp; vision insurance</li>\n<li>Open vacation policy</li>\n<li>Commuter reimbursement</li>\n<li>Convenient SOMA location on Mission St in downtown San Francisco (short walk to Montgomery Street BART)</li>\n</ul>\n<strong>Diversity</strong>\n<br><br>\nWe value the insights that a diverse team brings. We encourage applications from members of groups that have been traditionally underrepresented in tech. Geli is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, or national origin.\n<br><br>\n<strong>About Geli</strong>\n<br><br>\nGeli provides software and business solutions to design, automate, and manage energy storage systems. Gelis suite of products creates an ecosystem where project developers, OEMs, financiers, and project operators can deploy advanced energy projects using a seamless hardware-agnostic platform.\n<br><br>\nGeli is a Series A company whose software actively manages megawatts of projects that are deployed around the world."}