{"job title": "Signal Processing &amp; Data Analyst", "company": "GenapSys, Inc.", "city state": "– Redwood City, CA", "rating": "3.3", "job description": "At GenapSys we are working to change the world of healthcare and diagnostics. At GenapSys, we are developing a DNA-sequencing technology that will revolutionize the world of healthcare. Our system will enable fast, accurate, and ultra-low cost genetic tests in order to better understand (and ultimately treat) genetic diseases such as Cancer, Parkinson's, Diabetes, and Alzheimer's, just to name a few. GenapSys was founded by Dr. Hesaam Esfandyarpour and incubated over 6 years (2004-2010) at Stanford University.\n<br><br>\nOur team brings together an incredibly diverse and multidisciplinary set of backgrounds and skills from electrical and mechanical engineers to physicists, chemists, microfluidic engineers, molecular biologists, bioinformaticians, mathematicians and more. Together we will advance scientific and medical knowledge and improve human health through cheaper, faster, and more accurate DNA sequencing technologies. We are working cross-functionally to make a great impact in the world join us on that mission!\n<br><br>\nWe're looking for talented and passionate team players to join our fast-paced startup company. Specifically, we are looking for an exceptional Ph.D. level candidate who has experience in Signal Processing and Data Analysis with a strong track record or extensive publication list and proven product development record in either academic or industry settings. If you want to help change the current paradigm of DNA sequencing and contributor to the GenapSys vision and goals this job is for you!\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Develop signal processing algorithms to extract information from many biomedical sensors</li>\n<li>Develop DNA sequencing base calling algorithms</li>\n<li>Develop DOE (design of experiments) for troubleshooting and failure mode analysis</li>\n<li>Perform in-depth data analysis and present results and conclusions for characterization and modeling of a complex physical system on a chip</li>\n<li>Present written and oral reports and proposals to peers and management</li>\n</ul>\n<strong>Required Qualifications</strong>\n\n<ul>\n<li>PhD level candidate in electrical engineering, computational biology, physics, mathematics, statistics.</li>\n<li>4+ years of experience either as a postdoc or in industry after receiving PhD degree.</li>\n<li>Expert in signal processing algorithm development.</li>\n<li>Expert in Python, C/ C++.</li>\n<li>Working knowledge of regression analysis, statistical estimation and signal detection theories.</li>\n<li>Experienced in implementing clustering algorithms, PCA analysis, and Markov models.</li> \n\n<li>Familiar with data analysis and characterization of physical systems. Has the ability to model, simulate and validate dynamic systems.</li>\n<li>Machine learning experience is a big plus.</li> \n\n<li>Innovative, driven, results-oriented and methodical with a successful track record.</li>\n<li>Detail oriented with strong documentation skills.</li>\n<li>Strong team player who is flexible, adaptable and the ability to collaborate within a multidisciplinary organization.</li>\n<li>Ability to manage work within tight timelines.</li>\n</ul>\n<strong>What we offer:</strong>\n\n<ul>\n<li>An amazing mission: Enabling everyone to decode the living world!</li>\n<li>Competitive compensation and stock options</li>\n<li>Competitive benefits: medical, dental and vision benefits for employees and dependents, fully sponsored life, short and long-term disability insurance, and 401(k) retirement savings plan.</li>\n<li>Free daily catered gourmet lunches and snacks</li>\n<li>Weekly fancy High Tea and happy hours</li> \n\n<li>Free complex onsite gym membership</li>\n<li>Casual, but high-performing work environment</li>\n</ul>\n<em>A diverse and inclusive workplace where we learn from each other is an integral part of GenapSys' culture. We actively welcome people of different backgrounds, experiences, abilities, and perspectives. We are an equal opportunity employer and a great place to work. Join us and help us achieve our mission!</em>\n<br><br>\n<strong>Note to Recruiters and Placement Agencies:</strong>\n<br><br>\nGenapsys does not accept unsolicited agency resumes. Please do not forward unsolicited agency resumes to our website or to any Genapsys employee. Genapsys will not pay fees to any third party agency or firm and will not be responsible for any agency fees associated with unsolicited resumes. Unsolicited resumes received will be considered the property of Genapsys."}