{"job title": "Lead Data Scientist &amp; Engineer", "company": "GQR Global Markets", "city state": "– Phoenix, AZ", "rating": "3.6", "job description": "Lead Data Scientist &amp; Engineer<br>\n\n<div>\n<strong> DATE</strong>\n<br>\n<br>\n 13 Jul</div><br>\n\n <div>\n<strong> LOCATION</strong>\n<br>\n<br>\n Phoenix</div><br>\n\n <div>\n<strong> COMPENSATION</strong>\n<br>\n<br>\n $155,000.00</div><br>\n\n <div>\nKEY SKILLS</div><br>\n\n<div>\nDESCRIPTION<br>\n<div><strong>TITLE &amp; LOCATION</strong>\n<br><br>\nAssociate/Senior/Lead Data Scientist – Phoenix, AZ; New York, NY</div> <div><strong>SALARY RANGE OR SPECIFIED NUMBER + BONUS</strong>\n<br><br>\n$95,000 - $155,000 DOE + Bonus</div> <div><strong>SUMMARY</strong>\n<br><br>\nOur client is an international industry leader in corporate travel &amp; events program management that leverages cutting-edge technology, real-time analytics aggregation, &amp; partnerships in over 120 countries to provide clients with discounted rates, efficient coordination, &amp; increased ROI.\n<br><br>\nMoving in a more Big Data-driven direction, our client is building out a new specialist Data Science team within its Analytics function that will be based in either Phoenix, AZ or New York, NY. This team will be focused on developing a large-scale recommendation engine, optimize their metasearch platform, &amp; optimize personalization for their client base. Our client is able to hire in at multiple levels, based on experience. Ideal candidates will be very hands-on end-to-end data scientists who can also convey the application of data insights to real-world business problems. He/she will be a part of a highly collaborative &amp; niche group that will be quite visible, with advancement opportunities projected as soon as 2017.</div> <div><strong>REQUIREMENTS</strong>\n\n<ul>\n<li>Bachelors required; Masters/PhD highly preferred in Computer Science, Electrical Engineering, Applied Mathematics, Statistics, Information Systems, or relevant quantitative field.</li><li>3-5+ years of professional industry experience in an analytics-driven environment.</li><li>Experience in developing recommender algorithms or building out recommendation systems; Should be able to truly validate recommendation systems &amp; defend personal approaches regarding development</li><li>Proficiency with Hadoop (HDP) required; Strong working knowledge of Python/Pandas, Spark, R, or other open source tools required.</li><li>Experience with Natural Language Processing techniques &amp; text mining highly preferred.</li><li>Experience with Agile Scrum preferred but not required.</li><li>Experience collaborating in an interdisciplinary technical environment &amp; the ability to communicate technical concepts to different (non-technical) audiences</li><li>Enjoys “getting their hands dirty”; capable of conducting independent research, likes building things from scratch, &amp; excels in challenging environments.</li>\n</ul>\n<strong>Benefits</strong>\n\n<ul>\n<li>Competitive salary, incentives, &amp; full benefits</li></ul></div>\n<br>\n<div>APPLY | data.americas@gqrgm.com\n<br><br>\nVISIT US | www.gqrgm.com\n<br><br>\nWhile a resume is preferable we also welcome tentative enquiries from well-qualified persons. Utmost confidentiality and discretion is assured.\n<br><br>\nLOS ANGELES | 1.310.807.5030\n<br><br>\n631 Wilshire Boulevard, Santa Monica, CA 90401 | Office Hours: 7.00-20.00 PDT\n<br><br>\nNEW YORK | 1.212.763.8333\n<br><br>\n340 Madison Avenue, New York, NY 10173 | Office Hours: 8.00-20.00 EDT\n<br><br>\nLONDON | 0203.141.8000\n<br><br>\nWestminster Tower, London SE1 7SP| Office Hours: 8.00-20.00 GMT\n<br><br>\nHONG KONG | 852.3678.6738\n<br><br>\n2 Exchange Square, 8 Connaught Place, Central | Office Hours: 9.00-21.00 HKT\n<br><br>\nGQR Global Markets\n<br><br>\nWe are committed to protecting and respecting your privacy. Information on our privacy policy, together with our terms of business are available at www.gqrgm.com.\n<br><br>\nFor the latest vacancies, please join our group on Linkedin: http://www.linkedin.com/groups?gid=1615777&amp;trk=myg_ugrp_ovr</div></div><br>\n\n<div>While a resume is preferable we also welcome tentative enquiries from well-qualified persons. To speak with an\n<br>\n agent please contact one of our regional offices. Utmost confidentiality and discretion is assured.</div>\n<br>"}