{"job title": "Data Scientist", "company": "HireNetworks", "city state": "– Raleigh, NC", "rating": "4.5", "job description": "<div><strong>Data Scientist 6426</strong></div><div>Our client is seeking a customer facing Data Scientist to translate customer data and problems in ways that the ML system can solve the problems. The identified candidate will need to have a sense of humor and be able to work in a fast-paced start up environment. Possessing an ability to adapt to shifting schedules and priorities will contribute to success in this environment. Anyone joining this team should have the ability and willingness to accept criticism and be able to explain and defend their suggestions and ideas.</div> <br>\n<div>The Data Scientist role is a direct hire opportunity with one of our clients in Raleigh, NC. Client wants to see all qualified candidates, so salary range is open. Local candidates strongly preferred, but will consider relocating the right candidate. Partial telecommute from the local area possible. No sponsorship or C2C arrangements available.</div><br>\n\n<div><strong>Responsibilities of the Data Scientist:</strong></div><ul><li>Help customers translate their data and problems in ways that our ML system can solve them</li><li>Create requirements and select algorithms for tools that customers can use themselves as part of our ML system</li><li>Characterize aspects of our ML system and recommend ways it can be improved</li><li>Identify a new customer's best problems and data sets</li><li>Transform and process the data sets to maximize accuracy, performance, and ML transparency</li><li>Communicate results to customer and make recommendations for future work</li>\n</ul>\n\n<div><strong>Qualifications of the Data Scientist:</strong></div><ul><li>At least 3 – 7 years of industry experience</li><li>Experience applying machine learning and/or advanced statistics techniques to solve problems</li><li>Experience with all aspects of feature engineering, including interviewing subject matter experts, feature transformation, feature evaluation, and feature selection</li><li>Good writing and communication skills</li><li>Proficiency with 2 or more of the following: Java, C#, Python</li><li>BS in computer science, statistics, or another field related to ML</li><li>Approachable, friendly demeanor</li><li>Systems thinker</li><li>Good at tracking down problems and finding opportunities</li>\n</ul>\n\n<div><strong>Desired Attributes of the Data Scientist:</strong></div><ul><li>Knowledge of ways to improve throughput and reduce latency on various computing platforms and networks</li><li>Breadth of knowledge and ability to communicate pros and cons about many different statistical techniques and machine learning algorithms</li><li>MS in computer science, statistics, or another field related to ML</li>\n</ul>\n\n<div>Contact <strong>Martha Michaux</strong> at mmichaux@hirenetworks.com or (919)981-6200 x314 with questions regarding this posting. A Word resume is preferred when applying.</div><div>When looking for a job, have you ever heard the phrase… <em>it is not about what you know, it is who you know</em>?</div><br>\n<div>At HireNetworks, it really is all about who we know.</div><br>\n<div>Whether your current contract is coming to a close, you’re looking to advance your career or are a company on the hunt for new talent and wanting to expand…let HireNetworks put our networks to work for you.</div><br>\n<div>HireNetworks is an equal opportunity employer.</div>"}