{"job title": "Data Scientist", "company": "PEAK6", "city state": "– Chicago, IL", "rating": "2.7", "job description": "PEAK6 was brought to life by the idea that the development of integrative technology can improve how business is done. The passion for that idea powers our firm still. As a <strong><em>Data Scientist</em> </strong>at PEAK6, you are free to explore unique solutions and try fresh ideas that will benefit our trading business and investment companies. You'll collaborate with some of tech's and analytics' sharpest minds to solve the firm's ever-changing but exciting challenges. Working in tech at PEAK6 means that you'll always be presented with a variety of new possibilities as you continue to enhance your skills.\n<br><br>\nPlease note that we do not require prior knowledge of financial markets for this role, and will offer all the training you need to be successful.\n<br><br>\n<em>You'll be responsible for:</em>\n\n<ul>\n<li>Converting human pattern recognition and decision-making processes into automated aspects of the trading workflow.</li>\n<li>Finding innovative solutions to known problems that will support and expand our core business.</li> \n\n<li>Driving the firm forward with new ideas that will impact the way we leverage market data.</li>\n<li>Defining best practices within our analytics team regarding prototyping and scaling solutions.</li>\n<li>Assisting software developers in translating research results to production.</li>\n<li>Mentoring junior researchers on the analytics and trading teams.</li>\n</ul>\n<em>While you'll gain experience in this role, you should already have:</em>\n\n<ul>\n<li>Five years of experience as a researcher or machine learning engineer, with at least one year in industry.</li>\n<li>A demonstrated track record of applying ML techniques to real-world problems.</li>\n<li>Extensive knowledge of statistical modeling.</li>\n<li>An interest in staying up-to-date with recent advances in machine learning.</li>\n<li>The ability to collaborate with subject matter experts in defining appropriate features and metrics for a given model.</li>\n<li>The confidence to take the lead on a project, work through the practical business decisions involved, and carry it to completion in a timely manner.</li>\n<li>Comfort implementing new models from papers.</li>\n<li>Experience working with large, noisy, or incomplete datasets.</li>\n<li>Expertise in Python (Pytorch and Tensorflow preferred) and SQL.</li>\n</ul>\n<em>As a PEAK6 employee, you can expect</em>:\n\n<ul>\n<li>Generous medical, vision and dental plans</li>\n<li>Matching 401(k) programs</li>\n<li>Adoption assistance &amp; family leave</li>\n<li>Speakers Series</li>\n<li>Massage days</li>\n<li>Poker tournament (with a grand prize of a World Series of Poker buy-in)</li>\n<li>Sports leagues</li>\n<li>Annual PEAK6 Party</li>\n<li>Yoga classes</li>\n<li>Tuition reimbursement</li>\n<li>Lasik eye discount</li>\n<li>Philanthropy events</li>\n<li>Annual wellness screens and flu shots</li>\n<li>Birthday gifts</li>\n<li>Charitable matching gift program</li>\n</ul>"}