{"job title": "Data Scientist", "company": "Rose International", "city state": "– Creve Coeur, MO", "rating": "4.4", "job description": "<div>Position Title: Data Scientist</div> \n<br>\n<div>Position Number: 295142</div>\n<br>\n<div>Location: Creve Coeur, MO</div><br>\n\n<div><strong>Desired Skill Set:</strong></div><div> Data Scientist, Machine Learning, Python, R Programming, Statistics</div><br>\n\n<div><strong>Position Description:</strong></div><div> **C2C and STEM-OPT are not available**\n\n\n<ul>\n<li>*Only U.S. Citizens and those authorized to work in the U.S. can be considered as W2 candidates.**</li>\n</ul>\n\nLocation: Creve Coeur, MO 63141\n<br>\nDuration: 15 months\n<br><br>\nData Scientist\n\n\n<ul>\n<li>Design, implement and optimize statistical and machine learning models based on structured and unstructured data.</li>\n<li>Collaborate with system integration and data warehouse engineers on data extraction and data cleaning.</li>\n<li>Develop powerful analytics insights from geographical, marketing, industrial data and public policy using advanced machine learning techniques.</li>\n<li>Work closely with the software engineering team to productize analytic software, using statistical programming languages like R and Python.</li>\n<li>Work in a highly interactive, team-oriented environment.</li>\n<li>Master's degree in a STEM field, with statistics courses or proven expertise, and 2 years of experience.</li>\n<li>MUST HAVE: conceptual knowledge of statistics and basic theory</li></ul></div>\n\n\n<div> #CBRose#</div>\n<br>\n<div> \n<div>\nSend me a reminder to complete this application</div>\n </div><br>\n\n<div>\n<strong>Rose International is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender (expression or identity), national origin, arrest and conviction records, disability, veteran status or any other characteristic protected by law. Positions located in San Francisco and Los Angeles, California will be administered in accordance with their respective Fair Chance Ordinances.\n<br><br>\nRose International has an official agreement (ID #132522), effective June 30, 2008, with the U.S. Department of Homeland Security, U.S. Citizenship and Immigration Services, Employment Verification Program (E-Verify).\n<br><br>\n(Posting required by OCGA 13/10-91.)</strong></div>\n<br>"}