{"job title": "Data Scientist", "company": "Seneca Resources", "city state": "– Richmond, Virginia", "rating": "4.3", "job description": "<div><strong>Position Title:</strong> Data Scientist</div><br>\n\n<div><strong>Location:</strong> Richmond, VA</div><br>\n\n<div><strong>Work Status:</strong> U.S. Citizen or Green Card</div><br>\n\n<div><strong>Position Status: Direct Hire</strong></div>\n\n<br><strong><div>Position Description:</div>\n\n<br></strong>\n<br>\n<div>Our client is looking for <strong>Data Analyst</strong> candidates for a position located in <strong>Richmond, VA</strong>. The client is a consumer finance company that partners with furniture dealers across the country to provide their customers with a superior financing experience. They are a new company that has done increasingly well over the past few years and are looking to add to their rapidly growing team.</div><br>\n\n<div><strong>Required Education:</strong> Undergraduate Degree in a <strong>quantitative</strong> field of study</div>\n\n<br><strong><div>Required Skills:</div>\n\n<br></strong>\n\n\n<ul>\n<li>1+ years using SQL</li>\n\n<li>2+ years building predictive models in Python or R</li>\n\n<li>2+ years in a finance, sales, or risk-oriented support role</li>\n</ul>\n\n<strong><div>Desired Skills:</div>\n\n<br></strong>\n\n\n<ul>\n<li>Advanced degree (MS or PhD) in a quantitative field of study</li>\n\n<li>1+ years at a fast-moving start-up</li>\n\n<li>3+ years in financial services</li>\n\n<li>1+ years using Spark, AWS, or Azure</li>\n\n<li>Prior experience deploying machine learning models into production</li>\n</ul>\n\n<strong><div>About Seneca Resources:</div>\n\n<br></strong>\n<br>\n<div>Seneca Resources is client driven provider of strategic Information Technology consulting services and Workforce Solutions to government and industry. Seneca Resources is a leading IT services provider with offices in Virginia, Alabama, &amp; Dallas that service clients throughout the United States. The key to our success lies within our strong corporate culture which drives our business. We challenge our staff through engaging work, and we reward our staff through competitive compensation, extensive professional training, and excellent opportunities for career advancement. In turn, we look for only the best and brightest to join our team.</div><br>\n\n<div>We are an Equal Opportunity Employer and value the benefits of diversity in our workplace.</div>"}