{"job title": "Data Scientist", "company": "The Judge Group, Inc.", "city state": "– Irving, TX", "rating": "3.6", "job description": "Our client is currently seeking a Data Scientist<br>Role: Data Scientist<br>Location: Irving, TX<br>Job Type: Contract<br><br>This job will have the following responsibilities:<br><br>• Hands on experience in predictive analytics and statistical tools and big data tools<br>• Define data store architecture<br>• Create visualizations for consumption by varied audiences to convey understandable insights<br>• Manipulate, extract, process, and analyze large data sets to develop insights and surface implications using statistical techniques<br>• Identify, analyze and interpret trends or patterns in complex data sets<br>• Apply scientific data collection and interpretation activities and ensure collected data is relevant and exhaustive<br><br>Qualifications &amp; Requirements<br>• • SQL, no-SQL, R or Python, • Hadoop, Spark, Storm, Hive • Frameworks/libs: NumPy, SciPy, Pandas, numpy, Matplotlib/Plotly, Statsmodels Desirable Technical Skills • Elastic Stack, Git • Frameworks/libs: TensorFlow, Keras, NLTK, Gensim, Scikit-learn • Familiarity with HTTP and invoking web-APIs Personal Skills • Experienced in managing work with distributed teams • Experience working in SCRUM methodology • Proven sense of high accountability and self-drive to take on and see through big challenges • Confident, takes ownership, willingness to get the job done • Excellent verbal communications and cross group collaboration skills Total Experience Required 2+ years of relevant experience NLP exposure beneficial<br><br>Judge Group Job Order ID: 582980<br><br>Salary: Open<br><br>Company Description:<br><br>Working at the crossroads of people and transformative technologies, The Judge Group delivers innovative business solutions powered by top talent to help organizations reach their strategic goals and realize opportunities now and in the future.<br><br>The Judge Group is a leading professional services firm specializing in technology, talent, and learning solutions. Our services are successfully delivered through a network of more than 35 offices in the United States, Canada, China, and India. The Judge Group serves more than 40 Fortune 100 companies and is responsible for the placement of more than 4,500 professionals annually across a wide range of industries. To learn more, visit www.judge.com."}