{"job title": "Default Reporting and Analytics Manager", "company": "The Money Source", "city state": "– Meriden, CT", "rating": "4.5", "job description": "The Default Reporting and Analytics Managers primary functions are to establish sound policies and procedures, provide guidance and or insight for daily job duties to direct staff members, ensure proper controls are in place for servicing reporting and provide Management insight into portfolio statistics and strategy recommendations. The information provided to management will include current and historical performance trends, forecasts, variance analysis, calling statistics and other default related data. The position looks for opportunities to create efficiencies for staff and other impacted department while making recommendations to department owners. All employees of The Money Source Inc. are expected to provide quality customer service and maintain high ethical standards when serving our clients.\n<br><br>\n<strong>Duties and Responsibilities:</strong>\n\n<ul>\n\n\t<li>Assist in the development and maintenance of the policies &amp; procedures and operating manual(s) required for functions within responsibility area.</li> \n\n<li>Ensure staff protects the privacy of the mortgagor(s) through strict enforcement of procedures on Non-Public Information (NPI) standards.</li>\n\n<li>Prepare ad hoc reports as required.</li>\n\n<li>Conduct annual performance appraisals for direct reports and approve performance reviews for subordinate staff.</li>\n\n<li>Ensure all reporting needs for government agencies are occurring within Investor Guidelines</li>\n\n<li>Work with internal departments in minimizing risk levels be introducing new strategies and techniques</li>\n\n<li>Work with staff to perform complex research and analysis to provide hypothesis around customer behavior, test hypothesis with quantitative and qualitive data.</li>\n\n<li>Ensure integrity of analyses through rigorous attention to detail and validation of data</li>\n\n<li>Assists in directing staff in collecting data to establish goals for call center management, Foreclosure/Bankruptcy, Loss mitigation and other departments as directed</li>\n\n<li>Recommends controls by identifying problems with anomalies in data sets</li> \n\n<li>Produce the data mining, analysis and reporting where directed</li>\n\n<li>Prepares report requirements by collecting, analyzing, and summarizing information and trends</li>\n\n<li>Maintains professional industry knowledge by attending educational workshops, reviewing</li> \n\n<li>professional publications, establishing personal networks, benchmarking state-of-the-art</li> \n\n<li>practices, and participating in professional societies</li> \n\n<li>Assist in development of workflow platforms</li>\n\n<li>Partner with Business to identify solutions to improve workflow efficiency and risk management</li>\n\n<li>Report all department activity to Management on a daily/weekly/monthly basis</li>\n\n<li>Additional duties and tasks as assigned</li>\n</ul>\n<strong>Experience and Skills:</strong>\n\n<ul>\n\n\t<li>6+ years of experience in one or a combination of the following: reporting, analytics, or modeling</li>\n\n<li>Ability to read, analyze and interpret technical procedures, government regulations as well as interpret a variety of instructions furnished in written, oral, diagram and/or schedule form</li> \n\n<li>Proficiency in writing reports, business correspondence and procedural manuals</li> \n\n<li>Capacity to work with mathematical concepts such as probability and statistical inference</li> \n\n<li>Strong understanding of the mortgage servicing process and industry</li>\n\n<li>Working knowledge of RESPA, TILA, FDCPA, GLBA, UDAAP, state licensing regulations, and any other pertinent regulations.</li>\n\n<li>Must be able to communicate technical ideas effectively</li>\n\n<li>Excellent verbal and written communication skills.</li> \n\n<li>Required Computer and Software Competencies:</li> \n\n<li>Proficient in Microsoft Office suite (e.g., Word, Excel, Visio, PowerPoint, Outlook)</li> \n\n<li>Strong experience with MSP mortgage servicing system and mortgage terminology</li> \n</ul>\n<strong>Education:</strong>\n<br><br>\nBachelor?s Degree in a business-related field or a combination of education and required minimum of five (5) years? experience in default servicing\n<br><br>\n<strong>Direction Received:</strong>\n<br><br>\nReceives general guidance and direction from SVP of Default\n<br><br>\n<strong>Direction Given:</strong>\n<br><br>\nSupervise / Manage team of Analysts\n<br><br>\n<strong>Working Conditions:</strong>\n<br><br>\nTempe office"}