{"job title": "Quantitative Analyst II", "company": "American Greetings", "city state": "– Westlake, Ohio", "rating": "3.1", "job description": "American Greetings is recruiting for a Quantitative Analyst II to join the Business Intelligence team at our world headquarters in Cleveland, Ohio. The Analyst position carries out standard reporting and data analysis from a number of data sources, including Point-of-Sale, shipments, product footage, and other internal and 3rd party database systems (e.g. Retailer Loyalty Card Data Portals, IRI, APT, Kantar Retail, etc). Analyzes and interprets data using category management and statistical techniques in order to improve sales performance at retail under the direction of the Manager.\n\n\n<ul>\n<li>Works closely with the Account Executive (AE) to develop a strong fact-based selling relationship with the retailer's buying and merchandising teams.</li>\n<li>Evaluates and develops analysis methodologies to track, analyze, and plan retailer opportunities. This individual leverages Point-of-Sale, shipment, and product footage data as well as 3rd party data sources to provide breakthrough insights for the retailer, Sales, and Product Merchant teams under direction of the Channel Manager.</li>\n<li>Track merchandising and promotional efforts to determine if they were efficient and effective, and make recommendations for improvement.</li>\n<li>Quantify program initiatives and sales trends in order to help develop annual sales plans internally as well as for the retailer.</li>\n<li>Develops presentation decks that are used by the sales teams to communicate product sales performance during customer relationship forums (CRFs) and retailer headquarter visits.</li>\n<li>Communicate insights effectively, both verbally and in writing. The accuracy of reporting and analysis is paramount as many reports are directly shared with retailers and upper management.</li>\n<li>The ability to successfully manage several concurrent projects at one time under close direction of the Channel Manager.</li>\n<li>Other duties as assigned.</li>\n</ul>\n\n<strong>Experience Required:</strong>\n\n\n<ul>\n<li>A minimum of 1-2 years experience applying quantitative methods to solve business problems.</li>\n<li>Prior experience utilizing Excel, SAS,Access, SQL, or a similar large database application is strongly desired.</li>\n<li>Strong quantitative skills and the ability to apply statistical/data analysis techniques.</li>\n<li>Strong computer skills including Microsoft Excel, Access, SAS, SPSS, etc.</li>\n<li>Accuracy and attention to detail.</li>\n<li>Good communication (oral and written) and interpersonal skills.</li>\n<li>Ability to interact with both internal clients and external clients (retailers).</li>\n</ul>"}