{"job title": "Analytics Consultant", "company": "Apex Systems LLC", "city state": "– Charlotte, North Carolina", "rating": "3.1", "job description": "<strong> Job Description</strong>\n<br><br>\n<strong> Job #:</strong>  858749<br><br>The Insights and Reporting team provides reporting and analytic support across the various Wholesale LOBs. The team functions as a key central analytic and reporting function for relationship and sales growth, and provides insight into Wholesale-wide metrics and reporting needs, looking for innovative analytic solutions to support business growth.\n<br><br>\nThis team conducts a variety of analyses and reporting such as segmentation, product depth, opportunity identification and sizing, spatial analyses, and predictive and expert modeling. Analyses and reports support strategic growth, marketing, prospecting, attrition, and any other areas where businesses may need analytic/reporting support. Additionally this team supports senior leader presentations and ongoing reporting needs for Wholesale and its lines of business.\n<br><br>\nThis position will be a senior analytic consultant within WRS&amp;I, who will be dedicated to supporting the Wholesale Customer Complaints team, which will be part of the Customer Excellence group within the Wholesale COO group. This individual will work in partnership with multiple Wholesale lines of business to identify, develop and perform analytical, statistical modeling, and/or forecasting methods for Wholesale LOB and Wholesale-wide efforts to understand customer complaints. In addition, this role will contribute to senior level presentations and will need to be comfortable aggregating and leveraging data from multiple sources, including internal and external sources. A keen ability to identify and deliver succinct, relevant and impactful insights is imperative.\n<br><br>\nThis team member will partner closely with LOB business partners, Wholesale Business Solutions (WBS), and other partners as appropriate. This role will also partner with other analysts across the Enterprise to continue to drive WF consistency in analytic and reporting structures, as well as explore new innovative thinking/ideas to be leveraged by the team. As such, the successful candidate will have strong relationship building and communication skills, with the ability to effectively collaborate on projects. They will have an analytic curiosity, a strong desire to dig deeper, and the ability to solve complex problems quickly.\n<br><br>\n<strong> Specifically, this individual will:</strong>\n<br><br>\nInfluence the data platform that will be necessary to support customer complaints reporting and analysis\n<br><br>\nInfluence and identify long term metrics and data needs that will enable an enterprise-wide customer excellence practice\n<br><br>\nAggregate findings across all LOBs and deliver a Wholesale-wide view in standardized reporting for customer complaints\n<br><br>\nDefine customer complaint management metrics. Calculate KPIs for Wholesale and each LOB. Develop customer complaint trends to be included in LOB operational reports. Find early warnings and create insights that allow for predictive capability regarding complaints and overall customer experience\n<br><br>\nIdentify key insights from data to inform on-going LOB decision making\n<br><br>\nDevelop, pilot, and launch new and leading analytic capabilities (voice/text analytics) to generate greater insights from data\n<br><br>\nWork with LOB partners to leverage analytics that identify root cause for complaints\n<br><br>\nIdentify and bring visibility to cross-LOB analysis opportunities regarding customer complaints\n<br><br>\n<strong> Responsibilities may include, but not limited to:</strong>\n<li> Responsible for performing complex activities related to business analysis and/or modeling by responding to requests from lines of business and conduct in-depth analyses and ad-hoc reporting. Analyses will include identifying relationship growth opportunities, product penetration and profitability analyses, relationship portfolio profiles and segmentation analysis, and preparing lead lists</li> <li> Duties typically include providing strategic insights, developing analytical strategies, building interactive dashboards, developing and productionalizing foundational reporting, performing analytical support and/or modeling regarding a wide array of business initiatives</li> <li> Designs and leads a variety of projects/ analyses, generally spanning multiple products/business lines/functional areas/data sources and may involve analytical application of industry-leading experimental techniques or exploratory data analytics</li> <li> Provide actionable insights and make strategic recommendations to the line of business based on thought-provoking and sound analytics, both proactively and in response to business partners requests</li> <li> Works with internal clients to identify analytical needs, define business requirements, identify potential data sources, design reports and analyses, and translate business needs into actionable insights. Additionally, partner with internal technology group(s) to build/enhance databases as needed</li> <li> Applies knowledge of business, customers, and/or products/services/portfolios to synthesize data to 'form a story' and align information to contrast/compare to industry perspective</li> <li> Manipulates and manages data that are typically very large, structured or unstructured, and from multiple sources</li> <li> May be involved directly in the technical build-out and/or support of databases, query tools, reporting tools, BI tools, dashboards, etc. that enable analysis, modeling, and/or advanced data visualization</li>  <li> Partners closely with project/virtual teams and may partner with more senior Analytic Consultants depending on complexity of analysis involved</li>\n<strong> Required Qualifications:</strong>\n<br><br>\n6+ years of experience in one or a combination of the following: reporting, analytics, or modeling; or a Masters degree or higher in a quantitative field such as applied math, statistics, engineering, physics, accounting, finance, economics, econometrics, computer sciences, or business/social and behavioral sciences with a quantitative emphasis and 4+ years of experience in one or a combination of the following: reporting, analytics, or modeling\n<br><br>\n<strong> Desired Qualifications</strong>\n<li> Advanced working knowledge of text and speech analytics and analyzing other types of unstructured data</li> <li> Experience with analytic coding tools (i.e. SAS, SQL, R, Python)</li> <li> Hands on experience with Tableau and other visualization and BI tools, with a keen ability to tell a visual data story</li> <li> Creativity to ideate new ways to represent data in graphs/tables/pictures to deliver the best insights</li> <li> Analytical and detail oriented with the ability to prioritize, execute and deliver projects on time</li> <li> Strong desire and ability to creatively solve problems and strong prioritization skills</li> <li> Ability to identify in efficiencies and opportunities to improve the process</li> <li> Diversity champion enabling team collaboration. Leads and influences diverse views to foster problem solving, and delivery of extraordinary work that promotes team success</li> <li> Excellent verbal, written, and interpersonal communication skills</li> <li> Extensive knowledge and understanding of research and analysis</li> <li> Strong analytical skills with high attention to detail and accuracy</li>"}