{"job title": "Data Science &amp; Tagging Analyst (Full Time)", "company": "Bluemont Technology &amp; Research, Inc.", "city state": "– Bethesda, MD", "rating": "NA", "job description": "Title: Data Science &amp; Tagging Analyst\n<br>\n<strong>Location: Bethesda, MD</strong>\n<br><br>\n<strong>Clearance: Active CI Poly Required to apply.</strong>\n<br><br>\nRequired Knowledge / Skills / Abilities:\n\n\n<ul>\n\n\t<li>\n\n\n<ul>\n\n </ul>\n\n\t</li>\n<li>Applicable degree(s): Computer Information Systems, Computer Science, Database Administration, Data Science, Engineering, IT Management, Mathematics, or Statistics (or another quantitative field).</li>\n\n<li>Minimum five (5) years of experience manipulating datasets and building statistical models, and familiarity with:\n\n\n<ul>\n\n <li>Coding knowledge and experience with several languages (C, C++, Java, JavaScript, etc.);</li>\n\n<li>Statistical and data mining techniques (Regression, Random Forest, Boosting, Trees, text mining, social network analysis, etc.);</li>\n\n<li>Querying databases and using statistical computer languages (R, Python, etc.);</li>\n\n<li>Using web services (Redshift, Spark, Digital Ocean, etc.);</li> \n\n<li>Algorithms and statistics (regression, simulation, scenario analysis, learning advanced machine using Creating and modeling, clustering, decision trees, neural networks, etc.).</li>\n\n<li>These five (5) years may be concurrent with requisite years of experience.</li>\n\n<li>Strong problem solving skills with an emphasis on product development.</li>\n</ul>\n\n\t</li>\n<li>Knowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications.</li>\n\n<li>Outstanding interpersonal skills, including the ability to work independently and in a team or collaborative environment, to work with all levels of employees from support staff to senior leadership, and to be proactive and responsive in communicating with all stakeholders.</li>\n\n<li>Outstanding oral and written communication skills with the ability to conduct independent research, filter and synthesize data, and produce clear, logical, and concise recommendations to policy and decision-making data management and governance professionals data metadata management, data governance, data quality, knowledge areas: data management, data management key of the one with demonstrated expertise modeling and design, data storage and operations, data integration and operability, document and content management, reference and master data.Demonstrated expertise with developing and implementing data management strategies, processes, and technical solutions.</li>\n\n<li>Proven ability to drive business results with data-based insights.</li>\n</ul>\n\n<strong>Desired Knowledge / Skills / Abilities:\n<br><br>\n</strong>\n\n\n<ul>\n\n\t<li>\n\n\n<ul>\n\n </ul>\n\n\t</li>\n<li>Experience analyzing data from 3rd party providers (Google Analytics, Site Catalyst, Core metrics, AdWords, Crimson Hexagon, Facebook Insights, etc.).</li>\n\n<li>Experience visualizing/presenting data for stakeholders using (Periscope, Business Objects, etc.).</li>\n\n<li>Demonstrated expertise managing competing priorities while maintaining a high level of attention to detail; demonstrated ability to work effectively with senior leaders in a high profile and demanding office.</li>\n\n<li>Outstanding analytical and critical thinking skills, including the demonstrated ability to think strategically, identify needs and requirements, and develop recommendations and solutions.</li>\n\n<li>Outstanding leadership and managerial capabilities, including the ability to effectively direct tasking, and assess and manage performance.</li>\n\n<li>Knowledge of the IC, ODNI, DoD, and the overall national security apparatus.</li>\n</ul>\nYou will mine and analyze data from various databases to drive optimization and improvement of strategy and policy development. Develop custom data models and algorithms to apply to data sets. Recommend, develop and support implementation of best practices for standardizing data across its lifecycle through engineering, development and governance. You will advise on a range of Enterprise and IC data management matters through their application of substantive, analytical, operational, program management, and/or IC expertise.\n<br><br>\nBluemont Technology is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, sex, sexual orientation, gender identity, religion, national origin, disability, veteran status, or another legally protected status."}