{"job title": "Data Sciences Hi-Tech Market Lead", "company": "Cognizant Technology Solutions", "city state": "– Sunnyvale, CA", "rating": "3.6", "job description": "Cognizant's AI&amp;Analytics (AIA) is seeking a Data Science Hi-Tech Market Lead to join its growing organization. We are currently looking for someone in the Bay Area.\n<br><br>\n<strong>Key Responsibilities:</strong>\n<br><br>\nWe're looking for motivated individual with strong advanced analytics and data science background in Hi-Tech industries to take on delivery, practice development and revenue generation activities within North America. Your primary role is to build demand and deliver our analytics services and solutions from within our existing base of Hi-Tech customers as well as new prospects. You will be joining a high performance team of AI&amp;Analytics, specifically focusing on Hi-Tech analytics.\n<br><br>\nDescription / Expectations\n\n\n<ul>\n<li>Drive profitable revenue growth though new business development for advanced analytics and data science opportunities in Hi-Tech space.</li>\n<li>At least 12-15 years of professional experience; 10 years of selling and delivering large multi-year analytics deals to Hi-Tech companies in US.</li>\n<li>Hands-on analytical modeling experience in any of the data science platforms such as R, Python, SAS, Alteryx, Spark ML, Azure ML, Tensorflow etc. Exposure to newer technologies like Databricks, Data Robot, H2O desired.</li>\n<li>Exposure and understanding of third party / syndicated data like Nielsen, IRI, Epsilon, Experian, Comscore etc. Knowledge of DMP platforms like Krux, BlueKai will be a plus.</li>\n<li>Experienced in all areas of advanced analytics including descriptive, diagnostic, predictive and prescriptive analytics</li>\n<li>Should be able to collaborate effectively across a large global organization to deliver the right analytics solutions to our Hi-Tech clients.</li>\n<li>MBA/Masters/Bachelor's degree in Statistics, Mathematics, Econometrics or Operations Research. PhD preferred</li>\n<li>Good knowledge of AI/ML techniques, application of AI/ML in Robotic Process Automation (RPA), deep learning techniques and application.</li>\n<li>Up to 50% or more travel may be expected</li>\n<li>Develop contact matrix and establish strong relationships with marketing heads, category managers, brand managers, product managers, eCommerce heads, Chief Analytics Officers (CAO) and other business leaders in the retail and consumer space.</li>\n<li>Develop and lead strategic relationships with niche analytics solution providers, cultivate new alliances locally and globally, and monitor competitor activity in North America with a view of looking establishing joint ventures and alliances or acquisitions in this area</li>\n<li>Develop account relationships, find opportunities and bring together analytics opportunities at strategic accounts within assigned geography or industry.</li>\n</ul>"}