{"job title": "Web Analytics consultant IV", "company": "Collabera", "city state": "– San Antonio, Texas", "rating": "3.9", "job description": "<p> </p><p> <b> Job Description</b> </p> <p></p> Title: Web Analytics consultant IV<br> Assignment Duration: 6 months<br> Potential to Extend: Yes<br> Potential to Convert: Yes<br> Work Location: San Antonio <br> Interview Process: First round screen followed by second round technical screen. <br> <br> Responsibilities:<br> •Own creation of a robust set of standards and baseline for Web Analytics (GA) adoption and onboarding GA for all existing and new platforms at Rackspace. Goal is to integrate analytics capabilities into the Platform to capture customer and performance data that will drive future feature enhancements<br> •Work with stakeholders across the business to evaluate analytics needs and formulate a plan for identifying gaps, recommending changes towards baseline adoption and measurement moving forward<br> •Consult with various engineering teams to bring customer-facing web applications in line with expected analytics practices while required needed development effort<br> •Review the Big Query data we receive and help parse the information for the origination<br> •Set up reporting, etc. and help run knowledge management experiments <p> </p><p> <b> Job Requirements</b> </p> <p></p> Required Skills (and years of experience)<br> •2+ years of experience using Web Analytics in an enterprise situation. Knowledge of best practices in creating an analytics set up, presenting data in an accessible format, and optimizing usage to keep costs under control.<br> •4+ Experience with modern front end technologies (HTML5, JavaScript/ES6, CSS, frontend libraries such as ReactJS and AngularJS) in an enterprise environment<br> •2+ Experience creating powerful, informative reports that bring actionable data to decision-makers across the business<br> •Bachelors degree in computer science or related field"}