{"job title": "Enterprise Data Consultant", "company": "First Citizens Bank &amp; Trust Company", "city state": "– Raleigh, NC", "rating": "3.4", "job description": "<strong>Position Description:</strong> \n<br>\nThe Enterprise Data Consultant takes action on the strategic initiatives associated with improved data quality, governance, analytics modernization, and enterprise data warehouse (EDW) support for all functions within First Citizens Bank Enterprise Data Management (EDM). Reporting to the Enterprise Data Manager, this role will partner closely with business stakeholders, IT, and Data Stewards on EDM initiatives.\n<br><br>\n<strong>Position Requirements:</strong> \n<br>\n<strong>Basic Qualifications:</strong>\n<br>\nPost graduate degree with 2 years of experience in data management, analytics or similar.\n<br><br>\n<strong>OR</strong>\n<br><br>\nBachelor degree with 4 years of experience in data management, analytics or similar.\n<br><br>\n<strong>Additional Requirements:</strong>\n<br>\n? Strong collaboration and project management mindset.\n<br>\n? Previous involvement with data management initiatives (data profiling, data quality, stewardship, governance, MDM, etc.)\n<br>\n? Strong understanding of data warehousing and transformation/ETL.\n<br>\n? Understanding of Base SAS programming, SAS Enterprise Guide, Cognos, or Similar.\n<br>\n? Understanding of data lineage documentation and ETL processes.\n<br>\n? The ability to lead, make decisions and drive results that positively impact productivity, efficiency, overall customer service levels, and enhance company profitability.\n<br>\n? Knowledge of current and future technologies and trends impacting the financial service industry\n<br>\n? Ability to be a strong advocate for process and technology improvement.\n<br>\n? Ability to influence decision makers, drive consensus and broker solutions between parties with competing or potentially conflicting requirements.\n<br>\n? Ability to effectively present information and respond to questions from business customers at all levels.\n<br>\n? Passion for innovation and continuous improvement and ability to effectively drive change.\n<br>\n? Strong working knowledge of MS Office Suite including MS Project.\n<br>\n? Strong oral and written communication skills.\n<br>\n? Heightened sense of urgency and the ability to handle multiple priorities.\n<br>\n? Position requires strong organizational skills, a high level of detail, advanced spreadsheet and database knowledge.\n<br><br>\n<strong>Other Preferred Qualifications:</strong>\n<br>\n? Graduate degree\n<br>\n? Experience with IBM InfoSphere Information Management suite or similar\n<br>\n? Knowledge of banking systems\n<br><br>\nCompany Description:<br><br>Founded in 1898 and headquartered in Raleigh, N.C., First Citizens Bank serves customers in 18 states and the District of Columbia. For over 100 years, customers have trusted First Citizens with their money … and their futures. Today, First Citizens is the largest family-controlled bank in the nation and the sixth-largest bank franchise headquartered in the Southeast with more than $30 billion in assets. We employ more than 6,000 associates who are focused on helping our customers achieve a lifetime of success. First Citizens operates more than 570 branches in Arizona, California, Colorado, District of Columbia, Florida, Georgia, Kansas, Maryland, New Mexico, Missouri, North Carolina, Oklahoma, Oregon, South Carolina, Tennessee, Texas, Virginia, Washington and West Virginia.\n<br><br>\nFirst Citizens Bank. Forever First®. Member FDIC.\n<br><br>\nEqual Opportunity/Affirmative Action Employer/Minority/Female/Disability/Veteran\n<br><br>\nIf you need special assistance or an accommodation in applying for employment at First Citizens Bank, please contact our Human Resources department."}