{"job title": "Senior Data Analyst", "company": "Iconma, L.L.C.", "city state": "– Round Rock, TX", "rating": "3.4", "job description": "Senior Data Analyst\n<br><br>\nLocation: Round Rock, TX\n<br><br>\nDuration: 6 months with possible contract to hire\n<br><br>\n<strong>Description:</strong>\n\n\n<ul>\n<li>Client PowerEdge group developed a well-respected in-house big-data oriented server planning and analysis system. Candidate will be responsible to improve upon and extend the boundaries of the current scope of client's server based business data analytics. This position requires data discovery, analysis of relevant data sets, driving user requirements through multiple business units and implementing new features in the system. You will be part of a small team within the server product group providing subject-matter expertise for business analytics.</li>\n</ul>\n\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Build on and improve existing system planning, SQL Server data cube development, output</li>\n<li>Discover data sets and extend the dashboard including server, storage and network products</li>\n<li>Research, document data sources and impacted targets creating process rules &amp; flows</li>\n<li>Use business rules and processes to design/implement data quality rules</li>\n<li>Work in a global team environment and serve as technical/data subject matter expert for projects related to server product management, engineering and quality.</li>\n<li>Recommend and drive cross-functional continuous improvement opportunities</li>\n<li>Understand business process management and business requirements of the customers and be able to translate to BRDs, data mapping specs, and create business cases</li>\n<li>Understand and translate specific business requirements - Extract, evaluate, and summarize transactional and referential data</li>\n<li>Perform ad-hoc analysis of large data sets; participate in special projects</li>\n<li>Recommend methods to improve the use of data within specified areas as well as across the enterprise including existing dashboards and visualization</li>\n<li>Ensure that the data governance standards are adhered to support data integrity</li>\n</ul>\n\n<strong>Required Qualifications:</strong>\n\n\n<ul>\n<li>Bachelor's degree in Computer Science, Actuarial Science, Math or related field</li>\n<li>3-5 years of requisite experience</li>\n<li>Minimum of 2 year experience working as a data analyst</li>\n<li>Skilled in Tableau, proficiency in Visio, MS SQL, BI analysis/visualization tools, Excel, PowerPoint, Access, Excel Pivot.</li>\n<li>Skilled at writing advanced SQL queries, stored procedures</li>\n<li>Ability to tell a story using high quality data visualization</li>\n<li>Excellent analytical, quantitative and problem solving skills.</li>\n<li>Familiarity with software development languages in particular, R and Python is a plus</li>\n<li>Skilled in Tableau, proficiency in Visio, MS SQL, BI analysis/visualization tools, Excel, PowerPoint, Access, Excel Pivot.</li>\n<li>Skilled at writing advanced SQL queries, stored procedures.</li>\n<li>Ability to tell a story using high quality data visualization.</li>\n<li>Excellent analytical, quantitative and problem solving skills.</li>\n<li>Familiarity with software development languages in particular, R and Python is a plus.</li>\n</ul>\n\n\"A successfully completed background check will be required; which will include a criminal history search in the current jurisdiction residing and is employed as well as in each jurisdiction where resided or been employed over the past seven (7) years. A 5 panel drug screen will also need to be successfully completed.\"<br><br>SDL2017"}