{"job title": "Quantitative Research Manager", "company": "Insight Strategy Group", "city state": "– New York, NY", "rating": "2.7", "job description": "Do you enjoy thinking about why people behave the way that they do? Are you intrigued by the way that data can describe the world and answer challenging questions? Are you interested in designing and executing research to learn about everything from television shows to power-tools? If so, Insight might be the right place for you.\n<br><br>\nABOUT THE COMPANY\n<br><br>\nBased in New York City, Insight Strategy Group (www.insightstrategygroup.com) is a leading research and strategy agency that decodes consumer insights to fuel brand growth, new product introductions, and service and content innovation. Leveraging deep expertise anchored in social sciences, our core services include segmentation and targeting strategy, brand positioning and tracking, product innovation and testing, and customer experience strategy. We are a go-to-partner for media and entertainment clients, and also have established industry practices in lifestyle, consumer goods, retail, and services businesses, as well as a pre-eminent youth practice.\n<br><br>\nPOSITION OVERVIEW\n<br><br>\nInsight seeks future leaders who demonstrate the potential to become highly skilled strategists, with a particular focus on the underlying psychological and social motives behind consumer behavior. We are currently looking for a Quantitative Research Manager, who will design and apply quantitative methods to projects covering branding, segmentation and targeting strategy, and product/experience innovation. The position requires a comprehensive understanding of primary quantitative research design, related analytical methods, and experience applying these techniques to business challenges. Day to day tasks include:\n<ul>\n<li>Project management of ongoing studies</li><li>Client management and communication</li><li>Analysis of quantitative and qualitative research</li><li>Report and materials creation, including strategic recommendations and implications</li>\n</ul>\nJOB REQUIREMENTS\n<br><br>\nThe ideal candidates should:\n<ul>\n<li>Have a graduate degree in the business, marketing, or the social sciences (e.g., psychology, sociology)</li><li>Be curious about people, what drives them, and why they do what they do</li><li>Be a creative thinker and a proactive problem solver</li><li>Have strong communication skills</li><li>Have the desire and willingness to work as part of a team</li><li>Be adept at working in a fast-paced environment and managing multiple priorities</li><li>Completely proficient in Microsoft Office, particularly Excel and PowerPoint</li><li>Familiar with factor analysis; perceptual mapping; linear regression</li><li>2 to 6 years of experience at a market research firm, a brand or innovation consultancy, the planning group of an advertising agency, or in a market research capacity on the client side</li>\n</ul>\nSalary commensurate with experience.<br><br><strong>Job Posted by ApplicantPro</strong>\n<br>"}