{"job title": "Quantitative Researcher Summer Analyst", "company": "ITG", "city state": "– New York, NY", "rating": "3.4", "job description": "<strong>OVERVIEW:</strong>\n<br><br>\nITG is looking for a technical, driven and innovative student to join our Execution Services team.\n<br><br>\nHere at ITG, technology is our middle name. Literally. With nearly half of our staff working in technology roles, our technologists empower our business to provide best-in-class service to our clients around the world. From conceptualizing ideas to bringing them to market, ITG Researchers work alongside our business units to build technology for institutional traders that enables them to improve returns for investors.\n<br><br>\n<strong>WE'LL TRUST YOU TO:</strong>\n\n\n<ul>\n<li>Develop execution strategies using statistical and machine learning algorithms and supporting a team in consulting with clients to improve trading strategy</li>\n<li>Perform econometric analysis on trade data</li>\n<li>Assist with consolidating and interpreting data for client requests</li>\n<li>Analyze algorithmic trading data and make recommendations</li>\n<li>Participate in research on algorithmic trading, liquidity management and market microstructure</li>\n<li>Support the design of new products/document functional requirements and acceptance tests</li>\n</ul>\n\n<strong>WHAT YOU BRING WITH YOU:</strong>\n\n\n<ul>\n<li>Master's or PhD degree in Statistics, Computer Science, Financial Engineering, Financial Mathematics, Finance, Economics or related quantitative disciplines from a top university</li>\n<li>Experience in Machine Learning with a focus on Deep Learning, Intermediate programming skills (Python, R, C, C/C++ SQL)</li>\n<li>Experience in financial modeling or software design/development</li>\n<li>Strong communication abilities with a demonstrated interest in financial markets</li>\n<li>Familiarity with time series analysis and the models of market microstructure and financial econometrics is desired</li>\n</ul>\n\n<strong>YOU'RE JUST RIGHT FOR ITG IF YOU WANT:</strong>\n\n\n<ul>\n<li>Exposure to different technologies and projects with quick life cycles, from concept to client in three months</li>\n<li>A smaller team environment</li>\n<li>A great place for upward and geographic mobility</li>\n<li>Direct exposure to the decision makers and senior leaders on the business side</li>\n<li>A company that's investing a sizable amount in its technology department</li>\n<li>Teams that are passionate about continually learning, improving and raising the bar</li>\n<li>A community that values hard work as well as work-life balance</li>\n<li>A company that is committed to giving back to surrounding communities, from LA to Hong Kong and Sydney and the 11 locations in between</li>\n</ul>"}