{"job title": "Machine Learning Scientist", "company": "Smiths Detection", "city state": "– Newark, NJ", "rating": "2.8", "job description": "<strong>Job Description</strong>\n<br><br>\nAs a Machine Learning Scientist in the Imaging Group, you will work within a team of scientists and software engineers on finding machine learning solutions to CT reconstruction and image classification problems. Your technical contributions will address current market needs and drive the design of our next generation computed tomography (CT) explosives detection systems. Team members in our group work on a wide range of projects including ones that collaborate with vendors, agencies, and academia. The candidate must have good communication skills and the ability to effectively present their technical work to a broad audience.\n<br><br>\nDuties and Responsibilities\n\n\n<ul>\n<li>Research, design, prototype, and test machine learning solutions.</li>\n<li>Use existing tools&amp;software to devise and perform experiments pertaining to CT system design&amp;analysis.</li>\n<li>Enhance software modules according to project requirements.</li>\n<li>Complete project deliverables, shifting priorities as needed.</li>\n<li>Report results to multidisciplinary audiences, both technical and non-technical.</li>\n<li>Adapt and grow into new responsibilities over time.</li>\n</ul>\n\nRequired Skills and Experience\n\n\n<ul>\n<li>Masters or greater in Applied Mathematics, Electrical Engineering, Physics, Imaging Science or related field.</li>\n<li>Minimum 2 years experience in software development using C or C++.</li>\n<li>Familiarity with machine learning models and frameworks such as Tensorflow, SciKit-Learn, Matlab Statistics and Machine Learning Toolbox, etc.</li>\n<li>Proven ability in scientific analysis, testing, and problem solving.</li>\n<li>Strong written and verbal communication skills. Able to present ideas and material clearly and concisely, to both technical and non-technical audiences.</li>\n<li>Technically flexible. Able to work on multiple simultaneous projects and learn new material quickly.</li>\n<li>Must be eligible and willing to apply for US Security Clearance. Typically this requires United States Citizenship.</li>\n<li>Must submit your application for employment through the Smiths Detection website to be considered.</li>\n<li>Must be 18 years or older.</li>\n<li>Must be willing to take a drug test as part of the selection process.</li>\n<li>Must be willing to submit to a background investigation as part of the selection process.</li>\n<li>Must be willing to submit to a government background investigation as part of the selection process.</li>\n<li>Must have unrestricted authorization to work in the United States.</li>\n<li>Must be willing to work out of an office in Newark, CA</li>\n</ul>\n\nAbout Us\n<br><br>\nAt Smiths Detection we are dedicated to making the world a safer place.\n<br><br>\nSmiths Detection, a division of Smiths Group, is a global authority on the application, management and manufacture of world class detection and screening technology.\n<br><br>\nWe deliver solutions needed to protect society from the threat and illegal passage of explosives, prohibited weapons, contraband, toxic chemicals, and narcotics. Delivering an unrivalled range of detection technologies, we support customer from markets across air transportation, ports and borders, the armed forces, and critical i"}