{"job title": "Clinical Research Scientist - Heart and Vascular Institute", "company": "Swedish Health Services", "city state": "– Seattle, WA", "rating": "3.5", "job description": "Swedish Medical Group is looking for a Clinical Research Scientist (0.5 FTE, Day Shift) to work in Heart and Vascular Institute at Swedish Cherry Hill in Seattle, WA.\n<br><br>\nThe goal of the clinical research scientist will be focused on assessing and improving quality across the Advanced Cardiac Support Program (ACS) and heart failure management in general across the Swedish System.\n<br><br>\n<strong>In this position you will:</strong>\n\n\n<ul>\n<li>Employs a broad and advanced knowledge of principles, practices, and procedures in clinical area of expertise to plan, coordinate, and conduct research.</li>\n<li>Responsible for the development, oversight, conduct, and administration of clinical databases and defined programs of non-industry based research within the Department.</li>\n<li>Identify patient for protocols in which the ACS program is enrolling.</li>\n<li>Responsible for obtaining funding to implement research project or study in conjunction with Medical Director and Program Director.</li>\n<li>Supervise staff hired to perform duties required by funded study.</li>\n<li>Work with ACS staff to publish novel literature to help advance the field of heart failure management and medical systems of care.</li>\n<li>Perform other duties as required; participate in committees and projects as required.</li>\n</ul>\n\n<strong>Required qualifications for this position include:</strong>\n\n\n<ul>\n<li>Doctorate Degree in laboratory science or medical field, or equivalent experience.</li>\n<li>Minimum of five years of clinical experience, program development and research experience.</li>\n<li>Experience in academic research preferred.</li>\n<li>Working knowledge of computers (either DOS-based or Macintosh), standard office software packages (Word, WordPerfect, Lotus, Excel, Access, Power Point, etc.), statistical software packages including SPSS, SAS, MedCalc or equivalent, standard office equipment (photocopiers, facsimiles, telephones, pagers, etc.).</li>\n<li>Able to work independently.</li>\n<li>Fundamental understanding of scientific method and specialized methods and procedures in area of expertise.</li>\n<li>Fundamental understanding of research funding process and culture.</li>\n<li>Ability to manage emerging technology.</li>\n<li>Excellent communicator, both written and verbal.</li>\n<li>Able to successfully submit proposals to peer review bodies.</li>\n<li>Professional writing skills and presentation skills.</li>\n<li>Able to establish collaborations with scientists/researchers in other institutions.</li>\n<li>Able to independently develop procedures/protocols to test hypotheses.</li>\n<li>Thorough understanding of Human Subject protections and other research related regulations, biohazards and other environmental exposures as applicable.</li>\n<li>Proficient in good laboratory and/or clinical practices.</li>\n</ul>\n\nLicenses and Certifications for this position include:\n\n\n<ul>\n<li>Current ARNP licensure for Washington State.</li>\n</ul>\n\nAbout Swedish Medical Group\n<br><br>\nSwedish Medical Group (SMG) is a successful, performance-driven division of Swedish Health Services, the largest non-profit health provider in the Greater Seattle area. The SMG network includes more than 900 providers across more than 130 primary care and specialty care clinics."}