{"job title": "Data Analyst", "company": "Telecommunication Systems", "city state": "– Seattle, WA", "rating": "2.8", "job description": "Data Analyst\n<br><br>\nSeattle, WA\n<br><br>\nFull Time\n<br><br>\nCome to Seattle, WA, to Help Build Public Safety Solutions with Comtech!\n<br><br>\nTo learn more about Comtech Telecommunications (CMTL), visit our website at www.Comtech911.com .\n<br><br>\nYou can see the big picture, and get excited about supporting and maintaining applications that support emergency 9-1-1 (E911) systems. You also crave an opportunity to work with the best and brightest software development teams, in an environment that is rewarding and collaborative.\n<br><br>\nYour New Opportunity\n<br><br>\nThe MSAG Data Analyst position's primary responsibility is to support carrier service providers with address validation issues. The analyst works in a collaborative team environment and is responsible for Comtech address data vendor outreach to resolve issues by auditing and resolving fallout in a 911 customer-critical address data set. The analyst will also manage a reference address data set from end-to-end, beginning with collection of the source data, processing data using Oracle SQL and other database tools, loading data into an Oracle database, validating address datasets, preforming fallout resolution, and many ad hoc reporting and troubleshooting requests. The analyst's overall objective is to ensure that Comtech's address validation maintains the highest accuracy, which is used in routing critical 911 calls.\n<br><br>\n<strong>PRIMARY DUTIES:</strong>\n<br><br>\nThe data analyst will be responsible for increasing the accuracy of the databases over time, including:\n\n\n<ul>\n<li>Provide customer support for address validation issues.</li>\n<li>Resolve data inconsistencies, conflicts, inaccuracies, and other fallout of customer submissions.</li>\n<li>Provide reporting and feedback to Comtech's customers regarding address data inconsistencies.</li>\n<li>Create and provide Ad-Hoc reporting on-demand.</li>\n<li>Identify and create methods for proactively identifying potential fallout.</li>\n<li>Ensure the accuracy and level of information provided to the customer; supports the business requirements.</li>\n<li>Identify data inconsistencies and conflicts in address data sets.</li>\n<li>Co-ordinate with address data set vendors to resolve inaccuracies and data inconsistencies.</li>\n<li>Identify and perform detailed analysis of all data sources for each application and subject area.</li>\n<li>Provide detailed analysis of all data loaded into the database, based on validation successes and failures.</li>\n<li>Assist in development of the business rules and accuracy targets associated with the data.</li>\n<li>Identify achievable and aggressive targets for maximizing data accuracy and minimizing fallout.</li>\n<li>Create and deliver management-level reporting to communicate fallout and testing results.</li>\n<li>Provide the data mapping and associated transformation rules for each data item.</li>\n<li>Work with internal teams to learn and support 911 specific business processes.</li>\n</ul>\n\n<strong>AS A MSAG DATA ANALYST YOU WILL HAVE THE FOLLOWING EXPEIRENCE/SKILLS/EDUCATION:</strong>\n\n\n<ul>\n<li>Must be able to work in both Windows desktop and Unix command line environments</li>\n<li>Must have advanced experience with MS Office, specifically Excel and Access</li>\n<li>Experience using databases and tables to perform analysis and reporting required</li>\n<li>Exhibit strong verbal and written communication skills</li>\n<li>Display high levels of self-motivation, ability to self-direct and take ownership</li>\n<li>Critical, creative, and conceptual thinking abilities</li>\n<li>Ability to manage multiple tasks and function as part of a team</li>\n<li>4-year college degree or equivalent and a minimum 2 years data analysis experience</li>\n</ul>\n\n<strong>ADDITIONAL VALUED CAPABILITIES INCLUDE:</strong>\n\n\n<ul>\n<li>Experience using Oracle, mySQL, or other RDBMS a plus</li>\n<li>Familiarity using geographic data sets and GIS a plus</li>\n</ul>\n\nComtech is an Equal Opportunity Employer\n<br><br>\n<strong>Are you a returning applicant?Previous Applicants:Email:Password:</strong>\n<br><br>\nIf you do not remember your password click here.\n<br><br>\nBack to Search Results\n<br><br>\nNew Search"}