{"job title": "Hospital Data Scientist/Data Analyst (Technical Solutions Design Specialist - Analytics)", "company": "Abbott", "city state": "– Illinois", "rating": "3.5", "job description": "At Abbott, we're committed to helping people live their best possible life through the power of health. For more than 125 years, we've brought new products and technologies to the world -- in nutrition, diagnostics, medical devices and branded generic pharmaceuticals -- that create more possibilities for more people at all stages of life. Today, 99,000 of us are working to help people live not just longer, but better, in the more than 150 countries we serve.\n<br><br>\n<strong> <strong> JOB DESCRIPTION:</strong></strong>\n<br><br>\n<strong> Job Summary</strong>\n<br><br>\nThe Hospital Data Scientist/Data Analyst (Internal Job Title: Total Solution Design Specialist - Hospital Data Analytics) strengthens Abbotts value proposition by enabling our customers to better make data driven decisions to impact hospital financial and clinical performance. Supports customers with harmonizing and mobilizing data from various inputs into insights and strategies. Understands and communicates hospital data use best practices that impact long-term strategy, financial outcomes or patient care.\n<br><br>\n<strong> Position Impact to Business</strong>\n<br><br>\nResponsible for creating revenue through novel data services. Examples include improving utilization of health resources, using data to assess operational or clinical performance, converting clinical data into a sellable product to payers, or generally leveraging data for population health initiatives.\n<br><br>\nTravel: 40% (US only)\n<br><br>\n<strong> Key Success Factors</strong>\n<li> Harmonize, organize, and mobilize data sources to derive unique strategic insights.</li> <li> Comprehensive understanding of hospital data systems to include EMRs, HISs, LISs, ERPs, etc.</li> <li> Ability to interface CIOs and other C-level executives to understand needs, identify data sources, and develop data harmonization strategies.</li>\n<strong> Ideal/Highly Preferred Experience:</strong>\n<li> 5 or more years of hospital Data Scientist or hospital Data Analyst experience, e.g. analyzing data from hospital EMR and other data sources to provide insights to healthcare customers.</li>\n<strong> Requirements</strong>\n<li> Bachelor's Degree in data analysis, business analytics or related discipline.</li> <li> 5 years of experience working with Big Data/Analytics in the healthcare field.</li>  <li> Lab or hospital experience is preferred.</li>"}