{"job title": "Data Analyst - Apprentice", "company": "Amey Plc", "city state": "– Maybee, MI", "rating": "3.2", "job description": "Amey Apprenticeship Programme Our Amey Apprenticeship Programme provides all of the skills, experience and support required to kick start your career, or to branch out in a new direction! From the beginning of your programme you'll have full exposure to all elements of your chosen role, giving you the best opportunity to learn from experience. Whilst working, you'll undertake a nationally recognised qualification; providing the theoretical background to your work. At Amey we strongly support the development of our people; we therefore offer you a permanent contract from day one. Role Overview The primary role of a Data Analyst is to collect, organise and study data to provide business insight. Data analysts are typically involved with managing, cleansing, abstracting and aggregating data, and conducting a range of analytical studies on that data. They work across a variety of projects, providing technical data solutions to a range of stakeholders/customers issues. They document and report the results of data analysis activities making recommendations to improve business performance. They have a good understanding of data structures, database systems and procedures and the range of analytical tools used to undertake a range of different types of analysis. What are we looking for? We treat people as individuals. We want a range of abilities, from practicality and problem solving to precision and creativity. That goes for diversity too. We want a workforce as diverse as the communities we serve and value the experience that you bring to our business. You'll also have: • At least 5 GCSEs, equivalent A levels, Level 3 Apprenticeship or relevant qualifications and experience. • You don't need specific previous experience but you should be comfortable working on a computer and using Microsoft Office • Excellent teamwork skills • A willingness to learn and keen to progress • Ability to juggle multiple tasks Benefits What makes this role unique? The Apprentice scheme offers enhanced skills development, on-the-job continuous learning, support towards further academic qualifications, participation in the Duke of Edinburgh Business Scheme (Gold Award), and an opportunity to be part of the wider Amey Apprentice community. We place great value on all our people and the contribution they make to our business, that's why we offer a competitive Apprenticeship Programme. Your starting salary will be competitive to the National Apprenticeship Minimum Wage, and you may be eligible to receive performance related pay increases whilst on the programme. We as a business will support you every step of the way; we even have a dedicated HR Manager to guide you through and mentor your progress! Amey is an equal opportunities employer.<br><br>SDL2017"}