{"job title": "Business and Data Quality Analyst", "company": "Catholic Relief Services", "city state": "– Baltimore, Maryland", "rating": "4.0", "job description": "<strong>Job Summary</strong>\n<br><br>\nUS Church Engagement is seekinge a strong and dynamic Business &amp; Data Quality Analyst as a member of its Quality Assurance team. This unit is an integral member of the agency\\u0027s US-based church engagement and advocacy efforts, and supports multiple teams across units by maintaining a clean and updated database and building out the divisions\\u0027 technical and Customer Relationship Management (CRM) capacity by leveraging its CRM system, Salesforce, among other areas and platforms.\n<br><br>\nThis position will support the division\\u0027s business lead and data manager in managing quality assurance standards and processes, project management and business analysis, along with communications and administrative support. This role will require coordination with various US Church Engagement programs including University Outreach, Government and Advocacy Relations, Ethical Trade, Rice Bowl, and others, in addition to colleagues across GKIM (IT department), Charitable Giving and other agency departments.\n<br><br>\nIn this position, the Business Analyst will manage the following components of the QA team\\u0027s responsibilities:\n<br><br>\n<strong>Data Quality</strong>\n<br><br>\nManage and support all quality assurance efforts pertaining to the system, including but not limited to:\n\n<ul>\n<li> Maintain accuracy and integrity of the CRM by establishing a regular system of checks on records, ensuring coding and configuration of the data, and monitoring and taking responsibility of data cleansing and security activities.</li><li> Conduct and respond to regular quality assurance audits of all pertinent data and ensure that regular data quality processes are adhered to throughout the division;</li><li> Regularly test and assess integrations and data loads with multiple third-party data sources, including our Digital Marketing System and Donor Databases and regular data loads from program sources (Ethical Trade, Rice Bowl, etc.);</li><li> Routinely address data quality concerns and make recommendations when enhancements to business processes or standards could improve the health of the CRM;</li><li> Auditing processes and controlling data integrity across all areas of the CRM and advising/taking on preventive/cleaning measures;</li><li> Contact authors of source documents or data to address data inconsistencies and to gather missing data.</li><li> Address other data quality projects or tasks as assigned.</li><li> Write, maintain and enforce, with support from unit head and managers, all data-related procedures and protocols, based on agency needs and best practices. Also ensuring that these processes are updated and communicated as necessary.</li>\n</ul>\n\n<strong> Business Analysis</strong>\n\n<ul>\n<li> Coordinate intake processes and documentation for gathering business requirements (creating use cases, workflow diagrams, etc.) of change requests, maintenance requests, and larger projects, including the facilitation of discovery meetings to capture business process/ reporting requirements and user stories that can be translated to a technical development team (internal IT/GKIM department and/or external vendors).</li><li> Provide documentation and testing support for all Salesforce related projects and ongoing maintenance at ongoing intervals.</li><li> Participate in design walkthroughs; functional and user acceptance testing test plans and implementation sessions.</li><li> Lead testing efforts during development and testing phases for any new features, updates or enhancements or modules in the CRM.</li>\n</ul>\n\n<strong> Communications and Administrative Support</strong>\n\n<ul>\n<li> Regularly develop and communicate project progress reports to key stakeholders.</li><li> Develop communications related to new system features and functionality.</li><li> Generate basic reports for end users as needed in Salesforce.</li><li> Perform administrative duties as needed.</li>\n</ul>\n\n<strong>REQUIREMENTS</strong>\n\n<ul>\n<li> Bachelor\\u0027s degree in business, information technology, or related field required, Masters preferred.</li><li> Minimum of two years related experience as business analyst, project manager, or in similar role.</li><li> Experience with Salesforce or other CRM systems (Microsoft Dynamics) highly preferred</li><li> Technology savvy and great attention to detail;</li><li> Advanced skills in of MS Outlook for communications and MS Office tools (Word, Excel, Visio, PowerPoint, SharePoint); BPM tools; databases and BI tools (e.g. SQL, Tableau); and JIRA is a plus;</li><li> Experience with all phases of the SDLC (systems development life cycle) and Agile development preferred.</li><li> Working knowledge of office equipment and computer hardware and peripheral devices;</li><li> Good command of English both written and verbal.</li>\n</ul>\n\n<strong>Key Skills:</strong>\n\n<ul>\n<li> Teach your colleagues what you know, patiently and compassionately;</li><li> Demonstrate a proactive and can-do attitude, while managing a sense of humor;</li><li> Show follow-through, efficiency, and mastery of detail;</li><li> Manage multiple projects with varying deadlines in a complex work environment;</li><li> Demonstrate strong analytical and effective problem-solving skills;</li><li> Proactively seek out optimization opportunities and recommend ongoing improvements;</li><li> Communicate technical solutions to non-technical audiences.</li>\n</ul>\n\n<strong>Agency-wide Competencies (for All CRS Staff)</strong>\n<br><br>\nThese are rooted in the mission, values, and guiding principles of CRS and used by each staff member to fulfill his or her responsibilities and achieve the desired results.\n\n<ul>\n<li> Serves with Integrity</li><li> Models Stewardship</li><li> Cultivates Constructive Relationships</li><li> Promotes Learning</li>\n</ul>\n\n<strong>Key Working Relationships</strong>\n<br><br>\nInternal: All US Church Engagement departments, Government Relations and Advocacy, GKIM, Charitable Giving Analytics teams and Donor Services, and more.\n<br>\nExternal: Vendors and consultants\n<br><br>\nPhysical Requirements/Environment: Standard office environment\n<br><br>\nForeign Language Required: None\n<br><br>\nDisclaimer Clause: This job description is not an exhaustive list of the skill, effort, duties, and responsibilities associated with the position.\n<br><br>\nNote: All candidates must be eligible to work in the US at the time of application.\n<br><br>\nEOE<br><br>Catholic Relief Services carries out the commitment of the Bishops of the United States to assist the poor and vulnerable overseas. Our Catholic identity is at the heart of our mission and operations. We welcome as a part of our staff and as partners people of all faiths and secular traditions who share our values and our commitment to serving those in need."}