{"job title": "Master Data Analyst", "company": "Community Health Systems", "city state": "– Nashville, TN", "rating": "2.6", "job description": "<ul>\n<li>*Description:**</li>\n</ul>\n\nCHSPSC, LLC is one of the leading operators of general acute care hospitals. The organization's affiliates own, operate, or lease 137 hospitals in 21 states, with an aggregate of approximately 22,000 licensed beds. The consolidated organization owns and leases community hospitals that offer quality, cost-effective healthcare including a range of inpatient medical and surgical services, outpatient treatment, and skilled nursing care. In over 60 percent of the markets served, CHSPSC, LLC-affiliated hospitals are the sole provider of healthcare services.\n<br><br>\nCHSPSC, LLC seeks a **Master Data Analyst** for its **Antioch, TN** , headquarters **Supply Chain Services** team.\n\n\n<ul>\n<li>*Summary:**</li>\n</ul>\n\nThis position will support operations by monitoring and analyzing master data, key data, and master relationship data within the organization. Ensures master data integrity in key systems as well as maintaining processes to support overall master data quality. The Master Data Analyst services as a point of contact for the organization for the submission of supplier requests, supplier updates and contract data.\n\n\n<ul>\n<li>*Essential Duties and Responsibilities:**</li>\n</ul>\n\n?Assists the master data management team to ensure system data integrity\n<br><br>\n?Identify areas for data quality improvements to resolve quality issues through error detection, correction, process control, improvement and/or process re-design strategies\n<br><br>\n?Build and maintain items and contracts within Lawson\n<br><br>\n?Conduct data cleansing to rid the system of old, unused, inaccurate or duplicative data.\n<br><br>\n?Collaborates with subject matter experts and data stewards to define and implement data strategy, policies, controls, and programs to ensure the Global data is accurate, complete, secure, and reliable\n<br><br>\n?Support item/ vendor master maintenance, General Ledger (GL) category maintenance, item agreements, template creation, and Requestor/Location/Par Location setup\n<br><br>\n?Demonstrate an understanding of the data maintenance impact upon clinical and business process operations\n<br><br>\n?Work with Accounts Payable and Purchasing team members to identify master data related improvement opportunities\n<br><br>\n?Maintain a consistent taxonomy for new item and contracts master data\n<br><br>\n?Contribute to requirements for supplier and standard operating procedure (SOP)\n<br><br>\n?Upload, sort, and analyze item and contract data to ensure accurate data\n\n\n<ul>\n<li>*Qualifications**</li>\n<li>*Qualifications:**</li>\n</ul>\n\n?Bachelor Degree or equivalent relevant experience\n<br><br>\n?2-3 years Data Management experience or 5-10 years operating room technician experience\n<br><br>\n?Ability to understand the operational impact of data changes\n<br><br>\n?Excellent research, analytical and problem-solving skills\n<br><br>\n?Experience working with relational databases\n<br><br>\n?Good communication skills to communicate with customers, team members, external data providers, and management\n<br><br>\n?Proficient in Microsoft Excel\n<br><br>\n?Functional knowledge of SQL or ability to rapidly learn technical languages\n<br><br>\n?Lawson experience preferred but not required\n\n\n<ul>\n<li>*Job:** _Corporate Positions_</li>\n<li>*Organization:** _Supply Chain Shared Services Center_</li>\n<li>*Location:** _TN-Nashville_</li>\n<li>*Requisition ID:** _1844164_</li>\n</ul>\n\nThis organization does not discriminate in any way to deprive any person of employment opportunities or otherwise adversely affect the status of any employee because of race, color, religion, sex, sexual orientation, genetic information, gender identity, national origin, age, disability, citizenship, veteran status, or military or uniformed services, in accordance with all applicable governmental laws and regulations. In addition, the facility complies with all applicable federal, state and local laws governing nondiscrimination in employment."}