{"job title": "Recruiting Systems Project Specialist &amp; Data Analyst", "company": "Cornerstone OnDemand", "city state": "– Santa Monica, CA", "rating": "3.8", "job description": "We're looking for a\n<br>\nRecruiting Systems Project Specialist &amp; Data Analyst (Santa Monica, CA)\n<br><br>\nThis role isn’t for the traditional recruiter, sourcer, or executive researcher. This role isn’t for the content or unimaginative.\n<br><br>\nThis role is for someone who wants to interrupt the norm and make change. For someone who loves to implement process with efficiency, programs with creativity, technology with functionality and make BIG things happen!\n<br><br>\nThe right person for this position will need to have the ability influence others through collaboration, is drawn to tinkering with new technology, loves the stories they find in data and is someone that seeks to make a difference and celebrate with their team.\n<br><br>\nOne thing is for sure…in this position you will work with the BEST team of your life. We have fun together, have common goals, support one another and can stay closely connected across the globe.\n<br><br>\nIn this role you will….\n<br><br>\nStrategy\n\n\n<ul>\n<li>Partner with the Director, Talent Acquisition, create and execute recruiting technology strategies.</li>\n<li>Develop and manage recruiting analytics, trends and dashboards.</li>\n<li>Coordinate closely with executive and leadership teams to review and update headcount targets.</li>\n<li>Assess and improve processes and initiate programs in support of organizational goals and data needs.</li>\n<li>Calibrate and align the recruiting team to meet an established set of expectations in a highly-dynamic organization.</li>\n<li>Be responsible for the strategic development, training and oversight of recruiting technology, tools, systems and recruiting workflows.</li>\n<li>Review and Determine new ways for CSOD to attract and hire the best candidates in the market.</li>\n</ul>\n\nExecution\n\n\n<ul>\n<li>Organize, manage, and drive the productivity of the recruiting teams data trend, utilization and technology strategies.</li>\n<li>Implement change management initiatives related to new recruiting systems, process, training and report/data roll-outs.</li>\n<li>Drive adoption, optimization and full utilization of all recruitment technology globally, specifically focusing on the Cornerstone OnDemand Applicant Tracking System. Efforts include:</li>\n<li>Facilitating on-going training, communication and education on system enhancements and compliance.</li>\n<li>Determining trends, insights an stories based on reporting to enhance process, experience and recruiter performance</li>\n<li>Collaborate and build partnerships with our Customer Enablement and Product teams.</li>\n<li>Oversee headcount management, analytics and company org charts.</li>\n<li>Lead daily operations and recruiting projects throughout the company.</li>\n<li>Drive and support ad hoc regional/global projects/programs and initiatives from conception to implementation.</li>\n</ul>\n\nYou’ve got what it takes if you have…\n\n\n<ul>\n<li>Experience creating and leading initiatives and programs. A plus if within HR and/or Talent Acquisition programs</li>\n<li>An analytical perspective that drives curiosity and creative solutions.</li>\n<li>Minimum of 2 years’ experience as an administrator and strong understanding of HR Technology and tools, including applicant tracking and candidate management and/or similar systems.</li>\n<li>The ability to analyze data to determine and deliver stories. With a minimum of 2 years’ experience in data manipulation and visualization in excel.</li>\n<li>A collaborative and leading work style, with the ability to influence others into action and lead out on creative solutions.</li>\n<li>Ability and drive to dream up innovative ideas and bring them to fruition.</li>\n<li>Passion for what you do, enthusiasm and charisma.</li>\n<li>The presence of a natural educator, teacher and avid learner.</li>\n<li>Thrive in an environment that is a mix of highly creative and uber tech.</li>\n<li>Excellent organizational skills; with the ability to discern critical items, judicious follow up and strong attention to detail.</li>\n<li>Demonstrated ability to multitask effectively, highly organized, direct and effective communicator.</li>\n<li>The skill to present, train and educate small to large groups, in person or via WebEx.</li>\n<li>A heightened sense of urgency without compromise to high quality standards.</li>\n<li>Experience collaborating effectively across various groups, regions, within an organization.</li>\n<li>Proficiency in Microsoft Office Products (Excel, PowerPoint, Word).</li>\n<li>Exhibit ability to work with minimum direction and in a fast-paced environment.</li>\n</ul>\n\nAn extra dose of awesome if you have…\n\n\n<ul>\n<li>Proven change management experience with Talent Acquisition focus.</li>\n<li>A demonstrated understanding of staffing standard operating procedures, guidelines and legal requirements.</li>\n<li>Global experience working in Talent Acquisition and/or Human Resources.</li>\n<li>Experience implementing and managing multiple projects, some large scale, at the same time and meeting established goals.</li>\n<li>Project Management certification.</li>\n<li>Knowledge of OFCCP reporting and process requirements.</li>\n<li>Technical background in HCM software</li>\n<li>Experience in Prezzy, Webex, social media community management, Photoshop and video editing tools.</li>\n</ul>\n\nAt Cornerstone we aren’t typical. That is why what is listed above isn’t everything. We want our tech savvy and visionary Recruiting Systems &amp; Program Manager to have the time to spend ideating, collaborating, researching and finding new ways for Cornerstone to stay at the forefront of recruiting. We are never settled and know we can continue to find new ways to connect with our candidates, improve their interview experiences with us and introduce them to the awesomeness that is CSOD.\n<br><br>\nIf you are excited about this opportunity, that is great! We are excited about it too! Apply now…what are you waiting for, we might be waiting for YOU!!!\n<br><br>\n<strong>Our Culture:</strong>\n<br><br>\nOur mission is to empower people, businesses and communities. A culture created less by what we do and more by who we are. When people are asked to describe the team, the answer is always the same: Smart, Cool, Dependable, and Visionary. We are not a typical tech company (even with our free massages, yoga studio, arcade, movie theatre, free breakfast and generous stock units), because, well, our employees aren't your typical techies...\n<br><br>\nWe're always on the lookout for new, curious and capable people who can help us achieve our goal. So if you want to work for a friendly, global and innovative company, we'd love to meet you! What are you waiting for?\n<br><br>\n<strong>What We Do:</strong>\n<br><br>\nCornerstone OnDemand (NASDAQ: CSOD) helps organizations to recruit, train and manage their people. We work with hundreds of the world’s largest companies—from Walgreens and Starwood Hotels &amp; Resorts to Deutsche Post DHL and Xerox—and thousands of smaller ones to help them engage their workforces and empower their people. Our software impacts every aspect of the employee experience, helping people to make their best work even better – which ultimately translates into greater business results.\n<br><br>\nOur software and services are in use by over 37 million people in 192 countries and in 43 languages.\n<br><br>\nCheck us out on Linkedin, The Muse, Glassdoor, and Facebook!\n<br><br>\nEqual Employment Opportunity has been, and will continue to be, a fundamental commitment at Cornerstone OnDemand. All qualified applicants are given consideration regardless of race, religion, color, gender, age, sexual orientation, national origin, marital status, citizenship status, disability, veteran status, or any other protected class as provided in applicable Federal, State, or Local fair employment laws. If you have a disability or special need that requires accommodation, please contact us at careers@csod.com."}