{"job title": "Data Integrity Analyst, Fiscal and Regulatory Management", "company": "Dana-Farber Cancer Institute", "city state": "– US-MA-Brookline", "rating": "4.0", "job description": "Overview<br><br>Located in Boston and the surrounding communities, Dana-Farber Cancer Institute brings together world renowned clinicians, innovative researchers and dedicated professionals, allies in the common mission of conquering cancer, HIV/AIDS and related diseases. Combining extremely talented people with the best technologies in a genuinely positive environment, we provide compassionate and comprehensive care to patients of all ages; we conduct research that advances treatment; we educate tomorrow's physician/researchers; we reach out to underserved members of our community; and we work with amazing partners, including other Harvard Medical School-affiliated hospitals.<br><br>Responsibilities<br><br><strong>GENERAL SUMMARY:</strong>\n<br><br>\nThe Data Integrity Analyst is responsible for ensuring the accuracy, quality, and hygiene of all gift and prospect-related data prior to commitment of the data to the ClearView and Sphere/Luminate prospect/gift database.\n<br><br>\nEmbodies Dana-Farber’s Core Values: Impact; Excellence; Compassion &amp; Respect; and Discovery every day. Adds value to the Dana-Farber community by seeking opportunities to collaborate across the Institute. Fosters an ethical, positive, results-oriented culture founded on open communication.\n<br><br>\nResponsible for assisting the entire Division in reaching financial goals.\n<br><br>\n<strong>PRIMARY DUTIES AND RESPONSIBILITIES:</strong>\n\n<ul>\n\n <li>Conduct thorough analysis of all gift batches in the ClearView prospect/gift database prior to database commitment; manually reviews a minimum of 20% of all transactions in each batch to ensure data integrity; executes a series of 150+ exception reports over all batches, identifies and corrects all identified gift and prospect record exceptions;</li>\n<li>Facilitate gift reconfiguration in the ClearView database ensuring that all adjustments comply with internal and external policy and auditing requirements; exclusive ClearView system privileges for this activity;</li>\n<li>Handle daily data clean-up in prospect systems, including daily exception reports, logging &amp; reporting of errors to manager;</li>\n<li>Act as a ClearView database gift code “Super User” for utilization of fund and appeal codes, understanding their role in the database, impact on the general ledger, impact on revenue reports, etc.;</li>\n<li>Develop expert understanding of all prospect and gift-related fields used to record prospect biographical, address, interest, connections, and other information into the Sphere/Luminate and/or ClearView databases;</li>\n<li>Record all identified errors by batch, type, and user; reports errors to manager;</li>\n<li>Assist with the training of Fiscal &amp; Regulatory staff members and others on DFCI’s gift processing policies and procedures. Manually proof 100% of training batches prior to database commitment;</li>\n<li>Identify, investigate, and correct duplicate prospect records found in ClearView, Sphere/Luminate, and other Development prospect/gift databases;</li>\n<li>Fulfill prospect requests to opt out of future development communications, solicitations, and mailings; update database records due to deceased notifications, name change, divorce and obituaries requests;</li>\n<li>Assist with prospect address and contact information hygiene;</li>\n<li>Conduct comprehensive research using Alumni Finder and other tools to ensure all prospect information is captured and current in the ClearView database;</li>\n<li>Assist in the reconciliation of data integrity reports with the Fiscal Department;</li>\n<li>Maintain highest level of prospect confidentiality and accountability.</li>\n</ul>\n<strong>SUPERVISORY RESPONSIBILITIES:</strong>\n<br><br>\nReports to the Assistant Director of Data Integrity.<br><br>Qualifications<br><br><strong>MINIMUM JOB QUALIFICATIONS:</strong>\n<br><br>\nBachelor’s degree preferred with 3-5 years of related experience.\n<br><br>\n<strong>KNOWLEDGE, SKILLS, AND ABILITIES REQUIRED:</strong>\n<br><br>\nThis position requires formal analysis and problem-solving abilities. Ability to prioritize workflow, train and motivate staff. Detail-oriented team player with excellent verbal, written language, organizational, and problem-solving skills. Strong reading and oral communication skills required. Experience with web-based gift databases preferred, and familiarity with Microsoft Outlook, Word, and Excel essential.\n<br><br>\n<strong>PATIENT CONTACT:</strong>\n<br><br>\nNo.\n<br><br>\n<strong>WORKING CONDITIONS:</strong>\n<br><br>\nTypically daytime; some evening and weekend work is required during peak times. Some use of personal vehicle for business purposes may be required.\n<br><br>\nDana-Farber Cancer Institute is an equal opportunity employer and affirms the right of every qualified applicant to receive consideration for employment without regard to race, color, religion, sex, gender identity or expression, national origin, sexual orientation, genetic information, disability, age, ancestry, military service, protected veteran status, or other groups as protected by law."}