{"job title": "Master Data Management (mdm) Analyst", "company": "Impact Makers", "city state": "– McLean", "rating": "3.8", "job description": "<div>Desired: Analysis SkillsBusiness Analysis<strong>Master Data Management (MDM) Analyst</strong>\n<br>\n<strong>McLean, VA</strong>\n<br>\n<strong>Travel: 50%</strong>:\n<br>\nImpact Makers is a mission-driven management and technology consulting company that delivers exceptional value to make an impact for our clients and the world. Our experienced teams help organizations manage transformation in IT, data, cloud and security with a focus on their customers and their people.\n<br><br>\nWe utilize our innovative business model to transform the business value of our work into social value for the community. Were committed to gifting 100% of our net profits to the community over the life of the company and our annual community contributions rival companies <strong>100x our size</strong>:.\n<br><br>\nWant to make an impact with us as an <strong>MDM Analyst within our Data Governance team</strong>:?\n<br><br>\n<strong>What youll do</strong> :\n<br>\nYoull play a critical business-facing role by being a central point of contact for master data needs within a clients data program. You will also be expected to play a significant role in educating the team on MDM best practices and leading in solution recommendations. Youll work as a liaison among stakeholders, team members, and IT to understand the relevant data and processes required to achieve the MDM business objectives. In addition, youll help identify opportunities for process and business improvement using the Impact Makers values approach to provide excellent services to all customers. You will:\n\n<ul>\n<li>Play a liaison role on designing and implementing Master Data Management solution across the organization.</li>\n<li>Develop and maintain clear and succinct documentation, such as data governance standards, processes and requirements.</li>\n<li>Facilitate requirements gathering and solutioning workshops with stakeholders on business and IT</li>\n<li>Identify, develop level of efforts for and lead MDM solution efforts.</li>\n<li>Develop Epics, Features, and User Stories</li>\n</ul>\n<strong>Youll thrive here because you</strong>:\n\n<ul>\n<li>Are results-driven with a strong customer focus</li>\n<li>Are experienced in analyzing business functions and accurately documenting critical data requirements that represent the business needs including future state business activities.</li>\n<li>Have strong data analysis skills with the ability to collect, organize, and disseminate significant amounts of information about said data with attention to detail and accuracy.</li>\n<li>Have strong business analysis skills with emphasis on data and process flows</li>\n<li>Are experienced in interfacing with multiple program areas or organizations that have varying business needs.</li>\n<li>Have experience in developing data catalogs (business metadata &amp; technical metadata and working with reference data.</li>\n<li>Have prior Data Governance and Administration experience</li>\n<li>Have prior Master Data Management solution implementation and management experience</li>\n<li>Are experienced in both agile and waterfall</li>\n<li>Quickly assimilate into a team environment with the client.</li>\n<li>Possess a desire to help build our business, win new work, and expand client relationships</li>\n<li>Thrive in a role where youll wear many hats</li>\n<li>Want to use your talents to give back to the community</li>\n<li>Have a bachelors degree in Business, Information Technology or related field; or equivalent work experience</li>\n</ul>\n<strong>Nice to see</strong>:\n\n<ul>\n<li>Masters Degree</li>\n<li>Financial Services knowledge and experience, especially in working on projects that include IT related needs</li>\n<li>Knowledge and experience in Mortgage Loan Industry and its Federal requirements/regulations</li>\n</ul>\n<strong>Benefits of working at Impact Makers</strong>:\n<br>\nAs a values-based company and Certified B Corporation, taking care of our employees is of the utmost importance and our employee benefits package reflects that. We offer healthcare plans with benefit premiums 100% paid-for, 401(k) with matching, and unlimited PTO. Impact Makers embraces the pursuit of balance between work, family, and personal interests, with a flexible, dog-friendly work environment in Scotts Addition. We like to have fun at work, collaborating through company sponsored events and pro bono opportunities. Our team members work <em>with</em> Impact Makers, not <em>for</em> Impact Makers.\n<br><br>\n<strong><em>Impact Makers provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Impact Makers complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.</em></strong>:</div>"}