{"job title": "Sr. Data Analyst", "company": "Legacy.com", "city state": "– Chicago, IL", "rating": "3.4", "job description": "Description\n<br><br>\nLeading technology company is seeking a Sr. Data Analyst who will solve some of the most analytically complex questions that a fast-growing company faces by leveraging the trove of data that we have access to including web traffic, sales, and customer data and turning it into actionable insights.\n<br><br>\nThis position requires a combination of strong data analysis, business analytics and communication skills. A good understanding of business strategy and experience in the ecommerce industry is helpful.\n<br><br>\nWe are looking for an innovative, positive, self-directed team player who is passionate about solving problems.\n<br><br>\n<strong>Specific job responsibilities will include:</strong>\n\n\n<ul>\n<li>Work collaboratively to identify business needs and provide data-driven insights to fuel business and marketing decisions</li>\n<li>Create automated executive and client dashboards to enable stakeholders to monitor business and product performance</li>\n<li>Report and analyze web traffic, website behavior, and product performance for multiple product lines</li>\n<li>Generate ad hoc reports and related insights that enable the organization to be agile and responsive to new opportunities</li>\n<li>Conduct analyses and test hypotheses around business questions</li>\n<li>Develop consistent approaches and methodologies, automate repeatable tasks and drive process efficiencies</li>\n<li>Partner with the Data Architecture team to deliver solutions to support ongoing Business Intelligence needs and work within the data governance policies and controls put in place by the Data Architecture team</li>\n</ul>\n\n<strong>Required Skills/Qualifications:</strong>\n\n\n<ul>\n<li>3+ years of experience in data/business analytics in consumer web/mobile, internet advertising, internet search, e-commerce or related field</li>\n<li>Passion for analytics, data, and delivering results</li>\n<li>Insatiable curiosity that drives you to look for the meaning behind numbers</li>\n<li>Communication skills of the highest level, with an ability to converse effectively with different groups of peoplefrom executives to customers to developers</li>\n<li>Highly organized with a keen attention to detail</li>\n<li>Proven team player with ability to work independently, and manage and prioritize multiple projects, clients, and deadlines in a fast-paced environment.</li>\n<li>Working knowledge of databases, data warehousing techniques, and database querying using SQL (or similar query language)</li>\n<li>Experience with web analytics tools such as Google Analytics</li>\n<li>Experience creating visualizations and dashboards using BI tools</li>\n<li>Bachelor's Degree in business or quantitative field preferred</li>\n</ul>\n\n<strong>Benefits</strong>\n<br><br>\nWe offer a very generous and comprehensive salary and benefits package, including:\n\n\n<ul>\n<li>Medical, Dental, and Vision Insurance</li>\n<li>Life &amp; Accident Insurance</li>\n<li>Short and Long Term Disability</li>\n<li>Paid Time Off</li>\n<li>401k plan</li>\n<li>Medical, Dependent Care, and Parking/Transit Flex Spending Plans</li>\n<li>Wellness Program</li>\n<li>Employee Assistance Program</li>\n<li>Casual dress</li>\n<li>Daily, company-provided coffee, tea, soda, and snacks</li>\n<li>Friendly, team-oriented, open environment<br><br>SDL2017</li>\n\n</ul>"}