{"job title": "Senior Data Analyst (U.S. Border Patrol)", "company": "LMI", "city state": "– Crystal City, VA", "rating": "3.7", "job description": "LMI seeks a <strong>senior data analyst</strong> to support a federal program management office in Northern Virginia. Join our team of collaborative self-starters focused on delivering practical and efficient solutions to help our client keep U.S. borders safe and facilitate travel and trade. As part of our high-performing team, you will augment our vital work to provide “eyes and ears” technology to protect our nation.\n<br><br>\nYou will provide data analytics for integrated project reporting and analysis to support our client’s programs charged with planning, acquiring, and managing the operation of technology and capabilities to keep our borders safe and facilitate travel and trade. Representative responsibilities:\n<ul>\n<li>Collaborate with the integrated project team to compile, collate, and integrate portfolio, program, project, and quality data</li><li>Use data analytics to develop, populate, and analyze dashboards for transparent, real-time project, program, and portfolio measurement results and metrics</li><li>Route dashboards and performance measures to executives and managers to inform strategies and decisions</li><li>Analyze program and project cost, schedule, technical performance, and quality data for trends and issues common across the program management office to identify areas needing management attention or new strategies and opportunities to improve</li><li>Route analyses to program managers for review and possible action</li></ul>\n\n<ul>\n<li>\n\n<ul>\n<li>Ability to pass a government background investigation, including financial, criminal, residential, educational, foreign affiliation, prohibited substance abuse, and employment verifications; active U.S. Customs and Border Protection background investigation preferred. Please note that only U.S. citizens are eligible for a suitability determination.</li><li>Previous work with CBP’s Integrated Fixed Tower (IFT), Remove Video Surveillance Systems (RVSS), Mobile and Agent-Centric Systems (MACS), and/or Field Surveillance Services (FSS) portfolios is a plus.</li><li>10+ years of experience and a Master’s degree in business, management, or information technology (IT); or 12+ years and a Bachelor’s degree.</li><li>Experience with using data analytics tools (e.g., Tableau, Microsoft Power BI) to create dashboards and balanced scorecards summarizing organizational performance.</li><li>Expertise in building and cleaning databases from multiple data sources, combining cost and performance information.</li><li>Experience with developing queries for routine data requests and reports.</li><li>Proficiency in Microsoft Word, Excel, Outlook, PowerPoint, and SharePoint.</li><li>A true team player who maintains a positive attitude in a dynamic environment.</li></ul></li>\n</ul>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}