{"job title": "Financial Data Analyst - Middletown, RI", "company": "Magellan Health Services", "city state": "– Middletown, OH", "rating": "3.1", "job description": "Are you seeking meaningful work with people who care? Magellan Health is seeking a Financial Data Analyst to work in our Middletown, RI office. The ideal candidate will have two-to-three years of experience, preferably in pharmacy benefit management or in a managed care organization. In this role, you will be a power user in Excel as well as possess strong communication skills. Join Magellan and help us turn fragmented care into focused care, empowering 1 in 10 Americans to lead healthier, more vibrant lives every day. This position requires significant financial analytical experience and demonstrated health care industry knowledge. Primary responsibilities include analyzing costs, preparing financial reports and providing recommendations to leadership for lines of business according to established policies, guidelines and methodologies. Prepare journal entries and analyses in conjunction with month end close process and meet monthly deadlines. Essential Functions: - Analyzes complex financial information and reports; provides accurate and timely financial recommendations to management for decision making purposes. - Develops sophisticated financial models. Provides recommendations based upon evaluation of financial trends and forecasts. - Evaluates and monitors the efficiency and performance of programs, ensuring program execution is on target. - Manages dashboard reporting by tracking monthly, quarterly and annual revenue and expenses. - Obtains a thorough understanding of operating infrastructure of Strategic Business Unit(s) (SBUs) operations to be able to proactively analyze and identify opportunities for cost savings and revenue enhancements. - Regularly reviews historical operating results and proactively identifies and analyzes potential revenue enhancement and cost saving opportunities. - Performs a variety of pro forma financial and operating analyses as requested to support proposals. - Reviews and understands fluctuations across SBUs in delivering cost of care and variations in cost of care. Differentiates impact of rate versus utilization variations. - Supports SBUs by providing information, responding to questions and resolving complex problems and issues. - Other special projects as assigned. General Job Information TitleFinancial Data Analyst - Middletown, RI Grade21 Job FamilyFinance Group CountryUnited States of America FLSA StatusUnited States of America (Exempt) Recruiting Start Date9/6/2018 Date Requisition Created9/6/2018 Minimum Qualifications EducationBachelors Accounting||&amp;&amp; Bachelors Finance||&amp;&amp; Masters License and Certifications - Required License and Certifications - Preferred Other Job Requirements Responsibilities Ability to understand and analyze complex data sets and frame it to actionable analysis. Understanding of the financial structure and business practices of the managed care industry. Strong PC skills are essential, with advanced skills in Excel and Hyperion Essbase or other large enterprise financial software. Magellan Health Services is proud to be an Equal Opportunity Employer and a Tobacco-free workplace. EOE/M/F/Vet/Disabled<br><br>SDL2017"}