{"job title": "Quantitative Data Analyst II", "company": "Mr. Cooper", "city state": "– Irving, TX", "rating": "3.2", "job description": "When you click 'Apply', you will need to click on 'Create Account'. By creating an account, you will be able to view your applications and their statuses. Your password must contain 8 characters, 1 upper case letter, 1 number and 1 special character.<strong>Check It Out!</strong><br><br>Ready to be a Cooper too? This might just be right up your alley!\n<br><br>\n<strong><strong>Quantitative Data Analyst II</strong></strong>\n<br><br>\n<strong><strong>Location:</strong></strong>\n<br><br>\n<strong><strong>Dallas, Texas</strong></strong>\n<br><br>\nWe’re here to keep the dream of home ownership alive. Oh, and while we’re at it, we’re determined to change the lending industry itself. It’s simple, but it won’t be easy. And we’ll need a great team behind us. (That’s where you come in.) We want to show the world that transparency, candor and collaboration aren’t just good values. They’re good business. Working here isn’t for people who want to punch a clock. It’s for people who want to punch a hole in the status quo. Come join us. And make a difference instead of just a living.\n<br><br>\nThe Quantitative Data Analyst II will be responsible for supporting the data analytics and reporting needs of the Risk and Compliance Testing Department. This position reports to the Manager of Quantitative Data Analytics for Risk and Compliance Testing.\n<br><br>\n<strong><strong>Roles &amp; Responsibilities:</strong></strong>\n<ul>\n<li>Work with Forward and Reverse Servicing, Xome, Marketing and Originations Business Units to understand their data structures and testing needs.</li><li>Develop and perform ongoing maintenance of testing population queries within SQL Management Studio and the proprietary RACT testing application based on knowledge of the test objective as communicated by Risk and Compliance Test Developers and Business Partners.</li> <li>Develop and maintain reporting to support the Risk and Compliance Testing Department.</li><li>Perform ad hoc analysis and reporting based on needs of the Risk and Compliance Testing Department.</li><li>Maintain Risk and Compliance Testing SharePoint used to manage testing query pipeline.</li>\n</ul>\n<strong><strong>Core Requirements:</strong></strong>\n<ul>\n<li>Expert skill in SQL Management Studio programming.</li><li>Expert skill in Microsoft PowerPoint.</li><li>Experience in Mortgage Servicing and familiarity with Mr. Cooper Servicing data location and structure</li><li>Strong organizational skills and ability to prioritize and manage workload.</li>\n</ul>\nJob Requisition ID:<br><br>4355<br><br>Job Category:<br><br>Analytics &amp; Reporting<br><br>Primary Location City:<br><br>Irving<br><br>Primary Location Region:<br><br>Texas<br><br>Primary Location Postal Code:<br><br>75063<br><br>Primary Location Country:<br><br>United States of America<br><br>Posting Organization:<br><br>Mr. Cooper<br><br>Line of Business:<br><br>Corporate<br><br>Additional Posting Location(s):\n<br><br>\nAlternate Requisition:<br><br>No"}