{"job title": "Lead/Senior Data Analyst (Transmission Line Engineering)", "company": "National Grid", "city state": "– Waltham, MA", "rating": "3.2", "job description": "<strong>About the Position:</strong>\n<br><br>\nSupport needs related to gathering, maintaining and governing asset data across the business. Add value by analyzing system and process challenges and delivering solutions.\n<br><br>\nPosition Responsibilities (including but not limited to):\n\n\n<ul>\n<li>Collaborate with multiple stakeholders to identify business process and system changes and enhancements</li>\n<li>Utilize existing GIS and database tools to deploy solutions to meet business challenges and demonstrate business process improvement</li>\n<li>Provide support for electric and gas asset information - including reporting, data update, analysis and development</li>\n<li>Embed best practice while promoting security, consistency, availability, standardization and accuracy of information.</li>\n</ul>\n\n<strong>Main Interfaces:</strong>\n<br><br>\nOther Asset Data and Analytics team members, Operations and Engineering business representatives and IS support personnel\n<br><br>\n<strong>Knowledge &amp; Experience Required:</strong>\n\n\n<ul>\n<li>Bachelor's Degree in Civil, Electrical or Information Sciences - Technology or equivalent OR in lieu of a degree, equivalent work experience</li>\n<li>Proven experience working with diverse teams to gather user requirements and translate those into an action plans</li>\n<li>Process and workflow analysis</li>\n<li>Exceptional and demonstrated customer service and communication skills (verbal and written) including proven ability to work in a team environment</li>\n<li>Exceptional and demonstrated analytical skills, problem-solving and decision-making capabilities.</li>\n<li>Proficient with computer applications including databases, spreadsheets and other general applications</li>\n<li>Highly motivated with ability to take an assignment and progress independently</li>\n<li>Ability to travel throughout the National Grid service territory as needed (10-20%)</li>\n<li>Must have a valid driver's license and safe driving history.</li>\n</ul>\n\n<strong>Preferred Experience:</strong>\n\n\n<ul>\n<li>Experience working with utility asset information particularly electric transmission and distribution</li>\n<li>Experience working with other systems including work and document management</li>\n<li>Hands on experience working with utility GIS models and systems ESRI and/or Smallworld - ESRI GISP or other certification is highly desirable</li>\n<li>Familiarity with data quality concepts, tools and techniques</li>\n<li>Experience working in a matrix environment and ability to prioritize work in this environment is helpful</li>\n</ul>\n\nThis position is one of National Grid's career path roles which provide for promotional opportunities within and across salary bands as you develop and evolve in the position by gaining experience, expertise and acquiring and applying technical skills.\n<br><br>\nNational Grid is an equal opportunity employer that values a broad diversity of talent, knowledge, experience and expertise. We foster a culture of inclusion that drives employee engagement to deliver superior performance to the communities we serve. National Grid is proud to be an affirmative action employer. We encourage minorities, women, individuals with disabilities and protected veterans to join the National Grid team.<br><br>SDL2017"}