{"job title": "Sr. Data Analyst", "company": "Nexon M", "city state": "– Emeryville, CA", "rating": "3.5", "job description": "Nexon M is a mobile game publisher based in Emeryville, CA. Founded in 2013, Nexon focuses on free-to-play games for mobile and counts some of the world's best developers as its partners, including Big Huge Games, maker of the top-grossing game DomiNations, and Pixelberry, maker of top-grossing game Choices: Stories you Play\n<br><br>\nWe focus on free-to-play games for mobile can be traced to our roots as a subsidiary of NEXON Corp. As Korea's largest game company, NEXON is known for having created the first free-to-play games in the early 2000s and has multiple games which recently passed their 10-year anniversaries of live operation.\n<br><br>\nJoin our Analytics Team in Emeryville, CA, to work cross-functionally with internal teams as well as Nexon international studios to deliver accurate, impactful insights. As an analyst, you'll gain exposure to, work closely with, and move the needle across all functions of mobile game publishing. You'll be responsible for compiling raw game data into usable data stores and reports for both game developers and stakeholders within the company, as well as generating novel insights on game performance, user acquisition, and user experience.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n\n\t<li>Use data to identify the weakest areas of game performance and user experience, and work with producers and product managers to create data-driven solutions</li>\n\n<li>Prepare data visualizations, reports, and high-level summaries for producers, product managers, executives, external developers, and other non-technical end users based on both raw data and aggregate results.</li>\n\n<li>Perform data verification and validation to ensure that instrumentation, aggregation, reporting, and analyses are accurate and complete. Devise and implement solutions when gaps or errors are found.</li>\n\n<li>Leverage cross-game datasets to develop predictive models. Collaborate with other analysts to grow a standard analytics library of tools and methodology to support ongoing and future game launches.</li>\n</ul>\n<strong>Qualifications:</strong>\n\n<ul>\n\n\t<li>5+ years of experience working in analytics, leveraging data to build business &amp; product solutions</li>\n\n<li>2+ years of experience building reports with Tableau or any other similar tools.</li>\n\n<li>Bachelor's degree or equivalent in Math, Statistics, Computer Science, Business, Economics or other quantitative field preferred.</li>\n\n<li>Strong knowledge and proven abilities with SQL.</li>\n\n<li>Experience in at least one analytical package like R or Python.</li>\n\n<li>Working understanding of statistics.</li>\n\n<li>Strong communication skills. Able to explain technical concepts to a non-technical audience; as well as non-technical concepts to a technical audience</li>\n\n<li>Good understanding of mobile gaming mechanics and the gaming industry</li>\n\n<li>Experience with cloud-based computing (especially Amazon Web Services), procedural programming (especially PHP or Python), EMR frameworks such as Spark or Hadoop, and data science and machine learning methods such as k-means clustering, random forest, decision trees, etc., are all <em>a plus.</em></li>\n<li>Korean language (written and verbal) and cultural knowledge, <em>a plus.</em></li>\n</ul>\nThis is an onsite, full-time position with Nexon M (nexonm.com). Our studio is located in Emeryville, CA. A casual, friendly, work environment, comprehensive benefits package, a competitive salary, and a great opportunity for career growth and development, are all part of what makes Nexon M a great place to work.\n<br><br>\n<em>Nexon is an Equal Opportunity Employer</em>\n<br><br>\n<u>To all 3rd party recruiting agencies</u>: Nexon does not accept agency resumes. Please do not forward resumes to our recruiters, employees or any other company location. Nexon is not responsible for any fees related to unsolicited resumes."}