{"job title": "Policy Analyst - Economics and Data Focus (Data Analyst)", "company": "State of Washington", "city state": "– Olympia, WA", "rating": "3.7", "job description": "Description\n<br><br>\nPlease note: This recruitment is open until filled. Initial screening of applications will begin on September 14, 2018. We encourage all applicants to apply early for first interview consideration. The hiring authority reserves the right to make a hiring decision at any time.\n<br><br>\n<strong>OIC CAREER OPPORTUNITY</strong>\n<br><br>\nThe Office of the Insurance Commissioner (OIC) is seeking civil service exempt position as a Policy Analyst Economics and Data Focus to join our Olympia office.\n<br><br>\nThe OIC occupies a unique space in Washington state government at the intersection of numerous high priority, data heavy programs. This position will be responsible for finding innovative ways to utilize existing data and develop new data sets to support agency priorities and initiatives. The incumbent can expect a fast paced development environment where their unique skills are added to a team working on the leading edge of analytics in state government. If you're interested in making your mark in state government data and analytics, this is an opportunity to join a team doing just that!\n<br><br>\nIn addition to the comprehensive benefits package, the salary for this position is up to $89,000 annually, depending on qualifications.\n<br><br>\nThis recruitment may be used to establish a qualified pool of candidates for agency-wide vacancies in the next six months.\n<br><br>\n<strong>AGENCY PROFILE AND VALUES</strong>\n<br><br>\nThe OIC operates under the direction of the state's Insurance Commissioner, a statewide elected official. The agency's mission is to provide consumer protection and regulation of the state's insurance industry. With a workforce of approximately 250 employees, we are one of the smaller state agencies in Washington state government and are fortunate to have a stable funding source that does not rely on the state's general fund.\n<br><br>\nThe OIC values its employees and diversity in the workplace. We challenge our employees to continuously improve the way we do business, and to meet and exceed the needs of our customers. To learn more about this agency, we invite you to visit our website at http://www.insurance.wa.gov/.\n<br><br>\n<strong>BENEFITS OF WORKING FOR OIC</strong>\n<br><br>\nAs an eligible state employee, Washington State offers:\n\n\n<ul>\n<li>An outstanding benefits package and retirement plans.</li>\n<li>Training and development opportunities, including tuition reimbursement.</li>\n<li>The fulfillment of public service.</li>\n<li>We honor diversity in the workplace and support one another with respect and trust.</li>\n</ul>\n\nDuties\n\n\n<ul>\n<li>Collect, analyze, and summarize information for use in agency work. This includes data collection, aggregation, manipulation, and summarization of both internal administrative data and program data received from outside entities.</li>\n<li>Use knowledge of statistical and econometric methods to derive highly quantitative information from available data and form conclusions about the meaning of the information.</li>\n<li>Provide economic analysis necessary for completion of agency fiscal notes.</li>\n<li>Assist with cost benefit analysis and small business economic impact analysis for proposed agency rule-making, as required by the Administrative Procedure Act (APA) and the Regulatory Fairness Act (RFA).</li>\n<li>Respond to requests for data, economic information, and research assistance on insurance related issues from agency managers and external stakeholders.</li>\n<li>Identify best sources of insurance industry and market data.</li>\n<li>Collect and update key data and reports on a regular basis.</li>\n<li>Work with other analysts to develop new sources of insurance industry and market data for use in agency work. This work includes, but is not limited to, surveying, analysis of administrative data, and extraction of data from primary source documents.</li>\n<li>Perform data cleaning and manipulation using a variety of software packages.</li>\n<li>Produce charts, maps, tables, and graphs to visually communicate data on the insurance industry and communicate compelling trends, results of analyses, and interrelationships between datasets.</li>\n<li>Analyze economic factors and evaluate the economic impact on the Washington State insurance market and regulation in support of the development of agency policy positions, management options and legislative proposals, with an emphasis on insurance-related economic analysis.</li>\n<li>Coordinate with agency staff, subject matter experts, other agencies and stakeholders to obtain information needed to provide analysis on policy options and legislative proposals.</li>\n<li>Prepare documents and other work product that are clearly written and plain talked to allow your audience to easily understand and engage in meaningful dialog.</li>\n<li>As a policy analyst, take the lead in bill analysis and facilitate rulemaking teams as assigned.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>B.S. or B.A. preferably in Economics, Public Policy, Public Administration, or related field that included coursework in statistics and data analysis.</li>\n<li>Two years of professional experience reviewing and interpreting legislation, rules or policies for likely impacts on affected parties and/or analysis of economic impact (economic analysts and/or modeling). Additional post graduate education with a focus in economic analysis, statistics or related field may substitute for some or all of the experience.</li>\n<li>One year of experience working with databases and compiling data from numerous sources in a professional or scholastic setting. This experience can include but is not limited to: Excel, SQL (or similar database languages) or R (or similar statistical analysis languages).</li>\n<li>Intermediate skills in Microsoft Office Products (Word, Excel, PowerPoint, Outlook)</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Master's degree in Economics, Public Administration, Business Administration, Statistics or related field.</li>\n<li>Three years of professional experience reviewing and interpreting legislation, rules or policies for likely impacts on affected parties and/or analysis of economic impact (economic analysts and/or modeling). Additional post graduate education with a focus in economic analysis, statistics or related field may substitute for some or all of the experience.</li>\n<li>Experience composing fiscal notes.</li>\n<li>Advanced level experience in the use of Excel (including PowerPivot) and PowerPoint.</li>\n<li>Experience programming in SQL (or similar database languages) and R or similar statistical analysis language.</li>\n<li>Two or more years' experience working with databases and compiling data from numerous sources in a professional or scholastic setting.</li>\n</ul>\n\n<strong>Job Specific competencies include:</strong>\n\n\n<ul>\n<li>Knowledge of the institutions and processes in policy development and implementation, including legislative processes.</li>\n<li>Knowledge of statistical and econometric methods to derive high quality quantitative information from available data and form conclusions about the meaning of the information.</li>\n<li>Ability to work in a fast-paced policy making environment. Sensitive to the needs of stakeholders and the general public.</li>\n<li>Ability to develop innovative ideas that provide solutions to all types of workplace challenges. Identifies impacts of policy options on different stakeholders.</li>\n<li>Ability to effectively collect, organize and document data and information in ways that make the information most useful for subsequent assessment, analysis and investigation.</li>\n<li>Ability to explain complex or technical information using language that holds the attention of and meets the needs of different audiences, including managers, legislative staff, stakeholders, and the general public.</li>\n<li>Ability to work diplomatically, professionally, and in a non-partisan manner. Stays focused on results and desired outcomes and how best to achieve them.</li>\n<li>Ability to provide option based advice when evaluating complex situations.</li>\n</ul>\n\n<strong>Agency core competencies include:</strong>\n\n\n<ul>\n<li>Respect, recognition and inclusiveness: Engages in constructive working relationships characterized by a high level of acceptance, cooperation, and mutual respect; helps create a work environment that embraces and appreciates diversity; and, recognizes contributions of others within the organization (to include subordinates and peers) --- all of which will enhance the attainment of organizational goals.</li>\n<li>Accountability: Demonstrates understanding of the link between job responsibilities and organizational goals. Accepts personal responsibility and accountability for the quality and timeliness of own work, and adhering to agency processes/policies. Manages his or her own performance to meet expectations and achieve expected results.</li>\n<li>Communication and Collaboration: Actively listens and engages in open, respectful, and cooperative manner. Conveys messages that are effective in communicating information and ideas with others.</li>\n<li>Customer Focus: - Builds and maintains internal and external customer satisfaction with services offered by the organization, both regulatory and consumer based. Demonstrates sensitivity to public's perceptions and attitudes.</li>\n<li>Professionalism and Integrity: Through consistent honesty, forthrightness, and professionalism in all interactions, earns the trust, respect and confidence of co-workers and customers.</li>\n</ul>\n\nSupplemental Information\n<br><br>\n<strong>Supplemental Information:</strong>\n<br><br>\nHow to Apply: Applications for this recruitment will be accepted electronically. Please select the large \"apply\" button at the top of this announcement. You may need to set up an account profile.\n<br><br>\nTo be considered for this position you will need to answer the supplemental questions, and attach a letter of interest, resume and three professional references. Your letter of interest should describe how your experience, training and education make you a viable and competitive candidate for this position.\n<br><br>\nIn accordance with RCW 48.02.090(5), Office of Insurance Commissioner employees are prohibited from having any interest, directly or indirectly, in an insurance company other than as a policy holder. This prohibition includes the receipt of renewal commissions.\n<br><br>\nContact us: For inquiries about this position, please contact Phyllis Gratis at 360.725.7012.\n<br><br>\nEmployment, Education and Criminal History Verification\n<br><br>\nDegree/Credential Verification: If a degree or other credentials are listed by the candidate, proof will be required at the finalist stage; therefore, candidates are encouraged to pre-plan for this.\n<br><br>\nBackground Check: Prior to a new hire, a background check including criminal record history will be conducted. Information from the background check will not necessarily preclude employment but will be considered in determining the applicant's suitability and competence to perform in the position.\n<br><br>\nThe Office of Insurance Commissioner is an equal opportunity employer and does not discriminate on the basis of age, sex, sexual orientation, gender, gender identity/expression, marital status, race, creed, color, national origin, religion or beliefs, political affiliation, military status, honorably discharged veteran, recently separated or other protected veteran status, the presence of any sensory, mental, physical disability or the use of a trained dog guide or service animal by a person with a disability, equal pay or genetic information.\n<br><br>\nPersons requiring accommodation in the application process or need this job announcement in an alternative format may contact the recruiter listed above. Applicants who are deaf or hard of hearing may call through Washington Relay Service by dialing 7-1-1."}