{"job title": "Data/Business Analyst", "company": "U-Haul", "city state": "– Phoenix, AZ", "rating": "3.2", "job description": "U-Haul Corporate Headquarters\n<br>\n\n<br>\nU-Haul International\n<br>\n\n<br>\n2727 N Central Ave\n<br>\n\n<br>\n<strong>PHOENIX , AZ</strong>\n<br>\n\n<br>\n<strong>Description:</strong>\n<br>\n\n<br>\nU-Haul Operations IT Group is seeking a talented data/business analyst to join our team. You will join a team of talented professionals who work collaboratively with developers, project managers, and usability experts to carry our projects to completion. This role will evolve as a unique position with lots of room for growth and a variety of responsibilities based on the business needs.\n<br>\n\n<br>\n<strong>Responsibilities</strong>\n<br>\n\n<br>\nCollect customer requirements, determine technical issues and create written requirements\n<br>\n\n<br>\nIdentify current process flows and methods to improve data collection, provide analysis and reporting to meet business area needs\n<br>\n\n<br>\nTrack and fully document changes for functional and business specifications; write detailed universally understood procedures for permanent records and for use in training.\n<br>\n\n<br>\nCreate tutorials to help end-users use a variety of applications\n<br>\n\n<br>\nProvides technical assistance in training, mentoring, and coaching professional and technical staff.\n<br>\n\n<br>\nDevelops training curriculum and conducts formal training sessions covering assigned systems module.\n<br>\n\n<br>\nWork with internal teams to obtain an in-depth understanding of the projects and the documentation requirements\n<br>\n\n<br>\nProduce high-quality documentation that meets applicable standards and is appropriate for its intended audience\n<br>\n\n<br>\nMust work closely with the Accounting Ledger and Sub-ledger Team\n<br>\n\n<br>\nWrite easy-to-understand user interface text, online help and developer guides\n<br>\n\n<br>\nMust be organized, efficient and a motivated self-starter\n<br>\n\n<br>\nExcellent written and verbal skill\n<br>\n\n<br>\nExcellent analysis and problem solving skills\n<br>\n\n<br>\nStrong interpersonal communication skills, verbal, listening and written\n<br>\n\n<br>\nAssist with administrative projects, agendas, meeting notes and action items follow-up\n<br>\n\n<br>\nAssist with project testing requirements and training documentation\n<br>\n\n<br>\nRequires meticulous attention to detail but also has the capability to be a free-form thinker.\n<br>\n\n<br>\n<strong>Requirements:</strong>\n<br>\n\n<br>\nProven working experience in technical writing of software documentation\n<br>\n\n<br>\nAbility to deliver high quality documentation paying attention to detail\n<br>\n\n<br>\nAbility to quickly grasp complex technical concepts and make them easily understandable in text and pictures\n<br>\n\n<br>\nExcellent written skills in English\n<br>\n\n<br>\nStrong working knowledge of Microsoft Office\n<br>\n\n<br>\nBasic familiarity with the SDLC and software development\n<br>\n\n<br>\nKnowledge of Mainframe processes would be a plus\n<br>\n\n<br>\nKnowledge of COBOL would be a plus\n<br>\n\n<br>\n<strong>Education/Training:</strong>\n<br>\n\n<br>\nUniversity degree in Computer Science or equivalent preferred\n<br>\n\n<br>\n<strong>Work Status:</strong>\n<br>\n\n<br>\nFull-Time\n<br>\n\n<br>\n<strong>Location:</strong>\n<br>\n\n<br>\n2727 N Central Ave, Phoenix, Arizona 85036 United States of America\n<br>\n\n<br>\nU-Haul is an equal opportunity employer. All applicants for employment will be considered without regard to race, color, religion, sex, national origin, physical or mental disability, veteran status, or any other basis protected by applicable federal, provincial, state or local law. Individual accommodations are available on requests for applicants taking part in all aspects of the selection process. Information obtained during this process will only be shared on a need to know basis."}