{"job title": "Healthcare Claims Data Analyst - Telecommute", "company": "UnitedHealth Group", "city state": "– Eden Prairie, United States", "rating": "3.3", "job description": "Some people take things as they come. Others relentlessly push themselves to go farther. Combine health care and technology, which are two of the fastest-growing fields on the planet, with UnitedHealth Group's culture of performance, collaboration and opportunity and this is what you get: industry-leading health care services at a company that's improving the lives of millions. <br><br>As the <strong>Healthcare Claims Data Analyst</strong> you will design and develop reports and analyze data to measure clinical outcomes, network performance and methodology levers. You will investigate key business problems through quantitative analyses of utilization and health care costs data. As the Consultant, you will interpret and analyze clinical data from various sources and recommend best approaches for its consolidation. Your analyses will be used to create viable, real-world solutions in a complex health care landscape. The work is as challenging as it is rewarding. You'll open doors to new opportunities. This is where bold people with big ideas are writing the next chapter in health care. Join us. There's never been a better time to do <strong>your life's best work.(sm)</strong> <br><br>You'll enjoy the flexibility to telecommute* from anywhere within the U.S. as you take on some tough challenges. <br><br><strong>Primary Responsibilities:</strong> <br> <ul> <li> <br> Conduct independent research through both internal &amp; external sources and databases <br> </li><li> <br> Conduct an assessment of incoming lead referrals, and complete related documentation <br> </li><li> <br> Perform data analysis of claims history to substantiate fraud and abuse allegations <br> </li><li> <br> Build analytics for claims analysis <br> </li><li> <br> Interact / coordinates activities with all levels of leadership and clients about course of investigation or analytical development <br> </li><li> <br> Lead projects to completion by contributing to database creation, statistical modeling and financial reports <br> </li><li> <br> Prepare accurate reports to detect and identify fraud trends, analysis of those trends and risk mitigation recommendation </li></ul><strong> Required Qualifications: </strong><br> <ul> <li> <br> Undergraduate degree or equivalent work experience <br> </li><li> <br> 1+ years of health care experience working with claims data and medical codes <br> </li><li> <br> Proficiency in performing data analytics <br> </li><li> <br> Beginner level of SQL, SAS and/or other statistical programs <br> </li><li> <br> Any statistical coding language (R. Python or Java) <br> </li><li> <br> Beginner level of proficiency with MS Access <br> </li><li> <br> At least an intermediate level of proficiency working with MS Excel including formulas, calculations, charts, graphs, etc. <br></li></ul> <br> <strong>Preferred Qualifications:</strong> <br> <ul> <li> <br> Some Project Management experience <br></li></ul> <br> <strong>Careers with Optum.</strong> Here's the idea. We built an entire organization around one giant objective; make health care work better for everyone. So when it comes to how we use the world's large accumulation of health-related information, or guide health and lifestyle choices or manage pharmacy benefits for millions, our first goal is to leap beyond the status quo and uncover new ways to serve. Optum, part of the UnitedHealth Group family of businesses, brings together some of the greatest minds and most advanced ideas on where health care has to go in order to reach its fullest potential. For you, that means working on high performance teams against sophisticated challenges that matter. Optum, incredible ideas in one incredible company and a singular opportunity to do <strong>your life's best work.(sm)</strong> <br><br>*All Telecommuters will be required to adhere to UnitedHealth Group's Telecommuter Policy. <br><br>Diversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law. <br><br>UnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment. <br><br>Job Keywords: Healthcare Economic Consultant, claims data, medical codes, data analytics, SQL, SAS, telecommute, telecommuter, remote, work from home <br><br><br>${description2}<br>Requisition #: 782767"}