{"job title": "Senior Data Analyst", "company": "UnitedHealth Group Inc.", "city state": "– Minnetonka, MN", "rating": "3.3", "job description": "No industry is moving faster than health care. And no organization is better positioned to lead health care forward. We need attention to every detail with an eye for the points no one has considered. The rewards for performance are significant. You'll help improve the health of millions. And you'll do your life's best work.(sm)\n<br><br>\n<strong>Primary Responsibilities:</strong>\n\n\n<ul>\n<li>Engage with Internal clients to clearly define business requirements</li>\n<li>Interface professionally with database, Datastage ETL and SAS development teams</li>\n<li>Perform complex data analysis to support research requests by the client</li>\n<li>Create technical specifications, unit test plans, dataflow diagrams</li>\n<li>Follow quality assurance guidelines including the documentation, review and approval of all project related artifacts</li>\n<li>Troubleshoot client and operational issues quickly and comprehensively</li>\n<li>Coordinate SAS algorithm development projects of varying complexity</li>\n<li>Support, train and mentor fellow analysts and developers</li>\n<li>Improve operational processes</li>\n<li>Report project status timely and accurately from week-to-week</li>\n<li>Works with minimal guidance; seeks guidance on only the most complex tasks</li>\n<li>Function well within a matrix organization (E.g. supporting multiple leaders)</li>\n</ul>\n\n<strong>Required Qualifications:</strong>\n\n\n<ul>\n<li>5 years of Healthcare Knowledge</li>\n<li>2 years writing SQL query experience</li>\n<li>2 years of data analyst experience</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Undergraduate degree or equivalent experience</li>\n<li>Overpayment Recovery experience (Data Mining , COB, FWA)</li>\n<li>Oracle SQL Certification</li>\n<li>Fraud West and Abuse analysis experience</li>\n<li>Knowledge of healthcare claim adjudication systems</li>\n<li>File Transfer Protocol (FTP) experience</li>\n</ul>\n\nCareers with Optum. Here's the idea. We built an entire organization around one giant objective; make the health system work better for everyone. So when it comes to how we use the world's large accumulation of health-related information, or guide health and lifestyle choices or manage pharmacy benefits for millions, our first goal is to leap beyond the status quo and uncover new ways to serve. Optum, part of the UnitedHealth Group family of businesses, brings together some of the greatest minds and most advanced ideas on where health care has to go in order to reach its fullest potential. For you, that means working on high performance teams against sophisticated challenges that matter. Optum, incredible ideas in one incredible company and a singular opportunity to do your life's best work.(sm)\n<br><br>\nDiversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.\n<br><br>\nUnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment.\n<br><br>\nJob Keywords: Senior Data Analyst, Minnetonka, MN, Minnesota"}