{"job title": "Senior Business Process and Data Analyst", "company": "University of California", "city state": "– San Diego, CA", "rating": "4.1", "job description": "UCSD Layoff from Career Appointment: Apply by 08/18/18 for consideration with preference for rehire. All layoff applicants should contact their Employment Advisor. Eligible Disability Counseling and Consulting services (DCC) or Special Selection clients should contact their Vocational Rehabilitation Counselor for assistance.\n<br><br>\n<strong>DESCRIPTION</strong>\n<br><br>\nLed by the Director of Admissions, the Office of Admissions is housed in a multi-unit Enrollment Management (EM) department within the Division of Student Affairs, under the direction of the Associate Vice Chancellor. EM is comprised of seven high-profile, core functional units including: the Office of Admissions, the Office of the Registrar, Financial Aid&amp;Scholarships Office, Student Affairs Technology Services (SATS), Creative&amp;Analytical Services, Cal-SOAP, Parent&amp;Family Programs; plus the Business Office. EM's core functions oversee undergraduate admissions, continuing student enrollment management and financial aid and scholarship management.\n<br><br>\nThe Office of Admissions leads the university's efforts to identify, recruit, admit and enroll the next generation of UC San Diego Tritons with particular focus on talented, academically capable, California students, representative of the diversity of the people of California. The mission of the office includes increasing the visibility of UC San Diego in California, the nation and world, through marketing and on- and off- campus recruitment activities to prospective freshmen and transfer students and their families; school counselors; community college leaders and advisors; community based organizations; and educational organizations serving groups historically underrepresented on our campus. The Office of Admissions hosts more than 80,000 visitors and receives, processes, and reviews over 106,000 applications for admission annually. The office works collaboratively with on-and off- campus partners to achieve university goals.\n<br><br>\nUnder the general direction of the Associate Director of Operations, the Senior Business Process and Data Analyst applies skills as a seasoned, experienced professional with a full understanding of industry-wide business process and analysis practices and organizational policies and procedures in the design, creation, development, and administration of EM large and complex data systems. Establishes effective data business practice standards and data integrity pertinent to the data systems maintained with the Office of Admissions including the Admissions module in ISIS campus mainframe, Data Warehouse, and the CRM, Slate.\n<br><br>\nAnalyzes, develops, and implements programs, batch processes and application scripts to support operations of EM, UCOP data requirements, and UCOP admissions input files. Supports Customer Relationship Management (CRM), Slate, development, QA, data validation, prospect and applicant data management. Re-engineers business processes and workflows from current homegrown systems to new business processes within Slate in consultation with lead data analysts and developers requiring integration with other data systems. Creates various ad hoc reports, data extracts and collaborate with various IT, Registrar, Admissions, and other campus office departments and personnel on various tasks and projects for systems integration.\n<br><br>\nResolves a wide range of business process issues of moderate to complex scope, providing user support for requests and/or scheduled data extract, data validation and data reporting needs; provide support regarding mainframe applications and batch processing where and when needed within EM, SATS, ITS, ISIS, DataWarehouse and SLATE, ensuring synchronicity among platforms. Serves as back up to Operations' data analysts. Ensures that programming quality standards are met and that all aspects of data systems and applications are well tested and documented; provides Departmental Security Administrator support; provides end user technical support in troubleshooting errors when using Admissions data systems.\n\n\n<ul>\n<li>Overtime (evenings/weekends) during peak periods.</li>\n<li>A complete application includes a resume and cover letter.</li>\n</ul>\n\n<strong>QUALIFICATIONS</strong>\n\n\n<ul>\n<li>Knowledge of Structured Query Language (SQL.). Knowledge of the structures of the SQLDSE/Darwin/SQL server. Knowledge of and ability to use software utilities, including: MS SQL Server/Management, Studio/Visio; TSO/IBM Mainframe; Ultra Edit; FTP; WS/FTP.</li>\n<li>Knowledge of CRM data management and workflow processes, such as SLATE, preferred.</li>\n<li>Demonstrated experience with large database structures and ability to work with them to produce reports and data files.</li>\n<li>In-depth understanding and skill in process and systems requirement documentation standards, such as Use Case modeling, User Story creations and narrative description.</li>\n<li>Broad knowledge relating to software design. Ability to write SQL queries using Query Analyzer/T-SQL to fulfill ad-hoc and standing requests for data analysis and official reports for various audiences.</li>\n<li>Strong skills and knowledge of methodologies associated with analysis of processes and problems, information flow and architecture.</li>\n<li>Thorough knowledge of business processes and procedures. Ability to learn and understand the functions and processing cycles of the various areas of EM clusters, their inter-relationships, and their relationships to the functions of other campus administrative units.</li>\n<li>Demonstrated testing and test planning skills. Skill to clearly articulate data processing requirements, process failures, malfunctions, and remedies to programmers.</li>\n<li>Self-motivated and works independently and as part of a team. Able to learn effectively and meet deadlines. Strong problem solving skills. Ability to read, understand, and apply the content of technical literature. Strong analytical skills and capacity to solve complex hardware and software problems by finding creative solutions.</li>\n<li>Ability to pay close attention to detail, with a high level of accuracy. Good interpersonal skills including patience, diplomacy and flexibility. Knowledge of and ability to apply systems development methodologies.</li>\n<li>Effective communication and interpersonal skills. Ability to communicate technical information to technical and non-technical personnel at various levels in the organization. Ability to work with others from diverse backgrounds.</li>\n<li>Interpersonal and communications skills to work with both technical and non-technical personnel at various levels in the organization. Ability to instruct non-technical users in the use of software. Ability communicate clearly and effectively in person, by telephone, and in writing.</li>\n<li>Demonstrated ability to analyze the daily production schedule to establish job priorities, job dependencies and special processing requirements.</li>\n<li>A Bachelor's Degree, preferably in Mathematics and/or Computer Science, and three (3) years of experience; or equivalent experience/training.</li>\n<li>Thorough Knowledge of related areas of IT.</li>\n<li>Ability to work under pressure to meet deadlines. Skill in organizing and prioritizing workloads to meet deadlines. Ability to adapt to frequent changes in priorities and deadlines.</li>\n</ul>\n\n<strong>SPECIAL CONDITIONS</strong>\n\n\n<ul>\n<li>A background check is required.</li>\n</ul>\n\nThis position is a mandated reporter under the Child Abuse and Neglect Reporting Act (CANRA).\n<br><br>\nApply Now\n<br><br>\nThe University of California is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, age, protected veteran status, gender identity or sexual orientation. For the complete University of California nondiscrimination and affirmative action policy see: http://www-hr.ucsd.edu/saa/nondiscr.html\n<br><br>\nUC San Diego is a smoke and tobacco free environment. Please visit smokefree.ucsd.edu for more information."}