{"job title": "Recovery Data Analyst", "company": "WellCare Health Plans Inc.", "city state": "– Tampa, FL", "rating": "3.6", "job description": "Performs advanced and in-depth data analysis and provider profiling to determine recovery opportunities for claims that are overpaid due to retroactive member termination, inappropriate coding, duplication of payments, non-authorized services, erroneous contract or fee schedule reimbursement, non-covered benefit(s) and other reasons. Provide recommendations to reduce future occurrences of overpayments.\n<br><br>\nLocation: Hoover Blvd, Tampa, FL\n<br><br>\nDepartment: Ops-Payment Integrity\n<br><br>\nReporting to: Sr Mgr, Recovery\n<br><br>\n<strong>Essential Functions:</strong>\n\n<li></li><li>Analyzes contractual obligations and identifies/pursues overpayments on claims for various reasons.</li>\n<li>Prepares detailed analyses on mis-paid claims with complex business requirements and partners with IT resources for data pulls, analysis, and validation.</li>\n<li>Summarizes information for business partners for review and resolution and provides recommendations on recovery strategies.</li>\n<li>Monitors progress of overpayment projects and executes on next steps.</li>\n<li>Develops comprehensive and detailed analyses on erroneous payments in order to support the revenue collection and reconciliation process.</li>\n<li>Develops simple data queries to generate reports of overpaid claims</li>\n\n\n<strong>Additional Responsibilities:</strong>\n<br><br>\n<strong>Candidate Education:</strong>\n\n\n<ul>\n<li>Required A High School or GED</li>\n<li>Preferred A Bachelor's Degree in a related field</li>\n<li>Preferred or equivalent work experience</li>\n</ul>\n\n<strong>Candidate Experience:</strong>\n\n\n<ul>\n<li>Required 3 years of experience in data analysis and business criteria development</li>\n<li>Required 3 years of experience in Claims processing, Claims Operations or Claims recovery</li>\n</ul>\n\n<strong>Candidate Skills:</strong>\n\n\n<ul>\n<li>Intermediate Demonstrated analytical skills</li>\n<li>Intermediate Demonstrated interpersonal/verbal communication skills</li>\n<li>Intermediate Demonstrated written communication skills</li>\n<li>Intermediate Demonstrated problem solving skills</li>\n<li>Intermediate Ability to influence internal and external constituents</li>\n</ul>\n\n<strong>Licenses and Certifications:</strong>\n<br><br>\nA license in one of the following is required:\n<br><br>\n<strong>Technical Skills:</strong>\n<br><br>\nLanguages:<br><br>SDL2017"}