{"job title": "Senior Software Engineer - Commerce Front-End", "company": "Ancestry", "city state": "– San Francisco, California", "rating": "3.1", "job description": "Company Description<br><br>Were a cutting-edge tech company with a very human missionto help every person discover, preserve, and share the story of what led to them. Combining the rich information in family trees and historical records with the genetic details revealed in DNA, we create unique experiences that give people a new understanding of their lives, because connecting all the pieces of our family story can give us the deepest sense of who we are.\n<br><br>\nFor more information on what we do and why you would want to work at Ancestry, visit our careers page:www.workforancestry.com\n<br><br>\nAncestry is not accepting unsolicited assistance from search firms for this employment opportunity. All resumes submitted by search firms to any employee at Ancestry via-email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Ancestry. No fee will be paid in the event the candidate is hired by Ancestry as a result of the referral or through other means<br><br>Job Description<br><br>Ancestry.com is looking for a Senior Software Engineer to partake in the design, architecture, and development of advanced software solutions, and provide high levels of system support. The person will adhere to the organizations software solutions while following industry best practices surrounding AGILE methodologies. The ideal candidate will be able to interpret and articulate business needs and demonstrate competency in providing business solutions. Must be able to work collaboratively in a team environment and have strong interpersonal skills. Required technical skills include in-depth knowledge and experience with front-end technologies such as HTML, CSS, JavaScript, React, Redux and NodeJS.\n<br><br>\nResponsibilities:\n<ul>\n<li>Design, build, enhance and maintain highly scalable web sites using industry standard technologies</li><li>Identify and solve advanced technical challenges</li><li>Interact with various stake holders to vet the technical requirements</li><li>Work on AWS technologies such as ECS, Fargate etc.</li><li>Write code that follows standards and best practices, especially around performance, stability and testability Work in a collaborative agile environment (SCRUM)</li><li>Investigate and resolve customer issues in a timely-manner</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n<ul>\n<li>Must have a minimum of 5 years of experience with JavaScript, HTML, CSS, Web Servers</li><li>Proven experience building scalable web sites</li><li>Experience with React ecosystem and NodeJS is a big plus</li><li>2 years of experience working and deploying applications in a cloud environment (AWS or Azure)</li><li>3 years of experience building RESTful services in a micro services environment</li><li>Strong understanding of data structures and design patterns</li><li>Continuous Integration/Continuous deployment experience</li><li>Strong command-line experience using remote access Linux</li><li>Experience working within an Agile development environment</li><li>Should be a self-starter and fast learner with the willingness to learn</li><li>Must have excellent communication skills and be a good team player</li><li>Willingness to mentor junior members of the team</li><li>Must possess strong analytical and problem solving skills</li>\n</ul>\n\nAdditional Information<br><br>Helping people discover their story is at the heart of ours. Ancestry is the largest provider of family history and personal DNA testing, harnessing a powerful combination of information, science and technology to help people discover their family history and stories that were never possible before. Ancestrys suite of products includes: AncestryDNA, AncestryProGenealogists, Fold3, Newspapers.com, Find a Grave, Archives.com, and Rootsweb.\n<br><br>\nWe offer excellent benefits and a competitive compensation package. For additional information, regarding our benefits and career information, please visit our website at http://ancestry.com/careers<em>.</em>\n<br><br>\n<em>IND2</em>\n<br><br>\n<em>#LI-Post</em>"}