{"job title": "Technical Support Engineer", "company": "Area 1 Security", "city state": "– Redwood City, CA", "rating": "5.0", "job description": "<div>Area 1 Horizon, a native cloud-based service, the only one which is preemptive, accurate &amp; accountable.It deploys in minutes and stops phishing attacks across all traffic vectorsemail, web, or network.Phishing attacks remain the primary cybersecurity threat to organizations of all sizes. Existing defenses struggle with these highly focused and sophisticated campaigns. Users are constantly lured into falling for phishing baits, leading to massive financial damage and data loss. The speed, variety, and cunning of these attacks underscore the urgent need for a new, advanced platform to address them which is what Area 1 is all about.</div><br>\n\n<div>We are looking for a Technical Support Engineer to be a primary point of contact to existing customer. The ideal candidate will be flexible, detail-oriented, and skilled at working with customers (Security &amp; SaaS services preferred). This position requires the ability to work with minimal direction, the capacity to work quickly, and identify and fix root cause of technical issues. Having an eye for process and product improvement is critical as we look to the team for input on how to evolve our collection processes and tools across our products.</div> Responsibilities:\n\n<ul>\n<li>Provide support to troubleshoot and resolve technical issues reported by customers and other team members through phone, chat, and ticket channels.</li><li>Identify bugs, test, reproduce, report, and work with the dev &amp; security engineers to assist with a fix and test/verify fix versions.</li><li>Provide ideas and assist with creation of documentation and training material for external and internal Support Center content.</li><li>Maintain clear, concise, and positive communication for all cases in a timely and efficient manner including follow-ups with customers, team members, and engineers.</li><li>Stay familiar with all of Area 1 products, offerings, and integrations as well as those of other competitors and partners in the industry.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n<ul>\n<li>5+ years of Technical Support or Customer Service in the cybersecurity area preferred.</li><li>Ability to handle high volume of tickets, phone calls, and chats.</li><li>Bachelor's degree in Computer Engineering, Management Information Systems or equivalent degree/experience.</li><li>Excellent communication (both oral, written, and interpersonal) and customer service skills are a must.</li><li>Ability to work in a fast-paced, team-oriented environment while maintaining a positive attitude towards customers and team-members.</li>\n</ul>\n\n<strong>Benefits:</strong>\n\n<ul>\n<li>Competitive salary and meaningful equity.</li><li>Catered lunch every weekday, plus a fully stocked kitchen with snacks and cold breakfast items.</li><li>Annual performance reviews - great work is rewarded!</li><li>Partially Funded Comprehensive medical, dental, and vision coverage.</li><li>Open vacation policy and 12 corporate holidays.</li><li>Stay healthy with our fully funded One Medical membership for you and your dependents.</li><li>401k plan.</li><li>Commuter benefits.</li><li>MacBooks are our standard, but were happy to get you whatever equipment helps you get your job done.</li><li>Anniversary and performance awards.</li><li>Pets welcome!</li><li>Fun events for employees, friends, and family!</li>\n</ul>\n\n<div>Area 1 Security is an equal opportunity employer and we value diversity. All employment is decided on the basis of qualifications, merit and business need. We are committed to building a team that represents a variety of backgrounds, perspectives, and skills.</div> <li>To all recruitment agencies:* Area 1 Security does not accept agency resumes. Please do not forward resumes to our jobs alias, Area 1 Security employees or any other company location. Area 1 Security is not responsible for any fees related to unsolicited resumes.</li>"}