{"job title": "Systems Engineer, Autonomous Support", "company": "Arm Holdings", "city state": "– Austin (TX)", "rating": "4.4", "job description": "<div><div>\n<div><strong>We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.</strong></div>\n </div><br>\n\n<div>\n<div>\nJob Description<br><br>The Systems Engineer, Autonomous Support, will join the Vehicle Architecture and Systems Analysis team within the Embedded and Automotive Line of Business (LoB) Unit. As part of the team, you will work collaboratively with partners as they develop their Autonomous systems around Arm architecture. A competitive system solution will strike a fine balance between performance and power consumption. You will support partners in their own development to ensure they produce the most efficient system to optimize performance within a specified power and thermal budget.\n<br><br>\n<strong>Together with our dedicated team you will:</strong>\n\n<ul>\n<li>Work closely with Arm’s partners to ensure that their software runs best on Arm based systems.</li><li>Provide benchmark data to partners to allow comparison between Arm based systems and competition.</li><li>Collaborate with tools vendors, both internal and external, to ensure the eco system is in place to support partners.</li><li>Identify areas for potential improvement in both Autonomous software and hardware.</li><li>Collaborate with IP design teams in Arm and with external partners to improve Arm-based products.</li>\n</ul>\n</div>\n </div><br>\n\n<div>\n<div>\nJob Requirements<br><br><strong>What skills, experience, and qualifications do I need?</strong>\n\n<ul>\n<li>Bachelor’s degree or Master’s degree in Computer Science, Software Engineering, Computer engineering, or in a related field</li><li>Minimum 5 years of experience developing software architecture, requirements and specifications for complex systems</li><li>Experience and understanding in Arm architecture, RTOS, Operating systems, SoC architecture, System architecture</li><li>Deep understanding on Linux internals as well good working knowledge of compilation tools (DS5, Arm Compiler 6, GCC, IAR, Greenhills)</li><li>Fluent with C/C++ programming and scripting (e.g. Python)</li><li>Experience with compilation tools and debugging issues with the source code</li>\n</ul>\n\n<strong>Desirable skills:</strong>\n\n<ul>\n<li>Knowledge of Arm processor architecture</li><li>Experience with setting up servers, applications, and tuning application performance</li><li>Knowledge of performance analysis tools and methodologies</li><li>High-level knowledge of computer architecture including translation, caching, IO devices, DRAM, etc. ...</li><li>Excellent problem-solving skills</li><li>Dedicated and self-motivatedWillingness to be flexible and accept new challenges</li><li>Excellent written and oral interpersonal skills</li>\n</ul>\n\n<div>\n#LI-JS1</div></div>\n </div><br>\n\n<div>\n<div>\nBenefits<br><br>Your particular benefits package will depend on position and type of employment and may be subject to change. Your package will be confirmed on offer of employment. Arm’s benefits program provides permanent employees with the opportunity to stay innovative and healthy, ensure the wellness of their families, and create a positive working environment.\n<ul>\n<li>Annual Bonus Plan</li>\n\n<li>Discretionary Cash Awards</li>\n\n<li>401(k), 100% matching on first 6% eligible earnings</li>\n\n<li>Medical, Dental &amp; Vision, 100% coverage for employee only, shared cost for dependents</li>\n\n<li>Basic Life and Accidental Death and Dismemberment Insurance (AD&amp;D)</li>\n\n<li>Short Term (STD) and Long Term (LTD) Disability Insurance</li>\n\n<li>Vacation, 20 days per year with option to buy 5 more.</li>\n\n<li>Holidays, 13 days per year</li>\n\n<li>Sabbatical, 20 paid days every four-years of service</li>\n\n<li>Sick Leave, 7 days per year</li>\n\n<li>Volunteering, four hours per month (TeamARM)</li>\n\n<li>Office location dependent: café on site, fitness facilities, team and social events</li> \n\n<li>Additional benefits include: Flexible Spending Accounts for health and dependent care, EAP, Health Advocate, Business Travel Accident Program &amp; Commuter programs.\n<br>\nARM, Inc. (USA) participates in E-Verify. For more information, please refer to www.dhs.gov/E-Verify</li>\n\n</ul>\n</div>\n</div><br>\n\n<div>\n<div>\nAbout Arm<br><br>Arm® technology is at the heart of a computing and connectivity revolution that is transforming the way people live and businesses operate. From the unmissable to the invisible; our advanced, energy-efficient processor designs are enabling the intelligence in 86 billion silicon chips and securely powering products from the sensor to the smartphone to the supercomputer. With more than 1,000 technology partners including the world’s most famous business and consumer brands, we are driving Arm innovation into all areas compute is happening inside the chip, the network and the cloud.\n<br><br>\nWith offices around the world, Arm is a diverse community of dedicated, innovative and highly talented professionals. By enabling an inclusive, meritocratic and open workplace where all our people can grow and succeed, we encourage our people to share their unique contributions to Arm's success in the global marketplace.\n</div> </div><br>\n\n<div>\n<div>\nAbout the office<br><br>The Arm Austin office employs staff from across all divisions of ARM and is considered the engineering hub for North America. Austin has the nickname of “Silicon Hills” thanks to the high number of tech companies in the area, and is also known as the “Live Music Capital of the World\". Events such as South by Southwest, Austin City Limits Music Festival and the F1 Grand Prix are but a few of the many activities that make Austin a top destination for both residents and travelers.<br>\n<div>\n<div>\n<strong> Austin, TX USA</strong> \n<br>\nArm Inc.\n<br>\nEncino Trace\n<br>\n5707 Southwest Pkwy\n<br>\nBldg 1 Suite 100\n<br>\nAustin, TX. 78735\n<br><br>\nSee on Google maps</div>\n </div>\n </div> </div>\n </div>\n\n<br>"}