{"job title": "Software Engineer II (Embedded Systems)", "company": "BAE Systems", "city state": "– Fort Walton Beach, Florida", "rating": "3.5", "job description": "<strong>Job Description</strong><br>\n\n<div><strong>I. BASIC FUNCTIONS OF THE JOB:</strong></div><div>Work as a member of a Radar System Software development team to develop Command and Control Interfaces,\n<br>\nReal-time system control code, Radar Subsystem development, Range Control System and Graphics Package development. Candidate will develop code and unit tests to a documented design. In addition to the above activities the candidate will assist in other basic Software Engineering activities such as peer reviews, code reviews, and Software configuration management.</div><div>\nII. PRIMARY DUTIES AND RESPONSIBILITIES: (Duties and responsibilities which occupy a major portion of time and importance in the job. Incumbent(s) perform one or more of the following duties.)</div><div>1. Assists in development and evaluation of moderately complex software designs to reduce/identify design flaws that would cause defects.</div><div>2. Assists in preparing design documentation for moderately complex software designs in accordance with established software development processes and procedures.</div><div>3. Codes and unit tests moderately complex software units to a documented design.</div><div>4. Assist in the preparation of software engineering change orders, change proposals and corrective action reports.</div><div>5. Assist in evaluations/trade studies for software development tools.</div><div>6. Will follow the direction of Lead Software Engineer to Develop Radar System and Range Control System software components.</div>\n\n<br><strong>Typical Education &amp; Experience</strong> \n<br><br>\nTypically a Bachelor's Degree and 2 years work experience or equivalent experience\n<br><br>\n<strong>Required Skills and Education</strong><br>\n\n<div>Typically a Bachelor's Degree and 2 years work experience or equivalent experience\n<br><br>\nDegree must be in Computer Engineering and or Computer Science.</div>\n<br>\n<div>Must have at least 1 to 3 years of experience with programming in C, or C++.\n<br><br>\nBackground in real-time embedded systems with Emphasis in Command and Control interfaces desired as well as a basic understanding of physics and network programming</div>\n\n<br><strong>About BAE Systems Intelligence &amp; Security</strong> \n<br><br>\nBAE Systems Intelligence &amp; Security, based in McLean, Virginia, designs and delivers advanced defense, intelligence, and security solutions that support the important missions of our customers. Our pride and dedication shows in everything we dofrom intelligence analysis, cyber operations and IT expertise to systems development, systems integration, and operations and maintenance services. Knowing that our work enables the U.S. military and government to recognize, manage and defeat threats inspires us to push ourselves and our technologies to new levels. Thats BAE Systems. Thats Inspired Work. Equal Opportunity Employer/Females/Minorities/Veterans/Disabled/Sexual Orientation/Gender Identity/Gender Expression. To see Inspired Work in action, visit www.baesystems.com and follow us on Facebook: www.facebook.com/baesystemsintel."}