{"job title": "Cloud Developer / System Engineer", "company": "BOEING", "city state": "– Hanover, Maryland", "rating": "3.5", "job description": "<div><strong>**THIS POSITION REQUIRES AN ACTIVE TS/SCI WITH POLY CLEARANCE**</strong>\n<br><br>\n<strong>Boeing Intelligence &amp; Analytics (\"BI&amp;A\"),</strong> a subsidiary of The Boeing Company, is seeking a <strong>Cloud Developer/System Engineer</strong> to join their top-tier team.\n<br><br>\n<strong>DUTIES WILL INCLUDE:</strong>\n<br><br>\n· Design, development, and deployment of Utility Cloud Service offerings\n<br><br>\n· Work with enterprise-level IaaS network and data storage environments to ensure compliance is achieved within the deliverable period of performance.\n<br><br>\n· Apply systems engineering principles throughout the life cycle phases.\n<br><br>\n· Interact with the customer regarding systems engineering technical considerations, and regarding associated problems, issues or conflicts and potential outages.\n<br><br>\n· Prepare, review, revise and maintain technical documentation to include system configuration, architectural, software and systems engineering, system operations, testing and user documentation.\n<br><br>\n· Facilitate the integration of new capabilities into the system-of-systems design for the program.\n<br><br>\n· Provide strategic guidance and engineering to successfully manage and align multiple projects and capabilities to improve efficiency and effectiveness.\n<br><br>\n<strong>REQUIRED EDUCATION AND EXPERIENCE</strong>\n<br><br>\n· Bachelors Degree or higher in computer engineering or in afield related to the computer engineering or computer science disciplines\n<br><br>\n· 8 years of Software Engineering experience\n<ul>\n<li>An additional 4+ years of Software Engineering experience may be substituted for the degree for a total of 12 years</li>\n</ul>\n· 3+ years work experience in the SIGINT, IA, or IT domains\n<br><br>\n· 10 years experience with Linux and platforms\n<br><br>\n· Demonstrated experience and skills in DevOps using tools such as Puppet, Salt, Foreman and other automated deployment capabilities, as well as vmWare.\n<br><br>\n· Demonstrated experience in the areas of Cloud Utility Services such as IaaS, PaaS and DBaaS, user interface/user experience design and development, and systems integration.\n<br><br>\n· Experience with JIRA ticketing system.\n<br><br>\n<strong>DESIRED EXPERIENCE (although NOT required)</strong>:\n<br><br>\n· Experience with open source COTS/GOTS/FOSS solutions\n<br><br>\n· Experience with cloud based computing\n<br><br>\n· CEPH/Gluster experience\n<br><br>\n· Experience with automation tools such as Ansible or Chef<br>\n<div><div><div><div>BI&amp;A is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.\n<br><br>\nEqual Employment Opportunity is the Law (PDF)</div></div></div></div></div>"}