{"job title": "Software Engineering Manager", "company": "BrightEdge", "city state": "– Cleveland", "rating": "3.3", "job description": "<div>Interested in spearheading breakthroughs in Big Data, Machine Learning, and Artificial Intelligence on a successful SEO platform? BrightEdge needs an Engineering Manager!</div><div>As the industry pioneer behind Content Performance Marketing, BrightEdge has thoroughly redefined the concept of search engine optimization (SEO) by developing an award-winning platform that precisely measures and optimizes marketing content across online channels. Our cloud-based platform is powered by big data analysis that allows our customers to plan, optimize, and measure campaigns based on real-time content performance. BrightEdge has emerged as the leading international provider of cloud-based SEO Enterprise solutions due to its dynamic and results oriented entrepreneurial culture.</div><div>The BrightEdge S3 platform is the leading technology in the SEO space, and given some of our latest innovations on Content, social signals and mobile, we are looking to expand our leadership across even more areas. In this hands-on position, you will lead a team of developers and contribute on the architecture/design of our platform. We are constantly innovating and never looking to settle. We hope to find somebody who has a passion to lead/mentor developers, while helping to lead big sections of our technology stack.</div> Core Responsibilities\n\n<ul>\n<li>Design and develop a robust data infrastructure both for our own data collections and partner data</li><li>Design and scale a massive-scale (100+ PB) data collection effort that can be organized and fetched in near real-time</li><li>Participate in the design and facilitate the development of key back-end components in Python, Java, and other relevant languages</li><li>Develop and maintain a culture that values commitments, collaboration, and quality work</li><li>Develop highly scalable systems using open source technologies like Hive, Impala, Hadoop, HBase, and cloud technologies (Amazon EC2)</li><li>Be responsible for end-to-end delivery of features, collaborate with SREs, Devs, PMs and customer support</li>\n</ul>\n\nWhat it Takes to be Successful\n\n<ul>\n<li>Passion and track record for data driven executions. Enjoy experimentation, data analytics tools, statistics analysis</li><li>Passion and track record for software development (8+ years developing experience)</li><li>Obsession in seeking customer feedback, innovations, and micro services to solve large scale problems</li><li>Be a combination of a highly-technical software engineer and an effective people manager</li><li>Recent experience working in a start-up</li><li>Self-starter attitude</li><li>At least a Bachelors degree in Computer Science or related field</li><li>A strong desire to learn new technologies and work on innovative projects</li><li>The ability to excel in a fast-paced environment</li>\n</ul>\n\nBenefits &amp; Perks\n\n<ul>\n<li>Competitive Salary with Stock Options</li><li>Medical / Dental / Vision Insurance / PTO</li><li>Team networking, social events, Friday company lunches</li><li>Hackathons</li><li>Fully stocked kitchens</li><li>Comfortable working spaces</li>\n</ul>\n\n<div><strong>About BrightEdge</strong></div><br>\n<div>BrightEdge Technologies, Inc. (<strong>www.BrightEdge.com</strong>) is privately held and the leader in cloud-based SEO and Content Performance Marketing solutions for over 1200 enterprise, corporate, and agency customers and 9000 brands. The BrightEdge platform boosts their marketing performance by streamlining, automating, and integrating search optimization, social marketing, and content performance management capabilities for its customers. Advanced BrightEdge technology delivers visibility, executable recommendations, competitive insights, and dynamic performance metrics. With the largest technology, sales, and customer success teams in our industry, we help customers innovate and execute to achieve superior marketing performance.</div>"}