{"job title": "Software Engineer Data Center Infrastructure", "company": "Dell", "city state": "– Round Rock, Texas", "rating": "3.8", "job description": "<strong>Software Engineer Data Center Infrastructure</strong>\n<br><br>\n<strong>Location: Round Rock, TX or Southboro, MA</strong>\n<br><br>\nDell provides the technology that transforms the way we all work and live. But we are more than a technology company we are a people company. We inspire, challenge and respect every one of our over 100,000 employees. We also provide them with unparalleled growth and development opportunities. We cant wait for you to discover this for yourself as an IT End User Support Technician on our End User Support Services team.\n<br><br>\nDell Digital is a world-class IT organization that employs 5000+ across the globe. We are focused on driving business transformation, superior customer satisfaction, and revenue growth through innovation and cutting-edge technology that leverages traditional ERP, as well as cloud, analytics, mobile, and social solutions.\n<br><br>\n<strong>General Summary:</strong>\n<br><br>\nModernize our global data center infrastructure, automate the delivery of cloud services, and transform application hosting to enable and modernize application development, testing and delivery for business agility.\n<br><br>\n<strong>Principal Duties and Responsibilities:</strong>\n<ul>\n<li>Contributes to the design and development of integration solutions involving primarily VMware automation products and multi-tiered virtual resource management applications</li><li>Uses various software technologies, including Java web services database systems and third party vendor tools, APIs and CLIs</li><li>Implements full cycle cloud provisioning (SDDC) and disposing solutions on vCenter and vSphere using VMware, EMC and Pivotal products, integrating with Java Spring framework using the Spring tools suite</li>\n</ul>\n<strong>Qualifications:</strong>\n<br><br>\nRequired:\n<ul>\n<li>Bachelors degree in Computer Science, Computer Engineering or related field with 3+ years of relevant experience; or Masters degree with 2+ years relevant experience</li><li>Solid automation software development integration background</li><li>Strong distributed enterprise systems knowledge</li><li>Understanding of VMware products</li><li>Able to quickly learn systems, processes, and procedures, grasp technical concepts, and adapt easily to change</li><li>Must have a passion for learning and demonstrable intellectual curiosity</li><li>Able to manage competing demands, multiple priorities, while remaining adaptable and flexible</li><li>Strong communications skills</li>\n</ul>\nPreferred/Nice to Have:\n<ul>\n<li>Development experience with VMware vRealize Automation (vRA) and/or enterprise hybrid cloud (EHC) solutions</li><li>Puppet Configuration Management</li><li>Data Center expertise</li>\n</ul>\n<strong>Benefits</strong>\n<br>\nWe offer highly competitive salaries, bonus programs, world-class benefits, and unparalleled growth and development opportunities all to create a compelling and rewarding work environment.\n<br><br>\nIf you can keep groundbreaking projects on track, this is your opportunity to develop with Dell.\n<br><br>\n<strong>Dell</strong> is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Learn more about Diversity and Inclusion at Dell here."}