{"job title": "Senior Software Engineer (Windows Desktop)", "company": "Dexcom", "city state": "– Portland, Oregon", "rating": "3.5", "job description": "We're Dexcom, a Diabetes healthcare company. Youll be working at our Software Center of Excellence located in downtown Portland. The team is smart, driven, and growing -- we need great engineers to help us continue to deliver innovative software solutions for diabetes management. As a member of our team you'll make a real difference in the lives of people living with diabetes.\n<br><br>\nAs a Sr. Software Engineer working on our client/mobile development team you'll help us develop modern desktop and mobile applications to help patients and healthcare professionals manage diabetes.\n<br><br>\n<strong>You'll be great in the position if:</strong>\n\n<ul>\n\n <li> You have experience with C# Windows Desktop Developer (e.g., WCF, WiX, etc)</li> \n\n<li>Youre comfortable consuming APIs and interpreting results.</li> \n\n<li>You are happy to contribute in native development for Android and iOS.</li> \n\n<li>You believe that good testing is critical to create good software.</li> \n\n<li>You prefer working in a collaborative, team environment and have the strong communication skills necessary for effective teamwork.</li> \n\n<li>You enjoy working with others in person.</li> \n\n<li>You can effectively manage your time and are comfortable supporting and coaching others.</li> \n\n<li>You are a fast learner and love to stay up to date with the latest technology.</li>\n</ul>\n<strong>Qualifications:</strong>\n\n<ul>\n\n <li>Bachelor's degree in Computer Science or Engineering from four-year college or university or equivalent work experience</li> \n\n<li>At least 5 years software development experience</li>\n</ul>\n<strong>Experience that would give you an edge:</strong>\n\n<ul>\n\n <li>Experience with C# Windows / Mac development</li> \n\n<li>Experience with Xamarin.Mac</li> \n\n<li>Experience with Swift</li> \n\n<li>Experience with Java/Kotlin</li> \n\n<li>Experience with internationalizing products</li> \n\n<li>Experience with Google Analytics</li> \n\n<li>Experience creating medical products or working in a regulated industry</li>\n</ul>\n<strong>Additional Information:</strong>\n\n<ul>\n\n <li>We offer competitive salaries, meaningful stock bonuses, health benefits, and a great work environment.</li> \n\n<li>We encourage you to submit things youve built, samples of code, commits to open source projects and cover letters along with your resume.</li>\n</ul>\n\n<div> \n<div>#LI-BA1</div>\n </div>\n<br><em>An Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against on the basis of disability.</em>\n<br><br>\n<em>If you are an individual with a disability and would like to request a reasonable accommodation as part of the employment selection process, please contact Talent Acquisition at talentacquisition@dexcom.com.</em>\n<br><br>\n<em>To all Staffing and Recruiting Agencies: Our Careers Site is only for individuals seeking a job at Dexcom. Only authorized staffing and recruiting agencies may use this site or to submit profiles, applications or resumes on specific requisitions. Dexcom does not accept unsolicited resumes or applications from agencies. Please do not forward resumes to the Talent Acquisition team, Dexcom employees or any other company location. Dexcom is not responsible for any fees related to unsolicited resumes/applications.</em>"}