{"job title": "Senior Data Architect", "company": "Experian", "city state": "– Allen, TX", "rating": "3.6", "job description": "<div><div><div><div><div>Experian is the leading global information services company, providing data and analytical tools to our clients around the world. We have always believed that data has the potential to transform lives and create a better tomorrow. We are transforming data into something meaningful: helping businesses to manage credit risk, preventing fraud, targeting marketing offers and automating decision making. We have been named one of the “World’s Most Innovative Companies” by Forbes for 3 years in a row. Experian has operated at the center of Big Data since before the phrase was coined. Few companies can offer information services on an equivalent scale.\n<br><br>\nExperian IT Services is the centralized technology organization that globally supports all of Experian. Our organization is comprised of about 2,000 employees across the globe supporting and improving our business-critical IT environment/ecosystem. Experian IT Services includes Infrastructure Services, Cyber &amp; Information Security, and Enterprise Architecture. We drive growth through reusable technology providing quicker time to market for solutions, increased productivity, and a more secure environment.\n<br><br>\nWe are looking for an experienced Senior Data Architect to work closely with our business functions (Sales, Service, Finance, HR) and technical development teams. The Senior Data Architect will:\n<ul>\n<li>Provide a standard common business vocabulary.</li><li>Express strategic data requirements in terms of business benefit.</li> <li>Outline high level integrated designs to meet these requirements.</li><li>Align with enterprise strategy and related business architecture.</li><li>Recommend database structures based on the data storage and retrieval needs.</li><li>Recommend monitoring and pro-active maintenance approaches for repositories (structured and unstructured).</li><li>Report regularly on integration initiatives, extensions of the target data architecture.</li><li>Liaise with key stakeholders to track the changing data needs of the company and adjust target state accordingly</li> \n</ul>\n\n<strong>Job Functions:</strong>\n<br><br>\n<strong>\n<ul>\n<li>Foundation in systems development:</li>\n</ul>\n\n</strong>\n\n<ul>\n<li>The data architect should understand the system development life cycle; software project management approaches; and requirements, design, and test techniques. The data architect is asked to conceptualize and influence application and interface projects, and therefore must understand what advice to give and where to plug in to steer toward desirable outcomes.</li> </ul>\n\n\n<ul>\n<li>Depth in data modelling and database design:</li>\n</ul>\n\n\n<ul>\n<li>The effective data architect will be sound across all phases of data modelling, from conceptualization to database optimization and have experience in SQL development, Hadoop tooling, Kafka deployment, and database administration.</li> \n</ul>\n\n<strong>Functional Responsibilities:</strong>\n\n<ul>\n<li>To set data architecture principles.</li><li>To create models of data that enable the implementation of the intended business architecture.</li><li>To create diagrams showing key data entities.</li><li>To create an inventory of the data needed to implement the architecture vision.</li><li>To organize data at the macro level (i.e. which subject areas are managed in which goldensources).</li><li>To organize data at the micro level (i.e. data models for new applications).</li><li>To provide a logical data model as a standard for the goldensource and for consuming applications to inherit.</li><li>To provide a logical data model with elements and business rules needed for the creation &amp; support of DQ rules.</li><li>To remain abreast of technology and its impact on data architecture, including Big Data, Streaming Analytics, etc.</li><li>To work with Enterprise Architects to provide relevant design and architecture documentation.</li><li>To work with Security Architects to ensure adequate security of sensitive data elements (eg. GDPR, HIPPA)</li> \n</ul>\n\n<div>Qualifications:\n<ul>\n<li>Clearly demonstrate hands-on leadership of major data architecture projects or programs.</li><li>Clearly demonstrate knowledge of current technologies and their applications and impact on data Architecture.</li><li>Experience working in global organizations; multi-lingual and multicultural environment; offshore and/or outsourced development teams and third party suppliers.</li><li>5-7 years of experience in data architecture with enterprise systems such as CRM, ERP, Service Management, and reporting.</li><li>It is considered desirable not essential that the applicant have knowledge of relevant Oracle products.</li> \n</ul>\nExperian is an Equal Opportunity Employer. Anyone needing accommodation to complete the interview process should notify the talent acquisition partner. The word \"Experian\" is a registered trademark in the EU and other countries and is owned by Experian Ltd. and/or its associated companies.\n<br><br>\nEOE including Disability/Veterans</div>\n </div>\n</div>\n </div>\n </div>\n</div>\n<br>"}