{"job title": "Stress Engineering Manager", "company": "HAECO Americas", "city state": "– US-NC-Greensboro", "rating": "2.9", "job description": "Overview<br><br>Accomplishment of engineering stress and substantiation services within budget in accordance with\n<br><br>\nFAA/EASA, customer and HAECO standards of quality.\n<br><br>\n<strong>ESSENTIAL JOB DUTIES:</strong>\n<li>Coordinate the Stress Engineering group’s activity by providing technical support, supervision and guidance to stress engineering personnel for engineering programs in which HAECO is involved.</li>\n<li>Develop well defined HAECO statements of work from customer provided specifications and air framers specifications.</li>\n<li>Provide man-hour estimates, for stress engineering and be accountable for the technical content of analysis undertaken by the Stress Engineering group, and coordinate with other functional groups within HAECO.</li>\n<li>Responsible for engineering data (analysis, reports, manuals, etc.) required to substantiate a product or aircraft modification achieve Airline and Regulatory acceptance of the installed parts. Provide the proper man-loading of the Engineering team to ensure that those hours expended are used most effectively.</li> \n\n<li>Interface with HAECO certification/DER/UM and designers to ensure that all designs meet established FAA and where required by contract EASA or other foreign regulatory criteria.</li>\n<li>Attend and support the standard program design reviews with customers and either aircraft OEM’s or STC applicants.</li>\n<li>Set group objectives, assign projects and evaluate group(s) work for content and conformity with FAA, customer and HAECO requirements.</li>\n<li>Develop program quotations from data provided by sales on the project. Maintain involvement in day to day HAECO operations to ensure that the highest level of engineering support is maintained at all times.</li>\n<li>Analyze and check structural engineering data produced by other engineering groups to ensure it meets the structural requirements for FAA certification.</li>\n<li>Create and develop structural engineering substantiation reports that will be used to certify repair and modification data.</li>\n<li>Create, develop, and implement test procedures as required to obtain certifiable allowables data for use by TIMCO.</li>\n<li>Assist and guide Stress Engineers in accomplishing analytical substantiation tasks.</li>\n<li>Initiate support for other Engineering groups as workload requirements dictate.</li>\n<li>Provide input and suggestions for continuous improvement of various department procedures, controls, flows and systems, and increase familiarity with HAECO’s internal policies and procedures.</li>\n<li>Coordinate, in a professional manner, with customers, major manufacturers, vendors, FAA (when needed), or other outside agencies to promote and support HAECO’s technical &amp; commercial interests.</li>\n\nQualifications<br><br><strong>MINIMUM:</strong>\n<li>Bachelor’s degree in Engineering or related scientific field.</li>\n<li>Ten (10) years experience in aircraft/aerospace engineering design field. Should have experience of working programs with a major OEM i.e. Airbus, Boeing.</li>\n<li>Minimum three (3) years experience utilizing a 2D/3D cad system, with obvious and demonstrable proficiency in hand sketching or concepts.</li>\n<li>Must possess extensive knowledge of FAA regulations, certification processes and related requirements.</li>\n<li>Must possess comprehensive knowledge of standard aircraft components, materials, fabrication practices, aviation hardware and proper applications in design. Must also possess knowledge of engineering principles used in stress analysis, finite element modeling (FEM), 3D computer modeling, or other analytical substantiation techniques.</li>\n<li>Must possess extensive knowledge of personal computer systems with Microsoft Office and Microsoft Project.</li>\n<li>Must be able to travel both domestically and internationally.</li>\n<li>Must have extensive knowledge of the use and application of aircraft technical data such as engineering drawings, MDL’s, LOPA’s, Envelope drawings, SL’s, SB’s, CMM’s, etc.</li>\n<li>Must have the ability to manage, organize and motivate people in technical positions.</li>\n<li>Must have superior oral, written and organizational skills that are easily applied to administration and management. Must and be able to read, write, speak and understand the English language.</li>\n<li>Must be a self starter, highly motivated and be able to work under pressure with a minimum level of supervision.</li>\n<li>Must possess ability to maneuver around airplanes (i.e. climbing stairs, on work stands, man lifts, etc.) and in confined areas (i.e. cargo compartments, fuel tanks, E/E bays, etc.). Must also be able to lift and carry 15 lbs.</li>"}