{"job title": "Specialist, Software Engineer", "company": "Harris", "city state": "– Nashua, NH", "rating": "3.3", "job description": "Description:<br><br><strong>Job Title: Software Engineer</strong>\n<br><br>\n<strong>Requisition: ES20182506-25559</strong>\n<br><br>\n<strong>Location: Nashua, NH</strong>\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nHarris Corporation is looking for a motivated Software Engineer to support the development of Software Defined Radio (SDR) and Electronic Countermeasure (ECM) products used to protect soldiers and diplomats across the globe.\n<br><br>\nWork with industry professionals through the complete software development process including requirements generation, architecture and design, implementation, and system integration and validation.\n\n<ul>\n<li>Use industry standard tools and agile development processes</li>\n<li>Communicate across engineering disciplines</li>\n<li>Work independently</li>\n<li>Analyze problems and recommending solutions</li>\n<li>Debug at the hardware/software interface</li>\n<li>Support system integration, verification and validation activities.</li>\n</ul>\n<strong>Qualifications:</strong>\n\n<ul>\n<li>Bachelor’s Degree and minimum 4 years of prior relevant experience; or, Graduate Degree and a minimum of 2 years of prior related experience.</li>\n<li>At least 4 years of experience with C/C++</li> \n\n<li>Embedded Linux experience</li> \n\n<li>Experience with Agile Development Methods and Tools</li>\n<li>Ability to manage small to medium scale individual projects</li>\n<li>Object Oriented application development</li>\n<li>Candidate must be able to obtain a security clearance. In order to obtain a clearance, you must be a US Citizen and show proof of citizenship</li>\n</ul>\n<strong>Preferred Additional Skills:</strong>\n\n<ul>\n<li>Linux Driver Development</li>\n<li>Python</li>\n<li>Yocto</li>\n<li>Boot Loaders</li>\n<li>Cross Compilers</li>\n<li>Xilinx Zynq / Vivado SDK</li>\n<li>GIT</li>\n<li>Comfortable with lab equipment (Oscilloscopes / Spec-A / Sig-Gen)</li>\n</ul>\n<strong><em>Please be aware that many of our positions require a security clearance or the ability to obtain one. Security clearances may only be granted to U.S. citizens. In addition, applicants who accept a conditional offer of employment may be subject to government security investigation(s) and must meet eligibility requirements for access to classified information.</em> </strong>\n<br><br>\n<strong><em>By submitting your résumé for this position, you understand and agree that Harris Corporation may share your résumé, as well as any other related personal information or documentation you provide, with its subsidiaries and affiliated companies for the purpose of considering you for other available positions.</em></strong>\n<br><br>\n<strong><em>Harris is an Equal Opportunity/Affirmative Action Employer. We consider applicants without regard to race, color, religion, age, national origin, ancestry, ethnicity, gender, gender identity, gender expression, sexual orientation, marital status, veteran status, disability, genetic information, citizenship status, or membership in any other group protected by federal, state or local law</em></strong>\n<br><br>\n<strong>“Candidates will support Environment, Health and Safety by fulfilling the Harris EHS Policy, complying with Harris EHS programs and applicable regulations, and striving for continual EHS improvement.”</strong>\n<br><br>\n<strong><em>#LI-ES</em></strong><br><br>Location: USA - NH - Nashua\n<br>\nActivation Date: Thursday, July 12, 2018\n<br>\nExpiration Date: Saturday, July 13, 2019\n<br>\nApply Here"}