{"job title": "Software Engineer, Senior Specialist", "company": "Harris", "city state": "– Palm Bay, FL", "rating": "3.3", "job description": "Description:<br><br><strong>Job Title:</strong> Sr Spec, Software Engineering\n<br>\n<strong>Job Code:</strong>ES20181008-26593\n<br>\n<strong>Location:</strong> Palm Bay, FL\n<br><br>\n<strong>Job Description:</strong>\n\n<ul>\n<li>Design, develop, operate and maintain software components and computing systems software to be applied to and integrated with engineering, scientific and manufacturing requirements.</li> \n\n<li>Develop real time embedded systems involving software for digital signal processing, electronic warfare, and control and display components, interface with customers, suppliers, application users and other technical and support staff.</li>\n<li>Participate in the full life cycle of most projects (embedded development, analyzing requirements to integration).</li>\n</ul>\n<strong>Qualifications:</strong>\n\n<ul>\n<li>BS in Computer Science, Computer Engineering or Electrical Engineering.</li>\n<li>6+ years’ experience in software development</li> \n\n<li>6+ years working with C++</li>\n<li>VxWorks or similar embedded OS experience</li>\n<li>UML design experience</li>\n<li>Ability to work on both high and low level software</li>\n<li>Strong background in software integration and verification</li>\n<li>An Active Secret Security Clearance</li>\n</ul>\n<strong>Additional Preferred Skills:</strong>\n\n<ul>\n<li>Comprehensive knowledge of software operating systems, software products and installation procedures</li>\n<li>In-depth knowledge of Linux and Windows Operating systems</li>\n<li>Extensive knowledge of preparing test plans, analyzing software requirements and developing design specifications</li>\n<li>Electronic Warfare and Radar experience is a plus</li>\n<li>Experience with ADA 83 &amp; 95</li>\n<li>DOORS and MKS experience a plus</li>\n</ul>\n<strong>This position requires the candidate to be able to obtain a SECRET security clearance in order to obtain a clearance you need to be a US Citizen and show proof of citizenship.</strong>\n<br><br>\n<strong>Job Contingent upon award</strong>\n<br><br>\n<strong>By submitting your resume for this position, you understand and agree that Harris Corporation may share your resume, as well as any other related personal information or documentation you provide, with its subsidiaries and affiliated companies for the purpose of considering you for other available positions.</strong>\n<br><br>\n<strong>Harris is an Equal Opportunity/Affirmative Action Employer. We consider applicants without regard to race, color, religion, age, national origin, ancestry, ethnicity, gender, gender identity, gender expression, sexual orientation, marital status, veteran status, disability, genetic information, citizenship status, or membership in any other group protected by federal, state or local law.</strong><br><br>Location: USA - FL - Palm Bay\n<br>\nActivation Date: Friday, August 10, 2018\n<br>\nExpiration Date: Wednesday, May 29, 2019\n<br>\nApply Here"}