{"job title": "Software Engineer C++/ADA", "company": "Harris", "city state": "– Clifton, NJ", "rating": "3.3", "job description": "Description:<br><br><strong>Title:</strong> Software Engineer- Clifton, NJ\n<br><br>\n<strong>Job ID: ES20181306-25247</strong>\n<br><br>\n<strong>Job Description:</strong>\n\n<ul>\n<li>Designs, develops operates and maintains software components and computing systems software to be applied to and integrated with engineering, scientific and manufacturing requirements. Applies the appropriate standards, processes, procedures and tools throughout the system development life cycle to support the generation of engineering applications and products. Developments real time embedded systems involving SW for digital signal processing, electronic warfare, and control and display components. Interfaces with customers, suppliers, application users and other technical and support personnel.</li>\n</ul>\n<strong>Qualifications:</strong>\n\n<ul>\n<li>A Bachelors degree in Computer Science, Electrical Engineering, or related engineering field.</li>\n<li>2+ Years of Embedded Software Engineering experience.</li>\n<li>Real Time Operating Systems Experience.</li>\n<li>Must have experience with following programming languages:(Either applicable. No preference) :</li> \n\n<li>C++ <strong> OR</strong>  ADA 83 and ADA 95</li>\n</ul>\n<strong>Preferred Additional Skills</strong>\n\n<ul>\n<li>EW Background</li>\n<li>Capable of working on both high and low level software</li>\n<li>VxWorks or similar embedded OS experience</li>\n<li>UML design experience</li>\n</ul>\n<strong>This position requires the candidate to be able to obtain an INTERIM SECRET security clearance in order to obtain a clearance you need to be a US Citizen and show proof of citizenship.</strong>\n<br><br>\n<strong>By submitting your resume for this position, you understand and agree that Harris Corporation may share your resume, as well as any other related personal information or documentation you provide, with its subsidiaries and affiliated companies for the purpose of considering you for other available positions.</strong>\n<br><br>\n<strong>Harris is an Equal Opportunity/Affirmative Action Employer. We consider applicants without regard to race, color, religion, age, national origin, ancestry, ethnicity, gender, gender identity, gender expression, sexual orientation, marital status, veteran status, disability, genetic information, citizenship status, or membership in any other group protected by federal, state or local law.</strong><br><br>Location: USA - NJ - Clifton\n<br>\nActivation Date: Wednesday, June 13, 2018\n<br>\nExpiration Date: Tuesday, November 27, 2018\n<br>\nApply Here"}