{"job title": "Senior Software Engineer", "company": "HomeAway", "city state": "– Austin, TX", "rating": "3.7", "job description": "<strong>About HomeAway:</strong>\n<br><br>\n<strong>HomeAway</strong>, a world leader in the vacation rental industry, is the place to book beach houses, cabins, and condos with more than two million places to stay in 190 countries. The site makes it easy to find and book the perfect vacation rental for any getaway, often for less than the cost of traditional hotel accommodations. HomeAway is part of the Expedia Group family of brands.\n<br><br>\nHomeAways Partner API team is looking for a talented Sr. Software Engineer to demonstrate their hands-on programming and leadership skills. We are building new teams focused on greenfield development using the latest technologies. Our goal is to create the best online vacation rental marketplace with an exceptional user experience that optimally matches traveler demand with property owner supply.\n<br><br>\n<strong>What youll do:</strong>\n<ul>\n<li>Challenges you can work on:<br><br>As a highly competent engineer, you will develop fast, scalable, highly available and reliable micro-services that will process thousands of requests per second. Having access to real-time data and exposure to optimize with machine learning, you will understand customers needs before they do. Additionally, you will be developing features and APIs that will drive our business through real-time feedback loops in the cloud. Other responsibilities will include ownership of continuous integration and deployment (CI/CD) while utilizing Agile methodologies. As part of our continuous learning culture, you will have the opportunity to participate in exciting global company hackathons and various career building courses with co-workers of all levels of expertise.\n<ul>\n<li>Being part of an influential team to solve complex data driven optimization techniques for 3.5 billion visitors a year</li><li>Use real-time data to understand customers needs before they do</li><li>Develop features that will drive our business through real-time feedback loops</li><li>Develop a smart service layer that will allow for in-session personalization based off user behavior and data</li><li>Make bold decisions with your team to influence a new industry</li></ul></li>\n\n<strong></strong><li><strong>Technologies we use:</strong>\n\n<ul>\n<li>AWS, Docker, Mesos, Dropwizard, Elasticsearch, Cassandra, Kafka, Hadoop, Samza, NoSQL, Java8, Python, Spark, Node.js, Git, Scala, Splunk, NewRelic, DataDog, LaunchDarkly</li></ul></li>\n\n<strong></strong><li><strong>Responsibilities:</strong>\n\n<ul>\n<li>Commit to ruthlessly rewriting, refactoring, and perfecting code</li><li>Deliver tested and optimized high performance code for a distributed micro services environment</li><li>Develop quality scalable, tested and reliable applications using industry standard methodologies</li><li>Participate in resolution of production issues and lead efforts toward solutions</li><li>Showcase your work on our tech blog and internal &amp; external conferences</li></ul></li>\n</ul>\n<strong>Who you are:</strong>\n<br><br>\n<strong></strong><ul><strong></strong><li><strong>Requirements:</strong>\n\n<ul>\n<li>BS or MS in Computer Science or equivalent experience</li><li>5+ years of professional software development experience (Java and Python preferred)</li><li>Technical leadership experience</li><li>Excellent communication skills with ability to work well multi-functionally across multiple department</li><li>An analytical problem solver that is passionate about delivering a high-quality user experience</li></ul></li>\n</ul>\n<strong>Benefits &amp; Perks:</strong>\n<ul>\n<li>Competitive health and insurance benefits.</li><li>Competitive salary.</li><li>Annual target bonus or commission.</li><li>Parental leave for up to 20 weeks (dependent on eligibility).</li><li>Paid vacation and sick time.</li><li>Vacation rental on a yearly basis (taxable benefit).</li><li>Employee Stock Purchase Program.</li><li>Free snacks and beverages.</li><li>Frequent company update talks with our leadership team.</li><li>Free listing on HomeAway.com.</li><li>Electronic, adjustable stand-up desk.</li><li>Discounted Metro &amp; Rail pass.</li><li>Casual dress.</li>\n</ul>\n<strong>Why join us:</strong>\n<br><br>\nExpedia Group recognizes our success is dependent on the success of our people. We are the world's travel platform, made up of the most knowledgeable, passionate, and creative people in our business. Our brands recognize the power of travel to break down barriers and make people's lives better that responsibility inspires us to be the place where exceptional people want to do their best work, and to provide them to tools to do so.\n<br><br>\nWhether you're applying to work in engineering or customer support, marketing or lodging supply, at Expedia Group we act as one team, working towards a common goal; to bring the world within reach. We relentlessly strive for better, but not at the cost of the customer. We act with humility and optimism, respecting ideas big and small. We value diversity and voices of all volumes. We are a global organization but keep our feet on the ground so we can act fast and stay simple. Our teams also have the chance to give back on a local level and make a difference through our corporate social responsibility program, Expedia Cares.\n<br><br>\nOur family of travel brands includes: Brand Expedia®, Hotels.com®, Expedia® Partner Solutions, Egencia®, trivago®, HomeAway®, Orbitz®, Travelocity®, Wotif®, lastminute.com.au®, ebookers®, CheapTickets®, Hotwire®, Classic Vacations®, Expedia® Media Solutions, CarRentals.com, Expedia Local Expert®, Expedia® CruiseShipCenters®, SilverRail Technologies, Inc., ALICE and Traveldoo®.\n<br><br>\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}