{"job title": "Senior Electrical Design Engineer", "company": "KeepTruckin", "city state": "– San Francisco, CA", "rating": "4.7", "job description": "<div><strong>About Us</strong>:</div><br>\n<div>KeepTruckin is on a mission to connect the worlds trucks. With the leading ELD and fleet management platform, we are bringing the trucking industry online and fundamentally changing the way freight is moved on our roads.</div><br>\n\n<div><strong>The numbers tell the story:</strong></div><li>The KeepTruckin network is composed of more than 200,000 trucks and is expected to grow to 400,000 by end of 2018.</li>\n<li>We grew from $1 million to more than $50 million in annual recurring revenue in 12 months, among the fastest growing SaaS companies ever.</li>\n<li>Our Glassdoor rating is 4.8 stars. We have built an incredible culture with high trust and transparency, where people feel empowered to do their best work.</li>\n\n<br>\n<div><strong>About the Job:</strong></div><br>\n<div>As a Senior Electrical Design Engineer your duties will include all facets of EE architecture, design, and development. You are expected to be engaged and participate in, architectural, development, build, and recruiting responsibilities. You will act as the primary liaison to teams including but not limited to SW/FW, design, product, and operations. You should be comfortable working in a distributed team layout with rapid growth. You should be comfortable working with vendors and ODMs in Asia. Your contributions will be an facilitating new features on a technological breakthrough device in an untapped market.</div>Responsibilities:\n\n<ul>\n<li>Determine component requirements, and develop architectures for new product concepts containing digital image sensors, application CPU, micro-controllers, low-noise power supplies, sensors, LTE and 3G modems, WiFi, BT/BLE, GNSS and high-speed serial interfaces</li><li>Direct schematic capture</li><li>Direct layout and/or supervision of layout for PCB, and FPC</li> <li>Perform schematic reviews, layout reviews and give feedback for areas of improvement</li><li>Debugging and electrical testing and validation of all electrical designs</li><li>Author clear and comprehensive electrical test documentation for manufacturing partners to complete electrical test and validation</li><li>Develop electronic prototypes for new product concepts</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n<ul>\n<li>7+ years relevant experience architecting and designing embedded electrical systems</li><li>BS in Electrical Engineering</li><li>Core technical skills include but not limited to having an in depth expertise in consumer electronic design, component selection, schematic design, and schematic capture with tools like Cadence Allegro and OrCAD Capture</li><li>Mastery of EE design for digital circuits, including high-speed interfaces and low-speed serial control interfaces, layout for low-noise and switching power supply circuits, and RF coexistence</li><li>Comfortable using all types of electronic test equipment</li><li>Broad knowledge of engineering concepts (device behavior, data analysis, and systems modeling)</li><li>Demonstrated ability to diagnose and solve performance problems</li><li>Ability to plan projects and to communicate clear, measurable, expectations</li><li>Excellent process development and documentation skills</li><li>Experience working with distributed teams is a huge plus</li><li>Sporadic travel is expected in this role</li>\n</ul>\n\n<div>KeepTruckin is a rapidly growing startup headquartered in San Francisco. We offer fantastic benefits, a phenomenal office culture, unlimited PTO, and a stocked kitchen. As an equal opportunity employer, we are committed to diversity in the workforce. We consider qualified applicants without regard to sexual orientation, gender identity, race, veteran or disability status.</div>"}