{"job title": "Senior Staff Platform Engineer", "company": "Lookout", "city state": "– San Francisco, CA", "rating": "3.6", "job description": "Lookout is a cybersecurity company that makes it possible for individuals and enterprises to be both mobile and secure. With 100 million mobile sensors fueling a dataset of virtually all the mobile code in the world, the Lookout Security Cloud can identify connections that would otherwise go unseen -- predicting and stopping mobile attacks before they do harm. The world's leading mobile network operators, including AT&amp;T, Deutsche Telekom, EE, KDDI, Orange, Sprint, T-Mobile and Telstra, have selected Lookout as its preferred mobile security solution. Lookout is also partnered with such enterprise leaders as Microsoft, AirWatch, Ingram Micro and MobileIron. Headquartered in San Francisco, Lookout has offices in Amsterdam, Boston, London, Sydney, Tokyo, Toronto and Washington, D.C. To learn more, visit www.lookout.com\n<br><br>\nLookout's backend system supports a massive volume of data and an increasingly high level of demand, from data ingestion to delivery to dynamic analysis. We're looking for talented and motivated engineers to build core components and services, as well as to contribute to evolving the architecture. We're a small team working on a very large, modern system with a user base of millions, so you'll get to work on a cutting-edge product and service on a large scale. We're responsible for building and maintaining several of the services powering the various Lookout applications. We build services in Scala, Java &amp; Ruby are hosted on AWS and firmly believe in using the cloud to our advantage.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Design, build and maintain high performance and low latency services that are, highly available and scalable.</li>\n<li>Engage in product and feature design with architects and product owners.</li>\n<li>Conduct unit, functional, integration, and other forms of automated testing.</li>\n<li>Help us meet aggressive performance and scalability goals keeping us ahead of dramatic growth in the space.</li>\n<li>Fully participate in the ownership of your services and components, including on-call duties</li>\n<li>Create documentation to enable self service.</li>\n<li>Internal customer outreach, advocacy, and support.</li>\n<li>Mentor junior developers.</li>\n<li>Participate in on call rotation</li>\n</ul>\n<strong>Requirements</strong>\n\n<ul>\n<li>Excellent coding skills in Scala and/or Java.</li>\n<li>Experience designing, building and operating large-scale, complex highly distributed systems in AWS.</li>\n<li>Experience implementing highly scalable ingestion pipelines on messaging infrastructure like Kafka or Kinesis.</li> \n\n<li>Experience implementing RESTful services with APIs on a massively scalable cloud environment.</li>\n<li>Strong object oriented or functional design experience and ability.</li>\n<li>You're a quick, avid learner and a natural problem solver, and you like to get things done at a fast pace.</li>\n<li>Experience with test driven development.</li>\n<li>Skilled at troubleshooting you appreciate the value of testing and can resolve the trickiest of issues, and take the initiative to pitch in and help as issues arise.</li>\n<li>Significant experience with operating production systems and being on on-call rotation</li>\n<li>Experience working on Agile teams.</li>\n<li>Excellent communication and collaboration skills.</li>\n<li>BS/MS in Computer Science or related field/degree, and/or equivalent work experience</li>\n</ul>\n<strong>Bonus Points</strong>\n\n<ul>\n<li>Experience working with large scale ingestion and query pipeline of operational data.</li>\n<li>Experience working with Git, Jenkins, Jira,</li> \n\n<li>Experience working with containers.</li>\n<li>Experience with distributed processing frameworks like Akka and Spark.</li>\n<li>Experience with serverless architectures on AWS, like AWS Lambda.</li>\n<li>Experience/expertise with the following stores - DynamoDB, ElasticSearch, Redis, Cassandra, Aurora.</li>\n</ul>"}