{"job title": "Senior Systems Software Engineer - CUDA Chips", "company": "NVIDIA", "city state": "– US, CA, Santa Clara", "rating": "4.4", "job description": "NVIDIA’s invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined modern computer graphics, and revolutionized parallel computing. More recently, GPU deep learning ignited modern AI — the next era of computing — with the GPU acting as the brain of computers, robots, and self-driving cars that can perceive and understand the world. Today, we are increasingly known as “the AI computing company.” We're looking to grow our company, and build our teams with the smartest people in the world. Join us at the forefront of technological advancement.\n<br><br>\nCUDA defines a unified programming model across a range of system configurations and hardware capabilities. To accomplish this, the CUDA driver interacts with GPU hardware, kernel mode drivers, and the operating system.\n<br><br>\n<strong>We are now looking for a Senior Systems Software Engineer</strong>\n<br><br>\nNVIDIA is seeking a senior software engineer to work in our CUDA system software team. As a member of our team, you will use your design abilities, coding expertise, and creativity to deliver the best compute platform in the world. You will craft elegant solutions to exciting problems and shape the future direction of CUDA as you collaborate with your peers across NVIDIA.\n<br><br>\nYou will have very strong C programming skills, a deep understanding of operating systems and kernel programming, with working knowledge of parallel programming, and hardware architecture. You will work closely with hardware and software engineers to design, develop, and debug many functional aspects of our massively data parallel architecture.\n<br><br>\n<strong>What we need to see:</strong>\n<ul>\n<li>Bachelor of Science in Computer Science or Computer Engineering, (Masters or PhD is a plus), with 3+ years of relevant systems software development experience</li><li>You have excellent C programming skills, with strong knowledge of parallel programming</li><li>Excellent knowledge of computer system architectures</li><li>Experience with complex system-level development and debugging</li><li>We would like to see applicants with great communication and planning skills</li><li>We want you to be self driven, with a focus on execution and quality</li><li>Ability to multitask and perform well under pressure</li><li>Deep understanding of technology and passionate about what you do</li><li>Strong collaborative and interpersonal skills, specifically a proven ability to effectively guide and influence within a dynamic matrix environment</li><li>A strong team player; self motivated and good attitude</li><li>The candidate must be able to work independently with minimal direction</li>\n</ul>\n<strong>Ways to stand out from the crowd:</strong>\n<ul>\n<li>Engineers with CUDA experience are always a plus</li><li>Hardware simulation, emulation, and bringup experience is desirable</li>\n</ul>\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most brilliant and talented people in the world working for us. If you're creative and autonomous, we want to hear from you!<br><br>NVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression , sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law."}