{"job title": "Mainframe Engineer III, IT", "company": "Pentagon Federal Credit Union", "city state": "– Chantilly, Virginia", "rating": "3.5", "job description": "<div><div><div>\n\n \n\n</div>\n\n<strong>\nMainframe Engineer III, IT\n</strong>\n<div>\n<div>\n\nCity\n\n<strong>\nChantilly\n</strong>\n</div>\n<div>\n\nState/Territory\n\n<strong>\nVirginia\n</strong>\n</div>\n<div>\n\nLast updated\n\n<strong>\n4/23/18 9:18 AM\n</strong>\n</div>\n</div>\n</div>\n\nApply Now\n</div>\n<div><p><strong><u>Mainframe Engineer III, IT</u></strong></p>\n<p><strong><u>Summary</u></strong></p>\n<p>PenFed is hiring a Mainframe Engineer III, IT in our Chantilly Datacenter in Chantilly, VA. The primary purpose of this job is to lead engineering specific activities on enterprise infrastructure systems, services and applications. Responsibilities include, but are not limited to, system design; standards based implementation, capacity planning, systems integration, process / procedure development and refinement, and technical support.</p>\n<p> </p>\n<p><strong><u>Essential Functions</u></strong></p>\n<p><em>Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. This is not intended to be an all-inclusive list of job duties and the position will perform <u>other duties as assigned</u>. </em></p>\n<ul>\n<li>Implement systems in a phased approach of requirements analysis, system design review, installation, integration, and testing.</li>\n<li>Lead the development of product/project requirements and success criteria through collaboration with internal and external customers. Leverage these criteria and integrate business and technical knowledge when designing and developing solutions to deliver optimal, elegant solutions that meet functional and non-functional requirements while delivering the best value and user experience.</li>\n<li>Responsible for leading the infrastructure engineering initiatives.</li>\n<li>Responsible for stability, integrity and efficiency of the infrastructure and information systems that support core functions of the business.</li>\n<li>Accountable for providing escalation support to troubleshoot and maintain production infrastructure and to resolve production issues and outages.</li>\n<li>Recommend new and emerging technologies to solve business problems.</li>\n<li>Maintain proper documentation including configuration specifics and procedures, for implementation and ongoing operation/maintenance of infrastructure solutions.</li>\n<li>Provide technical support for enterprise systems. Troubleshoot, repair and recover from hardware or software failures in accordance with standard operating procedures.</li>\n<li>Install, configure, test and maintain systems, application software and infrastructure tools.</li>\n<li>Serve as a key team member using existing technical knowledge and have the skills to perform specific projects independently.</li>\n<li>Maintain the highest levels of systems and infrastructure availability.</li>\n<li>Interact with other engineers and management to identify areas of improvement for operational efficiency.</li>\n<li>Work closely with technical and non-technical personnel within and across PenFed departments and vendors.</li>\n<li>Accountable for managing all assigned tasks and projects.</li>\n<li>Participate in the planning and design of an enterprise Business Continuity Plan and Disaster Recovery Plan.</li>\n<li>Comply with Incident Management and Change Management procedures and reporting practices.</li>\n<li>Maintain up-to-date detailed knowledge of the IT industry as it relates to the technologies identified as primary responsibilities including awareness of new or revised solutions and improved processes.</li>\n<li>Develop and maintain up-to-date baselines for the secure configuration and operations of all in-place systems.</li>\n<li>Assist junior and subordinate staff in researching technical problems and complex designs in order to develop staff capabilities.</li>\n<li>Participate in on-call 24x7 support as needed in the event of system outage or failure. </li>\n</ul>\n<p> </p>\n<p><strong><u>Education and Experience</u></strong></p>\n<p><em>Equivalent combination of education and experience is considered.</em></p>\n<ul>\n<li>Bachelor’s Degree in related field is required. </li>\n<li>In lieu of a degree, combination of education and a minimum of ten (10) years of related work experience is required that provides the necessary skills and knowledge to perform all the essential job functions.</li>\n<li>Strong understanding of Network, Compute, Storage, Cloud and End-User technologies</li>\n<li>Strong understanding of System design and integration with a thorough familiarity with multi-tiered application architecture and public, private, and hybrid cloud technologies.</li>\n<li>Strong interpersonal, problem solving and multi-tasking skills desired.</li>\n<li>Must be able to present system designs for user approval at formal reviews.</li>\n<li>Strong problem solving and analytic skills.</li>\n<li>Strong communication, documentation, and time management skills.</li>\n</ul>\n<p> </p>\n<p><strong><u>Technical Requirements</u></strong></p>\n<ul>\n<li>System console commands particularly zOS &amp; JESx commands</li>\n<li>Working knowledge of TSO, ISPF, SDSF and JCL</li>\n<li>Analytical skills (identifying, analyzing, collecting diagnostic data, escalating, resolving, preparing and reporting performance related issues)</li>\n<li>Developing and customizing new and/or existing processes and procedures</li>\n<li>Installing and configuring CICS product and define and configure CICS regions</li>\n<li>Operating CICS; Defining resources to CICS; Using CICS monitoring tools</li>\n<li>Accounting &amp; Monitoring; Understand the different types of CICS traces; SIT parameters associated with tracing; CICS transaction dump formatting utility; CICS trace formatting utility</li>\n<li>Using CICS utility programs; Understanding of CICS Groups and Lists; Installing CICS resource definitions; Auto install of terminals &amp; programs; Using the Batch CSD update utility and associated options</li>\n<li>Designing &amp; writing CICS applications; Familiar with techniques to write application programs for performance and concurrency; Familiar with the API and SPI commands; Experience with using the integrated translator for CICS; Accessing CICS recoverable resources (VSAM, TSQ, etc.); Debugging programs using CEDF and CEDX; Experience with setting up the LE/370 environment and configuring LE parameters for performance</li>\n<li>CICS Security; Different kinds of Intercommunication Security; How to specify Transaction Security and how and when CICS implements security; Commonly used RACF Classes and profiles for CICS; Authorization IDs used in CICS-DB2 security and where specified; Using CICS-DB2 Interface; Different techniques to connect CICS to DB2</li>\n<li>Benefits of using protected threads and how they are specified; Know the various RDO definitions associated with CICS-DB2 resources; How accounting works in a CICS-DB2 environment; Know how to manually and automatically stop and start the DB2 adapter; How to purging CICS tasks using DB2 and the associated wait states</li>\n<li>Using CICS-MQ Adapter; Describe how to configure CICS for MQ; Understand the role of the MQ Listener CKTI; Know how to manually and automatically stop and start the MQ adapter</li>\n<li>Using TCP/IP Sockets Interface; Configuring CICS to support TCP/IP Sockets Interface; Creating a Listener definition; Understanding the various SOCKET API calls;</li>\n<li>CPSM; Understand CMAS, MAS and overall CPSM topology; Role of Data Repository; Defining CICS systems to CPSM; Defining the links between CICS systems; Workload Management in CPSM; CPSM Web User Interface</li>\n<li>Configuring WUI for high availability; Experience using CPSM WUI to administer CPSM objects</li>\n<li>CICS configurations for high availability and fail-over; When and how to use VTAM Generic Resources; Role of the Sysplex Distributor in CICS; Use and limitations of Port Sharing in CICS; Using CPSM WLM to distribute Workload;</li>\n<li>Installing and configuring CICS product; Know how to define CICS product to MVS operating system; Understand how to install the CICS SVCs; Know how to install MRO support in CICS</li>\n<li>CICS Web Support; Web Support architecture; Different techniques to connect to CICS from the Web; Configuring CICS for Web Support; Common commands for Web Support applications; Understanding how CICS handles HTTP requests</li>\n<li>CICS Logging; Explain the options for logging - CF versus DASD Only; Use of DFHLOG and DFHSHUNT; Understanding activity key point and logtail deletion</li>\n</ul>\n<p> </p>\n<p><strong><u>Supervisory Responsibility</u></strong></p>\n<p>This position will directly supervise employees.</p>\n<p> </p>\n<p><strong><u>Licenses and Certifications</u></strong></p>\n<p>There are no additional licenses and/or certifications required.</p>\n<p> </p>\n<p><strong><u>Work Environment</u></strong></p>\n<p>While performing the duties of this job, the employee is regularly exposed to an indoor office setting with moderate noise. </p>\n<p>*<em>Most roles require </em><em>working in an office setting with moderate noise and the ability to lift 25 pounds.*</em></p>\n<p> </p>\n<p><strong><u>Travel</u></strong></p>\n<p>Ability to travel to various worksites and be on-call is required. </p>\n<p> </p>\n<p> </p>\n<p><strong><u>About Us</u></strong></p>\n<p>Established in 1935, PenFed today is one of the country’s strongest and most stable financial institutions with over 1.6 million members and over $23 billion in assets. We serve members in all 50 states and the District of Columbia, as well as in Guam, Puerto Rico, Okinawa, and Portugal. We are federally insured by NCUA and we are an Equal Housing Lender. We are available to members worldwide, via the web, seven days a week, twenty-four hours a day.</p>\n<p>Our mission isn’t simply to help our members get by. We exist to help them realize every ounce of their potential. We exist to educate, and to encourage. We exist to usher their dreams into the land of reality.</p>\n<p>We provide our employees with a lucrative benefits package including robust medical, dental and vision plan options, plenty of paid time off, 401k with employer match, on-site fitness facilities at our larger locations, and more.</p>\n<p><strong><u>Equal Employment Opportunity</u></strong></p>\n<p>PenFed management will maintain and observe personnel policies which will not discriminate or permit harassment or retaliation against a person because of race, color, creed, age, sex, gender, gender identity, gender expression, religion, national origin, ancestry, marital status, military or veteran status or obligation, the presence of a physical and/or mental disability or medical condition, genetic information, sexual orientation, and all statuses protected by applicable state or local law in all recruiting, hiring, training, compensation, overtime, position classifications, work assignments, facilities, promotions, transfers, employee treatment, and in all other terms and conditions of employment. PenFed will also prohibit retaliation against individuals for raising a complaint of discrimination or harassment or participating in an investigation of same.</p>\n<p>PenFed will also reasonably accommodate qualified individuals with a disability so that they can apply for a job or perform the essential functions of a job unless doing so causes a direct threat to these individuals or others in the workplace and the threat cannot be eliminated by reasonable accommodation or if the accommodation creates an undue hardship to PenFed. Contact human resources (HR) with any questions or requests for accommodation at 571-289-4710.</p></div>"}