{"job title": "Control Systems Engineer", "company": "Rudolph Technologies", "city state": "– Wilmington, MA", "rating": "3.5", "job description": "Senior level Control Systems Software Engineer with hands-on experience integrating and debugging complex electromechanical systems. The Senior Systems Engineer will be a member of a highly skilled development team that focuses on meeting internal and external customer goals.\n<ul>\n<li>Develop software for tool platforms following LSG software engineering processes and practices</li><li>Analyze and quickly resolve issues reported by internal and external customers</li><li>Identify potential product improvements and recommend design modifications</li><li>Breakdown system requirements into software development activities and estimated effort</li><li>Design, build, and maintain efficient, reusable and robust code</li><li>Interact with external groups for instance manufacturing engineering and applications groups</li><li>Gain in-depth knowledge and understanding of inspection and metrology from systems perspective</li><li>Clearly present data, analysis and conclusions to peers and management</li><li>Write requirements, functional specifications, design verification &amp; integration test plans</li><li>Demonstrate effective interpersonal and communication skills within a diverse team</li><li>Provide clear and timely status updates as needed</li>\n</ul>\n<strong>Key Responsibilities/Accountabilities</strong>:\n<ul>\n<li>Technical leadership [10%]</li><li>Software requirement analysis and functional specifications [10%]</li><li>Software Project Management [5%]</li><li>Software/Systems Design [10]</li><li>Software Development (coding and unit testing) [50%]</li><li>System Integration Testing (verification) [10%]</li><li>Documentation (release notes) [5%]</li></ul>\n\n<ul>\n<li>BS/MS Electrical Engineering or BS/MS Computer Engineering</li><li>Ten (10) or more years of current development experience in the following areas:</li>\n\n<ul>\n<li>C, C++, Python</li><li>VxWorks, RTEMS, Linux</li><li>User Interface development using WxWidgets or similar environment</li><li>Threading (POSIX), TCP/IP, I/O Driver Development</li><li>GNU software development tool such as gcc, gmake, and gdb</li><li>User level Database/SQL skills. The ability to develop queries for data mining and problem investigation.</li><li>Ability to develop Linux scripts in languages such as bash and python</li>\n</ul>\n\n<li>Experience working in process-oriented and/or agile software development environments</li><li>Experience with ClearCase (user &amp; administrative-level) and other source-control/configuration management</li><li>Experience with motion control systems such as servos, stepper motors and piezo-electric devices.</li><li>Demonstrated experience leading projects and keeping to schedule</li><li>Customer-oriented, understands concerns from customer perspective</li><li>Effective listener and self-directed learner.</li><li>Goal-oriented, quality-focused, inspires others.</li><li>Strives to find simpler more efficient ways to accomplish tasks.</li><li>Values commitments. Holds themselves and others accountable.</li><li>Able to perform trade-off analysis between software/hardware sub-systems</li><li>SEMI conductor capital equipment expertise (desired)</li><li>Ability to travel occasionally to customer sites, including international</li>\n</ul>\nSorry, we are not currently accepting agency submissions for this position.\n<br><br>\nNo relocation assistance is provided for this position.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}