{"job title": "Sr. Engineer Quality", "company": "Salix Pharmaceuticals", "city state": "– US-NY-Rochester", "rating": "3.8", "job description": "Overview\n<p>Valeant Pharmaceuticals International, Inc. is a diverse pharmaceutical company that is committed to focusing on our key stakeholders while delivering consistently high performance. Our values provide the overall direction for our company, and provide us with the tools necessary to rise to any challenge by leveraging our collective hard work and effort along with our unwavering competitive spirit. These values help us set goals based on our organization’s potential and what we hope it will become.</p>\n<p> </p>\n<p>Quality Assurance Lead for Contact Lens manufacturing platform in the Rochester facility. </p>\n<p> </p>\n<p>This position will be responsible for supporting the quality system structure (DHR, process control plan, PFMEA, participate in design control activities, etc.) of the process and product in alignment with B+L directives and procedures.</p>\n<p> </p>\n<p>This position will be an integral part in leveraging the process and applicable design transfer activities to bring a new/modified product to market for B+L by creation/review of statistical sampling plans, managing root cause investigation teams, evaluate data using statistical tools, develop corrective action plans, lead close out of action plans, and communicate results to key stakeholders.</p>\n<p> </p>\n<p>This role will work on ensuring compliance with both internal and external requirements to drive future success of the business. The successful candidate is expected to improve the effectiveness and efficiency of the NC/CAPA process.</p>\n<p> </p>\n<p>Must possess excellent written and verbal communication skills, and be able to guide others to make sound Quality decisions. The Quality Engineer must be self-directed, and must show initiative in identifying and resolving opportunities for improvement, promoting Quality initiatives.</p>\n<p> </p>\n<p>This position has responsibility for Quality Technicians (2) and Quality Assurance Analsyt (1)</p>\nResponsibilities\n<p>Will be responsible for managing quality related problem solving and continuous improvement opportunities for Contact Lens Manufacturing facility in addition to:</p>\n<ul>\n <li>Manage NC/CAPA teams through identification and development of corrective action plans through closure</li>\n <li>Evaluate data using statistical tools</li>\n <li>Provide technical support to production in defining and resolving problems</li>\n <li>Ensure compliance to B+L global and plant quality system elements</li>\n <li>Participation in Risk Analysis activities</li>\n <li>Participation in audits</li>\n <li>Identifying opportunities for continuous improvement</li>\n <li>Ownership of process control plan and its implementation</li>\n <li>Provide guidance and approvals of applicable validations and change control documentation</li>\n <li>Other projects as required</li>\n</ul>\nQualifications\n<ul>\n <li>Bachelor’s Degree in Science or related field required. Master’s degree preferred</li>\n <li>Six Sigma Black or green belt certification preferred.</li>\n <li>Knowledge of ISO and FDA/QSR requirements and system development &amp; management in medical device industry.</li>\n <li>Computer experience with Microsoft Office and database type software a must.</li>\n <li>Demonstrated project management and leadership skills.</li>\n <li>Strong written, oral and interpersonal skills.</li>\n <li>Strong statistical analysis, knowledge of sampling plans and root cause investigative skills.</li>\n <li>Ability to work in a team environment.</li>\n <li>Ability to manage a varied workload and prioritize effectively.</li>\n <li>Show good capacity for attention to detail.</li>\n <li>Capacity for innovation and ability to work on own initiative.</li>\n <li>7 or more years Manufacturing experience with a minimum of 5 years in a regulated Quality Assurance environment required (medical device or pharmaceutical).</li>\n</ul>\nBe Aware of Recruiting Fraud \n<p>Job Applicants should be aware of job offer scams perpetrated through the use of the Internet and social media platforms.</p>\n<p> </p>\n<p>To learn more please read Valeant’s Job Offer Fraud Statement.</p>\n<p> </p>\n<p> </p>\n<p>Valeant Pharmaceuticals International, Inc. is committed to leveraging the talent of a diverse workforce to create great opportunities for our business and our people. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.</p>"}