{"job title": "Principal Engineer III – Wireless Research and Development", "company": "Spectrum", "city state": "– Centennial, Colorado", "rating": "3.0", "job description": "<strong>JOB TITLE: Principal Engineer III - Wireless Research and Development<br><br>Company Overview:</strong><br>Charter Communications is America’s fastest growing TV, internet and voice company. We’re committed to integrating the highest quality service with superior entertainment and communications products. Charter is at the intersection of technology and entertainment, facilitating essential communications that connect 24 million residential and business customers in 41 states. Our commitment to serving customers and exceeding their expectations is the bedrock of Charter’s business strategy and it’s the philosophy that guides our 90,000 employees.<br><br><strong>JOB SUMMARY:</strong><br>Responsible for leading development, selection and employment of Charter fixed and mobile wireless technology. Applies expert knowledge on existing and evolving wireless technologies, industry and market trends to define, evaluate and deploy a multi-year technology roadmap for Charter future out-of-home wireless products. Works independently, leading a team of wireless engineers team including direct reports as required.<br><br>The ideal candidate has extensive experience leading wireless technology development, testing and evaluation, a deep knowledge of wireless industry, and will drive a vision for how Charter can leverage wireless technology to extend our existing product and service offerings.<br><br><strong>MAJOR DUTIES AND RESPONSIBILITIES:</strong><br>Lead technology evaluation and selection for wireless products, identifying the right technology and vendor portfolio and managing the review, test and selection process.<br><br>Responsible for maintaining expertise in wireless technology trends and opportunities, evaluating their validity and making recommendations for inclusion in Charter’s out-of-home wireless program of record.<br><br>Defines technological solutions using out-of-home wireless technologies in support of product requirements.<br><br>Analyzes performance metrics of out-of-home wireless networks to recommend network improvements.<br><br>Manages capital budgets of related technology development initiatives.<br><br>Develops effective partnerships between the Wireless Technology Team, the supporting Network Operations and Product Management groups, and other supporting functional organizations (Engineering, Software Development, IT, Operations, 3rd Party suppliers, etc.) to properly design, assess and deliver to the project requirements.<br><br>Ensures alignment between business operational strategies and technical solutions.<br><br>Supports business development and strategic partnerships for out-of-home wireless networks, assessing potential partnerships and managing resulting relationships, working closely with business development.<br><br>Actively and consistently supports efforts to simplify and enhance the end-customer experience.<br><br>Works closely with in-home wireless and wireline network technology managers to ensure a seamless integration between all Charter network product initiatives.<br><br><strong>REQUIRED QUALIFICATIONS:</strong><br>Skills/Abilities and Knowledge<br>Ability to read, write, speak and understand English<br>Wireless technology and industry expert, in both existing and emerging mobile and fixed standards<br>Deep understanding of RF and IP engineering<br>Strong background and experience in wireless technologies – WiFi, fixed and mobile technologies<br>Ability to manage and foster change<br>Ability to lead large, cross-functional teams in order to achieve business goals and results<br>Ability to build, motivate and lead a team<br>Ability to listen to multiple points of view and synthesize against goals for recommendations<br>Ability to plan, prioritize and organize effectively and independently<br>Ability to handle multiple projects and tasks<br>Ability to make decisions and solve problems while working under pressure<br>Ability to show judgment and initiative and to accomplish job duties<br>Ability to analyze and interpret data and synthesize recommendations<br>Ability to communicate with all levels of management and company personnel<br>Ability to communicate orally and in writing in a clear and straightforward manner<br>Expertise in Word, Excel and PowerPoint<br>Excellent analytical skills<br>Strong organizational and office management skills<br>Strong business acumen and sense of urgency to achieve results<br><br><strong>Education:</strong><br>Bachelor’s degree in Engineering related technology field<br>Master’s degree in an applicable field preferred<br><br><strong>Related Work Experience Number Of Years</strong><br>RF Engineering design, deployment or operations 5-7<br>Related industry experience (Wireless, Telecommunications, Cable) 5-7<br>Management experience 5-7<br><br><strong>WORKING CONDITIONS:</strong><br>Office environment<br>Limited Travel"}