{"job title": "Senior Product Engineer", "company": "Tempur Sealy", "city state": "– Lexington, KY", "rating": "3.3", "job description": "The Product Engineer- Electro-Mechanical Products will effectively serve as Product Engineer and be a key member of the company's engineering team. As a member of the electro mechanical products team, this position will be responsible for providing engineering support to products in production as it relates to quality improvements, efficiency improvements and cost reductions. As owners of current products, the product engineering team manages engineering changes for any reason. Product engineering includes support to manufacturing on root cause analysis, process troubleshooting &amp; improvements and support to field service.\n<br><br>\nThis role partners with Development, Manufacturing, Sales, Service, Marketing, and Sourcing to address any technical issues impacting current products. The role is also responsible for the coordination of new product introductions to manufacturing, with significant involvement in development of manufacturing processes, test methods for new product features and qualification plans. The individual that works in this role can expect to work across functions.\n<br><br>\nEssential Duties, Responsibilities, and Key Results Area:\n<br><br>\nCurrent Product Support\n\n<ul>\n<li>Work encompasses one or more areas of engineering including electrical, mechanical, metal fabrication, test and/or other related fields; primarily as related to electro-mechanical bases and bedding products\n\n</li><li>Resolving technical issues found by customers, in the TSI Supply Chain and at suppliers. Take lead to determine root cause and drive to closure.\n\n</li><li>Manage Engineering Changes for assigned products (internally and with vendors)\n\n</li><li>Compile/analyze data and report on Warranty/Returns and Service for current products. Monthly updates on PE activities and Product Quality. Develop and drive actions to improve customer satisfaction and cost.\n\n</li><li>Apply statistical and other appropriate analytical methods to characterize product performance for improved fact-based decision making.\n\n</li><li>Communication with vendors on a regular basis\n\n</li><li>Participate with PPC team on cost reductions. Includes developing ideas, developing and executing project plans, performing test and evaluation, manufacturing feasibility, cost analysis\n</li></ul>\nNew Product Involvement\n\n<ul>\n<li>Member of cross-functional Core Team representing Product Engineering on NPD Projects. Representation of and communications with all Operations functions not directly on the Core Team\n\n</li><li>Responsible for working with development on manufacturability and assessing readiness of the product and process for start of production.\n\n</li><li>Updates to management prior to stage gate checkpoints\n\n</li><li>Responsible for tracking and approval of tooling, special test equipment, new processes. May develop test equipment and/or test methodologies. Provide information needed for Capital Approval process.\n\n</li><li>Communicate current product issues with NPD team for improvement of new products.\n</li></ul>\n<em>Other primary duties and responsibilities include the following; however, Management reserves the right to assign or reassign other appropriate duties to this job at any time. This document excludes the marginal functions of the position that are incidental to the performance of fundamental job duties.</em>\n<br><br>\nIdeal Candidate Possesses These Attributes:\n\n<ul>\n<li>Strong product and project management skills\n\n</li><li>Strong analytic and strategic problem-solving ability\n\n</li><li>Ability to multi-task and run multiple projects in a fast-paced work environment\n\n</li><li>Proficiency in statistical and data management/evaluation\n\n</li><li>Excellent communication skills, verbal and written\n\n</li><li>Flexible team player with strong relationship-building skills\n</li></ul>\nInternal and External Interfaces:\n<br><br>\n-Member of the Global PE organization\n\n<ul>\n<li>WW PE (US and Denmark)\n\n</li><li>New Product Development/Global Product Development\n\n</li><li>Manufacturing\n\n</li><li>Distribution\n\n</li><li>Marketing/Sales\n\n</li><li>Customer service\n\n</li><li>Sourcing\n</li></ul>\n-External Partners\n\n<ul>\n<li>Suppliers of electromechanical products, components and subassemblies\n\n</li><li>Other vendors as needed to resolve technical/quality issues\n</li></ul>"}