{"job title": "Sr. Software Engineer", "company": "Veritas", "city state": "– Roseville, MN", "rating": "2.9", "job description": "<p><b>Job Description:</b></p><p>Veritas' vision is to enable organizations to thrive in this new world of digital business.</p><p>Did you know that the International Data Corporation (IDC) predicts that data will double every 2 years, reaching 44 zetabytes by 2020? That's more bytes than gallons of water in the ocean and an exponentially growing problem for businesses. Veritas helps organizations harness the power of their data &amp; turn it into actionable insights.</p><p></p><p>We believe information is everything! Data is an organization's digital currency; a critical business asset that is growing in value. We are the only company that provides a data management platform to address the core challenge of accessing, managing, and analyzing all of their data, no matter where it is, in real time - allowing organizations to truly maximize the value of their data.</p><p></p><p>Veritas is currently looking for motivated individuals who not only “do” but are also leaders who influence change and make a difference. The team is always looking for passionate, dedicated individuals who are self-motivated in their work and careers. </p><p></p><p><b>What you will be doing:</b></p><ul><li>Lead definitions of Software Architecture and Platform Enablement using your extensive background in x86 Server platforms and Latest Enterprise Storage Technologies.</li><li>Your extensive background in storage, capability to understand firmware, Kernel and applications software will drive Proof of Concept (POC) of multiple World’s leading backup appliances that will shape the future of backup storage. You will get an opportunity to lead investigations of potential technological investment targets for the office of CTO.</li><li>You will work with System and Automation Test teams to drive HW diagnostics test development, Performance Testing and Optimization. You will work with OEM partners to tune/configure HW to best suit our application workloads</li><li>Contribute towards open source community by developing sample applications using Veritas Backup Platform APIs</li></ul><p></p><p><b>What skills, experience and education you need as a team member to succeed:</b></p><ul><li>You have a solid understanding of embedded systems or have an appetite to learn what’s inside the platform your code runs on</li><li>Experience with Linux based diagnostic code development on embedded platforms is highly desired</li><li>Experience in languages such as <b>C/C++, Python</b> is required</li><li>Experience with <b>RESTFUL APIs</b> is highly desired</li><li>MINIMUM MS in Computer Science/Computer Engineering or BS in Computer Science/Computer Engineering with 2 or more years of relevant experience.</li><li>Experience with Test Automation, unit/integration/performance testing</li></ul><p></p><p><b>Preferred skills:</b></p><ul><li>NoSQL Databases such as MongoDB</li><li>Virtualization</li><li>AGILE Development Practices</li></ul><p></p><p><b>Desired Skills include:</b></p><ul><li>Production level code Development for Server Storage Technologies such as RAID, SAS, etc.</li><li>Knowledge of Clustered, Distributed and Virtualized Storage</li><li>Minimum of 5+ years’ experience developing turn-key solutions is highly desired</li></ul><p></p>"}