{"job title": "Software Engineer - Web Applications", "company": "ZoomInfo", "city state": "– Waltham, MA", "rating": "4.3", "job description": "At ZoomInfo we encourage creativity, value innovation, demand teamwork, expect accountability and cherish results. If you are a take charge, take initiative, get stuff done individual we want to talk to you! We have high aspirations for the company and are looking for the right people to help fulfill the dream. We strive to continually improve every aspect of the company and use cutting edge technologies and processes to delight our customers and rapidly increase revenues.\n<br><br>\nThe mission of the Web Applications Team is to build attractive and easy-to-use tools which provide our clients with access to in-depth profiles on millions of business people and companies.\n<br><br>\nAs a <strong>Software Engineer</strong> on the Web Applications Team, you will get to explore and work with cutting-edge technologies and a tremendously large (and fantastically rich) data set. If you like working on tough problems, whether thats building systems that handle millions of customer requests per day or how to make sense of over a billion pieces of potentially correlated data, ZoomInfo could be the right place for you!\n<br><br>\n<strong>The Opportunity</strong>:\n\n<ul>\n<li>Write high-volume server applications (full stack)</li>\n\n<li>Experience with 3rd party intgrations</li>\n\n<li>Build slick and responsive Web UI tools that can handle millions of requests a day</li>\n\n<li>Work with cutting-edge technology like Hadoop, Solr, JBoss, Hibernate, Angular, HBase and Mongo</li>\n\n<li>Solve interesting and challenging problems alongside a great team of engineers</li>\n\n<li>Develop new skills as you push your knowledge, and our technology, to new levels</li>\n\n<li>Work for a profitable, growing company that works with an impressive Fortune 500 client list</li>\n</ul>\n\n<div><strong>The Requirements</strong>:\n\n<ul>\n<li>3-5 years industry experience, B.S. in Computer Science or equivalent</li>\n\n<li>Knowledge of Java or similar programming languages</li>\n\n<li>Knowledge of and experience using Angular, Node.js, HTML/CSS, JavaScript is a plus</li>\n\n<li>Experience with any of the following is a plus: J2EE, JMS, Hibernate, Spring</li>\n\n<li>Familiarity with Hadoop, Solr/Lucene is a plus</li>\n\n<li>Passionate about using technology to solve interesting challenges</li>\n\n<li>Excited to tell us why you want to work here and what kinds of challenges you're looking for</li>\n</ul>\n<strong>About ZoomInfo:</strong>\n<br><br>\nFor over a decade, ZoomInfo has helped companies achieve their most important objective: profitable growth. Backed by a database that contains over 225 million businesspeople and 9.3 million businesses, our Growth Acceleration Platform dynamically puts sales and marketing professionals in position to identify, connect, and engage with qualified prospects.\n<br><br>\nFor more information, go to www.zoominfo.com.\n<br><br>\n<em>All qualified applications will receive consideration for employment without regard to race, color, ethnicity, religion, gender, national origin, disability and protected veterans status or any other personal characteristic protected by law.</em></div>\n<br>"}