{"job title": "Senior Business Intelligence Analyst - Web Analytics", "company": "BNP Paribas", "city state": "– San Francisco, CA", "rating": "3.4", "job description": "What sets Bank of the West apart from other banks is our team membersthey embody the optimistic spirit of the West. There is a spirit here that drives us to do more. Our team of more than 10,000 employees is vital to the success of our Bank. They reflect our modern western valuesstraightforward, entrepreneurial and optimistic. We seek to create a corporate culture that fosters and rewards excellence, encourages creative thinking and respects diversity an environment where team members are engaged, supportive of one another and enthusiastic about serving our customers. Bank of the West offers the stability of a company that has a 135 year history and is part of BNP Paribas, a European leader in global banking and financial services and one of the 6 strongest banks in the world. We offer opportunities across our diverse business lines Retail Banking, Commercial Banking, National Finance, and Wealth Management.<br><br>Job Description Summary<br><br>Responsible for providing highly complex analytical and project oversight by conducting financial and website analyses, assisting with internal strategy and ad-hoc projects, and performing competitor and industry benchmarking analysis for a designated Business Line.<br><br>Essential Job Functions<br><br>* Create, test and analyze A/B testing activities in Adobe Target.<br><br>* Analyze web analytics and digital reports to derive business insights.<br><br>* Manages data gathering efforts with internal and external business partners.<br><br>* Participates in the management of complex projects.<br><br>* Interprets complex analysis and develops presentations for senior management.<br><br>* Partners with members of other groups and functions within the bank to drive results.<br><br>Other Job Duties<br><br>* Performs other duties as assigned.<br><br>Required Experience<br><br>* Requires deep knowledge of job area typically obtained through advanced education combined with experience.<br><br>* Typically viewed as a specialist within the discipline of A/B testing and web analytics.<br><br>* May have broad knowledge of project management.<br><br>* Requires 7 years minimum prior relevant experience.<br><br>* At least 3 years' relevant experience:<br><br>1. Experience with A/B testing using Adobe Target or other tools.<br><br>2. Experience using Adobe Analytics (preferred) or Google Analytics to create and interpreting reports.<br><br>3. Experience with documenting web analytics requirements and testing plans<br><br>4. Able to understand what the data is saying and communicate insights to nontechnical business partners<br><br>* Nice-to-Have experience:<br><br>1. Digital marketing experience<br><br>2. Experience with using data to identify business insights<br><br>3. Experience creating systems development lifecycle deliverables (such as business requirements documents, user acceptance test plans and scripts)<br><br>4. Basic-to-mid level SQL skills (preferably Oracle)<br><br>Education<br><br>* Bachelor's Degree Economics, Math, Accounting, or applicable field<br><br>Skills<br><br>* Strong data collection, research and quantitative skills<br><br>* Knowledge of the banking and financial services industries<br><br>* Ability to summarize complex information into simple to understand information<br><br>* Ability to develop relationships with multiple stakeholders throughout an organization<br><br>* Exceptional MS Excel, PowerPoint and Word skills; experience with other data analysis tools a plus<br><br>* Ability to self-motivate and a desire to work independently in a relatively unstructured environment.<br><br>* Strong written and verbal communication skills. Will be responsible for discerning client's explicit and implicit needs. Will be responsible for writing standard systems development lifecycle business deliverables.<br><br>* Problem solving skills. Examples: Must be able to understand a business problem from the client's perspective and propose potential solutions. The ability to visualize how existing technology solutions could be changed / leveraged to meet future needs would be a plus.<br><br>* Attention to detail, as well as the ability to see the \"big picture\"<br><br>* Organized<br><br>* Flexibility/ Adaptability<br><br>Equal Employment Opportunity Policy<br><br>Bank of the West is an Equal Opportunity employer and proud to provide equal employment opportunity to all job seekers without regard to any status protected by applicable law. Bank of the West is also an Affirmative Action employer - Minority / Female / Disabled / Veteran.<br><br>Bank of the West will consider for employment qualified applicants with criminal histories pursuant to the San Francisco Fair Chance Ordinance subject to the requirements of all state and federal laws and regulations.<br><br>Postuler<br><br>Partager cette offre !<br><br>* Facebook<br><br>A partager avec vos amis<br><br>* Twitter<br><br>Tweeter cette page<br><br>* LinkedIn<br><br>Partagez cette page avec votre réseau<br><br>* Messenger<br><br>Share this page on Messenger<br><br>* WhatsApp<br><br>Share this page on WhatsApp<br><br>* Scoop It<br><br>Partagez votre veille d'informations avec Scoopit<br><br>* Weibo<br><br>Partagez cette page sur le 1er réseau social chinois<br><br>* Buffer<br><br>Pas le temps? Lisez et partagez cette page plus tard avec Buffer<br><br>* Pocket<br><br>L'appli pratique pour lire cette page tout moment, même en offline !<br><br>Voir plus de réseaux sociaux<br><br>Outils<br><br>* Envoyez cette page par mail<br><br>Envoyez cette page par mail<br><br>* Imprimer cette page<br><br>Etes vous sûr de vouloir imprimer ?<br><br>Offre précédente<br><br>Universal Banker I (Teller&amp;New Accounts) - 40 hours, Fergus Falls<br><br>Offre suivante<br><br>Service Banker - Tehachapi<br><br>Ces autres offres vous intéressent-elles ?<br><br>* Full-time Sr Business Intelligence Analyst<br><br>United States-California-San Francisco<br><br>* Full-time Sr Quantitative Analyst - Modeling<br><br>United States-Arizona-Tempe<br><br>* Full-time Senior Social Media Analyst<br><br>United States-California-San Francisco"}