{"job title": "Specialist Process Improvement Analyst - IT Data Analyst", "company": "BNY Mellon", "city state": "– Jersey City, New Jersey", "rating": "3.2", "job description": "TECHNOLOGY SERVICES GROUP (TSG) is the central infrastructure services group\n<br>\nwith a proven track record of innovating to help BNY Mellon and its customers\n<br>\nhave most reliable, nimble and cost-effective solutions in the financial services\n<br>\nmarket place. BNY Mellon App Engine technology is leading edge with industry\n<br>\nfirst PasS/IaaS fully integrated solution, combined with enterprise standards\n<br>\nfor developers.\n<br><br>\n<strong>'</strong>\n<br><br>\n<strong>TSG</strong>\n<br>\nis building next generation scalable, efficient data center as a service using\n<br>\nthe latest innovation infrastructure. Building on top of the cloud deployments\n<br>\nin BNY Mellon, we are aggressively automating and bridging the green field\n<br>\ncloud with the existing virtual computing environments.\n<br><br>\n<strong>'</strong>\n<br><br>\nThe Hardware Asset Management team is\n<br>\nresponsible for the tools and processes that support tracking the firm's IT\n<br>\nfleet globally. We work collaboratively within the team and with stakeholders\n<br>\nand clients to manage and maintain the tools and data, identifying changes and\n<br>\nenhancements to improve our processes with the goal to maintain the highest\n<br>\npossible accuracy in our data. We interact with staff across the globe, we\n<br>\ninteract with multiple vendors for product support and provide a variety of\n<br>\ndata, process and application analysis.\n<br><br>\n<strong>'</strong>\n<br><br>\n<strong>Key responsibilities include:</strong>\n<br><br>\nCreate and maintain data queries\n<br>\nacross multiple DBMS system types, understanding and documenting data models as\n<br>\nneeded.\n<br>\nAnalyzing data from a variety of internal sources,\n<br>\ncommunicate results succinctly and drive resolution of discrepancies.\n<br>\nEstablishing and adjusting data cleansing rules to\n<br>\nreduce error rates and increase data accuracy.\n<br>\nDesigning, developing and maintaining enterprise\n<br>\nlevel data analysis and reporting solutions.\n<br>\nDocumenting business and technical requirements,\n<br>\ncapturing process flows and outlining application procedures.\n<br>\nInteracting with system users on issues and\n<br>\nenhancements and troubleshooting failures to resolution.\n<br>\nProviding basic application\n<br>\nconfiguration and operational support to internal clients.\n<br>\nDeveloping insights on proposed changes\n<br>\nand improvements to better manage inventory.\n<br><br>\n<strong>'</strong>\n<br><br>\nSpecialist Process Improvement\n<br>\nAnalyst-&gt;&gt; Leads a wide array of activities supporting the improvement of\n<br>\nprocesses and procedures. May allocate/coordinate work within a team/project.\n<br>\nProvides project/process management consulting, coaching, and training to IT\n<br>\nteams and/or Project/Process Office staff across one or more LOBs. Provides\n<br>\ninput on approaches/tools to build, streamline, implement, and/or automate key\n<br>\nprocesses. Promotes the company's project management methodology, tools and\n<br>\ntechniques. Develops and may manage IT processes and work flows which maximize\n<br>\nefficiency, and comply with regulatory and audit requirements. Helps assess\n<br>\ngaps in the processes used within one or more LOBs. Participates in formal\n<br>\nassessments and checkpoints for one or more LOBs. May develop and manage the\n<br>\nproject plans to support process improvement or IT projects at the LOB level.\n<br>\nEnsures adherence to quality standards and reviews project deliverables. Builds\n<br>\neffective working relationships with peers and clients. Manages client\n<br>\npartnerships to ensure that service expectations are developed and met.\n<br>\nContributes to the achievement of related teams' objectives.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nBachelor's degree in a related\n<br>\ndiscipline or equivalent education and work experience is required.'\n<br>\nThree to Five (3-5) years of\n<br>\nexperience in systems and data management is preferred.\n<br>\nExperience in the securities or\n<br>\nfinancial services industry is a plus.\n<br>\nStrong\n<br>\nbackground in relational data concepts, with an emphasis on the use of analytic\n<br>\nand reporting tools.\n<br>\nCritical\n<br>\nthinking and analytical skills to solve problems and effectively communicate\n<br>\nsolutions.\n<br>\nProgramming\n<br>\nexperience and expertise across a number of languages and frameworks.\n<br>\nA willingness to learn new\n<br>\ntechnologies in a team environment is required.\n<br><br>\nFor over 230 years, the people of BNY Mellon have been at the forefront of finance, expanding the financial markets while supporting investors throughout the investment lifecycle. BNY Mellon can act as a single point of contact for clients looking to create, trade, hold, manage, service, distribute or restructure investments &amp; safeguards nearly one-fifth of the world's financial assets. BNY Mellon remains one of the safest, most trusted and admired companies. Every day our employees make their mark by helping clients better manage and service their financial assets around the world. Whether providing financial services for institutions, corporations or individual investors, clients count on the people of BNY Mellon across time zones and in 35 countries and more than 100 markets. It's the collective ambition, innovative thinking and exceptionally focused client service paired with a commitment to doing what is right that continues to set us apart. Make your mark: **********************\n<br><br>\nClient Technology Solutions provides our business partners with client-focused, technology-based solutions. These enhance their ability to be successful through world-class software solutions and leading-edge infrastructure. Client Technology Solutions provides employees with the tools and resources to enhance their professional qualifications and careers.\n<br><br>\nBNY Mellon is an Equal Employment Opportunity/Affirmative Action Employer.\n<br>\nMinorities/Females/Individuals With Disabilities/Protected Veterans.\n<br><br>\nPrimary Location: United States-Pennsylvania-Pittsburgh\n<br>\nInternal Jobcode: 45147\n<br>\nJob: Information Technology\n<br>\nOrganization: Office of the CIO-HR06033\n<br>\nRequisition Number: *******\n<br>\n, city : Pittsburgh , state : Pennsylvania , country : United States , country_code : US , location_type : LAT_LNG , latitude :40.44062, longitude :-79.99589, additional_locations :[{ city : Jersey City , state : New Jersey , country : United States , country_code : US , latitude :40.72816, longitude :-74.07764}], categories :[{ name : Information Technology }], brand : Experienced , experience_levels :[ Experienced ], apply_url : ******************************************************************* , applyable :true, li_easy_applyable :true, ats_code : bnymellon-prod-taleo , meta_data :{ flow_config_name : external , ats_job_hash : 772fedc42274b1cda8570e*********dc6d3713c64883d5b77ad7dc0aff1f700 , career_sections :[ 6 ], questionservice :{ id : ******* }, creation_date : 2018-06-06T14:17:14-04:00 , canonical_url : ************************************************** , taleo_language : en , tags :[], gdpr :false, last_mod : 2018-08-31T10:03:32+0000 , elasticsearch :{ es_version_current :165}, import_source : taleo-api-importer , gateway : taleo-external , question_sets :[{ name : taleo-external , ordinal :1},{ name : *******_js_questions_en-us , ordinal :2},{ name : work_eligibility , ordinal :3},{ name : eeo , ordinal :4},{ name : ofccp , ordinal :5},{ name : esignature , ordinal :6}]}, update_date : 2018-08-31T10:03:32+0000"}