{"job title": "Senior Data Engineer", "company": "CBS Corporation", "city state": "– San Francisco, California", "rating": "3.5", "job description": "<strong> DESCRIPTION:</strong><br><br>The Data technology team is an agile and dynamic group who is passionate about developing reliable data platform to facilitate internal groups to process data more efficiently. Our team collaborates across number of business units to design and implement reusable frameworks for different data teams. We use Google Cloud Platform to process large volumes of data from multiple vendors enabling our BI, Yield, Finance and marketings teams to focus on data-driven insights.\n<br><br>\nRole Details:\n<br><br>\nYoull be an integral part of the Data Technology team, working on designing and building new infrastructure frameworks and automation workflows for data acquisition and processing data in Google Cloud Platform. You will be collaboration with both internal and external teams to finalize the requirements, design and development along with mentoring the co-workers. The ideal candidate will be very familiar with the current state of data engineering technologies in modern Cloud environments.\n<br><br>\nYour Day-to-Day:\n\n<li>Collaborate with other Engineers to design and develop new data infrastructure frameworks and automation processes in Google Cloud Platform</li>\n  \n<li>Resolve issues with both on-premise and cloud environments and optimize performance</li>\n  \n<li>Developing and Documenting the processes to be used by other groups</li>\n  \n<li>Develop data pipelines required for any new customer projects</li>\n  \n<li>Mentor co-workers on Python</li>\nKey Projects:\n\n<li>Automate deployment processes for data management teams</li>\n  \n<li>Design and develop data acquisition templates in Apache Nifi</li>\n  \n<li>Design and develop data processing frameworks in Google Dataflow</li>\n<strong> QUALIFICATIONS:</strong>\n<br><br>\nWhat you bring to the team:\n\n<li>Proficient in Python</li>\n  \n<li>Experience with Google Cloud Platform and/or AWS</li>\n  \n<li>Experience in designing and delivering modern applications and services with DevOps model</li>\n  \n<li>Experience with any \"infrastructure as code\" systems such as Terraform</li>\n  \n<li>Experience in deploying applications using Docker containers</li>\n  \n<li>Experience working with Linux servers and troubleshooting</li>\n  \n<li>Bachelor's Degree in Computer Science or Equivalent</li>\nYou may also have:\n\n<li>Experience in Kubernetes and Jenkins is a plus</li>\n  \n<li>Experience in Google Dataflow/Apache Beam is a plus</li>\n  \n<li>Experience in Apache NiFi is a plus</li>\n<strong> EEO STATEMENT:</strong>\n<br><br>\nEqual Opportunity Employer Minorities/Women/Veterans/Disabled"}