{"job title": "Connected Vehicle Data Analyst", "company": "Chrysler", "city state": "– Auburn Hills, MI", "rating": "5.0", "job description": "<div><div><div><div>Qualifications</div></div><br>\n\n<div>\n<div>\n<div>FCA’s Connected Vehicle Operations team is looking for an enthusiastic and capable Data Analyst who will be responsible for generating, analyzing, refining and presenting connected vehicle data that is critical to building better products as well as improved customer experience. FCA’s connected vehicle team is growing rapidly and provides challenges and opportunities to make a difference. If this is something you are looking for then look no more.\n<br><br>\nMain Responsibilities include:\n\n<ul>\n<li>Lead connected vehicle data analysis by writing SQL queries to pull data from several FCA internal databases, analyze and refine data to generate and present meaningful reports</li>\n<li>Support new product launches, Firmware-Over-The-Air (FOTA) campaigns, volume forecasts, factory VIN feed process and several other ad-hoc data analysis requests.</li>\n<li>Support Connected Vehicle Operations support teams on all data needs to resolve customer issues</li>\n<li>Coordinate and Collaborate with internal as well as external IT and engineering teams to monitor and, analyze back-end information flow on key connected vehicle processes</li>\n<li>Work actively with product planning and marketing teams to generate data that is essential to launching features as well as customer communication</li>\n</ul>\n\n</div>\n</div>\n</div><br>\n\n<div>\n<div>\n<div><strong>Basic Qualifications:</strong>\n\n<ul>\n<li>Bachelor of Science degree in Computer Science, IT, Engineering, or other related technical subject</li>\n<li>Minimum of 5 years of overall experience</li>\n<li>Minimum of 2 years of experience in OEM Telematics/Connected Services/Architecture</li>\n<li>Expert in the database communication language, SQL</li>\n<li>Experience working with DB Visualizer and MS Access</li>\n<li>Excellent working knowledge in MS-Office Suite especially Excel (Pivot tables, V-Lookup etc), Access and Power Point</li>\n<li>Excellent analytical, organizational, multi-tasking and time management skills</li>\n</ul>\n<strong>Preferred Qualifications:</strong>\n\n<ul>\n<li>Working knowledge/experience in other programming languages (Java) to automate reports</li>\n<li>Experience working with Qlik Sense or Eclipse for Java</li>\n<li>Working knowledge of FCA’s tools and processes</li>\n</ul>\n\n</div>\n</div>\n</div>\n</div>\n</div><br>\n\n<div>Our benefits reflects the FCA commitment to helping you reach your personal and professional goals. In addition to an environment that promotes career development, we offer benefits for a healthy lifestyle and a rewarding future, designed to take care of you and your family, in various stages of life.\n<br><br>\nAs a global company, our employee packages will vary by country, customary norms and the legal entity into which you are hired.\n<br><br>\nApply</div>\n\n<br>"}