{"job title": "Compliance Data Analyst - reporting", "company": "Compass Group USA Inc", "city state": "– Charlotte, NC", "rating": "3.5", "job description": "A family of companies and experiences\n<br><br>\nAs the leading foodservice and support services company, Compass Group USA is known for our great people, great service and our great results. If you've been hungry and away from home, chances are you've tasted Compass Group's delicious food and experienced our outstanding service. Our 200,000 associates work in award-winning restaurants, corporate cafes, hospitals, schools, arenas, museums, and more in all 50 states.\n<br><br>\nOur reach is constantly expanding to shape the industry and create new opportunities for innovation. Join the Compass family today!\n<br><br>\ngreat people. great services. great results.\n<br><br>\nEach and every individual plays a key role in the growth and legacy of our company. We know the next big idea can come from anyone. We encourage developing and attracting expertise that differentiates us as a company as we continue to raise the bar.\n<br><br>\nWho is Foodbuy?\n<br><br>\nWe are the industry leader in procurement and supply chain solutions. We are the subsidiary to the 6th largest company in the world (Compass Group PLC), yet Foodbuy's CEO knows all associates by their name. We pride ourselves on our ability to source and provide a variety of products and services that help our customers more easily, and cost effectively, run their businesses. We work with clients in the Hospitality, Restaurant, Healthcare, Education and Entertainment industries, and of course we support Compass Group-- which is the world's largest contract food and support services provider.\n<br><br>\nWhy Foodbuy?\n<br><br>\nWe care about our associates, our clients, and our community. We think big, encourage innovation and debate, and seek out game changers. Our benefits and PTO offerings are strong. Our compensation packages are competitive. And we are constantly growing, and we want our associates' careers to grow along with us. We have an open and modern work environment, believe in flexibility, and promote a collaborative open door environment.\n<br><br>\nAdditionally, we follow a value system called FORT, which stands for Flexibility, Optimistic, Resourceful, and Transparent. FORT is the foundation for everything we do at Foodbuy. It is how we behave and interact with our clients, business partners and fellow associates.\n<br><br>\nJob Summary\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nFoodbuy has implemented a Managed Order Guide (MOG) system to ensure that Foodbuy committed customer and Compass Group sector purchases are fully aligned with Foodbuy contracted programs. The Compliance Data Analyst position is responsible for the operational integrity and profitability of MOGs via reporting. The position is located in our office in Charlotte, NC.\n\n\n<ul>\n<li>Execute and Analyze large data sets for various projects including Conversions, Courtesy shipments, My Orders reporting, OFF MOG reporting, Proprietary, Void Fill, etc</li>\n<li>Collaborate with stakeholders, category development team, sourcing team, BAR, distribution partners and DC MOG management team on various projects and reports</li>\n<li>Timely and Accurate implementation of daily, weekly and monthly reporting for Compliance Team</li>\n<li>Use multiple software programs for reporting needs.</li>\n<li>Support Sr Purchasing Specialists on adhoc projects and tasks</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>1-3 years foodservice industry experience desired</li>\n<li>Bachelor's degree or culinary degree preferred; related experience will be considered in lieu of formal education</li>\n<li>Working Knowledge of Microsoft programs (Excel, Access, Word, Outlook, Internet Explorer) required</li>\n<li>Strong Excel required and Basic Access preferred</li>\n<li>Large Data Set Analysis preferred</li>\n<li>Knowledge of Ceres or other rebate and contract management technology preferred</li>\n<li>Excellent communication and customer relationship skills</li>\n<li>Experience meeting stated timelines and deadlines</li>\n<li>Collaborative works well as a member of a team</li>\n<li>Self starter and work independently</li>\n<li>Consistently displays strong integrity and ethics</li>\n</ul>\n\nApply to Foodbuy today!\n<br><br>\nFoodbuy is a member of Compass Group USA\n<br><br>\nClick here to Learn More about the Compass Story\n<br><br>\nCompass Group is an equal opportunity employer. At Compass, we are committed to treating all Applican"}