{"job title": "Business Intelligence Analyst IV", "company": "CyberCoders", "city state": "– Fresno, CA", "rating": "3.8", "job description": "Business Intelligence Analyst IV <div>\nIf you are a Business Intelligence Analyst with experience and are able to relocate to Bakersfield, please read on! We're looking for an experienced BI Analyst with healthcare experience. You'll be responsible for the design and maintenance of dashboards to determine KPIs to aid with reporting and analysis. Applications are reviewed and processed quickly - please apply today if you are interested.\n\n\n<ul>\n<li>-Application will be considered incomplete unless screening questions are answered; incomplete applications cannot be submitted for further review. Please answer all screening questions in detail in order to expedite the process.--</li></ul></div>\n\n\nWhat You Will Be Doing<div>\n\n\n<ul>\n<li>Determine KPI's based on requirements of the executive leadership</li>\n<li>Create actionable reporting to deliver data products in report</li>\n<li>Agile Project Managment</li>\n<li>Mentor users and lower-level BI Analysts</li>\n<li>Educate users to access data</li>\n<li>Identify specific needs for BI reporting and data analysis</li>\n<li>Design and build dashboards and data warehouse</li></ul></div>\n\n\nWhat You Need for this Position<div>\nMore Than 5 Years of experience and the following:\n\n\n<ul>\n<li>Bachelor in Computer Science or similar area of study</li>\n<li>SQL understanding</li>\n<li>Relational Database Management Systems</li>\n<li>Operational Data Store / Data Warehouse</li>\n<li>SSRS and SSIS</li>\n<li>RDLC</li></ul></div>\n\n\nWhat's In It for You<div>\n\n\n<ul>\n<li>Vacation/PTO</li>\n<li>Great Benefits for Health/Dental/Vision</li>\n<li>Relocation assistance</li>\n<li>Retirement Savings / 401k</li></ul></div>\n\n\n<div>\nSo, if you are a Business Intelligence Analyst with experience, please apply today!</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}