{"job title": "36th EWS Mission Data Engineer I", "company": "DCS CORPORATION", "city state": "– Niceville, FL", "rating": "3.6", "job description": "The Electronic Warfare Mission Data Engineer will apply a variety of analytical techniques to formulate and solve problems; plan for future technologies; conduct research and development; and define requirements for systems.\n<br><br>\n<strong>Essential Job Functions:</strong>\n<br><br>\nSupport EW system improvements and follow-on enhancements to aircraft countermeasures components and the development of Mission Data for Combat Air Forces aircraft Electronic Warfare (EW) and defensive systems, including radar warning receivers, ECM jammers, and ECM dispenser systems.\n<br><br>\nPrepare final reports and end-of-test briefings. Present final reports to review boards and results briefings to higher HQ.\n<br><br>\nSupport working groups, technical reviews, and other group activities, such as TPWGs, PMRs, PDRs, and CDRs.\n<br><br>\nAttend program meetings andmake recommendations on technical and functional process matters and decisions.\n<br><br>\nPrepare and present technical status briefings documenting progress, accomplishments, and problem areas affecting defined task areas.\n<br><br>\nRecommend COIs and program objectives; develop proposed designs, methods, and scenarios; recommend M&amp;S requirements; and propose program schedules.\n<br><br>\nDevelop Project Management directives, operational requirement documents, and other program documents.\n<br><br>\nDevelop and update threat databases using EWIR tools.\n<br><br>\nPlan, conduct, and report Performance Characterization Assessments.\n<br><br>\nDesign and use computer-based tools to flag and extract threat system parametrics for analyses.\n<br><br>\nGenerate optimized EW MD software files.\n<br><br>\nDevelop and use software simulations and EW laboratory facilities to verify and validate MD prior to fielding.\n<br><br>\nPerform rapid reprogramming of fielded MD in response to adversary threat changes.\n<br><br>\nDevelop Critical Operational Issues, Measures of Effectiveness, Measures of Performance, and mission scenarios.\n<br><br>\nDevelop MD, instrumentation and data management and analysis plans.\n<br><br>\nCoordinate with higher HQ and participating organizations to schedule MDO resources and activities.\n<br><br>\nConduct briefings and debriefings.\n<br><br>\nDesign MDO configurations.\n<br><br>\nRequirementsDue to the sensitivity of customer related requirements, U.S. Citizenship is required.\n<br><br>\nA Bachelors degree is required.\n<br><br>\nMust be able to obtain and maintain a Secret Security clearance.\n<br><br>\nElectronic Warfare Systems experience.\n<br><br>\nElectronic Warfare Mission Data software production/modification.\n<br><br>\nElectronic Warfare systems operational employment knowledge.\n<br><br>\nStrong writing and communications skills.\n<br><br>\n<strong>Desired Skills:</strong>\n<br><br>\nElectronic Warfare.\n<br><br>\nExperience in Airborne Electronic Combat (EC), using Electronic Intelligence (ELINT), developing operationally suitable mission data for to support EC sys"}