{"job title": "Data Analyst - Entry Level", "company": "DNV GL", "city state": "– Seattle, WA", "rating": "3.2", "job description": "Local Unit&amp;Position Description\n<br><br>\nDNV GL Energy group is seeking a Data Analyst to join the Data&amp;Met Mast Services Section of the Measurements Department in the Energy Advisory Division of DNV GL - Energy's North American regional organization as a Data Analyst reporting to a Head of Section and working alongside several other Data Analysts located in several offices in North America. The Energy Advisory Division is part of a global organization providing independent and unbiased expert advice to a wide variety of participants in the electric power industry, including governments, utilities, grid operators, suppliers of wind turbines and related equipment, and developers and financiers of individual projects.\n<br><br>\nThe Data&amp;Met Mast Services Section works with its clients to manage their ongoing field measurements, analyzing the data arriving on a regular and frequent basis, highlighting and reporting any issues arising with the data and measurement equipment in order that repairs can be carried out promptly, and compiling summary reports of the measurements and related issues. \"Clean\" datasets ready for more detailed analysis along with detailed histories of the specific measurement installation are prepared as a result of this work, with erroneous measurement data identified and excluded. Both wind and solar resource measurements are currently analyzed, and this may expand in future. A wide variety of measurement equipment is encountered, including offshore and remote sensing (Lidar, Sodar) devices as well as conventional land-based measurement masts.\n<br><br>\nThis position is based out of our Seattle, WA office.\n<br><br>\nTasks May Include\n\n\n<ul>\n<li>Monitor data transmission and proper operation of sensors on meteorological (met) masts and remote sensing units (RS) used for preliminary wind energy studies around the world</li>\n<li>Validate met mast and other data, and prepare periodic summary reports for use by clients and other groups in the company using internal tools, MS Excel, MS Access, etc.</li>\n<li>Interpret and fulfill client data requests as needed</li>\n<li>Monitor client facing platforms to find and solve problems proactively</li>\n<li>Provide timely communications to clients and team members regarding problems with equipment and for routine reporting</li>\n<li>Interact professionally with clients through email, phone and in person</li>\n<li>Develop relationships with clients and understand their needs and goals in order to better serve them</li>\n<li>Share and continuously develop knowledge and best practices</li>\n<li>Constantly and clearly document procedural changes and relevant client notes</li>\n<li>Support program development by both innovation and implementation</li>\n<li>Help with other tasks as assigned</li>\n</ul>\n\nPosition Qualifications\n<br><br>\nPosition Qualifications\n<br><br>\nAttach cover letter along with resume - required\n\n\n<ul>\n<li>4 year degree in a technical discipline</li>\n<li>Minimum 1 year of data analysis experience and comfort with math&amp;quantitative analysis</li>\n<li>Demonstrated ability to work accurately with large quantities of data</li>\n<li>Proficient with Excel, as well as Microsoft Office suite in general</li>\n<li>In particular, knowledge and experience with Microsoft Excel, particularly equation writing and interpreting skills, including macros and pivot table</li>\n<li>Self-motivated, quick learner with exceptional attention to detail and problem-solving aptitude</li>\n<li>Strong, confident and appropriate verbal and written communications and relationship-building skills</li>\n<li>Able to work independently and in teams with diverse people both clients and co-workers, domestically and internationally;</li>\n<li>Ability to provide a regular and relatively standard service to clients over an extended period</li>\n<li>Well-organized and reliable</li>\n<li>Ability to perform desk-based office work for most or all of the working day with appropriate ergonomic adjustments as required.</li>\n<li>Strong written and verbal English communication skills</li>\n<li>We conduct pre-employment drug and background screening</li>\n</ul>\n\nPreferred Skills (Not Required)\n\n\n<ul>\n<li>Strong interest in renewable energy</li>\n<li>Knowledge of Access, SQL Server or similar relational database</li>\n<li>Programming skills are advantageous, particularly in VBA/C#/Matlab</li>\n<li>Ability to multi-task and be accountable for assigned tasks and projects</li>\n<li>Systematic, meticulous, and creative troubleshooting skills</li>\n<li>Curiosity, flexibility and adaptability as issues and tasks may change quickly, able to identify, document, and learn from mistakes;</li>\n<li>Strong independent judgment skills</li>\n<li>Ability to manage own time and provide accurate time estimates for assigned tasks</li>\n</ul>\n\nImmigration-related employment benefits, for example visa sponsorship, are not available for this position\n<br><br>\nOpportunities Beyond Business\n<br><br>\nOur mission is to safeguard life, property and the environment. By joining us, you will work towards our meaningful vision: to make a global impact for a safe and sustainable future. DNV GL offers a congenial working environment, competitive salaries, and an exceptional benefits package.\n<br><br>\nDNV GL is an Equal Opportunity Employer and gives consideration for employment to qualified applicants without regard to race, color, religion, age, sex, national origin, disability or protected veteran status. For more information about your rights under the law, see: http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf\n<br><br>\nLocal employment conditions apply.\n<br><br>\nPlease visit our website at www.dnvgl.com\n<br><br>\nCompany&amp;Business Area Description\n<br><br>\nDNV GL is a global quality assurance and risk management company. Driven by our purpose of safeguarding life, property and the environment, we enable our customers to advance the safety and sustainability of their business. We provide classification, technical assurance, software and independent expert advisory services to the maritime, oil&amp;gas, power and renewables industries. We also provide certification, supply chain and data management services to customers across a wide range of industries.\n<br><br>\nCombining technical, digital and operational expertise, risk methodology and in-depth industry knowledge, we empower our customers' decisions and actions with trust and confidence. We continuously invest in research and collaborative innovation to provide customers and society with operational and technological foresight. With origins stretching back to 1864 and operations in more than 100 countries, our experts are dedicated to helping customers make the world safer, smarter and greener.\n<br><br>\nDNV GL delivers world-renowned testing and advisory services to the energy value chain including renewables and energy efficiency. Our expertise spans onshore and offshore wind power, solar, conventional generation, transmission and distribution, smart grids, and sustainable energy use, as well as energy markets and regulations. Our experts support customers around the globe in delivering a safe, reliable, efficient, and sustainable energy supply."}