{"job title": "Data Analyst Manager II", "company": "IDEXX Laboratories, Inc.", "city state": "– Westbrook, ME", "rating": "3.4", "job description": "As a Data Analyst Manager, you will manage activities of a group of data analysts who provide report automation and analytical support for ongoing performance monitoring as well as multiple initiatives, projects and programs. Manages staff, assigning work and evaluating results. Leads development of budget, operating policies and procedures. Contributes to development of overall department strategy and direction.\n<br><br>\n<strong>What you will be doing:</strong>\n\n\n<ul>\n<li>Managing activities of a group of data analysts who provide report automation and analytical support for ongoing performance monitoring as well as multiple initiatives, projects and programs.</li>\n<li>Managing staff, assigning work, monitoring activities and evaluating performance. Manages escalated/critical issues. Administers employment actions, provides coaching and guidance to staff and promotes staff training and development. Leads the development of department budget, policies and procedures. Contributes to development of overall department strategy and direction. May coordinate work of outside vendors and contractors.</li>\n<li>Lead work activities of the group, planning and organizing work, providing for adequate staffing and resources and maintaining work on schedule so that ongoing customer satisfaction is maintained.</li>\n<li>Identify and implement strategies and efficiencies to enhance customer experience and align with business operations.</li>\n<li>Communicate with other related departments to coordinate work and resolve issues as needed. Provides internal and external customer feedback and leads/participates in teams related to new or ongoing project work and other areas as needed.</li>\n<li>Lead/contribute to process/other improvements based on evaluation of existing procedures and business needs. Utilizes data, metrics and system tools to ensure efficiency and to maximize customer experience. Identifies problems, obstacles and opportunities and proactively takes action to address issues. Strives for continuous improvement.</li>\n<li>Lead maintenance of internal technology and systems resources within own group(s). Coordinates with related technology areas, vendors and others as needed to resolve issues, perform system upgrades and maintain ongoing functionality.</li>\n<li>Prepare reports and other information summarizing work activities and reports results to peer groups as well as senior management. Prepares various analyses as needed to highlight issues and resolve questions.</li>\n<li>Maintain knowledge of Company business and data management knowledge as well as changes and developments in the industry affecting work activities. May participate in outside industry groups and forums related to business activities.</li>\n<li>Perform other duties as assigned and adheres to and models the IDEXX Purpose&amp;Guiding Principles.</li>\n</ul>\n\n<strong>What you need to succeed:</strong>\n<br><br>\nBachelor's degree in statistics, engineering, life sciences, operations management or business, or an equivalent combination of related education and work experience. Strong data management systems skills. Proficient in SAS and Visual Analytics, as well as other reporting, analysis and query languages. Leadership skills and ability. Ability to organize, prioritize and direct work activities of others. Strong interpersonal skills with the ability to facilitate, coach, mentor and resolve conflict. Strong communication skills, both written and verbal. Ability to present information to all levels of the organization. Reasoning, problem solving and analytical skills to resolve issues. Ability to work in a collaborative manner across multiple business units. Project management skills and abilities.\n<br><br>\n<strong>Physical Demands and Work Environment:</strong>\n<br><br>\nExtensive sitting, phone and computer use. Some travel may be required. General office environment. Normal office noise level, with occasional moderate noise\n<br><br>\nEOE/Minority/Female/Disabled/Veteran\n<br><br>\nWhile we appreciate our staffing partners, we are unable to accept unsolicited agency resumes\n<br><br>\n<strong>#LI_CORP</strong>"}