{"job title": "Data Analyst - IRES - SAFB", "company": "Jacobs", "city state": "– Colorado", "rating": "3.4", "job description": "<strong><br><br>Description</strong><br><br>Data analyst within the C2BMC Labs and Warfighters (CLAW) in support of the Missile Defense Agency on the IRES Program at Schriever AFB, CO. Joint Early Warning Lab (JEWL) analyst provides expertise with Theater Missile Warning (TMW) systems including producers, communications, Tactical Data Processors (TDP) and the integration of system with operations. Will interface between the TMW community, the TMW Configuration Control Board (CCB) and product offices. Analysts will review targets of opportunity (TOO) reporting and assess reported performance against operational requirements and Tactics, Techniques and Procedures (TTP) to identify non-compliance with specifications to include OPIR producer, communications architectures, and TDP systems. Initiate Change Requests (CR) and ensure the required continuity and associated relationships between affected Military Standards including MIL-STD 6018, MIL-STD 6016 and Mil-STD 6020. Assess impact of changes to systems, identify system or functional anomalies and provide recommendations for continuing with changes and upgrades.<br><br>#cjpost\n<br><br>\n<strong><br><br>Qualifications</strong><br><br><strong> Requirements</strong> : Must have a Bachelors degree and 10 years general experience. 6 years of relevant experience and 3 years management and/or leadership experience. Ability to analyze data and prepare coherent, comprehensive reports on findings and recommendations for corrective actions. Candidate must be proficient in commonly used word processing, presentation and spreadsheet applications. Must be a US citizen and have a DoD Secret clearance and be able to qualify for and apply for a Top Secret with common compartments. Familiarity with OPIR systems and producers, TMW broadcasts and TDPs to include: Global Command and Control Systems (GCCS), Processing and Display System - Migration (PDS-M) Tactical Receive Segment (TRS), and Shared Early Warning Display (SEWD) a plus. <strong> Desired</strong> : Detailed understanding of IBS broadcasts and data structures and their relationship with the various TDPS. Detailed knowledge of TMW communications systems and procedures to include space borne sensor capabilities, ground processing systems, tactical communications systems and operational environments. Knowledge of DoD communications systems, BMD and ITW/AA systems. Familiar with test planning and test conduct within laboratory and operational environments. An active Top Secret clearance.Jacobs is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status or other characteristics protected by law. Jacobs is a background screening, drug-free workplace."}