{"job title": "Senior Business Intelligence Analyst", "company": "MarineMax", "city state": "– Clearwater, FL", "rating": "3.4", "job description": "<ul>\n<li>Use data to tell a story. Make insights and recommendations to help drive operational performance and control SG&amp;A expense.</li>\n<li>Translate business needs into technical specifications that result in reports and visualizations to convey information to management.</li>\n<li>Design, develop, test and maintain solutions.</li>\n<li>Build dynamic and rich dashboards accessible by various departments and user groups.</li>\n<li>Build exception reports to help focus management on relevant financial transactions and ratios.</li>\n<li>Create ad hoc reports and views as needed to assist management in understanding, researching, and analyzing issues.</li>\n<li>Evaluate and improve existing BI systems.</li>\n<li>Monitor data quality and validate data queries.</li>\n<li>Review and assess proposals requesting changes or additions to existing reports.</li>\n</ul>\n\n<strong>What we are looking for:</strong>\n\n\n<ul>\n<li>Bachelor's Degree in Accounting, Finance, Computer Science, Management Information Systems, Statistics or closely-related field.</li>\n<li>Minimum of three years of hands-on Data Analysis and Reporting experience.</li>\n<li>Previous experience with business intelligence visualization software (Qlik, Tableau, Microsoft Power BI, Sisense BI, Spotfire etc.)</li>\n<li>SQL experience is highly valued.</li>\n<li>Advanced skills in Microsoft Excel is highly valued.</li>\n<li>Multi-location or multi-department experience a plus.</li>\n<li>Excellent communication skills are important -- both written and spoken.</li>\n<li>Ability to work independently, multi-task, and manage your time to meet deadlines.</li>\n<li>Strong interpersonal skills with an ability to interact with all levels of management will be successful in the role.</li>\n<li>Good organizational skills and attention to detail required.</li>\n</ul>\n\n<strong>Position Overview:</strong>\n<br><br>\nAs a part of the MarineMax team, you will work directly with the accounting/finance, products and operations teams to identify business opportunities, measure the results of change and provide world-class reporting solutions. MarineMax continues to focus more on data driven insights to manage the business. In addition, you will provide strategic and tactical input to develop and maintain the company's Business Intelligence infrastructure.\n<br><br>\nEqual Opportunity Employer Minorities/Women/Protected Veterans/Disabled<br><br>SDL2017"}