{"job title": "Government Programs Data Analyst", "company": "Medical Mutual", "city state": "– Cleveland, OH", "rating": "3.2", "job description": "<strong>Responsibilities</strong> Supports business decisions through the use of data mining and analytics and identifying and resolving routine to varied and/or more complex issues through the reconciliation of large data sets. Serves as a subject matter, data analytics, and regulatory reporting expert in assigned government programs functional area including but not limited to Medicare enrollment, revenue, government files processing, reconciliation, regulatory reporting, encounter data. Collaborates with peers in various internal departments and external parties to ensure timely and accurate data.\n\n<ul>\n <li> Utilizes data mining and analytical knowledge to understand large data sets. Develops reporting to meet business needs. Provides clear, easy to understand summary documents and reports for management. Creates and maintains technical specifications, unit test plans, and dataflow diagrams. Follows quality assurance guidelines including the documentation, review and approval of all project related artifacts.</li>  <li> Prepares analysis to identify trends and issues, troubleshoot errors, and propose methods for resolution. Validates data against other data sources, requirements and/or technical specifications, and works with data exchange processes and workflows between Company, government entities, and delegated entities to ensure accurate and complete data.</li>  <li> Collaborates with various departments to identify and resolve routine to more complex issues and errors that involve internal and external systems, government data, and regulatory guidance. Executes and may lead small to medium size data-related analytical projects to drive business decisions and efficiencies. Ensures timely and accurate reporting, correction of issues and errors, implements best practices, support audits and attestations.</li>  <li> Participates in the development and implements data analytics, reconciliation, and reporting policies and procedures. Supports, trains and mentors more junior analysts. Functions well within a matrix organization (e.g. supporting multiple leaders).</li>  <li> Maintains up to date knowledge of regulatory requirements and industry best practices as it relates to data. Attends CMS training sessions and other appropriate industry meetings.</li>  <li> Performs other duties as assigned.</li> \n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\n<strong>Government Programs Data Analyst II</strong>\n\n<ul>\n <li> Bachelor's degree in Health Informatics, Healthcare or Business Administration, Statistics or related field. Advanced degree preferred.</li>  <li> 3 years' experience in statistical analysis or data analysis which includes relational database structure, SQL programming, and DB2 in a mainframe environment.</li>  <li> Health plan experience preferred.</li>  <li> Medicare or Medicaid managed care experience preferred.</li>  <li> Relevant Certification and/or Licensure preferred (or working towards).</li>  <li> Strong knowledge of government programs regulations, requirements best practices.</li>  <li> Knowledge of various data mining, reporting, and reconciliation tools and methodologies.</li>  <li> Intermediate to advanced proficiency with database reporting and query writing and Microsoft Office applications (especially Access and Excel), SAS SQL, Business Objects, and data warehousing.</li>  <li> Ability to write policies that are compliant with Federal laws.</li> \n</ul>\n\n<strong>Sr. Government Programs Data Analyst</strong>\n\n<ul>\n <li> Bachelor's degree in Health Informatics, Healthcare or Business Administration, Statistics or related field. Advanced degree preferred.</li>  <li> 5 years' experience in statistical analysis or data analysis which includes relational database structure, SQL programming, and DB2 in a mainframe environment.</li>  <li> Health plan experience preferred.</li>  <li> Medicare or Medicaid managed care experience preferred.</li>  <li> Relevant Certification and/or Licensure strongly preferred</li>  <li> Comprehensive knowledge of government programs regulations, requirements best practices.</li>  <li> Knowledge of various data mining, reporting, and reconciliation tools and methodologies.</li>  <li> Advanced proficiency with database reporting and query writing and Microsoft Office applications (especially Access and Excel), SAS SQL, Business Objects, and data warehousing.</li>  <li> Ability to write policies that are compliant with Federal laws.</li> \n</ul>\n\nMedical Mutual is looking to grow our team! We truly value and respect the talents and abilities of all of our employees. That's why we offer an exceptional package that includes: <strong>A Great Place to Work:</strong>\n\n<ul>\n <li>Top Workplace in Northeast Ohio year after year</li> <li>On-site wellness center at most locations. Enjoy personal trainers, towel service, locker room, weight room, elliptical machines, and a variety of classes!</li> <li>On-site cafeteria serving hot breakfast and lunch, at most locations. Choices ranging from salad bar, made to order, hot and cold sandwiches, or a variety of entrees cooked fresh daily. Convenience store at most locations</li> <li>Employee discount program. Discounts at many places in and around town, just for being a Medical Mutual team member</li> <li>Business casual attire</li>\n</ul>\n\n<strong>Excellent Benefits and Compensation:</strong>\n\n<ul>\n <li>Competitive compensation plans</li> <li>Employee bonus program</li> <li>401(k) with company match and an additional company contribution</li>  <li>Excellent medical, dental, vision, and disability insurance</li>\n</ul>\n\n<strong>An Investment in You:</strong>\n\n<ul>\n <li>Career development programs and classes</li> <li>Mentoring and coaching to help you advance</li> <li>Education reimbursement up to $5K per year</li>\n</ul>\n\n<strong>About Medical Mutual:</strong> We strive to create peace of mind. Our customers can trust us to do things right and to help them get value from their health plan. We're the largest health insurer in Ohio and for more than 80 years, we've been serving our members and the Ohio communities where they live and work. Medical Mutual is a Top Place to Work in Northeast Ohio with exceptional career opportunities that offer challenge, growth and a great work/life balance. We want talented, innovative, and driven people to help us continue to be the best health insurance choice of Ohioans and help make Ohio the best it can be! Our headquarter building is located in the heart of downtown Cleveland and we have multiple offices throughout the state. Join us at one near you! At Medical Mutual we celebrate differences and are mutually invested in our employees and our community. We are proud to be an Equal Employment Opportunity and Affirmative Action Employer. Qualified applicants will receive consideration for employment regardless of race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, veteran status, or disability status. We maintain a drug-free workplace and perform pre-employment substance abuse and nicotine testing.\n<br>\nAssociated topics: care, care unit, drug, licensed practical nurse, licensed vocational nurse, oncology, operating room, physician, pulmonary, therapist"}