{"job title": "Senior Enterprise Data Analyst", "company": "Perspecta Inc.", "city state": "– Chantilly, VA", "rating": "NA", "job description": "Senior Enterprise Data Analyst Apply Job ID 2018-52076 Location Chantilly, Virginia, United States Clearance Top Secret/SCI w/Poly\n<br><br>\n<strong>Overview:</strong>\n<br><br>\nEvery day at Perspecta, we enable hundreds of thousands of people to take on our nation's most important work. We're a company founded on a diverse set of capabilities and skills, bound together by a single promise: we never stop solving our nation's most complex challenges. Our team of engineers, analysts, developers, investigators, integrators and architects work tirelessly to create innovative solutions. We continually push ourselvesto respond, to adapt, to go further. To look ahead to the changing landscape and develop new and innovative ways to serve our customers.\n<br><br>\nPerspecta works with U.S. government customers in defense, intelligence, civilian, health care, and state and local markets. Our high-caliber employees are rewarded in many waysnot only through competitive salaries and benefits packages, but the opportunity to create a meaningful impact in jobs and on projects that matter.\n<br><br>\nPerspecta's talented and robust workforce14,000 strongstands ready to welcome you to the team. Let's make an impact together.\n<br><br>\nPerspecta is an AA/EEO Employer - Minorities/Women/Veterans/Disabled and other protected categories\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nPerspecta is seeking a Senior Enterprise Data Analyst to join a high-performing, multi-disciplinary team and to lead innovative enterprise data analysis and knowledge management activities directly supporting the Nation's most sensitive and critical intelligence activities. This is not a typical database management or data analysis position. The successful candidate will have direct, recent experience working with and applying multiple approaches to analyzing massive data sources (including streaming) requiring integration of and reporting on highly diverse data types supporting intelligence operations. The successful candidate will also have demonstrated experience building and sustaining multi-disciplinary, collaborative teams responsible for stakeholder engagement, building and maintaining strategic partnerships, and proactively identifying and implementing new and/or innovative approaches to support analytic and operational activities. This position requires demonstrated expertise or experience in the following areas:\n\n\n<ul>\n<li>Interacting with senior leaders and decision makers</li>\n<li>Simultaneously manage long-term data analysis tasks and short-suspense (crisis-support) tasks</li>\n<li>Providing guidance to web developers, knowledge managers, visualization specialists, and communication officers to convey highly technical and complex information to diverse audiences</li>\n</ul>\n\n<strong>Qualifications:</strong>\n<br><br>\n<strong>Required Qualifications:</strong>\n\n\n<ul>\n<li>TS/SCI clearance with polygraph.</li>\n<li>Bachelor's Degree in a quantitative or technical field of study,</li>\n<li>Minimum of 10 years of experience supporting multiple offices and mission activities in the customer's organization</li>\n<li>Demonstrated expertise applying data science, mathematical, quantitative, and/or statistical methods and tools in direct support of an intelligence community mission with demonstrated experience building and sustaining collaborative relationships with internal and external stakeholders</li>\n<li>Applied expertise in massive data conditioning, curation, visualization, and analytics methods/approaches involving diverse data types</li>\n<li>Continuous learning of new or emerging data science and related applications, methods, and approaches with demonstrated experience applying new methods or approaches</li>\n<li>Experience supporting data-driven decision processes in support of intelligence community operations</li>\n<li>Working knowledge of intelligence community collection sources and methods</li>\n<li>Excellent communication and interpersonal skills with demonstrated ability to work independently with minimal guidance to develop and apply data science methods to solve problems or support operations</li>\n</ul>\n\n<strong>Desired Qualifications:</strong>\n\n\n<ul>\n<li>MS, MA or PhD in a related field</li>\n<li>Experience with customer data and situational reporting tools and processes (data mining or cables and other reporting; operations tracking; personnel and equipment accountability and monitoring)</li>\n<li>Minimum of 10 years of experience performing statistical analysis, mathematical models, and data-mining analysis</li>\n<li>Minimum 5 years of experience translating complex, technical findings into an easily understood narrative (i.e., tell a story with the data) in graphical, verbal, or written form</li>\n<li>Minimum 5 years of experience investigating and identifying data quality concerns while working with the stakeholder to develop recommendations and resolutions</li>\n<li>Conceptual, quantitative, organizational, research, written and verbal communication, sound judgment, problem solving, and independent working skills.</li>\n<li>Interpersonal and teamwork skills to work with individuals and organizations, to include varying levels and types (Government, Industry, and Academia).</li>\n<li>Facilitation skills to bring diverse groups together on issues and reach consensus across stakeholders.</li>\n<li>The ability to perform complex analyses and to communicate the results using accurate, concise, and effective writing and through descriptive and graphical representations.</li>\n<li>Technical understanding of intelligence community requirements and contract-specific lines.</li>\n<li>Flexibility in assisting with ad hoc tasks and in adjusting as tasks are re-prioritized.<br><br>SDL2017</li>\n\n</ul>"}