{"job title": "Senior Data Engineer PSJH", "company": "Providence Health &amp; Services", "city state": "– Seattle, WA", "rating": "3.4", "job description": "<strong>Description:</strong>\n<br><br>\n<strong>Providence is calling a Senior Data Engineer PSJH to Providence Health &amp; Services in one of the following locations: Renton, WA, Seattle, WA, Portland, OR, Beaverton, OR or Anaheim, CA.</strong>\n<br><br>\nWe are seeking a Senior Data Engineer PSJH who designs and builds modern data-centric software applications to support clinical and operational processes across all parts of the health system. These applications leverage cloud computing, big data, mobile, data science, and modern software development methodologies and frameworks. Data Engineers build data pipelines, enrichment processes, provisioning layers, APIs and user interfaces to meet the requirements of key initiatives. A Senior Data Engineer has a demonstrated ability to mentor and assist less experienced Data Engineers. Senior Data Engineers participate in research and development of new technologies to help set up repeatable processes or templates for other Data Engineers to follow. Strongly encourages and places a priority on collaboration with meticulous source control and documentation. An emphasis on simple solutions to complex problems through the use of modern and emerging methods and tools is critical. This position will works closely with the Product, Platform, and Architecture teams to deliver on joint efforts.\n<br><br>\n<strong>In this position you will have the following responsibilities:</strong>\n\n<ul>\n<li>Design, build and deliver quantitative applications that improve operations and generate value</li>\n\n<li>Participate in DevOps, Agile, and continuous integration frameworks</li>\n\n<li>Stay abreast of emerging technologies, open source projects, and best practices in the field</li>\n\n<li>Data warehousing, big data, enterprise search, business intelligence, analytics, modern and mobile applications</li>\n\n<li>Build processes that are fault-tolerant, self-healing, reliable, resilient and secure</li>\n\n<li>Work effectively and in real-time with other developers, product managers, and customers to deliver on collective goals</li>\n\n<li>Actively participate in code reviews, support the overall code base, and support the establishment of standard processes and frameworks. Participate in development of standard practices and enforce following standard processes.</li>\n\n<li>Take an open and transparent approach to the work by sharing code and expertise, by consulting peers for problem-solving, and by being a mentor to your peers</li>\n\n<li>Mentor and train less senior staff</li>\n</ul>\n<strong>Qualifications:</strong>\n<br><br>\n<strong>Required qualifications for this position include:</strong>\n\n<ul>\n<li>Bachelors Degree in computer science, engineering, mathematics, MIS or similar field.</li>\n\n<li>5 years in technology roles.</li>\n\n<li>Demonstrated analytical skills</li>\n\n<li>Demonstrated problem solving skills</li>\n\n<li>Possesses strong technical aptitude.</li>\n\n<li>Cloud computing, Linux, Hadoop, MapReduce, Spark, Hbase, Kudu and NoSQL platforms in general; Apache Solr and Lucene</li>\n\n<li>Java, Scala, C#, Python, shell scripting and/or similar languages</li>\n\n<li>Relational database platforms, database design, and SQL</li>\n\n<li>APIs, JSON, REST and other relevant W3C open standards</li>\n\n<li>Modern application development frameworks</li>\n\n<li>Familiarity with commercial or open source ETL tools</li>\n</ul>\n<strong>Preferred qualifications for this position include:</strong>\n\n<ul>\n<li>Masters Degree.</li>\n\n<li>9 years in technology roles.</li>\n</ul>\n<strong>About the department you will serve.</strong>\n<br><br>\nProvidence Strategic and Management Services provides a variety of functional and system support services for all eight regions of Providence Health &amp; Services from Alaska to California. We are focused on supporting our Mission by delivering a robust foundation of services and sharing of specialized expertise.\n<br><br>\n<strong>We offer a full comprehensive range of benefits - see our website for details</strong>\n<br><br>\nhttp://www.providenceiscalling.jobs/rewards-benefits/\n<br><br>\n<strong>Our Mission</strong>\n<br><br>\nAs expressions of Gods healing love, witnessed through the ministry of Jesus, we are steadfast in serving all, especially those who are poor and vulnerable.\n<br><br>\n<strong>About Us</strong>\n<br><br>\nProvidence Health &amp; Services is a not-for-profit Catholic network of hospitals, care centers, health plans, physicians, clinics, home health care and services guided by a Mission of caring the Sisters of Providence began over 160 years ago. Providence is proud to be an Equal Opportunity Employer. Providence does not discriminate on the basis of race, color, gender, disability, veteran, military status, religion, age, creed, national origin, sexual identity or expression, sexual orientation, marital status, genetic information, or any other basis prohibited by local, state, or federal law.\n<br><br>\n<strong>Schedule:</strong> Full-time\n<br><br>\n<strong>Shift:</strong> Day\n<br><br>\n<strong>Job Category:</strong> Information Technology\n<br><br>\n<strong>Location:</strong> Washington-Renton\n<br><br>\n<strong>Other Location(s):</strong> Washington-Seattle, Oregon-Portland, Oregon-Beaverton, California-Anaheim\n<br><br>\n<strong>Req ID:</strong> 198070"}