{"job title": "Data Science - Developer", "company": "SunTrust Banks", "city state": "– Atlanta, GA", "rating": "3.2", "job description": "<strong>Job Description :</strong>\n<br><br>\n<strong>Job Description</strong>\n\n\n<ul>\n<li>Delivers moderately complex solutions.</li>\n<li>Designs, codes, tests, debugs, and documents moderately complex application solutions that meet defined business requirements and meets the enterprise performance and architecture standards.</li>\n<li>This includes but is not limited to customized coding, software integration, analysis, configuring solutions, or using tools such as Pega, FileNet, WebSphere integration products to customize or generate a product. Conducts robust unit testing and provides support for subsequent release testing.</li>\n<li>Provides escalated support for applications in production.</li>\n<li>Works independently on most phases of applications systems analysis and programming activities.</li>\n<li>Provides direction in the development and maintenance of solutions as well as participates in various phases of the development life cycle.</li>\n<li>Applies an understanding of key business processes and practical experience to solve a range of straightforward problems.</li>\n<li>Analyzes possible solutions using experience, judgment and precedents.</li>\n<li>Works under moderate supervision.</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\n<strong>Basic Qualifications:</strong>\n\n\n<ul>\n<li>Bachelor's degree and 2 years of experience as a developer or an equivalent combination of education and work experience.</li>\n<li>Knowledge in information systems and ability to apply that knowledge in practice.</li>\n<li>Ability to manage competing priorities.</li>\n<li>Ability to solve problems in straightforward situations by analyzing possible solutions using experience, judgment and precedents.</li>\n<li>Experience participating in IT projects.</li>\n<li>Ability to communicate complex information in straightforward situations.</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Bachelor's degree and 3 years of experience.</li>\n<li>Banking or financial services experience.</li>\n<li>Knowledge of one or more of the following: Data Warehousing, Business Intelligence, ETL tools, ERP systems, RAD/JAD, Unix, Distributed (e.g. JEE, .Net, Middleware, WebServices), Mainframe (COBOL) , Specialties (e.g. Pega, FileNet, Cognos, IVR, WebSphere), Database platforms such as Oracle, SQL Server, DB2.</li>\n</ul>\n\nEqual Opportunity Employer: SunTrust supports a diverse workforce and is a Drug Testing and Equal Opportunity Employer. SunTrust does not discriminate against individuals on the basis of race, creed, color, gender, religion, national origin, age, disability, veteran status, pregnancy, marital status, citizenship status, sexual orientation, gender identity, genetic information, or any other classification protected by applicable laws.\n<br><br>\nTo review the EEO Poster, copy and paste the following link into your browser: http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf http://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\n<br><br>\nApply Now &gt;&gt; Refer a Friend\n<br><br>\nLink for schema<br><br>SDL2017"}