{"job title": "Data Analyst Trainee", "company": "T.D. Williamson Inc.", "city state": "– Salt Lake City, UT", "rating": "3.1", "job description": "Overview\n<br><br>\nUnder the direction of the team's Lead Data Analyst, complete training and acquire sufficient knowledge to accurately interpret and evaluate inspection vehicle data to facilitate on-going safe operation of pipelines.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Under supervision of qualified Analysts, performs initial run checks to ensure inspection data meets clients' minimum specifications in accordance with contractual requirements,</li>\n<li>Under supervision, identifies all instances of metal loss for the inspected pipeline length,</li>\n<li>Under supervision, determines all pipeline features, fittings and locations in order to provide a comprehensive pipeline listing,</li>\n<li>Under supervision, collates and documents all quality-checked inspection data in order to produce a comprehensive overview of the pipeline integrity per client-specified standards;</li>\n<li>Completes assigned online training modules and participates in classroom/workshop sessions to gain experience in Pipeline Inspection Technology Level I material</li>\n<li>Acquiresknowledge and skills necessary to obtain the industry standard Data Analyst Level I certification, in compliance with industry standard,</li>\n<li>Acquires behavior competency appropriate to level of experience while developing, through coaching, mentoring, and training, the behaviors necessary to advance to Data Analyst,</li>\n<li>Coordinates with the software development team in areas of fault finding and possible methods of process improvement,</li>\n<li>Learns job tracking methods for complete and accurate forecasting of analysis deadlines,</li>\n<li>Attends scheduled meetings and trainings to ensure adherence to current TDW initiatives and processes.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>High School Diploma required; Bachelor Degree preferred,</li>\n<li>Demonstrated ability to be detailed oriented,</li>\n<li>Good basic mathematics skills,</li>\n<li>Proficient written and verbal communication skills in English, and/or other local language, if req</li>\n</ul>"}