{"job title": "Healthcare Data Analyst II - MHE", "company": "University of Massachusetts Medical School", "city state": "– North Quincy, MA", "rating": "3.4", "job description": "Overview\n<br><br>\n<strong>GENERAL SUMMARY OF POSITION:</strong>\n<br><br>\nUnder the general direction of the Manager or designee, the Healthcare Data Analyst II MHE will perform data analyses for assigned projects and develop/ produce all related reports. This position will conduct information gathering to provide leadership with the necessary tools to determine the best data analytic practices to position the business unit for addressing client needs. The Healthcare Data Analyst II MHE will also begin to develop analytic consulting skills and utilize a customer service focus to design and deliver analytic products that meet or exceed client expectations. This position will be required to work on multiple concurrent projects while managing to successfully complete deliverables with an increasing level of independence.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\n<strong>MAJOR RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>Conduct advanced data mining in a timely and accurate manner as required by the program/project.</li>\n<li>Produce standard and adhoc analyses and reports using a variety of data which support the development, implementation and monitoring of programs/projects.</li>\n<li>Integrate/manipulate large datasets from data sources (e.g. claims and encounter data) to support analyses using MS Excel, Access, SAS, SQL, COGNOS, and Business Objects.</li>\n<li>Deploy standard qualitative and quantitative analysis techniques utilizing software packages such as SAS, SQL or Atlas.ti.</li>\n<li>Contribute to the design of project-specific analytic plans, data manipulation and collection efforts; may include: claims analysis, interviews, focus groups, and surveys involving clients, state agency personnel, and other key informants.</li>\n<li>Utilize and create standard testing measures and/or algorithms to test and analyze large amounts of data.</li>\n<li>Design and develop data collection instruments, databases and procedure manuals based on thorough knowledge of data files, related databases, and systems integration.</li>\n<li>Participate in the design and implementation of data management strategies/techniques and quality control procedures, including writing technical requirements and documentation of data sets.</li>\n<li>Produce and submit data analysis reports. Develop methods and results narratives to be included in broader scientific reports developed by senior staff.</li>\n<li>Ensure accuracy of all data analyses, reports and other deliverables by conducting thorough quality control checks and resolving discrepancies.</li>\n<li>Provide interpretation of data for key stakeholders and leadership; including identifying and reporting data patterns and abnormalities. May be required to produce tabular and graphic summaries of analyses in a form suitable for inclusion in manuscripts for publication in peer reviewed scientific journals as well as for presentation at scientific meetings.</li>\n<li>Schedule, coordinate, and review activities related to data collection and analysis to meet deadlines.</li>\n<li>Communicate with all appropriate parties to ensure that the project's objectives, scope, and expected deliverables of each project phase are understood. Facilitate communication of the project's status, budget, costs, issues, and related information to same.</li>\n<li>May provide guidance and training to more junior data staff as needed to help ensure accuracy and timeliness of deliverables.</li>\n<li>Review and monitor compliance with the federal and state regulations.</li>\n<li>Perform other duties as required.</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\n<strong>REQUIRED QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>Bachelor's degree in a business, health sciences, or a related field; or equivalent</li>\n<li>4 years of related experience; including at least one year of healthcare data analysis</li>\n<li>Demonstrated experience/skills in appropriate computer, statistical or database applications including SAS/SQL, Business Objects, Cognos or similar.</li>\n<li>Strong attention to detail and time management/organization skills to manage multiple priorities.</li>\n<li>Demonstrated ability to research issues and resources.</li>\n<li>Demonstrated ability to write reports, journal articles and/ or other technical documents.</li>\n<li>Excellent communication skills, both oral and written.</li>\n<li>Interpersonal skills necessary to interact successfully with a wide range of individuals.</li>\n</ul>\n\n<strong>Additional Information</strong>\n<br><br>\n<strong>PREFERRED QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>Master's degree in a public policy, public administration, economics, health care administration, epidemiology, statistics or a related field.</li>\n</ul>"}