{"job title": "Data Scientist", "company": "Chase", "city state": "– Columbus", "rating": "3.5", "job description": "<div>The Performance Consulting organization is responsible for leading critical, strategic efforts throughout the business with the ultimate goal of improving both operating and financial performance. The Operations Research and Data Science (ORDS) organization, which is part of Performance Consulting, leads and executes transformational data science and machine learning projects in Operations across Consumer and Community Banking.</div> \n<br>\n<div>The ORDS organization is a highly collaborative and innovative data science team, bringing together individuals with diverse backgrounds and experiences to solve complex business problems. We are deeply committed to fostering an organization devoted to Continuous Learning, and are passionate about building solutions which deliver business value. If you passionate about working on challenging machine learning, data science or modeling problems, this is an ideal opportunity.</div> \n<br>\n<div><strong>Data Scientists</strong> are responsible for developing advanced analytics using a variety of statistical modeling and machine learning methods, algorithms and techniques, e.g., predictive modeling, forecasting, statistical analysis, optimization, and simulation modeling. This position provides an exceptional opportunity to make a difference at a premier financial institution. In this role, you will have an excellent career path and numerous opportunities for both personal and professional development in an intellectually stimulating environment.</div> \n<br>\n<strong><div> Responsibilities:</div>\n\n<br></strong>\n\n\n<ul>\n<li>Leverage a wide range of data analysis, machine learning and statistical modeling algorithms and methods to solve business problems.</li> \n\n<li>Evaluate the current operational environment and identify opportunities to leverage advanced analytics.</li> \n\n<li>Apply critical thinking skills and perform advanced analytics with the goal of solving complex and multi-faceted business problems.</li> \n\n<li>Generate deep insights through the analysis of data and understanding of operational processes and turn them into actionable recommendations.</li> \n\n<li>Perform advanced quantitative and statistical analysis of large datasets to identify trends, patterns, and correlations that can be used to improve business performance.</li>\n<li>Become a subject matter expert and trusted advisor in the analytics discipline.</li>\n<li>Demonstrate excellent organization skills throughout the development of analytical solutions (data analysis documentation, hypothesis documentation, code management, etc.).</li>\n<li>Build and deploy prototype solutions to demonstrate ideas and prove concepts.</li> \n\n<li>Effectively communicate with project team members and sponsors throughout the project lifecycle (status updates, gaps/risks, roadblocks, testing outcomes, etc.).</li> \n\n<li>Develop presentations to summarize and communicate key messages to senior management sponsors and colleagues.</li>\n<li>Work independently and collaboratively (as needed) within the team to achieve the desired outcomes of an analytical project.</li>\n<li>Actively contribute to the continuous learning mindset of the organization by bringing in new ideas and perspectives that stretch the thinking of the group.</li> \n</ul>\n\n<div></div> \n<br>\n<strong><div>Education:</div>\n\n<br></strong>\n\n\n<ul>\n<li>M.S. or Ph.D. in Statistics, Engineering, Computer Science, Mathematics, Economics or related quantitative field</li> \n\n<li>Background in Machine Learning with a strong foundation in statistical analysis and modeling preferred</li>\n</ul>\n\n<strong><div>Experience and Technical Skills:</div>\n\n<br></strong>\n\n\n<ul>\n<li>3 years experience developing predictive models, forecasting models and/or machine learning algorithms in a large-scale, corporate environment</li>\n<li>Hands-on experience with a wide variety of predictive modeling, machine learning, data mining, time series forecasting and optimization algorithms</li>\n<li>3 years experience working with a variety of database environments (SAS, Oracle, Teradata, etc.)</li> \n\n<li>Must have demonstrated ability to code complex programs in Python, SAS and SQL</li> \n\n<li>Must have demonstrated experience in large scale data environments and ability to work efficiently with very large datasets</li>\n<li>Proven ability to strategically manage complex, highly-visible analytical projects from concept through implementation</li>\n<li>Experience leveraging job automation applications and environments (e.g., CRON, Control-M)</li>\n<li>Demonstrated ability to effectively manage all facets of the analytical project lifecycle (data exploration, hypothesis testing, code development, testing/validation, model deployment, etc.)</li>\n</ul>\n\n<div><strong>Superior Analytical Skills</strong></div>\n\n\n<ul>\n<li>Outstanding critical thinking and problem solving skills</li>\n<li>Has an engineering mindset</li>\n<li>Self-starter mentality with the ability to delegate/collaborate with others</li>\n<li>Ability to translate ambiguous business problems into a conceptual analytical and technical architecture</li>\n<li>Passion for continuous learning and professional development</li>\n<li>Deep curiosity, creativity and imagination.</li>\n</ul>\n\n<div><strong>Strong business acumen</strong> </div>\n\n\n<ul>\n<li>Ability to influence and become a trusted advisor</li>\n<li>Ability to partner closely with team members and business sponsors to clearly define the requirements of proposed solutions</li>\n<li>Ability to translate technical details, observations and results into business language</li>\n<li>Proven effective communication and presentation skills</li>\n<li>Ability to effectively navigate an occasionally ambiguous, semi-structured work environment</li> \n\n<li>Ability to thrive in both independent and collaborative work environments</li> \n</ul>"}