{"job title": "Data Scientist", "company": "Varite USA", "city state": "– Moline, IL 61265", "rating": "4.1", "job description": "This position is currently eligible for a telework and/or compressed workweek arrangement at the present time. The arrangement may be delayed for training or other job acclimation purposes, and remains subject to change.\n<br>\nAs the lead Data Scientist in Analytics Enablement this position will provide technical leadership across multiple corporate critical analytic initiatives directly tied to the enterprise Critical Initiative on Data and Analytics, many of these programs will run in parallel. The role will start off providing support to four programs: EID (Emerging Issue Detection), MAI (Manufacturing Analytic and Insights), Parts Pricing Optimization and Inventory Optimization. These current projects impact all divisions and hit many business functions including Parts, Customer and Product Support, Quality, Manufacturing, Supply Management, Engineering, and Information Technology. In addition, you will:\n\n\n<ul>\n<li>Ensure the actual adoption and value realization of the analytical solutions and models by developing the complex analytic models, proving the validity of these models, explaining them to the business partners, and driving continuous improvement to the models based on model results and business requirements changes</li>\n<li>Perform highly complex statistical analysis on structured and unstructured data from multiple sources with many potential non-unique identifiers</li>\n<li>Find and integrate new internal or external datasets necessary to complete the analysis and improve the validity, predictability, and accuracy of models</li>\n<li>Mentor junior team members as the lead data scientist and operations research analyst on the team</li>\n<li>Serve as the lead technical expert for analytics and consult with other analytic professionals, industry experts and business partners to advocate for the technologies and methodologies that must be implemented to realize high cost-savings and optimizations opportunities</li>\n<li>Consult and oversee analytics experts and analytic solution development done by third party companies</li>\n<li>Proactively stay up-to-date with the latest appropriate analytical techniques, tools and frameworks from both academia and the industry to recommend and implement these where needed</li>\n<li>** U.S. visa sponsorship is NOT available for the role.</li>\n</ul>\n\nWhat Skills You Need\n\n\n<ul>\n<li>5+ years of experience in conducting statistical analysis and building models in an advanced scripting language such as R or Python</li>\n<li>5+ years of experience in solving business problems and realization of optimizations and savings with advanced analytical solutions</li>\n<li>Demonstrated transformational consulting experience in garnering alignment by advocating potential benefits of advanced analytics and operational research with the ability to present highly technical information to business units not versed in such technicalities</li>\n<li>5+ years of experience in classical and modern operations research methods as well as tools such as Lindo, GUROBI, CPLEX</li>\n<li>Ability and willingness to travel up to 25%</li>\n</ul>\n\nWhat Makes You Stand Out\n<br>\nOther areas of experience or interest that will help us place you on the right team include:\n\n\n<ul>\n<li>2+ years of experience in defining Solution Architecture</li>\n<li>1+ years of experience developing solutions within the AWS cloud</li>\n<li>2+ years of demonstrated ability in application programing using languages such as Java Script, Java, Scale etc.</li>\n<li>Demonstrated ability and desire to learn new techniques in the field of data and analytics, potentially leading to a relevant Advanced Degree</li>\n<li>Experience in development of Expert systems</li>\n<li>Experience performing projects using the Agile methodology</li>\n<li>Good working knowledge of all Deere product lines and the types of data available for each having worked in more than 1 division</li>\n<li>Basic knowledge of the internal manufacturing processes as well as the Marketing and Customer Support processes</li>\n</ul>\n\n<strong>Education</strong>\n<br>\nIdeally, you will have a degree or equivalent work experience in the following:\n\n\n<ul>\n<li>Degree in a relevant study area is required (e.g. computer science, mathematics, statistics, business analytics)</li>\n</ul>"}