{"job title": "Scientist I - Neuroanatomy and Data Analysis", "company": "Allen Institute", "city state": "– Seattle, WA", "rating": "3.1", "job description": "POSITION SUMMARY\n<br><br>\nOur mission at the Allen Institute for Brain Science is to accelerate the understanding of how the human brain works in health and disease. Our research goals include generating and analyzing large-scale anatomical imaging data from Alzheimer’s disease mouse models. We are seeking a Scientist to join the Neuroanatomy team and to help with image processing and data analysis related to our whole-brain projection mapping projects.\n<br><br>\nAs a member of this team, the Scientist will perform computational analyses aimed at understanding the organization of whole brain connectivity patterns and pathology in aging and diseased brains. She/he should have experience working with voxel-based image data, solid programming skills, and a strong background in mathematics and statistics. The Scientist will also be responsible for generating data visualizations, establishing signal detection metrics for primary data, generating computational models, performing statistical analysis on large datasets, and assisting with analysis and visualization of single cell RNA sequencing data.\n<br><br>\nJOB RESPONSIBILTIES\n\n<ul>\n\n <li>Develop software tools and methods to identify anatomical structures in image data.</li>\n\n<li>Establish and implement objective metrics for the success of image registration and signal detection algorithms.</li> \n\n<li>Build computational models for predicting and evaluating inter-region and cell type specific connectivity and pathology.</li>\n\n<li>Perform graph theoretical and other computational analyses of whole brain connectivity data to describe network organization (e.g. hubs, modules, rich club organization).</li>\n\n<li>Support primary analysis through data visualizations towards answering specific biological questions.</li>\n\n<li>Follow good coding practices.</li>\n</ul>\nBASIC QUALIFICATIONS:\n\n<ul>\n\n <li>PhD in applied mathematics, computer science, computational neuroscience, or a related field</li>\n\n<li>0-3 years working in a data analysis role performing scientific computing</li>\n\n<li>Experience with relational databases (e.g. postgres, SQL)</li>\n\n<li>Experience with scientific data visualization</li>\n\n<li>Strong knowledge of mathematics especially in linear algebra, 3D transforms and statistics</li>\n\n<li>Strong programming ability in Python (preferred) and/or R</li>\n</ul>\nPREFERRED QUALIFICATIONS\n\n<ul>\n\n <li>Experience using machine learning algorithms for image processing</li> \n\n<li>Strong publication record</li>\n\n<li>Ability to work with fast timelines as part of a collaborative team.</li>\n\n<li>Experience analyzing transcriptomics data</li>\n\n<li>Strong knowledge of statistics</li>\n\n<li>Exceptional attention to good coding practices</li>\n</ul>\n**Please note, this opportunity <strong>does not</strong> offerrelocation assistance or VISA sponsorship**\n<br><br>\nIt is the policy of the Allen Institute to provide equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, the Allen Institute will provide reasonable accommodations for qualified individuals with disabilities."}