{"job title": "Data Scientist, Engineer", "company": "ATI", "city state": "– NC, USA", "rating": "2.9", "job description": "ATI is Building the World's Best Specialty Materials Company™. We focus our advanced specialty materials technology, unsurpassed manufacturing capabilities, and innovative products to serve global end use markets with highly diversified and specialized product offerings. ATI is one of the largest and most diversified specialty metals producers in the world. We have employees world-wide who use innovative technologies to offer growing global markets a wide range of specialty metals solutions.\n<br><br>\nATI Corporate is seeking a Data Scientist, Engineer to join our team! The Data Scientist, Engineer will support all of ATI, focusing on creating and maintaining engineering systems to collect and store transactional and real-time data for analytics. This person will create solutions to compile current and historical data from multiple formats and sources into a unified system that will provide data to other Data Scientists and general users. If you are looking for an opportunity to support a growing, world-class manufacturing company with global manufacturing operations, then this position is for you!\n<br><br>\nPrimary Responsibilities\n\n\n<ul>\n<li>Engineer data storage architecture, methods, and procedures across the business.</li>\n<li>Map data from multiple sources into the new structure.</li>\n<li>Work with business subject matter experts to determine best solutions</li>\n<li>Serve as a subject matter expert in the capabilities of Data Science.</li>\n<li>Collaborate with business owners to solve business problems using a broad spectrum of data science tools, packages and visualization techniques.</li>\n<li>Build models and optimization tools to support large scale projects that utilize online, offline data, structured, and unstructured data.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Degree in computer science, applied statistics, economics, or engineering.</li>\n<li>Experience with SQL, Python, Spark, and R.</li>\n<li>Thorough understanding and hands on experience with Hadoop based distributed storage and computing frameworks</li>\n<li>Thorough understanding of various database systems including NoSQL technologies.</li>\n<li>Solid foundation of statistical and data science concepts and in-depth knowledge about various modeling techniques including linear and logistic regression, decision trees, SVM, neural networks, k-means, random forest, dimensionality reduction, etc.</li>\n</ul>\n\nEqual Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}