{"job title": "Data Scientist Lead - Digital Products Manager", "company": "Chase", "city state": "– Palo Alto", "rating": "3.6", "job description": "<div><div><strong><br>\n<strong><br>\n<div>Commercial Banking is a core business unit focused on Commercial Lending within the JP Morgan Chase group. The group is focused on an innovative journey to create a stealth mode division building a platform for the commercial Banking clients. The platform delivers a one stop shop for the commercial banking clients through AI-driven technologies and best-in class User Experience. The platform will also integrate with other business process related to commercial banking. We are looking out for creative entrepreneurs with high end user focus and who enjoy building large scale systems in the area of FIN tech/Prop tech. This is a unique opportunity to join a fast-paced internal startup team with the resources and support of the nation’s largest bank. The unit is based in Palo Alto and Bangalore.</div> \n<br>\n<div>The Infrastructure Architect will drive the design and development of data management infrastructure, DevOps &amp; CI/CD automation, cloud hosting, security and service availability aspects of JP Morgan Chase commercial real estate products and platforms.</div>\n\n<br><strong><div>Responsibilities:</div>\n<br>\n</strong>\n<br>\n<div><strong>The successful candidate will be leading the development of key aspects of JP Morgan Chase commercial real estate products and platforms:</strong></div>\n<ul>\n<li>Design industrial leading solutions to deeply optimize the big data computing and storage setup, to enable new business needs</li>\n<li>Design and build the infrastructure for data extraction, preparation, and loading of data from a variety of sources</li>\n<li>Design and implement enterprise infrastructure and platforms required for cloud computing</li>\n<li>Design, architect, and improve automation tools for systems management, including development of scripts/building tools</li>\n<li>Perform analysis of best practices and emerging concepts in DevOps, Infrastructure Automation, and system Security</li>\n<li>Dig deep into hardware, driver, Linux kernel, and TCP stack issues to troubleshoot problems and improve system performance</li>\n<li>Implement Continuous Delivery solutions and helping customers automate various stages of their deployments and testing processes</li></ul></strong></strong></div><strong><strong>\n</strong></strong></div><strong><strong>\n<br>Qualifications:\n\n<ul>\n\n<strong><br>\n\n<div><strong>The successful candidate will have experience in working in innovative projects with fast-paced delivery schedules in startups &amp; large enterprises:</strong></div>\n<li>8 years of experience with medium to large-scale Linux production environments</li>\n<li>Proficient understanding of distributed computing principles</li>\n<li>Experience in managing Hadoop cluster, with all included services in any or multiple of cloud infra like GCP, AWS or Azure</li>\n<li>Ability to solve any ongoing issues with operating the cluster</li>\n<li>Proficiency with Hadoop v2, MapReduce, HDFS</li>\n<li>Experience with web technologies and building enterprise architecture roadmaps</li>\n<li>Experience designing, integrating and managing complex infrastructure solutions</li>\n<li>Hands-on experience with containers stacks and orchestration like Kubernetes/K8S, Rancher, Docker</li>\n<li>Expert in the configuration and maintenance of common applications such as Tomcat, Nginx, LDAP, NFS, DHCP, DNS</li>\n<li>Hands-on expert level experience with at least one of the configuration management tools (Puppet/Ansible/Chef)</li>\n<li>BS/MS degree in Computer Science or equivalent experience</li>\n</strong></ul></strong></strong>"}