{"job title": "Director, Product Data Science", "company": "DocuSign", "city state": "– San Francisco, CA", "rating": "4.6", "job description": "<strong>Director, Product Data Science</strong>\n<br>\nProduct Management | San Francisco, California\n<br><br>\nDesign and ship new product quickly from concept to launch product that will impact the lives of millions globally.\n<br><br>\n<strong>Position Summary</strong>\n<br><br>\nWe are looking for Director, Product Data Science to lead our efforts to analyze, infer, predict and optimize a vast array of problems at DocuSign. This role will be involved in developing the vision and future direction of analytics and data science solutions and executing on this vision by conducting predictive modeling and related funnel optimization analyses. This is a great opportunity for a highly entrepreneurial and analytical individual to be the driving force behind critical growth related intelligence, providing actionable insights into our product roadmap, purchasing economics &amp; key business drivers.\n<br><br>\nIn this role you will synthesize deep statistical expertise with communication and vision to build DocuSign's Data Science capabilities, shape our growth roadmap and help create a strong culture of experimentation and data-driven decision making, interfacing directly with executive stakeholders.\n<br><br>\nThis is an individual contributor role reporting to the Senior Director of Product Insights.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Champion the use of data-driven decision-making within the organization.</li>\n<li>Own data science roadmap and oversee major initiatives around modeling for various areas.</li>\n<li>Help build and own the company's data science modeling and A/B testing infrastructure and define model building with the Data Analytics, Engineering, and Product teams.</li>\n<li>Provide thought leadership and analytic review for end-to-end model design and development for analytic modeling techniques (R, Python)</li>\n<li>Provide subject matter expertise in several of following analytic areas: product analytics, marketing analytics, predictive modeling, web/app analytics, A/B testing, customer lifetime value, customer profiling and segmentation, machine learning and artificial intelligence, NLP, dashboarding and data visualization</li>\n<li>Be able to work hands-on end to end on data modeling and on devising, executing and analyzing experiments</li>\n<li>Translate business problems into an analytical framework, develop and deliver on analytic design</li>\n<li>Work with multiple business stakeholders to understand critical business problems and areas of opportunity, influence to implement recommendations.</li>\n<li>Continue to challenge status quo in terms of development processes and best engineering practices. Promote healthy debates around new tools and processes and champion changes that have a positive impact.</li>\n<li>Work with cross-functional and global teams to define business requirements, evangelize the use of empirically derived solutions and influence the product/project delivery.</li>\n<li>Create a friendly, fun, and collaborative team environment</li>\n<li>Participate in external data science events to promote the company's engineering brand. Be comfortable giving tech talks/organizing data scientist panels.</li>\n<li>Manage and mentor data scientist within the Product Insights team</li>\n</ul>\n<strong>Basic Qualifications</strong>\n\n<ul>\n<li>8+ years of experience in highly analytical roles including Big data processing and manipulation in R, Python, Hadoop, BigQuery, SQL</li>\n<li>5+ years of experience in senior data science role focused on solving analytical problems using statistical/quantitative approaches and implementing or improving end-to-end data validation processes and systems</li>\n<li>M.S. or equivalent experience in Mathematics, Statistics, Engineering, Data Science, or another relevant technical field. Ph.D. preferred</li>\n</ul>\n<strong>Preferred Qualifications</strong>\n\n<ul>\n<li>Expert knowledge of statistics, A/B testing, experimental design and optimization, predictive modeling, BI analytics and machine learning</li>\n<li>Hands-on experience with Application Insights Analytics tools (Kusto strongly preferred)</li>\n<li>Familiar with engineering implementation and coding</li>\n<li>2+ years of demonstrated leadership experience: coaching, hiring, developing and engaging data scientists/engineers</li>\n<li>Experience working on high traffic SaaS products strongly preferred</li>\n<li>Experience working in a startup a strong plus</li>\n<li>Strong problem-solving skills with demonstrated rigor in analyzing data; proven experience using data to solve critical and complex questions</li>\n<li>Innovative thinker with intellectual curiosity, with an eye to developing new solutions and tools</li>\n<li>Strong collaboration skills, clear team player, enthusiastic, can-do attitude</li>\n<li>Strong communication skills. Excellent Written and Verbal skills and a passion to articulate ideas in its best form</li>\n<li>Strong project management experience with the ability to manage multiple analytics modeling engagements and priorities at the same time.</li>\n</ul>\n<strong>Product Management @ DocuSign</strong>\n<br><br>\nOur Product Management team brings together some of the best in our industry. The problems you will get to work on are very challenging and that makes them interesting. Collaborating with our partners in engineering and design, we are bringing some of the most innovative never-been-done-before solutions to market. Our highly collaborative cross-border Product Management team operates on the edge between engineering and the business. The Product Management team is helping design solutions from concept to launch all while focusing on and advocating for what's best for the customer. Our team partners with our Sales, Marketing, Finance, Legal and Security teams to bring the product to market.\n<br><br>\n<strong>About DocuSign</strong>\n<br><br>\nDocuSign® is changing how business gets done by empowering hundreds of thousands of companies and tens of millions of users in most countries around the world to sign, send and manage documents anytime, anywhere, on any device with confidence. DocuSign replaces printing, faxing, scanning and overnighting documents with the easiest, fastest, most trusted way to make every approval and decision digital. Organizations of all sizes and industries are accelerating contracts, approvals, and workflows with DocuSign's Digital Transaction Management (DTM) platform and eSignature solution. DocuSign keeps life and business moving forward.\n<br><br>\nDocuSign is an Equal Opportunity Employer. Individuals seeking employment at DocuSign are considered without regards to race, ethnicity, color, age, sex, religion, national origin, ancestry, pregnancy, sexual orientation, gender identity, gender expression, genetic information, physical or mental disability, registered domestic partner status, caregiver status, marital status, veteran or military status, citizenship status, or any other legally protected category.\n<br><br>\n#LI-DS1"}