{"job title": "Research Scientist I HTBS", "company": "Gilead Sciences", "city state": "– Foster City, CA (US)", "rating": "3.2", "job description": "For Current Gilead Employees and Contractors:<br><br>Please log onto your Internal Career Site to apply for this job.<br><br>Job Description<br><br><strong>Specific Responsibilities</strong>:\n<br><br>\nOpportunity exists for a dynamic and highly collaborative scientist to join the High Throughput Biology &amp; Screening group. The successful candidate will work with project and department team members to develop and optimize assays to support drug discovery efforts across multiple therapeutic areas including virology, oncology, fibrosis and inflammatory diseases. Specifically, he/she will support lead identification and optimization efforts by providing assay development and high throughput biology expertise including, but not limited to the following:\n<ul>\n<li>Design assays and screening strategies for different targets, identifying and implementing the most suitable technologies for screening and proactively identifying rate-limiting steps and key decisional activities to advance discovery programs.</li><li>Develop, optimize and validate biological assays amenable to automation and high throughput screening.</li><li>Perform primary high throughput screening, secondary hit profiling assays, focused on small molecule or antibody based projects.</li><li>Program and operate integrated automation systems.</li><li>Perform data analysis, reporting and integration with database software.</li><li>Ability to further develop in-house capabilities, including automation technology, assay methodology, and data base efforts, as needed, through in-house collaborations or other external expertise.</li><li>Ability to manage several projects at any given time, work successfully in a cross-functional team environment and communicate clearly both verbally and in writing to a variety of audiences.</li><li>Mentor and supervise junior lab members, providing scientific direction and guidance.</li>\n</ul>\n<strong>Essential Duties and Job Functions:</strong>\n<ul>\n<li>Broad experience with biochemical and cell based assay development to identify or characterize small molecules and biologics.</li><li>Strong tissue culture experience with the ability to characterize and manipulate primary and transformed cell lines.</li> <li>Experience with high throughput screening and utilization of laboratory automation equipment is preferred but not required.</li><li>Excellent computer skills and experience with data analysis.</li><li>Must be detail oriented, well organized, and have strong communication skills.</li><li>Must be collaborative and have the ability and desire to work in a fast-paced, multi-disciplinary environment.</li>\n</ul>\n<strong>Qualifications:</strong>\n<br><br>\nApplicants must have a PhD or equivalent degree and relevant post graduate experience, preferably in industry, with direct experience in biochemical and cell based assay development.\n<br><br>\n#LI-KW1<br><br>For jobs in the United States:<br><br>As an equal opportunity employer, Gilead Sciences Inc. is committed to a diverse workforce. Employment decisions regarding recruitment and selection will be made without discrimination based on race, color, religion, national origin, gender, age, sexual orientation, physical or mental disability, genetic information or characteristic, gender identity and expression, veteran status, or other non-job related characteristics or other prohibited grounds specified in applicable federal, state and local laws. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Era Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants who require accommodation in the job application process may contact careers@gilead.com for assistance.\n<br><br>\nFor more information about equal employment opportunity protections, please view the ‘EEO is the Law’ poster.\n<br><br>\nNOTICE: EMPLOYEE POLYGRAPH PROTECTION ACT\n<br>\n<strong>YOUR RIGHTS UNDER THE FAMILY AND MEDICAL LEAVE ACT</strong>\n<br>\nPAY TRANSPARENCY NONDISCRIMINATION PROVISION\n<br><br>\nOur environment respects individual differences and recognizes each employee as an integral member of our company. Our workforce reflects these values and celebrates the individuals who make up our growing team.\n<br><br>\nGilead provides a work environment free of harassment and prohibited conduct. We promote and support individual differences and diversity of thoughts and opinion.<br><br>For jobs in France:<br><br>Conformément à la Loi « Informatique et Libertés » (06/01/78), nous vous informons du fait que les données personnelles renseignées pourront faire l'objet d'un traitement informatique par Gilead et pourront être transmises aux Organismes Sociaux. Par ailleurs, vous disposez d'un droit d'accès, de rectification et de suppression des données vous concernant. Vous pouvez exercer ce droit en contactant: FranceDataPrivacy@gilead.com<br><br>For Current Gilead Employees and Contractors:<br><br>Please log onto your Internal Career Site to apply for this job."}