{"job title": "Research Scientist - Data Science", "company": "Immuta", "city state": "– College Park, MD", "rating": "NA", "job description": "<div><b>THE COMPANY</b></div><div>Immuta is a data management platform purposefully built to accelerate the development of machine learning and AI. The world's largest enterprises rely on our software to enable their data scientists, data owners, and governance teams to work together, in a single digital platform, to access data faster and in a legal and ethical manner, lowering business risk and bridging the gap between the law and AI.</div><div> </div><div>We are always on the lookout for world-class talent to join the team and we recognize that our employees are the heart and soul of our solutions. We focus on recruiting the most talented people, treating you right, and allowing you to do what you do best! Smart people want to work with smart people, and we love people who are passionate about what they do and are driven by identifying ways to do it better. Our People-centered culture ensures that your personal and professional interests are both supported and celebrated!</div><div><br></div><div><b>RESEARCH TEAM</b></div><div>Immuta research scientists and engineers identify, plan, and perform basic research and engineer the tools needed to go from concept to prototype. They are focused on finding solutions to challenging problems with the intent to incorporate such solutions within Immutas offerings anywhere from six months from now to several years in the future. Our scientists and engineers on this team and others are world class with a drive to take on and solve cutting edge problems.</div><div><br></div><div><b>YOUR ROLE</b></div><div>You'll work on the Research Team investigating the latest technologies and computational techniques relevant to data integration, virtualization, privacy, and analysis. You'll evaluate the utility of the technology or technique, it's relevance to Immuta, and, when relevant, build prototype integrations or demonstrations. The members of this team have deep knowledge of distributed systems and backgrounds in applied math.</div><div>Beyond your team, youll work closely with the Applied Data Science and Customer Success teams to understand customer use cases, usage patterns, and feedback. Youll work closely with the Legal Engineering team to understand trends in regulations and best practices on a variety of regulatory &amp; privacy related topics. Finally, youll work closely with the Product Team to ensure successful hand off and productization of research prototypes that transition to product features.</div><div>There is a great variety to the projects youll work on, but a common theme is that they are groundbreaking work in this field, suitable for publishing and/or patenting. Some examples of current projects include differential privacy and enhancements to Immutas implementation of it, mathematical techniques to fingerprint data and graphically represent to non-technical users changes in said fingerprint due to policy-driven data transformation, techniques for transforming streaming data based on data access policies.</div><div><br></div><div><b>WERE LOOKING FOR RESEARCH SCIENTISTS WHO...</b></div><div>* have a strong background in their field, have a strong background in mathematics &amp; statistics, and have a desire to apply their background to research centered on data privacy, protection, and governance</div><div>* are outstanding problem solvers, can understand tradeoffs without becoming stuck in analysis paralysis, can tackle tough challenges with innovative thinking and determination,</div><div>* have excellent communication skills and can effectively convey the results of investigation for productization and convey the results of analysis / investigations at conferences, in papers, and in other media such as blog posts,</div><div>* have expertise in R or Python or can easily leverage their experience with other tools to become experts in those</div><div><br></div><div><b>TECHNOLOGIES YOU'LL USE</b></div><div>* Immuta's Data Platform</div><div>* Jupyter</div><div>* Python, Pandas, PySpark</div><div>* R</div><div>* Hadoop, Spark, SparkSQL</div><div>* Various Distributed Data Processing Frameworks</div><div>* Docker</div><div>* Various Machine Learning Frameworks</div><div>* Various Business Intelligence Tools</div><div><br></div><div><b>WE VALUE</b></div><div>* SQL expertise</div><div>* Proficiency in at least one programming language and associated libraries suited to data science, preferably Python or R,</div><div>* Familiarity with version control software</div><div>* Experience with distributed or high performance computing</div><div>* A strong statistics &amp; math background</div><div>* Experience building predictive models</div><div>* Understanding of privacy and working in regulated environments</div><div><br></div><div>Immuta provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, national origin, marital status, age, disability (including disability due to pregnancy) or genetics, protected veteran status, or any other characteristic protected by law. Immuta complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment.</div><div><br></div><div>NOTICE TO THIRD PARTY RECRUITERS: Immuta does not accept candidates from third party recruiters. All candidates submitted through this website are considered to be submissions by the candidate and no submission will obligate Immuta to pay any third party for the referral or hiring of a candidate.</div>"}