{"job title": "Bioinformatics Scientist", "company": "Incendia Partners", "city state": "– Boston", "rating": "NA", "job description": "Description<div><div>We are a leader in the genomic therapeutics space currently focused clinical phase research and collaborations that are driving impactful industry discoveries. This is an opportunity to flex your bioinformatics, statistics and data science skills to make an impact on the effectiveness and accuracy of next generation products. We are increasing our focus in the areas of cancer/immuno-oncology and has become a rapidly growing area of the organization.\n<br><br>\nDue to this, we are seeking a talented Bioinformatics Scientist to join an enthusiastic and collaborative team. You will be contributing to the analysis and design of novel gene therapy methods. The genomics group combines expertise in computer science, statistics, molecular bio and human genomics.\n<br><br>\n<strong>What the Bioinformatics Scientist will be doing:</strong>\n\n<ul>\n\n\t<li>Focus on gene editing, stem cell biology and oncology projects.</li>\n<li>Partner with biologists to analyze the next-generation sequencing (NGS) data coming from external databases and in-house instruments.</li>\n<li>Analyze sequencing experiments, optimize for throughput and sensitivity,</li>\n<li>Apply transcriptomics methods to gene expression datasets (total RNA, mRNA and single cell mRNA)</li>\n<li>Gain biological insights through pathway and enrichment analyses</li>\n<li>Automate pipelines and build interfaces for wet lab &amp; bioinformatics team collaboration</li>\n<li>Data visualization</li>\n<li>Proactively recommend new approaches the bioinformatics team can take to impact R&amp;D</li> \n</ul>\n<strong>Skills and Qualifications of the Bioinformatics Scientist:</strong>\n\n<ul>\n\n\t<li>PhD in Bioinformatics, Molecular Biology or similar Discipline</li>\n<li>Up to 3 years of professional experience</li>\n<li>Python and R</li>\n<li>Linux and version control tools</li>\n<li>Understanding NGS workflows (DNA, RNA, amplicon-seq) and data formats</li>\n<li>Strong molecular biology knowledge</li>\n<li>Data analysis and applied statistics – model testing, regression, classification and clustering methods.</li>\n</ul>\n\n</div>\n</div>"}