{"job title": "Lead Data Scientist / Analytics Analyst", "company": "Kforce", "city state": "– Costa Mesa, CA", "rating": "3.7", "job description": "<strong>RESPONSIBILITIES:</strong><br><br>Kforce has a client in search of a Lead Data Scientist/Analytics Analyst in Costa Mesa, California (CA).\n<br><br>\nSummary:\n<br>\nThe Data Science Lead will be responsible for managing analytical efforts for critical big data projects for the organization. Projects will be fast paced with extremely tight deadlines. The Data Science lead will be the primary person responsible for ensuring the big data team delivers sound analytical results on time. Project teams will be comprised of cross functional members for business units across the organization and the Data Science Lead will be the liaison between the big data team and the business unit.\n<br><br>\nResponsibilities include:\n\n\n<ul>\n<li> Use data to deliver new insights to business units</li>\n\n<li> Solve unique and challenging problems using sound analytical techniques</li>\n\n<li> Lead deliverables through the entire analytic cycle, including converting business needs into analytical tasks through implementation of newly developed items</li>\n\n<li> Utilize and manage junior analysts</li>\n\n<li> Clearly communicate project progress to various stakeholders, from executives to IS</li>\n</ul>\n<strong>REQUIREMENTS:</strong>\n\n<ul>\n<li> Minimum of a Bachelor's degree in a quantitative field; Master's degree preferred</li>\n\n<li> Experience leading and completing analytical projects</li>\n\n<li> Experience with a variety of data manipulation and analytic tools and languages, (e.g. R, Tableau, SQL, Python)</li>\n\n<li> Understanding of emerging big data technologies</li>\n\n<li> Experience converting analytical results into actionable recommendations</li>\n\n<li> Clear communication of recommendations derived from analysis</li>\n\n<li> Experience leading/mentoring analysts desired</li>\n\n<li> Proficient with MS Office suite</li>\n\n<li> Ability to learn new product lines and business units quickly</li>\n</ul>\n\nKforce is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status."}