{"job title": "Engineer, Data Team", "company": "pymetrics", "city state": "– New York, NY", "rating": "4.9", "job description": "Using neuroscience-based assessments and machine learning algorithms, pymetrics is reinventing the recruiting industry by matching candidates to jobs and companies where they are most likely to succeed. We are leading the charge in an evolving industry, and growing our amazing team to support the mission of using data to unleash one's full potential.\n<br><br>\n<strong>The Role</strong>\n<br><br>\nWe are looking for a skilled Engineer to join the current cross-functional and highly autonomous Data Engineering Team. The ideal candidate will have an interest in creating the infrastructure, systems, and tools that enable world-class data science and machine learning. You will be working with product managers, data scientists, and others to improve the performance of internal systems or replace them entirely with standalone microservices when appropriate. A strong understanding of engineering principles paired with an interest in data science is crucial, as you will be able to contribute to projects across the company and develop the skills that interest you most.\n<br><br>\n<strong>Description &amp; Responsibilities</strong>\n<ul>\n <li>Plan, build, and launch new tools and services to improve data gathering, cleaning and analysis</li> <li>Collaborate with data scientists and machine learning experts to scale the predictive modelling processes</li> <li>Design and document well-structured APIs</li> <li>Launch standalone microservices using Docker, Terraform and Kubernetes</li> <li>Construct ETL pipelines connecting various internal and external data sources</li> <li>Implement data quality control measures</li> <li>Meet with product managers to understand and outline the needs of the company and internal teams</li> <li>Design and launch data products that make everyone at pymetrics more efficient</li> <li>Find and implement the right tools for the job, even if they’re not currently in our stack</li> <li>Generate aggregate reports connecting various segments of the business</li> <li>Analyze and visualize data for internal and client-facing use cases</li>\n</ul>\n<strong>Requirements</strong>\n<ul>\n <li>2+ years writing production-grade Python or similar OO programming languages</li> <li>Experience with, or significant exposure to, the Scientific Python libraries - numpy, scipy, pandas, scikit-learn, etc</li> <li>Comfortable in Linux/ Unix environments</li> <li>At least a working knowledge of JavaScript</li> <li>Experience launching standalone microservices using Docker</li> <li>Experience working with messaging systems (RabbitMQ, Redis, etc)</li> <li>Experience with Airflow or a similar tool (Luigi, Pinball, etc)</li> <li>Strong grasp of engineering best practices</li> <li>Clear interest in data science and machine learning workflows</li> <li>Strong knowledge of data structures, data modeling and schema design</li> <li>Fundamental understanding of best practices with SQL and NoSQL databases</li> <li>You’ve used the debugger at least once (kidding… but not really)</li> <li>You’re known as the person who gets things done</li>\n</ul>\n<strong>Benefits</strong>\n<ul>\n <li>Health care plan (medical, dental &amp; vision)</li> <li>Flexible vacation</li> <li>Family leave (maternity, paternity)</li> <li>401k</li> <li>Stock option plan</li> <li>Commuter benefits</li> <li>Budget for training &amp; development</li> <li>Fun, diverse and intellectually eager coworkers</li> <li>Team happy hours and retreats</li> <li>Dog-friendly workplace</li>\n</ul>"}