{"job title": "Lead Data Scientist/Machine Learning Programmer - FullTime - Basking Ridge, NJ &amp; Philadelphia, PA", "company": "Software Technology Inc", "city state": "– Basking ridge, New Jersey", "rating": "5.0", "job description": "One of our clients has an opening for a <strong>Data Scientist / Data Scientist Lead on FULLTIME for New Jersey OR Philadelphia locations</strong>\n<br><br>\nIf you are interested and looking for opportunities please review the job details given below and share your latest resume with Amrutha at amrutha.duddula@stiorg.com.\n<br><br>\nFor more details please call or shoot an email.\n<br><br>\n<strong>Title: Data Scientist / Data Scientist Lead</strong>\n<br><br>\n<strong>Duration: FULLTIME</strong>\n<br><br>\n<strong>Location: Baskin Ridge/White Station, NJ or Philadelphia, PA</strong>\n<br><br>\n<strong>MUST HAVE:</strong>\n<ul>\n <li><strong>Strong in Python &amp; R</strong></li> <li><strong>Strong in SQL</strong></li> <li><strong>MUST have Lead experience for Data Scientist Lead role</strong></li> <li><strong>Consultants from Insurance background are given preference.</strong></li>\n</ul>\n<strong>JOB ROLE:</strong>\n<br><br>\nClient is someone with a strong background in software programming and statistics who is eager to tackle data challenges with large, complex datasets using machine learning, predictive analytics and the latest open source and cloud technologies.\n<br><br>\n<strong>MUST Key requirements:</strong>\n<br><br>\n<strong> Bachelor's degree in mathematics, statistics, computer science, economics or other quantitative field</strong>\n<br><br>\n<strong> Proficient in SQL and advanced data manipulation techniques</strong>\n<br><br>\n<strong> Knowledge of machine learning techniques such as clustering, decision tree, artificial neural networks, etc.</strong>\n<br><br>\n<strong> Experience using statistical programming with at least one language such as Python, R, Scala</strong>\n<br><br>\n<strong> Experience using machine learning libraries for Python (scikit-learn, pandas, scipy, numpy, etc)</strong>\n<br><br>\n<strong> Experience in text mining using natural language processing, topic modelling, entity extraction, etc.</strong>\n<br><br>\n<strong> Experience developing data visualizations using a tool such as matplotlib, shiny, bokeh, etc.</strong>\n<br><br>\n<strong> Experience in command line and scripting languages</strong>\n<br><br>\n<strong> Familiar working in parallel, distributed systems with technologies such as spark</strong>\n<br><br>\n<strong> Ability to effectively present and explain complex concepts to a non-technical audience</strong>\n<br><br>\n<strong> Actuarial background will be of advantage.</strong>\n<br><br>\n<strong>RESPONSIBILITIES:</strong>\n<br><br>\nCollaborate with stakeholders to carryout exploratory data analysis, design and development of advanced machine learning algorithms to\n<br><br>\nsolving complex business problems that may be loosely defined\n<br><br>\nCollect and analyze data from diverse internal and external source systems and assess the effectiveness and accuracy of the data and data\n<br><br>\ngathering techniques\n<br><br>\nDevelop data models and algorithms to apply to data sets for normalization\n<br><br>\nDevelop A/B testing framework to test model quality\n<br><br>\nCoordinate with different functional teams to implement models and monitor outcomes\n<br><br>\nDevelop processes and tools to monitor and analyze model performance and data accuracy\n<br><br>\nProvide architectural support by building proof of concepts &amp; prototypes\n<br><br>\nStay current with emerging technologies and industry trends\n<br><br>\n<strong>If you have any questions, please feel free to reach me via email or phone.</strong>\n<br><br>\n<strong>Thank you,</strong>\n<br><br>\n<strong>Amrutha Duddula\n<br>\nLead Talent Acquisition Specialist</strong>\n<br><br>\n<strong>Software Technology Inc (STI)</strong>\n<br><br>\n<strong>100 Overlook Center, Suite 200</strong>\n<br><br>\n<strong>Princeton, NJ 08540</strong>\n<br><br>\n<strong>Email:</strong> <strong>amrutha.duddula@stiorg.com</strong>\n<br><br>\n<strong>Phone : 732-664-8807</strong>\n<br><br>\n<strong>www.stiorg.com</strong>\n<br><br>\n<strong>www.linkedin.com/in/amruthad/</strong>"}