{"job title": "SSGA AI Engineer&amp;Data Scientist, VP", "company": "State Street Global Advisors", "city state": "– Boston, MA", "rating": "2.9", "job description": "State Street Global Advisors is looking for research scientists with experience running a data science/machine learning project from inception to completion. The candidate will be part of Technology Architecture team within a Financial Services firm and will help in assessing existing technology capabilities, gathering business technology requirements, applying data science, AI and machine learning, research/prototype for predictive and prescriptive analytics and potential solutions, and documenting the end to end process. This involves working closely with Quantitative Research teams. Technology areas/platforms may include Big Data (i.e., Hadoop, Text Analytics), Business Intelligence.\n<br><br>\nPrimary Job Duties and Responsibilities\n<br><br>\nWork closely with Research teams for the development and execution of a research agenda surrounding some of the core business problems, the data you will be working with will be both Structured and Unstructured. The candidate will be performing the following duties:\n\n\n<ul>\n<li>Understand and define business problems, research analytical solutions, and determine the datato be used in providing needed business insight</li>\n<li>Analyze data using a variety of advanced analytics and machine learning techniques in order to build an initial proof of concept</li>\n<li>Build high-quality prototypes and implement the solution in a scalable framework like Spark</li>\n<li>Train, test, and validate the analytical models to ensure that the model achieves and/or exceeds the expected accuracy levels</li>\n<li>Communicate findings to product owner and a broader audience of technical and non-technical colleagues</li>\n<li>Lead projects, contribute to teams, and mentor junior analysts/data scientists</li>\n<li>Innovate and continue to improve the accuracy of the models using a variety of techniques</li>\n<li>Query, assemble, clean, normalize, and transform datasets in preparation for analysis</li>\n<li>Collaborate with other data scientists to innovate and continuously improve the accuracy of models using a variety of techniques</li>\n<li>Leverage industry best practices; shares the same with team</li>\n</ul>\n\nEducational Qualifications and Preferred Prior Skills/Experience\n\n\n<ul>\n<li>MS or PhD in engineering or a related field (computer science, deep learning, mathematics, Statistics, Physics, Econometrics, Economics) from a reputed University, formally educated in data science.</li>\n<li>Work from our Boston, MA office</li>\n<li>Valid US work authorization; we do not sponsor visas at this time</li>\n<li>Job-related experience, 8 years, OR Master's Degree and job-related experience, 6 years, OR Doctorate Degree and job-related experience, 3 years</li>\n<li>Experience in data modeling, 5yrs</li>\n<li>Solid understanding of applied statistics, such as probability distributions, measures of dispersion and central tendency, hypothesis testing and statistical inferences.</li>\n<li>3 yrs. experience with machine learning algorithms, such as k-NN, Naive Bayes, SVM, Random Forest, Linear Regression, ARIMA, Neural Nets, Deep learning, etc.</li>\n<li>State of the art deep learning (e.g., hyper-parameter tuning, sequence-to-sequence methods, word/entity embedding's, CNNs, etc.)</li>\n<li>Model evaluation; Feature engineering; Big data experience; Familiarity with time series analytics</li>\n<li>Solid grounding in statistics, probability theory, data modeling, machine learning algorithms and software development techniques and languages used to implement analytics solutions</li>\n<li>Must be able to formulate an ML problem, analyze/explore/identify relevant data, apply various methods for feature modelling, and leverage suitable ML algorithms.</li>\n<li>Must be able to explain the logic and reasoning behind the ML models, and identify the best strategy, algorithm or techniques for a particular problem, and/or develops one if none already exist. Should be able to custom design new ensembles of existing algorithms</li>\n<li>Must be thoroughly hands-on and should be able to put theory into practice by writing code, building visualizations and fine-tuning existing algorithms.</li>\n<li>Experience with one or more data science toolkits, such as Azure ML, AWS ML, R, scikit-learn, Matlab, SAS, pyspark, yarn</li>\n<li>Experience with a deep learning framework (e.g., TensorFlow, PyTorch, Keras, CNTK, etc.)</li>\n</ul>"}