{"job title": "Data Scientist/Engineer New Grad (Master's or PhD)", "company": "Visa", "city state": "– Foster City, CA", "rating": "3.3", "job description": "Note: By applying to this position your application is automatically considered for the following locations: Foster City, CA; San Francisco, CA; Palo Alto, CA; Seattle, WA; Ashburn, VA; Bellevue, WA; Austin, TX; Highlands Ranch, CO\n<br><br>\nAs the world's leader in digital payments technology, Visa's mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company's dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.\n<br><br>\nAt Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers.\n<br><br>\nYou're an Individual. We're the team for you. Together, let's transform the way the world pays.\n<br><br>\nAs a Data Scientists/Engineers, you will work with our software developers, database architects, data analysts and data scientists on data initiatives and will ensure optimal data delivery architecture is consistent throughout ongoing projects. You will have an opportunity work on the following:\n\n\n<ul>\n<li>Experience with building stream-processing systems, using solutions such as Storm or Spark-Streaming.</li>\n<li>Gather and process raw data at scale (including writing scripts, calling APIs, write SQL queries, etc.).</li>\n<li>Adhoc project related to data</li>\n</ul>\n\nSpecific assignments will depend on upon your skills sets, interest, location and team needs.\n<br><br>\nData Scientist/Engineer you will be place in one of the Technology Organization teams. Here is a list and brief descriptions:\n\n\n<ul>\n<li>Visa Developer Platform: Provides standards, subject matter expertise and technology to package Visa's core and value-added products into consumable services and capabilities and deliver them reliably and securely to a global community of engaged client, merchant and partner developers.</li>\n<li>Data Platform: We timely deliver secure, high-quality and easy-to-use Visa core data assets as a service, together with reliable and scalable data platform as a service, that enable Visa internal partners to rapidly and efficiently innovate data-driven business products and services to lead the digital payment industry.</li>\n<li>Data Product Development: Visa's position as one of the leading global networks enables us to collect and analyze a rich trove of data. And thisteam is the folks behind the data curtain enabling us to tell our data story through business intelligence and insights, and data-driven product innovation.</li>\n<li>Merchant&amp;Acquirer Processing: The team's strategy is to build deeper merchant and acquirer relationships and increase total merchant value by developing solutions that address complex and emerging merchant and acquirer needs.</li>\n<li>Digital&amp;Mobile Products: promoting the growth of digital commerce and mobilization of payments by digitalizing the physical card, providing multi-channel capabilities, building Provisioning-as-a-Service, re-energizing our Mobile Money platform, expanding reach with the Visa brand to connected devices</li>\n<li>Corporate IT: We enable unconstrained, efficient growth in the business. We silently protect our customers from malicious activity. We are obsessed with customer experience. We are builders. We set the bar for operational excellence.</li>\n<li>Operations + Infrastructure: O and I, as it's nicknamed, provides best-in-class infrastructure services that are secure, scalable, continuously available, and run on software-defined infrastructures. And all of this is done with sustainability in mind -- providing infrastructure that is located in energy efficient data centers that use renewal energy to reduce our carbon footprint.</li>\n</ul>\n\n<strong>Eligibility:</strong>\n\n\n<ul>\n<li>Pursuing a Master's or PhD in Computer Science, Computer Engineering, Information Systems, or a related field</li>\n<li>Students graduating August 2018 - August 2019</li>\n<li>Competitive GPA</li>\n</ul>\n\n<strong>Skill Sets:</strong>\n\n\n<ul>\n<li>Proficiency in Unix/Linux Scripts</li>\n<li>Proficiency in SQL</li>\n<li>Proficiency in Scala and Java</li>\n<li>Knowledge in Hadoop, Hive, Impala/ Hbsas, MapReduce</li>\n<li>Proficiency with Tableu</li>\n<li>Strong ability to collaborate</li>\n<li>Highly driven, inventive and results oriented</li>\n<li>Strong verbal and written interpersonal skills</li>\n</ul>\n\nAll your information will be kept confidential according to EEO guidelines."}