{"job title": "Sr. Data Engineer", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nWould you like to support increasing customer base and the revenue for Amazon Web Services (AWS), a market-leading cloud offering? Would you like to be part of a team focused on increasing awareness and adoption of the AWS Services by analyzing customer's behavior on and outside AWS website? Do you want to empower marketing team to make the data-driven decisions that further establish AWS as the leader in the cloud computing world?<br> <br> AWS Marketing BI team is looking for a highly driven, customer-obsessed Sr. Data Engineer who will support Product Marketing Managers (PMMs) for their data engineering and analytics needs. The candidate will be responsible for (i) creating analytics roadmap for the PMMs team, (ii) performing complex analysis using multiple data sources like service metering, console clickstream, web activities etc. (iii) build new reports to measure the effectiveness of product adoption campaigns, (iv) support and enhance current SMART reports which include Life Cycle, Life Stages, WMR, and PAC (Product Adoption Campaigns) reporting. The candidate will work with the existing BI team and will share the ownership of code, DW components, reports, on-call etc. <br><br> Roles and Responsibilities<br> 1. Design, implement and support data warehouse infrastructure using AWS cloud technologies.<br> 2. Create ETLs to take data from various operational systems like Adobe Target, Adobe Connect, Sales Force and create a unified dimensional or star schema data model for analytics and reporting.<br> 3. Support Technical Program Manager, Research Scientist, and a growing virtual team aimed at analyzing usage data to derive new insights and fuel customer success.<br> 4. Use business intelligence and visualization software (e.g., OBIEE, AWS QuickSight, Tableau etc.) to empower non-technical, internal customers to drive their own analytics and reporting.<br> 5. Develop a deep understanding of AWS’s vast data sources and know exactly how, when, and which data to use to solve particular business problems.<br> 6. Support the development of performance dashboards that encompass key metrics to be reviewed with senior leadership and sales management.<br> 7. Work with product marketing managers to build data sets that answer their specific business questions.<br> 8. Manage numerous requests concurrently and strategically, prioritizing when necessary. <br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Bachelors degree in CS or related technical field and 5+ years of experience in data warehousing.</li><li>8+ years of relevant experience with ETL, data modeling, and business intelligence architectures</li><li>Experience using SQL.</li><li>Understanding of advanced data warehousing concepts and track record of applying these concepts on the job.</li><li>Experience building self-service reporting solutions using business intelligence software (e.g., OBIEE, QuickSight, etc.).</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Experience with Amazon Redshift or other distributed computing technology.</li><li>Experience with scripting languages like Python, Ruby, or Unix shell scripts.</li><li>Exceptional troubleshooting and problem-solving abilities.</li><li>Excellent written and verbal communications skills.</li><li>Demonstrated the ability to work effectively across various internal organizations</li></ul><br> Amazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation.\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}