{"job title": "Data Analyst - MARMC", "company": "AECOM", "city state": "– Norfolk, Virginia", "rating": "3.2", "job description": "<strong> Business Line</strong> Government\n<br><br>\n<strong> Position Title</strong> Data Analyst - MARMC\n<br><br>\nUnited States of America - Virginia\n<br><br>\nNorfolk\n<br><br>\n<strong> Job Summary</strong>\n<br><br>\nAECOM is actively seeking a Data Analyst / Program Management Support Specialist to join our Norfolk, VA team. This position will sit onsite at the Mid-Atlantic Regional Maintenance Center (MARMC) supporting Combat Systems technical codes. The successful candidate will provide program management support and analysis to include routine and non-routine program correspondence, documentation, presentations, briefings and program reports.\n<br><br>\nEssential Responsibilities:\n\n<li>Interface with internal functional teams and external customers for planning, prioritization, and issue resolution of overall activities in the support of and achievement of customer goals.</li>\n  \n<li>Interact and support customers, through the application of specific program knowledge, in the execution of program management tasks.</li>\n  \n<li>Coordinate and maintain program documentation with internal and external teams including plans, schedules, briefings, reports correspondence, contracts/contract modifications, technical instructions/procedures and/or related material.</li>\n  \n<li>Prepare routine and non-routine program correspondence, documentation and reports.</li>\n  \n<li>Create and maintain master files/schedules related to program history, execution and status for the life of the program (inception to disposal).</li>\n  \n<li>Review, evaluate and provide assessments of technical and non-technical program reports; research specific areas and prepare findings.</li>\n  \n<li>Interface with internal and external program participants to coordinate overall activities to support customer goals.</li>\n  \n<li>Perform all other related duties as assigned or requested</li>\n<strong> Minimum Requirements</strong>\n\n<li>Associate degree in Business Administration or related field and at least one (1) year of job-related experience or equivalent.</li>\n  \n<li>GENERAL EXPERIENCE: Minimum 5 years experience within the last 15 years in technical writing</li>\n  \n<li>SPECIALIZED EXPERIENCE: A total of five (5) years experience within the last 10 years. At a minimum, Experience of one (1) year in each of the following is required:</li>\n  \n<li>(1) Experience in technical documentation development including origination of text, layout and outline.</li>\n  \n<li>(2) Knowledge of applicable specifications and standards which govern development and maintenance of technical manuals, test procedures, charts, graphs, and engineering drawings and form and format of various technical data and documentation</li>\n  \n<li>(3) Experience in writing and editing technical documentation, in use of computers, data base programs, work processing programs, and graphics programs</li>\n  \n<li>(4) Experience with and proficiency in desktop publishing</li>\n  \n<li>(5) Desired is knowledge of terminology and abbreviation of DOD and/or DON, and HM&amp;E specific technical manuals, plans, and procedures and other documentation.</li>\n  \n<li>Requires strong Microsoft Office Suite skills, experience.</li>\n  \n<li>Analytical Background, experience</li>\n  \n<li>Knowledge/Experience in Metrics, analysis and database management</li>\n  \n<li>Excellent written and verbal communication skills.</li>\n  \n<li>Minimum five (5) years within the last 15 years general experience with Project Management, Engineering, Financial Analysis, Administrative and Technical efforts the surface ship repair, installation, operation.</li>\n  \n<li>Experience in technical documentation development including origination of text, layout and outline</li>\n  \n<li>Desire knowledge of terminology and abbreviations of DOD and or DON,</li>\n  \n<li>Demonstrate analytic and evaluative work, to include problem resolution in a variety of administrative areas to include investigative and recommended solutions to problems related to program or project processes and procedures.</li>\n  \n<li>Demonstrate a strong background in organization and coordination of various tasks and the skills necessary to de-conflict and resolve schedule conflicts using established guidelines as well as innovative processes to accomplish the work assigned.</li>\n  \n<li>Position may require travel.</li>\n  \n<li><strong> Position requires an active Secret Security Clearance</strong></li>\n<strong> Preferred Qualifications</strong>\n\n<li>Ability to analyze employee training and professional progress reports</li>\n  \n<li>Experience in a professional environment presenting oral or written reports</li>\n<strong> What We Offer</strong>\n<br><br>\nAECOM is a place where you can put your innovative thinking and business skills into high gear and work alongside other highly intelligent and motivated people. It's a place where you can apply your skills to some of the world's most challenging, interesting, and meaningful projects worldwide. It's a place that values the diversity of our areas of practice and our people. It's what makes AECOM a great place to work and grow.\n<br><br>\nAECOM is an equal opportunity employer and Minorities, Females, Veterans, and Disabled persons are encouraged to apply. For further information, please click here to view the EEO Is The Law poster.\n<br><br>\nNOTICE TO THIRD PARTY AGENCIES:\n<br><br>\nPlease note that AECOM does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed Recruitment Fee Agreement, AECOM will not consider or agree to payment of any referral compensation or recruiter fee. In the event a recruiter or agency submits a resume or candidate without a previously signed agreement, AECOM explicitly reserves the right to pursue and hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of AECOM.\n<br><br>\n<strong> Job Category</strong> Administrative Support / Secretarial\n<br><br>\n<strong> Business Group</strong> Management Services Group (MS)\n<br><br>\n<strong> Country</strong> United States of America\n<br><br>\n<strong> Position Status</strong> Full-Time\n<br><br>\n<strong> Requisition/Vacancy No.</strong> 193457BR\n<br><br>\nQualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status."}