{"job title": "Business Intelligence Analyst", "company": "Analogic", "city state": "– Peabody, MA", "rating": "2.9", "job description": "The Business Intelligence Analyst provides reporting, analytics and insights to Analogic’s global ultrasound business by leveraging Analogic’s CRM system and business intelligence application tool. This position makes an impact across the organization by providing business stakeholders with ad-hoc and recurring reports, as well as by providing general support for Analogic’s CRM system and business intelligence application tool. This position will assist with the technical and development aspects of these tools based upon reporting/management needs. This role works in coordination with IT to continually improve reporting capabilities within CRM and the BI application tool. Other key responsibilities include assisting with the development of processes and projects to optimize sales productivity and performance through the CRM system/ BI tool, including reporting and analysis of sales related data. Assists with the development of standardized tools, methodologies and business processes aimed at improving operational efficiency.\n<br><br>\nBachelor’s Degree with 0 to 3 years of experience\n<br><br>\nStrong analysis skills\n<br><br>\nProblem-solving skills\n<br><br>\nExcellent attention to detail\n<br><br>\nProven organizational skills\n<br><br>\nAble to prioritize and multi-task and see projects/assignments to completion\n<br><br>\nHighly autonomous\n<br><br>\nExcellent written and verbal communication\n<br><br>\nAdvanced skill in Microsoft Office applications (Excel, PowerPoint, and Word)\n<br><br>\nExperience with Excel Pivot Tables\n<br><br>\nAbility to capture and document business and reporting requirements from multiple sources\n<br><br>\nWorking knowledge of SQL a plus\n<br><br>\nPrevious experience with SAP and CRM a plus\n<ul>\n<li>Provide customized reports to upper management to drive informed business decisions by leveraging CRM and the BI application tool.</li><li>Provide on-going training to sales, service, marketing and other personnel on the business intelligence tools, through creation and maintenance of technical documentation and user training manuals</li><li>Diagnose needs of Upper Management, Product Management, Sales, Finance, Service, Quality, IT/MIS and other departments.Proactive development of reports to fit needs</li><li>Collaborate as a member of CRM team, to manage updates, product rollout, and other high need business initiatives within CRM.</li>\n</ul>\nOther responsibilities include:\n<ul>\n<li>Drive analytic reports to keep in line with Key Performance Indicators including creating sales/market reports; Collaborate with finance, achieve business goals</li><li>Improve data quality within CRM system/BI tool.</li>\n</ul>\n<br><br>\n<em></em>\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}