{"job title": "Sr Business Intelligence Analyst", "company": "Bank of the West", "city state": "– San Francisco, CA", "rating": "2.8", "job description": "<p>Responsible for providing highly complex analytical and project oversight by conducting financial analyses, assisting with internal strategy and ad-hoc projects, and performing competitor and industry benchmarking analysis for a designated Business Line.<br>Essential Job Functions<br>Manages data gathering efforts with internal and external business partners. Builds complex financial models related to current and future business, product and/or customer economics.<br>Conducts competitive, industry and bank research.<br>Participates in the management of complex projects.<br>Interprets complex analysis and develops presentations for senior management.<br>Partners with members of other groups and functions within the bank to drive results.<br>Other Job Duties<br>Performs other duties as assigned.<br>Qualifications<br>Required Experience<br>Requires deep knowledge of job area typically obtained through advanced education combined with experience.<br>Typically viewed as a specialist within discipline.<br>May have broad knowledge of project management.<br>Requires 7 years minimum prior relevant experience.<br>At least 3 years’ relevant experience:<br>Able to understand what the data is saying, and visually and orally communicate insights to nontechnical business partners<br>Experience using R and Python<br>Financial modelling experience<br>Customer life-cycle analytics experience<br>Expert level SQL skills (preferably Oracle) <br>Nice-to-Have experience:<br> Experience with Hadoop and Big Data<br>Experience creating systems development lifecycle deliverables (such as business requirements documents, user acceptance test plans and scripts)<br>Experience using clickstream data<br>Education<br>Bachelors Degree in Economics, Math, Accounting, or applicable field<br>Skills<br>Excellent financial modeling skills<br>Required: Strong data collection, research and quantitative skills<br>Knowledge of the banking and financial services industries<br>Preferred: Knowledge of accounting and financial concepts, experience with bank accounting and financial statement analysis<br>Required: Ability to distill complex concepts into simple to understand information<br>Required: Ability to develop relationships with multiple stakeholders throughout an organization<br>Exceptional MS Excel, PowerPoint and Word skills; experience with other data analysis tools a plus<br>Required: Ability to be self-motivated, with an ability to work independently in a relatively unstructured environment.<br>Required: Strong written and verbal communication skills. Will be responsible for discerning client’s explicit and implicit needs. Will be responsible for writing standard systems development lifecycle business deliverables.<br>Problem solving skills. Examples: Must be able to understand a business problem from the client’s perspective and propose potential solutions. The ability to visualize how existing technology solutions could be changed / leveraged to meet future needs would be a plus.<br>Required: Attention to detail, as well as the ability to see the “big picture”<br>Required: Strong organizational skills<br>Required: Flexibility/ Adaptability</p>"}