{"job title": "Sr. Data Engineer", "company": "Envision", "city state": "– Saint Louis, MO", "rating": "3.4", "job description": "<strong> Sr. Data Engineer - St. Louis, MO</strong>\n<br><br>\n<strong>Description:</strong>\n<br><br>\nDesign, develop and implement ETL transformations using Informatica power center and related products. Develop ETL related scripts, database procedures and other services as needed for implementing the best practices of ETL implementation. Provide SME (subject matter expert) in ETL technology implementation.\n<br><br>\nDesign coded database objects, including stored procedures, Oracle packages, functions, views, and PL/SQL scripts used for data migration, fixes, transformations, and test data generation.\n<br><br>\nCreate, review, and deliver release documentation, reports, procedures, configuration documents and other required artifacts for updates to extraction, transformation, and load packages in order to: populate databases from different sources; integrate, consolidate and cleanse data; and, structure data for use in analytics applications.\n<br><br>\nPromptly provide written status reports as requested by company on activities to achieve successful updates to company's databases, data engineering platforms, and data integration platforms according to the applicable schedule.\n<br><br>\nAs requested, perform problem diagnosis, identification and resolution for complex databases, data engineering platforms, and data integration platforms developed in Oracle, Informatica, and scripting language. Provide reports to company on activities to address problems.\n<br><br>\nDevelop, test, deploy and document code based on the company's design specifications. Implement schema changes and maintain data architecture standards across databases.\n<br><br>\nPrepare, test and maintain database release code to ensure optimized performance of databases, data engineering platforms, and data integration platforms throughout the software development life cycle.\n<br><br>\nParticipate in peer code reviews.\n<br><br>\n<strong>Qualifications:</strong>\n<br><br>\nBachelor's degree with major or specialized courses in Information Technology or commensurate experience.\n<br><br>\n3+ years' related experience in performing listed activities.\n<br><br>\nExperience with Informatica PowerCenter.\n<br><br>\nExperience designing and delivering cross functional custom reporting solutions.\n<br><br>\nExperience with relational SQL and NoSQL databases, and Oracle.\n<br><br>\nDemonstrated ability to perform self-directed work while supporting multiple teams, systems and products.\n<br><br>\nDemonstrated ability to communicate effectively.\n<br><br>\nAvailability to travel in connection with providing services.<br><br>Associated topics: data analyst, data analytic, data architect, data integration, data manager, data management, data quality, data warehouse, database, sql"}