{"job title": "Data Engineer - Professional Services", "company": "Forcepoint", "city state": "– New York City, NY", "rating": "3.0", "job description": "Forcepoint is transforming cybersecurity by focusing on what matters most: understanding people's intent as they interact with critical data and intellectual property wherever it resides. Our uncompromising systems enable companies to empower employees with unobstructed access to confidential data while protecting intellectual property and simplifying compliance. Based in Austin, Texas, Forcepoint supports more than 20,000 organizations worldwide. For more about Forcepoint, visit www.Forcepoint.com and follow us on Twitter at @ForcepointSec.\n<br><br>\nForcepoint is seeking a qualified full-time Professional Services Data Engineer working on client site to facilitate configuration, data integration and training of our commercial-off-the-shelf regulatory surveillance and cybersecurity User and Entity Behavioral Analytics (UEBA) products. This individual must be highly motivated, have great interpersonal skills, and be technically proficient.\n<br><br>\nIn this role you will be joining a small but rapidly growing team in New York. Your role will include working directly with customers to understand their goals, help shape requirements, own the design and implementation of analytic strategies, and develop robust ETL pipelines to support these analytic strategies. Additionally, you will interface with the broader Forcepoint Professional Services team to drive analytic capabilities of the platform, and overall facilitate an efficient, effective, and robust deployment of the Forcepoint UEBA platform to characterize and detect insider threats and compliance violations.\n<br><br>\nThe successful candidate will receive specialized training to support our technologies and is expected to become proficient in all aspects of complex software solution deployment. Initially, the focus will be working with one of our major multi-national clients to build out a new deployment of UEBA. This position requires 5-10% travel domestic and international as needed to meet customer and project requirements.\n<br><br>\nWork Location: New York City\n<br><br>\nMust have U.S.Citizenship or Permanent resident green card holder status\n<br><br>\n<strong>Responsibilities Include:</strong>\n\n\n<ul>\n<li>Provide exceptional implementation services to new customers, including supporting data ingestion, analytic configuration, customer training, and troubleshooting</li>\n<li>Work directly with customers to design and implement robust analytic strategies in the Forcepoint UEBA platform to address use cases in cyber security and regulatory surveillance</li>\n<li>Partner with the UEBA Delivery team to integrate with and automate ingest for a wide variety of data sources (databases, remote servers, flat files, APIs, etc.) to ensure data is quickly and reliably available in all contexts</li>\n<li>Prepare technical documentation to include as-built design, requirements, and Standard Operating Procedures</li>\n<li>Interface with the broader Forcepoint data science team about analytic opportunities and accomplishments in the field to drive the evolution of the Forcepoint UEBA platform</li>\n<li>Provide technical briefings to customer leadership and Forcepoint corporate leadership as required</li>\n<li>Coordinate tasks and activities with various groups within Forcepoint, the government or partners</li>\n</ul>\n\n<strong>Required Skills &amp; Experience:</strong>\n\n\n<ul>\n<li>Experience writing modular and reusable code in Python</li>\n<li>Facility in scripting and troubleshooting application errors in Linux/Unix environments</li>\n<li>Experience with the ETL: cleaning, transforming, and ingesting large datasets</li>\n<li>Experience with full Software Development Life Cycle (SLDC) from requirements through to testing and deployment</li>\n<li>Possess strong analytical, verbal, and technical written communication skills</li>\n<li>Must be able to coordinate collaboratively across traditional engineering disciplines and effectively engage with customers</li>\n<li>Must be eligible to work in the UK</li>\n</ul>\n\n<strong>Desired Skills:</strong>\n\n\n<ul>\n<li>Prior technical experience in finance and/or information security organisations</li>\n<li>Experience with Apache NiFi and high volume ETL tasks</li>\n<li>Integration experience with data stores such as Elasticsearch, PostgreSQL, Splunk, ArcSight, Cloudera, etc.</li>\n</ul>\n\n<strong>Required Education:</strong>\n\n\n<ul>\n<li>Degree in a technical field such as Computer Science or equivalent work experience<br><br>SDL2017</li>\n\n</ul>"}