{"job title": "Analytics Consultant - Advanced Sales Illustrations", "company": "MassMutual", "city state": "– Springfield, MA", "rating": "3.5", "job description": "Since 1851, MassMutuals commitment has always been to help people protect their families, support their communities, and help one another. This is why we want to inspire people to Live Mutual. We at MassMutual value diversity and inclusion. Were people helping people.\n<br><br>\nA career with us means you will work alongside exceptional people and be empowered to reach your professional and personal goals. Our employees are the foundation of what makes MassMutual a strong, stable and ethical business. We seek and value unique and varied perspectives and experiences because we believe we are stronger when all voices are heard. We invite you to bring your bright, innovative ideas to MassMutual as we continue to help millions of Americans rely on each other.\n<br><br>\nTogether, were stronger.<br><br><strong><u>Description</u></strong><br><br>Responsibilities:\n<ul>\n<li>Provide producers with counsel on the strategy and use of high-level insurance products/services.</li><li>Develop customized sensitivity analyses/illustrations to be used in key client presentations.</li><li>Respond to the most complex inquiries from agents and or clients.</li><li>Provide guidance to more junior staff</li><li>Escalate issues to appropriate resources when required.</li>\n</ul>\nBasic Qualifications:\n<ul>\n<li>Self-motivated with the ability to maintain ownership and responsibility for the disposition of delegated assignments.</li><li>Experience working with field associates and general agents.</li><li>Strong life product knowledge</li><li>Strong illustration design experience</li><li>Understand complex advanced sales concepts e.g. Deferral and Bonus plans; provide creative use of these solutions for specific sales situations.</li><li>Demonstrated knowledge of Excel spreadsheets and financial concepts (e.g. Net Present Value, Internal Rates of Return).</li><li>Strong writing skills; will work with ASCS team in developing training materials (e.g. PowerPoints) and articles for WebEx sessions, MassMutual Academy and other field opportunities.</li><li>Working knowledge of PlanLab and echoWealth</li><li>Ability to work in the US without requiring sponsorship now or in the future.</li><li>College degree</li>\n</ul>\nPreferred Qualifications:\n<ul>\n<li>5+ yrs. in related analytical field and Client Facing Experience</li><li>Strong written and oral communication skill</li><li>Strong analytical and problem-solving abilities</li><li>Able to prioritize and execute tasks in a high-pressure environment</li><li>Experience working in a team-oriented, collaborative environment</li><li>Strong interpersonal and relationship building skills</li><li>CLU, ChFC, and CFP professional designations desirable</li>\n</ul>\nRanked No. 77 in the annual FORTUNE ® 500 Ranking (FORTUNE ® Magazine, June 2017) and recognized as a Worlds Most Ethical Company by Ethisphere, MassMutual is guided by a single purpose: We help people secure their future and protect the ones they love. As a company owned by our policyowners, we are defined by mutuality and our vision to put customers first. Its more than our company structure its our way of life. We are a company of people protecting people. Our company exists because people are willing to share risk and resources, and rely on each other when it counts. At MassMutual, we Live Mutual.\n<br><br>\n<strong>CORE VALUES</strong>\n<br><br>\n<strong>Focus on the Customer:</strong> We understand our customers well and look for every opportunity to deliver an experience that is clear, easy, personal, human, empowering and trustworthy.\n<br><br>\n<strong>Act with Integrity:</strong> We deliver on our promises by being open, honest and humble and by adhering to the letter and spirit of applicable laws, rules, regulations and company policies.\n<br><br>\n<strong>Value People:</strong> We respect and learn from each others diverse backgrounds, experiences and ideas. We engage and develop people to their greatest potential.\n<br><br>\n<strong>Work Collaboratively:</strong> We work together to achieve results by actively listening, seeking, understanding and creating solutions as a unified team driving toward one company, one culture, one brand.\n<br><br>\n<strong>Achieve Results:</strong> We focus on winning by exceeding expectations and getting better everyone, every day.\n<br><br>\nFor more information, visit www.massmutual.com or find us on Facebook, Twitter, LinkedIn, YouTube, Google+, Instagram and Pinterest.\n<br><br>\nMassMutual is an Equal Employment Opportunity employer Minority/Female/Sexual Orientation/Gender Identity/Individual with Disability/Protected Veteran. We welcome all persons to apply."}