{"job title": "Business Data Analyst", "company": "NTT Data Inc", "city state": "– Charlotte, North Carolina", "rating": "2.6", "job description": "Date: Aug 30, 2018\n<br>\nLocation: Charlotte, NC, US\n<br>\nCompany: NTT DATA Services\n<br><br>\nReq ID: 29731\n<br><br>\nAt NTT DATA Services, we know that with the right people on board, anything is possible. The quality, integrity, and commitment of our employees are key factors in our company's growth, market presence and our ability to help our clients stay a step ahead of the competition. By hiring the best people and helping them grow both professionally and personally, we ensure a bright future for NTT DATA Services and for the people who work here.\n<br><br>\nNTT DATA Services currently seeks a Business Data Analyst to join our team in Charlotte, North Carolina (US-NC), United States (US).\n<br><br>\n(To qualify must be a US Citizen or Permanent Resident and located in Charlotte, NC)\n<br><br>\n<strong>POSITION SUMMARY</strong>\n<br>\nThe Business Data Analyst uses business and technology knowledge to serve as a liaison between business initiatives and IT in order to determine the correct course of action to achieve desired results. This person collaborates with business and technical resources to determine business information and application needs and assists clients in the analysis of a proposed idea and performs the review, determines the systems potential, conducts documentation, testing (as needed) and follow through.\n<br><br>\n<strong>RESPONSIBILITIES</strong>\n\n\n<ul>\n<li>Analysis and Solution Definition</li>\n<li>Analyzes business requirements to understand the business needs and to determine how the application can best function to fulfill those needs.</li>\n<li>Identifies cross impact to other systems.</li>\n<li>Performs data analysis and provides documentation of results</li>\n<li>Proposes solutions to problems and considers timeliness, effectiveness, and practicality in addressing client needs.</li>\n</ul>\n\nProject Execution\n\n\n<ul>\n<li>Adheres to and facilitates project standards.</li>\n<li>Creates, consolidates and presents documents relating to use cases, functional requirements, data mapping, privilege provisioning and authorization models, maintaining them throughout the project, including traceability back to requirements.</li>\n<li>Provides a business or process perspective during design reviews.</li>\n<li>Establishes responsible deadlines and personal work plans and manages time effectively.</li>\n<li>Participates in change control process throughout the project.</li>\n<li>Contributes to continuous improvement and proactively supports knowledge sharing within the team and across Technology.</li>\n<li>Proactively carries out project support /administrative functions.</li>\n</ul>\n\nCommunication &amp; Teamwork\n\n\n<ul>\n<li>Listens to others and accepts input from team members.</li>\n<li>Clearly articulates ideas and thoughts verbally.</li>\n<li>Accurately prepares written business correspondence that is coherent, grammatically correct, effective and professional.</li>\n<li>Demonstrates flexibility in day-to-day work.</li>\n<li>Establishes harmonious working relationships with team members; appreciates each team member's contributions and values each individual member.</li>\n<li>Values internal and external clients and responds to their needs as they arise.</li>\n<li>Establishes effective working relationship with clients; uses good judgment in what and how to communicate with clients.</li>\n</ul>\n\n<strong>SKILLS REQUIRED</strong>\n\n\n<ul>\n<li>Working knowledge of VBA</li>\n<li>Must have strong knowledge of MS Office Suite - specifically Excel and Access</li>\n</ul>\n\n<strong>MINIMUM QUALIFICATIONS</strong>\n\n\n<ul>\n<li>Bachelor's degree</li>\n<li>3+ years of experience as a Business Analyst working in a Financial Services environment</li>\n</ul>\n\n<strong>#LI-NAM</strong>\n<br><br>\nThis position is only available to those interested in direct staff employment opportunities with NTT DATA, Inc. or its subsidiaries. Please note, 1099 or corp-2-corp contractors or the equivalent will NOT be considered. We offer a full comprehensive benefits package that starts from your first day of employment.\n<br><br>\nAbout NTT DATA Services\n<br><br>\nNTT DATA Services partners with clients to navigate and simplify the modern complexities of business and technology, delivering the insights, solutions and outcomes that matter most. We deliver tangible business results by combining deep industry expertise with applied innovations in digital, cloud and automation across a comprehensive portfolio of consulting, applications, infrastructure and business process services.\n<br><br>\nNTT DATA Services, headquartered in Plano, Texas, is a division of NTT DATA Corporation, a top 10 global business and IT services provider with 118,000+ professionals in more than 50 countries, and NTT Group, a partner to 88 percent of the Fortune 100. Visit ******************* to learn more.\n<br><br>\nNTT DATA, Inc. (the 'Company') is an equal opportunity employer and makes employment decisions on the basis of merit and business needs. The Company will consider all qualified applicants for employment without regard to race, color, religious creed, citizenship, national origin, ancestry, age, sex, sexual orientation, genetic information, physical or mental disability, veteran or marital status, or any other class protected by law. To comply with applicable laws ensuring equal employment opportunities to qualified individuals with a disability, the Company will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant or an employee unless undue hardship to the Company would result.\n<br><br>\nNearest Major Market: Charlotte\n<br>\nJob Segment: Database, Consulting, Business Analyst, Technology\n<br><br>\n<strong>*</strong>"}