{"job title": "Offshore Data Analyst", "company": "Oceaneering International", "city state": "– Lafayette, LA", "rating": "3.0", "job description": "Oceaneering is a global provider of engineered services and products, primarily to the offshore energy industry. We develop products and services for use throughout the lifecycle of an offshore oilfield, from drilling to decommissioning. We operate the world's premier fleet of work class ROVs. Additionally, we are a leader in offshore oilfield maintenance services, umbilicals, subsea hardware, and tooling. We also use applied technology expertise to serve the defense, entertainment, material handling, aerospace, science, and renewable energy industries.\n<br><br>\n<strong>Position Summary</strong>\n<br><br>\nData Analyst primary duty will be as a key AUV Data Analyst\n<br><br>\nThe position of Data Analyst/System Administraor exists for the purpose of carrying out required tasks in the field for AUV survey projects, as requested by the AUV Offshore Manager for AUV survey data collection, processing and quality control.In addition this position shall make sure all tasks are performed efficiently, responsibly and in accordance with safe work procedures.\n<br><br>\nDuties&amp;Responsibilities\n<br><br>\n<strong>ESSENTIAL</strong>\n\n\n<ul>\n<li>Mobilizing survey gear and vessel networks.</li>\n<li>Maintain AUV processing logs.</li>\n<li>Coordinating and communicating with AUV Offshore Manager for planning of survey operations and data quality and processing.</li>\n<li>Working with AUV Offshore Manager to ensure AUV computer equipment is setup and maintaned.</li>\n<li>Managing and carrying out specific job tasks as requested by AUV Offshore Manager</li>\n<li>Responsible for care, maintenance and inventory of company equipment, specifically AUV lab equipment and consumables such as data storage media.</li>\n<li>Responsible for daily communication and QC of data quality.</li>\n<li>Comply with company safety rules and training, conduct operations safely and report any unsafe condition or practices immediately to his/her supervisor</li>\n<li>Assist new and fellow employees in performing their work in accordance with safe work procedures</li>\n<li>Participate in daily Job Safety Analysis (JSEA), Safety Toolbox Meetings, etc.</li>\n<li>Participate in AUV Launch and Recovery operations</li>\n<li>Participate in Geophysical survey operations</li>\n<li>Understanding of AUV Operation and limitations</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\n<strong>REQUIRED</strong>\n\n\n<ul>\n<li>Two or more year degree or 3 years of sytem administration experience.</li>\n<li>Must have valid driver's license and suitable driving record that is able to meet company driver requirements</li>\n</ul>\n\n<strong>DESIRED</strong>\n\n\n<ul>\n<li>Four year degree or higher</li>\n<li>Proficient with AUV and other survey software</li>\n<li>Current security clearance or ability to obtain security clearance</li>\n</ul>\n\nWorking Conditions\n<br><br>\nThis position is considered OFFSHORE which is characterized as follows.\n\n\n<ul>\n<li>Outdoors and indoors, day and night, as well as over/near water.</li>\n<li>Requires working on or near moving and vibrating equipment.</li>\n<li>Frequently the humidity is above 90%, noise is over 85db and the light is intense/glare.</li>\n<li>Potential exposure to open fire/flames/sparks.</li>\n<li>Constant exposure to airborne dust, fumes and gases.</li>\n<li>Work surface is stable, height is elevated.</li>\n</ul>\n\nPhysical Activity/Requirements\n<br><br>\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<br><br>\nThis position is considered HEAVY work.\n<br><br>\n<strong>OCCASIONAL</strong>\n\n\n<ul>\n<li>Lift 50-100 pounds</li>\n<li>Sit, twist, crawl, climb stairs/ ladders, and use repetitive movements of the arms and hands.</li>\n<li>Operate small water vessel or ATV</li>\n</ul>\n\n<strong>FREQUENT</strong>\n\n\n<ul>\n<li>Lift 25-50 pounds</li>\n<li>Wear PPE for head, hands</li>\n</ul>\n\nBalance, stoop, kneel, squat, crouch, reach with hands and arms, and lift/carry objects, handle or feel.\n\n\n<ul>\n<li>Differentiate between colors</li>\n<li>Operate a motor vehicle</li>\n</ul>\n\n<strong>CONSTANT</strong>\n\n\n<ul>\n<li>Lift 10-20 pounds</li>\n</ul>\n\nStanding and walking\n\n\n<ul>\n<li>Wear PPE for body, vision, and hearing protection</li>\n<li>Close vision ability and ability to adjust focus</li>\n<li>Hearing all ranges</li>\n<li>Wear steel toed shoes/ boots</li>\n</ul>\n\nEqual Opportunity Employer\n<br><br>\nAll qualified candidates will receive consideration for all positions without regard to race, color, age, religion, sex (including pregnancy), sexual orientation, gender identity, national origin, veteran status, disability, genetic information, or other non-merit factors."}