{"job title": "Executive Director, Data Engineering &amp; Operations", "company": "Providence Health &amp; Services", "city state": "– Renton, Washington", "rating": "3.4", "job description": "<strong> Description:</strong>\n<br><br>\n<strong> Providence is calling an Executive Director, Data Engineering and Operations to Providence Health &amp; Services in either Renton, WA or Portland, OR</strong>\n<br><br>\nWe are seeking an Executive Director, Data Engineering and Operations to be accountable for the iterative design, build and deployment of analytic data solutions for the organization. Working in conjunction with partners within Information Services, technology vendors, and solution providers, this role will blend proven information management processes with emerging technologies and iterative deployment processes to drive the data as a service model. Sets the standard practices and DevOps model for data solutions. Ensures that data products meet the requirements for service quality, usability, scalability, and time to market. Actively manages the portfolio of products to maximize value for internal customers. Plays a lead role in data product design for the wider marketplace, with an eye towards revenue generation. Applies an engineering mindset to complex data and analytic problemsgoes beyond the traditional business intelligence playbook. Builds and maintains a high functioning engineering team with operational capabilities, including 24x7 support.\n<br><br>\n<strong> Essential Job Functions:</strong>\n\n<li>Drive the information management data product approach, from formulation through engineering to operations, leveraging big data and data warehousing, cloud computing, enterprise search and semantics, data movement/integration, business intelligence, master data management, metadata, data quality and configured EMR reporting assets.</li>\n  \n<li>Advance the data architecture, SDLC, and iterative development programs.</li>\n  \n<li>Create, build, sustain and improve high performing technical teams.</li>\n  \n<li>Be a knowledgeable and trusted partner to business, clinical and operational leaders.</li>\n  \n<li>Be a champion for a data-driven decision-making culture.</li>\n  \n<li>Drive the information management platform portfolio towards a revenue-generating service provider model.</li>\n  \n<li>Ensure stability, resiliency, and availability of the portfolio. Partner with Enterprise Risk, Privacy and Legal to maintain appropriate data security.</li>\n  \n<li>Implement and drive data product optimization strategies, new systems designs and other ad-hoc projects.</li>\n  \n<li>Effectively execute business strategies by aligning human resource strategies with business needs, by recruiting and developing a high-performing team, and by developing a climate which builds employee commitment and reinforces high-performance standards.</li>\n  \n<li>Maintain an operating culture which is disciplined, accountable, consistent, cost-effective, and collaborative, and ensures that patient well-being and safety are paramount.</li>\n<strong> Qualifications:</strong>\n<br><br>\n<strong> Required qualifications for this position include:</strong>\n\n<li>Bachelors degree in Computer Science or related field.</li>\n  \n<li>More than 10 years in technology roles.</li>\n  \n<li>More than 10 years of healthcare industry experience in positions of increasing responsibility.</li>\n  \n<li>9 years experience of leading and/or supervising staff.</li>\n<strong> Preferred qualifications for this position include:</strong>\n<li> Masters Degree.</li>\n<strong> About the department you will serve.</strong>\n<br><br>\nProvidence Strategic and Management Services provides a variety of functional and system support services for all eight regions of Providence Health &amp; Services from Alaska to California. We are focused on supporting our Mission by delivering a robust foundation of services and sharing of specialized expertise.\n<br><br>\n<strong> We offer a full comprehensive range of benefits - see our website for details</strong>\n<br><br>\nhttp://www.providenceiscalling.jobs/rewards-benefits/\n<br><br>\n<strong> Our Mission</strong>\n<br><br>\nAs people of Providence, we reveal God's love for all, especially the poor and vulnerable, through our compassionate service.\n<br><br>\n<strong> About Us</strong>\n<br><br>\nProvidence Health &amp; Services is the third largest not-for-profit health system in the United States. Providence employs more than 82,000 caregivers (employees) across a five-state area; AK, WA, MT, OR, and CA. Our facilities include 34 hospitals, 600 physician clinics, senior services, supportive housing and other health and educational services. Providence is proud to be an Equal Opportunity Employer. Providence does not discriminate on the basis of race, color, gender, disability, veteran, military status, religion, age, creed, national origin, sexual identity or expression, sexual orientation, marital status, genetic information, or any other basis prohibited by local, state, or federal law.\n<br><br>\n<strong> Schedule:</strong> Full-time\n<br><br>\n<strong> Shift:</strong> Day\n<br><br>\n<strong> Job Category:</strong> Director / Executive\n<br><br>\n<strong> Location:</strong> Washington-Renton\n<br><br>\n<strong> Other Location(s):</strong> Oregon-Portland\n<br><br>\n<strong> Req ID:</strong> 177594"}