{"job title": "Specialist, Strategic Planning (Data Analyst)", "company": "The Bank of New York Mellon", "city state": "– Pittsburgh, PA", "rating": "3.2", "job description": "The Specialist, Strategic Planning (Data Analyst) is responsiblefor working in conjunction with business units, support groups and technologyteams to define and build out the data repository and data architecture forBNYM. S/he provides ongoing support to strategic and business planning teamsfor the data repository and the data architecture, maintains data governance,and executes his/her work according to the defined data policies andprocedures. As a part of this role, the Data Analyst will work closely withbusiness, finance and technology teams to define data requirements, datastores, and business and data rules. S/he is accountable for ensuring theimplementation of automation and business rules functionality and datagovernance procedures in support of the finance process model. S/he supportsFinance and technology teams with the maintenance of business rules logic,business as usual (BAU) changes and enforcement of data governance. S/he coordinatesand builds consensus across multiple global internal and external business andtechnology groups and process owners. The Data Analyst supports the initialplanning and scope definition through to process design, requirementsdevelopment, testing, training and implementing of the solution for his/herfunctional area.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nBachelors degree in business or technicalrelated field, such as Computer Science or Information Management, (orequivalent work experience), or equivalent workexperience required 3-5 years of related experience preferred. Experience inthe securities or financial services industry preferred. Strongdata analysis skills and strong oral and written communication skills inEnglish are required. Preferred Qualifications: At least 3 years' experiencewithin finance services operations with an advanced solid understanding of theassigned end to end process or processes in the business unit (e.g. Record toReport, Inform to Manage, Source to Pay) and the associated sub processes andexperience working in a complex global services environment. Knowledge of MAQis a big plus. Experience using best-of-class methods for methods for dataarchitecture design and execution.\n<br><br>\nBNY Mellon is an Equal Employment Opportunity/Affirmative Action Employer.\n<br><br>\nMinorities/Females/Individuals With Disabilities/Protected Veterans.\n<br><br>\nPrimary Location: United States-Pennsylvania-Pittsburgh\n<br><br>\nInternal Jobcode: 70197\n<br><br>\nJob: Finance/Accounting\n<br><br>\nOrganization: Finance-HR06599\n<br><br>\nRequisition Number: 1813715"}