{"job title": "HR Data Analyst", "company": "Thyssenkrupp", "city state": "– Southfield, MI", "rating": "3.4", "job description": "HR Data Analyst\n<br><br>\nSouthfield,Michigan,United Statesthyssenkrupp Materials NA Inc.\n<br><br>\nLocationSouthfieldPeriodPermanentContractFull TimeStatusLaufende RekrutierungJob IDUS_901369_MX-MAT-USA00139\n<br><br>\nYour responsibilitiesSummary of Position:This position is responsible for internal human resource data management for the US and Canada. This individual will be responsible for the accuracy and completeness of HR system records as well as supporting the HR operations team in projects related to process improvement. This position reports to the HR Operations Manager. Key Accountabilities:\n\n\n<ul>\n<li>Maintain organization, position, and job structure master data in HR system.</li>\n<li>Audit and preparation of weekly time and attendance file for payroll.</li>\n<li>Assist in maintenance of employee master data, time data, and auditing for accuracy.</li>\n<li>Monthly and quarterly reporting, both internal and business HR KPIs</li>\n<li>Document current data processes and assist in creating forms and structure to ensure compliance with wage and hour and data protection laws.</li>\n<li>Collaborate with the leadership team to identify areas for process improvement.</li>\n<li>Assist in identifying system requirements and testing new solutions.</li>\n<li>Provide support to HR users.</li>\n<li>Participate in special projects as needed.</li>\n<li>Meets TKMNA Employee Attributes/Competencies</li>\n</ul>\n\nThe above is intended to describe the general content of and requirement for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities or requirements.\n<br><br>\nYour profileRequired Knowledge, Skills and Abilities\n\n\n<ul>\n<li>Ability to maintain confidentiality at all times.</li>\n<li>Strong attention to detail, process orientation, and quality of work.</li>\n<li>Ability to communicate clearly and concisely, orally and in writing.</li>\n<li>Ability to establish and maintain effective working relationships with people at all levels within and outside the organization.</li>\n</ul>\n\n<strong>Minimum Requirements:</strong>\n\n\n<ul>\n<li>Bachelor's degree, preferably in Business or Human Resources</li>\n<li>Solid experience working with Microsoft Excel and other reporting tools</li>\n<li>Prior responsibility for managing employee data in HR and Time systems</li>\n<li>Strong working knowledge of Federal and state wage and hour laws, and their application in a time and attendance system, especially in California</li>\n<li>Demonstrated time management, organizational and customer service skills.</li>\n<li>Interest in or exposure to compensation is a plus.</li>\n</ul>\n\nOur offer to you\n<br><br>\nSafety at work&amp;Healthcare\n<br><br>\nSafety at work&amp;Healthcare: Highest standards in occupational safety and health, comprehensive programs and measures for safety at work and preventive healthcare with comprehensive coverage and flexible options.\n<br><br>\nSecurity for the future\n<br><br>\nFinancial security for your individual retirement plan.\n<br><br>\nCollaboration\n<br><br>\nRespect, recognition and appreciation of the contribution of everyone. Regular team - and social events.\n<br><br>\nContinuing development\n<br><br>\nTraining and continuing developement options. Help to grow alongside with us, in personality and profession.\n<br><br>\nCompensation&amp;benefits\n<br><br>\nWe offer a lot: Fair working conditions and a reasonable, competitive compensation are the foundation for many more attractive benefits.\n<br><br>\nDiversity\n<br><br>\nOpen, tolerant and constructive work environment with a team consistent of diverse views and backgrounds.\n<br><br>\nWe are looking forward to your application\n<br><br>\nWe work together closely and respect each other, for over 200 years now and up till today. If that is just as important to you as it is to us, apply now!\n<br><br>\nthyssenkrupp Materials NA Inc is an equal opportunity employer. Applicants will receive consideration for employment without regard to age, sex, race, color, religion, national origin, genetics, disability, gender identity, marital status, sexual orientation, veteran status or any other protected characteristic required by applicable law.\n<br><br>\nApplicants with disabilities who require reasonable accommodation in connection with the application process are encouraged to contact us directly.\n<br><br>\nWe are thyssenkrupp!At thyssenkrupp we have more than 158,000 employees in 79 countries and annual sales of 41,5 billion. We are active in automotive engineering, logistics, plant technology, steel production, elevator manufacturing and much more. We work in large and small businesses all around the world but we always work together. We have over 200 years of experience in industry and the latest cutting-edge technology. We have a position that's right for you, that piques your interest, and that puts your skills to the test."}