{"job title": "Director, Data Engineering", "company": "Time Warner", "city state": "– Burbank, California", "rating": "3.4", "job description": "Posting\n<br>\nJob Title Director, Data Engineering\n<br><br>\nTime Warner\n<br>\nDivision Warner Bros. Entertainment Group\n<br><br>\nWB Business Unit WB Technology\n<br><br>\nIndustry Film Production and Distribution\n<br><br>\nArea of\n<br>\nInterest Technology/Information Technology\n<br><br>\nLocation United States - California - Burbank\n<br><br>\nRequisition # ******BR\n<br><br>\nPosition\n<br>\nType Full Time\n<br><br>\nCompany Overview Warner Bros. has been entertaining audiences for more than 90 years through the world's most-loved characters and franchises. Warner Bros. employs people all over the world in a wide variety of disciplines. We're always on the lookout for energetic, creative people to join our team.\n<br><br>\nBusiness Unit Overview WB Technology combines Warner Bros.' industry-leading technologists and disciplines to ensure global alignment with business strategy and accelerated delivery of innovative technology solutions studio- and industry-wide. From pre-production through archiving, the WBT organization will provide critical business and technology intelligence and services to all Studio business units. WBT manages the Studio's enterprise systems and solutions, emerging platforms, information security, consumer intelligence, content mastering and delivery, and more.\n<br><br>\nPosting Job Description What part will you play?\n<br><br>\nWarner Bros. Entertainment Inc. seeks a Director, Data Engineering for the Digital Product, Platform &amp; Strategy: Data Intelligence department. The Director, Data Engineering directs all enterprise-wide data operations, data platforms, engineering and architecture management related activities. Thought leader and champion for our data-driven culture as well as manage and grow our data engineering team. Focus is on supporting and driving business initiatives.\n<br><br>\nThe person works across multiple functional and technical groups, educates technical and non-technical stakeholders, effectively manage expectations, facilitate negotiations and help establish department priorities. They must drive project delivery within established timeframes, budget and scope while delivering business value and simultaneously planning for and managing future requirements.\n<br>\nData Integration - Design and develop new source system integrations from a variety of formats including files, database extracts and APIs.\n<br>\nData Pipelines - Design and develop highly scalable Data Pipelines that incorporate complex transformations and efficient code. Data will need to flow to and from unstructured and relational systems for analytic processing.\n<br>\nData Platforms - Design and develop solutions for delivering data that meets SLAs and is of high quality to various WB divisions for marketing and reporting as well as external vendors.\n<br>\nOperations and Tuning - Investigate problems and resolve as required, including working with various internal teams and vendors. Proactively monitor the data flows with a focus on continued performance improvement.\n\n\n<ul>\n<li>Oversee and direct the strategic planning of Data Engineering Operations.</li>\n<li>Ability to support multiple data/analytics project initiatives.</li>\n<li>Drive development of data warehouse programs and applications following established guiding principles and roadmap delivering project commitments on time.</li>\n<li>Manage the overall data platform while ensuring cross-platform stakeholders are engaged in overall design strategies, operations and projects.</li>\n<li>Develop reference data architectures and data integration methodologies.</li>\n<li>Provide technical direction on design, development, testing and implementation of data warehouse solutions, ensuring data quality.</li>\n<li>Execute strategies that inform data design and architecture.</li>\n<li>Manage relationships with Stakeholders.</li>\n<li>Collaborate with technology and business partners to support their objectives through comprehensive data warehouse programs.</li>\n<li>Identify opportunities for business process and technology improvement across departments that support plans and initiatives.</li>\n<li>Advise clients on available technology and solutions to further business goals.</li>\n<li>Work with BI Analytics, Data Science and Marketing Operations teams to enrich and build data sets that enable data-driven decisions across the organization.</li>\n<li>Work closely with PMO team to plan and manage budget for projects, maintenance, and resources.</li>\n<li>Prepare and manage project and IT contracts.</li>\n<li>Prepare and manage routine performance reports.</li>\n<li>Manage both internal and contract staff on project and operations support.</li>\n<li>Serve as leader on various projects and technology initiatives.</li>\n<li>Collaborate on strategic planning, major initiatives and directives.</li>\n<li>Develop and oversee data engineering goals, objectives and procedures.</li>\n<li>Manage multiple product roadmaps, reviewing blueprints and gap documents, functional design prototypes and specifications ensuring proper change control processes are followed and platforms are architected to company design principles.</li>\n</ul>\n\nWhat do we require from you?\n\n\n<ul>\n<li>6 - 8 Years of relevant experience.</li>\n<li>Data warehousing tools such as Teradata, Oracle, SQL, Amazon Redshift, Snowflake.</li>\n<li>Data Modeling and System Analysis.</li>\n<li>Data Platforms EMR, Data Bricks, AWS.</li>\n<li>Data Integration tools such as SQL, Spark, Scala, Python, Data Bricks.</li>\n<li>Experience and knowledge with various Business Intelligence reporting tools (Business Objects, Microstrategy, Looker, Tableau) a plus.</li>\n<li>Minimum of 5 years of relevant ETL/ELT experience.</li>\n<li>Experience in building real-time data pipelines.</li>\n<li>Experience with Digital Marketing tools for instrumentation and analytics analysis, such as Segment, Google Analytics, and Datorama.</li>\n<li>R, Machine Learning a plus.</li>\n<li>Project lifecycle, on a global level, including business process design, documentation, testing, rollout.</li>\n<li>Managing and providing data mining and modeling solutions.</li>\n<li>Knowledge of industry leading data quality and data protection management practices.</li>\n<li>Knowledge of data governance practices, business and technology issues related to management of enterprise information assets and approaches related to data protection.</li>\n<li>Knowledge of data related government regulatory requirements and emerging trends and issues.</li>\n<li>Knowledge of risk data architecture and technology solutions.</li>\n<li>Delivering on KPIs related to program objectives.</li>\n<li>Managing cross-functional teams to drive key initiatives to market on time and within budget with strict adherence to achieving measurable and defined objectives.</li>\n<li>Solid background in developing and driving key strategic product roadmaps including budgetary control.</li>\n<li>Experience managing multiple, simultaneous development projects.</li>\n<li>Experience managing technology assets and operations across multiple sites and internal/external resources.</li>\n<li>Experience in Agile methodology: Scrum, Kanban, Lean, etc. JIRA.</li>\n<li>Deep understanding of methods and tooling of continuous integration, delivery and deployment.</li>\n<li>Knowledge of enterprise system software solutions and the integration of business processes, with a focus on service introduction and operational sustainment.</li>\n<li>SaaS and Cloud operational solutions.</li>\n<li>ITIL Operations best practices.</li>\n<li>Entertainment industry experience preferred.</li>\n<li>Strong interpersonal, communication and presentation skills.</li>\n<li>Strong team focus with outstanding organizational and resource management skills.</li>\n<li>Experience with vendor selection process.</li>\n<li>Experience in P &amp; L and budget management.</li>\n<li>Understanding of e-commerce technology platform options.</li>\n<li>Working knowledge of and experience using a variety of CMS tools.</li>\n<li>Knowledge of e-commerce and direct-to-consumer trends.</li>\n<li>Proficient in Excel, Word, PowerPoint, MS Project and MS Visio.</li>\n</ul>\n\nBut Wait, There's More! At WBT we look for members who want to:\n\n\n<ul>\n<li>Be Curious: Seek out opportunities to learn, and who aren't afraid to ask questions</li>\n<li>Own It: Be the driver, and take accountability</li>\n<li>Embrace Change: The technology landscape is ever changing - we're looking for people who are ready to change along with it.</li>\n<li>Engage and Influence: Share your passion for technology, and develop great relationships with colleagues and collaborators</li>\n<li>Respect: Show empathy and respect to all, and operate with the best intentions</li>\n<li>Live the #WBLife: At WBT we look for team members who want to 'Contribute to Our Community</li>\n<li>The Warner Bros. Entertainment Group of Companies is an equal opportunity employer and considers all candidates for employment regardless of race, color, religion, sex, national origin, citizenship, age, disability, marital status, military or veteran's status (including protected veterans, as may be required by federal law), sexual orientation, gender identity or any other category protected by law.</li>\n</ul>"}