{"job title": "Airlift Data Analyst", "company": "Unisys Corporation", "city state": "– Scott Air Force Base, Illinois", "rating": "3.2", "job description": "We are currently seeking a motivated, career and customer oriented Airlift Data Analyst to join our team in Scott Air Force Base, IL, to begin an exciting and challenging career with Unisys Federal Systems.\n<br><br>\nIn this role you will compile, analyze and report air transportation movement data for the 618 Air Operations Center (AOC) Stratgy Division.\n<br>\n<strong>Duties/Tasks and Responsibilities:</strong>\n\n\n<ul>\n<li>Compares manifest information to planned data and populates spreadsheets and power point presentations with relevant movement data.</li>\n<li>Utilizes the Global Air Transportation Execution System (GATES), the Global Transportation Network (GTN), a locally developed Fusilator program, and a variety of other tools and systems to determine passengers and cargo moving in support of the Department of Defense mission.</li>\n<li>Evaluates system discrepancies and solves unique transportation movement issues in respect to in-transit visibility of passengers and cargo moving within the Department of Defense transportation system.</li>\n<li>Develops briefings and presents data to senior level decision makers for efficient and effective use of airlift assets, both military and commercial.</li>\n<li>Utilizes database tools to compile historical information relating to the movement of unclassified and classified force movement.</li>\n<li>Provides transportation consultant services to executive level decision makers.</li>\n<li>Develops and presents executive level DTTS presentations for dignitaries and high level DoD personnel from all Services.</li>\n<li>Work 40 hour week with split weekend and holiday as per the schedule.</li>\n<li>Update and import data (JOPES/SMS) for the Web Robin, and create deliverables.</li>\n<li>Record each action/activity in a provided Shift Tool</li>\n<li>Maintain NIPR/SIPR accounts and monitor email on both systems throughout the assigned shift.</li>\n<li>Interface with other internal directorates to obtain data needed for product updates</li>\n</ul>\n\n<strong>Requirements</strong>\n<br><br>\n<strong>Position Requirements:</strong>\n<br>\n<strong>U.S. CITIZENSHIP REQUIRED</strong>\n<br>\nActive SECRET Security Clearance\n<br>\nEducation/Experience: Bachelor's degree or a minimum of 5 years of relevant work experience (Air Refueling and Airlift Operations).\n\n\n<ul>\n<li>Shift will be (15:00pm to 23:00pm) holidays on days other than actual holiday</li>\n</ul>\n\nAbout Unisys\n<br><br>\nDo you have what it takes to be mission critical?\n<br><br>\nYour skills and experience could be mission critical for our Unisys team supporting the Federal Government in their mission to protect and defend our nation, and transform the way government agencies manage information and improve responsiveness to their customers. As a member of our diverse team, you'll gain valuable career-enhancing experience as we support the design, development, testing, implementation, training, and maintenance of our federal government's critical systems.\n<br><br>\nApply today to become mission critical and help our nation meet the growing need for IT security, improved infrastructure, big data, and advanced analytics.\n<br><br>\nUnisys is a global information technology company that solves complex IT challenges at the intersection of modern and mission critical. We work with many of the world's largest companies and government organizations to secure and keep their mission-critical operations running at peak performance; streamline and transform their data centers; enhance support to their end users and constituents; and modernize their enterprise applications. We do this while protecting and building on their legacy IT investments. Our offerings include outsourcing and managed services, systems integration and consulting services, high-end server technology, cybersecurity and cloud management software, and maintenance and support services. Unisys has more than 23,000 employees serving clients around the world.\n<br><br>\nUnisys offers a very competitive benefits package including health insurance coverage from first day of employment, a 401k with an immediately vested company match, vacation and educational benefits. To learn more about Unisys visit us at **************.\n<br><br>\nUnisys is an Equal Opportunity Employer (EOE) - Minorities, Females, Disabled Persons, and Veterans.\n<br>\n<strong>#FED#</strong>\n<br><br>\nApply on Company Website\n<br><br>\nJob ID: 2018-4697\n<br><br>\nHelp us improve CareerBuilder by providing feedback about this job: .\n<br><br>\n<strong>CAREERBUILDER TIP</strong>\n<br>\nFor your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.\n<br>\nBy applying to a job using CareerBuilder you are agreeing to comply with and be subject to the CareerBuilder Terms and Conditions for use of our website. To use our website, you must agree with the Terms and Conditions and both meet and comply with their provisions.\n<br><br>\nUnisys Corporation\n<br><br>\nUnisys is a worldwide information technology company. We provide a portfolio of IT services, software, and technology that solves critical problems for clients. We specialize in helping clients secure their operations, increase the efficiency and utilization of their data centers, enhance support to their end users and constituents, and modernize their enterprise applications. Contact Info\n\n\n<ul>\n<li>Scott Air Force Base, IL 62225</li>\n</ul>"}