{"job title": "Data Engineer", "company": "Cambridge Mobile Telematics", "city state": "– Cambridge, MA, US", "rating": "5.0", "job description": "<div>\nAt Cambridge Mobile Telematics (CMT), our mission is to make roads safer by making drivers better. We do this by developing innovative software and hardware products that measure driver safety and provide insightful feedback about how drivers become better. Our products are in use by millions of drivers, with proven results: users of our software show reductions of 40% or more in risky behaviors like phone use while driving, and our safest and most engaged users are many times less likely to have an accident than the average driver.\n<br><br>\nAs a <strong>Data Engineer</strong> on our Data team, you design, implement and maintain how CMT moves and stores driving sensor data coming at a high-velocity and a high-volume. You enable CMT's engineers and customers to be able to design algorithms and discover insights very quickly from \"big\" driving data.\n<br><br>\nYou would use various tools and frameworks to enable this capability: big data processing engines (e.g. Apache Spark, AWS Athena), big data/columnar/specialized database platforms (e.g. Vertica, MapD), streaming (e.g. Apache Kinesis, Kafka), various storage formats and solutions (e.g. Apache Parquet) within AWS ecosystem. You design and implement how data flows within and between CMT data processing pipelines. If the idea of turning big, raw driving data into algorithms and actionable insights that make drivers drive better, this is an ideal position for you.\n<br><br>\n<strong>Basic qualifications:</strong></div><strong>\n<br>\n</strong>\n\n<ul>\n\n<li>\nBA/BS in Computer Science, Engineering or related technical discipline</li>\n<li>\n3+ years of experience developing software using data tools and products</li>\n<li>\nStrong programming skills for constructing and understanding data pipelines, particularly in Python and SQL</li>\n</ul>\n\n<div><strong>Preferred qualifications:</strong></div><ul>\n<li>\nMS / PhD plus several years of relevant experience</li>\n<li>\nExpertise and experience in one or more of: scalable computing platforms (e.g. Apache Spark), streaming data pipelines (e.g. Kafka), analytical databases (e.g. Vertica) etc</li>\n<li>\nExperience in designing data pipelines and products for real world applications</li>\n<li>\nAbility to visualize and monitor high-velocity, high-density and high-volume data-flow</li>\n<li>\nStrong understanding of software design and disciplines</li>\n</ul><br>\n\n<div>\nCambridge Mobile Telematics provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, sexual orientation, protected veteran status or genetics. In addition to federal law requirements, Cambridge Mobile Telematics complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.</div>"}