{"job title": "Engineer, Senior", "company": "FusionStorm, Inc.", "city state": "– San Francisco, CA", "rating": "3.7", "job description": "<strong>Are you passionate about working with a dynamic team?</strong>\n<br><br>\nThe Senior Engineer is responsible for providing post-sales engineering and consulting design and implementation services related to hardware and software technologies; providing presales support by assisting the development, review and validation of customer solutions; and performing as a technical lead for multiple hardware and software solutions.\n<ul>\n<li>Assist in identifying design options for systems infrastructure.</li><li>Support Presales activities including:</li><li>Analyzing technical needs, requirements, and state of a customer’ current infrastructure and operations;</li><li>Articulating to customers the recommended solutions;</li><li>Seeing opportunities and developing technical solutions to meet customers’ needs and requirements;</li><li>Reviewing and validating solutions to ensure compatibility and consistency with FusionStorm standard methodologies.</li><li>Assist the Sales and Engineering groups with requests for quotes / information, bids, proposals and statements of work.</li><li>Interact with Solutions Architects, other specialists and vendors to adjust designs to meet the customer’s needs.</li><li>Ability to take on Technical Project Leadership of multiple projects, interact and support and customer of FusionStorm assigned Project Managers.</li><li>Meet or exceed assigned regional objectives.</li><li>Develop levels of effort for systems development and testing.</li><li>Perform the build, configuration, testing and maintenance of servers, storage, virtualization and networking related hardware and software.</li><li>Prioritize and perform research on technical problems with minimal guidance</li><li>Identify, research, analyze and resolve system malfunctions and operational problems.</li><li>Develop design/testing/implementation and change control documentation</li><li>Meet schedules and goals for work you're doing.</li><li>Track project tasks against project plan and meet project achievements.</li><li>Provide status to management on work you're doing as required.</li><li>Communicate technical information to non-technical personnel, vertically and horizontally within an organization.</li><li>Assist with the definition, development, installation and administration of solution demonstrations in the FusionStorm labs.</li><li>Work well with people from many different disciplines.</li><li>Work with other IT support personnel and service providers to solve technical problems.</li><li>Working in conjunction with other Solution Architects and teams build, maintain and publish a set of written procedures and standard methodologies for the delivery of pre- and post-sales engineering services to customers.</li><li>Act as a technical lead in technology solutions by doing the following:</li><li>Mentoring other specialists;</li><li>Direct a team of resources on larger projects;</li><li>Review the work of other specialists, as appropriate;</li><li>Act as a point of critical issue;</li><li>Present technology topics at internal education sessions, and industry user group meetings and/or conferences.</li><li>Be regarded as a leader with vision by recommending new technologies, standard methodologies and tools that support the growth of the business</li><li>Work with vendors to understand road maps and changes to products and technologies, how it effects the business and clients.</li><li>Embrace and support FusionStorm’s mission and core values.</li><li>Be regarded by one or two vendors as an authority on their solutions.</li><li>Rapidly learn new technologies and paradigms</li><li>Physical ability to lift up to 50 lbs.</li><li>Provide after-hours on-call support.</li><li>Participate in vendor training to maintain and grow skills and knowledge of existing and new products.</li><li>Support local vendor relationships within the Region.</li><li>Utilize business management tools for tracking time, expenses and project status and documentation.</li><li>Supports Sales efforts to meet Regional financial goals.</li><li>Understand and abide by all security and operational polices</li></ul>\n\n<ul>\n<li>Knowledge of a wide range of hardware and software technologies. Primary focus for products and professional services is on vendors as follows: EMC, NetApp, Cisco, Citrix, and VMware.</li><li>Considered an authority in more than one technology and/or vendor.</li><li>Deep understanding of server, storage, virtualization and networking technologies, procedures, operations and standard methodologies.</li><li>Bachelor’s degree in Computer Science, Information Technology or related field.</li><li>Minimum of 10 years as an engineering consultant, outside systems engineer or similar.</li><li>Technology industry certifications</li><li>Legally eligible to work in the United States</li><li>Ability to assist the Sales and Engineering groups with requests for quotes / information, bids, proposals and statements of work.</li><li>Possess excellent verbal and written communication skills, customer contact and analytical skills.</li><li>Strong technical writing skills to develop system documentation</li><li>Ability to create technical solution drawings</li><li>Strong social and communication skills.</li><li>Strong presentation skills.</li><li>Self-motivated to develop and maintain skill set and product knowledge to improve value and to deliver quality services to our customers. This includes attaining designated certification requirements and attending product-specific training, reviewing technical literature, and obtaining hands-on experience.</li><li>Ability to mentor other specialists.</li><li>Be regarded as a technical lead for thought leadership, coaching, and driving business solutions.</li><li>Professional self-starter, able to work collaboratively with others.</li><li>Projects a professional image and strong business insight during customer interactions.</li><li>Possesses a sense of urgency, strong organizational and follow up skills.</li><li>Ability to multi-task, stay organized, and work expertly</li><li>Ability to work independently, as well as with peers</li><li>Be acknowledged nationally within the FusionStorm organizations as being the best, capable of developing others in the field and sharing expert knowledge.</li>\n</ul>\n<strong>This</strong> <strong>position</strong> <strong>may</strong> <strong>require</strong> <strong>travel</strong> <strong>50%</strong> <strong>travel,</strong> <strong>as</strong> <strong>required.</strong>\n<br><br>\n<strong>WHY FUSIONSTORM?</strong>\n<br><br>\nFusionStorm is an award-winning, information technology delivery (ITD) companyTM. We combine best-of-breed products from leading vendors with a full suite of Professional and Managed Services to help our customers save money and grow their businesses. FusionStorm provides advanced technology and data center infrastructure expertise; world-class IT consulting, and managed and support services. We ensure our customer’s IT investments create value and realize high returns.\n<br><br>\nFusionStorm hires extraordinary people who strive to make a difference. Our success is in large part due to our outstanding talented and dedicated employees. If you thrive on transformation, empowerment to make a difference, and identification of solutions in an innovative environment, we want you to join our team.\n<br><br>\nFusionStorm is headquartered in the San Francisco Bay Area with offices in Newark, Irvine, San Diego, Franklin Massachusetts, New York City, Cranberry Township Pennsylvania, Amsterdam Netherlands, Beijing China and Wanchai Hong Kong. For more information about FusionStorm, please visit www.fusionstorm.com.\n<br><br>\n<strong>WE OFFER A GREAT BENEFITS PACKAGE!</strong>\n<br><br>\n<strong>There's so much more to enjoy about being at FusionStorm than just having a rewarding career.</strong> In addition to offering competitive compensation plans and long-term career opportunities, FusionStorm provides an attractive mix of benefit plans to contribute to its employees' good health, future financial security and peace of mind. Please visit our website for more information about our competitive benefits package: http://www.fusionstorm.com/company/careers/beyond-rewarding-career\n<br><br>\nYou must be authorized to work in the United States.\n<br><br>\nFusionStorm is an Equal Opportunity Employer with a strong commitment to supporting and retaining a diverse and talented workforce.\n<br><br>\nNo AGENCIES, please. We are not obligated to pay any fees for any individuals we decide to hire.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}