{"job title": "Staff Software Engineer, Geospatial", "company": "HomeAway", "city state": "– Austin, TX, United States", "rating": "3.7", "job description": "<strong>HomeAway</strong>, a world leader in the vacation rental industry, is the place to book beach houses, cabins, and condos with more than two million places to stay in 190 countries. The site makes it easy to find and book the perfect vacation rental for any getaway, often for less than the cost of traditional hotel accommodations. HomeAway is part of the Expedia Group family of brands.\n<br><br>\n<strong>The Opportunity:</strong>\n<br><br>\nAs a member of the Digital Platform team, you will have a unique opportunity to develop data products and services that surface deep insights about our markets, properties, and competition, while being part of an engineering group leading the way in building a world-class data platform.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Develop services to collect, enrich, and persist information from stream, batch, and programmatic data sources.</li><li>Develop comprehensive geo measures and attributes that enable deeper understanding of vacation rental markets and locations</li><li>Develop code to interface with internal and external RESTful API services to build and enrich data products.</li><li>Design and implement high-performance data models in Relational and NoSQL database technologies</li><li>Develop and configure resilient online and offline data processing jobs</li><li>Dockerize apps and microservices for CI/CD deployment</li><li>Participate in resolution of production issues and lead efforts toward solutions</li><li>Develop and maintain high-quality software using best-in-class tools: Git, Splunk, New Relic, Datadog, Qubole, and Jenkins</li>\n</ul>\n<strong>Qualifications:</strong>\n<ul>\n<li>B.S. or M.S. in Computer Science, Engineering, or equivalent</li><li>9+ years of development experience including 4+ years engineering geo solutions and performing geospatial analytics</li><li>Proficiency with SQL (ideally T-SQL or pgSQL), SQL Spatial (data types, functions and methods, indexing) and geospatial analytics on Spark</li><li>Familiarity with geospatial software and tools (Mapbox, Mapboxgl, Leaflet, PostGIS, etc.)</li><li>Proficiency developing in Java, Scala, or Python</li><li>Strong understanding of OOP/OOD/Functional programming principles</li><li>Experience with large scale data processing including data modelling, ETL, aggregation strategy, and performance optimization</li>\n</ul>\n<strong>Benefits &amp; Perks:</strong>\n<ul>\n<li>Competitive health and insurance benefits</li><li>Competitive salary</li><li>Annual target bonus or commission</li><li>Paid vacation and sick time</li><li>Vacation rental on a yearly basis (taxable benefit)</li><li>Employee Stock Purchase Program</li><li>Free snacks and beverages</li><li>Frequent company update talks with our leadership team</li><li>Free listing on HomeAway.com</li><li>Electronic, adjustable stand-up desk</li><li>Discounted Metro &amp; Rail pass</li><li>Casual dress</li>\n</ul>\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}