{"job title": "Engineering Manager, Enterprise", "company": "Improbable", "city state": "– Washington DC", "rating": "4.4", "job description": "<div><strong>Our Purpose</strong></div><br>\n<div>Improbable builds world-leading simulation technology that helps resolve previously impossible problems. Our technology platforms enable the creation of enormous virtual worlds for training and highly accurate \"system of systems simulations of complex real-world scenarios to facilitate better decision-making.</div> <br>\n<div>The Enterprise division of Improbable was formed in 2015. It seeks to create an Optimized World, where simulations of unprecedented scale and complexity provide insights into all of the most important problems faced by businesses and governments. The decisions based on this work will make a safer, more efficient and more prosperous world.</div><br>\n<div>This process is enabled by distributed computation and the abundance of data generated by the digitization of the physical world. We believe that these huge simulations will be the next fundamental technology of our time. You can read more about our story here.</div><br>\n<div>Our US engineering office is located in Arlington, VA</div><br>\n<div><strong>Your Mission</strong></div><br>\n<div>As a founding member of Improbable's DC office you will build out our offering in this strategically important location; providing a fundamentally new technology to some of the most interesting and important problems across federal government.</div><br>\n<div>As an Engineering manager at Improbable, your primary role is to manage, develop and grow your wonderful teams - taking care of hiring, on-boarding, mentoring, coaching, career development, and performance management. Overall, youre responsible for the productivity and happiness of your team, continually optimizing to get the best out of them. We currently have both research and applied teams across different verticals; your role will be to scale and develop these teams.</div><br>\n<div>We believe it's important to be passionate about building teams and we're looking for considerable experience in mentoring and developing managers as well as engineers. Your role will also expect you to work closely with Principal Engineers, Product Managers and Delivery Managers ensuring that your unit is building a product that delights your customers.</div><br>\n<div>We want to build a positive team culture where you're supporting colleagues and empowering them to grow as technical leaders and people. The work that you enable your team to deliver on time and to roadmap will ultimately have an impact on the vision of Improbable itself.</div> <br>\n<div>You can read about the engineering culture of the division here.</div>Competencies\n\n<ul>\n<li>4+ years experience with growing and managing a team of 5 engineers or more.</li><li>Proven experience managing teams delivering software into the Federal government</li><li>Real passion for developing, mentoring and supporting people.</li><li>A diverse background in software and/or systems engineering.</li><li>Comfortable coding in at least one mainstream programming language (even if it is not one that Improbable uses).</li><li>Highly developed technical and people troubleshooting skills.</li><li>Active Top Secret Clearance (SCI preferred)</li> \n</ul><br>\n\n<div><strong>Equal Opportunity</strong> </div><div>The best ideas are often the least expected and require new ways of thinking; thats why our teams at Improbable are made up of an incredible range of talented people. Improbable is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy, childbirth, related medical conditions and lactation), sexual orientation, gender identity, gender expression, national origin, marital status, age, protected veteran or disabled status, genetic information, or any other legally protected status.</div>"}