{"job title": "sr. software engineer in test, firmware/device", "company": "Light", "city state": "– Palo Alto", "rating": "5.0", "job description": "<div><div>Light is pioneering the era of the software-defined camera. Powered by sophisticated computational processes, software-defined cameras deliver intelligent, high-quality imaging at cost-effective, global scale. Light’s first product, the award-winning L16 Camera, has eliminated the quality or convenience dilemma that has plagued photographers for a century. Light’s foundational technologies, including its Lux Capacitor camera control chip and its Polar Fusion Engine for multi-image processing, are licensed for use in applications like smartphones and beyond. To learn more about Light, visit light.co.</div> <br>\n<div>We are hiring a Senior Software Engineer in Test to join our team as we continue to develop our radically new camera technology. You will lead the design and execution of test cases in support of the validation and verification of firmware and device software.</div><br>\n<div>Only engineers with testing experience with embedded systems on consumer electronics will be considered. We prefer mobile device and camera experience too!</div>\n</div><div><div>what you will do...\n\n<ul>\n\n\n<ul>\n<li>influence, design, and implement processes and tools at a fast-paced start-up</li><li>bring your Software Quality Engineering and Test Automation expertise to help launch our revolutionary camera technology</li><li>work on cutting edge consumer device projects</li> <li>very hands on work - writing automation test scripts and debugging and analyzing logs</li><li>design and build automation framework for firmware and platform level tests</li><li>design and execute test cases for hardware devices</li><li>isolate bugs and record issues in an issue tracking system</li><li>collaborate with the firmware and platform development teams to isolate and resolve open issues</li><li>generate project summary and status reports</li><li>contribute to the continuous improvement of the quality of the products</li><li>collaborate and provide guidance and test strategy for offshore team</li></ul>\n</ul>\n\n</div>\n</div><div><div>what you bring to Light...\n\n<ul>\n\n\n<ul>\n<li>extensive test automation experience with embedded software on camera devices and mobile devices</li> <li>BS in computer science - required</li><li>3+ years of experience in at a hardware company writing test scripts for hardware test automation - required</li><li>hands-on industry experience coding with Python and Shell scripting</li> <li>consumer devices and embedded systems experience - required</li><li>ability to code and write scripts independently</li><li>strong knowledge of Bug reporting, code tracking, and source control tools such as JIRA, Gerrit, Git or Subversion - required</li><li>experience providing guidance to offshore teams- preferred</li><li>knowledge of testing in Linux and Android environments</li></ul>\n</ul>\n\n</div>\n</div><div><div>oh, but there's more...\n\n<ul>\n\n\n<ul>\n<li>You get to up-level your game as you work with world class technologists who have proven they know how to create extraordinary technology.</li> <li>We offer medical, dental, vision, life, maternity, paternity and commuter benefits.</li><li>We value flexibility and know that it's a 2-way street. So our teammates get to enjoy our open time off policy.</li> <li>Our passion for photography is evident in everything we do from our in-house photo talks, gallery walks and other photography-obsessed events!</li><li>Fully stocked kitchen. Yes. We eat a lot.</li> <li>Be one of the first photography enthusiasts to get your hands on the L16!</li></ul>\n\n</ul>\n\n</div>\n</div><div><div>This full-time role based at Light's Palo Alto headquarters is ready to be filled immediately.</div> <div>To reimagine photography, visit: https://light.co/.</div><br>\n<div>We appreciate your interest in Light!</div><br>\n<div>Individuals seeking employment at Light are considered without regard to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, gender identity, or sexual orientation.</div> </div>"}