{"job title": "Sales Engineer - Central", "company": "Lookout", "city state": "– Chicago, IL", "rating": "3.6", "job description": "Lookout is a cybersecurity company that makes it possible for individuals and enterprises to be both mobile and secure. With 150 million mobile sensors fueling a dataset of virtually all the mobile code in the world, the Lookout Security Cloud can identify connections that would otherwise go unseen -- predicting and stopping mobile attacks before they do harm. Headquartered in San Francisco, Lookout has offices in Amsterdam, Boston, London, Sydney, Tokyo, Toronto and Washington, D.C. To learn more, visit www.lookout.com.\n<br><br>\nWith a massive mobile security dataset and over 100 granted patents, Lookout's security platform, the Lookout Security Cloud, supports a wide range of Lookout products and services and forms the backbone of Lookout's value and competitive advantages in the mobile security market.\n<br><br>\n<strong>Who Are We Looking For?</strong>\n<br><br>\nWe're looking for a high-energy, creative, detail-oriented and passionate person to join the Sales organization at Lookout. You will be responsible for managing and creating multiple aspects of our relationship with Midwest territory customers. Successful candidates will be results-oriented, self-directed and have a strategic orientation balanced with a strong ability to contribute directly to the businesses we build with our customers. You will be based in the Midwest region (Ohio, TX, Chicago area) and have already successfully supported all technical aspects required for software sold to the region. You have solid contacts within the technical community. You are an experienced engineer with a successful track record of solving difficult technical issues, architecting a solution to meet customer needs, and provide valuable feedback to developers based on customer input. You know how to ensure that your customer's needs and wants are conveyed across the organization, while primarily safeguarding the interests of your own company.\n<br><br>\n<strong>What Will You Do?</strong>\n\n<ul>\n<li>You will forecast and deliver upon the revenue plan associated with your named accounts</li>\n<li>You will create deep ongoing relationships at multiple levels of the organization, you will represent their interests well internally, most importantly balancing Lookout's interests within that of the customer</li>\n<li>You will manage investments to improve win probability</li>\n<li>You will position the capabilities of Lookout Security products with the customer to define RFP requirements</li>\n<li>You will aid in the response to RFIs and RFPs in a timely and professional manner to win bids</li>\n<li>You will communicate customer requirements and competitive data, including feature needs, and value proposition to the product and marketing teams and senior management</li>\n<li>You will provide input to senior management on go-to-market strategies</li>\n<li>You will build the Lookout Security brand by presenting at seminars and conferences.</li>\n</ul>\n<strong>What's Needed?</strong>\n\n<ul>\n<li>A solid system/sales engineer with excellent relevant experience, strong ties with customers and an extremely positive reputation for delivery</li>\n<li>10+ years of direct sales engineering experience with customers</li>\n<li>Excellent presentation and communication skills and the ability to boil down complex topics into clear and easily understandable messages</li>\n<li>The ability to help the company become a thought leader in the Mobile space</li>\n<li>The ability to sit on technical panels and deliver strong technical presentations to prospective customers</li>\n<li>Demonstrated ability to develop effective programs, optimize efforts and communicate results</li>\n<li>Strong interpersonal skills with a demonstrated ability to influence and drive others. Be able to say \"no\", take charge of the account, manage all interactions with that account</li>\n<li>Flawless organizational and follow up skills</li>\n<li>Excellent analytical skills</li>\n</ul>\n#LI-POST"}