{"job title": "Product Engineer", "company": "MaxLinear Inc.", "city state": "– Irvine, US-CA", "rating": "3.0", "job description": "MaxLinear is seeking a Product Engineer to join our Irvine, CA design center. We are open to candidates of varying experience levels.\n\n<ul>\n<li>Responsible for working with Core team members to coordinate, manage and prioritize all activities needed to support a product through NPI flow</li>\n\n<li>Responsible for transferring a product to Production phase</li>\n\n<li>Participate in the Testability Review and follow up to insure production test coverage consistent with documented Test Plan. Insure correlation between the ATE Test results and the Design Bench Verification results</li>\n\n<li>Work closely with TDE on program development required for product qualification, characterization and production program</li>\n\n<li>Responsible for developing the product Characterization Plan and coordinating test and analysis of Characterization Test results</li>\n\n<li>Responsible for developing and managing product Qualification Requirements (Package Qual, Burn-in, ESD, Latchup)</li>\n\n<li>Responsible for on-going product cost reduction efforts and quality improvements including Test Time reductions/optimization, alternate source qualifications, and Yield improvement, DPPM reduction</li>\n\n<li>Responsible for supporting customer returns through coordination with core team members to resolve issues (Failure Analysis, Test improvements)</li>\n</ul>\n\n<strong>Required Skills</strong>\n\n\n<ul>\n<li>Manufacturing Operations experience in Semiconductor industry (RF experience preferred)</li>\n\n<li>Experience with ATE (Automatic Test Equipment), such as Verigy and Teradyne</li>\n\n<li>Experience with Data Analysis S/W in support of Characterization Reports and Yield Reporting tools such as Excel VBA, JMP, Galaxy, or Data Conductor</li>\n\n<li>Experience with common Fabless Standard Logic CMOS Process Technologies (65nm and below) and correlation to product performance, quality, and yield</li>\n\n<li>Able to interface knowledgably within a cross functional team and to own and drive best technical solutions</li>\n\n<li>Demonstrated process improvement skills</li>\n\n<li>Strong statistical, analytical and organization skills</li>\n\n<li>Must be a team player, flexible and goal oriented</li>\n\n<li>Work on and lead projects of significance and able to analyze and evaluate complex technical problems; provide direction and performance feedback to project team</li>\n\n<li>Bachelor’s or Master’s</li>\n</ul>\n\n<strong>Company Overview</strong><br><br>MaxLinear is a global, New York Stock Exchange-traded company (NYSE: MXL) where the entrepreneurial spirit is alive and well. We are a fabless system-on-chip product company, designing highly integrated, radio-frequency, and mixed-signal Communications ICs for broadband and infrastructure applications.\n<br><br>\nWe hire the best people in the world and engage them in some of the most exciting opportunities in our broadband and infrastructure markets. Our growth has come from innovative, bold approaches to solving some of the world’s most challenging communication technology problems.\n<br><br>\nMaxLinear began by developing the World’s first high-performance TV tuner chip using standard CMOS process technology. Others said we couldn’t achieve the extremely high performance requirements using CMOS, but we proved them wrong and achieved enduring global market leadership with our designs. Since then, we’ve developed a full line of products for satellite communications, cable modems, and terrestrial TV; diversified into high speed products addressing Datacom applications such as 400 Gbps fiber-optic interconnect chips for high-speed networks; and MoCA technology for home networking.\n<br><br>\nOur headquarters is in Carlsbad, near San Diego, California. We also have major design centers in Irvine and San Jose, CA; in Vancouver, Canada; in Herzliya, Israel; in Valencia, Spain; and in Bangalore, India.\n<br><br>\nWe have approximately 800 employees, a substantial majority of whom have engineering degrees, and include masters and Ph.D. graduates from many of the premiere universities around the world. Our engineers thrive on innovation, outstanding execution, outside-the-box thinking, nimbleness, and collaboration. Together, we form a high-energy business team that is focused on building great products.\n<br><br>\n*MON<br><br>Required Experience\n<br><br>\nJob Location\n<br>\nIrvine, US-CA\n<br>"}