{"job title": "Director Product Engineering", "company": "MaxLinear Inc.", "city state": "– Irvine, US-CA", "rating": "3.0", "job description": "MaxLinear is seeking a Product Engineering Director to join our Irvine, CA design center team.\n\n<ul>\n<li>Responsible for the overall Product Quality</li>\n\n<li>Manages centralized team of Product Engineers. Responsible for recruiting, hiring, training, and supporting all product development and production sustaining activities</li>\n\n<li>Responsible for supporting/managing product schedules and key requirements through the product development cycle</li>\n\n<li>Responsible for working closely with Design and Systems teams to develop a full Product Characterization and Qualification plan for all new products in development</li>\n\n<li>Supports all aspects of the Product Qualification process (product characterization and reliability testing) and correlation between the ATE platform and the Systems bench test results</li>\n\n<li>Responsible for establishing the production flows and optimizing the product cost through yield improvement and other operational efficiencies. Prioritizes and drives overall product cost reduction strategies.</li>\n\n<li>Works closely with offshore teams and the Supply Chain partners to ensure efficient manufacturing flows and the monitoring of all aspects of selected production metrics</li>\n\n<li>Key interface between Operations and the Supply Chain partners to ensure efficient manufacturing flows and optimal cost objectives are met</li>\n\n<li>Familiarity with key suppliers and an understanding of the Wafer Fab, Assembly, and Final Test technologies associated with the fabless semiconductor industry</li>\n\n<li>Key interface between Operations and Finance to manage product costs and yield assumptions; as well as project engineering expense planning (development budgets) in support of the operating plan</li>\n</ul>\n\n<strong>Required Skills</strong>\n\n\n<ul>\n<li>Track record of managing a product engineering team and the ability to effectively interface across functional groups both within and outside of Operations</li>\n\n<li>Strong written and verbal communication skills with the ability to build confidence at the executive level</li>\n\n<li>Strong background and experience with the Fabless Semiconductor supplier base (Foundry, Assembly, and Test)</li>\n\n<li>Experience with Data Analysis software: Data Conductor preferred</li>\n\n<li>Experience with Automated Test Equipment: Teradyne and Verigy preferred</li>\n\n<li>Experience with Standard Logic CMOS processes spanning advanced technology nodes (down to 14/16nm)</li>\n\n<li>Experience with industry standard packaging technologies</li>\n</ul>\n\n<strong>Company Overview</strong><br><br>MaxLinear is a global, New York Stock Exchange-traded company (NYSE: MXL) where the entrepreneurial spirit is alive and well. We are a fabless system-on-chip product company, designing highly integrated, radio-frequency, and mixed-signal Communications ICs for broadband and infrastructure applications.\n<br><br>\nWe hire the best people in the world and engage them in some of the most exciting opportunities in our broadband and infrastructure markets. Our growth has come from innovative, bold approaches to solving some of the world’s most challenging communication technology problems.\n<br><br>\nMaxLinear began by developing the World’s first high-performance TV tuner chip using standard CMOS process technology. Others said we couldn’t achieve the extremely high performance requirements using CMOS, but we proved them wrong and achieved enduring global market leadership with our designs. Since then, we’ve developed a full line of products for satellite communications, cable modems, and terrestrial TV; diversified into high speed products addressing Datacom applications such as 400 Gbps fiber-optic interconnect chips for high-speed networks; and MoCA technology for home networking.\n<br><br>\nOur headquarters is in Carlsbad, near San Diego, California. We also have major design centers in Irvine and San Jose, CA; in Vancouver, Canada; in Herzliya, Israel; in Valencia, Spain; and in Bangalore, India.\n<br><br>\nWe have approximately 800 employees, a substantial majority of whom have engineering degrees, and include masters and Ph.D. graduates from many of the premiere universities around the world. Our engineers thrive on innovation, outstanding execution, outside-the-box thinking, nimbleness, and collaboration. Together, we form a high-energy business team that is focused on building great products.\n<br><br>\n*MON<br><br>Required Experience\n<br><br>\nJob Location\n<br>\nIrvine, US-CA\n<br>"}