{"job title": "Software Engineer", "company": "MITRE", "city state": "– Bedford, Massachusetts", "rating": "3.2", "job description": "<div><div><div><div><div>Why choose between doing meaningful work and having a fulfilling life? At MITRE, you can have both. That's because MITRE people are committed to tackling our nation's toughest challenges—and we're committed to the long-term well-being of our employees. MITRE is different from most technology companies. We are a not-for-profit corporation chartered to work for the public interest, with no commercial conflicts to influence what we do. The R&amp;D centers we operate for the government create lasting impact in fields as diverse as cybersecurity, healthcare, aviation, defense, and enterprise transformation. We're making a difference every day—working for a safer, healthier, and more secure nation and world. Our workplace reflects our values. We offer competitive benefits, exceptional professional development opportunities, and a culture of innovation that embraces diversity, inclusion, flexibility, collaboration, and career growth. If this sounds like the choice you want to make, then choose MITRE—and make a difference with us.<br>\n\n<div>As a member of MITRE's Software Engineering\n<br>\nTechnical Center, you will provide hands-on software engineering expertise in a\n<br>\ncollaborative environment to respond to a diverse set of sponsor needs. \n<br>\nYou will apply agile methodologies to prototype software solutions that\n<br>\nrespond to the needs of the end-user, empowers them to improve their business\n<br>\nprocesses, and enables agile and adaptive changes to fielded capabilities to\n<br>\nmeet the ever-evolving needs.\n<br><br>\nYou will work in a collaborative\n<br>\nlearning environment where you will work closely with other software\n<br>\nengineers in an environment and organization that encourages collaboration,\n<br>\nmentoring, and continued learning.\n<br><br>\nAs a software engineering consultant, you\n<br>\nwill have the opportunity to leverage and grow your software engineering\n<br>\nexpertise and provide:\n<br><br>\n• Hands-on Software Design &amp; Development\n<br><br>\n• Software Architecture &amp; Design\n<br><br>\n• Software Analysis &amp; Assessments\n<br><br>\n• User Engagement &amp; Experimentation\n<br><br>\n• Software Systems Engineering</div><br>\n\n<div>\n<div>Bachelor's Degree in Computer Science or\n<br>\nComputer Engineering or similar field. Candidate should possess the ability to\n<br>\nbe responsible for deliverables or parts of deliverables to MITRE customers.\n<br><br>\nPreferred Qualifications:\n<br><br>\nIn addition to possessing a degree in\n<br>\nSoftware Engineering, Computer Science, Computer Engineering or relevant\n<br>\ntechnical discipline with a focus on Enterprise Software, relevant knowledge in\n<br>\nthe following will improve your candidacy:\n<br><br>\n• \n<br>\nStrong understanding of full life cycle\n<br>\ndevelopment methodology skills including Agile methods, Continuous Integration/\n<br>\nContinuous Deployment (CI/CD) and DevOps\n<br><br>\n• \n<br>\nUnderstanding of the application of software\n<br>\nengineering methods\n<br><br>\n• \n<br>\nUnderstanding of enterprise and software frameworks,\n<br>\nWeb Services principles and Service Oriented Architecture (SOAs),\n<br>\nMicroservices, and Cloud-based implementations\n<br><br>\n• \n<br>\nExperience with Internet technologies such as\n<br>\nHTTP REST, HTTP SOAP, AJAX, web services, and related emerging web standards\n<br><br>\n• \n<br>\n<strong>“Hands-on” full stack development skills in:</strong>\n<br>\nJava, C++, C#, HTML, SQL\n<br><br>\n• \n<br>\nKnowledge and experience with JSON and XML\n<br>\ntechnology\n<br><br>\n• \n<br>\nExperience with cloud native computing,\n<br>\ncontainers, and frameworks\n<br><br>\n• \n<br>\nMobile platform development experience (iOS,\n<br>\nAndroid)\n<br><br>\n• \n<br>\nStrong oral/written communication skills</div>\n</div>\n </div>\n</div>\n </div>\n </div>\n</div>\n<br>"}