{"job title": "Senior Network Engineer", "company": "MITRE", "city state": "– San Diego, California", "rating": "3.2", "job description": "<div><div><div><div><div><div>Why choose between doing meaningful work and having a fulfilling life? At MITRE, you can have both. That's because MITRE people are committed to tackling our nation's toughest challenges—and we're committed to the long-term well-being of our employees. MITRE is different from most technology companies. We are a not-for-profit corporation chartered to work for the public interest, with no commercial conflicts to influence what we do. The R&amp;D centers we operate for the government create lasting impact in fields as diverse as cybersecurity, healthcare, aviation, defense, and enterprise transformation. We're making a difference every day—working for a safer, healthier, and more secure nation and world. Our workplace reflects our values. We offer competitive benefits, exceptional professional development opportunities, and a culture of innovation that embraces diversity, inclusion, flexibility, collaboration, and career growth. If this sounds like the choice you want to make, then choose MITRE—and make a difference with us.</div>\n<div> </div>\n<div>\n<div>We seek to expand our team of networking experts at MITRE’s San Diego, California site with staff capable of performing communications network engineering research and analysis tasks in support of the local work program. </div>\n<div> </div>\n<div>Key Functions: </div>\n<ul>\n<li>Vary per project and include: research, design, analysis, testing, experimentation, and/or modeling and simulation of communications networks to solve our nation’s most complex problems. </li>\n<li>If a specific project requires skills or knowledge of technologies with which the selected incumbent is unfamiliar, the expectation is to proactively reach back to fellow experts across MITRE to bring their expertise to bear</li>\n<li>Focus includes: research, design and analysis focused in networking, and does not involve administering, operating, troubleshooting, or otherwise maintaining a production communications network</li>\n<li>Posses fundamental understanding of and interest in networking protocols and principles, as well as the desire to learn more and focus in this area</li>\n<li>Passionate about communications networks</li></ul></div>\n<div> </div>\n<div> </div>\n<div> </div>\n<div> </div>\n \n \n \n\n \n \n \n \n \n <div>\n <div>Minimum Qualifications:</div>\n<ul>\n<li>BS and 3 years related experience</li>\n<li>\n<div>Applicants selected for this position will be subject to a government security investigation and must meet eligibility requirements for access to classified information or applicants who are eligible for security clearances.</div></li></ul>\n<p>Required Qualifications:</p>\n<p> </p>\n<p>B.S. in Computer Science, Electrical Engineering, Information Systems, or a related field</p>\n<div><br>Coursework, experience, or skills in at least three of the following areas, and possess a willingness to expand into additional areas with which they may not yet have experience:</div>\n<ul>\n<li>\n<div>Knowledge of TCP/IP networks and network architectures</div></li>\n<li>\n<div>Knowledge of standard networking protocols for transport (including MPLS), routing, and network services such as DNS, SNMP, NTP/PTP, etc.</div></li>\n<li>\n<div>Knowledge of wireless and SATCOM networks</div></li>\n<li>\n<div>Familiarity with Firewalls, VPNs, IDSs, HAIPEs, and other network security technologies</div></li>\n<li>\n<div>Experience with cloud technologies, data center networks, Software Defined Networking (SDN), and/or Network Function Virtualization (NFV)</div></li>\n<li>\n<div>Network modeling and simulation tools such as OPNET/Riverbed Modeler and Exata</div></li>\n<li>\n<div>Hands-on experience with the configuration of commercial IP routers, ethernet switches, and other standard networking equipment</div></li>\n<li>\n<div>Use of tools for network performance testing, management and troubleshooting (e.g. Wireshark)</div></li>\n<li>\n<div>Proficiency in one or more programming or scripting languages (Java, Python, etc.)</div></li></ul>\n<p>Key Attributes:</p>\n<ul>\n<li>Excellent written and verbal communication and presentation skills</li>\n<li>\n<div>Ability to work well in a collaborative team environment</div></li>\n<li>\n<div>Self-motivation to learn new technologies and flexibility to support tasking in a variety of areas</div></li>\n<li>\n<div>Initiative to work independently and exercise good judgment in the absence of supervision</div></li>\n<li>\n<div>Ability to obtain and maintain a DoD Secret level security clearance</div></li></ul>\n<p>Preferred Qualifications:</p>\n<ul>\n<li>MS or PhD with 3 years of experience, with expertise in any of these additional areas:</li>\n<li>\n<div>DoD, US Navy, and USMC network architectures and technologies</div></li>\n<li>\n<div>Navy and SPAWAR systems and organizations</div></li>\n<li>\n<div>Robust communication solutions for stressed environments</div></li>\n<li>\n<div>Demonstrated ability to assess sponsor needs and identify and propose viable technical solutions </div></li>\n<li>\n<div>Experience in experimentation, prototyping, and piloting</div></li>\n<li>\n<div>Professional Certifications; e.g. Cisco CCNA, Comptia Security+, CISSP</div></li></ul>\n<div><br></div>\n </div>\n \n \n\n \n <div>\n \n </div>\n \n\n \n </div>\n </div>\n </div>\n\n \n </div>\n\t</div>"}