{"job title": "Software Engineer - API (Ruby &amp; JavaScript)", "company": "OneLogin", "city state": "– Redmond, WA", "rating": "4.0", "job description": "<ul>\n<li><strong>Help us build the next generation of cloud-based Identity and Access Management (IAM) solutions</strong> </li>\n<li><strong>Be one of the first to join a brand new API team in our Redmond office</strong></li>\n<li><strong>Make a big impact in a flexible work environment with a strong focus on professional development</strong></li>\n</ul>\nOneLogin provides industry-leading, enterprise IAM solutions for every user, device, and application. We manage and secure millions of identities for thousands of enterprise customers. Headquartered in San Francisco, we're excited to bring our award-winning company culture to Seattle with the recent launch of our Redmond office.\n<br><br>\nAs part of building out a new API-focused team, we're looking for multiple talented <strong>Software Engineers</strong> with experience working in Ruby (Rails), JavaScript (Node.js), and the creation of RESTful Web Services. You'll come onboard a new group taking ownership of our endpoint API services. This team will play an integral part in maintaining our existing Ruby-based systems, while simultaneously working on the design development of a new API platform using node.js and the best modern web technologies.\n<br><br>\n<strong>What you'll be doing:</strong>\n\n<ul>\n<li>Architecture, design, and tooling for both current APIs and next-gen platform APIs (including authentication, privileges, versioning, rate limiting, usage tracking, etc)</li>\n<li>Own development and maintenance of all platform APIs and coordinate with other teams to support development of APIs in their areas</li>\n<li>Build and maintain our endpoint RESTful Web Services in Ruby with a focus on performance, security, and reliability</li>\n<li>Play an integral role in defining the technology and design of our next-gen API platform - using JavaScript (Node.js), or perhaps Golang or whatever we find is the best tool for the job</li>\n<li>Help implement a cutting-edge microservices architecture with Docker, Kubernetes, etc. on the public cloud</li>\n<li>Work in cross-functional teams, delivering new features while maintaining existing systems</li>\n</ul>\n<strong>What you can bring to the table:</strong>\n\n<ul>\n<li>Experience building scalable, enterprise applications including the design and implementation of RESTful Web Services or other APIs</li>\n<li>Strong ability in Ruby/Rails and at least a working knowledge of JavaScript or other languages</li>\n<li>Computer Science degree (or relevant industry experience with demonstrable CS fundamentals) and eligibility to work in the United States</li>\n<li><em>Bonus points for experience with:</em>  IAM technologies, migration or modernization of API platforms, microservices architecture, Docker, Kubernetes, AWS, or similar technologies</li>\n</ul>\n<strong>What's in it for you:</strong>\n\n<ul>\n<li>Join a small, close-knit team with the backing of a large company, and the opportunity to impact highly visible products already trusted by millions</li>\n<li>Award-winning company culture, strong local leadership, and great career development opportunities</li>\n<li>Competitive salary plus great perks including equity, full insurance (medical, dental, &amp; vision), unlimited time off, and flexible WFH policies</li>\n</ul>\nIf you are experienced developer who can deliver high-performance API design and implementation, this might just be the ideal opportunity for you.\n<br><br>\n<strong>Ready to make an impact? APPLY now for a quick and painless interview process, or learn more at</strong><strong> https://www.onelogin.com/company/culture</strong>\n<br><br>\nOur core values:\n\n<ul>\n<li>Security first - We make it our #1 priority to protect data and privacy. From the way we work to the technology we provide, security is top of mind</li>\n<li>Customer focused - We design for, listen to and partner with customers to come up with smart solutions that drive business value</li>\n<li>Collaborative - We take bold steps and work together to thrive across boundaries. We drive productivity as we grow as one team</li>\n<li>Accountable - We get things done and take ownership in our work. Showcasing consistent quality and pride to perform at the highest levels</li>\n<li>Creative - We embody creativity in everything we do. We embrace a diversity of ideas. We execute with ingenuity, flexibility, and agility</li>\n</ul>"}