{"job title": "Systems Engineer", "company": "Promontory Interfinancial Network", "city state": "– Arlington, VA", "rating": "4.7", "job description": "<strong>Systems Engineer</strong>\n<br><br>\n<strong>What is the role?</strong>\n<br><br>\nYou would be a key member of our IT Systems Engineering team responsible for providing the company with the highest standards in Systems and Data Center management. Your primary responsibility will be the design, installation, configuration, and maintenance of all company-wide computing infrastructure. You should possess the experience and qualifications to perform these core responsibilities:\n\n<ul>\n<li>Maintain and optimize Linux (Red Hat) systems and on-premises ISCSI storage units across multiple data centers;</li>\n<li>Guide systems initiatives that focus on migrating on-premises system to cloud platforms, such as AWS and Azure;</li>\n<li>Work with top talent in a fast-paced, entrepreneurial environment where automation and technical craftsmanship are a top priority;</li>\n<li>Independently create designs of solutions, or facilitate activities with a technical team to design solutions to complex business challenges;</li>\n<li>Operate across multiple projects simultaneously, and perform a variety of tasks from addressing production issues to designing new systems;</li>\n<li>Leverage commercial or custom solutions to maintain and optimize Promontory Network’s systems, storage, and application stacks;</li>\n<li>Operate a comprehensive backup and recovery plan using a combination of tools, scripts, and best practices;</li>\n<li>Support production environments during off-hours and weekends; candidate must be willing to provide 24/7 on-call support;</li>\n<li>Progress the automation of building systems using Continuous Delivery technologies, such as Ansible, Jenkins, and CloudFormation;</li>\n<li>Lead or participate in cross-functional IT projects that include work performed by development, database, network, application, and system engineers;</li>\n<li>Facilitate DevOps work by ensuring communication, collaboration, integration, and automation among the IT Operations and Development teams;</li>\n<li>Make critical support decisions to ensure system uptime and effectively manage incidents; and</li>\n<li>Understand monitoring metrics and translate them to proactive issue resolution to avoid customer impact.</li>\n</ul>\n<strong><strong>What qualifications are required?</strong></strong>\n<br><br>\nYou should possess the following experience, skills, and qualifications:\n\n<ul>\n<li>8 years of progressive hands-on experience in systems architecture, design, and operations</li>\n<li>A BS in computer science or equivalent experience</li>\n<li>Advanced knowledge of Red Hat Linux 6 and 7 operating systems</li>\n<li>Experienced with automation tools such as Ansible, Jenkins, Vagrant, and BitBucket</li>\n\n<strong></strong><li><strong>Fully versed in administering:</strong>\n\n\n<ul>\n<li>Dell EqualLogic SAN storage</li>\n<li>VMware hypervisor</li>\n<li>DNS and authentication services</li>\n<li>Systems-monitoring tools, such as Solarwinds and Splunk</li>\n<li>Satellite server management</li>\n</ul>\n\n</li>\n</ul>\n\n\n\n<ul>\n<li>Advanced knowledge of shell scripting tools, such as Bash, Python, and PowerShell</li>\n<li>Experienced in automated backup tools, such as NetBackup, systems hardening and performance tuning</li>\n<li>Knowledgeable in cloud deployment and security</li>\n<li>Exceptional written and oral communication skills</li>\n<li>Evidence of a strong foundation in data center operations with HA and 24x7 service levels</li>\n<li>Excellent organizational and planning skills with the ability to demonstrate mature, timely, and professional problem-solving abilities</li>\n<li>Must be customer-focused, self-directed, results/goal oriented, and demonstrate initiative</li>\n</ul>\nApply\n<br><br>\nPromontory Interfinancial Network, LLC is an Equal Opportunity Employer and does not discriminate on the basis of race, color, national origin, sex, religion, age, veteran status, disability, or sexual orientation in employment of the provision of services."}