{"job title": "Engineering Technician", "company": "Rudolph Technologies", "city state": "– Wilmington, MA", "rating": "3.5", "job description": "<strong>Engineering Technician</strong>\n<br><br>\n<strong>(R&amp;D Engineering Technician)</strong>\n<br><br>\nA highly-skilled, experienced, electro-mechanical technician is required to support prototype component assembly, construction of test fixtures, system upgrades, system maintenance, test execution and data collection. Experience with, and an understanding of, complex, software-controlled, semiconductor-manufacturing capital equipment is required. This role will contribute directly to the successful development of new, large-area, precision photolithographic equipment. Experience operating and troubleshooting at the system level and diagnosing at the component level is required. A working understanding of software controls is essential.\n<br><br>\nResponsibilities:\n<ul>\n<li>Work closely with product engineers to support R&amp;D engineering projects</li><li>Perform qualification testing, document test results, and write comprehensive reports to document performance of new sub-assemblies</li><li>Using engineering drawings and guidance from the lead engineer, assemble, test, and deliver operational test fixtures and prototype electro-mechanical assemblies</li><li>Install prototype assemblies on an existing systems for test and evaluation, ensuring that the assembly is properly installed and wired</li><li>Test, evaluate, troubleshoot and diagnose electronic and electro-mechanical issues at the system and component level</li><li>Develop proficiency in operating lithography equipment</li><li>Make measurements, perform tests, collect and tabulate data as required by the lead engineer</li><li>Meet assigned project schedules</li><li>Use various diagnostic equipment such as volt meters, oscilloscopes and precision mechanical measuring devices</li><li>Maintain rigorous lab notes and communicate findings clearly</li><li>May be required to travel to evaluate issues in the field, assist in escalations from product support or perform testing at customer sites as required</li>\n</ul>\nRequired Skills and Experience:\n<ul>\n<li>Minimum of an associates or technical certificate in engineering</li><li>Minimum of 2 to 4 years of experience in assembly, integration and calibrations of semiconductor capital equipment, photolithography or equivalent equipment in a clean room.</li><li>Or, a minimum of 5 years of experience in the assembly, test, troubleshooting, and repair of complex electro-mechanical assemblies</li><li>Ability to follow clearly prepared instruction and provide the requested result (e.g., assembly installation or data collection)</li><li>Ability to read and understand (with some guidance and explanation) engineering drawings, interconnection diagrams, wiring schematics</li><li>Ability to troubleshoot simple electrical problems at the circuit board level</li><li>Ability to troubleshoot mechanical problems in components or on the larger system</li><li>Experience with, and an understanding of, complex, software-controlled, semiconductor-manufacturing capital equipment is required</li><li>Ability to troubleshoot electrical wiring and communications problems</li><li>Competence with basic math</li><li>Proficiency with MS Word and Excel</li><li>3-d CAD experience, especially with Inventor is a plus</li><li>Available to travel to customer sites in Asia</li>\n</ul>\nRequired Attributes:\n<ul>\n<li>Self-starter</li><li>Good communicator</li><li>Pro-active, quickly reports issues and concerns to the cognitive engineer or program management</li><li>Team player, able to work with others, comfortable asking for assistance or guidance</li>\n</ul>\nWe are not currently accepting agency submissions for this position.\n<br><br>\nNo relocation assistance is available for this position.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}