{"job title": "Principal Software Engineer - Anti-Abuse", "company": "SendGrid", "city state": "– Denver, CO", "rating": "4.5", "job description": "The Anti-Abuse Engineering team touches every single customer with a mission to protect SendGrid from Bad Actors trying to access our systems. Leveraging big data and machine learning, you'll build backend systems and services in a multi-datacenter cloud environment. You'll ensure that we protect the sending reputation of SendGrid while creating opportunities for business growth by determining new ways to analyze and measure customer behavior that drive better business decisions. You'll bring the ability and experience to write complex backend services, communicate effectively with cross functional teams, and have a tremendous drive to hone your craft.\n<br><br>\nOur global headquarters, Denver, is home to our second generation product -- Marketing Campaigns, and hub for our technical operations team. Additionally, we wield machine learning and big data to combat The Evil that comes in the form of phishers and spammers and we ensure that each aspect of our customers' lifecycle is flawless so they have one less thing to worry about.\n<br><br>\n<strong>What You'll Do</strong>\n\n<ul>\n<li>Live by and champion our cultural values of Happy, Hungry, Honest, and Humble</li>\n<li>Design entire systems from scratch, end-to-end, that can fit into the SendGrid architecture</li>\n<li>Develop solutions for complex problems both independently and with team members</li>\n<li>Focus on designing and implementing systems for scalability, testability, supportability and maintainability</li>\n<li>Work with other teams to troubleshoot/determine resolution for complex issues across team domains</li>\n<li>Lead team initiatives and implementations from conception to completion</li>\n<li>Recommend and champion improvements to our software and drive improvements in quality of team's work output</li>\n<li>Provide technical coaching and mentorships</li>\n</ul>\nOur stack includes: Golang, Docker, Redis, Kafka, MySQL, AWS\n<br><br>\n<strong>About You</strong>\n\n<ul>\n<li>8+ years of software development experience in a modern programming language (Go, Python, Java, Ruby, or C++)</li>\n<li>Proficient across a highly diverse set of technologies (Docker, Go, Kubernetes, AWS, etc.)</li>\n<li>Ability to translate architecture vision into concrete system designs</li>\n<li>Experience with building reliable and robust software that tolerates and recovers from unreliable dependencies.</li>\n<li>Expert OO experience and software engineering expertise (coding, automated tests, profiling, monitoring, etc).</li> \n\n<li>Solid experience with Kafka and datastores like MySQL, Redis and DynamoDB are a plus</li>\n<li>An insatiable learner, curious and constantly pushing the boundary of what is possible.</li>\n<li>A background in, or experience with, defining and building Machine Learning models</li> \n\n<li>We're an agile, fast growing company and this job description isn't meant to be a complete list of your qualifications or all of the things you'll do</li>\n</ul>"}