{"job title": "Network Engineer II - Spectrum Enterprise", "company": "Spectrum", "city state": "– Cerritos, California", "rating": "3.0", "job description": "Spectrum Enterprise, a part of Charter Communications, is a national provider of scalable, fiber-based networking and managed services solutions. Solutions include Internet access, Ethernet and Managed Network Services, Voice solutions, TV solutions and Managed Application, Cloud Infrastructure and Managed Hosting Services. We work closely with clients to achieve greater business success by providing these right-fit solutions designed to meet their evolving needs. For more information, visit enterprise.spectrum.com. The broad Spectrum Enterprise portfolio includes Internet access, Ethernet access and networks, Voice and TV solutions extending to Managed IT solutions, including Application, Cloud Infrastructure and Managed Hosting Services offered by its affiliate, Navisite. We work closely with clients to achieve greater business success by providing these right-fit solutions designed to meet their evolving needs.\n<br><br>\n<strong>The Highlights</strong>\n<br>\nUnder general supervision, assists in the planning, forecasting, implementation, and identification of resource requirements for network systems basic to moderate complexity. Monitors protocol compatibility standards, develops and implements network enhancements and makes recommendations for improvement. Responsible for implementation of network architecture and designs.\n<br><br>\n<strong>What You Will Do</strong>\n\n<ul>\n<li>Actively and consistently support all efforts to simplify and enhance the customer experience</li><li>Participates in network planning, network architecture design and engineering</li><li>Integrates communication architectures, topologies, hardware, software, transmission and signaling links and protocols into complete network configurations</li><li>Evaluates new products, performs network problem resolution</li><li>Assists in the development and documentation of technical standards</li><li>Implements approved methods of procedure</li><li>Implements and assists in designing protocol compatibility standards, develops and implements network enhancements and makes recommendations for improvement</li><li>Works on projects/systems/issues of medium to high complexity surrounding network planning, configuration and optimization</li><li>Provides tier support across organizations</li><li>Works on one or more projects as a project team member, occasionally as a project team lead</li><li>Coaches less experienced staff</li><li>Adheres to industry specific local, state, and federal regulations, as applicable</li><li>Knows, understands and follows company policy</li><li>3 years data network experience</li><li>Performs other duties as requested by supervisor</li>\n</ul>\n\n<strong>Required Keys for Success</strong>\n\n<ul>\n<li>Ability to read, write and speak the English language to communicate with employees, customers, suppliers, in person, on the phone, and by written communications in a clear, straight-forward, and professional manner</li><li>Ability to use personal computer and software applications</li><li>Proficient data networking knowledge (OSI Model, TCP/IP, Optical Transport)</li><li>Ability to work in a team environment</li><li>Proficient knowledge of related industry specifications and standards IEEE, ANSI, Fiber (Multimode, Single mode, UTP, etc.), Bridging, Switching, Routing, Ethernet and Transport technologies and protocols</li><li>Proficient Knowledge in network design, network architecture, protocols and network topology</li><li>Proficient knowledge in using ticketing and software tools to support the current operations</li><li>Proficient Knowledge of basic network devices and basic network appliances</li><li>Proficient knowledge of network designing software, such as Visio</li><li>Ability to perform duties in a very fast pace environment and ability to learn new technology quickly</li><li>Knowledge of Microsoft Office</li>\n</ul>\n\n<strong>How You Will Stand Out from the Crowd</strong>\n\n<ul>\n<li>Knowledge of company products and services</li>\n</ul>\n\n<strong>Your Education</strong>\n\n<ul>\n<li>Bachelor's Degree in Computer Science, Electrical Engineering, or related field or equivalent work experience</li><li>Cisco Certified Network Professional (CCNP or CCIP)</li> <li>Industry and vendor specific certifications and training (Cisco, Juniper, Alcatel-Lucent, etc.)</li>\n</ul>\n\n<strong>What You Can Expect</strong>\n\n<ul>\n<li>Office Environment</li><li>May work in Network Lab environment</li><li>24X7 Network Operations environment</li><li>Occasional travel as required</li>\n</ul>"}