{"job title": "Database Administrator", "company": "Stonecrop Technologies LLC", "city state": "– Garland, TX", "rating": "2.5", "job description": "The promise of a connected future requires increasingly complex networks that are capital intensive to build. Stonecrop Technologies leverages software, mobile technology and supply chain expertise to reduce the cost and time required to develop, build and maintain telecommunications networks.\n<br><br>\nEstablished in 2001, Stonecrop continues to disrupt the way communications networks are deployed through a system of coordinated software applications and processes that align network design, supply chain, and installation. Stonecrop operates a national integrated logistics network with nearly 2 million square-feet of distribution space across 90+ U.S. cities.\n<br><br>\nWe are an established company with a start-up culture; successful because we know how to shake things up, ask the difficult questions, and collaborate with our clients to break industry paradigms. Our employees embody our company values: teamwork, innovation, and self-directed initiative.\n<br><br>\nStonecrop Technologies is currently accepting applications for a PostgreSQL Database Administrator.\n<br><br>\n<strong>What you will be doing:</strong>\n\n<ul>\n\n\t<li>Provide technical expertise and support in the use of DBMS.</li>\n\n<li>Evaluate and recommend available DBMS products to support validated user requirements.</li>\n\n<li>Define file organization, indexing methods, and security procedures for specific user applications.</li>\n\n<li>Create and maintain database objects such as tables, views, index, constraints, etc. for data platform and custom applications.</li>\n\n<li>Develop, implement, and maintain database backup and recovery procedures for the processing environments, and ensures that data integrity, security, and recoverability are built into the DBMS applications.</li>\n\n<li>Design and implement automation using scripts, must be proficient in scripting.</li>\n\n<li>Monitor and maintain the backups for database recoverability for all production databases.</li>\n</ul>\n<strong>Education:</strong>\n\n<ul>\n\n\t<li>Bachelor's Degree from an accredited college or university with a major in Computer Science, Information Systems, Engineering, Business, or other related scientific or technical discipline.</li>\n\n\n<li>Certified PostgreSQL DBA is preferred.</li>\n\n\n\n</ul>\n<strong>Experience:</strong>\n\n<ul>\n\n\t<li>At least seven (7) years of experience in administering on-prem/cloud based multi user environment with expertise in planning, designing, building, and implementing complex database systems.</li>\n\n<li>Experience working in the database domain with proven experience managing all operations of RDBMS databases such as Oracle/SQL Server with a minimum of two (2) years of PostgreSQL DB.</li>\n\n<li>In depth knowledge of the PostgreSQL DB architecture.</li>\n\n<li>Prior AWS cloud base Postgres database administration experience</li>\n\n<li>Drive end to end availability, performance monitoring, and capacity planning for PostgreSQL, using native and 3rd party tools.</li>\n\n<li>Experience Implementing automated methods and industry best practices for consistent installation and configuration of PostgreSQL for production, pre-production and non-production environments.</li>\n\n<li>Conducting technical reviews and Walkthroughs of system design documentation with development and design team members.</li>\n\n<li>Administration of PostgreSQL databases throughout the non-production (Sandbox, development, test, UAT, Training), pre-production (Staging) and production lifecycles in an AWS environment.</li>\n\n<li>Designing and develop logical and physical database designs from application requirements.</li>\n\n<li>Designing and implement automation using scripts. <strong>(</strong><em>must be proficient in scripting).</em></li>\n<li>Designing and implement replication and backups for mission critical/tier-1 applications.</li>\n\n<li>Ensuring optimal database performance through exhaustive pro-active testing and ongoing real-time monitoring.</li>\n\n<li>Testing database security and enterprise policy guidelines according to established best practices.</li>\n</ul>\n<strong>Bonus Points:</strong>\n\n<ul>\n\n\t<li>Oracle DBA experience</li>\n\n<li>Dataguard replication services</li>\n</ul>"}