{"job title": "Systems Engineering Manager (ICE)", "company": "Travelport", "city state": "– ATLANTA", "rating": "3.1", "job description": "<strong>Title</strong>\n<br>\nSystems Engineering Manager (ICE)\n<br><br>\n14-Aug-2018\n<br><br>\n<strong>Job Description</strong>\n<br>\nThe Systems Engineer Manager is responsible for supporting the development and communication of the overall test environment strategy for the organization and ensuring that it is aligned with corporate objectives. The Systems Engineer Manager is responsible for working within the business framework in securing a proper budget for the Test System Environments team (Team) to support the test environment’s strategy and corporate initiatives and ensure spend rates are aligned with budget. The Systems Engineer Manager is required to maintain technical knowledge and trends within the industry and drive innovation and continuous improvements throughout the organization and customer iterations on these environments. The Systems Engineer Manager is responsible for leading a skilled team consisting of Test/System engineering and Delivery roles in a matrixed organizational structure including partnering with the managed service provider of onshore and offshore contractors.\n<br><br>\n<strong>Main Accountabilities</strong>\n\n<ul>\n<li>Responsible for supporting the development and communication of the overall test environment strategy to ensure alignment with key business initiatives that could consist of cloud computing, technology transformations, strategic architecture direction, and shift-left methodologies.</li> <li>Responsible for establishing the strategy that may consist of, but not limited to, data management and refresh schedule, production staging environments, alpha and production checkout nodes, test system integration with up-line and downline code and system configurations including customer test systems, continuous integration and continuous deployment support, End-2-End testing and monitoring and cloud implementations and cloud based tools.</li> <li>Responsible for ensuring the Team is well-versed in the test environment strategy and can clearly communicate and execute on it.</li> <li>Leads the Team in designing, documenting and implementing quality processes, standards, best practices and KPIs that apply to the Team and communicate them across the lines of business (LoB).</li> <li>Coordinates the Team with Travelport organizations such as; product teams, IS, and architecture to resolve customer issues.</li><li>Leads the Team to actively and frequently engage with key stakeholders across the LoB’S including Architecture, Development and Delivery Manager to assess test environment issues and initiate, track and prioritize remediation activity.</li> <li>Leads the implementation of continuous quality improvements to improve reliability of test systems, improved speed in remediation of issues, closer alignment with product delivery requirements, and proactive measures to improve overall quality of test environments that will result in reduced impact to project schedules and cost related to those delays.</li> <li>Manages the balance of resources required to support the constant changing project work flow that consists of direct hire employees, onshore and offshore contracting resources, fixed-bid, time and material, and managed services agreements.</li> <li>Supports a dynamic and flexible work force that is required to support the constant changing priorities, project schedules, and technology through cross-training, documentation, and mentoring programs.</li> <li>Builds and maintains business relations across the Travelport LoBs to ensure Quality Management Organization is providing the required services and support in meeting their business objectives and seen as “enablers” and proactive in their engagement.</li> <li>Tracks, reports and makes required adjustments necessary to maintain budget across the organization, focusing priority on capitalized work while minimizing maintenance and support activity.</li> <li>Leads the Team in establishing strong relationships while engaging early with the project teams assisting in the build out, maintenance and integration of their environment with other test system environments.</li> <li>Establishes and implements KPI metrics (process capability, control charts, measurement quality) for monitoring system effectiveness that enable leads/managers to make sound product quality decisions and distributes required information out to key stakeholders in the various LoBs.</li> <li>Develops, reviews and approves statements of work, time charging, and requisitions for the team.</li> <li>Performs other reasonable duties that may consist of production support, enhancing business processes, budgeting, operations, monitoring and customer support as required.</li> <li>Establish and maintain Information Technology Infrastructure Library (ITIL) and alignment with “move to production” processes required to support Travelport LoBs.</li> \n</ul>\n\n<strong>Knowledge, Skills, Experience, Training, Education</strong>\n\n<ul>\n<li>Strong business leader with a Degree in IT engineering, computing science, or business.\n\n<ul>\n<li>10-15+ years’ experience leading software and delivery in commercial software or in the implementation and maintenance of infrastructure in a large global organization including:</li> <li>8+ years application development experience required</li><li>Experience in quality management, technical strategy, architecture, project management, and business governance</li><li>Knowledgeable in common software development languages, code deployment, monitoring, databases, various operating systems and network protocols.</li> <li>Experience in managing and delivering multiple concurrently multi-million dollar projects annually</li> <li>Proven track record of driving change and managing high performing product and technology teams in a multinational, distributed and complex matrix environments.</li> </ul></li>\n<li>Innovative, organized and proactive professional with a positive and energetic attitude.</li> <li>Experienced in various software delivery methodologies with emphasis on Agile.</li> <li>Experienced in the practice, operations and implementation of Agile, Lean, DevOps, CI/CD teams</li> <li>Able to deliver consistently on schedule and within budget and willing to working extra hours to meet organizational commitments.</li> <li>Very strong interpersonal and communication skills able to effectively communicate with internal and external customers. Able to represent the best interest of the QA COE / Quality Management Organization goals and objectives and handle potential conflict situations where disagreements exist.</li> <li>Remain current on technical trends in the industry and where applicable, introduce those new technologies and trends into the organization.</li><li>Has working knowledge of test and programming technologies such as: HP Unified Functional Tester, SOAP UI, JUnit, selenium, Load runner and various other common IT industrial tools.</li> <li>ITIL Certification</li>\n</ul>\n\n<strong>Key Measures</strong>\n<br><br>\nThis position requires a large degree of interaction with peers and immediate supervisor, and some interaction with senior management, other Travelport groups and/or external customers.\n<br><br>\nRequire the ability to work with people from the different functional areas within the Technology organization.\n<br><br>\n<strong>Auto req ID</strong>\n<br>\n<strong>6028BR</strong>\n<br><br>\n<strong>Employee type</strong>\n<br>\nEmployee\n<br><br>\n<strong>Employment type</strong>\n<br>\nRegular - Full Time\n<br><br>\n<strong>Office location</strong>\n<br>\n<strong>US - ATLANTA - DATA CENTER, US - ATLANTA - HQ</strong>\n<br><br>\n<strong>Functional Area</strong>\n<br>\nTechnology\n<br>"}