{"job title": "Industrial Engineering Project Leader", "company": "Wawa", "city state": "– Wawa, PA", "rating": "3.7", "job description": "<div><div><div><div><div>\n<div><strong>Date Posted:</strong></div>5/8/2018</div><br>\n\n<div>\n<div><strong>Requisition Number:</strong></div>22481</div><br>\n\n <div>\n<div><strong>City:</strong></div>Wawa</div><br>\n\n <div>\n<div><strong>State:</strong></div>PA</div><br>\n\n <div>\n<div><strong>Country:</strong></div>United States of America</div><br>\n\n <div>\n<div><strong>Department:</strong></div>Marketing</div><br>\n\n <div>\n<div><strong>Travel Percentage:</strong></div>10-20</div><br>\n\n <div>\n<div><strong>Employment Status:</strong></div>Full Time</div><br>\n\n<div>\n<div>Description</div> \n<br>\n <div><strong><u>Position Summary</u></strong><u>:</u> The Operations Engineering Project Leader uses a process engineering approach to drive improvements which reduce complexity, lower operating costs, improve labor productivity, maximize throughput capacity, and enhance customer speed of service. Responsible for supporting all Wawa departments with development of efficient processes, test and evaluation of equipment, study and analysis of key systems, and design of critical work cells and store layout concepts. Key partners with Marketing, Store Operations, Product Development, Store Effectiveness, Store Design, Construction, Facilities and Strategic Sourcing to drive new initiatives which increase shareholder value.\n<br><br>\n<strong><u>Principal Duties</u></strong>\n<ul>\n<li>Lead sub-teams within key strategic programs to develop work cell designs which assure efficient operation for Associates and provide a great experience to Customers.</li><li>Manage day-to-day responsibilities within the Innovation &amp; Design Center and all work that is completed in the area. Capable of creating mock-up conceptual designs and properly plan/execute simulation trials in the Innovation &amp; Design Center.</li><li>Test and evaluate potential store equipment and supplies which are targeted for new initiatives or are required to improve current store performance. Work closely with Strategic Sourcing and equipment manufacturers to:\n\n<ul>\n<li>maximize life cycle of equipment</li><li>deliver great product quality</li><li>assure energy efficiency in design</li><li>provide a great customer experience</li><li>approve final recommendation and design</li></ul></li>\n<li>Champion innovation through new design initiatives, and “feed the pipeline” with concepts that convert into successful business strategies. Responsible for the application and evaluation of the latest technology like 3D Design Modeling to enhance store operating systems, work cell layouts, and equipment.</li><li>Lead strategic Operations Engineering projects to develop operating processes that will improve productivity, profitability, and customer satisfaction.</li><li>Lead effort to develop proper time study methodology and complete studies which analyze impact of labor, efficiency, and capacity. Provide all critical labor time requirements to feed into the Store Operations Labor Scheduler model.</li><li>Develop all methodology and maintain database which defines capacity needs for Store Operations to meet customer demand.</li><li>Assist Product Development in test of new products and defining proper cooking methods to meet product quality standards. Conduct all portioning testing and manage database to assure product costs are properly documented.</li><li>Design and optimize backroom systems to maximize storage needs and provide Associates with proper space to complete day-to-day work.</li><li>Support and assist in development of training materials and refinement of job aids, as well as in the communication of new methods and processes within Wawa.</li><li>Report results to cross-functional teams and members of management through engineering reports or formal presentations. Operations Engineering Project Leaders are the “objective voice” to programs through a “facts and data” report out process.</li><li>Ensure that Operations Engineering functions are conducted on a timely basis through the creation of action plans to deliver targeted goal to internal customers. Ensure that resources are used to produce accurate, practical, and actionable results.</li><li>Travel to stores to study processes, support roll-out of key programs, and drive change.</li>\n</ul>\n<strong><u>Essential Functions:</u></strong>\n<ul>\n<li>Ability to work well individually as well as in a team environment</li><li>Excellent oral and written communication skills</li><li>Excellent customer service skills</li><li>Ability to work with little or no supervision</li><li>Detail oriented and excellent organizational and project planning skills</li><li>Excellent analytical, financial analysis and problem solving skills</li><li>Ability to handle multiple projects simultaneously and independently</li><li>Excellent interpersonal and presentation skills</li><li>Self motivated, proven self starter with demonstrated ability to make decisions</li><li>Excellent leadership skills</li><li>Ability to travel 25% of the time</li><li>Highly observant of operating techniques, situations, and conditions</li></ul></div>\n</div><br>\n\n<div>\n<div>Minimum Requirements</div> \n<br>\n <div>\n\n<ul>\n<li>Bachelor’s Degree in Industrial Engineering preferred</li><li>5 years of experience in technical related field or Wawa Store Operations</li><li>Demonstrated ability as a project lead for multiple technical programs</li><li>Highly proficient with Microsoft Excel and Microsoft Access</li><li>Experience with AutoCAD and/or 3D Design Modeling (Sketchup or Revit) preferred</li><li>Highly proficient in process design and time study methodologies</li><li>Must be able to occasionally move and lift up to 25lbs</li><li>Performs the following physical behaviors frequently throughout their shift: standing, walking</li><li>Performs the following physical behaviors occasionally during their shift: bending, stooping, squatting, crouching, kneeling, pushing, reaching below the waist, reaching horizontally, reaching above the shoulder, grasping firmly and pushing buttons.</li></ul></div>\n</div>\n</div>\n<br>Wawa<br>\n<div>\nApply Now</div>\n</div><br>\n\n<div>\n<div>\n\n\n<ul>\n\n \n<li>\n<br><br>\nBack to Results</li>\n<br><br>\n<li>Save this Job</li>\n<br><br>\n<li>Refer this Job</li>\n</ul><br>\n\n<div>\nApply Now</div>\n</div>\n </div>\n </div>\n</div>\n\n<br>"}