{"job title": "Technologist, Product Development Manufacturing Firmware Engineer", "company": "Western Digital Corporation", "city state": "– Milpitas, CA", "rating": "3.3", "job description": "<strong>Description</strong>\n<br><br>\nWestern Digital®\n<br><br>\nWe deliver the possibilities of data. <strong>YOU</strong> define what’s possible.\n<br><br>\n<strong>ESSENTIAL DUTIES AND RESPONSIBILITIES:</strong>\n<br><br>\nIn this position, the individual will develop and implement new algorithms in SSD manufacturing firmware based on the product and manufacturing requirements. The individual with analyze firmware requirements to determine feasibility of design within time and cost constraints, evaluate various architectures and implementations of ASIC controllers and firmware, and support Failure Analysis (FA) from manufacturing failures, customer returns or qualification failures.\n<br><br>\n<strong>QUALIFICATIONS</strong>\n<br><br>\n•Requires BS/BA degree or equivalent with 7 or more years of related experience.\n<br><br>\n•Computer Architecture/Micro architecture.\n<br><br>\n•Excellent programming skills in C/C++\n<br><br>\n•Working knowledge of algorithm development\n<br><br>\n•Low level firmware/software design, development, debug skills.\n<br><br>\n•Scripting in Python, Perl etc\n<br><br>\n•Strong knowledge of digital electronics and circuits\n<br><br>\n•Basic knowledge of SAS and PCIe protocol\n<br><br>\n•Good working knowledge of various bench systems (i.e. oscilloscopes, logic analyzers, and meters)\n<br><br>\n•The ideal individual must have proven ability to achieve results in a fast moving, dynamic environment.\n<br><br>\n•Self‐motivated and self‐directed, however, must have demonstrated ability to work well with people.\n<br><br>\n•A proven desire to work as a team member, both on the same team and outside of the team.\n<br><br>\n•Ability to work effectively cross‐functionally.\n<br><br>\n•Ability to troubleshoot and analyze complex problems.\n<br><br>\n•Ability to multi‐task and meet deadlines.\n<br><br>\n•Excellent communication (written and verbal) and interpersonal skills.\n<br><br>\n<strong>ABOUT WESTERN DIGITAL</strong>\n<br><br>\nWestern Digital Corporation is the world’s largest data storage company with a leading portfolio of HGST, SanDisk, G-Technology and WD brands covering flash and disk-based solutions. Deployed by the largest and most prominent organizations worldwide, Western Digital solutions are everywhere, touching lives and enabling great value from the data they possess.\n<br><br>\nWestern Digital is an equal opportunity employer. We are committed to providing equal employment opportunity for all applicants and employees. Western Digital does not unlawfully discriminate and complies with the laws and regulations set forth in the following EEO Is The Law poster: Equal Employment Opportunity Is The Law.\n<br><br>\nWestern Digital participates in the E-Verify program in the US. For more information click here. Este empleador participa in E-Verify.\n<br><br>\n#LI-MM1"}