{"job title": "Engineering Manager", "company": "Yesware, Inc.", "city state": "– Boston, MA, US", "rating": "4.5", "job description": "<div>\n<strong>Engineering Manager</strong></div><br>\n<div>\nYesware is seeking an Engineering Manager to join our talented development team. We have created a feature-rich backend architecture and data platform along with apps for Gmail, Outlook, and the web. Together these provide the leading prescriptive sales platform, which serves over 100K sales professionals worldwide.</div><br>\n<div>\nWe value the insights and creativity of our engineers. You'll manage engineers in our extraordinarily talented engineering team, helping reinforce our culture of fostering innovation and excellence in engineering practices. You wont be coding every day, but youll collaborate with engineers to solve our most complex technical challenges.</div><br>\n<div>\nBecause you will be tasked with delivering maintainable, well-documented software, and because some of your teammates may be remote, we highly value written communication skills at Yesware. As such, we require all engineering applicants to please provide a cover letter in their application. We look forward to hearing from you!</div> <br>\n<strong></strong><div><strong>\nResponsibilities</strong>:</div>\n\n<br>\n\n<ul>\n\n<li>\nManage 2 or more small, highly focused and effective teams of 2-6 engineers each.</li>\n<li>\nMentor engineers as they advance in their careers by fostering the growth of technical, problem-solving and communication skills.</li>\n<li>\nLevel up the team through smart hiring, skills development, and cross-training.</li>\n<li>\nLead and deliver key engineering initiatives.</li>\n<li>\nIdentify and implement development process and methodology improvements to increase quality and pace of development.</li> \n<li>\nWork with Customer Success to respond to customer impacting issues.</li>\n<li>\nWork with Product Management to contribute to the strategic direction of the company.</li>\n</ul>\n\n<div><strong>Requirements:</strong></div><ul>\n\n<li>\nExperience implementing and leading successful engineering teams.</li>\n<li>\nExtensive experience building full-stack web applications.</li>\n<li>\nBachelor's or Master's degree in Computer Science or the real-world equivalent.</li>\n<li>\nExcellent software development habits: object-oriented design, unit testing, integration testing, data structures, etc.</li>\n<li>\nA hands-on attitude and a willingness to get things done.</li>\n<li>\nExcellent oral and written communication skills.</li>\n<li>\nEmotional maturity and adaptability.</li>\n</ul><br>\n\n<div><strong>Nice to Haves:</strong></div><ul>\n\n<li>\nExposure to architectural patterns of a large, high-scale web application (e.g., well-designed APIs, high volume data pipelines, efficient algorithms).</li>\n<li>\nExperience working with SQL and/or NoSQL databases at scale.</li>\n<li>\nExperience developing SaaS offerings.</li>\n<li>\nA desire to learn the other tools in our stack.</li>\n</ul><br>\n\n<div><strong>About the Company:</strong></div><br>\n<div>\nYesware is a team of smart, ambitious, kind people working together to empower each other and our customers. We build, market, and sell a one-of-a-kind sales platform that helps salespeople sell smarter, right from their inbox.</div><br>\n<div>\nYou can find us in our 15th floor office, conveniently located in downtown Boston. We offer competitive compensation comprised of salary, equity and bonuses. We also offer a growing list of benefits: health, dental, 401(k), life insurance, flexible spending account, as well as gym and public transportation reimbursement. Don't worry about vacation, you can take it when you need it. Additional perks include weekly wellness classes, professional coaching, free daily catered lunch, and a ride home with Uber when you need it.</div><br>\n<div>\nYesware is proud to be venture-backed by investors including the Foundry Group, Battery Ventures, and Google Ventures. Our customers range from young startups of all sizes, to some of the biggest names in business, like Yelp, Acquia, Groupon, Zendesk, and many more. We live out our core values everyday in a mission to serve our customers and to make Yesware the best place weve ever worked.</div><br>\n<div>\nYesware is committed to developing a culture that embraces diversity and fosters inclusivity. We do this not only because it makes us stronger both as individuals and as a business, but because it is the right thing to do. We know that diversity comes in many forms, so we welcome employees from all walks of life to bring their differing experiences and perspectives to Yesware. Together, we can build an environment where every single member of our team can bring their authentic self to work, be heard, and work toward achieving their professional potential.</div>"}