{"job title": "Software Tools Engineer", "company": "Yesware, Inc.", "city state": "– Boston, MA, US", "rating": "4.5", "job description": "<div>\n<strong>Software Tools Engineer</strong></div><br>\n<div>\nYesware is seeking a Software Tools Engineer to join our talented development team. We have created a feature-rich backend architecture and data platform along with apps for Gmail, Outlook, and the web. Together these provide the leading prescriptive sales platform, which serves over 100K sales professionals worldwide.</div><br>\n<div>\nWe value the insights and creativity of our engineers. You'll work side-by-side with other engineers to create high-quality internal products at a fast pace. Our culture fosters innovation and excellence in engineering practices, and your primary responsibility will be to help facilitate those practices. We have an internal open-source model in which you'll learn and extend the rest of our technology stack to realize tools and infrastructure that will enhance both our engineer processes as well as our product offerings.</div><br>\n<div>\nBecause you will be tasked with delivering maintainable, well-documented software, and because some of your teammates may be remote, we highly value written communication skills at Yesware. As such, we require all engineering applicants to please provide a cover letter in their application. We look forward to hearing from you!</div> <br>\n<strong></strong><div><strong>\nResponsibilities</strong>:</div>\n\n<br>\n\n<ul>\n\n<li>\nExtend existing development and deployment tools used by Engineering and Operations teams.</li>\n<li>\nPush engineering to find more efficient ways to meet our customers expectations before our customers experience these bottlenecks.</li>\n<li>\nHelp support and scale infrastructure for a large cloud-hosted SaaS platform.</li> \n<li>\nDevelop, enhance, and review test automation tools, frameworks, and infrastructure.</li>\n</ul>\n\n<div><strong>Requirements:</strong></div><ul>\n\n<li>\nIndustry experience in software development in a Unix-based environment. (Minimum of 3 years, additional experience highly valued.)</li>\n<li>\nDevelopment experience in Python, Ruby, or similar environments.</li>\n<li>\nExperience implementing development tools such as version control systems, build or test systems, deployment utilities, etc.</li>\n<li>\nExcellent software development habits: object-oriented design, unit testing, integration testing, data structures, etc.</li>\n<li>\nFamiliarity with database technologies and concepts.</li>\n<li>\nA hands-on attitude and a willingness to get things done.</li>\n<li>\nExcellent oral and written communication skills.</li>\n<li>\nEmotional maturity and adaptability.</li>\n</ul><br>\n\n<div><strong>Nice to Haves:</strong></div><ul>\n\n<li>\nEvidence of exposure to architectural patterns of a large, high-scale web application (e.g., well-designed APIs, high volume data pipelines, efficient algorithms).</li>\n<li>\nExperience working with SQL and/or NoSQL databases at scale.</li>\n<li>\nExperience supporting cloud-hosted SaaS applications in a Dev Ops capacity</li>\n<li>\nExperience developing SaaS offerings.</li>\n<li>\nA desire to learn the other tools in our stack.</li>\n</ul><br>\n\n<div><strong>About the Company:</strong></div><br>\n<div>\nYesware is a team of smart, ambitious, kind people working together to empower each other and our customers. We build, market, and sell a one-of-a-kind sales platform that helps salespeople sell smarter, right from their inbox.</div><br>\n<div>\nYou can find us in our 15th floor office, conveniently located in downtown Boston. We offer competitive compensation comprised of salary, equity and bonuses. We also offer a growing list of benefits: health, dental, 401(k), life insurance, flexible spending account, as well as gym and public transportation reimbursement. Don't worry about vacation, you can take it when you need it. Additional perks include weekly wellness classes, professional coaching, free daily catered lunch, and a ride home with Uber when you need it.</div><br>\n<div>\nYesware is proud to be venture-backed by investors including the Foundry Group, Battery Ventures, and Google Ventures. Our customers range from young startups of all sizes, to some of the biggest names in business, like Yelp, Acquia, Groupon, Zendesk, and many more. We live out our core values everyday in a mission to serve our customers and to make Yesware the best place weve ever worked.</div><br>\n<div>\nYesware is committed to developing a culture that embraces diversity and fosters inclusivity. We do this not only because it makes us stronger both as individuals and as a business, but because it is the right thing to do. We know that diversity comes in many forms, so we welcome employees from all walks of life to bring their differing experiences and perspectives to Yesware. Together, we can build an environment where every single member of our team can bring their authentic self to work, be heard, and work toward achieving their professional potential.</div>"}