{"job title": "Senior Data Scientist", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAmazon delights millions of customers around the world. Meet the behind the scenes team that enables our Human Resource and Operations Leaders to make informed decisions. The Amazon PeopleInsight team builds reporting and analytics tools for our teams that fulfill customer promise every day. Whether it is Fulfillment Center team that delivers your Prime order in two days, our Amazon Locker team that lets you pick up your package anytime that is convenient for you, our Prime Now team getting you lunch in under an hour, or one of many more, the PeopleInsight group is there providing people metrics along the employee lifecycle for our global operations businesses. The PeopleInsight team is a collaborative group of Business Analysts, Business Intelligence Engineers, Data Engineers, Data Scientists, Economists, Product Managers, and Program Managers that studies a workforce numbering in the hundreds of thousands. Our work is dedicated to empowering leaders and enabling action through data and science. In addition to standard reporting, we leverage predictive analytics to help our leaders focus their efforts in ways that will engage, retain and grow their associates. <br> <br> We are now recruiting for an exceptional Senior Data Scientist, Global Operations<br> <br> The ideal candidate will be:<br> · A Well-Rounded Athlete –Like a true athlete, you understand that we succeed or fail as a team. You are always ready to step up beyond your core responsibilities and go the extra mile for the project and your team. You nimbly overcome barriers to deliver the best products more quickly than expected.<br> · A Perpetual Student – You seek knowledge and insight. You challenge yourself to turn moments into master’s classes. Whether closing a gap, developing a new skill, or staying ahead of your industry, you revel in the joy of learning and growing.<br> · A Skilled Communicator – You excel when interacting with business and technical partners whether you are chatting, sending a written message, or conducting a presentation.<br> · A Trusted Advisor – You work closely with stakeholders to define key business needs and deliver on commitments. You enable effective decision making by retrieving and aggregating data from multiple sources and compiling it into a digestible and actionable format.<br> · An Inventor at Heart – You innovate on behalf of your customer by proactively implementing improvements, enhancements, and customizations. Your customers marvel at your creative solutions to challenges they had not yet identified.<br> · A Fearless Explorer – You are drawn to take on the hardest problems, navigate ambiguity, and battle skepticism. You never settle, even in the face of overwhelming obstacles.<br> <br> Roles and Responsibilities<br> Like stones skipping across the water’s surface, you will study known or emerging concerns. Each new insight will be a splash with ripples that impact our associates and business. You will seek to understand all aspects of the associate experience. You will inform senior business leaders by providing associate insights that will guide attraction, retention, and more. You will inject science into the practice of HR at Amazon. Dorothy may have been focused on lions, tigers, and bears while on her journey to Oz, but our mantra is algorithms, models, and AI. <br> <br> Amazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation.<br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· Masters in quantitative field (Computer Science, Mathematics, Machine Learning, AI, Statistics, or equivalent) with 4+ years of experience working in data science in a consumer product company OR Bachelors in quantitative field (Computer Science, Mathematics, Machine Learning, AI, Statistics, or equivalent) with 8+ years of experience. <br> · Ability to distill informal customer requirements into problem definitions, dealing with ambiguity and competing objectives<br> · Ability to manage and quantify improvement in customer experience or value for the business resulting from research outcomes<br> · Experience hiring and leading experienced scientists as well as a successful record of developing junior members to a successful career track<br> · Superior verbal and written communication skills, ability to convey rigorous mathematical concepts and considerations to non-experts.<br> · Project management experience for working on cross-functional projects<br> · Proven achievements of developing and managing a long-term research vision and portfolio of research initiatives, with algorithms and models that have been successfully integrated in production systems<br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· Extensive knowledge and practical experience in several of the following areas: machine learning, statistics, NLP, deep learning, recommendation systems, dialogue systems, information retrieval<br> · Skilled with Java, C++, or other programming language, as well as with R, MATLAB, Python or similar scripting language<br> · Professional experience in software development (software design and development life cycle)<br> · Ability to distill informal customer requirements into problem definitions, dealing with ambiguity and competing objectives<br> · Ability to manage and quantify improvement in customer experience or value for the business resulting from research outcomes<br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}