{"job title": "Data Scientist", "company": "Ascensia Diabetes Care", "city state": "– Valhalla, NY", "rating": "3.0", "job description": "Data Scientist (RD0057)\n<br><br>\nAscensia Diabetes Care\n<br><br>\n20 reviews\n\n<li>Valhalla, NY</li>\n\nAscensia Diabetes Care\n<br><br>\n20 reviews\n<br><br>\nRead what people are saying about working here.\n<br><br>\nAscensia Diabetes Care is a global specialist diabetes care company, dedicated to helping people living with diabetes. Our mission is to empower people living with diabetes through innovative solutions that simplify and improve their lives. We use our innovation and specialist expertise in diabetes to develop high quality solutions and tools that make a positive, daily difference for people with diabetes.\n<br><br>\nPOSITION PURPOSE:The ideal candidate will be intricately involved in running analytical experiments in a methodical manner and will regularly evaluate alternate models via theoretical approaches. Responsibilities include analyses of various data streams, utilization of large data sets to determine unique insights to further business needs. This includes finding innovative ways to combine fields of data that don?t naturally mesh together as well as exploratory data analysis in order to navigate a dataset and come out with conclusions based on certain assumptions. Creation of meaningful data visualizations that communicates findings and relate them back to how your insights create business impact.\n<br><br>\nWork autonomously and be comfortable building projects from start to finish. Position participates in projects and makes proposals for new and innovative projects within the R&amp;D environment. Uses expertise gained through a wide exposure of previous assignments and by focusing on areas for planning, scheduling, organizing, performance management, financial management and administrative skills.\n<br><br>\n<strong>MAJOR TASKS AND RESPONSIBILITIES OF POSITION:</strong>\n<br><br>\n+ Research and develop statistical learning models for data analysis\n<br><br>\n+ Analyze business needs and produce results that meet strategic objectives\n<br><br>\n+ Optimize information architecture to promote usability, while accommodating technical needs/constraints.\n<br><br>\n+ Understands and ensures strict compliance to applicable processes; collaborates to ensure cross-functional process requirements e.g., regulatory are met.\n<br><br>\n+ Collaborate with product management and engineering departments to understand company needs and devise possible solutions\n<br><br>\n+ Possess ability to present, interpret, and recommend to senior management the results of work including the development including the development of new concepts, major advances in technology, new major applications, and progress on all product programs.\n<br><br>\n+ Keep up-to-date with latest technology trends.\n<br><br>\n+ Implement new statistical or other mathematical methodologies as needed for specific models or analysis.\n<br><br>\n<strong>QUALIFICATIONS:</strong>\n<br><br>\n+ Experience in a fast-paced software development environment, and an ability to execute against aggressive timelines\n<br><br>\n+ Proven ability to influence cross-functional teams without formal authority\n<br><br>\n+ Highly creative and inquisitive; able to multitask effectively\n<br><br>\n+ Deep knowledge of statistical tests, distributions, maximum likelihood estimators\n<br><br>\n+ Sound experience with Python and/or R\n<br><br>\n+ Experience with statistical programming languages and a database querying language like SQL.\n<br><br>\n+ Experience with machine learning methods like k-nearest neighbors, random forests, ensemble methods and more.\n<br><br>\n+ Data-driven problem-solver\n<br><br>\n+ Degree in Computer Science, Engineering, Statistics, Technical Science or 4+ years of IT/Programming experience\n<br><br>\n+ Experience in and understanding of data and information management, especially in Big Data trends\n<br><br>\n+ Health care industry experience is a plus\n<br><br>\n+ Experience with development in regulated environment is a plus\n<br><br>\n+ Experience with medical devices or software is a plus\n<br><br>\n+ MS: 4 years of experience\n<br><br>\n+ BS: 6 years of experience\n<br><br>\nYOUR APPLICATION:Ascensia offers a wide variety of competitive compensation and benefits programs. If you meet the requirements of this unique opportunity, and are driven by innovation and the desire to improve the lives of our patients, we encourage you to apply now. Job postings will remain open for a minimum of five business days and are subject to immediate closure thereafter without additional notice.\n<br><br>\nTO ALL RECRUITMENT AGENCIES:Ascensia does not accept unsolicited third party resumes.\n<br><br>\nAscensia is an Equal Opportunity Employer.\n<br><br>\n<strong>IND123</strong>\n<br><br>\nJob Type: Full-time\n<br><br>\n<strong>Experience:</strong>\n<br><br>\n+ statistical programming languages: 4 years (Preferred)\n<br><br>\n+ machine learning methods: 4 years (Preferred)\n<br><br>\n+ regulated environment: 2 years (Preferred)\n<br><br>\n+ Python and/or R: 4 years (Preferred)\n<br><br>\n+ medical device industry: 2 years (Preferred)"}