{"job title": "Supply Chain &amp; Quality Assurance Data Analyst", "company": "Blue Buffalo", "city state": "– Wilton, Connecticut", "rating": "3.7", "job description": "<strong><u>GENERAL DESCRIPTION – PURPOSE OF ROLE:</u></strong>\n<br><br>\n<strong>Responsible for development and execution of all quality data initiatives and ongoing programs, ensuring data quality throughout Blue’s Quality and Operations department, as well as internal and external communications across a variety of teams and platforms.</strong>\n<br><br>\n<strong><u>Looking for:</u></strong>\n<br><br>\n<strong>Motivated, results-oriented, and dynamic professional interested in developing programs and processes leading to productive, high quality, and innovative operations.</strong>\n<br><br>\n<strong>Analytical and organized as well as highly adaptable, proactive in approach to problem solving, and proven in aptitude for anticipating how quality processes impact the big picture.</strong>\n<br><br>\n<strong>Proven expertise in problem resolution and progression of the work program, to identify needs and take responsibility for SAP Application Systems teams and to plan and implement internal initiatives.</strong>\n<br><br>\n<strong>Skilled communicator able to build collaborative relationships with cross-functional peers, external operations, and motivate teams to exceed expectations.</strong>\n<br><br>\n<strong></strong>\n<br><br>\n<strong><u>ESSENTIAL FUNCTIONS:</u></strong>\n<br><br>\n<strong>Proficient user of Product Lifecycle Management system within the SAP environment. Collaborating with all stakeholders in coordinating all functions of the system to ensure end to end successful product creation through set up in material master and through to manufacturing.</strong>\n<br><br>\n<strong>Training of essential users: including research &amp; development formula management, regulatory, package engineering and procurement. Including system usage, defining workflows, monitoring usage and ensuring quality and integrity in the system output and upkeep.</strong>\n<br><br>\n<strong>Tracking new product data and changes in existing product data to ensure it progresses through the process correctly and is communicated appropriately.</strong>\n<br><br>\n<strong>Executing updates to our external web portal site to communicate with co-manufacturers and co-packers, to publish product specifications and updates, and changes to processes and procedures. Will also assist in developing and expanding the portal site for our internal manufacturing and warehouse sites.</strong>\n<br><br>\n<strong>Working with decision makers in other department to identify, recommend, develop, implement solutions, including organizational change management.</strong>\n<br><br>\n<strong>Being involved in short and long-term strategic direction and roadmap for SAP application systems with the IT, Quality and Operations team</strong>\n<br><br>\n<strong>Developing future data migration strategies internally and externally to insure complete data integrity across all phases of product development through production and analysis.</strong>\n<br><br>\n<strong>Writing and implementing training material for all quality systems, existing and future.</strong>\n<br><br>\n<strong>Ensures the administration of company's quality, process and business improvement efforts</strong>\n<br><br>\n<strong><u>Functional Skills</u></strong><strong><u>:</u></strong>\n<br><br>\n<strong>Ability to handle multiple priorities and work independently</strong>\n<br><br>\n<strong>Ability to work in a fast paced environment</strong>\n<br><br>\n<strong>Ability to follow instructions and dependable in the execution of established procedures</strong>\n<br><br>\n<strong>Ability to take the initiative, work as a team and identify/communicate ways to improve efficiency</strong>\n<br><br>\n<strong><u>QUALIFICATIONS:</u></strong>\n<br><br>\n<strong>3-5 years SAP Material Management/ERP/Product Lifecycle Management</strong>\n<br><br>\n<strong>2-5 years Data Quality Compliance experience</strong>\n<br><br>\n<strong>Strong Knowledge of product(s) design and assembly bills of materials and dependencies</strong>\n<br><br>\n<strong>Experience with data migration, data bases, SQL and statistical analysis</strong>\n<br><br>\n<strong>Working knowledge in some or all aspects of quality, supply chain and manufacturing</strong>\n<br><br>\n<strong>Experience in file creation/maintenance/and routing processes of documents and workflows</strong>\n<br><br>\n<strong>Advanced Microsoft Excel skills required</strong>\n<br><br>\n<strong>Must be able to work in an environment with free-roaming pets.</strong>\n<br><br>\n<strong><u>PREFERRED SKILLS, COMPETENCIES AND EXPERIENCE:</u></strong>\n<br><br>\n<strong>SAP – Material Management/ERP/PLM/HANA</strong>\n<br><br>\n<strong>Advanced Excel Skills</strong>\n<br><br>\n<strong>SQL</strong>\n<br><br>\n<strong>SharePoint</strong>\n<br><br>\n<strong>Experience with Minitab, LIMS a plus</strong>\n<br><br>\n<strong>Pet Parent Preferred</strong>\n<br><br>\n<strong><u>EDUCATION REQUIREMENTS:</u></strong>\n<br><br>\n<strong>BS degree in IT Data Science, Mathematics, Engineering, Chemistry or Food Science</strong>"}