{"job title": "Data Scientist", "company": "Bose", "city state": "– US, MA - Framingham", "rating": "3.6", "job description": "<u><strong>Job Description</strong></u><br><br>Responsible for mining, analyzing, and modeling large structured and unstructured datasets, and applying advanced statistical predictive models and leading machine learning algorithms to solve business questions. Creatively translate business problems into a subset of data science problems that leverage appropriate methodology (e.g., classification, regression, probability estimation, etc.), evaluate the results rigorously, and transform the results into insights and recommendations that are clearly communicated to the business. Identify and leverage appropriate tools/techniques. Work with data systems professionals to develop the infrastructure and format for new data sources so they can be leveraged and analyzed. Champion and educate the business and product owners on ways to extract value from data that can be collected from our products or externally.<br><br>Bose is an equal opportunity employer that is committed to inclusion and diversity. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, age, disability, veteran status, or any other legally protected characteristics. For additional information, please review: (1) the EEO is the Law Poster (http://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf); and (2) its Supplements (http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm). Please note, the company's pay transparency is available at http://www.dol.gov/ofccp/pdf/.pdf. Bose is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the application or employment process, please send an e-mail to Wellbeing@bose.com and let us know the nature of your request and your contact information."}