{"job title": "Data Scientist", "company": "Envision Resource Group", "city state": "– Miami, FL", "rating": "NA", "job description": "Job Description<div>This Fortune 500 company is seeking an experienced Commercial and Industrial Fuel Sales Executive! This position offers a salary, strong benefits, flexibility, and a strong commission structure!\n<br><br>\n<strong>Position</strong>: Data Scientist, senior person (5-8 years of experience in this field).\n<br><br>\n<strong>Need:</strong> The key here is someone with machine learning and AI experience. They're doing a lot of machine learning work there. I would even search the term \"machine learning\".\n<br><br>\nJob Description:\n<br><br>\nKey Areas of Responsibility\n<br><br>\nWorks on diverse data sets (transactional, external, CRM, structured, semi-structured, etc.) to develop machine learning models that can be used to generate revenue management insights and recommendations.\n<br><br>\nPerforms statistical analyses on data sets to determine trends and develop business understanding of commercial activity. Work with Amazon Web Services Machine Learning Stack and additional tools for machine learning to drive process improvement and efficiencies.\n<br><br>\nWorks with operations, sales and supply teams to help shape business objectives and prioritization using a methodical, data-driven approach to decision making.\n<br><br>\nAssists in resolving ambiguous issues and find the insights that drive operational, support and product excellence.\n<br><br>\nUnderstanding of the concepts and values of Advanced Analytics, Machine Learning and Artificial Intelligence, turning data into insight and direction.\n<br><br>\nMay be involved in the Areas of Pricing Strategy, Credit Risk and Exposure Management, Inventory management, customer satisfaction, Purchasing strategy, Unit Margin Management, asset optimization and other corporate and operational areas.\n<br><br>\nPresents findings in written and verbal format to business leadership.\n<br><br>\nBuilds and maintain positive on-going cooperative relationships with internal stakeholders\n<br><br>\nProvides support to the rest of the team and to Champions in the Business\n<br><br>\nGathers, communicates and manages issues and risks\n<br><br>\nArchitects, builds and manages secure and efficient solutions in with appropriate data management discipline, aligning to any corporate or external standards that are communicated as guidance\n<br><br>\nDrive continuous improvement through measurement and monitoring\n<br><br>\nQualifications\n<br><br>\nBachelor’s degree with an emphasis on quantitative or technical work (Computer Science, Statistics, Mathematics).\n<br><br>\nAt least 4 -6 years’ in the role of Data Scientist with hands-on experience in full lifecycle development of real-world corporate applications using machine learning models and pipelines.\n<br><br>\n4 years minimum experience in data management, data transformation and reporting/visualization.\n<br><br>\n3+ years experience working with RDBMs and SQL.\n<br><br>\nProficiency in one or more programming languages (excellent knowledge of Python is required).\n<br><br>\nDeep knowledge of machine learning algorithms and libraries/frameworks.\n<br><br>\nAbility to prioritize multiple conflicting priorities while driving towards pragmatic decisions/actions\n<br><br>\nDeploying machine learning models in distributed / cloud computing.\n<br><br>\nDesigning high performance, resilient implementations\n<br><br>\nPreferred Qualifications\n<br><br>\nMaster’s Degree in Computer Science, Statistics or related fields.\n<br><br>\nStrong oral and written communication skills, including the ability to communicate complex findings in a structured and clear manner to a non-technical audience.\n<br><br>\nKnowledge of one or more visualization tools such as Tableau. Experience gathering reporting and analytics requirements from stakeholders, deriving business insights, and evaluating the impact of business decisions.\n<br><br>\nExperience working in an Agile environment.</div>"}