{"job title": "Senior Machine Learning Scientist", "company": "Freenome", "city state": "– South San Francisco, CA, US", "rating": "5.0", "job description": "<div>\n<strong>What is Freenome?</strong></div><div>\nFreenome is a health technology company bringing accurate, accessible and non-invasive disease screenings to you and your doctor to proactively treat cancer and other diseases at their most manageable stages. Freenome is a place where you can do your best, most meaningful work, and contribute to a whole new way of thinking about curing cancer. Its a data-driven, diverse company at the intersection of biology, technology and medicine.</div><div>\n<strong>Our Mission</strong> </div><div>\nEquip you and your family with knowledge and tools to maintain a healthier life and prevent disease.</div><br>\n<div>\n<strong>About the Role</strong></div><div>\nAs a machine learning engineer at Freenome, you will be an integral part of our R&amp;D team, working in close collaboration with computational biologists and software engineers to develop and deploy the statistical models driving our mission of early detection and intervention in human disease.</div><div>\n<strong>Responsibilities</strong></div>\n\n<ul>\n\n<li>\nCollaborate within an interdisciplinary technical team to develop your science into Freenomes product</li>\n<li>\nParticipate in cutting edge research in statistical modeling and inference of biological problems (including cancer research, genomics, computational biology/bioinformatics, immunology, therapeutics, and more)</li>\n<li>\nBuild and immediately apply core analysis technologies to solve patients and doctors healthcare needs</li>\n<li>\nDiscover science that generalizes in support of a long term research program in data driven biology</li>\n<li>\nInterface with product teams to identify potential new problem areas in need of an ML solution</li>\n<li>\nTake a mindful, transparent, and humane approach to your work</li>\n</ul>\n\n<div>\n<strong>\n<br>\nWhat We're Looking For</strong></div>\n\n<ul>\n\n<li>\nPhD (or equivalent research experience) in computer science (AI or ML emphasis), statistics, applied math, or a related field</li>\n<li>\nExpertise, demonstrated by research publications or industrial experience, in applied machine learning, data mining, pattern recognition, or AI</li>\n<li>\nExperience building statistical models from a variety of input data types: text, images, audio, structured data, time series events, etc</li>\n<li>\nProficiency in a general-purpose programming language: Python, Java, C, C++, etc</li>\n<li>\nFamiliarity working in a Linux server-based environment</li>\n<li>\nStrong knowledge of mathematical fundamentals: statistics, probability theory, linear algebra</li>\n<li>\nPractical and theoretical understanding of fundamental models and algorithms in supervised and unsupervised learning: generalized linear models, kernel machines, decision trees, neural networks; boosting and model aggregation; clustering and mixture modeling; EM, variational inference, and local/global optimization; dimensionality reduction and manifold learning</li>\n<li>\nAbility to clearly communicate across disciplines and work collaboratively towards next steps in experimental iterations</li>\n</ul>\n\n<div>\n<strong>Nice to Haves</strong></div>\n\n<ul>\n\n<li>\nDomain-specific experience in computational biology, genomics or a related field</li>\n<li>\nExperience in scientific parallel computing</li>\n<li>\nExperience in high-performance computing, including SIMD or GPU performance optimization</li>\n<li>\nExperience in a production software engineering environment, including use of automated regression testing, version control, and deployment systems</li>\n</ul>\n\n<div>\n<strong>Freenomes culture</strong></div><div>\nOur culture is simple. We value Empathy, Trust and Integrity. We feel from the perspectives of each other, patients and the communities we serve. We give each other the benefit of the doubt and believe were all working as a team towards our goals. We conduct ourselves with integrity, empowering others to grow in a collaborative environment. Freenome explicitly prohibits any form of workplace harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status.</div><br>\n<div>\n<strong>What does a successful person look like at Freenome?</strong></div><div>\nYou can prioritize, manage and execute your goals and align them to the mission of Freenome. Youre a steward of the culture and hold yourself and the team accountable. You believe hiring and mentorship are fundamental to building the organization. You bring ownership to your role, focus on your process and find the gaps to help Freenome reach its full potential. You welcome feedback and criticism knowing its value is to build people up and support each other, rather than tearing each other down.</div>"}