{"job title": "Data Scientist", "company": "Intrepid Pursuits", "city state": "– Boston, MA", "rating": "4.0", "job description": "<div><div>Acquired by Accenture Digital in June 2017 and founded in 2010, Intrepid is an end-to-end mobile design and development studio with headquarters in Cambridge, MA and offices in NYC and Houston. With expertise in insightful product strategy, well-crafted design and development for iOS, Android, Web and Rails, we help companies, from startup to enterprise, boldly navigate their mobile future.</div> <div><strong>Accenture Digital</strong></div><div>The digital revolution is changing everything, transforming how we work and play, and Accenture Digital is leading the way - driving these exciting changes across 40 industries in more than 120 countries. Designing and implementing cutting-edge digital solutions for leading businesses and governments around the world, you will be creating real ‘wow moments’ for customers, connecting them with our clients through advanced analytics, interactive, social media and mobility. Join us and become an integral part of our experienced digital team with the credibility, expertise and insight clients depend on, to better serve their connected customers and operate always-on enterprises.</div> <div><strong>Job Description:</strong></div><div>We are looking for a seasoned data scientist who uses advanced statistical analysis and machine learning algorithms to meet our clients’ needs.</div></div><div><div>Key responsibilities include:\n\n<ul>\n\n\n<ul>\n<li>Client-facing interaction including providing analyses, recommendations, presentations and advice to clients.</li><li>Adapts existing methods and procedures to create possible alternative solutions to moderately complex problems.</li><li>Understands the strategic direction set by senior management as it relates to team goals.</li><li>Uses considerable judgment to determine solution and seeks guidance on complex problems.</li><li>Determines methods and procedures on new assignments with guidance.</li><li>Project-based analytics including but not limited to Big Data Analytics, Digital Analytics, Customer Segmentation, Propensity / Churn Models, Marketing Mix Modeling, Multi-Channel Attribution, Pricing and Promotion, Trade Analytics, Markdown Optimization, Demand Forecasting</li> </ul>\n</ul>\n\n</div>\n<br>\n<div><div>Basic Qualifications:\n<br>\n\n\n<ul>\n\n\n<ul>\n<li>Minimum of Bachelor's Degree required in related field; strong preference for fields of study in the data science, economics, statistics, and social sciences</li><li>Minimum of 3 years of hands-on development experience</li><li>Minimum of 3 years expertise with the Microsoft suite (including advanced Excel skills with embedded Pivot Tables &amp; Macros; advanced PowerPoint usage)</li><li>At least 2 years of experience with predictive analytics and BI tools which may include at least two applications from R / Revo R, SAS, Python, Spark, and Tableau.</li><li>Minimum of 2 years of experience working with big data technologies and data management tools such as Hadoop, SQL, or Infomatica</li></ul>\n</ul>\n\n</div>\n<br>\n<div><div>Set Yourself Apart (Preferred Qualifications):\n<br>\n\n\n<ul>\n\n\n<ul>\n<li>Possess a blend of consulting expertise and analytical capabilities that creates value</li> <li>Experience in the analysis of marketing databases using SAS or other statistical modeling tools</li><li>Experience with analytic projects in the following areas: Applied Statistics/Econometrics, Statistical Programming, Database Marketing Management &amp; Operations, Digital, Marketing Intelligence &amp; Competitive Analysis</li><li>Has project management, time management and communication skills necessary to execute the responsibilities and deliver against client expectations</li><li>Demonstrated teamwork and collaboration in a professional setting</li><li>Excellent written and oral communication skills with ability to clearly communicate ideas and results to non-technical business people</li></ul>\n</ul>\n\n</div>\n</div><div><div>Applicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States and with Accenture.</div> <div>Candidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.</div><div>Accenture is an EEO and Affirmative Action Employer of Females/Minorities/Veterans/Individuals with Disabilities.</div><div>Equal Employment Opportunity</div><div>All employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.</div><div>Job candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process.</div><div>Accenture is committed to providing veteran employment opportunities to our service men and women.</div></div></div></div>"}