{"job title": "Staff Scientist - Systems Analyst", "company": "MIT Lincoln Laboratory", "city state": "– Lexington, MA", "rating": "3.9", "job description": "<div>\nStaff Scientist - Systems Analyst\n<br>\n Apply now »<br>\n\n <div>\nApply now \n\n\n<ul>\n\n \n<li>\n<br>\n<br>\n Start apply with LinkedIn</li>\n<br><br>\n<li>\n<br>\n<br>\n Start apply with Facebook</li>\n<br><br>\n<li>\n<br>\n Apply Now</li><br>\n\n<div>\n<div>\n<div>\nStart</div>\n </div>\n </div>\n\n<br><li>\n <div>\n<strong>Please wait...</strong></div>\n</li>\n\n</ul>\n\n </div>\n</div>\n<br><strong>Date:</strong> \n<br>\n Aug 8, 2018\n<br><br>\n<strong>Location:</strong>\n<br><br>\n MA, US<br><br>#job-location.job-location-inline {\n<br>\n display: inline;\n<br>\n }<br><br><strong>Company:</strong> \n<br>\n MIT Lincoln Laboratory<br>\n<div>The Homeland Protection Systems Group conducts systems analysis on a broad range of problems related to surface surveillance, force protection, and homeland defense. Activities include sensor and system modeling, mission requirements analysis, and architecture development. A variety of technologies are examined, including radar, optical, acoustic, biological, and chemical sensors. Modeling and the analysis of field measurements are used to quantify the ability of current and proposed technology to meet mission requirements. This work includes analysis, algorithm development, and field testing.\n<br><br>\nThe Homeland Protection Systems group is seeking a candidate who will work on a broad range of problems related to homeland protection missions, architecture design, and technology performance assessment. The work will require an ability to understand a variety of sensing modalities (e.g. electro-optical, radar, etc.), platforms (e.g. airborne, maritime, etc.) and end-to-end data exploitation techniques (signature detection, automatic tracking, pattern recognition, etc.). Activities involve systems analysis, data analysis, physics-based modeling, and software simulation.\n<br><br>\nThe candidate must work in both a team-oriented environment and independently. The candidate must have excellent written and verbal communication skills. At a minimum, candidates should have a Ph.D. in Physics, Applied Mathematics, EE or a related discipline. In lieu of a Ph.D., a M.S. with at least 5 years of directly related experience will be considered.\n<br><br>\nExperience in the following areas is required:\n\n<ul>\n\n\t<li>Ability to quickly learn new technical areas and apply that knowledge effectively to solve challenging mission problems</li>\n<li>Knowledge to develop, implement, test and evaluate novel algorithms and concepts</li>\n<li>The ability to clearly present technical concepts to a wide spectrum of audiences</li>\n<li>Proficient at high-level prototyping software languages (e.g., Matlab, Python)</li>\n</ul>\nExperience in the following areas is desired:\n\n<ul>\n\n\t<li>RF system design and/or testing</li>\n<li>Signal processing, computer vision techniques, pattern recognition algorithm development</li>\n<li>Java, C/C++/C#</li>\n</ul>\nMIT Lincoln Laboratory is an Equal Employment Opportunity (EEO) employer. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, veteran status, disability status, or genetic information; U.S. citizenship is required.\n<br><br>\n<strong>Job Segment:</strong> \n<br>\n Chemistry, Scientific, Chemical Research, Systems Analyst, Scientist, Science, Engineering, Technology</div><br>\n\n <div>\nApply now »<br>\n\n <div>\nApply now \n\n\n<ul>\n\n \n<li>\n<br>\n<br>\n Start apply with LinkedIn</li>\n<br><br>\n<li>\n<br>\n<br>\n Start apply with Facebook</li>\n<br><br>\n<li>\n<br>\n Apply Now</li><br>\n\n<div>\n<div>\n<div>\nStart</div>\n </div>\n </div>\n\n<br><li>\n <div>\n<strong>Please wait...</strong></div>\n</li>\n\n</ul>\n\n </div>\n</div>\n\n<br>"}