{"job title": "Data Scientist", "company": "Murmuration", "city state": "– New York, NY", "rating": "1.0", "job description": "<strong>Data Scientist</strong>\n<br><br>\n<strong>Who We Are</strong>\n<br><br>\nMurmuration is an organization dedicated to sustainable policy change in the U.S., and we believe that the path to real change in America’s education system is through political activism and participation. Together with our partners, we develop shared infrastructure and coordinated support for organizations on the ground to massively improve outcomes for all children. We do this by working directly with local schools and organizations to amplify the voices of parents and families as key stakeholders in setting education policy.\n<br><br>\nAs part of our work, Murmuration has developed a technology product called “m{insights” that seeks to aggregate data from a combination of sources including member data from partner organizations, publicly available data, consumer data, voter file data, and more. The compiled data are then used to build a variety of analytic models and tools that enable Murmuration’s partner organizations to activate, expand, and mobilize their supporter bases effectively for sustained political change.\n<br><br>\n<strong>About the Position</strong>\n<br><br>\nWe are looking for a creative and endlessly inquisitive Data Scientist to join our team. You will be working hand-in-hand with our Director of Analytics to develop highly optimized predictive models from a large volume of regularly updated data and to design experiments to test the effectiveness of various campaign tactics. In addition, you will be a key resource for building out custom analytics to help analyze our partners’ work in the political and advocacy spheres. You will be working in a small but dedicated, detail-oriented team that is committed to our mission. The Murmuration work environment is friendly, driven, and non-corporate but professional.\n<br><br>\n<strong>The Data Scientist will:</strong>\n\n<ul>\n<li>Create predictive analytics using the latest machine learning algorithms on relatively “big” data (hundreds of features on &gt; 100 million records)</li>\n\n<li>Provide analytic insights for partners throughout the lifecycle of their campaign(s); build, review, and recommend custom models; provide real-time visualizations and analysis of campaign work; and produce post-campaign analytics to help our partners constantly learn from their efforts</li>\n\n<li>Design and implement large-scale randomized controlled trials to gauge the general effectiveness of advocacy and campaign efforts</li>\n\n<li>Produce post-mortem analytics on the advocacy and campaign work being performed in our platform to help our partners constantly learn from their efforts</li>\n\n<li>Conduct various analyses to infer causality from large sets of behavioral data</li>\n\n<li>Work closely with the data engineering team to analyze and augment our data</li>\n\n<li>Work closely with our business analysts to draft clear and informative data visualizations</li>\n\n<li>Work with our staff and partners to develop practical ways to apply our leading analytics to the real world</li>\n\n<li>Help optimize our analytic work to perform well on large datasets stored in Amazon Web Services (AWS)</li>\n\n<li>Never stop asking questions and always be hunting for the next impactful insight</li>\n</ul>\n<strong>Candidate Profile</strong>\n<br><br>\nMurmuration attracts employees with distinctive and diverse backgrounds and accomplishments. Integrity, creativity, flexibility, and drive are key attributes of competitive candidates. The Data and Analytics teams are highly collaborative, friendly and hard-working, and we are looking for a Data Scientist who embodies those values.\n<br><br>\nThe ideal candidate will have:\n\n<ul>\n<li>PhD in political science, sociology, mathematics, statistics or other related field or 4-5 years of experience performing data analysis work as described below</li>\n\n<li>Excellent general data science skills (data cleaning, munging, data visualization)</li>\n\n<li>Excellent Python or R skills</li>\n\n<li>Experience building machine learning models on large datasets</li>\n\n<li>Experience identifying appropriate statistical techniques and applying them to a variety of real-world datasets</li>\n\n<li>Strong problem-solving skills as well as the ability to manage several tasks/projects concurrently and prioritize work effectively</li>\n\n<li>Experience with databases and knowledge of SQL preferred</li>\n\n<li>Experience with Amazon Web Services, in particular applying analytics in that setting (desired not required)</li>\n\n<li>Interest in politics and/or educational policy</li>\n</ul>\n<strong>Location</strong>\n<br><br>\nThis position will be based in New York, NY, and requires occasional travel.\n<br><br>\n<strong>Compensation</strong>\n<br><br>\nThe DataScientistpositionis a full-time, salaried position with a comprehensive benefits package. Compensation for this position is commensurate with experience.\n<br><br>\n<strong>An Equal-Opportunity Employer with a Commitment to Diversity</strong>\n<br><br>\nMurmuration is proud to be an equal opportunity employer, and as an organization committed to diversity and the perspective of all voices, we consider applicants equally of race, gender, color, sexual orientation, religion, marital status, disability, political affiliation and national origin. We reasonably accommodate staff members and/or applicants with disabilities, provided they are otherwise able to perform the essential functions of the job."}