{"job title": "Data Scientist", "company": "Pluralsight", "city state": "– Boston, Massachusetts", "rating": "4.2", "job description": "Company Description<br><br><strong>About Pluralsight</strong>\n<br><br>\nFounded in 2004 and trusted by Fortune 500 companies, Pluralsight is <em><strong>the</strong></em> technology learning platform organizations and individuals in 150+ countries count on to innovate faster and create progress for the world.\n<br><br>\n<strong>Working at Pluralsight</strong>\n<br><br>\nAt Pluralsight, we believe everyone should have the opportunity to create progress through technology. That everyone should have access to the skills of tomorrow. That technology can make the world a better place. Through the work we do everyday, we empower the people who power our world.\n<br><br>\nAnd we dont let fear, egos or drama distract us from our mission. Were adults, and we treat each other that way. We have the autonomy to do our jobs, transparency to eliminate office politics and trust each other to do the right thing. We thrive in an environment with creativity around every corner, challenges that keep us on our toes, and peers who inspire us to be the best we can be. We bring different viewpoints, backgrounds and experiences, and united by our mission, we are one.<br><br>Job Description<br><br><strong>The Opportunity</strong>\n<br><br>\nPluralsight Iris is the learning intelligence platform built within Pluralsight. It helps technologists worldwide discover the learning they need to achieve their personal and career goals in technology.\n<br><br>\nAs a data scientist on our core team, you will help us you will help us solve novel statistical, machine learning, and data science problems by building and improving on the intelligence of Iris. We are looking for an experienced data scientist who loves tackling ambiguous problems, finding creative and practical solutions, and producing concrete prototypes that will become a key part of Pluralsights user experience. Youll work closely with an established team of top-notch, collaborative data scientists and you will collaborate with a cross-functional product team that is responsible for one of Pluralsights key differentiators.\n<br><br>\n<strong>Who you are:</strong>\n<ul>\n<li>You have a strong foundation in Machine Learning, Computer Science, and Statistics.</li><li>You have a creative mindset and excellent critical thinking skills.</li><li>You know your way around SQL-like databases (e.g. PostGres, Impala, Hive) and even better if have experience with Spark and other big data platforms.</li><li>You have mastery of Python programming and at least some exposure to R. Regardless of your favorite scientific computing environment, you can flex between the two languages.</li><li>You are able to perform rapid prototyping of experimental solutions, writing readable, scalable, and reproducible code.</li><li>You have a solid data science toolkit that you can leverage, with knowledge of and understanding of how and when to apply different algorithms and technical approaches.</li><li>You can describe and speak in an approachable way about complex analyses and concepts within a cross-functional team. You are a great analytic translator.</li>\n</ul>\n<strong>What youll do:</strong>\n<ul>\n<li>You will collaborate with the Iris product teams to define data science solutions needed to drive our user experience outcomes.</li> <li>You will create, iterate, and innovate on Iris algorithms and partner to implement them on the Pluralsight platform.</li><li>You will guide the research and development of new product features, in alignment with product strategy</li><li>You will propose and design experiments to test new product features and analyze their results.</li>\n</ul>\n\nQualifications<br><br><strong>Experience youll need:</strong>\n<ul>\n<li>M.S. or Ph.D in Computer Science, Statistics, Mathematics, Data Science, or related field</li><li>Ideally a minimum of 3 years in a data science role, developing algorithms and building prototypes</li><li>Experience working with product development teams and/or with developers</li>\n</ul>\n\nAdditional Information<br><br>Be Yourself. Pluralsight is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status."}