{"job title": "Data Scientist", "company": "Point72", "city state": "– New York", "rating": "3.7", "job description": "What you’ll do\nThe Data Scientist/ Statistician will drive innovation by using alternative data sources in creative ways to enhance the performance of our Long/Short investment platform. You will be responsible for:\n<li>\n\t<p>Serving as an expert statistician/data scientist on a discretionary investment team</p>\n\t</li><li>\n\t<p>Testing research hypotheses and assumptions of portfolio manager and investment analysts by designing methodology and writing necessary code to perform backtesting, cross-validation, event studies, data analysis, etc.</p>\n\t</li><li>\n\t<p>Testing and identifying the most predictive and robust statistical methods to forecast factors, features, metrics, drivers, etc. relevant to portfolio manager and research analysts in making investment decisions</p>\n\t</li><li>\n\t<p>Work closely with team’s data engineer/systems developer to help specify best sources, format, and delivery mechanism of data</p>\n\t</li><li>\n\t<p>Writing efficient, modular, and dependable code, packages, libraries, and scripts</p>\n\t</li><li>\n\t<p>Documenting all work extensively and train teammates on use of work products (e.g., custom Python libraries or R packages)</p>\n\t</li><li>\n\t<p>Work closely with team’s data engineer/systems developer and portfolio manager to design research (e.g., backtesting software) and production (e.g., trade file creation) processes</p>\n\t</li><li>\n\t<p>Collaborating regularly with firm’s Big Data group and other firm resources</p>\n\t</li><li>\n\t<p>Staying abreast of new research in statistics, machine learning, and deep learning</p>\n\t</li>\nWhat’s required?\n<li>\n\t<p>Be an expert in statistical analysis</p>\n\t</li><li>\n\t<p>Have strong programming skills in SQL/NoSQL and at least one of the following Python, R, or C++</p>\n\t</li><li>\n\t<p>Hold an advanced degree in quantitative discipline (or 3+ years of full-time work experience using advanced statistical analysis)</p>\n\t</li><li>\n\t<p>Strong written and verbal communication skills</p>\n\t</li>\nWe take care of our people\nWe invest in our people, their careers, their health, and their well-being. We want you to concentrate on success and leave the rest to us. When you work here, we provide:\n<li>\n\t<p>Fully-paid health care benefits</p>\n\t</li><li>\n\t<p>Generous parental and family leave policies</p>\n\t</li><li>\n\t<p>Mental and physical wellness programs</p>\n\t</li><li>\n\t<p>Tuition assistance</p>\n\t</li><li>\n\t<p>A 401(k) savings program with an employer match and more</p>\n\t</li>\nAbout Point72\nPoint72 is a global asset management firm led by Steven Cohen that uses Discretionary Long/Short, Macro, and Systematic strategies to invest in eight offices across the globe. We look for people who want to build a career with us – people who want to innovate, experiment, and be the best at what they do – while adhering to the highest ethical standards."}