{"job title": "Data Scientist", "company": "Thrive Market", "city state": "– Los Angeles, CA", "rating": "3.3", "job description": "<div><div>ABOUT THRIVE</div><br>\n<div>Wholesome products at wholesale prices. Thrive Market is a membership e-commerce platform on a mission to make the world’s highest quality natural and organic products affordable for every American family. For $60/year, Thrive members get access to their favorite healthy snacks, supplements, home, beauty, and baby products at 30-50% off retail value—all shipped to their front door. As part of our Thrive Gives initiative, each paid membership on the site also sponsors a free membership for a low-income family.</div> <br>\n<div>THE ROLE</div><br>\n<div>Our Data team is growing, and you will be a high impact Data Scientist on our team. You'll have the opportunity to build data science the way you think it's intended for our needs. At Thrive, we've created a transparent, data-centric environment from the beginning and we'll need your help applying algorithms, machine learning and other tools across our business departments like engineering, marketing, merchandising and operations to unlock our full potential.</div></div><div><div>Responsibilities\n\n<ul>\n\n\n<ul>\n<li>Identify and evaluate various business insights for both opportunities and threats that encompass all aspects of our business</li> <li>Develop strong working relationships with team members across departments, gathering requirements and understanding their drivers</li> <li>Convey concise and actionable stories through data to different stakeholders of the company</li><li>Employ machine learning methods where needed to optimize business metrics</li><li>Work with other members of the Data team to develop and refine algorithms</li><li>Work with internal teams to research, prototype and deliver applied machine learning solutions where needed</li></ul>\n</ul>\n\n</div>\n</div><div><div>Qualifications\n\n<ul>\n\n\n<ul>\n<li>M.S. or Ph.D degree in statistics, computer science, operations research, computational physics or related field</li><li>At least 3+ years of data science experience in eCommerce, SaaS, or other digital based businesses</li><li>Strong understanding of online advertising, A/B testing, cohort analysis, conversion optimization, customer segmentation, etc</li><li>Experience with supervised and unsupervised data mining algorithms like support vector machines, boosting, LDA, and logistic regression, etc..</li> <li>Proficiency in at least one high level programming language like Java / Scala / Python / C++</li><li>Experience with large scale data analysis in Pig, Hive or Spark is a plus</li><li>Experience using a data visualization program such as Tableau or related program</li><li>Excellent communication skills, fun personality and a strong sense of curiosity</li></ul>\n</ul>\n\n</div>\n</div><div><div>We Offer\n\n<ul>\n\n\n<ul>\n<li>Competitive Salary (DOE) + equity</li><li>Flexible vacation time</li><li>Free Thrive membership</li><li>Medical, dental and vision plans to choose from</li><li>Stocked kitchen and fridges with Thrive-type foods</li><li>Catered lunches in the office</li><li>Optional Yoga on Wednesdays, Kombucha Thursdays and weekly events</li><li>Casual atmosphere and great people to work with</li></ul>\n</ul>\n\n</div>\n</div>"}