{"job title": "Principal Data Scientist", "company": "Abbott", "city state": "– United States - Illinois - Des Plaines", "rating": "3.5", "job description": "At Abbott, we're committed to helping people live their best possible life through the power of health. For more than 125 years, we've brought new products and technologies to the world -- in nutrition, diagnostics, medical devices and branded generic pharmaceuticals -- that create more possibilities for more people at all stages of life. Today, 99,000 of us are working to help people live not just longer, but better, in the more than 150 countries we serve.<p> </p><b>JOB DESCRIPTION:</b><p>Abbott Molecular as an opening for Principal Data Scientist. This individual is responsible for analyzing data, drawing insights, and presenting results in a cohesive, intuitive, and simplistic manner to the business partner utilizing technologies to collect, clean, analyze, predict, and effectively communicate information</p><p></p><p><b>Core Job Responsibilities:</b></p><p>Analyze data, draw insights, and present results in a cohesive, intuitive, and simplistic manner to the business partner</p><p>Utilize technologies to collect, clean, analyze, predict, and effectively communicate information such as model logic and restrictions</p><p>Able to examine data sets and determine the best end-to-end analysis plan to address key business questions and proactively identifies opportunities for significant operational, process or system level product improvements for the business partner</p><p>Conduct advanced statistical analysis to determine trends and significant data relationships</p><p>Develop machine learning models to apply test data algorithms to future data</p><p>Validate models/analytical techniques, and develop algorithms to execute analytical functions</p><p>Works with stakeholders to define business questions, requirements, timelines, objectives, and success criteria to address need.</p><p>Work closely with the business to understand the domain and iteratively refine analyses</p><p></p><p><b>Position Accountability/ Scope:</b></p><p>Independently manages and consults in multiple complex projects working with stakeholders to define business questions, requirements, timelines, objectives, and success criteria to address need</p><p>Experience in creating and implementing machine learning algorithms and advanced statistics such as: regression, time-series forecasting, clustering, decision trees, exploratory data analysis methodology, simulation, scenario analysis, modeling, optimization, unstructured data analysis, and neural networks</p><p>Researches and adapts existing open-source algorithms when possible, and develops novel techniques when needed</p><p></p><p><b>Education and experience requirements</b></p><p>Masters Degree</p><p>•Advanced degree in Life or Physical Science, Bioengineering, Biomedical Engineering or closely related discipline is preferred.</p><p>Minimum 6 years</p><p>•4-6 years’ work related experience with degree or sufficient transferable experience to demonstrate functional equivalence to a degree</p><p>•Advanced Experience with programming scripts such as Python, Java, Scala, C++ in Linux/Unix, and R</p><p>•Experience in applying data analysis techniques to a large set of data using big data systems such as Hadoop, Spark, MongoDB, or similar software</p><p>•Advanced analytics knowledge and application in the field of</p><p> •Statistics</p><p> •Mathematical programming</p><p>•Business acumen and experience with operational or strategic systems</p><p>Additional experience --</p><ul><li>Process monitoring</li><li>Early Signal Detection-SPC Control charting</li><li>KPI monitoring</li><li>Tools &amp; Technology performance scorecard</li><li>Systems and data integration</li></ul><p> </p><b>JOB FAMILY:</b>Research and Discovery<p> </p><b>DIVISION:</b>AMD Molecular<p> </p><b>LOCATION:</b>United States &gt; Des Plaines : DP01 Floor-2<p> </p><b>ADDITIONAL LOCATIONS:</b><p> </p><b>WORK SHIFT:</b>Standard<p> </p><b>TRAVEL:</b>Yes, 5 % of the Time<p> </p><b>MEDICAL SURVEILLANCE:</b>No<p> </p><b>SIGNIFICANT WORK ACTIVITIES:</b>Continuous sitting for prolonged periods (more than 2 consecutive hours in an 8 hour day)<p> </p>Abbott is an Equal Opportunity Employer of Minorities/Women/Individuals with Disabilities/Protected Veterans.<p> </p>EEO is the Law link - English: http://webstorage.abbott.com/common/External/EEO_English.pdf<p> </p>EEO is the Law link - Espanol: http://webstorage.abbott.com/common/External/EEO_Spanish.pdf"}