{"job title": "Machine Learning Scientist", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAmazon Connections is an innovative product that gives Amazon employees a confidential and effective way to give feedback on the workplace and help shape the future of the company. By asking employees daily questions, Connections leverages real time information to learn more about their experiences and become a source of innovation and change. Our goal is to help remove barriers to employees delivering results for our customers. Over time, Connections represents an engagement flywheel in which information and insights from employee responses feedback into leadership decisions and business outcomes.<br> <br> The product is growing beyond a static feature set and will be automating and scaling identification of issues across businesses, delivering of insights and recommendations to managers and senior business leaders. To support this expansion, a rich set of models will be needed that draw from diverse fields of machine learning to build holistic solutions for business problems.<br> <br> We are looking for passionate machine learning scientists to expand the use of ML into every aspect of our product. This includes personalization, NLP, online learning, and other structured/unstructured prediction problems. The role involves working with senior Amazon business leaders, other scientists, and developers to leverage survey data and other sources to generate actionable insights to improve business outcomes at scale, make Amazon a better place to work, and improve management practices.<br> <br> As an ML scientist in Connections, you will have the opportunity to build machine learning models and solutions to identify and solve Amazon-wide business problems in a fast-moving environment. You will apply your skills in an unconventional domain with the potential to impact businesses across Amazon.\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n- Ph.D. or M.S. in Computer Science, Statistics, or related field with exposure to machine learning and natural language processing.<br> - Proficient in at least one major programming language (Java, Scala, C++, Python).<br> - Experience with supervised and unsupervised machine learning algorithms.<br> - Strong grasp of data structures and algorithms.<br> - Track record of solving ambiguous technical problems and delivering complex software systems to customers<br> - Good communication skills with both technical and business people. Ability to speak at a level appropriate for the audience.<br> - Strong critical thinking and attention to detail.<br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n- 2+ years of practical experience in applying ML, especially personalization, NLP techniques and/or dimensionality reduction.<br> - Demonstrated experience in building solutions using deep neural networks, recommendation systems and NLP algorithms, including RNNs, collaborative filtering, Attention mechanism, etc.<br> - Significant peer reviewed scientific contributions in relevant fields including publications at major ML conferences and journals.<br> - Cares deeply about agile software practices, data driven development, and collaborating with other researchers and engineers.<br> - Scientific thinking and the ability to invent, a track record of thought leadership and contributions that have advanced the field.<br> - Strong personal interest in learning, researching, and creating new technologies in unconventional domains.<br> - Strong fundamentals in problem solving, algorithm design and complexity analysis.<br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}