{"job title": "Data Scientist - Cisco DevNet", "company": "Cisco Systems", "city state": "– San Jose, CA (US)", "rating": "4.0", "job description": "Who You’ll Work With\n<br><br>\nCisco DevNet (https://developer.cisco.com) is Cisco's developer program to help developers and IT professionals who want to write applications and develop integrations with Cisco products, platforms, and APIs. Cisco DevNet includes Cisco's products in software-defined networking, security, cloud, data center, internet of things, collaboration, and open-source software development. The DevNet site also provides learning and sandbox environments for those trying to learn coding and testing apps.\n<br><br>\nWhat You’ll Do\n<br><br>\nYou will be responsible for modeling complex problems, discovering insights and identifying opportunities through the use of statistical, algorithmic, mining and visualization techniques. In addition to advanced analytic skills, this role will also need to be proficient at integrating and preparing large, varied datasets, architecting specialized database and computing environments, and communicating results.\n<br><br>\nYou will work closely with clients within the DevNet team, data stewards with the engineering group, project/program managers, and other DevNet members to turn data into critical information and knowledge that can be used to make sound organizational decisions. Other responsibilities include providing data that is congruent and reliable.\n<br><br>\nWho You Are\n<br><br>\nWe are looking for a creative thinker that can propose innovative ways to look at problems by using data mining approaches on the set of information available. You will need to be able to present back findings to the business stakeholders by exposing their assumptions and validation work in a way that can be easily understood by their business counterparts.\n<br><br>\nYou will need a combination of business focus, strong analytical and problem solving skills and programming knowledge to be able to quickly cycle hypothesis through the discovery phase of the project. Excellent written and communications skills to report back the findings in a clear, structured manner are required.\n<br><br>\nOur Minimum Requirements Are\n<ul>\n\n<li>Bachelor’s Degree in Mathematics, Statistics, Computer Science or related field; Master’s Degree preferred.</li>\n<li>3-5 years of relevant quantitative and qualitative research and analytics experience.</li>\n<li>Solid knowledge of statistical techniques. The ability to come up with solutions to loosely defined business problems by leveraging pattern detection over potentially large datasets.</li>\n<li>Strong programming skills (such as Hadoop MapReduce or other big data frameworks, Python, Java) and statistical modeling skills (like SAS or R).</li>\n<li>Experience with Amazon Redshift, Power BI or other visualization tools.</li>\n<li>Experience using Machine Learning algorithms.</li>\n<li>Proficiency in the use of statistical packages.</li>\n<li>Proficiency in statistical analysis, quantitative analytics, forecasting/predictive analytics, multivariate testing, and optimization algorithms.</li>\n<li>Strong communication and interpersonal skills.</li>\n\n</ul>\n<br><br>\nWhy Cisco\n<br><br>\nAt Cisco, each person brings their unique talents to work as a team and make a difference. Yes, our technology changes the way the world works, lives, plays and learns, but our edge comes from our people.\n<br><br>\n<ul>\n\n<li>We connect everything – people, process, data and things – and we use those connections to change our world for the better.</li>\n<li>We innovate everywhere - From launching a new era of networking that adapts, learns and protects, to building Cisco Services that accelerate businesses and business results. Our technology powers entertainment, retail, healthcare, education and more – from Smart Cities to your everyday devices.</li>\n<li>We benefit everyone - We do all of this while striving for a culture that empowers every person to be the difference, at work and in our communities.</li>\n\n</ul>\nColorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Be you, with us! #WeAreCisco\n<br><br>\n*LI-MA1 #GD2015"}