{"job title": "Research Scientist II, Formulation and Process Development", "company": "Gilead Sciences", "city state": "– Foster City, CA (US)", "rating": "3.2", "job description": "For Current Gilead Employees and Contractors:<p>Please log onto your Internal Career Site to apply for this job.</p><p></p>Job Description<p>The Formulation &amp; Process Development group located at the Foster City, CA Gilead headquarters is seeking a Research Scientist II to provide scientific, technical and hands-on support of drug discovery and product development.</p><ul><li>The qualified candidate will be responsible for drug product development from lead optimization to clinical development and through commercialization, and should have experience and/or knowledge in preformulation, formulation development, and process selection and scale up based on Quality by Design (QbD), oversight of GMP drug product manufacturing and global regulatory CMC (INDs, IMPDs, NDAs, MAAs).</li><li>The qualified candidate will be responsible for lead optimization, API form selection/characterization, preformulation, formulation development, manufacture of clinical supplies, development of efficient and scalable manufacturing processes, process scale up based on Quality by Design (QbD), implementation of innovative technologies, CMO management and global regulatory strategy.</li></ul><p></p><p>Required Skills:</p><ul><li>Experienced in formulation and process development and scale-up of parenteral drug products.</li><li>Expertise in parenteral drug delivery technologies. Knowledge of sustained release parenteral delivery is preferred</li><li>Knowledge of basic analytical skills required: HPLC, UV, solid state characterization.</li><li>Excellent communication skills (both verbal and technical) and interpersonal skills are required. </li></ul><p></p><p><b>Essential Duties and Job Functions:</b></p><ul><li>Responsible for developing chemical processes for the manufacturing of drug substances.</li><li>Familiar with Pilot Plant operations and able to write master batch records and safety summaries with limited supervision.</li><li>Pays particular attention to avoiding reactions and processes that do not scale well, such as distilling to dryness and flash chromatography.</li><li>May suggest alternative chemistry including step optimization and new route selection.</li><li>Gains a better understanding of how impurities are formed, tracked and purged throughout the subsequent processing.</li><li>Works in collaboration with more senior scientists or scientific directors to advance the development of economical, state-of-the-art techniques to isolate, characterize, purify and mass-produce substances.</li><li>Works on complex problems where analysis of situations or data requires evaluation of intangible variables, requiring regular use of ingenuity and creativity.</li><li>Advises members of project teams in the initiation and execution of laboratory experimentation, considering economic, regulatory and safety factors.</li><li>Presents results of work, interprets data, and draws conclusions regarding presented material and nature of work.</li><li>Makes contributions to scientific literature and conferences through publication and presentation of research results.</li><li>Maintains full working knowledge of state-of-the art principles and theories, applying such knowledge to the direction that supports Company interests.</li><li>Demonstrates technical proficiency, scientific creativity, collaboration with others and independent thought in suggesting experimental design and strategy.</li><li>Must think critically and creatively and be able to work independently, determine appropriate resources for resolution of problems and have strong organizational and planning skills.</li><li>Demonstrates excellent verbal communication skills and interpersonal skills.</li><li>Demonstrates collaborative communication and problem solving spirit.</li></ul><p></p><p><b>Knowledge, Experience, and Skills Required:</b></p><ul><li>PhD in a related scientific discipline 3+ years’ industry experience.</li><li>BS or MS degree with extensive industry experience.</li><li>Ideal candidate will have degree in pharmaceutical sciences, chemical engineering, physical organic chemistry.</li><li>*Academic Level - PhD</li></ul><p></p><br>For jobs in the United States:<p>As an equal opportunity employer, Gilead Sciences Inc. is committed to a diverse workforce. Employment decisions regarding recruitment and selection will be made without discrimination based on race, color, religion, national origin, gender, age, sexual orientation, physical or mental disability, genetic information or characteristic, gender identity and expression, veteran status, or other non-job related characteristics or other prohibited grounds specified in applicable federal, state and local laws. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Era Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants who require accommodation in the job application process may contact careers@gilead.com for assistance.</p><p></p><p>For more information about equal employment opportunity protections, please view the ‘EEO is the Law’ poster.</p><p></p><p>NOTICE: EMPLOYEE POLYGRAPH PROTECTION ACT<br>YOUR RIGHTS UNDER THE FAMILY AND MEDICAL LEAVE ACT<br>PAY TRANSPARENCY NONDISCRIMINATION PROVISION</p><p></p><p>Our environment respects individual differences and recognizes each employee as an integral member of our company. Our workforce reflects these values and celebrates the individuals who make up our growing team.</p><p>Gilead provides a work environment free of harassment and prohibited conduct. We promote and support individual differences and diversity of thoughts and opinion.</p><p></p>For jobs in France:<p>Conformément à la Loi « Informatique et Libertés » (06/01/78), nous vous informons du fait que les données personnelles renseignées pourront faire l'objet d'un traitement informatique par Gilead et pourront être transmises aux Organismes Sociaux. Par ailleurs, vous disposez d'un droit d'accès, de rectification et de suppression des données vous concernant. Vous pouvez exercer ce droit en contactant: FranceDataPrivacy@gilead.com</p><br>For Current Gilead Employees and Contractors:<p>Please log onto your Internal Career Site to apply for this job.</p>"}