{"job title": "Research Scientist I, Biologics Analytical Development", "company": "Gilead Sciences", "city state": "– Oceanside", "rating": "3.2", "job description": "For Current Gilead Employees and Contractors:<br><br>Please log onto your Internal Career Site to apply for this job.<br><br>Job Description<br><br>The successful candidate will possess a thorough understanding of protein/glycan general, analytical, and biological chemistry. The candidate must be highly motivated to contribute to the research and development of biologics targeting unmet medical need through biochemical characterization and novel method development. Experience in biological mass spectrometry, biochemistry, quantitation, enzymology, molecular biology, and bioinformatics are strongly desired.\n<br><br>\nTeamwork, critical thinking, and the ability to convey complex and nuanced concepts to interdisciplinary teams are required.\n<ul>\n<li>Contributes to analytical method development and qualification to support protein characterization activities.</li><li>Familiarity with several of the following is highly desired: Peptide mapping by LC-MS/MS, intact mass analysis, MS/MS for protein and carbohydrate structural elucidation/quantification, bioinformatics, kinetic analyses, ultra-performance chromatography, proteolytic/chemical processing, and data analysis algorithms. Knowledge of ICH guidelines and GMP is a plus.</li><li>Participates in technology transfer of assays from analytical development to QC and external CRO/CMOs.</li><li>Works as part of a team to characterize molecules, degradation pathways and define critical quality attributes in a phase-appropriate context.</li><li>Participates in process comparability studies and coordinates analysis of in-process and product-related impurities as needed.</li><li>The candidate will be expected to work in a matrixed environment and be an effective communicator of ideas, assay results and issues.</li><li>Works closely on problems of moderate complexity.</li><li>Maintains familiarity with scientific literature and applies appropriately to projects</li><li>Represents the company at national/international conferences.</li>\n</ul>\n<strong>Essential Functions:</strong>\n<ul>\n<li>Responsible for conducting scientific research for the development of drug candidates or the research support of marketed drugs.</li><li>Applies scientific principles and techniques to products and problems.</li><li>Works in collaboration with more junior and more senior scientists and directors to advance the development of state-of-the-art techniques to characterize substances, assays, and tools.</li><li>Works on moderately complex problems where analysis of situations or data requires evaluation of intangible variables, requiring regular use of intelligence, logic, ingenuity, and creativity.</li><li>Advises Research Associates or members of project teams in planning and execution of laboratory experimentation, considering economic, regulatory and safety factors.</li><li>Presents results of work, interprets data, and draws conclusions regarding presented material and nature of work.</li><li>Maintains full working knowledge of state-of-the art principles and theories, applying such knowledge to the direction that supports Company interests.</li><li>Demonstrates technical proficiency, scientific creativity, collaboration with others and independent thought in suggesting experimental design and strategy.</li><li>Must think critically and creatively and be able to work independently, determine appropriate resources for resolution of problems and have strong organizational and planning skills.</li><li>Excellent verbal communication skills and interpersonal skills are required.</li>\n</ul>\n<strong>Knowledge, Experience and Skills:</strong>\n<ul>\n<li>PhD with Post Doc in Chemistry or a related discipline with limited industry experience.</li><li>BS or MS degree with extensive industry experience.</li><li>Requires relevant experience that demonstrates an expertise and sustained excellence in performance and accomplishments that align to company goals.</li><li>Excellent communication skills (both verbal and technical) and interpersonal skills are required. Must be able to participate in highly effective teams.</li><li>Exercises independent judgment in developing methods, techniques and evaluation criteria for obtaining results.</li><li>Demonstrates ability to recognize anomalous and inconsistent results and interpret outcomes.</li><li>Maintains in-depth knowledge of state-of-the art principles and theories, applying such knowledge to the direction that supports Company interests.</li><li>Demonstrates technical proficiency, scientific rigor, collaboration with others and independent thought in suggesting experimental design and strategy.</li><li>Must think critically and creatively and be able to work independently, determine appropriate resources for resolution of problems and have strong organizational and planning skills.</li><li>Strong knowledge in mass spectrometry, experimental design, and assay development.</li><li>Familiarity in chromatography and mass spectrometry for protein or carbohydrate characterization is expected.</li><li>Performs a variety of experiments that support protein analytical characterization activities in various disciplines. Includes operating equipment, selecting appropriate methods and techniques, analyzing data and preparing related reports/presentations.</li>\n</ul>\n#LI-JS1<br><br>For jobs in the United States:<br><br>As an equal opportunity employer, Gilead Sciences Inc. is committed to a diverse workforce. Employment decisions regarding recruitment and selection will be made without discrimination based on race, color, religion, national origin, gender, age, sexual orientation, physical or mental disability, genetic information or characteristic, gender identity and expression, veteran status, or other non-job related characteristics or other prohibited grounds specified in applicable federal, state and local laws. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Era Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants who require accommodation in the job application process may contact careers@gilead.com for assistance.\n<br><br>\nFor more information about equal employment opportunity protections, please view the ‘EEO is the Law’ poster.\n<br><br>\nNOTICE: EMPLOYEE POLYGRAPH PROTECTION ACT\n<br>\n<strong>YOUR RIGHTS UNDER THE FAMILY AND MEDICAL LEAVE ACT</strong>\n<br>\nPAY TRANSPARENCY NONDISCRIMINATION PROVISION\n<br><br>\nOur environment respects individual differences and recognizes each employee as an integral member of our company. Our workforce reflects these values and celebrates the individuals who make up our growing team.\n<br><br>\nGilead provides a work environment free of harassment and prohibited conduct. We promote and support individual differences and diversity of thoughts and opinion.<br><br>For jobs in France:<br><br>Conformément à la Loi « Informatique et Libertés » (06/01/78), nous vous informons du fait que les données personnelles renseignées pourront faire l'objet d'un traitement informatique par Gilead et pourront être transmises aux Organismes Sociaux. Par ailleurs, vous disposez d'un droit d'accès, de rectification et de suppression des données vous concernant. Vous pouvez exercer ce droit en contactant: FranceDataPrivacy@gilead.com<br><br>For Current Gilead Employees and Contractors:<br><br>Please log onto your Internal Career Site to apply for this job."}