{"job title": "Senior Data Engineer", "company": "GoDaddy", "city state": "– Sunnyvale, California", "rating": "3.5", "job description": "<strong>About GoDaddy</strong>\n<br><br>\nGoDaddy powers the world's largest cloud platform dedicated to small, independent ventures. With nearly 17 million customers worldwide and over 75 million domain names under management, GoDaddy is the place people come to name their idea, build a professional website, attract customers and manage their work. Our mission is to give our customers the tools, insights and the people to transform their ideas and personal initiative into success. To learn more about the company visit www.GoDaddy.com.\n<br><br>\nWe're looking for scrappy, passionate software developers with a specific focus on data engineering to join our Business Analytics and Data Engineering team.\n<br><br>\nThe solutions we build allow our business partners to easily turn vast amounts of data into useful insights. In this role, you’ll be responsible for bringing data into the platform, transforming it into a well-defined, consistent model, moving it to the best data stores to support API and analytics use cases, and making it easy for applications and consumers to access the data. Our goal is to enable GoDaddy to deeply know our customers and provide great customer products and experiences. If you’re interested in working with the latest BIG data technologies and using industry leading BI analytics and visualization tools, this position is for you.\n<br><br>\n<strong><strong>Responsibilities</strong>:</strong>\n<ul>\n\n<li>Support data applications, ad-hoc analysis, and BI systems used for in-depth analytics to identify actionable insights that will influence the direction of the business</li>\n<li>Analyze requirements to design, develop and test interactive data solutions</li>\n<li>Develop large-scale systems with high-speed and low-latency data solutions</li>\n<li>Be well-versed in ETL of large-scale data, low-latency queries, real-time reporting, and APIs for data access</li>\n<li>Develop APIs and write code to transform and enrich data in both batch and streaming scenarios</li>\n<li>Build end-to-end reporting solutions from multiple data structures and sources</li>\n\n</ul>\n<strong>​</strong>\n<br><br>\n<strong><strong>Requirements</strong>:</strong>\n<ul>\n\n<li>BS/MS in Computer Science, Information Systems or related discipline</li>\n<li>5+ years of experience in data engineering and building large scale data platforms</li>\n<li>5+ years of experience in SQL to discover, aggregate and extract data</li>\n<li>5+ years experience with Hadoop, Pig, Hive, Spark, Storm, and other BIG data technologies</li>\n<li>3+ years of experience with data visualization tools, such as Tableau and Kibana</li>\n<li>Experience with databases such as MS SQL Server and MySQL</li>\n<li>Experience in coding in Java, Python, Node.js, or other object-oriented language</li>\n<li>Solid Linux and Windows administration skills, and understanding of system performance</li>\n<li>Strong interpersonal and communication skills, flexibility, commitment to team, and positive attitude</li>\n<li>Experience with data in the SaaS/subscription space is a plus</li>\n<li>Experience with Teradata development is a plus</li>\n<li>Experience with Apache Beam is a plus</li>\n<li>Knowledge of Cassandra or other distributed data stores (Redis, MongoDB, MemCache, etc.) is a plus</li>\n<li>Experience building CI/CD and server/deployment automation solutions is a plus</li>\n\n</ul>\n#LI-JA1\n<br><br>\nGoDaddy is proud to be an equal opportunity employer. We will not discriminate against any applicant or employee on the basis of age, race, color, creed, religion, sex, sexual orientation, gender, gender identity or expression, medical condition, national origin, ancestry, citizenship, marital status or civil partnership/union status, physical or mental disability, pregnancy, childbirth, genetic information, military and veteran status, or any other basis prohibited by applicable federal, state or local law. GoDaddy will consider for employment qualified applicants with criminal histories in a manner consistent with local and federal requirements.\n<br><br>\nIf you need assistance completing an application for a position with us, please reach out to our Recruiting Team at Recruiting@godaddy.com\n<br><br>\nTo submit your application to this position, please click Apply . On the next screen, after you click Apply, click Create to establish your candidate account. If you have previously created a candidate account, please slick Sign-In and use that account to complete your application."}