{"job title": "Data Scientist III", "company": "Honeywell", "city state": "– USA-Atlanta", "rating": "3.3", "job description": "Data Scientist III<br><br>Join a team recognized for leadership, innovation and diversity\n<br><br>\nHoneywell Transportation Systems (TS) is a leading provider of world-class technologies and solutions to automakers, their suppliers, and consumers. Transportation Systems’ fuel-saving and emission-reducing turbocharger technologies enhance the efficiency and performance of passenger and commercial vehicles worldwide.\n<br><br>\nHoneywell Automotive Software (HAS) North America has an immediate need for an experienced Data Scientist to be part of a leading edge technology development team. The current offerings, which are in development phase, are a software suite of solutions providing automotive cyber security, vehicle health management, data analytics, and modeling solutions within the automotive industry. The Data Scientist will be responsible for the design, validation, and support of data-driven and heuristic algorithms that detect cyber-attacks or health degradations and that meet the requirements for embedded automotive operation.\n<br><br>\nThe candidate must have a demonstrated record of sustained superior performance in the design and development of Data Science Solutions. The candidate must be able to demonstrate a high-level of understanding of data science technologies such as Predictive Analytics, Machine Learning, Data Visualization, Data Mining, and algorithm development. The candidate must be able to use these tools to examine and explore data to find hidden insights that result in valuable solutions for Honeywell Transportation Systems.\n<br><br>\nThis position will report to the HAS Software Development Lead.\n<br><br>\nThe position is intended to be located in Atlanta, GA.\n<br><br>\nEssential Job Functions\n<br><br>\nData Analytics – Use a combination of machine learning, data analysis techniques, and automotive design knowledge to identify distinguishing traits in vehicle bus communication data that can be used to distinguish between normal operation, versus cyber-attack, or degraded health.\n<br>\nAlgorithm Design – Design algorithms that detect cyber-attacks and/or degraded health, and that can meet the requirements for embedded operation including footprint, processing speed, and detection and false alarm performance. Develop the parameter set for the algorithms, tailored to different configurations of vehicles from different OEMs\n<br>\nEmbedding Support – Work closely with a team of embedded software engineers to ensure the algorithms are suitable for embedding, and that the embedded algorithms faithfully match the design.\n<br>\nNetwork Protocols – Quickly learn standard and custom network protocols used in the automotive industry.\n<br>\nCybersecurity – Have basic understanding of cyber security concepts, processes, and algorithms.\n<br>\nDevelopment Process – Follow defined software development process. Perform documentation, design, code, and defect reviews.<br><br>Created with SnapDevelop Data Science SolutionsResearch Understand Cyber Security Concepts, Processes, &amp; AlgorithmsDesign Algorithms YOU MUST HAVE\n\n<ul>\n<li>Graduate degree in Engineering, Science or related field at an accredited college or university</li><li>Three (3) plus years of experience in developing Data Science solutions.</li><li>Three (3) plus years of experience in any of the following Data Science technologies:</li><li>Application, statistical, conceptual, mathematical, modeling, and predictive analytic expertise</li><li>System/Data Integration</li><li>High level programming skills (Python, R, Matlab, C++ or Java)</li><li>Machine Learning Algorithms</li><li>Data mining (including data auditing, aggregation, validation and reconciliation)</li><li>Cloud Computing</li><li>Data Visualization/Presentation</li>\n</ul>\n\n<strong>WE VALUE</strong>\n\n<ul>\n<li>Impeccable integrity</li><li>Experience in working with Hadoop, MapReduce, Hive, HBase and other big data technologies</li><li>Experience in working with ETL tools such as Informatica, Talend and/or Pentaho.</li><li>Good understanding of cluster and parallel architecture as well as high-scale or distributed RDBMS and/or knowledge on NoSql platforms.</li><li>Familiarity and experience in the automotive industry around bus communications, electronic control units, embedded software, powertrain, engine, and control</li><li>Excellent oral and written communication</li><li>Ability to embrace the philosophy of taking 100% responsibility for delivering results</li><li>The ability to work in a team environment</li><li>Familiarity and experience with software deployment and support</li><li>Superior presentation and communication skills.</li><li>Demonstrated ability to operate effectively in an international functional matrix organizational structure</li>\n</ul>\n\nExempt\n<br><br>\n<strong>INCLUDES</strong>\n\n\n<ul>\n\n <li>Relocation Provided</li>\n<li>Continued Professional Development</li>\n<li>Some Travel Required</li>\n</ul>\n\n<strong>ADDITIONAL INFORMATION</strong>\n\n<ul>\n<li><strong>Job ID:</strong> req152165</li> <li><strong>Category:</strong> Engineering</li> <li><strong>Location:</strong> 715 Peachtree Street, N.E., Atlanta, GA 30308 USA</li> \n</ul>\nHoneywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, or veteran status.\n<br><br>\nINDSOFTWARE"}