{"job title": "Operations Data Scientist", "company": "Illumina", "city state": "– San Diego, CA", "rating": "4.2", "job description": "The Data Scientist will be part of a team responsible to develop the infrastructure, system and statistical analytics to enable proactive and predictive analytics throughout the Global Quality and Operations group. The Data Scientist will work with other functions such as manufacturing, engineering, quality and IT to develop complex statistical algorithms and machine learning models working with extremely large and complex data structures. The position will provide technical leadership of other data scientists, analysts and programmers in the design, build, evaluation and deployment of models and other analytical projects. The position may also provide analytics support to other parts of the organization including Product Development, Customer Service, Sales and Marketing and/or Finance.\n<br><br>\nResponsibilities:\n<br><br>\nAnalyze complex data systems that may involve one or more of the following: data mining, statistical analysis, predictive modeling, machine learning techniques\n<br>\nDesign, develop, test, troubleshoot and document systems to produce data-drive decision making and other related concepts\n<br>\nProvide technical input to internal teams regarding data discovery, planning and processing.\n<br>\nKeep current with outside advancements in data science techniques and inject developments as appropriate\n<br>\nMinimum Qualifications:\n<br><br>\nMaster’s degree or Ph.D. in a relevant technical discipline (Mathematics, Engineering, Computer Science, Statistics or a similar field)\n<br>\nMinimum 5 years of data science experience in industry for Master’s candidates or 3 years for Ph.D. candidates\n<br>\nExperience creating and applying advanced statistical methods and complex algorithms such as: regression, clustering, simulation, scenario analysis, neural networks and decision trees and other machine learning techniques.\n<br>\nExperience creating and presenting simple, concise visualizations of data to stakeholders using software such as Tableau, PowerBI, Periscope, or other similar\n<br>\nMinimum of 3 years of programming experience (C, C++, Java, Python, R)\n<br>\nMinimum of 3 years of experience with relational databases and SQL\n<br>\nExperience with statistical or computational mathematics tools (SAS, R, Jmp, Matlab).\n<br>\nStrong interpersonal and communication skills (both written and oral) including the ability to communicate complex technical/statistical concepts to a non-technical audience.\n<br>\nPreferred Qualifications:\n<br><br>\nMBA\n<br>\nExperience working with large data sets and tools like MapReduce, Hadoop, Hive, etc.\n<br>\nExperience with web services such as AWS, Redshift, S3, and/or Spark connecting to data using API’s.\n<br>\nExperience connecting and analyzing data from multiple business applications(SAP, SFDC, IBM Cognos)\n<br>\nSystems engineer or reliability engineering experience.\n<br>\nAbility to work in a global collaborative team environment\n<br>\nExcellent verbal and written communication skills in English"}