{"job title": "Data Scientist-Machine Learning", "company": "Mercy", "city state": "– US-MO-Chesterfield", "rating": "3.4", "job description": "Overview<br><br><strong>We’re a Little Different</strong>\n<br><br>\nOur mission is clear. We bring to life a healing ministry through our compassionate care and exceptional service.\n<br><br>\nWe don’t believe in jobs at Mercy, we believe in <em>careers</em> that match the unique gifts of unique individuals; careers that not only make the most of your skills and talents, but also your heart.\n<br><br>\nAt Mercy, you’ll feel our supportive community every step of your day, especially the tough ones. We’re a team and love working that way. That team is expanding, and we currently have exceptional opportunities to help our communities grow.<br><br>Responsibilities and Qualifications<br><br>The Medical Intelligence and Analytics division at Mercy is a small, agile, cross-disciplinary team that uniquely fuses together physician and nursing experience in the clinical domain with technical expertise in EHR database engineering, data modeling, BI development, UI / front-end development, machine learning and statistics. True to our team motto — 'Transforming Complexity into Insight to Enrich Lives’ — we work closely with health care practitioners across the organization to build applications that reveal the insights hiding in our precious data resources in order to improve decision making and operational workflows that ultimately impact patient care.\n<br><br>\nAs a multi-state hospital system serving millions of patients all under a single EHR system, Mercy has a large and robust healthcare data set. We are expanding our team to include an experienced machine learning engineer to help create actionable insight into this data. You will work with clinicians and other data experts to integrate predictive analytics into the workflows of Doctors, Nurses, and Billing specialists throughout the Mercy system.\n\n<ul>\n\n <li>Experience with applying machine learning models to solve real-world problems (i.e. with multiple stake holders) as part of their on-the-job duties</li>\n<li>Emphasis on analysis and model development, but experience deploying a model for an end-to-end app solution of some sort</li>\n<li>Advanced machine learning skills using python or R: clustering, regression, classification.</li>\n<li>Assess model performance; train multiple models; carry out hyperparameter tuning.</li>\n<li>Some familiarity with deep learning.</li>\n<li>Experience working with database systems</li>\n<li>Transform and clean data into an appropriate form for statistical analysis.</li>\n<li>Use inferential statistics to gain insight into problems and guide decision making.</li>\n<li>Work with domain experts to identify areas where predictive analytics can take us to the next level.</li>\n<li>Be an active listener, probe requirements for all projects from relevant stakeholders, stay nimble and willing to produce rapid iterations.</li>\n<li>Be capable of self-direction, within context</li>\n</ul>\n<strong>Because you’re committed to excellence, you understand the importance of being properly prepared for your role at Mercy. That’s why you’ll bring to your role the right set of qualifications:</strong>\n\n<ul>\n\n <li><em>Education:</em> BS or above in relevant discipline (Math, Statistics, Computer Science or similar).</li>\n<li><em>Experience:</em> 3+ years of machine learning experience. Experience using predictive analytics in a business or healthcare setting.</li> \n\n<li><em>Skills:</em> Deep knowledge of a scripting or statistical programming language (python preferred). Basic SQL. Ability to efficiently work with very large datasets. Ability to deal with non-standard machine learning datasets (class-imbalances, sparse matrices, etc.)</li>\n<li><em>Nice-to-have:</em> Comfortable writing fairly complex SQL queries. Experience developing python packages. Version control experience in Git or a similar system. Experience with agile development practices. Experience with hadoop. Experience with low-level machine learning libraries</li>\n</ul>\n<strong>We’ll Support You at Work and Home</strong>\n<br><br>\nOur foundations are built on dignity and respect. Modern Healthcare Magazine named us as a “top 100 places to work.” We go out of our way to help people feel welcomed. We offer day-one comprehensive health, vision and dental coverage, PTO, and employer-matched retirement funds, even to part-time employees. We’re proud to provide tuition reimbursement to help you grow and learn new skills.\n<br><br>\n<strong>What Makes a Good Match for Mercy</strong>\n<br><br>\nCompassion and professionalism go hand-in-hand with us, along with exceptional quality care. Having a positive outlook and a strong sense of advocacy is in perfect step with our mission and vision. We’re also collaborative and are not afraid to do a little extra to deliver excellent care – that’s just part of our commitment. If that sounds like a fit for you as well, we encourage you to apply."}