{"job title": "Senior Data Scientist", "company": "Neal Analytics", "city state": "– Kirkland, WA", "rating": "4.5", "job description": "Neal Analytics is looking for a talented Sr. Data Scientist!\n<br><br>\nData Scientists at Neal are professionals who understand how to present compelling stories through data and create machine learning solutions that wow clients. They are equipped with strong skills working with data, but also possess the requisite business acumen to discuss and present results to business stakeholders. Put it all together and supercharge your career at Neal Analytics. Neal Analytics is Microsoft’s premier and award-winning Partner for Data Services, Business Analytics, and Automation.\n<br><br>\nWe work in a dynamic, project-based environment that is both interesting and challenging due to the variety of problems. These projects span a wide range of applications (marketing, operations, social media, product recommendation, sensor monitoring) and are consistently at the forefront of the machine learning space.\n<br><br>\nRole and Responsibilities:\n<br><br>\nTeam Interaction\n<li> Work with Project Managers, Data Engineers, and senior-level Data Scientists to execute tasks/projects</li><li> Bring novel ideas to the table for alleviating client pain points by leveraging data</li><li> Collaborate with data engineering team to provide data requirements and set the timetable for the integration of data sources</li>\nClient Engagement\n<li> Communicate with clients using PowerPoint and data visualization tools (Excel, R, Python, Power BI) in order to get to the core of problems and generate insightful discussions</li><li> Iteratively develop solutions for clients using Big Data and advanced analytics technologies</li><li> Collaborate with client teams to solve real-world business pain points. Must be able to communicate comfortably and work collaboratively with data engineers and business stakeholders.</li>\nWork Product\n<li> Expertise in the following tools / technologies:</li>\no Hands-on knowledge of at least one statistical software tool (R, Python, Matlab, SAS)\n<br><br>\no Advanced analytics techniques: machine learning, regression, collaborative filtering, sentiment analysis, etc.\n<br><br>\no Knowledge of Big Data &amp; IoT toolsets: Spark, Hadoop, SQL, Azure IoT suite, etc.\n<br><br>\no Overall understanding of analytics platforms/stacks: Cortana Analytics, AWS, Azure, IBM\n<li> Desire to continuously learn and improve skillset as technology evolves</li><li> Self-manage tasks by prioritizing and executing a plan of attack</li><li> Tasks/Duties:</li>\no Three pillars of DS toolkit (Data Transformation, Data Storytelling, Data Visualization)\n<br><br>\no Machine Learning: build, calibrate, and test machine learning models\n<br><br>\no Transformation: feature creation, data cleansing, re-expression\n<br><br>\no Visualization: exploratory data analysis, intuitive presentation of findings\n<br><br>\no Data Science storytelling in PowerPoint and other platforms\n<br><br>\n<strong>Requirements</strong>\n<br><br>\nMaster’s or PhD degree in Scientific, Quantitative / Analytical field or MBA combined with a technical bachelor’s degree.\n<li>Proven track record developing advanced analytical tools</li><li>Work experience in a consulting setting is a plus</li>\n<strong>Benefits</strong>\n<br><br>\nCompetative salary and benefits"}