{"job title": "Data Scientist-Nike Direct", "company": "Nike", "city state": "– Beaverton, OR", "rating": "3.9", "job description": "Become a Part of the NIKE, Inc. Team\n<br><br>\nNIKE, Inc. does more than outfit the world's best athletes. It is a place to explore potential, obliterate boundaries and push out the edges of what can be. The company looks for people who can grow, think, dream and create. Its culture thrives by embracing diversity and rewarding imagination. The brand seeks achievers, leaders and visionaries. At Nike, it?s about each person bringing skills and passion to a challenging and constantly evolving game.\n<br><br>\nNike Retail employees inspire athletes of all abilities to tap into their potential. Step into a Nike Store or visit nike.com, and feel the energy, enthusiasm and passion for sport. That same excitement and consumer-first mindset reverberates through the Nike Retail Corporate team. A global network of buyers, visual merchandisers, real estate specialists, store operations directors and others direct the daily operations of nike.com and the hundreds of Nike Stores and Nike Factory Stores worldwide. The team constantly defines the new frontier of retail and creates the most inspiring and engaging consumer experiences in the industry.\n\n\n<ul>\n<li>*Description**</li>\n</ul>\n\nNike?s Digital Risk &amp; Control is a growing team primarily responsible for payment risk mitigation in our digital Nike Direct business including fraud risk management.\n<br><br>\nAs a data scientist you will need to collect information from business teams and contribute to the roadmap for delivering insights, recommendations, and models that have a global and lasting impact on our payment fraud risk. To be successful, you should demonstrate the ability to balance excellent analytical and technical skills while clearly driving communication and collaboration with other key players. As a member of the team, you will have the opportunity to leverage your passion for data science to create high impact solutions.\n<br><br>\nYou will be responsible for identifying, leveraging, and enhancing statistical learning algorithms relevant to a diverse set of problems, with a focus on understanding data arising from online consumer transactions and engagements. You will analyze large sets of data in order to develop insights into payment risk or fraud behaviors and introduce new approaches to transform complex disparate data into actionable information, such as building predictive models to improve our decisions.\n<br><br>\nThis role requires a strong background in data science and machine learning. As an applicant, we want you to be ready to discuss your experiences working with complex data, and the methods, experiments, and results you have built from data. You will explain not just how to build models to answer problems, but how proven models worked in risk mitigation for e-commerce or financial services industry.\n<br><br>\nRoles &amp; Responsibilities\n<br><br>\n+ Implement/re-iterate machine learning models and rule sets based on new payments risks and industry trends.\n<br><br>\n+ Define the business problem and solution approach autonomously with limited guidance.\n<br><br>\n+ Use advanced algorithms to solve business problems and transform one-off models into automated systems.\n<br><br>\n+ Partner with data engineering teams to improve data assets, quality, metrics and insights.\n<br><br>\n+ Proactively identify areas of investigation and future product development.\n<br><br>\n+ Design and execute analytic projects in collaboration with other product teams across Nike and external vendors.\n<br><br>\n+ Challenge assumptions and conventional ways of thinking and work collaboratively with the team to generate new approaches\n<br><br>\n+ Write concise documents communicating results to internal teams and visualize data to drive decision making\n<br><br>\n+ Monitor existing metrics against scorecards and partner with internal and external teams to identify trends, behaviors, process and system improvement opportunities.\n<br><br>\n+ Respond to escalated payment risk issues, industry risk alerts, bank alerts and consumer alerts.\n<br><br>\n+ Understand the vision, direction and culture of Nike Direct - Digital Risk &amp; Control.\n\n\n<ul>\n<li>*Qualifications**</li>\n</ul>\n\n+ Bachelor degree or MS in highly quantitative field (Statistics, Economics, Mathematics, Engineering, Physics or related field)\n<br><br>\n+ 3-5 years of experience in e-commerce payment fraud risk or financial services preferred.\n<br><br>\n+ Able to understand and translate business questions into analytics projects\n<br><br>\n+ Demonstrated experience in data mining, machine learning techniques and/or statistics\n<br><br>\n+ Strong SQL\n<br><br>\n+ Proficient using Python, R, Stata, Scala or other statistical or machine learning software\n<br><br>\n+ Strong communication and data presentation skills, ability to work with technical and non-technical teams\n<br><br>\n+ Experience innovating and implementing novel ML techniques\n<br><br>\n+ Creative and thorough problem-solver that can apply technical solutions to difficult problems\n<br><br>\n+ Demonstrates patience, integrity and the ability to network with internal and external contacts.\n<br><br>\n+ Ability to effectively manage time, and individually prioritize tasks of competing priority.\n<br><br>\n+ Self-driven individual who can take a high-level problem, see it to completion and deliver in a rapid and dynamic environment.\n<br><br>\n+ Ability to work independently and cooperatively in a diverse group.\n\n\n<ul>\n<li>*Qualifications**</li>\n</ul>\n\n+ Bachelor degree or MS in highly quantitative field (Statistics, Economics, Mathematics, Engineering, Physics or related field)\n<br><br>\n+ 3-5 years of experience in e-commerce payment fraud risk or financial services preferred.\n<br><br>\n+ Able to understand and translate business questions into analytics projects\n<br><br>\n+ Demonstrated experience in data mining, machine learning techniques and/or statistics\n<br><br>\n+ Strong SQL\n<br><br>\n+ Proficient using Python, R, Stata, Scala or other statistical or machine learning software\n<br><br>\n+ Strong communication and data presentation skills, ability to work with technical and non-technical teams\n<br><br>\n+ Experience innovating and implementing novel ML techniques\n<br><br>\n+ Creative and thorough problem-solver that can apply technical solutions to difficult problems\n<br><br>\n+ Demonstrates patience, integrity and the ability to network with internal and external contacts.\n<br><br>\n+ Ability to effectively manage time, and individually prioritize tasks of competing priority.\n<br><br>\n+ Self-driven individual who can take a high-level problem, see it to completion and deliver in a rapid and dynamic environment.\n<br><br>\n+ Ability to work independently and cooperatively in a diverse group.\n<br><br>\nNIKE, Inc. is a growth company that looks for team members to grow with it. Nike offers a generous total rewards package, casual work environment, a diverse and inclusive culture, and an electric atmosphere for professional development. No matter the location, or the role, every Nike employee shares one galvanizing mission: To bring inspiration and innovation to every athlete* in the world.\n<br><br>\nNIKE, Inc. is committed to employing a diverse workforce. Qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, veteran status, or disability.\n\n\n<ul>\n<li>*Job ID:** 00400636</li>\n<li>*Location:** United States-Oregon-Beaverton</li>\n<li>*Job Category:** Retail Corporate</li>\n</ul>"}