{"job title": "Expert Data Scientist", "company": "Nike", "city state": "– OR, United States", "rating": "3.9", "job description": "Become a Part of the NIKE, Inc. Team\n<br><br>\nNIKE, Inc. does more than outfit the world's best athletes. It is a place to explore potential, obliterate boundaries and push out the edges of what can be. The company looks for people who can grow, think, dream and create. Its culture thrives by embracing diversity and rewarding imagination. The brand seeks achievers, leaders and visionaries. At Nike, it?s about each person bringing skills and passion to a challenging and constantly evolving game.\n<br><br>\nNike Technology designs, creates and implements the methods and tools needed to make the world?s largest sports brand run faster, smarter and more securely. Global Technology teams aggressively innovate the solutions needed to help employees navigate Nike's rapidly evolving landscape. From infrastructure to security and supply chain operations, Technology specialists drive growth through top-flight hardware, software and enterprise applications. Simply put, without Nike Technology, there are no Nike products.\n\n\n<ul>\n<li>*Description**</li>\n</ul>\n\nAt Nike we are always on the offense, and we are looking for talented self-starters with a passion for advanced analytics to join our growing team. We are responsible for leveraging predictive analytics to enhance decision making and drive to action against our strategic priorities, elevating the function of analytics within Global Sourcing &amp; Manufacturing at Nike.\n<br><br>\nAs an Expert Data Scientist on the Global Sourcing &amp; Manufacturing Advanced Analytics team, you will develop new sophisticated algorithms and improve existing approaches based on statistical/econometric models, machine learning techniques and big data solutions to optimize various sourcing execution &amp; production planning decisions. Forecast long range capacity, cost drivers, sustainability drivers and raw material forecasting for Sourcing &amp; Manufacturing portfolio. You will be a key contributor to the building, scoring, implementing, tracking, updating and promoting Nike?s platform that provides actionable insights and supports critical business and investment decisions. You will be playing a critical lead in co-leading and integrating an array of Industry 4.0 elements into the decision making and driving digital transformation.\n<br><br>\nThe role is perfect for a team player with strong hands-on analytics experience, drive, and curiosity. You know how to rise above the numbers and explain the essential insights to business users, and you instinctively minimize complexity to focus on results. While you rely on data to prove your point, you love to think outside the box and solve problems creatively. Your experience helps you prioritize and overcome blockers and guide the work of others on your team. You thrive in an entrepreneurial environment, and you are excited by the challenge of building something from the ground up. You ask questions, are continually learning as well as finding opportunities to share knowledge with others.\n\n\n<ul>\n<li>*Qualifications**</li>\n<li>*What we're looking for:**</li>\n</ul>\n\n+ Advanced quantitative degree (Statistics, Mathematics, Economics, Computer Science or related field) and at least 5 years of related industry experience with PhD or Masters degree is strongly preferred.\n<br><br>\n+ Demonstrated understanding of forecasting, optimization, statistical analysis and operations research. Working knowledge of forecasting techniques, such as surveys, trend analysis, econometric models and machine learning algorithms.\n<br><br>\n+ Strong technical skill set to work with analytics toolkit (R, Python, Spark, SQL, Hadoop, Amazon Web Services (AWS), SAS, Tableau) on large data sets.\n<br><br>\n+ Experience in building, training, scoring, tuning and maintaining predictive models in production at enterprise scale.\n<br><br>\n+ Proven ability to sift through data, identify critical information, analyze, develop hypothesis and make recommendations to broader audience.\n<br><br>\n+ Proven track record of working cross functionally to develop innovative solutions using advanced analytics.\n<br><br>\n+ Prior experience synthesizing and packaging complex analyses and delivering results to non-technical audiences including senior leadership teams.\n<br><br>\n+ Excellent written and verbal communication skills, including ability to develop and deliver presentation.\n<br><br>\n+ Familiarity with agile development methodology.\n\n\n<ul>\n<li>*Qualifications**</li>\n<li>*What we're looking for:**</li>\n</ul>\n\n+ Advanced quantitative degree (Statistics, Mathematics, Economics, Computer Science or related field) and at least 5 years of related industry experience with PhD or Masters degree is strongly preferred.\n<br><br>\n+ Demonstrated understanding of forecasting, optimization, statistical analysis and operations research. Working knowledge of forecasting techniques, such as surveys, trend analysis, econometric models and machine learning algorithms.\n<br><br>\n+ Strong technical skill set to work with analytics toolkit (R, Python, Spark, SQL, Hadoop, Amazon Web Services (AWS), SAS, Tableau) on large data sets.\n<br><br>\n+ Experience in building, training, scoring, tuning and maintaining predictive models in production at enterprise scale.\n<br><br>\n+ Proven ability to sift through data, identify critical information, analyze, develop hypothesis and make recommendations to broader audience.\n<br><br>\n+ Proven track record of working cross functionally to develop innovative solutions using advanced analytics.\n<br><br>\n+ Prior experience synthesizing and packaging complex analyses and delivering results to non-technical audiences including senior leadership teams.\n<br><br>\n+ Excellent written and verbal communication skills, including ability to develop and deliver presentation.\n<br><br>\n+ Familiarity with agile development methodology.\n<br><br>\nNIKE, Inc. is a growth company that looks for team members to grow with it. Nike offers a generous total rewards package, casual work environment, a diverse and inclusive culture, and an electric atmosphere for professional development. No matter the location, or the role, every Nike employee shares one galvanizing mission: To bring inspiration and innovation to every athlete* in the world.\n<br><br>\nNIKE, Inc. is committed to employing a diverse workforce. Qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, veteran status, or disability.\n\n\n<ul>\n<li>*Job ID:** 00389867</li>\n<li>*Location:** United States-Oregon-</li>\n<li>*Job Category:** Technology</li>\n</ul>"}