{"job title": "Data Scientist 5", "company": "Northrop Grumman", "city state": "– Fairfax, VA", "rating": "3.7", "job description": "<div>\n<div><strong>Description</strong></div>\n<br>\n<div>Northrop Grumman is seeking Data Scientists to support our Headquarters Marine Corps (HQMC) Analytics and Data Support team in Fairfax, VA.</div>\n<br>\n<div>The research team conducts advanced analytics and research support for the U.S. Marine Corps. The team works with data form numerous data sources and can be asked to address questions supporting any topic of interest to HQMC.</div>\n<br>\n<div>The Data Scientist will support multiple projects. Primary tasks include: developing data mining and modeling plans; describing, exploring, and verifying data quality; selecting, cleaning, constructing, integrating, and formatting data; selecting modeling techniques; generating training, testing, and validation designs; building and evaluating models; developing visualizations of model results.</div>\n<br>\n<div><strong>Responsibilities</strong></div>\n\n<li>Serve as a Data Scientist in support of HQMC, responsible for developing statistical models and methods to support predictive analytics to help Marine Leaders make data informed decisions</li>\n<li>Position requires data analytics, statistics, mathematical and communication skills while working in a multi-functional team environment</li>\n<li>Applies operations research, statistical, mathematical, and analytical techniques related to numerous topics</li>\n<li>Provides analysis and develops information papers, presentations, and other correspondence as required</li>\n<li>Presents data to senior military and civilian leaders and provides recommendations as necessary</li>\n<li>Performs data consolidation, cleansing and analysis, and presents data from one or more source systems</li>\n\n<div><strong>Basic Qualifications:</strong></div><strong>\n\n<br></strong>\n\n<li>Bachelor's degree from an accredited college or university in Mathematics, Statistics, or other technical degree and 14 years of experience or Master's Degree and 12 years of experience or PhD and 9 years of experience.</li>\n<li>Experience with statistical analyses involving anomaly detection (e.g., support vector machine, principal component analysis), clustering (e.g., k-means, hierarchical), regression (e.g., linear, multi-level), two- and multi-class classification (e.g., logistic regression, decision tree, neural network)</li>\n<li>Proficiency with statistical programs such as R (preferred), Python (preferred), SAS, SPSS, and MATLAB.</li>\n<li>Demonstrated experience in data management (e.g., Oracle, SQL)</li>\n<li>Ability to collaborate in a team environment</li>\n<li>Ability to comprehend and analyze complex problems</li>\n<li>Ability to obtain/maintain Department of Defense (DoD) Secret clearance</li>\n<li>Excellent written and oral communication</li>\n<li>U.S. Citizenship is required</li>\n\n<strong><div>Preferred Qualifications:</div>\n\n<br></strong>\n\n<li>Proficiency in R and/or Python statistical programs; demonstrated experience with SQL</li>\n<li>Demonstrated experience developing data visualization products such as R Shiny, Tableau, and Qlik</li>\n<li>Experience working in HQMC, Marine Commands or Joint Staff</li>\n<li>Familiarity briefing senior military and civilian leaders</li>\n<li>Modeling and simulation experience, especially with DoD applications</li>\n<li>Knowledge of the U.S. Marine Corps' health promotion, risk reduction, and suicide prevention programs</li>\n<li>Interim DoD Secret clearance required to start</li>\n\n<div>- PT telecommuting may be available\n<br><br>\nNorthrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit www.northropgrumman.com/EEO. U.S. Citizenship is required for most positions.</div></div>"}