{"job title": "Data Scientist - Smart Cities", "company": "Parsons Corporation", "city state": "– Denver, CO", "rating": "3.4", "job description": "Data Scientist - Smart Cities\n<br><br>\n<strong>Location:</strong>\n<br><br>\nUnited States\n<br><br>\n<strong>Requisition #:</strong>\n<br><br>\n<strong>52374</strong>\n<br><br>\n<strong>Post Date:</strong>\n<br><br>\nParsons is looking to hire a Data Scientist for our smart cities initiative. This person will serve as a member of our RD product team with responsibilities of our smart city data analysis outcomes.They will work with the principal architect and be a key stake holder in defining the principles shaping our data schemas and AI adoption practices. As a member in research and development this person will be responsible for fostering a culture inspiring technical experimentation for pushing the envelope of what?s possible while raising the bar of excellence.\n<br><br>\nWe are looking for a data scientist capable of identifying gaps, extrapolate, and create ML to automate insights. Someone who possesses loads of intellectual horsepower and looking to tackle the most complex problem spaces with the simplest algorithms. Someone who is naturally inquisitive and will ask more questions than answers provided.\n\n\n<ul>\n<li>*PrimaryResponsibilities:**</li>\n</ul>\n\n+ Identifying the data-analytics problems and solutions that offer the greatest opportunities to Operational Intelligence in Smart Cities\n<br><br>\n+ Continuously collecting massive amounts of crazy data (both vertical and horizontal) and transforming it into a more usable format\n<br><br>\n+ Create data schemas and data marts to pivot on data\n<br><br>\n+ Solve operationally-related problems using data-driven techniques\n<br><br>\n+ Working with a variety of programming languages, including SAS, R and Python\n<br><br>\n+ Staying on top of analytical techniques such as machine learning, deep learning and text analytics\n<br><br>\n+ Communicating and collaborating with both product and business teams\n<br><br>\n+ Looking for order, patterns trends in data\n<br><br>\n+ Collecting large sets of structured and unstructured data from several sources\n<br><br>\n+ Scrubbing and maintaining data integrity in compliance with product protocols\n<br><br>\n+ Devising and applying models and algorithms to mine stores of big data opportunistic discovery\n\n\n<ul>\n<li>*Requirements:**</li>\n</ul>\n\n+ 8+ years? experience in data science\n<br><br>\n+ 2-4+ years designing and delivering high performing large scale distributed data systems\n<br><br>\n+ A Bachelor?s degree in Computer Science or Business Intelligence\n<br><br>\n+ Experienced with ML/ AI in a big data environment\n<br><br>\n+ Ability to perform multiple, complex assignments under limited direction required\n<br><br>\n+ Ability to plan and accomplish assignments as an individual contributor\n<br><br>\n+ Ability to effectively communicate and achieve positive results, share information, provide data, furnish guidance, and discuss assignment status within the immediate work unit required\n<br><br>\n+ Ability to develop advanced highly optimized database queries required\n\n\n<ul>\n<li>*Travel Requirement:**</li>\n</ul>\n\n+ 15-30% travel will be required.\n<br><br>\nMust have at least a bachelor?s degree (or foreign earned equivalent degree) in a computer, mathematics, or engineering field\n<br><br>\n_Parsons is a digitally enabled solutions provider focused on the defense, security, and infrastructure markets. With nearly 75 years of experience, Parsons is uniquely qualified to deliver cyber/converged security, technology-based intellectual property, and other innovative services to federal, regional, and local government agencies, as well as to private industrial customers worldwide._\n<br><br>\n_Parsons is an equal opportunity, drug-free employer committed to diversity in the workplace. Minority/Female/Disabled/Protected Veteran/LGBT._\n<br><br>\n_For more about Parsons, visit_ _parsons.com_ _and follow us on_ _Facebook_ _,_ _Twitter_ _,_ _LinkedIn_ _, and_ _._\n<br><br>\nParsons is an equal opportunity, drug-free employer committed to diversity in the workplace. Minority/Female/Disabled/Protected Veteran/LGBT\n<br><br>\nParsons is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regards to an individual's race, color, religion, national origin, ethnicity, union affiliation, age, sex, sexual orientation, gender identity and expression, pregnancy, employable physical or mental disability, veteran status, genetic information, immigration status, or any other basis protected by applicable laws."}