{"job title": "Principal Data Scientist", "company": "Personal Genome Diagnostics", "city state": "– Baltimore, MD", "rating": "3.7", "job description": "<div>\n<div>\nPrincipal Data Scientist<br>\n\n <div>\n<div>\nPosted in\n<br><br>\non \n<br><br>\n August 29, 2018\n<br><br>\n by \n<br><br>\n Nakera Lee</div>\n</div><br>\n\n<div><div>\n<ul>\n\n<br>\n<li>Full Time</li>\n\n<li>Baltimore, MD</li>\n<li>Posted 6 days ago</li>\n</ul><br>\n\n<div>Website\n<br>\n <strong>Personal Genome Diagnostics</strong></div><br>\n\n <div><strong>JOB DESCRIPTION:</strong>\n<br><br>\nPersonal Genome Diagnostics is seeking a Principal Data Scientist who will be responsible for empowering the use of analytical data assets to improve business performance.\n<br><br>\nThe Principal Data Scientist is a key leader in supporting a highly scientific and technical internal organization to make metrics-based decision a ubiquitous element of our corporate culture. The Data Scientist would work collaboratively with multiple scientific functions, business functions and technology teams in experimental design and data-driven problem solving.\n<br><br>\nThis position provides statistical and data visualization mentoring and support to complex projects that span multiple departments and functions. The Principal Data Scientist would assess the effectiveness and accuracy of data gathering techniques, business algorithm development and experimental design approaches. This position documents the statistical methodologies and data-driven approaches leveraged by various internal functions and would serve as a liaison to internal and external groups to articulate and justify the methodologies which were leveraged to produce data-driven results.\n<br><br>\n<strong>KEY RESPONSIBILITIES:</strong>\n\n<ul>\n<li>Work collaboratively with teams to advise methods for data capture, data wrangling, data intuition and data visualization support. Mentor teams on how to documentation data lineage, accuracy of data sources and data gathering techniques, especially as related to efforts supporting clinical trials. Develop the capability, methods and documentation, as needed to support various teams. Review approaches to leveraging data assets to ensure that they comply with FDA, ISO and industry best practices.</li>\n<li>Serve as organizational representative to external partners regarding analysis methodology. Champion statistical approaches to external partners, especially as related to clinical trials and related regulatory submissions.</li> \n\n<li>Work collaboratively with Biostatistical staff supporting various research efforts. As needed, provide statistical analysis methodologies and coding. Serve as reviewer of statistical analysis plans.</li> \n\n<li>Work collaboratively with laboratory teams to develop enterprise data-driven capabilities to monitor and assess laboratory operations.</li>\n<li>Work collaboratively with manufacturing, sales and customer relationship teams to develop methodologies and algorithms which support metrics-based problem solving, KPI monitoring, and predictive analytical approaches to support business optimization.</li>\n<li>Work collaboratively with finance, sales, marketing and leadership to develop informational assets that articulate business performance.</li>\n<li>Work collaboratively with internal business functions (HR, Finance, IT) to develop data-driven monitoring and KPI reporting of business operations</li>\n<li>Work closely with System and Data Architects, Data Coordinators, DBAs and other staff engaged in data warehousing to standardize the harnessing of corporate data assets.</li>\n</ul>\n<strong>REQUIRED EDUCATION AND EXPERIENCE:</strong>\n\n<ul>\n<li>2 or more years of industry experience supporting translational sciences, clinical research, laboratory services, medical devices or related field.</li>\n<li>5 or more years of experience developing statistical methodologies. 2 or more years of experience in a lead role advocating statistical design approaches which align with budget, time and scientific design constraints.</li>\n<li>2 or more years of experience mining and analyzing data and experience manipulating data (R, Python, SQL, etc) to draw insights.</li>\n<li>Demonstrated experience in an effective mentoring role.</li>\n<li>Experience with Good Clinical Data Management Practices (GCDMP) principles and systems used to manage clinical study data. Experience with SOP and Work Instruction development and enforcement</li>\n<li>Excellent collaboration, leadership, communication and decision-making skills.</li>\n<li>Experience developing and documenting statistical methods, data capture, data wrangling, data intuition and data visualization.</li>\n<li>Ability to work independently and in teams (and work with technical and non-technical staff)</li>\n<li>Ph.D. in Statistics, Data Science or related field (A Master’s level with preferred experience will be considered)</li>\n<li>10+ years of experience in statistical analysis, data sciences or related field</li>\n</ul>\n<strong>PREFERRED EXPERIENCE:</strong>\n\n<ul>\n<li>Experience with next-generation sequencing (NGS) applications</li>\n<li>Experience with medical device development and manufacturing, especially with FDA regulations and guidance.</li>\n<li>Experience with Laboratory Information Management Systems and/or Biorepository Systems.</li>\n<li>Understanding of Cancer/Tumor/Oncology terminology and disease progression. Knowledge of ICDO-x, ICD-x, CPT-x, etc. medical coding systems.</li>\n<li>Knowledge of data standards related to clinical trials, such as CDISC/BRIDG</li>\n<li>Knowledge across multiple database technologies: MS SQL Server, PostgreSQL, and MongoDB. Experience with iCloud databases. Experience diagraming databases, data architecture or systems architecture</li>\n<li>Experience with scripting languages, with a strong preference for R, SAS and/or Python coding experience.</li> \n\n<li>Experience across a range of BI-Toolsets: Power BI, Tableau, etc.</li>\n<li>Experience with CRM, Contracting, Finance and HR systems</li>\n</ul>\n<strong>ABOUT PERSONAL GENOME DIAGNOSTICS:</strong>\n<br><br>\nPersonal Genome Diagnostics (PGDx) empowers the fight against cancer by unlocking actionable information from the genome. We are committed to developing a portfolio of regulated tissue-based and liquid biopsy genomic products for laboratories worldwide. PGDx was established by internationally-recognized cancer researchers Dr. Luis Diaz and Dr. Victor Velculescu, who are pioneers in the application of innovative genomic technologies for drug development and clinical practice.\n<br><br>\nPlease submit applications (cover letter and resume) to HR@personalgenome.com</div><br>\n\n<div>\n<div>To apply for this job <strong>email your details to</strong> hr@personalgenome.com</div>\n </div>\n </div>\n </div><br>\n\n<div>\n<div>\nPosted in\n<br><br>\non \n<br><br>\n August 29, 2018\n<br><br>\n by \n<br><br>\n Nakera Lee</div>\n</div>\n</div>\n</div>\n\n<br>"}