{"job title": "Senior Data Scientist", "company": "Sentry Data Systems", "city state": "– Mequon, WI", "rating": "2.4", "job description": "<div><div><div>Senior Data Scientist</div></div><div><div><div>Level <div><div>Undisclosed</div></div></div><div>Job Location <div><div>Mequon Office - Mequon, WI</div></div></div><div>Position Type <div><div>Undisclosed</div></div></div><div>Education Level <div><div>Undisclosed</div></div></div></div><div><div>Salary Range <div><div>Undisclosed</div></div></div><div>Travel Percentage <div><div>Undisclosed</div></div></div><div>Job Shift <div><div>Undisclosed</div></div></div><div>Job Category <div><div>Undisclosed</div></div></div></div></div><div><div>SUMMARY</div></div><div><div> <div>This individual oversees the activities of data scientists and data/business analysts, ensuring proper execution of analytic projects, including the acquisition, management, manipulation, and analysis of data and reports. The Senior Data Scientist will work with department leadership to develop, implement, manage, and continually improve scalable analytic solutions that meet best practice standards. The ideal candidate will enjoy working with both technical and business staff on projects and will possess advanced skills and experience in computer science and applications, modeling, statistics, analytics and math.\n<br><br>\n<strong>POSITION DESCRIPTION:</strong>\n<ul>\n<li>Perform and/or manage data scientists and data/business analysts in the execution of complex research and analytics to help determine root causes of performance issues across the entire process of data receipt, ingestion, transformation, and, ultimately, use by software applications and analysts.</li>\n\n<li>Explore and examine data from multiple disparate sources to identify value-added opportunities to enhance functionality and/or performance amongst all of Sentry’s applications.</li>\n\n<li>Analyze and problem solve issues with current and planned systems as they relate to the integration and management of data.</li>\n\n<li>Identify, analyze, and interpret trends or patterns in complex data sets.</li>\n\n<li>Sift through incoming data to discover previously hidden insights, which in turn can provide a competitive advantage or address a pressing business problem for Sentry clients.</li>\n\n<li>Acquire and abstract primary or secondary data from existing internal or external data sources.</li>\n\n<li>In collaboration with others, develop and implement data collection systems and other strategies that optimize statistical efficiency and data quality.</li>\n\n<li>Create and maintain consulting and analytic standards, considerations, methodologies, and controls.</li>\n\n<li>Define, scope, manage, and perform complex statistical analyses for projects and reports.</li>\n\n<li>Communicate informed conclusions and recommendations to Sentry leadership and customers.</li>\n\n<li>Assist in evaluating new technologies and methods of analyzing Sentry’s data.</li>\n\n<li>Assist in formulating new and creative customer use-cases that leverage Sentry’s data asset to address critical business needs or inform strategic business decisions.</li>\n\n<li>In collaboration with others, evaluate and monitor the completeness and accuracy of Sentry’s overall data asset; identify, understand, and communicate limitations or opportunities as related to planned projects to internal or external stakeholders.</li>\n</ul>\n\n</div>\n</div></div><div><div>QUALIFICATIONS</div></div><div><div> <div>\n\n<ul>\n<li>PhD or Master’s Degree in Information Management, Healthcare Information, Computing, Mathematics, Statistics, Applied Sciences, or equivalent combination of related experience</li>\n\n<li>Ability to communicate findings to both business and IT leaders in a way that can influence how an organization approaches a business challenge</li>\n\n<li>Ability to understand and generate complex process flows for assigned projects</li>\n\n<li>Advanced SQL skills</li>\n\n<li>Advanced data-mining skills using SAS, Python, SPSS, or R</li>\n\n<li>Tableau skills and experience preferred</li>\n\n<li>Possess strong Excel skills</li>\n\n<li>Aptitude for deploying and managing continuous process improvement techniques</li>\n\n<li>Ability to establish and maintain professional working relationships with all levels of staff, clients, and the public\n\n<ul>\n<li>Ability to supervise, mentor, and develop data/business analysts; assumes responsibility for performance of team</li>\n\n<li>Efficient and timely execution of projects</li>\n\n<li>Superior organizational skills with ability to prioritize and multi-task</li>\n</ul>\n\n\t</li>\n<li>Fast learner, able to understand new products/features and business objectives quickly</li>\n\n<li>Ability to work with minimal daily supervision\n\n<ul>\n<li>Willingness to be part of a team-unit and cooperate in the accomplishment of departmental goals and objectives</li>\n\n<li>Energetic, motivated individual with a desire to succeed</li>\n</ul>\n\n\t</li>\n<li>Attention to detail and editing skills</li>\n\n<li>Excellent verbal &amp; written communication skills</li>\n\n<li>Strong business acumen\n\n<ul>\n<li>Strong research capabilities</li>\n</ul>\n\n\t</li>\n</ul>\n<strong>SUPERVISORY RESPONSIBILITIES:</strong>\n<br><br>\nThis position will manage employees of their department and responsible for the performance management and hiring of the employees.\n<br><br>\n<strong>TRAVEL</strong>\n<br>\nAs needed, estimated not to exceed 10% of time. Travel may be outside the local area and overnight.</div></div></div></div>"}