{"job title": "Senior Data Scientist", "company": "SparkCognition", "city state": "– Austin, TX", "rating": "4.6", "job description": "SparkCognition is looking for innovative Data Scientists to join our team to help create the next generation of analytics and artificial intelligence solutions. At SparkCognition, you will immerse yourself in cutting-edge research and work with the latest technologies to deliver value in the Industrial IoT, Finance, and Defense spaces.\n<br><br>\nResponsibilities\n<br><br>\nBuilding models to solve specific problems. This includes, but is not limited to:\n<br><br>\nProcessing, cleansing, and verifying the integrity of data used for analysis\n<br><br>\nFeature engineering using various techniques for the enhancement of data\n<br><br>\nPerforming feature selection on original and generated data\n<br><br>\nUsing machine learning tools to develop and train models\n<br><br>\nPerforming efficacy testing of the models\n<br><br>\nBuilding automated tools that enable data scientists to more effectively perform tasks such as data cleaning, feature generation, feature selection, or model building\n<br><br>\nPerforming ad-hoc analysis and presenting results in a clear manner\n<br><br>\nWorking with a team to help solve new, never-before-solved challenges across multiple industries\n<br><br>\nSkills and qualifications\n<br><br>\nUnderstanding and experience using machine learning techniques and algorithms, including but not limited to: Linear Models, Neural Networks, Decision Trees, Bayesian Techniques, Clustering, Anomaly Detection, and more\n<br><br>\nExperience with data science languages, such as Python, R, MatLab, etc.\n<br><br>\nExperience with machine learning frameworks, such as PyTorch, TensorFlow, Theano, Keras, etc\n<br><br>\nGreat communication skills\n<br><br>\nGood applied statistics skills, such as distributions, statistical testing, etc.\n<br><br>\nGood scripting and programming skills, especially Python\n<br><br>\nExperience managing large volumes of data (terabytes or more)\n<br><br>\nGraduate degree (or equivalent industry experience), Ph.D. preferred, in Computer Science, Statistics, Physics, Mathematics, Neuroscience, Linguistics, Electrical Engineering, Economics, or a related scientific discipline\n<br><br>\nDesirable skills and qualifications\n<br><br>\nExperience with distributed computing, such as Hadoop, Spark, or an MPP environment\n<br><br>\nExperience with developing application on full stack of HTTP, JSON, REST, React, Java/C#, SQL and no-SQL databases\n<br><br>\nExperience with NLP, Big Data Analytics, and Graphing techniques"}