{"job title": "Field Application Scientist Biopharma Purification - Remote, MA", "company": "Thermo Fisher Scientific", "city state": "– Branford, CT", "rating": "3.3", "job description": "Job Description<br><br>When youre part of the team at Thermo Fisher Scientific, youll do important work, like helping customers in finding cures for cancer, protecting the environment or making sure our food is safe. Your work will have real-world impact, and youll be supported in achieving your career goals.\n<br><br>\n<strong>How will you make an impact?</strong>\n<br><br>\nThe Sr. Field Application Scientist will serve as the customer facing technical consultant/expert during both pre-sales and post-sales commercial engagements. Acting as the customer facing technical expert, you will drive successful product evaluations of purification solutions through understanding the customers goals and technical challenges followed by providing the appropriate technical information. Technical information may be sourced from personal experience, literature references or an internal knowledge database. When warranted, you will execute lab experiments that are strategically designed to move specific customer evaluations forward. You will be required to work on both a technical and business level during customer interactions and will develop a rich network of contacts both locally and globally.\n<br><br>\n<strong>What will you do?</strong>\n<ul>\n<li>Responsible for the technical component of pre-sales, post-sales and market development activities with a defined geographic region</li><li>Deliver technical presentations on the features and benefits of POROS and CaptureSelect purification products</li><li>Hold technical discussions on downstream purification challenges and solutions</li><li>Consult on process development, column packing, chromatography optimization and scaling and troubleshooting from pilot to large-scale.</li><li>Document evaluation progress through technical reports in an on-line database (SFDC)</li>\n</ul>\n<strong>How will you get here?</strong>\n<br><br>\n<strong>Education</strong>\n<br><br>\nB.S. or higher degree in biochemistry, chemical engineering, biotechnology, biology or chemistry\n<br><br>\n<strong>Experience</strong>\n<ul>\n<li>Significant experience (3-5 FAS, &gt;7 years Sr. FAS) in a downstream process development setting where chromatography-based purification methods were developed, scaled and validated</li><li>Prior experience with lab, pilot and large scale biopharmaceutical purificatio</li>\n</ul>\n<strong>Preferred Experience</strong>\n<ul>\n<li>Experience with process scale column packing (&gt;100L)</li><li>Experience with filtration or other downstream unit operations</li><li>Experience working in an external-facing role</li><li>Experience working with automated purification models (robo column/predictor plates)</li>\n</ul>\n<strong>Knowledge, Skills, Abilities</strong>\n<ul>\n<li>Ability to operate and interpret data from AKTA or alternative process development LC chromatography workstations</li><li>Knowledge of small-scale, pilot scale and large scale chromatography and column packing</li><li>Knowledge of analytics used to support purification process development, including HPLC, ELISA, SDS-PAGE and Spectroscopy and ability to interpret such data sets.</li><li>Ability to work independently, analyze data, troubleshoot and speak in a public setting</li><li>Strong written and oral communication skills</li><li>This position is remote, with travel requirements of up to 50%.Partner with the local Commercial team to drive the technical aspects of pre-sales and post-sales activities with our customers primarily through consultation with lab work when warranted</li>\n</ul>\nAt Thermo Fisher Scientific, each one of our 70,000 extraordinary minds has a unique story to tell. Join us and contribute to our singular missionenabling our customers to make the world healthier, cleaner and safer.<br><br>If you are an individual with a disability who requires reasonable accommodation to complete any part of our application process, click here for further assistance.<br><br>Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status."}