{"job title": "Lead Systems Data Scientist", "company": "Transocean", "city state": "– Houston, TX", "rating": "3.2", "job description": "Engineering &amp; Technical Svcs Group<br><br><strong>Transocean is focused on being the employer of choice for the drilling industry.</strong>\n<br><br>\n<strong><strong>We are challenging ourselves every day to push the performance of the company through technological advances and passion for our work.</strong></strong>\n<br><br>\n<strong><u>Job Description</u></strong>\n<br><br>\n<strong>DUTIES</strong>:\n<br><br>\nA Systems Data Scientist is charged with ensuring the following Department objectives:\n<br><br>\nCombine and synthesize data from multiple sources, select appropriate analytical methods to explore, develop, and test hypotheses. Develop and apply predictive models, communicate results effectively and clearly to a range of audiences Stay up to date with techniques and tools Use a Systems Engineering approach for the design, realization, technical management, operations, and retirement of systems concerned within the context of the Transocean Technology Innovation Process. Maintaining compliance with established Company policies and procedures, compliance of general business practices with applicable government laws and regulations, and Integrity and security of the Company’s data systems.\n<br><br>\nThe Systems Data Scientist will conduct the activities described below in support of the above Department objectives.\n<br><br>\nSystems Data Scientist will perform activities such as:\n<ul>\n<li>Developing and managing System Level requirements following the Transocean Systems Engineering Process.</li><li>Collect, analyze, and interpret information from multiple data sources identifying actionable insights that create efficiencies and improve drilling performance and safety.</li><li>Build predictive models and machine-learning algorithms for second-level analytics.</li><li>Develop reports and/or presentations leveraging data visualization tools that clearly and concisely communicate analytical findings and recommendations to key stakeholders.</li><li>Leverage analytical tools (SQL, SAS, Tableau) and data mining techniques to perform advanced data manipulation and extract insights from large databases.</li><li>Other duties may be assigned. Identify and implement strategies to leverage valuable data sources across search, signal, RMS, GMS and other digital channels.</li><li>Support ad hoc analytics need as requested.</li>\n</ul>\n<strong><u>QUALIFICATIONS:</u></strong>\n<br><br>\n<strong>EDUCATION:</strong> Master’s Degree in Computer Science, Mathematics, Engineering or other relevant disciplines. Understanding of signal processing, databases and experience with data mining.\n<br><br>\n<strong>EXPERIENCE:</strong> Proficiency in analysis packages (e.g. R, SAS, Matlab) and programming languages (e.g. Python, Ruby, Java, Scala) and machine learning methods.\n<br><br>\n<strong>TRAVEL:</strong> The ability to travel up to 10% of the time internationally is a must.\n<br><br>\n<strong>WRITING:</strong> Must be capable of writing and presenting information to the Company’s Senior Management.\n<br><br>\n<strong>INGENUITY:</strong> Incumbent must be capable of working with limited direct supervision and should be further capable of sorting through complex issues with a high degree of professional skepticism. Have the ability to work independently and will possess the poise and flexibility required to work in a highly dynamic environment.\n<br><br>\n<strong>DECISION-MAKING:</strong> Demonstrate the capacity for effective decisions and drawing sound conclusions regarding Company processes and procedures and Data Science practices.\n<br><br>\n<strong>INTERPERSONAL SKILLS:</strong> Must be able to work with all levels of personnel and management in a professional manner.\n<br><br>\n<strong><u>Education</u></strong>\n<br><br>\n<strong><u>Work Experience</u></strong>\n<br><br>\n<strong><strong>If you want to push yourself to great achievement, let Transocean develop your career.</strong></strong>"}