{"job title": "Principal Data Engineer", "company": "Wood Mackenzie", "city state": "– TX-Houston", "rating": "3.5", "job description": "<div> Job ID: 20180706-12107-CK \n<br>\n<br>\nCompany Name: Wood Mackenzie</div> \n<br>\n<div><strong>Description:</strong></div><div>\n<div><strong>Job Title:</strong>\n<br><br>\nPrincipal Data Engineer</div> <div><strong>Location:</strong><br><br>Houston</div>\n\n<br><strong>Company</strong>\n<br><br>\nFor the past 40 years, Wood Mackenzie has established its reputation as a trusted source of intelligence, enriching lives by empowering clients with unique insight on the world’s natural resources.\n<br><br>\nNow, as part of the Verisk family, that legacy is even stronger. Aligning with the world’s leading data analytics company extends our ability to support clients with our unrivalled analysis and advice.\n<br><br>\nTogether, we inspire and innovate the markets we serve – providing invaluable intelligence that informs the strategy that will ultimately shape the future direction of our global natural resources.\n<br><br>\n<strong>Team Description</strong>\n<br><br>\nThe Analytics Lab team at Wood Mackenzie is working to find new ways of unlocking value for clients through data and analytics. We are building a collaborative environment that facilitates bespoke data sharing within Study Groups of clients to conduct pilot projects to evaluate the power of predictive models on combined datasets.\n<br><br>\n<strong>Role Purpose</strong>\n<br><br>\nWood Mackenzie is seeking a Principal Data Engineer to join our Analytics Lab team to generate innovative data solutions that will solve complex business problems in collaboration with our clients. They will have experience in applying data mining techniques, extracting data from a variety of sources and data types, complex data transformations, and preparing tidy data sets suitable for machine learning algorithms. They should have strong communication and interpersonal skills and will be able to explain the provenance and quality of final data sets to colleagues from all areas of the business and to clients.\n<br><br>\nThe role requires a strong data-focussed personality, with a keen eye for detail. They should have experience of working in a data environment with multiple streams of data. We are looking for someone who has an innovative approach to working with data and is willing to learn technologies that create new data solutions.\n<br><br>\nThis successful candidate for this role must have a strong technology background, and understand the challenges of building a modern data centric business. Proven technical experience in data transformation and collaborative data science in a cloud or shared data environment. Achieving results will hinge on an ability to work collaboratively with colleagues across organizations and stakeholder groups, developing creative solutions to new problems, and leveraging the expertise and talents of Wood Mackenzie and the wider Verisk company group.\n<br><br>\n<strong>Main Responsibilities</strong>\n\n<ul>\n<li>Working with Analytics Lab team members and Technology division leaders to define the technical roadmap for data used in analytics – informing and challenging on technical and business directions.</li>\n<li>Design, prototype and productize data sets that are used both internally and externally for predictive analytics</li>\n<li>Support other data professionals (internal and external) in the adoption of industry leading data tools/frameworks that enable predictive analytics</li>\n<li>Collaborate with our internal research teams to ensure data inputs and outputs are interpreted and utilized in predictive data sets correctly and appropriately in context</li>\n<li>Develop tools to explore and interrogate datasets to communicate the completeness, quality, provenance, and fidelity of the underlying data</li>\n<li>Deploy solutions to a shared cloud environment (AWS) and facilitate the data set preparation and data science activities for the team and clients in this environment</li>\n<li>Build tools and reports to ensure information security and data protection requirements are adhered to as agreed with clients</li>\n<li>Regularly feedback learnings and contribute experience and perspective to various other stakeholder groups at Wood Mackenzie</li>\n<li>Act as, and be seen as, a respected and trusted adviser</li>\n</ul>\n<br><br>\n<strong>Knowledge &amp; Experience</strong>\n\n<ul>\n<li>Adept at AWS based deployments of data processes and data science</li>\n<li>Experience of building and managing production data pipelines using a variety of technologies (Hadoop, Hive, Pig, Spark, Athena...) to deliver data in a variety of formats</li>\n<li>Experience of building and supporting data science activities using a variety of technologies (such as Jupyter notebooks, R Studio / Shiny, Tensorflow)</li>\n<li>Experience of building and running Real-time data streaming solutions using technologies like Kafka or Kinesis</li>\n<li>Hands on experience with schema/message design and modelling</li>\n<li>Expert level Python, with working knowledge or comfort level with some other languages (including, not limited to, Java, R, .NET, Julia, etc.)</li>\n<li>Delivered data projects to data science teams.</li>\n<li>Excellent understanding of advancements in Data Science and how this can contribute to improvements within data engineering.</li>\n<li>Experience scaling data processing and/or ML algorithms over large scale, distributed computing environments and other high performance solutions (e.g. GPUs) is a plus</li>\n</ul>\n<strong>Core Competencies</strong>\n\n<ul>\n<li>Excellent communication skills, including mentoring more junior developers and discussing architectural designs at abstract and more tangible implementation levels</li>\n<li>Strong organization and planning skills and the ability to manage own workload and that of others within sometimes tight timescales</li>\n<li>The ability to work as part of a team involving multiple locations and time zones</li>\n<li>Commitment to excellence and meeting high quality standards expected by our clients</li>\n<li>Attention to detail, high standard of excellence, passionate about the value-add from high quality data engineering</li>\n</ul>\n<br><br>\n<strong>WoodMackenzie Core Values</strong>\n<br><br>\nWood Mackenzie is a place where we are committed to supporting our people to grow and thrive. We value different perspectives and aspire to create an inclusive environment, which encourages diversity and fosters a sense of belonging.\n<br><br>\nOur core values are:\n\n<ul>\n<li>Respect for the Individual</li>\n<li>Integrity</li>\n<li>Passion</li>\n<li>Persistence</li>\n<li>Confidence with humility</li>\n<li>Excellence</li>\n<li>Teamwork</li>\n</ul>\nWe understand the importance of achieving balance between work, family and other life commitments. We are open to considering flexible working arrangements to enable the greatest spectrum of talent to contribute to Wood Mackenzie's success.\n<br><br>\n<strong>EEO statement</strong>\n<br><br>\nUnsolicited resumes submitted to Maplecroft by any external recruitment agency via Internet, e-mail, fax, or U.S. mail become the property of Wood Mackenzie and we are not responsible for any fees associated with those resumes.\n<br><br>\nIn compliance with the Civil Rights Act of 1964 and 1991, the Age Discrimination in Employment Act of 1967, Section 504 of the Rehabilitation Act of 1973, the Americans with Disabilities act of 1990 and all other relevant federal and state laws, the policy of this company prohibits discrimination in employment because of race, color, religion, national origin, sex, gender identity and/or expression, age, veteran’s status, disability, genetic information or any other group protected by law. Applicants are considered for all positions without regard to race, color, religion, national origin, sex, gender identity and/or expression, age, veteran’s status, disability, genetic information or any other group protected by law.\n<br><br>\nIf you are a qualified individual with a disability or a disabled veteran, you may request a reasonable accommodation if you are unable or limited in your ability to use or access WoodMac.com/careers on-line as a result of your disability. You can request reasonable accommodations sending an email to hrenquiries@woodmac.com.\n<br><br>\nWe are an Equal Opportunity Employer M/F/V/D, and a member of E-Verify.\n<br><br>\nhttp://www.eeoc.gov/</div><br>\n\n<div><strong>Requirements:</strong></div><div> \n<div> Expertise Research</div> <div> Education Bachelors (or equivalent work experience)</div> <div> Job Type Full Time</div> <div> Location TX-Houston</div> <div> Years of Experience 5-8 Years</div> </div>\n\n<br>"}