{"job title": "Senior Data Scientist", "company": "", "city state": "– Lowell, Massachusetts", "rating": "NA", "job description": "<div><strong>The Company</strong>\n<br><br>\nWorldpay is making payments smarter, faster and easier for all our partners, as well as the consumers they serve. From the largest retailers in the U.S. to the coffee shop down the street, we are leading the transformation in payments through chip-enabled cards, mobile wallets, eCommerce, and payment solutions for businesses of all sizes. We are the fastest growing payments company in the U.S., first in PIN Debit transactions and the second largest merchant acquirer. Visit Worldpay.com for more.\n<br><br>\n<strong>The Opportunity</strong>\n<br><br>\nWorldpay's growth is one attributed not only to our first-in-class products and services, but also our ability to find new avenues of opportunity. This sense of discovery is thanks to the innovative and visionary work of our Marketing team; a team that leaves no stone unturned in seeking out and exploring new channels for Vantiv. When we are proactive and beating the trends in our marketing strategy, we stay ahead of the competition and assure continued growth and success at Worldpay.\n<br><br>\nThe Senior Data Scientist designs and develops methods and systems that have the ability to consolidate and analyze \"big data\" that generate insights to untapped client solutions. He/she will develop and code software programs, algorithms and automated processes to cleanse large datasets into meaningful information for gathering insight. By being able to draw conclusions from large, disparate sources of data, Vantiv can identify and pursue new areas of growth, preempt trends and continue our exponential growth.\n<br><br>\n<em>Rewarding Impact. Fulfilling Careers.</em>\n<br><br>\nMaking an impact isn't something reserved for people in corner offices. At Worldpay, it comes from people in every corner of the office. People with ambition, optimism and courage. We provide growth and opportunity and give employees flexibility in how they get the job done. You might not expect that from a big payments company, but we're smart enough to know how to hire the best and when to step aside and let them lead. Our goal is that you never stop learning and you never cease to amaze--especially yourself. If this fits your career goal, we can't wait to welcome you on board.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Designs, develops and programs methods, processes, and systems to consolidate and analyze unstructured, diverse \"big data\" sources to generate actionable insights and solutions for client services and product enhancement.</li><li>Interacts with product and service teams to identify questions and issues for data analysis and experiments.</li><li>Develops and codes software programs, algorithms and automated processes to cleanse, integrate and evaluate large datasets from multiple disparate sources.</li><li>Identifies meaningful insights from large data and metadata sources.</li><li>Interprets and communicates insights and findings from analysis and experiments to product, service and business managers.</li><li>Having wide-ranging experience, uses professional concepts and company objectives to resolve complex issues in creative and effective ways.</li><li>Ability to draw on past experience and current data to influence business partners and provide insightful analytics.</li><li>Ability to challenge conclusions and impact business outcomes.</li><li>Works on complex issues where analysis of situations or data requires an in-depth evaluation of variable factors.</li><li>Exercises judgment in selecting methods, techniques and evaluation criteria for obtaining results.</li><li>Networks with key contacts outside own area of expertise.</li><li>Ability to perform onsite due diligence of potential acquisition targets.</li><li>Ability to influence outcomes and business partner decisions (viewed as trusted business advisor) with extensive subject matter expertise.</li><li>Works in larger cross-functional teams with ability to influence senior leaders in Finance and Business.</li><li>Determines methods and procedures on new assignments and may coordinate activities of other personnel.</li>\n</ul>\n<strong>Qualifications:</strong>\n<ul>\n<li>Typically requires a minimum of 8 years of related experience with a Bachelor's degree; or 6 years and a Master's degree; or a PhD with 3 years of experience; or equivalent experience.</li>\n</ul>\n\n<em>All the above duties and responsibilities are essential job functions for which reasonable accommodation will be made. All job requirements listed indicate the minimum level of knowledge, skills and/or ability deemed necessary to perform the job proficiently. This position description is not to be construed as an exhaustive statement of duties, responsibilities or requirements. Employees may be required to perform any other job-related instructions as requested by their leader, subject to reasonable accommodation.</em></div>"}