{"job title": "Scientist", "company": "Cargill, Inc.", "city state": "– Plymouth, MN", "rating": "3.5", "job description": "Position Purpose\n<br><br>\nThe Scientist Sensory Position is part of the Cargill R&amp;D team in North America. Innovation in finished products utilizing Cargill's Food Ingredients and Protein business product portfolios requires in depth sensory expertise. This position will provide technical sensory support to a growing set of customer projects in Sensory Applications. The position reports to the R&amp;D Sensory leader for North America and is part of the R&amp;D Shared Capabilities team.\n<br><br>\nThis is a key technical position providing sensory evaluation expertise by working closely with R&amp;D, Consumer insights, and Marketing teams in the food ingredient and protein businesses. Basic understanding of sensory methodologies such as descriptive analysis, consumer panels, difference testing, and focus groups along with statistical sensory data analysis will be required for this position.\n<br><br>\nThe individual will have a chance to work independently as well as together with other sensory team members to support sensory projects. The dynamics of working with the sensory team and a group of trained panelists for a variety of sensory projects would be a great opportunity for the successful candidate to develop technical and leadership skills in a fast emerging, highly dynamic and technical business environment.\n<br><br>\nPrincipal Accountabilities\n<br><br>\n70% Sensory Team Support and Customer Collaboration\n\n\n<ul>\n<li>Provide sensory expertise to product development and cross functional business teams supporting internal Cargill and external customer projects by supporting various sensory projects including Descriptive Analysis (DA), Consumer and Difference type panels.</li>\n<li>Align with Global R&amp;D team strategy as well as Cargill Food Ingredient and Protein business needs and priorities and deliver results that enable the business to succeed.</li>\n<li>Lead sensory projects from planning through execution, analysis, report writing and communication of sensory results with recommended actionable next steps.</li>\n<li>Contribute to functional basic research projects including methodology development, reference development, training initiatives, alternative and creative ways to train panel, design a study or present statistical data.</li>\n<li>Apply sound, scientific practices and techniques to ensure all sensory projects are executed professionally and as per industry standards.</li>\n<li>Work closely with sensory and cross-functional teams to understand, execute and meet project objectives.</li>\n<li>Interact effectively with cross-functional project teams including other sensory team members, panelists, and able to work with a diverse group of people and work styles.</li>\n<li>Use sensory data collection software (e.g. EyeQuestion, Compusense or SIMS) to design sensory panels, develop and maintain sensory ballots.</li>\n<li>Work closely with other sensory team members to upkeep the sensory lab and sensory evaluation rooms. Responsibilities include and not limited to procuring and preparing samples/references, panel room set-up and clean-up, lab supply stocking and maintenance.</li>\n<li>Conduct research following Cargill's food safety and health&amp;safety policies.</li>\n<li>Document all work using electronic lab notebooks and tracking software systems. Protect this information as required by company policy.</li>\n<li>Able and willing to work on product development using novel and/or non GRAS ingredients.</li>\n</ul>\n\n20% Sensory Descriptive Analysis Panel Management and Execution Support\n\n\n<ul>\n<li>Conduct panel performance evaluation and providing regular feedback on individual panelist performance.</li>\n<li>Document any panelist concerns, opportunities, training offered and panelist progress and update the Sensory DA Panel Lead and contractor agency frequently.</li>\n<li>Manage recruitment and maintenance of new descriptive panelists working closely with the contractor agency. Provide initial training process and incorporating the new panelists with current panel.</li>\n<li>Taste and evaluate samples to support guiding and leading panel / team discussions to better understand sensory data and panelist evaluation experience.</li>\n</ul>\n\n10% Innovation, Project Improvement and Other Sensory Support\n\n\n<ul>\n<li>Identify innovative new approaches related to sensory science, panel training, statistical analysis, product and ingredient development.</li>\n<li>Assist in improving effectiveness of the sensory program and project management.</li>\n<li>Assist the sensory team in managing external sensory services and advance current sensory testing capabilities.</li>\n<li>Assist in creating IP to help Cargill capture value from innovation.</li>\n<li>Participate on global Cargill Sensory Enabling Sciences team network.</li>\n</ul>\n\nThis position is posted internally as well as externally.\n<br><br>\nA strong candidate has been identified for this position. However we will consider all candidates who meet the requirements.\n<br><br>\n<strong>Required Qualifications:</strong>\n\n\n<ul>\n<li>Bachelor's degree in Food Science or related field (e.g. Biology, Chemistry, Engineering, Nutrition etc.)</li>\n<li>2 years' technical experience in the food and beverage industry</li>\n<li>1 years' experience in sensory science</li>\n<li>Ability to understand and interpret qualitative and quantitative sensory data and statistical analysis</li>\n<li>Ability to communicate technical details to wide array of people and project teams</li>\n<li>Basic understanding of sensory data collection systems (EyeQuestion, Compusense or SIMS)</li>\n<li>Basic understanding of statistical analysis applied to sensory data</li>\n<li>Demonstrated ability to influence and lead sensory projects across teams</li>\n<li>Excellent organizational, interpersonal and conflict resolution skills</li>\n<li>Excellent verbal, communication, prioritization, report writing and presentation skills</li>\n<li>Ability to work independently as well as with teams</li>\n<li>Ability to travel up to 15%</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Master's degree in Food Science or related field with an emphasis in sensory analysis</li>\n<li>5 years of experience working in the sensory field with finished products or food ingredients</li>\n<li>Experience in designing and executing sensory panels</li>\n<li>Experience in recruiting, training and managing descriptive panel</li>\n<li>Experience in recruiting consumer panel</li>\n<li>Experience in using sensory data collection software (EyeQuestion, Compusense or SIMS)</li>\n<li>Expertise in statistical analysis of descriptive methods and panel performance</li>\n<li>Project management experience</li>\n</ul>"}