{"job title": "Laboratory Data Scientist", "company": "Clinical Pathology Laboratories", "city state": "– US-TX-Austin", "rating": "3.0", "job description": "<div><div>\n<div><strong>Position:</strong> Laboratory Data Scientist\n<br><br>\n<strong>Position Summary:</strong> The Data analyst/data scientist at CPL uses a broad spectrum of software tools and experience to mine, maintain, transform, report and analyze a host of data feeds in the modern clinical laboratory. This position also supports the maintenance of laboratory computerized systems, and assists in managing lab software systems projects to include software upgrades, change control procedures, regulatory compliance, and system validation. Strong critical thinking and communication skills are required on.</div>\n</div>\n</div>\n\n<br>Responsibilities<br>\n\n<div>\n<div>\n<div><strong>Principal Responsibilities:</strong>\n<ul>\n<li>Develop, optimize and maintain data systems and business analyses in support of technical, business, or financial departments using automation and advanced analytical tools. Skills in data munging, parsing, querying, and organizing are paramount.</li><li>Create and maintain SQL queries as-needed, both ad-hoc and regularly scheduled</li><li>Provide lab-centric monitoring &amp; troubleshooting of a wide variety of primary and ancillary systems and applications, interfacing with central IT support as required.</li><li>In conjunction with dedicated IT system support staff, maintain and monitor laboratory resources, systems &amp; software from a “lab-centric” perspective. Participate in system and software evaluations, transitions and implementations. Maintains patient confidentiality following all established HIPAA and compliance policies/guidelines</li><li>Process reports for state mandated communicable and infectious disease as well as regulatory audit reports as needed.</li><li>Create &amp; maintain laboratory information system policy and procedures</li><li>Follows all established procedures (departmental and company) at all times</li><li>Projects a positive, friendly, professional attitude towards customer service</li></ul></div>\n</div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div><strong>Education:</strong> BS or MS in computer science, information systems, and/or 3 years equivalent work experience.\n<br><br>\n<strong>Experience:</strong> Knowledge of laboratory processes, laboratory information systems and/or health information systems is not required but is preferred.\n<br><br>\n<strong>Skills:</strong> A strong command of English with the ability to communicate effectively and clearly with our users and clients is a required skill set. Excellent reading, writing and typing skills are required. Must be able follow procedures and organize information in a concise, thorough manner. Must be able to define and implement scripted computational pipelines, competently code in several computer languages, read and write SQL queries, and understand basic networking concepts.</div>\n</div>\n</div>\n<br>"}