{"job title": "TS Cleared Senior Data Scientist", "company": "Digital Management, Inc.", "city state": "– US-DC-", "rating": "3.5", "job description": "<div><div>\n<div>DMI (Digital Management, LLC.), the world’s first end-to-end mobility company, combines all the skills and services necessary to deliver mobile enterprise solutions. Built to reinvent business through mobility, DMI has expertise in mobile strategy, UX, web, and app development, omni-channel commerce, brand and marketing, IoT and big data analytics, and secure device and app management. The company’s unique, integrated approach to mobility has resulted in dramatic growth as well as an expanding client base, which includes hundreds of Fortune 1000 commercial clients and all fifteen U.S. Federal Departments. DMI is headquartered in Bethesda, MD, with satellite offices around the world. The company was named one of the 2018 Top Workplaces in the Washington, DC area by The Washington Post and received Inc. Magazine’s Hire Power Award as one of the top 100 Private Job Creators in the US. Additional information is available at www.dminc.com and on LinkedIn, Twitter, Facebook, and Instagram.</div>\n</div>\n</div>\n\n<br>About the Opportunity<br>\n\n<div>\n<div>\n<div>DMI (Digital Management, LLC.) is looking for a <strong>TS Cleared Senior Data Scientist</strong> to support Federal customer with providing IT technical support which includes the continuing development of IT capabilities.\n<br><br>\n<strong>Duties and Responsibilities:</strong>\n<ul>\n<li><div>Assist in selecting features, building and optimizing classifiers using machine learning techniques. Document use of classifiers for machine learning techniques, Help build algorithms to seek out significant information hidden iii vast amounts of data by working with users to develop criteria and parameters that effectively highlight and associate areas of interest.</div> </li><li><div>Document algorithms including criteria and parameters used in algorithm, with notes on approaches that didn't work out.</div></li><li><div>Apply data mining techniques using state-of-the-art methods to find trends and address potential knowledge gaps.</div></li><li><div>Process, clean, and verify the integrity of data used for analysis and be able to calculate accuracy and/or rank of data in a set in statistical terms.</div></li><li><div>Create or use automated anomaly detection systems and track system performance highlighting areas for improvement.</div> </li><li><div>Document results of anomaly detection and system performance.</div></li><li><div>Make recommendations on improving existing processes.</div></li><li><div>Research and develop statistical learning models for data analysis.</div></li><li><div>Collaborate with various offices and personnel to understand.company needs and devise possibl solutions.</div></li><li><div>Communicate results and ideas to unit leadership.</div></li><li><div>Implement new statistical or other mathematical methodologies as needed for specific models or analysis.</div></li><li><div>Optimize joint development efforts through appropriate database use and project design.</div></li><li><div>Create meaningful presentations and analyses which tell a story focused on insights, not solely data.</div></li><li><div>Synthesize methodology and data into an actionable business strategy and communicate findings to team members.</div></li></ul></div>\n</div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div><strong>Education and Years of Experience:</strong>\n<ul>\n<li><div>1O+ years of relevant experience</div></li><li><div>Expert in SQL and other programming languages</div></li><li><div>Extensive background in data mining and statistical analysis</div></li><li><div>Excellent understanding of machine learning techniques and algorithms, such as k-NN, NaYve Bayes, SVM, Decision Forests, etc.</div></li><li><div>Experience with data science toolkits, such as R, Weka, NumPy, MatLab, etc.</div></li><li><div>Experience with data visualization tools, such as D3.js, GGplot, etc.</div></li><li><div>Proficiency in using query languages such as Hive, Pig, etc.</div></li><li><div>Able to understand various data structures and common methods in data transformation</div></li><li><div>Excellent pattern recognition and predictive modeling skills</div></li><li><div>Experience with programming languages such as Java/Python/Hadoop a plus</div></li></ul>\n<ul>\n\n<li>\n<div><strong>Required Skills/Certifications:</strong></div></li></ul>\n<ul>\n<li><div>Active TS Clearance</div> </li>\n</ul>\n<strong>Additional Requirement(s):</strong>\n<ul>\n<li><div>M-F (excluding Federal Holidays) 8 hours/day between 6AM-6PM</div> </li>\n</ul>\n<strong>Min. Citizenship Status Required:</strong> US Citizen\n<br><br>\n<strong>Physical Requirement(s):</strong> No Physical requirement needed for this position<strong>.</strong>\n<br><br>\n<strong>Location:</strong> Washington, DC\n<br><br>\n<strong>Working at DMI</strong>\n<br><br>\nDMI is a diverse, prosperous and rewarding place to work. We provide our employees with competitive benefits, educational assistance, and career growth opportunities. Every employee is valued for their talents and contributions. We all take pride in helping our customers achieve their goals, which in turn contributes to the overall success of the company.\n<br><br>\nThe company does and will take affirmative action to employ and advance in employment individuals with disabilities and protected veterans, and to treat qualified individuals without discrimination on the basis of their physical or mental disability or veteran status. DMI is an Equal Opportunity Employer Minority/Female/Veterans/Disability.\n<br><br>\n<strong>***************** No Agencies Please *****************</strong>\n<br><br>\nApplicants selected may be subject to a government security investigation and must meet eligibility requirements for access to classified information. US citizenship may be required for some positions.</div></div>\n</div>\n<br>"}