{"job title": "Data Analyst / Scientist", "company": "DMAI", "city state": "– Los Angeles, CA", "rating": "NA", "job description": "We are seeking a highly motivated individual to take the lead in data collection and assist in data management as a member of DMAIs data team.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n\n<li>Work closely with product, and engineering team leads to understand NLP, CV, and Robotics applications to the final product and define success from the perspective of data.</li>\n\n\n</ul>\n\n\n\n<ul>\n\n<li>Collect quality data to accommodate the data requests placed by other engineering teams.</li>\n\n\n\n<li>Prepare and present data collection plans and updates to requester teams.</li>\n\n\n\n<li>Design and construct the data processing and analytics infrastructure necessary to perform advanced analytical research within the company.</li>\n\n\n\n<li>Coordinate Research Day and other research-related activities that are being routinely held in the company office.</li>\n\n\n\n<li>Facilitate and optimize the workflow of training data annotation.</li>\n\n\n\n</ul>\n<br><br>\n<strong>Required:</strong>\n\n<ul>\n\n<li>BA in related fields</li>\n\n\n\n<li>5+ year experience of relevant experience</li>\n\n\n\n<li>Proficiency in SQL and Python</li>\n\n\n\n<li>Strong written and oral communication skills</li>\n\n\n\n<li>Familiarity with common KPIs, metrics, and growth experiments</li>\n\n\n\n<li>Detail-oriented and self-motivated</li>\n\n\n\n</ul>\n<br><br>\n<strong>Preferred:</strong>\n\n<ul>\n\n<li>2+ Big Data experience (Kafka, Kinesis, Hadoop, HBase, Hive, Pig, EMR, Spark, Presto, or Elasticsearch)</li>\n\n\n</ul>\n\n\n\n<ul>\n\n<li>Passion for education and working with children</li>\n\n\n\n<li>Creative problem solving skills</li>\n\n\n\n<li>Familiarity with cloud platforms (AWS, GCP)</li>\n\n\n\n<li>Background knowledge in statistics and analytics</li>\n\n\n\n</ul>\n\n<div>\n<div>\n<div>\n<div><strong>Who We Are</strong>:\n<br><br>\nDMAI is an early-stage startup committed to developing top-notch Artificial Intelligence technologies for education. As a team of UCLA and Harvard alumni including post-docs, PhDs, and undergrads, were looking for highly motivated individuals that are willing to develop creative solutions. At DMAI, youll work alongside a growing team of experienced researchers and accomplished entrepreneurs in Computer Vision, NLP, and unified AI.\n<br><br>\n<strong>Where We Are</strong>:\n<br><br>\nDMAIs office is located in the heart of the Westwood Village area of Los Angeles. We are less than a mile away from UCLA and a short ride to Beverly Hills, Santa Monica, and the Los Angeles Airport. Westwood Village provides all the best that LA has to offer with a more relaxed neighborhood feel.\n<br><br>\n<strong>Who You Are</strong>:\n<br><br>\nYou are a team player who fill thrive in a fast-paced startup environment. Youre able to execute tasks efficiently, communicate effectively, and own your work. Youre passionate about the potential for AI in education and want to lead the charge in building it.\n<br><br>\n<strong>You Should Know</strong>:\n<br><br>\nDMAI provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, DMAI complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.\n<br><br>\nDMAI expressly prohibits any form of workplace harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status. Improper interference with the ability of DMAIs employees to perform their job duties may result in discipline up to and including discharge.</div>\n</div>\n</div>\n</div>\n\n<br>"}