{"job title": "Senior Data Review Scientist", "company": "Eurofins Scientific", "city state": "– PA, Lancaster", "rating": "2.8", "job description": "<div><div>Senior Data Review Scientist<br>\n\n<div>\n<div>\nOrganization\n<br><br>\n<strong>\n<br>\nEurofins Lancaster Laboratories Inc.</strong>\n</div><br>\n\n<div>\nLocation\n<br><br>\n<strong>\n<br>\nPA, Lancaster</strong>\n</div><br>\n\n<div>\nJob Code\n<br><br>\n<strong>11888</strong>\n</div>\n</div>\n</div>\n\n<br>Apply Now</div><br>\n\n<div><div><strong>Senior Data Review Scientist</strong>\n<br><br>\n<strong>Employee Responsibilities:</strong>\n\n<ul>\n<li>Perform analysis of proteins and the impurities or raw materials associated with their production using various analytical techniques</li>\n\n<li>Document work as required for GMP compliance</li>\n\n<li>Perform tests accurately</li>\n\n<li>Troubleshoot method and instrumentation problems</li>\n\n<li>Use office and instrumentation specific computer software</li>\n\n<li>Produce written reports (e.g., SOP, OMC, client reports)</li>\n\n<li>Initiate and perform investigations</li>\n\n<li>Serve as administrator of analytical instrumentation systems</li>\n\n<li>Develop and execute validation plans</li>\n\n<li>Carry out method transfers and feasibility studies</li>\n\n<li>Train technical staff</li>\n\n<li>Give presentations for training and client reviews</li>\n</ul>\n<strong>The Ideal Candidate would possess:</strong>\n\n<ul>\n<li>Strong computer, scientific, and organizational skills</li>\n\n<li>Excellent communication (oral and written) and attention to detail</li>\n\n<li>Ability to work independently and as part of a team, self-motivation, adaptability, and a positive attitude</li>\n\n<li>Ability to learn new techniques, perform multiple tasks simultaneously, keep accurate records, follow instructions, and comply with company policies</li>\n\n<li>Three years chromatography experience</li>\n\n<li>Five years in a GMP lab environment</li>\n</ul>\n<strong>Minimum Qualifications:</strong>\n\n<ul>\n<li>Bachelor's or Master’s degree in chemistry, biology, biochemistry, or other related degree concentration, or equivalent directly-related experience (two years of directly related industry experience is equivalent to one full-time year of college in related major)</li>\n\n<li>Authorization to work in the United States indefinitely without restriction or sponsorship</li>\n</ul>\n<strong>What we offer:</strong>\n\n<ul>\n<li>Excellent full-time benefits including comprehensive medical coverage, vision, and dental options</li>\n\n<li>Life and Disability Insurance</li>\n\n<li>401(k) with company match</li>\n\n<li>Paid vacation and holidays</li>\n</ul>\nAs a part of Eurofins BioPharma Product Testing – the largest network of harmonized bio/pharmaceutical GMP product testing laboratories worldwide – Eurofins Lancaster Laboratories provides comprehensive laboratory services for the world’s largest pharmaceutical, biopharmaceutical and medical device companies. Our service offering includes comprehensive chemistry, biochemistry, microbiology, molecular and cell biology and biosafety testing of drug substances, final products, intermediates, and starting materials for both small and large molecule drug products.<br><br><strong> Eurofins is a M/F, Disabled, and Veteran Equal Employment Opportunity and Affirmative Action employer.</strong></div><br>\n\n<div>\n<div>\n<div><strong>In 1987, Eurofins Scientific was founded in Nantes, France, with four employees to market the SNIF‑NMR technology. During the past 30 years, Eurofins has grown to be a world leader in laboratory testing services with a network of 375 laboratories across 41 countries in Europe, North and South America and Asia-Pacific and over 30,000 staff.</strong>\n<br><br>\n<strong>Eurofins is the world leader in the food, bio/pharmaceutical product testing. It is also number one in the field of environmental laboratory services and one of the global market leaders in agroscience, genomics, discovery pharmacology, and central laboratory services.</strong></div>\n</div>\n</div>\n</div>"}