{"job title": "Research Scientist - Machine Learning", "company": "Job Juncture", "city state": "– Franklin, NE", "rating": "5.0", "job description": "My client applies research in machine learning and data analytics to multiple areas including cyber security, IP networking, Wireless and sensor networks, Power and Smart Grid to name just a few, for government and commercial customers. Their customers include DARPA, the U.S. Army Research Labs, the U.S. Air Force Research Labs, the U.S. Army CERDEC, and others.\n<br><br>\nThey are looking for a dynamic individual skilled in the areas of machine learning and data analytics and interested in working in small to mid-size multi-disciplinary teams. Responsibilities will include performing applied research, formulating and defining new projects and proposing new areas of work, including participating in writing proposals for new funding.\n<br><br>\nMy client is involved with the latest technologies in an R&amp;D capacity primarily with government agencies. In addition to the experience you will gain in technology you will also be given a clearance which should add even more value to you. This company of over 10,000 employees, works with U.S. government customers in defense, intelligence, civilian, health care, and state and local markets.\n<br><br>\n<strong>Requirements:</strong>\n<br><br>\nRequires 5 to 8 years with BS/BA or 3 to 5 years with MS/MA or 0 to 2 years with PhD.\n<br><br>\nU.S. Citizenship (This is an absolute requirement, no exceptions. This is required due to requirements imposed by contracts with the Federal government.)\n<br>\nM.S. or Ph.D. degree in a field related to machine learning (Computer Science, Statistics, Mathematics, Electrical Engineering or related field).\n<br>\n5 years of work experience in a relevant field.\n<br>\nHands-on skills in implementation of machine learning techniques and development of software systems that incorporate machine learning.\n<br>\nAbility to apply machine learning to real-world problems, such as cyber security, IP networking, sensor networks, power grid, image, video and social network analysis, or other relevant areas.\n<br>\nEffective communication and writing skills."}