{"job title": "Data Analyst", "company": "Lockheed Martin", "city state": "– Shelton, Connecticut", "rating": "3.6", "job description": "<strong>Description:</strong> RMS's Analytics, PHM and Artificial Intelligence (APA) Innovations team applies technology, processes and expertise to a wide variety of platform data in order to drive proactive decision-making throughout the business. APAs rapidly evolving Analytics Development team functions like a small startup within RMS, rapidly developing solutions in pursuit of these objectives, and working with a wide variety of internal customer and expert groups.\n<br><br>\nData generated from the execution of business processes and operations, such as program finance data, and elements that impact program cost and schedule, such as cost, quality and delivery data from external suppliers, operations, and engineering business processes is collected, conditioned and analyzed to identify opportunities for improvements to program schedule and cost efficiency.\n<br><br>\nThe role requires coordination and execution with multiple platform teams, Engineering, Programs, Operations and external entities is essential for identification, solicitation and development of analytic solutions. The applicant is responsible for development and implementation of analytic methodologies that enable our transformation to a digital operating system.\n<br><br>\nThe applicant is expected to collaborate with work extensively with Sikorsky and RMS internal business partners to :\n\n\n<ul>\n<li>Mine, process, and summarize data</li>\n<li>Manage the quality assurance of data scraping, query databases for stakeholder requests, and triage data issues for timely resolutions</li>\n<li>Analyze large datasets, draw valid inferences and prepare insights in narrative or visual forms, including dashboards</li>\n<li>Set up and maintain data processes and new analytics capabilities</li>\n<li>Produce and track key performance indicators</li>\n</ul>\n\n<strong>Desired Skills:</strong> • Spreadsheet tools, e.g., MS Excel\n\n\n<ul>\n<li>Database systems (SQL and NO SQL based)</li>\n<li>Communication and visualization</li>\n<li>Descriptive statistics and exploratory data analysis</li>\n<li>Languages: R, Python, HTML, Javascript, SQL, C/C++</li>\n<li>Knowledge of business planning / financial management, applied analytics, and manufacturing operations, preferably in an Aerospace application.</li>\n<li>Strong continuous improvement background, such as Lean Six Sigma training preferred</li>\n<li>Demonstrated ability to learn new programs and approach new problems in an efficient methodical manner</li>\n</ul>\n\n<strong>BASIC QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>Knowledge of programming (one or more common languages e.g., Python and R), statistics (descriptive and inferential), data munging, and data visualization (Tableau or equivalent)</li>\n<li>Experienced in data structures and hierarchies</li>\n<li>Strong analytical skills and understanding of system databases, data elements and application software solutions to optimize data gathering and analysis</li>\n<li>Familiarity with data modeling, relational databases and SQL</li>\n<li>Excellent written and verbal communication skills (i.e. the ability to communicate complex analysis with clarity and precision)</li>\n<li>Good problem solving and organizational skills</li>\n<li>The candidate should possess excellent communication skills, oral and written. Strong organizational skills and the ability to operate independently are required.</li>\n<li>US Person</li>\n</ul>\n\n<strong>Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.</strong>\n<br>\nAs a leading technology innovation company, Lockheed Martins vast team works with partners around the world to bring proven performance to our customers toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.\n<br><br>\nJoin us at Lockheed Martin, where were engineering a better tomorrow."}