{"job title": "Senior Strategic Analyst / Data Scientist", "company": "Memorial Sloan Kettering", "city state": "– New York, NY", "rating": "4.0", "job description": "At Memorial Sloan Kettering (MSK), we’re not only changing the way we treat cancer, but also the way the world thinks about it. By working together and pushing forward with innovation and discovery, we’re driving excellence and improving outcomes.\n<br><br>\nFor the 28th year, MSK has been named a top hospital for cancer by U.S. News &amp; World Report. We are proud to be on Becker’s Healthcare list as one of the 150 Great Places to Work in Healthcare in 2018, as well as one of Glassdoor’s Employees’ Choice Best Place to Work for 2018. We’re treating cancer, one patient at a time. <em><strong>Join us and make a difference every day.<em><strong><em><strong><em><strong><strong><br>\n</strong></strong></em></strong></em></strong></em></strong></em>\n<br><br>\n<strong>**Please submit a cover letter with your application**</strong>\n<br><br>\nAre you passionate about using data to shape strategic business decisions? Do you want to utilize your analytical skills to support MSK's mission? Do you want to be part of a team that was awarded the INFORMS Prize for “repeatedly applying the principles of advanced analytics and operations research / management science in groundbreaking, varied, novel, and lasting ways”? We care deeply about solving meaningful problems that will measurably impact the lives of MSK’s patients and staff. We are seeking a<strong> Data Scientist / Senior Strategic Analyst</strong> who will serve as a champion for data-driven decision-making within Marketing &amp; Communications, particularly for programs to strengthen MSK’s relationships with physicians and partners in the tri-state area, across the US, and internationally.\n<br><br>\n<strong>Embedded Analytics Program</strong>\n<br><br>\nThis position is part of our Embedded Analytics Program, wherein Strategy &amp; Innovation analysts are embedded in operational departments and immersed in their challenges. Embedded Analytics allows for the best of both worlds: being a full member of an operational team to truly understand their needs and ensure sustainable implementation of work, while still being part of a diverse and energizing community of analytics experts. We support technical and business skill development in a variety of ways, including conferences and external workshops, internal training and journal clubs, creating analytical tools and best practices, and developing our own in-house R package.\n<br><br>\n<strong>Department of Communications &amp; Marketing</strong>\n<br>\nAs a leader in cancer treatment and research for more than 130 years, MSK sets an equally high standard for the effectiveness of our communications and marketing efforts. Our focus is on generating demand for MSK services and active consideration of MSK as the best place for cancer treatment, research, and education. The team encompasses public relations, social media, web content, digital tools, consumer marketing and advertising, business-to-business communications, and research insights.\n<br><br>\n<strong>You will:</strong>\n<ul>\n<li>Serve as an analytical thought partner to Communications leadership, especially the Senior VP, Director of Business/Physician Relations, Director of CRM, and Director of Digital Communications</li><li>Become deeply versed in the operational needs of Communications and own the strategic roadmap for iteratively developing analytical products in support of those needs</li><li>Independently manage individual analytical products and projects from \"question to answer\" including problem framing, data collection and validation, exploratory analysis, statistical modeling, visualization, and synthesis</li><li>Effectively communicate actionable insights and see them through to implementation</li>\n</ul>\n<strong>Sample projects include:</strong>\n<ul>\n<li>Developing a global data model of the network of international physicians from disparate and often conflicting sources</li><li>Analyzing the relative impact of business-to-business programs (e.g. continuing medical education, newsletters, observership programs) on referrals and patient volumes</li><li>Leveraging patient behavioral and outcomes data to continually improve our digital engagement platform for prospective patients</li><li>Collaborating with the customer relationship management (CRM) team to set up our analytical environment within Salesforce and develop segmentation and targeting strategies</li>\n</ul>\n<strong>Qualifications:</strong>\n<br><br>\nWe are looking for an analytics professional who has both deep technical skills and a passion for applying them to real-world problems in partnership with non-technical partners. Our successful analysts typically have the below qualifications:\n<ul>\n<li>A proven track record (4+ years of experience) of using analytics and data science to impact key business decisions.</li><li>You've built reproducible analyses using R, Python, or a similar language</li><li>You're deeply comfortable with relational databases and SQL\n<br>\nYou know how to choose the right technical approach for a question (from a statistical model to a dashboard and everything in between) and know that the simplest solution is often the best</li><li>You're a storyteller, able to synthesize knowledge from a variety of sources and clearly communicate complex topics to non-technical audiences</li><li>You're curious and self-motivated, and you thrive when working autonomously. You know when to run with something and when to ask for help.</li><li>You have a solid understanding of common statistical methods (especially regression and probability)</li><li>You have a bachelor’s degree in a quantitative field (statistics, economics, operations research, mathematics, etc.) or equivalent training, fellowship, or work experience</li>\n</ul>\n#LI-POST\n<br><br>\nMSK is an equal opportunity and affirmative action employer committed to diversity and inclusion in all aspects of recruiting and employment. All qualified individuals are encouraged to apply and will receive consideration without regard to race, color, gender, gender identity or expression, sexual orientation, national origin, age, religion, creed, disability, veteran status or any other factor which cannot lawfully be used as a basis for an employment decision.\n<br><br>\nFederal law requires employers to provide reasonable accommodation to qualified individuals with disabilities. Please tell us if you require a reasonable accommodation to apply for a job or to perform your job. Examples of reasonable accommodation include making a change to the application process or work procedures, providing documents in an alternate format, using a sign language interpreter, or using specialized equipment.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}