{"job title": "Scientist", "company": "Organovo", "city state": "– San Diego, CA", "rating": "3.2", "job description": "<strong>Organovo</strong>\n<br><br>\nAll qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.\n<br><br>\n<strong>JOB DESCRIPTION</strong>\n<br><br>\n<strong> Scientist Responsibilities:</strong> \n\n<ul>\n<li>Performs duties related to cell and tissue culture, bioprinting, compound dosing and analysis per established protocols</li><li>Will be responsible for new assay development and establishing standard operating procedures (SOPs)</li><li>Utilizes a range of assay technologies tocharacterize bioprinted tissue constructs, including ELISA, qPCR, viability and histology</li><li>Independently identifies and implements new assay technologies that have an impact on assay throughput and/or performance</li><li>Independently designs, executes, and performs basic analysis of experiments, including independent troubleshooting.</li><li>May manage individual projects, including contributing to establishing timelines and deliverables</li><li>Primary cell culture and maintenance of bioprinted tissues</li><li>Participates in fabrication of bioprinted tissues, including independent fabrication where applicable</li><li>Prepares detailed SOPs that enable transfer of validated assays to project teams and customers</li><li>Reporting of results to supervisor and internally at group meetings</li><li>May present findings at external forums (conferences)</li><li>May be required to supervise junior associates</li><li>Other duties as assigned</li>\n</ul>\n\n<strong> ScientistSkills andExperience:</strong> \n\n<ul>\n<li>Ph.D.in Biology, Physiology, Molecular and Cellular Biology or closely related field</li><li>Minimum3 years work experience in an industry setting</li><li>Extensive experience in most of the following: mammalian tissue culture, ELISA, qPCR, flow cytometry</li><li>Experience evaluating and implementing new techniques</li><li>Experience with 3D tissue culture, histology, and/or liver models is a plus</li><li>Ability to work collaboratively with multi-disciplinary groups in a fast-paced work environment</li><li>Able to work independently on experimental design, execution, and analysis</li><li>Excellent verbal and written communication skills and track record of ability to effectively present scientific data</li><li>Detail and task oriented</li><li>Positive attitude</li><li>Keeps calm under pressure</li><li><strong>Some weekend work will be required</strong></li>\n</ul>\n\n<strong>\n<br>\n<em>DISCLAIMER:</em></strong><em>The above statements are intended to describe the general nature and level of work being performed by incumbents assigned to this job. This is not intended to be an exhaustive list of all the functions, responsibilities, duties and skills required for the position, and Organovo retains the discretion to modify functions, responsibilities, duties and skills at any time, including modifying the time devoted to such activities, deleting activities, and assigning other activities.</em>\n<br><br>\n<em>Organovo is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.</em>\n<br>\n<em>If you are an individual with a disability and require a reasonable accommodation to complete any part of the application process, or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you may contact us at 858-224-1000 for assistance. #CB</em>\n<br><br>\n<strong>JOB SNAPSHOT</strong>\n<br>\n<strong>Employee Type:</strong> Full-Time\n<br>\n<strong>Location:</strong> San Diego, CA\n<br>\n<strong>Job Type:</strong> Science\n<br>\n<strong>Experience:</strong> Not Specified\n<br>\n<strong>Date Posted:</strong> 8/18/2018<br><br>PI104326780"}