{"job title": "Scientist", "company": "Randstad Life Sciences", "city state": "– North Chicago, IL", "rating": "NA", "job description": "Job Title: Associate Scientist I\n<br><br>\nPosition Description\n\n\n<ul>\n<li>The Drug Metabolism, Pharmacokinetics &amp; Translational Modeling Department at Company is seeking a scientist to conduct routine, low, medium and high volume in vitro drug metabolism screening assays leveraging the use of laboratory automation. Lower throughput assays will also be executed. The scientist will partner with senior staff to understand the rationale behind the protocols, running the assays, and data analysis. Assays may include microsomal stability, protein binding, permeability, CYP inhibition, and CYP induction assays. Candidate should be able to generate precise, reliable and reproducible data in a timely manner and should demonstrate strong data interpretation skills and be able to note significant deviations and troubleshoot appropriately.</li>\n</ul>\n\nPosition Responsibilities\n\n\n<ul>\n<li>Independently perform routine drug metabolism assays and generate high quality data, noting significant deviations to be elevated to senior staff.</li>\n<li>Operate laboratory liquid handling automation platforms and effectively troubleshoot when issues arise.</li>\n<li>Collaborate with department team members including Bioanalytical counterparts to ensure seamless and timely execution of in vitro drug metabolism studies.</li>\n<li>Learn drug metabolism assays including but not limited to microsomal and hepatocyte stability, CYP Inhibition, PAMPA, and protein binding.</li>\n<li>Interact with scientists at all levels and effectively communicate results.</li>\n</ul>\n\nPosition Requirements\n\n\n<ul>\n<li>B.S or M.S in Biology, Chemistry, Biomedical Engineering, Chemical Engineering or related field and 1+ years of experience in the pharmaceutical industry.</li>\n<li>Experience with liquid handling systems such as Hamilton, Beckman and/or Tecan is highly desired.</li>\n<li>Highly motivated individual with attention to detail and a proven ability to work cross functionally.</li>\n<li>Ability to work well in a collaborative fast-paced team environment.</li>\n<li>Passion for data analysis, solving technical problems and applying new technologies to further scientific goals.</li>\n\n<strong><li>Key Leadership Competencies:</li>\n\n</strong>\n\n<li>Builds strong relationships with peers and cross functionally with partners outside of team to enable higher performance</li>\n<li>Learns fast, grasps the \"essence\" and can change course quickly where indicated</li>\n<li>Raises the bar and is never satisfied with the status quo</li>\n<li>Creates a learning environment, open to suggestions and experimentation for improvement</li>\n<li>Embraces the ideas of others, nurtures innovation and manages innovation to reality</li>\n</ul>\n\n<strong>Benefits</strong>\n\n\n<ul>\n<li>Medical, Dental, and Vision Insurance</li>\n<li>401K Plan with Company Match</li>\n<li>Life and AD&amp;D Insurance</li>\n</ul>\n\nEqual Opportunity Employer: Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.\n<br><br>\n<strong>Company Description:</strong>\n<br><br>\nRandstad is a $22.5 billion global provider of HR services and the second largest staffing organization in the world. From temporary staffing to permanent placement to in-house, professionals, search &amp; selection, and HR Solutions, Randstad holds top positions around the world and has approximately 31,100 corporate employees working from its nearly 4,700 branches and in-house locations in 40 countries.\n<br><br>\nWe are a company built on a deep network of expertise that crosses industries and geographies. We recognize that talent comes in different forms, that every business has its unique challenges and opportunities. And our recruiting experts are skilled at marrying talent and businessidentifying the ideal professionals for an organizations culture and its teams, its needs and its goals."}