{"job title": "Scientist", "company": "SANOFI", "city state": "– Cambridge, MA", "rating": "3.5", "job description": "About Sanofi US At Sanofi US, we are committed to the growth of our people, connected in purpose by career, life and health. Headquartered in Bridgewater, NJ, Sanofi US is part of a leading global healthcare company dedicated to discovering, developing and distributing therapeutic solutions focused on patients needs. Sanofi has core strengths in diabetes solutions, human vaccines, innovative drugs, consumer healthcare, emerging markets, animal health and Genzyme. Sanofi US employs approximately 17,000 people across the country all dedicated to protecting health, enhancing life and responding to the hopes and potential healthcare needs of seven billion people around the world. Commitment is our Strength. Ready to grow together? Scientist, Type 2 Immunity and Fibrosis, Immunology and Inflammation Research The Immunology and Inflammation Research and Early Development Therapeutic Area in Sanofi is building a world-class immunology team and is seeking highly motivated scientists to lead projects evaluating novel therapies in the fields of Type 2 Immunity and Fibrosis, Immune Checkpoint Biology, Type 1 Diabetes, Autoimmunity and Innate Immunity. We are seeking a Scientist to join a newly formed team within the Type 2 Immunity &amp; Fibrosis Cluster of our Immunology &amp; Inflammation Research Therapeutic Area . The candidate will have broad knowledge base and extensive hands-on experimental biology skills in fundamental and applied immunology, and a strong aptitude to apply it to drug discovery. The candidate will work within and across disciplines in Sanofi to identify and validate novel targets, and to drive discovery research programs into early clinical development. Summary of Key Responsibilities: Scientific contribution and leadership towards novel target identification and validation Scientific contribution and leadership in drug discovery project teams, working with scientific platform teams to advance projects from discovery into early clinical development. Design, develop and perform experiments to characterize targets and pathways to select functional antibody or small molecule therapeutic candidates. Hands-on laboratory contribution is essential. Analyse, interpret and document data and communicate results in team, group and leadership settings Help establish interactions with collaborators within and outside the Immunology and Inflammation Research and Early Development Therapeutic Area. Prepare publications, research and clinical/regulatory documentation in accordance with Sanofi quality standards. Provide and promote support for operational excellence according to Sanofi values and ethics. Essential Qualifications: PhD in immunology or a related field with 0+ years, or MS with 5+ years of industry or academic research experience. Preferred Qualifications: 1-3 years of postdoctoral training, industry experience. A broad &amp; deep understanding of the pathophysiology, molecular mechanisms and common therapeutic paradigms in Type 2 immunity (e.g., allergy, atopy). A broad understanding of immunological/mechanistic interdependencies and drug discovery paradigms across inflammatory and autoimmune diseases. Strong hands-on in vitro and in vivo experimental biology skills in immunology (e.g., multicolor flow cytometry, isolation and in vitro functional assay development using human and mouse immune cells), DNA/RNA/protein quantification platforms (e.g., qPCR, MSD, Luminex) and in vivo animal models of inflammatory and/or autoimmune diseases. Excellent organization, communication, presentation and interpersonal skills A creative, problem-solving, collaborative and goal-oriented mindset Track record of scientific publications demonstrating ability to successfully lead projects Knowledge and/or experience with systems biology principles and tools (e.g., generating and/or exploring high dimensional datasets to generate and test biological hypotheses) Fundamental pharmacological principles in drug discovery Sanofi, a global healthcare leader, discovers, develops and distributes therapeutic solutions focused on patients needs. Sanofi has core strengths in diabetes solutions, human vaccines, innovative drugs, consumer healthcare, emerging markets, animal health and Genzyme. Sanofi Inc. and its U.S. affiliates are Equal Opportunity and Affirmative Action employers committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race; color; creed; religion; national origin; age; ancestry; nationality; marital, domestic partnership or civil union status; sex, gender, gender identity or expression; affectional or sexual orientation; disability; veteran or military status or liability for military status; domestic violence victim status; atypical cellular or blood trait; genetic information (including the refusal to submit to genetic testing) or any other characteristic protected by law. #GD-SA #LI-SA At Sanofi diversity and inclusion is foundational to how we operate and embedded in our Core Values. We recognize to truly tap into the richness diversity brings we must lead with inclusion and have a workplace where those differences can thrive and be leveraged to empower the lives of our colleagues, patients and customers. We respect and celebrate the diversity of our people, their backgrounds and experiences and provide equal opportunity for all."}