{"job title": "Scientist II, DMPK (Biotransformation)", "company": "SHS, Incorporated", "city state": "– Philadelphia, PA", "rating": "5.0", "job description": "<ul>\n <li>As a member of Drug Metabolism and Pharmacokinetic (DMPK) group, you will participate in drug discovery and development through the conduct of in vitro and in vivo drug metabolism studies designed to understand biotransformation pathways/routes of elimination of small molecules to guide synthetic efforts and to identify potentially active/reactive metabolites/fragments.</li> <li>Qualified candidates will have experience in the pharmaceutical or biotech industry with hands-on experience with selecting, operating, and maintaining mass spectrometric equipment for the purposes of structure elucidation of metabolites as well as chemical modifications/degradation products in complex biologic matrices.</li>  <li>The candidate should have extensive experience interpreting mass spectral data to make structural assignments.</li>  <li>Hands-on experience with radioactivity (3H, 14C) is essential and experience with NMR and common chemical derivatization techniques to identify site of metabolism, use of isotopically labeled reagents to aid the understanding of enzyme reactions are highly preferred.</li>  <li>In addition, candidate should have fundamental understanding of various DMPK areas such as physicochemical properties, PK, drug metabolizing enzyme, as well as transporter kinetics.</li>  <li>A qualified individual will be expected to collaborate in a team environment with both internal members of the group as well as discovery/early development project teams.</li>  <li>A successful candidate will need excellent interpersonal skills, particularly oral and written communication skills.</li>\n</ul>\n<strong>Requirements</strong>\n<ul>\n<li>Ph.D. in chemistry, biochemistry, medicinal chemistry or a related discipline with 4-5 years of experience in the pharmaceutical industry.</li>\n</ul>\n<strong>Benefits</strong>\n<br><br>\nCompetitive salary and benefits package."}