{"job title": "Data Scientist: TS/SCI", "company": "stanleyreid", "city state": "– Springfield, VA", "rating": "NA", "job description": "Our client is a recognized leader is predictive analytics and data mining - they pride themselves on their ability to find creative, cutting edge solutions to real-word problems. They support the highest priority cases and are on the winning team of a 5 year contract that will deliver data science solutions to address the toughest national security challenges.\n<br><br>\nOur client is seeking Data Scientists and Predictive Modelers / Analysts with various specializations to join their advanced multi-disciplinary team. In this role, you will continually learn new tools and technologies in the data science field while contributing to national defense and working in an amazing new building. In addition to a strong salary and excellent benefits packages, other perks include an employee stock ownership program, work/life/learning balance that includes paid time in the office for technical presentations (with nicely catered lunches), standing/sitting desks, gym membership stipends, and a very strong focus on professional development of staff.\n<br><br>\nTo be considered for this team, you will need the following:\n\n\n<ul>\n<li>US citizenship plus current TS/SCI</li>\n<li>BS and 5+ yrs of relevant experience (MS or PhD preferred and can count toward experience)</li>\n<li>Professional focus on Data Science, Statistics, Machine Learning, NLP, Predictive Modeling, or similar discipline</li>\n<li>Experience with R, MATLAB, SAS, SPSS, Rapid Miner, or similar tools</li>\n</ul>\n\nBackground in any of the following is beneficial:\n\n\n<ul>\n<li>People-centric analytics (human behavior, user activity, risk ranking, psychology, security, CI, etc.)</li>\n<li>Supervised and unsupervised learning techniques (neural networks, regressions, clustering, segmentation, etc.)</li>\n<li>Link analysis and related topics</li>\n<li>Analytic software development in Python, Perl, R, Java, or other languages</li>\n</ul>\n\nThe opportunity is located in Springfield VA in an amazing new building.\n<br><br>\ncjobs-cat:\"IT - Data Science\"\n<br><br>\n<strong>11016</strong>"}