{"job title": "Quantitative Analyst/Portfolio Manager", "company": "T. Rowe Price", "city state": "– Baltimore, MD", "rating": "3.8", "job description": "Our mission as a leading investment management firm is to help our clients achieve their long-term financial goals. We believe our associates are the key to this mission and we are always looking for talented individuals who share our commitment to our client’s success.\n<br>\nIf you’re looking for challenging work experiences and the ability to learn in a collaborative culture, we invite you to explore the opportunities available at T. Rowe Price. <br><br><strong>About the Equity Quantitative Group</strong>\n<br><br>\nServes as an integral part of the firm’s Equity division and is based in Baltimore. The eleven-member team manages six distinct long-only and long-short strategies with current AUM of ~$10 billion (as of June 30, 2018). The team is supported by a dedicated group of IT specialists. The quantitative equity group is expanding and would like to add experienced analysts and portfolio managers.\n<br><br>\n<strong>Principal Responsibilities</strong>\n<br><br>\n<u>Portfolio Manager</u>\n<ul>\n<li>Manage portfolio(s) on a day-to day basis</li><li>Carry out quantitative research and work with other researchers to enhance models and process</li><li>Client related activities of a portfolio manager.</li><li>Work with researchers and portfolio specialist to develop white-papers and other appropriate marketing material<br><br><u>Portfolio Manager and Analyst</u></li>\n</ul>\n\n<ul>\n<li>Perform rigorous quantitative/statistical research in finance to develop new stock selection models and enhance current models.</li><li>Independently identify and analyze topics relevant to stock selection and portfolio management.</li><li>Conduct research and analysis on other investment management topics, such as attribution and portfolio construction.</li><li>Keep abreast of industry and academic research to generate innovative insights.</li><li>Work occasionally with fundamental portfolio managers and analysts to help them use insights from quantitative stock selection models.</li>\n</ul>\n<u><strong>Major responsibilities of the group</strong></u>\n<ul>\n<li>Manage equity portfolios.</li><li>Develop stock selection models and screens for all global regions;</li><li>Publish white papers for the group’s clients</li><li>Work with fundamental portfolio managers based in our global offices who would like to use quant resources to help enhance their investment processes and decisions;</li><li>Solve analytical problems encountered by portfolio managers and analysts;</li><li>Collaborate with separate quantitative investment groups in Fixed Income and Multi-Asset on joint projects; and</li><li>Help the firm’s institutional marketing efforts by leveraging the group’s expertise.</li>\n</ul>\n<strong>Strongly Preferred</strong>\n<ul>\n<li>Experience in managing portfolios, in particular, long-short strategies.</li></ul>\n\n<ul>\n<li>Ph.D., MBA/MS in Finance or Accounting or an MBA with a Quantitative Finance specialization.</li><li>Experience conducting empirical research and working with large financial data sets.</li><li>CFA charter or commitment to obtain one</li>\n</ul>\n<strong>Required</strong>\n<ul>\n<li>Advanced degree in a relevant field with strong credentials, strong academic background, and/or relevant work experience</li><li>Prior experience in the financial services industry in quantitative equity research.</li><li>Exceptional quantitative and finance skills</li><li>Superb skills in communicating with technical and non-technical associates and clients; and desire to work in a highly collaborative group</li><li>A high-level understanding of finance, investing, and economics</li><li>Excellent skills in statistics/econometrics and proficiency in programming languages, such as R or Python, and a demonstrated ability at applying those skills to modeling problems</li>\n</ul>\n\nT. Rowe Price is an Equal Opportunity Employer"}