{"job title": "Software Engineer - New Grad - Understand Data Scientist", "company": "Twilio", "city state": "– San Francisco, CA", "rating": "3.9", "job description": "<strong><em>Because you belong at Twilio</em></strong>\n<br><br>\n<em>The Who, What, Where and Why</em>\n<br><br>\n<strong>Who?</strong>\n<br><br>\nTwilio is looking for a Data Scientist who wants to research, design, experiment and deploy machine learning solutions in the real world and help Twilio deliver the the next-generation communications platform. You are eager to learn and inspire and you like to think at scale and work in real world products and problems, bringing a focus on efficient experimentation, team collaboration and large-scale datasets. You want to develop skills and industry experience while working on machine learning-based products that have an impact on real customers.\n<br><br>\nYou should have some or all of the following:\n\n<ul>\n<li>A Masters or preferably PhD degree in Mathematics, Statistics, Computer Science or another quantitative discipline</li>\n<li>Strong background in machine learning, mathematical statistics and data mining</li> \n\n<li>Familiarity with NLP, conversational systems, knowledge bases and/or search</li>\n<li>1-3+ years of hands-on experience with Python, C/C++ or Java/Scala</li>\n<li>Strong interest in the latest NLP-related algorithms and technologies, such as sequence-to-sequence models, word and sentence embeddings, NLP packages and services etc<strong>.</strong></li>\n</ul>\n<strong>What?</strong>\n<br><br>\nAs a Data Scientist -\n\n<ul>\n<li>Within the first 6 months of work, you will design, prototype, implement and deploy one or more core Twilio machine learning services.</li>\n<li>The process will include understanding of the customer problem, conducting experiments and developing machine learning model, testing and documenting performance and working with engineering to deploy to production at scale.</li>\n<li>Collaborate across the company and interact with our customers (software engineers) to define, design and build new functionality.</li>\n<li>Tackle complex problems in natural language understanding, text representation, dialog modeling as well as measurement of model performance in real world scenarios.</li>\n</ul>\n<strong>Why?</strong>\n<br><br>\nTwilio is a company that is empowering the world's developers with modern communication in order to build better applications.\n<br><br>\nTwilio is truly unique; we are a company committed to your growth, your learning, your development and your entire employee experience. We only win when our employees succeed and we're dedicated to helping you develop your strengths. We invest in weeks dedicated to tackling hard problems and creating your own ideas. We have a cultural foundation built on diversity, inclusion and innovation and we want you and your ideas to thrive at Twilio. Come join us.\n<br><br>\n<strong>Where?</strong>\n<br><br>\nThis position will be located in our beautiful office at 375 Beale Street in San Francisco. You will enjoy our incredible perks: catered meals, snacks, game room, ergonomic desks, massages, Wednesday Night dinners, bi-weekly All Hands and more. What you will also get to experience is a company that believes in small teams for maximum impact; that strives to balance work and home life, that understands that this is a marathon, not a sprint; that continuously and purposefully builds an inclusive culture where everyone is able to do and be the best version of themselves. We seek people who naturally demonstrate our values, who are challenged by problems, empower others to thrive, people who can draw the owl and not be beholden to one playbook.\n<br><br>\n<strong>About us:</strong>\n<br><br>\n<em>More than 2 million developers around the world have used Twilio to unlock the magic of communications to improve any human experience. Twilio has democratized communications channels like voice, text, chat, and video by virtualizing the world's telecommunications infrastructure through APIs that are simple enough for any developer to use, yet robust enough to power the world's most demanding applications. By making communications a part of every software developer's toolkit, Twilio is enabling innovators across every industry from emerging leaders to the world's largest organizations to reinvent how companies engage with their customers. Founded in 2008, Twilio has over 1,000 employees, with headquarters in San Francisco and other offices in Bogotá, Dublin, Hong Kong, London, Madrid, Mountain View, Munich, New York City, Singapore and Tallinn.</em>\n<br><br>\n<em>Twilio is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal opportunity regardless of race, color, ancestry, religion, gender, gender identity, parental or pregnancy status, national origin, sexual orientation, age, citizenship, marital status, disability, or Veteran status and operate in compliance with the San Francisco Fair Chance Ordinance.</em>"}