{"job title": "Applied Scientist, Economic Data - Intern", "company": "Zillow", "city state": "– Seattle", "rating": "4.2", "job description": "About the teamJoin our industry-leading Economic Research team bringing innovative analysis, creativity and excellence to the U.S. housing market. Our mission is to leverage Zillow’s unique proprietary data on American housing – often in combination with other public or private data – to answer Americans’ questions about the housing market and, often, the American economy more broadly. You’ll work in an informal, fun, collaborative atmosphere with a sharp and dynamic team that loves all things data and all things economics, but also has a diverse range of interests and skillsAbout the role<br><br>Zillow Group’s Economic Research team is looking for applied data science interns for the summer of 2019. Do you love answering questions using data? Do you have a knack for thinking through market dynamics? Have you waited your whole life to see “economic storytelling”, “statistical analysis”, and “production code” appear together in a single job description? Do you find that you both appreciate the power of machine learning methods and want to understand the “why” behind them?\n<br><br>\nIf so, then we have a job for you. You will directly contribute to the most innovative, authoritative, open, and comprehensive source of housing-related data and products, used not only across Zillow Group but also by academic researchers, government institutions, industry professionals, and real estate consumers around the world. You’ll have the opportunity to dig into Zillow Group’s unparalleled databases of proprietary housing market data to unearth market insights, build predictive models, and automate the production of economic indices used by millions every month.\n<br><br>\nYou will work in an informal, collaborative atmosphere with a team of strong, smart self-starters like yourself. You will collaborate with Zillow Group’s Chief Economist and our team of Applied Scientists, Economists, Analysts, Editors, and Engineers to tell the ever-evolving story of the housing market, from the nation to the neighborhood.\n<br><br>\n<strong>Why Us ?</strong>\n<ul>\n\n<li><strong><strong>Your work will be impactful.</strong> Our data and research routinely features in national publications, powers insights for businesses and institutions, and appears in public-facing tools used by Zillow Group’s millions of consumers.</strong></li>\n<li><strong><strong>Your work will be stimulating.</strong> Our team has a tremendous range of analytical and technical skills that we are excited to share and teach. These span from cloud-based data engineering and machine learning to innovative data visualization, storytelling, and public speaking.</strong></li>\n</ul>\n\nWho you are\n\n<ul>\n\n<li><strong>A current graduate student (or recent grad) in economics, statistics, operations research, or any another quantitative field who plans to pursue full-time positions in 2019/2020</strong></li>\n<li><strong>Experience with data science tools such as SQL, R, or Python, including the ability to process large, complex datasets using tidy data principles. Experience with cloud-based data processing tools (e.g. Hadoop, Hive, Presto, Spark) is a plus.</strong></li>\n<li><strong>Ability to compose well-written, well-documented, automatable code</strong></li>\n<li><strong>Experience designing and executing multifaceted research projects</strong></li>\n<li><strong>Knowledge of statistical methods, machine learning, and/or econometrics (e.g. tree-based methods, KNN, clustering, autoencoders, ARIMA)</strong></li>\n<li><strong>Strong verbal and written communication skills</strong></li>\n<li><strong>Candidates who are curious, detailed-oriented, analytical, and self-motivated</strong></li>\n\n</ul>\n\nGet to know usZillow Group houses a portfolio of the largest and most vibrant real estate and home-related brands on the web and mobile. Our mission is to build the largest, most trusted and vibrant home-related marketplace in the world.<br><br>Zillow Group is owned, fueled and grown by innovators who help people make better, smarter decisions around all things home. We encourage one another at every level, and our efforts are supported by employee-driven, world-class benefits that enable us to enjoy our lives outside the office while building fulfilling careers that impact millions of individuals every day.\n<br><br>\nZillow Group is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. Therefore, we provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, or any other protected status in accordance with applicable law. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know."}