{"job title": "Scientist - Immunology", "company": "Alpha Consulting", "city state": "– CA - Irvine", "rating": "4.0", "job description": "<div><strong>SCIENTIST - IMMUNOLOGY</strong>\n<br>\n<strong>IRVINE, CA</strong></div>\n\n<br><strong>Project Description:</strong>\n\n\n<ul>\n\n\t<li>Executes the development and qualification of analytical methods for the biologics drug product development with an emphasis on SMCxPRO (Singulex Erenna) immunoassay.</li> \n\n<li>Creates written procedures and protocols.</li> \n\n<li>Responsible for creating detailed project plans including scientific strategy. Actively involved in the planning, execution and management of experimental studies.</li> \n\n<li>Organizes, schedules and participates in project team meetings to define and schedule project activities and review completed tasks.</li> \n\n<li>Communicates project status to supervisor, and/or project team leader,</li> \n\n<li>Writes, reviews and issues technical reports, technical memoranda and other documents for internal and external distribution.</li> \n</ul>\n\n<strong>Required Skills:</strong>\n\n\n<ul>\n\n\t<li>Ph.D. and 2+ years of industry experience or Master's degree and 4+ years of industry experience. Degree in a related scientific or engineering discipline (cell biology, molecular biology, immunology or similar).</li>\n\n<li>Experience in a developing immunoassay with a proven record of success in conducting R&amp;D projects.</li> \n\n<li>Must have a thorough working knowledge of a wide range of analytical methods (i.e. Singulex Erenna, SMCxPRO, Luminex, ELISA, MSD).</li> \n\n<li>Ability to independently develop new and innovative analytical methods, improving existing ones, and troubleshoot product quality problems.</li> \n\n<li>Previous experience with biologics and/ or hydrogels is a plus.</li> \n\n<li>Strong ability to evaluate and interpret analytical results and lead investigations to resolve analytical issues is required.</li> \n\n<li>Proficient in writing technical reports, protocols, and procedures.</li> \n\n<li>Strong verbal and written communication skills, strong scientific leadership skills, ability to work effectively in independent and team settings, and acute attention to detail are essential skills for this position.</li> \n\n<li>Working knowledge in analytical development.</li> \n\n<li>Must be knowledgeable using statistical programs for analytical data evaluation.</li> \n\n<li>Ability to critically review and evaluate analytical data and make conclusions/recommendations based on data.</li> \n\n<li>Must possess good interpersonal skills, the ability to work in a dynamic team environment and must multi-task to meet project timelines.</li> \n</ul>\n\nThis 7+ month position starts ASAP.\n<br><br>\n<strong>ALPHA'S REQUIREMENT #18-01138</strong>\n<br>\n<strong>MUST BE ELIGIBLE TO WORK IN THE U.S. AS AN HOURLY W2 EMPLOYEE</strong>"}