{"job title": "Scientist/Sr. Scientist/Director Translational Biomarkers", "company": "Apexigen", "city state": "– San Carlos, CA", "rating": "NA", "job description": "Scientist/Sr. Scientist/Director Translational Biomarkers<br><br>Apexigen, Inc. San Carlos, CA<br><br>Job Summary<br><br>Apexigen is currently seeking a talented and innovative Translational Biomarker\n<br>\n Scientist to join our Clinical Research department located in San Carlos, California.\n<br>\n The ideal candidate is an experienced Translational Scientist capable of leading a\n<br>\n biomarker discovery team responsible for execution of biomarker strategies for clinical\n<br>\n programs. As a Clinical Translational Biomarker Scientist for early discovery and\n<br>\n clinical stage projects, you will work closely with clinical study directors and research\n<br>\n associates, discovery project team leaders, and other functional groups to discovery\n<br>\n and implement clinical biomarkers into clinical trials and preclinical development\n<br>\n activities. Expectations include independent design and implementation of preclinical\n<br>\n and clinical biomarker strategy for Apexigen’s targeted antibody pipeline. The\n<br>\n ideal candidate will have a broad knowledge of biomarker discovery and implementation\n<br>\n including but not limited to hands-on experience with assay development, data collection\n<br>\n and analysis methodologies, and a strong understanding of target engagement, pharmacodynamic\n<br>\n outcomes, and patient selection endpoints for immuno-oncology antibody therapeutics.\n<br><br>\nThe position offers an exciting opportunity to play an integral role in the clinical\n<br>\n development of antibody therapeutics for oncology.<br><br>Essential Functions<br><br>He/she will be leading the clinical translational biomarker effort at Apexigen\n<br>\n and as such will be independently strategizing and performing a range of activities\n<br>\n in support of the clinical and preclinical development of monoclonal antibodies and\n<br>\n related therapeutic molecules. The primary responsibilities include obtaining in-depth\n<br>\n scientific knowledge of therapeutic targets of interest, determining critical path,\n<br>\n gathering data to support indication or patient population and dose strategy for early\n<br>\n clinical development. Using this information, he/she will be expected to design and\n<br>\n implement a clinical biomarker discovery and development strategy. He/she will need\n<br>\n to work closely with the clinical research team, external partners, contract service\n<br>\n providers, and internal target discovery project teams to design biomarker strategies.\n<br>\n He/she will need to be highly independent and experienced since the experimental work\n<br>\n will be conducted both internally and with the help of external collaborators and\n<br>\n contract laboratories in a highly matrixed environment. Time management skills and\n<br>\n a self-motivated attitude will be essential to succeed in this role.<br><br>Other Responsibilities<br><br>Candidate will be responsible for\n\n<ul>\n\n <li>Infusing a translational research point of view into Apexigen’s preclinical\n<br>\n and clinical strategies</li>\n<li>Developing a biomarker plan that supports clinical objectives</li>\n<li>Generating high quality data and interpreting and effectively communicating that\n<br>\n data in a timely manner to discovery and development teams to facilitate swift action</li>\n<li>Effectively engaging team members in a professional and thoughtful manner</li>\n<li>Understanding internal and external resources, partnering with functional groups\n<br>\n to coordinate the efficient execution of biomarker strategies including obtaining\n<br>\n proper support to deliver on team goals</li>\n<li>Effectively and independently seeking information from advisory bodies, contract\n<br>\n organizations, scientific experts and industry and academic thought-leaders to define,\n<br>\n revise and progress translational/biomarker plans</li>\n<li>Consistently ensuring alignment of biomarker strategies with clinical operational\n<br>\n plans</li>\n<li>Accurately determining functional area capabilities (internal and external) to\n<br>\n identify gaps and execute the most productive path to achieve mission critical goals</li>\n<li>Cultivating and maintaining close relationships with CROs and clinical trial\n<br>\n partners when outsourcing biomarker analysis of clinical trial samples</li>\n<li>Working closely with trial operational staff to organize and train on study logistics,\n<br>\n sample repository design and implementation, data analysis and data transfer as well\n<br>\n as work with analytics teams.</li>\n<li>Authoring biomarker sections of clinical trial related documents including IB,\n<br>\n IND, CSR, as well as regulatory submissions.</li>\n<li>Communicating risks and milestones effectively to the larger team</li>\n<li>Managing information flow across team members and senior management</li>\n<li>Ensuring timely decisions are made at the appropriate levels to drive biomarker\n<br>\n deliverables</li>\n<li>Continually analyzing progress, engaging in critical thinking and assertive problem-solving\n<br>\n and, when appropriate, making swift decisions in order to deliver key data and interpretations\n<br>\n essential for success</li>\n</ul>\n\n<br>\nJob Qualifications\n<br>\n<ul>\n\n <li>MD, PhD, or equivalent advanced degree in biology, molecular biology, pharmacology\n<br>\n or related field</li>\n<li>Experienced scientist with strong background in translational medicine, ideally\n<br>\n with 10+ years of experience in the drug development (minimum of 5 years focused on\n<br>\n clinical biomarkers)</li>\n<li>Understanding of PK/PD and efficacy relationships, drug mechanism of action,\n<br>\n and systems pharmacology for antibody therapeutics</li>\n<li>Strong preference for candidate with experience in immunology and oncology</li>\n<li>Significant understanding of key functional areas of drug development, including\n<br>\n but not limited to: basic biology, pharmacology, toxicology, preclinical and clinical\n<br>\n development, diagnostics, etc..</li>\n<li>Demonstrated ability to work and lead in a cross-functional project team environment</li>\n<li>Ability to multitask and make robust decisions</li>\n<li>Excellent written and verbal communication skills.</li>\n<li>Ability to identify / implement cutting edge methodologies to develop innovative\n<br>\n biomarker approaches.</li>\n<li>Proven ability to identify issues, investigate solutions and make rational decisions\n<br>\n about a path forward independently and in a team environment.</li>\n<li>Able to participate effectively in highly collaborative environment to achieve\n<br>\n company goals</li>\n<li>Strong track record of professional success demonstrated through collaborative\n<br>\n efforts, research presentations or publications and/or intellectual property generation</li>\n<li>Must have a positive and supportive attitude toward growth and change, mature\n<br>\n soft skills and an appreciation of the small company environment.</li>\n</ul>\n<strong>Job Type</strong>: Full-time<br><br>To Apply<br><br>Email resumes to career@apexigen.com.\n<br>\n Please reference Job ID (Ref #RB03)\n<br><br>\n<em>Apexigen is an equal opportunity employer</em>"}