{"job title": "Bioengineering Scientist, Prin", "company": "Boston Scientific", "city state": "– San Jose, CA", "rating": "4.0", "job description": "<strong>Additional Locations:</strong>\n<br><br>\n&nbsp;\n<br><br>\n&nbsp;\n<br><br>\nPurpose and Passion • Comprehensive Benefits • Life-Work Integration • Community • Career Growth\n<br><br>\nAt Boston Scientific, you will find a collaborative culture driven by a passion for innovation that keeps us connected on the most essential level. With determination, imagination and a deep caring for human life, we’re solving some of the most important healthcare industry challenges. Together, we’re one global team committed to making a difference in people’s lives around the world. This is a place where you can find a career with meaningful purpose—improving lives through your life’s work.\n<br><br>\n&nbsp;\n<br><br>\n<strong>About the role:</strong>\n<br><br>\nBoston Scientific is seeking a highly motivated scientist or engineer with experience in energy-tissue interaction to join a growing team developing first in class and best in class technologies across multiple procedures in Urologic surgery. The candidate must have a desire to utilize their skills in the lab to solve technical problems in a hands-on manner. The successful candidate for this position will provide expertise on energy-tissue interaction to augment technology and product development on multiple efforts with an initial focus on kidney stone and benign prostatic disease.&nbsp;\n<br><br>\n&nbsp;\n<br><br>\n<strong>Your responsibilities include:</strong>\n<ul>\n<li>Performs research and development functions utilized in the development of new or improved products.*</li><li>Proposes new product concepts and ideas; prepares design concepts and assists in building the initial prototype products.*</li><li>Develops product testing programs to be performed by in-house and outside testing laboratories.</li><li>Performs lab testing, conducts statistical analysis and summarizes data.*</li><li>Serve as technical consultant to development, manufacturing, marketing and regulatory group on specific technologies*.</li><li>Completes all engineering documentation related to assigned projects.</li><li>Communicates pertinent information to managers.</li><li>Independently solves complex engineering and associate engineering problems.*</li><li>Interfaces with outside vendors and consultants and participates in customer interaction s at company site, during visits or professional meetings.</li><li>Initiates active participation on project teams.</li><li>Understands and enforces ISO/GMP/GLP requirements.</li><li>Analyzes competitive products.</li><li>Analyze research results and maintain records*</li><li>May lead project teams in the development, verification, validation and submission of new products.*</li><li>Interfaces with key physicians on user expectations and product features; relays <em>in vitro</em> data and participates during <em>in vitro</em> animal studies.*</li><li>Provides support to Sales and Marketing as technical advisor.</li><li>Keeps abreast of industry trends, competitive activity and new technologies via industry trade shows and training seminars.</li><li>Contribute to an intellectual property portfolio.</li><li>Present and publish reports and proposals.</li><li>Domestic and international travel (5-10%)</li>\n</ul>\n*Essential Functions\n<br><br>\n&nbsp;\n<br><br>\n<strong>What we’re looking for:</strong>\n<br><br>\nBasic Qualifications\n<ul>\n<li>PhD in biomedical engineering, material sciences, biophysics, physics, biochemistry</li><li>Minimum 5 years’ experience in medical device industry ( Relevant experience during PhD study will be considered)</li><li>Previous research experience with biologic effect of ablation therapies</li><li>Experience in conducting animal studies</li><li>Deep understanding of the generation and delivery of directed energy into biological systems and the responses of biologic tissues and systems.&nbsp;</li><li>Extensive experience with analytical methods of biologic tissue analysis (biological/chemical/biochemical).</li>\n<li>Demonstrated experience with the conception and/or development of translational solutions aimed at applying novel or improved therapies in clinical practice (e.g., applied research and/or product development).</li>\n\n</ul>\n&nbsp;\n<br><br>\nPreferred Qualifications\n<ul>\n<li>Knowledge of urology and gynecology is a plus</li><li>Excellent verbal and written communication skills</li><li>Ability to work in a multidisciplinary team environment</li><li>Proven analytical and problem solving abilities</li><li>Good working knowledge of the activities required in the product development cycle.</li><li>Self-initiator in relation to project and/or project teams</li>\n</ul>\n&nbsp;\n<br><br>\n&nbsp;\n<br><br>\n&nbsp;\n<br><br>\nAbout us\n<br><br>\nAs a global medical technology leader for more than 35 years, our mission at Boston Scientific (NYSE: BSX) is to transform lives through innovative medical solutions that improve the health of patients. If you’re looking to truly make a difference to people both around the world and around the corner, there’s no better place to make it happen.\n<br><br>\n&nbsp;\n<br><br>\nBoston Scientific is an Equal Opportunity Employer – Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Disability, Veteran\n<br><br>\n&nbsp;\n<br><br>\n<strong>Requisition ID:&nbsp;</strong>428097\n<br><br>\n&nbsp;"}