{"job title": "Health Scientist", "company": "Centers for Disease Control and Prevention", "city state": "– Atlanta, Georgia", "rating": "3.8", "job description": "<strong>Department:</strong> ONDIEH, National Center for Injury Prevention and Control\n<br>\n<strong>Agency:</strong> Centers for Disease Control and Prevention\n<br>\n<strong>Job Announcement Number:</strong> HHS-CDC-M2-18-10288587\n<br>\n<strong>SALARY RANGE:</strong> $91631.00 to $119121.00/Per Year\n<br>\n<strong>OPEN PERIOD:</strong> 2018-09-04 to 2018-09-13\n<br>\n<strong>SERIES &amp; GRADE:</strong> GS-0601-13/13\n<br><br>\n<strong>AGENCY MARKETING STATEMENT:</strong> \n<br>\nThe Centers for Disease Control and Prevention (CDC) is the agency Americans trust with their lives. As a global leader in public health, CDC is the nation's premier health promotion, prevention, and preparedness agency. Whether we are protecting the American people from public health threats, researching emerging diseases, or mobilizing public health programs with our domestic and international partners, we rely on our employees to make a real difference in the health and well-being of people here and around the world.\n<br><br>\nThis position is located in the Department of Health and Human Services(DHHS), Centers for Disease Control and Prevention(CDC), National Centers for Injury Prevention and Control (NCIPC), Atlanta GA.\n<br><br>\nCDC is an Equal Opportunity Employer.\n<br><br>\n<strong>DUTIES:</strong> \n<br>\n<strong>As an Health Scientist you will:</strong>\n\n<ul>\n<li>Design, oversee, implement, and conduct major scientific surveys/studies or projects to identify and solve public health problems.</li><li>Review and analyze studies and projects assessing major and/or sensitive public health issues in order to make recommendations for processes, procedures and/or policies related to public health programs, practices and research.</li><li>Provides technical advice and assistance to national, state and local health agencies and to various other organizations.</li><li>Consult on Scientific and Technical Issues</li><li>Prepare scientific and other articles and technical reports for publication. Communicate information to various audiences.</li><li>Performs other duties as assigned.</li> \n</ul>\n\n<strong>CLEARANCE REQUIRED:</strong> \n<br>\nQ - Nonsensitive\n<br><br>\n<strong>REQUIREMENTS:</strong> \n\n<ul>\n<li>US Citizenship is required.</li><li>Background Investigation is required.</li><li>E-Verify: If you are selected for this position, the documentation that you present for purposes of completing the Department of Homeland Security (DHS) Form I-9 will be verified through the DHS \"E-Verify\" System. Federal law requires DHS to use the E-Verify System to verify employment eligibility of all new hires, and as a condition of continued employment obligates the new hire to take affirmative steps to resolve any discrepancies identified by the system. The U.S. Department of Health and Human Services is an E-Verify Participant.</li><li>Direct Deposit: All Federal employees are required to have Federal salary payments made by direct deposit to a financial institution of their choosing.</li><li>One-year probationary period may be required.</li><li>Travel, transportation, and moving expenses will be paid:No</li><li>Bargaining Unit Position:No</li><li>Drug Screening Required:No</li><li>Recruitment Incentive may be authorized:No</li><li>Annual Leave for non-federal service may be authorized:No</li><li>Research position:No</li><li>Promotion potential:No</li><li>Supervisory position:No</li><li>Time in grade (TIG) must be met within 30 days of the closing date of the announcement.</li><li>All qualification requirements must be met by the closing date of the announcement.</li>\n</ul>\n\n<strong>QUALIFICATIONS REQUIRED:</strong> \n<br>\n<strong>Basic Qualifications:</strong>\n<br>\nBachelor's or graduate/higher level degree: major study in an academic field related to the medical field, health sciences or allied sciences appropriate to the work of the position. This degree must be from an educational program from an accrediting body recognized by the U.S. Department of Education at the time the degree was obtained.\n<br><br>\n<strong>Minimum Qualifications:</strong>\n<br>\n<u><strong>GS-13</strong></u>: Applicants must have at least one year of specialized experience at or equivalent to the GS-12 grade level in the Federal service as defined in the next paragraph.\n<br><br>\n<strong>Specialized experience</strong> is experience at or equivalent to which is directly related to the position which has equipped the applicant with the particular knowledge, skills and abilities (KSAs) to successfully perform the duties of the position to include experience designing, implementing, and conducting scientific studies or projects to identify public health issues, outcomes, and solutions.\n<br><br>\n<strong>Documenting experience:</strong> In accordance with Office of Personnel Management policy, federal employees are assumed to have gained experience by performing duties and responsibilities appropriate for their official series and grade level as described in their position description. Experience that would not normally be part of the employee's position is creditable, however, when documented by satisfactory evidence, such as a signed memorandum from the employee's supervisor or an SF-50 or SF-52 documenting an official detail or other official assignment. The documentation must indicate whether the duties were performed full time or, if part time, the percentage of times the other duties were performed. It is expected that this documentation is included in the employee's official personnel record. In order to receive credit for experience in your resume that is not within the official series and grade level of your official position, you must provide a copy of the appropriate documentation of such experience as indicated above.\n<br><br>\n<strong>HOW YOU WILL BE EVALUATED:</strong> \n<br>\nOnce the application process is complete, a review of the resume and supporting documentation will be made and compared against your responses to the assessment questionnaire to determine if you are qualified for this job. If, after reviewing your resume and/or supporting documentation, a determination is made that you have inflated your qualifications and/or experience, you may lose consideration for this position. Please follow all instructions carefully. Errors or omissions may affect your eligibility.\n<br><br>\nYour qualifications will be evaluated and rated on the following competencies (knowledge, skills, abilities, and other characteristics):\n\n<ul>\n<li>Accountability</li><li>Collaboration / Partnering</li><li>Conflict Management</li><li>Customer Service</li><li>Data Analysis and Interpretation</li><li>Data Collection</li><li>Decision Making</li><li>Diversity</li><li>Flexibility</li><li>Integrity</li><li>Interpersonal Skills</li><li>Needs Assessment (2)</li><li>Oral Communication</li><li>Problem Solving</li><li>Program Evaluation</li><li>Public Health Knowledge</li><li>Research (2)</li><li>Research Translation</li><li>Resilience</li><li>Results Driven</li><li>Self-Direction</li><li>Technical Credibility</li><li>Written Communication</li>\n</ul>\n\n<strong>BENEFITS:</strong> \n<br><br>\n<strong>OTHER INFORMATION:</strong>\n<br>\nNote: This is a temporary promotion not-to-exceed 1 year, but may be extended and or made permanent without further competition. If you currently are a GS-13, you do not meet the eligibility requirements for this position.\n<br><br>\nPHS Commissioned Corps Officers interested in performing the duties of this position within the Commissioned Corps may apply online to this announcement. Candidates will be referred as (CC) personnel and not as candidates for conversion to a permanent career or career-conditional appointment.\n<br><br>\nAdditional selections may be made within the same geographical location CDC-wide.\n<br><br>\nMales born after December 31, 1959 must be registered or exempt from Selective Service (see http://www.sss.gov).\n<br><br>\nInteragency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible see http://opm.gov/rif/employee_guides/career_transition.asp#ictap. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated at 85.0 or above on the rating criteria for this position.\n<br><br>\nTo view the questionnaire, click on the following link:\n<br>\nhttps://apply.usastaffing.gov/ViewQuestionnaire/10288587\n<br><br>\nIf you are unable to apply online or need to fax a document(s), view the following link for information regarding an Alternate Application.\n<br><br>\n<strong>HOW TO APPLY:</strong> \n<br><br>\nTo apply for this position, you must complete the online application and submit the documentation specified in the Required Documents section below.\n<br><br>\nA complete application package must be submitted by 11:59 PM (EST) on 09/13/2018 of this announcement to receive consideration.\n\n<ul>\n<li>To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application.</li><li>Follow the prompts to select your résumé and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process.</li><li>After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process.</li><li>You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application.</li>\n</ul>\n\nTo verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/.\n<br><br>\n<strong>If you cannot apply online:</strong>\n<br><br>\nYou are encouraged to apply online. If you are unable to apply online, please use the Alternate Application link listed in the Additional Information section of this vacancy announcement. Applicants are strongly encouraged to apply online if at all possible. Applying online, through your USAJOBS account, will expedite the application process and allow you to check your application. If you utilize the Alternate Application method, your USAJOBS account will not display this application and you will not receive status updates.\n<br>\n<strong>REQUIRED DOCUMENTS:</strong>\n<br>\nTo apply for this position, you must submit a complete Application Package which includes:\n\n\n<ul>\n<li>Your résumé showing work schedule, hours worked per week, dates of employment and duties performed.</li>\n\n<strong><li>Other supporting documents:</li>\n</strong></ul><strong>\n\n</strong>\n\n<ul>\n<li>Cover Letter, optional</li><li>Resume</li><li>SF50</li><li>Transcripts required</li><li>Career Transition Assistance Program/Interagency Career Transition Assistance Program documentation, if applicable (e.g., Certification of Expected Separation, Reduction-In-Force Separation Notice, or Notice of Proposed Removal; SF-50 that documents the RIF separation action; and most recent performance appraisal.)</li>\n</ul>\n\nNote: You may submit an unofficial transcript or a list of college courses completed indicating course titles, credit hours, and grades received. An official transcript from an accredited educational institution is required if you are selected for the position.\n<br><br>\nFailure to submit any of the above mentioned required documents may result in loss of consideration due to an incomplete application package. It is your responsibility to ensure all required documents have been submitted.\n<br><br>\nFor Résumé and Application Tips visit: https://help.usajobs.gov/index.php/Tips.\n<br>\n<strong>WHAT TO EXPECT NEXT:</strong>\n<br>\nOnce the online questionnaire is received you will receive an acknowledgement email that your submission was successful. The most highly qualified candidates will be referred to the hiring manager for further consideration and possible interview. We expect to make a selection within 45 days of the closing date of this announcement.\n<br><br>\nYou will receive notice via email once this process is completed (generally 4-6 weeks).\n<br><br>\n<strong></strong>"}