{"job title": "Imaging Scientist", "company": "DuPont™ Danisco®", "city state": "– IA", "rating": "3.0", "job description": "<div>\nJob Description<br><br>Corteva Agriscience™, Agriculture Division of DowDuPont™ is\n<br>\nseeking an Imaging Scientist with a background in image analysis, computer\n<br>\nvision and machine learning to join our global Data Science and Informatics\n<br>\ngroup working on image analytics for digital agriculture at our Johnston, Iowa\n<br>\nlocation.\n<br><br>\nWe are aggressively building Big Data and Predictive Analytics\n<br>\ncapabilities to deliver improved services to our customers. At Corteva Agriscience™, you’ll\n<br>\nbecome part of an interdisciplinary, global work environment in which you will operate as a thought leader and visionary that\n<br>\nwill encourage and promote disruptive advances by applying state-of-the-art\n<br>\nmethods in imaging science and artificial intelligence. This is a critical position with strategic impact on our\n<br>\nbusiness and you will play a major role by driving innovation in agriculture\n<br>\ntechnology.\n<br><br>\nThe successful candidate will\n<br>\nhave an extensive background and track record in applied image analysis or\n<br>\ncomputer vision. She/he will work closely with other imaging specialists,\n<br>\nsoftware engineers, and data scientists in a dynamic research environment to design\n<br>\nand implement sophisticated end-to-end solutions for image-based solutions for\n<br>\nlab and field trials. The candidate will need to have an in-depth understanding\n<br>\nof practical imaging applications, sensors &amp; techniques and be able to\n<br>\nindependently create engineered technical solutions to a wide range of applied\n<br>\nimaging problems requiring collaboration with key stakeholders.<br><br>Job Qualifications\n\n<ul>\n<li>Ph.D. in Image Analysis, Computer Engineering,\n<br>\nPattern Recognition, Computational Photography or Artificial Intelligence</li><li>Alternatively, a Ph.D. in Machine Learning, Computer\n<br>\nScience, Computer Engineering, Electrical Engineering, Robotics, Physics,\n<br>\nMathematics or related field or related scientific discipline with 2yrs+ of\n<br>\ndemonstrated experience specifically in image processing or computer vision.</li><li>Master’s degree in Image Analysis, Computer\n<br>\nVision, Pattern Recognition or Artificial Intelligence with 6yrs+ of equivalent\n<br>\nexperience.</li>\n</ul>\nPreferred\n<br>\nQualifications:\n<ul>\n<li>Deep understanding of\n<br>\nimage processing and analysis algorithms and tools for RGB,·hyperspectral,\n<br>\nfluorescence, LIDAR and 3D imaging including detecting and classifying objects\n<br>\nin complex low/medium/high\n<br>\nresolution datasets.</li><li>Experience\n<br>\nin the design and optimization of deep neural networks architectures for image\n<br>\nclassification, object detection, sematic segmentation, machine vision\n<br>\napplications at the edge.</li><li>Strong\n<br>\nprogramming skills in Python and C/C++ programming with the ability to quickly\n<br>\ncreate prototype solutions on Unix / Linux / embedded platforms.</li><li>Experience\n<br>\nworking with open source libraries and toolkits on embedded imaging devices\n<br>\nusing tools such as SciKit-Image, TensorFlow, Torch, Theano, OpenCV, ROS,\n<br>\nORB_SLAM, VLFeat, Keras, MXNet.</li><li>Practical\n<br>\ncloud computing experience with AWS technologies (EC2, S3, ECS, etc.) and experience\n<br>\nin high performance and data intensive platforms.</li><li>Interest\n<br>\nin learning new technologies, programming techniques, languages, and operating\n<br>\nsystems.</li><li>Excellent\n<br>\ninterpersonal skills and a can-do attitude with the ability to thrive in a\n<br>\nfast-paced dynamic environment. Experience in research, life sciences, or in\n<br>\ndata science is a plus.</li><li>Excellent\n<br>\nanalytical and problem-solving skills with the ability to work as part of a\n<br>\nglobal team and, at times, independently while appropriately prioritizing\n<br>\ntasks.</li><li>Strong\n<br>\nverbal and written communication skills in English are required.</li>\n</ul>\n\n<strong>Nice-to-have:</strong>\n\n<ul>\n<li>Experience\n<br>\nin Computer Vision, Machine Learning, Convolutional Neural Networks, Deep\n<br>\nLearning for Imaging Applications, Generative Image Models.</li><li>Experience\n<br>\nworking with containerized applications and orchestration such as Docker Swarm\n<br>\nand/or Kubernetes</li><li>Experience\n<br>\nworking with robotics, automation systems and reinforcement learning paradigms.</li><li>Background in Statistical Modeling and Computation Mathematics</li>\n</ul>\n\n<div>We\n<br>\nare excited to announce that Corteva Agriscience™ is the name of the\n<br>\nnew Agriculture Division of DowDuPont™. We are bringing together DuPont\n<br>\nCrop Protection, DuPont Pioneer and DowAgroSciences to create a\n<br>\nmarket-shaping, standalone agriculture company with leading positions in seed\n<br>\ntechnologies, crop protection and digital agriculture. We will work across the\n<br>\nglobal agriculture value chain to create a more efficient food system.\n<br><br>\nAt Corteva Agriscience™,\n<br>\nwe seek to enrich the lives of those who produce and those who consume. This\n<br>\nmeans we will help rejuvenate the agricultural ecosystem to support people and\n<br>\nthe planet and to ensure progress for generations to come.</div>\n<br>\nAbout DowDuPont<br><br>DowDuPont (NYSE: DWDP) is a holding company comprised of The Dow Chemical Company and DuPont with the\n<br>\n intent to form strong, independent, publicly traded companies in agriculture, materials science and specialty\n<br>\n products sectors that will lead their respective industries through productive, science-based innovation to meet the\n<br>\n needs of customers and help solve global challenges. For more information, please visit us at www.dow-dupont.com.\n<br><br>\nThe positions represented by this job posting are aligned to one of the three divisions, Agriculture, Materials\n<br>\n Science or Specialty Products, which are expected to separate from DowDuPont into stand-alone public companies.\n<br>\n Information on the division alignment will be provided during the recruitment process.</div>\n<br>"}