{"job title": "Senior Data Engineer", "company": "HOMER", "city state": "– New York, NY", "rating": "5.0", "job description": "<strong>HOMER</strong> is looking for a collaborative and results driven <strong>Senior Data Engineer</strong> to join our energetic, growing team and <strong>sit in our New York City office</strong>. You will have a profound impact on a company that touches the lives of children, parents, and teachers across the globe with one of the most celebrated reading and learn-to-read platforms in the industry. We are looking to create the most world-class digital learning experience available. Your work will help build a beautiful, personalized experience to meet every child's specific needs as they learn to read, love to read, and read to learn. Overall success in this position means you have helped the children using our products find the lessons, stories, and other content that best fit their age and interests.\n<br><br>\nHOMER's mission is to challenge a one-size-fits-all approach to learning and put individuality at its center. We are a venture-backed, high-growth business that offers competitive compensation including equity and full benefits in a creative, flexible environment that invests in professional development.\n<br><br>\n<strong>Reporting into the Director of Technology</strong>, the successful candidate will be responsible for improving and maintaining our data infrastructure and owning parts of it. You will focus on accuracy, reliability and timeliness of data that the whole company uses to generate insights, and deploying data science models that tackle sophisticated business problems. As you grow, you'll take on new responsibilities, from designing and defining our processes around data management to scaling our data pipeline.\n<br><br>\n<strong>You will:</strong>\n\n<ul>\n<li>Collaborate effectively with our data scientists, analysts, engineers and other stakeholders to design and maintain data models</li> \n\n<li>Design scalable infrastructure to build, train, and deploy machine learning models, with an eye on efficiency</li>\n<li>Own efficacy and quality for data pipelines and ETL processes you build and maintain</li>\n<li>Develop, maintain and improve tools to enable team members to rapidly consume and understand data</li>\n<li>Implement and integrate solutions using Python, SQL, and other languages as necessary</li>\n<li>Improve and expand our product recommendation systems to be more powerful, helping children using our products to have greater success</li>\n<li>Help build and add new features to our in-house experimental tools to support A/B testing</li>\n</ul>\n<strong>You must have:</strong>\n\n<ul>\n<li>Demonstrable expertise in Python, SQL, Node, relational databases (e.g. PostgreSQL), non-relational databases (e.g. Couchbase or MongoDB), and column store (e.g. Vertica/Redshift)</li>\n<li>Experience building and maintaining data infrastructure (including batch and streaming ETL processes)</li>\n<li>Sound Computer Science fundamentals (Bachelor's degree in CS or related fields preferred)</li>\n<li>Strong interpersonal and communication skills</li>\n<li>At least 3 years of relevant work experience</li>\n</ul>\n<strong>We are also looking for:</strong>\n\n<ul>\n<li>Knowledge of machine learning, statistics, and data visualization solutions (e.g. Looker)</li>\n<li>Knowledge of MapReduce and some distributed data processing methodologies and frameworks (e.g. Hadoop, Hive, Pig, Presto, Spark )</li>\n<li>Knowledge of deployment technologies in cloud hosted environments (e.g. AWS )</li>\n<li>Experience with mobile development in Objective-C, Swift or Javascript</li>\n</ul>\n<strong>We like people who are:</strong>\n\n<ul>\n<li>Results oriented, hands-on and passionate about our industry (education) and our consumers (children, parents and educators)</li>\n<li>Collaborative, and thrive in startup environments</li>\n<li>Able and willing to learn new technologies and styles</li>\n</ul>\n<strong>What you'll get:</strong>\n\n<ul>\n<li>HOMER offers competitive compensation including equity and full benefits</li>\n<li>Smart, passionate, and engaged co-workers</li>\n<li>Excellent top-tier Medical/Dental/Vision benefits</li>\n<li>A chance to have a big impact</li>\n<li>A chance to bring a love of reading and learning to children globally</li>\n</ul>\nHOMER is an equal opportunity employer and enthusiastically encourages people from a wide variety of backgrounds and experiences to apply. HOMER does not discriminate on the basis of race, color, religion, sex (including pregnancy), gender, national origin, citizenship, age, mental or physical disability, veteran status, marital status, sexual orientation or any other basis prohibited by law."}