{"job title": "Data Visualization and Communications Intern", "company": "Monsanto Company", "city state": "– Saint Louis, Missouri", "rating": "4.0", "job description": "<div><div><div>We are seeking a motivated Data Visualization and Communications Intern. This position will be located in Chesterfield, Missouri, reporting to our Process Visualization Lead.</div><div>The Data Viz and Communications intern will learn fast in an exciting, energetic environment, develop relationships with world class scientists, create awesome ways to drive decisions and visualize operations, communicate observations from trends to a broad audience, and learn to use visualization and data analytics software to collate complicated data.</div><div>Be part of the future of agriculture and identify exciting ways to visualize data that will drive decisions within the R&amp;D pipeline that impact product development and farmers globally.</div> <div>Dates for this internship are May August of 2019.</div>\n<br>\n<div><strong>Key Responsibilities:</strong></div><ul><li><div>Partner closely with interdisciplinary scientists including plant breeders, field/seed operations, logistics managers and IT to implement new solutions for identifying key operational trends and communicate them across a broad audience</div></li><li><div>Work with large data sets collected from around the world to drive recommendations</div></li><li><div>Analyze data to identify trends that drive new strategic decisions</div></li><li><div>Leverage creative talents and passion for visual communications to design innovative approaches to make our operations data tell a story</div></li></ul></div>\n\n<br><strong><br>\n\n<div><strong>Required Skills / Experience:</strong></div>\n<ul>\n<li>Current enrollment in a BS or MS degree program at a university within the US studying two or more of the following disciplines: Data Visualization, Business Intelligence, Information/Graphic Design, Data Analysis or Mass Communication/Marketing</li>\n<li>Cumulative GPA of 3.0 or above</li>\n<li>Must be returning to school upon completion of this internship to continue program of study or to begin an advanced degree</li> \n\n<li>Experience and passion for using data to generate insight and solve problems</li>\n<li>Creative, proactive, bold and out-of-box thinking</li> \n\n<li>Strong problem solving and critical thinking skills</li> \n\n<li>Demonstrated ability to innovate, collaborate and work effectively in fast-paced team-oriented environment</li>\n<li>Ability to communicate complex ideas in a clear, precise and actionable manner with both technical and non-technical audiences</li>\n</ul>\n\n<div>Bayer successfully completed the acquisition of Monsanto in June 2018, bringing together Monsantos leadership in seeds and plant traits with Bayers leadership in chemical and biological crop protection. By joining forces, we will create even more extensive career opportunities for talent around the world. Were a global team working to shape agriculture through breakthrough innovation that will benefit farmers, consumers, and our planet.</div>\n<br>\nWhile we are now Bayer, we will continue to hire using separate career sites until we can integrate our career platforms. We invite you to explore the career opportunities available at the combined company by visiting advancingtogether.com/careers.</strong></div>"}