{"job title": "Behavioral Scientist", "company": "MRY", "city state": "– New York, New York", "rating": "3.3", "job description": "Company Description<br><br>MRY is a dynamic creative agency that unlocks cultural relevance to create ideas that uniquely captivate and compel. Our approach is rooted in behavior science which gives us a deep understanding of the human experience. Our ideas are designed to be channel-proof, so that they are not bound by media, but come to life with contextual reference.\n<br><br>\nPart of Publicis Groupe, MRY is headquartered in New York and works with some of the world's leading brands. We offer a full spectrum of services to make sure our big ideas meet all the needs of our clients: Walmart, Kellogg's, Aflac, Five Guys, and more.<br><br>Job Description<br><br>The<strong> Behavioral Scientist</strong> will work within the Intelligence department to influence strategy and creative on a key account through a synergy of psychology, behavioral economics, and neuro-marketing. By combining owned and 3rd party consumer data with behavioral economics, the Behavioral Scientist will build recommendations based on well-rounded understanding of consumers needs, motivations, and personalities. This role will be working with a larger Behavioral Science team across the Atlanta and New York offices.\n<br><br>\n<strong>Responsibilities</strong>\n<ul>\n<li>Analyzing a breadth of data points to uncover human truths</li><li>Apply learnings to tactical creative and strategy work on a weekly and monthly basis</li><li>Assist in biometric creative testing using a proprietary structure</li><li>Build testing recommendations and test studies</li><li>Proactively collaborate with Creative, Strategy, and Analytics teams to ensure agency partners comprehend and apply findings</li><li>Collaborate with the Analytics team to craft social media tests and strategies that drive consumers through business and engagement funnels</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n<ul>\n<li>In-depth knowledge of Behavioral Sciences:</li><li>Base understanding of psychology, social psychology, evolutionary psychology, and/or consumer neuroscience</li><li>Understanding of Behavioral Economics cognitive process including heuristics and biases</li><li>Understanding of cognitive motivations including explicit and implicit motivational territories.</li><li>Demonstrated knowledge of traditional and behavioral science research:</li><li>In-depth knowledge of traditional qualitative and quantitative marketing research techniques</li><li>In-depth knowledge of behavioral qualitative and quantitative marketing research techniques</li><li>In-depth understanding of the scientific method and Random Control Trials</li><li>In-depth understanding of Consumer Neuroscience techniques.</li><li>Demonstrated ability to discover what business questions internal and external stakeholders are trying to answer, and formulate and execute a Behavioral Science Research Plan and provide actionable results.</li>\n</ul>\n\nAdditional Information<br><br>MRY is proud to be an equal opportunity employer and values diversity. All your information will be kept confidential according to EEO guidelines."}