{"job title": "Bioassay Scientist", "company": "Nirmidas Biotech, Inc", "city state": "– Palo Alto, CA", "rating": "NA", "job description": "Job Description<div>Nirmidas Biotech Inc. is looking for a highly motivated bioassay scientist for clinical in vitro diagnostics product development. Qualified applicants should have the strong desire and flexibility to work in a fast-paced startup environment. The bioassay scientist is expected to lead and participate in bio-assay development, and/or development of platforms and instruments in support of our current and future products. A strong background and industrial experience in Immunoassays and In Vitro Diagnostics (IVD) product development is desired.\n<br><br>\n· Design &amp; Develop biological/Immuno assays for clinical diagnostic applications\n<br><br>\n· Identify, design and execute new ideas leading to novel diagnostic assays with existing Nirmidas and new product platforms\n<br><br>\n· Lead and contribute to a multi-disciplinarily project team through the entire cycle of product development (from feasibility to launch)\n<br><br>\nDesign and perform laboratory experiments, Compile and analyze data; prepare reports and presentations.\n<br><br>\n· Participate in product improvement and support manufacturing, as required.\n<br><br>\n· Participate in the development of automated assay platform\n<br><br>\n· Supervise and instruct research scientists and research associates, as needed.\n<br><br>\n· Manage Project with consideration of schedule, cost, reliability, simplicity, manufacturing methods and effectiveness.\n<br><br>\n· Liaise with internal and external individuals; attend meetings as necessary.\n<br><br>\n· Assist in marketing Nirmidas’ innovative new products\n<br><br>\n· Produce rigorous lab documents and maintain a well-organized laboratory notebook</div>Company Description<div>Nirmidas Biotech, Inc. is a venture-backed startup in Palo Alto building innovative technologies based on infra-red and near infra-red fluorescence and novel nanomaterials. It was a Stanford University spin-off and a member of the StartX community. We combine chemistry, biology, bio-engineering, and optical imaging to research and develop, and commercialize applications for diagnostics and imaging in early disease diagnosis, prognosis monitoring, population screening, and therapeutics. Our technology and applications have been published in Nature Medicine and J. Clinical Microbiology. We have been awarded multiple NIH grants. Our products include signal enhancing plasmonic pGOLDTM microarray slides, highly sensitive multiplexed assay system OptiMidasTM, Zika virus serology assay kits, and pioneering NIR-II nanomaterials for high resolution deep tissue imaging. Our products aim for both research and clinical use. For more information, please visit our website: www.nirmidas.com</div>"}