{"job title": "Senior Scientist", "company": "Pharmaceutical Product Development, LLC", "city state": "– Middleton, Wisconsin", "rating": "3.4", "job description": "PPD is a leading global contract research organization. At PPD we are passionate, deliberate, and driven by our purpose - to improve health.\n<br><br>\nPPD Laboratories offer the most comprehensive set of laboratory services available in the industry. Our services are designed to accelerate pharmaceutical development for small molecules, biologics, and vaccines, allowing our clients to make faster decisions about their compounds.\n<br><br>\nAs a Senior Scientist - Biopharmaceutical Services (Protein/Biologics/large molecule), you are committed to excellence and high quality results in your complex laboratory analysis of key pharmaceutical products. Beyond the bench, you work as a project leader with a strong sense of urgency aligned to our customers, and you are committed to delivering results.\n<br><br>\nGrow your career within the scientific ladder, pursue project management, or develop into a leader. These are just a few career pathways available once you chose to Be with PPD.\n<br><br>\nJoin PPD in our relentless pursuit of excellence - apply now!\n<br><br>\n<strong> Responsibilities:</strong>\n<li> Performs complex laboratory analysis of pharmaceutical products and proficiently uses analytical instrumentation, calculates and analyzes data and records data in adherence with PPD SOP's and the industry.</li>  <li> Routinely acts as the project leader on multiple projects, interacts with clients, reviews and evaluates data, writes reports and protocols.</li>  <li> Responsible for the scientific conduct of the project and communication of regulatory issues with senior level team members.</li>\n<strong><br><br>Qualifications</strong>\n<br><br>\n<strong> Education and Experience:</strong>\n<li> Bachelor's degree or equivalent and relevant formal academic / vocational qualification</li> <li> Previous experience that provides the knowledge, skills, and abilities to perform the job (comparable to 4+ years) or equivalent combination of education, training, &amp; experience.</li>\nOR\n<li> Masters degree and previous experience that provides the knowledge, skills, and abilities to perform the job (comparable 2+ year)</li>\nOR\n<li> PhD</li>\nAND\n<li> Analytical method development and validation experience in protein/large molecule/biologics, strongly preferred.</li> <li> Protein characterization experience, preferred.</li> <li> HPLC, ELISA, and/or Capillary Electrophoresis (CE or iCE), strongly preferred.</li>\n<strong> Knowledge, Skills and Abilities:</strong>\n<li> Solid understanding and knowledge of general chemistry and separation science</li> <li> Full understanding of laboratory requirements, PPD &amp; client SOPs, ICH guidelines, USP requirements and FDA guidance</li> <li> Ability to utilize Microsoft Excel and Word to perform tasks</li> <li> Proficiency on technical operating systems</li> <li> Proven problem solving and troubleshooting abilities</li> <li> Effective oral and written communication skills</li> <li> Proven ability in technical writing skills</li> <li> Time management and project management skills</li> <li> Ability to work in a collaborative work environment with a team</li> <li> Proven problem solving and troubleshooting abilities</li> <li> Ability to train junior staff</li>\n<strong> Working Conditions</strong>\n<li> Work is performed in a laboratory and/or a clinical environment with exposure to electrical office equipment.</li> <li> Occasional drives to site locations, occasional domestic travel.</li>  <li> Exposure to biological fluids with potential exposure to infectious organisms.</li>  <li> Rare exposure to skin and lung irritants, radiation, toxic materials and hazardous waste.</li>  <li> Personal protective equipment required such as protective eyewear, garments and gloves.</li>  <li> Exposure to fluctuating and/or extreme temperatures on rare occasions.</li>\n<strong> Physical Requirements</strong>\n<li> Ability to work in an upright and /or stationary position for 6-8 hours per day.</li>  <li> Repetitive hand movement of both hands with the ability to make fast, simple, repeated movements of the fingers, hands, and wrists to operate lab equipment.</li>  <li> Occasional mobility needed.</li>  <li> Occasional crouching, stooping, with frequent bending and twisting of upper body and neck.</li>  <li> Light to moderate lifting and carrying (or otherwise moves) objects including luggage and laptop computer with a maximum lift of 15-20 lbs.</li>  <li> Ability to access and use a variety of computer software developed both in-house and off-the-shelf.</li> <li> Ability to communicate information and ideas so others will understand; with the ability to listen to and understand information and ideas presented through spoken words and sentences.</li>  <li> Frequently interacts with others to obtain or relate information to diverse groups.</li>  <li> Works independently with little guidance or reliance on oral or written instructions and plans work schedules to meet goals. Requires multiple periods of intense concentration.</li>  <li> Performs a wide range of variable tasks as dictated by variable demands and changing conditions with little predictability as to the occurrence. Ability to perform under stress. Ability to multi-task.</li>  <li> Regular and consistent attendance.</li>\nPPD is an affirmative action employer that values diversity as a strength and fosters an environment of mutual respect. PPD provides equal employment opportunities without regard to age, race, color, pregnancy, national origin, religion, sex, gender identity, sexual orientation, disability, veteran status or other status within any other protected group.\n<br><br>\n<strong> Organization</strong>\n<br><br>\n-Biopharmaceuticals\n<br><br>\n<strong> Primary Location</strong>\n<br><br>\n-North America-United States-Wisconsin-Middleton - Research Way"}