{"job title": "Color Scientist", "company": "Sun Chemical Corporation", "city state": "– Carlstadt, NJ", "rating": "3.6", "job description": "The color scientist is responsible for projects in Color Research in areas of color measurement and color management technology. This position works independently on assigned and self-initiated R &amp; D programs related to new color reproduction technologies and colorimetric characteristics of a wide range of materials. Develops new color management technologies and their applications to accomplish the long-term objectives identified in the vision of the respective product lines. The position generates information which extends the existing boundaries of basic knowledge of color reproduction in the Graphic Arts. This position develops computer models for the prediction of the color of materials from measurements of the basic optical properties of characteristics of graphic arts materials, including ink, extenders, substrates and pigments.\n<br><br>\n<strong>ACCOUNTABILITIES / JOB RESPONSIBILITES</strong>\n<ul>\n\t<li>Maintain &amp; verify the accuracy of the color-measurement instruments in the Color Research Laboratory. Contact vendors for ISO 9000 certifications.</li>\t<li>Perform statistical data analysis on color measurements and material properties, assist with gage R&amp;R studies of optical properties of inks and printing.</li>\t<li>Develop mathematical and computer models of printing, inks, coatings and other pigmented materials. Apply models to color management and color matching</li>\t<li>Prepare reports and disseminate knowledge to technical groups in NAI, SIE and customers on color management and matching of packaging inks.</li>\t<li>Attend technical and trade shows to assess the technology of competitors and identify potential partners for future developments.</li>\n</ul>\n<strong>ROLE-SPECIFIC COMPETENCIES /FUNCTION-SPECIFIC KNOWLEDGE &amp; SKILLS</strong>\n<ul>\n\t<li>Familiar with most instruments and software for color measurement.</li>\t<li>Proficient in the use of software for modeling color reproduction processes including Matlab, iQC and IFS/CQS.</li>\t<li>Capable of developing small applications in a modern, object oriented programming language (C++, Java, Ruby)</li>\t<li>Excellent interpersonal relationship skills</li>\t<li>Good writing , reporting and presentation skills</li>\t<li>Ability to work successfully with less knowledgeable development and production staff on developing specification and plans.</li>\t<li>Excellent analytical / problem solving skills</li>\t<li>Advanced computer skills (Excel, Word, Power Point, Adobe Creative Suite)</li>\n</ul>\n<strong>KEY RELATIONSHIPS</strong>\n<br><br>\n<em>-Senior Color Physicist</em>\n<br><br>\nProvide regular verbal and written project/results updates and communicate timeline/status for assigned tasks. Review algorithms and models.\n<br><br>\n- <em>Senior Color Scientist</em>\n<br><br>\nSupport projects on computer assisted color-matching, instrument profiling.\n<br><br>\n<em>- Color Engineer</em>\n<br><br>\nDevelop a strong working relationship in which he/she understands application of substrate and lighting on models of color reproduction.\n<br><br>\n<strong><em>-</em></strong><em> Director of Regional Color Matching Laboratory</em>\n<br><br>\nSupport the development and application of IFS color-matching software and proofing.\n<br><br>\n<em>- Director of Packaging Technology</em>\n<br><br>\nProvide direct support and guidance on issues related to color control and color management of packaging inks. Help establish and promote best practices for manufacturing and process control\n<br><br>\n<strong>MINIMUM EDUCATION AND EXPERIENCE</strong>\n<br><br>\nPrefer Ph.D. degree in color science, color imaging or reproduction. Minimum 5 years of experience in color technology or image reproduction technology."}