{"job title": "Associate Scientist", "company": "Synectics", "city state": "– San Diego, CA", "rating": "3.4", "job description": "<div>\nJob Post Index\n<br>\n1FA8EE-Sy##</div>\n<br>\n<div>\nLocation\n<br>\nSan Diego, CA</div>\n<br>\n<strong></strong><div><strong>\nDescription:</strong>\n<br>\n<strong>Summary</strong>\n\n<ul>\n<li>The Associate Scientist will be working under the direction of Scientists and will be responsible for supporting projects related to gene cloning, gene modification, protein expression optimization, strain optimization and associated microbiological support for novel enzyme products.</li>\n<li>Complete assigned tasks independently, with minimal supervision.</li>\n<li>Coordinate technical activities with minimal supervision.</li>\n<li>Summarize, analyze and interpret moderately complex analytical data.</li>\n<li>Achieve successful completion of deliverables with efficiency and adherence to time constraints.</li>\n<li>High throughput enzyme screening and enzyme activity characterization assays.</li>\n<li>Activity and inhibition kinetics analysis, protein quantitation.</li></ul></div>\n<br>\n<strong></strong><div><strong>\nSkills:</strong>\n<br>\n<strong>Qualifications</strong>\n\n<ul>\n<li> BS (preferred + 3 years relevant experience) or MS (preferred + 1 year relevant experience or Ph.D with no experience) in Chemical or Biological Engineering, Molecular Biology, Microbiology, Biochemistry, Cellular Biology or related field.</li>\n<li>Must have experience with aseptic technique and manipulation of microorganisms</li>\n<li>Must have experience with PCR, protein gel electrophoresis and other standard molecular biology techniques</li>\n<li>Experience with small scale (96-well, 24-well) protein expression, enzymatic assays and DNA/RNA manipulation including extraction/quantitation experience desired</li>\n<li>Experience with protein expression and production in bacterial, yeast, or fungal systems is a plus</li>\n<li>Experience with enzyme liquid handling is a plus</li>\n<li>Excellent attention to detail, organization, and time management skills</li>\n<li>Must be highly self-motivated and enjoy working in a team oriented environment</li></ul></div>\n<br>"}