{"job title": "Entry Level Associate Scientist", "company": "The Fountain Group", "city state": "– San Diego, CA", "rating": "4.0", "job description": "Job Description<div><strong>Job Description:</strong>\n<br><br>\nSeeking an Associate Scientist for the Expression &amp; Technology Development group.\n<br><br>\nThe Associate Scientist will be working under the direction of Scientists and will be responsible for supporting projects related to gene cloning, gene modification, protein expression optimization, strain optimization and associated microbiological support for novel enzyme products.\n<br><br>\nThe successful candidate is expected to complete assigned tasks independently, with minimal supervision.\n<br><br>\nMust have experience with aseptic technique and manipulation of microorganisms\n<br><br>\nMust have experience with PCR, protein gel electrophoresis and other standard molecular biology techniques\n<br><br>\nExperience with small scale (96-well, 24-well) protein expression, enzymatic assays and DNA/RNA manipulation including extraction/quantitation experience desired\n<br><br>\nExperience with protein expression and production in bacterial, yeast, or fungal systems is a plus\n<br><br>\nExperience with enzyme liquid handling is a plus\n<br><br>\nExcellent attention to detail, organization, and time management skills\n<br><br>\nMust be highly self-motivated and enjoy working in a team-oriented environment\n<br><br>\nHigh throughput enzyme screening and enzyme activity characterization assays.\n<br><br>\nActivity and inhibition kinetics analysis, protein quantitation. Coordinate technical activities with minimal supervision.\n<br><br>\nSummarize, analyze and interpret moderately complex analytical data.\n<br><br>\nAchieve successful completion of deliverables with efficiency and adherence to time constraints.\n<br><br>\nExperience with biochemical and enzyme assays and analysis.\n<br><br>\nExperience with HPLC, SDS-PAGE and analysis.\n<br><br>\nExperience with protein purification, liquid handling and starch based applications a plus.\n<br><br>\nAbility to work in a multidisciplinary and fast paced environment, both independently and in a team setting.\n<br><br>\nExcellent organization skills and detail oriented. Excellent communication skills</div>Company Description<div>About The Fountain Group:\n<br>\nHeadquartered in Tampa, FL, with operations in all 5 regions, The Fountain Group is a Contingent Labor Resource Provider. The Fountain Group services clients directly, clients with an internal contingent labor program, and clients with an external managed service program.\n<br><br>\nAt The Fountain Group, we know that searching for a new career can be stressful, which is why we take time to understand your skills and personal goals. We understand the importance of job flexibility and professional growth, and offer top-notch positions with leading employers. In fact, the majority of our clients are well known Fortune 100-500 companies. We also offer a variety of benefits to our associates to ensure their overall happiness.\n<br><br>\nIn addition to assisting with your job search, we will help you through every step of the process offering online tutorials and additional resources to enhance your industry knowledge and skills. As your employment agent, we are dedicated to providing career counseling and job advice, knowing precisely what established companies want.\n<br><br>\nAt The Fountain Group, we treat you like family, regardless of your proximity to our office. We are dedicated to providing you with an exciting, challenging and highly rewarding place to work. Become a part of our team today and let us put your talents to work.\n<br><br>\nIf you are interested in hearing more about the position please respond to this email with a copy of your resume in word form with the best contact info Please forward this email to any friends or colleagues</div>"}