{"job title": "Environmental Scientist", "company": "The Judge Group, Inc.", "city state": "– Columbia, OH", "rating": "3.6", "job description": "Our client is currently seeking a Environmental Scientist\n<br><br>\n<strong>Job Summary:</strong>\n\n\n<ul>\n<li>Field sampling and/or oversight of environmental sampling and construction activities;</li>\n<li>Experience in estimating environmental project costs and preparing proposals;</li>\n<li>Ability to understand and apply government regulations related to hazardous materials and wastes; and</li>\n<li>Coordination of small to mid-scale projects.</li>\n<li>Client interaction skills to develop and retain existing clients.</li>\n<li>Working knowledge of various computer software to prepare reports, presentations, and to conduct statistical and risk analyses. Experience in using GIS and handheld GPS for field survey and presentation of data is a plus.</li>\n<li>Willingness to travel, hike 2 to 3 miles in rough terrain with field gear.</li>\n<li>Good organizational and communication skills and ability to work independently, as well as in a team setting.</li>\n</ul>\n\n<strong>Knowledge &amp; Skills:</strong>\n\n\n<ul>\n<li>Phase I &amp; II ESAs, Remediation, Asbestos Hazard Evaluation, Lead-based paint and/or Mold Surveys, and/or Underground Storage Tank Closures and Assessments.</li>\n</ul>\n\n<strong>Education:</strong>\n<br>\nBachelor's or Master's degree in Environmental Science, Geology, Civil or Chemical Engineering, biology, or related science field.\n<br>\nA minimum of 5 years of consulting experience in the environmental field.\n<br><br>\nJudge Group Job Order ID: 581726\n<br><br>\nSalary: 60k- 90k\n<br><br>\n<strong>Company Description:</strong>\n<br><br>\nWorking at the crossroads of people and transformative technologies, The Judge Group delivers innovative business solutions powered by top talent to help organizations reach their strategic goals and realize opportunities now and in the future.\n<br><br>\nThe Judge Group is a leading professional services firm specializing in technology, talent, and learning solutions. Our services are successfully delivered through a network of more than 35 offices in the United States, Canada, China, and India. The Judge Group serves more than 40 Fortune 100 companies and is responsible for the placement of more than 4,500 professionals annually across a wide range of industries. To learn more, visit www.judge.com."}