{"job title": "Imagery Scientist", "company": "TPGS", "city state": "– Springfield, VA", "rating": "4.1", "job description": "<div>Description<div><div><div>\n</div><div></div><div><strong>Title:</strong> Imagery Scientist</div><div><strong><strong>Location:</strong></strong><strong> Springfield, VA</strong></div><div><strong><strong><strong>Work Requirements:</strong></strong><strong> Candidate must be able to obtain government security clearance.</strong></strong></div><div><strong><strong><strong><strong>Job Description:</strong></strong><strong> The selected candidate will provide imagery science support specifically related to the exploitation of imagery in one of the following sensor disciplines: radar, infrared, spectral, or geospatial (to include photogrammetry and LiDAR); to assist the government/contractor team in optimizing the collection and exploitation of varied imagery data types, especially those categorized as AGI. The image scientist will collaborate with and provide scientific analysis support to imagery/geospatial analysts, who will leverage the value-added support to sharpen their assessments of current intelligence issues. The image scientist duties also include applying AGI techniques and capabilities to mission issues, as well as investigating innovative and emerging technologies to incorporate into analysis. The evaluation of commercial, academic, and outside approaches and algorithms, refinement, development of measures of effectiveness, improvements to system environments, and creation of new procedures will be commonplace. Formal and informal written reports and briefings will be necessary to capture plans, schedules, status updates and results.</strong></strong></strong></div><div><strong><strong><strong><br>\n</strong></strong></strong></div><div><strong><strong><strong><strong><strong>Typical Education &amp; Experience:</strong></strong><strong> Typically a Bachelor's Degree and 4 years work experience or equivalent experience</strong></strong></strong></strong></div><div><strong><strong><strong><br>\n</strong></strong></strong></div><div><strong><strong><strong><strong><strong>Required Skills And Education:</strong></strong><strong>A minimum of 20 years of experience and a Bachelor of Science degree in image science, remote sensing, earth science, physical science, engineering, or similar engineering/science field or . Scientist candidates must have experience in applied image processing and scientific analysis of imagery (SAR, IR, Spectral, Lidar, photogrammetry), knowledge of image formation, and associated discipline phenomenology. Additional experience required includes scientifically processing imagery (SAR, IR, Spectral, Lidar) from Civil and Commercial imaging systems, proficiency with techniques, algorithms, and scientific analysis of associated discipline data processing using RSI ENVI. Experience with GOTS applications such as FSTK and AGITK is a plus. Scientists must possess the ability to communicate effectively in writing and oral presentations, complete task in a timely manner with minimal supervision, and the ability to work cooperatively and effectively as a team member.</strong></strong></strong></strong></div><div><strong><strong><strong><strong></strong>\n<br>\n</strong></strong></strong></div><div><strong><strong><strong><strong>Preferred Skills And Education:</strong></strong><strong> Proficiency using ITT ENVI COTS image processing software, ERADAS IMAGINE, MS Office, Windows, and knowledge of programming languages such as IDL, R, Python. Familiarity with commercial and civil data sources, integration of resulting data into ArcGIS. Knowledge of Marine Corps TTPs pertaining to littoral operating environment, and Marine Corps mission sets.</strong></strong></strong></div><div>\n\n<ul>\n\n<li><strong><strong><strong><strong><strong>Clearance must be current and active. We cannot sponsor new clearances for this role.</strong></strong></strong></strong></strong>\n<br><br>\n<strong><strong><strong>COMPENSATION/BENEFITS</strong></strong></strong>\n<br><br>\n<strong><strong><strong>Our benefits package includes:</strong></strong></strong></li>\n<li><strong><strong><strong>Comprehensive Medical Benefits</strong></strong></strong></li><li><strong><strong><strong>Competitive Pay</strong></strong></strong></li><li><strong><strong><strong>401(k) Retirement Plan</strong></strong></strong></li><li><strong><strong><strong>Training/Tuition</strong></strong></strong></li><li><strong><strong><strong>Paid Time Off (PTO)</strong></strong></strong></li><li><strong><strong><strong>Team Lunches</strong></strong></strong></li><li><strong><strong><strong>Leadership Incentives</strong></strong></strong></li></ul></div>\n<br>\n<div><strong><strong><strong><strong>WHO WE ARE</strong></strong></strong></strong></div><div><strong><strong><strong>TPGS is a mission-oriented defense contracting firm with extensive experience in the intelligence community as well as with federal agencies and the Department of Defense. TPGS provides expertise in information technology, intelligence, cyber security, training and instruction, software engineering/application development, management support and more. We understand and value the unique needs of our government clients and industry partners, as well as the importance of completing projects on time and we work hard to not only meet, but exceed expectations. Our world-class culture operates with an unparalleled sense of urgency and continuously encourages and promotes individual and team success. No matter the project, our capability can be summarized by our motto: Rapid Response. Proven Talent. Exceptional Service.</strong></strong></strong></div><div><strong><strong></strong></strong></div><div><strong><strong><strong>TPGS is an equal opportunity employer.</strong></strong></strong></div></div></div></div>"}