{"job title": "Data Analyst- Data Viz", "company": "Uber", "city state": "– San Francisco, California, United States", "rating": "4.2", "job description": "We’re changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now we’re a part of the logistical fabric of more than 600 cities around the world. Whether it’s a ride, a sandwich, or a package, we use technology to give people what they want, when they want it.\n<br><br>\nFor the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer.<br>\n<div>And that’s just what we’re doing today. We’re thinking about the future, too. With teams working on new modalities, self-driving cars and even urban air transportation, we’re in for the long haul. We’re reimagining how people and things move from one place to the next.</div>\n<br><strong>What You’ll Do</strong>\n<ul>\n<li>Scale the core data warehouse model</li><li>Build data models and pipelines</li> \n</ul>\n<strong>What You'll Need:</strong>\n<ul>\n<li>Experience with Hadoop, Hive, Vertica, Spark, Presto is highly desired</li><li>Strong experience developing and launching efficient and reliable ETL pipelines to move data</li><li>Strong experience creating and evolving dimensional data models &amp; schema designs to improve accessibility of data and provide intuitive analytics</li><li>Experience handling structured and unstructured data from internal and third party sources</li><li>Demonstrated ability to think strategically about business, product, and technical challenges</li><li>Experience developing scripts and tools to enable faster data consumption</li><li>Experience partnering with multiple teams in high visibility roles and owning end-to-end data solutions</li><li>Experience with ETL and business intelligence tools</li><li>Familiarity with Kimball’s data warehouse lifecycle</li><li>Experience with SQL and Hive is a must</li><li>Scripting experience with Python is highly desired</li><li>Passion and ownership over everything you ship; you'd never call code \"released\" until you’re confident it’s correct, monitored, documented, and tested</li><li>Team player. You rely on others' candid feedback for continuous improvement</li>\n</ul>\n\n<div>Be sure to check out the Uber Engineering Blog to learn more about the team.</div><div>#datavisualization</div><div><strong>About the Team</strong>\n<br><br>\nAt Uber, we have many opportunities to work with large data sets and to build essential pipelines that transform the data into insightful information. We are looking for a Data Engineer to design and build data models and pipelines to move that information across systems, and to build the next generation of tools to enable us to take full advantage of this knowledge. The engineers on this team are a critical part of making Uber's data platform successful.\n<br><br>\nYou will help scale the core data warehouse model at Uber that provides various Uber teams like Operations, Finance, Marketing, Eats, Fraud, Risk, Rider, Driver, Maps and Marketplace with accurate decision-making insights.</div>"}