{"job title": "Research Scientist 2", "company": "University of Washington", "city state": "– Seattle, WA", "rating": "4.1", "job description": "As a UW employee, you will enjoy generous benefits and work/life programs. For a complete description of our benefits for this position, please visit our website, click here. As a UW employee, you have a unique opportunity to change lives on our campuses, in our state and around the world. UW employees offer their boundless energy, creative problem solving skills and dedication to build stronger minds and a healthier world.\n<br><br>\nUW faculty and staff also enjoy outstanding benefits, professional growth opportunities and unique resources in an environment noted for diversity, intellectual excitement, artistic pursuits and natural beauty. All of which has allowed the UW to be nationally recognized as a \"Great College to Work For\" for five consecutive years.\n<br><br>\nThe Department of Family Medicine's Research Section currently has an outstanding opportunity for an 80%-100% RESEARCH SCIENTIST 2 to work with a multidisciplinary team of researchers on studies related to the health workforce and health care delivery regionally and nationally. The Research Section includes the UW Center for Health Workforce Studies (CHWS); Collaborative for Rural Primary care Research, Education, and Practice (Rural PREP); WWAMI Rural Health Research Center; Primary Care Innovation Lab (PCI-Lab); and WWAMI-region Practice and Research Network (WPRN). Our staff not only enjoys outstanding benefits and professional growth opportunities, but also an environment noted for diversity, community involvement, and intellectual excitement. The Research Section is a collegial and collaborative environment.\n<br><br>\nThe Research Scientist will work primary with UW CHWS and Rural PREP on projects that involve collaborating with lead investigators and other researchers in all phases of research, including developing and managing study work plans, drafting and managing study protocols in collaboration with a project team, obtaining Institutional Review Board reviews, collecting data and preparing it for analysis, maintaining databases, conducting analyses, and reporting findings.\n<br><br>\nThis individual may work closely with other University departments and offices, study sites and participants across the country, as well as other study staff, which will require excellent communication and collaborative skills. The Research Scientist may direct the work of staff assisting with project tasks. She or he must be able to work both independently and under the direction of study leads.\n<br><br>\nThe Research Scientist's responsibilities may include, but are not limited to the following:\n<br><br>\nCollaborating with the research team to develop, manage, and implement study work plans and protocols\n<br><br>\nCoordinating communications between team members\n<br><br>\nCoordinating the development of survey data collection instruments\n<br><br>\nAssisting in preparation of IRB applications and reviews\n<br><br>\nConducting searches and reviews of academic literature and other sources (reports, online materials, etc.)\n<br><br>\nCollecting, assembling, and maintaining research data (may involve primary quantitative and qualitative data collection, managing data collection by others on- or off-site, and assembling secondary datasets for analysis)\n<br><br>\nProgramming Web surveys using programs such as REDCap or Qualtrics\n<br><br>\nCleaning, coding and otherwise preparing data for analysis\n<br><br>\nConducting qualitative analyses under the direction of study directors and using statistical programs such as NVivo or Atlas.ti\n<br><br>\nContributing to the preparation and obtaining appropriate reviews of scholarly papers, posters, and abstracts, reports to funders, project summaries, articles and news items (such as by preparing literature reviews, drafting descriptions of study methods and findings, preparing summaries of study results for community partners and stakeholders, designing dissemination products such as posters and policy briefs, etc.)\n<br><br>\nMonitoring progress toward accomplishing project and related departmental goals\n<br><br>\nIdentifying problems and technical issues that affect project goals and timelines and identifying appropriate solutions\n<br><br>\nSoliciting input from internal and external research colleagues on study design and interpretation of study findings\n<br><br>\nProviding ideas to improve organizational efficiency at group and department levels\n<br><br>\nContributing to positive co-worker/customer/investigator relationships through efficient interaction on current grants/projects\n<br><br>\nOccasional travel\n<br><br>\n<strong>Minimum Requirements:</strong>\n<br><br>\nMaster's Degree in a health-related field.\n<br><br>\nMinimum 3 months to one year work experince\n<br><br>\nExperience conducting health services research, including topic areas such as, for example, health workforce, rural health, and/or primary care Experience conducting literature reviews\n<br><br>\nBeginner level experience collecting data using programs, such as REDCap, Qualtrics, or related programs.Beginner level experience conducting qualitative analyses using software such as NVivo, Atlas.ti, Dedoose, or related program\n<br><br>\nExcellent writing skills\n<br><br>\nProven attention to detail and proven ability to complete work on schedule Interpersonal and communication skills needed to work as a member of multidisciplinary teams\n<br><br>\nEffective time management, organizational, and project coordination skills\n<br><br>\n<strong>Desired:</strong>\n<br><br>\nExperience using geographic mapping software and creating compelling visualizations of data.\n<br><br>\n<strong>Application Process:</strong>\n<br><br>\nThe application process for UW positions may include completion of a variety of online assessments to obtain additional information that will be used in the evaluation process. These assessments may include Work Authorization, Cover Letter and/or others. Any assessments that you need to complete will appear on your screen as soon as you select \"Apply to this position\". Once you begin an assessment, it must be completed at that time; if you do not complete the assessment you will be prompted to do so the next time you access your \"My Jobs\" page. If you select to take it later, it will appear on your \"My Jobs\" page to take when you are ready. Please note that your application will not be reviewed, and you will not be considered for this position until all required assessments have been completed.<br><br>SDL2017"}