{"job title": "Computational Scientist - McCombs Institute", "company": "University of Texas M.D. Anderson", "city state": "– Houston, TX", "rating": "4.1", "job description": "The primary purpose of the Computational Scientist position is to apply bioinformatics algorithms and software tools for the analysis of high throughput omics biological and clinical data. This position is responsible for the development and application of high performance computational applications and pipelines to supportthe MD Anderson Proteomics and Metabolomics Platform research within the McCombs Institute.\n<br><br>\n<strong>KEY FUNCTIONS:</strong>\n\n\n<ul>\n<li>Supports informatics and data pipeline for Platform daily operations</li>\n<li>Troubleshoot existing data pipeline processes</li>\n<li>Maintain database and website for Platform</li>\n<li>Maintain IT software and hardware including Windows and Linux workstations and servers, Network storage, and databases.</li>\n<li>Performs data analyses</li>\n<li>Performs data analysis tasks on a variety of projects that include analysis, integration, and interpretation of proteomics, metabolomics, immunoassay, and other experimental data.</li>\n<li>Analyzes data, evaluates results, and effectively presents them to collaborators</li>\n<li>Works closely with clinical scientists to understand data processing challenges and provide custom solutions for pathway analyses, metabolomics, genomic, and proteomic data to expedite biomarker and drug discovery projects.</li>\n<li>Develops, applies, and provides bioinformatics software and computational tools to researchers.</li>\n<li>Leads improvement projects</li>\n<li>Searches literature and investigates emerging data analysis tools and technologies; recommends, schedules, develops the budget, and performs software improvements and upgrades. Presents recommendations to the McCombs team.</li>\n<li>Develops and deploys prototype algorithms and parallel processing methods.</li>\n<li>Design and improve automation pipelines for current and new data processing</li>\n<li>Consistently develops and customizes software applications according to project-specific requirements.</li>\n<li>Acts as informatics team lead for outside vendors, collaborators, and internal project teams</li>\n<li>Supervises junior software developers.</li>\n<li>Other duties as assigned.</li>\n</ul>\n\n<strong>Education</strong>\n<br><br>\nRequired: Bachelor's degree in Biomedical Engineering, Electrical Engineering, Physics, Applied Mathematics or related field.\n<br><br>\nPreferred: Master's degree in Biomedical Engineering, Medical Physics, Electrical Engineering, Physics, Signal Processing, Software Engineering, Applied Mathematics or related field.\n<br><br>\nExperience\n<br><br>\nRequired: Five years experience in scientific software development/analysis. With preferred degree three years experience required.\n<br><br>\nIt is the policy of The University of Texas MD Anderson Cancer Center to provide equal employment opportunity without regard to race, color, religion, age, national origin, sex, gender, sexual orientation, gender identity/expression, disability, protected veteran status, genetic information, or any other basis protected by institutional policy or by federal, state or local laws unless such distinction is required by law. http://www.mdanderson.org/about-us/legal-and-policy/legal-statements/eeo-affirmative-action.html"}