{"job title": "Staff Scientist", "company": "Vanderbilt University Medical Center", "city state": "– TN-Nashville", "rating": "3.6", "job description": "<div><b><u>Discover Vanderbilt University Medical Center:</u></b></div>\n<div>Located in Nashville, Tennessee, and operating at a global crossroads of teaching, discovery and patient care, VUMC is a community of individuals who come to work each day with the simple aim of changing the world. It is a place where your expertise will be valued, your knowledge expanded and your abilities challenged. It is a place where your diversity — of culture, thinking, learning and leading — is sought and celebrated. It is a place where employees know they are part of something that is bigger than themselves, take exceptional pride in their work and never settle for what was good enough yesterday. <b>Vanderbilt’s</b> mission is to advance health and wellness through preeminent programs in patient care, education, and research.</div>\n<div> </div>\n<div>Click Here To View The VUMC Promise of Discovery</div><br><br><b>JOB SUMMARY:</b><br>Assists the Principal Investigator with grant and manuscript preparation. Independently carry out and design highly sophisticated and independent experiments. Mentor and train graduate students and post doctoral fellow in developing their research projects.<br><br><br><b>KEY RESPONSIBILITIES:</b> \n<ul>\n<li>Independently oversee research projects and perform near to totally independent research.</li>\n<li>Supervise, plan, design and implement research projects</li>\n<li>Establish highly complex protocol(s); define data collection, evaluation and analysis procedures</li>\n<li>Exercise discretion and independent judgment to develop methods and procedures for operation of complex scientific equipment</li>\n<li>Supervise set-up and operation of various scientific experiments involving complex apparatus and equipment</li>\n<li>Contribute to research so as to merit serving as author or co-author on research publications, etc.</li>\n<li>Assist principal investigator in writing research grants and contract proposals</li>\n<li>Assists PI in manuscript preparation for scientific journals.</li>\n<li>Present research findings as needed</li>\n<li>Responsible for plan and coordination of literature and library searches and data collection programs</li>\n<li>Develop reports of results, graphs, charts, tables, etc. of research findings</li>\n<li>Supervise writing, reviewing and editing of various materials for publication</li>\n<li>Provide supervisory responsibility to staff</li>\n<li>Mentor and teach graduate students and post doctoral fellows in developing their projects and on specific techniques and protocols.</li>\n<li>Train and supervise technical staff, medical and graduate students</li>\n<li>Provide technical guidance to students, pos-doctoral fellows and faculty as required</li>\n<li>May provide budget responsibility</li>\n<li>Make recommendations to principal investigator regarding staff, supply and equipment needs for research projects</li>\n<li>May monitor expenditures of funds</li>\n<li>Maintain open communication between department and others</li>\n<li>Open contact as needed with principal investigator, collaborating professionals, Purchasing, Human Resource Services, Space and Facilities Planning, asset management personnel, Environmental Health and Safety, Institutional Review Board staff, administrative staff relating to budget capabilities</li>\n<li>Contact as required with sponsoring agencies and/or cooperating facilities (e.g. V.A.), collaborating professionals and vendors</li></ul>\n<p><br> </p>\n<div><b><u>VUMC Recent Accomplishments</u></b></div>\n<div>Because we are committed to providing the best in patient care, education and research, we are proud of our recent accomplishments:</div>\n<div> </div>\n<ul>\n<li>\n<div><strong>US News &amp; World Report:</strong> #1 Hospital in Tennessee, #1 Health Care Provider in Nashville, #1 Audiology (<b>Bill Wilkerson Center</b>), 12 adult and 10 pediatric clinical specialties ranked among the nation's best, #15 Education and Training</div></li>\n<li>\n<div><strong>Truven Health Analytics:</strong> among the top 50 cardiovascular hospitals in the U.S.</div></li>\n<li>\n<div><strong>Becker's Hospital Review:</strong> one of the \"100 Greatest Hospitals in America\"</div></li>\n<li>\n<div><strong>The Leapfrog Group:</strong> grade \"A\" in Hospital Safety Score</div></li>\n<li>\n<div><strong>National Institutes of Health:</strong> among the top 10 grant awardees for medical research in the US</div></li>\n<li>\n<div><strong>Magnet Recognition Program:</strong> Vanderbilt nurses are the only group honored in Tennessee</div></li>\n<li>\n<div><strong>Nashville Business Journal:</strong> Middle Tennessee's healthiest employer</div></li>\n<li>\n<div><strong>American Hospital Association:</strong><b> </b>among the 100 \"Most Wired\" medical systems in the US</div></li></ul>\n<br>Doctorate/PhD (or equivalent experience) and 2 years experience.<br><br>\n<ul><br><br><b>Physical Requirements/Strengths needed &amp; Physical Demands:</b><br><br>\n <br><br><b>Movement</b><br><br>\n<ul>\n<li>Occasional: Sitting: Remaining in seated position</li>\n<li>Occasional: Standing: Remaining on one's feet without moving.</li>\n<li>Occasional: Walking: Moving about on foot.</li>\n<li>Occasional: Lifting under 35 lbs: Raising and lowering objects under 35 lbs from one level to another</li>\n<li>Occasional: Push/Pull: Exerting force to move objects away from or toward.</li>\n<li>Occasional: Bending/Stooping: Trunk bending downward and forward by bending spine at waist requiring full use of lower extremities and back muscles</li>\n<li>Occasional: Reaching below shoulders: Extending arms in any direction below shoulders.</li>\n<li>Occasional: Handling: Seizing, holding, grasping, turning or otherwise working with hand or hands.</li></ul><br><br><b>Sensory</b><br><br>\n<ul>\n<li>Occasional: Vision: Clarity of near vision at 20 inches or less and far vision at 20 feet or more with depth perception, peripheral vision, color vision.</li>\n<li>Frequent: Noise: May include exposure to occupational noise levels which equal or exceed an 8-hr time-weighted average of 85 decibels, requiring enrollment in VUMC's Hearing Conservation Program which includes training, use of hearing protection, and periodic audiometry.</li>\n<li>Continuous: Communication: Expressing or exchanging written/verbal/electronic information.</li></ul><br><br><b>Environmental Conditions</b><br><br>\n </ul>"}