{"job title": "Data Scientist- Client Facing", "company": "Adaptive Management", "city state": "– New York", "rating": "5.0", "job description": "<u>About Us</u>\n<br><br>\nAdaptive Management is an emerging leader in data analytics that aims to fundamentally change the way people find, analyze, and acquire predictive datasets. Our cloud-based platform, DataMonster™, leverages alternative data to gain granular and real-time visibility into the fundamentals that drive companies. Our team comprises former financial investors, NSA cryptology and applied mathematics experts, and Silicon Valley software veterans. Adaptive Management is headquartered in Manhattan, New York City.\n<br><br>\n<u>The Role</u>\n<br><br>\nWe are seeking a Client Facing Data Scientist to support our data science efforts by applying data mining to client company investment techniques, performing statistical analysis, and developing cutting-edge predictive models for users of our data analytics platform, DataMonster™. He/she will be instrumental in helping us tackle interesting problems around data analysis, data visualization, big data processing, machine learning and statistical prediction. This role will report to the Chief Data Scientist.\n<br><br>\nWe are a well-funded startup offering full benefits and competitive compensation with equity. This position will be full-time. We prioritize work/life balance.\n<br><br>\n<u>Responsibilities</u>\n\n<ul>\n<li>Understand our client thesis around their investments and propose technical solutions</li>\n<li>Work with and manipulate data, customize analytical algorithms and solutions for clients, and develop analytical models into production environments</li>\n<li>Leverage data to inform decision making, risk mining, and structured and unstructured text mining methods and techniques</li>\n<li>Build and optimize classifiers using machine learning techniques</li>\n<li>Apply data visualization techniques to tell the story of the data</li>\n<li>Collaborate with software engineers and other members of the product teams in designing experiments and new features for the platform</li>\n<li>Collaborate with clients to integrate custom data science solutions into DataMonster™.</li>\n</ul>\n<u>Qualifications</u>\n\n<ul>\n<li>Master's degree in Computer Science, Statistics, Mathematics or a related field</li> \n\n<li>2+ years of experience as a Data Scientist working with complex data sets</li>\n<li>Experience programming in Python or other high-level languages</li>\n<li>Understanding of machine learning techniques and algorithms</li>\n<li>Experience with common data science toolkits and data visualization tools</li> \n\n<li>Experience applying statistical methods (distribution analysis, classification, clustering, etc.)</li>\n<li>Passion for Finance is a plus</li>\n<li>Previous startup experience a plus</li>\n</ul>"}