{"job title": "Data Scientist - III", "company": "Avacend, Inc.", "city state": "– Colorado Springs, US-CO", "rating": "1.7", "job description": "Title: Data Scientist III\n<br><br>\nLocation: Colorado Springs, CO\n<br><br>\nDuration: 6 Months Contract\n<br><br>\n<strong>No Corp. to Corp. or 3rd party Only W2 Candidates</strong>\n<br><br>\n<strong>Onsite position</strong>\n<br><br>\n<strong>Description:</strong>\n<br><br>\nDefine models and prove it with sufficient test data\n<br><br>\nWork creatively and analytically in a problem-solving environment\n<br><br>\nBenchmark systems, analyze system bottlenecks and propose solutions to eliminate them\n<br><br>\nClearly articulate pros and cons of various techniques and machine learning models\n<br><br>\nDocument use cases, solutions and recommendations\n<br><br>\nPossess excellent written and verbal communication skills\n<br><br>\nPerform detailed analysis of business problems and provide technical solutions\n<br><br>\nWork in a fast-paced agile development environment\n<br><br>\n4 Year Bachelor's degree or Master's in Computer Science preferably in Data Science\n<br><br>\nStrong experience working with Spark and Scala\n<br><br>\nStrong experience working with HortonWorks HDP or Cloudera or equivalent Hadoop distribution\n<br><br>\nProven track record of researching new ways to model financial market trends and to provide business insights\n<br><br>\nKnowledge of machine learning and statistical modelling with Rstudio\n<br><br>\nStrong background in Financial systems and business processes\n<br><br>\nBusiness Analytics experience focused on Corporate Finance is a huge plus\n<br><br>\nBackground knowledge of UNIX programming, Oracle SQL is a huge plus\n<br><br>\nExperienced in designing solutions, and implementing IT projects\n<br><br>\nThank You,\n<br><br>\nRohan Ghag\n<br>\nRecruitment Lead\n<br>\nAvacend, Inc.\n<br>\n3155 North Point Pkwy Bldg. G\n<br>\nSuite 130, Alpharetta GA 30005\n<br>\nPhone: 678-935-7308\n<br><br>\nRohan.g@avacend.com<br><br>Required Skills\n<br><br>\n<strong>Required Experience</strong>\n<br><br>\nJob Location\n<br>\nColorado Springs, US-CO\n<br>"}