{"job title": "Data Scientist - Metabolomics", "company": "Calico", "city state": "– South San Francisco, CA", "rating": "5.0", "job description": "<strong>Who we are:</strong>\n<br><br>\nCalico is a research and development company whose mission is to understand the biology of aging, and to help people to lead longer and healthier lives. We aim to combine the best biomedical science with cutting edge technology and computing. We are building a new and unique culture of true partnership between the best biomedical and computational scientists, within a company that is both a nimble startup but also has a firm financial footing.\n<br><br>\n<strong>Position description:</strong>\n<br><br>\nBiology is rapidly becoming a data science due to the exponential growth in high-quality biological and medical data. These data are transforming our understanding of biology and disease, but deriving valuable scientific insights requires careful analysis and interpretation of data done in close collaboration with computational and life scientists. Calico is seeking to expand our group of Data Scientists who are exploring diverse questions from a computational perspective; and who are developing methods which facilitate a deeper understanding of data.\n<br><br>\nAs a data scientist, you will work cross-functionally with other individual contributors within computing, as well as researchers at Calico, on collaborative research projects which may be centered around biological questions, analytical methods, or engineering.\n<br><br>\nWe are seeking an exceptional data scientist with interest and experience in metabolomics to join the team.\n<br><br>\n<strong>Position responsibilities:</strong>\n\n<ul>\n<li>Develop signal deconvolution, databasing, and fragmentation matching approaches which improve metabolite compound identification accuracy.</li>\n<li>Expand automated, internally-developed pipelines for high-throughput and deep profiling of metabolomics data.</li>\n<li>Work with experimental and computational scientists to design experiments and contributing to the analysis of the resulting data.</li>\n<li>Develop methods and visualizations which enhance insights from metabolomics, lipidomics and proteomics data.</li>\n</ul>\n<strong>Position requirements:</strong>\n\n<ul>\n<li>B.S. in Computational Biology, Chemistry, Statistics, Computer Science, or equivalent preparation and experience</li>\n<li>4+ years of experience in data analysis, including at least 2 years of hands-on work experience with real data (either in an academic environment or in industry)</li>\n<li>3+ years of experience on mass spectrometry methods development, metabolic systems biology, or cheminformatics</li>\n<li>Experience in high-quality software development, including proficiency with R (tidyverse), Python and SQL</li>\n<li>Significant experience with the application of statistical and machine learning methods, such as: regularized GLMs, Bayesian modeling, time series analysis, modern neural network architectures, and more</li>\n<li>Track record of effective cross-functional collaboration on complex projects involving people with very diverse backgrounds</li>\n</ul>\n<strong>Nice to haves:</strong>\n\n<ul>\n<li>Experience with scan-level metabolomics or lipidomics data</li>\n<li>Experience with proteomics, especially using TMT for quantification</li>\n<li>Experience with R package development and testing frameworks</li>\n</ul>"}