{"job title": "Principal Data Scientist", "company": "Concurrent Technologies", "city state": "– Arlington, VA", "rating": "4.7", "job description": "<div> \n<div> Principal Data Scientist</div>\n<br>\n<div> \n<div> Location Arlington, VA</div> <div> Job Type Information Technology</div> <div> Status</div> </div><div>At Concurrent Technologies Corporation (CTC), we are committed to assisting government, industry and nonprofit organizations achieve world-class competitiveness. In carrying out that mission, we recognize that <strong>our employees are our most important asset</strong>. Our organization has been recognized continually as an exceptional place to work. Visit us online at www.ctc.com for more information.\n<br><br>\nAre you ready to make a difference in your career and be recognized as a corporate innovator with a respected national reputation for solving complex technical challenges? Become a part of our team. CTC has an opportunity for a <strong>Principal Data Scientist</strong> at <strong>Arlington, VA</strong>.\n<br><br>\n<strong>PRINCIPAL DATA SCIENTIST</strong>\n<br><br>\n<strong>Primary Responsibilities:</strong> Concurrent Technologies Corporation (CTC) is seeking a full time Principal Data Scientist to support the United States Postal Service (USPS) Office of Inspector General (OIG).\n<br><br>\nThe selected applicant will be responsible for:\n<ul>\n <li>Discovering and interpreting data through multiple sources and techniques.</li>  <li>Working with large amounts of data with various hardware software and analytical tools</li>  <li>Combining data from different sources</li>  <li>Understanding, testing and validating data; creating analytical and visual outputs to display results; building mathematical and statistical models using the data; presenting data findings through a variety of media or communication to end users who may or may not have subject matter expertise or understanding.</li>\n</ul>\n<br><br>\n<strong>Basic Qualifications:</strong>\n<ul>\n <li>The qualified applicant must possess Bachelor of Science degree in Computer Science, Engineering, or similar field with 10 or more years of experience or a Master of Science degree in Computer Science or similar field with 5 or more years of experience in data analytics, data mining, data visualization or data management.</li>  <li>Experience with SAS Analytics, SAS Visual Analytics, Microsoft SQL Server Reporting Services (SSRS), Microsoft SQL Server Analysis Services (SSAS), Microsoft SQL Server Integration Services (SSIS), MicroStrategy Analytics, Oracle, Crystal Reports, Cognos, Informatica, or similar technologies.</li>  <li>Background with USPS Data Analytics and Data Management processes and technologies preferred.</li>  <li>Excellent communication skills are a must.</li> \n</ul>\n<br><br>\n<strong>Clearance:</strong> The candidate must be capable of obtaining and maintaining a USPS Postal Sensitive Clearance or equivalent for this position.\n<br><br>\n<strong>Join us!</strong> CTC offers exceptional career growth, corporate values, educational opportunities, and recognition for quality work. We have a competitive salary and benefits package. Qualified candidates should submit their resumes online at:\n<br><br>\nhttp://careers.ctc.com\n<br><br>\nEmail: careers@ctc.com\n<br><br>\nReference Code: <strong>SR#2018-00</strong><strong>55</strong>\n<br><br>\n“We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability status, protected veteran status, or any other characteristic protected by law.”\n<br><br>\nEOE, M/F/Disability/Vet</div></div>"}