{"job title": "Senior Computational Biologist - Biological and Statistical Modeling", "company": "Freenome", "city state": "– South San Francisco, CA, US", "rating": "5.0", "job description": "<div>\n<strong>What is Freenome?</strong></div><div>\nFreenome is a health technology company bringing accurate, accessible and non-invasive disease screenings to you and your doctor to proactively treat cancer and other diseases at their most manageable stages. Freenome is a place where you can do your best, most meaningful work, and contribute to a whole new way of thinking about curing cancer. Its a data-driven, diverse company at the intersection of biology, technology and medicine.</div><br>\n<div>\n<strong>Our Mission</strong>\n<br>\nEquip you and your family with knowledge and tools to maintain a healthier life and prevent disease.\n<br><br>\n<strong>About the Role</strong></div><div>\nThe computational biology team at Freenome plays a key role in integrating our unique laboratory technology and novel machine learning efforts by supporting assay and model development and transforming raw data into maximally useful forms for machine learning.</div><br>\n<div>\nAs a computational biologist in statistical modeling at Freenome, you will be an integral part of our R&amp;D team, working in collaboration with machine learning specialists to develop the core analysis technology driving Freenomes mission of early detection and intervention in human disease.</div><br>\n<div>\n<strong>Responsibilities</strong></div>\n\n<ul>\n\n<li>\nParticipate in cutting edge research in statistical modeling and inference of biology (including cancer research, genomics, computational biology/bioinformatics, immunology, therapeutics, and more)</li>\n<li>\nUtilize and code optimal methods to solve real world, large scale health problems</li>\n</ul><br>\n\n<div>\n<strong>What We're Looking For</strong></div>\n\n<ul>\n\n<li>\nPhD (or equivalent research experience) in computational biology, bioinformatics, cancer biology, genomics, or a related field</li>\n<li>\nExtensive experience developing statistical models in biology on large in-house or public datasets (e.g., ENCODE, TCGA, GTEx)</li>\n<li>\nDeep knowledge of statistics: significance testing (and the hazards therein), Bayes theorem, properties of basic probability distributions used in computational biology</li>\n<li>\nExperience in machine learning as applied to molecular biology: cross-validation, parametric and nonparametric regression, hierarchical modeling, ensemble learning, neural networks, and graphical models</li>\n<li>\nProficiency in at least one general-purpose programming language: Python, Java, C++, etc</li>\n<li>\nProficiency in a scientific data processing ecosystem: R, Python/Numpy, etc</li>\n<li>\nSkilled at clearly communicating scientific results with a team and working collaboratively towards next steps</li>\n</ul>\n\n<div>\n<strong>Nice to Haves</strong></div>\n\n<ul>\n\n<li>\n3+ years postdoctoral work in academia or equivalent industry experience demonstrating success in leading development projects.</li>\n<li>\nExpertise in oncology, immunology, developmental biology, or similar applied fields</li>\n<li>\nExperience working with multiple types of molecular data sets: germline DNA-seq, RNA-seq, microarrays, single-cell sequencing, metagenomics, epigenomics, etc</li>\n<li>\nExperience working with other digital biological data: mass spec, images, EHR/EMR, etc</li>\n<li>\nBench experience: youve analyzed data you generated yourself</li>\n<li>\nExperience with software engineering best practices: code quality, testing, performance optimization, development of research tools infrastructure</li>\n</ul>\n\n<br>\n<div>\n<strong>Freenomes Culture</strong></div><div>\nOur culture is simple. We value Empathy, Trust and Integrity. We feel from the perspectives of each other, patients and the communities we serve. We give each other the benefit of the doubt and believe were all working as a team towards our goals. We conduct ourselves with integrity, empowering others to grow in a collaborative environment. Freenome explicitly prohibits any form of workplace harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status.</div><br>\n<div>\n<strong>What does a successful person look like at Freenome?</strong></div><div>\nYou can prioritize, manage and execute your goals and align them to the mission of Freenome. Youre a steward of the culture and hold yourself and the team accountable. You believe hiring and mentorship are fundamental to building the organization. You bring ownership to your role, focus on your process and find the gaps to help Freenome reach its full potential. You welcome feedback and criticism knowing its value is to build people up and support each other, rather than tearing each other down.</div>"}