{"job title": "Data Scientist - Learning Measurement", "company": "Hired by Matrix, Inc.", "city state": "– Greenwood Village, Colorado", "rating": "4.5", "job description": "<strong>Job Summary</strong>\n<ul>\n<li>Our Client, an education publishing company, is seeking a data scientist with an expertise in Learning Measurement to join the Advanced Computing and Data Science Lab.</li><li>Their mission, as an R&amp;D group, is to improve the value of Company products, services and processes with innovations in machine intelligence.</li><li>The position provides the opportunity to engage in cutting-edge research on a cross-functional, AI-driven team to push the boundaries of what's possible in education and have an impact on millions of learners around the globe.</li>\n</ul>\n<strong>Responsibilities</strong>\n<br>\nIn this role, you will have the opportunity to:\n<ul>\n<li>Make pioneering educational inferences in non-traditional contexts using large amounts of data from diverse sources, including emerging content types and technology-based student interactions.</li><li>Transform large, messy data into an ongoing source of actionable intelligence.</li><li>Ideate, plan, and execute research, drawing upon the cognitive/learning sciences, psychometrics, and data science to advance the field of digital teaching and learning.</li><li>Work collaboratively with team members and other stakeholders to build functional prototypes leading to new products and businesses.</li>\n</ul>\n<strong>Qualifications</strong>\n<br>\n<strong>Minimum Education Requirement</strong>\n<ul>\n<li>Ph.D. in a quantitative field (or equivalent experience).</li>\n</ul>\n<strong>Experience</strong>\n<ul>\n<li>Solid background in mathematics and statistics.</li><li>Experience with educational measurement, specializing in one or more of the following: Item Response Theory, Bayesian Networks, Cognitive Diagnostic Models, Multilevel Models, or Intelligent Tutoring Systems. Have the ability to apply those methods in new situations.</li><li>Strong coding skills in Python and/or R. Other languages preferred.</li><li>Experience using version control and other software development tools preferred.</li>\n</ul>\n<strong>Skills</strong>\n<ul>\n<li>Interest in human cognition, teaching, and learning.</li><li>Ability to communicate effectively with both technical and non-technical stakeholders, including research scientists, software engineers, and product managers.</li><li>A knack for creative problem solving and willingness to learn new technologies and skills.</li>\n</ul>\n<strong>Please submit your resume for consideration. Once submitted, feel free to contact Rushi at 858-703-6733 for additional information.</strong>\n<br><br>\n<strong>Approx. Duration: 4 months</strong>\n<br><br>\n<strong>About Hired By Matrix</strong>\n<br><br>\nHired by Matrix, Inc. founded in 1986, is a certified Woman-Owned Business Enterprise (WBE) dedicated to providing the highest quality of job opportunities to our candidates and staffing services to our clients. We are a full service staffing firm with experience recruiting and delivering for IT, Accounting &amp; Finance, Administrative &amp; Clerical, Clinical &amp; Scientific, and Marketing disciplines. Our long history in the staffing industry and dedication to excellence are the key differentiators that have fueled our success for over 30 years.\n<br><br>\nHired by Matrix offers our contract professionals competitive salaries, benefits after 60 days and a 401k option after one year.\n<br>\nEqual Opportunity Employer\n<br>\nWBENC Certified\n<br>\nWOSB Certified\n\n\n<ul>\n<li>CEO Sharon Olzerowicz serves on the WBENC Board and is a long-standing member of the Forum Governing Group.</li>\n</ul>\n\nWe work hard to match our candidates with the right career opportunities. Let us find you a <strong>#MatrixMatch</strong> so you can reach your career goals!\n<br><br>\nConnect with us on LinkedIn and see how we can impact your career!\n<br><br>\nHired by Matrix Career Center: https://www.hiredbymatrix.com/find-work/open-positions/"}