{"job title": "Senior Medical Data Scientist", "company": "Hired by Matrix, Inc.", "city state": "– Woodcliff Lake, New Jersey", "rating": "4.5", "job description": "Job Summary\n<br>\nSenior Medical Data Scientist\n<br>\nMust have at least 5 years of clinical data review experience in Clinical Research, review protocol and CRF designs.\n<br>\nAdequate knowledge of FDA requirements in narrative writing.\n<br><br>\n<strong>Responsibilities</strong>\n<br>\nAbstracts all necessary information from CIOMS and recognize data discrepancies in Clinical Database.\n<br>\nPerforms reconciliation of safety report and clinical patient profile.\n<br>\nPost queries for relevant information from safety report to be added in the clinical database.\n<br>\nMay require narrative writing for clinical data review profile.\n<br><br>\nQuantitative analysis\n<br>\nPerforms a comprehensive review for the all SAE data but not limited to reported and coded terms.\n<br>\nCompletes brief description of clinical cases for clinical data review utilizing the auto-generated narratives.\n<br><br>\nQualitative analysis\n<br>\nEnsures all relevant information is captured in clinical database and provides quality, clinically meaningful narratives.\n<br>\nPerforms all duties according to company policy and regulations and guidance. Performs other duties assigned by the Director or Sr. Manager. No travel required.\n<br><br>\n<strong>Qualifications</strong>\n<br>\n<strong>Education</strong>\n<br>\nGraduate of adequate health care related course with commensurate experience in use of dictionaries in Clinical trial setting and have performed clinical data review.\n<br><br>\nExperience\n<br>\nMinimum of 5 years of AE/SAE data review in Clinical Research.\n<br>\nStrong knowledge of ICH guideline, or adequate background of pathogenesis of disease\n<br>\nKnowledge of INFORM, J -review is a plus and/or other Clinical trial Systems\n<br>\nProficiency on all related regulations, GCP, and Good Clinical DM Practice\n<br><br>\n<strong>Skills</strong>\n<br>\nComputer proficiency and knowledge of medical terminology\n<br>\nExpertise on use of Microsoft applications, e.g. word document, power point, excel\n<br>\nStrong oral and written communication skills\n<br><br>\nPlease submit your resume for consideration. Once submitted, feel free to contact Sanka at 646-856-8903 for additional information.\n<br><br>\nApprox. Duration: 12 months\n<br><br>\nAbout Hired By Matrix\n<br><br>\nHired by Matrix, Inc. founded in 1986, is a certified Woman-Owned Business Enterprise (WBE) dedicated to providing the highest quality of job opportunities to our candidates and staffing services to our clients. We are a full service staffing firm with experience recruiting and delivering for IT, Accounting &amp; Finance, Administrative &amp; Clerical, Clinical &amp; Scientific, and Marketing disciplines. Our long history in the staffing industry and dedication to excellence are the key differentiators that have fueled our success for over 30 years.\n<br><br>\nHired by Matrix offers our contract professionals competitive salaries, benefits after 60 days and a 401k option after one year.\n<br>\nEqual Opportunity Employer\n<br>\nWBENC Certified\n<br>\nWOSB Certified\n\n\n<ul>\n<li>CEO Sharon Olzerowicz serves on the WBENC Board and is a long-standing member of the Forum Governing Group.</li>\n</ul>\n\nWe work hard to match our candidates with the right career opportunities. Let us find you a #MatrixMatch so you can reach your career goals!\n<br><br>\nConnect with us on LinkedIn and see how we can impact your career!\n<br><br>\nHired by Matrix Career Center: https://www.hiredbymatrix.com/find-work/open-positions/"}