{"job title": "Big Data Engineer", "company": "Honeywell", "city state": "– USA-Atlanta", "rating": "3.3", "job description": "Big Data Engineer\n\n<p>Design solutions to drive safe living and quality of life</p>\n\n<div>Honeywell Connected Homes is looking for a Big Data Engineer to join the team. Join a smart, highly skilled team with a passion for technology, where you will work on design and development of our state of the art Big Data Platform. You will be an active and integral member of the Data Platform team, enhancing customer experience with widely-used home comfort, security and awareness products. You’ll be empowered to find innovative solutions in work situations; trying different and novel ways to bring opportunities and experiences to life.</div><div></div><div>Use your skill set to provide value added data driven software features to our products for our customers</div><div>Accelerate innovation and growth, teaming with the world's most talented engineers</div><div>We invite you to discover for yourself why a career with Honeywell is the opportunity you've been looking for</div><div></div><div>Honeywell Connected Homes offers you an elevated work experience, with modern and innovative workspaces, access to the latest technology to do your work, snacks and refreshments. Our offices are in the heart of Midtown in Atlanta, and exciting place to live and work with easy access to the MARTA transportation system. </div><div></div>\n\n\n\n<div> </div><div>YOU MUST HAVE</div><div>• Bachelor’s degree in Engineering or Computer Science</div><div>• 3+ years of experience in software engineering role in Agile environment</div><div>• 1+ years working with Big Data technology</div><div></div><div> </div><div>WE VALUE</div><div>• Cloud Services: AWS and Microsoft Azure</div><div>• Messaging Technologies: RabbitMQ, Kafka and Kinesis</div><div>• NoSQL Technologies: ElasticSearch and Cassandra</div><div>• Streaming data platforms – Kafka, Spark, Flink, Storm, Beam</div><div>• Knowledge of data governance, analytics and visualization</div><div>• Experience operating big data solutions at scale</div><div>• Understanding various software development lifecycle</div><div>• Demonstrate the ability to develop efficient and high quality software</div><div>• CI/CD Pipelines</div><div>• DevOps Culture</div><div>• Ability to code in multiple languages: </div><div>• JVM Languages - Java, Scala, Python</div><div>• Positive attitude, desire to learn, and willingness to try new things.</div><div>• Working well with a team</div><div>• Openness to new ideas and viewpoints, bringing diverse opinion and experiences</div><div>• Effective Communication</div><div></div>\n\n\n\nExempt\n\n\n\nCreated with SnapDesign and development on data platformStreaming Data, Data Pipeline, Data ModelingFeature DefinitionTestingINCLUDES\n\n<ul>\n <li>1st Shift</li>\n <li>Continued Professional Development</li>\n \n</ul>\n\nADDITIONAL INFORMATION\n\n<ul><li><b>Job ID: </b>req144466 </li><li><b>Category: </b>Engineering </li><li><b>Location: </b>715 Peachtree Street, N.E., Atlanta, GA 30308 USA </li></ul>\n\n<p>Honeywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, or veteran status.</p>"}