{"job title": "Data Scientist - Cloud Services", "company": "JPMorgan Chase", "city state": "– Jersey City, NJ", "rating": "3.8", "job description": "<ul>\n<li>*Who we are**</li>\n</ul>\n\nWe are a small, focused team of passionate engineers, developers, and data and business people set on using metrics from our Cloud Platforms to help understand our clients, shape our offerings? roadmaps and optimize the firm?s Cloud Infrastructure. Our goal is to partner with developers, technology leaders, and senior leadership to drive large scale organization change initiatives to deliver on the GT vision.\n<br><br>\n<strong>You will:</strong>\n<br><br>\n+ Work at the intersection of two dynamic industries ? Cloud and Big Data.\n<br><br>\n+ Interact &amp; correlate datasets from a wide array of disparate sources.\n<br><br>\n+ Develop analytics that will change the way we operate, and how Banking is done today.\n<br><br>\n_As a member of a small team, you will play a key role_ in projects executed by the Cloud Services Analytics Team. You will work closely with cloud engineers, architects and other business analysts and software engineers within Cloud Services &amp; Global Infrastructure, to help build a foundation of state-of-the-art technical and scientific capabilities to support a number of ongoing and planned data analytics projects.\n<br><br>\n+ Expertise in Database design, concepts and management\n<br><br>\n+ Build an in-depth understanding of the problem domain and available data assets\n<br><br>\n+ Research, design, implement, and evaluate machine learning approaches and models\n<br><br>\n+ Perform ad-hoc exploratory statistics /data mining tasks on diverse datasets - small scale to ?big data?\n<br><br>\n+ Participate in data architecture and engineering decision-making to support analytics\n<br><br>\n+ Take initiative in evaluating and adapting new approaches from data science research\n<br><br>\n+ Investigate data visualization and summarization techniques for conveying key findings.\n<br><br>\n+ Communicate findings and obstacles to stakeholders to help drive the delivery to market\n<br><br>\n+ Code your solutions (this is a hands-on position requiring strong programming skills)\n\n\n<ul>\n<li>*Key Requirements**</li>\n</ul>\n\n+ Core foundation &amp; understanding of cloud design fundamentals\n<br><br>\n+ Professional experience as a data scientist or a related software engineering role\n<br><br>\n+ Graduate degree (MS) in mathematics, computer science or other quantitative discipline\n<br><br>\n+ Thorough understanding of probability and statistics, Bayesian methods, time series analysis\n<br><br>\n+ Strong programming skills (in any language)\n<br><br>\n+ Expert level SQL skills\n<br><br>\n+ Experience with Data Visualization and dashboarding tools such as Tableau, Qlik or Looker\n<br><br>\n+ Great communication skills, team player, self-starter, demonstrated strong work ethic\n<br><br>\n+ Desire to use modern technologies as a disruptive influence within the Finance domain\n<br><br>\n+ Partner with other Data teams to maintain process alignment with firmwide standards\n<br><br>\n+ Assist in planning and implementation of Cloud Services KPI standards\n<br><br>\n+ Serve as liaison between business, data governance, and operations to execute data &amp; analytics requests\n<br><br>\n+ Work dynamically across many globally diverse virtual teams to deliver strategic initiatives\n\n\n<ul>\n<li>*Requirements**</li>\n</ul>\n\nExpertise in Statistics, Empirical Data Analysis, Machine Learning or Natural Language Processing\n<br><br>\n+ Experience with AWS Redshift, AWS Kinesis Data Firehose, AWS S3, AWS EMR and other AWS Big Data Offerings\n<br><br>\n+ Experience and in-depth knowledge of Python, Java, Groovy and other modern programming languages\n<br><br>\n+ Experience in a specialized statistical computing environment, preferably R and Stan\n<br><br>\n+ Experience in practical data processing, data mining, predictive modeling, text mining and information retrieval tasks\n<br><br>\n+ Demonstrated strong ability to analyze problems, communicate effectively and confidently (both verbal and written), and demonstrated influencing skills to work in cross-functional teams\n<br><br>\n+ Experience in scalable data management tools - Relational and NoSQL databases\n<br><br>\n+ Knowledge of Big Data architectures a strong plus\n<br><br>\n+ Knowledge of Python?s data analysis and machine learning libraries a strong plus\n<br><br>\n+ Certification from a big data and/or data science program (CAP,CSPA,CCP)\n<br><br>\nYour expertise in cyber, combined with your desire to provide innovative security services, will be an asset to our Cybersecurity team. Help deliver high-quality security solutions across all our lines of business around the world by creating, designing, implementing, and maintaining next-level technology. The work you?ll do is vital, as it will protect over $18 trillion of assets under custody and $393 billion in deposits every day.\n<br><br>\nWhen you work at JPMorgan Chase &amp; Co., you?re not just working at a global financial institution. You?re an integral part of one of the world?s biggest tech companies. In 14 technology hubs worldwide, our team of 40,000+ technologists design, build and deploy everything from enterprise technology initiatives to big data and mobile solutions, as well as innovations in electronic payments, cybersecurity, machine learning, and cloud development. Our $9.5B+ annual investment in technology enables us to hire people to create innovative solutions that will not only transform the financial services industry, but also change the world.\n<br><br>\nAt JPMorgan Chase &amp; Co. we value the unique skills of every employee, and we?re building a technology organization that thrives on diversity. We encourage professional growth and career development, and offer competitive benefits and compensation. If you?re looking to build your career as part of a global technology team tackling big challenges that impact the lives of people and companies all around the world, we want to meet you.\n<br><br>\nIt's time to take your career to the next level, and we can help. Apply today.\n<br><br>\nJPMorgan Chase is an equal opportunity and affirmative action employer Disability/Veteran."}