{"job title": "Research Data Scientist", "company": "Lilly", "city state": "– Indianapolis, IN", "rating": "3.8", "job description": "**42390BR**<br> <br>**Responsibilities:**<br> <br><br> <br>**Responsibilities:**<br> <br>In the highly competitive race of drug discovery, Lilly's research informatics team has combined novel techniques, simulation, analytics, and other in-silico capabilities with deep knowledge of science to discover effective and differentiated therapies in cancer, diabetes, immunology, neurodegenerative and other disease areas. This position will play a key role in the advancement of Lilly's informatics capabilities and in the discovery of novel disease targets, biomarkers and therapies.<br> <br><br> <br>**Key Objectives/Deliverables:**<br> <br><br> <br>+ Drive the discovery of novel disease targets, biomarkers and/or therapies by leveraging world-class informatics skills.<br> <br>+ Develop proof-of-concept methods/workflows in an HPC/Cloud environment.<br> <br>+ Participate as a technical/scientific lead on cross-functional research teams with members from Lilly discovery research, patient tailoring, IT and statistics.<br> <br>+ Influence and shape the informatics capabilities strategy by providing regular input to projects, specialized databases, innovative computational methods, and advances in research.<br> <br>+ Drive the evaluation of external and internal informatics platforms/services/data sources with focus on capabilities, workflows and visualizations.<br> <br><br> <br>**Req ID:**<br> <br><br> <br>42390BR<br> <br><br> <br>**Additional Skills/Preferences:**<br> <br><br> <br>+ Postdoctoral training or work experience in drug discovery research with focus on computational methods, tools and databases<br> <br>+ Experience in applying computational systems biology, integrative analysis and high dimensional data visualization approaches to facilitate interpretation and hypothesis generation, preferably in a cross-therapeutic setting.<br> <br>+ Understanding of software development in research and production environments. Familiarity with writing queries (SQL) and working with databases. Ability to take someone else's code (in any language) and make changes.<br> <br>+ Experience with Amazon S3 and EC2 or Google cloud technologies as well as with raw data management and archiving.<br> <br>+ Ability to work with minimal supervision, Innovative thinking with strong problem-solving skills, Excellent communicator with ability to communicate complex technical issues to diverse audiences.<br> <br>+ Demonstrable experience in processing, organizing, analyzing and visualizing complex data and information from disparate sources.<br> <br>+ Expertise in one or more of text and data mining, data analytics including machine learning.<br> <br>+ Programming skills in languages such as R, Python, C/C++ etc. and related informatics packages and tools.<br> <br>+ Working knowledge of Cloud and HPC environments. Experience with high performance cluster computing queuing systems such as SGE. Experience with Spotfire, .NET, NoSQL, pipelining tools (KNIME, Galaxy), computer networking, and HPC batch scheduler.<br> <br><br> <br>**Additional Information:**<br> <br><br> <br>Lilly is an EEO/Affirmative Action Employer and does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.<br> <br><br> <br>**Title:**<br> <br><br> <br>Research Data Scientist<br> <br><br> <br>**Job Category:**<br> <br><br> <br>Information Technology<br> <br><br> <br>**Basic Qualifications:**<br> <br><br> <br>+ PhD or Master's degree in computational or information sciences or related fields with 5+ years of experience in one or more of the following areas: bioinformatics, cheminformatics, computational chemistry, genomics, biochemistry, and molecular biology or related fields<br> <br>+ Qualified candidates must be legally authorized to be employed in the United States. Lilly does not anticipate providing sponsorship for employment visa status (e.g., H-1B or TN status) for this employment position<br> <br><br> <br>**Company Overview:**<br> <br><br> <br>At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 39,000 employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We?re looking for people who are determined to make life better for people around the world.<br> <br><br> <br>**City:**<br> <br><br> <br>Indianapolis<br> <br><br> <br>**Country:**<br> <br><br> <br>USA<br> <br><br> <br>**State / Province:**<br> <br><br> <br>Indiana<br> <br><br> <br>**Region:**<br> <br><br> <br>North America"}