{"job title": "Senior Data Scientist", "company": "Microsoft Corporation", "city state": "– Bellevue, WA", "rating": "4.1", "job description": "Did you ever think that two pixels could result in millions of dollars of added revenue? This was just one of the ten thousand A/B experiments that we ran last year, powered by ExP, Microsoft?s Analysis and Experimentation team. We are building a world-class experimentation platform that accelerates innovation for partners across Microsoft. The ability to experiment is credited as one of the key reasons that Bing quickly closed the gap on Google. We are now at the next phase of our mission: bring Bing?s innovation process through experimentation to the rest of Microsoft and beyond. Come and join us in the revolution!\n<br><br>\nAs a data scientist on ExP, you will spend most of your time working with partners around Microsoft with a goal of getting them to run A/B experiments at scale. You?ll work deeply with their data to establish quality and unlock insights. You?ll work with their leadership to identify the core signals that indicate success, along with the additional metrics that are leading indicators of success. You will also spend time directly with experimenters on their experiments, ensuring they are designed, executed, and analyzed correctly and in a trustworthy fashion.\n<br><br>\nAs your career grows in ExP, you will have many opportunities to expand the state of the art of experimentation, not just for ExP but for the world.\n\n\n<ul>\n<li>*Responsibilities**</li>\n</ul>\n\nAs a data scientist on ExP, you will spend most of your time working with partners around Microsoft with a goal of getting them to run A/B experiments at scale. You?ll work deeply with their data to establish quality and unlock insights. You?ll work with their leadership to identify the core signals that indicate success, along with the additional metrics that are leading indicators of success. You will also spend time directly with experimenters on their experiments, ensuring they are designed, executed, and analyzed correctly and in a trustworthy fashion.\n<br><br>\nAs your career grows in ExP, you will have many opportunities to expand the state of the art of experimentation, not just for ExP but for the world.\n\n\n<ul>\n<li>*Qualifications**</li>\n</ul>\n\n<strong>Required:</strong>\n<br><br>\n? University degree in a science, technology, engineering, or mathematics field.\n<br><br>\n? 4-8 years of industry experience in data-driven scenarios.\n<br><br>\n? Deep skill in shaping, analyzing, and combining heterogeneous data sets.\n<br><br>\n? Proficiency in writing code to assist analysis efforts and to interact with the various analysis and engineering systems in Microsoft.\n<br><br>\n? A keen curiosity to learn beyond your boundaries and teach the same.\n<br><br>\n<strong>Preferred:</strong>\n<br><br>\n? Master?s or PhD degree in a science, technology, engineering, or mathematics field.\n<br><br>\n? Experience working with big data technologies such as Hadoop and Spark.\n<br><br>\n? Ability to communicate effectively and be inclusive to partners that come from non-technology/non-scientific backgrounds as they reach experimentation scale.\n<br><br>\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form at https://careers.microsoft.com/us/en/accommodationrequest . \\#EXPDS#\n<br><br>\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work."}