{"job title": "Data Scientist - Biostatistics", "company": "Monsanto", "city state": "– Seattle, WA", "rating": "4.0", "job description": "<ul>\n<li>*Position Overview:**</li>\n</ul>\n\nThe Climate Corporation?s mission is to help the world?s farmers sustainably increase their productivity with digital tools. ?We are looking for a biostatistician with strong data analysis and modeling skills to join an interdisciplinary team of scientists. ?We apply big data and cloud computing in concert with some of the richest agronomic datasets in the world including weather data, environmental sensors, soil measurements, and disease observations as well as satellite and UAV imagery. ?You will help build robust predictive models for the spread of plant diseases and their impact on plant health, yield, and profitability, in order to help farmers make better informed management decisions. Candidates with substantially deeper experience may be hired at a more senior level. ?If you are interested in applying your skills in data wrangling and biostatistics to help farmers, The Climate Corporation would love to talk to you!\n\n\n<ul>\n<li>*What You Will Do:**</li>\n<li>Lead research projects to create curated datasets, develop new disease models, and develop statistically robust experimental designs to validate models in the real world</li>\n<li>3. Apply spatio-temporal statistics, machine learning, mechanistic models, survival analysis, natural language processing, and other approaches to continuously improve our models</li>\n<li>5. Collaborate closely with atmospheric scientists, plant pathologists, epidemiologists, physical scientists, software engineers, product managers, and designers to design and build products that delight our customers</li>\n<li>7. Mentor other scientists through direct collaboration on projects, code and paper review, and acting as a consultant as needed</li>\n<li>9. Clearly communicate program direction and results to stakeholders in various parts of the organization, including science, engineering, business strategy, and product</li>\n<li>**Basic Qualifications:**</li>\n<li>M.S. +2 years of experience or Ph.D. in biostatistics, epidemiology, or another highly quantitative applied discipline</li>\n<li>13. Applicant must demonstrate experience in applying statistical and or machine learning techniques to real-world problems</li>\n<li>15. Ability to write well-structured, easily maintainable, and well-documented code</li>\n<li>**Preferred Qualifications:**</li>\n<li>Experience with application of statistics to applied environmental or epidemiological problems</li>\n<li>19. Experience working with big, messy datasets and deriving inferences from them</li>\n<li>21. Desire to continuously improve on coding skills, including through code review with peers</li>\n<li>23. Strong drive to learn new topics and skills, to develop innovative products for our customers, and build whatever is necessary along the way</li>\n<li>25. Desire and ability to communicate and collaborate as a member of an agile, interdisciplinary team</li>\n<li>27. Problem solving skills to develop quick yet sound solutions to resolve complex issues</li>\n<li>29. Coding skills in Python, R, or similar</li>\n<li>**What We Offer: ?**</li>\n</ul>\n\nOur teams are composed of industry experts, top scientists, and talented engineers.?The environment is extremely engaging and fast-paced, with dozens of specialties coming together to provide the best possible products and experiences for our customers.\n<br><br>\nWe provide competitive salaries and some of the best perks in the industry, including:\n\n\n<ul>\n<li>Superb medical, dental, vision, life, disability benefits, and a 401k matching program</li>\n<li>33. A stocked kitchen with a large assortment of snacks &amp; drinks to get you through the day</li>\n<li>35. Encouragement to get out of the office and into the field with agents and farmers to see first-hand how our products are being used</li>\n<li>37. We take part and offer various workshops, conferences, meet-up groups, tech-talks, and hackathons to encourage participation and growth in both community involvement and career development</li>\n<li>We also hinge our cultural DNA on these five values:</li>\n<li>Inspire one another</li>\n<li>41. Innovate in all we do</li>\n<li>43. Leave a mark on the world</li>\n<li>45. Find the possible in the impossible</li>\n<li>47. Be direct and transparent</li>\n<li>Learn more about our team and our mission:</li>\n</ul>\n\nThe Climate Corporation - The Technology Behind Making A Difference\n<br><br>\nhttps: youtu.be c5TgbpE9UBI?or visit?https: climate.com careers\n<br><br>\n<strong>#LI-TD1</strong>\n<br><br>\nAt Monsanto, we value a diverse combination of ideas, perspectives and cultures. All qualified applicants will receive consideration for employment without regard to, among other things, race, religion, color, national origin, age, sex, sexual orientation, gender identity, gender expression, status as a protected veteran, or status as a qualified individual with a disability. If you need a reasonable accommodation to access the information provided on this website, please access our disability accommodations process for further assistance.\n<br><br>\nU.S. Employment Law (applicable for U.S. jobs ONLY):\n<br>\nEEO Employer Minorities/Females/Protected Veterans/Disabled. For information about equal employment opportunity rights, please refer to this information from the U.S. federal government: EEOC Poster; EEOC Supplement."}