{"job title": "Data Scientist, NSW", "company": "Nokia", "city state": "– Pembroke Pines, Florida, United States", "rating": "4.1", "job description": "<div><div><div><div><div><em>Nokia is a global leader in the technologies that connect people and things. With state-of-the-art software, hardware and services for any type of network, Nokia is uniquely positioned to help communication service providers, governments, and large enterprises deliver on the promise of 5G, the Cloud and the Internet of Things. Serving customers in over 100 countries, our research scientists and engineers continue to invent and accelerate new technologies that will increasingly transform the way people and things communicate and connect.</em>\n<br><br>\nNSW (Nokia Software)\n<br><br>\n<strong>Job Position Summary Description:</strong>\n<br><br>\nThe role of the Data Scientist is to work on the conception, design, development of analytical models and algorithms in the areas of machine learning, statistics and optimization of Nokia networks and systems with assets and resources participating in networks.\n<br><br>\nThe work includes the creation of both prototype “proof of concept” models to prove out specific technologies and algorithms as well as production models. In addition, the Data Scientist will provide general analytical advice and inputs to the professional services, product management and engineering organizations.\n<br><br>\n<strong>Key Responsibilities / Functions:</strong>\n\n<ul>\n<li>Develop and Apply state-of-the-art algorithms for large scale stochastic optimization, predicting failure times and other machine learning technologies like deep learning, signal processing and to build and validate algorithms that satisfy specific customer requirements</li>\n<li>Some travel to customer sites is required to capture requirements, give demos, support projects and customer account teams. Input to technical sections of RFP/RFI responses is also required.</li>\n<li>The Data Scientist will also own the technical roadmap for analytic functionality in specific areas.</li>\n</ul>\nLocation: Candidate should be located in: San Jose, CA; Austin, TX; Ottawa, CA.<br>\n<div><strong>Required Qualifications: (Education, Technical Skills/Knowledge)</strong>\n\n<ul>\n<li>At least 3 years of experience in a relevant role</li>\n</ul>\n<strong><u>Education Required</u></strong><u>:</u>\n<br><br>\n<ul>\n\n<li>An advanced degree in statistics, physics, operations research, computer science or applied mathematics at Master's degree but Phd is a plus.\n<br><br>\n<strong>General</strong></li>\n</ul>\n\n\n<ul>\n\n<li>Extensive experience solving analytical problems using quantitative approaches</li>\n<li>Comfortable manipulating and analyzing complex, high-volume, high-dimensionality data from varying sources</li>\n<li>Ability to communicate complex quantitative analysis in a clear, precise, and actionable manner</li>\n<li>A strong passion for empirical research and for answering hard questions with data</li>\n<li>Business skills to build the algorithms necessary to find the right answers</li>\n<li>A flair for presenting complex results in a visual and intuitive manner</li>\n<li>Ability to abstract models across very different industries and formulate repeatable models</li>\n<li>Ability to work in a fast-paced multidisciplinary environment</li>\n<li>Ability to work both autonomously and in a team\n<br><br>\n<strong></strong>\n<br><br>\n<strong>Technical</strong></li>\n</ul>\n\n\n<ul>\n\n<li>Strong skills in Python, and/or R and/or Scala</li>\n<li>Proficiency in Java or C# (or Mono, or C++), SQL</li>\n<li>At least 2 years of experience building and applying predictive modeling in real-world use cases</li>\n<li>At least 2 years of experience in solving large scale mathematical programming / operations research problems</li>\n<li>Strong Statistical, mathematical, predictive modeling, machine learning skills</li>\n<li>Exposure to big data systems and methodologies\n<br><br>\n<strong>Desired Qualifications: (Education, Technical Skills/Knowledge)</strong>\n<br><br>\n</li>\n<li>Domain experience in building models for transportation, supply chain, scheduling, vehicle routing is a plus</li>\n<li>Exposure to deeplearning frameworks a plus</li>\n<li>Experience in large scale optimization and meta heuristics a plus</li>\n<li>Experience in applications of computer vision a plus</li>\n\n</ul>\nNokia is an equal opportunity employer that is commited to diversity and inclusion. At Nokia, employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law.</div>\n </div>\n</div>\n </div>\n </div>\n</div>\n<br>"}