{"job title": "Senior Scientist, Oncology Bioinformatics", "company": "AstraZeneca", "city state": "– US - Waltham - MA", "rating": "3.8", "job description": "<strong>Senior Scientist, Oncology Bioinformatics</strong> (Waltham, MA, USA or Cambridge, UK)\n<br><br>\nAstraZeneca is a global biopharmaceutical company driven by what science can do. We are dedicated to discovering, developing, and delivering innovative, meaningful medicines and healthcare solutions that enrich the lives of patients. The vision of AstraZeneca Oncology is to redefine cancer, redefine our solutions to cancer, and restore patients' lives. To achieve this, we have an exciting and diverse portfolio combining agents targeting tumor cell drivers/dependencies and the tumor microenvironment and immune response.\n<br><br>\nThe Oncology Bioinformatics group work within cross-disciplinary drug project teams throughout the discovery and translational pipeline, driving new target discovery, pre-clinical and clinical research. The global group spans the UK Cambridge and US Boston sites, including graduate students and post-docs.\n<br><br>\nExcitingly the group is expanding and diversifying to rise to the new challenges of oncology and harness the fuller potential of data science for our portfolio. We are generating clinical and pre-clinical multi-omic data sets to advance precision medicine and drive a new generation of cancer targets. In this position, you will have the opportunity to push the boundary of science to deliver life-changing medicines for cancer patients.\n<br><br>\n<strong>Main Duties and Responsibilities</strong>\n<ul>\n<li>Work as part of drug project bioscience and translational science teams to understand their scientific and technical challenges and identify where bioinformatics can best impact.</li><li>Discover and develop new molecular targets, mechanisms and biomarker hypotheses.</li><li>Design, code and/or apply innovative algorithms, workflows and visualizations to generate actionable biological insight:\n\n<ul>\n<li>Discover new ways to find meaningful patterns in complex data.</li><li>Integrate and interpret proprietary and public patient and in vitro/vivo model data spanning multiple molecular and phenotypic platforms.</li></ul></li>\n<li>Proactively engage in knowledge sharing and peer support, including train our bench science community in the tools critical to understanding their data.</li><li>Collaborate with industry and academia, and exploit external resources, to find the most effective solutions to problems.</li>\n</ul>\n<strong>Essential Requirements</strong>\n<ul>\n<li>PhD or equivalent in the related fields.</li><li>Deep understanding of the molecular drivers of human diseases.</li><li>Extensive experience of data analysis and interpretation of either:\n\n<ul>\n<li>NGS data characterization of human disease</li><li>Transcriptomics for signaling deconvolution/inference</li><li>Proteomics, metabolomics or epigenetics</li></ul></li>\n<li>An enthusiasm to explore non-traditional approaches to bring big data together in biologically meaningful ways.</li><li>R and/or Python programming expert (working in Unix and Windows environments).</li></ul>\n\n<ul>\n<li>A solid understanding of statistical and mathematical principles for biological data analysis.</li></ul>\n\n<ul>\n<li>Skilled in effective communication of complex data and methods to a non-expert.</li>\n</ul>\n<strong>Next Steps – Apply today!</strong>\n<br><br>\nTo be considered for this exciting opportunity, please complete the full application on our website at your earliest convenience – it is the only way that our Recruiter and Hiring Manager can know that you feel well qualified for this opportunity.If you know someone who would be a great fit, please share this posting with them.\n<br><br>\nAstraZeneca is an equal opportunity employer.AstraZeneca will consider all qualified applicants for employment without discrimination on grounds of disability, sex or sexual orientation, pregnancy or maternity leave status, race or national or ethnic origin, age, religion or belief, gender identity or re-assignment, marital or civil partnership status, protected veteran status (if applicable) or any other characteristic protected by law. AstraZeneca only employs individuals with the right to work in the country/ies where the role is advertised.\n<br><br>\n<strong>Date Posted</strong><br><br>05-Sep-2018<br><br><strong>Closing Date</strong>"}