{"job title": "Sr. Research Scientist, Bakery", "company": "Campbell Soup Company", "city state": "– Norwalk, CT", "rating": "3.2", "job description": "Imagine...working for a company that knows that its people are the key to its success in the marketplace. A company in which achieving extraordinary results and having a stimulating work experience are part of the same process.\n<br><br>\nWe cultivate and embrace a diverse employee population. We recognize that people with diverse backgrounds, experiences and perspectives fuel our growth and enrich our global culture.\n<br><br>\nWe are looking for an individual who enjoys working in a fast-paced, team oriented environment, likes to be challenged, and values the opportunity to make a difference.\n<br><br>\n<strong>General Summary:</strong>\n<br><br>\nThe Senior Research Scientist is responsible for the coordination and execution of product development efforts for Bakery initiatives, encompassing fresh bread, buns, rolls, frozen cakes, puff pastry and turnovers. The scope of this opportunity includes innovation, new products, line extensions, cost savings, alternate supplier qualifications and quality improvements. Incumbent is responsible for ensuring that objectives, budget and timelines are met. The incumbent must demonstrate strong interpersonal and project management skills and the ability to influence decisions within the cross functional team (Marketing, Operation Engineering, Manufacturing, QA, Process Development and Package Development) and externally with partners (suppliers, R&amp;D houses, co-manufacturers). Incumbent must be capable of assuming a Technical Leadership role and execute projects per the Stage-Gate process with the support of other functions. The Senior Research Scientist is expected to possess and demonstrate a solid understanding of food science, the business, operations and the commercialization processes. The Senior Research Scientists approach should include a practical application and modification of existing products/new technologies or the identification and innovative creation of new and unique products which achieve business goals. This position is a hands on personal contributor position that may manage a technician. The Senior Research Scientist responds resourcefully to new demands and challenges throughout the product development &amp; commercialization process (including bench, pilot plant, and plant trials to create prototypes for consumer testing, etc.) and implements best practices. The Senior Research Scientist provides technical specifications and support to assure smooth rollouts of new products and processes during plant start-ups. This includes the provision of comprehensive process documentation to enable smooth commercialization and training of plant personnel. The Senior Research Scientist must support an environment that fosters innovation and calculated risk taking.\n<br><br>\n<strong>Primary Responsibilities:</strong>\n<br><br>\n+ Leads the identification, assessment and validation of recipes from bench-top through commercialization. This includes managing the financial aspects of product development including ingredient costs for plant trials\n<br><br>\n+ Insures all proper documentation is done accurately and on schedule\n<br><br>\n+ Conducts and leads assessment and capability studies, product startups/commercialization and provides on-site support to Plant Operations for new products, cost savings and quality programs\n<br><br>\n+ Fosters an innovation culture in Pepperidge Farm by continually introducing new ideas and product concepts for new products, quality improvements, and productivity.\n<br><br>\n+ Creates, designs, supervises the development of new experimental protocols/best practices required to validate product concepts and prototypes.\n<br><br>\n+ Independently directs the activities of outside vendors including ingredients and services.\n<br><br>\n<strong>Job Complexity:</strong>\n<br><br>\n+ Ability to interact and communicate effectively with Senior Management as well as Plant Management\n<br><br>\n+ Must be a good problem solver; able to identify, interpret and analyze the correct data, and provide detailed direction to development projects\n<br><br>\n+ Active knowledge and understanding in areas beyond Product Development including Process in Commercial Bakery, QA, Project Engineering and thorough understanding of Marketing needs and financial hurdles\n<br><br>\n+ Sustain a high level of competence and professionalism in a dynamic business environment\n<br><br>\n+ Easily adapts to changing priorities\n<br><br>\n<strong>Minimum Requirements:</strong>\n<br><br>\n+ B.S. Food Science or Bakery Science degree (M.S. preferred); Has commercialized bakery products.\n<br><br>\n+ 4-10 years of related experience in a CPG company, or CPG ingredient supplier with bakery emphasis; experience with bread baking unit operations is preferred. Experience in rolls, artisan breads, pasta, doughs, cakes and other baked goods is also relevant.\n<br><br>\n+ Excellent analytical skills, strong attention to detail, good communication and interpersonal skills\n<br><br>\n+ Ability to handle and lead multiple projects at any given time in a team environment\n<br><br>\n+ Passion for food science, product development and consumers as it relates to innovation for new products, line extensions, and cost savings opportunities.\n<br><br>\n+ Ability to think beyond his or her own (R&amp;D) function to consider the organization holistically.\n<br><br>\n+ Travel 40%\n<br><br>\n<strong>Working Conditions:</strong>\n<br><br>\n+ Norwalk, CT office based (Travel 40%)\n<br><br>\n<strong>?</strong>\n<br><br>\nThe Company is committed to providing equal opportunity for employees and applicants in all aspects of the employment relationship, without regard to race, color, sex, sexual orientation, gender identity, national origin, citizenship, marital status, veteran status, disability, age, religion or any other classification protected by law.\n<br><br>\nIn that regard, U.S. applicants and employees are protected from discrimination based on certain categories protected by Federal law. Click here for additional information."}