{"job title": "Research Scientist, Analytical R&amp;D", "company": "Chicago Search Group", "city state": "– - NC", "rating": "4.6", "job description": "<div><div>Location\n<br>\nNC</div><br>\n\n<div>Job Type\n<br>\nDirect Hire</div><br>\n\n <div>Date\n<br>\nSep 05, 2018</div>\n<br>\n <div>Job ID\n<br>\n2601526</div></div><br>\n\n<div>\n<div>\nSummary\n<br>\nWe are currently accepting resumes for the position of Research Scientist in Analytical R and D/Methods Development and Validation.\n<br>\n<strong>Responsibilities</strong>\n\n<ul>\n <li>Must be fully capable of developing analytical methods based on experience, literature search, etc.</li> <li>Design, develop, conduct and/or review experiments including method development and method</li> <li>transfer; perform methods validations utilizing typical instrumentation including but not limited to LC,</li> <li>MS, GC, etc.</li> <li>Interpret data from routine and non-routine analyses in order to develop workable test methods</li> <li>and/or deduce and test mechanistic or systematic hypotheses;</li> <li>Familiarity with other instrumental methods (IR, NMR, XRPD, TGA, KF, etc.) as well as non-</li> <li>instrumental methods (wet chemical methods);</li> <li>Perform data audits in order to ensure accuracy of data and analytical processes;</li> <li>Act as scientific, regulatory, technical or quality expert and consultant by responding to targeted</li> <li>questions from and providing support to customers;</li> <li>Provide leadership including cross-training and technical development to the GMP Analytical laboratory colleagues;</li> <li>Organize workflow and tasks to maximize laboratory efficiency (e.g., prioritize sample analysis, manage/assign tasks, preventative maintenance);</li> <li>Maintain laboratory equipment and instrumentation (e.g., troubleshooting, conducting preventative maintenance, calibrating and repairing);</li> <li>Participate in the laboratory quality system activities such as internal audits, writing standard operating procedures, and documentation review;</li> <li>Prepare samples for analysis and record data from analyses or experiments in a computer, log book, or laboratory notebook;</li> <li>Ensure compliance with company policies and SOPs as well as FDA and other applicable guidelines. The successful candidate will hold a PhD or MS in Chemistry (or closely related discipline) with 7-10 years relevant experience, or a BS degree with 12+ years relevant experience, having a broad background, strong comprehension, and demonstrated skills in the analytical methods validation/development areas. Aptitude in the area of Project Management is also a strong positive. A minimum of 7-10 years of relevant background in a cGMP-compliant pharmaceutical laboratory environment is required for consideration. In-depth work experience in an analytical contract laboratory environment is a strong positive. Experience in stability study performance/evaluation is helpful. Demonstrated project management skills is also a strong positive. Expertise in USP/compendial testing is vital. Excellent verbal and written communication/interpersonal skills, problem-solving skills, organizational skills, and the ability to work in a diverse team environment are essential. Proficiency with Microsoft software (Word / EXCEL / PowerPoint) is expected. The company offering parallels the drug discovery process and provides significant advantages at each step from lead discovery to lead optimization, chemical synthesis and scale-up of pharmaceutical intermediates as well as chemical process R&amp;D.</li></ul></div>\n</div>\n\n<br>"}