{"job title": "Materials Scientist", "company": "Headway Technologies", "city state": "– Milpitas, CA", "rating": "2.8", "job description": "Materials Scientist<br><br><strong>FLSA Status:</strong> Exempt\n<br><br>\n<strong>Reports To:</strong> Sr. Director of Wafer Characterization\n<br><br>\n<strong>Req#:</strong> 18-001\n<br><br>\n<strong>Summary</strong>\n<br>\nUnder the direction of the Sr. Director of Wafer Characterization, the Materials Scientist performs the materials and physical characterization of development and product devices; designs and conducts experiments using Dual Beam and XRD, analyzes results, summarizes findings, and makes recommendations regarding future impact to current processes or materials in development such as recording heads, HDD wafers, MRAM, or other devices. This position is located in Milpitas, California.\n\n<ul>\n\n <strong>Essential Functions</strong>\n\n<li>Performs the materials and physical characterization of development and product devices</li>\n<li>Designs and conducts experiments using Dual Beam, SEM, and XRD systems</li>\n<li>Uses Dual Beam to perform TEM sample preparation using both in-situ and ex-situ methods</li>\n<li>Works to continuously improve current or future materials or processes by reviewing and monitoring sample data, summarizing findings, and recommending corrective action</li> \n\n<li>Proactively responds to issues related to materials quality or the characterization process and initiates resolution</li>\n<li>Reviews and analyzes data, creates reports, and presents findings to panels, groups, teams, or departments as required</li>\n<li>Trouble shoots issues and coordinates the repair of equipment/tools as needed</li>\n<li>Interacts and responds to inquiries from other product groups regarding process-related issues and product or device requirements</li> \n\n<li>Adheres to all safety policies and procedures as required</li> \n\n<li>Performs other duties of a similar nature or level</li> \n</ul>\n\n<ul>\n\n <strong>Minimum Qualifications</strong>\n\n<li>Master’s degree in Materials Science, Chemical Engineering, or Physics, and/or equivalent relevant experience; PhD preferred</li>\n<li>Five years of hands on experience working in the magnetic recording head or semiconductor industry using Crystallography, Diffraction, Dual Beam, SEM, XRD, and EDS</li> \n\n<li>Knowledge of (S)TEM preferred</li>\n<li>Proficient in the use of Microsoft Office Applications</li> \n</ul>\n\n<ul>\n\n <strong>Required Knowledge, Skills, and Abilities</strong>\n\n<li>Proficient in the knowledge and operation of Dual Beam, SEM, XRD, XRR, and EDS; knowledge of (S)TEM preferred</li>\n<li>Knowledge of semiconductor or HDD industry principles, practices, and techniques</li>\n<li>Knowledge and ability to prepare samples, conduct experiments, interpret complex data, and recommend correction action</li>\n<li>Knowledge and ability to use Microsoft Office applications to create spreadsheets, Word documents, and presentations</li>\n<li>Able to independently create reports, presentations, and written analysis summaries</li>\n<li>Strong ability to communicate effectively, both verbally and in writing, with all levels of contractors, consultants, employees, and management</li>\n<li>Able to work productively and collaboratively with all levels of employees and management</li> \n\n<li>Able to comply with all safety policies and procedures</li> \n\n<li>Demonstrated ability to understand and carryout complex instructions given verbally or in writing</li>\n<li>Demonstrated organizational and time management skills</li>\n<li>Demonstrated problem-solving and trouble shooting skills</li>\n<li>Flexible and able to prioritize</li> \n</ul>\n<strong>Working Conditions</strong>\n<br>\nThe Materials Scientist works primarily in a laboratory environment from Monday to Friday. The schedule may be altered from time-to-time to meet business or operational needs; may travel from building-to-building as needed. Spends a majority of time in a seated position, but occasionally stands and walks; performs various fine grasping movements, bends, and twists; operates a computer and enters information using a keyboard, operates a telephone, and other office equipment. May occasionally be required to push, pull, or lift up to 10 pounds.\n<br><br>\n* Other duties of a similar nature or level are duties that may be required, but may not be specifically listed in the job description or posting.\n<br><br>\nTDK/Headway Technologies, Inc. provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to\n<br>\n race, color, religion, sex, national origin,age, disability,orgenetics. Applicants requiring accommodation in order to complete the application process\n<br>\n should contact Susan Rowatt, Staffing and Compensation Manager, at susan.rowatt@headway.com.\n<br><br>\nAll interested applicants should submit their resume to jobs@headway.com."}