{"job title": "Data Analytics Platform Developer", "company": "JPMorgan Chase", "city state": "– New York, NY", "rating": "3.8", "job description": "J.P. Morgan is a premier corporate and investment bank with a full suite of global financial services and capabilities. The world?s most important corporations, governments, financial institutions, pensions, sovereign wealth organizations, states and municipalities entrust us with their business in more than 100 countries. We offer strategic advice, lend money, raise capital, help manage risk, extend liquidity, buy and sell securities and provide many other banking services in markets around the world.\n<br><br>\nWe are a global, centralized team of data scientists, engineers and developers within the Corporate &amp; Investment Bank, focused on applying emerging and established techniques to find new growth opportunities, drive efficiencies in our businesses, improve risk management and better serve our clients and markets.\n<br><br>\nOpportunity to innovate and drive measurable commercial value in an industry that is being transformed by machine learning/AI\n<br><br>\nCollaborate with a highly skilled and passionate team of data scientists with diverse experiences (technology, finance, academia)\n<br><br>\nDevelop and engineer proprietary and open-source technologies with a team of really good technologists\n<br><br>\nAt JPM we are making significant investments in AI and machine learning across our lines of businesses. We see this as critical to our future success and as such we have assembled a team of world class scientists to work on these projects. To succeed in these endeavors however, we need more than scientists. We need software developers, engineers and devops to make sure that we can develop and deploy models at scale.\n<br><br>\nOne of our key roles is that of platform GUI developer. The platform provides the data scientist with the tools and utilities that the need to be effective in all stages of the model development lifecycle. In order to deliver functionality that scientists need, platform developers interact often with the scientist and developer community to ensure that we are delivering value. The role of the GUI developer is to ensure that our users have the best possible experience with our platform. Projects will span application UI development, reporting tooling and model results visualization.\n<br><br>\nAs a member of the platform group you will dive head-first into creating innovative solutions that advance businesses. You?ll join an inspiring and curious team of technologists dedicated to improving the design, analytics, development, coding, testing and application programming that goes into creating high quality software and models. And best of all, you?ll be working with and sharing ideas, information and innovation with our global team of technologists from all over the world.\n<br><br>\nKey Requirements\n<br><br>\n+ Higher degree in computer science or engineering\n<br><br>\n+ Ability to collaborate with high-performing teams and individuals throughout the firm to accomplish common goals\n<br><br>\n+ Proficiency in one or more general purpose programming languages Java, C++, C#, or Python\n<br><br>\n+ Understanding of software skills such as business analysis, development, maintenance and software improvement\n<br><br>\n+ Communicate advanced technical design and solutions to a technical and non-technical audience\n<br><br>\n+ Developing solutions at scale to the biggest problems facing developers, production management and cyber within the CIB\n<br><br>\n+ An aptitude to pick up new subjects like machine learning and analytics\n<br><br>\n+ Ability to design, code and deliver production ready micro services\n<br><br>\nJPMorgan Chase is an equal opportunity and affirmative action employer Disability/Veteran."}