{"job title": "Algorithms Research Scientist - FaST", "company": "KLA-Tencor", "city state": "– Milpitas, CA", "rating": "3.7", "job description": "<strong>Company Overview</strong>\n<br><br>\nCalling the adventurers ready to join a company that's pushing the limits of nanotechnology to keep the digital revolution rolling. At KLA-Tencor, we're making technology advancements that are bigger—and tinier—than the world has ever seen.\n<br><br>\nWho are we? We research, develop, and manufacture the world's most advanced inspection and measurement equipment for the semiconductor and nanoelectronics industries. We enable the digital age by pushing the boundaries of technology, creating tools capable of finding defects smaller than a wavelength of visible light. We create smarter processes so that technology leaders can manufacture high-performance chips—the kind in that phone in your pocket, the tablet on your desk and nearly every electronic device you own—faster and better. We're passionate about creating solutions that drive progress and help people do what wouldn't be possible without us. The future is calling. Will you answer?\n<br><br>\n<strong>Group/Division</strong>\n<br><br>\nThe Film and Scatterometry Technology (FaST) Division provides industry leading metrology solutions for worldwide semiconductor IC manufacturers. The FaST Division portfolio of metrology products includes hardware and software solutions for optical film thickness, optical critical dimension (CD), composition, and resistivity measurement systems. These products are essential for the IC manufacturers as they provide critical metrology capabilities for the development and implementation of their advanced IC processes. The FaST division is committed to support our customers to achieve performance entitlement of our solution and we effectively partner with our customers from their early research and development phase to the high volume in-line manufacturing implementation specific for their process needs. The division consists of a global team located in US, Israel, China, and India.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nDevelop the next generation of algorithms for semiconductor device and thin film metrology. The position requires a proven innovative track record in the related fields of algorithm development, statistical data analysis and signal processing, image analysis and machine learning. The candidate should have a background in engineering/math/physics and be comfortable and conversant in a range of disciplines from optics, information and noise analysis, solving optimization problems (forward and inverse).\n<br><br>\nThe Algorithms Scientist will produce mathematical formulations, develop modeling tools, and perform data analysis and capability predictions on a variety of metrology technologies. The role will closely interface with other members of Advanced Development, Engineering, Algorithm and Application teams. The candidate should demonstrate ability to develop complex data analysis algorithms, software codes that can be used by others, understanding of experimental data analysis, and ability to guide others.\n<br><br>\n<strong>Preferred Qualifications</strong>\n<br><br>\nEducation or experience must include:\n\n<ul>\n\n\t\n<li>\n Designing, developing, modifying and diagnosing complex algorithms, utilizing C#, C++, R, Matlab or other tools and languages;</li>\n<li>\n Ability to invent, develop and implement new algorithms and ideas</li>\n<li>\n Matlab, Linear Algebra, Data Visualization</li>\n<li>\n Advanced optimization topics including compressive sensing and regularization</li>\n<li>\n Level Set and Implicit Surface methods</li>\n<li>\n Distributed and Parallel Computation methods</li>\n<li>\n Statistical analysis, modeling and optimization methods</li>\n<li>\n Signal and image processing, computer vision and machine learning</li>\n<li>\n Hands-on experience in object-oriented and functional programming</li>\n<li>\n Hands-on experience with products such as JMP, R, Matlab is a plus</li>\n<li>\n Excellent written and verbal communication skills.</li>\n<li>\n Ability to work both independently and in a team environment.</li>\n<li>\n Semiconductor optical metrology experience preferred.</li>\n</ul>\n<strong>Minimum Qualifications</strong>\n<br><br>\nDoctorate (Academic) with at least 2 years of experience.\n<br>\n<strong>OR</strong>\n<br>\nMaster's Level Degree with at least 4 years of experience.\n<br>\n<strong>OR</strong>\n<br>\nBachelor's Level Degree with at least 5 years of experience.\n<br><br>\n<strong>Equal Employment Opportunity</strong>\n<br><br>\nKLA-Tencor is an Equal Opportunity Employer. Applicants will be considered for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristics protected by applicable law."}