{"job title": "Senior Scientist, Biomolecular Interactions", "company": "Merck and Co.", "city state": "– Boston, MA", "rating": "3.7", "job description": "We are seeking a highly motivated senior scientist to join our Biomolecular Interactions team within the Protein Sciences organization at our research division in Boston. The qualified candidate will be responsible for the development of fit-for-purpose binding assays with an array of technologies to characterize the binding activity, epitope specificity, cross reactivity, and quality of various protein antigens and biologics including but not limited to antibodies, bi-specifics, Fc-fusions, and receptors. Other responsibilities include developing new technologies, performing protein conjugations and limited biophysical characterization assays, managing multiple projects and workflows, communicating results in reports and presentations to project team stakeholders, and participation in cross-functional and/or cross-site teams.\n<br><br>\nQualifications\n<br><br>\nEducation Minimum Requirement:\n<br><br>\nBachelors degree in biomedical sciences/engineering or related discipline with 5+ years of relevant lab experience, M.S. degree with 3-5 years of experience, or PhD in a related field.\n<br><br>\nRequired Experience and Skills:\n<br><br>\nHands on experience with Biacore or other biosensor platforms (ForteBio, Carterra) assay development and data interpretation of protein:ligand interactions\n<br><br>\nExperienced user of data analysis software such as GraphPad Prism or MS Excel\n<br><br>\nDemonstrated ability to independently develop assays, design experiments, critically review data, and troubleshoot assays\n<br><br>\nPreferred Experience and Skills:\n<br><br>\nHands on experience with ELISA, Microscale Thermophoresis, or KinExA assays development\n<br><br>\nHands on experience with protein conjugation techniques, SDS-PAGE, western blotting, and protein quantification\n<br><br>\nExperience with automated liquid handling systems\n<br><br>\nExperience using flow cytometry and FACS\n<br><br>\nExperience with Spotfire (highly desired"}