{"job title": "Research Scientist II", "company": "Parsons Corporation", "city state": "– Aberdeen, MD", "rating": "3.4", "job description": "Research Scientist II\n<br><br>\n<strong>Location:</strong>\n<br><br>\nAberdeen, Maryland, United States\n<br><br>\n<strong>Requisition #:</strong>\n<br><br>\n<strong>52396</strong>\n<br><br>\n<strong>Post Date:</strong>\n\n\n<ul>\n<li>*Research Scientist II**</li>\n</ul>\n\nAberdeen\n<br>\nProving Ground, MD\n<br><br>\nAre you an experiencedResearcher who\n<br>\nthrives in a fast-paced environment working with teams in a support role?\n<br>\nImagine yourself working on top level critical network defense missions alongside other seasoned professionals.\n<br>\nParsons is now hiring top Research Scientists with a passion for innovation and solving mission critical challenges.\n<br><br>\nParsons' extensive experience in this field, combined with your technical\n<br>\nknowledge, will propel your career forward. Training, mentorship and the\n<br>\nopportunity for advancement will keep you engaged and challenged. We need our\n<br>\nresearchers to be versatile, display leadership qualities and be enthusiastic\n<br>\nto tackle new challenges.\n<br><br>\nIf you are passionate about science and engineering, this is your chance to\n<br>\njoin in Parsons' team supporting the Army Research Laboratory at Aberdeen\n<br>\nProving Ground, MD.\n<br><br>\nCandidate will work with a team to investigate programmable networks in the\n<br>\ncontext oftactical mobile computing\n<br>\nplatforms. Study programmable networks, classical and\n<br>\nquantum, as an enabler for adaptive computing, especially using simulations to\n<br>\nanalyze network performance, understand algorithms, understand hardware\n<br>\nperformance, and to understand the effects of computational complexity on\n<br>\nalgorithm and network performance. Examples of network simulation environments\n<br>\nthat may be used are the open source Network Simulator 3 (NS-3), the Army tool\n<br>\nEMANE, and Mininet. Conduct algorithm testing in MATLAB in its virtual network\n<br>\nenvironment before deploying algorithms in a more realistic simulation\n<br>\nenvironment using higher fidelity network and environment representations.\n<br>\n(Experience with NS-3, EMANE or Mininet is not required.)\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\n+ Implementand test algorithms in MATLAB\n<br><br>\n+ Incorporate algorithms in a generalized code and optimizealgorithm performance\n<br><br>\n+ Conduct network simulations to assess algorithm performancein a more physically realistic environment\n<br><br>\n+ Run hardware simulations to understand performance impact ona network\n<br><br>\n+ Conductcompiler simulations to understand computational complexity\n<br><br>\n+ Assess thelimitations of the MATLAB network environment\n<br><br>\n+ Customize software solutions to meet research and analysisobjectives\n<br><br>\n+ Perform basic analytics on simulation data\n<br><br>\n+ Prepare and present\n\n\n<ul>\n<li>*Qualifications:**</li>\n</ul>\n\n+ Bachelors' degree in Engineering, Computer Science, Mathematics or related field; Master?s degree preferred\n<br><br>\n+ At least 2 years of related professional experience withone or more of C++, Java, Python programming languages required\n<br><br>\n+ Experience with MATLAB a plus\n<br><br>\n+ Experience with machine learning, such as the Tensorflow framework, a plus\n<br><br>\n+ Good written and verbal communication skills\n<br><br>\n+ Due to the sensitivity of customer related requirements, U.S. Citizenship is required.\n<br><br>\n+ Applicants selected for employment will be subject to a federal background investigation and may need to meet additional eligibility requirements for access to classified information or materials.\n\n\n<ul>\n<li>*Ready for action? We?re looking for the kind of people who see this opportunity and don?t hesitate to act. Parsons is a leader in the world of technical services. We hire people with a broad set of technical skills who have proven experience tackling some of the greatest challenges. Take your next step and apply today.**</li>\n<li>*Parsons Referral Plan**</li>\n<li>*_Maybe this opportunity isn?t the right fit for you, but you know someone who is? Why not join our Parsons external referral program? When you refer other top professionals and they are hired, you are rewarded with an incredible financial incentive. Help us find top talent!_**</li>\n</ul>\n\n_Parsons is a digitally enabled solutions provider focused on the defense, security, and infrastructure markets. With nearly 75 years of experience, Parsons is uniquely qualified to deliver cyber/converged security, technology-based intellectual property, and other innovative services to federal, regional, and local government agencies, as well as to private industrial customers worldwide._\n<br><br>\n_Parsons is an equal opportunity, drug-free employer committed to diversity in the workplace. Minority/Female/Disabled/Protected Veteran/LGBT._\n<br><br>\n_For more about Parsons, visit_ _parsons.com_ _and follow us on_ _Facebook_ _,_ _Twitter_ _,_ _LinkedIn_ _, and_ _._\n<br><br>\nParsons is an equal opportunity, drug-free employer committed to diversity in the workplace. Minority/Female/Disabled/Protected Veteran/LGBT\n<br><br>\nParsons is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regards to an individual's race, color, religion, national origin, ethnicity, union affiliation, age, sex, sexual orientation, gender identity and expression, pregnancy, employable physical or mental disability, veteran status, genetic information, immigration status, or any other basis protected by applicable laws."}