{"job title": "Associate Scientist II - Molecular Biology", "company": "Pfenex Inc.", "city state": "– San Diego, CA", "rating": "3.3", "job description": "This role will support all projects within the Molecular Biology group. Responsible for the construction, screening and characterization of recombinant <em>P. fluorescens</em> strains.<br>\n<div><strong>ESSENTIAL DUTIES AND PRIMARY RESPONSIBILITIES</strong></div>\n\n<ul>\n<li>Accountable for personal technical goals which align with project</li> <li>Carrying out experiments, interpreting data, to meet project milestones.</li><li>Use known or develop specific techniques/technology to solve problems within Molecular</li> <li>Perform efficient gene cloning including the design of constructs and primers, PCR amplification, and DNA sequencing and</li> <li>Design and construct various microbial genes and strains, execute strain analysis procedures, and carry out and troubleshoot protocols for mutagenesis and</li> <li>Perform protein analysis such as cell fractionation, SDS-PAGE gel and Western</li> <li>Independently perform HTP strain expression and analysis using appropriate statistical tests and</li> <li>Deliver presentations that distill complex ideas and proactively communicate results and progress to technical teams and</li> <li>Troubleshoot and improve protocols for increased speed or precision, as required</li><li>Identify and introduce new technologies and ways to improve assay performance and laboratory</li> <li>Seek to understand capabilities across disciplines and use innovative, collaborative approach for solving technical</li> <li>Author technical documents, including SOPs, that describe the methods used and operation of laboratory instruments/equipment or</li> <li>Capture IP through clear documentation of experiments and results</li> <li>Expand breadth of skills through participation on projects which utilize diverse techniques or</li> \n</ul><br>\n<div><strong>JOB SKILLS, ABILITIES AND QUALIFICATIONS</strong></div>\n\n<ul>\n<li>BS/MS in biology, molecular biology, microbiology, or biochemistry</li><li>BS/MS 2 years relevant experience</li><li>Proficient in molecular biology techniques such as nucleic acid isolation and digestion, DNA cloning, PCR/ QPCR, DNA sequencing, and RNAseq</li><li>Good documentation practices are essential</li><li>Knowledge of GLP compliance essential; knowledge of ISO9000, and cGMP regulatory guidelines desirable</li><li>Must be proficient in MS Word, Excel, and Powerpoint. JMP or other statistical package</li><li>Must be proficient in DNA sequence analysis software, e.g. sequencher, DNAstar, VectorNTI and possess basic bioinformatics skills e.g: working knowledge of BLAST, SignalP, CLUSTAL, etc.</li><li>Good problem-solving skills</li><li>Flexible hours essential, be available to troubleshoot equipment and process issues during off-hours.</li>\n</ul>\n\n<strong>Job Posted by ApplicantPro</strong>\n<br>"}