{"job title": "Principal Scientist, Culture Process Development", "company": "Pfizer", "city state": "– Andover, MA", "rating": "3.9", "job description": "The Culture Process Development (CPD) group of Pfizer in Andover, MA is seeking a highly motivated and energetic scientist/engineer interested in working on the forefront of cell culture bioreactor process development. The successful applicant will lead a small group of scientists and engineers responsible for the development of early and late stage cell culture processes, technology transfer to manufacturing sites, scale-up and scale-down of processes, characterization of mammalian culture processes, and authoring of associated regulatory submissions. She/he will be expected to provide strong technical, strategic, and organizational leadership, effectively manage a multi-project development portfolio, and make strong technical and strategic contributions to multi-disciplinary cross-functional development project teams to ensure efficient and timely execution of CPD deliverables.\n\n\n<ul>\n<li>*ROLE RESPONSIBILITIES**</li>\n</ul>\n\nResponsible for successful development, characterization and execution of state-of-the-art manufacturing processes for mammalian cultures. Accomplished technical leader who applies scientific and technical experience and business acumen to establish strategies, drive safe and high-quality lab technical work, and deliver well-controlled and characterized late stage manufacturing processes. Provides creative and pragmatic technical and operational problem-solving options.\n<br><br>\nProvides visible, passionate and optimistic organizational/ technical/ personal leadership and fosters colleague engagement; models and engenders desired values and behaviors, including quality, integrity, respect, collaboration and personal accountability.\n<br><br>\nHas the ability and mastery (technical and interpersonal skills, awareness of functional area deliverables and business/ regulatory context) to train/ mentor more junior colleagues in specific lab techniques or processes. Expected to supervise a group of 2-4 junior colleagues.\n<br><br>\nContributes to project, technical and strategic teams as appropriate; reaches across organizational, functional and geographic boundaries to provide appropriate context and communication (in both directions) so as to ensure effective technical and strategic integration at all internal and external interfaces (Research, Bioprocess development, Analytical, Safety, CMOs, Commercial manufacturing, etc.), as appropriate.\n<br><br>\nEstablishes and drives relevant and impactful innovation programs, to enhance upstream manufacturing/ characterization technologies and work-processes; ensures that innovation strategy is aligned with broader business drivers and current and emerging Regulatory paradigms.\n<br><br>\nContributes to regulatory submissions and responses to regulatory questions; presents data/ strategy to scientists and management in appropriate internal and external venues (technical meetings, project team meetings, conferences) and publishes in peer-reviewed journals, as appropriate.\n\n\n<ul>\n<li>*QUALIFICATIONS**</li>\n</ul>\n\n+ PhD with 4-8 years of experience, Master's Degree with 7-11 years of experience or Bachelor's Degree with 9-13 years of experience with a degree in Chemical/Biochemical Engineering, Biotechnology, Biochemistry, Cell Biology, Microbiology or related field, with relevant experience in the development and characterization of mammalian cell culture processes for therapeutic proteins and monoclonal antibodies.\n<br><br>\n+ Experience contributing to regulatory submissions and demonstrated leadership success in project progression is required.\n<br><br>\n+ This position requires a highly motivated individual with the ability to work closely with other members of the laboratory and the department in a matrix team environment.\n<br><br>\n+ Collaborative, team oriented leadership and management style essential.\n<br><br>\n+ Demonstrated ability to drive for results and lead innovation and change.\n<br><br>\n+ Applicants should be bright, organized, self-motivated, and capable of working independently and in a collaborative environment.\n<br><br>\n+ Applicants should also have strong oral and written communication skills as well as analytical and computer proficiencies.\n\n\n<ul>\n<li>*DESIRABLE EXPERIENCE/SKILLS:**</li>\n</ul>\n\n+ Experience developing commercially relevant processes for products derived from mammalian processes.\n<br><br>\n+ Expert knowledge in developing cost effective, scalable culture processes.\n<br><br>\n+ Experience in supporting the scale-up / scale-down of bioreactor processes and technology transfer to pilot / commercial manufacturing scale.\n<br><br>\n+ An in depth understanding of mammalian cell metabolism.\n<br><br>\n+ Demonstrated experience in process development utilizing quality risk management and quality by design concepts.\n<br><br>\n+ An understanding of process characterization and design of experiment (DOE) studies.\n<br><br>\n+ Good knowledge of GLP/GMP and biotechnology CMC regulatory requirements.\n<br><br>\n+ Ability to manage a small group of scientists / engineers.\n<br><br>\n+ Demonstrated experience with managing multiple projects in parallel, including key participation on multi-disciplinary project teams.\n\n\n<ul>\n<li>*PHYSICAL/MENTAL REQUIREMENTS**</li>\n</ul>\n\n+ Ability to perform mathematical calculations and ability to perform complex data analysis.\n\n\n<ul>\n<li>*NON-STANDARD WORK SCHEDULE, TRAVEL OR ENVIRONMENT REQUIREMENTS**</li>\n</ul>\n\n+ Occasional weekend work is possible; travel to other Pfizer sites (St Louis MO, Andover MA and others) and to support process tech transfer to contract manufacturing organizations in USA / Rest of World as appropriate.\n\n\n<ul>\n<li>*OTHER JOB DETAILS**</li>\n</ul>\n\n+ **Last Date to Apply for Job: September 30, 2018**\n<br><br>\n+ Additional Location Information: Andover, MA\n<br><br>\n+ Eligible for Employee Referral Bonus: Yes\n\n\n<ul>\n<li>*EEO &amp; Employment Eligibility**</li>\n</ul>\n\nPfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.\n\n\n<ul>\n<li>*Sunshine Act**</li>\n</ul>\n\nPfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider's name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.\n<br><br>\nPfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates."}