{"job title": "Senior Scientist, Immunogenicity", "company": "Pfizer", "city state": "– United States - Massachusetts - Andover", "rating": "3.9", "job description": "<p>The Immunogenicity Sciences Group within the BioMedicine Design (BMD) department is seeking a motivated and dynamic Immunogenicity Senior Scientist to work within the team and contribute to immunogenicity risk assessment across a diverse array of therapeutic protein modalities and disease areas.</p><p></p><p>The role has responsibility for establishing and executing laboratory-based predictive immunogenicity &amp; immunogenicity reduction technologies, in particular in vitro cellular assays. The role will be to work independently, use scientific judgment in making decisions within the area of technical expertise, and propose new options and develop new processes to advance Immunogenicity Sciences knowledge and technology.</p><p></p><p>In collaboration with Immunogenicity Scientists, Protein engineers and other lines within BMD, the Senior Scientist will provide continuous support to Pfizer biologics portfolio projects.</p><p></p><p><b><b>ROLE RESPONSIBILITIES </b></b></p><ul><li>Designs, conducts and interprets in-vitro or other lab-based immunogenicity assessment studies, delivering high-value data to inform molecular design to reduce immunogenicity risk in support of Pfizer biologics portfolio projects</li><li>Organizes and presents data to Immunogenicity and project teams to inform decisions</li><li>Demonstrates innovative thinking to investigate and establish novel techniques or technologies to advance, improve or optimize scientific practices and procedures in the discipline</li><li>Maintains awareness of scientific and technical developments in field</li><li>Effectively interacts within Immunogenicity team and across BMD to support projects advancement</li></ul><p></p><p><b><b>BASIC QUALIFICATIONS </b></b></p><ul><li>PhD with 0-3 years of experience, Master's Degree with 3-6 years of experience or Bachelor's Degree with 5-8 years of experience with industry experience in the field of biopharmaceuticals or immunology</li><li>Extensive experience with in vitro cell-based assays and flow cytometry is necessary.</li><li>Proven problem solving and troubleshooting abilities</li><li>Practical experience of achieving goals in a highly interactive, fast-paced and dynamic matrix environment</li><li>Ability to quickly adapt to changing priorities</li><li>Excellent interpersonal and oral / written communication skills, demonstrated through internal and external presentations of own work</li></ul><p></p><p><b>PREFERRED QUALIFICATIONS</b></p><ul><li>Experience with DC and/or T cell in vitro assays as well as experience with molecular immunology is preferred</li><li>Track record of method development skills with novel and complex methods. Experience in automating assays is preferred.</li></ul><p></p><p><b>ADDITIONAL OFFER DETAILS</b></p><ul><li><b>Last Date to Apply for Job: September 15 2018</b></li><li>Additional Location Information:: Andover, MA</li><li><p>Eligible for Employee Referral Bonus: Yes</p></li></ul><p></p><p><b><b>EEO &amp; Employment Eligibility</b></b></p><p>Pfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.</p><p></p><p><b><b>Sunshine Act</b></b></p><p>Pfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider’s name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.</p><p></p><p>Pfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates.</p>"}