{"job title": "Data Engineer", "company": "Upstart", "city state": "– San Carlos, CA", "rating": "3.6", "job description": "Upstart is a fast-growing and profitable company revolutionizing how people access credit. We use data science and automation to make smarter lending decisions and help borrowers access credit easier and faster. Join our engineering community as a <strong>Data Engineer</strong>, and help Upstart build infrastructure to move and analyze large volumes of data. Our success depends on our ability to efficiently make sense of data, and as a Data Engineer at Upstart, you'll be responsible for architecting systems to move, store, transform, and analyze large amounts of data, including financial and business data. You'll have an outsized impact on the productivity of the entire engineering and data science team and directly contribute to Upstart's core competitive advantage.\n<br><br>\n<strong>Here is more about what you'll be doing:</strong>\n\n<ul>\n<li>Build data pipelines that collect, connect, centralize, and curate data from various internal and external data sources</li>\n<li>Manage and extend a reliable, effective, and scalable data infrastructure</li>\n<li>Partner with Data Scientists and other business stakeholders to meet their data requirements</li> \n\n<li>Implement systems for monitoring data quality and consistency</li>\n<li>Productionize machine learning models that power our data products and integrate with our loan origination platform</li>\n<li>Help the Data Science team apply and generalize statistical and econometric models on large datasets</li>\n<li>Identify inefficiencies, optimize processes and data flows and make recommendations for improvements</li>\n</ul>\n<strong>Requirements:</strong>\n\n<ul>\n<li>3+ years of experience as Data Engineer or Software Engineer</li>\n<li>Proficiency in Python or Java</li>\n<li>Experience with streaming Kafka, ETL for service oriented architectures</li>\n<li>Ability to collaborate cross-functionally and communicate effectively</li> \n\n<li>Ability to bring new ideas and promote process improvement</li>\n</ul>"}