{"job title": "Imaging Research Scientist", "company": "Vanderbilt University Medical Center", "city state": "– Nashville, TN", "rating": "3.6", "job description": "<ul>\n<li>*Discover VanderbiltUniversity Medical Center:**</li>\n</ul>\n\nLocated in Nashville,\n<br>\nTennessee, and operating at a global crossroads of teaching, discovery and\n<br>\npatient care, VUMC is a community of individuals who come to work\n<br>\neach day with the simple aim of changing the world. It is a place where your\n<br>\nexpertise will be valued, your knowledge expanded and your abilities\n<br>\nchallenged. It is a place where your diversity ? of culture, thinking, learning\n<br>\nand leading ? is sought and celebrated. It is a place where employees know they\n<br>\nare part of something that is bigger than themselves, take exceptional pride in\n<br>\ntheir work and never settle for what was good enough yesterday. **Vanderbilt?s** mission\n<br>\nis to advance health and wellness through preeminent programs in patient care,\n<br>\neducation, and research.\n<br><br>\nClick Here To View The\n<br>\nVUMC Promise of Discovery\n\n\n<ul>\n<li>*About the Institute of Imaging Science**</li>\n</ul>\n\nAt Vanderbilt we believe the greatest successes for imaging in the future will come from environments where the complementary natures of different imaging approaches are exploited, where experts in basic sciences and technical aspects of image formation and analysis collaborate closely with biomedical scientists who ask appropriate questions, and where the basic underlying science of imaging is fostered.\n<br><br>\nVUIIS is a trans-institutional initiative within Vanderbilt University serving physicians, scientists, students and corporate affiliates. VUIIS maintains close collaborations in research and training with many parts of our campus including the schools of medicine, engineering, arts and science, law and Peabody College\n\n\n<ul>\n<li>*JOB SUMMARY:**</li>\n</ul>\n\nDevelop and maintain highly specialized research imaging methods, and contribute to imaging technology development. Train graduate students, postdoctoral fellows, and staff. Develop specific protocols to meet needs of investigators.\n\n\n<ul>\n<li>*KEY RESPONSIBILITIES:**</li>\n</ul>\n\n+ Develop and maintain highly specialized imaging methods and support technology based on current literature as well as changing experimental needs of investigators. Develop new options as needed. (Modalities currently include MR, PET, RF Coil Development, micro-CT, etc.)\n<br><br>\n+ Conduct and/or supervise scientific data collection and analysis. Advise investigators on preferred imaging modalities for specific research projects.\n<br><br>\n+ Exercise independent judgment to design/develop methods and procedures for innovative research studies.\n<br><br>\n+ Contribute to research so as to merit serving as author or co-author on publications\n<br><br>\n+ Troubleshoot and maintain complex scientific imaging instrumentation. Modify existing equipment as needed for research aims.\n<br><br>\n+ Research options and make recommendations for equipment purchases, service agreements, and supplies in such a manner as to maximize efficiency and cost-savings while best supporting the research needs of diverse groups of investigators\n<br><br>\n+ Interface with various regulatory groups (within Vanderbilt as well as external) to ensure compliance with laws and guidelines.\n<br><br>\n+ Communicate clearly, effectively, and collaboratively with investigators about methods, processes, results, etc.\n\n\n<ul>\n<li>***Position Benefits****</li>\n</ul>\n\nIn addition to offering\n<br>\na lively community that encourages learning and celebrates diversity,\n<br>\nVanderbilt University Medical Center provides its faculty and staff members\n<br>\nwith a benefits package that is comprehensive and flexible. Components for\n<br>\n<strong>benefits-eligible employees include:</strong>\n<br><br>\n<strong>+ PTO</strong>\n<br><br>\n+ Health Plan\n<br><br>\n+ Parental Leave\n<br><br>\n+ Life Insurance\n<br><br>\n+ Retirement\n<br><br>\n+ Short-Term Disability\n<br><br>\n+ Long-term Disability\n<br><br>\n+ Accidental Death &amp;Dismemberment (AD&amp;D)\n<br><br>\n+ Dental Insurance\n<br><br>\n+ Group Discounts\n<br><br>\n+ Flexible Spending Accounts(FSAs)\n<br><br>\n+ Vision\n\n\n<ul>\n<li>*** Minimum Requirementsfor Qualification ****</li>\n</ul>\n\n+ Doctorate/PhD (or equivalent experience) and\n\n\n<ul>\n<li>*VUMC RecentAccomplishments**</li>\n</ul>\n\nBecause we are committed to providing the best in patient care,\n<br>\neducation and research, we are proud of our recent accomplishments:\n<br><br>\n? **US News &amp; World Report:** \\#1 Hospital in Tennessee, #1 Health Care\n<br>\nProvider in Nashville, #1 Audiology ( **Bill Wilkerson Center** at http://www.vanderbilthealth.com/billwilkerson/ ), 12 adult and 10 pediatric clinical\n<br>\nspecialties ranked among the nation's best, #15 Education and Training\n<br><br>\n? **Truven Health Analytics:** among the top 50 cardiovascular\n<br>\nhospitals in the U.S.\n<br><br>\n? **Becker's Hospital Review:** one of the \"100 Greatest Hospitals\n<br>\nin America\"\n<br><br>\n? **The Leapfrog Group:** grade \"A\" in Hospital Safety\n<br>\nScore\n<br><br>\n? **National Institutes of Health:** among the top 10 grant awardees for\n<br>\nmedical research in the US\n<br><br>\n? **Magnet Recognition Program:** Vanderbilt nurses are the only group\n<br>\nhonored in Tennessee\n<br><br>\n? **Nashville Business Journal:** Middle Tennessee's healthiest employer\n<br><br>\n? **American Hospital Association:** among the 100 \"Most Wired\" medical\n<br>\nsystems in the US\n\n\n<ul>\n<li>CA</li>\n<li>*Physical Requirements/Strengths needed &amp; Physical Demands:**</li>\n<li>*Movement**</li>\n</ul>\n\n+ Occasional: Sitting: Remaining in seated position\n<br><br>\n+ Occasional: Standing: Remaining on one's feet without moving.\n<br><br>\n+ Occasional: Walking: Moving about on foot.\n<br><br>\n+ Occasional: Lifting under 35 lbs: Raising and lowering objects under 35 lbs from one level to another\n<br><br>\n+ Occasional: Push/Pull: Exerting force to move objects away from or toward.\n<br><br>\n+ Occasional: Bending/Stooping: Trunk bending downward and forward by bending spine at waist requiring full use of lower extremities and back muscles\n<br><br>\n+ Occasional: Reaching below shoulders: Extending arms in any direction below shoulders.\n<br><br>\n+ Occasional: Handling: Seizing, holding, grasping, turning or otherwise working with hand or hands.\n\n\n<ul>\n<li>*Sensory**</li>\n</ul>\n\n+ Occasional: Vision: Clarity of near vision at 20 inches or less and far vision at 20 feet or more with depth perception, peripheral vision, color vision.\n<br><br>\n+ Frequent: Noise: May include exposure to occupational noise levels which equal or exceed an 8-hr time-weighted average of 85 decibels, requiring enrollment in VUMC's Hearing Conservation Program which includes training, use of hearing protection, and periodic audiometry.\n<br><br>\n+ Continuous: Communication: Expressing or exchanging written/verbal/electronic information.\n\n\n<ul>\n<li>*Environmental Conditions**</li>\n<li>*Job** _Research_</li>\n<li>*Organization:** _VU Inst. of Imaging Science 104207_</li>\n<li>*Title:** _Imaging Research Scientist_</li>\n<li>*Location:** _TN-Nashville-Medical Center North (MCN)_</li>\n<li>*Requisition ID:** _1807959_</li>\n</ul>"}