{"job title": "3M HIS Sr. Data Engineer", "company": "3m", "city state": "– Albany, New York", "rating": "3.9", "job description": "<strong> Job Description:</strong>\n<br><br>\n<strong> 3M is seeking a</strong>  <strong> Sr. Data Engineer</strong>  <strong> for the Health Information Systems Division located in Albany, NY. At 3M, you can apply your talent in bold ways that matter. Here, you go.</strong>\n<br><br>\n3M Health Information Systems (HIS) is the world leader for innovating the language of health and delivers comprehensive software and consulting services. Working at 3M Health Information Systems you will be helping with todays challenges, while preparing for tomorrows. Transforming health care from a system that treats disease, to a system that improves health and wellness begins with accurate health information and payment. From improving efficiency of medical records coding, to outlining success in value-based care and health care analytics. All while working with the best and the brightest to advance more than your own career, you are working to advance the entire world.\n<br><br>\n<strong> Job Summary (</strong> Sr. Data Engineer):\n<br><br>\nThe person hired for the position of Sr. Data Engineer will provide technical expertise and leadership to project teams regarding the analysis, design, and development of the data structures and ETL framework used in the large-scale processing and storage of healthcare data. The Sr. Data Engineer will be tasked with contributing a technical perspective that spans the disciplines of data design, software development, and project leadership and will leverage previous leadership experience to successfully interface with business owners and solution architects to convert business requirements and high-level architecture guidelines into technical requirements. In addition, the Sr. Data Engineer will need to be highly skilled and act as a technical hands-on AWS SME; well experienced using AWS tools, frameworks (EMR, Hive, Spark), services, and development languages and very familiar with AWS API, as well as supporting configuration management tools.\n<br><br>\n<strong> Primary Responsibilities</strong> (Sr. Data Engineer) include but are not limited to the following:\n<li> Acts as the technical lead to one or more scrum development teams</li> <li> Leads development team activities, including design solutions and development efforts</li> <li> Implements and designs the most optimal ETL and Data Model design that can scale and perform</li> <li> Determines opportunities for application and process improvement</li> <li> Supports leadership initiatives and the strategic technical direction of the organization</li>  <li> Willingness to work in a fast-paced, team-oriented environment and able to handle multiple conflicting priorities</li>\n<strong> Basic Qualifications (</strong> Sr. Data Engineer)<strong> :</strong>\n<li> Possess a Bachelors degree or higher (completed and verified prior to start) from an accredited institution or High School Diploma/GED or higher from an accredited institution and a minimum of three (3) years of equivalent experience in lieu of a Bachelor's degree education requirement</li> <li> Minimum of seven (7) years of experience with relational databases, such as Microsoft SQL Server.</li> <li> Minimum of seven (7) years of development experience, with database object design (Stored Procedures, UDF, etc.)</li> <li> Minimum of seven (7) years of development experience, with object oriented programming, such as Java or C#</li>\n<strong> Preferred Qualifications (</strong> Sr. Data Engineer)<strong> :</strong>\n<li> Experience with platform development, using AWS and micro-services, AWS tools, frameworks (EMR, Hive, Spark), as well as using large-scale analytic paradigms, such as Map Reduce, NoSQL</li> <li> Expertise and experience large scale Healthcare Data</li> <li> Expertise and experience in version control systems, such as SVN, CodeCommit or Git</li> <li> Expertise and experience deploying applications to AWS</li> <li> Expertise and experience with an agile development process</li> <li> Knowledge and experience with dynamic languages, such as Python or Ruby</li>  <li> Familiarity with test-driven development</li> <li> Highly motivated</li> <li> Excellent verbal and written communication skills</li> <li> Ability to solve problems in a logical, methodical, and time efficient manner</li> <li> Ability to direct and influence others</li>\n<strong> Location:</strong>  Albany, NY\n<br><br>\n<strong> Travel:</strong>  May include up to 10% domestic\n<br><br>\n<strong> Relocation:</strong>  Is not authorized\n<br><br>\nThis position provides an opportunity to transition from other private, public, government or military environments to a 3M career.\n<br><br>\n<strong> 3M Ethics</strong>\n<br><br>\nMost Recent great-news / Awards: 3M received recognition as being A Most Ethical Company! Promoting Ethical Business standards and practices internally, enabling managers and employees to make good choices, and shaping future industry standards by introducing tomorrow's best practices today. Honorees have historically out-performed others financially, demonstrating the connection between good ethical practices and performances thats valued. To View this recognition, please visit: http://bit.ly/EthisphereWorldsMostEthicalCompanyAward\n<br><br>\n<strong> Diverse &amp; Inclusive 3M</strong>\n<br><br>\n3M is a place where you can collaborate with other curious, creative people. Where your diverse talents, inclusiveness, initiative and leadership are valued. Where youll find challenging opportunities that make your career exciting and rewarding. With a diversity of people, global locations, technologies and products, 3M is a place to grow and be rewarded for excellence."}