{"job title": "Analytic Consultant", "company": "Aetna", "city state": "– Portland, OR", "rating": "3.3", "job description": "Req ID: 51873BR\n<br><br>\n<strong>POSITION SUMMARY</strong>\n<br><br>\nPlan Sponsor Insights (PSI) is searching for an experienced Medical Economics analyst to analyze data from various sources to understand a geographic territory?s health plan performance, how programs and strategies have influenced that performance, and ultimately provide consultative overviews to territory/market leadership and field teams, including solutions and strategies related to geographic and industry trends.\n<br><br>\nThe primary responsibility within this position is to interpret, analyze and provide strategies related to the overall plan results of a geographic territory/market. Results may include things such as medical cost, pharmacy cost, clinical programs, population health and disability. This role will require creating reports or presentations as necessary and the analyst will need to be able to articulate results to a wide range of audiences including territory leaders and customer account teams. The candidate must be able to present complex information in a compelling format and manner. The individual in this position will conduct ongoing analytic reviews with a cross functional team and must be able to meet multiple deadlines in a fast paced environment.\n<br><br>\nThe ideal candidate will have a thorough understanding of the healthcare industry including benefit plans, medical management programs, population health and incentive strategies. The candidate must have strong medical cost analytic skills, superior technical ability, strong communication skills, be able to work in a face-paced environment and handle multiple priorities. They must maintain up-to-date knowledge of external/industry trends.\n<br><br>\n<strong>Core Competencies:</strong>\n\n\n<ul>\n<li>Strong communication skills. Able to articulate (verbally and written) complex business results, issues and strategies in a clear, concise and confident manner to all levels and positions of an organization (internal and external).</li>\n<li>Business/Industry Knowledge: Minimum of 7-10 years of industry experience interpreting/analyzing all aspects of a customer?s experience (financial results, medical management results, population health, effectiveness of incentive/wellness strategies, etc.). Experience must include using data across the spectrum of a customer?s products/results to tell the ?story?, connect the dots between various strategies and results and ultimately identify, value and communicate areas of opportunity .</li>\n<li>Must have strong knowledge of claim coding (CPT/DRG, etc.), provider networks, benefit designs, healthcare products/funding, medical management programs and financial acumen.</li>\n<li>Relationship management: Demonstrated relationship management skills at the senior level; capacity to quickly build and maintain credible relationships at varying levels of the organization simultaneously.</li>\n<li>Strategic Thinking: Must have demonstrated ability to think strategically in an independent manner and ?out of the box? versus accepting the status quo .</li>\n<li>Technical Skills: Must possess strong technical skills in Microsoft Office Applications (Excel, Access, Word, PowerPoint) as well as experience using analytic/reporting applications .</li>\n</ul>\n\nAdditional Information (situational competencies, skills, work location requirements, etc.)\n<br><br>\n? Critical thinking skills.\n<br><br>\n? Time management skills.\n<br><br>\n? Organizational skills.\n<br><br>\n? Negotiation/influencing skills.\n<br><br>\n? Relationship and change management skills.\n<br><br>\n? Analytical and planning skills.\n<br><br>\n? Oral and written communication skills.\n<br><br>\n? Ability to work in a team environment\n<br><br>\n<strong>EDUCATION</strong>\n<br><br>\nThe highest level of education desired but not required for candidates in this position is a Master's degree or equivalent experience\n<br><br>\n<strong>FUNCTIONAL EXPERIENCES</strong>\n<br><br>\nFunctional - Information Management/Medical economics/7-10 Years\n<br><br>\nFunctional - Finance/Financial analysis/7-10 Years\n<br><br>\nFunctional - Finance/Financial reporting and analysis/7-10 Years\n<br><br>\n<strong>TECHNOLOGY EXPERIENCES</strong>\n<br><br>\nTechnical - Database/Microsoft Access/7-10 Years/Power User\n<br><br>\nTechnical - Desktop Tools/Microsoft PowerPoint/7-10 Years/Power User\n<br><br>\nTechnical - Reporting Tools/SAS/4-6 Years/End User\n<br><br>\n<strong>REQUIRED SKILLS</strong>\n<br><br>\nGeneral Business/Communicating for Impact/MASTERY\n<br><br>\nGeneral Business/Consulting for Solutions/ADVANCED\n<br><br>\n<strong>ADDITIONAL JOB INFORMATION</strong>\n<br><br>\nThe Plan Sponsor Insights (PSI) team provides customer level consultative analytics and reporting for Aetnas commercial business segments. Working on the PSI team provides the opportunity for exposure to senior levels of management within Aetna as well as to customers and consultants. The work environment supports and thrives on out-of-the box thinking and creative talent. Our team is highly valued by our internal partners as well as the customers they serve.\n<br><br>\nAetna is about more than just doing a job. This is our opportunity to re-shape healthcare for America and across the globe. We are developing solutions to improve the quality and affordability of healthcare. What we do will benefit generations to come.\n<br><br>\nWe care about each other, our customers and our communities. We are inspired to make a difference, and we are committed to integrity and excellence.\n<br><br>\nTogether we will empower people to live healthier lives.\n<br><br>\nAetna is an equal opportunity &amp; affirmative action employer. All qualified applicants will receive consideration for employment regardless of personal characteristics or status. We take affirmative action to recruit, select and develop women, people of color, veterans and individuals with disabilities.\n<br><br>\nWe are a company built on excellence. We have a culture that values growth, achievement and diversity and a workplace where your voice can be heard.\n<br><br>\nBenefit eligibility may vary by position. Click here to review the benefits associated with this position.\n<br><br>\nAetna takes our candidates's data privacy seriously. At no time will any Aetna recruiter or employee request any financial or personal information (Social Security Number, Credit card information for direct deposit, etc.) from you via e-mail. Any requests for information will be discussed prior and will be conducted through a secure website provided by the recruiter. Should you be asked for such information, please notify us immediately\n<br><br>\nJob Function: Management"}