{"job title": "Sr. Data Analyst", "company": "Amway", "city state": "– Ada, Michigan", "rating": "3.9", "job description": "<li>Please wait...</li>\n\nA career at Amway is a career in opportunity. At Amway you can explore and grow, make a difference, and find success. Established in 1959, Amway is a multi-billion dollar company, and the world's No. 1 direct selling business, according to the Direct Selling News Global 100. Amway is a center of health, skincare and home product innovation and top-selling, global brands. We manufacture and distribute 450+ consumer products. More than 19,000 employees worldwide support millions of Amway Business Owners who sell Amway products.\n<br><br>\nJob title: Sr. Data Analyst\n<br><br>\nDepartment: Market Research\n<br><br>\nLocation: Ada, MI (Americas Region/Amway North America)\n<br><br>\n<strong>What do we need:</strong>\n<br><br>\nWe are looking for an experienced Data Analyst to investigate Voice of the Customer data and understand potential areas of improvement.\n<br><br>\n<strong>What's special about this team:</strong>\n<br><br>\nThe Market Research team is small, hardworking group that is in close collaboration with our Analytics group. The group co-locates with the Analytics group and attends monthly meetings with them. They are focused on working proactively and continuing to work together as a unit.\n<br><br>\nHow you would contribute to the role:\n<br><br>\nAs a Senior Data Analyst, you will take data from our Customer Service group and other sources and understand where we are delivering on our expectations and where we are falling short. We'll rely on you to provide a holistic view on what is happening in the region. This feedback, both good and bad, is used by our Supply Chain, Marketing, Research &amp; Development, and Customer Service departments to help effectively drive innovation and change. You will develop an intimate understanding of the impact of program changes and promotions, both good and bad.\n<br><br>\nYou will be spending time doing the following:\n\n\n<ul>\n<li>Doing deep-dive analysis on incoming data to figure out what is happening</li>\n<li>Making recommendations based on data</li>\n<li>Producing monthly reports on that data in PowerPoint, using tables and graphs</li>\n<li>Enhancing the current PowerPoint report</li>\n<li>Logging problems as action items and identifying who should solve the problem</li>\n<li>Keeping everyone in the loop with solutions as they are being developed</li>\n<li>Working with our Analytics team to create a holistic view on what the data is telling us</li>\n<li>Scheduling the regular meetings and presenting the reports to the client groups</li>\n</ul>\n\nWhat skills and background will be important to be successful:\n<br><br>\nTo be considered for this role, you must have prior analytics experience. We're looking for someone that has experience working with large sets of data and developing a recommendation based on that data. It will be a definite advantage if you have experience working with Voice of the Customer data, or experience working with customer service. Other desired skills include:\n\n\n<ul>\n<li>Inquisitive, eager to learn nature</li>\n<li>Experience and proven ability to find the root cause of a problem</li>\n<li>Ability to work proactively</li>\n<li>Ability to listen and be a good business partner to various client groups</li>\n<li>Ability to effectively lead meetings</li>\n<li>Understand data analytical tools, including visualization such as Tableau</li>\n<li>Exposure to (knowledge of) database tools such as SQL, MicroStrategy, among others</li>\n<li>Strong communication skills, both written and verbal, with the ability to convey complex information</li>\n</ul>\n\nThe following benefits and virtual tour are intended for jobs specific to the United States:\n<br>\nAmway's exceptional benefits package includes: Medical, dental, prescription and vision insurance; 401(K) participation; Profit Sharing; Bonus Eligibility; Fitness Center; product discounts. Look into how Amway can transform your career! Visit our web site to apply: ********************** For additional information, check us out at ******************************* ***************************** and ****************************\n<br>\nInterested in a virtual tour of our World Headquarters in Ada, MI? Simply click Explore Our Campus and click on the colored icons to scroll and navigate the views and information.\n<br><br>\nNearest Major Market: Grand Rapids\n<br>\nJob Segment: Database, Market Research, Data Analyst, SQL, Supply, Technology, Marketing, Data, Operations\n<br><br>\n<strong>*</strong>"}