{"job title": "Fraud Data Analyst II", "company": "BBVA", "city state": "– Birmingham, AL", "rating": "3.6", "job description": "<ul>\n<li>Location: Birmingham, Alabama. United States</li>\n<li>Job type: Employment | Engineering</li>\n<li>Published on: 1st September 2018</li>\n</ul>\n\nApply\n<br><br>\nThis jobs belongs to another country and because of that, the specifications of its selection process will be different. If you apply, you will be registered on BBVA Compass.\n<br><br>\nYou could get know of this country process selection in BBVA Compass\n<br><br>\n<strong>Requirements</strong>\n<br><br>\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>Bachelor’s Degree in Computer Science, Management Information Systems, Finance or related field</li>\n<li>Experience managing and manipulating large relational data sources</li>\n<li>Strong project management skills and ability to manage multiple projects simultaneously</li>\n<li>Ability to effectively communicate / present ideas &amp; recommendations to all levels of management</li>\n<li>Successful candidate will have a demonstrable analytic, problem solving, leadership skills, and has the ability to deliver projects in a fast-paced environment.</li>\n<li>Minimum of 3+ years of experience at a Financial Services company in a technical or business analyst role</li>\n<li>Experience using programing languages, such as SAS, R, Python C++, SQL, VBA</li>\n<li>Ensures full security and regulatory compliance for products and services</li>\n<li>A team player mentality with strong relationship building skills.</li>\n<li>Ability to gain knowledge on reporting capabilities within planned tools to be implemented</li>\n<li>Strong verbal and written communication skills</li>\n<li>Experience in product and system testing is a plus</li>\n</ul>\n\nFlexible work schedule and ability to travel up to 30 within the Enterprise\n<br><br>\nFunctions\n<br><br>\nAt BBVA, we are working to make banking better for everyone. That is where you come in. We are looking for smart, team oriented people who want to be part of a first-class workforce that gives people the tools they need to meet their financial goals, all while delivering an outstanding client experience.\n<br><br>\nLearn more below.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nFraud Fraud Analyst II- Non card Analytics will lead or assist the Enterprise Fraud non card analytics Director on key Fraud Projects for BBVA Compass. Primary responsibilities include:\n\n\n<ul>\n<li>Lead development and implementation of effective Fraud Detection and prevention strategies to mitigate fraud losses while ensuring an appropriate balance between risk and customer experience.</li>\n<li>Transaction monitoring develop and maintain the monitoring framework based on monetary and non-monetary behaviors. React emerging fraud trend and modify the monitoring frame work accordingly</li>\n<li>Evaluate origination fraud tools and strategy rules, made recommendation on the changes</li>\n<li>Create and maintain strategy rule documentation / governance as appropriate</li>\n<li>Proactively identify fraud detection issues at the strategy and enterprise level with strong partnership with the business and fraud analytics. Leverage customer data to understand risk segmentation and mitigation strategies.</li>\n<li>Primary interface with internal and external partners to evaluate new tools to build detection and analytical capabilities</li>\n<li>The position requires substantial interaction with Governance, Operations, and other functional business partners to optimize fraud business strategies.</li>\n<li>Must be able to effectively provide updates and communicate key initiatives to functional business partners and management.<br><br>SDL2017</li>\n\n</ul>"}