{"job title": "Revenue Cycle - Business Intelligence Analyst", "company": "Community Health Network", "city state": "– Indianapolis, IN", "rating": "3.6", "job description": "<strong>Job Location</strong><br><br>The Revenue Cycle Analyst position is located in Indianapolis, Indiana<br><br><strong>Job Duties</strong><br><br>The Revenue Cycle Analyst is responsible for designing, implementing and supporting business and administrative analytics within revenue cycle functional areas. The Analyst will develop dashboards and reports with key performance indicators, metrics, data points and formulas to support management objectives<br><br><strong>Experience</strong><br><br>• Minimum of three years of data, financial or business analysis experience required\n\n\n<ul>\n<li>Previous experience in revenue management, patient financial services, and/or health information systems preferred</li>\n<li>Experience in QlikView, Tableau or Microsoft Power BI preferred<br><br></li></ul>\n\nEducation<br><br>Bachelors Degree in Business, Finance, Healthcare, Computer Science or related field required<br><br><strong>Skills</strong><br><br>• Expertise in data extraction and database queries\n\n\n<ul>\n<li>Ability to manage, organize, prioritize and multitask</li>\n<li>Strong project management skills</li>\n<li>Working knowledge of Microsoft Office products</li>\n<li>Knowledge of SQL</li>\n<li>Strong written and oral communication skills</li>\n<li>Excellent communication, analytical, problem solving, and organizational skills<br><br></li></ul>\n\nKeywords<br><br>Revenue Cycle Analyst, SQL, Analytics<br><br>Ranked among the nation's most integrated healthcare systems, Community Health Network is Central Indiana's leader in providing convenient access to exceptional healthcare services, where and when patients need them in hospitals, health pavilions and doctor's offices, as well as workplaces, schools and homes. Exceptional care, simply delivered.<br><br>Community is a non-profit health system that is deeply committed to the communities we serve with more than 200 sites of care and affiliates throughout Central Indiana. Guided by our PRIIDE Values Patients First, Relationships, Integrity, Innovation, Dedication and Excellence our team of caregivers is committed to providing an exceptional experience with every life we touch."}