{"job title": "Business Intelligence Analyst", "company": "Corning", "city state": "– Wilmington, NC", "rating": "3.6", "job description": "Corning is one of the world’s leading innovators in materials science. For more than 160 years, Corning has applied its unparalleled expertise in specialty glass, ceramics, and optical physics to develop products that have created new industries and transformed people’s lives.\n<br><br>\nCorning succeeds through sustained investment in R&amp;D, a unique combination of material and process innovation, and close collaboration with customers to solve tough technology challenges.\n<br><br>\nThe global Information Technology (IT) Function is leading efforts to align IT and Business Strategy, leverage IT investments, and optimize end to end business processes and associated information integration technologies. Through these efforts, IT helps to improve the competitive position of Corning's businesses through IT enabled processes. IT also delivers Information Technology applications, infrastructure, and project services in a cost efficient manner to Corning worldwide.\n<br><br>\n<strong><u>Scope of Position:</u></strong>\n<ul>\n<li>The position will be responsible for analysis, design, development, implement and maintain global reporting systems for Fiber manufacturing environment. In this capacity, he/she will work closely with engineering, operations and business leaders in the Fiber plants to deliver manufacturing information.</li><li>Fulfill dual function, one as a Manufacturing analyst; two as a MI analyst/developer.</li><li>The person will become the expert for the MI reporting system in their area of responsibility along with ancillary data feeds to reporting systems.</li><li>Maintain close relationships with business personnel in order to understand changing business requirements and drive adoption to standard reporting practices.</li>\n</ul>\n<strong><u>Required Education:</u></strong> B.S. Computer Engineering or Computer Science or Electrical or Electronics Engineering.\n<br><br>\n<strong><u>Years of Experience:</u></strong> 4+ years of combined experience in IT.\n<br><br>\n<strong><u>Required Skills/Knowledge:</u></strong>\n<br><br>\n<strong><u>Manufacturing Analyst:</u></strong>\n<ul>\n<li>Align MI with business objectives.</li><li>Improve manufacturing performance by analyzing manufacturing processes and product data to build various reports and cubes to be used by operational leaders to make key operational decisions.</li><li>Good knowledge about any manufacturing processes to generate ware flow reporting, scorecards, dashboards, summary, and detail reporting to give good insights to manufacturing productivity, backlogs and outputs.</li>\n</ul>\n<strong><u>Technical Skills:</u></strong>\n<ul>\n<li>Experience using Microsoft SQL server Business Intelligence Development Studio.</li><li>Experience in developing data extraction packages using SSIS.</li><li>Experience in developing reports design and development using SSRS.</li><li>Experience in Cube design and development using SSAS.</li><li>Full Life Cycle Experience in Model, Design, Development of Data warehouse/ETL/BI Solutions.</li><li>Strong Back End development skills and knowledge of relational databases (Oracle, Microsoft SQL Server, or others).</li><li>Good Database development experience for both OLTP &amp; OLAP Systems.</li><li>Build SQL to conduct statistical analysis.</li><li>Willing to be on off hours call on a rotational basis.</li>\n</ul>\n<strong><u>Soft Skills:</u></strong>\n<ul>\n<li>Self-discipline and motivation.</li><li>Collaborate with multiple teams across multiple regions.</li><li>Process oriented and customer focused.</li><li>Able to communicate with engineers, production associates, managers and business leaders.</li>\n</ul>\n<strong><u>Travel Requirements:</u></strong> 5% Domestic travel.\n<br><br>\n&nbsp;\n<br><br>\n&nbsp;\n<br><br>\nThis position does not support immigration sponsorship.\n<br><br>\nWe prohibit discrimination on the basis of race, color, gender, age, religion, national origin, sexual orientation, gender identity or expression, disability, or veteran status or any other legally protected status."}