{"job title": "Research Data Analyst", "company": "Discovery Communications", "city state": "– Charlotte, North Carolina", "rating": "3.5", "job description": "Discovery Education is the global leader in standards-based digital content for K-12 classrooms, transforming teaching and learning with award-winning digital textbooks, multimedia content, professional development, assessment tools, and the largest professional learning community of its kind. Discovery Education partners with districts, states and like-minded organizations to captivate students, empower teachers, and transform classrooms with customized solutions that accelerate academic achievement. Discovery Education's services are available not only in half of all U.S. schools, but in half of all English primary schools, numerous institutes of higher learning, and in 50 countries around the world.\n<br><br>\n<strong> The Role</strong>\n<br>\nThe Research Data Analyst is responsible for the analysis of product and service usage for the Research &amp; Data Analysis Team. The individual will be responsible for various activities related to raw data files, databases and data warehouses, which may include: reporting and extracting data for various reports and analyses, cleaning unstructured and structured data files, and auditing data for accuracies.\n<br><br>\n<strong> Responsibilities</strong>\n<br><br>\n1. Manage projects and collaborate with cross-functional departments to develop and implement improved reporting and data workflows and processes to support business goals.\n\n\n<ul>\n<li>Provide reports and KPIs to senior executives, as requested</li>\n<li>Manage scheduled and ad hoc reporting needs of the organization</li>\n<li>Analyze data for errors and inconsistencies</li>\n<li>Extract and transform data sets and provide insights for customer reporting</li>\n<li>Join datasets from different sources (Salesforce, MSSQL Server) and with different formats (.xlsx, .csv, .json, .sav)</li>\n<li>Mine and manage large data sets and analyzing data for actionable insights</li>\n<li>Participate in analysis of structured and unstructured data</li>\n<li>Analyze pre/post survey results and any other longitudinal analysis as needed. Work may include: merging data with any service usage, running descriptive statistics, and running significance tests</li>\n<li>Create internal and external presentations\n<br><br>\n<strong> Requirements</strong>\n<br><br>\n* Bachelors or Masters in computer science, mathematics, statistics, information systems, research or a related quantitative field</li>\n<li>A minimum of 3-5 years experience managing large data sets and analyzing data for actionable insights.</li>\n<li>Experience taking transactional business data, analyzing that data to answer a core research question and using analytics tools and systems to present the findings and insights</li>\n<li>Experience querying/joining databases and using statistical computer languages: R, Python, SQL, SPSS.</li>\n<li>Experience with data mining and data cleaning, including JSON data formats</li>\n<li>Experience with data visualization and reporting techniques</li>\n<li>Demonstrated ability to learn new systems quickly and master data integrity among multiple systems</li>\n<li>Must have strong Excel, PowerPoint, MS Word knowledge</li>\n<li>Must have strong listening, analysis and problem solving skills</li>\n<li>Must have strong interpersonal skills collaboration across multiple business and technology functions, relationship building and consensus building are a must</li>\n<li>Must be able to work on and prioritize multiple tasks while working well under pressure.</li>\n<li>Must be a self-starter and work productively with minimal direction</li>\n<li>Must learn quickly and produce under pressure and tight deadlines</li>\n<li>Must have the legal right to work in the United States\n<br><br>\nSilver Spring, Maryland, MD, Charlotte, North Carolina, NC</li>\n\n</ul>"}