{"job title": "Data Engineer- Project Hire", "company": "Disney", "city state": "– Burbank, California", "rating": "3.7", "job description": "Data Engineer- Project Hire at DISNEYSkip Navigation<br>\njapen-menu Back English Franais Deutsch Espaol Portugus<br>\n<br>\nChoose a Language<br>\n<br>\nHelp tell our stories in the most innovative ways!<br>\n<br>\nJob Search<br>\n<br>\nKeyword<br>\n<br>\nCountry/RegionSelect Country/RegionUnited StatesCanadaMexicoBahamasPuerto RicoChinaHong Kong Arab EmiratesIsraelAustraliaSouth AfricaUnited KingdomIndia<br>\n<br>\nState/ProvinceSelect State/Province Select State/ProvinceFloridaCaliforniaNew YorkIslands CarolinaSouth CarolinaNew JerseyMaharashtraArizonaOntarioBuenos AiresGeorgiaMadridPennsylvaniaDistrict of South WalesBavariaMichiganBangkokJakarta Special Capital RegionSelangorScotlandLombardySao PauloMexico CityMarylandMissouriTennesseeOregonBritish ColumbiaManitobaKarnatakaLisbon DistrictBalearic IslandsAndalusiaValenciaWalesNorthern IrelandStockholmPortoSantiago MetropolitanLouisianaSan JuanIndianaMinnesotaNebraskaNew HampshireWisconsinColoradoNew MexicoNevadaUtahKentuckyCapital RegionNational Capital RegionLeinsterIle-de-FranceIle-de-FranceProvincia de Buenos AiresDistrito FederalSao PauloTokyo<br>\n<br>\nCitySelect City Select CityOrlandoLake Buena VistaNew YorkBurbankLantau IslandGlendaleAnaheimBristolCelebrationLondonSan FranciscoSeattleKapoleiKissimmeeChicagoLos AngelesBay LakeMumbaiHilton HeadHoustonDurhamFresnoSan GablesCharlottePhiladelphiaDanburyCosta MesaEmeryvilleOntarioSan DiegoEdmontonSydney CBDBangkokJakartaPetaling CityNorth OlmstedConcordGilroyLakewoodMontebelloSan JoseSanta upon da HoraDublinSantiagoDestinFort MyersTampaVero HillJacksonSan JuanMyrtle BeachMemphisSeviervilleFriscoGrapevineLaredoSan MarcosThe ValleyNiagara FallsRiverheadWest ViejoModestoNorcoSan BernardinoSanta AnaBroomfieldAlbuquerqueLas VegasCanutilloEl PasoHappy ValleyWoodburnSalt Lake <br>\n<br>\nSearch<br>\n<br>\nAlready applied?View Dashboard<br>\n<br>\nData Engineer- Project Hire<br>\n<br>\nLater Job ID ******BR Location Burbank, California, United States Business Disney ABC Television Group Date posted Aug. 30, 2018<br>\nJob Summary: The Data Engineer for the data technology team manages and operates systems to acquire and deliver content data to client systems within Disney. The data engineer's primary responsibility is to maintain the systems that ensure data meets internal and client specifications and is delivered on-time. The data engineer will work as part of a data technology team with the senior staff data engineer and the data quality engineer. Responsibilities:The Data Engineer will ensure the smooth functioning of processes to ingest third-party data into internal data systems, as well as manage delivery of data to API endpoints or data repositories. The engineer will have responsibility for both data ingest and delivery. The engineer typically will be responsible for data transformation scripts and oversight of one or more data QA pipelines, per client requirements. The data engineer may work with client or provider systems to write specifications detailing the type and expected quality of data deliveries. The data engineer will also with work with systems engineering, product development, solutions engineering and data entry teams as needed to assess and meet needs. Basic Qualifications:<br>\n<br>\n- Highly knowledgeable about industry data management strategies and practices, such as ACID compliance, data backup/restore, and data encryption/access.<br>\n- Ability to write data transformation scripts in at least one common scripting language, such as Groovy, Python or Javascript.<br>\n- Functional competence in Java.<br>\nPreferred Qualifications:<br>\n<br>\n- Familiarity with W3C standards for linked data and related technologies such as triple stores, RDF, SPARQL and SHACL is strongly preferred.<br>\nRequired Education<br>\n<br>\n- Bachelors degree in Computer Science or Information Systems or 5+ years' experience with corporate data management systems in high-compliance contexts.<br>\nAbout Disney ABC Television Group:<br>\n<br>\nDisney/ABC Television Group (DATG) redefines the future of media and entertainment. Delivering compelling creative, great storytelling, ground-breaking technology, high-impact marketing and innovative distribution, DATG offers multiple opportunities to build a career that supports entertaining and informing the world. A key unit of The Walt Disney Company, one of the world's most admired vertically integrated media enterprises, DATG includes global live action and animation entertainment, news, owned television stations, and radio. If you've got a passion to join our team of talented professionals we want to hear your story. About The Walt Disney Company:<br>\n<br>\nThe Walt Disney Company, together with its subsidiaries and affiliates, is a leading diversified international family entertainment and media enterprise with the following business segments: media networks, parks and resorts, studio entertainment, consumer products and interactive media. From humble beginnings as a cartoon studio in the 1920s to its preeminent name in the entertainment industry today, Disney proudly continues its legacy of creating world-class stories and experiences for every member of the family. Disney's stories, characters and experiences reach consumers and guests from every corner of the globe. With operations in more than 40 countries, our employees and cast members work together to create entertainment experiences that are both universally and locally cherished.<br>\n<br>\nThis position is with American Broadcasting Companies, Inc., which is part of a business segment we call Disney ABC Television Group.<br>\n<br>\nAmerican Broadcasting Companies, Inc. is an equal opportunity employer. Applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Disney fosters a business culture where ideas and decisions from all people help us grow, innovate, create the best stories and be relevant in a rapidly changing world.<br>\nLater<br>\n<br>\nthis Job<br>\n<br>\n- Facebook<br>\n- LinkedIn<br>\n- Twitter<br>\n- Google+<br>\n- Email<br>\n<br>\nFollow Us<br>\n<br>\n- Facebook<br>\n- LinkedIn<br>\n- Twitter<br>\n- YouTube<br>\n- Instagram<br>\n<br>\n- Jobs By Location<br>\n- Jobs By Category<br>\n- Jobs By Group<br>\n- Jobs By Business Area<br>\n<br>\n- Site Map<br>\n- Terms of Use<br>\n- Privacy Policy<br>\n- Your California Privacy Policy<br>\n- Children's Online Privacy Policy<br>\n- Interest-Based Ads<br>\n- About Disney<br>\n<br>\n2017 Disney. All rights reserved."}