{"job title": "Data Engineer", "company": "Jobspring Partners", "city state": "– Aliso Viejo, California", "rating": "3.6", "job description": "A Finance company in Southern Orange County is looking add a Jr/Mid-level data science developer to join their team. They will be working closely with the data science team as well as the portfolio analytics team developing and maintaining of key production models. This candidate will need to be able to make changes to models, optimize algorithms to work on specific platforms as well as add connectors to relational databases. You will lead all phases of programming conceptualization, design, development, and testing.\n<li> Design, implement and test the conversion of existing Excel, VBA &amp; SQL models to a Python backend</li> <li> Understand the business needs and designs programs and systems that match the complex business requirements and records all the specifications that are involved in the development and coding process</li> <li> Expert in Unix Shell scripting. UNIX, Python scripting have added advantage</li> <li> Expert in writing efficient SQL's Oracle queries and performance tuning</li> <li> Expert in Informatica ETL tool, Mapping design, Implementation, Performance Tuning and Debugging. Develop complex data extracts, applications and ad-hoc queries using Informatica Power Center</li> <li> Experience in Tableau Dashboard Design and Development (quick/context/global filters, parameters, interactive views, trends and drill downs and calculated fields on Tableau (7.x))</li> <li> Background with file transfer protocols like SFTP, FTP</li> <li> Exposure in Data warehouse or Exposure Finance/Banking Data are added advantage</li> <li> Optimize models to make models more efficient, accurate and comprehensive</li> <li> Support the data science team in acquiring, cleansing and engineering data for longevity risk modeling</li> <li> Other ad-hoc programming needs as needed to support other departments</li> <li> Bachelors degree in Computer Science, Information Technology, Engineering or related technical field required</li>  <li> 5+ years of experience developing production level software/modeling solutions</li> <li> Expert knowledge in Microsoft Excel (model building/optimization)</li> <li> Soft Skills: Problem solver, Results/Task oriented, Proactive, Independent self-starter</li> <li> Presentation skills: Clear and fluent communicator. Able to discuss project issues/topics with users, present status orally and written, present demos</li>\nTech Breakdown\n<li> 50% Python</li> <li> 50% ETLs/Conversion Projects</li>\nDaily Responsibilities\n<li> 100% Hands On</li> <li> Competitive Salary: Up to 110,000/year, DOE</li>\nYou will receive the following benefits:\n<li> Medical Insurance &amp; Health Savings Account (HSA)</li> <li> 401(k)</li> <li> Paid Sick Time Leave</li> <li> Pre-tax Commuter Benefit</li>\nApplicants must be currently authorized to work in the United States on a full-time basis now and in the future.\n<br><br>\nJobspring Partners, part of the Motion Recruitment network, provides IT Staffing Solutions (Contract, Contract-to-Hire, and Direct Hire) in major North American markets. Our unique expertise in todays highest demand tech skill sets, paired with our deep networks and knowledge of our local technology markets, results in an exemplary track record with candidates and clients."}