{"job title": "DATA ANALYST- Computational Biology", "company": "Massachusetts General Hospital(MGH)", "city state": "– Boston, Massachusetts", "rating": "3.9", "job description": "The <strong>Lawrence Lab</strong> at the Massachusetts General Hospital Cancer Center seeks a data analyst to join an interdisciplinary team of computational biologists from MGH and the Broad Institute, working at the forefront of cancer research and treatment. We use computation as a powerful microscope to study both the fundamental biology of cancer initiation and progression, as well the diagnosis and treatment of cancer patients in the hospital setting.\n<br><br>\nCurrent research interests of the Lawrence Lab:\n\n<ul>\n<li><strong> Cancer evolution:</strong>  We are using genomic profiling to observe the processes of clonal evolution during the course of a patient's disease and treatment.</li> <li><strong> Resistance to targeted therapies:</strong>  We are actively investigating mechanisms of drug resistance and how to combat it.</li> <li><strong> Single-cell sequencing</strong>  : New approaches allow us to dissect a tumor down to single cells and investigate RNA expression, DNA mutations, and epigenetic changes all in single cells.</li> <li><strong> Liquid biopsies</strong>  : We work with state-of-the-art technologies that can monitor the progression of cancer through a simple blood draw.</li> <li><strong> Mutational processes</strong>  : We are studying mutational background patterns to learn about DNA damage repair deficiencies, which can be biomarkers for the use of genotoxic therapy.</li> <li><strong> Cancer driver genes</strong>  : We are working to understand specific driver mutations that deactivate tumor suppressors or activate oncogenes.</li> \n</ul>\n\n<strong>Principal Duties:</strong>\n\n<ul>\n<li>Apply existing computational pipelines, and help develop novel pipelines, for analyzing cancer data sets to assess data quality, critically review and analyze results, communicate results to biologists, computational biologists, software engineers and clinicians.</li> <li> Explore novel data visualization methods, with emphasis on integrating diverse data types and extracting clinically relevant insights.</li> <li> Work with Cancer Center researchers to understand experimental procedures and the kinds of data produced (e.g. DNA sequencing, RNA sequencing, epigenetic readouts, clinical outcome annotations). Meet and discuss with clinical and experimental colleagues to identify analytical challenges and goals.</li> <li> Contribute to scientific writing and creation of data figures to be included in research publications reporting novel discoveries made in the lab and clinic.</li> \n</ul>\n\n<strong>Qualifications</strong>\n\n<li> B.A./B.S. (M.A./M.S. preferred) in one of Computational Biology, Bioinformatics, Biology, Biochemistry, Computer Science, Mathematics, Physics, or a related field.</li> <li> At least 2 years of experience in scientific research.</li> <li> Independent, self-motivated drive to push research forward.</li> <li> Excellent programming skills (using any of Matlab, R, Java, Python, Perl, C, etc.)</li> <li> Nimble approach to programming and data analysis, with an emphasis on simple, intuitive, reasoning: quickly open unfamiliar datasets, generate simple visualizations to project the data onto our brains as usefully as possible, to stimulate hypothesis generation and the next steps of the analysis.</li> <li> Comfort using Word, Excel, Powerpoint to communicate results between team members.</li> <li> Ability to work together with multi-disciplinary teams comprising physicians, biologists, statisticians, and software engineers.</li> <li> Fluency in spoken and written English.</li> <li> Experience in machine learning, cloud computing (e.g. Google Cloud) a plus.</li>\n\n<strong>EEO Statement</strong>\n<br>\nMassachusetts General Hospital is an Equal Opportunity Employer. By embracing diverse skills, perspectives and ideas, we choose to lead. Applications from protected veterans and individuals with disabilities are strongly encouraged.\n<br>\nPartner's Healthcare is acting as an Employment Agency in relation to this vacancy."}