{"job title": "Data Science &amp; Algorithm Development Engineering Manager", "company": "Medtronic Inc.", "city state": "– Northridge, CA", "rating": "3.7", "job description": "Careers that Change Lives\n<br><br>\nWe are looking for a motivated individual to manage a teamof analytics and algorithm engineers responsible for developing Medtronic'snext generation glucose sensor technology. In this role, you will helpestablish and drive the strategic direction of the team, and will beresponsible for all analytics efforts spanning research through to development.A successful candidate will have management experience (people or program),have solid technical training with sufficientknowledge of signal processing and analytics methodologies so as to makeinformed technical decisions. Preference will be given to candidates withdirect experience in the software and algorithm development lifecycle.\n<br><br>\nA Day in the Life\n\n\n<ul>\n<li>You will manage a technical team with focus on algorithms and data analytics, and establish a structure for this team that can address organizational needs</li>\n<li>You will lead algorithm development projects from investigation through to productization</li>\n<li>We will ask that you actively search for best-in-class technologies and develop innovation roadmap</li>\n<li>You will Identify and implement systems and tools to facilitate the algorithm development life cycle</li>\n<li>You will collaborate closely with other managers and project leads and establish infrastructure to support cross-functional analytics needs</li>\n<li>You will lead and participate in meetings and share technical information and \"best-practices\" across the Sensor R&amp;D organization</li>\n<li>You will be responsible for the professional develop of individuals assigned to the team, promote engagement and ensure job satisfaction of individual team members</li>\n</ul>\n\nResponsibilities may include the following and other duties may be assigned.\n\n\n<ul>\n<li>Plans, directs and implements all aspects of the company's design and development of new medical device products or software systems.</li>\n<li>May develop, evaluate, implement and maintain technical quality assurance and control systems or reliability systems and standards pertaining to materials, techniques, or company products.</li>\n<li>Oversees the investigation and evaluation of existing technologies.</li>\n<li>Guides the conceptualization of new methodologies, materials, machines, processes or products.</li>\n<li>Directs the development of new concepts from initial design to market release.</li>\n<li>Manages feasibility studies of the design to determine if capable of functioning as intended.</li>\n<li>Monitors documentation maintenance throughout all phases of research and development.</li>\n<li>Organizes the coordination of activities with outside suppliers and consultants to ensure timely delivery.</li>\n<li>Selects, develops and evaluates personnel to ensure the efficient operation of the function.</li>\n<li>Bachelor's degree in Electrical engineering, Computer engineering, Computer science, or related discipline and 5+ years of industry experience OR</li>\n<li>Advanced degree (Masters, PhD) in Electrical engineering, Computer engineering, Computer science, or related discipline and 3+ years of industry experience OR</li>\n<li>Industry experience in program management, people management or in a technical lead position</li>\n<li>Signal processing &amp; analytics experience in industry setting</li>\n</ul>\n\n<strong>Nice to have:</strong>\n\n\n<ul>\n<li>Direct people management experience</li>\n<li>Experience in a regulated industry and exposure to regulatory submissions; we'd love if you had experience in biosensor signal processing</li>\n<li>Experience interacting with a multi-disciplinary, cross-functional team</li>\n<li>Direct experience working with and implementing advanced analytics and algorithm methodologies</li>\n<li>Demonstrated ability to work and lead within a team-based project environment</li>\n<li>Ability to effectively communicate technical information through presentation and through the preparation of technical documentation and/or manuscripts</li>\n<li>Ability to read, analyze, and interpret common scientific and technical journals</li>\n</ul>\n\nAbout Medtronic\n<br><br>\nTogether, we can change healthcare worldwide. At Medtronic, we push the limits of what technology, therapies and services can do to help alleviate pain, restore health and extend life. We challenge ourselves and each other to make tomorrow better than yesterday. It is what makes this an exciting and rewarding place to be.\n<br><br>\nWe want to accelerate and advance our ability to create meaningful innovations - but we will only succeed with the right people on our team. Let's work together to address universal healthcare needs and improve patients' lives. Help us shape the future.\n<br><br>\nPhysical Job Requirements\n<br><br>\nThe above statements are intended to describe the general nature and level of work being performed by employees assigned to this position, but they are not an exhaustive list of all the required responsibilities and skills of this position.\n<br><br>\nThe physical demands described within the Day in the Life section of this job description are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br><br>SDL2017"}