{"job title": "Principal Backend Developer - Data Science", "company": "Oracle", "city state": "– Denver, CO", "rating": "3.4", "job description": "**Principal Backend Developer - Data Science**<br><br><br><br><br><br><br><br>**Preferred Qualifications**<br><br><br><br><br><br><br><br>The Oracle Data Science Cloud Service team<br><br>is seeking a Backend Software Engineer to join our engineering team. We are<br><br>addressing exciting challenges at the intersection of data science and cutting<br><br>edge infrastructure. Machine Learning tools/workflows, data integrations and<br><br>Kubernetes based infrastructure are key areas for us.<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>Our current backend tech stack is Go,<br><br>Python and Node.js.<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>**What you?ll do**<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>+ Workon blend of application programming and systems engineering<br><br><br><br>+ Designand develop backend services in a microservices architecture<br><br><br><br>+ Workwith state of the art in Kubernetes ecosystem<br><br><br><br>+ Designsolutions that work with container-native storage, networking and routing<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>**Qualifications**<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>+ Youare ideally proficient in either Go, Python or Java<br><br><br><br>+ Youhave prior experience working on distributed systems<br><br><br><br>+ Youare experienced at building highly available services, possessing knowledge ofcommon service-oriented design patterns and service-to-service communicationprotocols<br><br><br><br>+ Youare familiar with components of modern infrastructure like service discovery,secret storage, software-defined networking, etc.<br><br><br><br>+ Preferably,production experience with Kubernetes<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>**Desired Skills**<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>+ Takeinitiative and be responsible for delivering complex software by workingeffectively with the team and other stakeholders<br><br><br><br>+ Youfeel at home communicating technical ideas verbally and in writing (technicalproposals, design specs, architecture diagrams and presentations)<br><br><br><br>+ Youcare about entire lifecycle of software (development, testing, CI andproduction)<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>**Detailed Description and Job Requirements**<br><br><br><br><br><br><br><br>Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.<br><br><br><br><br><br><br><br>As a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associated with the developing, designing and debugging of software applications or operating systems.<br><br><br><br><br><br><br><br>Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience.<br><br><br><br><br><br><br><br>**Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.**<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>**Job:** Product Development<br><br><br><br><br><br><br><br>**Location:** US-CA,California-Culver City<br><br><br><br><br><br><br><br>**Other Locations:** US-CA,California-Redwood City, US-CO,Colorado-Denver, US-NY,New York-New York, US-WA,Washington-Seattle<br><br><br><br><br><br><br><br>**Job Type:** Regular Employee Hire<br><br><br><br><br><br><br><br>**Organization:** Oracle"}