{"job title": "Business Data Analyst", "company": "The Hartford", "city state": "– Hartford, CT", "rating": "3.7", "job description": "The Enterprise Data Organization in IT is seeking a qualified candidate to fill the role of an Associate Business Data Analysis to support Claims and Enterprise initiatives. The ideal candidate will by a dynamic person that has an awareness of AGILE Methodology and can play a multi-faceted role within the team. He/she will be adaptable to change and can work fluidly with a team of resources performing in different roles on the team.\n<br><br>\nWorking with our business partners as well as working in a collaborative environment is a unique chance to understand the internal data collection process as well as delivery of critical business data supporting the all aspects of reporting and analytics. This position offers opportunities to grow your skills in data analysis, data testing, consulting, and customer interfacing competencies.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Collaboration with a high-performing, forward-focused team, Product Owner(s) and Business stakeholders engagement</li>\n<li>Experience working in a fast paced environment driving business outcomes in Agile ways of working</li>\n<li>Part of the team to drive timely and successful delivery of business data capabilities and/or technology objectives</li>\n<li>Applies techniques necessary to draw out data and analytics business requirements for a low complexity initiative.</li>\n<li>Performs data analysis and data profiling with assistance from others.</li>\n<li>Maintains data mapping requirements and other data design artifacts that define business requirements and transformation rules.</li>\n<li>Structure and drive working and informational sessions that promote collaboration, synergy, and achieve desired outcomes.</li>\n<li>Understands the scope of the project and helps resolve scope questions and issues of low complexity related to own work.</li>\n<li>Learn and expand your Analysis capabilities such as business process mapping, data analysis, data testing, data wrangling, and data transformation mappings to build data assets that enable business value generation.</li>\n<li>Learn and Independently performs data analysis, data discovery and data profiling using industry standard querying tools to support business requirements development that are complete, clear, unambiguous, well written and appropriate to audience.</li>\n<li>Be part of a Scrum Team driving work independently or collaboratively towards achieving business outcomes</li>\n<li>Act as liaison, consultant between various business functions impacting organization and leadership</li>\n<li>Clearly give and receive information, requirements and specifications (facts, ideas, perspectives) through verbal, written and presentation communication methods</li>\n<li>Provides support and consulting by answering questions, researching possible solutions to complex problems, and fostering open communication between the customer and development team.</li>\n<li>Acts as a change agent to help and drive implementation of industry best practices.</li>\n<li>2 to 4 years of experience deploying analytical solutions, preferably leveraging SQL</li>\n<li>Bachelor's Degree; preferably in Computer Science, MIS or other related field</li>\n<li>Ability to build effective relationships with business partners</li>\n<li>Strong verbal&amp;written communication skills, with an ability to express complex technical concepts in business terms</li>\n<li>Ability to listen effectively, process information, ask appropriate questions for clarification and execute tasks accordingly</li>\n<li>Strong organizational, planning&amp;problem solving skills</li>\n<li>Experience working in an Agile framework is a plus</li>\n<li>Detail oriented and good documentation skills</li>\n<li>Forward looking and focused on continuous improvement</li>\n<li>Team player and able to work with and through others</li>\n<li>Takes initiatives in building their own technical and soft skills</li>\n<li>Volunteers for extra assignments within the organization driving towards continuous improvements within our Data Delivery Life Cycle.</li>\n<li>Develops current understanding of department technologies and processes; keeps individual development as a priority and manages with AGILE team deliverables.</li>\n</ul>\n\nWhat Else Can You Tell Me?\n<br><br>\nThe Hartford is committed to the education and growth of our Information Technology Professionals. A number of IT Certifications are available to enhance your career and growth potential. IT Professionals at The Hartford may qualify for a stipend up to $1000 per year for additional certifications\n<br><br>\nEqual Opportunity Employer/Females/Minorities/Veterans/Disability/Sexual Orientation/Gender Identity or Expression/Religion/Age"}