{"job title": "Data Analyst", "company": "Ukpeagvik Inupiat Corporation", "city state": "– Dahlgren, VA", "rating": "3.2", "job description": "<strong>DATA ANALYST (RDTE-18-0956-F)</strong>\n<br><br>\nBowhead is seeks a Data Analyst to work as part of a business intelligence and data warehouse team tasked with providing data analysis, data design, systems development, training and customer support.\n<br><br>\nEssential functions for the Data Analyst will include:\n\n\n<ul>\n<li>Systems development activities include data table/structure design, data acquisition, system specifications, data validation and documentation.</li>\n<li>Data Analyst will support includes development of data interfacespecifications, on-line query and report specifications, database load specifications, and data validation specifications.</li>\n<li>Customer support, including interfacing with customers, trouble shooting, product review and analysis and problem resolution.</li>\n</ul>\n\nRequirements• Requires a Bachelor's degree and two (2) years of experience related to database management and development\n\n\n<ul>\n<li>Must have knowledge of relational database management systems and data warehousing</li>\n<li>Must have experience using Cognos Tool Suite to create reports and dashboards</li>\n<li>Skilled in writing and analyzing structured query language (SQL) queries</li>\n<li>Experience and knowledge in mathematical reasoning</li>\n<li>Must have the ability to communicate effectively orally and in writing for required customer support and requirements gathering and validation</li>\n</ul>\n\n<strong>Desired capabilities:</strong>\n\n\n<ul>\n<li>Knowledge of analytical tools and evaluation techniques</li>\n<li>Knowledge of government accounting (highly desired: DOD Accounting)</li>\n<li>Intermediate to advanced level skills in Microsoft Office software suite - Word, Excel, Outlook, PowerPoint</li>\n<li>Ability to communicate effectively with all levels of employees and outside contacts</li>\n<li>Strong interpersonal skills and good judgment with the ability to work alone or as part of a team</li>\n</ul>\n\nSECURITY CLEARANCE REQUIRED: A SECRET clearance is required for all personnel supporting this PWS. All individual contractors must be able to obtain and maintain fully adjudicated SECRET clearances.\n<br><br>\nApplicants may be subject to a pre-employment drug&amp;alcohol screening and/or random drug screen, and must follow UIC's Non-DOT Drug&amp;Alcohol Testing Program requirements. If the position requires, an applicant must pass a pre-employment criminal background history check. All post-secondary education listed on the applicant's resume/application may be subject to verification.\n<br><br>\nWhere driving may be required or where a rental car must be obtained for business travel purposes, applicants must have a valid driver license for this position and will be subject to verification. In addition, the applicant must pass an in-house, online, driving course to be authorized to drive for company purposes.\n<br><br>\nUIC is an equal opportunity employer. We evaluate qualified applicants without regard to race, age, color, religion, sex, national origin, disability, veteran status, and other protected characteristics EOE/AA/M/F/D/V. In furtherance, pursuant to The Alaska Native Claims Settlement Act 43 U.S.C. Sec. 1601 et seq., and federal contractual requirements, UIC and its subsidiaries may legally grant certain preference in employment opportunities to UIC Shareholders and their Descendants, based on the provisions contained within The Alaska Native Claims Settlement Act.\n<br><br>\nAll candidates must apply online at www.uicalaska.com, and submit a completed application for all positions they wish to be considered. Once the employment application has been completed and submitted, any changes to the application after submission may not be reviewed. Please contact a UIC HR Recruiter if you have made a significant change to your application. In accordance with the Americans with Disabilities Act of 1990 (ADA), persons unable to complete an online application should contact UIC Human Resources for assistance (http://www.uicalaska.com/contact-us/human-resources/).\n<br><br>\nUIC Government Services (UICGS / Bowhead) provides innovative business solutions to federal and commercial customers in the areas of engineering, maintenance services, information technology, program support, logistics/base support, and procurement. Collectively, the fast-growing Bowhead Family of Companies offers a breadth of services which are performed with a focus on quality results. Headquartered in Alexandria, VA, we are a fast-growing, multi-million-dollar corporation recognized as one of the top 25 8(a) companies for government contracting.\n<br><br>\n<strong>^ Cut/Paste this Link to Apply:</strong>\n<br><br>\nhttp://bit.ly/2IInMjn\n\n\n<ul>\n<li>Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities.</li>\n<li>Please view Equal Employment Opportunity Posters provided by OFCCP here.</li>\n<li>The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information. 41 CFR 60-1.35(c)</li>\n</ul>\n\nApply OnlineSend This Job to a Friend\n<br><br>\n© Ultimate Software"}