{"job title": "Data Analyst (Entry Level)", "company": "Uniters North America", "city state": "– West Palm Beach, FL", "rating": "2.5", "job description": "<strong>We are seeking a junior-level Data Analyst to join our I.T. team. This is an exciting opportunity for a junior level candidate (min. 1 year of Data Analyst experience) to become involved in</strong> <strong>multiple new and current projects.</strong>\n<br><br>\n<strong>This is a regular, Full Time position which offers the full benefits package upon eligibility (option to participate in medical, dental, vision, life insurance, diability, short and long term disability).</strong>\n<br><br>\n<strong>Due to the immediate need, we are only considering candidates that are local to South Florida.</strong>\n<br><br>\nThe Data Analyst collects and stores data on various technology functionalities by bringing technical expertise to ensure the quality and accuracy of that data, then process, design and present it in ways to help the company make better decisions. This professional takes responsibility for managing our master data set, developing reports, and troubleshooting data issues.\n<br><br>\nData analytics and metrics optimization is key to this role to further company data collection and analysis practices, and assist in instituting new policies, procedures and programs from the ground up.\n<br><br>\n<strong>Essential Functions</strong>\n<ul>\n<li>Managing master data, including creation, updates, and deletion.</li><li>Provide quality assurance of imported data, working with quality assurance analyst if necessary.</li><li>Commissioning and decommissioning of data sets.</li><li>Processing confidential data and information according to guidelines.</li><li>Helping develop reports and analysis.</li><li>Managing and designing the reporting environment, including data sources, security, and metadata.</li><li>Supporting the data warehouse in identifying and revising reporting requirements.</li><li>Supporting initiatives for data integrity and normalization.</li><li>Assessing tests and implementing new or upgraded software and assisting with strategic decisions on new systems.</li><li>Generating reports from single or multiple systems.</li><li>Troubleshooting the reporting database environment and reports.</li><li>Evaluating changes and updates to source production systems.</li><li>Training end users on new reports and dashboards.</li><li>Providing technical expertise on data storage structures, data mining, and data cleansing.</li><li>Review and validate customer data as it is collected.</li><li>Oversee the deployment of data to the data warehouse.</li><li>Develop policies and procedures for the collection and analysis of data.</li><li>Create or discover new data procurement and processing programs.</li><li>Cooperate with our CIO to deploy software and hardware upgrades that make it possible for us to leverage big data use cases.</li><li>Monitor analytics and metrics results.</li><li>Implement new data analysis methodologies.</li><li>Perform data profiling to identify and understand anomalies.</li>\n</ul>\nReasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<br><br>\n<strong>Competencies</strong>\n<ul>\n<li>Ability to analyze existing tools and databases and provide software solution recommendations.</li><li>Ability to translate business requirements into non-technical, lay terms.</li><li>High-level experience in methodologies and processes for managing large scale databases.</li><li>Demonstrated experience in handling large data sets and relational databases.</li><li>Understanding of addressing and metadata standards.</li><li>High-level written and verbal communication skills.</li>\n</ul>\n<strong>Experience:</strong>\n<br><br>\n1-3 years of relevant experience.\n<br><br>\n<strong>Education:</strong>\n<br><br>\nBachelor's degree in Computer Science or related field is preferred.<br><br>0\n<br><br>\n<strong>Job Posted by ApplicantPro</strong>\n<br>"}