{"job title": "Senior Lecturer in Quantitative Research Methods", "company": "University of Chicago", "city state": "– Chicago, IL", "rating": "3.9", "job description": "Senior Lecturer in Quantitative Research Methods The Division of Social Sciences at the Employer\n<br>\ninvites applications for a position as Senior Lecturer in a\n<br>\nnew Committee on Quantitative Methods in Social, Behavioral, and\n<br>\nHealth Sciences. This is a full-time teaching position beginning\n<br>\nSeptember 2019 with a renewable three-year term contingent upon\n<br>\nsatisfactory performance review. The salary (nine months) and\n<br>\nbenefits are competitive commensurate with experience.\n<br>\nTo be eligible, candidates must have a PhD in a social,\n<br>\nbehavioral, or health science field with a strong focus on the\n<br>\napplication of quantitative research methods and a record of\n<br>\nexcellence in teaching and advising/mentoring students.\n<br>\nThe Senior Lecturer will teach four courses per year in\n<br>\nquantitative research methods (at least one course per quarter\n<br>\nduring the three-quarter academic year). One course will be a\n<br>\ndiscussion session prior to each biweekly Quantitative Research\n<br>\nMethods (QRM) Workshop; the discussion session is designed to\n<br>\nengage students in technical writings that each workshop speaker\n<br>\nwill distribute ahead of time, provide scaffolding in content\n<br>\nknowledge, and facilitate student participation in intellectual\n<br>\nexchanges. For the remaining three courses, the ideal candidate\n<br>\nwould be able to teach one or two courses on psychometrics and\n<br>\nmultivariate statistics, and one or two courses to be determined on\n<br>\na yearly basis according to individual expertise and program needs.\n<br>\nThe courses will be open to undergraduate, master's, and doctoral\n<br>\nstudents. Additional responsibilities will include the\n<br>\n<strong>following:</strong>\n<br>\nProgram Development and Management\n<br><br>\nparticipate in applicant evaluation, admissions decisions, and\n<br>\nrecruitment for the Master of Arts Program in Social Sciences\n<br>\n(MAPSS) section for Quantitative Methods and Social Analysis\n<br>\n(QMSA); advise individual M.A. theses as needed; participate in\n<br>\nhiring decisions, training, supervision, and evaluation of an\n<br>\nadvanced doctoral student Preceptor in MAPSS for the QMSA\n<br>\nsection;\n<br>\nco-author doctoral training grant applications and manage or\n<br>\nparticipate in managing training grant awards;\n<br>\nwork with the faculty director of QRM and the Curriculum\n<br>\nSubcommittee to lead ongoing development and review of the\n<br>\ncurriculum for a new certificate in Advanced Quantitative Methods\n<br>\nfor students enrolled in graduate degree programs and ensure that\n<br>\nthe curriculum reflects the latest methodological developments;\n<br>\ndefine and evaluate learning objectives across curricular and\n<br>\nco-curricular initiatives; implement faculty-approved changes\n<br>\nacross the curriculum; coordinate QRM course offerings across\n<br>\ndepartments for each following academic year;\n<br>\nlead ongoing development and review of the curriculum for a\n<br>\ncollege minor in Quantitative Social Analysis;\n<br>\norganize the biweekly Quantitative Research Methods (QRM)\n<br>\nWorkshop; participate in selecting, orientating, and hosting\n<br>\nexternal speakers (including engaging intellectually with\n<br>\nscholarship in various fields);\n<br>\noversee regular updating of academic information on the QRM\n<br>\nwebsite;\n<br><br>\nAcademic Advising\n<br><br>\norganize quarterly information sessions and advise students on\n<br>\ncourse opportunities in quantitative methods;\n<br>\nadvise MAPSS QMSA students who are applying to PhD programs or\n<br>\nare seeking other professional placement, write letters of\n<br>\nrecommendation.\n<br><br>\nApplicants must apply on the University of\n<br>\nChicago's Academic Career Opportunities website at https://tinyurl.com/y9agxd7k.\n<br>\nThe following materials should be submitted: 1) a cover letter\n<br>\ndescribing academic specialty, teaching interests, and\n<br>\nqualifications for teaching, 2) a curriculum vitae, 3) a\n<br>\nchapter-length writing sample, 4) Syllabi for two proposed courses,\n<br>\n5) course evaluations or evidence of past teaching\n<br>\nperformance, and 6) three letters of reference. Review of\n<br>\napplications will begin September 22, 2018 and will continue until\n<br>\nthe position is filled or the search is closed. Later applicants\n<br>\nare encouraged to contact Aasha Francis,\n<br>\nafrancis1@uchicago.edu, for updates on the status of the\n<br>\nsearch.\n<br>\nThe Employer is an Affirmative Action / Equal\n<br>\nOpportunity / Disabled / Veterans Employer and does not\n<br>\ndiscriminate on the basis of race, color, religion, sex, sexual\n<br>\norientation, gender identity, national or ethnic origin, age,\n<br>\nstatus as an individual with a disability, protected veteran\n<br>\nstatus, genetic information, or other protected classes under the\n<br>\nlaw. For additional information please see the University's Notice\n<br>\nof Nondiscrimination at http://www.uchicago.edu/about/non_discrimination_statement/.\n<br>\nJob seekers in need of a reasonable accommodation to complete the\n<br>\napplication process should call 773-702-0287 or email ACOppAdministrator@uchicago.edu with\n<br>\ntheir request.\n<br>\n<strong>Required Application Documents:</strong>\n<br><br>\nCover Letter\n<br>\nCurriculum Vitae\n<br>\nWriting Sample\n<br>\nSyllabi\n<br>\nTeaching Evaluations\n<br>\nThree letters of reference\n<br><br>\nPosting Link: https://tinyurl.com/y9agxd7k\n<br><br>\nThe Chronicle of Higher Education. Keywords: Lecturer, Location: Chicago, IL - 60637"}