{"job title": "EH Clinical Practice Data Analyst Coordinator", "company": "University of Illinois at Chicago", "city state": "– Chicago, IL", "rating": "4.0", "job description": "UIC College of Nursing seeks a highly qualified QI / Performance Measurement Specialist (Clinical Practice Data Coordinator) to carry out functions within the Illinois Department of Corrections (IDOC) contract. Ideal candidate will demonstrate skills managing a balanced performance measurement system within a clinical organization, including collecting data, displaying data, interpreting data, reporting results, assisting leaders to use data for decision-making.\n<br><br>\n<strong>Duties:</strong>\n<br><br>\nThe consultant(s) responsible for developing the performance measurement system must include the following:\n\n\n<ul>\n<li>Recommended system-wide balanced performance measures for all health care units within the IDOC prisons.</li>\n<li>Development of a recommended database for holding and managing the performance data for both the system-wide and prison-specific levels.</li>\n<li>Development of a recommended data collection plan and process for both the system-wide and prison-specific levels. (This will initially be a manual process, but will progress to an electronic process.)</li>\n<li>Development of a recommended data analysis and display strategy for both the system-wide and prison-specific levels.</li>\n<li>Presentation of an example of the performance measurement system on a small scale</li>\n<li>Recommended process for reviewing and revising the performance measures at both the system-wide and prison-specific levels.</li>\n</ul>\n\nThe following activities will be essential to generating the deliverables listed above:\n\n\n<ul>\n<li>Review of documents reflecting the current performance measurement system.</li>\n<li>Identification of high risk, high volume, problem prone, and high cost patient populations.</li>\n<li>Participation in meetings with executives to solicit the voice of the customer and achieve proof of concept.</li>\n<li>Site visits and interviews with different team members to elicit voice of the customer.</li>\n<li>Participation in meetings with key site team members to achieve proof of concept.</li>\n<li>Meetings with executives and different team members to identify learning needs and preferences.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n<br><br>\n<strong>QUALIFICATIONS REQUIRED:</strong>\n\n\n<ul>\n<li>Bachelor's degree in Science, Information Management, Healthcare Information, Nursing, Information Technology, Computer Science, Statistics, Finance, Management Engineering, Business or closely related fields or as required by the position to be filled in the area of specialization inherent in the position may be required.</li>\n<li>Two (2) years (24 months) of data management/analyst work experience in a clinical or healthcare related field</li>\n</ul>\n\nApplicants possessing a Master's degree, in a closely related field, meet the requirements for #1 above\n<br><br>\nKNOWLEDGE, SKILLS AND ABILITIES (KSAs)\n\n\n<ul>\n<li>Knowledge of relational databases, query reporting, and report specification development</li>\n<li>Knowledge of database and report writing software such as Access, Business Objects, and Crystal reporting</li>\n<li>Proficiency with Excel and a statistical package such as SAS, SPSS, or Minitab</li>\n<li>Project management and time management skills</li>\n<li>Programming skills with proficiency at queries and report writing and understanding of XML and SQL data file structures required</li>\n<li>Experience with Access, Business Objects, and/or report writing software- e.g. Crystal reporting</li>\n<li>Ability to convert abstract concepts into manageable analytic approaches</li>\n<li>Experience with complex project management and time management 9. Ability to communicate effectively both verbally and in writinG</li>\n</ul>\n\nExperience building an electronic performance measurement system is preferred. Strong IT skills required. Familiarity with HEDIS measures. Knowledge of performance improvement software applications for health care preferred. Ability to travel across the state."}