{"job title": "Repair Options Data Analyst", "company": "Wagner Equipment Co.", "city state": "– Aurora, CO", "rating": "3.0", "job description": "Wagner Equipment Co., the Caterpillar dealer for Colorado, New Mexico and far west Texas, is seeking applications for a Repair Options Data Analyst <strong>in Aurora, CO.</strong>\n<br><br>\nThe Service Repair Options Analyst is primarily responsible for review and analysis of service repair options performance within the Wagner Equipment Co. business system. Repair Options are the foundation of our service pricing strategy to customers. Standard work drives our service efficiency for added safety, consistency, quality and profitability of Repair Options. Review and maintenance of Repair Options and standard job performance in our service areas will enhance productivity in the service operational areas.\n<br><br>\n<strong><u>ESSENTIAL FUNCTIONS AND BASIC DUTIES</u></strong>\n<br><br>\n<strong>Administrative:</strong>\n<ul>\n<li>Analyses standard job and Repair Option performance on work orders compared to historical performance</li><li>Builds standard work processes related to Repair Options in all service areas</li><li>Performs analysis on all systems used to review, create, update, and distribute service repair options, (i.e., DBS, Builder, Quoter, MS Excel, SalesLink, and etc.)</li><li>May participate in the service definition committee meetings</li><li>Develops reports about service Repair Options and standard work as necessary</li>\n</ul>\n<strong>Interpersonal:</strong>\n<ul>\n<li>Work with operations to determine the need for new repair options</li><li>Work with operations on reasons for repair option variances and how to correct</li>\n</ul>\n<strong>Technical:</strong>\n<ul>\n<li>Analysis of service performance on standard jobs relating to target labor hours vs. actual labor hours, target parts and misc. charges compared to actual</li><li>Makes recommendations for changes to standard jobs based upon analysis of work order performance</li><li>Works with Marketing, IT, Product Support and Service Operations to create and maintain the Repair Options quoting tools</li>\n</ul>\n<strong><u>ESSENTIAL JOB REQUIREMENTS</u> </strong><strong>Minimum Education Required:</strong>\n<br><br>\nHigh School Diploma or GED\n<br><br>\nCollege degree or trade school would be helpful\n<br><br>\n<u>Prior experience as a technician is not required, however, it would be very helpful in this role. At a minimum, a candidate for this position should be familiar with the BASIC function and relationships of machine components. Examples: Boom cylinders, hydrostatic drive, hydraulic pumps, transmissions, final drives, crankshaft, camshaft, torque converter, cylinder heads, intake and exhaust valves, turbo chargers, and etc.</u>\n<br><br>\n<strong><u>Required</u></strong><strong> Skills and Competencies:</strong>\n<br><br>\nData Entry\n<br><br>\nOrganizational Skills\n<br><br>\nTelephone Skills\n<br><br>\nCommunication Skills\n<br><br>\nSafety Knowledge\n<br><br>\nMath Skills\n<br><br>\nReading / Writing Skills\n<br><br>\nProduct Knowledge\n<br><br>\nReasoning Skills\n<br><br>\n<strong>Computer Skills:</strong>\n<br><br>\nMicrosoft Word\n<br><br>\nMicrosoft Excel\n<br><br>\nMicrosoft Outlook\n<br><br>\nMicrosoft PowerPoint\n<br><br>\nMicrosoft Access\n<br><br>\nDBS\n<br><br>\nCRM/Sales Link\n<br><br>\nET / SIS / SIS Web / STW\n<br><br>\nWagner offers great benefits including medical/dental/vision insurance, 401K, tuition reimbursement and more.\n<br><br>\nWagner Equipment Co. is an EEO/AA/Veterans/Disabled employer.<br><br>0"}