{"job title": "Statistical Data Analyst II - Health Communication Research Laboratory", "company": "Washington University In St. Louis", "city state": "– Saint Louis, Missouri", "rating": "4.2", "job description": "Job Type/Schedule<br><br>This position is full-time and works approximately 37.5 hours per week.<br><br>Department Name/Job Location<br><br>This position is in the Department of Health Communication Research Laboratory. This position is for the Danforth Campus.<br><br>Essential Functions<br><br><strong> POSITION SUMMARY:</strong>\n<br><br>\nThe Health Communication Research Lab (HCRL) in the School of Social Work conducts research to assess and address health disparities. The individual will primarily be responsible for the data management of a 5-year grant project involving individual survey data and longitudinal administrative health care billing and claims data. The analyst will: 1) assist in the secure electronic transfer of large data sets; 2) perform data management activities, including cleaning, quality checks, and creation of variables for analysis; 3) perform statistical analyses; and 4) contribute to the reporting of results. The individual will work independently with mentoring from senior staff and statisticians, and in collaboration with other project staff.\n<br><br>\n<strong> PRIMARY DUTIES AND RESPONSIBILITIES:</strong>\n<li> Manage data. Prepare administrative and survey data for analysis. Create and maintain comprehensive data codebooks and syntax. Perform regular quality control checks of data.</li> <li> Perform statistical analyses of data collected. Analyze data, interpret statistical test results, and summarize findings in graphical and written formats.</li> <li> Develop and maintain databases that efficiently and systematically provide contact information of identified health plan members to research assistants for recruitment and data collection. Support the recruitment and data collection needs of the project, as needed.</li> <li> Help prepare findings for dissemination in various forms (presentations, papers, reports). Draft narrative description of methods and results for journal articles, etc.</li> <li> Other duties as assigned.</li>\n\nRequired Qualifications\n\n<li> Masters degree and one year of related work experience or Bachelors and 3 years of related work experience in public health, computer science, statistics, biostatistics, psychology, social sciences, or related field.</li> <li> Experience merging, managing, and analyzing large longitudinal datasets.</li> <li> Excellent computer skills. A minimum of two years of experience with data analysis and working with programming software such as SAS, R, Stata, Mplus, SQL, Python and other programming languages in addition to reporting tools such as Word, Excel, Powerpoint, Access or FileMaker Pro, Visual Basic, and others.</li> <li> Ability to learn and independently perform new applications and procedures.</li>  <li> Attention to detail and ability to juggle multiple projects and deadlines.</li> <li> Ability to verbally communicate complex issues with clarity to different types of audiences (e.g., academic, health plans, community).</li>  <li> Ability to collaborate with others, working independently and with team members, including students, staff and faculty.</li>\n\nPreferred Qualifications\n\n<li> Completed Masters degree in public health, biostatistics, psychology or behavioral science, or related field with 2 years related experience.</li> <li> Experience managing, coding, and analyzing medical record or health plan administrative data (e.g., ICD, CPT codes etc.)</li> <li> Experience selecting and conducting the best inferential statistical tests for a given research question.</li> <li> Experience with some of the following: survival analysis, hierarchical linear modeling, mixed effects models, latent class analysis, growth mixture modeling, structural equation modeling, power analysis, sampling and weighting, propensity scores, multiple imputation, simulation models, cost effectiveness analysis, and others topics.</li> <li> Strong, effective, written and oral communication and interpersonal skills required. Ability to communicate with staff and investigators about data fields and coding algorithms, complex issues and analytic results with clarity.</li> <li> Excellent organizational skills. Ability to maintain a complex set of data management tasks, monitor quality, and prioritize workflow. Ability to work effectively while balancing competing demands of multiple assignments. Attention to detail and accuracy in editing, recordkeeping, etc.</li> <li> Desire to learn new skills, show initiative and independently perform new applications and procedures.</li> <li> Ability to collaborate with others, working independently and collaboratively with team members, including students, staff and faculty.</li>\n\nSalary Range<br><br>The hiring range for this position is $44,090 - $56,238 annually or commensurate with experience.<br><br>Benefits<br><br>-Retirement Savings Plan\n\n\n<ul>\n<li>22 vacation days</li>\n<li>8 Paid Holidays</li>\n<li>Sick Time</li>\n<li>Tuition benefits for employee, spouse and dependent children</li>\n<li>Free Metro Link/ Bus pass</li>\n<li>Free Life Insurance</li>\n<li>Health, Dental, Vision</li>\n<li>Health Savings Accounts (HSA)</li>\n<li>Long Term Disability Insurance</li>\n<li>Flex Spending Plan</li>\n<li>Other Benefits</li>\n</ul>\n\nHuman Resources website (hr.wustl.edu)<br><br>EOE Statement<br><br>Washington University is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity or expression, national origin, genetic information, disability, or protected veteran status."}