{"job title": "Research Scientist - Amazon Restaurants", "company": "Amazon", "city state": "– US, WA, Seattle", "rating": "3.8", "job description": "Amazon Restaurants has a culture of data-driven decision-making, and requires business intelligence that is timely, accurate, and actionable. We are looking for a top-notch product-minded Research Scientist who excels in analyzing data from multiple sources, can make sense of the results, and is able to communicate findings to senior leadership to help define our business strategy with actionable insights. As a research scientist, you will be focused on the most difficult and impactful problems within amazon restaurants. You will help to build the framework that will power our new products and initiatives across the business. You will be the go-to person for modeling and advanced analytics on one or more of the Amazon Restaurants business units such as Marketing, Product, Operations, and Sales.\n<br><br>\n<strong>In this role, you will:</strong>\n<br><br>\n· Design and develop models and machine learning to drive key business and product decisions\n<br>\n· Develop models to measure the downstream impact of our business\n<br>\n· Work with product managers to define the product strategy and priorities\n<br>\n· Collaborate with applied scientists and software engineers to develop and productionalize machine learning prediction models for real time order forecasting, personalization, driver route optimization and performance tracking\n<br>\n· Work closely with Marketing team to develop customer segmentation and retention models\n<br>\n· Drive deep statistical analyses to answer top business questions such as optimal selection, personalization strategies, and delivery cost optimization\n<br>\n· Work with Sales leadership to come up with expansion strategies\n<br>\n· Effectively balance scalability, performance, accuracy, and business needs in design decisions\n<br>\n· Combine expert knowledge of statistical methodologies and analysis with advanced programming skills to support complex analyses\n<br>\n· Be the champion of high standards for data collection, reporting and analysis across the team\n<br>\n· Be a consultant for the leaders across the business in driving key strategic decisions\n<br><br>\n<strong>The right candidate:</strong>\n<br>\n· Has a proven track record of handling complex and large data sets, and translating data into actionable insights to drive business decisions\n<br>\n· Possesses excellent communication skills and business understanding with the ability to influence leadership and partner teams\n<br>\n· Has a solid background in efficient and scalable data mining, along with the ability to utilize data in analyses and statistical modeling\n<br>\n· Enjoys partnering with business owners to identify the right questions to answer, and analyze data to answer them\n<br>\n· Enjoys mentoring and developing other engineers on the team"}