{"job title": "Scientist, Neuroscience Translational Biomarkers", "company": "Amgen", "city state": "– Cambridge, MA", "rating": "3.7", "job description": "Few careers offer the opportunity to make a difference in people's lives. At Amgen, the world's largest\n<br><br>\nbiotechnology company, the Neuroscience Team is committed to serving patients by carrying out innovative science and exploiting new advances in biology and human genetics.\n<br><br>\nWe are seeking a Scientist to join a vibrant and growing group currently focusing on Neurodegenerative diseases within the Neuroscience Therapeutic Area, a key component of the Discovery Research unit at Amgen's site in Cambridge, MA (Amgen Massachusetts-AMA). The candidate must be a Scientist with in-depth knowledge of biomarker discovery and assay develop to participate in ongoing efforts directed toward developing new and effective therapeutics for neurodegenerative diseases including Alzheimer's disease (AD), Parkinson's disease (PD) and ALS.\n\n\n<ul>\n<li>*Position Responsibilities**</li>\n</ul>\n\n+ Conceptualize, design and independently execute broad sets of experiments required to identify, develop and validate novel target engagement and disease biomarkers to support ongoing therapeutic programs\n<br><br>\n+ Develop innovative strategies and mechanisms for identifying novel biomarker candidates\n<br><br>\n+ Establish and manage biomarker work and studies outsourced to contract research organizations and academic labs\n<br><br>\n+ Critically analyze and interpret data, define realistic timelines for studies and meet delivery deadlines\n<br><br>\n+ Work closely with and communicate results to multi-disciplinary and cross-functional teams\n<br><br>\n+ Present strategies and results to project teams\n<br><br>\n+ Execute high impact studies within an extremely fast-paced and collaborative environment\n\n\n<ul>\n<li>*Basic Qualifications**</li>\n</ul>\n\nDoctorate degree\n<br><br>\n<strong>OR</strong>\n<br><br>\nMaster's degree and 4 years of Scientific experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nBachelor's degree and 6 years of Scientific experience\n\n\n<ul>\n<li>*Preferred Qualifications**</li>\n</ul>\n\n+ In-depth knowledge of biomarker discovery and assay development to participate in preclinical PK-PD evaluation and translational biomarker efforts.\n<br><br>\n+ Familiarity with biomarker assay development on various platforms including plate-based ELISA, MSD, Simoa, etc.\n<br><br>\n+ Background in neurodegenerative disease with familiarity of AD, PD and/or ALS.\n<br><br>\n+ Established scientific reputation as evidenced by an outstanding publication track record\n<br><br>\n+ Experience working in a cross-functional and matrixed organization and/or a highly collaborative research environment\n<br><br>\n+ Highly motivated self-starter with a demonstrated ability to work independently with minimal oversight\n<br><br>\n+ Outstanding interpersonal and communication skills\n<br><br>\nAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.\n<br><br>\nAmgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.\n<br><br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status."}