{"job title": "Senior Scientist- Pharmacology", "company": "Amgen", "city state": "– Thousand Oaks, CA", "rating": "3.7", "job description": "Amgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.\n<br><br>\nThe Senior Scientist role is part of the creation of a new Safety &amp; Exploratory Pharmacology group within Comparative Biology and Safety Sciences (CBSS) at Amgen reporting to the Head of Safety and Exploratory Pharmacology. We are seeking a talented Senior Scientist to join our group, assume responsibilities for non-GLP and GLP safety pharmacology studies and contribute to a lab-based in vivo pharmacology group. This group manages studies conducted with CRO partners and conducts early pharmacological evaluation of new agents for cardiovascular risk and operates in a non-GLP environment.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nKey part of an expert team to impact development of both small molecule and large molecule therapeutics\n<br><br>\nSupport projects with existing models and contribute to the development of novel experimental strategies and systems to aid cardiovascular safety evaluation\n<br><br>\nExisting efficacy models are also used to support therapeutic area compound selection\n<br><br>\nDesign experiments, interpretation of data and oral and written presentation of results, and the potential to manage scientific staff\n<br><br>\nServe in the development, review / evaluation, and interpretation of experiments that support the nomination and clinical development of new molecules\n<br><br>\n<strong>Basic Qualifications:</strong>\n<br><br>\nDoctorate degree and 2 years of Pharmacology, Physiology or Toxicology experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nMaster's degree and 5 years of Pharmacology, Physiology or Toxicology experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nBachelor's degree and 7 years of Pharmacology, Physiology or Toxicology experience\n<br><br>\n<strong>Preferred Qualifications:</strong>\n<br><br>\nPh.D. in Pharmacology, Physiology or related scientific discipline with 4+ years of experience (post-doctoral research included)\n<br><br>\nPrior pharmaceutical, medical device, or biotechnology experience\n<br><br>\nProven track record of scientific accomplishments and 4+ years experience in conducting cardiac electrophysiological evaluations in multiple species\n<br><br>\nPossess the ability to evaluate cardiac function and hemodynamics (e.g. pressure volume loops) and measurements of cardiac electrical activity (cardiac intervals).\n<br><br>\nExperience in recording localized atrial, ventricular, HIS bundle, and body surface electrograms or programmed cardiac pacing paradigms to measure atrial and ventricular conduction intervals and refractory periods\n<br><br>\nScience based, team-oriented, effective organizational and communication skills and be able to build relationships with the current lab technical team, and discovery research staff\n<br><br>\nPrior experience in conducting cardiac electrophysiological evaluations in vivo\n<br><br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status."}