{"job title": "Scientist - Discovery Technologies", "company": "Amgen", "city state": "– Thousand Oaks, CA", "rating": "3.7", "job description": "Amgen is a biopharmaceutical leader founded on discovering, developing, manufacturing, and delivering innovative human therapeutics. Amgen's Discovery Technologies laboratory within Therapeutic Discovery is seeking a highly motivated high throughput mass spectrometry Scientist at Amgen headquarters in Thousand Oaks.\n<br><br>\nThe successful candidate will be responsible primarily for the development of Affinity Selection Mass Spectrometry methods for screening and characterizing small molecule ligands of protein targets as part of an integrated drug discovery effort. Additional responsibilities may include the development and execution of mass spectrometric-based enzyme assays or the characterization of protein-small molecule adducts as part of our efforts toward the discovery of new drugs.\n<br><br>\nThe successful candidate will work closely with biology and chemistry teams to develop new assays and strategies, analyze results, and present and discuss high quality data in a timely manner and should also contribute to skills development and mentoring for colleagues in a highly multi-disciplinary environment.\n\n\n<ul>\n<li>*Basic Qualifications**</li>\n</ul>\n\nDoctoral degree\n<br><br>\n<strong>OR</strong>\n<br><br>\nMaster's degree and 4 years of scientific experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nBachelor's degree and 6 years of scientific experience\n\n\n<ul>\n<li>*Preferred Qualifications**</li>\n</ul>\n\nDoctoral degree and 2 years of mass spectrometry experience\n<br><br>\nDeep knowledge of MS techniques especially as applied to Affinity Selection MS or to the high-throughput analysis of protein-small molecule interactions\n<br><br>\nExperience with the operation, troubleshooting, and maintenance of Q-TOF, QQQ, and/or MALDI mass spectrometers, including the use of LC, SPE, or SEC separation techniques. Familiarity with Agilent, SCIEX, and Bruker instrumentation and software e.g. Agilent MassHunter and SCIEX MultiQuant software is desirable\n<br><br>\nExperience in the development of LC-MS, LC-MS/MS, or SPE-MS methods for the development of affinity selection-based MS assays, MS-based enzyme assays, or to characterize of protein-small molecule adducts\n<br><br>\nFamiliarity with the principles of high-throughput screening (HTS) and experience with microplate readers and automated liquid handling systems for HTS\n<br><br>\nDemonstrated ability to work both independently and as a member of a multidisciplinary team\n<br><br>\nExcellent written and oral communication skills for the timely documentation, presentation, and discussion of science-based results and strategy in a dynamic, multi-disciplinary, team-based environment\n<br><br>\nAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. Amgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.\n<br><br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status."}