{"job title": "Medical Scientist, Immuno-Oncology", "company": "AstraZeneca", "city state": "– US - Gaithersburg - MD", "rating": "3.8", "job description": "<strong><u>Job Description: Medical Scientist, Immuno-Oncology</u></strong>\n<br><br>\n<strong>Location: Gaithersburg, Maryland</strong>\n<br><br>\n<strong>Salary: We offer a competitive salary and benefits package.</strong>\n<br><br>\nAt AstraZeneca we work together across global boundaries to make an impact and find answers to challenges. We do this with integrity, even in the most difficult situations because we are committed to doing the right thing.\n<br><br>\nThis is an exciting period for us, as well as for those poised to join us. Our strategy and ability to transform our portfolio means we have a late stage pipeline that presents incredible opportunities to push the boundaries of science to deliver life-changing medicines.\n<br><br>\nIn Global Medicines Development (GMD), our mission is to transform innovative molecules into medicines that change lives. We are responsible for enabling the business to make critical pipeline and investment decisions, to ensure they select the right molecules to progress and to seize the right life-cycle management opportunities –generating the data required to drive regulatory submissions for new medicines and expanded indications and generating the evidence that shows their true value. With the transformation of our late stage pipeline, we have an incredible number of opportunities. Now, more than ever, it’s critical that we deliver exceptional performance and drive the best and most transformative programmes for every drug project. Our operating model is focused on achieving this.\n<br><br>\nAstraZeneca is a leader in IO combination therapy, with a pipeline focused on exploring the potential of immuno-oncology combinations.\n<br><br>\nOur differentiated strategy of combining IO therapies is leading in key tumour types such as non-small cell lung cancer, head and neck cancer, and bladder cancer, where combined checkpoint blockade will address a significant unmet need for patients who may not benefit from monotherapies. We believe our unique IO development program will play a critical role in continuing to redefine the cancer treatment paradigm, potentially replacing the need for chemotherapy.\n<br><br>\n<strong>Main Duties and Responsibilities:</strong>\n<br><br>\nYou will be a renowned expert in your own field and may specialize in more than one area. You will work independently with guidance in only the most complex situations and be a close partner to the physician on the team. You may coordinate the activity of a research team and will hold full accountability for projects, often with Global impact. You will have key relationships internally with clinical project teams, marketing and business development, and brand or therapy area team leaders, and externally with regulatory bodies and external service providers.\n<br><br>\nYou will develop and design studies to determine the scientific or commercial viability of a particular drug or portfolio of drugs and interpret the results of these studies, either as the head of a team, or by providing expert input. You’re expected to participate in protocol writing and strategy and ensure that all aspects of work being carried out by yourself or your team is done with a focus on the commercial viability of the drug under development.\n<br><br>\nYou will coordinate actions between research and development, manufacturing and marketing teams to ensure the success of product development at each stage of the product life cycle. You have responsibility for determining the commercial and scientific viability of drugs, and making decisions about whether to continue their development and how much resources to invest in them, or contribute to this decision-making process as a valued expert. You will communicate information to multiple teams in various areas of the drug development process, ensuring all involved parties are aware of important developments in other areas of the product life cycle.\n<br><br>\nYou will manage cross functional projects to ensure the successful passage of drugs through all phases of the drug development process, or contribute to one or more elements of such a project as a technical expert. You could be performance managing a team of clinical research professionals, setting goals and objectives and overseeing their professional development, whilst ensuring your own work, and work of team, is compliant with Safety, Health and Environment standards and all other relevant internal and external regulations. You will review and interpret medical data and clinical trial data and come up with conclusions as well as review patient consent forms and provide opinion on whether or not that matches the data. You will engage in literature search and author background section of the disease from the literature search and provide initial screening for study proposals to ensure information’s accurate; provide first review of the ISS proposals. You will also have responsibility for delivery of pieces of the trials and may lead submissions from a process standpoint.\n<br><br>\n<strong>Essential Requirements:</strong>\n<ul>\n<li>PhD in a scientific field is required; considerable relevant experience in the pharmaceutical industry is preferred, however academic experience will be considered provided the candidate has current immune-therapy / oncology clinical trials experience.</li><li>Good transferable project experience across phases I - III drug development.</li><li>Experience managing and interpreting the results of clinical trials as well as exposure to writing protocols to some degree.</li><li>Strong analytical skills.</li><li>Experience of authoring scientific documents.</li><li>Well-developed communication skills.</li><li>Experience leading and managing a team and project management experience is desirable (evidence of leading cross functional teams focussing on good communication, passion for customers and working collaboratively).</li><li>Sufficient technical and disease area knowledge to be able to interact with confidence with internal and external partners.</li>\n</ul>\n<strong>Next Steps – Apply today!</strong>\n<br><br>\n<strong>To be considered for this exciting opportunity, please complete the full application on our website at your earliest convenience – it is the only way that our Recruiter and Hiring Manager can know that you feel well qualified for this opportunity. If you know someone who would be a great fit, please share this posting with them.</strong>\n<br><br>\n<strong>AstraZeneca is an equal opportunity employer. AstraZeneca will consider all qualified applicants for employment without discrimination on grounds of disability, sex or sexual orientation, pregnancy or maternity leave status, race or national or ethnic origin, age, religion or belief, gender identity or re-assignment, marital or civil partnership status, protected veteran status (if applicable) or any other characteristic protected by law. AstraZeneca only employs individuals with the right to work in the country/ies where the role is advertised.</strong>\n<br><br>\n<strong>Date Posted</strong><br><br>07-Aug-2018<br><br><strong>Closing Date</strong>"}