{"job title": "Research Scientist I", "company": "Integrated DNA Technologies", "city state": "– US-CA-Redwood City", "rating": "3.6", "job description": "<div><div>\n<div>The Research Scientist I, under direct supervision, conducts bench scientific experimentation that advances the basic science of nucleic acids and nucleic acid technology and assists with development and characterization of new IDT genomics products in NGS, qPCR and functional genomics. This position is responsible for performing experiments, analyzing data and reporting findings.</div>\n</div>\n</div>\n\n<br>Responsibilities<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li>Applies knowledge of basic science and employs basic laboratory skills to execute bench experiments using variety of molecular biology, cell biology, biochemical and general laboratory techniques as directed.</li><li>Troubleshoots problems of limited to moderate scope, under close supervision.</li><li>Analyzes raw data and reports results.</li><li>Utilizes mathematical, graphical, nucleic acid analysis, and other software aids as needed.</li><li>Operate and maintain laboratory equipment.</li><li>Maintain accurate and detailed records of experimental work.</li><li>Assists in the preparation of technical reports for internal use.</li><li>Interacts with and assists other members of the R&amp;D team as needed to meet research &amp; development objectives.</li><li>Interacts with and assists IDT employees outside of the R&amp;D team as directed to meet company objectives.</li><li>Presents technical data at group meetings as directed.</li><li>Participates in the maintenance of laboratory cleanliness and equipment.</li><li>Uses radioactive materials and autoradiography, on occasion, during the course of experimental work.</li><li>Demonstrates behavior consistent with the Integrated DNA Technologies Core Values.</li><li>Performs other duties as assigned.</li></ul></div>\n</div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div><strong>Education:</strong>\n<ul>\n<li>Bachelor’s degree in Biology, Genetics, Chemistry, or a related life sciences field required.</li>\n</ul>\n<strong>Professional Experience:</strong>\n<ul>\n<li>Proficiency in a variety of PC software programs with strong working knowledge of Microsoft Office required</li><li>Previous lab experience in molecular biology, genetics, biochemistry, chemistry or other scientific discipline preferred.</li><li>Familiarity with DNA sequence analysis/bioinformatics applications preferred.</li>\n</ul>\n<strong>Other Job Qualifications:</strong>\n<ul>\n<li>Strong organizational skills and attention to detail.</li><li>Ability to multitask and maintain several projects at one time.</li><li>Good verbal and written communication skills.</li><li>Ability to communicate with peers and all levels of management.</li><li>Ability to perform a variety of duties, often changing from one task to another without loss of efficiency or composure.</li><li>Ability to maintain both a high standard of courtesy and cooperation in dealing with co-workers.</li><li>Adaptability to situations requiring the precise attainment of set limits, tolerances or standards.</li><li>Ability to perform repetitive work or to perform continuously the same work, according to set procedures sequence or pace.</li>\n</ul>\nIntegrated DNA Technologies is an equal employment and affirmative action employer. Minorities, women, veterans and individuals with disabilities are encouraged to apply.</div>\n</div>\n</div>\n<br>"}