{"job title": "Senior Scientist, Biomarker Signatures", "company": "Johnson &amp; Johnson", "city state": "– San Diego, California", "rating": "4.0", "job description": "Janssen Pharmaceuticals, Inc, a member of Johnson &amp; Johnson's Family of Companies, is recruiting for a Senior Scientist, Biomarker Signatures located in La Jolla, CA.\n<br><br>\nJanssen Pharmaceutical Companies of Johnson &amp; Johnson are dedicated to addressing and solving the most important unmet medical needs of our time, including in oncology, immunology, neuroscience, infectious disease, and cardiovascular and metabolic diseases. Driven by our commitment to patients, we develop sustainable, integrated healthcare solutions by working side-by-side with healthcare stakeholders, based on partnerships of trust and transparency.\n<br><br>\nThriving on a diverse company culture, celebrating the uniqueness of our employees and committed to inclusion. Proud to be an equal opportunity employer.\n<br><br>\nThe Senior Scientist, Biomarker Signatures will be a member of the Neuroscience Biomarkers team, and will be responsible for assessing and validating new biomarker technologies related to the Mood Disorder and Neurodegenerative Disease areas, with an emphasis on genetic and epigenetic biomarkers.\n<br><br>\n<strong>The Scientist will:</strong>\n\n\n<ul>\n<li>Focus on identifying and validating biomarker signatures aimed at diagnosis &amp; staging, stratification, therapy response, and relapse prediction, using genetics and epigenetics data, fluid biomarkers, omics - phenotype associations, and neuro-functional measurements.</li>\n<li>Provide input and results to Mood and Neurodegeneration biomarker experts in therapeutic discovery, clinical translation and clinical development.</li>\n<li>Work with internal and external collaborators/partners/CROs, to develop and validate biomarker signatures for mood disorders and Neurodegeneration.</li>\n<li>Interface internally with Project and Bioinformatics Scientists and Laboratory Personnel, and interact outside of the immediate group with Scientists in Neuroscience Discovery, Quantitative Sciences, Experimental Medicine and Clinical Development, RA/QA, Safety, Finance, Purchasing, and Contracting.</li>\n<li>Interface externally with Life science and instrument vendors, academic researchers, collaborators, and KOLs.</li>\n<li>Work in a results-oriented environment with the goal of identifying and validating biomarker signatures in connection with therapeutic discovery projects, aimed toward clinical translation and beyond.</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br>\n· The successful candidate will have a Ph.D. degree in pharmacology/biology or related fields with post-doctoral experience and a minimum of 5 years of relevant experience is required.\n<br>\n· The successful candidate will have on-the-job experience with the identification and/or use of DNA, RNA, and/or epigenetic markers of disease, ideally in combination with other phenotypes such as neuroimaging is preferred.\n<br>\n· Applied knowledge of machine learning and appropriate statistical inference techniques is required.\n<br>\n· Experience with establishing &amp; validating biomarker links to phenotypes, and application in drug discovery, translation and clinical development in NS is preferred\n<br>\n· Excellent communication skills are required.\n<br>\n· Strong collaboration and influencing skills are required.\n<br>\n· Up to 20% travel is required. (primarily domestic)\n<br><br>\n<strong>Primary Location</strong>\n<br>\nUnited States-California-San Diego\n<br>\n<strong>Organization</strong>\n<br>\nJanssen Research &amp; Development, LLC. (6084)\n<br>\n<strong>Job Function</strong>\n<br>\n<strong>R&amp;D</strong>\n<br>\n<strong>Requisition ID</strong>\n<br>\n<strong>4739180620</strong>\n<br>"}