{"job title": "Senior CCD and Electronics Research Scientist", "company": "KLA-Tencor Corporation", "city state": "– Milpitas, California", "rating": "3.7", "job description": "Job Opening ID: 118167<br><br><strong> Job Opening ID:</strong><br><br>Full-Time\n<br><br>\nRegular<br><br><strong> Company Overview</strong> Calling the adventurers ready to join a company that's pushing the limits of nanotechnology to keep the digital revolution rolling. At KLA-Tencor, we're making technology advancements that are biggerand tinierthan the world has ever seen. Who are we? We research, develop, and manufacture the world's most advanced inspection and measurement equipment for the semiconductor and nanoelectronics industries. We enable the digital age by pushing the boundaries of technology, creating tools capable of finding defects smaller than a wavelength of visible light. We create smarter processes so that technology leaders can manufacture high-performance chipsthe kind in that phone in your pocket, the tablet on your desk and nearly every electronic device you ownfaster and better. We're passionate about creating solutions that drive progress and help people do what wouldn't be possible without us. The future is calling. Will you answer? <strong> Group/Division</strong><br><br>The Office of the Chief Technology Officer (CTO) plays a critical role in developing advanced long-range technology in collaboration with product divisions and strategic marketing, working on future technology like light sources, lasers, and sensors. We are engaged in the research and development process, and once the technology is mature, we partner with product engineering groups who then build products based on the technology weve developed.\n<br><br>\nThe Office of the CTO also provides technical input into KLA-Tencors strategic planning process, program reviews and Product Life Cycle (PLC) phases. We provide our broad technology expertise and cross-division experience to ensure we leverage the collective knowledge within our company.<br><br><strong> Responsibilities</strong> <li> Simulate and design complex analog/digital electronic circuits to meet low noise, high-speed (signal integrity) requirements of PCB or other substrates.</li> <li> Capability of incorporating state of the art FPGA's in circuit designs.</li> <li> Work with critical vendor to design next generation detectors and CCD devices.</li> <li> Design and run experiments, analyze and present data with concert conclusions. Solve technical problems by utilizing problem solving techniques.</li> <li> Collaborate with other team members and other divisions to solve complex electronics challenges.</li> <strong> Preferred Qualifications</strong> <li> Hands-on experience in design and simulation of complex electronic circuits (analog and digital)</li> <li> Experience using analytical tools for simulating signal integrity and noise</li> <li> Experience in CCD and silicon detectors</li> <li> Experience with ASIC design</li> <li> Experience with state of the art FPGA design and some firmware programming capability</li> <li> Experience with designs using SerDes for high-speed communication</li> <li> Experience with circuit designs utilizing ceramic substrates</li> <strong> Minimum Qualifications</strong><br><br>Doctorate (Academic) with at least 5 years of experience.ORMaster's Level Degree with at least 6 years of experience.ORBachelor's Level Degree with at least 7 years of experience.<br><br><strong> Equal Employment Opportunity</strong> KLA-Tencor is an Equal Opportunity Employer. Applicants will be considered for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristics protected by applicable law."}