{"job title": "Scientist II - (Gaithersburg, MD)", "company": "MedImmune", "city state": "– Gaithersburg, Maryland", "rating": "3.8", "job description": "If youre inspired by the possibilities of science to change lives and you thrive when making brave decisions join us.\n<br><br>\n<strong>MedImmune</strong> is the worldwide biologics research and development arm of AstraZeneca. Here, youll have the opportunity to make a difference in peoples lives every day. As one of the worlds premier biotechnology companies, our mission is centered on delivering life-changing products that advance world health, and help fight and cure disease. As a <strong>Scientist II - Device Development (Device Engineer)</strong> in <strong>Gaithersburg, MD</strong> youll play a pivotal role in channeling our scientific capabilities to make a positive impact on changing patients lives.\n<br><br>\nWere constantly pushing the boundaries of science to deliver life-changing medicines to patients, with a passion for discovery and a pipeline to show for it. Were pioneering innovative research and exploring novel pathways across key therapeutic areas including oncology, respiratory, inflammation and autoimmunity, cardiovascular and metabolic disease, and infection and vaccines. And were industry-leading in immunology, protein engineering and translational science. We offer a unique and strong collaborative network as part of the AstraZeneca family, as together we explore synergies between small and large molecules.\n<br><br>\nMedImmune has a dynamic environment that fosters collaboration and innovation. We attract top minds, and we nurture and build top talent.\n<br><br>\nMain Duties and Responsibilities\n<br><br>\nThe position holder would be expected to take a role as a technical project lead with the responsibility for the design and development aspects of new device development projects, working closely with other functions, business areas, external suppliers and consultants. Manage device aspects of projects to achieve project targets in a timely fashion and to agreed quality standards, e.g. plan and review work to ensure that agreed objectives, timescales and budgets are met. Apply knowledge and expertise to support the achievement of project targets. Develop and maintain a level of knowledge and competence, perhaps extending to specialist expertise in a specific area of Device Development. Take responsibility for the design and development aspects of new device development projects and be proactive in proposing new ideas and solving problems. Assess and report data with a clear understanding of its reliability interpret findings and draw authoritative conclusions and recommendations so that their significance can be appreciated. Typically will have responsibility for more than one project at a time. Is able to demonstrate leadership through project team participation, internal consulting and mentoring. Is able to attain internal recognition as an emerging expert by the Medi scientific community through objective criteria such as publications, patents, internal presentations, and critical contributions to device development. Makes detailed observations, analyzes data, and interprets results. Demonstrates scientific rigor in assessing own data and that of others. Establish and maintain a close working relationship with suppliers and design consultants and contribute to management of external collaborations. Liaise effectively with internal departments (International Marketing, Regulatory Affairs, Product Development, Operations, etc.) to ensure that the proposed design meets their requirements and expectations. Oversee the transfer of projects to Commercial Manufacturing. Ensure that work is performed in accordance with appropriate quality and compliance standards, e.g. ISO/MDD/GMP/GLP and safety requirements. Prepare and maintain documentation and formal reports in accordance with these standards. Prepare and author formal reports and contributions to regulatory documentation. Supervise staff and contribute to the training and development of less experienced personnel by acting as coach/mentor as appropriate.\n<br><br>\n<strong>Essential Requirements</strong>\n<ul>\n<li>Typically, will be expected to have a PhD in Mechanical Engineering or a related discipline with 3-7 years relevant experience; or a Mechanical Engineering graduate holding a BS with 13-15 years experience or an MS with 10-13 years of relevant experience.</li><li>Requires an in depth understanding and experience of the principles and concepts within the area of device development in the pharmaceutical industry and/or the medical device industry, and is expected to demonstrate up to date technical knowledge.</li> <li>Requires knowledge of the drug development process and the importance of the application of device development capability to this process.</li> <li>Requires a basic knowledge and experience of other areas outside of own specialist area such as formulation and analytical development.</li> <li>Requires an in-depth knowledge of relevant compliance systems and experienced in authoring relevant sections in regulatory submissions (IND, IMPD, BLA, MAA etc.).</li> <li>Experience with the development of devices for biotechnology compounds would be a distinct advantage.</li>\n</ul>\n<strong>Desirable Requirements</strong>\n<ul>\n<li>Good communication skills and strong interpersonal skills are essential. Excellent leadership capabilities, organization, flexibility and the ability to operate in a fast paced environment are an integral part of this position. Problem solving and innovation are also fundamental qualities for this role. Has demonstrated these capabilities through leading and participating in multidisciplinary project teams.</li><li>Job complexity would be high immediately. Role holder would be expected to utilize experience to identify technical objectives immediately and prioritize effectively, handle multiple projects simultaneously and work with numerous functions, business areas, consultants and vendors globally.</li><li>Perform work without appreciable direction, independently determine technical objectives of assignment and be pro-active in identifying critical activities and prioritizing appropriately.</li>\n</ul>\n<strong>Next Steps Apply today!</strong>\n<br><br>\nTo be considered for this exciting opportunity, please complete the full application on our website at your earliest convenience it is the only way that our Recruiter and Hiring Manager can know that you feel well qualified for this opportunity. If you know someone who would be a great fit, please share this posting with them.\n<br><br>\nAstraZeneca is an equal opportunity employer. AstraZeneca will consider all qualified applicants for employment without discrimination on grounds of disability, sex or sexual orientation, pregnancy or maternity leave status, race or national or ethnic origin, age, religion or belief, gender identity or re-assignment, marital or civil partnership status, protected veteran status (if applicable) or any other characteristic protected by law. AstraZeneca only employs individuals with the right to work in the country/ies where the role is advertised.\n<br><br>\n~bsp\n<br><br>\n*LI-MEDI"}