{"job title": "Scientist, Production Associate", "company": "Merck KGaA", "city state": "– Miamisburg, United States", "rating": "3.7", "job description": "<div>\n<div>\n<div>\n<strong>Your Role:</strong> Evaluate stable isotope products according to established protocols, provide technical support to others and perform operations in support of the group and department.\n<br><br>\n<strong>ESSENTIAL JOB FUNCTIONS</strong>\n\n\n<ul>\n\n\t<li>Safely perform operations to meet quality expectations.\n\n\n<ul>\n\n <li>Ensure safety and quality throughout the process.</li>\n<li>Assure you are adequately trained to perform tasks/assignments.</li>\n<li>Perform multi-disciplined, established assays and/or unit operations, involving stable isotope compounds.</li>\n<li>Clean-up equipment and working areas during and after operations.</li>\n<li>Complete the volume of work required to achieve group/departmental goals and meet deadlines.</li>\n<li>Contribute to support functions of the lab (e.g., maintain equipment, prepare reagents, restock lab supplies, waste disposal).</li>\n<li>Communicate the status of operations and bring deviations to the attention of supervisor.</li>\n<li>Provide complete and accurate records consistent with quality guidelines.</li>\n<li>Ensure all applicable log books have been filled out completely as required by current procedures.</li>\n<li>Interface with other departments as needed.</li>\n<li>Participate as needed in quality audits.</li>\n<li>Accurately perform procedures independently.</li>\n<li>Perform routine troubleshooting and miscellaneous duties or tasks as necessary.</li>\n</ul>\n\n\t</li>\n<li>Ability to serve on committees to improve department, site or company performance. Committees may focus on safety, quality, inventory, output, costs, etc.</li>\n<li>In compliance with change control procedures, improve processes through application of scientific knowledge, experience, and principles.\n\n\n<ul>\n\n <li>Identify opportunities for process improvement.</li>\n<li>Participate in process improvements under the guidance of a Supervisor or Production Scientist.</li>\n<li>Take the necessary action to resolve any unsafe conditions.</li>\n<li>Develop improvement ideas, review impact of changes and document all work.</li>\n</ul>\n\n\t</li>\n</ul>\n\n<strong>Who You Are</strong><br><br><strong>Education and Experience:</strong> BS in Chemistry required with Independent lab research desired. 6-12 months of training necessary to learn specifics of job adequately to work independently.\n<br><br>\n<strong>Knowledge and Skills:</strong>\n<br><br>\n<strong>\n<ul>\n\n\t<li>Mechanical skills:</li>\n</ul>\n\n</strong>\n\n\n<ul>\n\n\t<li>Chemical glassware (flasks, fittings, connectors, condensers, and traps)</li>\n<li>Equipment (heating mantles, stirrers, clamps, and jacks)</li>\n<li>Hoses (compressed air lines, vacuum lines, cylinder lines, and thermocouples)</li>\n</ul>\n\n<strong>\n<ul>\n\n\t<li>Troubleshooting skills:</li>\n</ul>\n\n</strong>\n\n\n<ul>\n\n\t<li>Troubleshoot chemical reactions and analytical testing</li>\n<li>Identify solutions based on knowledge of modern chemistry techniques</li>\n</ul>\n\n<strong>\n<ul>\n\n\t<li>Laboratory skills:</li>\n</ul>\n\n</strong>\n\n\n<ul>\n\n\t<li>Weighing, measuring, pouring, filtering, making solutions</li>\n<li>Basic laboratory calculations (pH, molar concentration, percent yield, grams to moles, stoichiometric conversions, and buffer solutions)</li> </ul>\n\n\n<ul>\n\n\t<li>Interpreting analytical data and characterizing and identifying molecular compounds and gases using NMR, HPLC, GC, and MS instruments, among others.</li>\n<li>Handling chemicals safely wearing personal protective equipment</li>\n</ul>\n\n<strong>\n</strong><ul><strong>\n\n\t</strong><li><strong>Demonstrated knowledge of:</strong>\n\n\n<ul>\n\n <li>Analytical chemistry including instruments and methods</li>\n</ul>\n\n\t</li>\n</ul>\n\n\n\n<ul>\n\n\t<li>Organic chemistry including basic reactions (sn1, sn2, E1, E2, oxidations, reductions, carbonyl reactions, carbon-carbon bond forming reactions, and aromatic reactions)</li></ul>\n\n\n<ul>\n\n\t<li>Inorganic chemistry including cations, anions, ionic bonding, salts, oxides, and organometallics</li>\n<li>Gases including elemental gases, gas mixtures, pressure, temperature, volume, isotopic enrichment</li> \n</ul>\n<strong>ADDITIONAL LOCAL NEEDS:</strong>\n<br><br>\n<strong><u>Environmental Conditions:</u> </strong>\n<br><br>\n<strong>General Office Environment:</strong> Noise level in office environment is generally quiet.\n<br><br>\n<strong>Lab Environment:</strong> Works near moving mechanical parts. Is frequently required to wear appropriate protective gear, (hard hats, glasses/goggles, chemical resistant suits, gloves, safety shoes) and other personal protection equipment “PPE” to protect themselves from toxic or corrosive chemicals in the forms of liquids, solids, vapors or airborne particles. Outdoor weather conditions while moving material and waste handling.\n<br><br>\n<strong><u>Physical Requirements:</u></strong>\n<br><br>\n<strong>If performing office duties:</strong> Employee is required to sit, stand, hear, and use hands to operate all office equipment. Employee must view computer monitors for long periods of time. Vision requirements are close vision and the ability to adjust focus. Employee occasionally will be required to lift, generally no more than 25 pounds.\n<br><br>\n<strong>If performing lab duties:</strong> While performing the duties of this job, the employee is regularly required to sit, stand, walk, reach above the shoulder, stoop, kneel, twist, crouch or crawl for long periods of time. The employee must be able to talk, hear, taste and smell. The employee must occasionally lift and/or move up to 50 pounds unassisted and ability to push and pull heavy materials to complete assignment. The employee may be required to lift more poundage with assistance. Specific vision requirements of this job include close vision, distance vision, color vision, peripheral vision, depth vision, and the ability to adjust focus. Regularly uses phones, computers, computer monitors and all office/laboratory equipment. The employee is also required to type at a computer keyboard and have the ability to read CRTs/computer monitors.\n<br><br>\nFacility in Miamisburg, OH\n\n<ul>\n\n\t<li>ISO 9001:2015</li>\n<li>cGMP</li>\n</ul>\n\n</div>\n</div>\n </div>\n<br>"}