{"job title": "Weed Control Reserach Scientist", "company": "Monsanto", "city state": "– Saint Louis, MO", "rating": "4.0", "job description": "Bayer Crop Science is looking for a bright scientist to join the Weed Control Evaluations Platform in the Plant Biotechnology organization in our Seed&amp;Traits Global HQ in Chesterfield, MO. As a Weed Control Research Scientist, you will be working with a team of experts in the field and will be responsible for coordinating and executing controlled environment experiments to identify, evaluate, and characterize the next generation of integrated weed control solutions. In addition, you will be expected to analyze, interpret, and report the results to the team and project leads.\n<br><br>\nAbout us we are focused on developing the next generation of weed control technologies for farmers around the world. Our team's mission is to support the discovery and early development of sustainable weed management solutions through extensive testing in controlled environment.\n<br><br>\n<strong>Responsibilities include:</strong>\n\n\n<ul>\n<li>Design, conduct, and coordinate greenhouse and growth chamber experiments to assess and characterize new herbicide active ingredients, novel herbicide formulations, and new herbicide tolerant traits in soybean, corn, cotton, and canola, while ensuring regulatory compliance.</li>\n<li>Analyze, interpret, summarize, and report the results and develop recommendations to the team and project leads.</li>\n<li>Work closely with formulation chemists, biochemists, molecular biologists, plant physiologists, field biologists, technology development managers, and project leads to assess technical features of new weed control technologies in comparison to conventional weed control options.</li>\n<li>Evaluate new weed control product concepts, and determine and optimize product opportunities in global markets.</li>\n</ul>\n\n<strong>Required Education and Skills/Experience:</strong>\n\n\n<ul>\n<li>Minimum of Ph.D. in Weed Science or related life sciences discipline</li>\n<li>Minimum of two or more years of relevant experience in academia or industry in weed science, crop science, agronomy, plant physiology, plant biology, and/or a related discipline</li>\n<li>Strong experience in conducting research trials and following scientific procedures</li>\n<li>Proven ability to work independently and effectively on cross-functional and multidisciplinary teams</li>\n<li>Strong written / oral communication and interpersonal skills</li>\n<li>Strong understanding of weed biology, herbicide physiology, and herbicides modes of action</li>\n<li>Ability to utilize experimental design and statistical data analysis</li>\n<li>Ability to work in greenhouse environment with varied temperatures and conditions</li>\n</ul>\n\n<strong>Desired Education and Skills/Experience:</strong>\n\n\n<ul>\n<li>Five or more years of relevant experience in academia or industry in weed science, crop science, agronomy, plant physiology, plant biology, and/or a related discipline</li>\n<li>Prior experience working in agriculture industry and/or experience in crop protection product development</li>\n<li>Prior experience as a people manager and/or mentoring or co-advising students</li>\n<li>Strong understanding of traditional weed control systems and herbicide tolerance traits in major agronomic crops (such as corn, soybean, cotton and/or canola) in global markets</li>\n<li>Strong working knowledge of herbicide products used in corn, soybean, cotton, canola, rice and/or wheat globally</li>\n<li>Prior experience working in a global company and navigating a matrix environment</li>\n</ul>\n\nBayer successfully completed the acquisition of Monsanto in June 2018, bringing together Monsanto's leadership in seeds and plant traits with Bayer's leadership in chemical and biological crop protection. By joining forces, we will create even more extensive career opportunities for talent around the world. We're a global team working to shape agriculture through breakthrough innovation that will benefit farmers, consumers, and our planet.\n<br><br>\nWhile we are now Bayer, we will continue to hire using separate career sites until we can integrate our career platforms. We invite you to explore the career opportunities available at the combined company by visiting advancingtogether.com/careers."}