{"job title": "Associate Scientist, Claims", "company": "The Estee Lauder Companies", "city state": "– Minneapolis, MN", "rating": "3.5", "job description": "**Associate Scientist, Claims**<br> <br><br> <br>**Brand:** Est?e Lauder Companies Corporate Departments<br> <br><br> <br>**Description**<br> <br><br> <br>**Position Summary:**<br> <br><br> <br>This position primarily handles the management of lab instrumentation and study files, and supports the maintenance of claims dossiers and statistical analysis of studies. Additionally, this position is responsible for supporting clinical and analytical testing in accordance with Good Clinical Practices and company's SOPs. This position's responsibilities include performing early stage prototype or pilot testing and new technology proof of principle and method development studies under the supervision of a team leader.<br> <br><br> <br>**Key Roles and Responsibilities:**<br> <br><br> <br>+ Maintain and compose study related documents (test protocols, summaries, and reports) and SOP?s as directed. Manage and maintain study files and database. (20%)<br> <br>+ Manage instrument maintenance and troubleshooting, and assist in new equipment procurement (15%)<br> <br>+ Tabulate, analyze, and interpret data using appropriate test and analysis methods according to protocols and supervisor instructions. Perform statistical analysis of data. Assist in monitoring and verifying data analysis, notebooks and reports conducted by/written by lab technicians to ensure quality control of claims test results. (25%)<br> <br>+ Function as a testing sub-investigator which includes following testing protocols, conducting ex vivo instrumental testing and collecting consistent data in accordance with GCP/GLP and company's SOPs. (20%)<br> <br>+ Assist with identification, development and optimization of new claims substantiation methods. Keep up to date with relevant scientific literature. (10%)<br> <br>+ Assist team in maintenance of order, safety &amp; cleanliness of lab and adjoining areas. Maintain lab supplies as needed. (5%)<br> <br>+ Respond to requests from management, as necessary (5%)<br> <br>+ Stay current on cosmetic field trends, haircare technologies and technological developments of data collection instrumentation.<br> <br>+ Maintain a professional atmosphere.<br> <br><br> <br>**Qualifications**<br> <br><br> <br>**Education:**<br> <br><br> <br>Bachelor's degree in Science (Chemistry, Biology or relat<br> <br><br> <br>**Other:**<br> <br><br> <br>+ Strong technical and analytical skills<br> <br>+ Strong organization skills - Ability to handle multiple projects in a fast paced setting while maintaining attention to details and precision in testing techniques<br> <br>+ Excellent written and verbal communication skills; ablity to work collaboratively and independently<br> <br>+ Ability to stand for prolonged periods of time and willing to conduct repetitive tasks<br> <br><br> <br>**Job:** Research &amp; Development<br> <br><br> <br>**Primary Location:** Americas-US-MN-Blaine<br> <br><br> <br>**Job Type:** Standard<br> <br><br> <br>**Schedule:** Full-time<br> <br><br> <br>**Shift:** 1st (Day) Shift<br> <br><br> <br>**Travel:** Yes, 10 % of the Time<br> <br><br> <br>We are an equal opportunity employer. Minorities, women, veterans, and individuals with disabilities are encouraged to apply. **Job Number:** 185636"}