{"job title": "Research Scientist Engineer 2 (80%)", "company": "University of Washington", "city state": "– Seattle, WA", "rating": "4.1", "job description": "As a UW employee, you will enjoy generous benefits and work/life programs. For a complete description of our benefits for this position, please visit our website, click here. As a UW employee, you have a unique opportunity to change lives on our campuses, in our state and around the world. UW employees offer their boundless energy, creative problem solving skills and dedication to build stronger minds and a healthier world.\n<br><br>\nUW faculty and staff also enjoy outstanding benefits, professional growth opportunitiesand unique resources in an environment noted for diversity, intellectual excitement, artistic pursuits and natural beauty. All of which has allowed the UW to be nationally recognized as a \"Great College to Work For\" for four consecutive years.\n<br><br>\nThe Department of Bioengineering has an opportunity for a part time 80% Research Scientist/Engineer 2. This position is responsible for improving biomedical models and maintaining up-to-date documentation for the Center for Reproducible Systems for Biomedical Modeling. The focus of the new center is the development and dissemination of models for systems biology, physiology and neurophysiology. The center is an international collaboration with sites at UW, University of Auckland, University of Connecticut and Dartmouth College. Duties include:\n<br><br>\nWork collaboratively with center faculty and scientists on the improvement of models; this involves writing Python code to develop and improve models. Provide general trouble shooting on deadlines. (50%)\n<br><br>\nIndependently test software and tools developed by Center members; report bugs and usability issues back to the Center Director. (25%)\n<br><br>\nMaintain and update documentation; frequently review documentation and report back to the Center Director regarding the state of software and documentation. Edit documentation as needed. (20%)\n<br><br>\nResearch dissemination: Participate in center meetings and conferences; prepare written reports and journal articles; present at national and international conferences and workshops. (5%)\n<br><br>\n<strong>Minimum Requirements:</strong>\n<br><br>\nMaster's Degree in Molecular Biology, Biomedical Engineering, Systems Biology/Computational Biology.\n<br><br>\nMinimum of 12 months experience working in a life sciences research setting.\n<br><br>\nKnowledge of molecular biology.\n<br><br>\nIntermediate skills coding with Python or similar programming language.\n<br><br>\nAbility to work effectively with a team of interdisciplinary engineers and practitioners.\n<br><br>\nStrong critical thinking and analysis aptitude.\n<br><br>\nAbility to independently prioritize and organize work to meet deadlines; ability to delegate tasks and seek help.\n<br><br>\nAbility to present data and analysis results in clear, readily understandable form to non-technical audiences in person or in written, verbal, or web format.\n<br><br>\nEquivalent experience may be substituted for degree requirement.\n<br><br>\n<strong>Desired qualifications:</strong>\n<br><br>\nKnowledge of fundamentals of Systems Biology or Biomedical Modeling\n<br><br>\n<strong>Application Process:</strong>\n<br><br>\nThe application process for UW positions may include completion of a variety of online assessments to obtain additional information that will be used in the evaluation process. These assessments may include Work Authorization, Cover Letter and/or others. Any assessments that you need to complete will appear on your screen as soon as you select \"Apply to this position\". Once you begin an assessment, it must be completed at that time; if you do not complete the assessment you will be prompted to do so the next time you access your \"My Jobs\" page. If you select to take it later, it will appear on your \"My Jobs\" page to take when you are ready. Please note that your application will not be reviewed, and you will not be considered for this position until all required assessments have been completed."}