{"job title": "(Associate) Scientist, Dietary Supplements", "company": "US Pharmacopeia", "city state": "– Rockville, US-MD", "rating": "3.2", "job description": "This is a non-supervisory hands-on, highly technical position that supports the front end of the Dietary Supplements (DS) and Herbal Medicines standard-setting activities. It involves critically evaluating literature information related to the safety of dietary supplements and herbal medicines, to aid in determining their admission into the <em>USP-NF</em> monograph development process as well as their nomenclature.\n<br><br>\nThe incumbent is responsible for developing new DS admission evaluations and revising existing ones, collating information on nomenclature and labeling of dietary supplements, and responding to related internal and external queries.\n<br><br>\nThese activities require performance of literature searches on topics related to safety, nomenclature and labeling of DS; critical evaluation of relevant documents and other information, and drafting admission evaluations for other scientific staff and/or Expert Committee review.\n<br><br>\nThe incumbent liaises with expert committee members in the critical review of information required for the admission of the proposed monograph articles to the <em>USP-NF</em> monograph development process.\n<br><br>\nThe incumbent is able to work independently but recognizes when additional expertise is needed and has the ability to put together and manage advisory/expert panels.\n<br><br>\nThe incumbent will liaise with the Admission Expert Committee and interested parties from government, academia and industry on issues pertaining to safety, efficacy and nomenclature of dietary supplements and herbal medicines.\n<br><br>\n<strong>Roles and Responsibilities</strong>\n\n<ul>\n<li>Perform literature searches on clinical, toxicological, PKPD and regulatory opinion/information (EFSA opinions, GRAS, NDI, Self-GRAs documentation), analyzes and synthesize the literature data.</li>\n\n<li>Draft Admission Evaluations for the Admission EC to aid EC members in determining the admissibility of articles for monograph development.</li>\n\n<li>Make presentation related to admission evaluation to internal audience at USP and to external audience on behalf of USP.</li>\n\n<li>Writes general and specific correspondence related to safety, efficacy, nomenclature and labeling of dietary supplements proposed for USP monograph development.</li>\n\n<li>Collaborate with sponsors and other stakeholders (academia and regulatory agencies) to support the development of new Dietary Supplements admission evaluations.</li>\n\n<li>Assists in the development of agendas and planning for USP Expert Committee meetings, stimulates discussion between members of the Expert Committee, organizes work assignments and provides assistance and guidance to EC members.</li>\n\n<li>Support scientific liaisons, to determine specific markers to be included or excluded in the monograph based on safety attributes.</li>\n\n<li>Communicate with other USP departments regarding projects related to nomenclature of dietary supplements and herbal medicines, and dietary supplements admission evaluation.</li>\n</ul>\n<strong>Basic Qualifications</strong>\n<br><br>\n<em>Associate Scientific Liaison</em>:\n\n<ul>\n<li>Ph.D. with 5 years, an MS degree with 7 years, or a Bachelor’s degree in toxicology, pharmacology, pharmacognosy, pharmacy or a related field with 10 years of industry experience.</li>\n</ul>\n<em>Scientific Liaison</em>:\n\n<ul>\n<li>Ph.D. with 8 years, an MS degree with 10 years, or a Bachelor’s degree in toxicology, pharmacology, pharmacognosy, pharmacy or a related field with 15 years of industry experience.</li></ul>\n\n\n<ul>\n<li>Knowledge about natural products, their biological activities and safety profiles.</li>\n\n<li>Knowledge of PubMed and other electronic database search strategies.</li>\n</ul>\n<strong>Preferred Qualifications</strong>\n<br><br>\n<ul>\n<li>Excellent written and verbal communication skills in English.</li>\n\n<li>Knowledge about GRAS determination and requirements for NDI notifications.</li>\n\n<li>Experience working on evaluation of safety and benefits of dietary ingredients and supplements.</li>\n\n<li>Knowledge of the U.S. dietary supplement industry and the associated regulatory framework.</li>\n\n<li>Ability to prioritize tasks and manage multiple projects simultaneously.</li>\n\n<li>Ability to establish and nurture relationships with individuals of varying backgrounds and learning styles.</li>\n\n<li>Ability to operate independently where appropriate, yet understands when to escalate issues and how to establish effective working relationships.</li>\n\n<li>Well-developed organizational, interpersonal communications, negotiation, and strong listening skills.</li>\n\n<li>Strong presentation skills.</li>\n\n<li>Understanding of dietary supplements quality specifications.</li>\n\n<li>Must be able to share technical information with non-technical or non-scientific staff, and communicate effectively with representatives from dietary supplement companies, government, and academic institutions.</li>\n</ul>\n<br><br>\n<strong>Supervisory Responsibilities</strong>\n<br><br>\nNone\n<br><br>\nUSP offers an impressive benefits package, including:\n\n<ul>\n<li>Generous paid time off – 13 paid holidays, 10 sick days and 15 vacation days per year to start</li>\n\n<li>An annual 401(k) contribution, beginning after 1 year of service, of 10% of pay (base and bonus) every pay period that vests immediately</li>\n\n<li>Comprehensive individual and family healthcare plans with affordable premiums and low annual deductibles ($250/individual or $500/family)</li>\n</ul>\nThe U.S. Pharmacopeial Convention (USP) is a scientific nonprofit organization that sets standards for the identity, strength, quality, and purity of medicines, food ingredients, and dietary supplements manufactured, distributed and consumed worldwide. USP’s drug standards are enforceable in the United States by the Food and Drug Administration, and these standards are used in more than 140 countries.\n<br><br>\nBeing a part of USP means belonging to a diverse culture made up of more than 1,000 talented professionals working together at five international locations. We share our expertise in science, IT, human resources, quality assurance, communications, administrative management, and more...all to support an overall mission dedicated to making a difference by providing standards and programs that help improve the quality of medicines, dietary supplements, and foods worldwide.\n<br><br>\nUSP is proud to be an equal employment opportunity employer (EEOE) and affirmative action employer. Employment selection and related decisions are made without regard to sex, race, age, disability, religion, national origin, color, veteran status, sexual orientation, gender identity or any other protected class. We are committed to working with and providing reasonable accommodation to individuals with disabilities.\n<br><br>\nUSP does not accept unsolicited resumes from 3rd party recruitment agencies and is not responsible for fees from recruiters or other agencies except under specific written agreement with USP.<br><br>Required Skills\n<br><br>\n<strong>Required Experience</strong>\n<br><br>\nJob Location\n<br>\nRockville, US-MD\n<br>"}