{"job title": "Data Engineer (s)", "company": "ViaSat Inc", "city state": "– San Diego, California", "rating": "4.1", "job description": "Viasat designs, builds, and operates high-capacity satellite networks - bringing broadband Internet access to the world.\n<br><br>\nGMB Business Analytics (GMBBA) is the data science and data engineering team for Viasats Global Mobile Broadband (GMB) group. Every day, petabytes of data from Viasat networks across the globe are collected, processed, and stored our team both makes this happen and analyzes the data to drive business-impacting decisions. By leveraging modern tools such as Spark, Kafka, and Impala, we equip GMB with the power to make data driven decisions.\n<br><br>\nOur Team\n<br>\nThe GMBBA analytics group uses the latest big-data technologies (Spark, Kafka, Impala, Hadoop) to analyze petabytes of data streaming from our operational systems. Our diverse team of developers, data engineers and data scientists creates innovative solutions to gain technical and business insights.\n<br><br>\nYour Opportunity\n<br>\nAs a Data Engineer on the GMBBA team you will:\n<li> Architect real-time data processing pipelines</li> <li> Work alongside business leaders, analysts, and data scientists to deliver data that drives decisions</li> <li> Become familiar with the technologies that bring the Internet to millions of subscribers</li> <li> Utilize the latest cloud technologies to make it all happen</li> <li> Our Ideal Candidate</li> <li> We value curiosity, learning, and adaptability. Our ideal candidate loves solving tough problems using data.</li>\nIn this position, you will:\n<li> Design, build and own data pipelines &amp; storage systems</li> <li> Design and develop analytic tools</li> This posting is for future needs.<br><br>Requirements\n<li> Comfortable with several programming languages, including Python, Java</li> <li> Familiarity with RDBMS technologies (PostgreSQL, MySQL, Oracle, etc.)</li> <li> Comfortable with Linux environment and common tools</li> <li> Experience dealing with transactional data from a wide variety of systems</li> <li> Bachelor's Degree in Computer Science, Computer Engineering, Software Engineering, Electrical Engineering, Math, Physics or related field</li>\nPreferences\n<li> Hadoop, Spark, Kafka, Impala, MapReduce or other big data technologies experience</li> <li> Ansible, Docker, familiarity with container orchestration</li> <li> Familiar with several languages, including Scala, C/C++</li> <li> Familiar with any scripting language (Python, BASH, etc)</li> <li> Experience with TCP/IP network programming</li> <li> Experience with CI/CD development/orchestration</li> <li> Familiarity or experience working in a DevOps environment</li> <li> Background or interest in Data Science</li> Our Carlsbad, CA office is just 30 minutes north of San Diego and 5 minutes from the beach. We know there is more to life than work and with full gym access, volleyball/basketball courts and meal services onsite youll never want to leave our beautiful campus. You can also reach out to help others in the community by being involved in our VPartners program.\n<br><br>\nReady to join Viasat? Submitting your resume takes just a few minutes and well send you an automated response to let you know it has been received. If there is a potential match someone from the recruiting team will be in contact with you as soon as possible."}