{"job title": "Data Scientist", "company": "Altice USA", "city state": "– Plano, TX", "rating": "2.4", "job description": "Data Scientist Job ID: 2018-20440\n<br><br>\n<strong>Location:</strong>\n<br><br>\nPlano, TX\n<br><br>\nAltice USA (NYSE: ATUS) is one of the largest broadband communications and video services providers in the United States, delivering broadband, pay television, telephony services, proprietary content and advertising services to approximately 4.9 million Residential and Business customers across 21 states through its Optimum and Suddenlink brands.\n<br><br>\nFrom high-speed broadband and ultra-HD video, to digital advertising solutions, local news and voice offerings, we are making connections possible around the country -- to businesses, to consumers, to communities, to schools, to hospitals, and everyone in between.\n<br><br>\nThe Altice USA Audience Analytics team is seeking an outgoing, curious, interdisciplinary expert in machine learning to help us address opportunities ranging from churn management to \"right sizing\" products for our customers.\n<br><br>\n<strong>As a data scientist, you will:</strong>\n\n\n<ul>\n<li>Bring a combination of mathematical rigor and innovative algorithm design to create recipes that extract relevant insights from billions of rows of data to meaningfully improve user experience.</li>\n<li>Learn, develop, and apply new techniques in the intersection of math, probability, and optimization.</li>\n<li>Explore Altice USA's large-scale data to identify key insights on user behavior that will motivate future innovation.</li>\n<li>Work closely with various product development engineering teams to solve key retention and product affinity challenges.</li>\n<li>Interact with a stakeholder audience that includes Directors, Vice-Presidents, Senior Vice-Presidents and the Chief Operating Officer.</li>\n</ul>\n\nWe are a fact-based, analysis-driven organization. The improved algorithms you develop will be A/B tested quickly and rigorously and you will have direct, measurable impact to the bottom-line.\n<br><br>\nSome examples of the problems you might tackle in your new role:\n\n\n<ul>\n<li>How do we leverage our data to identify the customers that are risk of churning in the next 60-90 days?</li>\n<li>How do we give these customers the right offers that will make them stay?</li>\n<li>How do we detect data anomalies on voluminous data in matter of seconds and communicate them effectively?</li>\n<li>Masters, or PhD degree in a quantitative discipline (Economics, Finance, Statistics, Chemistry, Physics, Biology, Mathematics, Engineering, Computer Science)</li>\n<li>Experience in data mining, data transformation, pattern recognition, building statistical models, and delivering actionable insights</li>\n<li>Understanding of applied math topics such as probability and statistics, linear algebra, basic optimization techniques</li>\n<li>Experience with advanced machine learning techniques, such as deep learning systems, is a plus.</li>\n<li>Exposure to big data platforms, such as Big Query, Hadoop, AWS is a plus</li>\n<li>Exposure to Google Machine Learning is a plus</li>\n<li>Experience with customer analytics concepts, such as CLV modeling, churn modeling, real-time customer evaluation, recommendation engine is a plus.</li>\n<li>New Graduates welcomed.</li>\n</ul>\n\nWe are an Equal Opportunity Employer M/F/Disability/Vet and maintain a drug-free and smoke-free workplace.<br><br>SDL2017"}