{"job title": "Data Scientist", "company": "Ascension Information Services", "city state": "– Franklin, TN", "rating": "3.1", "job description": "<strong>Additional Job Information</strong>\n<br><br>\n<strong>Title:</strong> Data Scientist\n<br><br>\n<strong>City, State:</strong> Franklin,TN, St Louis, MO, Indianapolis, IN or Austin, TX\n<br><br>\n<strong>Location:</strong> TN Franklin - Offsite\n<br><br>\n<strong>Department:</strong> ESD Data Insights\n<br><br>\n<strong>Additional Job Details:</strong> FT, Days\n<br><br>\n<strong>About Us</strong><br>\n<div><div>Ascension Technologies is one of the nation’s largest healthcare information technology services organizations.\n<br>\nWe provide Ascension and its subsidiaries low-cost, high-value IT infrastructure and software application services that:\n\n\n<ul>\n<li>Support rapid and effective clinical decision making</li>\n<li>Improve efficiency and care transitions</li>\n<li>Foster information sharing across the continuum of care</li>\n<li>Make knowledge and data actionable, leading to improved patient outcomes</li></ul></div></div>\n<br><strong>Job Description</strong>\n<br><br>\nThe Senior Data Scientis ensures that the data assets of an organization are supported by its information technology architecture.\n<br><br>\nThe Senior Data Scientist is responsible for developing predictive and prescriptive analytics models, creating efficient algorithms, and innovating use of data. The Senior Data Scientist will work closely with the rest of the Analytics team, IT, and internal business partners to identify, evaluate, design, and implement statistical analyses and data exploration/visualization of internal and external, structured and unstructured, public and proprietary data. The Senior Data Scientist will work iteratively on the distributed Hadoop platform to deliver business and clinical results to stakeholders.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n\n\n<ul>\n<li>Recommends strategies based on changing business needs for supported area. Advises management on approaches to optimize business success.</li><li>Evaluates applicability of leading edge technologies and uses information to significantly influence future business strategy.</li><li>Analyzes complex business and competitive issues and discerns the implications for systems support. Identifies, defines, directs, and performs project issue analysis to resolve issues, including analysis of the technical and economic feasibility of proposed data solutions.</li><li>Designs projects with broad implication for the business and/or the future architecture, successfully addressing cross-technology and cross-platform issues. Selects tools and methodologies for projects. Negotiates terms and conditions with vendors.</li><li>Develops partnerships with senior users to understand business needs and define future data requirements.</li><li>Able to effectively communicate highly technical information to numerous audiences, including senior management, the user community, and less-experienced staff. Leads the development of effective networks of internal and external customers, suppliers, the technical community and consultants.</li><li>Leads the organization's planning for the future of the data model and data architecture. Leads the continual redesign of the organization's data model and/or transition to a common model.</li><li>Proposes and leads projects required to support the development or the organization's data infrastructure needs and provides intelligence on advances in database technologies.</li>\n</ul>\n<strong>Desired Responsibilities</strong>\n<ul>\n<li>Communicate effectively with executive and clinical personnel</li><li>Propose novel and execute on use cases for existing data assets</li><li>Identify trends and relationships in the data used for creating and testing hypotheses.</li><li>Mine and analyze structured/unstructured data to create machine learning models that deliver clinical and business value</li><li>Formulate innovative solutions to problems where machine learning is applicable</li><li>Collaborate with Product Managers, Senior Developers, and Chief Data Officer to produce the best possible end products</li><li>Consistently communicate on status of project deliverables</li><li>Provide work effort estimates to management to assist in setting priorities</li><li>Deliver timely work in accordance with estimates</li><li>Solve problems as they arise and communicate potential roadblocks to manage expectations</li><li>Adhere strictly to all security policies</li>\n</ul>\n<strong>Qualifications</strong>\n<br><br>\n<strong>Education:</strong>\n<ul>\n<li>Bachelor's degree preferred or equivalent experience.</li>\n</ul>\n<strong>Desired Education</strong>\n<ul>\n<li>Master’s or PhD in Computer Science, Data Science, Economics, Statistics, or a similar computational/quantitative field preferred.</li>\n</ul>\n<strong>Work Experience:</strong>\n<ul>\n<li>Seven years of experience preferred.</li>\n</ul>\n<strong>Desired Work Experience:</strong>\n<ul>\n<li>Four years of experience preferred.</li><li>Minimum number years of relevant experience preferred: <strong>2 Years</strong></li><li>Some of the minimum experience requirement may be met with Masters or other advanced degree</li><li>Demonstrated experience synthesizing and analyzing large data and making program recommendations based on that data is required, experience with healthcare data is desirable</li><li>Experience with Python and/or R is preferred.</li><li>Experience working with Tableau or similar reporting/data visualization tool is preferred</li><li>Experience with big data technologies like HDFS, Spark, Impala, HBase is preferred</li><li>Experience in using machine learning and predictive modeling techniques is preferred</li><li>Demonstrated ability to manage multiple projects and strong analytical skills</li><li>Must possess excellent written and verbal communication skills</li><li>Ability to understand and analyze complex business problems and apply cost effective solutions</li><li>Strong staff development, leadership, and coaching skills</li><li>Ability to assume responsibility and maintain confidentiality</li>\n</ul>\n<strong>Desired Skills/Experience:</strong>\n<ul>\n<li>Experience with machine learning algorithms such as Deep Learning (CNN, RNN, transfer learning), Ensemble learning and Reinforcement learning.</li><li>Experience with machine learning and numerical analysis packages such as scikit-learn, tensorflow, Keras and scipy.</li><li>Experience with analytical and data mining efforts which could include but not limited to clustering, segmentation, logistic and multivariate regression, decision/CART trees, neural networks, time-series analysis, sentiment analysis, and topic modeling.</li><li>Experience with optimization algorithms such as Bayesian Optimization, Genetic Algorithm, and Particle Swarm Optimization etc.</li><li>Experience with data processing and statistical analysis such as Bayesian statistical methods etc</li><li>Experience in modeling and an ability to implement models or model components from scratch.</li><li>Experience with datasets, data aggregation, assessment and reporting</li>\n</ul>\n<strong>Equal Employment Opportunity</strong><br>\n<div>Ascension Technologies is an EEO/AA Employer M/F/Disability/Vet. Please click the link below for more information.</div><div>http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf</div><div>EEO is the Law Poster Supplement</div><div>http://www.dol.gov/ofccp/regs/compliance/posters/pdf/ofccp_eeo_supplement_final_jrf_qa_508c.pdf</div>\n<br><strong>E-Verify Statement</strong>\n<br><br>\nAscension Technologies participates in the Electronic Employment Verification Program. Please click the E-Verify link below for more information.\n<br><br>\nE-Verify (link to E-verify site)"}