{"job title": "Data Scientist I", "company": "BDO USA", "city state": "– Grand Rapids, Michigan", "rating": "3.4", "job description": "<div>Auto req ID 13055BR</div> <div> Posting Title Data Scientist I</div> <div> Address 1 770 Kenmoor SE</div> <div> Address 2 Suite 300</div> <div> City Grand Rapids</div> <div> State Michigan</div> <div> Zip Code 49546</div> <div> Job Summary BDO’s Core Purpose is Helping People Thrive Every Day. Our Core Values reflect how we manage our work, our relationships and ourselves. As an employee of the firm, you will live true to our Core Values of people first, being exceptional every day in every way, embracing change, feeling empowered through knowledge and choosing accountability. Our Core Values are the standards by which we conduct ourselves day in and day out, both internally and externally.\n<br><br>\nThe Data Scientist I is responsible for analyzing data, understanding how to extract value from data by applying machine learning skills and using machine learning tools, platforms, and libraries.\n<br><br>\nThe Data Scientist I will also be expected to understand how to use programming skills to apply to machine learning projects, to clean and prepare datasets, as well as in other development projects.\n<br><br>\nThe Data Scientist I will also assist in evaluating and implementing third party tools, products, and platforms which utilize machine learning technologies.</div> <div> Qualifications Education\n\n\n<ul>\n<li>High School Diploma or GED required</li>\n<li>Bachelor’s Degree in Computer Science, Data Science, or other relevant field preferred</li>\n</ul>\n\nExperience\n\n\n<ul>\n<li>One (1) or more years’ experience in data science / data engineer / data analyst and/or software development required</li>\n<li>Prior experience in data mining preferred</li>\n</ul>\n\nLicense(s)/Certification(s)\n\n\n<ul>\n<li>Machine learning certifications preferred</li>\n</ul>\n\nSoftware\n\n\n<ul>\n<li>Prior experience with R or Python required</li>\n<li>Prior experience with Microsoft SQL required</li>\n<li>Prior experience with C# preferred</li>\n<li>Prior experience with Azure Machine Learning Studio / Azure Workbench preferred</li>\n<li>Prior experience with Cortana Intelligence Suite preferred</li>\n</ul>\n\nOther Knowledge, Skills &amp; Abilities\n\n\n<ul>\n<li>Strong understanding of statistics and advanced mathematics</li>\n<li>Strong understanding of machine learning concepts</li>\n<li>Strong oral and written communication skills</li>\n<li>Excellent interpersonal and customer relations skills</li>\n<li>Capacity to work in a deadline-driven environment while handling multiple complex projects/tasks simultaneously with a focus on details</li>\n<li>Capable of successfully multi-tasking while working independently or within a group environment</li>\n<li>Ability to rely on extensive experience and judgment to plan and accomplish goals</li>\n<li>Capable of working well under pressure while dealing with unexpected problems in a professional manner</li>\n<li>Capacity to communicate and interact with all levels of employees and management</li>\n<li>Ability to interact and build relationships and consensus among people</li>\n<li>Solid analytical and diagnostic skills to identify issues / problems and develop recommendations for effective resolution</li></ul></div> \n"}