{"job title": "Sr. Scientist, Early Discovery Biology (Immunology)", "company": "Celgene Corporation", "city state": "– Cambridge, MA", "rating": "3.6", "job description": "<div><strong>Other Locations:</strong>US- MA- Cambridge</div>\n<br>\nDescription<br><br>Celgene is a global biopharmaceutical company leading the way in medical innovation to help patients live longer, better lives. Our purpose as a company is to discover and develop therapies that will change the course of human health. We value our passion for patients, quest for innovation, spirit of independence and love of challenge. With a presence in more than 70 countries, and growing - we look for talented people to grow our business, advance our science and contribute to our unique culture.\n<br><br>\nThe Immunology and Inflammation Thematic Center of Excellence (I&amp;I TCoE) is building an industry-leading portfolio of novel therapeutics for I&amp;I diseases, and is seeking a creative, thoughtful, and highly motivated senior scientist to join our vibrant and cohesive team.\n<br><br>\nThe successful candidate will have a prominent leadership role, at the interface of Immunology and Protein Homeostasis. They will be based within the discovery biology group (Cambridge, MA) but will collaborate extensively with partners across Celgene at multiple sites (San Diego, New Jersey) and with external collaborators.\n<br><br>\nIn addition to their matrix leadership role, the successful candidate will progress laboratory projects with the support of a small team of direct reports. They will be expert in executing sophisticated experimental work including development of cellular and biochemical assays to study pathologic mechanisms, including biochemical, enzymatic, cell signaling, imaging and FACS based readouts to evaluate novel molecules.\n<br><br>\nThe successful candidate will have a background in cellular/molecular immunology and/or E3 ligase biology, demonstrated through authorship/ co-authorship of peer reviewed publications and several years of post-doctoral academic/ industry experience with evidence of sustained high performance and accomplishment. The candidate must have a thorough knowledge of experimental design, and a high level of technical laboratory skill together with an ability to interpret results.\n<br><br>\nThe position requires strong leadership skills, and a willingness to work in a highly collaborative research team environment along with highly credible technical knowledge and insight.\n<br><br>\n<strong>Responsibilities will include, but are not limited to, the following:</strong>\n\n\n<ul>\n<li>Leadership of collaborative working between Discovery Immunology and Protein Homeostasis teams.</li>\n<li>Being a thought leader within the team to critically evaluate the literature regarding new therapeutic targets in collaboration with computational biology/ genetics colleagues.</li>\n<li>Independently design, execute and interpret series of experiments to generate data to support decision making.</li>\n<li>Introduce and troubleshoot new methods, platforms and project concepts.</li>\n<li>Represent the biology function on drug discovery teams and deliver on cell biology needs for drug discovery teams of which you are member.</li>\n<li>Be a supportive line leader for scientific colleagues in design, execution and interpretation of experiments, and guidance of their career development</li>\n<li>Provide operational oversight of specified instrumentation</li>\n<li>Maintain an accurate electronic notebook</li>\n<li>Comply with laboratory safety procedures</li>\n<li>Process and communicate scientific findings in joint meetings and in written reports or manuscripts\n<br><br>\n<strong>Skills/Knowledge Required:</strong></li>\n<li>A PhD and post-doctoral training in Immunology/ E3 ligase biology, with at least 6 years of experience, preferably in industry, with significant focus on Immunology-focused cellular assay development for mechanistic characterization, and lead discovery and optimization of small molecule and biologic therapeutics. Ideally, the individual will have hands on expertise developing and validating functional assays to support drug discovery and target validation efforts.</li>\n<li>Excellent record of performance and scientific accomplishments as demonstrated by impactful contributions to the scientific community, pipeline contributions, peer reviewed publications and patent applications.</li>\n<li>Clear evidence of sustained independent thought and creativity in developing and implementing advanced technology and ideas for new drug discovery projects.</li>\n<li>Individuals with strong leadership, communication skills, and with experience in participating in and/or leading multi-disciplinary project teams are encouraged to apply.</li>\n<li>Ability to collaborate in teams and work with others in a matrixed environment</li>\n</ul>\n\n<strong>Other Attributes:</strong>\n\n\n<ul>\n<li>Able to manage multiple workstreams simultaneously</li>\n<li>Able to listen to and engage with colleagues of diverse backgrounds</li>\n<li>Passion, Courage, Trust, Excellence are our core values\n<br><br>\n#LI-POST<br><br>Celgene is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Celgene complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must have authorization to work for Celgene in the U.S.</li>\n</ul>"}