{"job title": "Senior Data Scientist", "company": "CyberCoders", "city state": "– San Mateo, CA", "rating": "3.9", "job description": "Senior Data Scientist <div>\nIf you are a Senior Data Scientist with strong programming experience with a machine learning background, please read on!\n<br><br>\nWe are an extremely well funded (VC backed) leader in the predictive analytics industry with several openings right now. As a member of the data science team, you will work on groundbreaking R&amp;D projects to leverage massive structured, unstructured, transactional and real-time data sets from a variety of sources. The goal is to analyze customer usage patterns and make actionable statistically robust recommendations that are impactful to the business case.\n<br><br>\nJob Title: Senior Data Scientist\n<br>\nLocation: East San Mateo, close to Foster City\n<br>\nPay: $185k-$215k base + 15-20% bonus + stock options</div>\n\n<br>What You Will Be Doing<div>\n\n\n<ul>\n<li>Combine an understanding of the business goals with data analysis and machine learning</li>\n<li>Cooperate with the Business Intelligence team to design and execute replicable data acquisition and utilization processes.</li>\n<li>Investigate new data sources. Acquire, analyze, clean and structure data.</li>\n<li>Use state of the art machine learning techniques to improve and expand existing models</li></ul></div>\n\n\nWhat You Need for this Position<div>\n\n\n<ul>\n<li>5+ years working experience</li>\n<li>Advanced degree in a quantitative discipline</li>\n<li>Java OR Python</li>\n<li>Hadoop (Hive, Pig, Spark)</li>\n<li>NoSQL (MongoDB, Cassandra, DynamoDB, etc.)</li>\n<li>Data-mining / analytics experience including applied techniques in data mining, machine learning, or scientific computing</li></ul></div>\n\n\nWhat's In It for You<div>\n\n\n<ul>\n<li>STRONG base pay right around $200k + bonus up to 20% + stock options + FULL benefits</li>\n<li>Potential for remote work</li></ul></div>\n\n\n<div>\nSo, if you are a Senior Data Scientist with experience, please apply today!</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}