{"job title": "Data Scientist", "company": "Daily Harvest", "city state": "– New York, NY", "rating": "1.0", "job description": "Data Scientist at Daily Harvest<br><br>Daily Harvest is a direct to consumer brand reimagining frozen food to solve a modern eating dilemma: the desire for convenience without nutritional compromise. We deliver single-serve cups of frozen ingredients (organic, whole ingredients and superfoods, with no preservatives or added sweeteners) that can be turned into crave-worthy eats in just seconds.\n<br><br>\nWe are looking for a data expert who is passionate about furthering this mission. As a member of the Data Team at Daily Harvest, you will help empower critical business decisions and build sophisticated machine learning products. You'll work in a modern data science stack including GCP/Bigquery, Python, and Looker that sits on top of our rich dataset. You'll find and explain insights to the rest of the company, and help plan, build, and put data products into production. All while enjoying tasty smoothies, soups, and bowls!\n<br><br>\nThis role works closely with every part of the company, including marketing, operations, finance, and the culinary team. Examples of upcoming projects are contextual product recommendations, demand modeling, and churn/LTV prediction. This is a highly visible role that has the opportunity to make a big impact on the business.\n<br><br>\n<strong>Requirements:</strong>\n\n<ul>\n<li>There is no minimum experience or education, but this role will require a firm grasp of software engineering and analytics/statistics.</li> \n\n<li>Strong Python and SQL background.</li> \n\n<li>Experience digging deep into data, creating expressive easy-to-understand visualizations.</li>\n<li>Experience building machine learning models and putting them into production.</li>\n<li>Understanding of CS fundamentals (data structures, algorithms), and how software scales.</li>\n<li>Understanding of basic statistics, experimental design.</li> \n\n<li>Excellent communication skills.</li>\n<li>Ability to thrive in an unstructured, fast-moving and constantly evolving high-growth environment</li> \n</ul>\n<strong>Good to Have:</strong>\n\n<ul>\n<li>E-commerce experience, especially within a subscription company</li>\n</ul>"}