{"job title": "Senior Data Scientist", "company": "Guideline, Inc.", "city state": "– San Mateo, CA, US", "rating": "4.8", "job description": "<div>\nAt Guideline, were helping Americans save for a better future. Guideline is the only 401(k) provider with a fee-free, full-stack 401(k) offering that automates plan administration and compliance with a platform that directly integrates with many of the most popular payroll providers.</div> <div>\nBy building transparent and first-of-its-kind software, the Guideline team is combatting whats unfortunately become the retirement industry status quo -- legacy providers have put profit over the interests of employees, abandoning the goal of the programs in the first place: to give employees the opportunity to save as much as possible for retirement.</div> <div>\nWith over 3,000 clients and hundreds of millions of dollars in assets under management, in just a couple years of operations, were well on our way to making smart retirement planning easy for everyone.</div> <br>\n<div>\n<strong>Job Description</strong></div><div>\nWe are looking to hire Senior Data Scientist to join our growing Data Team, which is comprised of data engineers and data scientists, and tasked to improve our 401(K) product and business efficiency by leveraging the power of proprietary data and public data. If you are experienced with and passionate about leveraging sophisticated data, analysis, statistics and algorithms to help tens of millions of Americans save for a better financial future, this is the team you want to join.</div> \n<br>\n<div><strong>Responsibilities:</strong></div><ul>\n<li>\nDevelop metrics to understand the performance and identify levers in product, marketing, sales, operations and customer services. Communicate findings and recommendations to department leads and executives.</li>\n<li>\nEvaluate and ETL rich data from proprietary and public data sources</li>\n<li>\nDesign and develop data product, in collaboration with data engineers and product teams</li>\n<li>\nIdentify and adopt state-of-the-art methodologies to meet companys increasingly more complex data needs</li>\n<li>\nIdentify and adopt frameworks, policies and tools to enhance the teams productivity</li>\n<li>\nFacilitate cross-functional collaboration</li>\n<li>\nCoach junior members</li>\n<li>\nThought leadership communication by authoring data-driven blog posts and infographics</li>\n</ul>\n\n<div><strong>Desired Skills and Experience/Qualifications:</strong></div><ul>\n<li>\nBachelor degree in a quantitative discipline</li>\n<li>\n6+ year professional experience in a similar role</li>\n<li>\nExtensive experience of applied statistics (e.g. distributions, hypothesis testing, regressions)</li>\n<li>\nExtensive experience of 1+ analysis-oriented programming languages (e.g. SQL, R, Python)</li>\n<li>\nSuperb verbal and written communication skills</li>\n<li>\nExperience of ETL development</li>\n<li>\nExperience of 1+ database technologies (e.g. transactional database, analytical data warehouse, key-value data store, document store)</li>\n<li>\nExperience of 1+ third-party analytics solutions (e.g. BI solution, marketing analytics solution, product funnel analytics solution, CRM solution)</li>\n<li>\nEmpathy, as manifested by excellent people skills and collaboration skills</li>\n<li>\nCreative and think outside the box</li>\n<li>\nIntellectual curiosity and lifetime learner</li>\n<li>\nProactive and driven to deliver high-quality work and make impact</li>\n</ul><br>\n\n<div>\n<strong>Compensation &amp; Benefits</strong></div><div>\nAt Guideline, were dedicated to creating a workspace environment that fosters creativity, collaboration, and hustle. Transforming a decades-old industry isnt easy, so we reward our team with generous compensation and a robust benefits package.</div>\n\n<ul>\n\n<li>\nCompetitive compensation with cash and stock option grants</li>\n<li>\nUnlimited vacation policy</li> \n<li>\nAn employer-matched Guideline 401(k)</li>\n<li>\nGenerous paid maternity/paternity leave policies</li>\n<li>\nPremium health benefits; Short and long-term disability benefits</li>\n<li>\nDaily catered lunch, in addition to more snacks, coffee, and beverages than you could ever consume</li>\n<li>\nComputer and monitor setup of your choosing</li>\n<li>\nCaltrain annual pass</li>\n<li>\nA spacious office in Hillsdale, steps away from Hillsdale Caltrain station, that happens to have an on-site beer garden, two Bocce Ball courts, and is conveniently across the street from Blue Bottle and Tin Pot.</li>\n</ul>\n\n<br>\n<div>\n<strong>\n<br>\nEqual Employment</strong></div><br>\n\n<div>\nGuideline provides equal employment opportunities to all employees and applicants for employment without regard to race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</div>\n<br>"}