{"job title": "Data Scientist", "company": "InfiCare Technologies", "city state": "– San antonio, Texas", "rating": "3.4", "job description": "<strong>Position: Data Scientist</strong>\n<br><br>\n<strong>Location: San Antonio, TX</strong>\n<br><br>\n<strong>long term contract</strong>\n<br><br>\n<strong>Primary Responsibility:-</strong>\n<br><br>\nResponsible for answering research questions and problem statements through the ongoing analysis and interpretation of data from various sources including ticketing, work tracking, web analytics, system monitoring, internal logging, and more. Using skills in modeling, simulation, and analysis, helps the business better understand its problem space by providing insights and recommendations for actionable optimizations. Presents findings and insights to business stakeholders and partners.\n<br><br>\n<strong>Job Complexity:</strong>\n<br><br>\nWorks directly with stakeholders across product, business operations, engineering, and service delivery to understand and gather problem statements and research questions.\n<br><br>\nHelps design and implement systems that will collect or aggregate structured or unstructured data for later analysis.\n<br><br>\nWorks with product and engineering to identify and define data gathering requirements for new initiatives/projects/applications/systems.\n<br><br>\nLeverages predictive modeling, machine learning, simulation, and other statistical and mathematical analysis techniques to solve or answer problem statements and research questions.\n<br><br>\nPresents analysis to business stakeholders, educating them about relevant technical details to enable understanding and drive informed decision-making.\n<br><br>\nSupervision:\n<br><br>\nWorks under light supervision, will be expected to be self-directed. Should be able to plan and execute projects independently.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nMinimum requirements:\n<br><br>\nExperience with R programming\n<br><br>\nBasic proficiency with at least one dynamic scripting language (JavaScript, Python, Ruby, Perl, etc.)\n<br><br>\nUnderstanding and comfort with data extraction via API.\n<br><br>\nExperience using and comfort working in Github workflows.\n<br><br>\nCompetence with database structures and design and some SQL development skills.\n<br><br>\nIntermediate Tableau, QV or other BI visualization tool skills including the ability to connect to data, build objects, and publish dashboards.\n<br><br>\nAbility to clearly communicate technical information and ideas so that non-technical audiences will understand.\n<br><br>\n<strong>Preferred:</strong>\n<br><br>\nDegree in a relevant discipline such as Finance, Computer Science, Mathematics, or Statistics.\n<br><br>\nStrong project management skills, with an ability to design, plan, and execute projects.\n<br><br>\nExperience with machine learning techniques, such as random forests, dimension reduction, etc.\n<br><br>\nStrong understanding probability, statistics, optimization, linear algebra, or related skills\n<br><br>\n<strong>Rahul Garg</strong> <strong>InfiCare</strong><strong>Technologies</strong><strong>22375 Broderick Drive #225 Dulles VA 20166</strong>\n<br><br>\n<strong>703.652.7500 Direct |</strong>\n<br><br>\n<strong>rahul(at)inficaretech(dot)com</strong>"}