{"job title": "Data Scientist", "company": "Johns Hopkins Health Care", "city state": "– Glen Burnie, MD", "rating": "3.4", "job description": "<div>The Healthcare Economics Data Scientist will be responsible for the creation, development, and communication of Healthcare Economics analysis, data mining, and pattern-recognition capabilities; providing specialized analytics and data driven insights to myriad business units through the organization; and using large data sets to find opportunities for product and process optimization, and building models to test the effectiveness of various courses of action. This position collaborates with a group of Healthcare Economics professionals to support the organizations goal of providing executive leadership with actionable intelligence related to the financial, clinical, and population health performance of various lines of business within JHHC. This position is responsible for providing insights and recommendations using statistical and quantitative analysis coupled with explanatory and predictive modeling to drive focused decision making. Must have strong experience using a variety of data mining and analysis tools, using/creating algorithms and designing/running simulations in a healthcare, payor, or clinical setting.\n\n<ul>\n<li>Develops financial reporting and analytics to measure ROI and support cross-functional initiatives</li></ul>\n\n\n<ul>\n<li>Liaises among finance, population health, health services, and data/IT to scope projects and initiatives, maximize effectiveness of data sources and quality, and determine financial impact; Collaborates with Health Services and Population Health teams to design clinical service initiatives to improve quality of care delivery while improving cost and utilization</li>\n<li>Provides economic acumen and insight to financial projection processes including risk scores, cost and utilization trend analysis, financial benchmarking, and ad hoc analysis; proven ability to drive business results with data-driven insights.</li>\n<li>Uses data science methodologies to scan available data pools for predictive patterns in member population, and works with Healthcare Economics team to identify clusters, behavioral or care patterns, and outliers having direct impact on cost or revenue drivers.</li>\n<li>Supports specialized reporting and financial projects for business units throughout the organization</li>\n<li>Serves as a go-to for leaders and stakeholders throughout the organization to craft creative financial approaches to practical business issues</li>\n<li>Creates financial and predictive models to evaluate the feasibility and key success drives for new ventures, opportunities, and translates prediction into prescriptive models for operational success</li>\n</ul>\n\n<div><strong><u>Requirements</u></strong><strong>:</strong></div><br>\n\n<div>\n\n\n<ul>\n<li><em>Education:</em></li>\n</ul>\nMBA, MPH, or other advanced degree in data science, statistics, computer science or bioinformatics</div><div>B. <em>Knowledge:</em>\n<br><br>\nData science methodologies\n<br><br>\nEconomic acumen\n<br><br>\nPredictive modeling\n<br><br>\nStatistical and quantitative analysis\n<br><br>\nMachine learning experience highly desirable</div><div>C. <em>Skills:</em>\n<br><br>\nExcellent interpersonal skills and ability to communicate verbally and written effectively. Ability to communicate with the business for requirements and presentation of findings. Ability to be innovative and creative. Strong analytical and problem solving skills. Attention to detail. Ability to lean new tools and concepts quickly. Self-Starter, ability to come up with solutions for loosely defined business problems by leveraging pattern detection.</div><div>D. <em>Required Licensure, Certification, Etc.:</em>\n<br><br>\nNA</div><div>E. <em>Work Experience:</em>\n<br><br>\nRequires 5 years of experience in data or statistical analysis, data manipulation and mathematical and causal modeling. Familiarity with technologies such as R, SAS, SPSS, Tableau, Excel, Qlikview, is preferred. Requires basic sql skills.</div><div>F. <em>Machines, Tools, Equipment:</em></div><div><strong><u>Dimensions:</u></strong></div><br>\n\n<div>A. <em>Budget Responsibility:</em>\n<br><br>\nSupport development of budgets and/or financial models to assist manager as needed</div><div>B. <em>Authority/Decision Making Level:</em>\n<br><br>\nWithin the guidelines of JHHS written policies may establish procedures and practices to effectively manage tasks and processes.</div><div>C. <em>Supervisory Responsibility:</em>\n<br><br>\nInitially no formal staff management although will function as a mentor and guide to less experienced analysts. As the Informatics team grows, this role may develop into an official management position.</div><div><strong><u>Problem Solving:</u></strong>\n<br><br>\nUses research, inquiry, analysis and creative thinking to evaluate, create and analyze data, business plans, and other financial models as are requested by executive decision makers.</div><div><strong><u>Information Management:</u></strong>\n<br><br>\nUses a variety of information as is required by the particular project. A project may call for the use of financial data from the hospital, School of Medicine, other affiliates, and/or outside companies. A project may also require research of outside journals, books, and other documentations (e.g., Internet searches).</div><div><strong><u>Working Conditions:</u></strong>\n<br><br>\nWorks in normal office environment where there are no physical discomforts due to dust, dirt, noise and the like. Work involves daily use of a computer and requires attention to detail for long periods of time. Travel to off-site meetings and to other on-site departments is required as needed.</div>\n<br><strong>#LI-AH1</strong></div>\n<br>"}