{"job title": "Clinical Scientist (Associate Director) Experimental Medicine Early Development Oncology", "company": "Johnson &amp; Johnson", "city state": "– Titusville, New Jersey", "rating": "4.0", "job description": "Janssen Research &amp; Development, L.L.C, a member of the Johnson &amp; Johnson Family of Companies, is recruiting for a <strong>Clinical Scientist (Associate Director) Experimental Medicine Early Development Oncology</strong>. The preferred location for this position is Spring House, PA however Raritan, NJ or Titusville, NJ can also be an option. <strong>For the right individual, consideration can also be given to working remote.</strong> Up to 15% travel is required.\n<br><br>\nJanssen Research &amp; Development, LLC discovers and develops innovative medical solutions to address important unmet medical needs in oncology, immunology, neuroscience, infectious diseases and vaccines, and cardiovascular and metabolic diseases. Please visit http://www.JanssenRnD.com for more information.\n<br><br>\nThe <strong>Clinical Scientist (Associate Director) Oncology Early Development</strong> works in the Oncology Therapeutic Area Early Development (ED) group. He/she reports to a senior clinical scientist. The position will review the scope of work for central labs, central ECG and other vendors, and will oversee the study start up process including budgets and contracts, compliance with country/site regulations and SOPs.\n<br><br>\nWhen serving as Study Leader, this position will be responsible for the timely delivery of clinical study milestones including study starts, database locks, and topline results. Operational duties may include ensuring compliance with Good Clinical Practice guidelines and working directly with local trial managers and site monitor for smaller trials, or with the broader Global Clinical Operations group to execute early phase clinical studies.\n<br><br>\nThe <strong>Clinical Scientist (Associate Director)</strong> has the following essential job functions:\n\n\n<ul>\n<li>Responsible for writing protocol synopses, full protocols, informed consent documents, and will help design Case Report Forms (CRFs) and other data collection tools.</li>\n<li>He/She will work together with the Project scientist Leader to ensure the efficient initiation of early phase clinical trials and will provide input to the Statistical Analysis Plan, the Data Management Plan, and the Safety Management Plan.</li>\n<li>Assist in site selection, and will lead investigator meetings and site initiation visits. For ongoing clinical trials, this individual will review all incoming clinical data in real time including patient screening results, PK/PD data, adverse events and other study endpoints and will perform medical review activities in collaboration with the SRP.</li>\n<li>Scientific responsibilities will include internal activities such as interpreting clinical endpoints for topline results, preparing Clinical Study Reports, and participating in Disease Area Stronghold and Compound Development Team activities. External scientific collaborations will include interacting directly with academic investigators, coordinating clinical presentations at scientific meetings, and facilitating scientific publications in a timely manner.</li>\n<li>Work within the cross-functional Early Development Clinical Team to plan, execute and oversee patient-oriented early phase clinical trials.</li>\n<li>Function as the Study Leader or Co-Leader for early phase clinical trials working in close collaboration with the SRP</li>\n<li>Oversee study start-up activities including site selection, study budgets, timelines, study conduct, clinical supplies, and to manage study close out activities</li>\n<li>Ensure the efficient collection and review of safety, efficacy, PK/PD, and proof-of-concept data for early phase clinical trials while maintaining adherence to Good Clinical Practice (GCP) guidelines</li>\n<li>Work closely with other key support areas including Global Clinical Operations, Translational Research, Medical Writing, Regulatory Affairs, Project Management, Biostatistics &amp; Programing, and Clinical Pharmacology, and other allied support functions</li>\n<li>Provide operational leadership for early trials by working directly with local site monitors and with the broader Global Clinical Operations group for larger early phase trials.</li>\n<li>Provide scientific leadership internally for the conduct and interpretation of early phase trials and externally in academic collaborations and scientific presentations and publications directly related to trial outcomes</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>An advanced degree such as a Masters degree, Ph.D. or Pharm. D or with commensurate exceptional clinical research experience is required.</li>\n<li>A minimum of 6 years of industry experience in Oncology drug development, early phase clinical trials, and clinical operations is required.</li>\n<li>Significant knowledge of basic and translational research with an understanding of applications to cancer drug development is required.</li>\n<li>The ability to work in a matrix team environment and adherence to the highest personal and ethical standards with a commitment to patient-centered clinical research are essential is required.</li>\n</ul>\n\n<strong>\n<br>\nJohnson &amp; Johnson Family of Companies are equal opportunity employers, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, protected veteran status, disability status, or any other characteristic protected by law.</strong>\n<br>\n<strong>Primary Location</strong>\n<br>\nUnited States-Pennsylvania-Spring House\n<br>\n<strong>Other Locations</strong>\n<br>\nNorth America, United States-New Jersey-Raritan, United States-New Jersey-Titusville\n<br>\n<strong>Organization</strong>\n<br>\nJanssen Research &amp; Development, LLC. (6084)\n<br>\n<strong>Job Function</strong>\n<br>\nClinical Research non-MD\n<br>\n<strong>Requisition ID</strong>\n<br>\n<strong>9619180814</strong>\n<br>"}