{"job title": "Data Scientist", "company": "Omnicell", "city state": "– Raleigh, NC", "rating": "2.9", "job description": "<div><div> <p><strong>Data Scientist, AI/ML </strong></p>\n\n<p>Omnicell has an exciting new opportunity available for a Data Scientist as part of the Advanced Analytics team focused on Patient Engagement Solutions. The Data Scientist contributes to analytics product development, data modelling, research and trending. This position will investigate behavioral responses around medication adherence in risk-based population segments.</p>\n\n<p><strong>Responsibilities:</strong></p>\n\n<ul>\n<li>Explore analytical solutions applying machine learning techniques</li>\n<li>Provide business insight using statistical reasoning methodologies to answer business questions</li>\n<li>Perform data validation, preparation and exploration with various data structures and formats</li>\n<li>Create clear documentation or presentation of complex logic for various levels of technical expertise</li>\n</ul>\n\n<p><strong>Required Knowledge and Skills:</strong></p>\n\n<ul>\n<li>Ability to apply machine learning techniques such as neural networking, Bayesian method, ensemble learning, reinforcement learning and NLP to develop business solutions</li>\n<li>Ability to perform data validation, preparation and investigation using advanced analytics tool to generate business insights</li>\n<li>Excellent oral and written communication skills</li>\n<li>Strong problem-solving and detail focused</li>\n<li>Flexibility with ad-hoc investigations and changes in requirements</li>\n<li>Ability to generate the statistical reasoning to support the decision making process to improve existing rule based campaigns.</li>\n<li>Ability to work within a dynamic environment, delivering on requirements and deadlines</li>\n</ul>\n\n<p><strong>Basic Qualifications:</strong></p>\n\n<ul>\n<li>Master Degree in progress in Computer Science, Statistics, Analytics, Data Science, Operations Research or Engineering</li>\n<li>1+ years of hands on machine learning technique experience using SAS, R, Python/Scala or other comparable technology</li>\n</ul>\n\n<p><strong>Preferred Skills:</strong></p>\n\n<ul>\n<li>Ph. D in progress in Computer Science, Statistics, Analytics, Data Science, Operations Research or Engineerin</li>\n<li>Familiarity with healthcare and/or pharmacy industry </li>\n</ul>\n\n<p><strong>Work Conditions:</strong></p>\n\n<p>Office Environment</p>\n\n<p> </p> </div></div><div> <p>Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.</p>\n\n<p>All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.</p>\n\n<p>Omnicell will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information.</p> </div><div><div> <br></div></div>"}