{"job title": "Data Scientist", "company": "Quant AI", "city state": "– Bellevue, WA", "rating": "NA", "job description": "Quant AI is transforming patent portfolio management using advanced big data &amp; machine learning analytics. We are a startup in Bellevue, WA with a great culture and team that includes industry veterans, leading data science academics, and top engineering talent at the forefront of scientific computing. This position is an opportunity to get in on the ground floor of a high-growth company that is squarely at the center of the data science revolution.\n<br><br>\nWe are looking for a Data Scientist who will implement innovative machine learning based approaches that provide actionable insights into patent management. Your ability to refine Neural Network and Nearest Neighbor classifiers to solve real world problems, and your experience working with big data are the keys to this opportunity. This is a chance to make your mark in an exciting field -- the successful candidate will have considerable influence in the design and direction of our products. If you are looking for a role where you can further your career and make a difference, and you are looking for a friendly, collaborative, work environment that offers a competitive salary and great benefits, we should talk!\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Work directly with scientists in the field who are actively inventing methods that apply to our products.</li>\n<li>Use R and Python to implement and validate new AI methods and refine existing methods.</li>\n<li>Assist with data analysis and ingestion with the goal of improving predictive accuracy and performance.</li>\n</ul>\n<strong>Experience</strong>\n\n<ul>\n<li>MS or higher in Statistics, Applied Math, Operations Research, or a related quantitative field - applicable experience considered.</li>\n<li>Experience implementing models and using programming and scripting (especially Python, R, and/or Matlab).</li>\n<li>2+ years applicable experience</li>\n</ul>\n<strong>The Wrap</strong>\n<br><br>\nWe are an Equal Opportunity Employer and love diversity. All qualified applicants will be given consideration for employment regardless of race, color, religion, sex, national origin, age, or disabilities. You must be authorized to work in the US. While this is an in-office role, we offer flexibility for your commute and personal matters.\n<br><br>\nThis is your chance to leapfrog your career and be part of a high-growth venture in the AI/Data Science space - and to be part of a resounding success story!"}