{"job title": "Data Scientist", "company": "Rainmaker Resources, LLC", "city state": "– Cincinnati, OH", "rating": "NA", "job description": "<div><div><div><div><div><div><div>Data Scientist</div><div>Are you interested in joining the fastest growing company in the city? Our client is newly international, hiring career aggressive high achievers to be the next generation of leaders. They offer highly competitive comp packages and fantastic PTO!</div><br>\n<div>Description</div><div>The Data Scientist designs and develops methods and systems that have the ability to consolidate and analyze \"big data\" that generate insights to untapped client solutions. He/she will develop and code software programs, algorithms and automated processes to cleanse large datasets into meaningful information for gathering insight. By being able to draw conclusions from large, disparate sources of data, we can identify and pursue new areas of growth, preempt trends and continue our exponential growth.</div><div>Making an impact isn't something reserved for people in corner offices. It comes from people in every corner of the office. People with ambition, optimism and courage. We provide growth and opportunity and give employees flexibility in how they get the job done. You might not expect that from a big company, but we're smart enough to know how to hire the best and when to step aside and let them lead. Our goal is that you never stop learning and you never cease to amaze--especially yourself. If this fits your career goal, we can't wait to welcome you on board.</div><div>Responsibilities</div>\n\n<ul>\n<li>Designs, develops and programs methods, processes, and systems to consolidate and analyze unstructured, diverse \"big data\" sources to generate actionable insights and solutions for client services and product enhancement.</li><li>Interacts with product and service teams to identify questions and issues for data analysis and experiments.</li><li>Develops and codes software programs, algorithms and automated processes to cleanse, integrate and evaluate large datasets from multiple disparate sources.</li><li>Identifies meaningful insights from large data and metadata sources.</li><li>Interprets and communicates insights and findings from analysis and experiments to product, service and business managers.</li><li>As a seasoned, experienced professional with a full understanding of area of specialization, he/she resolves a wide range of issues in creative ways.</li><li>Ability to draw on past experience and current data to influence business partners and provide insightful analytics.</li><li>Works on problems of diverse scope where analysis of data requires evaluation of identifiable factors.</li><li>Demonstrates good judgment in selecting methods and techniques for obtaining solutions.</li><li>Networks with senior internal and external personnel in own area of expertise.</li><li>Higher level of data analysis skills and knowledge M&amp;A.</li><li>Ability to leverage Excel and other systems to perform complex financial modeling.</li><li>Ability to work in cross-functional teams and work independently.</li><li>Ability to perform onsite due diligence of potential acquisition targets.</li>\n</ul>\n\n<div>Qualifications</div>\n\n<ul>\n<li>Typically requires a minimum of 5 years of related experience with a Bachelor's degree; or 3 years and a Master's degree; or a PhD without experience; or equivalent work experience.</li>\n</ul>\n\n<div>All the above duties and responsibilities are essential job functions for which reasonable accommodation will be made. All job requirements listed indicate the minimum level of knowledge, skills and/or ability deemed necessary to perform the job proficiently. This position description is not to be construed as an exhaustive statement of duties, responsibilities or requirements. Employees may be required to perform any other job-related instructions as requested by their leader, subject to reasonable accommodation.</div><br>\n\n<div><em>*Rainmaker is a search firm focused in Finance, Accounting, Tax, Audit, Risk &amp; Compliance,Treasury, M&amp;A, Investor Relations, Financial Data, Business Intelligence and Analytics recruiting.</em> </div><div></div><div><em>Certified Woman Owned Business by WBENC</em></div><div><em>7 Consecutive Years named a Largest Executive Search Firm by Cincinnati Business Courier</em></div><div><em>Largest Women-Owned Business by Columbus Business First</em></div><div></div><div><em>To view more active searches visit our website:</em></div><div><em>www.RainmakerResourcesLLC.com</em></div></div></div></div></div></div></div>"}