{"job title": "Data Scientist", "company": "TDB", "city state": "– Linthicum, US-MD", "rating": "3.4", "job description": "TDB Communications, Inc. is seeking qualified Data Scientists:<br>\n<div>\n<div>\n<div><strong>Description of specific Duties in a typical workday for this position:</strong></div>\n<ul>\n<li>Provides design recommendations based on long-term IT organization strategy.</li>\n\n<li>Develops enterprise level application and custom integration solutions including major enhancements and interfaces, functions and features. Uses a variety of platforms to provide automated systems applications to customers.</li>\n\n<li>Provides expertise regarding the integration of applications across the business.</li>\n\n<li>Determines specifications, then plans, designs, and develops the most complex and business critical software solutions, utilizing appropriate software engineering processes – either individually or in concert with a project team. Will assist in the most difficult support problems.</li>\n\n<li>Develops programming and development standards and procedures as well as programming architectures for code reuse. Has in-depth knowledge of state-of-the art programming languages and object-oriented approach in designing, coding, testing and debugging programs.</li>\n\n<li>Understands and consistently applies the attributes and processes of current application development methodologies.</li>\n\n<li>Researches and maintains knowledge in emerging technologies and possible application to the business.</li>\n\n<li>Viewed both internally and externally as a technical expert and critical technical resource across multiple disciplines. Acts as an internal consultant, advocate, mentor and change agent.</li>\n</ul>\n\n<div><strong>Position Requirements:</strong></div>\n<ul>\n<li>At least 8 years of experience in developing cloud based multi user application with expertise in designing, building, testing and implementing IT application.</li>\n\n<li>Must have a strong background in software engineering principles and techniques.</li>\n\n<li>5 Years of Experience as a Data Scientist</li>\n\n<li>Excellent understanding of machine learning techniques and algorithms (such as k-NN, Naive Bayes, etc)</li>\n\n<li>Experience with varied range of data visualization tools.</li>\n\n<li>Experience with varied data querying languages (sql, pig, hive)</li>\n\n<li>Expertise in two or more of the programming languages (Java, Spark, Python, R)</li> \n\n<li>Experience leveraging and harvesting data using various Relational and NoSQL Database Technologies.</li>\n\n<li>Ability to work independently and drive solutions end to end leveraging various technologies to solve data problems and develop innovative big data solutions.</li> \n\n<li>Data oriented, with proven experience in discovering information from vast amount of data, providing value to the business and enabling smart decision making.</li> \n\n<li>Experience working in a Cloud based environment.</li> \n\n<li>A Bachelor's Degree from an accredited college or university with a major in Computer Science, Information Systems, Engineering, Business, or other related scientific or technical discipline is required.</li>\n</ul>\n\n</div>\n</div><br>\n\n<div><em>TDB Communications, Inc. is an EEO Affirmative Action Race/Sex/Sexual Orientation/Gender Identity/National Origin/Veteran/Disability Employer</em></div>\n\n<br><strong>Required Skills</strong>\n<br><br>\n<strong>Required Experience</strong>\n<br><br>\nJob Location\n<br>\nLinthicum, US-MD\n<br>"}