{"job title": "Data Scientist", "company": "Technosoft Corporation", "city state": "– Morrisville, North Carolina", "rating": "3.5", "job description": "Hi,\n<br><br>\nPlease find the details of the requirement. Let me know your interest in this position along with your updated resume.\n<br><br>\n<strong>Job role: Data Scientist</strong>\n<br><br>\nLocation: Morrisville, NC\n<br><br>\nDuration: 12 months+\n<br><br>\nAs a member of a fast growing team, within a growing area of the business, this role presents exciting opportunities for career progression. Working with an enormous breadth of data, you will be able to design and develop data science applications on the latest big data platforms. As a member of the team of data science software engineers and data scientists you will have the opportunity and support to develop truly innovative solutions in support of the business.\n<br><br>\nYour typical activities might include:\n<br><br>\nCollaborating with business owners, subject matter experts, and go to market teams to develop data science applications and services to support CRO business, including optimizing design and execution of clinical trials, and improving risk management.\n<br><br>\nCollaborating on multiple projects from concept to completion.\n<br><br>\nDesigning and developing micro services to enable integration with legacy applications.\n<br><br>\nWriting automated tests to verify the application/service functionality.\n<br><br>\nDocumenting the application design and architecture.\n<br><br>\nQualification:\n<br><br>\nOur ideal candidate will have:\n<br><br>\nA Bachelors or Masters degree in Computer Science or a related field.\n<br><br>\n2+ years of relevant experience with Scala\n<br><br>\n2+ years of relevant experience with Spark\n<br><br>\n2+ years of experience with Python\n<br><br>\n2+ years of experience with SQL\n<br><br>\nExperience working in a Linux/Unix environment\n<br><br>\nExperience working on big data platforms\n<br><br>\nStrong Functional and Object Oriented development background\n<br><br>\nExperience working with large volumes of complex claims data.\n<br><br>\nExperience working in a collaborative agile environment\n<br><br>\nLocal language skills, to an advanced level (spoken and written), with complete fluency in English.\n<br><br>\nSaravanan\n<br><br>\nPhone: 248-415-4549\n<br><br>\nFax: 248-603-2599\n<br>\nsaravanan@technosoftcorp.com"}