{"job title": "Scientist 2", "company": "APN Software Services Inc.", "city state": "– Norwood, MA, US", "rating": "3.9", "job description": "<div>\nScientist 2\n<br>\nLocation: Norwood, MA 02062\n<br>\nDuration: 12 Months\n<br><br>\n| Description: This person would be responsible for participating in a laboratory environment for research and development programs focused on the goal of developing and optimizing biosensors and their associated reagents.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Support biosensor and reagent development for point-of-care rapid tests using electrochemistry, clinical biochemistry, and surface chemistry;</li>\n<li>Support development of novel chemistry methods for sensing blood gases, electrolytes, and other analytes;</li>\n<li>Design, carry out experiments and data analysis , and present findings with little supervision;</li>\n<li>Proactively identify, troubleshoot and provide solutions to issues relating to development, evaluation, optimization and validation of biosensors.</li>\n<li>Make sound judgment to organize and prioritize various assignments and to reach desired outcomes in a timely fashion</li>\n</ul>\n\n<strong>Specific duties include:</strong>\n\n\n<ul>\n<li>Performing hands-on lab work in the areas of blood handling; assembling components; and testing on prototype equipment.</li>\n<li>Making observations and taking measurements directly, as well as collecting and interpreting data from the technical and operating staff involved</li>\n<li>Preparing test solutions</li>\n<li>Performing inventory management and safety inspections</li>\n</ul>\n\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>Minimum of a bachelor's degree Analytical Chemistry, Physical Chemistry, Material Science or Biomedical Engineering.</li>\n<li>Hands-on experience in a full range of electroanalytical techniques such as SPR, QCM, SAW and electrochemical sensing</li>\n<li>Knowledge and experience in surface analytical techniques: AFM, optical microscopy, ellipsometer, XPS, Tof-SIM, cyclic voltammetry, impedance spectroscopy, etc.</li>\n</ul>\n\nProvides support in a wide variety of semi-complex technical assignments. Participates in conducting semi-complex tests or investigations pertaining to the development of new designs methods, materials, or processes and investigates possible application of results. Obtains, correlates, and analyzes technical information needed to accomplish semi-complex tasks. Provides support in preparing reports, charts, graphs, and other documents. Participates in developing designs for a variety of products, processes, and components.</div>\n\n<br>"}