{"job title": "Stability Scientist", "company": "Bristol Myers Squibb", "city state": "– Devens, MA", "rating": "3.7", "job description": "<ul>\n<li>*Description - External**</li>\n</ul>\n\nReporting to the Associate Director, Global BIOLOGICS STABILITY (GBS). The Stability Scientist is responsible for activities related to the global stability studies. Activities include those associated with the preparation of CMC elements of regulatory filings of the Stability and project work to support the activities of the Global Biologics Stability program for BMS and Third Party Manufacturers (TPM). The stability Scientist will also assist with Stability Assessment, Study Generation, Sample Management, Stability Data Evaluation and Trending and Stability Data Reporting generation activities in accordance with cGMP and Company SOPs and as requested by management.\n\n\n<ul>\n<li>*MAJOR DUTIES AND RESPONSIBILITIES:**</li>\n<li>Author internal stability study reports, Health Authority (HA) stability study reports and master stability protocols. Critically review stability documents for consistency and quality.</li>\n<li>Work in collaboration with Global Regulatory Sciences, CMC teams and technical experts to author CMC stability sections of initial and post approval HA submissions.</li>\n<li>Author site APQR/APR and end to-end APQR/APR and present the data at internal meetings.</li>\n<li>Respond to HA stability questions. Complete and close all stability studies.</li>\n<li>Point person for global rollout of observations that may impact stability programs and develop strategies to close gaps/mitigation.</li>\n<li>Approve, identify, write and revise SOPs. Assist with development of directives</li>\n<li>Support Health Authority inspections and internal inspections</li>\n<li>Act, escalate, identify information regarding stability program that may impact lab capacity, product studies or regulatory commitments directly and promptly to management</li>\n<li>Works according to cGMP requirements and HA expectations.</li>\n<li>*Qualifications - External**</li>\n</ul>\n\n<strong>KNOWLEDGE AND SKILL</strong>\n\n\n<ul>\n<li>Minimum of - 2 years (PhD)/ 6-8 years (MS)/ 8-10 years (BS) relevant cGMP experience in biopharma at BMS or other company</li>\n<li>Knowledge and understanding of ICH Guidelines (Q1A, Q5C), US/EU/ROW stability requirements, and industry best practices. A thorough knowledge of cGMP regulations as referenced in The Code of Federal Regulations (21CFR) and their specific application to stability programs in a biologics manufacturing facility.</li>\n<li>Excellent technical writing skills. Experience authoring CMC filing sections</li>\n<li>Ability to work collaboratively in a team matrix environment</li>\n<li>Experience with evaluating and interpreting stability data using statistics and statistics software</li>\n<li>Applied knowledge and good understanding of analytical and/ or Microbiology techniques</li>\n<li>Exhibit strong leadership and decision making skills. Develop strategies for solving complex problems/issues; recommending and driving implementation of solutions.</li>\n<li>Experience in Operational Excellence, with proven record of accomplishment in continuous improvement.</li>\n<li>Prior experience with stability programs and demonstrated expertise in Biologics or Protein Therapeutic molecules</li>\n<li>Works independently with a demonstrated ability to recognize anomalous trends or results. Able to prioritize objectives from multiple projects, and deliver according to overall strategy.</li>\n<li>Use computer software/programs: Microsoft Office applications, SAP, LIMS, Trackwise, JMP, etc.</li>\n<li>Front room FDA/Inspectional experience is preferred.</li>\n</ul>\n\n<strong>DECISION MAKING</strong>\n\n\n<ul>\n<li>Scientist works on problems of diverse scope in which analysis of situation or data requires evaluation of identifiable factors.</li>\n<li>Exercises judgment within generally defined practices and policies in selecting methods and techniques for obtaining solutions.</li>\n<li>Acts as an advisor to subordinate staff to resolve problems. Develops performance requirements and evaluates subordinates accordingly. Establishes and recommends changes to policies which affect subordinate organization.</li>\n<li>Erroneous decisions or failure to achieve goals results in additional costs and personnel, and serious delays in overall schedules.</li>\n</ul>\n\n<strong>SUPERVISION RECEIVED</strong>\n\n\n<ul>\n<li>Scientist receives assignments in the form of objectives and establishes goals to meet objectives.</li>\n</ul>\n\nWork is reviewed and measured based on meeting established objectives and schedules.\n<br><br>\nIdentifies and reports any discrepancies from normal practices or procedures to senior management, recommending and implementing corrective actions.\n<br><br>\n<strong>SUPERVISION EXERCISED</strong>\n\n\n<ul>\n<li>Direct Supervision of Exempt/ non-exempt employees may be required</li>\n</ul>\n\nBristol-Myers Squibb is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status."}