{"job title": "Sr Development Scientist", "company": "Corning Incorporated", "city state": "– Painted Post, NY", "rating": "3.6", "job description": "Sr Development Scientist\n\n\n<ul>\n<li>*Date:** Aug 23, 2018</li>\n<li>*Location:** Painted Post, NY, US, 14870</li>\n<li>*Req #:** 33021</li>\n</ul>\n\nCorning is one of the world?s leading innovators in materials science. For more than 160 years, Corning has applied its unparalleled expertise inspecialty glass, ceramics, and optical physics to develop products that have created new industries and transformed people?s lives.\n<br><br>\nAt Corning, our growth is fueled by a commitment to innovation. We succeed through sustained investment in research &amp; development, a unique combination of material and process innovation, and close collaboration with customers to solve tough technology challenges. We are a four-time National Medal of Technology winner thanks to our technology leadership and R&amp;D environment, which attract and enable the best scientific minds in the world. This pipeline of talent has brought life-changing innovation to your fingertips for more than 160 years.\n\n\n<ul>\n<li>*Scope of Position** (i.e. projects involved with and role within group):</li>\n</ul>\n\nOur team works on project teams to aid in development of materials products and processes within the development team for optical fiber &amp; cable applications. As part of a project team, you are responsible for the completion of a subset of project objectives. This includes working a multi-functional team where you will be expected to be a standout colleague. This key position will entail UV curable material (clear and pigmented) development efforts from laboratory scale to full manufacturing and production while applying formulation principles to materials processing and properties characterization, to optimize and evaluate structure- property relationship. Analysis of the experimental data on materials development, characterization and testing would be a key component of the position, and you communicate the conclusions and recommendations based on the analysis to the team. You are expected to demonstrate strong analytical and problem-solving skills.\n\n\n<ul>\n<li>*Day to Day Responsibilities:**</li>\n</ul>\n\n+ You will demonstrate technical leadership with scouting new technologies for developing processes for polymer materials such as ink &amp; UV curable materials that enable coating options with lower cost and improved product attributes.\n<br><br>\n+ Conduct research, propose and execute experiments and analyze data to test hypotheses to improve development and understanding of coating products and processes.\n<br><br>\n+ Provide leadership in problem solving through comprehensive fundamental understanding of material behavior, advanced technical knowledge, data, modeling, and statistical tools to improve material performance.\n<br><br>\n+ Balance hands-on work-related activities with technical leadership while providing mentorship to the junior team members.\n<br><br>\n+ Collaboration with members of immediate team as well as teams within research and other development groups.\n<br><br>\n+ Support ongoing efforts and develop novel ways in the development of lower cost products with improved attributes.\n<br><br>\n+ Work with Research, Development, Engineering and Operating groups to ensure process requirements are understood and integrated to meet product requirements and division objectives.\n<br><br>\n+ Communicate progress and needs to immediate team and other key partners.\n<br><br>\n+ Prepare process and technology transfer documentation. Very actively file IP and write Internal Reports.\n\n\n<ul>\n<li>*Travel Requirements** (please note if international): Less than 20% travel, to manufacturing plants and tollers, primarily in North America.</li>\n<li>*Hours of work/work schedule/flex-time:** Mon-Fri 8a-5p / 40 hrs per week.</li>\n<li>*Education and Experience** (minimum required for consideration)</li>\n</ul>\n\n+ M.S/PhD in Organic or Polymer Science/Chemistry\n<br><br>\n+ 3+ years experience with ink chemistries and/or coating formulations\n\n\n<ul>\n<li>*Required Skills**</li>\n</ul>\n\n+ Understanding of organic materials (acrylic monomers, photo-initiators, inhibitors) and complex UV-curable formulation concepts with excellent problem-solving and analytical skills.\n<br><br>\n+ Extensive hands-on experience (in an industry setting) &amp; understanding of structure/property relationship for polymer formulations UV curable (including ink color dispersions, pigments) materials.\n<br><br>\n+ Comprehensive knowledge of Fusion and LED curing technologies for curing materials.\n<br><br>\n+ Extensive experience with material characterization using analytical testing techniques (such as separation techniques, spectroscopic techniques, particle size distribution, color matching evaluations such as Hunter, L*A*B, Munsell), dispersion characterization, testing, measurements techniques, and mechanical testing (rheology, DMA, DSC) of UV-curable polymer coating\n<br><br>\n+ Solid background and knowledge of formulations, interfacial &amp;surface chemistries, and deep understanding of resin to pigment critical concentration ratios.\n<br><br>\n+ Comprehensive competency in protocol and experiment development through high quality DoE approach\n<br><br>\n+ Strong ability to design and carry out experiments independently.\n<br><br>\n+ Deep knowledge in analyzing data and drawing logical conclusions from them enabling formulation scale up and commercialization.\n\n\n<ul>\n<li>*Desired Skills**</li>\n</ul>\n\n+ Experience with delivering technology to manufacturing\n\n\n<ul>\n<li>*Soft Skills** (Communication/Team/Leadership)</li>\n</ul>\n\n+ Strong communication skills along with effective presentation and technical writing skills\n<br><br>\n+ Committed to working within a team environment\n<br><br>\n+ Dedicated with the ability to work independently and lead technical work.\n<br><br>\n+ Project management experience is a plus.\n<br><br>\n+ Effective time management and skilled at handling multiple priorities\n<br><br>\nThis position supports immigration sponsorship.\n<br><br>\nWe prohibit discrimination on the basis of race, color, gender, age, religion, national origin, sexual orientation, gender identity or expression, disability, or veteran status or any other legally protected status.\n\n\n<ul>\n<li>*Nearest Major Market:** Corning</li>\n</ul>"}