{"job title": "Development Scientist - Optics", "company": "Corning Incorporated", "city state": "– Painted Post, NY", "rating": "3.6", "job description": "Development Scientist - Optics\n\n\n<ul>\n<li>*Date:** Aug 3, 2018</li>\n<li>*Location:** Painted Post, NY, US, 14870</li>\n<li>*Req #:** 32492</li>\n</ul>\n\nCorning is one of the world?s leading innovators in materials science. For more than 160 years, Corning has applied its unparalleled expertise inspecialty glass, ceramics, and optical physics to develop products that have created new industries and transformed people?s lives.\n<br><br>\nAt Corning, our growth is fueled by a commitment to innovation. We succeed through sustained investment in research &amp; development, a unique combination of material and process innovation, and close collaboration with customers to solve tough technology challenges. We are a four-time National Medal of Technology winner thanks to our technology leadership and R&amp;D environment, which attract and enable the best scientific minds in the world. This pipeline of talent has brought life-changing innovation to your fingertips for more than 160 years.\n\n\n<ul>\n<li>*Scope of Position** (i.e. projects involved with and role within group):</li>\n</ul>\n\nCorning impacts your daily life with Optical Fiber for high performance communications networks, Display Glass for damage resistant / touch sensitive mobile devices, and Ceramic Particulate Filters for cleaner air from light-duty passenger cars to heavy-duty trucks.\n<br><br>\nBy cultivating a culture that values innovation, respect, and flexibility, we help Employees build long careers and reach their highest potential. We are seeking dedicated Scientists who strive to see their research make a difference by pursuing breakthroughs and discoveries with a goal of commercialization. If you passionately believe in the power of innovation to change the world, if you measure your own success by the number of people touched by your research, and if you are up to the challenge of accomplishing world-class science resulting in significantly advanced products, we encourage you to apply today on Corning?s career website http://www.corning.com/worldwide/en/careers.html.\n<br><br>\nThis position of Optical Development Scientist is within the Applied Research &amp; Development (AR&amp;D) Department of the Corning Optical Communications Division. AR&amp;D combines a deep understanding of Fiber Optics telecommunications systems with fundamental knowledge of structured materials to develop new advantaged optical products and processes. This role we focus on early to mid-stage development of optical systems and related components. As Development Scientist - Optics, you will apply fundamental knowledge from research to develop complex optical systems including physical / geometric optics, fiber-optics, lasers, and broadband optical sources. Our projects are fast-paced with many leading to new product innovations and improved technical capabilities.\n\n\n<ul>\n<li>*Day to Day Responsibilities:**</li>\n</ul>\n\n+ Develop optical and electro-optical systems / components based on Customer requirements.\n<br><br>\n+ Participate in global multi-functional teams to deliver value added products with an understanding of the technical and financial feasibility.\n<br><br>\n+ Perform modeling and data analysis to optimize design performance and minimize costs.\n<br><br>\n+ Define specifications, tolerances, and tests procedures to ensure functionality.\n<br><br>\n+ Identify Suppliers and procure various components including sensors, lasers, fiber-optics, electronics, and mechanical positioners / packaging.\n<br><br>\n+ Hand-on assembly and testing of prototypes resulting in documented procedures.\n<br><br>\n+ Work closely with Scientists, Engineers, and Technicians to develop / craft / execute experiment plans.\n<br><br>\n+ Manage lab resources including organization of tools and expansion of capabilities.\n\n\n<ul>\n<li>*Travel Requirements:**</li>\n</ul>\n\n+ Up to 25% travel depending on the project\n<br><br>\n+ Domestic &amp; international travel\n\n\n<ul>\n<li>*Hours of work/work schedule/flex-time:**</li>\n</ul>\n\n+ 40 hours per week with overtime as needed\n<br><br>\n+ Monday through Friday 8am to 5pm\n<br><br>\n+ Flex-time is supported\n\n\n<ul>\n<li>*Education and Experience** (minimum required for consideration)</li>\n</ul>\n\n+ Ph.D. Optics, Physics, Electrical Engineering, or equivalent.\n<br><br>\n+ Optional M.S. Degree and 2 years of relevant experience.\n\n\n<ul>\n<li>*Required Skills**</li>\n</ul>\n\n+ Deep knowledge of optics, fiber optics, and laser systems.\n<br><br>\n+ General understanding of electronics and/or RF systems.\n<br><br>\n+ Assembly experience with optical and electro-optical systems.\n<br><br>\n+ Measurement experience with optical and electro-optical systems.\n<br><br>\n+ Computer modeling and data analysis experience.\n\n\n<ul>\n<li>*Desired Skills**</li>\n</ul>\n\n+ General understanding of radiometry and photometry.\n<br><br>\n+ Deep knowledge of electronics and/or RF systems.\n<br><br>\n+ Mechanical design and fabrication of prototypes.\n<br><br>\n+ Automation of measurement systems.\n\n\n<ul>\n<li>*Soft Skills** (Communication/Team/Leadership)</li>\n</ul>\n\n+ Self-motivated to deliver results with minimal supervision.\n<br><br>\n+ Communicates effectively (verbal &amp; written) to all levels.\n<br><br>\n+ Ability to multitask and balance short / long term priorities.\n<br><br>\n+ Dedicated and organized with good planning and time management skills.\n<br><br>\n+ Works effectively and builds relationships with dynamic global multi-functional teams.\n<br><br>\n+ Strive to handle conflict successfully and seek appropriate solutions.\n<br><br>\n+ Positive attitude, flexible, dedicated, and committed work ethic.\n<br><br>\n+ Scientific curiosity and innovative / visionary mindset.\n<br><br>\nThis position supports immigration sponsorship.\n<br><br>\nWe prohibit discrimination on the basis of race, color, gender, age, religion, national origin, sexual orientation, gender identity or expression, disability, or veteran status or any other legally protected status.\n\n\n<ul>\n<li>*Nearest Major Market:** Corning</li>\n</ul>"}