{"job title": "Health Economics Scientist", "company": "FHI 360", "city state": "– Durham, NC", "rating": "3.8", "job description": "<p>FHI 360’s Program Sciences and Technical Support (PSTS) Department has an opening for a Scientist-Economics position in our Durham NC or Washington DC office. PSTS collaborates with program partners in low- and middle-income countries in conducting applied research and providing technical assistance to strengthen health service delivery. The Scientist-Economics position offers the opportunity to provide technical leadership and to produce evidence through research to aid decision making for health programs. Candidates should be prepared to apply principles and techniques in research on the economics of health services in resource-poor settings.</p><p></p><p>***This position can be located in Durham, NC or Washington, DC.</p><p></p><p><b><u>Job Summary:</u></b></p><p></p><p>Initiates, directs, and executes scientific research studies and provides technical support to projects, evaluations, and health service programs. Applies a wide variety of scientific principles, methods, and concepts to studies, problems, and projects. Plans and executes trainings. Makes major contributions to scientific literature and conferences. Acts as spokesperson on research studies and technical projects and advises executive management. Interfaces with various departments and serves as an internal consultant.</p><p></p><p><b><u>Accountabilities: </u></b></p><ul><li>Provides scientific leadership for designing, implementing, and managing health economics research studies</li><li>Provides technical assistance to disease-focused public health programs to strengthen the financing component of the health system</li><li>Presents methods and findings of research and technical assistance initiatives in technical reports, publications for the scientific literature, and technical meetings</li><li>Provides technical leadership to build capacity of internal colleagues and external partners</li><li>Designs and leads trainings and leads preparation of supporting materials</li><li>Provides in-house review of protocols, papers, research strategies and proposals for funding projects for methodological and technological soundness</li><li>Leads and serves on teams preparing proposals for new business</li></ul><p></p><p><b><u>Applied Knowledge &amp; Skills: </u></b></p><ul><li>Expertise in specialized areas such as:<ul><li>health care financing mechanisms supporting universal health coverage (including community-based financing and equitable access to care);</li><li>health insurance schemes (including social health insurance);</li><li>performance-based financing (including financial and non-financial incentives);</li><li>health care expenditure studies (including efficiency and sustainability analyses);</li><li>cost, cost-benefit, and cost-effectiveness analyses</li></ul></li></ul><ul><li>Comprehensive knowledge of theories, concepts and practices used in analysis of scientific projects and research studies</li><li>Excellent skills in study design and quantitative analysis</li><li>Excellent oral and written communication skills</li><li>Ability to analyze and interpret data, identify errors and provide correction action</li><li>Demonstrates technical skills, scientific creativity, self-initiative, collaboration with others and independent thought</li></ul><p></p><p><b><u>Education: </u></b></p><ul><li>Doctorate Degree or its International Equivalent in Economics, Public Health, Health Services Research, Public Policy, or Related Field</li><li>Masters degree with 10+ years of relevant health economics experience </li></ul><p></p><p><b><u>Experience: </u></b></p><ul><li>Typically requires 5-8 years of post-doctorate experience with scientific disciplines developing strategies in research studies and scientific projects</li><li>Experience leading the design and implementation of health economic analyses in low- and middle-income countries</li><li>Experience in public health policy analysis, health policy research, implementation science or related fields</li><li>Experience contributing to initiatives to seek funding for new business</li><li>Articulate, professional and able to communicate in a clear, positive manner with clients and staff</li><li>Must be able to read, write, and speak fluent English. Additional skills in French or Portuguese preferred</li><li>Prior work experience in a non-governmental organization (NGO) or in work-related academic, governmental, or industry setting</li><li>Experience working internationally in resource-poor settings</li></ul><p></p><p><b><u>Travel Requirements: </u></b></p><ul><li>10%-25%</li></ul><p></p><p></p><p>This job description summarizes the main duties of the job. It neither prescribes nor restricts the exact tasks that may be assigned to carry out these duties. This document should not be construed in any way to represent a contract of employment. Management reserves the right to review and revise this document at any time.<br><br>FHI 360 fosters the strength and health of its workforce through a competitive benefits package, professional development and policies and programs that support healthy work/life balance. Join our global workforce to make a positive difference for others — and yourself. </p><p></p><p>Please click here to continue searching FHI 360's Career Portal.<br><br>FHI 360 is an equal opportunity and affirmative action employer. FHI 360 is an equal employment and affirmative action employer whereby we do not engage in practices that discriminate against any person employed or seeking employment based on race, color, religion, sex, sexual orientation, gender identity, national or ethnic origin, age, marital status, disability, veteran status, genetic information or any other status or characteristic protected under applicable law.</p>"}