{"job title": "Environmental Scientist I", "company": "Freeport McMoRan", "city state": "– El Paso, TX", "rating": "4.0", "job description": "Freeport-McMoRan is a premier U.S.-based natural resources company with headquarters in Phoenix, Arizona. We operate large, long-lived, geographically diverse assets with significant proven and probable reserves of copper, gold and molybdenum. The company has a dynamic portfolio of operating, expansion and growth projects in the copper industry. Freeport-McMoRan is the world?s largest publicly traded copper producer, the world?s largest producer of molybdenum and a significant gold producer. We have a long and successful history of conducting our business in a safe, highly efficient and socially-responsible manner.\n<br><br>\nWe have the assets, the talent, the drive and the financial strength to provide attractive and rewarding careers for our employees. We encourage you to take some time to explore your career opportunities at Freeport-McMoRan.\n<br><br>\nUnder close supervision, assists in providing technical support and guidance for Environmental projects and programs at assigned site.\n\n\n<ul>\n<li>Assists in installation, operation, and maintenance of environmental monitoring instruments and testing equipment; analyzes data for compliance with regulatory requirements</li>\n<li>Evaluates and assesses environmental risk and assists in developing programs for risk reduction</li>\n<li>Participates in regular audits and inspections of operations areas for purposes of ensuring compliance with regulatory programs, site environmental policies, procedures and requirements of the Environmental Management System</li>\n<li>Collaborates in recommending appropriate action to management in compliance with regulations</li>\n<li>Prepares and maintains detailed records and files of environmental data and communications</li>\n<li>Develops and maintains basic working knowledge of national, regional, and local environmental occupation health and other applicable regulations</li>\n<li>Develops a basic knowledge of site environmental policies and procedures</li>\n<li>Coordinates the timely recycling and disposition of materials and other company assets in compliance with applicable legal and other requirements</li>\n<li>Tracks and reports the recycling and disposition of materials and other company assets as directed</li>\n<li>May provide leadership to technicians as assigned</li>\n<li>Performs other duties as assigned</li>\n<li>Minimum Qualifications*</li>\n<li>Bachelor's degree in Environmental Science, Environmental Technology, Earth Science or related Natural Science (such as Biology, Chemistry, Geology, Hydrology, Forestry, Agriculture, Meteorology, Environmental/Natural Resource Management), or Mathematics/Computer Science including Accounting and Finance, Business Management or other Bachelor's degree</li>\n<li>Additional certification or licensure appropriate to the job may be required or preferred (U.S. examples include: HAZWOPER, Method 9, DOT, EMS Auditor, Asbestos, Water Treatment Operator, or CHMM)</li>\n<li>Preferred*</li>\n<li>Previous experience working as an Environmental intern</li>\n<li>Criteria/Conditions*</li>\n<li>Ability to understand and apply verbal and written work and safety-related instructions and procedures given in English</li>\n<li>Ability to communicate in English with respect to job assignments, job procedures, and applicable safety standards</li>\n<li>Must be able to work in a potentially stressful environment</li>\n<li>Work is in a mine or manufacturing plant setting, which may include exposure to extremes in temperature and humidity, moving mechanical parts, risk of electrical shock, toxic chemicals, explosives, fumes or airborne particles</li>\n<li>While performing the duties of this job, the employee is regularly required to stand, sit, demonstrate manual dexterity, climb stairs and ladders, work on elevated platforms, talk, hear and see</li>\n<li>Occasionally may be required to lift moderately heavy objects (up to 30 pounds) during the course of the workday</li>\n<li>Personal protective equipment is required when performing work in a mine, outdoor, manufacturing or plant environment, including hard hat, hearing protection, safety glasses, safety footwear, and as needed, respirator, rubber steel-toe boots, protective clothing, gloves and any other protective equipment as required</li>\n<li>Freeport-McMoRan promotes a drug/alcohol free work environment through the use of mandatory pre-employment drug testing and on-going random drug testing</li>\n</ul>\n\nFreeport-McMoRan has reviewed the jobs at its various office and operating sites and determined that many of these jobs require employees to perform essential job functions that pose a direct threat to the safety or health of the employees performing these tasks or others. Accordingly, the Company has designated the following positions as safety-sensitive:\n\n\n<ul>\n<li>Site-based positions, or positions which require unescorted access to site-based operational areas, which are held by employees who are required to receive MSHA, OSHA, DOT, HAZWOPER and/or Hazard Recognition Training; or</li>\n<li>Positions which are held by employees who operate equipment, machinery or motor vehicles in furtherance of performing the essential functions of their job duties, including operating motor vehicles while on Company business or travel (for this purpose ?motor vehicles? includes Company owned or leased motor vehicles and personal motor vehicles used by employees in furtherance of Company business or while on Company travel); or</li>\n<li>Positions which Freeport-McMoRan has designated as safety sensitive positions in the applicable job or position description and which upon further review continue to be designated as safety-sensitive based on an individualized assessment of the actual duties performed by a specifically identified employee</li>\n</ul>\n\n<strong>/</strong>\n<br><br>\n/Equal Opportunity Employer/Protected Veteran/Disability//\n<br><br>\n<strong>//</strong>\n\n\n<ul>\n<li>*Job:** **Environmental*</li>\n<li>*Title:** *Environmental Scientist I - El Paso*</li>\n<li>*Location:** *TX-El Paso Refinery*</li>\n<li>*Requisition ID:** *1804449*</li>\n</ul>"}