{"job title": "Principal Research Scientist - Forecasting", "company": "JD.com", "city state": "– Mountain View, CA", "rating": "3.8", "job description": "<strong>Job Description:</strong> Principal Research Scientist - Forecasting\n<br><br>\n<strong>Job Location:</strong> Mountain View, CA\n<br><br>\n<strong>Job Type:</strong> Full-time\n<br><br>\n<strong>Department:</strong> JDY\n<br><br>\nJD.COM is looking for exceptional self-motivated research scientists with strong forecasting experience to join our Y-Division in JD.COM Silicon Valley R&amp;D Center. As a core component for JD's supply chain management systems and operation planning engines, our forecasting platform produces millions of predictions on a daily basis. We are looking for self-motivated scientists to improve forecasting accuracy through machine learning and/or statistical modeling.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n<li> Design and develop scalable forecasting models using machine learning, deep learning or statistical modeling techniques.</li>\n<li> Work with business and algorithm teams to understand the forecasting requirements and collaborate with partner teams to provide personalized and innovative forecasting solutions to integrate with other decision-support or decision-making systems.</li>\n<li> Participate in cutting-edge research in artificial intelligence and machine learning algorithms and applications.</li>\n</ul>\n<strong>Qualifications:</strong>\n\n<ul>\n<li> Ph.D. degree in Computer Science, Machine Learning, Operational Research, Statistics or related field.</li>\n<li> 5+ years hands-on experience with demand forecasting or other predictive models/algorithms.</li>\n<li> Experience with big data platform such as Hadoop.</li>\n<li> Experience with scripting languages such as Python or R.</li>\n<li> Experience with deep learning frameworks such as TensorFlow or Caffe is a plus.</li>\n<li> Excellent written and oral communication skills.</li>\n</ul>\n<strong>About JD-Y team</strong>\n<br><br>\nJD Y Division (JD-Y) focuses on building a smart supply chain and using AI to drive retail reform. The Y division applies AI algorithm and uses data-driven approaches in product selection, inventory management, pricing, and promotion. It also leverages big data technologies in smart retail to lower the costs of distribution. The Y division is working with leaders in industry and academia to design and build the next generation supply chain management system.\n<br><br>\n<em>JD.com is an Equal Opportunity Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class.</em>"}