{"job title": "Research Scientist", "company": "OSI Systems", "city state": "– Fremont, CA", "rating": "2.5", "job description": "Due to contracts with the US Federal Government the successful candidate must be a US Citizen.\n<br><br>\nRapiscan Systems is an industry leader in detection technology, providing cargo and vehicle inspection systems and services for ports, borders, military, high-threat facilities, and checkpoints to help customers combat terrorism, drug smuggling, illegal immigration, and trade fraud. We offer a broad array of scanning system configurations that leverage low-, medium-, and high-energy X-ray technologyor multiple X-ray technologiesto address each customer's unique security application requirements. Our commitment to excellence in imaging performance, innovative design, and uncompromising quality ensures our solutions consistently deliver best-in-class imaging, high reliability, and operator satisfaction, to help customers find threats and contraband with ease and confidence.\n<br><br>\nThe successful candidate will be a member of the Science and Technology (S&amp;T) team at Rapiscan Systems. The mission of S&amp;T is to develop commercially viable technology that drives the market through innovation. The S&amp;T team works collaboratively across four continents and has expertise in x-ray and nuclear physics, data science, chemistry, hardware and software engineering, computer science, and detection algorithms. This position will report to Sr. Director of R&amp;D.\n<br><br>\n<strong>Job Description</strong>\n\n\n<ul>\n<li>Create and run Geant4 simulations, analyze results, and perform trade studies to guide system design.</li>\n<li>Validate simulation results through laboratory experiments on test beds working independently and with other Science team members.</li>\n<li>Uphold the Company's core values of Integrity, Innovation, Accountability, and Teamwork.</li>\n<li>Demonstrate behavior consistent with the Company's Code of Ethics and Conduct.</li>\n<li>It is the responsibility of every Rapiscan Systems employee to report to their manager or a member of senior management any quality problems or defects in order for corrective action to be implemented and to avoid recurrence of the problem.</li>\n<li>Duties may bemodified or assigned at any time to meet the needs of the business.</li>\n</ul>\n\nJob Qualifications\n\n\n<ul>\n<li>Masters or Ph.D. in Physics, Nuclear Engineering, Radiation Physics or a related field preferred.</li>\n<li>Experience in Geant4 including setting up complex geometries using many objects of different materials, using physics lists, and constructing detectors for X-ray source and detector applications. Experience in using simulations results to conduct trade studies.</li>\n<li>Proficient in C++ programming.</li>\n<li>Firm grasp on topics related to x-ray and nuclear physics and a desire to acquire understanding of its applied use for non-intrusive inspection.</li>\n<li>Proficient at setting up tests, acquiring data and performing data analysis with LabVIEW, Matlab, Python and/or Java.</li>\n<li>Good communication skills. The candidate will be expected to give presentations and write technical reports on topics on which he/she is working. Also, communicating frequently with our collaborators on projects is expected.</li>\n<li>Ability to take occasional business trips to conferences (about 1 per year) and collaboration meetings and data collection campaigns at other Rapiscan or customer locations</li>\n<li>Ability to work both independently and with a team of scientists and engineers</li>\n<li>Has a strong desire to learn new skills, collaborate with others, and apply knowledge gained to real-world security problems.</li>\n</ul>\n\nDesired Experience\n\n\n<ul>\n<li>Experience with additional Monte Carlo methods (e.g., MCNP)</li>\n<li>Proficient in Python</li>\n<li>Experience with nuclear instrumentation, radiation detectors, and data acquisition systems</li>\n<li>Experience interfacing with hardware</li>\n<li>Experience in x-ray generation, detection and imaging technologies</li>\n<li>Being a creative problem solver</li>\n</ul>\n\nEqual Opportunity Employer\n<br><br>\nEEO is the Law\n<br><br>\nPoster Link: http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf\n<br><br>\nOSI Systems, Inc. has three operating divisions: (a) Security, providing security and inspection systems, turnkey security screening solutions and related services; (b) Healthcare, providing patient monitoring, diagnostic cardiology and anesthesia systems; and (c) Optoelectronics and Manufacturing, providing specialized electronic components and electronic manufacturing services for original equipment manufacturers with applications in the defense, aerospace, medical and industrial markets, among others."}