{"job title": "Mass Spectrometry Metabolomic Scientist", "company": "Pacific Northwest National Laboratory", "city state": "– Richland, WA", "rating": "3.7", "job description": "<ul>\n<li>*Organization and Job ID**</li>\n</ul>\n\nJob ID: 308064\n<br><br>\nDirectorate: Earth &amp; Biological Sciences\n<br><br>\nDivision: Environmental Molecular Sciences Laboratory\n<br><br>\nGroup: Biosystems Dynamics &amp; Simulation\n\n\n<ul>\n<li>*Job Description**</li>\n</ul>\n\nThe Environmental Molecular Sciences Laboratory (EMSL) seeks a scientists focused in the area of mass spectrometry particularly in the area of metabolomics. EMSL is a national scientific user facility and research directorate located at Pacific Northwest National Laboratory (PNNL). EMSL is supported and stewarded by the U.S. Department of Energy?s (DOE) Office of Biological and Environmental Research (BER). The EMSL user facility is designed to provide innovative and breakthrough experimental and computational science that addresses BER programs by providing access to more than 75 state-of-the-art instrumental and computational capabilities. EMSL users address some of the most important molecular-to-mesoscale challenges relevant to DOE missions.\n<br><br>\nThe incumbent will work on a broad range of projects with EMSL users as well as develop a collaborative research program that contributes to EMSL?s mission. The successful candidate will have received a PhD with an emphasis on mass spectrometry, biochemistry or separations science. The preferred candidate will have an extensive familiarity with GC-MS and LC-MS metabolomics based analyses, understanding of NMR based metabolite analysis as well as sample preparation for metabolomics based studies and metabolite based data analysis. A strong track record of interdisciplinary science as evidenced by publications in peer-reviewed journals is a necessity. Excellent oral and written communication skills are critical, as is the ability to work in a multi-disciplinary and culturally diverse environment.\n<br><br>\n<strong>Representative duties of the incumbent include:</strong>\n<br><br>\n? Operate the LC-MS and GC-MS instruments for the analysis of metabolomics samples\n<br><br>\n? Data analysis and preliminary interpretation of LC-MS and GC-MS data.\n<br><br>\n? Interaction with EMSL Users and collaborators on the application of LC-MS and GC-MS techniques to address specific biological questions. Serve as points of contact with interactions with biologists and other collaborators.\n<br><br>\n? Support the maintenance and operation of the MS laboratory\n\n\n<ul>\n<li>*Minimum Qualifications**</li>\n</ul>\n\nBS/BA with 2 years of experience; MS/MA with 0 years of experience; PhD with 0 years of experience\n\n\n<ul>\n<li>*Preferred Qualifications**</li>\n</ul>\n\nCandidates must have a Ph.D. with a substantial emphasis on mass spectrometry, plus 3 years of relevant experience.\n\n\n<ul>\n<li>*Equal Employment Opportunity**</li>\n</ul>\n\nBattelle Memorial Institute (BMI) at Pacific Northwest National Laboratory (PNNL) is an Affirmative Action/Equal Opportunity Employer and supports diversity in the workplace. All employment decisions are made without regard to race, color, religion, sex, national origin, age, disability, veteran status, marital or family status, sexual orientation, gender identity, or genetic information. All BMI staff must be able to demonstrate the legal right to work in the United States. BMI is an E-Verify employer. Learn more at jobs.pnnl.gov.\n<br><br>\n_Directorate:_ _Earth &amp; Biological Sciences_\n<br><br>\n_Job Category:_ _Scientists/Scientific Support_\n<br><br>\n_Group:_ _Biosystms Dynamics &amp; Simula_\n<br><br>\n_Opening Date:_ _2018-07-05_\n<br><br>\n_Closing Date:_ _2018-07-21_"}