{"job title": "Scientist III", "company": "System One Holdings", "city state": "– West Point, Pennsylvania", "rating": "3.3", "job description": "Joule, a System One division is seeking a Scientist III for a contract position. With more than 6,000 employees and roughly 40 offices throughout the , clinical, engineering, energy, IT, legal and administrative staffing services. For more than 40 years, we have delivered workforce solutions and integrated services to clients nationally.\n<br><br>\nThe Scientist III will:\n<br><br>\n<strong> Responsibilities:</strong>\n<li> Develop, validate and run clinical biomarker assays using Quantitative QQQ Mass Spectrometry. Provide support for all therapeutic areas and all phases of clinical development at the company.</li> <li> Assist in the transition of biomarker assays from Basic Research to Clinical by providing technical guidance on fit-for-purpose assay validation.</li> <li> Interface with scientists and physicians in early and late stage clinical development to execute on biomarker strategies in clinical trials.</li> <li> Writing memos, final reports and publications summarizing data, and writing/updating lab SOPs.</li> <li> Serve as a subject matter expert in tissue-based assay development and validation, collaborating with project teams, biomarker leaders, clinical operations and regulatory affairs on the implementation of these assays in clinical trials</li>\n<strong> Requirements:</strong>\n<li> BS, BA, MS or PhD in a life sciences discipline (Biochemistry, Immunology, Molecular Pathology, Cell Biology, etc.) or Chemistry Required Experience and Skills**:</li> <li> A minimum of 10 (for BS or BA), 5 (for MS) or 0 (for PhD) years of pharmaceutical industry experience</li>  <li> A minimum of 5 years of direct experience in quantitative QQQ Mass Spectrometry assay development and implementation.</li> <li> Strong interpersonal, verbal and written communication skills</li> <li> Be able to work independently; strong leadership skills</li> <li> Ability to execute within a matrixed organization</li>"}