{"job title": "Staff Scientist, SMD", "company": "University of Rochester", "city state": "– Rochester, NY", "rating": "4.1", "job description": "Opening\n<br><br>\nFull Time 40 hours Grade 092 Neuroscience\n<br><br>\nSchedule\n<br><br>\n<strong>8 AM-4:30 PM; OCC WKENDS</strong>\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>*Position Summary:**</li>\n</ul>\n\nUnder general direction and with considerable latitude for exercise of independent judgment, provides direct research and research training support at the professional level by directing and executing small, complex research projects or major aspects of larger research projects; and provides extensive guidance to and/or directly supervises technicians, laboratory aides, graduate students, undergraduate students, postdoctoral appointees and professional staff. The purpose of this description is for Doctoral level research and its use will be strictly regulated by review and approval of the Dean?s office to meet academic and research needs of the school and faculty.\n\n\n<ul>\n<li>*Responsibilities:**</li>\n</ul>\n\nUnder general guidance and with latitude for exercising independent technical judgment, performs research related activities. Responsibilities include most or all of the following, as well as other related duties:\n\n\n<ul>\n<li>Performs research on the developmental maturation and functional plasticity of brain circuits involved in the cognitive control of sensorimotor behaviors. Plans and executes animal experiments in both rodents and non-human primates using appropriate techniques such as stereotaxic surgery, neuroanatomical tracing, fluorescent microscopy, optogenetic manipulation and behavioral analysis. Supervises students and staff on aspects of this project and integrates results.</li>\n<li>Organizes and executes microscopy experiments in the lab. Supervises and trains new staff in microscopy techniques, including sample preparation.</li>\n<li>Designs new research projects or sub-projects, contributes to writing of research proposals and manuscripts, and prepares regulatory documentation required for performance of research. Writes protocols for the conduct of research, which include: purposes of study, design of experiments, lists of materials and methods to be used and the schedule of activities.</li>\n<li>Analyzes and evaluates experimental data and interprets results within the scope of the study; assesses the importance of findings in relation to the general research program. Prepares written reports on all phases of laboratory work involved in research projects. Contributes to the design, interpretation and final writing of research publications ? thereby meeting expectations for co-authorship of scientific publications. Develops and controls research project budgets in consultation with supervising faculty. Recommends expenditures for major laboratory equipment. Authorizes expenditures for expendable supplies and maintenance.</li>\n<li>Keeps abreast of trends in field of interest by reading current research literature, abstracting scientific articles of value in the prosecution of research problems, and attending and presenting at scientific meetings, seminars and research conferences.</li>\n<li>Attends and presents research at weekly lab meetings.</li>\n<li>Develops and installs operating procedures for the laboratory, and independently operates complex equipment. Develops and modifies test methods; selects procedures for data collection and handling; develops or utilizes computer programs for conversions and statistical treatment of data.</li>\n<li>Directs the gathering of research materials, supplies, equipment and apparatus and experimental. Coordinates service support: repair of equipment, requisitioning of supplies and research materials and minor construction.</li>\n<li>Interviews, trains, supervises and evaluates staff. Directs initial training as well as continuous skill development of staff/trainees in laboratory techniques and instrumentation procedures. Counsels staff/trainees on technical problems; advises and assists staff/trainees with special research projects. Evaluates the performance of research equipment, making design changes or developing new approaches for its use.</li>\n<li>*Qualifications:**</li>\n</ul>\n\nDoctoral degree with major course work in the field of assignment, and a minimum of 2-5 years of relevant postdoctoral training.\n\n\n<ul>\n<li>EOE Minorities/Females/Protected Veterans/Disabled*</li>\n<li>Job Title:* Staff Scientist, SMD</li>\n<li>Location:* School of Medicine &amp; Dentistry</li>\n<li>Job ID:* 210420</li>\n<li>Regular/Temporary:* Regular</li>\n<li>Full/Part Time:* Full-Time</li>\n</ul>"}