{"job title": "Software Development Engineer - Big Data", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAmazon is Big, Amazon is Data Driven. Interested in building the platform to make this easy at amazon scale?<br><br>Amazon's Big Data Technologies team is building a new data ecosystem, flexible enough for teams to bring their own compute platforms, experiment, and perform massive data analysis using AWS technologies.<br>We are radically changing the traditional ETL (Extract, Transform and Load) model to a data marketplace concept, facilitating 'one click' data-mart creation, and relationships between data producers and consumers.<br>We are developing a next-generation cluster management system and we’re looking for top engineers to build from the ground up.<br><br>This is a hands-on position where you will be do everything from designing and building extremely stable components and cutting-edge features to formulating strategy for EMR and Redshift at Amazon, mentor other engineers and work with the savviest customers in the business to help them get the best results. You need to not only be a top software developer with excellent programming skills, an understanding of big data and parallelization, and a stellar record of delivery but also excel at leadership and customer obsession and have a real passion for massive-scale computing.<br><br>Your responsibilities will include:<br>- Keeping your finger on the pulse of the constantly evolving and growing Big Data field<br>- Translation of complex functional and technical requirements into detailed architecture and design<br>- Delivering systems and features with top-notch quality, on time<br>- Stay current on technical knowledge to keep pace with rapidly changing technology, and work with the team in bringing new technologies on board<br><br>*LI-DK1<br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n- BS degree or higher in Computer Science or related program.<br>- Experience in Java, C++, C# or other object oriented language.<br>- Computer Science and Software development fundamentals.<br>- Software design experience.<br><br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n- MSc degree in Computer Science or related program.<br>- Experience with highly scalable systems and processing huge amounts of data.<br>- Experience building distributed systems.<br><br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}