{"job title": "Senior Site Reliability Engineer", "company": "Anaplan", "city state": "– San Francisco, CA", "rating": "4.1", "job description": "<strong>Site Reliability Engineer</strong>\n<br><br>\n<strong>San Francisco, CA</strong>\n<br><br>\nAt Anaplan, we are looking for a self-motivated <strong>SITE RELIABILITY ENGINEER</strong> to join our growing team at Anaplan HQ in the city-by-the-bay, <strong>SAN FRANCISCO</strong> to be a member of the Global Technical Operations group located across San Francisco, US, London, UK, and York, UK. You will be embedded in the SF Technical Operations organization, and also work closely with Engineering Development teams, Product Architecture, and Program Management. There is close partnering between our UK SRE team and our SF SRE team.\n<br><br>\nAs a Site Reliability Engineer, we know that you are passionate about seamless uptime. You delight in building tools to automate routine tasks and constantly seek new ways to improve system performance. If you also want to join a fast-growing startup, work with friendly people, and play with some cool tech, you found the right place!\n<br><br>\nIn the heart of the eclectic SOMA district, you can feel the excitement and energy of what we do at Anaplan when you step into our San Francisco office. There are open floor plans, fully stocked kitchens, and great collaboration spaces, and we focus on making sure that you have everything you need to work well from the right lighting to the latest technology. When it's time for the team to play together, we visit with our neighbors at a Giants game or a local pub's happy hour. Come see for yourself what a collaborative and exciting place to work looks like. You will join a team of individuals who embrace and respect diverse perspectives, aren't afraid to push boundaries and try new ideas, and are passionate about helping our customers and each other succeed. We work hard, but we also don't wait for an excuse to have fun and we inspire each other!\n<br><br>\nThis role is an immediate full-time position. If you're ready to roll up your sleeves and tackle unique problems that no one is solving in the tech space yet, keep reading.\n<br><br>\n<strong>What you'll be doing:</strong>\n\n<ul>\n<li>Our core technology is Java on Linux using open source technology throughout the stack. The Java engine runs and stores all data in RAM for super high performance while staying safe with transaction logs and auto recovery. The office is Macs with a few Windows holdouts. You decide which works best for you.</li>\n<li>Utilize your skills in automation, replication and scaling to manage the production cloud in our worldwide data centers</li>\n<li>Write scripts in Ruby, Python, Perl, etc. to build custom tools for automation, replication and scaling</li>\n<li>Build tools to monitor and provide metrics on our systems</li>\n<li>Perform Linux system administration (DNS, NFS, RPM, Apache, Raid, etc.)</li>\n<li>Extend the existing automation we have in place and making things even easier to use.</li>\n<li>Support Product Development Teams</li>\n<li>Lead Release deployments and participate in revising software design to scale and prevent against failures</li>\n<li>Ensure compliance with various best practices.</li>\n<li>Adhere to compliance standards in the development and operations spaces as guided by security.</li>\n<li>Participate in on-call rotation</li>\n<li>Work in a customer facing production environment</li>\n</ul>\n<strong>More about you:</strong>\n<br><br>\n<ul>\n<li>B.S. in Computer Science and 3 + years relevant experience OR 10+ years equivalent experience supporting production platforms using the following skills:</li>\n<li>Automation using tools such as Chef and Rundeck</li>\n<li>Programming in any of the following: Ruby, Python, Perl, BASH</li>\n<li>Multi Data center management, replication, scaling.</li>\n<li>Middleware software such as HA Proxy, Consul, Terraform or equivalent architectures</li>\n<li>Java applications including JVM performance and tuning</li>\n<li>Metrics and monitoring writing custom tools and familiar with open source options.</li>\n<li>Linux administration DNS, NFS, RPM, Apache, Raid, etc.</li>\n</ul>\n<strong>Technologies you'll work with:</strong>\n<br><br>\n<ul>\n<li>Chef</li>\n<li>CentOS</li>\n<li>Red Hat</li>\n<li>VMWare</li>\n<li>EMC</li>\n<li>Isilon</li>\n<li>Pure</li>\n<li>Dell-Both Virtual and Bare Metal</li>\n<li>HP-Both Virtual and Bare Metal</li>\n<li>Splunk</li>\n<li>New Relic</li>\n<li>Rundeck</li>\n<li>Kubernetes</li>\n</ul>\n<strong>Bonus points:</strong>\n\n<ul>\n<li>MySQL replication, backups, some light querying</li>\n<li>Networking Switches, routers, firewalls, VPN</li>\n<li>Amazon EC2, EFS and related AWS technologies</li>\n<li>Google Cloud</li>\n<li>Taking a bare metal server/hardware to a fully functional app server</li>\n</ul>\nDo you align with Anaplan's Values?\n<br><br>\n<strong>Collaborative: We go out of our way to help others succeed</strong>\n<br><br>\nExplore all of our Values on Anaplan.com/careers\n<br><br>\n#AnaplanLOVE\n<br><br>\n<strong>About Anaplan</strong>\n<br><br>\nAt Anaplan, we're relentlessly passionate about improving the way companies and people do business by empowering them with the technology, insights, and confidence they need to make better-informed plans and decisions.\n<br><br>\nWith 20 offices worldwide, we're building products used by over 850 clients that include some of the world's largest brands and fast-growing companies in every industry, and we're just getting started.\n<br><br>\n<strong>CAN'T FIND THE PERFECT ROLE FOR YOU? NEW OPPORTUNITIES ARE OPENING UP DAILY:</strong>\n<br><br>\nANAPLAN.COM/CAREERS\n<br><br>\n#LI-TH1"}