{"job title": "Telecom Engineer", "company": "Bank OZK", "city state": "– Little Rock-AR", "rating": "3.4", "job description": "<div></div><div> </div> \n<div> <p>\n Position Description\n <br><br>\n \n </p><p><strong>Job Purpose and Scope:</strong></p><p>Under general supervision, this position is responsible for the primary support of the enterprise collaboration environment (voice and video) and carrier services for the bank.</p><p> </p><p><strong>Essential Job Functions: </strong></p><ol><li><p>Responsible for day-to-day high availability of the telecommunications infrastructure.</p></li><li><p>Responsible for Tier 4 technical support for telecom helpdesk activities.</p></li><li><p>Responsible for Move, Add, Change and Disconnect (MACD) activities involving telecommunications network equipment including:</p><ol><li><p>Data network routers and switches supporting VoIP and video collaboration services.</p></li><li><p>Cabling and patch panel distribution networks</p></li><li><p>Handsets</p></li></ol></li><li><p>Monitor, manage, and troubleshoot telephone network equipment and software daily.</p></li><li><p>Assist with inventory of all telecommunications equipment, branch layout topologies and wiring plans, spreadsheets and drawings. Includes performing telecommunications site surveys on newly acquired properties.</p></li><li><p>Assist VP Telecom Manager to make recommendations on voice and data topology changes and equipment purchases.</p></li><li><p>Assist with the ordering and tracking of new and replacement of all telephone equipment.</p></li><li><p>Repair malfunctioning equipment as needed.</p></li><li><p>Maintain good punctuality and attendance to work.</p><p> </p><p><strong>Marginal Job Duties:</strong></p></li></ol><ol><li><p>As necessary, provide back-up assistance for the IS help desk and computer network support functions.</p></li><li><p>Update software and hardware as needed.</p></li><li><p>Work with the VP Telecom Manager on special projects as needed</p></li><li><p>Maintain on-call status as needed and directed</p><p> </p><p><strong>Knowledge, Skills, &amp; Abilities:</strong></p></li></ol><ol><li><p>Ability to install, repair and maintain equipment and software for a Cisco Unified Communication Manager/Cisco Unity Connection telecommunications environment is required.</p></li><li><p>Ability to perform Cisco Unified CCX administration and reporting is highly preferred.</p></li><li><p>Ability to program and write scripts for a Calabrio workforce management platform.</p></li><li><p>Knowledge of VoIP signaling (H323, SCCP, MGCP, SIP, G.711, G.729).</p></li><li><p>Working knowledge of the North American telephone network topology including understanding T1, PRI, POTS, Central Office, PBX, OC3, cable distribution and fiber modes.</p></li><li><p>Knowledge of Cisco router VoIP components (FXO, FXS/DID, PVDM) and how to configure routers for voice services.</p></li><li><p>Knowledge of various software products such as Microsoft Windows, Microsoft Office.</p></li><li><p>Ability to work without close supervision</p></li><li><p>Excellent customer service skills</p></li><li><p>Ability to work well in a fast paced environment</p></li><li><p>Ability to work in a team environment</p></li><li><p>Ability to adapt well to change</p><p> </p><p> </p></li></ol><ol><li><p><strong>Equipment Used in Job Performance/Working Environment:</strong></p></li></ol><ol><li><p>Monitor, support and repair tools: basic telephone field service hand tools, test sets, and CUCM/CUXN/CU CCX administrative and reporting tools.</p></li><li><p>Network Equipment</p></li><li><p>Computer</p></li><li><p>Printer</p></li><li><p>Telephone</p></li><li><p>Copier</p></li><li><p>Facsimile Machine</p><p> </p><p><strong>Major Job Demands (Physical/Mental):</strong></p></li></ol><ol><li><p>Job requires standing, walking, bending and lifting equipment, such as routers, telephone handsets, gateways, cable and UPS systems.</p></li><li><p>Exposure to heavy dust from equipment and users’ workstations</p></li><li><p>Decision making</p></li><li><p>Ability to adapt to repeated interruptions</p></li></ol>\n \n <p></p>\n <p>\n Position Requirements\n <br><br>\n \n </p><p><strong>Basic Qualifications:</strong></p><ol><li><p>High school diploma or equivalent</p></li><li><p>3 to 5 years of working knowledge of Cisco Unified Communications Manager, Cisco Unity Connection, Cisco Unified CCX and Calabrio.</p></li><li><p>Cisco certification completed or in progress.</p></li><li><p>Available to work extended hours as necessary (nights &amp; weekends).</p></li><li><p>Available to work at least one evening per week and one weekend per month.</p></li><li><p>Valid driver’s license with an excellent driving record.</p></li></ol>\n \n <p></p>\n \n \n <p>\n Bank OZK is an equal opportunity employer and give consideration for employment to qualified applicants without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, disability status, protected veteran status, or any other characteristic protected by federal, state, and local law. Member FDIC. \nIf you have questions determining your veteran status, please visit the following Click Me \n </p>\n \n\n<div></div></div>"}