{"job title": "Lead Developer - Data Fabric Capital Markets", "company": "Broadridge", "city state": "– Newark, New Jersey", "rating": "3.4", "job description": "<div>We are currently seeking senior-level software engineer to join our growing team. You will be part of a team responsible for building out next generation Trade Management solution.\n<br>\nYou'll be working closely with the Delivery Manager, IT development and Architecture groups. Previously worked with business teams, defining business functional requirements, and translating them into technical specifications aligned with Delivery Manager Architecture framework. Balance technology and business issues as well as communicate appropriately with both groups.\n<br>\nYou'll act as liaison and participate in defining technology solutions to solve complex, multidisciplinary business problems with long-term implications. Recommend solutions to improve business decision-making with a focus on core architecture, technology strategies and standards.\n<br>\nYou will work closely with the development team, tracking assignments and provide mentorship in the development of standard methodologies, conducting code reviews and overseeing code deployment to QA, UAT &amp; Production. Job Posting Title: Programmer Analyst -- HT (Senior Data Fabric Developer)\n<br><br>\nJob Description\n<br>\nWe are currently seeking senior-level software engineer to join our growing team. You will be part of a team responsible for building out next generation Trade Management solution.\n<br>\nYou'll be working closely with the Delivery Manager, IT development and Architecture groups. Previously worked with business teams, defining business functional requirements, and translating them into technical specifications aligned with Delivery Manager Architecture framework. Balance technology and business issues as well as communicate appropriately with both groups.\n<br>\nYou'll act as liaison and participate in defining technology solutions to solve complex, multidisciplinary business problems with long-term implications. Recommend solutions to improve business decision-making with a focus on core architecture, technology strategies and standards.\n<br>\nYou will work closely with the development team, tracking assignments and provide mentorship in the development of standard methodologies, conducting code reviews and overseeing code deployment to QA, UAT &amp; Production.\n<br><br>\nResponsibilities include:\n\n<ul>\n<li>Participate in all stages of software development lifecycle including design, development and testing of the system.</li>\n<li>Work with the business analysts to understand the user requirements and come up with software solutions.</li>\n<li>Design algorithms to provide ability to mine thru millions of transaction documents</li>\n<li>Implement system to efficiently consume thousands of transaction documents per second</li>\n<li>co-ordinate with others in and outside the team for requirement and delivery</li>\n</ul>\nTo be successful, you'll need:\n\n<ul>\n<li>Strong project management and organizational abilities</li>\n<li>Facilitation and issue resolution</li>\n<li>Negotiation skills and ability to work in a complex, matrix environment</li>\n<li>Written, verbal communication and Presentation skills</li>\n<li>Excellent interpersonal skills and experience at dealing with clients/users at all levels, singly and in groups.</li>\n<li>Understanding the significance of fiscal constraints</li>\n<li>Excellent understanding of system development life cycle and the concepts and practices required to implement effective information systems.</li>\n<li>Work on multiple tasks at any one time while maintaining high quality standards</li>\n<li>Excellent troubleshooting and problem solving skills, specific to highly technical and customer focused service environment.</li>\n</ul>\nQualifications\n\n<ul>\n<li>At least 5+ years of MarkLogic development &amp; architecture experience (preferable using version 8 or 9) building 3-tier application</li>\n<li>Strong knowledge of XQuery, JavaScript, SPARQL, RDF Data, triples, Document based content search concepts are essential\n<br>\nXML technologies such as XSLT, XPath, etc.</li>\n<li>Extensive experience with developing scalable enterprise grade applications using Java, JavaScript, Scala or GO</li>\n<li>Ability to architect and implement MarkLogic from scratch (Data modeling as well)</li>\n<li>Working knowledge on Data Governance, best practices and design principles.</li>\n<li>Ontology and Meta data management</li>\n<li>Excellent analytical and communications skills</li>\n<li>Experience in Agile Development practices and code management best practices\n<br>\nDegree or diploma in Computer Science, Computer Engineering or related discipline\n<br><br>\n<strong>Even Better:</strong></li><strong>\n\n</strong>\n\n<li>Understanding of streaming and micro service concepts</li>\n<li>Experience with building applications for cloud</li>\n<li>Test harness using JMeter &amp; Selenium</li>\n<li>Artificial intelligence and machine learning</li>\n<li>Brokerage or financial industry experience will be considered an asset</li>\n</ul>\n\n</div>\n<br>Broadridge, a global fintech leader with over $9 billion in market capitalization, provides communications, technology, data and analytics solutions. We help drive business transformation for our clients with solutions for enriching client-engagement, navigating risk, optimizing efficiency and generating revenue growth.\n<br><br>\nBroadridge employs approximately 10,000 full-time associates globally with a significant presence in North America, Europe, and Asia. Please visit our website at www.broadridge.com to learn more.\n<br><br>\nBroadridge is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability status, or any other status protected by law. Click here to view the \"EEO is the Law\" poster.\n<br><br>\n\"Our Associates Matter.\n<br>\nEveryone Benefits from Diversity &amp; Inclusion.\n<br>\nDiverse &amp; Inclusive Teams Drive Growth.\""}