{"job title": "Manager, Software Engineering", "company": "Comcast", "city state": "– Philadelphia, PA", "rating": "3.5", "job description": "<p>Comcast's Technology &amp; Product organization works at the intersection of media and technology. Our innovative teams are continually developing and delivering products that transform the customer experience. From creating apps like TVGo to new features such as the Talking Guide on the X1 platform, we work every day to make a positive impact through innovation in the pursuit of building amazing products that are enjoyable, easy to use and accessible across all platforms. The team also develops and supports our evolving network architecture, including next-generation consumer systems and technologies, infrastructure and engineering, network integration and management tools, and technical standards.</p><div></div><p><b>Job Summary:</b><br>Responsible for leading a team of Software Development Engineers in the<br>planning and designing of software and web applications. Manages<br>projects from design to testing, including new programs, enhancements,<br>and modifications. Collaborates with Quality Assurance team to conduct<br>testing. Has overall responsibility for developing/administering<br>performance standards for organizational unit. Manages team which may<br>include exempt and non-exempt employees. Provides subject matter<br>guidance to employees as required. Develops processes and procedures to<br>drive department efficiencies and assists in the development and meeting<br> of departmental budget.<br><br>Employees at all levels are expect to:<br><br>- Understand our Operating Principles; make them the guidelines for how<br>you do your job<br>- Own the customer experience-think and act in ways that put our<br>customers first, give them seamless digital options at every touchpoint,<br>and make them promoters of our products and services<br>- Know your stuff-be enthusiastic learners, users and advocates of our<br>game-changing technology, products and services, especially our digital<br>tools and experiences<br>- Win as a team-make big things happen by working together and being<br>open to new ideas<br>- Be an active part of the Net Promoter System-a way of working that<br>brings more employee and customer feedback into the company-by joining<br>huddles, making call backs and helping us elevate opportunities to do<br>better for our customers<br>- Drive results and growth<br>- Respect and promote inclusion and diversity<br>- Do what's right for each other, our customers, investors and our<br>communities</p><p><b>Core Responsibilities:</b><br>- Oversees the planning and designing of software and web applications,<br>including new programs, enhancements, and modifications.<br>- Provides guidance to Software Engineering team and other departments<br>in identifying product and technical requirements. Serves as primary<br>point of contact and liaison between Software Engineering and other<br>teams.<br>- Directs implementation initiatives for new software products and<br>applications. Organizes software update process for existing<br>applications and coordinates the roll-out of software releases.<br>- Manages all the deliverables to ensure adherence to deadlines,<br>specifications, and budgets. Implements performance metrics and prepares<br>periodic reports. Monitors and tracks project progress and reports<br>findings to leadership team.<br>- Ensures all engineers keep current with technological developments<br>within the industry. Monitors and evaluates competitive applications and<br>products.<br>- Develops proposals, hardware/software changes and other capital<br>expenditure projects.<br>- Manages professional and non-exempt employees, conducting work<br>performance reviews and Ensures work performance is adhering to Company<br>standards. Mentors, trains and develops staff.<br>- Consistent exercise of independent judgment and discretion in matters<br>of significance.<br>- Regular, consistent and punctual attendance. Must be able to work<br>nights and weekends, variable schedule(s) as necessary.<br>- Other duties and responsibilities as assigned.</p><p><b>Job Specification:</b><br>- Bachelors Degree or Equivalent<br>- Engineering, Computer Science<br>-<br>- Generally requires 6-9 years related experience</p><p></p><p>Comcast is an EOE/Veterans/Disabled/LGBT employer</p>"}