{"job title": "Data Engineer", "company": "Consumer Reports", "city state": "– US-NY-Yonkers", "rating": "3.0", "job description": "<div><div>\n<div>We are seeking a highly skilled data engineer to join us in building a business intelligence data systems from ground up. The engineer will design and establish the analytics database; The engineer will analyze various internal and external data sources and develop the data pipelines and ETLs to feed the databases systematically using modern Data-Engineering technologies.</div>\n</div>\n</div>\n\n<br>Qualifications Include<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li>Experience as a Data Engineer or related specialty (e.g., Software Engineer, Business Intelligence Engineer, Data Scientist) with a track record of manipulating, processing, and extracting value from large and complex datasets.</li> <li>Strong knowledge of DBMS concepts with hands-on experience architecting and deploying Nosql Databases (MongoDB), and working knowledge of Relational Databases (Oracle)</li><li>Strong scripting experience using Python/Bash in Linux/UNIX environment to process and analyze large data sets</li><li>Knowledge and Hands-on experience with object-oriented Programming languages and frameworks - Java/JEE, Spring, in development for modern data engineering systems</li><li>Strong Knowledge and Hands-on experience in building ETL systems and data-pipelines.</li><li>Experience with technologies such as Apache Spark, Kafka, Flume, Sqoop is a big plus</li><li>Experience with data visualizations software (Tableau/Qlikview)</li><li>Experience with AWS technologies - EC2, S3, EMR, etc.</li><li>Experience working in projects involving building Data Warehouse, Data Lakes, Big data ecosystem (Hadoop, HDFS, Hive, and Hbase ) and Data Science is a plus</li><li>Experience working with modern tools in the Agile software development life cycle - Version Control Systems (Ex. git, github, Stash/BitBucket), Knowledge Management (Ex. Confluence, Google Docs), Development Workflow (Ex. Jira), Continuous Integration (Ex. Bamboo, Jenkins), Real Time Collaboration (Ex. Hipchat, Slack)</li></ul></div>\n</div>\n</div>\n\n<br>Key Responsibilities<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li>Design , Deploy, performance tune and monitor analytical databases</li><li>Design, Build, and Launch new data models , data pipelines and ETLs that ingest, map, aggregate, and broadcast data feeds to internal and external groups</li><li>Design, develop, and deploy various data visualizations</li><li>Analyze business requirements, provide development estimates and feedback, and determine implementation/execution approaches.</li><li>Work with other software engineers, database developers, infrastructure, operations and QA teams to design and implement quality software solutions</li><li>Support, troubleshoot, monitor and optimize existing data engineering systems</li><li>Help streamline software development by contributing to the implementation of a continuous integration process, automating manual processes, and eliminating defects</li><li>Performs other duties as assigned but not at a higher level</li></ul></div>\n</div>\n</div>\n<br>"}