{"job title": "Data Engineer", "company": "Drilling Info", "city state": "– Austin, TX", "rating": "3.3", "job description": "Drillinginfo- Who We Are\n<br><br>\nAt Drilling Info, our mission is to provide better, faster decision-making support to the oil and gas industry through our data intelligence and analytics products. We are building an agile development culture that delivers great products to a wide variety of customers. We truly believe that diversity of experience, perspectives, and background will lead to a better workplace for our employees and better products for our clients. We need an experienced engineer with a passion for software development, someone to be hands-on in designing, implementing, and delivering features for our flagship product.\n<br><br>\nJob Overview\n\n\n<ul>\n<li>As a Data Engineer, a person will have the opportunity to shape the future of Drillinginfo by building and maintaining business-critical customer-facing applications and helping deliver the next generation of Oil and Gas information retrieval and analytics.</li>\n<li>Responsible for creating and maintaining the pipelines to assemble different datasets, all this following an architecture defined by the company.</li>\n<li>Write maintainable code, and work in a professional software engineering and teamwork environment (source control, shortened release cycles, continuous integration/deployment, documentation, agile development).</li>\n<li>Possess excellent analytical and critical thinking skills, should show initiative and a positive attitude.</li>\n</ul>\n\nCompetitive Candidate Profile\n\n\n<ul>\n<li>Bachelor's Degree in Computer Science or similar</li>\n<li>8+ years of experience building, maintaining and delivering data-based products</li>\n<li>Expert Level with Programing Languages: Python</li>\n<li>Strong familiarity with Programing Languages: JAVA, Go</li>\n<li>Strong familiarity with database languages, SQL Server, SSIS</li>\n<li>Strong familiarity with version control systems: Git, SVN</li>\n<li>Strong familiarity with agile development</li>\n<li>Experience with developing object-oriented, enterprise-sized systems</li>\n<li>Desirable experience with: Airflow, AWS, Kafka</li>\n<li>Desirable experience with server integration services</li>\n<li>Desirable experience with every layer of an Enterprise system (from Database to UX).</li>\n</ul>"}