{"job title": "Senior Quality Engineer", "company": "Endurance International Group", "city state": "– Waltham, MA", "rating": "3.0", "job description": "Constant Contact, Inc. helps small businesses and nonprofits connect with their customers, clients, and members. Constant Contact® champions the needs of small organizations and provides an easy, affordable way to build successful, lasting customer relationships. Our customers get real results through email newsletters, surveys, events, Facebook promotions, online listings, and more.\n<br><br>\nWe're looking to expand our team of developers located in our Waltham office.\n<br><br>\nAs a part of our agile team, you'll be working with innovative tools, processes and people to engineer web applications that are distributed and consumed on a massive scale.\n<br><br>\n<strong>About Us</strong>\n<br><br>\nWe are a fun, collaborative, agile work team solving interesting engineering challenges involving scale and big data. Our organization puts an emphasis on learning and career growth with a commitment to a work/life balance and sustainable development. We work with state of the art technologies, methodologies, and processes.\n<br><br>\n<strong>About You</strong>\n<br><br>\nYou are open to change and eager to work with tools and technologies that may be outside your comfort zone. You enjoy working in an open and collaborative environment. You express your opinions, and have the facts to back them up, but are willing to compromise when necessary. You like to have fun while youre working, but understand when its time to get serious. You are a dedicated software craftsperson who cares deeply about best practices and what it takes to write and maintain great code. You are a strong advocate for quality and are passionate about blurring the lines between development and QE.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Drive a quality mindset across our cross-functional, full-stack scrum teams</li>\n<li>Ensure proper automation coverage for all new functionality</li>\n<li>Ensure automation suite is stable, maintainable and performant</li>\n<li>Proactively identify areas of tech debt and work with the team to address it</li>\n<li>Promote the collaborative creation of test cases by involving developers and product owners in the process</li>\n<li>Help blur the line between development and QE by encouraging developers to write thorough automation</li>\n<li>Contribute to feature development on either the front-end or the back-end</li>\n<li>Stay on top of industry trends and ensure the team appropriately utilizes the latest technologies and best practices</li>\n</ul>\n<strong>Technical Skills</strong>\n\n<ul>\n<li>6+ years in test automation and/or development roles</li>\n<li>Experience with Protractor, Rspec and/or Selenium</li>\n<li>Experience with unit testing and test-driven development</li>\n<li>Experience in Javascript, Java and/or Ruby/Rails</li>\n<li>\nExperience with relational (MySQL, DB2 or Oracle) and NoSQL databases (Redis, Cassandra or DynamoDB)</li>\n<li>Experience with AWS</li>\n<li>Experience working with Git in a CI/CD environment</li>\n</ul>\n<strong>Leadership Skills</strong>\n\n<ul>\n<li>Ability to promote a quality mindset across a cross-functional team</li>\n<li>Ability to lead as part of a highly collaborative Agile team</li>\n<li>Strong collaboration and influence skills</li>\n<li>Strong focus on team effectiveness, results and customer success</li>\n<li>Self-motivated individual who proactively identifies team bottlenecks and works with the team to resolve them</li>\n<li>Passionate about technology and staying up to date on industry trends</li>\n<li>Strong commitment to continuous improvement for self and team</li>\n</ul>"}