{"job title": "Software Engineer - Android", "company": "Fitbit", "city state": "– San Francisco, CA", "rating": "3.3", "job description": "At Fitbit, our mission is to help people lead healthier, more active lives by empowering them with data, inspiration and guidance to reach their goals.\n<br><br>\nWe started our journey in 2007as a team of two with one big idea. Since then, we've grown to over 1,500 employees, sold over 60mm devices, and built a health and fitness community across the globe. In fact, the Fitbit Community has taken enough steps to walk from the Sun to Pluto! Offering award-winning products, a top-rated mobile app and an easy-to-use online dashboard, Fitbit provides personalized experiences that help our users reach their goals. With a reenergized focus on innovative devices, interactive experiences, and enterprise health we are transforming the way consumers and businesses see health &amp; fitness.\n<br><br>\nFrom your first steps as a Fitbitter, you will be at the forefront of developing new products. Our culture combines the spirit of startup with the perks of being public. We offer a competitive benefits package and amazing perks like unlimited snacks, Friday happy hours, onsite workout classes, and a strong focus on a healthy work-life balance. As part of our team, you'll have the opportunity to grow your career, contribute your ideas to life-changing products and services, andabove allhave fun doing it.\n<br><br>\nFitbit's HQ campus is located in the heart of San Francisco with office locations in Boston, San Diego and around the world. Think you've found your fit?<br><br><strong>What You'll Work On:</strong>\n\n\n<ul>\n<li> Creating engaging yet computationally efficient interactive data visualizations that are optimized for mobile devices with touch screens. This is an area of user interfaces for which there is no established solution; we aim to set the standard.</li> \n\n<li> Overcoming the hurdles of distributed systems to build native mobile clients that are tolerant of transient connectivity. We aim for our mobile clients and sensor devices to function together as normally as possible even when there is no connection to the internet.</li> \n\n<li> Exploiting low power communication technologies to make the internet of things a reality. We have been on leading edge of consumer deployment for both wearable sensors and Bluetooth Low Energy.</li> \n\n<li> Crafting beautiful mobile user experiences that allow users to intuitively accomplish any task. Our mobile clients are a vital part of the user interface to the Fitbit platform.</li>\n</ul>\nCheck out our current mobile apps for iOS and Android at:\n\n<ul>\n<li> https://itunes.apple.com/us/app/fitbit/id462638897</li>\n<li> https://play.google.com/store/apps/details?id=com.fitbit.FitbitMobile</li>\n</ul>\n<strong>Required Skills</strong>\n\n<ul>\n<li> BS in Computer Science or equivalent work experience</li>\n<li> Ability to evaluate solutions both in terms of algorithm and data structure fundamentals as well as object oriented design principles</li>\n<li> Experience creating reusable components with elegant, intuitive API interfaces</li>\n<li> Expertise in Java and Android. C/C++ a plus</li>\n</ul>\n<strong>Nice-to-have skills</strong>\n\n<ul>\n<li> Experience using a modern version control system to accomplish release and configuration management</li>\n<li> A drive to keep performance high using profile guided optimization</li>\n<li> A feel for visual and interaction design</li>\n<li> A knack for appropriate abstraction</li>\n<li> A love of refactoring</li>\n<li> Expertise in one of more of our core technology areas:</li></ul>\n\n\n<ul>\n<li>Android UI / Graphics / Animation / OpenGL ES</li>\n<li>SQLite / REST-like network APIs</li>\n<li>Bluetooth / Bluetooth Low Energy</li>\n</ul>\n<em>Fitbit is proud to be an equal opportunity employer. We recruit, hire, train, promote, pay, and administer all personnel actions without regard to race, color, ancestry, national origin, citizenship, religion, age, sex (including pregnancy, childbirth, and medical conditions related to pregnancy, childbirth, or breastfeeding), sex stereotyping (including assumptions about a person's appearance or behavior, gender roles, gender expression, or gender identity), sexual orientation, gender, gender identity, gender expression, marital status, medical condition, mental or physical disability, military or veteran status, genetic information or other statuses protected by law. We interpret these protected statuses broadly to include both the actual status and any perceptions and assumptions made regarding these statuses.</em>\n<br><br>\n<em>San Francisco applicants: Pursuant to the San Francisco Fair Chance Ordinance Fitbit will consider for employment qualified applicants with arrest and conviction records.</em>"}