{"job title": "Process Engineering Manager", "company": "Flex", "city state": "– Memphis, Tennessee, United States", "rating": "3.6", "job description": "<strong>Job Description</strong><br><br>The <strong><u><strong>Process Engineering Manager</strong></u></strong> will be based in <strong><u><strong>Memphis, TN</strong> </u></strong>and will be responsible for leading a team of industrial engineers working on increasing productivity through the management of workers, methods of business organization, and technology to solve organizational, production, and related problems efficiently.\n<br><br>\n<strong><strong>We are looking for</strong> someone who demonstrates:</strong>\n<ul>\n<li>Intense collaboration</li><li>Passionate customer focus</li><li>Thoughtful, fast, disciplined execution</li><li>Tenacious commitment to continuous improvement</li><li>Relentless drive to win</li>\n</ul>\n<strong><strong>Here is a glimpse of what you’ll do:</strong></strong>\n<ul>\n<li>Manages a team of engineers and technicians to establish work measurement programs and analyzes work samples to develop standards for labor utilization.</li><li>Analyzes work force utilization, facility layout, and operational data, such as production costs, process flow charts, and production schedules, to determine efficient utilization of workers and equipment.</li><li>Recommends methods for improving worker efficiency and reducing waste of materials and utilities, such as restructuring job duties, reorganizing work flow, relocation work stations and equipment, and purchase of equipment.</li><li>May develop management systems for cost analysis, financial planning, wage and salary administration, and job evaluation</li><li>Develops management control systems to aid in financial planning and cost analysis, and design production planning and control systems to coordinate activities and ensure product quality.</li><li>Designs or improve systems for the physical distribution of goods and services, as well as determining the most efficient plant locations.</li><li>Organizes details into a broad view of the total operations and organization of Flex.</li><li>Partners with other engineering team members to design manufacturable new products</li><li>Leads initiatives to increase throughput, reduce cost and improve performance in constrained areas.</li><li>Implements appropriate HR strategies and actions to recruit and retain a qualified and motivated workforce</li>\n</ul>\n<strong>Here</strong> <strong><strong>is some of what you’ll need (required):</strong></strong>\n<ul>\n<li>Bachelor’s Degree in Industrial Engineering or Equivalent</li><li>Experience managing or leading an Engineering team</li><li>Experience in process or manufacturing engineering with knowledge of what it takes to process or manufacture a product</li><li>Background in Industrial Engineering</li><li>Experience with Autocad or equivalent layout</li><li>Ability to create workstations, instructions and material flow</li><li>Experience in warehousing</li>\n</ul>\n<strong><strong>Here are a few of our preferred experiences:</strong></strong>\n<ul>\n<li>Experience with Lean practices</li><li>Industrial engineering tools (capacity modeling, calculations, etc)</li><li>Experience with Reverse Logistics experience, Direct fulfillment, Pick Back and Ship</li>\n</ul>\n<strong><strong>Here are a few examples of what you’ll get for the great work you provide:</strong></strong>\n<ul>\n<li>Full range of medical benefits, dental, vision</li><li>Life Insurance</li><li>Matching 401K</li><li>PTO</li><li>Tuition Reimbursement</li><li>Employee discounts at local retailers</li></ul>\n<br>\n<strong>Job Category</strong>OperationsFlex does not accept unsolicited resumes from headhunters, recruitment agencies or fee based recruitment services. Flex is an Equal Opportunity Employer and employment selection decisions are based on merit, qualifications, and abilities. Flex does not discriminate in employment opportunities or practices on the basis of: age, race, religion, color, sex, national origin, marital status, sexual orientation, gender identity, veteran status, disability, pregnancy status or any other status protected by law. Flex provides reasonable accommodation so that qualified applicants with a disability may participate in the selection process. Please advise us of any accommodations you request in order to express interest in a position by e-mailing: accesibility@flex.com. Please state your request for assistance in your message. Only reasonable accommodation requests related to applying for a specific position within Flex will be reviewed at the e-mail address. Flex will contact you if it is determined that your background is a match to the required skills required for this position. Thank you for considering a career with Flex.The information we collect:<strong>We may collect personal information that you choose to submit to us through the Website or otherwise provide to us. This may include your contact details; information provided in online questionnaires, feedback forms, or applications for employment; and information you provide such as CV/Resume. We will use your information for legitimate business purposes such as responding to comments or queries or answering questions; progressing applications for employment; allowing you to choose to share web content with others or; where you represent one of our customers or suppliers, administering the business relationship with that customer or supplier.</strong>"}