{"job title": "Data Engineer", "company": "GE Digital", "city state": "– ", "rating": "2.9", "job description": "<strong>Role Summary:</strong> \n<br>\nThe Data Engineering team helps solve our customers' toughest challenges; making flights safer, power cheaper, and oil &amp; gas production safer for people and the environment by leveraging data and analytics. The Data Engineer will work with the team to create state-of-the-art data and analytics driven solutions, working across GE to drive business analytics to a new level of predictive analytics while leveraging big data tools and technologies.\n<br><br>\n<strong>Essential Responsibilities:</strong> \n<br>\nThe Data Engineer, will be part of a data engineering or cross-disciplinary team on commercially-facing development projects, typically involving large, complex data sets. These teams typically include statisticians, computer scientists, software developers, engineers, product managers, and end users, working in concert with partners in GE business units. Potential application areas include remote monitoring and diagnostics across infrastructure and industrial sectors, financial portfolio risk assessment, and operations optimization. Performs a variety of data loads &amp; data transformations. Working knowledge of methods for parsing, formatting, &amp; transforming data into units consistent with analytical needs. Demonstrates proficiency in implementation of logical/physical data models that support MDM best practices. Performs integration of multiple data source-formats into master data load.\n<br><br>\n<strong>Qualifications/Requirements:</strong> \n\n\n<ul>\n<li>Bachelor's Degree in Computer Science, Information Technology or equivalent (STEM) with minimum 5 years of experience as data engineer.</li>\n<li>A minimum of 3 years of Database/Data Warehouse, SQL (Oracle, Terradata, Greenplum, Hive etc.) experience is required. 3+ Years of experience in Inforatica.</li>\n<li>A minimum of 1 year of experience using Hadoop ecosystem.</li>\n<li>A minimum of 1 year of experience using Spotfire or OBIEE reporting.</li>\n</ul>\n\n<strong>Desired Characteristics:</strong> \n\n\n<ul>\n<li>Exposure to Scripting (Pig, Python, Perl, etc.) experience.</li>\n<li>Translates analytics problems into data requirements.</li>\n<li>Understands logical and physical data models, big data storage architecture, data modeling methodologies, metadata management, master data management, data lineage &amp; data profiling.</li>\n<li>Understands the technology landscape, up to date on current technology trends and new technology, brings new ideas to the team.</li>\n<li>Demonstrated awareness of how to function in a team setting.</li>\n<li>Distills information down to key points.</li>\n<li>Expresses the information clearly and concisely. Projects knowledge of relevant data.</li>\n<li>Demonstrated awareness of how to leverage curiosity and creativity to drive business impact</li>\n<li>Asks follow-up questions when presented with new data/projects. Sees the broader implications of an idea.</li>\n<li>Presents new ideas and concepts. Makes connections among previously unrelated ideas.</li>\n<li>Deep passion for learning.</li>\n</ul>\n\n<strong>#DTR</strong>\n<br><br>\n<strong>About Us:</strong> \n<br>\nGE is the world's Digital Industrial Company, transforming industry with software-defined machines and solutions that are connected, responsive and predictive. Through our people, leadership development, services, technology and scale, GE delivers better outcomes for global customers by speaking the language of industry.\n<br><br>\n<strong>Locations:</strong>  India; Bengaluru"}