{"job title": "Senior Software Engineer, Web Applications", "company": "Genesys", "city state": "– Madison", "rating": "3.8", "job description": "<div><div><div><div><div><strong>Job Summary:</strong>\n<br><br>\nThis individual will be part of the Applications Group within Genesys’s Development Department and work Madison, WI. Design and implement web user interfaces that are functional, intuitive, and elegant. These interfaces will serve call center and corporate users around the world and will serve as a model for a new generation of web-based interfaces for Genesys and our growing customer base.\n<br><br>\n<strong>Major Responsibilities/Activities:</strong>\n<ul>\n<li>Work with Product Managers and UX Designers/Architects to establish the requirements for your user interface, often working from wireframes, mock-ups, or prototypes.</li><li>Analyze UI requirements for completeness, unexpected impacts, and potential user-impacting concerns.</li><li>Drive UI requirements through to an implementation-ready specification, complete with accurate sizing estimates and task breakdowns.</li><li>Work closely with QA / Test team members to help them understand the implications of your UI implementation, how best they can test it, and what areas may require specific focus.</li><li>Build UIs with anticipation of automated testing leveraging tools like Selenium, etc.</li><li>Work closely with UI/UX and web architecture teams to enable performant, near-real-time updates to the browser with responsive rendering to the end user.</li><li>Own given features/pages beginning to end, from mockups &amp; design documents/reviews to acceptance testing and deployment Experience working with Knockout, Angular, Backbone, Ember, or other client-side MV* frameworks.</li><li>Experience contributing to an open source project or experience with and a willingness to commit code via pull requests subject to code review by the team.</li> <li>Strong JavaScript Application development skills using HTML/CSS.</li><li>Strong understanding of web client interactions with REST/Ajax services.</li><li>Be able to write testable code in JavaScript.</li><li>Be able and willing to contribute to UI/UX design conversations.</li><li>Be motivated to learn new technologies and techniques.</li> \n</ul>\n<strong>Minimum Requirements:</strong>\n<ul>\n<li>Bachelor’s degree in Computer Science or related discipline.</li><li>At least 2 years experience developing software.</li><li>Intimate understanding of HTML, CSS and JavaScript, with recent experience with ES6, HTML5 and CSS3.</li><li>Experience in one or more JavaScript frameworks.</li><li>Experience with Git.</li><li>Familiar with push-based notification architectures.</li><li>Experience in Linux operating environments desired.</li><li>Experience in cloud-environments (AWS, OpenStack, etc., with an initial preference for AWS) preferred.</li><li>Good verbal and written communication skills.</li>\n</ul>\n<strong>Preferred Skills:</strong>\n<ul>\n<li>Experience with server-side Java technologies, specifically Spring MVC, would be helpful.</li><li>Experience with build pipelines and other devops concepts.</li><li>Familiarity with back-end technologies, including SOA, Restful interfaces, tiered application development, Java app servers (Tomcat, JBoss, etc.), SQL, NoSQL (Hadoop, Redis, Couchbase, etc.) is helpful.Node.js.</li><li>Unit Testing and Integration Testing.</li><li>Contributions to Open-source software projects.</li>\n</ul>\nAbout Us:\n<br><br>\nGenesys® powers more than 25 billion of the world’s best customer experiences each year. We put the customer at the center of everything we do and passionately believe that great customer engagement drives great business outcomes. More than 10,000 companies in more than 100 countries trust the industry’s #1 customer experience platform to orchestrate omnichannel customer journeys that eliminate silos and build lasting relationships. With a strong track record of innovation and a never-ending desire to be first, Genesys is the only company recognized by top industry analysts as a leader in both cloud and on-premise customer engagement solutions. Connect with Genesys via www.genesys.com, Twitter, Facebook, YouTube, LinkedIn, and the Genesys blog.\n<br><br>\n<strong>Genesys is an equal opportunity employer committed to diversity in the workplace. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, disability, veteran status, and other protected characteristics.</strong> #LI-BJ1</div>\n</div>\n </div>\n </div>\n</div>\n<br>"}