{"job title": "Sr. Network Engineer", "company": "Green Dot", "city state": "– Pasadena, CA", "rating": "2.6", "job description": "<div><div><strong>\n<br>\nSr. Network Engineer</strong><br>\n\n<div>\n<div>\nLocation\n<br><br>\n<strong>\n<br>\nPasadena, CA</strong>\n</div><br>\n\n<div>\nDepartment\n<br><br>\n<strong>\n<br>\nTechnology Operations</strong>\n</div><br>\n\n<div>\nRequisition ID\n<br><br>\n<strong>2740</strong>\n</div>\n</div>\n</div>\n\n<br>Apply Now</div><br>\n\n<div>Green Dot Corporation, along with its wholly owned subsidiary bank, Green Dot Bank, is a pro-consumer financial technology innovator with a mission to reinvent personal banking for the masses. Green Dot invented the prepaid debit card industry and is the largest provider of reloadable prepaid debit cards and cash reload processing services in the United States. Green Dot is also a leader in mobile technology and mobile banking with its award-winning GoBank mobile checking account. Through its wholly owned subsidiary, TPG, Green Dot is additionally the largest processor of tax refund disbursements in the U.S. Green Dot's products and services are available to consumers through a large-scale \"branchless bank\" distribution network of more than 100,000 U.S. retail locations and neighborhood financial service center locations, online, in the leading app stores and through 25,000 tax preparation offices and leading online tax preparation providers. Green Dot Corporation is headquartered in Pasadena, Calif., with additional facilities throughout the United States and in Shanghai, China.\n<br><br>\n<strong>Sr. Network Engineer</strong>\n<br><br>\n<strong><u>Summary</u></strong>\n<br><br>\nThe Sr. Network Engineer is responsible for developing and enhancing infrastructure and applications to support the growth of the business and to promote a highly available and stable computing environment. The Sr. Network Engineer will contribute to the overall engineering, design, build and high level support of all existing and new network infrastructure. Works closely with our internal clients to develop consensus and find solutions to problems facing their business constituents.\n<br><br>\n<strong><u>Responsibilities</u></strong>\n\n<ul>\n<li>Monitor network environment for anomalies and errors, reporting and escalation of issues.</li>\n\n<li>Provide the required daily support, maintenance, and management of the platforms.</li> \n\n<li>Provide Level II/III network support and repair, as well as escalation to the Management Team.</li> \n\n<li>Provide 24x7 On-call Escalation Support (rotation-based / full week support)</li>\n\n<li>Author internal documentation, such as environment diagrams, installation/configuration and release notes</li>\n\n<li>Troubleshoot and debug problems found in the production and non-production environments.</li>\n\n<li>Assist in managing the corporate systems in a racked data center environment</li>\n\n<li>Monitor and troubleshoot any problems within the network.</li> \n\n<li>Create network plans, document the existing network, and communicate with business partners to establish connectivity.</li> \n\n<li>Negotiate with technical solution providers and vendors to provide recommendations on equipment purchases and upgrades to the existing network infrastructure.</li> \n\n<li>Help ensure that the organization’s network infrastructure complies with the Payment Card Industry Data Security Standard (PCI DSS).</li> \n\n<li>Strong proficiency in configuring and troubleshooting routing protocols (OSPF, EIGRP, BGP…)</li>\n\n<li>Strong proficiency in configuring and troubleshooting Layer 2 networking (VLANS, Spanning-Tree,…)</li>\n\n<li>Strong understanding of network concepts related to High Availability, Business Continuity, and Disaster Recovery related to Open Systems architecture</li>\n\n<li>Perform other duties as needed.</li>\n</ul>\n<strong><u>Requirements</u></strong>\n\n<ul>\n<li>CCNP or CCDP preferred</li>\n\n<li>7+ years’ experience with Cisco Routers/ Switches</li>\n\n<li>Bachelor’s degree in computer science or related field, or equivalent work experience</li>\n\n<li>Applicable network engineering certifications preferred</li>\n\n<li>IPSec VPN, PIX/ASA Firewalls, SSL VPN, PKI encryption, and AAA.</li>\n\n<li>HSRP, VoIP, QoS, VSS, VMPS, PBR, PVLAN, and other IOS features.</li>\n\n<li>NTP, TCP/IP, and Windows Systems.</li>\n\n<li>Experience with Cisco or Avaya VoIP IP Telephony / VoIP</li>\n\n<li>IDS / IPS</li>\n\n<li>Solarwinds Orion or other SNMP-based monitoring</li>\n\n<li>In-depth knowledge of Cisco’s product lines.</li>\n\n<li>Understanding of network concepts related to High Availability, Business Continuity, and Disaster Recovery related to Open Systems architecture</li>\n</ul>\n\n</div>\n<br>"}