{"job title": "Software Engineer", "company": "Infor Global Solutions, Inc.", "city state": "– US-TX-Dallas", "rating": "3.5", "job description": "<div>.NET Developer </div><div>Dallas TX</div><div><br></div><div><br></div><div>For this role, you will develop .NET web applications using C#, SQL, HTML5, JavaScript, SOAP, WCF Services, IIS, CSS, JQuery, Angular JS, and Classic ASP </div><div>•Enhance the stability of the LMS application and support development of future releases of the system </div><div>•Conduct maintenance of the current LMS version and requested enhancements from the product roadmap </div><div>•Drive improvements to the automated build and deployment processes for the LMS product </div><div>•Understand and leverage Agile methodology for development processes </div><div>•Analyze defects and enhancement requests and evaluate feasibility </div><div>•Provide guidance to other developers on methods to resolve issues and implement features </div><div>•Provide effort estimation and technical solutions </div><div>•Perform code review and report on code quality </div><div>•Propose best practices and technical architecture for system enhancements </div><div>•Work closely with QA team lead to provide expert guidance and ensure specific tests are run </div><div>•Work closely with Development Management, Business Analysts and team members to understand the business requirements that drive the analysis and design of quality technical solutions </div><div>•Provide development level support to the LMS support team for complex client reported technical issues</div><div><br></div><div>Experience Required: </div><div>I•Candidate must possess (3) years of related experience involving each of the following:</div><div>•Strong experience in developing enterprise level web application using a ranged of Microsoft based and related technologies including, but limited to, Classic ASP, ASP.Net, MVC, JavaScript, jQuery, IIS</div><div>•Demonstrated experience in writing clean and maintainable code following best practices in Web and Cloud development.</div><div>•Experience with development environment like Visual Studio 2015 or higher and SQL Server Management Studio.</div><div>•Database development with MS SQL server and related technologies like SSRS, SSIS including writing complex T-SQL queries and performing analysis of the existing SQL code and environment with different profiling tools</div><div>•Strong familiarity with Service Oriented Architecture, Cloud Native principles, Application lifecycle management with Agile and Iterative methodology</div><div>•Experience with cloud-based platforms including AWS </div><div>•Test driven development and its usage in the development process</div><div>•Familiarity with SCORM and AICC content standards and other eLearning technologies is a plus.</div><div>•Source control system repository management with systems including GIT</div><div>•Continuous integration and build automation techniques</div><div>•Defect management systems such as Atlassian JIRA</div><div><br></div><div><br></div><div>The Company does not discriminate in employment opportunities or practices on the basis of race, color, creed, religion, sex, gender / transgender identity or expression, sexual orientation, sexual stereotype, national origin, genetics, disability, marital status, age, veteran status, protected veterans, military service obligation, citizenship status, individuals with disabilities, or any other characteristic protected by law applicable to the state or municipality in which you work.</div><div><br></div><div>In compliance with the ADA Amendments Act (ADAAA), should you have a disability and would like to request an accommodation to apply for a currently open position with Infor, please call (678) 319-8000 or email us at ADAAA@infor.com.</div>"}