{"job title": "Senior Process Engineer III (1 of 2)", "company": "Johnson &amp; Johnson", "city state": "– Monument, Colorado", "rating": "4.0", "job description": "DePuy Synthes is currently recruiting for a Senior Process Engineer III to be located in Monument, CO.\n<br><br>\nDePuy Synthes Companies of Johnson &amp; Johnson is the largest, most innovative and comprehensive orthopedic and neurological business in the world. DePuy Synthes Companies offer an unparalleled breadth and depth of products, services and programs in the areas of joint reconstruction, trauma, spine, sports medicine, neurological, craniomaxillofacial, power tools and biomaterials. Building on the legacy and strengths of two great companies, more agile and better equipped to meet the needs of todays evolving health care environment. With a focus on activating insights to develop innovative, comprehensive solutions, we are inspired to advance patient care in greater ways than either company could accomplish on its own.\n<br><br>\nAs a Senior Process Engineer III at the DePuy Synthes Monument, CO manufacturing facility, you will play a key role in creating a safe, compliant, and reliable production environment by defining transformation activities to optimize the manufacturing processes at a facility that delivers critical life restoring orthopedic implants to the world.\n<br><br>\nThis position will be responsible for creating and maintaining data specific to manufacturing screws and nails which includes raw materials, machining, finishing and packaging. Further responsibilities will include the implementation of manufacturing tools rooted in Lean Manufacturing and Quality by Design that make cGMP an integral part of the daily routine. The ideal candidate will have at least 5 years of prior industrial/manufacturing experience and will demonstrate prior experience documenting current state processes as well as developing future state processes to achieve world class performance in a cGMP regulated production environment.<br>\n<div><strong>Job Duties:</strong></div>\n\n<ul>\n<li>Owns and maintains Value Stream Maps and Capacity Models for manufacturing cells. Looks for opportunities to improve operations through Kaizen Events and manages the execution.</li><li>Works with Project Engineering Supervisors to build business cases when Capacity is above 85% Utilization</li><li>Analyzes multiple data sources such as Nonconformances, Scrap, Operational Equipment Effectiveness, Routings, Bills of Materials and CAPAs to identify and implement continuous improvement.</li><li>Owns CAPA's that are systemic within department. Reviews CAPA data and uses data for Process Monitoring Report.</li><li>Ensures cost components, such as Run Labor Rates, Material Utilization are accurate.</li> <li>Builds Head Count Model for operations and updates based on demand changes.</li><li>Modifies and Adjusts Tool Usage based on Demand. Tracks tooling costs and tool life and impact. Responsible for reorder point/reorder qty in tool crib.</li><li>Owner of PFMEA's in value stream. Responsible for gathering information for the creation and updating of PFMEA's.</li>\n</ul>\nResponsible for manufacturing floor documentation standards and ensuring documentation is accurate.\n<ul>\n<li>Identifies aged assets up for decommissioning and ensures additional equipment or projects have been identified.</li><li>Must be willing to support 24x7 manufacturing and perform other related duties as required.</li><li>Must be willing to support global projects, including up to 10% travel.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n<ul>\n<li>A minimum of\n<br>\nBachelor of Science Degree in Industrial Engineering, Manufacturing\n<br>\nEngineering, Mechanical Engineering, or a related degree is required.</li> <li>Master of\n<br>\nScience Degree in Manufacturing Engineering, Mechanical Engineering, Industrial\n<br>\nEngineering, or a related degree, preferred.</li><li> A minimum of 5 years of\n<br>\nexperience in industrial/manufacturing and/or engineering is required.</li> <li>Previous experience working in a regulated industry, such as\n<br>\nMedical Device is preferred.</li><li>Demonstrated experience in Six Sigma or Lean Sigma is required.</li><li>Demonstrated experience in executing Kaizen\n<br>\nevents.</li><li>Demonstrated experience developing and\n<br>\nimplementing robust manufacturing systems and processes is required.</li><li>Demonstrates leadership qualities including confidence,\n<br>\ntransparency, integrity, innovation, passion, patience and tenacity is required.</li><li>Demonstrates strong written, verbal and presentation skills is\n<br>\nrequired.</li><li>Demonstrates strong computer skills, such as the use of Microsoft\n<br>\nOffice, Minitab, and databases is required.</li><li>Demonstrates strong organizational and project management skills\n<br>\nand are results oriented is preferred.</li><li>Demonstrates positive interpersonal skills and professional\n<br>\ninteractions with coworkers.</li><li>Must be willing to support global projects\n<br>\nincluding some travel.</li> <li>Must be\n<br>\nwilling to support all shifts.</li> <li>May be\n<br>\nresponsible for the supervision of Engineering Technicians or Interns.</li> <li>Participates\n<br>\nin the hiring process for Engineering Technicians and Interns.</li> <li>Participates\n<br>\nin and understands compliance related activities pertaining to the job\n<br>\nassignment including compliance with the Quality System Regulation (QSR),\n<br>\nStandard Operating Procedures (SOP), and applicable Work Instructions.</li> <li>Follows all\n<br>\nlaws and policies as they apply to one's job and maintains the highest levels\n<br>\nof professionalism, ethics and compliance at all times.</li><li>Supports and\n<br>\noperates in a proactive safety environment</li> <li>Works in\n<br>\nconditions that may be hot, cold, wet and/or noisy along with exposure to\n<br>\nfumes, oil, coolants and other manufacturing related chemicals.</li> <li>This\n<br>\nposition is required up to 10% of travel.</li> <li>This\n<br>\nposition is located in Monument, CO.</li>\n</ul>\nJohnson\n<br>\n&amp; Johnson is an Affirmative Action and Equal Opportunity Employer. All\n<br>\nqualified applicants will receive consideration for employment without regard\n<br>\nto race, color, religion, sex, sexual orientation, gender identity, age,\n<br>\nnational origin, or protected veteran status and will not be discriminated\n<br>\nagainst on the basis of disability.<br><br><strong>Primary Location</strong>\n<br>\nUnited States-Colorado-Monument\n<br>\n<strong>Organization</strong>\n<br>\nDePuySynthes Products Inc (6149)\n<br>\n<strong>Job Function</strong>\n<br>\nProcess Engineering\n<br>\n<strong>Requisition ID</strong>\n<br>\n<strong>1005180829</strong>\n<br>"}