{"job title": "Data Engineer", "company": "Lab126", "city state": "– US, CA, Sunnyvale", "rating": "3.3", "job description": "<div><div>DESCRIPTION<br><br>Amazon Lab126 is an inventive research and development company that designs and engineers high-profile consumer electronics. Lab126 began in 2004 as a subsidiary of Amazon.com, Inc., originally creating the best-selling Kindle family of products. Since then, we have produced groundbreaking devices like Fire tablets, Fire TV, Fire phone, and Amazon Echo. What will you help us create?\n<br><br>\nWork hard. Have fun. Make history.\n<br><br>\n<strong>The Role:</strong>\n<br>\nWe are seeking a talented, self-directed Data Engineer to design, develop, implement, test, document, and operate large-scale, high-volume, high-performance data structures for our internal customers. Implement data structures using best practices in data modeling and ETL/ELT processes. Gather business and functional requirements and translate these requirements into robust, scalable, operable solutions that work well within the overall data architecture. Analyze source data systems and drive best practices in source teams. Participate in the full development life cycle, end-to-end, from design, implementation and testing, to documentation, delivery, support, and maintenance. Produce comprehensive, usable dataset documentation and metadata. Evaluate and make decisions around dataset implementations designed and proposed by peer data engineers. Evaluate and make decisions around the use of new or existing software products and tools. Mentor junior data engineers.\n<br><br>\nThe ideal candidate relishes working with large volumes of data, enjoys the challenge of highly complex technical contexts, and, above all else, is passionate about data and analytics. He/she is an expert with data modeling, ETL design and business intelligence tools and passionately partners with the business to identify strategic opportunities where improvements in data infrastructure creates outsized business impact. He/she is a self-starter, comfortable with ambiguity, able to think big (while paying careful attention to detail) and enjoys working in a fast-paced team. The ideal candidate needs to possess exceptional technical expertise in large scale data warehouse and BI systems with hands-on knowledge on SQL, Distributed/MPP data storage, and AWS services (S3, Redshift, EMR, RDS).\n<br><br>\n<strong>Specifically, the Data Engineer will:</strong>\n<br>\n· Design, implement, and support a platform providing ad hoc access to large datasets\n<br>\n· Interface with other technology teams to extract, transform, and load data from a wide variety of data sources using SQL\n<br>\n· Implement data structures using best practices in data modeling, ETL/ELT processes, and SQL, and Redshift\n<br>\n· Build robust and scalable data integration (ETL) pipelines using SQL, Python and Spark\n<br>\n· Build and deliver high quality datasets to support business analysis and customer reporting needs\n<br>\n· Interface with business customers, gathering requirements and delivering complete data structures</div><div>BASIC QUALIFICATIONS<br><br>· Bachelor's degree in Computer Science, Computer Engineering, Business Administration, Mathematics or a related field\n<br>\n· 3+ years of industry experience as a Data Engineer or related specialty (e.g., Business Intelligence Engineer, Data Scientist)\n<br>\n· Experience in data modeling, ETL development, and Data warehousing.\n<br>\n· Data Warehousing Experience with Oracle, Redshift, Teradata, etc.\n<br>\n· Experience providing technical leadership and mentor other engineers for the best practices on the data engineering space\n<br>\n· Experience in continually improve ongoing reporting and analysis processes, automating or simplifying self-service support for customers\n<br>\n· Experience building data products incrementally and integrating and managing datasets from multiple sources\n<br>\n· Experience building/operating highly available, distributed systems of data extraction, ingestion, and processing of large data sets</div><div>PREFERRED QUALIFICATIONS<br><br>· Experience leveraging Python, R or Matlab to manipulate data and set up automated processes as per business requirements\n<br>\n· Experience with Big Data Technologies (Hadoop, Hive, Hbase, Pig, Spark, etc.)\n<br>\n· Experience leading large-scale data warehousing and analytics projects, including using AWS technologies – Redshift, S3, EC2, Data-pipeline and other big data technologies\n<br>\n· Strong ability to interact, communicate, present and influence within multiple levels of the organization\n<br>\n· Track record of manipulating, processing, and extracting value from large datasets\n<br>\n· Excellent communication skills to be able to work with business owners to develop and define key business questions and to build data sets that answer those questions\n<br>\n· Master's degree\n<br><br>\nAmazon is an Equal Opportunity Employer – Minority / Women / Disability / Veteran / Gender Identity / Sexual Orientation</div></div>"}