{"job title": "Bible Labs Software Engineer - iOS", "company": "Life.Church", "city state": "– Edmond, OK", "rating": "4.9", "job description": "<div>With technology rapidly changing, Bible Labs recognizes the opportunity to make the most of this moment in history and discover new ways to help people engage with Gods Word. Were seeking a forward-thinking Software Engineer to join our small, collaborative team responsible for the end-to-end development of our iOS applications and sharing our passion for new technology, research, and innovation.</div><br>\n\n<div>If youre looking to dedicate your life to drive development of multiple mobile apps that have the potential to change millions of lives around the world, keep reading!</div>\n\n<br><strong><div>You are:</div>\n\n<br></strong>\n\n\n<ul>\n\n\t<li>Passionate about the global effect of Bible engagement</li>\n\n<li>Excited by learning new methodologies and systems.</li>\n\n<li>Willing to do whatever it takes to help your team be successful</li>\n\n<li>Comfortable with ambiguity, shifting deadlines and the iterative design process</li>\n\n<li>Able to drive a project from a simple idea to the finished product.</li>\n</ul>\n\n<strong><div>You will be:</div>\n\n<br></strong>\n\n\n<ul>\n\n\t<li>Quickly prototyping new app and feature ideas that make effective use of new platforms and technologies which are at the forefront of mobile technology</li> \n\n<li>Designing and implementing new features and creating human interfaces</li>\n\n<li>Building back-end applications and features</li>\n\n<li>Working closely with the YouVersion engineering team</li>\n\n<li>Collaborate with team members representing product, design, web development, and product marketing</li>\n</ul>\n\n<strong><div>You have:</div>\n\n<br></strong>\n\n\n<ul>\n\n\t<li>3+ years of experience in iOS development and/or software development</li>\n\n<li>Expertise in Git, MacOS, iOS application development, Cocoa, and Objective-C/Swift</li>\n\n<li>Deep understanding of interactive application development patterns</li>\n\n<li>Knowledge of iOS SDK performance tools and optimization techniques</li>\n\n<li>Skill in client/server architecture and integrated mobile applications, REST</li>\n\n<li>Published one or more applications in the iOS App Store</li>\n\n<li>Passion for the end-to-end user experience</li>\n\n<li>Strong time management and organizational skills to drive projects to completion</li>\n\n<li>Experience mentoring others and a desire to lead</li>\n</ul>\n\n<strong><div>The cherry on top:</div>\n\n<br></strong>\n\n\n<ul>\n\n\t<li>Be part of a team that cares about you, your personal growth, and professional development</li>\n</ul>\n\n<div><strong>About Bible Labs</strong></div><br>\n\n<div>Since YouVersion launched the Bible App in 2008, millions of people have used the app to engage with Gods Word in hundreds of languages and in every country around the world. It has truly been a remarkable work that God has done, and we believe it is just the beginning. We launched Bible Labs in 2016 to make the most of cutting-edge technology as we look toward the future of what God will continue to do.</div><br>\n\n<div>This position is located at the Life.Church/YouVersion Central Offices in Edmond, Oklahoma. We encourage you to submit examples of your work.</div>"}