{"job title": "Software Engineer (Trainer)-1", "company": "OneMain Financial", "city state": "– Evansville, Indiana", "rating": "2.8", "job description": "<ul>\n<li>Work closely with internal customers and subject matter experts to develop and maintain technical training documentation for the MuleSoft platform.</li><li>Provide personalized support and training to internal customers on the MuleSoft platform and enterprise standards.</li><li>Conduct training in a variety of formats to meet the needs of the audience (train-the-trainer, classroom, Remote, etc.)</li><li>Build and maintain professional relationships by consistently delivering exceptional service and exceeding expectations.</li><li>Collaborate with team members and internal customers to share knowledge and identify areas for improvement.</li><li>Act as subject matter expect for MuleSoft platform and enterprise standards.</li><li>Monitor emerging trends within the MuleSoft platform.</li><li>Cross Train with COE Engineers.</li><li>Maintains Appropriate Procedure Documentation.</li><li>Performs all other duties as assigned by Management.</li>\n</ul>\n<strong>Additional Job Functions and Skills:</strong>\n<ul>\n<li>Demonstrated ability to work with internal customers to design, implement and maintain MuleSoft platform training for the enterprise.</li> <li>Must have experience in written and verbal communication and should be capable of communicating effectively to all levels within the organization on technical content and concepts.</li> <li>Individual must be open to learning the MuleSoft platform and acting as a subject matter expert within the organization.</li><li>Must be a self-starter who is highly motivated, reliable, detail oriented, and driven to produce high quality work.</li> <li>Must thrive in a fast-pace environment and be willing to learn on the job in a continuously evolving environment.</li>\n</ul>\n<strong>Education/Experience:</strong>\n<ul>\n<li>Bachelors Degree with a minimum of 2 years experience as a Software Engineer or Software Developer (OR) Masters Degree with a minimum of 1 year experience in Computer Science, Information Science, Technical Communication or related field.</li><li>Technical Training experience and exposure to online consumer lending or similar industry preferred.</li>\n</ul>"}