{"job title": "Data Engineer", "company": "Project Management Institute", "city state": "– Newtown Square,PA", "rating": "3.1", "job description": "Project management matters. Want to help us move it forward? To make sure its people keep up, we’re changing, too– by becoming more agile, focused and customer-centric. And we’re looking for a Data Engineer to help us.\n<br><br>\n<strong>How you’ll make a difference</strong>\n<br><br>\nA big part of this transformation is making sure we are leading with data to support and drive our business initiatives.\n<br><br>\nYou will guide and be responsible for expanding and optimizing our data and data pipeline architecture, as well as optimizing data flow and collection for our cross functional teams. As well as being an experienced data pipeline builder and data wrangler who enjoys optimizing our data systems and building them from the ground up.\n<br><br>\nMake an impact by supporting our software developers, database architects, data analysts and data scientists on data initiatives and ensuring optimal data delivery architecture is consistent throughout our ongoing projects.\n<br><br>\n<strong>What you’ll bring to the role</strong>\n<ul>\n<li>7+ years of experience in a Data Engineer role</li></ul>\n\n<ul>\n\n\n<ul>\n<li>Advanced working SQL knowledge and experience working with and optimizing databases performance</li><li>Experience with the architecting, design and implementation of ETL technologies</li><li>Experience building and optimizing traditional and contemporary data pipelines, architectures and data sets</li><li>Experience in developing processes, code and configurations for data extraction, transformation, and load and workload management.</li><li>Working knowledge of message queuing, enterprise service bus, and scalable‘big data’ data stores.</li><li>Experience performing root cause analysis of more complex data processing issues that cannot be resolved by operations</li><li>Software development experience</li></ul>\n</ul>\nYou should also have experience using the following software/tools:\n<ul>\n\n\n<ul>\n\n\n<ul>\n<li>ETL tools (e.g. Talend, Informatica)</li><li>SQL and NoSQL databases (e.g. Microsoft, Oracle)</li><li>Experience with cloud services (e.g. Azure, AWS, Google) Experience with stream-processing systems a plus: Storm, Spark-Streaming, etc.</li></ul></ul>\n\n</ul>\n\n\n<ul>\n<li>Experience with object-oriented/object function scripting languages (e.g. Python, R, Java, C++, )</li></ul>\n\n<ul>\n\n\n<ul>\n<li>Degree in computer science, engineering or mathematics</li><li>Graduate degree in Computer Science, Statistics, Informatics, Information Systems or another quantitative a plus.</li></ul>\n</ul>\n<strong>What you’ll get from PMI</strong>\n<br><br>\nThrough our certifications, professional development, communities and membership, we support more than three million people in nearly every country in the world.\n<br><br>\nAnd we believe in supporting our employees, too.\n<br><br>\nJoin us and:\n<ul>\n<li><strong>You’ll get an excellent total package, not just great pay</strong>. The benefits for this role include 100% paid medical, dental, vision and prescription coverage, up to 20 days’ paid days off a year to start (plus 10 paid holidays) and a 401(k) retirement savings program that matches your contribution (up to 7% of salary).</li><li><strong>You’ll grow professionally.</strong> We’ll work with you to make the right development choices for your career. The skills you gain will help you to get the most out of your time with us, and make you more marketable in the future.</li><li><strong>You’ll make an impact from day one.</strong> We’ll put you on stimulating projects, with people from diverse working backgrounds (and cultures, if the project's global). And if you have a bright idea, we’ll help you to develop it.</li><li><strong>You’ll be part of a culture you can be proud of</strong>. We’re friendly and inclusive– it’s what makes us unique. So we’ll support and help you from the moment you join. And you'll do the same for us.</li>\n</ul>\n<br><br>\n<strong>Want to grow, develop and thrive at PMI? Find out more and apply today.</strong>"}