{"job title": "Reliability Engineering Technician - Night Shift", "company": "Skyworks", "city state": "– Newbury Park", "rating": "3.6", "job description": "&nbsp;\n<br><br>\n<strong>Skyworks Solutions, Inc.</strong> is empowering the wireless networking revolution. Our highly innovative analog semiconductors are connecting people, places and things spanning a number of new and previously unimagined applications. We possess broad technology capabilities and one of the most complete product portfolios in the industry. Our customers are global industry leaders who are driving innovative platforms that are changing the way we all live, work and play. Our global team collaborates daily to create the semiconductors the world relies on. If you're looking for a challenging and exciting career in a fast-paced environment, Skyworks offers a variety of roles in an environment that promotes prompt decision making, uninhibited sharing of best practices and individual ownership. Here, you'll find minimal layers of management, open communication and mutual trust and respect.\n<br><br>\nRequisition ID:&nbsp;48438&nbsp;\n<br><br>\n<strong>Engineering Technician 3</strong>\n<br><br>\n<strong>*This is a night shift position, 5:30pm-5:30am. Each week will rotate starting with Wed, Thur, Fri, Sat and the next week will be Wed, Thur, Fri*</strong>\n<br><br>\nPosition Summary: This is an experienced reliability engineering technician position. Perform Qualifications and Qualification Readiness on new Product, Package and Process Qualifications.\n<br><br>\nPrimary Responsibilities:\n<ul>\n<li>Perform RF ATE testing on PCBs.</li><li>Perform RF ATE testing on loose parts using handlers.</li><li>Perform data analysis after ATE and create trend charts.</li><li>Create and maintain qualification schedules using Excel spreadsheets.</li><li>Update the database with the current status.</li><li> Qualification and Qualification Readiness consists of:\n\n<ul>\n<li>Configuring and loading HTOL boards and ovens.</li><li>Configuring and loading HAST boards.</li><li>Loading Temperature Cycle.</li><li>Loading THB (Temperature/Humidity/Bias).</li><li>Loading HTS (High Temperature Storage).</li></ul></li>\n</ul>\nJob Requirements\n<ul>\n<li>AA or 2 year Technical School in electrical engineering or physics.</li><li>3+yrs. of experience in Product Reliability or performing HTOL or Burn-in, Temperature cycling, and environmental testing.</li><li>2+yrs of experience in RF testing using Spectrum Analyzes, Network Analyzers, and Power Meters.</li><li>Excellent written communication skills and organizational skills are essential.</li><li>Experience with Microsoft Excel is required.</li>\n</ul>\n#LI-AP1\n<br><br>\n&nbsp;\n<br><br>\n&nbsp;\n<br><br>\nSkyworks is proud to be an equal opportunity employer supporting diversity in the workplace."}