{"job title": "REMOTE Lead Software Engineer - Java, JavaScript, Node.js", "company": "Technology Navigators", "city state": "– Austin, TX", "rating": "3.7", "job description": "<p><b>No sponsorship available. No third-party candidates.</b></p>\n<p>Our client, a heavy hitter in the IaaS/PaaS space, delivers cloud solutions and services to businesses on a global scale. With end-to-end solutions and streamlined technology, this company is making good on its mission to provide accessible and affordable cloud technologies.</p>\n<p>This high-performance group is looking to hire a motivated <b>Lead Software Engineer</b> to take on a key role for a mission-critical AI project. This person will have the opportunity to work <b>remotely</b> with occasional <b>visits to client sites in the Dallas area</b>.</p>\n<p><b>What you get to do:</b></p>\n<ul>\n<li>Design and develop complex solutions using Java, JavaScript, and Node.js</li>\n<li>Take on a leadership role within the development team<br></li>\n<li>Work in tandem with other engineers on paired programming initiatives</li>\n<li>Gain hands-on experience with cutting-edge tools and technologies while working with this booming start-up</li>\n</ul>\n<p><b>What you need to succeed:</b></p>\n<ul>\n<li>Recent professional experience coding with Java</li>\n<li>Strong hands-on experience with Node.js and JavaScript</li>\n<li>Experience leading and mentoring software engineering teams</li>\n<li>Proven ability to complete mission-critical paired programming tasks</li>\n<li>Experience with object-oriented and MVC design patterns</li>\n</ul>\n<p><b>What’s in it for you:</b></p>\n<p>If you enjoy working from the comfort of your own home, you’re in luck! This <b>remote</b> opportunity allows you to work from home, although <b>you will be expected to visit client sites in the Dallas, Texas area as needed</b>. As an employee, you will have access to our amazing client list, the support of an experienced industry-leading team, and the opportunity to enroll in health benefits packages, including medical, dental, and vision insurance.</p>\n<p><b>Interested to learn more about this job opportunity? Apply online today!</b></p>"}