{"job title": "Senior Backend Engineer", "company": "Tophatter", "city state": "– San Francisco", "rating": "3.8", "job description": "<div>We are currently looking for strong, experienced backend engineers to join our team. You will have the opportunity to work on all aspects of the product.</div><br>\n<div>For more details about our culture, teams, and growth, please review our interview process.</div>Responsibilities\n\n<ul>\n<li>Build backend components of an evolving real-time web application</li><li>Work closely with our product managers to understand product needs</li><li>Write &amp; test code that truly workscode that is elegant &amp; scales well</li><li>Focus on fast, iterative &amp; agile development</li><li>Ensure performance, scalability, availability &amp; security in everything you do</li><li>Contribute to platform-level technology, strategy &amp; decisions</li><li>Engage in the business goals as well as the technology</li>\n</ul>\n\n<strong>Requirements</strong>\n\n<ul>\n<li>BS, or equivalent work experience, in Computer Science, Math, or related technical field (experience writing good software is a suitable replacement for a technical degree)</li><li>An emphasis on shipping products on the web, rather than lower-level, systems or embedded systems</li><li>Preference for generalists over specialists - ability to wear many hats</li><li>Knowledge &amp; skills in a broad range of internet technologies</li><li>Deep proficiency interacting, building, and improving the performance of RESTful APIs</li><li>Deep proficiency in a popular framework such as Rails, Django, or Node (we use Ruby on Rails)</li><li>Deep proficiency in a programming language such as Python, Ruby, Java, or C (we use primarily Ruby)</li><li>Competence with Linux and Git</li><li>Comfortable working in a small, dynamic, and fast-paced team</li><li>Resourceful, flexible &amp; adaptable; no task is too big or too small</li><li>Experience in an agile environment where iteration has led to perfection</li><li>Past co-workers attest to your prowess &amp; agility in building great products</li>\n</ul>\n\n<div>Don't have Tophatter? Download it now: https://tophatter.com/sign_up</div><br>\n<div>Check us out on The Muse to learn about our culture and cool work environment!</div><br>\n<div>Like what you see? Subscribe to our channel and follow us!</div><br>\n<div>Facebook: https://www.facebook.com/tophatter/</div><div>Instagram: https://www.instagram.com/tophattr/</div><div>Pinterest: https://www.pinterest.com/tophatter/</div><div>Twitter: https://twitter.com/tophatter</div><br>\n<div>Tophatter is re-imagining discovery commerce in a world increasingly connected by smartphones. We are the world's fastest, most entertaining marketplace for mobile shoppers.</div><br>\n<div>We connect buyers and sellers around the world in real-time auctions that are both fast and effective. Leveraging our ever-expanding data for merchandising and personalization, nearly every item sells, and sells within an average of 90 seconds.</div><br>\n<div>Tophatter is funded by leading Silicon Valley venture capital firms, including August Capital, Charles River Ventures, Sequoia Capital, and SV Angel. We are based in Palo Alto, with offices in San Francisco and Shanghai.</div><br>\n<div>We are actively expanding our team. In exchange for your precious time and energy, we offer incredible freedom and responsibility. If you're looking for a challenge, look no further. Let's grow together.</div><br>\n<div>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</div><br>\n\n<div>Any unsolicited resumes/candidate profiles submitted through our website or to personal email accounts of employees of Tophatter are considered the property of Tophatter and are not subject to payment of agency fees.</div>"}