{"job title": "Assistant Scientist, Analytical Chemistry", "company": "Aerotek, An Allegis Group Company", "city state": "– Raleigh, North Carolina", "rating": "NA", "job description": "<strong> Position Summary</strong>\n<br>\nAnalytical Chemists are accountable for driving results in a fast-paced environment by performing analytical routine and non-routine testing in support of pharmaceutical product development or pharmaceutical manufacturing. The Analytical will also assist with method development/method validation projects. Typical types of testing: assays (potencies, related substances, residual solvents, metals etc.), rate of release (dissolution), moisture content, identification, and various other wet chemistry based measurements. HPLC and/or GC based methodologies are commonly employed in the described testing. Other key methodologies applied include: titrations UV, AA, IR. Test methods employed may be compendial (i.e. USP, EP) or proprietary (client supplied or developed by The Company).\n<br><br>\nThis position offers a fantastic opportunity for Chemists to gain experience with both liquid and solid drugs and to gain experience using 15 different types of testing techniques for pharmaceutical products.\n<br><br>\n<strong> Essential Functions</strong>\n\n\n<ul>\n<li>Performs laboratory work related to analytical testing and method development in support of contract pharmaceuticals.</li>\n<li>Evaluates and interprets generated data.</li>\n<li>Analyzes information for technical correctness and accuracy.</li>\n<li>Understands the theoretical basis of the methods/experiments.</li>\n<li>Works on problems of diverse scope in which analysis of data requires evaluation of identifiable factors.</li>\n<li>Writes standard operating procedures (SOPs), test procedures, specifications and summary reports.</li>\n<li>Maintains working knowledge of instrumentation, equipment, and scientific methodologies necessary to perform assigned tasks.</li>\n<li>Maintains a safe, clean, and organized work environment free of safety hazards.</li>\n<li>Ensures timely completion and compliance with cGMP and all other relevant company training requirements.</li>\n</ul>\n\nThis position is located in Wilmington, NC.\n<br><br>\nPlease contact Michael Del Bianco for more details\n<br>\n<strong>(854) 444-5685</strong>\n<br><br>\n<strong>About Aerotek:</strong>\n<br><br>\n<strong> We know that a company's success starts with its employees. We also know that an individual's success starts with the right career opportunity. As a Best of Staffing® Client and Talent leader, Aerotek's people-focused approach yields competitive advantage for our clients and rewarding careers for our contract employees. Since 1983, Aerotek has grown to become a leader in recruiting and staffing services. With more than 250 non-franchised offices, Aerotek's 8,000 internal employees serve more than 300,000 contract employees and 18,000 clients every year. Aerotek is an Allegis Group company, the global leader in talent solutions. Learn more at Aerotek.com.</strong>\n<br><br>\n<strong> The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.</strong>\n<br><br>\n<strong> If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please call 888-237-6835 or email accommodation@aerotek.com for other accommodation options. However, if you have questions about this position, please contact the Recruiter located at the bottom of the job posting. The Recruiter is the sole point of contact for questions about this position.</strong>"}