{"job title": "Product Data Science Senior Engineer", "company": "Amgen", "city state": "– Thousand Oaks, California", "rating": "3.7", "job description": "Job Description\n<br><br>\nAmgen is seeking a Product Data Science Senior Engineer to be based in our Thousand Oaks, CA global headquarters, who will report into a Senior Data Scientist.\n<br><br>\nThe Product Data Science Senior Engineer will support the Commercial Information Systems (IS) team by designing, building and maintaining software solutions for data generation and data transformation to deploy Advanced Analytics applications (product) to enhance different US Business Operations (USBO) business processes. Additionally, the Incumbent will design and develop solutions aligned with the IS strategy, which includes but is not limited to the reuse and enhancement of existing assets and capabilities. Further, the Product Data Science Senior Engineer will evaluate and introduce emerging technologies to enhance Data Science capabilities at Amgen as well as build software solutions for product team Data Scientists that enable them to do their jobs.\n<br><br>\nThis opportunity will be part of a product team that will remain working together after the initial deployment of an Advanced Analytics app.\n<br><br>\n<strong> Primary Responsibilities of the Product Data Science Senior Engineer include:</strong> \n\n<ul>\n<li>Understands the business innovation/opportunity use case for which the Proof of Value or Experiment is being planned</li><li>Supports product team data scientist by providing access to corporate data assets and new data sets required for the experiment</li><li>Develops a deep expertise in data, data models and how to consume and manage information</li><li>Assembles large, complex and diverse data sets that meet functional/non-functional requirements</li><li>Develops, tests and maintains the software infrastructure to enable computation over diverse data sets</li><li>Optimizes data delivery and re-design infrastructure for greater scalability to support the deployment phase of the Advanced Analytics app</li><li>Identifies and enables new capabilities and technologies required to execute the experiment like Data Streaming, Unstructured Data Pipelines, Machine Learning, etc.</li><li>Builds software products and frameworks to enable data engineering services for Advance Analytics app</li><li>Designs and develops technical solutions like data pipelines, data modelling, optimization of data flows and model deployment to support the Pilot, Scaling, Deployment and Support phases of Advanced Analytics app</li><li>Works closely with Software Developers and Data Scientists within the product team to ensure the Advanced Analytics app remains relevant, scalable and robust through the life of the product (product backlog)</li>\n</ul>\n\n<strong>Basic Qualifications:</strong>\n<br><br>\nDoctorate degree\n<br><br>\n<strong>OR</strong>\n<br><br>\nMaster's degree and 3 years of Data Science and/or Data Science Engineering and/or Product Engineering experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nBachelor's degree and 5 years of Data Science and/or Data Science Engineering and/or Product Engineering experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nAssociates' degree and 10 years of Data Science and/or Data Science Engineering and/or Product Engineering experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nHigh school diploma / GED and 12 years of Data Science and/or Data Science Engineering and/or Product Engineering experience\n<br><br>\n<strong>Preferred Qualifications:</strong>\n\n<ul>\n<li> Strong understanding of software architecture, design patterns, data structures &amp; algorithms</li> <li> 6+ years' of experience developing in one or more languages (Java, C#, C, Python, Go)</li> <li> Experienced in building cloud native applications with one of big 3 cloud providers (AWS, Microsoft, Google). Should have delivered at least 2 applications with different use cases. Strong understanding of cloud provider architecture, concepts &amp; SDKs</li> <li> 4+ years of experience developing backend applications using, REST/SOAP style APIs</li> <li> 4+ years of experience with open source development tool chain (SVN, Git, Jenkins, etc)</li> <li>Academic degree in Computer Science, Engineering or related discipline</li><li> Hands on experience in one or more: ETL, Batch Processing, APIs, Machine Learning</li> <li> Experience with open source data technology stack (e.g. Kafka, Spark, H20, Hadoop etc.)</li> <li> Experience with data stores (e.g. AWS Redshift, ElasticSearch, Neo4j etc.)</li> <li> Excellent verbal and written communication skills, with demonstrated ability to interact effectively with different personality styles and build relationships</li> <li> Experience with building &amp; managing Enterprise Data Lakes</li> <li> Experience in healthcare industry or business intelligence as an SRE</li> \n</ul>\n\nAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.\n<br><br>\nAmgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.\n<br><br>\n<strong>#DS2018</strong>\n<br><br>\n<strong> Join Us</strong> \n<br><br>\n<strong>If you're seeking a career where you can truly make a difference in the lives of others, a career where you can work at the absolute forefront of biotechnology with the top minds in the field, you'll find it at Amgen.</strong>\n<br><br>\n<strong>Amgen, a biotechnology pioneer, discovers, develops and delivers innovative human therapeutics. Our medicines have helped millions of patients in the fight against cancer, kidney disease, rheumatoid arthritis and other serious illnesses.</strong>\n<br><br>\n<strong>As an organization dedicated to improving the quality of life for people around the world, Amgen fosters an inclusive environment of diverse, ethical, committed and highly accomplished people who respect each other but compete intensely to win. Together, we live the Amgen values as we continue advancing science to serve patients.</strong>\n<br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n<br><br>\n<strong>.</strong>"}