{"job title": "Senior Engineer, Software Engineering (Data Modeling Data Warehouse Architect) (P", "company": "Cardinal Health", "city state": "– Dublin, Ohio", "rating": "3.3", "job description": "The primary role of the Data Modeling and Data warehouse architect is to understand the overall analytical needs and business requirements and capable of creating conceptual, logical and physical models using data warehousing principles. As a data warehouse architect, candidate should be able to conduct business design sessions to define the logical models. Furthermore, as a data warehouse architect, the candidate should be able to define an overall enterprise data warehouse architecture using the best data warehousing principles. Candidate should also have solid experience in implementing and supporting large Data Warehousing systems, preferably in SAP HANA.\n<br><br>\nWhat Software Engineering contributes to Cardinal Health\n<br><br>\nSoftware Engineering is responsible for designing, developing, implementing and supporting applications, systems and IT products required to achieve the company's business objectives.\n\n\n<ul>\n<li>Demonstrates knowledge of software development techniques and fluency in software languages and application programming interfaces.</li>\n<li>Demonstrates general understanding of hardware/software platforms including but not limited to operating systems, databases, application servers, web servers and integration technologies.</li>\n<li>Plans and executes system implementations that ensure success and minimize risk of system outages or other negative production impacts.</li>\n<li>Demonstrates conceptual knowledge of architecture standards and database and operating systems.</li>\n<li>Demonstrates problem solving ability that allows for effective and timely resolution of system issues including but not limited to production outages.</li>\n<li>Analyzes production system operations using tools such as monitoring, capacity analysis and outage root cause analysis to identify and drive change that ensures continuous improvement in system stability and performance.</li>\n<li>Demonstrates knowledge of software development, life cycle, modeling of business processes, application design patterns, business/functional documents. Estimates to high level business requirements and provide options analysis.</li>\n</ul>\n\nWhat is expected of you and others at this level\n\n\n<ul>\n<li>Applies advanced knowledge and understanding of concepts, principles, and technical capabilities to manage a wide variety of projects</li>\n<li>Participates in the development of policies and procedures to achieve specific goals</li>\n<li>Recommends new practices, processes, metrics, or models</li>\n<li>Works on or may lead complex projects of large scope</li>\n<li>Projects may have significant and long-term impact</li>\n<li>Provides solutions which may set precedent</li>\n<li>Independently determines method for completion of new projects</li>\n<li>Receives guidance on overall project objectives</li>\n<li>Acts as a mentor to less experienced colleagues</li>\n<li>Works with business/data analysts to establish clearly defined business requirements that follow a business process model</li>\n<li>Conducts design sessions with customers/stakeholders</li>\n<li>Creates Conceptual, Logical, and Physical data models to represent business and support its operational and analytical needs</li>\n<li>Designs and manages data models in data modeling products</li>\n<li>Develops data warehousing models that adhere to data warehousing best practices</li>\n<li>Design and develop slowly changing dimensions that can support both historical and current state data analysis</li>\n<li>Coordinate with testing and other development teams to implement the design</li>\n<li>Provides and architectural guidance on various data modeling needs of the business</li>\n<li>Works with data source systems process owners to establish input</li>\n<li>Performs data analysis for source system data.</li>\n<li>Proven experience working with PL/SQL and stored procedures</li>\n<li>Possess strong analytical, communication and presentation skills</li>\n<li>Possess in-depth understanding of data warehousing concepts and experience in areas such as large scale Data Warehouse implementation, business discovery platforms and Data Warehouse strategy at an enterprise level</li>\n<li>Solid work experience is a must in data warehousing tools such as Power Designer and/or ERwin or equivalent</li>\n<li>Understanding of security model around Enterprise data warehouse</li>\n</ul>\n\n<strong>Desired Skills:</strong>\n\n\n<ul>\n<li>Understanding of SAP HANA Data Modeling is desired</li>\n<li>Experience with Kimball Data Warehouse design methodology</li>\n<li>Experience in native HANA data modeling is a plus</li>\n<li>Experience of any data warehouse using cloud technologies is a plus</li>\n<li>Experience in supporting business community or data scientists is a plus</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>Bachelors Degree in related field or equivalent work experience</li>\n<li>8+ years experience in related field preferred</li>\n<li>Working knowledge of three or more technologies preferred</li>\n<li>Proven leadership ability preferred</li>\n</ul>\n\nCardinal Health is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status."}