{"job title": "Data Engineer (*Relocation Assistance Available)", "company": "CyberCoders", "city state": "– San Francisco, CA", "rating": "3.8", "job description": "Data Engineer (*Relocation Assistance Available) <div>\nIf you are a Data Engineer with experience, please read on!<br><br>If you are interested in joining a cutting edge company that definitely cares about providing a great working environment for its employees, then apply immediately.<br><br>--Your application will be considered incomplete unless the screening questions are answered, and incomplete applications cannot be submitted for further review. Please answer all of the screening questions in detail in order to expedite the process.--\n</div>\n\nWhat You Will Be Doing<div>\n-Design and develop scalable platforms and processes for feature extraction, model training, and simulation<br>-Build and interact with large data sets to optimize manual processes and create solutions to business problems<br>-Build and maintain the associated data infrastructure, ETL pipelines and data assets central to machine learning and data science.\n</div>What You Need for this Position<div>\n-MS or PhD in Computer Science, Physics, Engineering or related quantitative field<br>-5+ years experience as a Data Engineer, Software Engineer, or Machine Learning Engineer with a track record of manipulating, and extracting value from large datasets<br>-Excellent communication skills with the ability to distill complex issues and analysis<br>-Experience building machine learning models at scale and a broad knowledge of machine learning APIs, tools, and open source libraries<br>-Strong programming programming a algorithmic skills (experience with Python, Scala C++)<br>-Experience within a hadoop ecosystem and related technologies including Postgress, Redshift, Hive, Kafka, MapReduce, Hive, Spark or Presto<br>-Experience building micro services\n</div>What's In It for You<div>\n- $120,000-$175,000 Base Salary (DOE)<br>- Unlimited PTO<br>- Stock Options<br>- Medical<br>- Dental<br>- Vision<br>- Employee Discounts\n</div><div>\nSo, if you are a Data Engineer (-Relocation Assistance Available) with experience, please apply today!\n</div> - <p>Applicants must be authorized to work in the U.S.</p><br><br>\n <b>CyberCoders, Inc is proud to be an Equal Opportunity Employer</b>\n <br><br>\n All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n <br><br>\n <b>Your Right to Work</b> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}