{"job title": "Data Architect", "company": "Dyson", "city state": "– Chicago, IL", "rating": "2.8", "job description": "Description\n<br><br>\nAs a data architect you will work with our business teams to enable the design and build of repeatable analytics solutions, and to help drive innovation through proof of concepts and underlying capabilities.\n<br><br>\nMarket Overview\n<br><br>\nDyson is a global technology company. Using a desire to make things work better as a catalyst for invention, our team of 3,000 engineers and scientists are passionate about developing technology that solves the problems others often ignore. From the world's first bagless vacuum cleaner, to hand dryers that use 420mph sheets of air to remove moisture from hands, to a completely re-thought hair dryer with its motor in the handle, we are relentless about engineering better solutions. Dyson spends $8.8million a week on research and development and works with more than 40 universities worldwide to develop early-stage technologies.\n<br><br>\nDyson launched in the US in 2002, with the DC07 vacuum cleaner. Within 2 years, it was market share leader. Now, the US team is nearly 1,000 strong, with offices in Chicago, IL; Aurora, IL; San Francisco, CA; and Dyson people around the entire country. And we are still growing. Dyson US is poised to double its footprint, and take on new categories. Already a target for our competitors, challenging times are ahead. And our battle-hungry US team is fired up.\n<br><br>\nFunction Overview\n<br><br>\nThis role sits within Dyson's Global Data and Analytics team. This team is tasked with ensuring that the various parts of Dyson's business are able to leverage rich, accurate, and timely data to generate insights and make better decisions. As a part of IT, the team has the resources and the remit to keep up with Dyson's impressive global growth.\n<br><br>\nAccountabilities\n\n\n<ul>\n<li>· Engage with business teams to understand in detail their specific needs;</li>\n<li>· Solve the challenge of integrating disparate sources of enterprise data and information to model and visualize their businesses and derive insight;</li>\n<li>· Develop solutions and processes to deliver the right level of data quality;</li>\n<li>· Have the opportunity to work on projects at a strategic, tactical and operational level;</li>\n<li>· Develop and maintain long lasting relationships with senior stakeholders, both during and outside of project delivery;</li>\n<li>· Supporting a data design work-stream in an agile delivery or on a large-scale 'waterfall' delivery project for an enterprise data warehouse or reporting solution</li>\n<li>· Lead the design of the architecture for an on-premises or cloud-based, data warehouse, or big data solution; this could cover several technologies, countries and lines of business</li>\n<li>· Lead and Assist in the further development of our capability through proof-of-concepts; and</li>\n<li>Lead the data architecture capability and further develop the team</li>\n</ul>\n\n<strong>Skills</strong>\n<br><br>\nWe want people who will embody a collaborative approach in bringing both business and technology stakeholders togetherto deliver technology solutions that enable tangible business benefits.\n\n\n<ul>\n<li>· Owns the definition of data architecture components for information management solutions to facilitate storage, integration, usage, access, and delivery of data assets across the enterprise</li>\n<li>· Producing and approving architecture diagrams for enterprise data and analytics solutions including conceptual, logical and physical</li>\n<li>· Architecting conceptual, logical and physical data models using data modelling approaches (e.g. 3NF relational, Kimball dimensional) in standard modelling tools</li>\n<li>· Designing the data integration architecture based on solution requirements e.g. real-time, near real-time, batch</li>\n<li>· Support Defines and manages work packages that deliver elements of an information management solution e.g. data warehouse, data mart, ETL service, operational data store</li>\n</ul>\n\nDesirable Skills\n\n\n<ul>\n<li>Data Integration&amp;Federation: e.g. SAP, IBM, Oracle, Microsoft, Informatica, Ab Initio, and data integration tools for Hadoop-based architectures</li>\n<li>Data Repositories: e.g. Oracle, Teradata, SQL Server, Netezza, DB2, Greenplum, Amazon Redshift, Cassandra, Hadoop</li>\n</ul>\n\nBenefits Overview\n<br><br>\nDyson US monitors the market to ensure competitive salaries, holidays and retirement plans. Beyond that, you'll also enjoy profit-related bonuses and life and disability cover. But financial rewards are just the start of a Dyson career. Rapid professional growth, leadership development and new opportunities abound, driven by regular reviews and dynamic workshops. And with a vibrant culture, the latest devices and a relaxed dress code reflecting our engineering spirit, it's an exciting team environment geared to fueling and realizing ambition.\n<br><br>\nDyson is committed to providing reasonable accommodations to individuals with disabilities. If you are interested in applying for employment with Dyson and need a reasonable accommodation for any part of the application process, please send an e-mail with your contact information, the job number of the position for which you are interested in applying, and the nature of your request to careers.us@dyson.com or call (312) 706-2260. Determinations of requests for reasonable accommodation are made on a case-by-case basis.\n<br><br>\nPosted: 28-Aug-2018"}