{"job title": "Business Intelligence Data Architect", "company": "Eaton", "city state": "– Cleveland, Ohio", "rating": "3.4", "job description": "<div><strong>Join Eaton’s Information Technology IT team and help positively impact our business through leading technologies, exciting and challenging enterprise projects and new platforms. We are currently seeking a a Business Intelligence (BI) Data Architect to join our Business Intelligence Center of Excellence (BICOE)team.</strong> This position is based at our Beachwood, OH facility. No relocation is being offered for this position. If the candidate resides within 50 miles of Beachwood, Ohio, the candidate must work at that site. If the candidate resides more than 50 miles away from Beachwood, Ohio, the candidate will work remote from another US Eaton Facility or an approved home office.</div>\n<br>\n<div>The BI Data Architect will provide the technical strategy and supporting IT frameworks to guide the successful design, deployment and operations of IT solutions including the architecture, design, and management of large-scale, highly-distributed, multi-tenant data stores. In addition to building and maintaining these data stores, the Data Architect will also work to ensure that the data is easily accessible and available to data scientists and business users across the enterprise through a broad portfolio of visual analytic tool sets including but not limited to Oracle Business Intelligence, Qlikview, and Power BI.</div>\n<br>\n<div>Making what matters work at Eaton takes the passion of every employee around the world. We create an environment where creativity, invention and discovery become reality, each and every day. It’s where bold, bright professionals like you can reach your full potential—and where you can help us reach ours.</div> \n<br>\n<div>In this role, the BI-CoE Data Architect will have the responsibility for developing data strategies and the roadmaps and tactical solutions that will achieve those strategies in the Enterprise Business Intelligence space. The scope of this role will span the data needs of the Data Lake, MDM, Business Analytics, and Big Data as part of a team. This position will be a key technical leader in the enterprise business intelligence team with primary responsibility spanning data architecture, data modeling, and solution design with emphasis centered on data engineering methods and capabilities.</div><br>\n\n<div><strong>BI-CoE Data Architect will:</strong></div>\n<ul>\n<li>Plan for future-state technology portfolios and IT program investments.</li>\n<li>Develop, communicate, and deploy architecture governance processes.</li>\n<li>Drive the application of emerging technologies to current Eaton environments.</li>\n<li>Drive solution architecture, ensure technical alignment and facilitate technical solution delivery.</li>\n<li>Accountable for maintaining high levels of solution performance, availability and capacity, demonstrating a commitment to quality.</li>\n<li>Works within Eaton's IT Organization to successfully influence the direction of key technical elements of the solution environment.</li>\n<li>Will have a broad level of technical and functional knowledge spanning data mgmt. technologies and best practices.</li>\n<li>Significant proven implementation experience on a wider range of projects with large scope in terms of technological and geographical span.</li> \n\n<li>Architectural design and integration of unstructured and semi-structured platforms with Eaton’s existing architecture</li>\n<li>Establishment and end to end design of Eaton’s data mart strategy for refreshing data into analytic work-spaces including “subject area” build out capabilities, as well as mart deployment strategy</li>\n<li>Recommend, set up, integrate and utilize Big Data, NoSQL, Integration, Database tools and frameworks as required for business and data science needs</li>\n</ul>\n\n<div>When we embrace the different ideas, perspectives and backgrounds that make each of us unique, we — as individuals and as a company — are stronger.\n<br><br>\nWe are committed to ensuring equal employment opportunities for all job applicants and employees. Employment decisions are based upon job-related reasons regardless of an applicant's race, color, religion, sex, sexual orientation, gender identity, age, national origin, disability, marital status, genetic information, protected veteran status, or any other status protected by law.</div>\n\n<br>Qualifications<div><strong>Basic Requirements:</strong> </div>\n\n\n<ul>\n\n<li>\n<div>Bachelor’s degree from an accredited institution</div></li>\n<li>\n<div>Minimum of 10 years of experience as a Business Intelligence Solutions Architect, Systems Analyst or Software Engineer</div> </li>\n<li>\n<div>Minimum of 5 years data warehousing &amp; data modeling experience</div></li>\n<li>\n<div>Minimum of 5 years business intelligence reporting solution design experience</div> </li>\n<li>\n<div>Minimum of 2 years working with one of the following business functional areas: HR, sales, order management, supply chain, or finance.</div> </li>\n<li>\n<div>Candidates must be authorized to work in the US on a continuous basis without company sponsorship</div></li>\n<li>\n<div>This position requires use of information or access to hardware which is subject to the International Traffic in Arms Regulations (ITAR). All applicants must be U.S. persons within the meaning of ITAR. ITAR defines a U.S. person as a U.S. Citizen, U.S. Permanent Resident (i.e. 'Green Card Holder'), Political Asylee, or Refugee. 5 years IT experience or a graduate of Eaton's Leadership Development Program</div> </li>\n</ul>\n\n<div><strong>Position Criteria:</strong> </div>\n\n\n<ul>\n\n<li>\n<div>Experience of successfully delivering on all aspects of a technology project</div> </li>\n<li>\n<div>Exposure to several layers of technology solutions: hardware, application administration, application development, support, etc.</div> </li>\n<li>\n<div>Requires the ability to work on multiple projects of varying scope and scale</div> </li>\n<li>\n<div>Requires the ability to handle ambiguous situations and execute upon a direction</div> </li>\n</ul>\n\n<div><strong>Preferred:</strong> </div>\n\n\n<ul>\n\n<li>\n<div>Master’s degree</div> </li>\n<li>\n<div>Strong Project Management skills</div> </li>\n<li>\n<div>A Certified Business Intelligence Professional (CBIP)</div> </li>\n</ul>\nWe make what matters work. Everywhere you look—from the technology and machinery that surrounds us, to the critical services and infrastructure that we depend on every day—you’ll find one thing in common. It all relies on power. That’s why Eaton is dedicated to improving people’s lives and the environment with power management technologies that are more reliable, efficient, safe and sustainable. Because this is what matters.\n<br><br>\nWe are confident we can deliver on this promise because of the attributes that our employees embody. We’re ethical, passionate, accountable, efficient, transparent and we’re committed to learning. These values enable us to tackle some of the toughest challenges on the planet, never losing sight of what matters.\n<br><br>\n<strong>Job: Information Technology</strong>\n<br><br>\n<strong>Region: North America – US/Puerto Rico</strong>\n<br>\n<strong>Organization: Corporate Sector</strong>\n<br><br>\n<strong>Job Level: Individual Contributor</strong>\n<br>\n<strong>Schedule: Full-time</strong>\n<br>\n<strong>Is remote work (i.e. working from home or another Eaton facility) allowed for this position?: Yes</strong>\n<br>\n<strong>Does this position offer relocation?: No</strong>\n<br>\n<strong>Travel: Yes, 25 % of the Time</strong>"}