{"job title": "Geologist or Environmental Scientist - Mid Level", "company": "Groundwater &amp; Environmental Services, Inc.", "city state": "– Jacksonville, FL", "rating": "3.1", "job description": "<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Performs groundwater sampling, gauging and product bailing, and surveying.</li>\n<li>Participates in monitoring well installations and sampling events.</li>\n<li>Compiles and completes field notes on each event/site.</li>\n<li>Records data prepares reports, provides analysis and interpretations of findings based on scientific experimentation and existing knowledge.</li>\n<li>Completes quarterly groundwater monitoring reports.</li>\n<li>Performs hydrogeological assessments regarding groundwater flows to identify contamination impact and related concerns.</li>\n<li>Researches information relating to identifying geological formations and soil delineation studies and prepares reports and geological maps based on the findings.</li>\n<li>Participates in the identification of viable remedial solutions consistent with all Federal, state, and local regulations.</li>\n</ul>\n\nSkills/Requirements\n\n\n<ul>\n<li>A Bachelor's degree or higher in Geology, Environmental Science, Environmental Engineering or a related discipline.</li>\n<li>2-4+ years of related environmental consulting experience. Retail petroleum and/or industrial experience is a plus.</li>\n<li>Working knowledge of Florida's environmental regulations is a plus.</li>\n<li>Must be detail-oriented, and a team player with good communication, analytical, organization, and time management skills.</li>\n<li>Must have a clean driving record and be able to drive a company vehicle.</li>\n<li>Drug/Alcohol screening and a background check are required.</li>\n</ul>\n\nOur comprehensive benefits include: medical, dental, vision, prescription card, 401k, FSA, LTD, STD, New Parent Leave, 529 CollegeBound Fund, Tuition Assistance, Bonus Plan, and more.\n<br><br>\nGES is an equal opportunity/affirmative action employer that strongly values diversity. EOE/AA/M/F/V/D<br><br>SDL2017"}