{"job title": "Senior Scientist - NGS Assay Development", "company": "Labcorp", "city state": "– San Diego, CA", "rating": "2.9", "job description": "Sequenom, a wholly-owned subsidiary of Laboratory Corporation of America Holdings (LabCorp), is a CAP accredited and CLIA-certified molecular diagnostics laboratory, dedicated to the development and commercialization of laboratory-developed tests (LDTs) for prenatal conditions, cancer, and other diseases. As a member of the R&amp;D Diagnostic Development team, the Senior Scientist will lead laboratory initiatives with responsibilities including the planning, execution, and analysis of assay development projects with a particular focus on innovative and challenging programs like liquid biopsy. The ideal candidate will have extensive knowledge of molecular biology and biochemistry as well as a proven track record in development of novel nucleic acid detection assays. Experience with the analysis of complex genomic data, in particular NGS and/or microarray data, is preferred. Understanding of the biology of cancer as well as the challenges and limitations of low frequency variant detection is a plus. This is an exciting opportunity to be part of a dynamic R&amp;D team and have the opportunity to participate in novel technology development. Responsibilities: Design cutting-edge assays and experiments, execute experimental protocols, and analyze data for review Contribute to the team focusing on the development of liquid biopsy and other molecular diagnostic assays Develop next generation sequencing assays and perform data analysis/interpretation Conceive and design model systems for proof-of-concept studies Design and execute appropriate analytical verification studies Perform data analysis with graphical representations of findings using appropriate software (R, Excel, JMP) Present data clearly and concisely at departmental meetings and project meetings Develop target enrichment approaches utilizing multiplex PCR and/or capture methods Participate and present findings at conferences Publish scientifically relevant data in peer reviewed journals Participate in the development of patent applications, if applicable Independently and/or collaboratively conceive, initiate, and apply for the acceptance of new projects Document all work in the form of laboratory notebook, study reports, summary reports and presentations"}