{"job title": "Exploring The Utility Of Next-generation Air Quality Sensors - Assessment And Advanced Data Analysis", "company": "National Institutes of Health", "city state": "– Research Triangle Park, NC", "rating": "4.2", "job description": "The research participant may collaborate with a multidisciplinary team of EPA scientists devoted to the discovery, integration, and application of emerging technologies within the US EPAs Office of Research and Developments Emerging Technologies research team. Learn more about our past work on the Air Sensors Toolbox (https://www.epa.gov/air-sensor-toolbox)\n<br><br>\nThis team is instrumental in advancing the understanding and use of lower-cost air quality sensors and sensor systems. We have a variety of stakeholders including EPA researchers/policy makers/regulators, regional/tribal/state/local air quality professionals, academics, sensor manufacturers, communities, citizens, and even other countries. Our work provides first-hand knowledge of performance that can be shared with stakeholders as well as best practices, techniques, and tools that can be used by stakeholders implementing their own sensor projects. The research participants engaged in this training program have the opportunity to produce fundamental research to inform future sensor use.\n<br><br>\nThe research participant may conduct research related to the long-term performance evaluation of lower-cost air quality sensors and sensor systems. Research may involve characterization of performance of a number of field deployed sensors, monitoring how the performance metrics change over time and in various geographical locations, determining which environmental factors drive changes in performance, and developing best practice recommendations for maintenance, calibration, and/or replacement intervals for various application scenarios. Given the large data volume from sensors and multiple measurement artifacts affecting some sensors, the participant will likely use programming languages (e.g., R) to analyze sensor data, explore new algorithms to improve sensor data quality, and visualize data. These analyses may reach out beyond the sensor node to evaluate methods of processing sensor data when deployed in large networks or using air quality and/or meteorological data from nearby reference monitoring stations. Research may include one or more aspects of sensor discovery, planning and implementation of field deployments, routine monitoring of data from field deployed instruments, and data collection. Commensurate with the level of training, the research participant will have latitude in exercising independent initiative and judgment.\n<br><br>\nThe research participant may also be involved in developing materials to assist in knowledge transfer including peer-reviewed journal articles, evaluation reports, best practices documents, presentations, and fact sheets that may be published on the web and/or presented to internal and external audiences. The research participant will have the opportunity to present results at scientific conferences and publish manuscripts. Field projects and/or other new research opportunities may be identified while this project is ongoing. If new research projects are identified, the research participant could gain experience from their Mentor by participating in the development of necessary research materials (e.g., quality assurance plans, operating procedures) to meet study objectives.\n<br><br>\nThis program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and EPA. The initial appointment is for one year, but may be renewed upon recommendation of EPA and is contingent on the availability of funds. The participant will receive a monthly stipend commensurate with educational level and experience. Proof of health insurance is required for participation in this program. The appointment is full-time in the Research Triangle Park, North Carolina area. Participants do not become employees of EPA, DOE or the program administrator, and there are no employment-related benefits.\n<br><br>\nThe mentor for this project is Andrea Clements (clements.andrea@epa.gov). The anticipated start date for the appointment is September 17, 2018.\n<br><br>\nQualifications:\n<br>\nApplicants should have a Ph.D. in a field that involves quantitative analysis of large data sets such as engineering, atmospheric science, environmental science, computer science, statistics, mathematics, physical sciences, physics, or chemistry would be well positioned to gain from this training opportunity. The degree must be received within five years of the appointment start date. Degrees in Interdisciplinary STEM fields with strong quantitative analysis will also be considered. Individuals whose resume includes field and/or laboratory experience involving air quality monitoring, experience with low-cost sensors and sensor systems, experience in programming for air quality data analysis and/or air quality modeling will be given greater consideration for selection.\n<br><br>\nThe desired candidate would have experience with quantitative analysis of large data sets which include environmental data. However, experience with large data sets from other fields would still be valuable. Past experience with analyzing air quality data and/or air quality modeling including experience developing programming scripts to process and review, analyze, and visualize data is highly preferred. Skills in R programming is highly preferred although experience with python, IGOR, MATLAB, or SAS could be useful. Direct field and/or laboratory experience in air monitoring, particularly the use of air quality sensors and developing metrics for quantifying performance, is highly preferred. The sources of knowledge and experience may include direct experience, academic, or direct professional training. The preferred candidate would have experience giving scientific presentations, authoring peer-reviewed journal publications, and developing other technical documents."}