{"job title": "Quality Control Scientist", "company": "Nesco Resource", "city state": "– Raritan, New Jersey", "rating": "3.2", "job description": "<strong> Quality Control Scientist I</strong>\n<br>\n<strong>Job Description:</strong>\n<br>\nThe QC Scientist I will be responsible for testing raw materials, stability and final product release of all Client products. This person will assure compliance with company standards and applicable regulatory agencies. He/She will participate in failure investigations to help determine root cause, track and trend data, identify and suggest process improvements to improve business measures.\n<br><br>\nThe QC Scientist I will perform testing within established timelines in accordance with current cGMPs. He/She will participate in equipment maintenance/calibration program. The successful candidate will have the ability to prioritize and handle multiple tasks and challenges at one time and have the ability to work in a team environment and provide customer focused results in an efficient manner.\n<br><br>\nThe QC Scientist I will document results clearly and accurately as well as be able to interpret results by comparing results against appropriate specification requirements. He/She will perform data entry of critical product/process information and release test results to be used in trend analysis. He/She will maintain work areas and equipment as well as ensure calibration and maintenance of equipment is performed at designated intervals. The successful candidate will adhere to departmental and Ortho Clinical Diagnostics SOPs and safety requirements as well as be accountable for notifying management of any out of specifications or abnormal trend in results in a timely manner. He/She will be accountable for reporting nonconformances to management immediately.\n<br><br>\nQuality Control Scientist I provides support during regulatory inspections. Edits documentation (i.e. Standard Operating Procedures, test methods, batch records). Understands and applies PE tools in daily work activities.\n<br><br>\nAttends all required training, adhering to the processes &amp; procedures of this role and the company and displays the highest level of integrity.\n<br><br>\n<strong>Qualifications:</strong>\n\n<li> A Bachelor's degree in Medical Technology, Biology, Chemistry or a related field of study and a minimum of 1-3 years experience with QC, GMP, and analytical procedures is required.</li>  <li> Experience with analytical instrumentation such as spectrophotometer, AutoVue and ProVue is preferred.</li>  <li> Familiarity with the guidelines and regulations of FDA, OSHA, ISO and cGMP is preferred. Manual dexterity to handle instruments, complete repetitive motions, and stand for long periods of time is required.</li>  <li> Diligent use of PPEs (Personal Protective Equipment) to limit exposure to bloodborne pathogens is required. Excellent oral and written communication skills are required.</li>  <li> Proficiency with the Microsoft Office suite of products (Excel, Word, PowerPoint, Outlook). This position is located in Raritan, NJ.</li>  <li> This is a 1st shift position and you must have flexibility to other shifts and some weekends as needs of the business may require.</li>"}