{"job title": "Data Analytics Co-Op, Customer Demand Planning", "company": "Nestle", "city state": "– Stamford, CT", "rating": "3.8", "job description": "Job Number 18006067\n<br><br>\nCompany Nestle Waters North America\n<br><br>\nLocation Stamford, Connecticut\n<br><br>\n<strong>POSITION OVERVIEW</strong>\n<br><br>\nThe Data Analytics Co-Op position will support the Consumer Demand Planning team. Throughout the course of your program, you will be working directly with our National Manager, Advanced Analytics/Principal Data Scientist and the business leaders on critical business projects. You will get an opportunity to use top-of-the-line SAS tools for time seriesforecasting and modeling, and to build and put to use models in R. You will gain hands-on experience solving real business problems and delivering actionable business insight. Our former Co-Ops and interns were able to land highly competitive jobs in the industry as a result of doing this term with Nestle Waters.\n<br><br>\nWhat will you gain?\n\n\n<ul>\n<li>Hands-on experience in SAS through real business projects in a global CPG organization.</li>\n</ul>\n\n<strong>Responsibilities and Projects:</strong>\n\n\n<ul>\n<li>Forecasting: Prepare data for modeling and prototype various modeling approaches to achieve desirable forecast accuracy.</li>\n<li>Advanced Analytics: Combine/prepare data, data survey, preliminary analysis, and slicing and dicing the data to reveal new business insight.</li>\n<li>Predictive modeling: Suggest and implement predictive models such as regression, logistic regression, decision trees/random forest, neural nets, etc.</li>\n<li>Build model front end: Use GUI tools (R shiny or Power BI) to consume the model in a dynamic way.</li>\n</ul>\n\n<strong>DETAILS</strong>\n\n\n<ul>\n<li>The program is set to run from September March.</li>\n<li>The program is located in our North American HQ in Stamford, CT.</li>\n<li>At the conclusion, all co-ops will present their projects and co-op experience to their peers and key business leaders.</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\nTo apply for the Data Analytics Co-Op, candidates must meet the following requirements:\n<br><br>\nEducation level and Graduation Date: Candidates must be currently pursuing a graduate degree in a related area. Candidates must remain enrolled in a degree program for the entirety of the program.\n<br><br>\nMajors: Analytics, Applied Statistics, Software Engineering, Data Mining, Econometrics, or Engineering and/or other related disciplines.\n<br><br>\nMinimum GPA: 3.0\n<br><br>\nWork Authorization: Work authorization in the U.S. is required. NWNA does not offer work authorization sponsorship for this program.\n<br><br>\n<strong>Technical Skills preferred:</strong>\n\n\n<ul>\n<li>Good working knowledge of base SAS with the ability to write SAS code and macros.</li>\n<li>Understand statistical concepts and forecasting methodology.</li>\n<li>Experience with any of SAS tools such as Enterprise Guide, SAS Forecast Studio, Enterprise Miner, SAS ETS/Studio.</li>\n<li>Knowledge of R and hands-on experience with R. R Shiny development.</li>\n<li>Any other predictive analytics or forecasting package and a desire to learn SAS or R.</li>\n<li>Experience in software development.</li>\n</ul>\n\n<strong>Additional preferred qualifications:</strong>\n\n\n<ul>\n<li>Strong analytical capabilities</li>\n<li>Ability to multi-task and effectively troubleshoot</li>\n<li>Responsive and dedicated to internal customers</li>\n<li>Capability to work under pressure, deadline driven</li>\n<li>Continuous improvement mindset</li>\n<li>Strong work ethic and initiative</li>\n<li>Strong written and verbal communication skills</li>\n<li>Sound professional and personal judgment</li>\n<li>MS Office Skills</li>\n</ul>\n\nNOTE: This position does not provide housing, relocation, or sponsorship for employment status (e.g. H-1B visa status).\n<br><br>\nAPPLICATION DEADLINE: Please apply as soon as possible, as offers will be made on a rolling basis.\n<br><br>\nINTERVIEWS: Interviews will begin as early as August 2018.\n<br><br>\n<strong>About Us:</strong>\n<br><br>\nNestlé Waters North America is the nation's leading bottled water company. Our water brands include Poland Spring, Arrowhead, Ozarka, Deer Park, Zephyrhills and Ice Mountain, Nestlé Pure Life, S. Pellegrino, Perrier and Acqua Panna. We're passionate about creating shared value for society in all kinds of ways: from providing careers and benefits to communities where we operate to environmental stewardship most notably responsible water management, lightweight packaging and advancing recycling in America. As a valuable part of our team, you'll receive a competitive total rewards package something that will provide you with the support you need to thrive both inside and outside of work. It's not just the work that you'll find fulfilling here though. As you build a career with us, you'll receive exactly the kind of benefits you'd expect from a leading name in healthy hydration. The only question is, what elements will help you succeed at Nestlé Waters?\n<br><br>\nFor company news and information, please visit"}