{"job title": "Principal Scientist, Translational Medicine", "company": "Pharmacyclics, an Abbvie Company", "city state": "– Sunnyvale, California", "rating": "NA", "job description": "Pharmacyclics is committed to the development and commercialization of novel therapies intended to improve the quality and duration of life and to resolve serious unmet medical needs for cancer patients. Pharmacyclics is a wholly-owned subsidiary of AbbVie (NYSE:ABBV), a global, research-based biopharmaceutical company. Oncology is a key therapeutic area for AbbVie, with a portfolio consisting of three marketed products and a pipeline containing multiple promising new molecules that are being studied in more than 200 clinical trials for over 20 different types of cancer.\n<br><br>\nMore than 1,200 Pharmacyclics and AbbVie research scientists, clinicians, marketing, operations and corporate professionals work in the San Francisco Bay Area. They combine their expertise in immuno-oncology, stem cells, and cell-signaling with their knowledge of bispecific antibodies, antibody-drug conjugates (ADCs), and covalent-inhibitor technologies to discover and develop novel cancer treatments. Together, we are striving to outsmart cancer.\n<br><br>\nTo learn more about us, please visit us at\n<br><br>\nPharmacyclics is seeking a Principal Scientist, Translational Medicine.\n<br><br>\n<strong> General Position Summary/Purpose:</strong> \n<br>\nResponsible for implementation of overall biomarker strategy and development plans to support hematology/oncology clinical studies with a focus on Chronic Lymphocytic Leukemia (CLL) and other B-cell malignancies. Directs and performs pharmacodynamic marker, flow cytometry, cytogenetics, Minimal Residual Disease (MRD) and genomic assays through external CRO and/or internal efforts. Collaborates closely with Clinical Science, Biometrics, Clinical Operation, and Regulatory Departments to deliver biomarker results/reports to internal stakeholders and external agencies. Ensures that overall budgets, schedules, and performance standards are attained. Accountable for the operational execution of biomarker strategy of CLL and other hematology/oncology clinical studies, in compliance with Pharmacyclics processes and regulatory requirements.\n<br><br>\n<strong> Key Accountabilities/Core Job Responsibilities:</strong> \n\n<ul>\n <li> Works in the Discovery Organization, develops, establishes, and leads efforts aimed at discovery of novel biomarkers with association to clinical endpoints in oncology studies.</li>  <li> Collaborates with bioinformatics team to drive biomarker analyzes using a deep understanding of clinical genetics, CLL disease biology and immunology.</li>  <li> Undertakes cross-functional engagement with Clinical Science and Clinical Operations for implementation of biomarker assays in the clinic.</li>  <li> Manage relationships with external analytical labs, provide input into trial-specific agreements and perform technical assessment of labs involved in biomarker sample analysis. Coordinates between CRO Assay Development group and clinical team, when necessary .</li>  <li> Provides input on biomarker-related sections in clinical study-related and regulatory documents (such as Clinical protocol, INDs, IBs, etc.).</li>  <li> Contribute to the biomarker assessments in clinical protocols to develop the central and reference laboratory components.</li>  <li> Participates in reviews and provides recommendations for business development opportunities.</li>  <li> Ensures that biomarker samples selection, data transfer, analyzes and reporting are performed in accordance to the study protocol and in compliance with regulatory requirements.</li>  <li> Participates in drafting of clinical study-related and regulatory documents, such as INDs, ICFs, IBs, Clinical Study Reports, ad hoc analyses, etc. <strong> Qualifications:</strong> </li>  <li> Proven record of success in leading clinical biomarker studies in pharmaceutical or biotechnology companies, preferentially in hematology/oncology settings.</li>  <li> Expertise in frequently used clinical biomarker assay in CLL and a strong understanding of clinical genetics. Bioinformatic experience will be a bonus.</li>  <li> Understanding of clinical trial designs and clinical operations.</li>  <li> Excellent organizational skills, communication skills between research, clinical and biometrics staff.</li>  <li> Deep understanding and expertise in cancer biology.</li> \n</ul>\n\n<strong> Experience:</strong> \n\n<ul>\n <li> PhD in biological sciences or related field with 8 years of relevant Translational Medicine/Biomarker work experience d in in an industry setting.</li>  <li> Experience in drug development in a pharmaceutical or biotechnology company with significant expertise in mid to late stages of clinical development.</li>  <li> Small-molecule kinase inhibitor R&amp;D experience preferred.</li>  <li> Deep understanding of B-cell leukemia/lymphoma biology preferred.</li> \n</ul>\n\nEqual Opportunity Employer Minorities/Women/Veterans/Disabled\n<br><br>"}