{"job title": "Senior Scientist, Parkinsons Disease, CNS Genetic Diseases Research, Neuroscience Therapeutic", "company": "Sanofi", "city state": "– Framingham, Massachusetts, United States", "rating": "3.5", "job description": "<strong>POSITION:</strong>\n<br><br>\nWe are looking for a highly qualified and motivated scientist to join a lab focused on discovering, validating and developing transformative therapies for the treatment of Parkinsons disease and related neurodegenerative disorders. The lab focuses on biological and metabolic pathways shared by rare diseases and more common ailments. We use genetic and experimental approaches to understand the underlying pathological mechanisms and validate novel therapeutic targets.\n<br><br>\nThis is an at-the-bench, laboratory research position for scientists capable of working independently as well as collaboratively to design and execute experiments to discover and validate targets, lead project teams and work cross-functionally and with external collaborators to advance ongoing projects. The successful candidate will hold a Ph.D., have postdoctoral training in neuroscience and an excellent track record of research publications and productivity. A passion for drug discovery and extensive expertise in cell and molecular biology are required. Expertise in the use of -omics, bioinformatics, data mining and other approaches to identify and validate targets and pathways is highly desired.\n<br><br>\n<strong>KEY ACCOUNTABILITIES:</strong>\n<ul>\n<li>Design and execute studies to explore lysosomal and mitochondrial dysfunction in the context of Parkinsons and related CNS diseases.</li><li>Establish biochemical and cellular assays to further understand the roles of specific pathways in synucleinopathies.</li> <li>Mine data to identify or validate targets and pathways, generate and analyze human and model systems -omics data to define human pathological signatures.</li><li>Work independently and collaboratively to execute in vivo and in vitro studies.</li><li>Interact in a matrixed, dynamic and cross-functional manner across the Neuroscience Therapeutic Area, Research Platforms, Clinical Development and other groups around the world.</li><li>Prepare and communicate results at internal and external meetings, and in external publications of high quality.</li><li>Establish and maintain a scientific network external to the company to advance portfolio projects through collaborations, licensing opportunities and business development.</li>\n</ul>\n<strong>BASIC QUALIFICATIONS:</strong>\n<ul>\n<li>Ph.D. in Neuroscience or related field with 4+ years of postdoctoral training.</li>\n</ul>\n<strong>OTHER QUALIFICATIONS:</strong>\n<ul>\n<li>Established scientific reputation in neuroscience and/or neurodegenerative diseases as evidenced by an outstanding publication record.</li><li>A minimum of three letters of reference from senior scientific mentors and colleagues.</li><li>Expertise in cutting-edge approaches in cell biology, establishment of primary and/or iPSC-derived neuronal cultures, and biochemical and/or cellular assay development.</li><li>Expertise in the use of -omics, bioinformatics, data mining and other approaches to identify and validate targets and pathways.</li><li>Excellent analytical, presentation and writing skills.</li><li>Strong organizational skills that facilitate planning, multitasking and working within timelines.</li><li>Ability to work collaboratively with matrixed, cross-functional teams and to identify and execute key steps necessary to advance projects in a time- and resource-sparing fashion.</li>\n</ul>\nSanofi US Services, Inc. and its U.S. affiliates are Equal Opportunity and Affirmative Action employers committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race; color; creed; religion; national origin; age; ancestry; nationality; marital, domestic partnership or civil union status; sex, gender, gender identity or expression; affectional or sexual orientation; disability; veteran or military status or liability for military status; domestic violence victim status; atypical cellular or blood trait; genetic information (including the refusal to submit to genetic testing) or any other characteristic protected by law.\n<br><br>\n#LI-SA\n<br><br>\nSanofi is dedicated to supporting people through their health challenges. We are a global biopharmaceutical company focused on human health. We prevent illness with vaccines, provide innovative treatments to fight pain and ease suffering. We stand by the few who suffer from rare diseases and the millions with long-term chronic conditions.\n<br><br>\nWith more than 100,000 people in 100 countries, Sanofi is transforming scientific innovation into healthcare solutions around the globe.\n<br><br>\nSanofi, Empowering Life"}