{"job title": "Data Analyst - Tableau", "company": "TrueCar", "city state": "– Santa Monica, CA", "rating": "3.3", "job description": "Job Description:<br><br>ALG has been the industry leader for forecasting residual values, the amount of retained value a vehicle will have at a future date, for over 50 years. Our forecasts are utilized by every manufacturer and most of the top leasing institutions in North America. The data science team at ALG is responsible for building, maintaining and demystifying the prediction algorithms that power these residual value forecasts leveraged so heavily throughout the automotive industry.\n<br><br>\nOur team is accountable for every data point we output and strives to provide industry leading analytics that are accurate and accessible. Right now, we're looking for a Data Analyst to work with automotive data sets and a modern technology stack to create and visualize solutions for some of the biggest data questions OEM's are currently facing. This team member will create transparency for our internal and external data products through data visualization along with analyzing our automotive data lake to help build data driven products. We are a mature and tight knit data science team looking to add another great team member ready to make a difference in the automotive industry. Come join us!\n<br><br>\n<strong>ABOUT THE JOB</strong>\n<ul>\n<li>Build, maintain and iterate on Tableau data visualizations</li><li>Create visual reports in Tableau for internal and external clients that summarize findings clearly and effectively</li><li>Help create visual style that will define the ALG visualization design language</li><li>Collaborate closely with Data Scientists to improve existing visuals and build out new ones</li><li>Collaborate with data engineering teams to insure efficient data pipelines for Tableau Server</li><li>Work with product teams to research and develop the analytics that will power new products</li><li>Own your own data analysis projects from the research phase to production</li><li>Team environment that encourages sharing of ideas to build the best predictive algorithms</li><li>Ad-hoc data analysis and reporting</li>\n</ul>\n<strong>WHAT YOU NEED</strong>\n<ul>\n<li>Enthusiasm for the automotive industry</li><li>A passion for using data visualization to tell complex data stories</li><li>Ability to communicate complex ideas to any audience, ranging from teammates to business executives</li><li>2+ years of professional experience creating Tableau dashboards</li><li>Experience with publishing and maintaining workbooks on Tableau Server</li><li>2+ years of experience with database software (RedShift, Hive, SQL, MYSQL, ...)</li><li>Experience with statistical programming software (Spark, R, Python preferred)</li><li>Experience with data visualizations (Tableau, R, D3, Excel, Power BI, ...)</li><li>Bachelor's Degree in Statistics, Data Science, Economics, CS, Engineering or related field</li>\n</ul>\n<strong>NICE TO HAVE</strong>\n<ul>\n<li>Experience working with automotive data</li><li>Experience with Tableau Server administration</li><li>Proficiency with data oriented programming in Python (numpy, pandas, scikit, ... )</li><li>Master's Degree in Statistics, Data Science, Economics, CS, Engineering or related field</li><li>Some shareable examples of data visualizations you have created</li><li>Love of Fast and Furious franchise</li>\n</ul>\n\nLocation(s): Santa Monica Offices\n<br>\nAssociated topics: data administrator, data analytic, data engineer, data integration, data integrity, data quality, hbase, mongo database, mongo database administrator, teradata"}