{"job title": "DevOps Engineer, Data Applications and Services", "company": "United Technologies Corporation", "city state": "– Brooklyn, NY", "rating": "3.3", "job description": "<strong>Job Description</strong>\n<br><br>\nWe are seeking a highly motivated leader to be a DevOps Engineer, Data Applications and Services to join the United Technologies' Digital Accelerator in Brooklyn, NY. You will play an active role in designing, building, deploying and maintain new Industrial IoT big data pipelines to ingest, transform and persist sensor data to feed into Statistical/Machine Learning models. This role requires a deep understanding of the Hadoop ecosystem with hands-on implementation experience, streaming architectures in Hybrid Environments (both in Cloud and on metal) and CI/CD best practices. As part of this Engineering team, you will be working closely with Software Engineers, Data Engineers, and Data Scientists to deliver well tested, resilient infrastructure as code.\n<br><br>\nYou will have the ability to grow your experience and explore new technologies within our cross-collaboration team setting that is leading this digital transformation. This role will work closely with digital and UTC business unit cross-disciplinary teams, including design, operations, marketing and service delivery teams with a primary focus on the uncovering business value around Data.\n<br><br>\nThis position will provide the unique opportunity to operate in a start-up-like environment within a Fortune 50 company. Out digital focus is geared towards releasing the insights inherent UTC's best-in-class products and services. Together we aim to achieve new levels of productivity by changing the way we work and identifying new sources of growth for our customers.\n<br><br>\nJob Responsibilities\n\n\n<ul>\n<li>Write and develop tools for Continuous Integration across multiple frameworks for Big Data platforms</li>\n<li>Write and develop tools for Continuous Deployment automation in Hybrid environments with a bias towards Docker and Kubernetes</li>\n<li>Create and implement monitoring and alerting solutions</li>\n<li>Developing automation to ensure security and maintain uptime for IoT Data platforms</li>\n<li>Analyze and improve efficiency, scalability, reliability and performance of our Big Data platforms and systems infrastructure at the core of United Technologies</li>\n<li>Manage individual project priorities, deadlines and deliverables.</li>\n<li>Collaborate with other engineers and product management to deliver scalable, resilient and secure solutions</li>\n<li>Ensure the reliability of systems critical to United Technologies users and businesses</li>\n<li>Practice disciplined software engineering (e.g. automated testing, code reviews, and writing beautiful, pragmatic code)</li>\n<li>Actively contribute to team and company standards</li>\n<li>Mentor junior team members</li>\n</ul>\n\nEmployment Type\n<br><br>\nFull time"}