{"job title": "Scientist II (Part Time)", "company": "Universities Space Research Association", "city state": "– Huntsville, US-AL", "rating": "3.3", "job description": "This is a part-time (50%) position and supports the aerosol retrieval algorithms and products on multiple sensors (MODIS, VIIRS, Geostationary, etc.). There are two focus areas: one, the continued development of explicit error budgets for the aerosol retrievals, and two, the application of products to answer science questions.\n<br><br>\n<strong>Essential Duties/Responsibilities:</strong>\n\n<ul>\n<li>Develop explicit error budgets for aerosol retrievals.</li>\n\n<li>Implement error budgets into the operational framework.</li>\n\n<li>Using time series of retrieved aerosol products; develop aerosol processes, trends, and radiative effects.</li>\n\n<li>Manipulate large satellite data sets</li>\n\n<li>Interpret results from radiative transfer calculations.</li>\n\n<li>Prepare research results for publication in reports, papers, journals, books, and other media.</li>\n\n<li>Prepare and deliver major briefings and presentations to various national and international seminars, talks or lectures for dissemination of knowledge, particularly the results of research undertaken.</li>\n\n<li>Responsible for compiling research data results for publication in reports, papers, journals, books and other media and also into cohesive educational outreach presentations.</li>\n\n<li>Act as a mentor for student interns involved in the GESTAR Program. This involves instructing the intern about the nature and extent of the GESTAR program.</li>\n\n<li>Write several publications of considerable interest and value to the field as evidenced by favorable reviews, by citation in the work of others, by presenting papers to professional societies, and/or will have contributed inventions, new designs or research, which are of material significance in the solution of important applied problems.</li>\n\n<li>Preparation of reports of own scientific and other activity for purposes of annual reports to NASA, annual GESTAR report, and self-evaluation for annual performance appraisals.</li></ul>\n\n\n<ul>\n<li>Engage the academic community in research work through research collaborations, visits, invited guests, workshops, conferences, etc.</li></ul>\n\n\n<ul>\n<li>Develop an awareness of NASA’s mission needs and address them to the best of ability.</li>\n\n<li>Maintain an awareness of funding opportunities in area of expertise through internal and external funding agencies; seek and obtain funding to ensure continuation and growth of research efforts.</li>\n\n<li>Complete all trainings as scheduled</li>\n\n<li>Other job related duties as assigned</li>\n</ul>\n<br><br>\n<strong>Required Qualifications:</strong>\n<br><br>\n<strong>Education</strong>:\n<br><br>\nPhD. and experience in Meteorology, Atmospheric Physics, Applied Mathematics, or closely related subject.\n<br><br>\n<strong>Experience:</strong>\n<br><br>\n7 – 10 years of postdoctoral research experience\n<br><br>\n<strong>Knowledge, Skills &amp; Abilities:</strong>\n\n<ul>\n<li>Proficiency in a structured programming language, specifically FORTRAN and IDL.</li>\n\n<li>Experience with scientific analysis of swath and gridded datasets with skills in creating graphical representation of results.</li>\n\n<li>Specific experience analyzing satellite data from the NASA Earth Observing System instruments (e.g., MODIS, MISR, CALIPSO).</li>\n\n<li>Proficiency in running radiative transfer codes and scientific interpretation of the results.</li>\n\n<li>Demonstrated written and oral communication skills for publication/presentation activities.</li>\n\n<li>Lead and/or contribute to proposal writing.</li>\n</ul>\n<br><br>\n<strong>Attributes:</strong>\n\n<ul>\n<li>Strong analytical and problem-solving background.</li>\n\n<li>Strong verbal and written communication skills.</li>\n\n<li>Willingness to learn and improve.</li>\n\n<li>Strong team player.</li>\n</ul>\n<br><br>\n<strong>Working Conditions:</strong>\n<br><br>\nWork will be performed in an office or computer lab environment. While performing the duties of this job, the employee is frequently required to stand; walk; sit; talk or hear. Keyboarding for large time spans each day may be a significant part of this position.\n<br><br>\n<strong>Travel:</strong>\n<br><br>\nNegligible.\n<br><br>\nApplicants should apply to the posting at <strong>https://usracareers.silkroad.com/</strong> and include a letter of interest, resume, or curriculum vita. Review of candidates will begin immediately. Additional information on USRA can be found at <strong>www.usra.edu</strong>.\n<br><br>\nUSRA is an Equal Opportunity Employer Minorities/Females/Protected Veterans/Disabled/Sexual Orientation/Gender Identity<br><br>Required Skills\n<br><br>\n<strong>Required Experience</strong>\n<br><br>\nJob Location\n<br>\nHuntsville, US-AL\n<br>"}