{"job title": "Junior to Mid-level Engineer, Geologist or Environmental Scientist", "company": "Wood", "city state": "– Atlanta, GA", "rating": "3.2", "job description": "Wood Environment &amp; Infrastructure Solutions has an immediate need for a <strong>Junior to Mid-level Engineer, Geologist or Environmental Scientist</strong>. The position will support the Remediation Project Managers. The candidate should be eager to learn and be able to follow specific instructions to execute field tasks safely, accurately and timely.\n<br><br>\n<strong>Key Responsibilities</strong>\n<br><br>\nThe successful candidate will work on a variety of site investigation / remediation / demolition projects at industrial / commercial sites and / or government installations and conduct site assessment for real estate transactions. Duties will include performing routine, well-defined field and office assignments (technical and non-technical) including planning, conducting, and reporting on field investigations and remediation. Work may be conducted under a variety of regulatory programs (CERCLA, RCRA, UST, Brownfields) primarily in southeastern US. Will receive detailed instructions on work objectives, complex features and possible solutions and will receive close supervision and review of work. With experience, may be assigned tasks with minimal supervision. Specific work tasks are expected to include:\n<ul>\n<li><div>Field exploration, inspection, data collection analysis, and interpretation</div></li><li><div>Prepare maps, charts, boring logs, cross-sections depicting subsurface conditions</div></li><li><div>Run simple computer programs</div></li><li><div>Perform field testing using equipment and instrumentation</div></li><li><div>Prepare field reports, internal correspondence, sections of final reports</div></li><li><div>Oversee subcontractors and / or other company employees in the field</div> </li><li><div>Prepare health and safety plans / job hazard analyses and follow company / site safety standards</div></li><li><div>Contact vendors; research literature and regulatory requirements</div></li><li><div>Conduct scientific calculations</div></li>\n</ul>\n<em>Required</em>\n<ul>\n<li><div>B.S. in Engineering, Geology, and / or applicable science</div></li><li><div>Excellent written and verbal communication skills</div></li><li><div>Ability to work independently and as part of a team</div></li><li><div>Strong commitment to safety</div></li><li><div>Basic familiarity with MS Office computer software</div></li><li><div>Ability to conduct basic geological field procedures and techniques</div></li><li><div>Ability to handle multiple assignments and maintain flexibility while meeting strict deadlines</div></li><li><div>Valid Georgia driver's license</div> </li><li><div>A physical exam is required to obtain medical clearance to work on hazardous waste sites</div></li><li><div>Flexibility to travel and work outside normal business hours as required</div></li>\n</ul>\n<em>Preferred</em>\n<ul>\n<li><div>OSHA 40-hr HAZWOPER Training</div></li><li><div>Experience conducting Phase I / II environmental site assessments in accordance with ASTM standards</div></li><li><div>Experience and understanding of various remediation techniques</div></li>\n</ul>\n<strong>Physical Demands</strong>\n<ul>\n<li><div>Physically fit and able to travel to work in the field in potentially difficult terrain and under a variety of weather conditions (cold, heat, wind, rain) as required to accomplish project execution. Able to occasionally lift over 50 pounds and able to wear respirator, if required, to mitigate dust or fumes</div></li>\n</ul>\nWood is a global leader in the delivery of project, engineering and technical services to energy and industrial markets. We operate in more than 60 countries, employing around 55,000 people, with revenues of around $10 billion. We provide performance driven solutions throughout the asset life cycle, from concept to decommissioning across a broad range of industrial markets including the upstream, midstream and downstream oil &amp; gas, power &amp; process, environment and infrastructure, clean energy, mining, nuclear and general industrial sectors. We strive to be the best technical services company to work with, work for and invest in.\n<br><br>\nwww.woodplc.com\n<br><br>\nWe are an equal opportunity employer that recognises the value of a diverse workforce. All suitably qualified applicants will receive consideration for employment on the basis of objective criteria and without regard to the following (which is a non-exhaustive list): race, colour, age, religion, gender, national origin, disability, sexual orientation, gender identity, protected veteran status, or other characteristics in accordance with the relevant governing laws.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}