{"job title": "Environmental Engineer or Scientist 1", "company": "Woodard Curran", "city state": "– Middletown, Connecticut", "rating": "3.1", "job description": "At Woodard &amp; Curran, there's nothing we love more than a tough environmental or engineering challenge. We handle a wide range of water, environmental, and engineering issues-solving complex problems with creativity and tenacity. That's how we make a difference to our clients, people, and planet. Our company was founded on a simple concept: provide a safe and enjoyable place to work with opportunity, integrity, and commitment, and we will attract talented people. Those people are at the heart of our firm, solving some of the most pressing water and environmental challenges for our clients.\n<br><br>\n<strong>Overview:</strong> \n<br><br>\nWe are looking for a motivated scientist/geologist/engineer to join our Environment &amp; Remediation Service Line. If you want to jumpstart your career and expand your skills while working alongside talented experts, then this is the opportunity for you! You will be involved with project work from your first day, working side-by-side with experienced engineers and scientists to help clients address their water and environmental challenges. Exercise your creativity and problem-solving skills in a supportive environment where every perspective is valued. We are a mission-driven organization that puts our people first, with a culture that focuses on providing meaningful work, engaging challenges, recognition, and reward.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nThe individual in this position will assist with environmental/engineering tasks for site investigation and remediation projects. Position responsibilities will support tasks for investigation and remediation projects associated with site cleanup, brownfields redevelopment, and other corrective-action based projects. Duties will include field work (logging soil borings, test pits, and monitoring wells), soil sampling, monitoring well installation and groundwater sampling, surface water and sediment sampling, building material assessment surveys, and remediation/construction and other subcontractor oversight. Other responsibilities will include analytical data evaluation, data management, and preparation of environmental site assessment reports.\n<br><br>\n<strong>Qualifications:</strong>\n\n<ul>\n<li>B.S. or B.A. in Geology, Environmental Science, Engineering, Chemistry, Biology, Natural Resource Management or related field. Master's Degree preferred.</li><li>0-5 years of experience in environmental consulting.</li><li>Excellent writing and communication skills.</li><li>Strong computer skills including Word, Excel, and database software preferred.</li><li>Working knowledge of ArcGIS or CADD software is preferred.</li><li>40-hour OSHA training is a plus.</li>\n</ul>\n\nWoodard &amp; Curran is an Affirmative Action/Equal Opportunity Employer.\n<br><br>\nWoodard &amp; Curran is a Drug Free Work Place.\n<br><br>\nIndividuals with Disabilities and Protected Veterans are encouraged to apply.\n<br><br>\n<strong>PLEASE USE A WEB BROWSER OTHER THAN INTERNET EXPLORER IF YOU ENCOUNTER ISSUES (CHROME, FIREFOX, SAFARI)</strong>"}