{"job title": "Senior Data Scientist", "company": "Cubic", "city state": "– San Diego, CA", "rating": "3.6", "job description": "<strong>Business Unit:</strong>Cubic Transportation Systems<strong>Company Details:</strong>At Urban Insights we’re changing the way people travel – to work, to school, to wherever they want or need to go, and home again. Come join our team of data experts as we build innovative technologies and leverage the latest data science techniques to tackle transportation’s most pressing challenges. As a global company our work impacts the lives of millions of people around the world in cities like London, New York, Sydney, and many more. Urban Insights is the analytics center of excellence for Cubic Transportation Systems, and we are using data to optimize transit networks, reduce road congestion, improve the travel experience, and minimize each city’s carbon footprint.\n<br><br>\nYou will collaborate with a diverse group of talented professionals who are as passionate about their work as you are, and are committed to delivering only the highest quality solutions. We are an agile team and this means you’re empowered to deliver the best results, have the opportunity to influence all aspects of the business, and know that each contribution you make is significant. In an industry where Cubic is a world leader, we’re driving a paradigm shift in how transportation services are planned, delivered, and consumed to better meet the needs of an increasing and ever-more concentrated urban population. Don’t take a backseat. Join Urban Insights and be instrumental in driving the future of travel.\n<br><br>\n<strong>Perks</strong>\n\n\n<ul>\n<li>A culture that respects work-life balance and individual work styles</li>\n<li>We offer medical, dental and vision insurance, disability and life insurance options, and 401K Retirement Plan with a company match. Employees can also take advantage of a generous tuition reimbursement program and enjoy a 9/80 work schedule and Paid Time Off.<strong>Job Details:</strong><br><br>We are currently looking to bring another committed innovator onto our team to help deliver a highly scalable analytics solution. This solution will serve hundreds of organizations across the globe.</li>\n\n</ul>\n\n\n<ul>\n<li>Works with and advises the data science team and stakeholders to address business challenges by harnessing structured, semi-structured, and unstructured data in a distributed processing environment.</li><li>Designs, develops and programs methods, processes, and systems to consolidate and analyze unstructured, diverse data sources to generate actionable insights and solutions for client services and product enhancement.</li><li>Designs, implements, and maintains statistical models representing transportation network behavior and other transportation related processes.</li><li>Develops and codes software programs, algorithms and automated processes to cleanse, integrate and evaluate large datasets from multiple disparate sources.</li><li>Researches, interprets, and identifies use cases for applying data science techniques against public transportation data.</li><li>Prepares and delivers presentations that effectively describe complex quantitative methods in clear and concise communications.</li><li>Keeps up to date with technical as well as industry developments, analytics software/tools, trends, and recognized best practices.</li><li>Contributes to projects under the direction of project and product owners to adhere to funding, resourcing, schedule, and other constraints.</li>\n</ul>\n​\n<br><br>\n<strong>Technologies we use:</strong>\n<ul>\n<li>Azure cloud and services</li><li>R, Python</li><li>Tableau</li><li>PowerBI</li><li>Angular 2</li><li>Spring Framework</li>\n</ul>\nIf you’re motivated to harness the power of data to improve the lives of millions of travelers and can check many of the boxes above, let's talk.\n<br><br>\n<strong>Minimum Job Requirements:</strong>\n<br><br>\nFour-year college degree, in statistics, economics, physics, mathematics, operations research, computer science, data engineering, or related field, Masters or Ph.D. preferred. At least six years of related experience using data mining, data modeling, data integration, machine learning, statistical modeling, and other data science skills and techniques. Experience with Python or comparable scripting language. Experience working with Hadoop, Pig, Hive, and knowledge of SQL is essential. Experience with statistical and analytic programming design and technologies such as R and other simulation / data analysis tools. Knowledge of database management systems and other software tools used to manage an organization’s business activities. Requires fundamental knowledge and experience developing algorithms and analytics applications. Must have strong analytical and problem solving skills, attention to details, critical thinking ability, and creativity. Must be able to abstract from ambiguous and sometimes conflicting information to identify opportunities for improvement and the critical business drivers and factors that influence outcomes. Must have demonstrated ability to produce high quality analytics applications that can be deployed in a repeatable and scalable fashion. Requires strong knowledge of statistics, signal processing, machine learning, predictive analytics, and other related techniques. Must have excellent written and verbal communication skills used to effectively communicate and present complex information in terms appropriate to the audience. Incumbent will have well-developed research skills and knowledge of current data management principles, procedures, and other tools of the trade. Must be able to manage and prioritize multiple projects simultaneously while balancing according to scope, budget and schedule. Prior experience working in the transportation or logistics industries desired.<br><br><strong>Worker Type:</strong>Employee"}