{"job title": "Sr. Machine Learning Scientist", "company": "Expedia", "city state": "– Bellevue, Washington", "rating": "3.8", "job description": "Expedia<br><br>Are you inspired by the idea of solving real world problems with advanced machine learning methods, at one of the largest online travel companies in the world? If so, wed like to hear from you!\n<br><br>\nExpedias Data Science team helps power many of the features on our website. We design and build models that help our customers find what they want and where they want to go. As a member of our group, your contributions will affect millions of customers and will have a direct impact on our business results. You will have opportunities to collaborate with other talented data scientists and move the business forward using novel approaches and rich sources of data. If you want to resolve real-world problems using state-of-the-art machine learning and deep learning approaches, in a stimulating and data-rich environment, lets talk.\n<br><br>\nWe are looking for Machine Learning Scientist whos passionate about machine learning, model building, and analysis to help us with ongoing projects in search, geography, image processing, and NLP. In this position, you will design, prototype, and analyze data-driven models that support prominent features on the web sites of many Expedia brands. We work on a variety of projects such as query auto-completion, free-text search, automatic image moderation, and duplication of geographic entities at scale.\n<br><br>\nYou will work closely with our product teams to understand business requirements, and you will apply your knowledge, experience, and creativity to build models that can be integrated into our engineering teams software environments for A/B testing and production. This is a fantastic opportunity to enhance the experience of Expedia customers all over the world.\n<br><br>\n<strong>Requirements:</strong>\n<ul>\n<li>PhD (preferred), or MS/BS plus equivalent experience in a quantitative field like computer science, engineering, or statistics.</li><li>Deep understanding of linear algebra, probability, statistics, and machine learning theory.</li><li>Hands-on experience with machine learning algorithms, such as logistic regression, random forest, gradient boosting, support vector machines, and neural networks.</li><li>Excellent command of Python and related ML libraries (pandas, scikit-learn, etc.).</li><li>Facility with SQL-like query languages to do data extraction, transformation, and loading.</li><li>Ability to develop practical and novel models to resolve open problems.</li><li>Ability to understand a business problem, identify the key challenges, formalize the problem, and prototype solutions.</li><li>Passion for solving interesting and meaningful problems using principled techniques and practices.</li><li>Strong attention to detail.</li><li>Ability and willingness to document, synthesize, and communicate technical results.</li><li>Collaborative mindset for thinking through ambiguous problems with others.</li><li>Based in or willing to relocate to Chicago or Bellevue.</li>\n</ul>\n<strong>Nice to Have:</strong>\n<ul>\n<li>Expertise in NLP techniques and approaches a huge plus.</li><li>Experience with large data sets in a distributed computing environment such as Hadoop or Spark.</li><li>Ability to code in at least one additional programming language, for example Java or C++.</li>\n</ul>\n*LI-CS1<br><br>Expedia is committed to creating an inclusive work environment with a diverse workforce. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. This employer participates in E-Verify. The employer will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS) with information from each new employee's I-9 to confirm work authorization."}