{"job title": "Movidius Deep Learning Data Scientist", "company": "Intel", "city state": "– Santa Clara, CA", "rating": "3.8", "job description": "<ul>\n<li>*Job Description**</li>\n</ul>\n\nSenior Engineer Realtime Deep Learning\n<br><br>\nWe are looking for a Deep Learning expert to join our growing Movidius team within Intel's AI Product Group!\n<br><br>\n<strong>In this role, you will:</strong>\n<br><br>\nBuild machine learning-based products/solutions, which provide descriptive, diagnostic, predictive, or prescriptive models based on data.\n<br><br>\nUse or develop machine learning algorithms, such as supervised and unsupervised learning, deep learning, reinforcement learning, Bayesian analysis and others, to solve applied problems in various disciplines such as Data Analytics, Computer Vision, Robotics, etc.\n<br><br>\nComplete programming, testing, debugging, documentation and/or deployment of the solution/products.\n\n\n<ul>\n<li>*Qualifications**</li>\n</ul>\n\n<strong>Minimum Qualifications:</strong>\n<br><br>\nMS or PhD in CS or a field related to Artificial Intelligence.\n<br><br>\n5+ years of industry experience with at least 2 years focused on Machine Learning / Deep Learning.\n<br><br>\nStrong math background particularly in optimization theory and stochastic algorithms. Hands on experience with at least one of the following tools: Caffe, Torch, TensorFlow, Theano, or similar.\n<br><br>\n<strong>Preferred Qualifications:</strong>\n<br><br>\nStrong practical knowledge of state of the art real-time embedded deep learning techniques: - network design - compression - network sparsity - attention / selective execution\n<br><br>\nSignificant experience in Deep Learning with academic and industrial track record\n<br><br>\nGood understanding of CNNs, RNNs, reinforcement learning, supervised and unsupervised learning.\n<br><br>\nExcellent written and verbal communication skills. Strong programming skills.\n\n\n<ul>\n<li>*Inside this Business Group**</li>\n</ul>\n\nIntel AI, leveraging Intel's world leading position in silicon innovation and proven history in creating the compute standards that power our world, is transforming Artificial Intelligence (AI) with the Intel AI products portfolio. Harnessing silicon designed specifically for AI, end to end solutions that broadly span from the data center to the edge, and tools that enable customers to quickly deploy and scale up, Intel AI is inside AI and leading the next evolution of compute.\n\n\n<ul>\n<li>*Posting Statement.** Intel prohibits discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status.</li>\n</ul>"}