{"job title": "Director, NLP Data Scientist", "company": "KPMG", "city state": "– Seattle, WA", "rating": "3.8", "job description": "Director, NLP Data Scientist\n\n\n<ul>\n<li>*Chicago, Illinois**</li>\n<li>*Requisition #:** 34314</li>\n<li>*Practice Area:** Business Support Services</li>\n<li>*Location:** Irvine, CA; Denver, CO; Washington, DC; Atlanta, GA; Chicago, IL; New York, NY; Seattle, WA</li>\n</ul>\n\nInnovate. Collaborate. Shine. Lighthouse ? KPMG's Center of Excellence for Advanced Analytics ? has both applied data science, AI, and big data architecture capabilities. Here, you?ll work with a diverse team of sophisticated data and analytics professionals to explore the solutions for clients in a platform-diverse environment. This means your ability to find answers is limited only by your creativity in leveraging a vast array of techniques and tools. Be a part of a high-energy, diverse, fast-paced, and innovative culture that delivers with the agility of a tech startup and the backing of a leading global consulting firm. For you, that translates into the chance to work on a wide range of projects ? covering technologies and solutions from AI to optimization ? and the power to have a real impact in the business world. So, bring your creativity and pioneering spirit to KPMG Lighthouse.\n<br><br>\nKPMG is currently seeking a Director to join our- Center of Excellence for Advanced Analytics.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\n+ Develop innovative data science solutions for Fortune 500 clients that utilize natural language processing, optimization, machine learning, econometric and/or Bayesian modelling, while working across a diverse range of domains such as risk management, product development, marketing research, supply chain, and public policy\n<br><br>\n+ Utilize a hypothesis-driven problem-solving approach to design, construct and rapidly test/iterate exploratory analyses that will reveal insight and opportunities for the client\n<br><br>\n+ Utilize a variety of rich variety of data sources such as web data, internal/external documents, emails, financial, transactional, sales, and operational data; identify, review, and integrate data sources and classify the appropriate technologies (SQL, NoSQL, HDFS, S3, Lucene) to store the data\n<br><br>\n+ Stay up to date on research and industry trends, and identify technical areas for opportunity and lead innovation projects that demonstrate value; educate internal and external clients through workshops, and present at conferences, seminars, courses, and training events\n<br><br>\n+ Plan, direct, and build analytics solutions with a team of data science, big data engineers, consultants, and visualization experts; utilize a variety of big data technologies and analytics tools as deemed appropriate and as required by the client; be hands-on as needed to achieve project delivery\n<br><br>\n+ Provide SME support to projects through supporting brainstorming, project scoping, technical approach creation, and technical quality review, while helping manage technical risks, and blockers helping to ensure successful delivery; document approach and underlying design decisions\n<br><br>\n<strong>Qualifications:</strong>\n<br><br>\n+ A minimum of ten years of relevant experience and expert knowledge on the technical side of natural language processing (NLP), and previous experience in artificial intelligence (AI)\n<br><br>\n+ Master's degree from an accredited college/university in Computer Science, Statistics, Mathematics, Engineering, Econometrics, or related fields, PhD is preferred\n<br><br>\n+ Proficiency in programming languages (e.g. R, Python, Java, Scala) and ability to deploy tools in a Linux environment; broad understanding of databases (e.g. SQL, NoSQL, Lucene, Mongo), and high-performance or distributed processing (e.g. Hadoop, Spark)\n<br><br>\n+ Ability to translate engagement objectives to a project plan with milestones, and resource/technology requirements, and teach, lead, and manage projects to successful execution\n<br><br>\n+ Ability to work across multiple engagements with clients to assess needs, provide assistance, and resolve problems, using structured problem solving and communication to both technical and non-technical audiences\n<br><br>\n+ Ability to travel up to eighty percent of the time. Must be legally authorized to work in the United States without sponsorship of a VISA.\n<br><br>\nKPMG LLP (the U.S. member firm of KPMG International) offers a comprehensive compensation and benefits package. KPMG is an equal opportunity employer. All qualified applicants are considered for employment without regard to race, color, creed, religion, age, sex/gender, national origin, ancestry, citizenship status, marital status, sexual orientation, gender identity or expression, disability, physical or mental handicap unrelated to ability, pregnancy, veteran status, unfavorable discharge from military service or military status, genetic information, genetic disposition and or carrier status, domestic violence status, personal appearance, family responsibility, matriculation or political affiliation, status with regard to public assistance, or other legally protected status. KPMG maintains a drug-free workplace. KPMG will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of applicable local, state or federal law (including San Francisco Ordinance number 131192). No phone calls or agencies please.\n\n\n<ul>\n<li>*Our Benefits**</li>\n<li>*Health**</li>\n</ul>\n\nKPMG offers a range of medical insurance options to meet your needs as well as prescription drug coverage, health care flexible spending accounts, and dependent day care flexible spending accounts.\n\n\n<ul>\n<li>*Personal Time Off (PTO)**</li>\n</ul>\n\nUp to 30 PTO Days per year (depending on job classification/level/years of service).\n\n\n<ul>\n<li>*Financial**</li>\n</ul>\n\n+ 401(k) and Pension Plans\n<br><br>\n+ Dependent Care Flexible Spending Account\n<br><br>\n+ Health Care Flexible Spending Account\n<br><br>\n+ Mortgage Assistance Program\n<br><br>\n+ HomeBenefits@Work Program\n<br><br>\n+ Hyatt Legal Plan\n\n\n<ul>\n<li>Benefits vary by employment status.</li>\n</ul>"}