{"job title": "Genomics Data Scientist", "company": "Monsanto", "city state": "– Saint Louis, MO", "rating": "4.0", "job description": "Bayer is seeking a\n<br><br>\nhighly motivated Genomics Data Scientist to become an integral\n<br><br>\nmember of the Global Breeding Genetic Modeling and Simulation team. This role\n<br><br>\nwill be responsible for development and implementation of methods that combine\n<br><br>\nstatistical modelling and genomic datasets for phenotype-to-genotype analytics\n<br><br>\nto further precision breeding for tomorrow?s crops.\n<br><br>\nYou will have access to state of the art analytics\n<br><br>\nplatforms, simulation platforms, historical testing data, genomic and phenomic\n<br><br>\ndatasets, and a field testing network. Establishing key relationships and\n<br><br>\nnetworks across Breeding, Biotechnology, and R&amp;D IT is critical. The\n<br><br>\noutcomes of this work should significantly impact the future design of ongoing\n<br><br>\nbreeding programs including pipeline architecture, population selection, field\n<br><br>\ntesting strategies, and advancement decisions.\n\n\n<ul>\n<li>*Responsibilities:**</li>\n</ul>\n\n+ Develop methods and perform analysis that connectgenotypes and haplotypes to desired traits in row crop products.\n<br><br>\n+ Develop strategies to fully leverage genomic insightsin breeding decisions.\n<br><br>\n+ Key contributor to creation of a database of Monsanto?saccumulated germplasm knowledge for breeding decisions\n<br><br>\n+ Key contributor to development, with R&amp;D IT, ofinternal tools to facilitate both large scale and customgenotype-to-phenotype analytics\n<br><br>\n+ Key contributor to breeding collaborations on geneediting and genome design\n\n\n<ul>\n<li>*Minimum Qualifications:**</li>\n</ul>\n\n+ PhD in Quantitative Genetics, Statistics, EvolutionaryBiology, Population Genetics, Genomics, Systems Biology, ComputationalBiology, Applied Mathematics, or related field of study\n<br><br>\n+ Strong problem solving and critical thinking skills\n<br><br>\n+ Working knowledge of complex trait genetics\n<br><br>\n+ Proficiency working with very large data sets and highperformance computing\n<br><br>\n+ Demonstrated fluency with Python and/or R\n<br><br>\n+ Experience presenting results to varied audiences &amp;influencing project direction/strategy\n<br><br>\n+ Excellent interpersonal skills and the ability to workeffectively in a team-based and cross-functional team environment.\n\n\n<ul>\n<li>*Preferred Qualifications:**</li>\n</ul>\n\n+ Experience with cloud based computing on AWS\n<br><br>\n+ Proficiency in Machine learning algorithms and concepts\n<br><br>\n+ Experience building relational or graph databases\n<br><br>\nBayer successfully completed the acquisition of\n<br><br>\nMonsanto in June 2018, bringing together Monsanto?s leadership in seeds and\n<br><br>\nplant traits with Bayer?s leadership in chemical and biological crop\n<br><br>\nprotection. By joining forces, we will create even more extensive career\n<br><br>\nopportunities for talent around the world. We?re a global team working to shape\n<br><br>\nagriculture through breakthrough innovation that will benefit farmers,\n<br><br>\nconsumers, and our planet.\n<br><br>\nWhile\n<br><br>\nwe are now Bayer, we will continue to hire using separate career sites until we\n<br><br>\ncan integrate our career platforms. We invite you to explore the career\n<br><br>\nopportunities available at the combined company by visiting advancingtogether.com/careers .\n\n\n<ul>\n<li>*Organization:** _GLB Breeding - Analytics &amp; Pipeline Des_51190876_</li>\n<li>*Title:** _Genomics Data Scientist_</li>\n<li>*Location:** _North America-USA-Missouri-St. Louis_</li>\n<li>*Requisition ID:** _01RPZ_</li>\n<li>*Job:** _Research &amp; Development_</li>\n<li>*Schedule:** _Full-time_</li>\n</ul>\n\nAt Monsanto, we value a diverse combination of ideas, perspectives and cultures. All qualified applicants will receive consideration for employment without regard to, among other things, race, religion, color, national origin, age, sex, sexual orientation, gender identity, gender expression, status as a protected veteran, or status as a qualified individual with a disability. If you need a reasonable accommodation to access the information provided on this website, please for further assistance.access our disability accommodations process\n<br><br>\nU.S. Employment Law (applicable for U.S. jobs ONLY): EEO Employer Minorities/Females/Protected Veterans/Disabled. For information about equal employment opportunity rights, please refer to this information from the U.S. federal government: ; .\n<br><br>\nEEOC PosterEEOC Supplement"}