{"job title": "Senior Data Scientist", "company": "The Aerospace Corporation", "city state": "– El Segundo, CA, US, 90245", "rating": "3.5", "job description": "<strong>Requisition ID: 43033</strong>\n<br><br>\n<strong>All Locations:</strong> El Segundo, CA (California)\n<br><br>\nA trusted partner. A national resource. A leader in national security space. We are THE Aerospace Corporation. A team that takes pride in our readiness to solve some of the most complex technical challenges in existence. With challenges spanning government to commercial, you’ll have the unique opportunity to work on projects that are literally evolving our nation's space and launch capabilities. We all share a common passion and aspiration – to serve a mission much bigger than ourselves. When you join our team, you’ll be part of a rare collection of thought leaders and game-changing innovators. Are you ready to launch your career?<br>\n<div><strong>Responsibilities</strong>\n<br><br>\nThe Guidance and Control Subdivision provides engineering support to programs across all areas of spacecraft, launch vehicle, and UAS/drone guidance and control. We do analysis, modeling and simulation, hardware design, build and test, research and experimentation. The subdivision has two laboratories, the Mechatronics Research Laboratory and the Embedded Systems Application Center.\n<br><br>\n<strong>Key Functions</strong>\n\n<ul>\n\n\t<li>Structure and execute strategic and organizational initiatives by developing work plans, gathering and synthesizing relevant data, leading analyses, and developing recommendations</li>\n<li>Coordinate technology roadmaps that enable new technologies and their capabilities</li>\n<li>Provide clear and concise oral and well-written communications in a timely and consistent manner</li>\n<li>Lead adaptation of organizational analytics platforms for data collaboration and analysis</li>\n<li>Build and iteratively prototype analytical solutions to provide new insights</li>\n<li>Develop forecasting, and optimization methods to illuminate actionable insights</li>\n<li>Lead or coordinate cross-organizational teams across program/project lines</li>\n<li>Provide ongoing technical consultation and advice to management, in area of specialization and other areas aligned with organizational goals as specified by management</li>\n<li>Take initiative to inform management of perceived technical problems and recommend courses of action</li>\n<li>Act as senior technical authority, consultant, primary investigator, or team leader</li>\n<li>Establish and maintain effective working relationships with customers and management</li>\n</ul>\n<strong>Qualifications</strong>\n<br><br>\n<strong>Required</strong>\n\n<ul>\n\n\t<li>Bachelor’s degree or higher in computer science, computer engineering, data science, or related technical field, typically with 12 or more years of experience in science and technology related projects or research</li>\n<li>Experience leading teams to propose, develop and provide analytical solutions for customers in various engineering, research and business initiatives</li>\n<li>Experience troubleshooting problems involving process and workflow by exercising strong cross-cutting organizational skills</li>\n<li>Experience conducting and synthesizing quantitative and qualitative research through customer and industry trends analysis, stakeholder surveys, interviews and observation</li>\n<li>Current and active Secret security clearance</li>\n</ul>\n<strong>Preferred</strong>\n\n<ul>\n\n\t<li>An advanced degree in science, engineering, or related discipline</li>\n<li>Ability to design, author, and receive a U.S. Patent in science and technology</li>\n<li>Experience in authoring professional papers and books in scientific disciplines</li>\n<li>Familiarity with strategic planning and project management tools</li>\n<li>Understanding of FFRDCs for developing science &amp; technology research</li>\n<li>4 or more years’ experience in application of statistical and predictive modeling</li>\n<li>Experience in use of open source and commercial tools for collecting data from various sources and services (RDBMS, CUBES, XML, JSON, etc.)</li>\n<li>Familiarity with Amazon, Google, and Azure Web Services for data analytics</li>\n<li>Experience in fuzzy matching and neural network methods and models</li>\n<li>Strong analytical and creative problem-solving skills</li>\n<li>Participation in extracurricular activities related to data science (teaching, lectures, etc.)</li>\n<li>2 or more years’ experience with Alteryx and Tableau for data preparation and visualization</li>\n</ul>\n<strong>Transcript Requirement</strong>\n<br><br>\nNone</div>\n<br><strong>Additional Requisition Details</strong>\n<br><br>\n<strong>Clearance Requirement:</strong> Top Secret\n<br><br>\n<strong>Access:</strong> SCI\n<br><br>\n<strong>Polygraph:</strong> None\n<br><br>\n<strong>Relocation Available:</strong> Yes\n<br><br>\n<strong>Employment Type:</strong> Regular\n<br><br>\n<strong>Work Schedule:</strong> Full Time\n<br><br>\n<strong>Company Statement</strong>\n<br><br>\nThe Aerospace Corporation has provided independent technical and scientific research, development, and advisory services to national security space programs since 1960. We operate a federally funded research and development center (FFRDC) for the United States Air Force and the National Reconnaissance Office, and support all national security space programs. We also apply more than 50 years of experience with space systems to provide critical solutions to technologically complex systems in such areas as communications, shipping, law enforcement, and cyber, among others.\n<br><br>\nFrom our inception, our highly skilled technical staff has focused on ensuring the success of every mission and developing the most effective and economic space-related hardware and software in the world. Our greatest asset is the technical expertise of our people. Our state-of-the-art laboratory facilities are staffed by some of the leading scientists in the world.\n<br><br>\n<strong>Equal Opportunity Commitment</strong>\n<br><br>\nThe Aerospace Corporation is an Equal Opportunity/Affirmative Action employer. We believe that a diverse workforce creates an environment in which unique ideas are developed and differing perspectives are valued, producing superior customer solutions. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, age, sex (including pregnancy, childbirth, and related medical conditions), sexual orientation, gender, gender identity or expression, color, religion, genetic information, marital status, ancestry, national origin, protected veteran status, physical disability, medical condition, mental disability, or disability status and any other characteristic protected by state or federal law. If you’re an individual with a disability or a disabled veteran who needs assistance using our online job search and application tools or need reasonable accommodation to complete the job application process, please contact us by phone at 310.336.5432 or by email at ieo.mailbox@aero.org. You can also review The Equal Employment Opportunity is the Law poster and the supplement, as well as the Pay Transparency Policy Statement.\n<br><br>\n<strong>Nearest Major Market:</strong> Los Angeles\n<br>\n<strong>Job Segment:</strong> \n<br>\n Database, Scientific, Scientist, Engineer, Developer, Engineering, Technology, Science"}