{"job title": "Data Analyst in Excel 3 month contract -", "company": "ADECCO", "city state": "– Baytown, Texas", "rating": "3.3", "job description": "is currently assisting a local client in their search to fill a Data Analyst role in Baytown TX!\n\n\n<ul>\n<li>*Must be eligible to work for any employer in the U.S. without sponsorship / no corp to corp or 3rd party contracting arrangement / Adecco W2 only.</li>\n</ul>\n\nJob Title: Data Analyst\n<br>\nLocation: Baytown, TX\n<br>\nStart Date: 10/08/2018\n<br>\nDuration: 01/31/2019\n<br><br>\n<strong>MAIN FUNCTIONS</strong>\n<br><br>\nResponsible for importing, cleansing, validating and analyzing data with the purpose of understanding or drawing conclusions from the data. May consolidate and/or present data in charts, graphs, or tables. Focused on improving data quality. Position will receive direction and support. This position level would typically include junior Data Analyst performing mostly tasks that do not require prior extensive experience.\n<br><br>\n<strong>SKILLS AND QUALIFICATIONS</strong>\n<br><br>\nStrong analytical, verbal and written communication skills. Report generation and data analysis. Proficient in MS Office.\n<br><br>\nStrong analytical, verbal and written communication skills. Proficient in MS Office specifically Excel.\n<br><br>\nSAP knowledge preferred but not required, data entry, importing, cleansing, validating and analyzing data.\n\n\n<ul>\n<li>*Successful completion of a full background check, drug screening, employment and education verification required upon offer.</li>\n</ul>\n\nHow to Apply: Click on Apply Now to be considered for this position or any other opportunities with Adecco.\n<br><br>\nIMPORTANT: This position is being recruited for by Adeccos National Recruitment Center, not your local Adecco Branch Office. To be considered for this position, you must use the apply now button to submit your resume. If you have questions about the position, you may contact the recruiter recruiting for this position listed above. For other opportunities available at Adecco go to www.adeccousa.com.\n<br><br>\nIf you have any questions surrounding the application process, please feel free to reach out to: Melody Meyer - Melody.Meyer@adeccona.com\n<br><br>\nThe Adecco Group is a global leader in HR services. Our group connects over 700,000 associates with our business clients each day through our 6,600 offices in over 70 countries and territories around the world. We offer employment opportunities at any stage in your professional career. Contact us today to discuss available contract and direct hire positions. Adecco Group provides one of the most comprehensive benefits packages in the industry to contract workers to include Holiday, 401(k), and Insurance Benefit Plans.\n<br><br>\nEqual Opportunity Employer Minorities/Women/Veterans/Disabled"}