{"job title": "Data Analyst / Client Support and DevOps 2 year contract", "company": "Blueline Consulting, LLC", "city state": "– Madison, WI", "rating": "NA", "job description": "<strong>2 Year Contract for Healthcare Data Analyst with SQL skills, learn ETL and Python on the fly!</strong> \n<br><br>\n<strong>Cutting Edge Healthcare technology: find bay area culture in Madison, WI, best of both worlds!</strong>\n<br><br>\nThe SQL Data Analyst / DevOps role is to analyze Healthcare Data and Research data from various sources. This position is a critical member of a team, building state of the art healthcare applications This position will be responsible for validating, testing, querying and analyzing data using MS SQL / Oracle, and other tools for generating reports using but not limited to, MS SQL SSRS, Excel Macros, SAS Reports, etc. Learn ETL processes in the environment learning for other leaders, along with Python scripting and Linux scripting.\n<br><br>\n<strong>What the role involves (Responsibilities)</strong>\n\n\n<ul>\n<li>Assume role of data analysis scripting with Python; work on a team focused on data exploration, validation, optimization and troubleshooting. SQL Querying skills are a must with the data analysis skills, scripting exposure is important.</li> \n\n<li>Analyze regulatory and business requirements, specifically for Medical data and prospective</li>\n\n<li>Analyze data from Medicare and Medicaid and oversee and quality assure implementation of content into database tables</li>\n\n<li>Assist in analyzing and querying multiple, complex databases and systems to produce data sets for external review and analysis.</li>\n\n<li>Assist in software database quality assurance and testing</li>\n\n<li>Work cross-functionally with client service teams to resolve inquiries regarding the software, including payment policy and product functionality</li>\n\n<li>Identify and work with technical writing to make changes to end user documentation.</li>\n\n<li>Develop and maintain proficiency in Medicare and other public reimbursement-related data such as claims data for various health care products and services.</li>\n\n<li>Develop and maintain proficiency in the Companys products (software, data) and services</li> \n</ul>\n\n#ssis #etl #t-sql #sqlengineer #python #linux #healthcaretechnology\n<br>"}