{"job title": "BIOINFORMATICIAN DATA ANALYST / DAY / 40 HRS / BWH NEUROLOGY", "company": "Brigham &amp; Women's Hospital(BWH)", "city state": "– Boston, Massachusetts", "rating": "3.9", "job description": "A bioinformatics data analyst position is available in the laboratory of Howard Weiner and will also work closely with Nathalie Pochet at Brigham and Woman's Hospital, Harvard Medical School. The Weiner laboratory studies the immunologic mechanisms of neurodegenerative diseases with the ultimate goal of identifying novel therapeutic targets, as well as has several investigations relating to basic immunology and the microbiome. We utilize a range of genomic tools in order to analyze in vitro and in vivo experimental models and human samples. The Weiner lab is a highly collaborative environment studying multiple diseases, including multiple sclerosis, Alzheimer's disease, glioblastoma, and traumatic brain injury. The applicant would interface with the group by analyzing gene expression and microbiome data related to these disorders. Strong computational, organizational, and communication skills are desired for this position.\n<br><br>\n<strong>Qualifications</strong>\n<br>\n<strong>PRINCIPAL DUTIES AND RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>Analyze and integrate antigen array, phospho array, metabolomics, RNA-Seq</li>\n</ul>\n\nand ChIP-Seq data\n\n\n<ul>\n<li>Preform complete data validation and error detection; ensuring data security,</li>\n</ul>\n\nintegrity measures are met. Discuss with researchers to discuss results,\n<br>\nanalysis direction prior to project.\n\n\n<ul>\n<li>Maintaining an active role in research of the current trends in analysis</li>\n</ul>\n\nmethods, programming algorithms and using new technologies to prototype\n<br>\nfuture developments\n\n\n<ul>\n<li>Contribute in the preparation of scientific methods for manuscripts detailing</li>\n</ul>\n\nmethods and design; Presentations of results or new tools for the department.\n\n\n<ul>\n<li>Performs all other duties/responsibilities as directed.</li>\n</ul>\n\n<strong>QUALIFICATIONS:</strong>\n\n<ul>\n <li>Bachelors required.</li>  <li>MSc or PhD in Computer Science, Mathematics in a biological science or relevant field recommended.</li>  <li>Applicants will have 3+ years of programming experience developing software solutions for computational, biological or engineering problems. Understanding of agile development method preferred.</li> \n</ul>\n\n<strong>SKILLS/ABILITIES/COMPETENCIES REQUIRED:</strong>\n\n\n<ul>\n<li>Good organizational skills, detail oriented</li>\n<li>Ability to apply statistical and machine learning techniques to solve 'big data'</li>\n</ul>\n\nproblems\n\n\n<ul>\n<li>Experience in Programing with MATLAB, R, Python and/or Java that focus on</li>\n</ul>\n\ncomputational biological applications.\n\n\n<ul>\n<li>Experience with common bioinformatics and genomic browsers [NCBI,</li>\n</ul>\n\nGenbank, UCSC\n\n\n<ul>\n<li>Understanding the user of bioinformatics tools including common NGS tools</li>\n</ul>\n\n[BWA, samtools, GATK]\n\n\n<ul>\n<li>Ability to work in a highly collaborative and intellectually challenging</li>\n</ul>\n\nenvironment.\n\n\n<ul>\n<li>Ability to demonstrate professionalism</li>\n<li>Ability to demonstrate critical thinking and creative problem-solving abilities as</li>\n</ul>\n\nwell as excellent oral and written communication skills.\n\n\n<ul>\n<li>Ability to prepare manuscripts for presentation and publication</li>\n<li>Must work independently</li>\n<li>Excellent oral and written communication skills.</li>\n</ul>\n\n<strong>WORKING CONDITIONS:</strong>\n<br>\n<br>\nNormal Office Lab Environment\n<br><br>\n<strong>SUPERVISORY RESPONSIBILITY:</strong>\n<br>\n<br>\nNone Required\n<br><br>\n<strong>FISCAL RESPONSIBILITY:</strong>\n<br>\n<br>\nNone Required\n<br><br>\n<strong>EEO Statement</strong>\n<br>\nBrigham and Women's Hospital is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, sex, sexual orientation, gender identity, national origin, ancestry, age, veteran status, disability unrelated to job requirements, genetic information, military service, or other protected status.\n<br><br>\nPartner's Healthcare is acting as an Employment Agency in relation to this vacancy."}