{"job title": "Tableau Developer/Data Analyst", "company": "Brookdale Senior Living", "city state": "– Brentwood, TN", "rating": "2.7", "job description": "Full Time\n<br><br>\nTableau Developer/Data AnalystTableau Developer/Data Analyst\n<br><br>\nBrookdale Corporate Office - Brentwood, TN 37027\n<br><br>\nJob #: DACObreTN64856a\n<br><br>\nThis is a full-time permanent role, based out of our corporate offices in Brentwood, TN. Relocation assistance may be available.\n<br><br>\nBrookdale. Bringing new life to senior living.\n<br><br>\nJob Summary\n<br><br>\nYou will be part of a small and talented Enterprise Reporting team. This team is responsible for providing reporting solutions for the entire organization. As a member of this group you'll be responsible for creating reports/dashboards that provide actionable insights and support business process. This position focuses heavily on analytical skills while identifying resolutions and performing detailed reporting. Please note, this is a full-time, permanent role, based out of our corporate offices in Brentwood, TN. Candidate must reside in the area or be willing to relocate to the greater Nashville, TN area. Relocation assistance may be available.\n<br><br>\nResponsibilities and Duties\n\n\n<ul>\n<li>Conduct stakeholder interviews to determine business problems</li>\n<li>Document business requirements</li>\n<li>Dashboard / report design</li>\n<li>Collaboration with data group for identifying data/ETL needs</li>\n<li>Report/Dashboard development using Tableau and other reporting tools</li>\n<li>Attending daily stand-ups</li>\n<li>Demo product to stakeholders</li>\n<li>Facilitate User Acceptance testing</li>\n<li>Production support</li>\n<li>Support Tableau analysts embedded in the business</li>\n</ul>\n\nRequired Experience, Skills and Qualifications\n\n\n<ul>\n<li>Bachelor's degree in Information Systems, Computer Science or related field is preferred, a minimum of two to four years related IT or business related experience, or equivalent combination of education and experience</li>\n<li>2 or more years of experience as a data analyst/ report developer</li>\n<li>Solid experience with Tableau Design and Development</li>\n<li>Sound database knowledge / SQL coding skills</li>\n<li>Experience with other reporting tools such as SSRS or Jasper</li>\n<li>Experience designing and creating dashboards and reports</li>\n<li>Tableau Administration a plus</li>\n<li>Tableau Certification a plus</li>\n<li>Good communication skills</li>\n<li>Ability to work with multiple stakeholder for requirement gathering and User Acceptance testing</li>\n<li>Ability to tell a story with data</li>\n<li>Strong creative skills / UI design</li>\n<li>Agile experience a plus</li>\n</ul>\n\nBrookdale is an EOE-(Equal Opportunity Employer) and drug-free workplace.\n<br><br>\nBrookdale offers a number of benefits to full-time associates including, but not limited to: medical, dental, vision, disability, life, paid time off, educational reimbursement. All associates, age 21 and older, are eligible to participate in the 401(k) retirementsavings plan."}