{"job title": "Data/Reporting Analyst", "company": "City of Atlanta", "city state": "– Atlanta, GA", "rating": "2.8", "job description": "<div><div> <p><strong><u>Salary Range: $38,300 - $47,900</u></strong></p>\n\n<p><strong><u>Posting Expiration Date: August 27, 2018</u></strong></p>\n\n<p><strong><u>--</u></strong></p>\n\n<p><strong>General Description and Classification Standards</strong></p>\n\n<ul>\n<li>Performs reporting and analysis work in support of departmental research, performance reporting, operations management, and departmental operations. Designs and prepares reports by accessing databases or by consolidating data from multiple sources. Lays out report formats and produces reports. </li>\n<li>May summarize data and provide commentary or observations based on analysis. </li>\n<li>Position does not perform data entry. Sources of data may be enterprise systems, complex spreadsheets, databases, etc. requiring specialized expertise or training. Note: positions in this class may also perform other related administrative or operations tasks within the organization provided they have a similar level of professional challenge.</li>\n</ul>\n\n<p><strong>Supervision Received</strong></p>\n\n<p>Performs work under general supervision with review and advice from manager or a senior level professional. May work independently or with other workers with responsibility for completion of assigned tasks.</p>\n\n<p><strong>Essential Duties &amp; Responsibilities</strong> <em>These are typical responsibilities for this position and should not be construed as exclusive or all inclusive. May perform other duties as assigned.</em></p>\n\n<ul>\n<li>Assumes responsibility for maintaining accuracy of assigned operating records and/or databases. </li>\n<li>Identifies processes or reporting functions that do not provide the necessary level of completeness, detail or accuracy. Designs standard report formats based on organizational needs for information. </li>\n<li>Retrieves and summarizes data from various information systems for inclusion into research or operating reports. </li>\n<li>Writes queries in the appropriate reporting language. </li>\n<li>Reviews monthly operating statistics and operating data and prepares operating reports. </li>\n<li>Participates in internal and external research projects by collecting, reviewing, and summarizing results. </li>\n<li>Generates reports, presentations, graphics, forms and other documents to demonstrate information flow and project results. May make presentations of periodic reports or special projects to organizational management.</li>\n</ul>\n\n<p><strong>Decision Making</strong></p>\n\n<p>Selects from multiple procedures and methods to accomplish tasks. Establishes work methods, timetables, performance standards, etc.</p>\n\n<p><strong>Leadership Provided</strong></p>\n\n<p>Provides guidance and training as required to lower level, interns, temporary employees, etc. Serves as a technical resource or mentor to other employees. May lead or instruct less experienced workers in high level or technical jobs.</p>\n\n<p><strong>Knowledge, Skills &amp; Abilities</strong> <em>This is a partial listing of necessary knowledge, skills, and abilities required to perform the job successfully. It is not an exhaustive list.</em></p>\n\n<ul>\n<li>Interacts with line staff, managers, and supervisors when conducting studies, surveys, or audits.</li>\n<li>Knowledge of databases, reporting methods and formats. </li>\n<li>Skill in operation of computers to retrieve data and prepare reports and presentations; in writing narrative reports; in communicating.</li>\n<li>Ability to review data and identify data trends and/or inconsistencies.</li>\n</ul>\n\n<p><strong>Minimum Qualifications – Education and Experience</strong></p>\n\n<ul>\n<li>Bachelor’s degree in business/public administration, accounting, finance, information technology, statistics, human resources or a related field (equivalent professional experience may be considered for substitution for the required degree on an exception basis).</li>\n<li>3 years of work experience in creation, reporting, and/or management of data or closely related tasks (not including data entry).</li>\n</ul>\n\n<p><strong>Preferred Education &amp; Experience</strong></p>\n\n<p>Bachelor’s degree as described above, plus 3-4 years’ experience in data analysis.</p>\n\n<p><strong>Licensures and Certifications</strong></p>\n\n<p>No specific certifications or licensures required. Individual positions may require completion of training in specific reporting languages or software.</p>\n\n<p><strong>Essential Capabilities and Work Environment</strong></p>\n\n<p><em>Required physical, lifting, and sensory capabilities are requirements to perform the job successfully. Typical environmental conditions associated with job.</em></p>\n\n<p><em>City of Atlanta is an equal opportunity employer.</em></p> </div></div><div><div> <br></div></div>"}