{"job title": "Lead Data Privacy Analyst", "company": "Duke Energy", "city state": "– Charlotte, NC", "rating": "3.7", "job description": "More than a career - a chance to make a difference in people's lives.<br><br>Build an exciting, rewarding career with us – help us make a difference for millions of people every day. Consider joining the Duke Energy team, where you'll find a friendly work environment, opportunities for growth and development, recognition for your work, and competitive pay and benefits.<br><br>Position Summary<br><br>The Lead Data Privacy Analyst will be responsible for expanding, enhancing, and advancing the Company's Data Privacy Program. This will include collaboration with key stakeholders across the enterprise to develop a strategy and vision that is executable and sustainable. This position will be responsible for ensuring that the Company handles personal and customer data responsibly and complies with all applicable data protection and privacy laws. This position will work with multiple teams and departments to establish clearly defined roles/responsibilities and to ensure that the program is aligned with the Company’s compliance framework and standards.\n<br><br>\nResponsibilities\n<ul>\n<li>Develop, manage and assist in the implementation and maintenance of the Company's information privacy policies and procedures to ensure that business activities are consistent with them.</li><li>Research and stay abreast of new, changing, or emerging laws or regulatory requirements that may impact the Company.</li><li>Periodically revise the privacy program to reflect changes in laws, regulatory or Company policy and accreditation standards, and monitor advancements in information privacy technologies to ensure organizational adaptation and compliance, as needed.</li><li>Develop privacy training materials and innovative methods for targeting “need to know” information to employees and third parties, as appropriate, on company privacy policies, data handling practices and procedures and legal obligations.</li><li>Collaborate with business teams and senior management to ensure awareness of \\\"best practices\\\" on privacy and data security issues.</li><li>Collaborate with business teams to develop strategic plans for the storage, use and sharing of information in a manner that maximizes its value while complying with applicable privacy regulations.</li><li>Assist business teams with selecting and implementing tools and methodologies to ensure ongoing compliance and to establish reporting for effective monitoring and oversight.</li><li>Partner with the legal department to advise/inform the business and to oversee investigations and responses to privacy issues.</li><li>Collaborate with IT, Legal, and other key stakeholders to develop a consistent and sustainable process for receiving, documenting, tracking, investigating and taking action on all privacy related incidents.</li><li>Work with business teams to develop a methodology for evaluating the privacy impact assessments to identify risks and determine steps to mitigate risks via compliance monitoring activities and other auditing related activities.</li>\n</ul>\n\nBasic/Required Qualifications\n\n<ul>\n\n<li>Bachelor's degree in a related discipline and 10 or more years of related work experience OR 14 years of work related experience without a degree</li>\n<li>Proficient with Microsoft products such as SharePoint, Excel, Word, and Power Point</li>\n<li>Experience working with confidential information with a high degree of integrity</li>\n\n</ul>\n\nDesired Qualifications\n\n<ul>\n<li>Five (5) years’ experience in regulatory compliance or similar work experience in compliance or data privacy protection practices.</li><li>Ability to analyze and make recommendations to business leaders and senior management.</li><li>The ability to work in a team, with lawyers and non-lawyers, to establish effective solutions efficiently and in an amenable manner. Experience working with privacy and data protection laws, regulations and best practices, and data breach handling.</li><li>Experience with compliance issues and standards at all levels (local, state, federal).</li> <li> Strong understanding of processes across multiple businesses.</li><li>Experience facilitating, building consensus, influencing, and/or negotiating with stakeholders to meet business needs and satisfy compliance requirements.</li><li>Ability to engage, take initiative and make decisions to advance the Data Privacy compliance strategy.</li><li>Experience working as a project manager.</li><li>Experience developing compliance programs.</li><li>Experience developing and conducting training.</li>\n</ul>\n\nJob Specific Requirement\n\n<ul>\n<li>Strong presentation skills with the ability to facilitate large/small groups effectively</li><li>Effective interpersonal skills, e.g. influencing and listening skills to work effectively with all levels of employees, management and customers</li><li>Excellent written and verbal communication skills</li> </ul><br><br>#LI-RB2\n<br><br>\n<strong><strong>Travel Requirements</strong></strong><br><br>5-15%Relocation Assistance Provided (as applicable)NoRepresented/Union PositionNoVisa Sponsored PositionNo<br><br><strong><strong>Posting Expiration Date</strong></strong><br><br>Tuesday, September 25, 2018<br><br>All job postings expire at 12:01 AM on the posting expiration date.<br><br>Please note that in order to be considered for this position, you must possess all of the basic/required qualifications."}