{"job title": "Master Data Control Analyst", "company": "Dymax", "city state": "– United States-Connecticut", "rating": "3.3", "job description": "<strong>Position Summary:</strong>\n<br><br>\nThis position is responsible for the accurate and timely administration of Global Item Master Data in E1. The Master Data Control Analyst will support the data requirements of a centralized S&amp;OP team which directs the purchasing and manufacturing activities for all Dymax entities. This position enters and maintains key item master data according to policy and procedure as defined by E1 governance and leadership. Inputting data directly into E1 and for mass changes, create load files to be processed by others and then tests and reconciles data. Position also uses E1 to validate, enter and update data.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n<li>Supports Long Term, Annual, Monthly, Weekly and Daily Planning and Scheduling processes of the Sales and Operations Planning department.</li>\n<li>Entry and maintenance activities for the following Master Data elements (including but not limited to):</li>\n\n\n<ul>\n<li>Lead Times- Purchasing and Manufactruing</li><li>Safety Stock Levels</li><li>Branch Relationships</li><li>Item Cross Reference</li><li>Supplier/ Item Relationships</li><li>Supplier Catalog</li><li>Employee Setup for Manufacturing</li>\n<li>Shop Floor Calendar</li>\n</ul>\n\n<li>Ensure Master Data is entered and maintained with accuracy and integrity.</li>\n<li>Perform routine data audits.</li>\n<li>Train with and assist the S&amp;OP Planners in order to provide backup and potential advancement opportunity.</li>\n</ul>\n<strong>Skills/Qualifications desired:</strong>\n\n<ul>\n<li>Bachelor degree (preferred majors: Supply Chain Management, Business, Computer Science or other related-area).</li>\n<li>Experienced in JDE E1 Master Data Maintenance (or equivalent), Supply Chain, Data Entry or related work is preferred.</li>\n<li>This position requires strong computer and analytical skills combined with the ability to manage large amounts of data. This includes the ability to use MS Excel and/or MS Access to cleanse and update large data sets.</li>\n<li>Candidate should be proficient in the use Microsoft Office software and have working knowledge of relational databases.</li>\n<li>Ability to actively listen to internal and external customer issues, prioritize issues, efficiently troubleshoot problems and implement solutions in a timely and customer focused manner.</li>\n<li>Demonstrated analytical, verbal, and written communication skills.</li>\n<li>Must be organized and adaptable in a rapidly changing environment.</li>\n</ul>\nEOE Disabled/Male/Female/Veteran\n<br><br>\nVEVRAA FEDERAL CONTRATOR"}