{"job title": "Data Security Analyst", "company": "Equifax Inc.", "city state": "– Atlanta, GA", "rating": "3.0", "job description": "Equifax is a global leader in consumer, commercial and workforce information solutions that provide businesses of all sizes and consumers with insight and information they can trust. Equifax organizes and assimilates data on more than 600 million consumers and 81 million businesses worldwide. The company's significant investments in differentiated data, its expertise in advanced analytics to explore and develop new multi-source data solutions, and its leading-edge proprietary technology enable it to create and deliver unparalleled customized insights that enrich both the performance of businesses and the lives of consumers. Headquartered in Atlanta, Equifax operates or has investments in 19 countries and is a member of Standard &amp; Poor's (S&amp;P) 500® Index. Its common stock is traded on the New York Stock Exchange (NYSE) under the symbol EFX. In 2013, Equifax was named a Bloomberg BusinessWeek Top 50 company, was #3 in Fortune's Most Admired list in its category, and was named to InfoWeek 500 as well as the FinTech 100. For more information, please visit www.equifax.com. Equifax is an equal opportunity employer and a drug-free workplace. All qualified applicants will receive consideration for employment without regard to race, color, gender, sexual orientation, gender identity or expression, religion, national origin, marital status, age, disability, veteran status, genetic information, or any other protected status.<br><br>Data is our business, protecting it is paramount. As Security Analyst, you will help implement Data Protection and Data Governance solutions for the full data lifecycle. As part of broader Security efforts to protect data assets, you will have an exciting opportunity to support Data Protection efforts across a matrix organization. You will manage individual project priorities, deadlines and deliverables, and be involved in the design, development, testing, deployment and maintenance of Data Protection and Data Governance solutions.<br><br>As Security Analyst, youll be a key player in the security roadmap and consulting efforts that addresses Equifax needs in the Data Protection capability. We need our Security Analysts to be versatile, display leadership qualities, and be enthusiastic in addressing new problems as we continue to push risk management forward. You'll have the opportunity to be exposed to virtually all Equifax products and work with a wide variety of other teams throughout the company and every business unit.<br><br><strong><strong>Job Responsibilities</strong></strong>\n<ul>\n<li>Participate in Data Protection and Data Governance projects and initiatives</li><li>Work closely with business units on the deployment and operation of Data Protection and Data Governance-related technology</li><li>Assist with security planning and policy development</li><li>Help install and manage data discovery / data inventory scanning tools and configurations across multiple OS platforms (primarily Windows and Linux)</li><li>Produce reports and metrics including progress and findings</li><li>Plan and implement scanning schedules</li><li>Tests for compliance with relevant policies and procedures</li>\n</ul>\n<strong>Education and Experience</strong>\n<ul>\n<li>Bachelors Degree in computer science, information systems, engineering, data science, or a related field, or equivalent practical experience</li><li>5+ years' experience working as a security analyst, security operator, security engineer, or equivalent experience</li><li>Familiar with the basics of system administration for both Windows and Linux, including familiarity with the concepts around, for example, Active Directory, LDAP, Kerberos, privilege management and escalation</li><li>Experience with Data Protection or Data Governance tools (e.g., data discovery, data mapping data lineage, data loss prevention, database activity monitoring, data modeling); experience with Active Navigation, Privacera, or Imperva a plus</li><li>Capable of aggregating data and producing reports for representing status and results</li><li>Self-motivated and results-oriented</li><li>Excellent interpersonal and communication skills</li><li>Demonstrable track record dealing well with ambiguity, prioritizing needs, and delivering measurable results in an agile, fast-paced environment</li><li>Knowledge of SMB/CIFS, NFS, and other data sharing protocols -- a plus</li><li>Experience with SQL databases and basic SQL operations for data manipulation (SQL Server and SSAS experience) a plus</li><li>Knowledge of Data Protection, Data Governance, or data lifecycle methodologies and concepts a plus</li><li>Knowledge of data architecture, database technologies, and cloud services a plus</li><li>Experience with Confluence, SharePoint, Archer, ServiceNow, and/or Agile -- a plus</li><li>Understanding of consumer credit reporting or information services industry a plus</li><li>Knowledge of laws and regulations that impact Equifax (e.g., FCRA, GLBA, UDAAP, Dodd-Frank, GDPR) - a plus</li>\n</ul>\n#LI-SH2<br><br>See Job Description"}