{"job title": "Senior Business Analyst, Data Science", "company": "ICF", "city state": "– Annapolis, MD", "rating": "3.6", "job description": "<p><u><b>Working at ICF</b></u></p><p></p><p></p>Working at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you’re seeking to make a difference in the world, visit www.icf.com/careers to find your next career. ICF—together for tomorrow.<p></p><p></p><b>Senior Business Analyst, Data Science</b><b>Health, Environment, Analytics, Resilience, &amp; Social Group (HEARS) </b><b>Bethesda, Maryland</b><u><b>Job Description</b></u>The Health, Environment, Analytics, Resilience, &amp; Social Group (HEARS) of ICF provides a broad range of services related to Biomedical Informatics support for the Dept. of Health and Human Services (HHS) in the DC–metro area. We are currently seeking a versatile Senior Business Analyst specialized in Data Science, IT Requirements, and Business Analysis to support our client projects. This is a highly visible and dynamic position within projects and requires an individual with strong communication skills and can think strategically and execute tactically. This role requires delivery experience in business requirements, data collection and analysis, and high-level understanding of translating data into insights and concrete actions to enable better operational results.This position requires being onsite daily at our client location in Bethesda, Maryland.<u><b>Key Responsibilities:</b></u><ul><li>Initiates, elicits, analyzes, evaluates, and documents client business, system, and process requirements to support client’s strategic goals.</li><li>Leads and conducts analysis of client business processes, functional requirements, workflows, gap analysis, and validate the information.</li><li>Collaborates with stakeholders to develop and implement innovative approaches/solution through research and data analysis to address key business and operation needs.</li><li>Develops advanced data and business analytics frameworks for client’s future strategic initiatives and facilitates business decisions, including key indicators to ensure results are measurable and sustainable.</li><li>Performs explanatory data analyses, generates and tests working hypotheses, prepares and analyzes historical data and identifies patterns.</li><li>Builds relationships and serves as a great advocate to the client. Communicates regularly with clients about project progress.</li></ul><u><b>Basic Qualifications: </b></u><ul><li>Bachelor degree in Data Science, Bioinformatics, Computer Science, Data Analytics, or related field with at least 8+ years of experience in business requirements and data analytic supporting federal government projects.</li><li>Ability to collect, interpret, evaluate, and synthesize large amounts of data to develop appropriate conclusions and recommendations.</li><li>Advanced competency in understanding business needs, develop predictive models, and deliver data-driven analytical solutions that solve client problems.</li><li>Experience in requirements analysis, business process analysis, data analysis, system documentation, and testing in both Waterfall and Agile environments.</li><li>Experience in data retrieval, data manipulation, data analysis, and presentation using tools such as Tableau, SQL, and Excel to derive insights from data.</li><li>Knowledge of statistics and the scientific method, information classification techniques, and the ability to perform self-directed hypothesis-driven research.</li><li>Ability to clearly communicate ideas and solutions to non-technical people</li></ul><u><b>Preferred Qualifications:</b></u><ul><li>Master degree preferred.</li></ul><u><b>Professional Skills:</b></u><ul><li>Possess positive attitudes and behaviors and contribute to a constructive team culture.</li><li>Proven ability to work independently and collaboratively.</li><li>Excellent communications and interpersonal skills and experience in client management, with sensitivity to complex organizational structures, varying cultures, and potentially conflicting goals.</li></ul><p></p><p>ICF offers an excellent benefits package, an award winning talent development program, and fosters a highly skilled, energized and empowered workforce. </p><p></p><p>ICF is an equal opportunity employer that values diversity at all levels. (EOE – Minorities/Females/ Protected Veterans Status/Disability Status/Sexual Orientation/Gender Identity)</p><p></p><u><b>Pay Transparency Statement: </b></u>For more information, please click here: https://www.dol.gov/ofccp/pdf/pay-transp_formattedESQA508c.pdf<p></p><p><b>Working at ICF</b></p><p>Working at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. ICF—together for tomorrow.</p><p></p><p><b>About ICF</b></p><p>ICF (NASDAQ:ICFI) is a global consulting and technology services provider with more than 5,000 professionals focused on making big things possible for our clients. We are business analysts, policy specialists, technologists, researchers, digital strategists, social scientists and creatives. Since 1969, government and commercial clients have worked with ICF to overcome their toughest challenges on issues that matter profoundly to their success. Come engage with us at icf.com.</p><p></p><p></p>Maryland Client Office (MD88)<p></p><p></p>"}