{"job title": "Sr Data Analyst", "company": "Johnson Controls", "city state": "– WI", "rating": "3.2", "job description": "<div><b>What you will love about Johnson Controls:</b> </div>\n\n<p>We’ve\nbeen dedicated to protecting the environment since our invention of the\nelectric thermostat in 1885, which provided a fundamental shift in the energy\nefficiency of buildings. Now, all over the world, our products and services\nempower customers and communities to consume less energy and conserve\nresources.</p>\n\n<ul><li>Global, innovative, industry\n leader</li><li>#70 on Fortune’s most admired\n companies list</li><li>Embraces diversity</li><li>Growth opportunities abound </li><li>Fast paced, evolving company,\n always learning, always adapting</li><li>Great benefits; including\n Healthcare related wellness discounts, \n great 401k match, company funded retirement program, vacation, sick\n time, floating holidays and national holidays</li></ul>\n\n<div><b> </b></div>\n\n<div> </div>\n\n<div><b>What you will do</b></div>\n\n<div><b> </b></div>\n\n<p>The <b>IT Asset Management Analyst II </b>will work at\nthe direction of the Global Infrastructure Asset Management leadership to support\noperations, processes and procedures that are core to Hardware Asset Management\nbest practices, including effective lifecycle management of all specified\nassets. This position will utilize Hardware Asset Management tools and\nmethodologies to maintain the accuracy and automation of reporting and asset\ntracking to ensure the maintenance of assets entered within the tool and/or all\nassociated records throughout the lifecycles of the asset.</p>\n\n<p>IT\nAsset Management (ITAM) enables key corporate priorities by controlling costs,\nenhancing operational efficiency, ensuring regulatory compliance, and\nmitigating security &amp; financial risks. Work as a member of the IT Asset\nManagement team, primarily supporting the Hardware Asset Management function</p>\n\n<div><b> </b></div>\n\n<div><b> </b></div>\n\n<div> </div>\n\n<div><b>How you will do it</b></div>\n\n<div><b> </b></div>\n\n<p>The Hardware Asset Management Analyst\nshould have the demonstrated ability to analyze, research, resolve questions\nand/or concerns, and possess the ability to learn quickly and adjust to\ntechnology changes. A proficiency in system management and back office\nprocesses is preferred. Individual must communicate clearly, diplomatically and\neffectively at all levels of the organization and to audiences with varying\ndegrees of process and technical knowledge.</p>\n\n<ul><li>Track\nand manage IT assets throughout their life cycle, ensuring logical and\nconsistent operational processes are defined and standard systems are\nimplemented to acquire and maintain IT assets in a CMDB</li><li>Ensure\naccurate and complete asset information is available to supply financial\nreporting</li><li>Enhance\nbusiness decision-making</li><li>Improve\ntime-to-market and manage supply chain issues with hardware supplier</li><li>Manage\nasset-related liabilities and risks</li><li>Improve\ncustomer service and responsiveness</li><li>Establish\na foundation for services including Information Security</li><li>Inventory\nManagement</li><li>Problem\nManagement</li><li>Compliance\nManagement</li><li>Execute\npolicy and process in support of ITAM program goals</li><li>Manage\nand improve the hardware lifecycle process, from receiving to disposal</li><li>Improve\nthe quality of hardware data in the IT asset repository</li><li>Assist\nin providing key analytical reporting</li><li>Support\nsenior team members in projects and audits</li><li>Service\nenterprise customers by responding to hardware asset requests</li><li>Assist\nthe IT Asset and Data Manager with audits and report generation.</li><li>Maintain\nthe configuration management database for accuracy and consistency.</li><li>Ensures\nthe CMDB is updated upon successful change implementation.</li><li>Collect\nand retain asset data for risk and cost assessment.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<br>\n<div><b>What we look for</b></div>\n\n<div><b> </b></div>\n\n<ul><li>Undergraduate degree in Business,\nTechnology, or related major with a background or interest in Information\nTechnology required</li><li>5 years’ of experience in an\nanalytical role; experience working with IT hardware highly preferred</li><li>Proficiency in MS Outlook, Word, and\nPowerPoint</li><li>Proficiency in ITIL best practices</li><li>Advanced Microsoft Excel skills</li><li>Detail-oriented, proactive, and\nhighly organized</li><li>Capable of prioritizing work and\nmulti-tasking</li><li>Takes initiative and able to work\nindependently</li><li>Strong written and oral\ncommunication skills</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Additional\nrequirements include:</p>\n\n<ul><li>A bachelor’s degree in a technical\nfield or a minimum of 3 years of asset configuration management experience</li><li>ServiceNow training and\ncertification and Information Technology Infrastructure Library (ITIL)\nCertification required within 2 years of being hired</li><li>Detail oriented and possess\nexcellent oral and written communication skills</li><li>Strong analytical and organizational\nskills</li></ul>\n\n\n\n\n\n\n\n<div> </div>\n\n<div><b> </b></div>\n\n<div><b> </b></div>\n\n<div><b>Who we are</b></div>\n\n<div><b> </b></div>\n\n<p>At Johnson Controls, we’re shaping the future\nto create a world that’s safe, comfortable and sustainable. Our global team\ncreates innovative, integrated solutions to make cities more connected,\nbuildings more intelligent and vehicles more efficient. We are passionate about\nimproving the way the world lives, works and plays. The future requires bold\nideas, an entrepreneurial mind-set and collaboration across boundaries. You\nneed a career focused on tomorrow. Tomorrow needs you.</p>\n\n<p>Johnson\nControls is an equal employment opportunity and affirmative action employer and\nall qualified applicants will receive consideration for employment without\nregard to race, color, religion, sex, national origin, age, protected veteran\nstatus, status as a qualified individual with a disability, or any other\ncharacteristic protected by law. For more information, please view EEO is the\nLaw. If you are an individual with a disability and you require an\naccommodation during the application process, please visit www.johnsoncontrols.com/tomorrowneedsyou. </p>\n\n<div> </div>\n<br>"}