{"job title": "Data Analyst III-Center for Tobacco Independence", "company": "MaineHealth", "city state": "– Portland, ME", "rating": "3.4", "job description": "The ideal candidate will have a passion for community health improvement and the desire to interpret data to enhance the Center for Tobacco Independence (CTI) programs. This role is responsible for all evaluation, surveillance, reporting, and analysis consistent with the Federal Center for Disease Control (CDC) framework for program evaluation. The incumbent manages both internal and external survey processes and serves as the key contact for vendor relationship. This position reports to the Senior Director and is a member of the MaineHealth CTI leadership team.<br>\n<br>\nThe analyst must possess strong qualitative and quantitative analytic skills and have a desire to train and share data analytics and concepts with other team members. This position requires significant coordination with federal, state, and sub-recipient partners. Additionally, this position provides critical evaluation and analysis to inform business decisions. This position requires extensive experience with analytic tools such as SAS, STATA, SPSS, or similar software platforms. The incumbent will manage datasets from multiple sources and interact with United States CDC, National Quitline Data Warehouse, the North American Quitline Consortium, and the Maine CDC and Department for Health and Human Services (DHHS). <br>\n<br>\n<strong>Summary of Position Description</strong><br>\n<br>\nIdentifies, collects, integrates and analyzes data in support of the assigned project and/or department. Uses applied statistics, sampling, univariate, multivariate, and time dependent analytic techniques which encompass study design, implementation and data management, monitoring and reporting. This position works independently and uses methodologies consistent with the established policies, procedures and regulatory requirements affecting the department.<br>\n<br>\n<strong>Minimum Knowledge, Skills, and Abilities Required</strong><br>\n<ol>\n\t<li>\n Master's in healthcare field preferred. Doctoral level background in research methodology preferred.</li>\n\t<li>\n 5-7 years’ experience analyzing data required. 3-5 years in healthcare preferred.</li>\n\t<li>\n Intermediate to advanced proficiency in SAS (Statistical Analysis Software), spreadsheet, relational database, graphics and word processing software is required. Skills with additional statistical software packages are desirable.</li>\n\t<li>\n Other degrees/certification in an allied health profession preferred.</li>\n\t<li>\n Department specific certification may be required.</li>\n\t<li>\n Experience in working with large clinical and/or administrative databases, including both management and analysis.</li>\n\t<li>\n Capable of searching and critically appraising medical literature.</li>\n\t<li>\n Ability to work and interact with multiple departments.</li>\n\t<li>\n Ability to manage and lead multiple projects.</li>\n\t<li>\n Effective verbal and written communication skills.</li>\n\t<li>\n Strong analytical and problem-solving skills are essential attributes for this position.</li>\n\t<li>\n Ability to pay attention to detail.</li>\n\t<li>\n Teaching and supervisory skills are highly desirable. </li>\n</ol>"}