{"job title": "Senior Analyst/ Data Scientist", "company": "ME Bank", "city state": "– ", "rating": "3.5", "job description": "<div><div><strong>\n<br>\nSenior Analyst/ Data Scientist</strong><br>\n\n<div>\n<div>\nLocation\n<br><br>\n<strong>\n<br>\nMelbourne, VIC</strong>\n</div><br>\n\n<div>\nJob Code\n<br><br>\n<strong>988</strong>\n</div><br>\n\n<div>\n# of openings\n<br><br>\n<strong>1</strong>\n</div>\n</div>\n</div>\n\n<br>Apply Now</div><br>\n\n<div><strong>Let’s talk about ME:</strong>\n<br><br>\nME is different from the pack. We have a solid history but as importantly, a very exciting future. Our journey is just beginning and the best is yet to come. We are building a brand, a bank and a company that we can be proud of. To do this, we need the very best people to help us get there.\n<br><br>\nWe inspire people power. We want you to challenge the status quo and share extraordinary ideas. Our size means there are fewer corners to hide, so everyone is actively engaged to participate.\n<br><br>\nThere's never been a better time to join as we embark on a Digital Transformation and look to rapidly mature our agile way of working.\n<br><br>\n<strong>Let’s talk about the JOB:</strong>\n<br><br>\nDue to the exciting journey the ME Bank Customer Analytics and CRM team is on to expand our analytical capabilities, we are now looking for an experienced Senior Analyst or Data Scientist to be part of our amazing team. This role will see you drive the uplift of data analytics and insights, and work closely across the business to deliver relevant, quality analytical solutions. How awesome does that sound?\n<br><br>\nNow down to the nitty gritty … you will use your data science super power capabilities in customer analytics, predictive modelling as well as marketing and campaign analysis to produce insightful presentations, develop deep dive reports and dashboards, undertaking customer behavioural analysis, assessing campaign effectiveness, building predictive models and deriving customer segmentation. A large part of the role would entail significant data investigation and data preparation in order to do all this cool stuff.\n<br><br>\nBut you’re not just a data churner! You will your use your strong consultation and presentation skills to build and maintain relationships with your internal stakeholders, with the mindset and determination to make a difference and keeping a client focus at all times.\n<br><br>\n<strong>Let’s talk about YOU:</strong>\n<br><br>\nYou’re a go-getter and have a bucket load of potential complimented by a growth mindset! You have outstanding fact based problem solving skill set, you know how to get stuff done.\n<br><br>\nYou’re more than willing to get nerdy with numbers and data; in fact you absolutely love doing this. You possess advanced technical SAS, SQL and modelling skills honed from solid professional experience and your experience in R and other open source languages like Python enables you to build strong end-to-end predictive models and derive tangible customer insights.\n<br><br>\nYou also have strong statistical knowledge and ideally would have had exposure to experimental design. Strong experience in dashboard tools like Tableau, and Power BI is also highly desirable. In addition, experience with unstructured data, Cloud platforms and Big Data technologies like Hadoop will also be viewed very favourably.\n<br><br>\nYou will have well developed stakeholder management skills with the ability to consult with them to ensure that the data and analytical outputs are interpreted and validated correctly, whilst working with them to develop optimal solution designs. You have excellent presentation skills and able to articulate your insights confidently and clearly with effective graphs, visualisation and summaries, offering commercial and practical recommendations.\n<br><br>\nYou are someone who enjoys and can work independently, demonstrates a high attention to detail in their work and loves ambiguity within an ever-changing environment. Importantly, you are also someone who is highly collaborative, helpful and enjoys working in a friendly, collegiate and supportive team environment to achieve team goals and objectives.\n<br><br>\nPrevious experience working in an analytics or data science function within marketing in the banking/financial services/telecommunications industry or previous experience in a consultancy would hold you in good stead.\n<br><br>\n<strong>Why ME?</strong>\n<br><br>\nApart from the stuff we've already mentioned here are some reasons why people love it at ME:\n\n<ul>\n<li>The people -we really mean it. We care about each other here and our refreshing no BS way of engaging with each other means people are authentic and we don't have your usual banking political stuff.</li>\n\n<li>We embrace action oriented people who aren't afraid to fail….That's right you can make mistakes here and it's ok - so long as you learn from it.</li>\n\n<li>What we're building is really cool and you get to directly influence it.</li>\n</ul>\n<strong>I'm in! What's next?</strong>\n<br><br>\nIf this sounds like the perfect job for you, why wait? Have a swing by sending your application through and Love Monday's in a new role with ME!\n<br><br>\n<em>**Should an applicant be the preferred candidate, background checks (including police checks, reference checks, ASIC banned and disqualified persons and bankruptcy checks) will be completed prior to the candidate's employment being confirmed. The outcomes of the background checks do not automatically bar candidates; however will be assessed against the inherent requirements of the job**</em></div>"}