{"job title": "IT Sr Data Analyst", "company": "NCR", "city state": "– United States", "rating": "3.2", "job description": "<div><b> </b></div>\n<div> </div>\n<div>Title<b>: IT Sr. Data Analyst</b></div>\n<div>Location<b>: Atlanta, GA </b></div>\n<div> </div>\n<div><b>About NCR Corporation</b><br><br></div>\n<div>NCR Corporation (NYSE: NCR) is the global leader in consumer transaction technologies, turning everyday interactions with businesses into exceptional experiences. With its software, hardware, and portfolio of services, NCR enables nearly 700 million transactions daily across retail, financial, travel, hospitality, telecom and technology, and small business. NCR solutions run the everyday transactions that make your life easier. NCR is headquartered in Atlanta, Georgia, with approximately 29,000 employees and does business in 180 countries.</div>\n<div><b> </b></div>\n<div><b>Position Summary &amp; Key Areas of Responsibility</b></div>\n<div> </div>\n<ul>\n<li>The IT Sr Data Analyst is responsible for working within an analytics team to analyze, design, and deliver data products that enable NCR’s business. </li>\n<li>You will evaluate business questions, find the right data sets, ensure cleanliness of the data, and build visualizations or analytics that can be deployed in a production environment. </li>\n<li>Along the way, you’ll partner with our data infrastructure teams, data governance organization and advanced analytics group to consistently deliver quality data products.</li>\n<li>You will also work closely with Big Data team to drive and implement Analytical solutions in Hadoop technologies.</li>\n<li>Enhance Data Visualization capabilities to effectively communicate analysis to business users. </li></ul>\n<div><b>Basic Qualifications</b></div>\n<div><b><u> </u></b></div>\n<ul>\n<li>\n<div>Bachelor’s Degree in Computer Science or related field</div></li>\n<li>\n<div>5-8 years of related experience</div></li>\n<li>\n<div>Experience working with data preparation and data quality</div></li>\n<li>\n<div>Experience with data visualization tools like Tableau</div></li>\n<li>\n<div>Good understanding of data governance</div></li>\n<li>\n<div>Embraces agile development principles (SAFe)</div></li>\n<li>\n<div>Ability to clearly communicate data topics at an executive level</div></li>\n<li>\n<div>Ability to coordinate across multiple teams to solve complex problems</div></li>\n<li>\n<div>Experience in Java or Scala highly desired.</div></li>\n<li>\n<div>Exposure to Hadoop Echo System highly desired</div>\n<div><b><u> </u></b></div>\n<div><b><u> </u></b></div>\n<div><b>Preferred Qualifications</b></div>\n<div> </div></li>\n<li>Experience working as a data analyst with business units</li>\n<li>Experience in data analytics, including machine learning</li>\n<li>Hands-on experience with Hadoop</li>\n<li>Exposure to Continuous Integration methodology is a plus</li></ul>\n<div> </div>\n<div> </div>\n<div>Visit our careers site for a list of the benefits offered in your region in addition to a competitive base salary and strong work/family programs.</div>\n<div> </div>\n<div><b><u>EEO Statement</u></b></div>\n<div>Integrated into our shared values is NCR's commitment to diversity. NCR is committed to being a globally inclusive company where all people are treated fairly, recognized for their individuality, promoted based on performance and encouraged to strive to reach their full potential. We believe in understanding and respecting differences among all people. This concept encompasses but is not limited to human differences with regard to race, ethnicity, religion, gender, culture and physical ability. Every individual at NCR has an ongoing responsibility to respect and support a globally diverse environment.</div>\n<div> </div>\n<div><b><u>Statement to Third Party Agencies</u></b></div>\n<div>To ALL recruitment agencies: NCR only accepts resumes from agencies on the NCR preferred supplier list. Please do not forward resumes to our applicant tracking system, NCR employees, or any NCR facility. NCR is not responsible for any <strong>fees or</strong> charges associated <strong>with</strong> unsolicited resumes.</div>"}