{"job title": "Performance Data Analyst", "company": "Oregon Child Development Coalition, Inc.", "city state": "– Wilsonville", "rating": "3.2", "job description": "<div>Desired: Microsoft WordResponsible for developing information systems that measure and monitor organizational performances. Includes gathering data from decision-makers working with IT Department and Content Specialists to design the necessary processes and assisting with the training and technical assistance needed by staff. Duties also include developing data-gathering protocols designing dashboards preparing and presenting analysis reports and monitoring data quality.\"\n<br><br>\n<strong>Essential Duties</strong> Essential Functions: Regular and consistent attendance is an essential function of this position. 1. Development of Information Systems a. Works with specialists and managers to design processes forms reports dashboards summaries and/or charts to assist in performance monitoring.\" b. Monitors and addresses data quality issues. c. Coordinates the development of related processes. d. Gathers clarifies and interprets data.\" e. Provides training and technical assistance to staff. f. Produces quarterly dashboards. 2. Monitoring Analysis and Evaluation\" a. Monitors various processes to ensure consistent statewide application of data processes. b. Establishes and monitors reports and tracking systems. c. Monitors the implementation and evaluates effectiveness of current systems. d. Analyzes data to identify trends and recommends updates and changes. e. Prepares and/or performs periodic audit reviews. 3. System Support and Maintenance a. Designs data collection tools for statewide use. b. Gathers data from various databases and sources. c. Analyzes data flows for process improvement opportunities. d. Serves as a technical point-of-contact for assigned functional area. 4. Team Work: Communication and Partnership a. Maintains a professional mutually respectful and productive working relationship with all Agency personnel.\" b. Works with program specialists to establish and update plans of action at Agency level. c. Supports Agencys ability to manage and implement programs independently within guidelines of performance standards and other requirements. d. Develops prepares coordinates and maintains relevant statewide meetings.\" 5. Professional Development and Knowledge a. Maintains professional and technical knowledge in assigned subject area. b. Attends educational workshops trainings and seminars establishing personal networks to maintain expertise in field.\" c. Conducts best practice research for grant writing as directed. 6. Professional and Ethical Conduct a. Supports the OCDC mission and continually adheres to standards on conduct. b. Maintains confidence and keeps information confidential in compliance with OCDC policy and procedures. c. Applies safety practices in all facets of the performance of duties in compliance with safety standards. d. Abides by the Head Start Standards of Conduct. 7. Other a. Performs other work related or assigned duties. Supervisory Responsibilities: This job has no supervisory responsibilities at this time. Education And Experience Requirements Education and Job Requirements: Masters degree in Business Information Systems or related degree with over 3 years of experience in information management and database and website development. Advanced computer skills in database web design and report writing software is required. Experience in working with educational health social work data systems is preferred.\" OR BA/BS degree in Business Information Systems or related degree with over 7 years of experience in information management and database and website development. Advanced computer skills in database web design and report writing software is required. Experience in working with educational health social work data systems is preferred.\" Other Job Requirements: 1. Must be registered with Oregons Central Background Registry. 2. Ability to pass an Agency sponsored physical examination. TB test documented. 3. This position is an authorized driver and must possess current drivers license good driving record and auto insurance coverage as defined by OCDC Policy.\" 4. Must operate and be proficient with computers and related software (i.e. various data systems Microsoft Word Word Perfect Excel etc.). \" 5. Excellent verbal and written communication and analytical skills. 6. Must be able to make decisions based on established guidelines OCDC programs/policies applicable laws/regulations and best practices. \" 7. Ability to relate positively to others and work across departments.</div>"}