{"job title": "Senior Software Developer/Analyst - Big Data", "company": "Parsons", "city state": "– Schaumburg, IL", "rating": "3.5", "job description": "Job Description:Senior Software Developer/Analyst Big Data Schaumburg, IL In this team, you will be working on Parsons high performance real-time Advanced Transportation Management System platform. You will be working on big data solution using Java 8, Apache Spark, Hadoop, and Kafka to build advanced data driven systems at scale. The ideal candidate is a passionate and highly skilled individual, who can utilize programming and analytics tools such as SQL, R, Python, and Tableau to query and process large data sets to produce high quality customer facing data deliverables and insights. If you have experience designing and building business intelligence/analytics applications, especially around real time traffic data flow and big data, and excited about leveraging your experience to become an agent of change for the hyper-growth of this business line, this job is for you. Responsibilities: Design and maintain analytical database structures and requirements to manage and process various machine learning data sets * Convert OLTP data into OLAP for reporting/analytics/modeling purpose * Lead the development of analytical data assets with an eye towards process efficiency and automation * Communicate and present data to both internal and external customers by developing reports / dashboards / charts using business intelligence tools such as Tableau * Work closely with a dynamic and growing team to perform quantitative analysis of customer data, including gathering data requirements and validate data, applying judgement and statistical analysis Preferred Experience/Education * Bachelor's degree in Computer Science or related fields, preferably with focus on data analytics. Master's degree preferred. * Minimum 5+ years of related experience developing code in Java and popular Java IDE such as Eclipse, IntelliJ IDEA, NetBeans, or similar. * 3+ years of experience working with big data and/or big data analytics * 3+ years of hands-on experience in designing and building analytical data applications and BI Reporting * Proficient in SQL and Tableau, familiar with at least one coding language in Python / PHP / shell scripting. Nice to have R / SAS programming experience. * Experience in using cloud based managed services for data warehousing / analytics is a plus * Experience interfacing with back-end applications using RESTful web services, SOAP, message queues, and JSON * Experience with Dojo is preferred * Experience developing artificial intelligence or machine learning platforms is a plus * Good understanding of design patterns * Experience with distributed large data computing frameworks like Hadoop and related technologies including Mongo DB, NOSQL etc. is highly desired * Knowledge of relational databases such as SQL Server, Oracle and PostgreSQL. * Very strong written and verbal communication skills; ability to tell a story with the data * Analytical thinker, with an ability to evaluate multiple products/technologies to address various aspects of a data platform. * Experience working on Linux / Unix development and production environments * Experience working in agile software development environments * Ability to manage multiple conflicting priorities, take proactive ownership of problems and outcomes, think outside the box * Ability to develop technical and user interface designs for an application that meets the defined requirements * Demonstrates deep expertise in specific coding concepts and/or languages, especially around modern application architectures. * Experience with web applications that use responsive design to better support mobile browsers. * Demonstrate good understanding of highly-secured online environments that use n-tier designs and extensive firewalling to enhance security. * Experience in multi data center physical implementation models for scalability and resilience is a plus. * Experience in a software product development team is a plus. * Experience Developing mobile applications is a plus"}