{"job title": "Program Integrity Data Analyst", "company": "Partners Behavioral Health Management", "city state": "– Gastonia, NC", "rating": "3.1", "job description": "<em><strong>Excellent Benefits Package!!!</strong></em>\n<br><br>\n<strong>Projected Hiring Range:</strong> $48,355 – 50,900\n<br><br>\n<strong>Closing Date:</strong> <strong>Open Until Filled</strong>\n<br><br>\n<strong>Primary Purpose of Position</strong>: The Program Integrity (PI) Data Analyst assists the PI Department to perform the essential PI tasks of review, selection, analysis, and interpretation of data for auditing, investigating, and other data functions within the PI Department, including the development and maintenance of databases. Position uses various tools and software including CMS’ RAT STATS &amp; NC DMA’s Fraud and Abuse Management System (FAMS), to gather, research, analyze, design and present necessary data so that information presented can be used as an effective management tool.\n<br><br>\n<strong>Role and Responsibilities:</strong>\n<ul>\n<li>Assures that essential data are collected through Information Technology systems and other sources to assess key indicators and performance data; works with PI staff to develop accurate and useful reports.</li><li>Assures that data gathered, compiled, and processed are accurate.</li><li>Helps maintain databases, extracts information for trend analysis and dashboard reports.</li><li>Prepares periodic reports required in Partners BHM’s contract with the NC DHHS.</li><li>Helps to identify and analyze trends and patterns related to potential healthcare fraud, waste, and financial abuse (FWA).</li><li>Develops ad hoc reports as directed by supervisor.</li><li>Maintains resource materials and data files.</li><li>Accomplishes tasks utilizing statistical analysis; gathers data related to PI goals and makes recommendations for reporting data for use as management tools.</li><li>Assists supervisor to assure projects are completed within established guidelines.</li><li>Ensures the integrity of systems used in data collection, analyses and interpretation of information and ensures accuracy of reports.</li><li>Works with the internal and external personnel to assess information needs.</li><li>Responsible for the implementation, data management, use, reporting, training and ongoing support related to PI’s use of FAMS; serves on the FAMS User Group and acts as PI Liaison with the State.</li><li>Responsible for preparing allegation packages by using data analytics technology for producing investigatory leads for PI.</li><li>Tracks the status of PI’s tentative overpayment notices and collections of final overpayments.</li><li>Application of FAMS, RAT STATS, Business Intelligence and other software as identified to guide PI investigations.</li>\n</ul>\n<strong>Knowledge, Skills and Abilities</strong>.\n<ul>\n<li>Working knowledge of data extraction and statistical methodologies</li><li>Strong problem-solving, organizational, and analytical skills</li><li>Strong interpersonal skills, both orally and in written form</li><li>Ability to work independently and in a highly collaborative environment</li><li>Professional presentation and effective written and oral communication skills</li><li>Ability to apply appropriate judgment and discretion in interpreting and reporting of data</li><li>Ability to think within a quality systems framework</li><li>Ability to summarize analytical results graphically and numerically in Crystal Reports, Microsoft Excel, PowerPoint, and ability to utilize applicable software products</li><li>Proficiency in pivot tables and data cubes is desirable, along with knowledge of Microsoft Access and SSRS</li><li>Ability to effectively utilize fraud identification applications such as FAMS and random sampling software such as RAT-STATS</li><li>Ability to investigate data from FAMS to identify potential fraud, waste, abuse and related schemes and to effectively communicate that information to PI Investigators</li><li>Ability to maintain confidentiality of sensitive information</li><li>Ability to establish and maintain effective working relationships with colleagues and LME/MCO stakeholders</li>\n</ul>\n<strong>Experience and Education Required:</strong>\n<br><br>\nBachelor’s Degree and two years of experience in business and/or analytical reporting in a human service, healthcare or business setting or an equivalent combination of education and experience.\n<br><br>\n<strong>Experience and Education Preferred:</strong>\n<br><br>\nBachelor’s Degree with business oriented coursework and experience in collecting, interpreting and reporting statistical data. Preferred experience with program integrity related to prevention and detection of healthcare fraud, waste, and financial abuse.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}