{"job title": "Healthcare Business Intelligence Data Analyst", "company": "Performant Financial Corporation", "city state": "– Sunrise", "rating": "3.1", "job description": "The Healthcare Data Business Intelligence Analyst's focus is to create and maintain new audit concepts and algorithms for Performants Client contract through concept research, data analysis, preparation of rule documents and code lists, and updating existing edits as needed. This position also creates complex and data mining pre-payment edits and algorithms.\n<br><br>\nEssential Responsibilities:\n\n<ul>\n<li>Identifying and developing new concepts to recoup inappropriate Medicare payment.</li>\n<li>Identifying concepts for potential recoupment through automated and complex audits by analyzing health services utilization data (e.g., Medicare claims) and researching sources of new concepts</li>\n<li>Researching concepts approved for development</li>\n<li>Applying appropriate Medicare, Medicaid and other regulatory policy and rules</li>\n<li>Participating in development of new concepts</li>\n<li>Creating new concept proposal forms</li>\n<li>Writing good cause and rationale documents</li>\n<li>Identifying pertinent regulatory back-up and references</li>\n<li>Developing selection criteria/edit parameters, including refining probes, analyzing probe results</li>\n<li>Selecting claim examples to prove the concept</li>\n<li>Assisting in the creation of medical review guidelines, as needed</li>\n<li>Mentoring and coordinating subcontractor</li>\n<li>Work with Data Mining Auditors and Data Engineering teams to develop and refine probes</li>\n<li>Performing QA functions of new concepts</li>\n<li>Working in partnership with department co-workers and across departments</li>\n<li>Keeping abreast of medical practice, changes in technology, and regulatory concepts that may affect the Client contract</li>\n<li>Lead the ideation efforts within Performant teams</li>\n</ul>\nRequired Skills and Knowledge:\n\n<ul>\n<li>Expertise in ICD-9-CM, ICD-10-CM/PCS, CPT-4, and HCPCS coding;</li>\n<li>Knowledge of the national coding standards, particularly payment rules</li>\n<li>Knowledge of commercial claims processing systems</li>\n<li>Knowledge of the Medicare program, particularly medical policy and payment</li>\n<li>Experience analyzing and manipulating health care data.</li>\n<li>Experience with diagnostic grouper tools and techniques (DRG, ETG, MEG) a plus.</li>\n<li>Data manipulation skills using database and spreadsheet applications.</li>\n<li>Working knowledge of database applications, including extraction and querying skills.</li>\n<li>Ability to analyze raw data and disseminate results, with ability to think logically, and process sequentially with a high level of detailed accuracy and coach junior analysts to perform same.</li>\n<li>Excellent written and verbal communication skills, with the ability to multitask and prioritize projects for self and subordinate team members, to meet scheduled deadlines.</li>\n</ul>\nPerformant Financial Corporation is an Equal Opportunity Employer.\n<br><br>\nPerformant Financial Corporation is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, national origin, ancestry, age, religion, gender, gender identity, sexual orientation, pregnancy, age, physical or mental disability, genetic characteristics, medical condition, marital status, citizenship status, military service status, political belief status, or any other consideration made unlawful by law.\n<br><br>\nNO AGENCY SUBMISSIONS\n<br><br>\nEducation and Experience:\n\n<ul>\n<li>10 plus years of healthcare provider reimbursement experience specific to managed care contracting, medical billing, claims auditing, claims analysis and/or actuarial analysis.</li>\n<li>BA/BS degree in Nursing, CS, Finance or Accounting preferred</li>\n</ul>"}