{"job title": "Salesforce Data Analyst Part-Time Intern – Undergrad", "company": "Proofpoint", "city state": "– Sunnyvale, CA", "rating": "3.2", "job description": "<div><div> <p><strong><u>Company Overview</u></strong></p>\n\n<p>At Proofpoint, we’re a team of superheroes protecting people, data, and brands from today’s advanced threats and compliance risks. We scout the best people in the business to:</p>\n\n<ul>\n<li>Build and enhance our proven security platform</li>\n<li>Blend innovation and speed in a constantly evolving cloud architecture</li>\n<li>Analyze new threats and offer deep insight through data-driven intel</li>\n<li>Collaborate with customers to help solve their toughest security challenges</li>\n</ul>\n\n<p>It is our sole mission to help our allies protect what matters most. That’s why we’re a leader in next-generation cybersecurity—and why more than half of the Fortune 100 trust us as a security partner.</p>\n\n<p><strong><u>Become a Superhero-In-Training</u></strong></p>\n\n<p>The Sales Operations team owns the Salesforce.com (SFDC) tool that is used widely by the entire company. We work with variety of stakeholders including Sales, Finance, Marketing and Customer Support to help them on SFDC tool. </p>\n\n<p>There are many ways an intern will contribute to our team. Highlights of this intern role include:</p>\n\n<ul>\n<li>Working on Salesforce Accounts, Leads and Contacts enrichment initiatives</li>\n<li>Performing SFDC data clean-up activities for Accounts, Contacts and Leads leveraging different tools like Discover.org, LinkedIn Sales Navigator, etc.</li>\n<li>Building and running reports in Salesforce for senior management</li>\n<li>Developing PowerPoint presentations based on the SFDC data for senior management</li>\n<li>Supporting Sales and Sales Operations for their day-to-day run-the-business requests</li>\n<li>Helping Sales and Marketing in prospecting new Accounts and Contacts globally</li>\n</ul>\n\n<p><strong><u>Your Current Super-Skills</u></strong></p>\n\n<ul>\n<li>Strong knowledge of Microsoft Excel and PowerPoint</li>\n</ul>\n\n<ul>\n<li>Strong problem solving and collaboration skills</li>\n<li>Good communication skills</li>\n<li>Knowledge of Project Management</li>\n</ul>\n\n<p><strong><u>Your Superhero Profile</u></strong></p>\n\n<p>You have the ability and interest in working <strong>part time</strong> (30 hours/week at maximum) <strong>onsite</strong> <strong>in our Sunnyvale, CA office</strong>. You are currently pursuing an <strong>undergraduate degree</strong>, and are successfully maintaining an above average GPA, preferably 3.0 or higher. This internship is scheduled to begin immediately and end on approximately August 30, 2019.</p>\n\n<p><strong><u>Launch your #LifeAtPFPT</u></strong></p>\n\n<p>As a customer focused and driven-to-win organization with leading edge products, there are many exciting reasons to join the Proofpoint team. We believe in hiring the best the brightest and cultivating a culture of collaboration and appreciation. Our summer interns are highly valued, and we strive to ensure all interns are provided with a meaningful work experience, as well as projects that are relevant to our interns’ interests. As we continue to grow and expand globally, we understand that hiring the right people and treating them well is key to our success! We are a multi-national company with locations in 10 countries, with each location contributing to Proofpoint’s amazing culture!</p>\n\n<p>#LI-DNP</p>\n\n<p> </p> </div></div><div><div> <br></div></div>"}