{"job title": "Sr Business Analyst - Data", "company": "The Hartford", "city state": "– United States-North Carolina-Charlotte", "rating": "3.7", "job description": "<div>The Commercial Markets Technology organization of The Hartford Financial Services Group is in the midst of a multi-million dollar investment initiative that will help redefine the landscape of IT. The Hartford is seeking qualified candidate to fill the role of a Senior Consultant Business Data Analysis in our Enterprise Data Organization.</div>\n<div> </div>\n<div>The ideal candidate will be accountable to lead Data initiatives – Business Data Analysis management lifecycle process in support of various Data projects mainly in the Commercial Line of Business. Candidate should possess strong functional knowledge of data management, business data analysis, business process mapping and project management expertise. Candidate must also be skilled in performing data analysis, agile delivery, data testing lead, consulting, thought leadership and strong customer interfacing competencies. </div>\n<div> </div>\n<div>The ideal candidate will by a dynamic person that has been engaged with Agile teams and can play a multi-faceted role within the team. He/she will be adaptable to change and can work fluidly with a team of resources performing in different roles on the team.</div>\n<div> </div>\n<div>Responsibilities:</div>\n<ul>\n<li>\n<div>Applies strong functional knowledge and elicitation techniques necessary to draw out data and analytics business requirements completely and accurately from stakeholders. Performs requirements planning, monitoring and requirements management.</div></li>\n<li>\n<div>Independently performs rigorous data analysis, data discovery and data profiling using industry standard querying tools to support business requirements development that are complete, clear, unambiguous, well written and appropriate to audience. </div></li>\n<li>\n<div>Maintains data mapping documents, bus matrix and/or other data design artifacts that define business data requirements and transformation rules. </div></li>\n<li>\n<div>Act as liaison and advisor/consultant between the business and IT stakeholders providing thought leadership. </div></li>\n<li>\n<div>Lead responsibility in mentoring, instructing, assigning, directing and checking the work of Business Data Analysts within their group.</div></li>\n<li>\n<div>Aid creation of the Test Strategy and assist with critical functional testing. </div></li>\n<li>\n<div>Acts as a change leader to help and drive implementation of industry best practices.</div></li>\n<li>\n<div>Provides support and consulting by answering questions, researching possible solutions to complex problems, and fostering open communication between the customer and development team. </div></li>\n<li>\n<div>Identifies logical, relevant business, data relationships between complex topics in the broader context of own project or functional area.</div></li>\n<li>\n<div>Identifies choices and improvement opportunities to better align own work with the direction and strategic priorities of the broader organization.</div></li></ul>\n<div> </div>\n<div>Additional responsibilities include:</div>\n<ul>\n<li>\n<div>Coordinate with Business Partners and Vendor Partners to elicit, analyze, communicate and validate requirements for delivering on our Enterprise wide strategic initiatives</div></li>\n<li>\n<div>Partner with cross-functional business leads and work tracks to drive Data Analysis delivery within Scope, Cost, Schedule and Quality</div></li>\n<li>\n<div>Support our Agile/Scrum team in delivering on strategic projects.</div></li>\n<li>\n<div>Knowledgeable in and contribute to other functions like Data Modeling, Data Mapping, Impact analysis and Testing</div></li>\n<li>\n<div>Effectively set expectations relative to own work and remains unbiased and open to alternative opinions and perspectives.</div></li>\n<li>\n<div>Identifies major factors critical to decision making and drives team to most efficient approach to enable and support decisions.</div></li>\n<li>\n<div>Drives small, medium and large audiences along well organized agendas.</div></li>\n<li>\n<div>Effective at structuring meetings, preparing materials with Business Data Lead (as appropriate) necessary to achieve desired goals and objectives.</div></li>\n<li>\n<div>Listens for comprehension and insight into both what, how something is communicated and relays information with consistent accuracy and completeness.</div></li>\n<li>\n<div>Enables team to learn and utilize different approaches in improving quality, execution and driving improvement opportunities.</div></li>\n<li>\n<div>Able to adapt to new team dynamics. Builds relationship and influence with business, peers and effectively establishes credibility.</div></li></ul>\n<p> </p>\n<ul>\n<li>\n<div>Bachelor degree in Computer Science or a related discipline, with an advanced degree preferred, and at least seven years of solid, diverse work experience in IT, or an equivalent combination of education and work experience.</div></li>\n<li>\n<div>6 years of experience in business requirements or data analysis supporting the Insurance industry and data warehouse or reporting/analytic projects. Possesses strong functional knowledge and skills reflective of a competent practitioner. </div></li>\n<li>\n<div>Proficient in industry standard querying tools and SQL build and execution for data analysis</div></li>\n<li>\n<div>Experience working on Agile projects </div></li>\n<li>\n<div>Knowledge or familiarity with dimensional database structure </div></li>\n<li>\n<div>Excellent facilitation, requirements elicitation and data analysis skills </div></li>\n<li>\n<div>Experience with mentoring and leading other Business Analyst or Data Analyst</div></li>\n<li>\n<div>Identifies industry best practices</div></li>\n<li>\n<div>Insurance Knowledge</div></li>\n<li>\n<div>Advanced business acumen with technical aptitude</div></li>\n<li>\n<div>Communication skills (both verbal and non-verbal)</div></li>\n<li>\n<div>Detail Oriented</div></li>\n<li>\n<div>Proven ability to organize and manage multiple priorities in a timeline driven environment.</div></li>\n<li>\n<div>Strong Presentation skills </div></li>\n<li>\n<div>Strong Leadership skills </div></li>\n<li>\n<div>Forward looking and focused on continuous improvement </div></li>\n<li>\n<div>Strong relationship building / interpersonal and influencing skills </div></li>\n<li>\n<div>Team player and able to work with and through others </div></li>\n<li>\n<div>Effectively establishes credibility</div></li>\n<li>\n<div>Effectively manages key stakeholders at all levels including senior leadership team in a matrix environment</div></li></ul>\n<p> </p>"}