{"job title": "Senior Research Scientist", "company": "Allen Institute for Artificial Intelligence", "city state": "– Seattle, WA", "rating": "4.9", "job description": "<strong>Senior Research Scientist</strong><br><br>The Allen Institute for Artificial Intelligence (AI2) is a non-profit research institute in Seattle founded by Paul Allen and headed by Professor Oren Etzioni. The core mission of (AI2) is to contribute to humanity through high-impact AI research and engineering. We are actively seeking post docs and Research Scientists at all levels who are passionate about AI and who can help us achieve this core mission by teaming to construct AI systems with reasoning, learning and reading capabilities.\n<br><br>\n<strong>Position Summary</strong>\n<br><br>\nAI2 currently has projects in the following areas:\n\n<ul>\n<li>Deep Learning</li>\n<li>Language and Vision</li>\n<li>Information extraction and semantic parsing</li>\n<li>Question answering</li>\n<li>Language and reasoning</li>\n<li>Machine learning and theory formation</li>\n<li>Semantic search</li>\n<li>Natural language processing</li>\n<li>Diagram understanding</li>\n<li>Visual knowledge extraction and visual reasoning</li>\n</ul>\nAnd more.\n<br><br>\nWe are seeking Senior Research Scientists who are creative, visionary thinkers and passionate about making major impacts in their field. At AI2, Senior Research Scientists at AI2 provide scientific leadership, define and conduct ground-breaking research, have the opportunity to lead small teams, and help drive and refine AI2's mission in an exciting, fast-paced research environment. They also have the opportunity to take a leading role in overseeing and implementing software systems supporting AI2's research, author and present scientific papers and presentations for peer-reviewed journals and conferences, and help develop collaborative and strategic relationships with relevant academic, industrial, government, and standards organizations.<br><br><strong>Why AI2</strong><br><br>In addition to AI2's core mission, we also aim to contribute to humanity through our treatment of each member of the AI2 Team. Some highlights are:\n\n<ul>\n<li><strong>We are a learning organization</strong> because everything AI2 does is ground-breaking, we are learning every day. Similarly, through weekly AI2 Academy lectures, a wide variety of world-class AI experts as guest speakers, and our commitment to your personal on-going education, AI2 is place where you will have opportunities to continue learning alongside your coworkers.</li> \n\n<li><strong>We value diversity -</strong> We seek to hire, support, and promote people from all genders, ethnicities, and all levels of experience regardless of age. We particularly encourage applications from women, non-binary individuals, people of color, members of the LGBTQA+ community, and people with disabilities of any kind.</li> \n\n<li><strong>We value inclusion -</strong> We understand the value that people's individual experiences and perspectives can bring to an organization, and we are building a culture in which all voices are heard, respected and considered.</li>\n<li><strong>We emphasize a healthy work/life balance</strong>  we believe our team members are happiest and most productive when their work/life balance is optimized. While we value powerful research results which drive our mission forward, we also value dinner with family, weekend time, and vacation time. We offer generous paid vacation and sick leave as well as family leave.</li>\n<li><strong>We are collaborative and transparent</strong>  we consider ourselves a team, all moving with a common purpose. We are quick to cheer our successes, and even quicker to share and jointly problem solve our failures.</li>\n<li><strong>We are in Seattle</strong>  and our office is on the water! We have mountains, we have lakes, we have four seasons, we bike to work, we have a vibrant theater scene, and we have so much else. We even have kayaks for you to paddle right outside our front door. We welcome interest from applicants from outside of the United States.</li>\n<li><strong>We are friendly</strong> chances are you will like every one of the 70+ (and growing) people who work here. We do.</li>\n</ul>\n\n<div>AI2 is proud to be an Equal Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.</div>\n<br>\n<div>If you need assistance or an accommodation due to a disability, you may contact us at hr@allenai.org or you may call us at 206-548-5600.</div>"}