{"job title": "Technical Product Owner - Senior Data Scientist", "company": "Amgen", "city state": "– Thousand Oaks, CA", "rating": "3.7", "job description": "Amgen is seeking a Sr Data Scientist to function as a Technical Product Owner at its main headquarters in Thousand Oaks, CA to join the Commercial IS organization and will be responsible for developing the vision of Advanced Analytics applications (Products) by identifying product features with key business stakeholders, conducting market research, determining specifications, pricing, and time-integrated plans for product experimentation, scaling, introduction and support. The Technical Product Owner will report to the Director IS and will define and communicate technology solutions, scans emerging technologies to advance Data Science capabilities at Amgen.\n<br><br>\nGCOIS is responsible for partnering with Amgen's Global Commercial Operations organization to deliver technology services and solutions that achieve corporate strategies and business plans. This role will service US Business Operations (USBO).\n\n\n<ul>\n<li>*Key Activities for a Technical Product Owner include:**</li>\n</ul>\n\n+ Develop a vision for the Product and is responsible for communicating that vision to Product Team\n<br><br>\n+ Assist with the elaboration of Epics, Themes and Features into user stories that are granular enough to be achieved in a single sprint\n<br><br>\n+ Create and maintain the product backlog. Confirms user stories accuracy, completion and definition of done\n<br><br>\n+ Inspect the product progress at the end of every Sprint\n<br><br>\n+ The Product Owner is responsible for the product and product features from concept to end of life. Advocate and champion use of industry best-practices, high-quality code, and compliance with department development processes\n<br><br>\n+ Proactively communicate delays or unforeseen problems that will delay assigned task\n<br><br>\n+ Develop and manage the budget from experimentation, scaling, deployment and support of the product\n\n\n<ul>\n<li>*Basic Qualifications**</li>\n</ul>\n\nDoctorate degree and 2 years of Information Systems experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nMaster's degree and 6 years of Information Systems experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nBachelor's degree and 8 years of Information Systems experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nAssociate's degree and 10 years of Information Systems experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nHigh school diploma / GED and 12 years of Information Systems experience\n\n\n<ul>\n<li>*Preferred Qualifications**</li>\n</ul>\n\n+ Bachelors or Master's Degree in Computer Science or related field with 8+ years of experience\n<br><br>\n+ Strong understanding of software architecture, design patterns, data structures &amp; algorithms\n<br><br>\n+ 6+ years of experience delivering IS products through Agile methodologies\n<br><br>\n+ Solid understanding of users, the market place, the competition, future trends of the Commercial domain and the application (product) being developed and understands Commercial ecosystem and business processes\n<br><br>\n+ 6+ Years experience with SQL, Data Modelling &amp; query optimization\n<br><br>\n+ 5+ Years experience with open source development tool chain (SVN, Git, Jenkins, etc)\n<br><br>\n+ Good understanding in building cloud native applications with one of big 3 cloud providers (AWS, Microsoft, Google). Delivered at least 2 applications with different use cases. Strong understanding of cloud provider architecture, concepts &amp; SDKs\n<br><br>\n+ Proven record of leading Agile teams with a history of using their experience and creativity to solve complex business problems in an innovative, yet practical manner\n<br><br>\n+ Experience delivering IS products in Product teams\n<br><br>\n+ Experience building use cases and developing IS product vision\n<br><br>\n+ Excellent communication skills\n<br><br>\n+ Certified Product Owner\n<br><br>\n+ Knowledge on managing data sets for applying learning models using tensor, keras etc.\n<br><br>\nAmgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.\n<br><br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status."}