{"job title": "Center for Observational Research and Data Science - Senior Data Scientist", "company": "Bristol Myers Squibb", "city state": "– Princeton, NJ", "rating": "3.7", "job description": "The Center for Observational Research and Data Science (CORDS) ? Senior Data Scientist role is an individual contributor that will be part of a newly established advanced analytics lab that supports BMS?s digital health initiatives. This is a highly visible position where the successful candidate will provide technical leadership to multi-disciplinary projects contributing to a range of research and development (R&amp;D) activities within BMS. We are looking for an experienced, hands-on data scientists who will build solutions to solve digital health-related problems such as predicting patient outcomes, creating novel data sources, identification of novel predictors, automating analysis and building interactive visualizations.\n<br><br>\nCore Responsibilities\n<br><br>\n+ Lead projects implementing predictive models using tools such as classification, survival analysis, time-series analysis and clustering to solve digital health business problems. Develop visualizations to effectively convey insights.\n<br><br>\n+ Establish novel data resources and predictors through processing of a variety of sources that could include medical records and reports, insurance claims, lab results, genomics and medical imagery.\n<br><br>\n+ Provide leadership and guidance on the application of established, new and emerging machine learning, AI and data visualization methods and tools to the BMS analytics community.\n<br><br>\n+ Mentor staff in development of functional and behavioral skills related to job performance\n<br><br>\n+ Complete other duties as assigned by Advanced Analytics Lead, CORDS\n<br><br>\nExperiences Required for Success\n<br><br>\n+ 5+ years experience applying data science methods and tools to diverse problems using R and/or Python. Experience applying deep learning tools such as TensorFlow, Keras, Theano and/or experience in the application of NLP will be highly regarded.\n<br><br>\n+ Experience in efficiently extracting data from a range of structured and unstructured sources.\n<br><br>\n+ Ability to develop high quality static and interactive visualizations using tools such as Tableau, ggplot, Plotly, Shiny or similar.\n<br><br>\n+ Proven capabilities in stakeholder engagement.\n<br><br>\n+ Proven strong writing and oral presentation skills and the ability to explain complex concepts to colleagues with varying degrees of technical knowledge.\n<br><br>\n+ Exposure to real world healthcare data, pharmaceutical industry research activities, and clinical research data (biomarkers, -omics data) will looked upon favorably.\n<br><br>\nKnowledge Desired\n<br><br>\n+ A Master?s degree or higher (PhD will be highly regarded) in data science, AI or a related quantitative field.\n<br><br>\n+ Strong technical and scientific knowledge in research methods applied to healthcare including non-interventional scientific disciplines\n<br><br>\n+ Awareness of the drug development &amp; commercialization process, HTA assessment methodologies, global reimbursement environment, and regulatory requirements.\n<br><br>\n+ Knowledge of the pharmaceutical industry and competitors (their strategy, drug discovery, the drugs, CR&amp;D, outcomes research and marketing).\n<br><br>\nBristol-Myers Squibb is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status."}