{"job title": "Lead Data Scientist", "company": "Cartus Corporation", "city state": "– Danbury", "rating": "3.2", "job description": "<br><b></b><br>Lead Data Scientist<br><br><b></b><br>14-May-2018<br><br><b>Auto req ID</b><br>81BR<br><br><b>Job description</b><br>PRIMARY FUNCTION:<br> <br>This is a leadership position in the technology organization that has oversight responsibility for developing the Advanced Analytics program. The incumbent will collaborate with the Analytics business product owner, Cartus business leaders in Sales, Marketing and with Client leadership to develop Predictive and Prescriptive analytic models for Cartus. The perfect candidate will have a background in a quantitative or technical field, will have experience working with large data sets and relational databases, and will have some experience in data-driven decision making. You are focused on results, a self-starter, and have superior computational, analytical and communication skills.<br> <br>The incumbent must be able to balance operational and strategic responsibilities, meeting Client specific requirements as well as Cartus' broader needs for analytics that can serve the entire spectrum of Clients. Analytics capabilities are a core component in winning new business, so a keen awareness of the constantly changing business requirements of customers, clients and suppliers is required. This position will work with senior project sponsors and cross-functional stakeholders on analytics solutions. Candidates must be able to drive solution adoption by leveraging key change management, communication and stakeholder management principles. They must be able to build collaborative relationships and be capable of helping business users and technology resources develop solutions that unlock business insight, enable impactful decisions, and win business.<br> <br>MAJOR DUTIES AND RESPONSIBILITIES:<br> <br>Predictive Modeling<br>-Using Cartus' data science toolkit which is a mix of SPSS Modeler, Python, R and SQL, analyze and model structured data and implement algorithms to support analysis using advanced statistical and mathematical methods from statistics, machine learning, data mining, econometrics, and operations research<br>-Utilizing your algorithmic/programming toolkit, build predictive models to improve profitability, growth, retention and other such key performance indicators for our clients<br>-Translate advanced business analytics problems into technical approaches that yield actionable recommendations, in diverse domains such as risk management, product development, marketing research, supply chain, and public policy; communicate results and educate others through insightful visualizations, reports and presentations<br>-Perform exploratory data analysis, generate and test working hypotheses, and uncover actionable trends and relationships<br>-Implement formal modeling processes from end to end including data gathering, data profiling, numerical model building, calibration, cross-validation, putting product into production, etc.<br>-After building the models, pilot “scorecards” to track model performance and calculated improvement to business.<br> <br>Test/Learn Analytics<br>-Perform Statistical Natural Language Processing to mine unstructured data, using methods such as document clustering, topic analysis, named entity recognition, document classification, and sentiment analysis<br>-Develop portfolio of growth acceleration test &amp; learn pilots with marketing, merchant, ecommerce, and external partners<br>-Lean-out testing processes to cut end-to-end cycles times and accelerate test cadence<br>-Establish robust A/B and fractional factorial testing methodologies including sample size requirements for readability and go/no-go criteria for scaling<br>-Create, maintain, and deliver dashboards and reports for KPI results from test measurements and communicate results to key stakeholders<br>-Conduct ad hoc analysis for internal partners as requested, including in-depth funnel and conversion analysis<br> <br>Data Munging<br>-Collect data from a wide variety of corporate databases, including various SQL databases, Access databases, and Excel files<br>-Help identify new external data sources pertinent to Cartus' business model<br>-Utilize your toolset in regular expressions to extract information from un-structured text documents<br>-Handle missing data through an algorithmic approach such as multiple imputations to enable insights in sparse and messy data<br>-Use your inner whiz-kid to “feature engineer” the data to boost model accuracy<br> <br>New Technology<br>-Evaluate current and emerging tools to recommend and architect an analytics platform for today and tomorrow's needs. Tools such as R, Python, Spark, Hadoop, Qlik, and Tableau are some examples<br>-Drive improvements to current analytics tools for external clients and customers to provide competitive advantage in winning new and retaining current business<br> <br>Leadership<br>-Lead exercises to help the business to understand their data quality, data completeness and analytics opportunities<br>-Lead project teams comprised of business users, enterprise data specialists, solution developers and change management agents to build, test, revise and launch analytical tools<br>-Explain complex modeling approaches in layman's terms and discuss modeling results and business case impacts with non-technical business users internally and with clients<br>-Support the maintenance and development of the analytics platforms<br>-Develop strong partnerships and work collaboratively with cross-functional and IT peers<br> <br> <br>Minimum Requirements:<br>-Master's degree, PhD preferred from an accredited college/university in Computer Science, Statistics, Mathematics, Engineering, Econometrics, or related fields, with five years of relevant experience and strong knowledge in at least one of the following fields: statistics, data mining, machine learning, statistics, operations research, econometrics, natural language processing, and/or information retrieval<br>-Strong analytical and conceptual skills, with proven ability to translate business problems into analytical specifications and requirements<br>-Deep experience in extracting, cleaning, preparing, and modeling data; command-line scripting, data structures, and algorithms; and working in a Windows environment<br>-Ability to work with clients to assess needs, provide assistance, and resolve problems, using excellent problem-solving skills and verbal/written communication to non-technical audiences<br>-Superior research, statistical, analytical, processing and mathematical skills with ability to structure and conduct analyses<br>-Proficiency with programming languages (e.g. Python, R, Java, Scala) desirable<br>-Strongly motivated to be a player in a team which is constantly working to improve themselves<br>-Strong project management and planning skills, with proven experience managing multiple projects<br>-Dynamic leadership style that can develop and energize multi-disciplined, high-performance work teams<br>-Excellent oral and written communications; ability to present and discuss technical information in laymen's terms that establishes rapport, persuades others and gains understanding<br>-Ability to create, foster, and extend relationships across all parts of the business, comfortable with influencing across and within the entire organization<br><br><b>External Title</b><br>Lead Data Scientist<br><br><b>Company</b><br>Cartus Corporation <br><br><b>Employment type</b><br>Full-time <br><br><b>About us</b><br>Cartus Corporation is the world s leading provider of employee relocation, mobility management and workforce development solutions. Operational for over 60 years, Cartus serves the corporate, government and affinity markets. We offer outsourcing, consulting, and intercultural &amp; language training services. With a staff of more than 2,500 employees, Cartus Corporation assists in relocation to over 160,000 clients annually. We operate in over 150 countries and provide an extensive portfolio of group move management solutions for companies undergoing structural changes. Cartus is a part of Realogy Corporation.<br><br><b>EEO statement</b><br>EOE AA M/F/Vet/Disability<br><br><b>State/Province/Region</b><br>Connecticut <br><br><b>City</b><br>Danbury<br>"}