{"job title": "Lead Data Scientist - Military Systems (Remote Opportunity)", "company": "KBRwyle", "city state": "– Niceville, FL", "rating": "3.0", "job description": "**Lead Data Scientist - Military Systems (Remote Opportunity)**<br> <br> <br> <br>**Description**<br> <br> <br> <br>**WHO WE ARE**<br> <br> <br> <br>KBRwyle is a global government services organization delivering full life cycle professional and technical services from over 60 U.S. and 40 international locations. Our core capabilities include logistics, engineering, science, cyber, intelligence and security services.<br> <br> <br> <br>**WHAT TO EXPECT**<br> <br> <br> <br>When you become part of the KBR team, your career opportunities are endless. We offer challenging assignments on some of the world's largest and most complex projects where our customers have come to value us, because they know, We Deliver!<br> <br> <br> <br>**ABOUT THIS POSITION**<br> <br> <br> <br>The successful candidate will be part of the KBRWyle team supporting the Test Resource Management Center?s (TRMC) Big Data (BD) and Knowledge Management (KM) Team working on prototype BD and KM systems for DoD testing Ranges and various acquisition programs. The successful candidate will provide project management oversight support to assigned software development tasks in support data analytics tasks.<br> <br> <br> <br>Other duties include: documenting, managing configuration, testing, and bug fixing involved in creating and maintaining applications and frameworks involved within an agile software release life cycle and resulting in a software product. The successful candidate will be expected to utilize BD and KM tools and follow processes that ensure high quality software is delivered.<br> <br> <br> <br>**Qualifications**<br> <br> <br> <br>**BASIC QUALIFICATIONS:**<br> <br> <br> <br>Bachelor's Degree in Computer Science or similar field AND (15) years of experience.Advanced degrees may be substituted for years of experience on a year-for-year basis.<br> <br> <br> <br>Previous engineering technical advisement or project management experience<br> <br> <br> <br>Clearance:<br> <br> <br> <br>Active or Current Secret Clearance required<br> <br> <br> <br>Knowledge / Skills / Abilities:<br> <br> <br> <br>+ Proficiency using at least one high-level programming language (Java (preferred), C , C\\#, etc.)<br> <br>+ Proficiency with web application technologies, such as JBoss, Apache Tomcat, etc.<br> <br>+ Experience developing applications using Big Data databases (e.g., Accumulo, HBase, MongoDB, Cassandra)<br> <br>+ xperience with some of the following: Hadoop, Cloudera, Hortonworks, Apache Storm, Apache Spark, HBase, YARN, map-reduce, big-data analytics, semantic-web (RDF, OWL), and graph-databases.<br> <br>+ Experience using Python, R scripting, and SQL.<br> <br>+ Knowledge of software design patterns, and Agile Development methodologies.<br> <br>+ Use of advanced Data Science techniques for Modeling and Simulation Programs<br> <br>+ Knowledge of Distributed Testing and Training<br> <br>+ Experience with a version control system (e.g., Git), issue/problem tracking system (e.g., Jira), team collaboration software (e.g., Confluence), and continuous integration environments (e.g., Jenkins).<br> <br>+ The Software Engineer must have the ability to work closely with other engineers to develop the best technical design and approach for new product development.<br> <br>+ Excellent written and verbal communications skills are desired, as the Software Developer will be in frequent contact with both a project technical lead, and be taking direction from various government leads.<br> <br> <br> <br>**ADDITIONAL QUALIFICATIONS**<br> <br> <br> <br>The preferred candidate will have experience working in government/defense labs and their computing restrictions.<br> <br> <br> <br>Knowledge of the Test and Training Enabling Architecture (TENA) and the Joint Mission Environment Testing Capability (JMETC).<br> <br> <br> <br>Experience working with major DoD Acquisition programs such as Joint Strike Fighter (JSF) or Missile Defense Agency (MDA)<br> <br> <br> <br>**INCLUDES:**<br> <br> <br> <br>Competitive health, wellness &amp; lifestyle benefits<br> <br> <br> <br>Inclusive, flexible and supportive company culture<br> <br> <br> <br>Ongoing training and development opportunities<br> <br> <br> <br>**LEARN MORE ABOUT KBRwyle:** https://www.kbr.com/markets/government<br> <br> <br> <br>KBR is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, disability, sex, sexual orientation, gender identity or expression, age, national origin, veteran status, genetic information, union status and/or beliefs, or any other characteristic protected by federal, state, or local law.<br> <br> <br> <br>**Job:** Engineering<br> <br> <br> <br>**Primary Location:** US-US-FL-Niceville<br><br>**Req ID:** 1063193"}