{"job title": "Data Scientist - Digital Attribution Developer", "company": "Nielsen", "city state": "– Boston, MA", "rating": "3.6", "job description": "<strong>Data Scientist - Digital Attribution Developer - 4511</strong>\n<br><br>\nAnalytics - USA Boston, Massachusetts\n<br><br>\n<strong>Understanding marketing effectiveness is critical to success of businesses across all verticals. As the world’s largest research organization, Nielsen is powered by talented, creative scientists and researchers. Visual IQ/Nielsen associates come from diverse disciplines that include business, economics, engineering, mathematics, operations research, and statistics. These professionals drive innovation and insight through continual ideation, complex analyses, and delivery of insights to our clients. Because measurement is at the core of Nielsen's business, our products have high visibility and make a direct impact on our clients.</strong>\n<br><br>\n<strong>Our team in Needham has an opportunity available for a Data Scientist. The ideal candidate must have work experience in the development of machine learning algorithms, expertise in modern analytics programming, digital advertising across multiple devices, a solid foundation in developing solutions for marketing, advertising organizations and/or pricing, and the capacity to work in an agile development environment alongside software engineers.</strong>\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n\n\t\n<li><strong>Design market response analytics models and approaches as applied to massive volumes of addressable data such as data created from digital advertising platforms</strong></li>\n\n<li><strong>Design and write modules for Visual IQ/Nielsen’s modeling and analytics platforms using a variety of high level programming languages including R and Python</strong></li>\n\n<li><strong>Extraction and handling of large volumes of data using SQL as well as big data technologies</strong></li>\n\n<li><strong>Create various prototypes for research and development purposes</strong></li>\n\n<li><strong>Document and present methodology inside and outside the company</strong></li>\n\n<li><strong>Partner with our Software Engineering department to build best-of-class web-based analytical solutions</strong></li>\n\n</ul>\n<strong>Requirements</strong>\n\n<ul>\n\n\t\n<li><strong>Ph.D. degree in Statistics, Economics, Applied Mathematics, Computer Science, Engineering, or other Quantitative Field of Study</strong></li>\n\n<li><strong>2+ years work experience in delivering analytics software solutions in a production environment</strong></li>\n\n<li><strong>2+ years work experience in machine learning as applied to marketing analysis, with an emphasis on statistical, econometric and predictive analytic research that drives analytic product Innovation and implementation</strong></li>\n\n<li><strong>Proficiency in SQL and big data technologies</strong></li>\n\n<li><strong>Expertise in analytics programming using R. Proficiency with other high level languages such as Python is highly desired.</strong></li>\n\n<li><strong>Exceptional problem solving skills</strong></li>\n\n<li><strong>Well-organized and capable of handling multiple mission-critical projects simultaneously while meeting deadlines</strong></li>\n\n<li><strong>Excellent oral and written communication skills</strong></li>\n\n</ul>\n<strong>Desired</strong>\n\n<ul>\n\n\t\n<li><strong>Experience in marketing attribution modeling</strong></li>\n\n<li><strong>Experience in cross device analytics</strong></li>\n\n<li><strong>Experience in marketing mix modeling with Nielsen or IRI syndicated data</strong></li>\n\n<li><strong>Experience with household/person-level loyalty card analytics</strong></li>\n\n<li><strong>Experience with big data analytics and/or machine learning techniques, including Apache Spark</strong></li>\n\n<li><strong>Experience with Scala and/or any other open source programming</strong></li>\n\n<li><strong>Short-release life-cycle experience (agile processes including scrum)</strong></li>\n\n</ul>\n<strong>About Nielsen:</strong>\n<br><br>\nNielsen N.V. (NYSE: NLSN) is a global performance management company that provides a comprehensive understanding of what consumers Watch and Buy. Nielsen’s Watch segment provides media and advertising clients with Total Audience measurement services across all devices where content — video, audio, and text — is consumed. The Buy segment offers consumer packaged goods manufacturers and retailers the industry’s only global view of retail performance measurement.\n<br><br>\nBy integrating information from its Watch and Buy segments and other data sources, Nielsen provides its clients with both world-class measurement as well as analytics that help improve performance. Nielsen, an S&amp;P 500 company, has operations in over 100 countries that cover more than 90 percent of the world’s population. For more information, visit www.nielsen.com\n<br><br>\n<em>Nielsen is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class.</em>\n<br><br>\n<strong>Job Type:</strong> Regular\n<br><br>\n<strong>Primary Location</strong>: Boston,Massachusetts\n<br><br>\n<strong>Secondary Locations:</strong> , , ,\n<br><br>\n<strong>Travel:</strong> Yes, 15% of the Time"}