{"job title": "Data Analyst - Scientist", "company": "Reston Consulting Group", "city state": "– Washington, DC", "rating": "NA", "job description": "RCG is seeking a Database Analyst/Scientist for a full-time position as part of an ongoing contract in Washington DC near Farragut West metro station. RCG is a growing federal contracting company looking for strong, energetic people to help support our clients.\n<br><br>\nPlease note: Due to the secure nature of this government agency, all candidates must be U.S. citizens and hold a current, active Secret clearance.\n<br><br>\nThe successful candidate will receive a contingent offer based on the outcome of a government background check. This will take several weeks, and the candidate cannot begin actual employment until the background check is successfully completed.\n<br><br>\n<strong>Duties and Responsibilities:</strong>\n<br><br>\nApply complex analysis of data in support of agency challenges; apply expertise in problem solving, scripting in multiple languages, as well as the creation and/or implementation of tools and processes that aid in advanced analytics, testing and quality assurance, and operations development. Use and develop statistical analysis, modeling, simulation, and machine learning methods. Use complex mathematical concepts and models for data collection and data management services; perform enterprise-wide data collection, storage, and manipulation. Develop and implement automated testing frameworks.\n<br><br>\n<strong>Required Qualifications:</strong>\n\n\n<ul>\n<li>BS degree in a related scientific or engineering discipline from an accredited college or university and minimum of 10+ years of progressive experience. Higher degree(s) may be substituted for up to 3 years of experience</li>\n<li>Experience with the following tools/languages: Python, R, STATA, Mathematica, Pig/Piglet, SQL, PostgreSQL, NoSQL, MSSQL, C++, bash, JMP, ROOT, Latex, MATLAB, Java, JavaScript, XML</li>\n<li>Experience with AWS/cloud development and solutions architecture</li>\n<li>Experience with Agile Methodology/Scrum Development</li>\n<li>Familiar with TFS, Jira and Confluence</li>\n<li>Knowledge of consolidating disparate datasets using data analytic methods; experience analyzing unstructured or poorly structured datasets to answer specific analytic needs</li>\n<li>Experience serving as a process expert for integrating new data analytic solutions into existing, non-data centric, workflows</li>\n<li>Experience working with multiple stakeholders, gathering requirements, analysis and integration resulting in informed decision making; explaining highly technical concepts to a non-technical audience</li>\n</ul>\n\n<strong>Desirable Qualifications or Exceptional Candidate:</strong>\n\n\n<ul>\n<li>MS in Engineering, Computer Science, Information Systems, Math, or related scientific or technical discipline</li>\n<li>AWS Solutions Architect</li>\n<li>Certified ScrumMaster</li>\n</ul>\n\nPhysical Demands: Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<br><br>\nRCG, Inc. does not discriminate against qualified individuals based on their status as protected veterans or individuals with disabilities and prohibits discrimination against all individuals based on their race, color, religion, sex, sexual orientation/gender identity, or national origin."}