{"job title": "Scientist II - Small Molecule", "company": "Thermo Fisher Scientific", "city state": "– Charleston, SC", "rating": "3.3", "job description": "Job Description<br><br><strong>Summary:</strong>\n<br><br>\nProvides moderately complex analyses in a chemistry or microbiological environment within defined procedures and practices. Performs analytical methods for moderately complex testing on raw materials, samples, stability, production intermediates, environmental monitoring, sterility tests, growth promotion, microbial limits tests, and/or and antimicrobial effectiveness tests. Supports internal development and/or manufacturing operations. Makes detailed observations and reviews, documents, and communicates test results; recommends solutions.\n<br><br>\n<strong>Essential Functions:</strong>\n<ul>\n<li>Conducts moderately complex chemical and physical testing of pharmaceutical raw materials, packaging components, finished products, microbiological, and stability samples by internally developed and completed test methods.</li><li>Executes validated test methods for pharmaceutical raw materials and finished products for strength, impurities, identity, and dissolution by HPLC, GC, dissolution, spectroscopy, and traditional quantitative analysis, utilizing HPLC, GC, LC/MS, dissolution, spectroscopy, and/or traditional wet chemical testing.</li><li>Recognizes and reports out-of-specification or unexpected results and non-routine analytical and product problems; recommends solutions.</li> <li>Maintains and troubleshoots analytical instrumentation as needed.</li><li>Clearly and accurately communicates the results of work by creating documentation of the testing/analysis and obtained results.</li><li>Records and reports results of analysis in accordance with prescribed lab procedures and systems.</li><li>May interact with clients.</li><li>Prepares and assists in filing regulatory documents in support of internal projects.</li> <li>Provides communications with outside departments, corporate sites, agencies, and clients.</li><li>Writes SOPs and other instructional documents.</li><li>Cleans and organizes work area, instrumentation, and testing materials.</li><li>Cleans HPLC and dissolution systems after use.</li> <li>Performs all duties in strict compliance with Standard Operating Procedures, Good Manufacturing Practices, Good Laboratory Practices, and Safety guidelines.</li><li>Maintains the necessary compliance status required by company and facility standards.</li>\n</ul>\n<strong>Education:</strong>\n<br><br>\nBachelors degree in physical science, preferably in Chemistry or Biology.\n<br><br>\n<strong>Experience:</strong>\n<br><br>\nRequires 5+ years of experience in a QC environment, preferably in a pharmaceutical environment, performing tests or analyses for pharmaceutical raw materials, finished products, or microbiological samples. Experience with common office software and chromatographic data acquisition systems.\n<br><br>\n<strong>Competencies:</strong>\n<ul>\n<li>Good knowledge and understanding of chemistry and analytical instrumental technologies.</li><li>Good knowledge of qualitative and quantitative chemical or microbiological analysis.</li><li>Good knowledge of quality and regulatory requirements in the pharmaceutical industry, including pharmaceutical GMPs and descriptive organic chemistry.</li><li>Good problem solving skills and logical approach to solving scientific problems.</li><li>Proficiency with HPLC, GC, LC/MS and Dissolution techniques.</li><li>Good interpersonal and communication skills (both oral and written).</li><li>Good presentation skills to present information to customers, clients, and other employees.</li><li>Ability to read, analyze, and interpret technical procedures and governmental regulations.</li><li>Ability to write standard operating procedures, simple protocols, and reports.</li><li>Ability to respond to common inquiries or complaints from customers or regulatory agencies.</li><li>Ability to apply mathematical operations, to such tasks as determination of test reliability, analysis of variance and correlation techniques.</li>\n</ul>\n<strong>Physical Requirements:</strong>\n<br><br>\nPosition requires ordinary ambulatory skills and physical coordination sufficient to move about office locations; ability to stand, walk, stoop, kneel, crouch periodically for prolonged periods of time; manipulation (lift, carry, move) of light to medium weights of 10-35 pound pounds; arm, hand and finger dexterity, including ability to grasp and type for prolonged periods of time; visual acuity to use a keyboard, computer monitor, operate equipment, and read materials for prolonged periods of time; ability to sit, reach with hands and arms, talk, and hear for prolonged periods of time. Safety glasses, safety shoes, lab coat, latex or similar gloves, safety apron, organic respirator occasionally.\n<br><br>\n<strong>Disclaimer:</strong>\n<br><br>\nThis job description is intended to present the general content and requirements for the performance of this job. The description is not to be construed as an exhaustive statement of duties, responsibilities, or requirements. Managers and supervisors may assign other duties as needed.\n<br><br>\nNothing contained herein should be construed to create an employment contract. Occasionally, required skills/experiences for jobs are expressed in brief terms. Any language contained herein is intended to fully comply with all obligations imposed by the legislation of each country in which it operates, including the implementation of the EU Equality Directive, in relation to the recruitment and employment of its employees<br><br>If you are an individual with a disability who requires reasonable accommodation to complete any part of our application process, click here for further assistance.<br><br>Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status."}