{"job title": "Senior Application Scientist", "company": "Thermo Fisher Scientific", "city state": "– San Jose, CA", "rating": "3.3", "job description": "Job Description<br><br>When youre part of the team at Thermo Fisher Scientific, youll do important work, like helping customers in finding cures for cancer, protecting the environment or making sure our food is safe. Your work will have real-world impact, and youll be supported in achieving your career goals.\n<br><br>\n<strong>Location/Division Specific Information</strong>\n<br>\nSan Jose, CA or Boston, MA\n<br><br>\n<strong>How will you make an impact?</strong>\n<br>\nThe Senior Application Scientist will be responsible for application development to support strategic growth in the clinical research and toxicology sector in the Chromatography and Mass Spectrometry Division. The position will require frequent interaction with various groups within the company, including Product Marketing, R&amp;D, product support, commercial teams, demo labs, as well as our customers. This position will be reporting to the Manager, Vertical Marketing.\n<br><br>\n<strong>What will you do?</strong> \n\n\n<ul>\n<li>Develop LC-MS methods/workflow on small molecules, proteins and peptides for clinical research or toxicology applications.</li>\n<li>Design and execute experiments to support New Product Introduction</li>\n<li>Support collaborations with key opinion leaders from application perspective and leverage data/results from such collaborations for marketing collateral</li>\n<li>Publish technical/application notes, posters, peer-reviewed articles and various marketing collateral</li>\n<li>Attend scientific conferences/tradeshows to support various marketing activities</li>\n<li>Train sales and/or customers on our workflow and deliver key product propositioning information</li>\n<li>Interact with the global commercial teams to support pre- and post- sales requirements</li>\n</ul>\n\n<strong>How will you get here?</strong>\n<br>\nMS/Ph.D degree in Science (chemistry, biology or related discipline)\n<br><br>\n• Minimum 5 years of hands-on LCMS and/or GCMS experience and expertise in small and/or large molecules method and applications development\n\n\n<ul>\n<li>Experience in Proteomics and/or metabolomics is preferred.</li>\n<li>Strong domain knowledge of the clinical research and toxicology analytical industries is preferred.</li>\n</ul>\n\n<strong>Knowledge, Skills, Abilities</strong>\n\n\n<ul>\n<li>High comfort level of interacting, discussing, and presenting to internal/external customers</li>\n<li>Ability to travel 25%</li>\n</ul>\n\nAt Thermo Fisher Scientific, each one of our 65,000 extraordinary minds has a unique story to tell. Join us and contribute to our singular missionenabling our customers to make the world healthier, cleaner and safer.\n<br><br>\nApply today! http://jobs.thermofisher.com\n<br><br>\n<em>Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status.</em><br><br>If you are an individual with a disability who requires reasonable accommodation to complete any part of our application process, click here for further assistance.<br><br>Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status."}