{"job title": "Scientist I, Manufacturing Sciences", "company": "Thermo Fisher Scientific", "city state": "– Canoga Park, CA", "rating": "3.3", "job description": "Job Description<br><br>When you join us at Thermo Fisher Scientific, youll be part of a smart, driven team that shares your passion for exploration and discovery. With revenues of $22 billion and the largest investment in R&amp;D in the industry, we give our people the resources and opportunities to make significant contributions to the world.\n<br><br>\n<strong>How will you make an impact?</strong>\n<br><br>\nThe Scientist I, Manufacturing Sciences is responsible for managing and prioritizing assigned projects related to development and improvement of DNA-based diagnostic reagents with supervision.\n<br><br>\n<strong>What will you do?</strong>\n<br><br>\n· Simultaneously manage and prioritize multiple projects and products across multiple functional groups while meeting target due dates with guidance of supervisor/lead\n<br><br>\n· Design, create experimental task, run tests and be able to look at data and complete analysis using Fusion, Orchid, or equivalent software, can provide experimental task(s) to designated Scientist with Supervisor approval\n<br><br>\n· Be able to identify improvements, initiate and implement the solutions with the guidance of the supervisor\n<br><br>\n· Adapt, implement and train current and new Scientist I lab functions/procedure to other Scientists and provide guidance and support throughout projects and product builds (SAP, Operate UV spectrophotometer, thermal cycler, agarose gel electrophoresis, UV image analyzer, Luminex 200, FlexMAP3D, high speed centrifuge and other hardware. Reconstitution, quantification, QC test, organization and maintenance of all raw materials such as oligonucleotides, ancillary reagents, and genomic DNAs, etc.)\n<br><br>\n· Coordinate, plan and manage the day-to-day tasks to maintain the project(s)/product(s) workflow with guidance from Scientist II/III/Supervisor\n<br><br>\n· Manage, plan, and design experimental methods under supervision as needed to achieve technical objectives as well as identify and solve problems with minimum complexity\n<br><br>\n· Prepare accurate and timely reports to Scientist II-III/Management\n<br><br>\n· Conduct maintenance and organization of reagents and equipment\n<br><br>\n· Maintain and perform with all aspects of receiving and quality control testing of raw materials\n<br><br>\n· Update and maintain raw material and semi inventories. Be able to do Cycle count\n<br><br>\n· Prepare and QC buffer solutions\n<br><br>\n· Be able to efficiently handle multiple tasks and projects simultaneously\n<br><br>\n· Maintain and update all required SOPs and quality records of equipment maintenance, tests, analyses and other relevant data with the guidance of Scientist II/III/Supervisor\n<br><br>\n· Additional duties and responsibilities assigned as needed\n<br><br>\n<strong>How will you get here?</strong>\n<br><br>\n<strong>Education</strong>\n<br><br>\n· Bachelors degree in Biological Sciences, Chemistry, Molecular Biology or related field\n<br><br>\n<strong>Experience &amp; Knowledge, Skills, Abilities</strong>\n<br><br>\n· Knowledge and hands-on experience of molecular biology and recombinant DNA techniques\n<br><br>\n· Knows basic principles, methods and practices of HLA and scientific/technical field or software, typically via formal study and/or work in the field\n<br><br>\n· Able to complete assigned tasks in a timely manner\n<br><br>\n· Strong organizational and time management skills, as well as ability to work in a detail-oriented manner\n<br><br>\n· Ability to exercise decision making with the guidance of Supervisor/Scientist II-III\n<br><br>\n· Collects and organizes data in an appropriate manner, including documenting all experiments in a laboratory notebook or appropriate documentation\n<br><br>\n· Ability to use PCs for data input and/or analysis and excellent computer MSOffice skills\n<br><br>\n· Plan and organize oneself in a consistent manner and maintain work schedules. Be a self-starter with the ability to positively motivate others in a cooperative fashion\n<br><br>\n· Follow oral and written directions. Read, understand and implement written laboratory procedures. Communicate clearly and concisely, orally and in writing\n<br><br>\n· During situations that have high impact to the business, quickly escalate them by bringing solutions and consulting with Supervisor\n<br><br>\n· Be able to efficiently handle multiple tasks and projects simultaneously\n<br><br>\n· Maintain confidentiality of sensitive laboratory and business data\n<br><br>\n· Ensure that safe laboratory procedures and protocols are followed at all times, especially in the application of universal precautions in handling of all blood and blood products\n<br><br>\n· Ensure all processes and teams are in adherence of cGMP and GDP\n<br><br>\n· Ensure compliance with corporate, site, and regulatory policies, practices, and guidelines\n<br><br>\n· Work as a cooperative member of a Production team. Ability to collaborate effectively with all functions.\n<br><br>\n<strong>Working Conditions/Physical Requirements</strong>\n<br><br>\n· Frequently work at lab bench, low temperature freezers and PC workstations.\n<br><br>\n· Handle blood samples and blood byproducts occasionally.\n<br><br>\n· Some lifting of objects including laboratory instrumentation of 35 pounds.\n<br><br>\n· Work in office/computer/analysis\n<br><br>\nAt Thermo Fisher Scientific, each one of our 70,000 extraordinary minds has a unique story to tell. Join us and contribute to our singular missionenabling our customers to make the world healthier, cleaner and safer. Apply today! http://jobs.thermofisher.com\n<br><br>\nThermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status.<br><br>If you are an individual with a disability who requires reasonable accommodation to complete any part of our application process, click here for further assistance.<br><br>Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status."}