{"job title": "Senior Analyst Data Science", "company": "Toyota North America", "city state": "– Dallas, TX", "rating": "3.8", "job description": "<div><b>Who we are</b></div>\n<div><strong></strong> </div>\n<div>Collaborative. Respectful. A place to dream and do. These are just a few words that describe what life is like at Toyota. As one of the world’s most admired brands, Toyota is growing and leading the future of mobility through innovative, high-quality solutions designed to enhance lives and delight those we serve. We’re looking for diverse, talented team members who want to grow and challenge what’s possible with us. </div>\n<div> </div>\n<div>An important part of the Toyota family is Toyota Financial Services (TFS), the finance and insurance brand for Toyota and Lexus in North America. While TFS is a separate business entity, it is an essential part of this world-changing company – delivering on Toyota’s vision to move people beyond what’s possible. At TFS, you will help create best-in-class customer experiences in an innovative, collaborative environment.</div>\n<div> </div>\n<div> </div>\n<div><b>Who we’re looking for</b></div>\n<div> </div>\n<div>The TFS Risk team is looking for a passionate and highly-motivated Senior Analyst, Data Science.</div>\n<div> </div>\n<div>The primary responsibility of this role is to uncover actionable insights from large sets of data, modeling risk across core areas of the credit lifecycle, including but not limited to: Residual Value, Collections, Originations, and Dealer Risk. This person will develop forecasts from these insights and historical experience while running research using advanced analytical and experimental approaches. The data science team within risk is critical to the success of the organization and its ability to be competitive and to grow with the times. These decisions span everything from which customers to approve/decline up through how much provision for loan losses should the business account for on their books. </div>\n<div> </div>\n<div>A successful candidate will bring 2 or more years of statistical modeling experience and a Master’s within a quantitative discipline, or MBA. Advanced hands on experience with tools such as R, Python (Numpy/Pandas), scikit-learn, CART, Stata, TreeNet, SAS, and/or JMP is required. This person will be well versed in using a variety of statistical and machine learning techniques to problem solve, such as Logistic Regression, Time Series, Experimental Design, Generalized Linear Models, Mixed Modeling, Multivariate Statistics, Large-Scale Predictive Modeling, CHAID/decision trees, Neural Networks, Monte-Carlo, Survival Analysis, Ensemble Models, etc.</div>\n<div> </div>\n<div> </div>\n<div><b>What you’ll be doing </b></div>\n<ul>\n<li>Evaluate, recommend, and develop statistical and machine learning solutions for a diverse range of Credit Risk and Residual Value projects</li>\n<li>Engineer innovative solutions alongside business groups to improve predictive accuracy, automate forecast delivery, and provide decision support across multiple levels of management</li>\n<li>Design, develop, and refine predictive models integrated into new and existing operational solutions.</li>\n<li>Wrangle data from internal and industry sources to develop, leverage, and enhance analysis and predictive modeling</li>\n<li>Use the latest analytical tools to programmatically extract, clean, and analyze large, disparate, and disorderly data sets</li></ul>\n<div><strong>What you bring </strong></div>\n<div><strong></strong> </div>\n<div> </div>\n<ul>\n<li>Master’s or PhD in Statistics, Economics, Computer Science or other quantitative degree, or an MBA</li>\n<li>Hands on experience with analytical tools, such as: R, Python (Numpy/Pandas), scikit-learn, CART, Stata, TreeNet, SAS, JMP </li>\n<li>Proficiency in various statistical techniques, such as: Logistic Regression, Time Series, Experimental Design, Generalized Linear Models, Mixed Modeling, Multivariate Statistics, Large-Scale Predictive Modeling, CHAID/decision trees, Neural Networks, Monte-Carlo, Survival Analysis, Ensemble Models</li>\n<li>Ability to apply lateral thinking in engineering predictive models, analytical solutions, and ad hoc decision support to statisticians, data scientists, and business groups</li>\n<li>Experience in developing and implementing predictive models </li></ul>\n<div><strong></strong> </div>\n<div><strong></strong> </div>\n<div><strong>What we’ll bring</strong></div>\n<div><strong></strong> </div>\n<div>During your interview process, our team can fill you in on all the details of our industry-leading benefits and career development opportunities. A few highlights include:</div>\n<ul>\n<li>\n<div>A work environment built on teamwork, flexibility and respect</div></li>\n<li>\n<div>Professional growth and development programs to help advance your career, as well as tuition reimbursement</div></li>\n<li>\n<div>Vehicle purchase &amp; lease programs </div></li>\n<li>\n<div>Comprehensive health care and wellness plans for your entire family</div></li>\n<li>\n<div>Flexible work options based on business needs</div></li>\n<li>\n<div>Toyota 401(k) Savings Plan featuring a company match, as well as an annual retirement contribution from Toyota regardless of whether you contribute</div></li>\n<li>\n<div>Paid holidays and paid time off</div></li>\n<li>\n<div>Referral services related to prenatal services, adoption, child care, schools and more</div></li>\n<li>\n<div>Flexible spending accounts</div></li>\n<li>\n<div>Relocation assistance </div></li>\n<li>\n<div>Onsite amenities such as fitness center, restaurants, etc.</div></li></ul>\n<p> </p>\n<p> </p>\n<div><strong>What you should know</strong></div>\n<div> </div>\n<div>Our success begins and ends with our people. We embrace diverse perspectives and value unique human experiences. We are proud to be an equal opportunity employer that celebrates the diversity of the communities where we live and do business. Applicants for our positions are considered without regard to race, ethnicity, national origin, sex, sexual orientation, gender identity or expression, age, disability, religion, military or veteran status, or any other characteristics protected by law.</div>\n<div> </div>\n<div><strong> </strong></div>\n<div>Have a question or need assistance with your application? Check out the How to Apply section of our careers page on Toyota.com! </div>\n<div> </div>\n<div>#LI-KT1</div>"}