{"job title": "Scientist", "company": "Vencore", "city state": "– Herndon, VA", "rating": "3.2", "job description": "<ul>\n<li>*Overview**</li>\n</ul>\n\nEvery day at Perspecta, we enable hundreds of thousands of people to take on our nation?s most important work. We?re a company founded on a diverse set of capabilities and skills, bound together by a single promise: we never stop solving our nation?s most complex challenges. Our team of engineers, analysts, developers, investigators, integrators and architects work tirelessly to create innovative solutions. We continually push ourselves?to respond, to adapt, to go further. To look ahead to the changing landscape and develop new and innovative ways to serve our customers.\n<br><br>\nPerspecta works with U.S. government customers in defense, intelligence, civilian, health care, and state and local markets. Our high-caliber employees are rewarded in many ways?not only through competitive salaries and benefits packages, but the opportunity to create a meaningful impact in jobs and on projects that matter.\n<br><br>\nPerspecta?s talented and robust workforce?14,000 strong?stands ready to welcome you to the team. Let?s make an impact together.\n<br><br>\nPerspecta is an AA/EEO Employer - Minorities/Women/Veterans/Disabled and other protected categories\n\n\n<ul>\n<li>*Responsibilities**</li>\n</ul>\n\nProvides specialized subject matter expertise in CSR technical areas (e.g., spectrum management, surveillance sensors, wide-band wireless communications, broadband, narrowband, land mobile radios, sensors, video analysis, imaging, etc.). Performs research, collection and collation of data from technical studies. Responsible for the compilation of data, and preparation of inputs into larger reports. Performs assessments and projections as part of analysis process. Develops technical reports and briefings, project deliverables, monthly status reports and other finished products. May draft policy recommendations for environmental, habitat, and species protection. Interfaces with external entities to collect data. Uses and/or develops computer tools to facilitate analysis tasks. Prepares monthly status reports. May be assigned to customer site and participates in meetings as the representative of the company. May prepare and present technical briefings to customer and upper management. May be required to train customer personnel in analysis methods and/or findings. May also work as political activists who encourage politicians to change laws that help protect dwindling populations.\n\n\n<ul>\n<li>*Qualifications**</li>\n</ul>\n\nSkilled in wired and wireless network engineering as well as familiar with RF/microwave technologies. Experienced in requirements definition, design, evaluation, testing, and maintenance of telecommunications systems. Familiar with Non-Intrusive Inspection (NII) equipment, radiological, biological, IR, and ground sensing technologies. Holds CCNP or CCDP certification. Familiar with tools such as Cisco Anyconnect, HTZ Warfare, and/or TxtTower. Requires 5 to 8 years with BS/BA or 3 to 5 years with MS/MA or 0 to 2 years with PhD.\n<br><br>\nSubmit employee referral\n<br><br>\nSorry the Share function is not working properly at this moment. Please refresh the page and try again later.\n\n\n<ul>\n<li>*Connect With Us!**</li>\n</ul>\n\nNot ready to apply?for general consideration.\n\n\n<ul>\n<li>*Req #** _2018-51510_</li>\n<li>*Category** _Scientific_</li>\n<li>*\\# of Openings** _1_</li>\n<li>*Job Location** _US-Herndon-VA_</li>\n<li>*Clearance** _Public Trust_</li>\n</ul>"}