{"job title": "Deep Learning Scientist", "company": "AIG", "city state": "– New York, New York", "rating": "3.2", "job description": "<strong>Position Summary</strong>\n<br><br>\nThe Science team at AIG develops AI-first products (apps and services that use machine learning to <em>inform</em> and <em>assist</em> their users) for both insurance and investment arms of AIG. This is mainly achieved through:\n<ul>\n<li>Incubation of disruptive innovation (via scientists, engineers and designers working together)</li>\n<li>Machine learning R&amp;D (and publication in top AI/ML conferences and journals)</li>\n<li>Provision of machine-learning advisory / consulting to AIG's global businesses.\n<br><br>\nThe resulting solutions and innovations aim to reinvent AIG's internal processes, improve AIG's offerings to its clients (in line with the company's mission to be its clients' most valued insurer), and ultimately disrupt the wider insurance industry.\n<br><br>\nAs a critical role in Science's success, we are looking to hire Deep Learning Scientists to join our team and contribute to the development and implementation of the algorithmic core of a series of exciting new products / projects. We are currently hiring Deep Learning scientists across following themes (to name a few):</li>\n</ul>\n\n\n<ul>\n<li>Natural Language Processing (NLP).</li><li>Deep Reinforcement Learning, Unsupervised Learning, and Generative models.</li><li>Computer Vision.</li><li>Recurrent Neural Networks, Sequence Learning and Sequence Analysis.</li>\n</ul>\nThis is an exciting opportunity for those who want to enjoy state-of-the-art R&amp;D and be challenged and grow as a Deep Learning Scientist; along the way this role will contribute to game-changing products for the multi-trillion-dollar insurance industry and use AIG's (the world's largest insurer by many metrics) global network to deliver impact and change.\n<br><br>\n<strong>Responsibilities and Performance Objectives</strong>\n<ul>\n<li>Employ the best of Deep Learning research for solving business problems - disrupting the current practice in insurance and investment.</li><li>Build and refine Deep Learning algorithms that can find \"useful\" patterns in large multi-modal data (particularly, images, text, conversations, and transactional data).</li><li>Provide the business with new product ideas, as well as data-driven apps, insights and strategies.</li><li>Communicate (both oral and written) with colleagues and stakeholders (both internal and external).</li><li>For more senior candidates: Lead, inspire and mentor junior scientists and research assistants / interns.</li>\n</ul>\n<strong>Required Attributes</strong>\n<br><br>\nBoth senior candidates (e.g., with years of post-doctoral and/or commercial experience) and junior candidates are welcome to apply; we have and will offer positions appropriate to expertise and level of experience.\n<br><br>\nThe minimum required skills include:\n<ul>\n<li>An advanced degree in a numeric discipline (e.g., Statistics, Machine Learning, Computer Science, Engineering, and Physics).</li><li>Completion of one significant project (equivalent of a PhD research project, and/or a viable commercial product) in one or more of the hiring themes.</li><li>Scientific expertise, strong track record, and real-world experience in Deep Learning, especially with hands-on experience in hyper-parameter tuning and deep construction / distribution (e.g., architecture design in DNN/CNN/RNN, parameter initialization, activation, normalization, and optimization).</li><li>Expertise in programming (e.g., Python and C++) and computing technologies (high-performance computing, e.g., CUDA).</li><li>Ability to use existing deep / machine learning libraries (e.g., TensorFlow, Torch, Theano, Caffe, and scikit-learn).</li><li>Experience with the data and platform aspects of the projects.</li><li>Review, direct, guide, inspire the research of the more junior scientists in the team (especially applicable to more senior candidates).</li>\n</ul>\n<strong>An ideal candidate (is not required to, but) will also have</strong>\n<ul>\n<li>Track record in integrating deep learning with real-time computing (including mobile apps and front-end systems).</li><li>Experience in employing deep learning in a commercial setting - in collaboration with product development teams.</li><li>Publication record in (and willingness to represent AIG in) top machine learning journals (e.g., AI, TPAMI, IJCV, and JMLR) and conferences (e.g., NIPS, ICML, CVPR, ICCV, ECCV, ACL, EMNLP, ICLR, and IJCV).</li><li>Experience of working with engineering and design / product teams.</li><li>Broad knowledge of machine learning (including topics such as graph theory, hierarchical modeling, and Bayesian inference).</li><li>Practical experience of modern big-data computing ecosystems (e.g., Apache Spark).</li><li>The ability to engage with business stakeholders (with excellent oral and written communication skills).</li>\n</ul>\n<strong>About AIG</strong>\n<br><br>\nAmerican International Group, Inc. (AIG) is a leading global insurance organization. Founded in 1919, today AIG member companies provide a wide range of property casualty insurance, life insurance, retirement products, and other financial services to customers in more than 80 countries and jurisdictions. These diverse offerings include products and services that help businesses and individuals protect their assets, manage risks and provide for retirement security. AIG common stock is listed on the New York Stock Exchange and the Tokyo Stock Exchange.\n<br><br>\nJoin our Talent Network at http://www.aig.com/careers/life-at-aig/join-the-talent-network. Additional information about AIG can be found at www.aig.com and http:// www.aig.com/strategyupdate | <strong>YouTube:</strong> http://www.youtube.com/aig | <strong>Twitter:</strong> @AIGinsurance | LinkedIn: http://www.linkedin.com/company/aig. These references with additional information about AIG have been provided as a convenience, and the information contained on such websites is not incorporated by reference into this press release."}