{"job title": "Sr. Applied Scientist", "company": "Amazon", "city state": "– US, WA, Seattle", "rating": "3.8", "job description": "We are building a small Science and ML Technology team to focus on improving the customer delivery experience by detecting patterns, trends, and insights \"hiding\" in massive amounts of data. Then, leveraging science and intelligent ML to highlight the biggest opportunities and systematically reduce and eliminate classes of defects in order of impact and importance. Our work will directly impact millions of daily package deliveries worldwide and help assure we keep our customer promise of delivering packages to the right place, at the right time, and with the right level of professionalism. We will continuously learn, innovate, and improve the Amazon customer delivery experience. If you have expert level skills and want to be part of this small special group read on, and apply.\n<br><br>\nAs the Science and ML technology team our job is to leverage big data to identify key patterns of success and failure, identify the areas we need to focus on first, understand root cause(s) that triggered failure, and to build predictive models that will help fix the most impactful problems. The amount of data, the variables that come into play, and diversity of customers and locations make this role very challenging and also fun. It starts with dealing with enough ambiguity thatll scare most people way, entails asking lots of smart question that will lead to the discovery of universal concepts, and truly innovative ML solutions that continuously improve the customer delivery experience. Every member of the team needs to have independent thinking, a burning desire to learn, and the skills and experience needed to build science and technology so advanced that it will appear to generate magical outcomes.\n<br><br>\nAs part of your daily work you will:\n<br>\n· Think about customers and how to improve the customer delivery experience\n<br>\n· Use machine learning and analytical techniques to create scalable solutions for business problems.\n<br>\n· Analyze and extract relevant information from large amounts of data to help automate and optimize key processes.\n<br>\n· Design, development and evaluation of highly innovative models for predictive learning.\n<br>\n· Establish scalable, efficient, automated processes for large scale data analyses, model development, model validation and model implementation.\n<br>\n· Research and implement novel machine learning and statistical approaches.\n<br>\n· Work closely with data &amp; software engineering teams to build model implementations and integrate successful models and algorithms in production systems at very large scale.\n<br>\n· Technically lead and mentor other scientists in team.\n<br><br>\nIn terms of Amazon Leadership Principles, the most important ones for our team are: Customer Obsession, Think Big, Dive Deep, and Invent and Simplify.\n<br><br>\nYoull be based in Seattle, WA\n<br><br>"}