{"job title": "Sr. Research Scientist", "company": "Armstrong World Industries", "city state": "– Lancaster, PA", "rating": "3.2", "job description": "Job: Innovation/Prod Design/NPD\n<br><br>\nPrimary Location: Lancaster, Pennsylvania\n<br><br>\nRelocation Offered: Yes\n<br><br>\nEmployment Status: Full-Time\n<br><br>\nTravel: 25%\n<br><br>\nDo you want to work for a company that gives you opportunities to grow in a collaborative environment? How about working for a manufacturer with a rich history and even brighter future? Armstrong World Industries began over 150 years ago as a small cork-cutting shop in Pittsburgh, PA. From that small business, we became the leader in ceiling, wall and suspension system solutions that contribute to better, more inspiring buildings that make a difference in the lives of people where they work, play, learn, heal and live. At Armstrong World Industries you'll have the opportunity to make the most of your potential. Come build your future with us!\n<br><br>\nArmstrong World Industries, Inc., has a job opportunity for a Senior Research Scientist to be located in Lancaster, PA or Columbus, OH. Under the direction of the Business &amp; Operations Support Manager, the Senior Research Scientist will be responsible for the ownership and management of specific technical efforts in support of the overall global strategic plan. Additionally the Senior Research Scientist will focus on key areas including Quality, Business Support and Innovation and create a work approach that brings together these three areas in a way that integrates across the global manufacturing sites.\n<br><br>\n_* Key Responsibilities of the Senior Research Scientist*_:\n\n\n<ul>\n<li>Providing support to manufacturing sites as requested through the business support process, including consultation with production personnel, making and evaluating laboratory and plant tests, analyzing results and recommending corrective action, and following through on recommendations to evaluate their effectiveness</li>\n<li>Collaborating with manufacturing plants in the planning and execution of productivity efforts at the plant sites</li>\n<li>Leading cost reduction, raw material replacement, certain types of new product development and quality projects at single manufacturing sites and/or across the manufacturing network</li>\n<li>Proactively working with the sales and marketing team to identify proactive quality improvement opportunities then collaborates with manufacturing to execute agreed upon quality improvement opportunities</li>\n<li>Identifying opportunities to integrate technical work related to quality, productivity, applied innovation and new product development</li>\n<li>Leading the development of a technical network that includes technical resources and manufacturing leaders from both Technology and the manufacturing sites</li>\n<li>Participating as part of a team that develops a system that captures plant data in a way that enables easy access and the ability to analyze and compare data from multiple manufacturing sites at the same time</li>\n<li>Participating in Lean efforts</li>\n<li>Sharing key learning and best practices with the organization as required by business need</li>\n</ul>\n\n_*Required Qualifications of the Senior Research Scientist:*_\n\n\n<ul>\n<li>Bachelor's Degree in Chemical Engineering, Chemistry or Physics</li>\n<li>Minimum of 4-10 years applicable work experience</li>\n<li>Previous experience in wet felt manufacturing operations</li>\n<li>Experience driving productivity in a manufacturing environment</li>\n<li>Ability to apply technical knowledge in a manufacturing environment</li>\n<li>Strong communication skills, both written and verbal</li>\n<li>Self-starter with strong analytical skills and abilities</li>\n<li>Travel 25-35% as required</li>\n</ul>\n\n_*Desired Qualifications of the Senior Research Scientist:*_\n\n\n<ul>\n<li>Advanced Degree in Chemical Engineering</li>\n<li>Experience in mineral fiber ceilings</li>\n<li>Prior experience in quality systems</li>\n</ul>\n\n_*Physical and Mental Demands:*_\n<br><br>\nThe demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is regularly required to: sit for prolonged periods; repetitive motion of hands/wrists/fingers; concentrate and repeat the same physical or mental activities over and over; think analytically and be exact or highly accurate; make decisions such as to identify complex problems, develop options and implement solutions; work in a team; ability to maintain regular, punctual attendance consistent with the ADAAA, FMLA and other federal, state and local standards; pay attention to and remember details; communicate effectively including active listening to understand points being made, and asking appropriate questions and not interrupting inappropriately; speak to convey information effectively; write to communicate effectively as appropriate for the needs of the audience; read to understand work related documents; move between different physical locations within and between buildings; and push, pull, carry and lift in the normal course of travel.\n\n\n<ul>\n<li>Why Armstrong World Industries?*</li>\n</ul>\n\nArmstrong World Industries, Inc. (AWI) is a leader in the design and manufacture of innovative commercial and residential ceiling, wall and suspension system solutions. At home, at work, in healthcare facilities, classrooms, stores, or restaurants, Armstrong World Industries offers interior solutions that help to enhance comfort, save time, improve building efficiency and overall performance, and create beautiful spaces. We built our business on trust and integrity. It set us apart then, and it sets us apart now, along with our ability to collaborate with and innovate for the people we?re here to serve ? our customers, our shareholders, our communities and our employees.\n\n\n<ul>\n<li>Benefits Package*</li>\n<li>Standard benefit package offerings: Medical, dental, prescription drugs, life insurance</li>\n<li>Long term disability coverage</li>\n<li>Vacation and sick time</li>\n<li>Product discount programs</li>\n<li>401k Match</li>\n<li>About the Location (Lancaster, PA):*</li>\n</ul>\n\nLocated in South Central Pennsylvania, Lancaster is ideally situated for easy access to major metropolitan cities such as Philadelphia, Baltimore, Washington DC and New York City. Lancaster offers a vibrant arts and entertainment community with wonderful historic sites, B&amp;Bs, museums, world class shopping, entertainment venues and restaurants.\n\n\n<ul>\n<li>Equal Opportunity Employer: *AWI is an Equal Opportunity Employer M/F/Disabled/Vets</li>\n<li>Notice to Staffing Agencies, Placement Services, and Professional Recruiters*</li>\n</ul>\n\nArmstrong World Industries, Inc. has an internal Staffing Department. Recruiters are hereby specifically directed NOT to contact AWI employees directly in an attempt to present candidates.\n<br><br>\nAWI will not accept unsolicited resumes from any source other than directly from a candidate. Any unsolicited resumes sent to AWI, including unsolicited resumes sent to an AWI mailing address, fax machine or email address, directly to AWI employees, or to AWI's resume database will be considered AWI property. AWI will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume. AWI will consider any candidate for whom a Recruiter has submitted an unsolicited resume to have been referred by the Recruiter free of any charges or fees.\n\n\n<ul>\n<li>AWI will not pay a fee to any Recruiter that does not have a signed AWI contract in place specific to the position for which the resume was submitted. *</li>\n</ul>\n\nRecruiting vendor agreements will only be valid if in writing and signed by AWI's Corporate Talent Acquisition Manager or his or her designee. No other AWI employee is authorized to bind AWI to any agreement regarding the placement of candidates by Recruiters. *By submitting a candidate to AWI, recruiters agree to be bound and comply with this policy*."}