{"job title": "Scientist I, Immuno-Oncology", "company": "Bristol-Myers Squibb", "city state": "– ", "rating": "3.7", "job description": "<div>Scientist I, Immuno-Oncology\n<br><br>\nDescription\n<br><br>\nBristol-Myers Squibb is a global biopharmaceutical company whose mission is to discover, develop and deliver innovative medicines that help patients prevail over serious diseases.\n<br><br>\nOne shared journey is moving us forward at Bristol-Myers Squibb. Around the world, we are passionate about making an impact on the lives of patients with serious disease. Empowered to apply our individual talents and ideas so that we can learn and grow together. Driven to make a difference, from innovative research to hands-on community support. Bristol-Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees the resources to pursue their goals, both at work and in their personal lives.\n<br><br>\nThe Immuno-Oncology (IO) department is seeking a talented and enthusiastic individual to support the validation and preclinical development of novel immuno-oncology targets for the treatment of cancer. In this role, the successful candidate will be in a project leadership role and be involved in designing, performing and analyzing experiments that will contribute to the progression of an early stage myeloid drug discovery program. In this role, the successful candidate will also generally contribute to the IO department by providing technical expertise and extensive knowledge of myeloid biology. This role also requires excellent oral and written communication skills, the ability to work across multiple groups, and maintain accurate and up-to-date records in electronic notebooks. We are looking for a self-motivated, detail-oriented, adaptive individual that has a keen interest in learning to join our highly collaborative and innovative team.\n<br><br>\nPrimary Responsibilities\n<ul>\n<li>Project leader for early stage project</li><li>Design and execute functional myeloid experiments using primary cells or in vitro polarized myeloid cells</li><li>Present data in project and team meetings</li><li>Maintain accurate and up-to-date electronic notebook</li>\n</ul>\nQualifications\n<ul>\n<li>Ph.D. in Immunology or related field</li><li>2+ years post-graduate experience in immunology, tumor immunology or closely related field industry</li><li>Extensive knowledge in neutrophil/macrophage/dendritic cell biology is essential</li><li>Proficiency in functional immune cell-based assays (e.g. T cell activation and MLR assays) is essential</li><li>Expertise is multi-color flow cytometry is essential</li><li>Extensive experience in isolation of PBMCs is required</li><li>Experience with in vitro polarization assays for myeloid cells is highly desired</li><li>Experience with tumor-infiltrating lymphocyte profiling in mouse syngeneic cancer models is desired</li><li>Experience isolating myeloid cells from tumors is desired</li><li>Excellent time management and organizational skills</li><li>Proven ability to collaborate in a team environment</li><li>Excellent oral and written communication skills</li></ul></div>\n<br>"}