{"job title": "Postdoctoral Scientist (Inflammatory Bowel Disease)", "company": "Cedars-Sinai", "city state": "– ", "rating": "3.9", "job description": "The Cedars -Sinai F. Widjaja Foundation Inflammatory Bowel and Immunobiology Research Institute (IBIRI) is searching for a Postdoctoral Scientist. IBIRI is a multidisciplinary basic, translational and clinical research program devoted to Inflammatory Bowel Diseases. This position will be focused on investigating immune cellular interactions, receptor signaling/function and immune responses in inflammatory bowel diseases.\n<br><br>\nA postdoc works independently but in close cooperation and in consultation with the Principal Investigator and other Research Scientist, the Research Fellow will perform routine and complex laboratory procedures throughout training period. May develop, adapt, and implement new research techniques and protocols. Analyzes and interprets data. May assist in preparation of grant proposals. Participates in publications and presentations as author or co-author. Not responsible for generating grant funds.\n<br><br>\nThe successful candidate will perform all duties associated with in-vitro, in-vivo and ex-vivo experiments related to the projects including general lab maintenance, mouse husbandry and training of research associates or students. Specific lab duties include but are not limited to performing primary mouse and human cell isolation and tissue culture, T cell differentiation and functional assays, multi-color flow cytometry, gene/protein assays and in-vivo murine models of inflammation. As part of a large research group, postdocs participate in institute-wide activities and contribute to general lab supply and equipment purchasing and maintenance.\n<br><br>\n<strong>ESSENTIAL AND DEPARTMENT SPECIFIC JOB DUTIES AND RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>May assist in preparation of grant proposals, but is not responsible for generating grant funds.</li>\n<li>May participate in publications and presentations as author or co-author.</li>\n<li>Designs and performs experiments. Will keep appropriate experimental records and documentation and analyze the results with the Principal Investigator.</li>\n<li>May develop, adapt, and implement new research techniques and protocols.</li>\n<li>Analyzes, interprets, summarizes and compiles data.</li>\n<li>Performs routine and complex laboratory procedures throughout training period.</li>\n<li>Operates and maintains equipment and instruments.</li>\n</ul>"}