{"job title": "Data Analyst Level 4", "company": "CTG", "city state": "– Orlando, FL", "rating": "3.1", "job description": "Computer Task Group is seeking a Senior Level Data Analyst for our client in Orlando, FL.\n<br><br>\n<strong>Description:</strong>\n<br><br>\nDesigns and develops methods, processes, and systems to consolidate and analyze structured and unstructured, diverse sources including \"big data\" sources. Develops and uses advanced software programs, algorithms, querying and automated processes to cleanse, integrate and evaluate datasets, andmodels complex business problems. Is familiar with disciplines such as Natural Language Processing, Machine Learning, Predictive modeling, Statistical Analysis and Hypothesis testing. Works with cross-discipline teams to ensure connectivity between various databases and systems. Identifies meaningful insights and interprets and communicates findings and recommendations. May develop information tools, algorithms, dashboards, and queries to monitor and improve business performance. Maintains awareness of emerging analytics and big-data technologies. Requires knowledge of various technical domains to include various software programming languages and deep mathematical calculation and algorithms to provide intricate analytic solutions to meet end user needs. Has various tool knowledge with both software development and engineering research to create models of relevancy. Experience designing efficient algorithms with programming languages and tools for data manipulation and statistical analysis. Experience designing efficient data mining and text mining frameworks with related tools. Specific Job Description Data Scientist will support the Logistics and Sustainment Engineering (LSE) directorate. The primary objective will be to develop a vision and strategy to transform and modernize the analytical data processes being used by the organization today. This will require studying the way in which programs collect and analyze data and determining how more advanced analytical tools can be incorporated without disrupting the current operations. A blend of experience in science and engineering skills, and a proven track record of solving critical business problems through data science and strong analytical/quantitative and engineering skills is desired.\n<br><br>\nSkill/Experience/Education\n<br><br>\n<strong>Mandatory Skills / Experience:</strong>\n<br><br>\nBachelor's degree from an accredited college in a related discipline with 8 years of professional experience; or 5 years of professional experience with a related Master's degree. Considered an emerging authority. Ability to obtain secret clearance. 5 years of experience in Data Science. Experience developing and/or implementing enterprise data solutions.\n<br><br>\n<strong>Desired Skills / Experience:</strong>\n<br><br>\nAbility to work in cross functional teaming environment. Ability to communicate data findings to leadership to influence how an organization approaches and meets business challenges. Experience collaborating with database engineers and other scientists to develop, refine, and scale data management and analytics procedures, systems, workflows, best practices, and other issues. Project management experience. Proven ability to deliver results and meet deadlines\n<br><br>\nCandidates interested in this position may apply now or email resumes to jessica.remza@ctg.com\n<br><br>\nCTG (NASDAQ: CTG) provides industry-specific IT services and solutions that address the business needs and challenges of clients in high-growth industries in North America and Western Europe. CTG also provides strategic staffing services for major technology companies and large corporations. Backed by more than 50 years of experience and proprietary methodologies, CTG has a proven track record of reliably delivering high-value, industry-specific staffing services and solutions to its clients. CTG has operations in North America, Western Europe, and India.\n<br><br>\nCTG's greatest asset is its people, and as such, we are committed to providing employees programs and processes to support their performance, hone their skills, and advance in their careers. This commitment is reflected by CTG being named a Best Places to Work in Healthcare company by Modern Healthcare (2013-2016) in North America, and a Best Workplace in the United Kingdom (2013), Belgium (since 2007), and Luxembourg (since 2011).\n<br><br>\nCTG will consider for employment all qualified applicants including those with criminal histories in a manner consistent with the requirements of all applicable local, state, and federal laws.\n<br><br>\nCTG is an Equal Opportunity/Affirmative Action Employer and strong advocate of workforce diversity. Minority/Female/Sexual Orientation/Gender Identity/Disability/Veteran."}