{"job title": "Scientist - In Vivo Immunopharmacology", "company": "EMD Millipore", "city state": "– Billerica, MA", "rating": "3.2", "job description": "<strong>Your role:</strong>\n<br><br>\nThe successful candidate will be responsible for the hands-on execution of in vivo immunopharmacology studies that utilize mouse tumor models to study the anti-tumoractivity of novel immuno-oncology agents. The successful individual will contribute to the execution of a research strategy focused on the evaluation of novel cancer immunotherapy approaches and further combination with conventional treatment.\n<br><br>\nThrough applied expertise in tumor immunology, the incumbent will be charged with characterizing the immunological mechanisms associated with treatment and the identification of potential biomarkers.\n<br><br>\n<strong>Who you are:</strong>\n<br><br>\nWe are looking for an experienced in vivo immunopharmacology scientist to drive drug discovery and development projects in Immuno-Oncology by designing and conducting in vivo pharmacology studies in murine tumor models.\n\n\n<ul>\n<li>Bachelor's with 3 plus years or master's degree required.</li>\n<li>Three plus years of industry experience preferred</li>\n<li>The candidate should be proficient in handling rodents (rats, and mice), able to prepare formulations, administer compounds via various routes (IV, PO, IP), and collect blood as well as various tissue samples for analysis, and in vivo fluorescence imaging.</li>\n<li>Keep abreast of cutting-edge in vivo models that can be applied to concept discovery and drug candidate characterization</li>\n<li>Previous experience with multi-color flow cytometry and other immune readouts (i.e., experience in T cell activation assays, ELISA, IHC)</li>\n<li>Apply PK/PD relationship concepts to optimize the dose&amp;schedule for novel biological and small molecule agents</li>\n<li>The candidate should be proficient in data collection/documentation all study results in the form of lab notebook reports and, as needed, contribute to the authorship of regulatory submission documents</li>\n<li>Follow and promote safety instructions and regulations according to Quality Management Standards.</li>\n</ul>\n\nJob Requisition ID: 180368\n<br><br>\nLocation: Billerica\n<br><br>\nCareer Level: D - Professional (4-9 years)\n<br><br>\nWorking time model: full-time\n<br><br>\nNearest Major Market: Boston\n<br><br>\nJob Segment: Immunology, Oncology, Scientist, Quality Manager, Healthcare, Science, Quality, Research"}