{"job title": "Scientist, Asst (AR) School Of Medicine (SOM)", "company": "Emory University", "city state": "– Atlanta, GA", "rating": "4.1", "job description": "<ul>\n<li>*Description**</li>\n</ul>\n\n<strong>JOB DESCRIPTION:</strong>\n<br><br>\n+ Under minimal supervision, the Assistant Academic Research Scientist performs a wide range of highly technical and complex tasks necessary to advance basic and/or translational research programs.\n<br><br>\n+ Responsible for working with experimental platforms specific to the hiring Program.\n<br><br>\n+ Duties will include but are not limited to experimental design, data analysis, and interpretation and communication of results of basic and/or translational research.\n<br><br>\n+ Will be required to reviews literature and apply advanced knowledge, skills, and input necessary for protocol development.\n<br><br>\n+ May assist in grant and other funding applications, as necessary and appropriate.\n<br><br>\n+ Performs other responsibilities as required.\n<br><br>\n<strong>MINIMUM QUALIFICATIONS:</strong>\n<br><br>\n+ PhD or MD OR Master's degree and five years of professional level experience in a technical or research lab. Internship experience or experience prior to attaining the qualifying degree is not considered eligible work experience for this job classification.\n<br><br>\n+ Laboratory experience will be based on area of assignment.\n\n\n<ul>\n<li>*Additional Details**</li>\n</ul>\n\nStaff Scientist Position in Neurorestoration\n<br><br>\nThe Boulis laboratory in the department of Neurosurgery at Emory University in Atlanta, GA, is seeking a capable and self-motivated individual to oversee projects involving the transplantation of iPS cells for the treatment of motor neuron diseases and nerve damage. Our lab is also interested in gene therapy approaches for motor neuron diseases and for neuromodulation. More information about the lab can be found at http://neurosurgery.emory.edu/research/boulis-lab/index.html.\n<br><br>\nThe candidate should hold a Ph.D. in an appropriate field and have a strong publication record in neuroscience and related fields. The ideal candidate will have experience with creating iPS cells from human and rodent cells and differentiating them into motor neurons. The candidate should also have excellent oral and written communication skills and the ability to work as part of a team. Experience working with rodent models is preferred. Salary and title will be commensurate with experience.--76107BR\n<br><br>\nApply Now\n<br><br>\nSorry the Share function is not working properly at this moment. Please refresh the page and try again later.\n\n\n<ul>\n<li>*Connect With Us!**</li>\n</ul>\n\nNot ready to apply?\n\n\n<ul>\n<li>*Job Number** _15445_</li>\n<li>*Job Type** _Regular Full-Time_</li>\n<li>*Division** _School Of Medicine_</li>\n<li>*Department** _SOM: Neurosurgery: Admin_</li>\n<li>*This position may involve the following Health and Safety issues:** _Not Applicable_</li>\n<li>*Job Category** _Laboratory_</li>\n</ul>\n\nEmory University is an equal opportunity/equal access/affirmative action employer fully committed to achieving a diverse workforce and complies with all applicable Federal and Georgia State laws, regulations, and executive orders regarding nondiscrimination and affirmative action in its programs and activities. Emory University does not discriminate on the basis of race, color, religion, ethnic or national origin, gender, genetic information, age, disability, sexual orientation, gender identity, gender expression, and veteran's status. Inquiries about this statement should be directed to the Office of Equity and Inclusion, 201 Dowman Drive, Administration Bldg, Atlanta, GA 30322"}