{"job title": "GDIA Data Operations Analyst", "company": "Ford Motor Company", "city state": "– Dearborn, MI", "rating": "3.9", "job description": "**30795BR**<br> <br>**Job Title:**<br> <br><br> <br>GDIA Data Operations Analyst<br> <br><br> <br>**Job Description &amp; Qualifications:**<br> <br><br> <br>**GDIA Data Operations Analyst**<br> <br><br> <br>**Job description:**<br> <br><br> <br>GDIA Data Operations Analyst positions offered by Ford Motor Company (Dearborn, MI). Support data requirements of data scientists who are using analytics to achieve business outcomes including insights to accelerate our Connected Customer and Connected Vehicle initiatives. Provides data support including ingestion, standardization, mastering and assembly of data products for downstream applications. Implements computer databases and applies knowledge of databases.<br> <br><br> <br>**Minimum Requirements:**<br> <br><br> <br>+ Bachelor's or foreign equivalent degree in computer science, electronic engineering, or a related field<br> <br>+ 5 years of experience in the position offered or 5 years of experience running queries and compiling data for analytics<br> <br>+ 3 years of experience performing data design, data architecture and data modeling (both transactional and analytic)<br> <br>+ 3 years of experience using Big Data/NoSQL technologies including Greenplum and Hadoop<br> <br>+ 2 years of experience loading and manipulating files within HDF<br> <br>+ 1 year of experience building visualizations using Tableau or Qlikview<br> <br><br> <br>The distance between imagination and ?. Creation. It can be measured in years of innovation, or in moments of brilliance. And, it can be a road you start traveling right now. When you join Ford Motor Company, your journey begins. You become part of a team that is already leading the way, with ingenious solutions and attainable products ? and it is always ready to go further.<br> <br><br> <br>At Ford Motor Company, the distance between you and an amazing career has never been shorter. Join the Ford team today, and discover the benefits, rewards and development opportunities you?d expect from a diverse global leader.<br> <br><br> <br>Ford Motor Company is an equal opportunity employer committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, disability status or protected veteran status. Ford Motor Company also is committed to take affirmative action to employ and advance in employment such persons.<br> <br><br> <br>**Auto req ID:**<br> <br><br> <br>30795BR<br> <br><br> <br>**Company:**<br> <br><br> <br>Ford Motor Company<br> <br><br> <br>**Function:**<br> <br><br> <br>GDIA<br> <br><br> <br>**Skill Team:**<br> <br><br> <br>GDI&amp;A<br> <br><br> <br>**Sub-Component:**<br> <br><br> <br>Data Operations<br> <br><br> <br>**State:**<br> <br><br> <br>Michigan<br> <br><br> <br>**Location:**<br> <br><br> <br>Dearborn"}