{"job title": "Research Scientist - Machine Learning Algorithms", "company": "Ford Motor Company", "city state": "– Palo Alto, CA", "rating": "3.9", "job description": "<ul>\n<li>*31396BR**</li>\n<li>*Job Title:**</li>\n</ul>\n\nResearch Scientist ? Machine Learning Algorithms\n\n\n<ul>\n<li>*Job Description &amp; Qualifications:**</li>\n<li>*Posting Overview/Description:**</li>\n</ul>\n\nFord Motor Company is moving into a new phase of its 100+ year history, one in which openness is at the heart of its future. The automobile is being redefined as a networked computing platform upon which an ever-evolving set of applications is being designed, allowing us to create exciting new consumer experiences.\n<br><br>\nWe are a research lab within Ford that is investigating computing platforms, software &amp; hardware architectures, sensors &amp; strategies for fusing information from a variety of external &amp; internal environmental sensors for next generation active safety and automated vehicle technologies.\n<br><br>\nCandidates for consideration will be responsible for supporting research and developmental efforts in automated vehicle technologies ranging from Advanced Driver Assistance Systems (ADAS) to conditional automation capabilities. The ideal candidates are exceptionally creative, motivated and talented engineers with strong interdisciplinary backgrounds in science &amp; engineering with solid programming skills. We collaborate extensively within Ford and with external partners, thus we require exceptional communication and collaborative skills.\n<br><br>\nThese positions are located at Ford?s Greenfield Labs in Palo Alto, CA\n\n\n<ul>\n<li>*Job Responsibilities:**</li>\n</ul>\n\n+ Design, prototype, train and evaluate various machine learning methods for use in detection, classification and regression tasks, significantly improving performance or reducing cost\n<br><br>\n+ Develop, evaluate and compare deep learning algorithms for specific applications and tasks to improve performance, data collection, training, and suitability for embedded applications\n<br><br>\n+ Design, prototype, and evaluate effective and efficient sensor feature detection, tracking, mapping and localization algorithms and systems, including computer vision algorithms\n<br><br>\n+ Participate in technical discussions and collaborate in the creation of new ideas for automotive applications within the existing autonomous vehicle research team; coordinate with engineers in related Ford R&amp;D teams; contribute to technical roadmap for future development\n<br><br>\n+ Maintain close contact to the scientific and industrial community in computer vision and machine learning, and perform scouting and assessment of new approaches\n<br><br>\n+ Work closely and effectively with external partners ? corporations, universities and automotive suppliers\n<br><br>\n+ Publish/present technical reports, papers and/or pursue Intellectual Property rights\n\n\n<ul>\n<li>*Basic Qualifications:**</li>\n</ul>\n\n+ Ph.D. in Engineering, Computer Science, Natural Sciences, Robotics, Statistics, or related fields\n<br><br>\n+ 3+ months hands-on experience in Deep Learning or Machine Learning\n<br><br>\n+ 3+ months of experience in multiple contemporary computer programming languages, e.g., C/C++, Python, Java, OpenGL, PERL, MATLAB/Simulink, and relevant software libraries and tools\n\n\n<ul>\n<li>*Preferred Qualifications** **:**</li>\n</ul>\n\n+ 5+ years of Machine Learning and/or Computer Vision hands on work experience\n<br><br>\n+ Expert experience in designing and building state of the art feature detectors and trackers\n<br><br>\n+ Demonstrated ability to carry out independent research and lead projects\n<br><br>\n+ Experience with computer vision, machine learning, DNNs, and numerical optimization\n<br><br>\n+ Experience with algorithms such as statistical signal processing, image processing, simultaneous localization and mapping, geospatial location, rendering 3D data, computer graphics, etc.\n<br><br>\n+ Knowledge of 3D co-ordinate frames and transformations, vector mathematics, matrix algebra, state estimation, probabilistic inference and modeling, etc.\n<br><br>\n+ Experience developing and optimizing algorithms and systems with reduced computational complexity or cost\n<br><br>\n+ Experience in multiple computer hardware, operating systems and tools, e.g., embedded microcontrollers, GPUs; Windows, UNIX, Linux; git, Make, subversion, glibc, gcc, bash, CUDA, etc.\n<br><br>\n+ Familiarity with existing deep learning libraries (e.g. Torch, Theano, Caffe, PyBrain, Neon, etc.)\n<br><br>\n+ Experience with sensing systems such as cameras, radar, lidar, GPS, IMUs, etc.\n<br><br>\n+ 1+ years of GPU, GP-GPU, Parallel programming tools and language extensions etc.\n<br><br>\n+ Strong problem formulation and problem solving skills\n<br><br>\n+ Experience presenting results to internal management &amp; at external venues such as conferences\n<br><br>\nThe distance between imagination and ? creation. It can be measured in years of innovation, or in moments of brilliance. When you join the Ford team you will discover all the benefits, rewards and development opportunities you?d expect from a diverse global leader. You?ll become part of a team that is already leading the way, with ingenious solutions and attainable products ? and it is always ready to go further.\n<br><br>\nVisa sponsorship may be available for this position.\n<br><br>\nFord Motor Company is an equal opportunity employer committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, disability status or protected veteran status.\n\n\n<ul>\n<li>*Auto req ID:**</li>\n</ul>\n\n<strong>31396BR</strong>\n\n\n<ul>\n<li>*Company:**</li>\n</ul>\n\nFord Motor Company\n\n\n<ul>\n<li>*Function:**</li>\n</ul>\n\nAutonomous Vehicles\n\n\n<ul>\n<li>*Skill Team:**</li>\n</ul>\n\nResearch &amp; Advanced Engrg\n\n\n<ul>\n<li>*Sub-Component:**</li>\n</ul>\n\nResearch &amp; Advanced Engrg\n\n\n<ul>\n<li>*State:**</li>\n</ul>\n\nCalifornia\n\n\n<ul>\n<li>*Location:**</li>\n</ul>\n\nPalo Alto"}