{"job title": "Project Environmental Scientist", "company": "Golder Associates", "city state": "– Denver, CO", "rating": "3.1", "job description": "<ul>\n<li>*At Golder, we thrive on challenges.**</li>\n<li>*Golder is not just a place to work, it is a promise of a living, dynamic environment where people collaborate, innovate, build enduring relationships, excel, and grow professionally in a strong culture of ownership.**</li>\n</ul>\n\nDo you have the desire to learn? The drive to excel and thrive in an engaged, collaborative environment?\n<br><br>\nGolder has a new opportunity for a **Project Environmental Scientist** to join our **Denver** team on a **full time** basis.\n\n\n<ul>\n<li>*An overview of your role will include:**</li>\n</ul>\n\n+ Provide technical environmental science services for a range of projects in mining, water resources management, and environmental sustainability.\n<br><br>\n+ Work under the direction of Environmental Managers and Engineers.\n<br><br>\n+ Develop environmental sustainability plans and project life cycles for client operations and activities.\n<br><br>\n+ Monitor environmental impacts of industrial and mining activities.\n<br><br>\n+ Duties will include collecting, analyzing, and interpreting data.\n<br><br>\n+ Assist in preparation of data summaries, charts, graphs, and writing analytical reports.\n<br><br>\n+ Use technical software such as GoldSET to perform environmental sustainability studies for mining and industrial projects.\n<br><br>\n+ Support stakeholder engagement for a collaborative platform for consultation and communication of results.\n<br><br>\n+ Identify stakeholders and develop influence/interest matrices.\n<br><br>\n+ Develop and maintain stakeholder relationships, implement engagement and support strategies, and manage stakeholder satisfaction.\n<br><br>\n+ Implement project controls and evaluate project performance using established standards and milestones during design and construction of environmentally sensitive projects.\n<br><br>\n+ Utilize STATA to perform financial analyses and budget tracking\n\n\n<ul>\n<li>*You will have a background in:**</li>\n</ul>\n\n+ **Master?s degree (or foreign equivalent) in Environmental Studies or Environmental Sustainability and 2 years of experience in the job offered or in project management related to environmental sustainability.**\n<br><br>\n+ **All stated experience must include the following:**\n<br><br>\n+ **Using Life Cycle Assessment software, including GaBi, TRACI 2.1 or SimaPro;**\n<br><br>\n+ **Leading large, multi-disciplinary teams to schedule and budget, and mentor employees;**\n<br><br>\n+ **Performing integrated change control, identifying and mitigating risks, managing stakeholder expectations, and managing quality of services provided;**\n<br><br>\n+ **Experience with international standards on sustainability management and sustainability metrics reporting (Global Reporting Initiative Index; Energy Sustainability Index; Environmental Sustainability Index; ISO); and**\n<br><br>\n+ **managing document production lines to deliver technical reports and memoranda to internal and client standards.**\n<br><br>\n+ **1 year of stated experience must include the following:**\n<br><br>\n+ **Performing options analysis for decision-support systems for large-scale projects, including stakeholder engagement;**\n<br><br>\n+ **Planning, managing, and completing Environmental Social Impact Assessments;**\n<br><br>\n+ **Experience with project management to globally recognized standards set by the Project Management Institute;**\n<br><br>\n+ **Experience in coordinating internal and external stakeholder engagement for permitting and approvals; and**\n<br><br>\n+ **statistical approaches in financial planning, including implementation of statistical computing programs such as STATA** **.**\n\n\n<ul>\n<li>*Your benefits at Golder will include:**</li>\n</ul>\n\n+ **Competitive benefits and remuneration packages**\n<br><br>\n+ **Option to purchase shares in Golder**\n<br><br>\n+ **Employee owned structure - own the business, own the result**\n<br><br>\n+ **Deepen your expertise in a dynamic work environment**\n<br><br>\n+ **Innovative and collaborative multidisciplinary projects**\n<br><br>\n+ **On the job training, mentoring and coaching**\n<br><br>\n+ **Global projects and travel opportunities**\n\n\n<ul>\n<li>*Renowned for technical excellence, Golder is a leading, global employee-owned engineering and consulting firm with over a half century of successful service to its clients. With over 165 offices in over 40 countries, Golder?s 6,500 professionals are driven by a passion to deliver results, offering unique specialized skills to address the ever-evolving challenges that earth, environment and energy present to clients across the infrastructure, mining, oil and gas, manufacturing and power sectors.**</li>\n<li>*Equal Opportunity Employment Statement**</li>\n<li>*Golder is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status or other characteristics protected by law. Golder is a background screening, drug-free workplace.**</li>\n<li>*To learn more about our company and culture click here to view** **The Promise of Golder** at https://vimeo.com/252065645 **video.**</li>\n<li>*Title:** *Project Environmental Scientist*</li>\n<li>*Location:** *CO-Lakewood*</li>\n<li>*Requisition ID:** *18000874*</li>\n</ul>"}