{"job title": "Research Scientist, Chemist", "company": "Metabolon", "city state": "– Durham, NC", "rating": "4.1", "job description": "<strong><u>Research\n<br>\nScientist in Sample Prep Lab</u></strong>\n<br><br>\nMetabolon, headquartered in Research Triangle Park, NC, is\n<br>\nthe world's leading life sciences company focused on metabolomics - an\n<br>\nintegrative, powerful phenotyping technology for assessing health. Its\n<br>\nproprietary platforms and informatics are delivering biomarker discoveries,\n<br>\ninnovative diagnostic tests, breakthroughs in personalized medicine, and robust\n<br>\npartnerships in genomics-based health initiatives. Due\n<br>\nto our rapidly growing services business, Metabolon is seeking a Research\n<br>\nScientist to be an integral member of our platform team. The team member in this position will report\n<br>\nto the Group Leader, Platform Chemistry and will be responsible for the preparation\n<br>\nof samples prior to analysis on our mass spectrometry platform. This position will be on a five day per week\n<br>\nwork schedule with the possibility of a required weekend commitment. The\n<br>\nsuccessful candidate will have experience in sample preparation for LC and/or\n<br>\nLC-MS.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n\n <li>Handling\n<br>\n the physical samples as they are received and processed for the mass\n<br>\n spectrometry platform.</li> \n\n<li>Independently\n<br>\n perform sample measurements, including pipetting and weighing of\n<br>\n biological samples.</li></ul>\n\n\n<ul>\n\n <li>Operate\n<br>\n lab robotics and equipment during chemical extraction of biological\n<br>\n samples.</li></ul>\n\n\n<ul>\n\n <li>Perform\n<br>\n biological assays on samples and prepare reports for the Project Director\n<br>\n and others as needed.</li>\n<li>Perform\n<br>\n liquid/liquid extractions on biological samples.</li>\n<li>Perform\n<br>\n or assist in accessioning of incoming client samples.</li>\n<li>Maintain\n<br>\n consumables inventories.</li>\n<li>Maintain\n<br>\n laboratory equipment and report problems to the Sample Prep Manager.</li>\n<li>Prepare\n<br>\n Sample Prep worksheets in LIMS.</li>\n<li>Write\n<br>\n experimental protocols, analyze data and summarize reports.</li>\n<li>Contribute\n<br>\n to scientific papers and posters.</li>\n</ul>\n<strong>Qualifications</strong>\n<br><br>\n<ul>\n<li>Bachelor’s Degree in a life science is required. The preferred candidate will also have a\n<br>\nminimum of 3 years’ experience in the field or in a related area.</li> <li>Must be familiar with a variety of the field's concepts,\n<br>\npractices, and procedures. Experience\n<br>\nwith chromatography and liquid-handling robotics are desired.</li><li>Some knowledge of organic chemistry, biological systems and\n<br>\nlaboratory automation.</li><li>A broad overview of chemistry, including chemical structures\n<br>\nand nomenclature, and familiarity with general concepts, practices and\n<br>\nprocedures is expected.</li> <li>Ability to work independently or in a team environment is required.</li>\n<li>Ability to plan experiments and carry out data analysis.</li><li>Computer skills should include MS Office (Excel, Word,\n<br>\nPowerpoint, Outlook, etc.)</li> <li>Some experience working in LIMS systems is desired.</li> <li>The team member is expected to use experience and good\n<br>\njudgment to accomplish tasks in a satisfactory manner.</li> \n</ul>"}