{"job title": "Formulation Scientist, Nanoparticles (non-PhD)", "company": "Pfizer Inc.", "city state": "– Pearl River, NY", "rating": "3.9", "job description": "<strong><strong>ROLE SUMMARY</strong></strong>\n<br>\nThis formulation scientist will be responsible for developing, evaluating and characterizing targeted nanomedicines within a dynamic and highly interdisciplinary environment. He/she will be responsible for executing lab experiments, reporting results and representing formulation activities to the project team. Experience with polymeric nanoparticle preparation techniques, biophysical / chemical characterization, and surface modification are must. The successful candidate must have a foundation in chemical, biological, or biochemical sciences or materials engineering with experience in the drug delivery field.\n<br><br>\nThe incumbent displays strong technical knowledge in various aspects of drug delivery, formulation and process with a drive to learn new techniques while working at the laboratory bench. Incumbent must have the scientific commitment and strong desire to make impactful scientific and technical contributions within the nanomedicine research field\n<br><br>\n<strong><strong>ROLE RESPONSIBILITIES</strong></strong>\n\n<ul>\n<li>As a lab-based formulation scientist, you will be responsible to develop, and evaluate nanoparticles</li><li> Participate in determining specific physiochemical properties of drugs, excipients, and polymers, and applying that knowledge to the development of successful polymer and lipid nanoparticles drug delivery strategies.</li> <li> Duties include planning, designing, executing, interpreting, and reporting results for complex studies.</li> <li>As our R&amp;D programs integrate synthetic and polymer chemistry particle delivery technology and biological sciences, the candidate must work and learn across multiple technical disciplines.</li><li>Organize, evaluate, critique, and present data in an effective and scientific manner.</li>\n</ul>\n\n<strong><strong>QUALIFICATIONS</strong></strong>\n\n<ul>\n<li>BS with 6+ years' experience, or MS with 5+ years' experience, of drug delivery, nanoparticle formulation, and/or controlled drug release platform experience with education background in chemistry, biochemistry, bioorganic chemistry, pharmaceutics, or related field</li><li>Hands on industrial experience in biotech/pharma with experience in drug development or drug product formulation, or equivalent in lab-based related academic research</li><li>Knowledge of chemical/pharmaceutical/biotech industry preferred</li><li>Team player with good inter personal skills with demonstrated ability to work across functions</li><li>Experience in chemical characterization or chemical synthesis</li><li>'Hands on' lab worker</li><li>Good written and verbal communication skills</li><li>Experience preparing lab reports and protocols as well as comfortable presenting scientific data</li><li>Good organizational skills</li><li>Knowledge of analytical instrumentation (pH, HPLC, UV-Vis, NMR, LC/MS), and particle sizing</li><li>Affable personality; ability to perform well in a fast paced small company environment</li><li>Strong attention to detail and ability to multi-task and prioritize assignments</li>\n</ul>\n\n<strong><strong>EEO &amp; Employment Eligibility</strong></strong>\n<br>\nPfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.\n<br><br>\n<strong><strong>Sunshine Act</strong></strong>\n<br>\nPfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider's name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.\n<br><br>\n<strong><strong>Additional Offer Details</strong></strong>\n\n<ul>\n<li>Grade: 6</li><li>Eligible for Employee Referral Bonus</li>\n</ul>\n\nA career at Pfizer offers opportunity, ownership and impact.\n<br><br>\nAll over the world, Pfizer colleagues work together to positively impact health for everyone, everywhere. Our colleagues have the opportunity to grow and develop a career that offers both individual and company success; be part of an ownership culture that values diversity and where all colleagues are energized and engaged; and the ability to impact the health and lives of millions of people. Pfizer, a global leader in the bio-pharmaceutical industry, is continuously seeking top talent who are inspired by our purpose to innovate to bring therapies to patients that significantly improve their lives.\n<br><br>\nPfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates.\n<br>"}