{"job title": "Sr Clinical Scientist (Pharmaceutical Trials)", "company": "Philips", "city state": "– Monroeville, PA", "rating": "3.4", "job description": "**Your challenge**<br> <br><br> <br>Drawing upon scientific experience, acts as an advisor to sales team and clinical trial customers before, during and after the study. Builds customer confidence in the ability to collect and interpret motion data to provide meaningful study endpoints and enhances the perception of Philips as a vendor.<br> <br><br> <br>**Responsibilities**<br> <br><br> <br>+ Assists sales associates in early discussions with prospective customers to supply insight into how motion biosensors may be deployed and the data analyzed to address the questions of interest<br> <br>+ As the opportunity matures, draws on practical knowledge to advance the selling process by advising customers on study design and subject compliance to increase the probability of a successful engagement and data collection<br> <br>+ As a study protocol matures, applies practical experience to advise customers on data collection strategies and practical aspects of deployment of motion biosensors in biomedical research for their specific area of inquiry.<br> <br>+ Consultation on the analysis plan to increase the probability of useful outcomes by selection of useful endpoints.<br> <br>+ If the analytical needs of the customer are non-standard, assist the operations team on development of methods to process the data to the desired endpoints.<br> <br>+ Help present and interpret the results of the motion endpoints to the customer, field questions and design further analytical steps if needed.<br> <br>+ Acts as the scientific advisor to the sales and operations team. Helps interpret complex scientific concepts to enable associates to grow in their expertise.<br> <br><br> <br>**Scientific Marketing Support**<br> <br><br> <br>Consultation with customers, scientific expertise and knowledge in the conduct of pharmaceutical clinical research provides a deep understanding of the needs of stakeholders and the value of motion biosensor solutions. This information is communicated to the marketing associates to ensure that product and solution development is centered on the needs of the customer and what is of value to them. Additionally, the person in this role will act as an internal consultant to help shape the content of marketing materials and participate in promotional activities to most effectively communicate messages of value to the customer.<br> <br><br> <br>**Promotional Related Activities**<br> <br><br> <br>+ Assist in the development of customer facing marketing materials and sales tools as a subject matter expert and expert in the effective communication of value propositions<br> <br>+ Plan a publication strategy to further the scientific credibility and validity of offerings, including those to enable claims needed for effective marketing strategies<br> <br>+ Author abstracts, posters, and scientific publications<br> <br>+ Develop and deliver Scientific Podium Presentations - setting up symposiums - speaking at scientific conferences to advance Philips position of expertise.<br> <br>+ Participates in industry networking activities including the creation of standards with the specific goal of placing Philips in a position of scientific leadership.<br> <br><br> <br>**Business and Product Development Activities**<br> <br><br> <br>+ Consultation with product management to educate them on the state of the art for scientific research in physiological arenas and on market trends for future development.<br> <br>+ Offer novel opportunities to product management for new offerings.<br> <br>+ Creation of use cases to help guide identify features of value and development efforts.<br> <br>+ Development of relationships with key scientific leaders in the areas of interest.<br> <br>+ Identification of clinical research opportunities to support business development activities and consultation on the development and design of clinical research studies to establish product/solution validity.<br> <br>+ Applies analytical expertise to help identify and develop new experimental algorithms from wearable biosensors.<br> <br>+ Works closely with development teams as well as operations to ensure that new solutions are developed in a manner that enables efficient operational deployment and application.<br> <br><br> <br>**We are looking for**<br> <br><br> <br>+ Scientific credentials - Ph.D.<br> <br>+ 5+ Years' experience designing and conducting biomedical research<br> <br>+ Experience including motion biosensors in research studies, ideally pharmaceutical trials.<br> <br>+ Experience in data processing, statistical analysis and the development of study analytical plans for biomedical research. Clinical trials experience is ideal.<br> <br>+ Experienced speaker at scientific conferences and workshops<br> <br>+ Published scientific author<br> <br>+ Eager and able to effectively teach/articulate complex scientific or technological concepts to colleagues and customers<br> <br>+ Strong market foresight, teaming and learning agility.<br> <br>+ Self-starting and innovative thinker<br> <br><br> <br>Philips is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex (including pregnancy), sexual orientation, gender identity, national origin, genetic information, creed, citizenship, disability, protected veteran or marital status.<br> <br><br> <br>As an equal opportunity employer, Philips is committed to a diverse workforce. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants that require accommodation in the job application process may contact 888-367-7223, option 5, for assistance.<br> <br><br> <br>\\#LI-MH1<br> <br><br> <br>**In this role, you have the opportunity to**<br> <br><br> <br>act as an advisor to sales team and clinical trial customers before, during and after the study. Builds customer confidence in the ability to collect and interpret motion data to provide meaningful study endpoints and enhances the perception of Philips as a vendor.<br> <br><br> <br>**You are responsible for**<br> <br><br> <br>+ Assists sales associates in early discussions with prospective customers to supply insight into how motion biosensors may be deployed and the data analyzed to address the questions of interest<br> <br>+ As the opportunity matures, draws on practical knowledge to advance the selling process by advising customers on study design and subject compliance to increase the probability of a successful engagement and data collection<br> <br>+ As a study protocol matures, applies practical experience to advise customers on data collection strategies and practical aspects of deployment of motion biosensors in biomedical research for their specific area of inquiry.<br> <br>+ Consultation on the analysis plan to increase the probability of useful outcomes by selection of useful endpoints.<br> <br>+ If the analytical needs of the customer are non-standard, assist the operations team on development of methods to process the data to the desired endpoints.<br> <br>+ Help present and interpret the results of the motion endpoints to the customer, field questions and design further analytical steps if needed.<br> <br>+ Acts as the scientific advisor to the sales and operations team. Helps interpret complex scientific concepts to enable associates to grow in their expertise.<br> <br>+ Consult with marketing team to ensure inclusion of accurate and valuable scientific content during the development of sales tools and awareness generation materials.<br> <br>+ Work together with Field Marketing to develop and deliver scientific abstracts, publications, podium presentations, best practices workshops during trade shows or other promotional activities.<br> <br><br> <br>**You are a part of**<br> <br><br> <br>Philips Respironics, which is the worldwide leader at anticipating needs and providing valued solutions to the sleep and respiratory markets. The company's focus on home care, hospital, respiratory drug delivery and international markets provide programs that manage sleep disordered breathing, chronic obstructive pulmonary disease, asthma, infant care, congestive heart failure and restrictive lung disorders. Globally positioned, RI has manufacturing facilities in several domestic and international locations.<br> <br><br> <br>**To succeed in this role, you should have the following skills and experience**<br> <br><br> <br>+ Scientific credentials - Ph.D.<br> <br>+ 5+ Years' experience designing and conducting biomedical research ideally pharmaceutical clinical trials<br> <br>+ Experience including motion biosensors in research studies, ideally pharmaceutical trials.<br> <br>+ Experience in data processing, statistical analysis and the development of study analytical plans for biomedical research. Clinical trials experience is ideal.<br> <br>+ Experienced speaker at scientific conferences and workshops<br> <br>+ Published scientific author<br> <br>+ Eager and able to effectively teach/articulate complex scientific or technological concepts to colleagues and customers<br> <br>+ Strong market foresight, teaming and learning agility.<br> <br>+ Self-starting and innovative thinker<br> <br><br> <br>**Why should you join Philips?**<br> <br><br> <br>Working at Philips is more than a job. It?s a calling to create a healthier society through meaningful work, focused on improving 3 billion lives a year by delivering innovative solutions across the health continuum at http://www.philips.com/b-dam/corporate/corporateblog/2016/Philips_Chronic_Disease_5.jpg . Our people experience a variety of unexpected moments when their lives and careers come together in meaningful ways.<br> <br><br> <br>To find out more about what it?s like working for Philips at a personal level, visit the Working at Philips page at http://www.philips.com/a-w/careers/healthtech/working-at-philips/working-at-philips.html on our career website, where you can read stories from our employee blog at http://www.usa.philips.com/a-w/our-people/life-at-philips.html . Once there, you can also learn about our recruitment process at http://www.philips.com/a-w/careers/healthtech.html , or find answers to some of the frequently asked questions at http://www.philips.com/a-w/careers/healthtech/faq.html .<br> <br><br> <br>Philips is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex (including pregnancy), sexual orientation, gender identity, national origin, genetic information, creed, citizenship, disability, protected veteran or marital status.<br> <br><br> <br>As an equal opportunity employer, Philips is committed to a diverse workforce. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants that require accommodation in the job application process may contact 888-367-7223, option 5, for assistance.<br> <br><br> <br>\\#LI-PH1"}