{"job title": "Data Manager - CA", "company": "Aequor", "city state": "– San Diego, California", "rating": "4.1", "job description": "<strong> Actual Job Title = Data COORDINATOR\n<br>\nDuration = start date thru end of 2019\n<br>\nTypical Daily Work Hours = 8am to 5pm (some flexibility in start/end times); 40 hr/week\n<br>\nWeekend &amp; OT work = not required\n<br>\n100% onsite work.</strong>\n<br><br>\nIN MANAGERS WORDS = This is NOT the typical Data Management type role that will be doing analysis of clinical trials, etc. Need contractor who can follow defined process, use command like tools, update status in spreadsheets for mgmt, work with other scientists; AGAIN no analysis will be needed.\n<br><br>\n<strong>CORE JOB FUNCTIONS:</strong>\n\n\n<ul>\n<li>To contribute to our informatics and data management initiatives in Research and Early Development (R/ED).</li>\n<li>Develop, enhance, and automate processes for queuing and prioritizing data management and curation requests</li>\n<li>Create a rapid means to remediate data that fail to meet curation specifications</li>\n<li>Empower scientists with tools and processes needed to support project objectives</li>\n<li>Ensure accurate, complete and timely collection, delivery and tracking of data from translational, CRO or collaborating laboratories for curation, ingestion and delivery to computational scientists</li>\n<li>Work with computational biologists, computational scientists, biostatisticians and study scientists to resolve data quality issues</li>\n<li>Make data, including raw/interim data, available to R/ED department personnel as required</li>\n</ul>\n\n<strong>KNOWLEDGE/SKILLS/ABILITIES (KSA's):</strong>\n\n\n<ul>\n<li>Bachelor's degree in a related discipline with at least 8 years' experience in biomedical data management, data engineering, quality assurance, assay development, specimen data management or related discipline</li>\n<li>Excellent scripting skills in R or python programming</li>\n<li>Experience with REST API and command line interfaces</li>\n<li>General understanding of cloud computing / data storage concepts (S3, NSF)</li>\n<li>Extensive experience managing, processing, and applying quality control metrics and processes to a wide range of data types in support of R/ED clinical trials and drug development experiments while working in close collaboration with basic research, translational and computational scientists.</li>\n<li>Demonstrated proficiency with molecular biology concepts</li>\n<li>Working knowledge of both Windows and Linux operating systems is required</li>\n<li>Must thrive in a complex, dynamic environment while adapting to dynamically changing priorities</li>\n<li>Must have excellent written and verbal communication and presentation skills</li>\n<li>Must have excellent time management and organizational skills</li>\n</ul>"}