{"job title": "Sr. Research Scientist", "company": "Amazon", "city state": "– US, WA, Seattle", "rating": "3.8", "job description": "Research Scientist\n<br>\nAt Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. We are looking for a Research Scientist to be a part of the Grocery Analytics team who will build models and algorithms for procurement, selection, and pricing tools.\n<br>\nThis role is both creative and data driven we need someone who can review our current infrastructure, isolate improvement opportunities, help us think big about what to consider in terms of localization, scalability, commodity management, and long term automation. This role will report into the global Grocery Analytics Team leader and is an individual contributor role.\n<br>\nThis position requires the ability to dive deep large amounts of data, have a great business sense, and the desire to influence key strategic decisions with data-modelled analysis. Working within engineering and product teams and collaborating with key business stakeholders across the company, you will have the opportunity to design and implement features to enhance the experience of Amazon customer, and internal teams. We offer a technologically-sophisticated, customer-focused, data-driven and friendly work environment. Research Scientists at Amazon work directly with diverse scientific teams including Computer Engineers, Data Engineers and other scientists. In this role, you will have an opportunity to work on mathematical problems with a large element of unpredictability. You will analyze and process large amounts of data, develop new sophisticated algorithms and improve existing approaches based on statistical models, machine learning algorithms to generate demand plans based on distributions of confidence.\n<br>\nAs a Research Scientist in the Planning/Materials group you will partner with planning, materials, and system development engineers to enhance system tools and business process capabilities. The main responsibilities of this role are:\n<br><br>\n<strong>KEY RESPONSIBILITIES</strong>\n\n\n<ul>\n<li>Design and develop complex mathematical, simulation and optimization models and apply them to define strategic and tactical needs and drive the appropriate business and technical solutions</li>\n<li>Build a simulation based optimization platform to drive long-term decision making processes</li>\n<li>Prototype these models by using modeling languages such as R, MATLAB, Mosel or in software languages such as Python. A software team will be working with you to transform prototypes into production.</li>\n<li>Collaborate closely with the Supply Chain, Selection, and Pricing functional teams to dive deep into hard technical problems and develop insightful solutions that enable productivity gains</li>\n<li>Work with software engineering teams to drive scalable, real-time implementations</li>\n<li>Track general business activity and provide clear, compelling management reports on a regular basis</li>\n<li>Define solutions for problems across Operations and Supply Chain based on guidance from the Planning Systems Program Manager, and assist in estimating the development effort</li>\n</ul>\n\n<strong>BASIC QUALIFICATIONS</strong>\n<br>\nPhD in Statistics, Applied Mathematics, Machine Learning or a related quantitative field and 5+ years of industry experience, or a Masters degree in the related fields with 5+ years of industry experience\n<br>\n5+ years experience building, iterating and validating statistical models\n<br>\nKnowledge of data management, data cleaning, machine learning, and analytics techniques.\n<br>\nFluency in R, Python or a similar modeling language and in SQL\n<br>\nProficiency in at least one modern programming language such as Java or C++\n<br>\nExperience conveying mathematical concepts and considerations to non-experts\n<br><br>\n<strong>PREFERRED QUALIFICATIONS</strong>\n<br>\nExperience with large data sets\n<br>\nAbility to distill problem definitions, models, and constraints from informal business requirements; and to deal with ambiguity and competing objectives\n<br>\nExperience designing and supporting large-scale distributed systems in a production environment\n<br>\nPrevious experience in a ML or data scientist role with a technology company\n<br>\nKnowledge of scripting for automation (e.g. Python, Perl, Ruby)\n<br>\nWorking knowledge of visualization tools (e.g. Tableau, R-Shiny, Looker, D3)\n<br>\nSupply Chain operations planning and materials management experience and/or prior role in supporting supply chain business processes\n<br>\nExperience with Agile Development techniques\n<br>\nStrong verbal and written communication, influencing and partnership skills\n<br>"}