{"job title": "Scientist - Protein Engineering &amp; Design", "company": "Amgen", "city state": "– South San Francisco, CA", "rating": "3.7", "job description": "Amgen's Therapeutic Discovery organization is seeking an enthusiastic team-oriented Scientist to join the structure-based protein engineering group within Protein Technologies. Protein Technologies is responsible for designing, planning, and executing on the generation of key enabling reagents to support early discovery of small and large molecule therapeutics and cutting-edge novel modalities. The structure-based Protein engineering group prosecutes on challenging targets and tool antibodies/cytokines requiring structural consideration and/or engineering. The work in our group involves a blend of structural analysis and/or computational protein design as well as experimental protein production and characterization of designed proteins.\n<br><br>\nThe successful candidate will be responsible for executing on protein design projects from conceptualization through protein production and delivery to partner functions.\n\n\n<ul>\n<li>*Responsibilities**</li>\n</ul>\n\nSkillfully execute on protein engineering projects from conceptualization and computational structure-based design through experimental protein production and biochemical characterization.\n<br><br>\nSupport structure-based design activities such as fusion protein construct design, complex immunogen design, protein stabilization, affinity modulation of protein/protein interactions, and/or _de novo_ protein design.\n<br><br>\nContinually evaluate and incorporate new technologies to support protein engineering and design.\n<br><br>\nParticipate in project teams and communicate effectively with team members throughout the organization.\n<br><br>\nWork closely with the therapeutic areas, particularly oncology/inflammation and cardiometabolic disorders, to develop project-specific protein engineering strategies to support early discovery-stage projects.\n\n\n<ul>\n<li>*Basic Qualifications**</li>\n</ul>\n\nDoctorate degree\n<br><br>\n<strong>OR</strong>\n<br><br>\nMaster's Degree and 4 years of scientific experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nBachelor's Degree and 6 years of scientific experience\n\n\n<ul>\n<li>*Preferred Qualifications**</li>\n</ul>\n\nPh.D. and postdoc from a leading institution or biotechnology company\n<br><br>\nExpert knowledge of protein structure and protein structure visualization using PyMOL or a similar tool\n<br><br>\nDemonstrated success in protein structure prediction, modeling, and/or design using Rosetta or a similar package\n<br><br>\nExperience in scripting (e.g. Python, Perl) to support complex modeling tasks\n<br><br>\nDemonstrated success in the experimental production and characterization of engineered/designed proteins\n<br><br>\nTrack-record of productive biochemical laboratory experience including molecular cloning, protein expression, protein purification, and/or biophysical characterization\n<br><br>\nExperience in _de novo_ protein design and/or antibody modeling\n<br><br>\nExperience in the analysis of biological data sets in R, Matlab, or similar\n<br><br>\nTrack-record of solving challenging technical problems independently and creatively as evidenced by publication in leading journals\n<br><br>\nStrong written and verbal communication and interpersonal skills\n<br><br>\nDesire to be a team player in a cross-functional team environment\n<br><br>\nAbility to thrive and adapt in a dynamic environment\n<br><br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n<br><br>\nAmgen will consider for employment qualified applicants with criminal histories in a manner consistent with the San Francisco Fair Chance Ordinance."}