{"job title": "Data Engineer", "company": "Arcblock, Inc.", "city state": "– Bellevue, Washington", "rating": "NA", "job description": "ArcBlock is looking for an experienced Data engineer who is passionate about building great products in the context of a diverse, multi-functional and independent team.\n<br><br>\nOur systems need to meet remarkably high standards of quality, performance and reliability, operating around the clock on a massive scale. If you are a talented, detail-oriented and enthusiastic professional who is passionate about new technologies including big data, computer vision, and machine learning, then this is the right team for you.\n<br><br>\nIn this Data Engineering role, you will work closely with product engineering teams and data scientists to tackle problems in on-chain/off-chain data mining, anomaly detection, personalization, search, ranking, etc. You will build end-to-end data solution for the company, from analytics event definition, data collection, ETL jobs, all the way down to key metrics visualization and matching learning model serving. You will work closely with backend, client and product/business team to delivery calibrated internal metrics/learnings and best user experience for our customers and users.\n<br><br>\n<strong>Who we are?</strong>\n<br><br>\nArcBlock Inc.is a global leader in the blockchain revolution. We are building the first-lever Blockchain 3.0 ecosystem designed to reimagine how blockchain apps and services are built. ArcBlock is combining current and next-generation blockchain technologies with cloud computing and token economics that remove today’s technological limitations and deliver a complete framework to developers that empowers them to build blockchain decentralized applications service. We’re excited to announce that the company is growing and we are looking to add to our industry-best talent and are looking for people who are excited about the future.\n<br><br>\n<strong>Why work here?</strong>\n\n<ul>\n<li>A fast-growing team of passionate people and a tech-first / user-centric blockchain business</li>\n<li>Autonomy and end-to-end ownership</li>\n<li>A unique culture that is driven by our common principles</li>\n<li>Competitive pay,Token Incentive Plan, full medical, catered lunch, and your choice of hardware</li>\n<li>Big opportunity for internal growth (weekly BBLs, monthly retrospective, bootcamp every 6-8 weeks, tech conferences,opportunity to work from US and China, and travel around the world etc.)</li>\n</ul>\n<strong><u>Essential Duties and Responsibilities</u></strong>\n\n<ul>\n<li>Primary focus on delivering end-to-end solutions</li>\n<li>Build and work with various data pipelines</li>\n<li>Build the team capability for continuously multi-var A/B testing</li>\n<li>Build machine learning models and deliver the models to Backend team</li>\n<li>Work closely with Backend team to build anomaly detection engine for both customers and our own infrastructure</li>\n</ul>\n<strong><u>Basic Qualifications</u></strong>\n\n<ul>\n<li>BSc/MSc in Computer Science or related field</li>\n<li>3+ years of industry experience, at least two of which in a data infrastructure related role</li>\n<li>Proven track record of building and operating scalable, flexible and always-on data pipelines</li>\n<li>Strong knowledge of Scala and Apache Spark</li>\n<li>A passion for shipping production quality code with good test coverage</li>\n<li>Ability to quickly evaluate and make trade-off decisions on adopting emerging technologies</li>\n<li>An understanding of supervised and unsupervised machine learning methods</li>\n</ul>\n<strong><u>Preferred Qualification</u></strong>\n\n<ul>\n<li>Familiarity with blockchain concepts and algorithms</li>\n<li>Familiarity with Amazon AWS tools and technologies</li>\n<li>Demonstrated leadership abilities in an engineering environment in driving operational excellence and best practices</li>\n<li>The ability to take raw product requirements and develop software solutions and designs, to bring them to life</li>\n<li>Excellence in technical communication with peers and non-technical cohorts</li>\n</ul>"}