{"job title": "Scientist I, Protein Sciences", "company": "BioMarin Pharmaceutical", "city state": "– San Rafael, California", "rating": "3.6", "job description": "BioMarin is the world leader in delivering therapeutics that provide meaningful advances to patients who live with serious and life-threatening rare genetic diseases. We target diseases that lack effective therapies and affect relatively small numbers of patients, many of whom are children. These conditions are often inherited, difficult to diagnose, progressively debilitating and have few, if any, treatment options. BioMarin will continue to focus on advancing therapies that are the first or best of their kind.\n<br><br>\nBioMarins Research &amp; Development group is responsible for everything from research and discovery to post-market clinical development. Research &amp; Development involves all bench and clinical research and the associated groups that support those endeavors. Our teams work on developing first-in-class and best-in-class therapeutics that provide meaningful advances to patients who live with rare diseases. Come join our team and make a meaningful impact on patients lives.<br><br><strong>SUMMARY DESCRIPTION</strong>\n<br><br>\nProtein Sciences Research is seeking a Scientist level I that will play an important role in the discovery-stage research of biotherapeutics as a member of the Protein Purification sub team. The Scientist I will work within multidisciplinary teams of scientists/research associates to provide experimental expertise in purifying and characterizing protein-based drug candidates or drug targets. He or she also will have the opportunity to develop processes that empower downstream production efforts to drive the rapid scale up of preclinical stage therapeutics. This position involves a unique blend of discovery, experimental, and development skills in protein science and process development to support both discovery- and development-stage processes for novel therapeutics.\n<br><br>\n<strong>RESPONSIBILITIES</strong>\n<br><br>\nAs a Scientist I in the Protein Sciences group within the Research &amp; Drug Discovery department, the Scientist is responsible for providing expertise in experimental design and execution, data analysis, and problem solving using standard protein chemistry techniques to help discover and develop novel therapeutics for preclinical development. These include:\n<ul>\n<li>Advanced skills in experimental design, data analysis, and data presentation. Capable of independent scientific thinking.</li></ul>\n\n<ul>\n<li>Extensive background in Akta based protein purification, ultrafiltration/diafiltration, and clarification processes is required.</li></ul>\n\n<ul>\n<li>Develop protein purification, characterization and analytical methods</li><li>Assist development-stage programs (process development, formulation, etc.)</li><li>Identify and implement new technologies or improved approaches in protein chemistry</li><li>Has primary or shared responsibility for complex projects.</li><li>Normally receives general instruction on routine work; detailed instruction on new assignments.</li><li>Is capable of generating quality scientific publications with limited assistance from coworkers.</li><li>Assist in the evaluation of new project ideas</li><li>The successful candidate with plan and execute experimental protocols, present results at project team or departmental meetings, and engage in collaborative teamwork.</li> <li><strong>EXPERIENCE</strong></li></ul>\n\n<ul>\n<li>A candidate with a strong background in protein science is required, with demonstrated accomplishments producing and characterizing proteins of multiple classes.</li><li>Extensive experience with Akta-based protein purification is required.</li><li>The ideal candidate not only demonstrates a thorough understanding of protein structure, but also possesses complementary technical skills in lab innovation and the development and application of novel techniques to solve challenging problems</li><li>Experience with robotics and other high throughput technologies to accelerate discovery and development is a plus. PhD in relevant field with 0-2 years industry experience preferred; MS with 5+ years; BS with 8+ years also acceptable</li><li></li><li><strong>EQUIPMENT</strong></li> <li>Candidate is expected to interact with upstream processing groups in research as well as on the development side as well as purification process development and translational biology</li><li></li><li><strong>SUPERVISOR RESPONSIBILITY</strong></li><li>The successful candidate may have 0 to 1 direct reports</li> <li><strong>CONTACTS</strong></li><li>Knowledge of medium pressure chromatography systems as well as downstream processing filtration equipment and HPLC systems</li> <li><strong>EDUCATION</strong></li><li>The candidate must demonstrate an ability to work collaboratively with other scientists/research associates with diverse backgrounds, and efficiently manage time in order to organize, prioritize and execute tasks in a fast-paced work environment. Excellent oral and written communication skills, and a high degree of personal responsibility are valued.\n<br><br>\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.</li>\n</ul>\n\n<strong>~BIO</strong>"}