{"job title": "Senior Research Scientist", "company": "Bristol Myers Squibb", "city state": "– Hopewell, NJ", "rating": "3.7", "job description": "Bristol-Myers Squibb is a global biopharmaceutical company whose mission is to discover, develop and deliver innovative medicines that help patients prevail over serious diseases.\n<br><br>\nOne shared journey is moving us forward at Bristol-Myers Squibb. Around the world, we are passionate about making an impact on the lives of patients with serious disease. Empowered to apply our individual talents and ideas so that we can learn and grow together. Driven to make a difference, from innovative research to hands-on community support. Bristol-Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees the resources to pursue their goals, both at work and in their personal lives.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nEstablish and utilize appropriate in vitro and ex vivo cellular models to identify and validate of novel therapeutic targets in fibrotic diseases; Develop cell-based and biochemical approaches and technologies to understand mechanism of action of candidate therapeutics; Possess and remains updated on relevant scientific literature, applying external knowledge to internal drug discovery programs as appropriate; Document, analyze, and interpret experimental results; present results and conclusions at internal team meetings.\n<br><br>\n<strong>Qualifications:</strong>\n<br><br>\n+ At least 6 yrs with MS; At least 8 yrs with BS; BS or MS.\n<br><br>\n+ Bachelor?s degree in cell or molecular biology, in vitro pharmacology or related discipline with at least 8 years work experience or Master?s degree with at least 6 years work experience, preferably within the Pharmaceutical/Biotechnology sector.\n<br><br>\n+ Experience with cellular and molecular techniques including maintenance of cell culture, in vitro cell-based assay development, cell transfection, RNA/protein extraction, qPCR, ELISA, multiplex cytokine assessment, IHC, western blots and others; Experience with ex vivo tissue explant culture would also be of value; Able to work independently, creatively and collaboratively to determine methods and procedures, design and execute experiments.\n<br><br>\n+ Demonstrate excellence in data analysis and interpretation; Self-motivated, ability to think strategically, work independently and proven time management skills and ability to support multiple projects p in a fast pace and collaborative environment.\n<br><br>\n+ Excellent organizational skills and strong oral and written communication skills.\n<br><br>\nBristol-Myers Squibb is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status."}