{"job title": "MEDICAL LAB SCIENTIST", "company": "Duke University Health System", "city state": "– Durham, North Carolina", "rating": "3.9", "job description": "Job Description\n<br><br>\n<strong> Occupational Summary</strong><br><br>Perform a variety of routine and complex technical tasks in the performance of laboratory tests to obtain data for use in the diagnosis and treatment of disease. Job duties are dependent on the laboratory and may be composed of a combination of the following duties and responsibilities related to the specialization. Tasks are performed according to written procedures and policies with careful monitoring of quality control and quality assurance practices.<br><br><strong> Work Performed</strong>\n<li> Perform a variety of tests in clinical laboratories using standard techniques and equipment; perform related duties in the laboratory to include specimen handling, using manual and automatic equipment to test specimens, and perform and report analytical tests.</li> <li> Operate manual or computerized instrumentation.</li> <li> Calibrate and maintain instrumentation according to standard operating procedure.</li> <li> Process patient samples for testing using appropriate identification techniques and written procedures to ensure quality material for testing.</li> <li> Perform basic troubleshooting of assay problems as directed by senior staff.</li> <li> Communicate problems/issues to appropriate individuals.</li> <li> Maintain inventory of supplies and equipment.</li> <li> Participate in the development of new medical laboratory tests and techniques.</li> <li> Participate in the preparation for lab inspections.</li> <li> Review lab inspection documents and procedures to maintain knowledge.</li> <li> Bring any non-compliance issues to the attention of upper level staff.</li> <li> Perform proficiency testing as directed to maintain compliance with regulatory agencies.</li> <li> Document quality control and quality assurance results.</li> <li> Notify upper level personnel of instrument malfunctions or unusual or unexpected data or results.</li> <li> Review written procedures and policies for accuracy and submit changes to manager or designee.</li> <li> Understand, comply, and perform with all necessary safety procedures.</li> <li> Maintain compliance with safety training.</li> <li> Report all safety incidents within 24 hours.</li> <li> Attend all laboratory meetings, safety and compliance training as required.</li> <li> Comply with competency testing procedures for the laboratory staff.</li> <li> Comply with laboratory training programs.</li> <li> May provide technical guidance and instruction to students, interns, residents, staff and other employees.</li> <li> Perform other related duties incidental to the work described herein.</li> <li> Use behaviors that support achievement of balanced scorecard targets and support DUHS values.</li> <li> Consistently cooperate and communicate effectively with co-workers to ensure effective workflow.</li>\n<strong> Knowledge Skills and Abilities</strong>\n<br><br>\n<strong> Level Characteristics\n<br><br>\nMT, Medical Laboratory Technologist, Med Lab Scientist, Medical Technologist, ASCP, Clinical Laboratory Technologist, lab tech, med tech, MLS</strong>"}