{"job title": "User Experience Scientist", "company": "GE Global Research", "city state": "– San Ramon, CA", "rating": "3.3", "job description": "<br><br><b>Role Summary: </b><br>As a User Experience Scientist at Global Research you will conduct research, design, and development on projects related to but not limited to the areas of visual analytics, intelligent user interfaces, and augmented reality to enhance individual and collaborative user experience for people at work. <br><br><b>Essential Responsibilities: </b><br>Work with engineering, design, and product teams to turn the research and design concepts into digital platform and service innovations that will transform the industrial world. Current projects include interactive collaborative visualization for big data, visual analytics, 3D printing &amp; additive manufacturing, AR for people at work, and other topics.<br><br><br>You will:<br><br>-\tDefine and implement research &amp; design in the areas of visual analytics, 3D printing, as well as user experience innovation for people at work, and drive impact into businesses &amp; products<br>-\tPublish, and continue to grow the portfolio GE intellectual property in the tradition of Edison<br>-\tProvide intelligence to GE about new trends in user experience, visualization, and HCI methods, tools and technologies as well as disruptive design concepts and research ideas<br>-\tStay abreast / ahead of new trends in user experience, visualization and HCI methods and technology, and drive innovations in information visualization and HCI in the industrial space<br>-\tHelp build a world class human-systems interaction and AI research organization <br>-\tActively participate in professional and academic organizations to bring in top talent, new ideas and to grow GEâs reputation as an experience leader and innovator <br><br><b>Qualifications/Requirements: </b><br>-\tPh.D. in Human-Computer Interaction (HCI), Cognitive Science or closely related disciplines with a focus on user experience and visualization for both 2D &amp; 3D information &amp; digital means OR Masters Degree in Human-Computer Interaction (HCI), Cognitive Science or closely related disciplines with a minimum of 3 years of experience with user experience and visualization for both 2D &amp; 3D information &amp; digital means<div>- Experience with Javascript and other front-end web technologies specifically with React-Redux <br><div>-\tAbility and willingness to work out of an office located in San Ramon, CA or Niskayuna, NY </div><div>-\tAbility and willingness to travel, as required </div><div>-\tLegal authorization to work in the U.S. is required. GE may agree to sponsor an individual for an employment visa now or in the future if there is a shortage of individuals with particular skills </div><div>- Must be 18 years or older. </div><div>- You must submit your application for employment on the careers page at www.gecareers.com to be considered.</div></div> <br><br><b>Desired Characteristics: </b><br>-\tProfessional research and publication history in user experience, visual analytics, information visualization, intelligence interfaces, or related area(s) <div>-\tResearch in areas of user experience, information visualization, 3D interfaces, AI, or the ethnography of work and technology diffusion </div><div>-\tA broad understanding of the theories and principles in user experience, information visualization, and human-computer interaction </div><div>-\tThe ability to create tangible design concepts that demonstrate research and innovation outcomes in user experience and information visualization </div><div>-\tThe ability to effectively communicate research and design results and to work with engineering and product teams to translate research into business impact </div><div>-\tMinimum of 5 years of experience working on cross-functional teams in research settings (industrial or academic), and the ability to define and build support for a research and development program </div><div>-\tProven innovation and analytical skills </div><div>-\tExcellent written and verbal communication skills, and the ability to influence through insight<br></div> <br><br><b>About Us: </b><br><p>At GE Global Research, were redefining whats possible. From cutting-edge research in molecular pathology for use in personalized cancer diagnostics to programs in coal gasification and renewable power that drive clean energy solutions, our work at Global Research is world-renowned. As part of our team, youll find yourself among scientists and engineers from every discipline in a dynamic atmosphere where youll be constantly challenged to learn and grow. Youll have access to leaders on all levels of the organization and collaborate across the globe with the very best in the field. If you have an insatiable intellectual curiosity and the ability to articulate your vision, then join us and watch the work you do create the next generation of products and processes that will impact the globe for generations to come.</p><p><br><br></p><p>At GE Global Research we redefine what's possible, finding answers to some of the world's toughest problems. Find out more at http://www.ge.com/research or http://twitter.com/geresearchjobs, and connect with our technologists at http://www.edisonsdesk.com and http://twitter.com/GEresearch</p><br><br><br>GE offers a great work environment, professional development, challenging careers, and competitive compensation. GE is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law. <br><br><b>Locations: </b> United States; California, New York; San Ramon, Niskayuna<br><p>GE will only employ those who are legally authorized to work in the United States for this opening.</p>\n<p> </p>"}