{"job title": "Computer Scientist – Intermediate", "company": "Jacobs", "city state": "– Fort Meade", "rating": "3.4", "job description": "<strong>** This position is pending contract award. **</strong><br>\n<div>Jacobs is one of the world’s largest and most diverse providers of full-spectrum technical, professional and construction services for industrial, commercial and government organizations globally. The company employs over 74,000 people and operates in more than 40 countries around the world.</div>\n<br>\n<div>\n<div>Jacobs is looking for talented individuals to join our team for DISA's Joint Interoperability Test Command (JITC) supporting the upcoming Test, Evaluation, and Certification (TEC) contract. We are seeking current/former incumbents who are/or have supported the current JITC T&amp;E MSS IDIQ contract (at Fort Huachuca, AZ and Fort Meade, MD), as well as any candidates who have skill sets that can support the full spectrum of IT communication systems and software test and evaluation.</div> \n<br>\n<li>Please be advised, this position may be assigned to one of Jacobs Sub-Contractors</li>\n\n</div>\n<br>Performs professional assignments in the general area of computer hardware, software, and firmware such as: computer system protocol analysis, computer operations, programming, data base structuring and management, and T&amp;E of C5ISR, AIS, and IT/NSS. Demonstrates expertise in a variety of the field's concepts, practices, and procedures and may provide consultation on complex projects as a top-level contributor/specialist. Work requires thorough knowledge of recent developments and technologies in the specialty area, as well as proficiency in high- level languages. Defines systemrequirements based on user/client needs, cost, and required integration with existing applications, systems, or platforms. Designs new solutions or recommends improvements to existing implementations. Responsible for designing and developing technical standards and functionality tests for new capabilities. Responsible for the development of specifications, prototypes, or initial user guides. Responsibilities may include specific software code development and maintenance, and the development, documentation, and maintenance of test automation in accordance with quality assurance standards.\n<br><br>\nMust be familiar with a variety of the field's concepts, practices, and procedures. Relies on experience and judgment to plan and accomplish goals. Performs a variety of complicated tasks. A certain degree of creativity and latitude is required. Works under general supervision. Typically reports to a project leader, supervisor, or manager. Must be adept at problem solving, identifying risk, and communicating results and recommendations.<br>\n<div>Requires a Master's degree and at least 6 years of experience, or a Bachelor’s degree and at least 8 years of experience. The degree must be in a relevant technical curriculum and experience must be related to the job duties.\n<br><br>\nRelevant technical degrees include the following, though the Government may consider other curriculums, various engineering and science disciplines, Physics, Operations Research, Computer Science, and Mathematics.\n<br><br>\nRelated certifications in the area of specialization may be substituted for 1 year of experience. Examples of relevant Government or industry training include, but are not limited to, DAWIA T&amp;E Level III certification, SPRDE Level III certification, CTEP certification, and applicable United States Federal or DoD school training and certification on a specific system, network, or technology.</div><br>\n\n<div>This position will require a security clearance at the Secret level or higher.</div>\n<br>\n<div></div>\n<br>\n<strong><div>Essential Functions:</div>\n<br>\n</strong>\n<br>\n<div><strong>Physical Requirements</strong></div>\n<br>\n<div>Work may involve sitting or standing for extended periods of time. Position may require filing, typing, and reading from a computer screen. Must have sufficient mobility, included but not limited to: bending, reaching, turning and kneeling to complete daily duties in a timely and efficient manner. There is a possibility that due to parking availability and location of work, walking moderate to long distances may be required.</div>\n<br>\n<div><strong>Work Environment</strong></div>\n<br>\n<div>An inside and outside environment (considerations: closed quarters, close together, lighting). Needs to be able to work well with co-workers and all levels of management. No hazards on job or unusual environmental conditions.</div> \n<br>\n<div><strong>Equipment and Machines</strong></div>\n<br>\n<div>Ability to operate office equipment such as a personal computer, printer, copy machine, telephone, fax machine and other equipment including desk supplies and other work related tools as required.</div>\n<br>\n<div><strong>Attendance</strong></div>\n<br>\n<div>Core work hours will be between 9:00 a.m. – 3:00 p.m. Monday - Friday. Regular attendance of scheduled hours is extremely important, but not critical, except for deadlines and meetings. Punctuality and regular attendance are necessary to meet deadlines. Must exhibit flexibility of work hours to adjust to surge situations based on critical mission requirements.</div>\n<br>\n<div><strong>Other Essential Functions</strong></div>\n<br>\n<div>Must demonstrate professional behavior at all times when dealing with customers, management and co-workers. Must have clear, concise and accurate communications skills in English, both verbal and written. Grooming and dress must be appropriate for the position and must not impose a safety risk to employees or others. Must maintain a positive work atmosphere by behaving and communicating in a professional manner. Independent personal transportation to office or work site is required. Travel to and from customer’s locations and the test fields may be required to support projects. This may involve airline travel. In some cases, accommodations can possibly be made for POV, if necessary. When operating any vehicle for work purposes, must wear seat belt and in addition, no cellular devices are to be used when vehicle is in motion.</div>"}