{"job title": "Corporate Operations Group - BI Data Engineer (Contract)", "company": "Macquarie Group", "city state": "– Jacksonville", "rating": "3.7", "job description": "Join our Finance Data &amp; Analytics team as a BI Data Engineer in our Jacksonville office on a 12-month contract, where you will be responsible for designing and developing solutions using Microsoft Power BI and Alteryx following a Scrum methodology within the Agile framework.\n<br><br>\nIn this role your responsibilities will include working alongside SMEs and Technical Business Analyst to develop automated data acquisitions using Alteryx, developing visualization solutions in Power BI, doing unit testing to ensure deliverables meet acceptable quality metrics, as well as proactively identifying and managing data risk and ensuring those risks are understood. You will also work across the full development life cycle all the way from development through to deployment of deliverable to production environments.\n<br><br>\nTo be successful in this role you will have 5+ yeas of experience with automated data acquisition, preparation and blending using Alteryx, strong abilities designing and developing visualization solutions using tools like Power BI and Tableau, good understanding of data architecture principles, including data access patterns and data modelling. As well as demonstrable experience and techniques working to source and join large and disparate data sets from upstream systems, experience with Agile development methodology and prior experience in the financial services industry will also be expected\n<br><br>\nThe Financial Management Group provides financial, tax and treasury services to all areas of Macquarie. The group is focused on providing strategic analysis and advice to Macquarie's businesses and senior management, managing Macquarie's funding, liquidity and capital position, ensuring Macquarie continues to meet regulatory and compliance obligations and managing Macquarie's corporate communications and investor relations.\n<br><br>\nTo join an innovative and Agile team of technology professionals, apply now online, or visit www.macquarie.com/careers to find our more.\n<br><br>\nAll qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, national origin, age, disability, or protected veteran status. Macquarie takes affirmative action in support of its policy to hire and advance in employment individuals who are minorities, women, protected veterans, and individuals with disabilities."}