{"job title": "Big Data Cloud Engineer", "company": "Monsanto", "city state": "– Saint Louis, MO", "rating": "4.0", "job description": "We are currently seeking a talented **Big Data Cloud Engineer** . This role will be located in St. Louis, MO, reporting to the Cloud Analytics Technical Platform Lead.\n<br><br>\nOur team industry-leading Big Data Platform to transform domains as diverse as genomics to precision agriculture. The Big Data Cloud Engineer will help drive the growth of this platform as we pursue our mission of feeding the world while conserving resources and improving lives. In this position, you will engage with data scientists to drive the development of cutting edge massively scalable workflows and pipelines and to develop and deploy state-of-the-art machine learning models.\n\n\n<ul>\n<li>*Key Responsibilities:**</li>\n</ul>\n\n+ Partner with other engineering and data science teams to design, develop and deploy data processing and delivery pipelines which will be consumed by scalable and massively parallel workflows, pipelines and machine learning model deployments\n<br><br>\n+ Identify, test and validate current and immerging big data technologies within a cloud infrastructure including AWS and GCP native tools, Kafka, Spark, Cassandra, SQL, NoSQL and graph databases\n<br><br>\n+ Become an expert of AWS services and leverage infrastructure as code frameworks to develop reproducible deployments\n<br><br>\n+ Design, develop and deploy scalable and massively parallel workflows and pipelines using technologies such as Serverless, Lambdas, Step Functions and Kubernetes\n<br><br>\n+ Partner with a wide variety of domain experts including in silico breeding, precision agriculture and genomics to develop enterprise wide solutions\n\n\n<ul>\n<li>*Required Skills/Experience:**</li>\n</ul>\n\n+ Minimum of a Bachelor?s Degree or equivalent combination of education and experience\n<br><br>\n+ Hands on experience building modern big data ETL workflows in the cloud\n<br><br>\n+ At least 3 years of experience working with AWS cloud assets and tools\n<br><br>\n+ At least 5 years of experience with Python, R and/or equivalent scripting languages\n<br><br>\n+ Expertise in building scalable and massively parallel processes using ECS, Kubernetes and/or equivalent\n<br><br>\n+ Practitioner of software development and strong understanding of engineering best practices including: git, Continuous Integration and Delivery, Infrastructure as code and containerization via Docker\n\n\n<ul>\n<li>*About Us:**</li>\n</ul>\n\nBayer successfully completed the acquisition of Monsanto in June 2018, bringing together Monsanto?s leadership in seeds and plant traits with Bayer?s leadership in chemical and biological crop protection. By joining forces, we will create even more extensive career opportunities for talent around the world. We?re a global team working to shape agriculture through breakthrough innovation that will benefit farmers, consumers, and our planet.\n<br><br>\nWhile we are now Bayer, we will continue to hire using separate career sites until we can integrate our career platforms. We invite you to explore the career opportunities available at the combined company by visiting advancingtogether.com/careers.\n<br><br>\n<strong>\\#LI-POST</strong>\n\n\n<ul>\n<li>*Organization:** _GLB IT P&amp;E Technical Platforms_51183629_</li>\n<li>*Title:** _Big Data Cloud Engineer_</li>\n<li>*Location:** _North America-USA-Missouri-St. Louis_</li>\n<li>*Requisition ID:** _01RMV_</li>\n<li>*Job:** _Information Technology_</li>\n<li>*Schedule:** _Full-time_</li>\n</ul>\n\nAt Monsanto, we value a diverse combination of ideas, perspectives and cultures. All qualified applicants will receive consideration for employment without regard to, among other things, race, religion, color, national origin, age, sex, sexual orientation, gender identity, gender expression, status as a protected veteran, or status as a qualified individual with a disability. If you need a reasonable accommodation to access the information provided on this website, please for further assistance.access our disability accommodations process\n<br><br>\nU.S. Employment Law (applicable for U.S. jobs ONLY): EEO Employer Minorities/Females/Protected Veterans/Disabled. For information about equal employment opportunity rights, please refer to this information from the U.S. federal government: ; .\n<br><br>\nEEOC PosterEEOC Supplement"}