{"job title": "Clinical Laboratory Scientist", "company": "UCLA Health", "city state": "– Westwood, CA", "rating": "3.8", "job description": "<div><strong>Responsibilities</strong><br><br>Under the general supervision of a Senior Supervisor CLT, perform independently a wide variety of technical procedures in the ED, Anes and Core Laboratory. Other responsibilities include method development-modification-parallel testing, collaboration on or independent preparation of abstracts or manuscripts, repair of laboratory instruments, sample processing, reagent preparation, data entry and phlebotomy duties. Perform testing in toxicology, chemistry, hematology, coagulation, immunoassay, and blood gases. Operate laboratory instruments and develop/maintain records of instrument maintenance and quality control. Maintain all laboratory equipment in good working order by following established preventive and routine maintenance schedules. Initiate and perform troubleshooting and minor repair on laboratory instruments. Maintain records of laboratory tests performed. Prepare written reports and/or technical summaries. Record and review data for accuracy, completeness, and suitability. Perform various quality control tasks and computations and assist Sr Supervisors and Sr Specialists with quality programs: record keeping and document control systems, collection and collation of data, tracking laboratory compliance.</div>\n<br>\n<div><strong>Qualifications</strong><br><br>A current California Clinical Laboratory Scientist License. Two years of recent experience performing testing in a high volume laboratory, preferred. Recent demonstrated technical competence in high volume chemistry/hematology required. Ability to perform effectively under conditions of fluctuating workload, often changing from one task to another on an hourly or daily basis. Must have working knowledge of lab safety, basic lab skills (pipetting, dilutions, specimen integrity, etc) and test methodologies used in chemistry, hematology, urinalysis, infectious disease testing. Skill in practical application of fractions, percentages, ratios and proportions to used in making reagents and in performing calculations. Able to establish and maintain cooperative working relationships with personnel in the section, laboratory and ancillary medical areas. Under conditions of frequent interruptions, distractions and heavy workload while maintaining equanimity, accuracy and productivity. Able to work in an environment with variations in temperature, instrument noise, usage of toxic or hazardous chemicals, fumes, odors and biological agents and interaction with sick patients. Able to perform repetitive tasks (i.e. pipetting, computer data entry). Skill in writing accurately and legibly to record data, convey information, etc. Demonstrated skill in speaking on a one-to-one basis using appropriate vocabulary and grammar (English) to obtain or give information, explain procedures, teach, etc., and to report results. Demonstrated skill in listening perceptively to instructions or information and conveying awareness and understanding or lack of understanding as appropriate.</div>\n\n<br>"}