{"job title": "Polymer Scientist", "company": "W.L. Gore", "city state": "– United States-Maryland-Elkton", "rating": "3.2", "job description": "<p>Gore is a technology-driven global company built on entrepreneurial innovation, integrity, and teamwork. Our diverse portfolio includes everything from high-performance fabrics and implantable medical devices to industrial manufacturing components and aerospace electronics. Through our product leadership, we've been changing lives and changing industries for more than 50 years. What can you change by joining Gore? Visit gore.com/change-life to find out.<br><br>Job Description<br>The Composites center of excellence (COE) in Core Technology is looking for an energetic and hands-on materials scientist with a track record of innovation. This individual will create and drive technology development efforts that are aligned with global Enterprise needs and the strategic vectors of our technical community. <br><br>If you are searching for a company where you can make a difference, we’re looking for you. In this role, you will engage in and champion use-inspired exploratory research in a quest to develop knowledge driven, composite material solutions to fuel future growth for Gore. This position is located in Elkton, Maryland. <br><br><br>The ideal candidate will:</p>\n<p><br>• Be passionate about developing technology and products that are the highest quality in their class<br>• Be energized by working for a world-class manufacturer and collaborating on cross-functional teams<br>• Recognize the importance of building and maintaining strong interpersonal relationships<br><br>While the role and responsibilities will vary based on business priorities, they include:<br><br>• Performing use-inspired research, guided by speculative value hypotheses<br>• Identifying, communicating and acting upon gaps in our materials capability<br>• Influencing the material selection decisions for new product development efforts <br>• Developing advanced characterization techniques for composite materials<br>• Hands-on prototyping of innovative technologies, new ideas and solutions </p>\n<p> </p> \n<p> </p>\n<p><strong>Required Job Qualifications:</strong></p>\n<ul>\n<li>\n<div>Ph.D. in polymer science, polymer physics, materials science, chemical engineering, mechanical engineering, or a related technical field</div>\n</li><li>\n<div>A minimum of 3 years professional work experience in a science, engineering, or related technical field</div>\n</li><li>\n<div>Proven success as a principal investigator (generating hypotheses to initiate and complete investigations at a quick pace)</div>\n</li><li>\n<div>Demonstrated success in the creation of novel technology through use-inspired research</div>\n</li><li>\n<div>Proven track record inventing new technology and capturing intellectual property</div>\n</li><li>\n<div>Experience assessing a technology by identifying gaps and opportunities</div>\n</li><li>\n<div>Experience explaining the behavior of materials using a balanced approach of empirical, computational and theoretical tools</div>\n</li><li>\n<div>Proven success working within an interdisciplinary team</div>\n</li><li>\n<div>Working knowledge of mechanics, including principles of viscoelasticity and failure of materials</div>\n</li><li>\n<div>Hands-on and results oriented approach to research </div>\n</li><li>\n<div>Working knowledge of experimental design and data analysis</div>\n</li><li>\n<div>Working knowledge of a variety of polymer characterization techniques</div>\n</li><li>\n<div>Excellent verbal and written communication skills, including the ability to teach a technically diverse audience using formal and informal techniques</div>\n</li><li>\n<div>Willingness to sign confidentiality and non-competition agreements</div>\n</li><li>\n<div>Willingness to travel up to 10\"</div></li></ul>\n<p><br><strong>Desired Job Qualifications:</strong></p><strong></strong>\n<ul>\n<li>\n<div>More than 5 years of post-educational work experience developing new materials</div>\n</li><li>\n<div>Experience with fluoropolymer-based product development</div>\n</li><li>\n<div>Experience with polymer processing</div>\n</li><li>\n<div>Experience driving external collaboration on projects with universities, government labs or industry</div>\n</li><li>\n<div>Past participation in an immersive entrepreneurship training</div></li></ul>\n<p> </p>\n<p> </p>\n<p>Gore is committed to a drug-free workplace. All employment is contingent upon successful completion of drug and background screening.<br><br>Gore requires all applicants to be eligible to work within the US. Gore generally will not sponsor visas unless otherwise noted on the position description.<br><br>Gore is a M/F, Disabled and Vet EEO/AA Employer. (Applies to all positions in the U.S.)</p>\n<p><br> </p>\n<p><strong>Keywords</strong>: Gore, job, Baltimore, Elkton, Philadelphia, Wilmington, Maryland, MD, Pennsylvania, PA, Delaware, DE, surface, science, scientist, polymers, liquids, interactions, molecular, interfacial, interactions, filtration, membrane, separations, lamination, coating, biology, biological, interfaces, technology, chemical, engineering, extrusion, adhesive, resins</p>"}