{"job title": "Senior Data Scientist-Oncology Bioinformatics", "company": "AstraZeneca", "city state": "– US - Waltham - MA", "rating": "3.8", "job description": "<p></p><p><b>Senior Data Scientist, Oncology Bioinformatics </b>(Cambridge, UK)</p><p></p><p>AstraZeneca is a global biopharmaceutical company driven by what science can do. We are dedicated to discovering, developing, and delivering innovative, meaningful medicines and healthcare solutions that enrich the lives of patients. The vision of AstraZeneca <b>Oncology</b> is to redefine cancer, redefine our solutions to cancer, and restore patients' lives. To achieve this, we have an exciting and diverse portfolio combining agents targeting <b>tumor cell drivers</b>/dependencies and the tumor microenvironment and <b>immune response</b>.</p><p></p><p>The Oncology Bioinformatics group work within cross-disciplinary drug project teams throughout the discovery and translational pipeline, driving new target discovery, pre-clinical and clinical <b>research</b>. The global group, currently 14 full time computational and quantitative biologists, spans the UK and US.</p><p></p><p>Excitingly AstraZeneca IMED is reshaping its organization and data to take full advantage of <b>artificial intelligence</b> (AI). The Oncology Bioinformatics group is expanding and diversifying harness the fuller potential of <b>data science</b>, <b>machine learning</b> (ML) and AI for our portfolio. Multiple exciting opportunities exist for talented and motivated individuals to join the team. Applicants will join a burgeoning <b>community</b> of data scientists, sharing expertise to tackle diverse data problems across our research organization.</p><p></p><p>Encouragement and support will be provided to help the individual develop specialist knowledge and skill sets.</p><p></p><p><b>Main duties and responsibilities:</b></p><ul><li>Collaborate with drug project bioscience and translational scientists to understand their scientific and technical challenges and identify where data science can best impact.</li><li>Collaborate with the IT, data and quantitative science community to devise innovative data science solutions.</li><li>Draw actionable insight by developing and implementing ML/AI techniques to big data spanning clinical genomics, pre-clinical assays, and published knowledge.</li><li>Build models predicting new drug targets, drug mechanisms and drug combination effects.</li><li>Expand the knowledge of ML/AI capabilities across the drug discovery research pipeline.</li><li>Proactively engage in knowledge sharing and peer support.</li><li>Implement and train our bench community in FAIR data practices to augment AI.</li></ul><p></p><p><b>Your skills and qualifications will ideally include:</b></p><ul><li>Strong quantitative background with a PhD [or equivalent] in computer science, mathematics, statistics, data science, engineering, or similar.</li><li>Broad experience in data analysis and classical supervised and unsupervised ML methods such as random forests, SVMs, penalized regression, KNN, clustering, dimensionality reduction, ensemble methods, Bayesian methods (probabilistic programming, Gaussian processes).</li><li>Deep knowledge of at least one of the following areas of AI: <b>deep learning</b>, reinforcement learning, <b>natural language processing</b>.</li><li>Programming proficiency and experience with relevant software tools such as R, Python (other programming languages welcome e.g. Julia, MATLAB), version control (Git/Bitbucket), and databases (SQL as well as NoSQL);</li><li>Working in a Linux environment, with experience of cluster or cloud computing (e.g. AWS or Azure).</li><li>Excellent communication and presentation skills.</li></ul><p></p><p><b>Next Steps – Apply today!</b></p><p>To be considered for this exciting opportunity, please complete the full application on our website at your earliest convenience – it is the only way that our Recruiter and Hiring Manager can know that you feel well qualified for this opportunity. If you know someone who would be a great fit, please share this posting with them.</p><p></p><p>AstraZeneca is an equal opportunity employer. AstraZeneca will consider all qualified applicants for employment without discrimination on grounds of disability, sex or sexual orientation, pregnancy or maternity leave status, race or national or ethnic origin, age, religion or belief, gender identity or re-assignment, marital or civil partnership status, protected veteran status (if applicable) or any other characteristic protected by law. AstraZeneca only employs individuals with the right to work in the country/ies where the role is advertised.</p><p></p><p></p><p><b>Date Posted</b></p>14-Jun-2018<p></p><p><b>Closing Date</b></p>"}