{"job title": "DATA SCIENTIST in Portland, Oregon location Contract to Hire", "company": "Oloop Technology Solutions", "city state": "– Portland, Oregon", "rating": "4.5", "job description": "Skills Required:\n<ul>\n <li>5+ years experience in advanced analytics and machine learning model development and validation.</li> <li>3+ years experience working in industry, leading analytic-based projects, and delivering results within scope, funding, and duration.</li> <li>Excellent written and verbal communication skills are required to convey advanced statistical concepts to all levels of employees. Data visualization skills are required.</li> <li>Strong problem solving skills with a drive to learn and master new technologies and techniques.</li> <li>Strong experience using a variety of data mining/data analysis methods.</li> <li>Advanced experience with Python or R.</li> <li>Experience using statistical software (SAS, SPSS, etc.).</li> <li>Experience using analytics reporting software like Spotfire, Tableau, Excel, etc.</li> <li>Experience with SQL Server databases, T-SQL queries and ETL. Familiarity with Hadoop and Hive is desired.</li> <li>Knowledge of the following concepts:\n\n<ul>\n <li>Data transformations (e.g. log transformation, standardization, normalization)</li> <li>Univariate and Multivariate tests (e.g. t-test, non-parametric rank tests, ANOVA, MANOVA, ANCOVA, regression)</li> <li>Statistical modeling (e.g. linear regression, generalized linear models, multivariate regression, ARIMA models, classical time series decomposition, mixed models)</li> <li>Clustering (e.g. k-means, hierarchical clustering, Gaussian mixtures)</li> <li>Dimensionality reduction (e.g. Principle Components Analysis, Discrete Fourier transform, Wavelets)</li> <li>Classification (e.g. logistic regression, Support Vector Machine, neural networks, K-NN, na ve Bayes, decision trees)</li> <li>Optimization concepts (e.g. boosting and bagging)</li></ul> </li>\n<li>Leverage Big Data to discover patterns and solve strategic and tactical business problems using massive structured and unstructured data sets across multiple environments.</li> <li>Familiarity with shifting products from an OnPrem to SaaS model</li> <li>Working knowledge of SDLC including Agile methodologies</li> <li>Demonstrated ability to coordinate cross-functional work teams toward task completion</li> <li>Demonstrated effective leadership and analytical skills</li> <li>Smart, driven and problem solver</li> <li>Highly motivated self-starter with the ability to prioritize</li> <li>Ability to perform well under pressure in a fast-paced environment with a high sense of urgency.</li> <li>Completion of a Bachelor's Degree from an accredited institution that prepares the employee for the assignment.</li> <li>Preferred Graduate degree in data science, machine learning, mathematics, statistics, or related discipline.</li>\n</ul>\n\nHealthcare experience preferred\n<br>"}