{"job title": "Senior Research Scientist", "company": "Peraton", "city state": "– US-DC-", "rating": "3.2", "job description": "<div><div>\n<div>Peraton is currently seeking a Senior Research Scientist to join our research team at the Naval Research Laboratory in Washington, DC (located near the Wilson Bridge and off of 295). This is a highly dynamic research environment where you will be working with cutting edge theories and technology. If you have the skills, a high desire to learn, like to work in a University type environment and are open to new ideas, concepts and challenging problem resolution then this is a perfect fit for you!</div>\n</div>\n</div>\n\n<br>Responsibilities<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li>The candidate shall perform research and development in the area of communication networks, primarily for wireless tactical applications.</li> <li>The scope of his work includes both basic research and applied R&amp;D projects.</li> <li>Ability to conduct research and development in the area of tactical radio networks, wireless ad hoc and sensor networks.</li><li>Knowledge of communication theory, network theory, and information theory.</li><li>Knowledge of computer programming and operating systems.</li><li>Ability to design, develop, and apply software design techniques.</li><li>Ability to communicate orally and in writing as evidenced by scientific publications.</li></ul></div>\n</div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li>Ph.D. in Physics, Electrical or Computer Engineering, or computer science.</li><li>10+ years of experience (to include PostDoc).</li><li>Cognitive radio and networking, and dynamic spectrum access.</li><li>Mathematical analysis and optimization of networks.</li><li>The development of algorithms for centralized and distributed network control, which may address areas such as network organization and connectivity, channel access, routing, and flow-control, and validating these algorithms via the use of various networking simulation and emulation methodologies; the resultant networks are robust and are capable of operation under hostile conditions.</li><li>Address issues related to power management, connectivity, and energy efficiency in ad hoc as well as sensor networks.</li><li>Theoretical analysis followed by simulation and possible testbed implementation must be used to verify the design.</li><li>The applied research that the candidate engages in involves the analysis, evaluation and recommendations concerning planned or proposed communication and networking systems for naval and other military applications.</li>\n</ul>\n<strong>SECURITY CLEARANCE:</strong>\n<ul>\n<li><strong>Candidate MUST be a US Citizen and clearable to the Secret level.</strong></li></ul></div>\n</div>\n</div>\n\n<br>About Peraton<br>\n\n<div>\n<div>\n<div>Peraton provides innovative, reliable solutions to the nation’s most sensitive and mission-critical programs and systems. Peraton has significant experience providing highly differentiated secure communications, space, and technology solutions to key customers, and has become a trusted partner on missions that are critical to the security priorities of the United States. Capabilities include complex software and technology services and solutions, as well as end-to-end mission operations abilities, including Software Systems Development, Cyber, Modeling &amp; Simulation, Mission Operations, Signal Intelligence (SIGINT), and Quick Reaction Capabilities (QRC) / Research &amp; Development. The company is headquartered in Herndon, VA, with approximately 3,500 employees across the U.S. and Canada.</div>\n</div>\n</div>\n\n<br>EEO Statement<br>\n\n<div>\n<div>\n<div><em>We are an Equal Opportunity/Affirmative Action Employer. We consider applicants without regard to race, color, religion, age, national origin, ancestry, ethnicity, gender, gender identity, gender expression, sexual orientation, marital status, veteran status, disability, genetic information, citizenship status, or membership in any other group protected by federal, state, or local law.</em></div>\n</div>\n</div>\n<br>"}