{"job title": "Data Scientist Spine", "company": "Publicis Spine", "city state": "– New York, New York", "rating": "NA", "job description": "Company Description<br><br><strong>About Publicis Spine:</strong>\n<br><br>\nPart of Publicis Groupe (Euronext Paris Exchange: FR0000130577; CAC 40 index), Publicis Spine was established in 2017 to serve the data and analytics and technology needs of Publicis Groupe agencies and their clients. Its mission is to grow clients businesses through transformative data applications and is the home to Publicis Groupes proprietary technology platform, Publicis PeopleCloud. It includes a consistent, transparent, best-in-class approach to data, analytics solutions, partnerships and technology via a closely joined network of engineers, technology experts, product designers, analysts and data scientists all empowering marketing and digital business transformation.\n<br><br>\n<strong>About Publicis PeopleCloud:</strong>\n<br><br>\nOur global platform is Publicis PeopleCloud. It starts with a simple principle: the more we know about people, the more we can drive brand growth by converting people at scale. Publicis PeopleCloud is an end-to-end platform that organizes data into Publicis IDs, integrating 1st, 2nd, and 3rd party data and using machine learning to match cookies, devices, and offline behaviors to actual people, in a privacy-compliant manner. Aggregating these IDs provides a basis for growth planning, building audiences, creating content, managing and measuring consumer campaigns. The platform sits within the Publicis Spine and supports the full spectrum of marketing transformation and digital business transformation for our clients.\n<br><br>\n<strong>We are built on the foundation of Trust, Talent, Transformation:</strong>\n<br><br>\n<strong>TRUST</strong> \n<br>\nTrust is the cornerstone upon which we build our relationships. We hold ourselves to the highest standards of how a partner should behave. We treat our people and our clients with respect, transparency and honesty.\n<br><br>\n<strong>TALENT</strong>\n<br>\nThis is first and foremost a people business. We are committed to ensuring Publicis Media a destination for the best talent in our industry. We value people as individuals, growing ourselves as we grow our clients business.\n<br><br>\n<strong>TRANSFORMATION</strong> \n<br>\nTrue transformation comes when we stop managing change, and instead initiate change. We believe in our purpose to be the admired force for business transformation. We believe that focusing on performance and results has the power to transform client business.<br><br>Job Description<br><br>The Spine Global Product Engineering team seeks an accomplished Data Engineer and aspiring Data Scientist for an exciting opportunity on the Data team. You will be involved with designing a new workflow for data science and analytics that are a big part of the roadmap for 2018 and implement workflow processes for data science projects that scale for data in the billions. You will design large distributed technical solutions, manage research projects resulting in real world project and data pipelines that support data products. To start you will assist with, but eventually lead data science POC projects.\n<br><br>\n<strong>Your day to day will include:</strong>\n<ul>\n<li>The design and management of data pipe-lines using Luigi or other ETL system</li><li>Uncanny ability to look at code, identify bottlenecks and adjust through code refactor and/or tuning Spark parameters</li><li>Writing Java and Scala applications for data processing and engineering</li><li>Implementing standard and custom machine learning techniques across big data</li><li>Facing challenging and complex business problems daily</li><li>The investigation, procurement and ramp up to new technologies</li><li>Collaboration and team work, you enjoy fostering relationships and partnering with others daily and will work closely with the Product Management team</li>\n</ul>\n\nQualifications<br><br><strong>We are looking for a talented team member who is also a delight to work with, which usually includes:</strong>\n<ul>\n<li>Bachelor's degree in Mathematics, Computer Science, Engineering, Statistics</li><li>Data engineering experience in Java, Python and/or Scala</li><li>Accomplished in the design of efficient and robust ETL workflows</li><li>A background in software engineering</li><li>Clear understanding of Web Services</li><li>Knowledge of Big Data Architectures (Hive/Hadoop, Redis and/or Dynamo DB)</li><li>Experience with SQL and/or NoSQL</li><li>Excellent oral and written communication skills</li><li>A collaborative spirit and a drive to solve problems creatively</li><li>Extra credit for implementing Machine Learning on parallelize infrastructure</li>\n</ul>\nGot the goods? We would love to hear from you<br><br>Additional Information<br><br>All your information will be kept confidential according to EEO guidelines."}