{"job title": "Managing Director, Data Scientist", "company": "SunTrust Banks", "city state": "– Atlanta, GA", "rating": "3.2", "job description": "Req ID: W453318\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nThe role is responsible for overseeing the build out of a comprehensive data analytics strategy within Sales, Trading and Research. The initial focus will be in Equity Research. The teammate will be responsible for working with our senior equity research analysts to identify data sets that can be leveraged to improve our published research, as well as, implementing processes for their capture and organization, and integration into data analyses. Execution of this role will require an understanding of data modeling, statistical modeling, machine learning, data lineage and governance, as well as an ability to work collaboratively with traders, research analysts, management, technology representatives, other internal constituents, and potentially institutional investors.\n<br><br>\nLeverage data to fulfill business opportunities ? This includes identification of valuable data, acquisition, modeling, and storage of the data, as well as the integration of the data into data analysis processes.\n<br><br>\nGuide the establishment of a comprehensive data strategy, including the creation of processes based on best practices for the acquisition of data (both structured and unstructured, from a variety of sources), normalization of data, analysis, and visualization of the data.\n<br><br>\nCollaborate with technology teammates to ensure consistent delivery and usage of the data along with best data lineage/governance practices.\n<br><br>\nWork with teammates to understand data needs and existing data analytics that are being performed by those teammates. This includes working with the teammate to understand the business issues to be solved, and for serving as a subject matter expert in the data. Further, must collaborate with business and technology to identify, organize, and build proprietary data sets, utilize statistical and/or machine learning methods to draw proper conclusions from the data, prototype tools for analysis and sourcing, and to pursue new research topics from the data.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nExperience\n<br><br>\nRequired: 7-8 years of relevant experience with an advanced degree (either masters or PhD); Experience in statistical methods and modeling; Strong data profiling, mining, and cleaning skills and experience; Ability to perform complex data analysis on large volumes of structured &amp; unstructured data and communicate with research analysts and other teammates; Strong coding and programming skills with knowledge of Python, R, Java, SQL and other programming languages; Proven experience with data science technologies and design, development, and implementation skillsets; Experience with data tools and technical documentation skills; Previous exposure to capital markets a plus as is solid understanding of the equity market; Strong familiarity with big data technologies; Ultimately will need to be licensed: Series 7, 86, 87, and 63 but not a prerequisite for interview.\n<br><br>\nPreferred: PhD degree in a relevant field such as Mathematics, Statistics or Computer Science\n<br><br>\n<strong>Skills</strong>\n<br><br>\nRequired: Proficiency in at least one scripting language such as Python, one statistical package such as R or SAS and one general purpose object-oriented programming language such as Java or C#.\n<br><br>\nPreferred: Experience with data modeling techniques and various database types (Relational and NoSql); Experience with financial instruments and data.\n<br>\nEqual Opportunity Employer: SunTrust supports a diverse workforce and is a Drug Testing and Equal Opportunity Employer. SunTrust does not discriminate against individuals on the basis of race, creed, color, gender, religion, national origin, age, disability, veteran status, pregnancy, marital status, citizenship status, sexual orientation, gender identity, genetic information, or any other classification protected by applicable laws.\n<br><br>\nTo review the EEO Poster, copy and paste the following link into your browser: http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf http://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\n<br><br>\n? 2017 SunTrust Banks, Inc. All rights reserved.\n<br><br>\nSunTrust is federally registered service marks of SunTrust Banks, Inc."}