{"job title": "Research Scientist II - Organic Chemistry", "company": "The Broad Institute", "city state": "– Cambridge, MA", "rating": "4.2", "job description": "<strong>Job Description</strong>\n<br><br>\nThe Broad Institute is an amazing place - we exist to apply our deep knowledge of human genetics to empower a revolution in biomedicine and accelerate the pace at which the world conquers disease. The Broad Institute’s Center for the Development of Therapeutics (CDoT) and its team of professional “drug hunters” partner with faculty at MIT, Harvard and the Harvard teaching hospitals to translate emerging biological insights into novel therapeutic strategies. We couple novel technologies and approaches to industry-standard drug discovery rigor to tackle some of the most challenging targets across a wide range of disease areas (including oncology, cardiovascular disease and diabetes, psychiatric disease, infectious disease).\n<br><br>\nWe are looking for a highly motivated and talented chemist within CDoT to support advancement of compounds from PRISM screening. The PRISM multiplex screening platform efforts are yielding many hits with provocative predictive biomarkers and patterns of sensitivity. This position will be part of a multidisciplinary team challenged with identifying the targets and mechanism of action of these hit compounds, and advancing the compounds to later stages of drug discovery. Ideally you will have experience establishing SAR for chemical probes and having contributed to project teams at early stages from Target and Hit Identification through Lead Optimization. You will work closely with other chemists, cell biologists, biochemists, structural and biophysical scientists and pharmacologists. Having dual reporting structures into Chemistry and Translation Science, you will play a key role in driving projects forward within CDoT at the Broad Institute.\n<br><br>\n<strong>Requirements:</strong>\n<br><br>\nThe qualified candidate will have a demonstrated record building SAR for chemical tools and advancing compounds in early stages of drug discovery. This should include:\n<ul>\n<li>Ph.D. in synthetic/medicinal chemistry with 3+ years of research experience beyond postdoctoral training in an academic or industrial settingwith successful interaction with external customers, CROs, and team members.</li><li>Demonstrated track record of success in establishing SAR, characterizing compounds, and implementing medicinal chemistry strategies across different stages of drug discovery from hit identification through to lead optimization</li><li>Significant experience in cutting-edge synthetic chemistry, with evidence of creative solutions to complex synthesis problems</li><li>Deep experience working with multi-disciplinary teams and utilizing cross-functional data to drive drug discovery projects</li><li>Experience managing and integrating internal resources with external commercial collaborators and contract research organizations to achieve project goals in a timely and cost effective manner.</li><li>Must have strong interpersonal and communication skills.Serving as the core chemist on cross-functional project teams</li>\n</ul>\n#LI-POST\n<br><br>\nEOE / Minorities / Females / Protected Veterans / Disabilities\n<br><br>\n<strong>EEO is The Law - click here for more information</strong>\n<br><br>\n<strong>Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled</strong>"}