{"job title": "Position Senior Statistics Data Scientist", "company": "The Dow Chemical Company", "city state": "– Indianapolis, Indiana", "rating": "3.7", "job description": "<strong> Description</strong>\n<br><br>\n<strong> Corteva Agriscience,</strong> Agriculture Division of <strong> DowDuPont</strong> has an exciting opportunity for a Statistician. This position, <strong> Senior Statistics Data Scientist</strong> , will join the Mathematics and Statistics Team within Data Science and Informatics R&amp;D. The position is located in Indianapolis, IN. <strong> Duties and Responsibilities:</strong> The successful candidate will a) work with research partners to advance discovery, characterization, and development of agricultural chemical molecules (b) develop and apply state of the art statistical methods in the area of predictive toxicology and safety (c) develop advanced analytics capabilities for use by partners in research, production, and services in crop protection and seeds research. In addition, the successful candidate will be responsible for improving statistical awareness of partners and will work closely with them to carefully define research questions, design experiments and optimal study procedures. Working in a diverse group of data scientists, the candidate will also have opportunities to learn and apply modern machine learning and data science techniques to relevant problems. <strong> Competencies:</strong> <li> The ideal candidate must have strong experience in applying regression models (e.g. linear regression, generalized linear models, mixed models, non-linear models), curve fitting, and other general statistical methods.</li>  <li> Experience in statistical programming using R, SAS, Python, or MATLAB with strong experience in at least one of these is required.</li>  <li> Written and verbal communication skills and the ability to successfully collaborate and lead projects with colleagues from diverse technical backgrounds is required.</li>  <li> Critical thinking and strong problem solving skills are also required.</li>  <li> Prior Experience in dose-response modeling is preferred.</li>"}