{"job title": "Data Scientist II", "company": "Zurich NA", "city state": "– Jersey City, NJ", "rating": "NA", "job description": "<ul>\n<li>*Data Scientist II**</li>\n<li>*Description**</li>\n<li>*Job Summary**</li>\n</ul>\n\nZurich is currently looking for a Data Scientist II towork out of the Predictive Analytics Center of Excellence in our North Americanheadquarters in Schaumburg, Illinois or Jersey City, New Jersey.\n<br><br>\nThe Data Scientist II role is criticalto the success of Zurich and the Data Scientist team as the role blendsanalytical problem solving, project management, and leadership:\n<br><br>\n+ Leadspredictive analytics projects - this means leading a team of data scientists andcollaborating with our stakeholders to solve business challenges\n<br><br>\n+ Conductsexploratory data analysis, model development, model monitoring, and benefitestimation\n<br><br>\n+ Partners with business stakeholders totranslate business objectives into clearly defined analytical projects\n<br><br>\n+ Works with the business to develop andimplement a strategy on how to use the predictive model for most impact\n<br><br>\n+ Establishes and maintains collaborativerelationships throughout the organization\n<br><br>\n+ Demonstrates commitment to continuouseducation and personal development on areas of technical expertise and shareknowledge with team members and business partners.\n\n\n<ul>\n<li>*Job Qualifications**</li>\n<li>*Basic Qualifications:**</li>\n</ul>\n\n+ High School Diploma or Equivalent with 7 or more years of experience in Computer Science, Statistics or Mathematics and experience transforming data in the business analysis area\n<br><br>\n<strong>OR</strong>\n<br><br>\n+ Zurich Certified Insurance Apprentice including an Associate Degree in Computer Science, Statistics or Mathematics and 5 or more years of experience transforming data in the business analysis area\n<br><br>\n<strong>OR</strong>\n<br><br>\n+ Bachelor?s Degree in Computer Science, Statistics or Mathematics and 5 or more years of experience transforming data in the business analysis area\n<br><br>\n<strong>OR</strong>\n<br><br>\n+ Master?s Degree in Computer Science, Statistics or Mathematics and 3 or more years of experience transforming data in the business analysis area\n<br><br>\n<strong>OR</strong>\n<br><br>\n+ Ph.D. in Computer Science, Statistics or Mathematics and 0 or more years of experience transforming data in the business analysis area\n\n\n<ul>\n<li>*PreferredQualifications:**</li>\n</ul>\n\n+ Advanced analytical and problem solving skills\n<br><br>\n+ Ability to develop actionable solutions to business challenges\n<br><br>\n+ Advanced knowledge of statistical and predictive modeling techniques such as machine learning, decision trees, ensemble learning, probability networks, association rules, regularized models, clustering, regression, GLMs, and neural networks and their application to business decisions\n<br><br>\n+ Demonstrated experience in one or more of the above mentioned statistical and/or machine learning techniques\n<br><br>\n+ Experience applying data transformation techniques such as exact and probabilistic matching methods; fuzzy matching, text mining, and data reduction\n<br><br>\n+ Experience applying data transformation techniques such as exact and probabilistic matching methods; fuzzy matching, text mining, and data reduction\n<br><br>\n+ Experience with programming and data mining tools such as R, Python, SAS, SQL, Hadoop, Hive, or Pig\n<br><br>\n+ Excellent verbal and written communication skills, particularly possessing the ability to share technical results and recommendations toaudiences at varying levels of analytic understanding\n<br><br>\n+ Ability to perform high-level work both independently and collaboratively as a project member or leader on multiple projects.\n<br><br>\n+ Coach and provide technical advice and counsel within and outside operating unit. **Additional Information**\n<br><br>\nImagine working for a company that truly cares about theiremployees, customers, stakeholders, and communities they serve. Imagine workingfor a values-driven organization that has the ambition and desire to be thebest global insurance provider in the world. Zurich is that place where 55,000employees across approximately 200 countries and territories are all focused onhelping people and helping companies protect what is truly most important tothem. We are a values-driven organization that takes pride in the work that wedo every day and we have the ambition to be the best global insurer in theworld.\n<br><br>\nEOE disability/vets\n<br><br>\nZurich does not accept unsolicited resumes from search firms oremployment agencies. Any unsolicited resume will become the property of ZurichAmerican Insurance. If you are a preferred vendor, please use our RecruitingAgency Portal for resume submission.\n\n\n<ul>\n<li>*Primary Location:** United States-Illinois-Schaumburg</li>\n<li>*Other Locations:** United States-New Jersey-Jersey City</li>\n<li>*Schedule** Full-time</li>\n<li>*Travel** Yes, 15 % of the Time</li>\n<li>*Relocation Available** Yes</li>\n<li>*Job Posting** 06/29/18</li>\n<li>*Unposting Date** Ongoing</li>\n<li>*Req ID:** 180003DQ</li>\n</ul>\n\nIt is the Policy of Zurich in North America, as an equal opportunity employer, to attract and retain the best-qualified individuals available, without regard to race/ethnicity, color, religion, gender expression, genetic information, national origin, sex, gender identity, sexual orientation, marital status, age, disability or protected veteran status."}