{"job title": "Intermediate Investment Analyst-Data Management-Aegon AM", "company": "Aegon", "city state": "– Cedar Rapids, IA", "rating": "3.5", "job description": "<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Ensure at a high level of accuracy the quality of daily and monthly analytics for securities and alternative asset classes such as a mortgage loans and derivatives. (i.e. duration, weighted avg. live, yield, etc...)</li>\n<li>Support security pricing functions as required for daily and month end processes.</li>\n<li>Work closely with the Point of Contact for analytics and keeping them apprised of status on issues and projects.</li>\n<li>Complete thorough research on behalf of Data Management and propose appropriate solutions.</li>\n<li>Understand and be able to speak to multiple domains of data (i.e. Security, Benchmark, Analytics, and Pricing).</li>\n<li>Perform business analysis to determine best practices within daily production/projects.</li>\n<li>Continuous improvement mindset, improving data quality with a focus on customer service.</li>\n<li>Participate and set high expectations of self on daily production and projects.</li>\n<li>Provide excellent customer service to all clients and internal customers.</li>\n</ul>\n\n<strong>Required Qualifications:</strong>\n\n\n<ul>\n<li>Bachelor's degree in Finance or related fields.</li>\n<li>3+ years of related experience in financial services industry or technical analysis</li>\n<li>Proven ability to collaborate with a variety of internal and external parties to understand customer needs and ensure positive outcomes for our clients.</li>\n<li>Process improvement experience preferred, with the ability to recognize opportunities within own role.</li>\n<li>Strong analytical, problem recognition and resolution, and communication skills.</li>\n<li>Strong organizational skills with the ability to handle multiple assignments.</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Working knowledge of fixed income products and investment processes preferred.</li>\n<li>Experience with Aladdin desired</li>\n<li>Strong Excel skills</li>\n<li>CFA Level 1 passed</li>\n</ul>\n\nJob and compensation levels depend upon an applicant's qualifications including the extent of his/her relevant experience and other job related factors and will be determined by hiring supervisors/managers and HR.\n<br><br>\nCompany information\n<br><br>\nWhy Work for Us\n<br><br>\nTotal Rewards at Transamerica: It's more than a paycheck. Our comprehensive Total Rewards package is designed to help support you in many ways throughout all stages of your life and career. We provide a competitive, market-driven program that encompasses base compensation, bonus potential, retirement, health and wellness benefits, learning and development opportunities, plus great employee perks. All designed with you in mind to help you live your best life, grow personally and professionally - and feel valued for the work you do.\n<br><br>\nLearn more about our Total Rewards Package.\n<br><br>\n<strong>Equal Opportunity Employer:</strong>\n<br><br>\nTransamerica Life Insurance Company is an Equal Employment Opportunity employer and does not discriminate against any applicant or employee because of age, religion, sex, gender identity, genetic information, race, color, national origin, pregnancy, sexual orientation, marital status, participation in the uniformed services (e.g. U.S. Armed Forces, National Guard), physical or mental disability, or any other status protected by federal, state, or local equal employment opportunities laws.\n<br><br>\nAEGON USA Realty Advisors, LLC, is an Equal Employment Opportunity/ Affirmative Action Employer and does not discriminate against any applicant or employee because of age, religion, sex, gender identity, genetic information, race, color, national origin, pregnancy, sexual orientation, marital status, participation in the uniformed services (e.g. U.S. Armed Forces, National Guard), physical or mental disability, or any other status protected by federal, state, or local equal employment opportunities laws.\n<br><br>\nApplicants with physical or mental disabilities may be entitled to a form of reasonable accommodation under the Americans with Disabilities Act and certain state and local laws. A reasonable accommodation is a change in the way things are normally done which will insure equal employment opportunity without imposing undue hardship on the Transamerica Companies. If you are a job seeker with a disability, or are assisting someone with a disability, and require assistance to apply for one of our jobs, please contact: applicantsupport@transamerica.com.\n<br><br>\n<strong>Technical Assistance:</strong>\n<br><br>\nIf you experience technical problems during the application process, please email applicantsupport@transamerica.com.\n<br><br>\nApply\n<br><br>\nRelated vacancies\n\n\n<ul>\n<li>Marketing Manager - Aegon AM Cedar Rapids</li>\n<li>Intermediate Investment Analyst-Trade Operations-Aegon AM Cedar Rapids</li>\n<li>Intermediate Investment Analyst Data Mgt Aegon AM Cedar Rapids</li>\n<li>Intermediate Investment Analyst - Securities Operations Cedar Rapids</li>\n</ul>\n\nSee all vacancies\n<br><br>\nTransamerica Transamerica careers\n<br><br>\nVisit the dedicated careers website for more information about working for Transamerica.\n<br><br>\nLearn more\n<br><br>\nRoles Roles at Aegon\n<br><br>\nFind out more about different roles available at Aegon and Transamerica Globally.\n<br><br>\nLearn more"}