{"job title": "Senior Data Analyst", "company": "Babcock Power", "city state": "– Louisville KY", "rating": "2.6", "job description": "<div> <strong>Babcock Power is an Equal Opportunity Employer (M/F/D/V).</strong>\n<br><br>\nStart Over with Job Search\n<br>\nReturning Applicant? Login Now</div> <div> Senior Data Analyst</div>\n<br>\n<div> \n<div> Company: Babcock Power</div> <div> Location: Louisville KY</div> <div> Job Type: Information Technology</div> </div>\n<br>\n<div><strong>Position Summary:</strong></div><div> The Data Analyst supports business users by designing and developing solutions that provide data for making important business decisions. The person performing this job will be required to program efficiently in T-SQL, develop SQL Server Reporting Services (SSRS) reports, and develop Power BI dashboards and data-sets for our end-users.</div><br>\n\n<div><strong>Essential Responsibilities:</strong></div><div>\n\n<ul>\n <li>Design and develop a variety of ad-hoc and standard reports.</li> <li>Design and develop data security structures</li> <li>Create and maintain documentation for both IT standards and end-user assistance.</li> <li>Train users in the use of ad-hoc reporting.</li> <li>Develop and maintain the data warehouse reporting environment</li> <li>Work with key business representatives to gather and define reporting needs</li> <li>Design and develop KPI dashboards for business stakeholders.</li> <li>Troubleshoot and resolve data/reporting issues.</li></ul></div><br>\n\n<div><strong>Job Requirements / Skills, Knowledge and Abilities:</strong></div><div>Minimum Qualifications:\n<ul>\n <li>Bachelor’s degree or equivalent preferred.</li> <li>Minimum of 5 years of database programming and T-SQL experience.</li> <li>Minimum of 2 years of SQL Server Reporting Services report writing experience.</li> <li>Power BI Pro experience preferred.</li> <li>Microsoft SQL Server database programming experience required.</li> <li>Oracle database programming experience a plus.</li> <li>Proficiency with T-SQL language is required.</li>\n</ul>\nPrimary tools used:\n<ul>\n <li>SQL Server Reporting Services (SSRS)\n\n<ul>\n <li>2014 and later</li></ul> </li>\n<li>SQL Server Integration Services (SSIS)\n\n<ul>\n <li>2014 and later</li></ul> </li>\n<li>Power BI Desktop - Pro</li> <li>SQL Server Management Studio (SSMS)</li> <li>SQL Developer\n\n<ul>\n <li>Oracle database access</li></ul> </li>\n<li>T-SQL Required</li> <li>PL-SQL a plus</li> \n</ul>\nAdditional Skills Required:\n<ul>\n <li>Strong understanding of database structures, design, and reporting techniques required.</li> <li>Fluent in the creation of complex reports, scripts, and stored procedures.</li> <li>Analytical ability to gather and interpret requirements and then utilize those requirements to develop, recommend and implement reporting solutions.</li> <li>Must display good verbal and written communication skills.</li>  <li>Have the ability to work directly with business users and software vendors on problems and projects.</li>  <li>Ability to communicate complex technical issues clearly and effectively to any audience.</li> <li>Ability to work independently as well as in a team environment</li>  <li>Ability to organize work, respond to changing priorities and multitask</li>  <li>Quality Focused, Shows commitment to quality in data and reporting output to the business users.</li></ul></div>\n<br>"}