{"job title": "Regulatory Reporting Sr. Data Analyst - Band 5", "company": "Bank of America", "city state": "– Charlotte, NC", "rating": "3.6", "job description": "<strong>Job Description:</strong>\n<br><br>\nThe Regulatory Reporting Sr. Data Analyst will be part of the enterprise non-financial regulatory reporting (NFRR) group in Chief Data Office (CDO) organization and will play a vital role in establishing data strategy and documenting data requirements for regulatory reporting across enterprise (GBAM, Consumer, GWIM and Control Functions). The Regulatory\n<br><br>\nReporting Sr. Analyst will be responsible for:\n<ul>\n<li>Developing data dictionary and report generation playbooks for regulatory reports and identifying cross-data dependency across reports</li><li>Performing current state data landscape assessment across all data domains leveraged for regulatory reporting. Cross-domain reviews to identify synergies and opportunities to eliminate redundancy and duplication of data.</li><li>Analyzing requirements documents created to fulfill regulatory reporting needs for Non-Financial Regulatory Reports and identifying/documenting common data requirements across reports</li><li>Creating technical specifications for the sourcing and transformation of the data to meet requirements. The analysis and mapping will require working closely with representatives of various data sources, determine the appropriate data source, negotiate usage of the data, and document the technical specifications.</li><li>Usage of desktop tools, such as Trifacta, to create technical logic for the preparation of data for the fulfillment of requirements.</li><li>Delivery of a set of specifications to the technical implementation team which will be operating in an AGILE manner.</li><li>Part of a team of data analysts, data architects and domain SMEs to establish regulatory reporting data strategy.</li><li>Providing data domain subject matter expertise in Securities and Derivatives, Banking, Anti-Money Laundering, Escheatment, Consumer Mortgage, Commercial Lending and other domains.</li>\n</ul>\n<strong>Required Skills:</strong>\n<ul>\n<li>7+ years of experience as a business/data analyst in a complex financial industry data environment.</li><li>Strong ability to examine physical data and infer relationships to business context and requirements</li><li>Strong understanding of LEAN AGILE or other iterative development methodologies with practical exposure to these techniques</li><li>Extensive hands-on experience in regulatory reporting for one or more of the following domains: Securities and Derivatives, Global Markets, Global Banking, Anti-Money Laundering, Escheatment, Consumer Mortgage, Commercial Lending or HR.</li><li>Experience working in a data environment in Global Banking &amp; Markets organization is desired along with excellent understanding of Banking &amp; Markets trading instrument lifecycle.</li><li>Data Governance Data Management Standards &amp; Policies, PRC (Process, Risk &amp; Controls), Data Quality &amp; Controls</li><li>A bachelor degree in computer science or related field is highly desirable.</li><li>Strong knowledge of database modeling principles, techniques and enterprise data management best practices.</li><li>Ability to effectively manage day-to-day interactions and relationships with a diverse group of colleagues.</li><li>Put people at ease when necessary and instill a high degree of trust quickly and genuinely.</li>\n</ul>\nExtensive experience with one/more of the following data tools &amp; technologies:\n<ul>\n<li>Data Platforms Oracle, SQL Server, Hadoop</li><li>Query Language - SQL</li><li>Data Preparation Trifacta</li><li>Data Management - Zaloni</li>\n</ul>\n<strong>Shift:</strong><br><br>1st shift (United States of America)<br><br><strong>Hours Per Week:</strong><br><br>40"}