{"job title": "Patient Financial Services (PFS) Systems Data Analyst II - Patient Financial Services", "company": "Baxter Regional Medical Center", "city state": "– Mountain Home, AR", "rating": "3.5", "job description": "<div>\n<div>\nIn this position you will support the revenue process from registration through billing and payment posting to collections. You will provide support to the PFS Systems Manager / Revenue Intergrity position and coordinate all support as directed for the Patient Financial Services Department, including all software applications and hardware. In addition, you will assist Information Systems in any hardware or software installations as well as assist in systems training and continuing education for all Patient Financial Services staff as deemed necessary. Providing troubleshooting skills in any area of concern throughout PFS is also essential, as is exceptional communication, analytical and interpersonal skills.\n<br><br>\nRequirements include: \n\n\n<ul>\n\n \n<li>\n Assoicate Degree in Computer Science or related field</li>\n\n\n<li>\n Three (3) to five (5) years progressive experience in computer systems maintenance and/or programming</li>\n\n\n<li>\n General knowledge of all functions related to hospital revenue cycle; comprehensive knowledge of billing regulations (CPT/HCPCS, etc.); complete understanding of all functionality of the PFS Department</li>\n\n\n<li>\n Experience or ability to reconcile data flow from Optimum and other source systems to contract management systems and other patient accounting systems</li>\n\n\n<li>\n Knowledge of basic coding elements such as DRG's, CPT's, HCPC codes, bill types, etc.</li>\n\n\n<li>\n Knowledge of Excel, Work, etc. spreadsheets and pivot table reporting</li>\n\n\n<li>\n Knowledge of payer reimbursement systems and payer contracts</li>\n</ul>\n\n<br>\nPreferences include: \n\n\n<ul>\n\n \n<li>\n Bachelor of Science in Computer Science or related field</li>\n\n\n<li>\n Experience in Optimum System</li>\n\n\n<li>\n Knowledge of Contract Management System</li>\n</ul>\n\n </div>\n</div>\n<br>"}