{"job title": "SAP Data Analyst in Indianapolis, IN at BCforward", "company": "BCForward", "city state": "– Indianapolis, IN", "rating": "3.4", "job description": "<div>\n <div>\n Job Description\n <div>\n<br><p><strong>Bcforward is looking for a highly motivated SAP Data Analysts for our client in Indianapolis. Interested candidates please send your resumes to sri.vedantam@bcforward.com !</strong></p>\n<br><p>SAP Data Analysts will “own” various master data objects in support of new projects and production support activities within specific modules of SAP on behalf of a global, enterprise scope for a large corporate client of BC<em>forward</em>. Ideal candidates will be experts in Master Data Management for the specific functional area or module supporting, and will own execution of:</p>\n<br><p>\n<br>• Data Definition, Design and Transformation Rules</p>\n<br><p>\n<br>• Data Cleansing</p>\n<br><p>\n<br>• Data Migration (Data Transformation Routines, Data Extract Routines)</p>\n<br><p>\n<br>• Data Maintenance</p>\n<br><p>\n<br>• Data Integration</p>\n<br><p>Experienced candidates should understand the necessary Reference Data and Transactional Data required to fulfill the business processes, while leveraging data movement tools and executing against data governance best practices.</p>\n<br><ul><li><em>Responsibilities:</em></li>\n<br><li>Provide visibility to and assessing impact of projects by connecting and communicating with key stakeholders such as other Data Analysts, Process SMEs, Global Process Owners, Global Business Solutions (i.e. Shared Service Centers), Manufacturing Sites, External Manufacturing groups, Affiliates (i.e. country) and SAP IT resources.</li>\n<br><li>Act as data object owners carry decision rights for master data changes in consultation with the previously noted stakeholders, as well as being pivotal in the development and administration of master data training, lifecycle management and data quality efforts.</li>\n<br><li>Maintains categorization hierarchies and reference tables.</li>\n<br></ul>\n<br><p>o Develop software tools that enable the transfer of SAP data between programs such as Excel, Access, HTML without the need for custom programming or manual data entry. </p>\n<br><p></p>\n<br><p>o Build queries to extract data from multiple tables in SAP to build reports.</p>\n<br><ul><li>Load and maintain data and understand associated integration and timing implications within a project or as part of business production support</li>\n<br><li>Follow established project or change control methodology</li>\n<br><li>Create and update documentation of various types</li>\n<br><li>Prepare and execute testing.</li>\n<br><li>Document and resolve defects.</li>\n<br><li>Execute technical and/or business cutovers based on role, </li>\n<br><li>Provide stabilization support when a solution goes live. </li>\n<br><li>Transfer knowledge to the support organization.</li>\n<br></ul>\n<br></div>\n</div>\n\n </div>\n \n\n <div>\n <div>\n Job Requirements\n <p><strong>Desired Experience:</strong></p>\n<br><ul><li>3-5+ Years’ experience in data management </li>\n<br><li><strong>Tools:</strong> Solution Manager, HP Application Lifecycle Management, Service Now. Realtech and Winshuttle are preferred.</li>\n<br><li>Ability to interpret KPIs, SLAs and OLAs and understand their measurement and threshold criteria and reporting requirements.</li>\n<br></ul>\n</div>\n\n </div>"}