{"job title": "Data Migration Analyst in Clay at BCforward", "company": "BCForward", "city state": "– Clay", "rating": "3.4", "job description": "<div>\n <div>\n Job Description\n <p>Data Migration Analyst</p><p><strong>BCforward is seeking a highly motivated</strong><strong> Data Migration Analyst in Indianapolis, IN.</strong></p><p><strong> </strong></p><p><strong>Expected Duration:</strong><strong> Contract</strong></p><p><strong> </strong></p><p><strong>Job Description:</strong></p><p><strong>Essential Duties/Responsibilities:</strong></p><p>Ø Work with other teams to plan, organize, design and migrate data into the new system.</p><p>Ø Coordinate development of data extract and transformation programs.</p><p>Ø Manage the creation of data mapping deliverables, project and resource plans.</p><p>Ø Create and manage the data migration plan</p><p>Ø Manage the escalation and resolution of issues</p><p>Ø Investigate source system for data availability and accuracy</p><p>Ø Design and implement processes to ensure data quality</p><p>Ø Work on improving data integrity and quality</p><p>Ø Maintain documentation on data migration decisions</p><p></p><p><strong>Job Requirements:</strong></p><p>Ø Strong SQL and SQL Server experience required. </p><p>Ø Ability to write complex SQL queries and stored procedures.</p><p>Ø Experience with configuration and deployment of SSIS packages.</p><p>Ø Experience with ETL tools.</p><p>Ø Scribe experience is preferred.</p><p>Ø Excellent communication skills to include internal/external interaction, and documentation.</p><p>Ø Proven ability to self-manage and complete project deliverables.</p><p>Ø Confident in making decisions, accurate, detailed-oriented and able to problem solve/analyze.</p><p>Ø Good interpersonal, listening, written and verbal communication and basic project management skills.</p><p>Ø Functional and/or Technical Certifications as deemed appropriate for specialization</p><p><strong> </strong></p><p><strong>Contact Name:</strong> Ravi Teja </p><p></p><p><strong>How to Apply:</strong> To apply for this posting please send your resume to ravi.teja(@)bcforward.com</p><p></p><p><strong>About BCforward</strong></p><p>BCforward began as an IT business solutions and staffing firm. Founded in 1998, BCforward has grown with our customers' needs into a full-service personnel solutions organization. BCForward's headquarters are in Indianapolis, Indiana and operates delivery centers in 17 locations in North America as well as Hyderabad, India and Puerto Rico. We are currently the largest consulting firm and largest MBE certified firm headquartered in Indiana. With 14+ years of uninterrupted growth, the addition of two brands (Stafforward and PMforward) and a team of more than 1400 resources our teams deliver services for multiple industries from both public and private sectors. BCForward's team of dedicated staffing professionals has placed thousands of talented people over the past decade, with retention rates that are consistently higher than the industry average.</p><p></p><p>www.bcforward.com</p><p>Interested candidates please send resume in Word format Please reference job code 69320 when responding to this ad.</p>\n</div>\n\n </div>\n \n\n <div>\n \n </div>"}