{"job title": "Senior Analyst, Data Analytics and Dashboard", "company": "Becton Dickinson &amp; Company", "city state": "– Franklin Lakes", "rating": "3.3", "job description": "<strong>Job Description Summary</strong>:\n<br><br>\nAccountabilities in this role_**\n<br><br>\nReporting to the Senior Manager, Business Analytic Technologies this position supports execution of the business insights by having a thorough understanding of various data sources and system and business processes. This role is accountable across all US Region supported businesses and customer segments and will enable the transformation of the Analytics and data quality capability within the CoE by implementing best practices related to data management, tools and technologies. This role will be a key member of the Strategic Insights Governance team driving data validation and usage adoption for all Business Insights and Analytics initiatives. This role will be an individual contributor successfully accomplished through strong interpersonal skills, change management expertise, and by executing the dashboard and insights strategy for the organization in accordance with the CoE mission. This position will work closely with BD US Region Leaders, Business Sales Leaders, other Comm Ops functional areas, Cross-functional Business Partners including IT and Supply Chain and will serve as a catalyst to drive best in class analytics capabilities.\n<br><br>\nEssential Responsibilities:_**\n\n<ul>\n<li>Primarily focus on developing and implementing dashboards, reports, and analytics to support the US Region initiative around pricing and contracting</li>\n<li>Collaborate and knowledge share with internal teams to ensure single source of truth for all sales and pricing data</li>\n<li>Manage the optimization and design of self-service tools for key business partners and internal customers across all analytics areas.\n<br>\nAccountable for ensuring foundational data and data models are at a high quality for completeness, timeliness and accuracy through strong partnership with the C2C team and IT via the Strategic Insights Governance process.\n<br>\nDevelop and roll out standardized process and tools to internal and external audiences</li>\n<li>Perform ongoing assessment of Analytics tools (Calculators, Price Models, P&amp;L models, etc.) and dashboards relative to their usability, efficacy and adoption with their respective audiences.\n<br>\nCollaborate with BU Management, Marketing and Sales to understand information needs to optimize existing tools and create new solutions.\n<br>\nOptimize and automate current portfolio of tools to provide accurate/timely data in a usable/automated format to visualize trends relative to analytics function.\n<br>\nPartner with key stakeholders to develop and document business requirements</li>\n<li>Translate and enhance business requirements into timely validated deliverables adhering to governance policies</li>\n<li>Supports all pillars of Commercial Operations regarding performance metrics and KPIs</li>\n<li>Leads and participates in key projects as assigned by leadership</li>\n<li>Hold accountability for team goals and KPIs</li>\n<li>10%-25% Travel required for this position</li>\n</ul>\n<strong><em>Qualifications</em></strong>\n\n<ul>\n<li>BA/BS required (in lieu of a Bachelors Degree, extensive (15+ years)</li>\n<li>Advanced Qlikview experience required. Qliksense experience preferred.\n<br>\n3-5 years demonstrated experience in business analytics, large BI projects, tool design (Excel, Access, etc.) or dashboard design desirable</li>\n<li>Highly proficient in Excel, Database development (i.e. MS Access, SQL, Oracle), Data Mining tools and SAP BI/BW</li>\n<li>Advanced Portal User for SAP, including the ability to train, document processes, and reside on a governance team to affect change management</li>\n<li>Deep understanding in data relations, data standardization and analytics as it relates to Medical Device Capital and Consumables products and services.\n<br>\nStrong understanding of Medical Device Capital and Consumables products and services as well as customer segments BD participates in including GPO, Acute Care, Non-acute, National Labs, CRO and Government.\n<br>\nProven leadership of business process initiatives ensuring that operational activities are efficient, timely and minimize errors. Experience in ERP and Business Warehouse implementation</li>\n<li>Proven experience in implementing new processes/systems and improvement of process efficiency</li>\n<li>Highly strategic and analytical problem solver with solid business acumen. Able to identify key business information needs through dialog and assist in development clear strategic recommendations on how to provide the desired insights.\n<br>\nProven ability to quickly establish credibility, trust, and support within all levels of organization.\n<br>\nAbility to prioritize and execute a variety of objectives and clearly communicate progress and roadblocks</li>\n<li>Ability to articulate complex concepts, thought leadership and the business value of solutions in a clear, understandable way</li>\n</ul>\n**_Key Competencies\n\n<ul>\n<li>Drive for Results</li>\n<li>Business Acumen</li>\n<li>Customer Focus</li>\n<li>Process Effectiveness</li>\n\n<strong><li>Dealing with Ambiguity</li>\n</strong></ul><strong>\n<strong>Primary Work Location</strong>:</strong>\n<br>\n<strong>USA NJ - Franklin Lakes\n<br><br>\n<strong>Additional Locations</strong>:</strong>\n<br>\n<strong>Work Shift</strong>:"}