{"job title": "M148- Senior Data Analyst", "company": "Datamatics Consultants", "city state": "– New York, NY", "rating": "2.6", "job description": "M148- Senior Data Analyst Job location: New York, New York If you are interested in having your resume considered for this position, please fill the attached documents: Candidate Information Form from the client and RIGHT TO REPRESENT. Candidate Details: Full Name: Phone#: Emails: Skype ID (available): Current location: Open to relocate or travel (Yes / No): SSN Last 4 Digits: Total Years Experience: Availability to Start: Expected Pay Rate ($/hour): $ Are you willing to attend the Client in-person interview at your own expense? Highest Educational Qualification/Degree: Open for Onsite: DOB: Please attach most current resumeAre you being represented by another company for the same position in the same location? Work Authorization (US Citizen, GC others):I authorize Datamatics Inc. to present my resume to the client (Y/N): Job details: This nationwide industry leader has an immediate 3+ month contract opportunity in New York City for a Data Analyst in the Business Intelligence department. Will be responsible for ensuring data is processed accurately per business requirements. If issues are identified, root cause analysis and data remediation need to be performed. Primary focus will be to analyze marketing data to understand end-to-end data flow, analyze data anomalies and determine the root cause for the job failures, provide control requirements to control developers and work closely with development teams to avoid future failures. Will deal with all aspects of our end to end data processing. The emphasis is on data completeness, validity, consistency, timeliness, accuracy and intra-system and inter-system data flow controls. Will participate in investigation, root cause identification and remediation of affected data/processes in BI. Duties and Responsibilities:Work closely with BI Architect and development teams to get better understanding of existing new CV OEM campaigns migration.Understand end-to-end data flow for CV data mart from the operation support perspective.Research data anomalies in complex business systems, develop audit reports, provide reports and recommendations for correction of data, and develop business and technical processes to ensure data integrity.Provide data quality assurance through routine check-ups of pre-existing data fixes and audit reports.Identify control points and provide controls requirement to Infogix team.Provide Tier2 support for all marketing BI jobs.Present concise status to senior management. Qualifications:Bachelor s degree in Computer Science, Management Information Systems, or equivalent education and experience7+ years of experience in supporting a high-performance, cross-functional IT Data Operations team in multiple locations and time zonesStrong knowledge of Teradata, Informatica and UNIX is must.Must have prior data analyst and control-based data operations experienceExcellent query writing skills and debugging data anomalies.Experience in Media &amp; Entertainment industry a plus.Thorough knowledge of MS-Office Suite (Word, Excel, PowerPoint, Access).Strong organizational skills and attention to details.Excellent time management skills, with the ability to prioritize and multi-task and work under shifting deadlines in a fast-paced environment.Required Skills: Access, BI Tools, Campaign Management, Data Analysis, Debugging, MS Office, PowerPoint, SQL Queries, Teradata - provided by Dice Access, BI Tools, Campaign Management, Data Analysis, Debugging, MS Office, PowerPoint, SQL Queries, Teradata"}