{"job title": "Data Analyst - Jr", "company": "Enclipse Corp.", "city state": "– Long Beach", "rating": "2.6", "job description": "<div> Posted Date: 9/17/2018</div> <div> Job Category: Data Analyst</div> <div> Position Title: Data Analyst - Jr</div> \n<br>\n<div><strong>Salary Range:</strong></div><div> Location: Los Angeles-Long Beach, California, USA</div><br>\n\n<div><strong>Desired Skills:</strong></div><div> Description: <div>xmlns:o=\"urn:schemas-microsoft-com:office:office\" xmlns:w=\"urn:schemas-microsoft-com:office:word\" xmlns:m=\"http://schemas.microsoft.com/office/2004/12/omml\" xmlns=\"http://www.w3.org/TR/REC-html40\"&gt;\n<br><br>\nDescription:\n<br><br>\nProvide data architectural leadership in developing enterprise data/process models, and logical/physical database designs. Provide data and database development, maintenance, and production support. Participate in IT and Business project to define system requirements.\n<br><br>\nExperience Level: 0-3 Years.\n<br><br>\nSkill Set: Business analysis. Business process modeling - enterprise to department level. Ability to interpret Entity Relationship Diagrams.\n<br><br>\nProvides support for administering merit program as directed. Prepares statistical reports as directed. Calculates costs of current and proposed compensation programs. Analyzes data and develops recommendations for changes. Assists with compiling and computing data. Researches salary issues and compiles data upon request. Prepares and/or assists supervisors in preparing job descriptions. Minimum Requirements Bachelor's Degree in Business Administration or related area with specialization in HR and Labor Relations or equivalent experience required.\n<br><br>\nRelevant Years of Experience:\n<br><br>\n3-5 years of experience in Human Resources or Compensation or equivalent are required but in health care field preferred. Good general mathematics ability required. ? Excellent written and oral communication skills required.\n<br><br>\nOther Important Competencies:\n<br><br>\n1. Comfort around top management 2. Decision quality 3. Interpersonal Savvy 4. Listening 5. Business Acumen 6. Customer Focus 7. Negotiating 8. Career Ambition 9. Composure 10. Problem Solving 11.\n<br><br>\nPresentation Skills for success:\n<br><br>\nAnalysis skills Effective communicator (Both oral and written) with all levels of Sr. leadership. Comfortable working with all levels Strong presentation skills Detail oriented Strong customer services Microsoft office suite - Intermediate user - Please provide test scores. Experience with Pivot tables Daily\n<br><br>\nTasks:\n<br><br>\nSupporting the Compensation group Answering questions about the Compensation programs. Assist the Compensation group with developing documentation &amp; training material that will be delivered via webex or in person Ensure compliance of performance documentation Assist with the role out of new web based application.</div>\n</div>"}