{"job title": "IT Data Analyst", "company": "Highmark Health", "city state": "– Pittsburgh, PA", "rating": "2.9", "job description": "<strong>Company :</strong>Allegheny Health Network<strong>Job Description :</strong> <br><br>GENERAL OVERVIEW:\n<br><br>\nDesigns and implements reports, analyzes data and monitors statistical information to promote and guide quality and cost-effective care.\n<br><br>\nESSENTIAL RESPONSIBILITIES:\n<ul>\n<li>Collects and maintains data for reporting. Maintains weekly and monthly quality scorecard reports. Maintains data/reporting logs to support System groups. (25%)</li><li>Understands and utilizes quality software for analysis. (25%)</li><li>Supports innovative reporting for professional/publishable views of performance and quality measures. (10%)</li><li>Assists with submission of all quality reporting. May assists with clinical chart reviews. (10%)</li><li>Assists with data assurance for and produces quality reporting to analyze core measures. Supports all ad hoc project requests related to clinical, operational and statistical reporting. (10%)</li><li>Supports abstraction process and software related maintenance. (10%)</li><li>Supports team with interfacing of disparate systems to a centralized report writer and data base warehouse to create accurate and professional reporting. (10%)</li><li>Performs other duties as assigned or required.</li>\n</ul>\nQUALIFICATIONS:\n<br><br>\n<u>Minimum</u>\n<ul>\n<li>Bachelor's degree in Business, Health Information Management, or a Clinical degree with experience in data development and analysis.</li>\n</ul>\n<u>Preferred</u>\n<ul>\n<li>Master’s degree.</li><li>BSN degree.</li><li>1-3 years’ data/business analysis experience.</li><li>1-3 years’ healthcare experience.</li>\n</ul>\n----------------------------------------------------------------------------------------\n<br><br>\nHighmark Health and its affiliates prohibit discrimination against qualified individuals based on their status as protected veterans or individuals with disabilities, and prohibit discrimination against all individuals based on their race, color, religion, sex, national origin, sexual orientation/gender identity or any other category protected by applicable federal, state or local law. Highmark Health and its affiliates take affirmative action to employ and advance in employment individuals without regard to race, color, religion, sex, national origin, sexual orientation/gender identity, protected veteran status or disability."}