{"job title": "Senior Financial Analyst - data mining skills needed", "company": "Massachusetts General Hospital(MGH)", "city state": "– Boston, Massachusetts", "rating": "4.0", "job description": "<strong>Responsibilities</strong>\n<br>\nThe Department of Radiology/(GH) of the Massachusetts General Hospital has an annual gross patient service revenue budget of $800 million, with over twenty cost centers. The Senior Financial Analyst will report to the GH Senior Finance Manager, supporting the manager to perform financial analysis, develop financial presentation, manage the financial system, and problem-solve issues relating to GH finance.\n<br><br>\n<strong>PRINCIPAL DUTIES AND RESPONSIBILITIES:</strong>\n<br>\nThe job's primary responsibilities include, but not limited to, the following:\n<br><br>\nPerforming financial analysis and data mining\n\n\n<ul>\n<li>Analyzes financials of all cost centers periodically to report on key indicator performance. Monitors variances and trends.</li>\n<li>Supports annual budgeting processes (Operating and Capital) through data organization, process automation, information requirement coordination, and visualization of budget materials.</li>\n<li>Works closely with the Clinical Operation and Clinical Support teams, and all Budget Office liaisons.</li>\n<li>Identifies errors or areas of concern, works with relevant parties to resolve issues.</li>\n<li>Assists with comparative and other strategic analyses, develops relevant metrics in support of business decision-making.</li>\n<li>Performs ad-hoc analysis as needed and in response to inquiries from all stakeholders.</li>\n</ul>\n\nManaging financial system\n\n\n<ul>\n<li>Responsible for up-keeping finance database and maintaining all financial data/files pertaining to the financial operation and capital portfolio of the department.</li>\n<li>Evaluates and improves department financial reporting system and process, leveraging EPIC enterprise system capabilities and BI tools.</li>\n<li>Keeps abreast of external regulations and guidelines to ensure compliance.</li>\n</ul>\n\nPreparing financials and other materials\n\n\n<ul>\n<li>Develops materials for financial reporting and presentations on a monthly basis and as needed.</li>\n<li>Assists in preparing finance training materials.</li>\n</ul>\n\nOther Finance /accounting duties\n\n\n<ul>\n<li>Assists in resolving all problems/inquiries from MGH Budget Office and Partners Finance /Accounting Offices.</li>\n</ul>\n\nUndertakes special assignments as requested by the Senior Finance Manager.\n<br><br>\n<strong>Qualifications</strong>\n<br>\n<strong>Requirements</strong>\n<br>\n<strong>QUALIFICATIONS:</strong>\n<br>\n· Bachelor's degree in finance or information technology, MBA preferred.\n<br>\n· Minimum of 4 years of business/ financial analysis experience.\n<br>\n· Experience in healthcare a plus.\n<br><br>\n<strong>SKILLS/ ABILITIES/ COMPETENCIES REQUIRED:</strong>\n<br>\n· Ability to apply analytical skills to support the multi-faceted and complex analysis required for this role.\n<br>\n· Technical knowledge includes: advanced Excel and intermediate Access\n<br>\n· System proficiency - experience with EPIC enterprise system and PeopleSoft preferred, familiarity with BI system and visualization tools such as Tableau a plus\n<br>\n· Knowledge in financial accounting and principles.\n<br>\n· Excellent interpersonal skills, being able to support and work collaboratively with colleagues, Hospital and Partners personnel and outside customers, to accomplish Radiology Finance goals.\n<br>\n· Ability to follow up and finish projects to meet deadlines.\n<br>\n· Self-motivated, resourceful, and offer creative solutions for problem-solving.\n<br>\n· Professionalism to keep financial information confidential.\n<br><br>\n<strong>EEO Statement</strong>\n<br>\nMassachusetts General Hospital is an Equal Opportunity Employer. By embracing diverse skills, perspectives and ideas, we choose to lead. Applications from protected veterans and individuals with disabilities are strongly encouraged.\n<br>\nPartner's Healthcare is acting as an Employment Agency in relation to this vacancy."}