{"job title": "RN QUALITY DATA ANALYST", "company": "Mercyhealth", "city state": "– Wisconsin", "rating": "3.0", "job description": "<p>\n\t<strong>JOB SUMMARY </strong> <br>\n\tThe Surgery Registry Quality Data Analyst facilitates quality assessment and improvement activities for the surgical staff and supports health system quality initiatives. The Surgery Registry Quality Data Analyst collects and assesses data based on established criteria and participates at the organizational level in quality improvement initiatives. This position collects and reviews individual surgical data elements and analyzes for opportunities as they relate to measures and outcomes. The Analyst is a system advocate who deals with confidential information, coordinates data collection efforts and utilizes multiple resources to make needed information available to internal and external customers. May need to work overtime or flexible hours as needed. Performs other duties as assigned.<br>\n <br>\n\t<strong>ESSENTIAL DUTIES AND RESPONSIBILITIES </strong> <br>\n </p>\n<ul>\n\t<li>\n Reviews established criteria for data abstraction and understands how individual data elements relate to measures and outcomes</li>\n\t<li>\n Identifies patients for inclusion in appropriate measures</li>\n\t<li>\n Utilizes a variety of software applications for data collection and analysis</li>\n\t<li>\n Responsible for the accurate and timely entry of data into software</li>\n\t<li>\n Demonstrates reliability of data definitions and participates in data validation and inter-rater reliability testing</li>\n\t<li>\n Understands workflow and clinical documentation in relation to data collected</li>\n\t<li>\n Works with multiple departments to identify opportunities for improvement</li>\n</ul>\n<p>\n <br>\n\t<strong>CULTURE OF EXCELLENCE BEHAVIOR EXPECTATIONS</strong><br>\n\tTo perform the job successfully, an individual should demonstrate the following behavior expectations:<br>\n <br>\n\t<strong>Quality</strong>- Follows policies and procedures; adapts to and manages changes in the environment; Demonstrates accuracy and thoroughness giving attention to details; Looks for ways to improve and promote quality; Applies feedback to improve performance; Manages time and prioritizes effectively to achieve organizational goals.<br>\n <br>\n\t<strong>Service</strong>- Responds promptly to requests for service and assistance; Follows the Mercyhealth Critical Moments of service; Meets commitments; Abides by MH confidentiality and security agreement; Shows respect and sensitivity for cultural differences; and effectively communicates information to partners; Thinks system wide regarding processes and functions.<br>\n <br>\n\t<strong>Partnering</strong>- Shows commitment to the Mission of Mercyhealth and Culture of Excellence through all words and actions; Exhibits objectivity and openness to other's views; Demonstrates a high level of participation and engagement in day-to-day work; Gives and welcomes feedback; Generates suggestions for improving work: Embraces teamwork, supports and encourages positive change while giving value to individuals.<br>\n <br>\n\t<strong>Cost</strong>- Conserves organization resources; Understands fiscal responsibility; Works within approved budget; Develops and implements cost saving measures; contributes to profits and revenue.<br>\n <br>\n\t<strong>EDUCATION &amp; EXPERIENCE </strong> <br>\n\tGraduate of an Accredited School of Nursing<br>\n\tBSN or upon hire BSN completion agreement for enrollment in an accredited BSN program.<br>\n\tSurgical experiencerequired.<br>\n\t<strong>CERTIFICATION/LICENSURE </strong> <br>\n\tAbility to complete all training modules and pass the NSQIP certification exam is required within 4 months of hire.<br>\n <br>\n\t<strong>ADDITIONAL REQUIREMENTS</strong><br>\n\tPassing the Driver’s License Check and/or Credit Check (for those positions requiring).<br>\n\tPassing the WI Caregiver Background Check and/or IL Health Care Workers Background Check.<br>\n\tMust be able to follow written/oral instructions.<br>\n\t<strong>OTHER SKILLS AND ABILITIES </strong><br>\n\tComputer skills: Experience using the electronic medical record, internet and spreadsheet software is required.<br>\n\tReasoning ability: Ability to reason and deal with a variety of abstraction and concrete variables. This includes the ability to complete basic mathematical equations to calculate percentages and rates.<br>\n\tCommunication: Ability to read, analyze and interpret guidelines and effectively present information and respond to questions from multiple customers<br>\n <br>\n <br>\n\t<strong>WORK ENVIRONMENT </strong><br>\n\tThe noise level in the work environment is usually quiet.<br>\n\tOccupational Exposure: Category C - No partners in the specified job classification have occupational exposure.<br>\n <br>\n\t<strong>AGE OF PATIENTS SERVED </strong><br>\n\tNon-Specific Task (N/A)<br>\n <br>\n\t<strong>INFORMATION ACCESS </strong><br>\n\tPartner may access patient care information needed to perform their job duties<br>\n <br>\n\t<strong>WORK CONTACT GROUP </strong> <br>\n\tPartners, physicians, patients/family, visitors, vendors <br>\n <br>\n\t<strong>SPECIAL PHYSICAL DEMANDS </strong><br>\n\t<strong>The Special Physical Demands are considered Essential Job Functions of the position with or without reasonable accommodations.</strong><br>\n\tWhile performing the duties of this Job, the employee is regularly required to use hands to finger, handle, or feel and talk or hear. The employee is frequently required to sit and reach with hands and arms. The employee is occasionally required to stand; walk and stoop, kneel, crouch, or crawl. The employee must occasionally lift and/or move up to 10 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus. </p>"}