{"job title": "Lead Data Analyst", "company": "Parallon", "city state": "– Austin, Texas", "rating": "2.7", "job description": "<strong><br><br>Description</strong>\n<br><br>\n<strong> is part of St. Davids HealthCare, one of the largest health systems in Texas, which was recognized in 2014 with a</strong>  <strong> . Founded in 1924, St. Davids Medical Center is a full-service medical center offering comprehensive medical care at three locationsSt. Davids Medical Center,</strong>  <strong> and</strong>  <strong> .</strong>\n<br><br>\n<strong> Located in central Austin, St. Davids Medical Center includes a 350-bed acute care hospital and a 64- bed rehabilitation hospital providing comprehensive inpatient and outpatient care. It is home to the internationally renowned</strong>  <strong> and</strong>  <strong> . The hospital provides a complete range of womens services, including its acclaimed maternity unit, maternal-fetal medicine, a high-risk maternal and neonatal transport team, the regions largest and most sophisticated Neonatal Intensive Care Unit and</strong>  <strong> ; complex surgical services; a comprehensive</strong>  <strong> ; and a 24-hour emergency department.</strong><br><br><strong> POSITION SUMMARY</strong>\n<br>\nThe Data Analyst will function in a coordinator and project management role for the Quality and Infection Prevention departments including the CMO. The scope of this position includes the use of independent judgement. This position coordinates multiple functions across the Enterprise (SDH, GTH, and HHA).\n<br><br>\nThis position will provide provision to these areas by function through analysis of patient population and physician practice patterns and support to the medical staff peer review processes (i.e. FPPE/OPPE). This position will provide data collection, analysis, management, and report writing from a variety of database systems. The analyst creates and maintains clinical and statistical data, and abstracts various data elements required by designations, state requirements, and the facility itself. This position is accountable for the collection, completion, and verification of the accuracy of patient data collected from the hospital. This position is crucial to the implementation of data management and improvement of functions in the areas mentioned above.\n<br><br>\n<strong>GENERAL RESPONSIBILITIES</strong>\n\n<li> Collect, analyze and prepare data for ongoing data requests and reports.</li> <li> Writing of data queries and reports to collect data.</li> <li> Record review for data collection and/or confirmation.</li> <li> Preparation of numeric or graphical data presentations as needed.</li> <li> Data entry as required.</li> <li> Manage the data input, database management, and report writing from central database systems, such as Meditech.</li> <li> Must possess exceptional computer skills and demonstrate proficiency in using Ms Word, Ms Excel, PowerPoint, which are all necessary for the creation of visually and verbally engaging reports. Analyze, track and trend data, and utilize performance improvement tools and techniques, such as graphs, run charts, control charts in performance improvement reports.</li>  <li> Maintain integrity of system data elements, troubleshoot and fix discrepancies and submit data on schedule.</li>  <li> Work directly with the Infection Prevention Director, Senior Quality Director, Chief Medical Director, Quality Director, and Quality Manager to provide and present data summaries as requested.</li>  <li> Participate and contribute to the campus Quality Committee and the Enterprise Quality Committee (SDH, HHA, GTH and Rehab) as well as quality/process improvement activities.</li>  <li> Coordinates and prepares meetings, and documentation of minutes at specific designated meetings. Collaborate within and across the facility in order to understand data requirements.</li> <li> Develop logical and conceptual data flows that are in support of departmental project requirements and guides various departments in appropriate and effective use of data.</li>\n<strong><br><br>Qualifications</strong><br><br><strong> EDUCATION AND EXPERIENCE</strong>\n<br>\n<strong> Required:</strong> High School Graduate. Minimum 1 year experience working in a database environment, Two plus years of working in hospital setting. Independent analytical thinking skills.\n<br><br>\n<strong> Preferred:</strong> BS in Healthcare Admin, Registered Health Information Administrator (RHIA), Registered Health Information Technician (RHIT) or Certified Coding Specialists (CCS).\n<br><br>\n<strong><strong>:</strong>\n<br></strong>"}