{"job title": "Configuration Analyst ( Data or configuration management)", "company": "Raytheon BBN Technologies", "city state": "– Portsmouth, Rhode Island, United States", "rating": "3.4", "job description": "This position will fall under the Engineering Product Integrity (EPI) Department within the Mechanical Engineering Directorate (MED). MED provides engineering design, integration and production to a wide range of hardware in Raytheon’s Integrated Defense Systems (IDS). EPI defines, establishes and leads our hardware engineering environment within MED. Configuration and Data Management are disciplines within EPI responsible for product configuration and analysis and are actively engaged in all phases of program execution from start-up through contract closeout.\n<br><br>\n<strong>Job Description:</strong>\n<br>\nThe Data Management (DM) discipline ensures the Contract Data Requirement List / Subcontract Data Requirement List (CDRL/SDRL) requirements are identified, recorded, assigned to appropriate disciplines, and tracked in accordance with SP0038 (Formal Data Management).\n<br><br>\nDM creates and monitors the CDRL/SDRL submittal schedule. DM resolves data issues, distributes schedule notices for pending data submittals to ensure on-time delivery and creates status reports for management review and action. DM reviews the deliverable program data to determine completeness and submits to the customer as specified in the contract.\n<br><br>\nThe Configuration Management (CM) discipline works closely with the program execution and engineering teams to manage the technical baseline. CM tasking in this role will include the use of CM tools for configuration identification, configuration control, configuration status accounting, configuration verification and audits, product release and delivery and provide solutions to a variety of CM technical challenges.\n<br><br>\nDaily responsibilities include establishing and maintaining program CM systems, including the program documents and managing configuration baselines, ensuring all required process steps have been completed prior to release and documenting released configurations, improving and training the program CM processes and interfacing with other engineering disciplines providing solutions to a variety of technical challenges. Position requires great attention to detail with respect to managing hardware development environments and program technical data, understanding of ITAR/EXIM processes and strong presentation skills. Candidate must be an advocate of continuous process improvements. This position may be located in the Tewksbury, Andover or Woburn locations.\n<br><br>\nThis position can be a G07 or a G08 based on the candidate’s qualifications as they relate to the skills, experience and responsibilities required for the position.\n<br><br>\nU.S. Citizenship status is required as this position will need a U.S. Security Clearance within 1 year of start date. <em>Except in rare circumstances, only U.S. citizens are eligible for a security clearance.</em>\n<br><br>\n<strong>Required Skills:</strong>\n\n<ul>\n<li>2+ years of related experience in data management or configuration management</li></ul>\n\n<ul>\n<li>U.S. Citizenship is required</li><li>Proficient in Microsoft Office</li> <li>Strong oral and written communication skills</li>\n</ul>\n\n<strong>Desired Skills:</strong>\n\n<ul>\n<li>Self-Starter, willing to learn new tools and work with a variety of technical and non-technical disciplines</li></ul>\n\n<ul>\n<li>Ability to pro-actively interface with team members</li><li>Data Management or Configuration Management Experience</li><li>Experience working in a Engineering team environment, interfacing with Hardware, Systems or Test Engineers</li><li>Proficient in use and administration of Windchill PDM</li><li>Understands principles, standards and processes, such as described in EIA-649, Configuration Management Standard</li><li>Demonstrated ability to support multiple ongoing projects and parallel release activities</li>\n</ul>\n\n<strong>Required Education (including Major):</strong>\n\n<ul>\n<li>Bachelor’s Degree in Engineering, Business or related field or equivalent combination of related experience and education (each two years of related experience can substitute for one year of education)</li>\n</ul>\n\n<strong>What’s YOUR Mission?</strong>\n<br>\nHere at Raytheon, we work together as one global team creating trusted, innovative solutions to make the world a safer place. Our innovation spans all domains: from land and sea to air, space and cyberspace. We’re inspired by a noble mission that’s shared by Raytheon employees around the globe and an inclusive culture that empowers employees and celebrates their contributions.\n<br><br>\n<strong>What We Offer:</strong> Whether you’re just starting out on your career journey or are an experienced professional, Raytheon offers a robust total rewards package that goes above and beyond with compensation; healthcare, wellness, retirement and work/life benefits; career development and recognition programs. Some of the superior benefits Raytheon offers include paternal leave, flexible work schedules, achievement awards, educational assistance and child/adult backup care.\n<br><br>\nFind out why Forbes ranks us among the top 500 of America’s Best Employers by visiting us online at www.raytheon.com.\n<br><br>\n<strong>Stay Connected:</strong> Don’t miss out on what’s happening at Raytheon.\n\n<ul>\n<li>Follow @Raytheon on Twitter</li> <li>Follow Raytheon on YouTube</li><li>Follow Raytheon on LinkedIn</li><li>Follow Raytheon Company on Instagram</li>\n</ul>\n\nAre you ready to be remarkable with Raytheon?\n<br>\nRaytheon: Making the World a Safer Place\n<br><br>\n“Diversity is at the heart of all we do at Raytheon. We embrace diversity and diverse opinions; we treat people with dignity and respect to support our inclusive culture. This allows us to retain and attract the world-class talent and supplier base we need to develop the innovative solutions our global customers depend on. We view our diversity as a competitive advantage as a key enabler of our growth.\"\n\n\n<ul>\n<li>Thomas A. Kennedy</li>\n</ul>\n\nRaytheon Chairman and Chief Executive Officer 123426"}