{"job title": "Data Business Analyst", "company": "Russell Investments", "city state": "– Seattle, WA", "rating": "3.1", "job description": "Business Unit:Global Operations\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nThis position provides business integration and data operations support services to the Data Operations and Strategy Team 's internal and external clients. This role is responsible for designing, analyzing, and implementing new data integration solutions in support of the Enterprise Data Management strategic business requirements. The position will assist in the accurate and timely delivery of data and reports, execution of data research and controls and management of feeds. The role also helps in the design, development and evolution of team products and services, including the definition of team data management practices and policies.\n<br><br>\nThe responsibilities of the individual in this position include:\n\n\n<ul>\n<li>Collaborate with other team members to form key partnerships with the business, assisting with project scope definition, business requirements, project management, process improvement, and/or process modeling.</li>\n<li>Provide business analysis and data integration expertise and implementation for strategic processes and services to support business programs and projects</li>\n<li>Work with management and operational experts to define projects, provide recommendations and implement solutions</li>\n<li>Serve as an expert on Russell's global investment products, particularly data, operational, reporting, and regulatory aspects of managing the products.</li>\n<li>Advise clients on opportunities to further leverage Russell's reference data and partnering capabilities, and assist clients in both strategic and tactical planning phases.</li>\n<li>Perform data profiling and basic Business Intelligence level reporting</li>\n<li>Conduct data analysis when necessary, determining root cause of data inconsistencies.</li>\n<li>Ensure adequate quality controls are in place and are consistently performed.</li>\n<li>Develop/maintain data models and other data documents such as data flow diagrams and process flow diagrams.</li>\n<li>Network with other key data management associates globally/across Russell to evangelize and implement common best practices wherever possible.</li>\n</ul>\n\nThe successful candidate will have extensive demonstrable skills and experiences including the following:\n\n\n<ul>\n<li>Bachelor's degree in Business Administration, Finance or Technology related field preferred.</li>\n<li>5+ years of data management experience.</li>\n<li>3+ years Project management or team leadership experience</li>\n<li>Experience managing ETL processes around operational data stores and a working knowledge of basic Data Warehousing concepts/design patterns and data marts.</li>\n<li>Detailed understanding of the main types of financial data (instrument types) and their primary underlying components</li>\n<li>Fundamental understanding of data and database architecture with fluency in SQL.</li>\n<li>Ability to multi-task, including good organizational skills</li>\n<li>Client service and vendor oversight experience.</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Ability to collaborate and direct key business stakeholders to achieve shared understanding</li>\n<li>Ability to capture and portray complex information to compel actionable decisions</li>\n<li>Interpersonal skills including tact, diplomacy, professionalism and customer service</li>\n<li>Adaptability, high stress tolerance and ability to manage competing deadlines</li>\n</ul>"}