{"job title": "Data Quality Analyst", "company": "Salient CRGT", "city state": "– Washington, DC (US)", "rating": "3.1", "job description": "Company/Position Overview<br><br>In this role you will: Data analytics services to support Commission staff in reviewing, manipulating, visualizing and understanding the data submitted in order to meet the mission of the CFTC to include enforcement, surveillance, risk assessment and compliance functions. Data quality management activities that improve data quality for a designated data stream. Activities include issue investigation, reporting that measures data quality against industry standard data dimensions (i.e., completeness, uniqueness, timeliness, validity, accuracy, consistency), validation logic to ensure data complies with standards, programs that execute the validation logic on historical data and dashboards that give an over view of the data status. Actively monitor data quality on a specific data stream.\n<br><br>\nActive monitoring includes:\n\n<ul>\n\n <li>Profiling and analyzing the data to identify Data Quality (DQ) issues.</li>\n<li>Investigate DQ issues as reported by Division personnel, ODT staff or as a result of the profiling and data analysis activities.</li>\n<li>Prepare artifacts documenting the issue so issue owner has information necessary to solve issue.</li>\n<li>Work with Market Data Operations (MDO) and Data Architecture and Standards to contact data submitters to resolve identified DQ issues.</li>\n<li>Define validation logic to prevent similar problems in future data submissions.</li>\n<li>Work closely with the customer to determine the scope of data stream to be actively monitored – may be limited to certain fields, or certain submitters, etc.</li>\n<li>Partnering with Market Data Operations, standardize DMB data quality processes across data streams. Standardization includes generation of a standard set of reports, called Data Quality Scorecards, for measuring data quality across different data streams. Standardization also includes standardized reports that can be shared with internal CFTC staff and the data submitters to provide insight and trends on data quality for a specific submitter.</li>\n</ul>\n\nMandatory Qualifications (Education, Certifications, Experience, Skills)\n\n\n<ul>\n\n <li>Bachelor's degree in Computer Science, Engineering, Mathematics, or related field of study and 5 years of experience required. Will also accept a Master's degree and 3 years of experience.</li>\n<li>Excellent communication skills (both technical and non-technical)</li>\n<li>2+ years of SAS experience</li>\n</ul>\n\nDesired Qualifications (Education, Certifications, Experience, Skills)<br><br>Salient CRGT is a leading provider of health, data analytics, cloud, agile software development, mobility, cyber security, and infrastructure solutions. We support these core capabilities with full lifecycle IT services and training—to help our customers meet critical goals for pivotal missions. We are purpose-built for IT transformation supporting federal civilian, defense, homeland, and intelligence agencies, as well as Fortune 1000 companies.\n<br><br>\nIf you feel you are qualified for this position, express interest by clicking the Apply button below (if you are viewing this position on the Salient CRGT website). If you are viewing this job posting outside of the Salient CRGT website, please visit: www.salientcrgt.com/careers to express interest in this position through the Salient CRGT Careers page.\n<br><br>\nSalient CRGT is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, age, sex, sexual orientation, gender identity or expression, veteran status, disability, genetic information, or any other factor prohibited by applicable anti-discrimination laws."}