{"job title": "TECHNICAL DATA BASE ANALYST II", "company": "State of Florida", "city state": "– TALLAHASSEE, FL, US, 32399", "rating": "3.3", "job description": "<div>\nTECHNICAL DATA BASE ANALYST II - 55014286<br><br><strong>Date:</strong> \n<br>\n Aug 13, 2018\n<br><br>\n<strong>Location:</strong>\n<br><br>\n TALLAHASSEE, FL, US, 32399<br><br>#job-location.job-location-inline {\n<br>\n display: inline;\n<br>\n<strong> }</strong><br>\n\n <div>\n<div>\nApply now »</div>\n </div>\n </div><br>\n\n<div>The State Personnel System is an E-Verify employer. For more information click on our E-Verify website.</div><br>\n\n<div>Requisition No: 41901\n<br><br>\nAgency: Department of Transportation\n<br><br>\nWorking Title: TECHNICAL DATA BASE ANALYST II - 55014286\n<br><br>\nPosition Number: 55014286\n<br><br>\nSalary: $52,137.73 - $67,472.36\n<br><br>\nPosting Closing Date: 10/01/2018\n<br><br>\n<strong>STATE OF FLORIDA DEPARTMENT OF TRANSPORTATION</strong>\n<br><br>\n<strong>JOB POSTING DESCRIPTION</strong>\n<br><br>\n<strong>973 / Applications Services</strong>\n<br><br>\n<strong>OPEN COMPETITIVE</strong>\n<br><br>\n<strong>CAREER SERVICE</strong>\n<br><br>\n<strong>CONTACT PERSON: Bill Lucas</strong>\n<br><br>\n<strong>CONTACT PHONE NUMBER: (850) 410-5535</strong>\n<br><br>\n<strong>For benefit information available to State of Florida employees, go to</strong> http://www.mybenefits.myflorida.com/\n<br><br>\n<strong>SPECIAL REQUIREMENTS:</strong> You may be required to provide your Social Security Number to conduct required verifications. Male applicants born on or after October 1, 1962 will not be eligible for hire or promotion in the Career Service, or appointment in the Selected Exempt Service (SES) or Senior Management Service (SMS) unless they are registered with the Selective Services System (SSS) before their 26th birthday, or have a Letter of Registration Exemption from the SSS.\n<br><br>\n<strong>THE FLORIDA DEPARTMENT OF TRANSPORTATION VALUES AND SUPPORTS EMPLOYMENT OF INDIVIDUALS WITH DISABILITIES. QUALIFIED INDIVIDUALS WITH DISABILITIES ARE ENCOURAGED TO APPLY.</strong> In accordance with Section 110.112, Florida Statutes, and the Florida Department of Transportation’s Individuals with Disabilities Affirmative Action Plan, the agency is committed to ensuring affirmative action and equal employment opportunity for qualified individuals with disabilities. Upon request and as appropriate, reasonable accommodations to qualified individuals with disabilities may be provided. Interested persons should contact the Florida Department of Transportation’s Equal Opportunity Office located at 605 Suwannee Street, Tallahassee, Florida 32399 or call (850) 414-4747 for assistance.\n<br><br>\n<strong>POSITION DESCRIPTION</strong>: Perform technical work establishing and maintaining mainframe and server based enterprise application database environments that support the Florida Department of Transportation's (FDOT\"s) Enterprise Business applications. This position is located in Application Services of the Office of Information Technology (01T).\n<br><br>\nCollaborate with enterprise application development teams and coordinates the technical database tasks associated with the analysis, implementation and maintenance of logical and physical database objects. This involves coordination with appropriate personnel from other BSSO and OIS sections with issues pertaining to the resolution of technical application database problems (such as database access and application performance). Monitor the health of DB2, Oracle, SQL Server and mainframe jobs, and troubleshoot issues that occur outside of normal business hours and on weekends.\n<br><br>\nTransform logical data structures into physical data database objects within the Department's enterprise application database environment. This support is required for internal enterprise application development, Commercial-Off-The-Shelf (COTS) implementations, and user-developed systems.\n<br><br>\nPerform as member of a technical database team involving database platform conversion from Oracle to SQL Server. Assist with the implementation and support of new Windows/Linux/Unix database platforms. Serves as liaison with the Southwood Shared Resource Center (SSRC) for Windows/Linux/Unix platform database services. Serve as liaison with districts for Windows/Linux/Unix platform database services. Research and recommend technology and processes related to Windows/Linux/Unix platform relational database management system adoption and implementation.\n<br><br>\nAssist with the coordination of the database activities and tasks associated with the implementation and support of district-wide applications (i.e. Primavera, Open Text) within the district relational database environment. This involves coordination with the appropriate district personnel involved with the applications.\n<br><br>\nCreate and maintain custom data extracts and files in various formats as requested by enterprise application teams, end user offices, and external customers (i.e. flat files, geospatial shape files, etc.).\n<br><br>\nParticipate in the measurement and tuning of database access statements with an emphasis on those performing geospatial data access.\n<br><br>\n<strong> KNOWLEDGE, SKILLS AND ABILITIES:</strong> KNOWLEDGE OF THE PRINCIPLES, PRACTICES AND TECHNIQUES OF COMPUTER PROGRAMMING ANDYSTO1S DESIGN; KNOWLEDGE OF COMPUTER OPERATIONS, SYSTEMS AND PROCEDURES; KNOWLEDGE OF PROJEra COVITROL AND COST ESTIMATING TECHNIQUES; KNOWLEDGE OF COMPUTER PROGRAMMING LANGUAGE; KNOWLEDE OF DATA PROCESSING FLOW CHARTING TECHNIQUES; KNOWLEDGE OF DATABASE STRUCTURES AND THE6PIESii-,NOWLEDGE OF CURRENT DATABASE TECHNOLOGIES; KNOWLEDGE OF TERMINOLOGY, CONCEPTS AND TECHNIQUES ELATING TO GEOSPATIAL DATABASE COMPONENTS AND GIS APPLICATION PROGRAMMING; KNOWLEDGE OF THE CONFIGURATION AND USE OF ENVIRONMENTAL SCIENCES RESEARCH INSTITUTE'S (ESRI'S) ARCGIS, ARCSDE AND ARCGIS SERVER SOFTWARE; ABILITY TO CREATE DATABASES AND MONITOR DATABASE PERFORMANCE; ABILITY TO IDENTIFY AND DEFINE USER TASK NEEDS; ABILITY TO PROCESS INFORMATION LOGICALLY; ABILITY TO CONDUCT SHORT-RANGE AND LONG-RANGE PROJECT PLANNING STUDIES; ABILITY TO PERFORM MATHEMATICAL CALCULATIONS; ABILITY TO PLAN, ORGANIZE AND COORDINATE WORK ASSIGNMENTS; ABILITY TO COMMUNICATE TECHNICAL INFORMATION EFFECTIVELY; ABILITY TO ESTABLISH AND MAINTAIN EFFECTIVE WORKING RELATIONSHIPS WITH OTHERS.\n<br><br>\n<strong>MINIMUM QUALIFICATIONS:</strong> This position may be entrusted with access to confidential or sensitive data, with specific authorization from the Manager of the Business Systems Support Office. This position is authorized to perform duties related to the production environment which requires a high level of trusted security. This position has on-call responsibilities for returning to work to handle emergency situations or other needed activities.\n<br><br>\nA bachelor's degree from an accredited college or university in management information systems or in one of the computer sciences and four years of experience in computer systems analysis and/or computer programming, two years of which must have been in data base design; or a bachelor's degree from an accredited college or university and five years of experience in computer systems analysis and/or computer programming, two years of which must have been in data base design; or a master's degree from an accredited college or university in management information systems or in one of the computer sciences and three years of experience in computer systems analysis and/or computer programming, two years of which must have been in data base design; or a doctorate from an accredited college or university in management information systems or in one of the computer sciences and two years of experience in data base design; or six years of experience in computer systems analysis and/or computer programming, two years of which must have been in data base design and either (1) completion of a 720 classroom hour program of study from a vocational/technical school or accredited community college in an area of data processing (excluding data entry), or (2) 60 semester or 90 quarter hours of college coursework from an accredited institution which includes four courses in computer science or management information systems. Experience in computer systems analysis and/or computer programming can substitute on a year-for-year basis for the required college education. Completion of a one-year program of study from a vocational/technical school in an area of data processing (excluding data entry) can substitute for one year of the required computer systems analysis and/or computer programming experience.\n<br><br>\n<strong>As a CANDIDATE, you may be required to provide documentation (i.e. HIGH SCHOOL DIPLOMA OR EQUIVALENCY, college transcripts, ETC.) to verify meeting these Minimum Qualifications.</strong>\n<br><br>\n<strong>THE FLORIDA DEPARTMENT OF TRANSPORTATION VALUES THE SERVICE VETERANS AND THEIR FAMILY MEMBERS HAVE GIVEN TO OUR COUNTRY AND SUPPORTS THE HIRING OF RETURNING SERVICE MEMBERS AND MILITARY SPOUSES.</strong> If you are a preference-eligible applicant who receives notice of a hiring decision and believe that you were not afforded employment preference in accordance with applicable Florida law and regulation, you may file a written complaint within 60 calendar days from the date you receive the notice, requesting an investigation to the Florida Department of Veterans’ Affairs, Division of Benefits and Assistance, 9500 Bay Pines Boulevard, Room 214, St. Petersburg, Florida 33708.\n<br><br>\nThe State of Florida is an Equal Opportunity Employer/Affirmative Action Employer, and does not tolerate discrimination or violence in the workplace.\n<br><br>\nCandidates requiring a reasonable accommodation, as defined by the Americans with Disabilities Act, must notify the agency hiring authority and/or People First Service Center (1-866-663-4735). Notification to the hiring authority must be made in advance to allow sufficient time to provide the accommodation.\n<br><br>\nThe State of Florida supports a Drug-Free workplace. All employees are subject to reasonable suspicion drug testing in accordance with Section 112.0455, F.S., Drug-Free Workplace Act.\n<br><br>\n<strong>VETERANS’ PREFERENCE.</strong> Pursuant to Chapter 295, Florida Statutes, candidates eligible for Veterans’ Preference will receive preference in employment for Career Service vacancies and are encouraged to apply. Candidates claiming Veterans’ Preference must attach supporting documentation with each submission that includes character of service (for example, DD Form 214 Member Copy #4) along with any other documentation as required by Rule 55A-7, Florida Administrative Code. Veterans’ Preference documentation requirements are available by clicking here. All documentation is due by the close of the vacancy announcement.\n<br><br>\n<strong>Nearest Major Market:</strong> Tallahassee</div><br>\n\n <div>\n<div>\nApply now »</div>\n </div>\n<br>"}