{"job title": "Big Data Analyst", "company": "The Kemtah Group", "city state": "– Batesville, SC", "rating": "2.4", "job description": "A Big Data Analyst job in Greenville, SC is currently available through Belcan. In this role, you will be responsible for accelerating and supporting the ongoing activities in the field of Big Data and Smart Analytics at the clients innovation lab. To be considered for this role, you will have a Bachelors degree in Computer Science, and five or more years of experience in data science. Experience with Hadoop, Python, and C++ is a must. This is a very visible, contract opportunity with a growing company and has excellent upward mobility.\n<br><br>\n<strong>Big Data Analyst Job duties:</strong>\n\n\n<ul>\n<li>Works with large data sets from both within and external to client (e.g. plant data, social media data, warranty data) and conducts advanced analytical tasks, such data conversions, ETL, filtering, fusion, aggregations and data mining.</li>\n<li>Manages medium to large-scale enterprise-wide projects in the area of smart analytics.</li>\n<li>Serves as a primary point of contact for other engineers and specialists in the team providing expert knowledge and troubleshooting skills.</li>\n<li>Serves as internal consultant to other developers and engineers as needed, providing assistance in all phases of product life-cycle development.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>Bachelor degree in computer science, mathematics/statistics, engineering or related field required.</li>\n<li>Five or more years post-university experience in advanced analytics in the field of data science, applying scientific data analytics methods preferably to automotive industry datasets.</li>\n<li>At least a year proven experience completing projects in with a set of various data sources.</li>\n</ul>\n\nIf you are interested in this Big Data Analyst job in Greenville, SC, please apply via the apply now link provided.\n<br><br>\nBelcan is a global supplier of engineering, technical recruiting, and IT services to customers in the aerospace, industrial, and government sectors. Belcan engineers better outcomes through adaptive and integrated servicesfrom jet engines, airframe, and avionics to heavy vehicles, chemical processing, and cybersecurity. Belcan takes a partnering approach to provide customer-driven solutions that are flexible, scalable, and cost-effective. Our unique capabilities have led to continuous growth and success for nearly 60 years. We are a team-driven Equal Opportunity Employer committed to workforce diversity."}