{"job title": "Jr Business Analyst (Sr Coordinator, Data Management Support)", "company": "Tivity Health", "city state": "– US-VA-Ashburn", "rating": "3.7", "job description": "Description/Responsibilities<br><br>The Senior Coordinator of Data Management and Support is responsible for ensuring the internal utilization management (UM) QA processes are developed and applied to the management of UM workflow processing including letter template development, testing and deployment, system enhancements, and quality audit review of all UM processes. The colleague will coordinate with IT and operations resources to ensure system enhancements testing methodologies meet the requirements of the UM operations workflow and business needs.\n<li>Track and manage the overall testing effort of a UM project implementation and/or system enhancements, including the development of test case examples and execution of the test plan</li>\n<li>Create UM end user training materials and complete training</li>\n<li>Develop test case examples to support Inter-Rater Reliability (IRR) clinical workflow process and oversight</li>\n<li>Ensure that the testing is completed on time and meets all functional requirements as defined during the requirement definition process</li>\n<li>Work closely with developers to identify areas and methods to improve testing efficiency, expand coverage and increase product reliability</li>\n<li>Oversee UM system issues and works with development to identify and correct problems</li>\n<li>Responsible for entering UM-Fast Tracked escalated work items and coordinating with development for testing and resolution. Troubleshoots basic problems and recommends appropriate actions</li>\n<li>Oversight responsibility for monitoring IT utilities platform for management of all UM-specific issues related to client letter notifications, authorization errors, mismatched member/provider issues, etc.</li>\n<li>Review information systems, perform maintenance work, identify and document all quality related issues</li>\n<li>Oversight of client letter generation processing, including review and approval of letter templates, ongoing updates and quality review of regulatory requirements for member appeals content, formatting and state-specific regulations. Monitors and reviews production letters quarterly for quality assurance</li>\n<li>Supports work queues by managing assignments of administrative authorization requests to meet turnaround time requirements</li>\n\nQualifications\n\n\n<ul>\n\n <li>Bachelor’s degree in business administration, healthcare administration or related field or equivalent amount of related work experience</li>\n<li>Minimum of 4 years of experience in the healthcare industry or related field or equivalent combination of education and experience</li>\n<li>Outstanding communication skills and attention to detail</li>\n<li>Ability to troubleshoot system configuration problems</li>\n<li>Ability to develop a clear and concise user acceptance testing strategy</li>\n<li>Demonstrated ability to handle/organize multiple projects simultaneously</li>\n<li>Problem solving and conflict resolution abilities</li>\n<li>Knowledge of testing methodologies, operational workflows and application development</li>\n</ul>\n6793\n<br><br>\n#LI-CM1\n<br><br>\n<em>About Tivity Health</em>\n<br><br>\nTivity Health is a leading provider of fitness and health improvement programs, with strong capabilities in developing and managing network solutions. Through our existing three networks (SilverSneakers® - the nation’s leading fitness program for older adults, Prime® - membership access to the nation’s largest network of fitness centers, and WholeHealth Living – specialty medical network development and benefits management), Tivity Health is focused on targeted population health for those 50 and over.\n<br><br>\nTivity Health is an equal employment opportunity employer and is committed to a proactive program of diversity development. Tivity Health will continue to recruit, hire, train, and promote into all job levels without regard to race, religion, gender, marital status, familial status, national origin, age, mental or physical disability, sexual orientation, gender identity, source of income, or veteran status."}