{"job title": "Master Data Analyst Items", "company": "UTZ Quality Foods", "city state": "– Hanover, PA", "rating": "2.6", "job description": "Are you a loyal, career driven, and customer focused professional in search of a company with shared goals to help you succeed? If so, Utz is currently seeking a Master Data Analyst to work from our Corporate Offices in Hanover, PA.\n<br><br>\nThe Analyst is the primary point of responsibility, accountability and activity for the assessment, improvement and ongoing maintenance of critical data assets. The purpose of this position is to support the creation, editing and management of item data within the Item Master and determine data standards, develop process controls, maintain data elements and provide support for all areas of Utz. This position will act as the business expert responsible to lead and consult on project initiatives dependent on master data.\n<br><br>\nThe ideal candidate for this position must have a four-year degree or equivalent in a technical or financial field is preferred as well as, a minimum of 1-3 years of significant and relevant experience in the food industry. Knowledge in ingredients, formulations, package design, finished products, new product commercialization is required as well as excellent communication skills and the ability to train others in systematic, detailed work processes.\n<br><br>\n<strong>Master Data Analyst Items:</strong>\n\n\n<ul>\n<li>Leads the Item Master Data Item team, delivering rapid creation and maintenance for both routine and non-routine item data set up, maintenance and management.</li>\n<li>Creates, edits and manages item data within system Item Master(s).</li>\n<li>Works within and beyond immediate area to implement data improvement approaches. Actively participates in the design and deployment of applications and data integration.</li>\n<li>Works with cross functional business partners in marketing, operations, information technology, procurement, supply chain and quality to develop, manage and implement a priority list of all the key projects.</li>\n<li>Leads Item Master Data team response to requests for multiple projects/priorities on tight timelines with a high level of accuracy. Communicates project activities, information, recommendations and performance to management.</li>\n<li>Reviews the current state of data control processes for specific data domains or elements.</li>\n<li>Monitors and track ongoing data quality levels on a regular basis. Identifies and provides optimal approaches for resolving data quality issues. Supports Data Owners with resolution of data quality issues.</li>\n<li>Learns, develops and supports maintenance of specifications, product data, and process documentation.</li>\n<li>Defines and manages data control business processes for specific data elements as required, to achieve system integrity and consistency. Ensure that data quality is maintained and governance to data rules are followed, so the data can effectively support business processes.</li>\n<li>Maintains working relationships with external data brokers, leading all data governance efforts and ensuring data brokers are properly maintaining data elements for Utz customers. Publish data updates to respective data broker web sites.</li>\n<li>Maintain working relationship with IT and the DOA Group to ensure all route handhelds are properly configured with up-to-date item information including customer authorization lists and item pricing.</li>\n<li>Create and publish weekly Marketing memos recapping item maintenance changes such as New Items, Pack Size changes, Price changes, and Discontinued Items.</li>\n<li>Captures and monitors key business data rules within business systems.</li>\n<li>Other duties as assigned.</li>\n<li>Obtain GS1 certification for industry item standards governance.</li>\n</ul>\n\nAbout our Company!\n<br><br>\nUtz is the largest independent, privately held snack brand in United States. We pride ourselves on our pleasant working environment, challenging opportunities, career growth, and competitive wages. Utz offers a full benefit package, including medical, prescription, dental and vision plans, 401(k) and profit sharing plan, short&amp;long-term disability, paid holidays and vacation, life insurance and an employee assistance program. Come grow with the Utz Family of Brands.\n<br><br>\nJoin our Team! Click the Apply button above.\n<br><br>\nEqual Opportunity Employer/ Minorities/ Females/ Disability/ Protected Veteran\n<br><br>\nIf you want to view the EEO is the Law poster, please choose your language:"}