{"job title": "Data Analyst III", "company": "WageWorks", "city state": "– Irving, TX", "rating": "2.6", "job description": "Data Analyst III<br><br>With general direction and considerable latitude for independent judgment and discretion, this position is responsible for data analysis and technical support for inbound and outbound data quality in accordance with established Service Level Agreements (SLA's). Assists in troubleshooting and error resolution related to file processing for tier 1 and 2 issues.<br><br>REPORTING STRUCTURE&amp;WORK SETTING<br><br>This position typically performs work at a WageWorks site and reports to a Supervisor or Manager of Data Integration Services or another leader with responsibility for data integration.<br><br>ESSENTIAL DUTIES&amp;PRIMARY ACCOUNTABILITIES<br><br>1. Evaluates and monitors data quality including exception and error handling at a complex level. Researches data discrepancies and addresses issues by modifying and executing SQL queries to identify trends/issues in accordance with established SLA's.<br><br>2. Communicates with internal and external clients and vendors to provide support regarding file specifications and data quality issues in a timely and effective manner.<br><br>3. Develops, maintains and provides documentation on processes, scripts and case resolution procedures for future reference or use.<br><br>4. Provides ongoing guidance and training for team members on file processing, exception and error handling, and SQL query execution.<br><br>MARGINAL DUTIES&amp;ADDITIONAL FUNCTIONS<br><br>1. Acquires/enhances applications expertise to become more knowledgeable about evolving system analysis, programming and database technology. This may be accomplished by attending trainings, seminars and interfacing with senior level practitioners.<br><br>2. Performs other duties as assigned or apparent.<br><br>ADDITIONAL PERFORMANCE REQUIREMENTS<br><br>WageWorks believes that our success is achieved by its People. Values describe how we work together to achieve our success. It is our employees that drive results through living our Company Values. Every employee at WageWorks is expected to uphold and demonstrate the six Company Values listed below as an additional component of the job description and as a standard of individual performance.<br><br>CARING People are the heart of our company. We care about people: our Clients, our Client's employees and their families, our partners, and local communities, and our fellow employees at WageWorks.<br><br>CUSTOMER-CENTRIC Our Customer comes first. We aim to serve our Clients and their employees, our brokers and partners, as well as our internal customers.<br><br>PASSIONATE We love what we do and are passionate about delivering Consumer-Directed Benefits that save people money and enrich their lives.<br><br>ACCOUNTABLE We are dedicated to making our team and the company succeed, and we are open, honest, ethical, and conscientious, as we deliver on our commitments.<br><br>LEADING Our actions inspire new ideas and drive change each and every day.<br><br>RESPECTFUL We value the diversity of our people, treat them with dignity and respect, encourage their development and reward their performance.<br><br>SUPERVISORY RESPONSIBILITY<br><br>NOTE: WageWorks leadership will strive to uphold the mission, vision, and values of the organization. They will serve as role models for staff and act in a people-centered and results oriented manner with a focus on customer service.<br><br>No formal supervisory responsibility entailed, although this position may serve as a resource for other employees.<br><br>ESSENTIAL KNOWLEDGE, SKILLS&amp;ABILITIES<br><br>EDUCATION:<br><br>Knowledge of business and technology as normally obtained through the completion of a Bachelor's Degree in Information Technology, Business Administration or a closely related field or equivalent combination of education and experience.<br><br>WORK EXPERIENCE OR RELATED EXPERIENCE:<br><br>Experience should include at least one to three years of technical work experience including: ability to analyze and monitor data updates to ensure integrity of data, working with electronic files, analyzing and troubleshooting data, working in a client facing environment, and working knowledge of SQL.<br><br>SPECIALIZED KNOWLEDGE, SKILLS&amp;ABILITIES:<br><br>Ability to drive for results and display a sense of urgency.<br><br>The ability to interact effectively with team members, clients, developers and other staff is required. Excellent, communication and interpersonal skills are required. Excellent writing and editing skills are necessary to transfer information to individuals. A strong customer service orientation is essential. A demonstrated ability to adapt to the changing demands of business is necessary.<br><br>Advanced analytical skills and the ability to quickly assess client and systems issues as well as research/investigate technical systems and perform research/investigate technical transactions.<br><br>Strong organizational skills and the ability to prioritize workload in a frequently interrupted environment are essential while meeting deadlines. The ability to work independently with limited supervision is also required.<br><br>EQUIPMENT:<br><br>Proficiency with business and communications software (preferably Word, PowerPoint, common Windows operating systems, and Outlook) is required. Prior experience with a querying tool such as Microsoft SQL Server Management Studio or TOAD Solutions is preferred. Advanced hands-on knowledge of Excel and a text editing tool (such as Ultra Edit, Notepad++, etc.) is required.<br><br>TRAVEL REQUIREMENTS&amp;CONDITIONS<br><br>Infrequent travel may be required.<br><br>WORK ENVIRONMENT CONDITIONS&amp;DEMANDS<br><br>Work is generally performed in an office environment in which there is only minimal exposure to unpleasant and/or hazardous working conditions.<br><br>PHYSICAL REQUIREMENTS&amp;DEMANDS<br><br>Work requires normal range of hearing and eyesight. Incumbent must be able to use a telephone or headset equipment and operate a keyboard and other office equipment. The ability to perform work at a computer terminal for 6-8 hours a day and function in an environment with frequent interruptions is required. At times, incumbents are subject to sitting for prolonged periods. Infrequently, incumbent must be able to lift and move material weighing up to 20 lbs. Incumbent may experience elevated levels of stress during periods of increased activity and with work entailing multiple deadlines.<br><br>Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions as described."}