{"job title": "Project Scientist III", "company": "AECOM", "city state": "– Indianapolis, IN", "rating": "3.2", "job description": "<ul>\n<li>*Business Line** Environment</li>\n<li>*Position Title** Project Scientist III</li>\n</ul>\n\nUnited States of America - Indiana\n<br><br>\nIndianapolis\n\n\n<ul>\n<li>*Job Summary**</li>\n</ul>\n\nAECOM is actively seeking a highly talented and motivated Project Scientist III - Asbestos Program for immediate employment in our Indianapolis, IN office. The Project Scientist will be part of our Asbestos, lead &amp; mold program which includes inspection, design/plan, and abatement oversight.\n<br><br>\nThe responsibilities of this position include, but are not limited to:\n<br><br>\n+ Prepares reports and other technical documents\n<br><br>\n+ Compiles, evaluates, and analyzes environmental data\n<br><br>\n+ Conducts asbestos surveys\n<br><br>\n+ Conducts lead paint inspections\n<br><br>\n+ Conducts mold / indoor air quality surveys\n<br><br>\n+ Conducts universal and general hazard inventories surveys\n<br><br>\n+ Candidate will travel within a geographic territory conducting inspections (IN, IL, OH and KY)\n\n\n<ul>\n<li>*Minimum Requirements**</li>\n</ul>\n\n+ Bachelor's degree\n<br><br>\n+ 5+ years of experience\n<br><br>\n+ Asbestos Certifications (Inspector, Project Monitor, NIOSH 582, Supervisor and Designer)\n<br><br>\n+ Lead Paint Inspections\n<br><br>\n+ Indoor Air Quality Inspections\n<br><br>\n+ Excellent communication skills\n<br><br>\n+ Strong understanding of structural building components\n<br><br>\n+ Proficient with technology\n<br><br>\n+ Candidate must be self-motivated and able to work with little supervision\n<br><br>\n+ Ability to travel up 75% of the time\n<br><br>\n+ This position will require travel to multiple client sites within IN, IL, OH and KY\n<br><br>\n+ Due to the nature of the industry, there are times when weekend and evening work will be required, potentially on short notice\n<br><br>\n+ This is a fast paced position and the candidate must be flexible with schedules and able to adapt quickly\n<br><br>\n+ Due to the nature of this work, U.S. citizenship is required\n\n\n<ul>\n<li>*Preferred Qualifications**</li>\n</ul>\n\n+ DOT and RCRA Training\n<br><br>\n+ Proficient with MS Word, Excel, and Adobe\n<br><br>\n+ Experience working in SharePoint platform\n<br><br>\n+ Aerial Lift Experience\n\n\n<ul>\n<li>*What We Offer**</li>\n</ul>\n\nAECOM is a place where you can put your innovative thinking and business skills into high gear and work alongside other highly intelligent and motivated people. It's a place where you can apply your skills to some of the world's most challenging, interesting, and meaningful projects worldwide. It's a place that values the diversity of our areas of practice and our people. It's what makes AECOM a great place to work and grow. AECOM is an Equal Opportunity Employer.\n<br><br>\nAt AECOM, employee's safety and security are our top Safeguarding core value. All employees are expected to set the highest level of safety expectation in their work, display the highest level of safe behavior, and actively participate in AECOM's Safety For Life Program. SH&amp;E is a part of our company culture and participation is required for all employees.\n<br><br>\n_NOTICE TO THIRD PARTY AGENCIES: Please note that AECOM does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed Recruitment Fee Agreement, AECOM will not consider or agree to payment of any referral compensation or recruiter fee. In the event a recruiter or agency submits a resume or candidate without a previously signed agreement, AECOM explicitly reserves the right to pursue and hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of AECOM._\n\n\n<ul>\n<li>*_Job Category_** _Sciences_</li>\n<li>*_Business Group_** _Design and Consulting Services Group (DCS)_</li>\n<li>*_Country_** _United States of America_</li>\n<li>*_Position Status_** _Full-Time_</li>\n<li>*_Requisition/Vacancy No._** _183539BR_</li>\n</ul>\n\n_Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status._"}