{"job title": "Applied Scientist (Machine Learning)", "company": "Amazon", "city state": "– US, WA, Seattle", "rating": "3.8", "job description": "Do you want to join an innovative team of scientists who use machine learning and statistical techniques to create state-of-the-art solutions for providing better value to Amazon's customers? Do you want to build advanced algorithmic systems that help optimize millions of transactions every day? Are you excited by the prospect of analyzing and modeling terabytes of data to solve real world problems? Do you like to own end-to-end business problems/metrics and directly impact the profitability of the company? Do you like to innovate and simplify? If yes, then you may be a great fit to join the Machine Learning and Data Sciences team for our India Consumer Businesses.\n<br><br>\nIf you have an entrepreneurial spirit, know how to deliver, love to work with data, are deeply technical, highly innovative and long for the opportunity to build solutions to challenging problems that directly impact the company's bottom-line, we want to talk to you.\n<br><br>\nMajor responsibilities\n\n\n<ul>\n<li>Use machine learning and analytical techniques to create scalable solutions for business problems</li>\n<li>Analyze and extract relevant information from large amounts of Amazon's historical business data to help automate and optimize key processes</li>\n<li>Design, development and evaluation of highly innovative models for predictive learning</li>\n<li>Work closely with software engineering teams to drive real-time model implementations and new feature creations</li>\n<li>Work closely with operations staff to optimize various business operations,</li>\n<li>Establish scalable, efficient, automated processes for large scale data analyses, model development, model validation and model implementation</li>\n<li>Track general business activity and provide clear, compelling management reporting on a regular basis</li>\n<li>Research and implement novel machine learning and statistical approaches</li>\n</ul>"}