{"job title": "Sr Applied Scientist", "company": "Amazon", "city state": "– US, WA, Seattle", "rating": "3.8", "job description": "Amazon Web Services is the global leader in cloud services. This is a unique opportunity to play a key role in the research we are doing to innovate in several areas related to enabling growth a massive scale, developing our people, cultivating our culture, and enhancing our employees experience.\n<br><br>\nAWS HR is looking for an expert in descriptive statistics, model development, forecasting, and optimization to set the vision for large-scale experiments and lead data analysis for our organization. The output of this team has a big impact on how Amazon attracts, retains, and manages its workforce. We want to continue creating amazing experiences for our employees as we continue to scale our business globally. In order to meet this objective, a key initiative is to further build out internal tools with a vision setting the bar in experimental analysis for complex experiments. These analyses will be key in decisions that will have major impact on the future of our business.\n<br><br>\nYou will work closely with economists, statisticians, business analysts, and data engineers; learning from their collective experience. You will be challenged by the pace of the business and the scale involved. Success on this initiative will give you a great opportunity to be a thought leader in the space of HR analytics, operations research, and I/O psychology.\n<br><br>\nWe are searching for someone who can rigorously use state-of-the-art methods and is comfortable as both a mentor and subject area expert for their field. The successful candidate will (1) contribute to existing predictive, analytic, and algorithmic efforts already underway, (2) identify new and promising uses of technologies and (3) connect with other research scientists throughout Amazon to ensure our data is effectively used by other teams and that we benefit from innovations and progress across the company.\n<br><br>\n<strong>Job Responsibilities include:</strong>\n<br><br>\n· Participate in planning and design of research. Scope, conduct, direct, and coordinate all phases of small-scale research projects\n<br>\n· Develop and execute validation and impact studies\n<br>\n· Apply appropriate techniques to collect, organize, and analyze data to generate insights\n<br>\n· Serve as a consultant to internal stakeholder groups to design research approaches, strategize, and execute research initiatives\n<br>\n· Prepare analyses, graphs, fact sheets and other compelling research summaries to present to multiple audiences\n<br>\n· Support the design, research, and analysis of data for multiple client groups simultaneously\n<br>\n· Gather, develop, and manage large datasets from multiple data sources\n<br>\n· Consult internal stakeholders and customers to achieve proper alignment of research agendas\n<br>\n· Assist in defining project requirements, document business and functional specifications, map current and future state business processes\n<br>\n· Maintain project plans, identify resource needs, and manage project schedule; collaborate effectively across teams to meet timelines and deliverables\n<br>\n· Own all communications to project members and stakeholders on progress, issues, and risks, provide pre and post launch communications to impacted teams\n<br>\n· Use statistical analysis tools to analyze employee research results and provide detailed reporting and data presentation"}