{"job title": "Applied Machine Learning Scientist", "company": "Amazon", "city state": "– US, CA, Sunnyvale", "rating": "3.8", "job description": "External job description\n<br>\nAmazon Lab126 is an inventive research and development company that designs and engineers high-profile consumer electronics. Lab126 began in 2004 as a subsidiary of Amazon.com, Inc., originally creating the best-selling Kindle family of products. Since then, we have produced groundbreaking devices like Fire tablets, Fire TV and Amazon Echo. What will you help us create?\n<br><br>\n<strong>The Role:</strong>\n<br>\nDo you want to join a new crew of scientists who want to use machine learning and statistical techniques to create state-of-the-art solutions to impact Amazons products? Do you want to build predictive algorithmic systems that impact design decisions and optimize our engineering expectations in products? Are you excited by the prospect of analyzing and modeling terabytes of field and customer data to solve real world problems? Do you like to own end-to-end business problems/metrics and directly impact our products? Can you teach Machine Learning techniques comprehensively and lead teams to apply the best solutions? If you have an entrepreneurial spirit, know how to deliver, are deeply technical, highly innovative and long for the opportunity to build solutions to challenging problems, we want to talk to you.\n<br><br>\nMajor responsibilities\n<br>\n· Use statistical and machine learning techniques to deep dive and model customer behavior in how they use our Amazon hardware products.\n<br>\n· Analyze and extract relevant information from large amounts of Amazons historical business data to help drive business decisions on product features and field reliability\n<br>\n· Architect systems, design and code highly innovative models for predictive learning\n<br>\n· Establish scalable, efficient, automated processes for large scale data analyses, model development, model validation and model implementation\n<br>\n· Develop systems that can report field performance to management\n<br>\n· Research, Teach and lead teams to adopt state of the art machine learning and statistical approaches"}