{"job title": "Principal Research Scientist", "company": "Amazon", "city state": "– US, NY, New York", "rating": "3.8", "job description": "Amazons Advertising Analytics and Insights team is looking for a motivated and experienced research scientist to lead research and publication efforts focused on changing the way data is used to drive advertising success. We are a startup within one of the fastest growing and most strategic parts of Amazon. Our team owns the product, technology and deployment roadmap for advanced analytics and insight products across our advertiser success team. Advertiser success is core to Amazons growth, as it helps our suppliers drive awareness, consideration, and purchase of their products by hundreds of millions of consumers around the world, and generates revenue which helps us lower prices and invest in improvements to our customer experience. We are a highly motivated, collaborative and fun-loving team with an entrepreneurial spirit and bias for action. With a broad mandate to experiment and innovate, we are growing at an unprecedented rate with a seemingly endless range of new opportunities.\n<br><br>\nAs leader of the A&amp;I Research Science you influence our team of research and data scientists who are working with huge retail and advertising data sets to provide one-of-a-kind insights for our customers. You lead the exploratory research and prototyping of statistical and machine learning models within the broad marketing science domain. You are also responsible for writing and publishing articles that distinguish Amazon as a cutting edge thought leader in the ecommerce marketing and advertising space. You will share the ownership of the technical vision and direction for advanced analytics and insight products. We are looking for a leader who can thrive in a startup environment, thinks big, can move fast, and wants to change the way customers use data to drive business success. If you excel at proposing and developing unique analytical insights and are passionate about creating the future, come join us as we work hard, have fun, and make history.\n<br><br>\n<strong>Key Responsibilities Include:</strong>\n<br><br>\n· Develop a long-term research and prototyping strategy and drive the implementation of that strategy.\n<br>\n· Set and maintain a high bar for writing and publishing industry and scientific articles.\n<br>\n· Contribute to growing the research and data science teams and mentor team members for career growths.\n<br><br>"}