{"job title": "Process Development Scientist", "company": "Amgen Inc", "city state": "– Cambridge, Massachusetts", "rating": "3.7", "job description": "Amgen is currently seeking a Process Development Scientist with a passion for hands-on drug product process and formulation development, as well as data analytics, statistical modeling, and data visualization technologies to join our team. The position is in our Pivotal Drug Product Technologies Department in Cambridge, MA. This group is responsible for late phase drug product development of biologics, including commercial formulation, commercial process, and life cycle management activities. The Scientist will work closely with a team of engineers and scientists responsible for progressing the technical aspects of Amgens drug product and process development. Additionally, the position offers an excellent opportunity to apply expertise to enhance the way data is collected, analyzed, used to inform and make decisions throughout drug product development. The Scientist will integrate and successfully utilize platform and prior product knowledge to advance Amgen practices and ensure success through the commercialization process.\n<br><br>\nResponsibilities include:\n<li>Plan, design, execute, and document laboratory studies related to drug product design, formulation, and process development in support of commercialization and life cycle management</li><li>Participate in Drug Product Commercialization Teams responsible for conducting process development on pipeline products during Commercialization, as well as, supporting commercial products in lifecycle management</li><li>Actively utilize advanced IS systems to improve drug product design through faster data availability, analyzing large data sets, and statistical analysis</li><li>Understanding business needs and leveraging historical information to develop novel, yet practical, data-driven solutions to meet those needs</li><li>Foster a culture of data analytics and visualization (through creation and adoption of best practices, providing training and mentorship, leading working/learning groups) to help deploy and improve utilization of new IS systems designed for process development</li><li>Provide support, as needed, to clinical and commercial fill/finish manufacturing operations through process capability analysis, troubleshooting, root cause analysis, and product impact assessments for non-conformance investigations and process changes/improvements</li><li>Author and review guideline documents, technical protocols, reports, product impact assessments, and regulatory sections in support of IND and marketing application submissions</li><li>Deliver progress reports and presentations to ensure management awareness and engagement of the current status, progress, and future program and functional needs</li><li>Ability to travel domestically and internationally up to 10% of the time</li>\n<strong>Basic Qualifications:</strong>\n<li>Doctorate degree or Doctorate degree completed by September 2018</li><li>Masters degree &amp; 4 years of scientific experience or</li><li>Bachelors degree &amp; 6 years of scientific experience</li>\n<strong>Preferred Qualifications:</strong>\n<li>Advanced degree in Pharmaceutics, Biotechnology, Engineering, Material Science or related discipline or Statistics degree with experience in pharmaceutical development and manufacturing</li><li>2+ years of post-doctoral or industry experience in pharmaceuticals/biotechnology or related field</li><li>Experience with unit operation (i.e. filling, filtration, mixing, etc.) specific scale down model development, characterization, and scale-up</li><li>Experience with coding/scripting for automated data analysis and modeling to enable better access and standardization across the function</li><li>Experience with advanced statistical/analytical techniques and machine learning algorithms</li><li>Proficiency in at least one statistical software package (such as SIMCA or JMP)</li><li>Experience with data visualization tools or packages, such as Tableau or Spotfire</li><li>Proficiency in multiple programing languages, with emphasis on SQL, VBA, Python, or R</li><li>Experience that includes elements of new product development, formulation development, process characterization, equipment design and implementation, technical transfers to global manufacturing sites, statistical process control (SPC), and statistical design and analysis of experiments</li><li>Understanding of physical/chemical stability of proteins and how process related stress impacts product quality.</li><li>Aseptic processing experience and familiarity with cGMPs</li><li>Strong problem solving and effective cross-functional communication skills</li><li>Proven ability to learn and act on dynamic information at a rapid pace</li>\n\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status."}