{"job title": "Principal Data Mining Specialist - Big Data", "company": "Blue Cross and Blue Shield of Louisiana", "city state": "– Baton Rouge, LA", "rating": "3.9", "job description": "We take great strides to ensure our employees have the resources to live well, be healthy, continue learning, develop skills, grow professionally and serve our local communities. We invite you to apply for a career with Blue Cross.\n<br><br>\n<strong>You should know that:</strong>\n<br><br>\n+ Jobs are updated and posted daily.\n<br><br>\n+ You must submit your resume online.\n<br><br>\n+ Apply for each position for which you are qualified and interested in.\n<br><br>\n+ You will only be considered for positions for which you apply.\n<br><br>\n+ Resumes are only accepted for posted positions.\n<br><br>\n+ Positions are full-time unless otherwise stated.\n<br><br>\n+ Due to the high volume of applicants, only those most qualified will be contacted.\n<br><br>\n+ We are unable to accept phone calls.\n\n\n<ul>\n<li>*POSITION PURPOSE** **:**</li>\n</ul>\n\nThe Principal Data Mining Specialist - Big Data will be responsible for developing patterns &amp; practices and support for analytical consumption of the Data Lake by data analysts and data scientists in a reliable, repeatable and scalable manner to deliver fast time-to-value. Additionally, the Specialist will be responsible ensuring data quality and searchability of data sets in the Data Lake for the enterprise. This position plays an integral role in supporting the company?s strategic direction to be a data and analytics driven.\n<br><br>\nAccountable for complying with all laws and regulations associated with duties and responsibilities.\n<br><br>\n<strong>\n<ul>\n<li>*Necessary Contacts** :</li>\n</ul>\n\n</strong>\n<br>\nTo do this job effectively the incumbent has to be in contact with data scientists, team members, departmental management, vendors, and consultants.\n<br><br>\n<strong>\n<ul>\n<li>*QUALIFICATIONS** :</li>\n</ul>\n\n</strong>\n<br>\nBachelor?s Degree in Business, Finance, and Computer Science, Mathematics or related field is required. Four years of related experience can be used in lieu of a degree.\n<br><br>\nAt least 7 years of professional information technology experience to include a minimum of two years of experience in SQL and programming languages such as Python, Java, Perl.\n<br><br>\nStrong statistical understanding with experience in R and/or SAS languages is preferred.\n<br><br>\nUnderstanding of data cleansing and munging techniques as well as staying current with emerging tools and techniques in machine learning, statistical modeling and analytics.\n<br><br>\nEmploying best practices to analyze large amounts of data while maintaining intense attention to detail.\n<br><br>\nAbility to creatively think and question established business practices and brainstorming new approaches to data analysis.\n<br><br>\nStrong verbal and written communication skills, time management and organizational skills. Able to multitask and adapt quickly to change and coordinate activities with others.\n<br><br>\n<strong>\n<ul>\n<li>*ACCOUNTABILITIES &amp; ESSENTIAL FUNCTIONS** :</li>\n</ul>\n\n</strong>\n<br>\nDemonstrate the ability to adapt and work with team members of various experience level.\n<br><br>\nProvide support and best practices to assist in the wrangling, discovery, and exploratory analysis by Data Analysts and Data Scientist using statistical, analytic, and visualization tools on the Big Data platform as well as machine learning, natural language process, and artificial intelligence services.\n<br><br>\nPerform strategic data analysis, data cleansing and data validation from raw data zone.\n<br><br>\nCollaborate with Data Governance and Data Stewards to catalog and tag dataset to support the ongoing process of ensuring data quality and searchability\n<br><br>\nFacilitate and operationalize the storage and compute management as well as scripting needs such as R, Python, and SQL by Data Scientist to run analytical models.\n<br><br>\nUnderstands Departmental Goals and Objectives and deliver work products to contribute to those goals as well as advancing Analytics and EIM division.\n<br><br>\nJob duties are performed in a normal and clean office environment with normal noise levels.\n<br><br>\nWork is predominately done while sitting or standing.\n<br><br>\nThe ability to comprehend, document, calculate, visualize, and analyze are required.\n<br><br>\nPhysical effort is required to lift, hold, and carry objects up to 15 pounds, occasionally.\n<br><br>\n_The above statements are intended to describe the general nature and level of work being performed by employees assigned to this job. They are not intended to be an exhaustive list of all responsibilities, duties, and skills required of employees so classified._\n\n\n<ul>\n<li>*An Equal Opportunity Employer**</li>\n<li>*All BCBSLA EMPLOYEES please apply through Workday Careers.**</li>\n</ul>\n\n<strong>PLEASE USE A WEB BROWSER OTHER THAN INTERNET EXPLORER IF YOU ENCOUNTER ISSUES (CHROME, FIREFOX, SAFARI)</strong>\n\n\n<ul>\n<li>*Company Mission**</li>\n</ul>\n\nTo improve the health and lives of Louisianians.\n\n\n<ul>\n<li>*Company Vision**</li>\n</ul>\n\nTo be the market leader that delivers unsurpassed value to our customers through partnerships across the healthcare system.\n<br><br>\nBlue Cross and Blue Shield of Louisiana is incorporated as Louisiana Health Service &amp; Indemnity company and is an independent licensee of the Blue Cross and Blue Shield Association. Blue Cross and Blue Shield of Louisiana is licensed to sell products only in the state of Louisiana.\n<br><br>\nBCBSLA is an Equal Opportunity and Affirmative Action Employer and prohibits discrimination and harassment of any kind. It is the policy of BCBSLA to provide equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity and/or expression, genetic information, marital status, veteran status, or any other characteristic protected by federal, state or local law. In addition, BCBSLA will provide reasonable accommodations for qualified individuals with disabilities. If you are an individual with a disability and need assistance in applying for a position, please contact us at recruiting.solutions@bcbsla.com."}