{"job title": "Plant Microbiologist - Principal Scientist", "company": "Cardinal Health", "city state": "– Augusta, GA", "rating": "3.3", "job description": "Plant Microbiologist - Principal Scientist\n<br><br>\n<strong>Job Description Summary:</strong>\n\n\n<ul>\n<li>This position will oversee the Microbiology Testing at the Augusta facility and any activities related to environmental monitoring and product cleanliness/quality data.</li>\n<li>This position will review Test data and use the information to drive the continuous improvement at the Augusta facility. You will review the data/reports to make sure that we are meeting all Internal/External requirements and verify that the information is available to review in audits, management review, and information that is needed to support CAPA/Risk Assessment activities.</li>\n<li>In this role, you will be working in Microbiology, Clean room and Manufacturing production floor environment and it is required to collect, process, and completing the Air, Surface, and Water quality testing and documenting the results. You are responsible for managing inventory levels for raw materials that are needed to complete Microbiology Lab testing.</li>\n<li>In addition, you will support/conduct any Validation activities related to equipment and test method qualification and other validation elements such as process, packaging and sterilization as well as quality services such as calibration and product first article inspections</li>\n</ul>\n\n<strong>Accountabilities:</strong>\n\n\n<ul>\n<li>Responsible for direct management of Microbiology lab, lab personnel, trending of environmental monitoring data, review &amp; release of microbiology testing data, and monthly environmental metrics.</li>\n<li>Responsible for direct management of Sterility Release department, personnel, and daily release reports.</li>\n<li>Responsible for direct management of Validations lab, lab analyst, and prioritization of testing schedule in LIMS.</li>\n<li>Planning and execution of good laboratory practices and testing using standard lab equipment (incubator, Endosafe LAL Testing, refrigerator/freezer, stirrer, microscope, PH meter, Autoclave, particle analyzer, depyrogenation oven), able to operate independently in a laboratory environment</li>\n<li>Providing Water, Air and Surface testing support in Cleanroom and on production floor, collect samples, control, keep traceable and prepare for testing, follow testing schedule.</li>\n<li>Responsibility of testing to include the following:</li>\n<li>Limulus Amebocyte Lysate for bacterial endotoxins in Manufacturing Water System</li>\n<li>Surface Bacterial and Fungal Testing in the Controlled Environmental Area. Air Bacterial and Fungal Testing in the Controlled Environmental Area.</li>\n<li>Heterotrophic Plate Count for Manufacturing Water System</li>\n<li>TOC monitoring for the Manufacturing Water System</li>\n<li>Set-up and test execution in support of verification activities, prepare documentation for testing, follow established procedure and complete testing</li>\n<li>Reviewing product cleanliness test results and monitor and trend the key input/output results</li>\n<li>Review and document test results, verify for the correctness and follow GDP (Good Documentation Practices)/ and GLP (Good Laboratory Practices)</li>\n<li>Monitor and control Lab access, environment, and supply</li>\n<li>Ensure that the lab complies with all environmental health and safety requirements (EHS)</li>\n<li>Perform Equipment Qualification and Test Method Validation activities</li>\n<li>Assists in leading regulatory and third party audits including FDA.</li>\n<li>Serves as Quality Manager delegate.</li>\n<li>Serves a back-up for SQE and performs supplier audits.</li>\n<li>Knowledge of Ethylene Oxide, Gamma, and Steam sterilization processes, including implementation of validation protocols.</li>\n<li>Uses knowledge of product requirements to confidently assess corporate objectives, regulatory requirements, and cost objectives while maintaining quality goals.</li>\n<li>Demonstrated planning and project management skills. Solid presentation skills that include summarizing and communicating with customers, suppliers, and management.</li>\n<li>Conduct site training for microbiology, gowning, cleaning, and raw material handling.</li>\n<li>Lead investigations surrounding environmental non-conformances: water, viable and non-viable air testing, differential pressure, bioburden, and dose audit excursions with effective corrective and preventive actions.</li>\n<li>Write and revise SOP's, test methods, cleaning studies and other quality documents.</li>\n<li>Evaluate and interpret analytical data associated with product release, stability reports, laboratory investigations and manufacturing investigations to ensure cGMP compliance prior to final product release.</li>\n<li>Supports team with assessments of new products or changes to existing products.</li>\n<li>Responsible for accuracy and integrity of documentation generated, as well as compliance with cGMP's and Quality Control guidelines issued by FDA and other applicable agencies.</li>\n<li>Other duties as assigned.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>Bachelor of Science Degree in Technical major such as Microbiology, Biochemistry, Biomedical Engineering</li>\n<li>4+ years applied experience in sterilization, 2+ if Master degree</li>\n<li>3+ years Device and/or Pharmaceutical QA/QC/Validation experience, 2+ if Master degree</li>\n<li>Sterilization subject matter expertise</li>\n<li>Thorough knowledge of fundamental microbiology principles, methods and procedures, including knowledge of bacteria morphology and staining, aseptic technique specifically as they relate to sterilization methods.</li>\n<li>Expertise in clean room requirements and gowning requirements</li>\n<li>Ability to multi-task, Skilled in planning, organizing, coordinating projects and working independently.</li>\n<li>Ability to write procedures and work instructions</li>\n<li>Ability to read and interpret documents related to medical device sterilization and cleanrooms Including:</li>\n</ul>\n\nInternational standards, regulations, technical procedures, journals, regulatory publications. Familiarity with FDA regulations.\n\n\n<ul>\n<li>Working knowledge of MS Word, Excel, PowerPoint, MS Outlook, Project</li>\n<li>Expertise in cGMP's and quality systems as related to aseptically manufactured and terminally sterilized medical devices.</li>\n<li>Knowledge in compendial (AAMI, USP, ISO) methodologies and techniques.</li>\n<li>Environmental Monitoring (EM) subject matter expertise.</li>\n<li>Master of Science degree is preferred especially in Microbiology or Biomedical Engineering.</li>\n</ul>\n\nCardinal Health is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status.<br><br>SDL2017"}