{"job title": "Senior Information Scientist", "company": "CTG", "city state": "– Whippany, NJ", "rating": "3.1", "job description": "Title: Senior Information Scientist\n<br><br>\nLocation: US-NJ-Whippany\n<br><br>\nJob Number: 18208683\n<br><br>\nCTG's premier global client in Whippany, NJ, has an assignment for a Senior Information Scientist.\n<br><br>\n<strong>Major responsibilities of this position are:</strong>\n\n\n<ul>\n<li>Retrieve and analyze high quality data from commercial medical, science and business online and web-based databases for a diverse internal customer base as well as the client?s legal department with unique and complex information requirements</li>\n<li>Provide critical information with a direct influence on the client?s R&amp;D business decisions</li>\n<li>Handle confidential information requests within strict timelines and interact with key decision makers and upper management in local and global groups</li>\n<li>Identify, evaluate, and implement new information sources, databases, applications and techniques with focus on text and data mining for the client?s project leaders and management</li>\n<li>Analyze site information training needs and direct the development and implementation of all end-user training programs needed to teach users how to search a variety of complex desktop electronic resources; design and prepare all instructional materials for end-users</li>\n<li>Manage end-user electronic database services, new database product trials and product implementation library information systems collection management services and proprietary information services</li>\n<li>Partner with vendors/suppliers to customize solutions and programs for database access and use in computer network environment</li>\n<li>Serve as information management consultant to departments seeking solutions for optimum ways of monitoring scientific literature, real-time news, and for determining best database sources to meet their critical information needs</li>\n<li>Monitor current developments in information science and technology and/or other subject specialties and pursue a program of personal/professional development to improve skills in these areas</li>\n<li>Develop strong partnerships with internal customers to ensure an understanding of their business goals and scientific objectives</li>\n<li>Determine how published and proprietary information projects relate to client's vision</li>\n<li>Participate in and take senior role in site and international cross-functional teams</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>Bachelor's degree in biomedical life sciences (Pharmacology/Biology/Medicine) with a minimum 7-10 years of professional information analysis experience using advanced analysis including text mining databases and analysis vocabularies; or Master's degree in library/information science or biomedical life sciences with a minimum 5-8 years of relevant experience; or PharmD in subject specialty with a minimum 1-3 years recent experience in the field of professional information analysis in life science industry using advanced analysis technologies using databases and controlled vocabularies/thesauri</li>\n<li>Detailed knowledge and understanding of the pharmaceutical industry and pharmaceutical and corporate information services</li>\n<li>In-depth advanced experience searching and evaluating commercial medical, science and/or business online and web-based databases and advanced working knowledge of library systems, acquisitions, and cataloging systems</li>\n<li>Advanced experience writing programs, configuring and designing record formats in automated library systems</li>\n<li>Experience in the field of information analysis using databases and controlled vocabularies</li>\n<li>Excellent analytical/technical knowledge</li>\n<li>High degree of confidentiality, flexibility, initiative, and ability to work under pressure</li>\n<li>Excellent communication, presentation, problem solving, and organizational skills</li>\n<li>Demonstrate supervisory and team-leadership skills</li>\n</ul>\n\nThis position pays on a W2 hourly basis (no C2C or 1099's).\n<br><br>\nAPPLY NOW for resume review by recruiter Pam Gewin!\n<br><br>\nCTG?s Benefits Plan allows you to take part in our savings programs and educational plans. We offer Flexible Spending Accounts, a 401(k) Retirement Plan, and an Employee Stock Purchase plan. Our educational plan comprises access to more than 2,000 web-based technical, professional and business development courses.\n<br><br>\n<strong>Qualifications:</strong>\n<br><br>\nCTG (NASDAQ: CTG) provides industry-specific IT services and solutions that address the business needs and challenges of clients in high-growth industries in North America and Western Europe. CTG also provides strategic staffing services for major technology companies and large corporations. Backed by more than 50 years of experience and proprietary methodologies, CTG has a proven track record of reliably delivering high-value, industry-specific staffing services and solutions to its clients. CTG has operations in North America, Western Europe, and India.\n<br><br>\nCTG's greatest asset is its people, and as such, we are committed to providing employees programs and processes to support their performance, hone their skills, and advance in their careers. This commitment is reflected by CTG being named a Best Places to Work in Healthcare company by Modern Healthcare (2013-2016) in North America, and a Best Workplace in the United Kingdom (2013), Belgium (since 2007), and Luxembourg (since 2011).\n<br><br>\nCTG will consider for employment all qualified applicants including those with criminal histories in a manner consistent with the requirements of all applicable local, state, and federal laws.\n<br><br>\nCTG is an Equal Opportunity/Affirmative Action Employer and strong advocate of workforce diversity. Minority/Female/Sexual Orientation/Gender Identity/Disability/Veteran.\n<br><br>\nJob: Data Analysis / Management"}