{"job title": "Senior Clinical Studies Scientist", "company": "Danaher Corporation", "city state": "– Chaska, MN", "rating": "3.3", "job description": "**Danaher Company Description** <br>Beckman Coulter develops, manufactures and markets products that simplify, automate and innovate complex biomedical testing. Our diagnostic systems, found in hospitals and other critical care settings around the world, produce information used by physicians to diagnose disease, make treatment decisions and monitor patients. Scientists use our life science research instruments to study complex biological problems including causes of disease and potential new therapies or drugs. More than 275,000 Beckman Coulter systems operate in both diagnostics and life sciences laboratories on all seven continents. For 80 years, our products have been making a difference in peoples? lives by improving the productivity of medical professionals and scientists, supplying critical information for improving patient health and reducing the cost of care.<br>Beckman Coulter offers a broad array of comprehensive, competitive benefit programs that add value to associates' and their families' lives. Whether it's a health care program or paid time off, our programs contribute to life beyond the job. Check out our benefits. We think you'll like what you see.<br>If you believe your education and experience are in line with the position description and qualifications referred to above, and are motivated, energetic, and looking for a new and exciting opportunity, please submit your resume online at the URL below or atwww.beckmancoulter.com.<br>Beckman Coulter is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, national origin, religion, gender, age, marital status, disability, veteran status, sexual orientation, gender identity, or any other characteristic protected by law.<br> <br> <br>**Description** <br>Reporting to the Sr. Manager of Clinical Affairs for Chemistry &amp; Immunoassay businesses at Beckman Coulter, the Senior Clinical Study Scientist is responsible for the execution of external clinical study deliverables following GCP, FDA and OUS requirements. The ideal candidate is experienced in the field of in vitro diagnostics with good understanding of disease states and understands the laboratory environment as well as the basic product development process. <br><br>Position Description: <br>Responsibilities include, but are not limited to:<br>?Works under the general guidance of Staff Clinical Scientist or assigned Clinical Study lead for the project to prepare deliverables for the external validation activities for one or more assigned projects.<br>?Participates in the key phases of the external clinical study, including: planning, execution, analysis &amp; close-out. This includes drafting the many necessary documents for each phase.<br>?Planning phase activities may include literature search and product evidence strategy plan development, as well as study site qualification visits and reports.<br>?Supports final study site selection, contract process and site initiation visits; participates in investigators meetings and other training of site personnel on the clinical study protocol, database, and investigator responsibilities.<br>?Ensures study site readiness, ships materials and investigational devices as needed, tracks device accountability, and collaborates in the procurement of samples, as needed.<br>?Executes a clinical study monitoring plan, with interim and risk-based monitoring visits to verify site compliance to the study protocol and applicable regulations. <br>?Escalates protocol deviations and site compliance issues to the Clinical Staff Scientist or study lead, in accordance with clinical risk management and CAPA procedures.<br>?Reviews data and supports the database development and maintenance with selected database vendor representatives. <br>?Facilitates data analysis by assigned study biostatistician. Escalates and addresses any issues with data integrity. <br>?Prepares data summaries, reports and presentations for design reviews. Works with Staff Clinical Scientist &amp; Regulatory Affairs to ensure data outputs and templates are adequate for submission.<br>?Supports preparation of manuscripts, technical articles based on clinical trials and external studies.<br>?May be asked to perform other clinical responsibilities as directed by the project or functional leader of Clinical Affairs.<br> <br>Supervisory Responsibilities: <br>This is primarily an individual contributor position within Clinical Affairs, with potential need to provide work direction to less experienced team members.<br> <br> <br>**Qualification** <br>?Bachelor?s degree with 3-5 years? experience related to in vitro diagnostics, advanced degree a plus.<br>?Experience with clinical study management and monitoring for clinical diagnostics, medical devices or pharmaceutical products in a regulated environment.<br>?Functional knowledge of Good Clinical Practice, certification a plus, and familiar with US and OUS requirements for design control and clinical study management.<br>?Experience working with data management tools and understanding of databases and general statistical concepts.<br>?Willing and able to develop appropriate internal or external technical expertise required and coordinate efforts to resolve technical issues that may arise during clinical trials.<br>?Ability to work in a team environment, with the ability to relate to both highly educated and unskilled team members.<br>?Ability to handle and resolve conflicts and work under stressful conditions and in an environment of changing priorities<br>?Must be detail-oriented; demonstrate excellent verbal/written communication and interpersonal skills<br>?Able to travel up to 30% of the time, depending on business need<br> <br>Education and Experience: <br>Bachelor of Science (B.S.), Master of Science (M.S.) or Doctor of Philosophy (Ph.D.). in scientific or related field and a minimum of the following years of industry or relevant experience according to degree:<br>?Bachelor?s Degree 3 years<br>?OR Master?s degree with 2 years<br>?OR Doctoral degree with 1-2 years<br> <br>Language Skills: Must be proficient in writing and communicating in the English language. Chinese language skills a plus.<br> <br>Certifications, Licenses, Registrations: Clinical research certification (such as CCRA, CCRC) is desired.<br> <br> <br>**Danaher Corporation Overview** <br>Danaher is a global science &amp; technology innovator committed to helping our customers solve complex challenges and improve quality of life worldwide. Our world class brands are leaders in some of the most demanding and attractive industries, including life sciences, medical diagnostics, dental, environmental and applied solutions. Our globally diverse team of 67,000 associates is united by a common culture and operating system, the Danaher Business System, which serves as our competitive advantage. We generated $18.3B in revenue last year. We are ranked #162 on the Fortune 500 and our stock has outperformed the S&amp;P 500 by more than 1,200% over 20 years.<br>At Danaher, you can build a career in a way no other company can duplicate. Our brands allow us to offer dynamic careers across multiple industries. We?re innovative, fast-paced, results-oriented, and we win. We need talented people to keep winning. Here you?ll learn how DBS is used to shape strategy, focus execution, align our people, and create value for customers and shareholders. Come join our winning team.<br> <br> <br>**Organization:** Beckman Coulter - Diagnostics <br>**Job Function:** Science <br>**Primary Location:** North America-North America-United States-MN-Chaska <br>**Schedule:** Full-time <br>**Req ID:** BEC012210"}