{"job title": "Senior Color Scientist", "company": "Danaher Corporation", "city state": "– Tewksbury, MA", "rating": "3.3", "job description": "<ul>\n<li>*Danaher Company Description**</li>\n</ul>\n\nX-Rite is the global leader in color measurement and color management, offering hardware, software and services for measuring, formulating and matching color. The company serves a range of industries, including automotive, paints, plastics, textiles, printing, packaging, photography, graphic design, video, and medical. X-Rite serves customers worldwide from its offices in Europe, Asia and the Americas.\n\n\n<ul>\n<li>*Description**</li>\n</ul>\n\nWe are looking for a SENIOR RESEARCHER / ENGINEER working in the field of COLOR SCIENCE to round out our software team in our Tewksbury, MA office.\n<br><br>\nIn addition to other duties, this position will be primarily responsible for:\n\n\n<ul>\n<li>Develop and write C Algorithms for the Color industry.</li>\n<li>Research, identify, explore and prove feasibility of new technology.</li>\n<li>Develop patent and work with IP lawyers</li>\n<li>Conduct applied and fundamental research on the relationship of color science and provide findings to internal/external customers.</li>\n<li>Adapt and transfer new technology for optimization and commercialization.</li>\n<li>Generate and collaborate creating Patent ideas.</li>\n<li>Develop specifications, estimate project cost and time, release and support applications.</li>\n<li>Work with cross-functional teams to explore new color technology</li>\n<li>Work in an international environment.</li>\n<li>*Qualification**</li>\n<li>A MS/PHD in engineering field</li>\n<li>Strong proficiency in C/C , with thorough knowledge of the standard library, STL containers and algorithms.</li>\n<li>Hands-on experience in the field of color science. (such as color conversion, ICC profiles, formulation, image processing, 3d rendering and good understanding of color processes).</li>\n<li>Strong mathematical and statistics background</li>\n<li>Solid foundation in Object Oriented Programming and Development (i.e polymorphism, inheritance, ?).</li>\n<li>Strong understanding of Design Patterns.</li>\n<li>Advanced software engineering concepts. (Threading, Multiprocessing, Advanced Data Structures).</li>\n<li>Comfortable with Matlab/Mathematica.</li>\n<li>Comfortable with the following Principals: Optics, Statistics, GPU, linear algebra.</li>\n<li>Solid understanding of Agile methodology such as Scrum. Certified Scrum Master is a plus.</li>\n<li>Familiarity with Unit testing and continuous integration.</li>\n<li>Capable to work in a team</li>\n<li>Great learning capabilities and problem solving skills</li>\n<li>Active participation with ICC is a plus</li>\n<li>Fast learner with the ability to learn and adapt to new technology</li>\n<li>Good communication skills</li>\n<li>Ability to perform the above mentioned job functions</li>\n<li>*Danaher Corporation Overview**</li>\n</ul>\n\nDanaher is a global science &amp; technology innovator committed to helping our customers solve complex challenges and improve quality of life worldwide. Our world class brands are leaders in some of the most demanding and attractive industries, including life sciences, medical diagnostics, dental, environmental and applied solutions. Our globally diverse team of 67,000 associates is united by a common culture and operating system, the Danaher Business System, which serves as our competitive advantage. We generated $18.3B in revenue last year. We are ranked #162 on the Fortune 500 and our stock has outperformed the S&amp;P 500 by more than 1,200% over 20 years.\n<br>\nAt Danaher, you can build a career in a way no other company can duplicate. Our brands allow us to offer dynamic careers across multiple industries. We?re innovative, fast-paced, results-oriented, and we win. We need talented people to keep winning. Here you?ll learn how DBS is used to shape strategy, focus execution, align our people, and create value for customers and shareholders. Come join our winning team.\n\n\n<ul>\n<li>*Organization:** X-Rite</li>\n<li>*Job Function:** Engineering</li>\n<li>*Primary Location:** North America-North America-United States-MA-Tewksbury</li>\n<li>*Schedule:** Full-time</li>\n<li>*Req ID:** X-R000925</li>\n</ul>"}