{"job title": "Systems Integration Scientist I", "company": "Danaher Corporation", "city state": "– Chaska, MN", "rating": "3.3", "job description": "**Danaher Company Description** <br>At Beckman Coulter, we are dedicated to advancing and optimizing the laboratory. For more than 80 years, we have been a trusted partner for laboratory professionals, helping to advance scientific research and patient care. We do challenging work on a global scale, and are invested in growing our associates? careers. We embrace continuous improvement, and are passionate about moving science and healthcare forward.<br><br>We have a vital role at Beckman Coulter: our focus on innovation, reliability and efficiency has led us to become the partner of choice for clinical, research and industrial customers all over the world.<br><br>Beckman Coulter is a Danaher company, operating in two industries: Diagnostics and Life Sciences. <br><br>Beckman Coulter is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, national origin, religion, gender, age, marital status, disability, veteran status, sexual orientation, gender identity, or any other characteristic protected by law.<br><br>All employment offers are contingent upon successful completion of our pre-employment drug screening and background/criminal check.<br> <br>Be sure to follow Beckman Coulter on LinkedIn!<br> <br> <br>**Description** <br>This position is for a systems integration scientist to work on a line of immunochemistry analyzers used in medical testing. In this role the individual will be responsible for integration of new hardware and software designs with existing chemistry to meet established performance expectations, and/or conducting investigations to determine how existing hardware/software designs should be modified to meet new performance requirements, or to be restored to previously acceptable performance levels.<br> * Use knowledge and skills to assist in creation of design requirements, characterization studies, risk assessments, verification or validation plans in order to achieve best in class products.<br> * Apply knowledge of assay performance drivers to instrument system design and characterization to assist the team in ensuring optimal performance.<br> * Use statistical understanding to develop sound test plans with robust acceptance criteria for verifying and validating component, subsystem and system level designs.<br> * Collect appropriate data to define, analyze, identify and correct system failures.<br> * Perform both empirical and theoretical analysis, interpret experimental data to formulate conclusions<br> * Interact with Quality and Regulatory organizations to ensure new designs and design changes meet or exceed customer expectations for quality, and are compliant with federal and international requirements<br> * Formulate models to predict, analyze and optimize system behaviors as environmental conditions, or other system components interact to influence results, using modeling tools and simulations.<br> * Track and communicate project status, develop project schedules<br> * Participate on cross-functional teams<br> <br> <br>**Qualification** <br> * Bachelor?s degree in field with 0-2 years of experience<br> * Biotech industry experience preferred<br> <br> <br>**Danaher Corporation Overview** <br>Danaher is a global science &amp; technology innovator committed to helping our customers solve complex challenges and improve quality of life worldwide. Our world class brands are leaders in some of the most demanding and attractive industries, including life sciences, medical diagnostics, dental, environmental and applied solutions. Our globally diverse team of 67,000 associates is united by a common culture and operating system, the Danaher Business System, which serves as our competitive advantage. We generated $18.3B in revenue last year. We are ranked #162 on the Fortune 500 and our stock has outperformed the S&amp;P 500 by more than 1,200% over 20 years.<br>At Danaher, you can build a career in a way no other company can duplicate. Our brands allow us to offer dynamic careers across multiple industries. We?re innovative, fast-paced, results-oriented, and we win. We need talented people to keep winning. Here you?ll learn how DBS is used to shape strategy, focus execution, align our people, and create value for customers and shareholders. Come join our winning team.<br> <br> <br>**Organization:** Beckman Coulter - Diagnostics <br>**Job Function:** Science <br>**Primary Location:** North America-North America-United States-MN-Chaska <br>**Schedule:** Full-time <br>**Req ID:** BEC012104"}