{"job title": "Senior Scientist - Clinical", "company": "Estee Lauder Companies", "city state": "– Melville, New York", "rating": "3.5", "job description": "<strong><br><br>Description</strong><br><br>The primary purpose of this position is the expansion of our Clinical Innovation Research group with the appropriate skills for the development of new breakthrough measurement methods for diagnosis of skin concerns and evaluation of treatment performance. This position will include various research-related activities around imaging and clinical bio-instrumental measurements, focusing on research, development and evaluation of first-of-kind algorithms, prototypes and protocols for extracting information that can help make better and informed decision on treatment options. Responsibilities will include management of clinical projects (product testing) through clinical studies of varying degrees of complexity from initial set-up to reporting; timely completion of testing for all study time-points, analysis and evaluation of data; and, creation of final reports•Conduct Proof-of-Concept internal and external clinical research on human volunteers to Research relevant biological, physiological and physical properties of the skin and to demonstrate the in vivo efficacy of cosmetic ingredients or/and formulations•Collaborate with R&amp;D Technology Innovation groups in translational research for the evaluation of their new technologies •Help develop novel new methods that can provide new insights and differentiation in the marketplace through new claims, demos and visualsThe ideal candidate is an individual who performs productively in a fast-paced work environment, works well both within a focused team environment as well as independently, communicates well, and has a strong entrepreneurial attitude. Independence of action and accountability (40%): support CIR efforts by having full responsibility over specific projects: from contributing to the protocol set up, to performing the study (with assistance from peers if needed), to analyzing and reporting the data.Problem solving (60%): apply analytical skills to identify the appropriate methods to use to substantiate specific claims and to identify trends in the data, or alternative analyses that could lead to innovative approaches to claim support with demos and visuals.\n<br><br>\n<strong><br><br>Qualifications</strong><br><br>Graduate degree in science/engineering in a field related to physics, biomechanical or mechanical engineering, material science or skin imaging research. 3-5 years of experienceKnowledge of Optical skin imaging modalities and computing in MatLab, preferably working with image processing, signal processing, statistics and data/image acquisition toolboxes, and interfacing with C++ code. Knowledge of other imaging packages (ImagePro Plus, Phython, etc.) is a plus. Demonstrates a methodical approach and ability to thrive in an environment of innovation inadvanced image analysis techniques and applications, and prototype method/instrument development.Ability to deliver results in short time frames and in accordance with deadlines. Ability to function effectively as part of a team, while also being able to work independently.Basic understanding of statistical analysisExcellent analytical, organizational, and communication skillsWillingness to travel (20%)We are an equal opportunity employer. Minorities, women, veterans, and individuals with disabilities are encouraged to apply."}