{"job title": "Environmental Engineer, Geologist or Scientist", "company": "GHD, Inc", "city state": "– Oklahoma City, Oklahoma", "rating": "3.5", "job description": "With more than 8500 people across five continents and the Pacific region, GHD is one of the worlds leading engineering, environmental and construction services companies. Committed to the success of our clients and the communities in which we operate, we have an ongoing requirement for high caliber professionals to join our connected global network. We are seeking a talented <strong> Environmental Engineer, Geologist or Scientist</strong>  for our environmental services team in <strong> Oklahoma City, OK</strong> . At GHD, we offer comprehensive engineering, environmental, geotechnical, engineering design, construction, forensic engineering and litigation support services. This is an opportunity to leverage your local knowledge and be involved in challenging projects that will offer an opportunity to provide technical solutions. You will be involved with field observation, contractor supervision, and testing. You will plan and implement field health and safety protocols, perform field analysis, inspections and assessments, data analysis, environmental technical reporting, and assist in more complex tasks, as required. We are seeking someone who is enthusiastic about the environmental consulting industry. We offer a professional, friendly and collaborative work environment predicated on our core values of Safety, Teamwork, Respect and Integrity. We also provide an active social club and opportunity for professional development through the GHD Business School. <strong> The successful candidate will be interested in p</strong> <strong> erforming a wide variety of duties for soil and groundwater remediation projects in Oklahoma to include:</strong>  <li> Conduct environmental monitoring at remediation sites (environmental inspection and sampling).</li>  <li> Assist with environmental compliance tasks including, air emissions calculations, permit applications, regulatory applicability determinations, and EPCRA reporting.</li>  <li> Understand and apply federal, state, and local environmental requirements.</li>  <li> Prepare Spill Prevention, Control, and Countermeasure (SPCC) Plans, and Stormwater Pollution Prevention Plans (SWPPPs).</li>  <li> Management, investigation, assessment, remediation and monitoring of environmental projects</li>  <li> Manage and coordinate emergency response field efforts</li>  <li> Support senior staff on a variety of air, soil, surface water, groundwater, emergency response, and compliance projects</li>  <li> Plan and implement environmental field work such as soil sampling, supervision of monitoring well installation, groundwater monitoring and due diligence assessments</li>  <li> Prepare routine correspondence, data reports, standardized documents and work plans for internal and client review</li>  <li> Oversight of contractors and field staff</li>  <li> Coordinate multiple projects and interface with clients and government agencies</li> <strong> The ideal candidate will have the following:</strong> <li> B.S. and/or M.S. degree in Civil or Environmental Engineering, Environmental Geology or Environmental Science</li>  <li> PE desired</li>  <li> 5 - 10 years of previous environmental experience including the management, investigation, remediation and monitoring of environmental projects</li>  <li> Knowledge of environmental regulations for Oklahoma</li>  <li> Willing and able to travel to job sites</li>  <li> Sampling, permitting and compliance experience</li>  <li> Excellent verbal and written communication skills</li>  <li> Working knowledge of Microsoft Office programs</li>  <li> Current OSHA 40 hour HAZWOPER certification is a plus</li> As a multicultural organization, we encourage individual achievement and recognize the strength of a diverse workforce. GHD is an equal opportunity employer. We provide equal employment opportunities to all qualified employees and applicants without regard to race, creed, religion, national origin, citizenship, color, sex, sexual orientation, gender identity, age, disability, marital status or veteran status."}