{"job title": "Research Scientist III", "company": "Integrated DNA Technologies", "city state": "– US-IA-Coralville", "rating": "3.6", "job description": "<div><div>\n<div>The Research Scientist III, independently conducts bench scientific experimentation that advances the basic science of nucleic acids and nucleic acid biochemistry and assists with development and characterization of new IDT genomics products in NGS, qPCR and CRISPR. This position is involved in major customer support and R&amp;D collaboration activities as well.</div>\n</div>\n</div>\n\n<br>Responsibilities<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li>Applies extensive scientific knowledge with broad laboratory skills to execute complex bench experiments using variety of molecular biology, cell biology, biochemical and general laboratory techniques as directed.</li><li>Plans experimental details required for execution of assigned work, with little oversight.</li><li>Analyzes raw data, reports results and plans the next steps.</li><li>Organizes and manages moderately complex projects.</li><li>Utilizes mathematical, graphical, imaging, nucleic acid analysis and other software aids as needed.</li><li>Operates and maintains laboratory equipment.</li><li>Maintains accurate and detailed records of experimental work.</li><li>Prepares technical reports for internal use; creates protocols or manuals for public display or distribution.</li><li>Assists in filing invention disclosures, writing patent applications and manuscripts for publication.</li><li>Interacts with and assists other members of the R&amp;D team as needed to meet research objectives.</li><li>Oversees activities and assists with training of more junior research personnel as directed.</li><li>Interacts frequently with other internal departments and IDT customers to assist with customer service/technical support and helps manage collaborative research projects as directed.</li><li>Presents experimental results, data analysis or prior art evaluations at group meetings as directed.</li><li>Participates in scientific collaborations for new technology/product development.</li><li>Demonstrates behavior consistent with the Integrated DNA Technologies Core Values.</li><li>Participates in the maintenance of laboratory cleanliness including but not limited to washing and storage of glass/plastic ware and autoclaving waste, organization of reagents and freezers, etc.</li><li>Represents IDT at scientific conference and trade shows; prepares and presents data-oriented posters (involving domestic or international travel).</li><li>Uses radioactive materials and autoradiography, on occasion, during the course of experimental work.</li><li>Performs other duties as assigned.</li></ul></div>\n</div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div><strong>Education:</strong>\n<ul>\n<li>Bachelor’s degree (in Biology, Genetics, Chemistry or a related life sciences field) with six or more years relevant lab experience required</li><li>Master’s degree (in Biology, Genetics, Chemistry or a related life sciences field) with four or more years relevant lab experience preferred</li><li>PhD degree (in Biology, Genetics, Chemistry or a related life sciences field) with one or more years relevant lab experience preferred</li>\n</ul>\n<strong>Professional Experience:</strong>\n<ul>\n<li>Proficiency in a variety of PC software programs with strong working knowledge of Microsoft Office required.</li><li>Previous experience with DNA analysis/genomics applications in NGS, qPCR or CRISPR required.</li><li>Previous experience with public speaking preferred.</li><li>Previous experience with publishing scientific papers in peer-reviewed journals preferred.</li><li>Extensive knowledge of IDT products and product lines preferred.</li>\n</ul>\n<strong>Other Job Qualifications:</strong>\n<ul>\n<li>Ability to train others in basic laboratory techniques and equipment operation.</li><li>Strong organizational skills and attention to detail.</li><li>Ability to multitask and maintain several projects at one time.</li><li>Good verbal and written communication skills.</li><li>Ability to communicate with peers and all levels of management.</li><li>Ability to perform a variety of duties, often changing from one task to another without loss of efficiency or composure.</li><li>Ability to maintain both a high standard of courtesy and cooperation in dealing with co-workers.</li><li>Ability to accept responsibility for the direction, control or planning of an activity.</li><li>Adaptability to situations requiring the precise attainment of set limits, tolerances or standards.</li><li>Ability to perform repetitive work or to perform continuously the same work, according to set procedures sequence or pace.</li>\n</ul>\n<strong>Travel Requirements</strong>\n<ul>\n<li>Occasional travel (up to than 20%) is expected.</li>\n</ul>\nIntegrated DNA Technologies is an equal employment and affirmative action employer. Minorities, women, veterans and individuals with disabilities are encouraged to apply.</div>\n</div>\n</div>\n<br>"}