{"job title": "Senior Staff Research Scientist - RAPID", "company": "KLA-Tencor", "city state": "– Milpitas, CA", "rating": "3.7", "job description": "<strong>Company Overview</strong>\n<br><br>\nCalling the adventurers ready to join a company that's pushing the limits of nanotechnology to keep the digital revolution rolling. At KLA-Tencor, we're making technology advancements that are bigger—and tinier—than the world has ever seen.\n<br><br>\nWho are we? We research, develop, and manufacture the world's most advanced inspection and measurement equipment for the semiconductor and nanoelectronics industries. We enable the digital age by pushing the boundaries of technology, creating tools capable of finding defects smaller than a wavelength of visible light. We create smarter processes so that technology leaders can manufacture high-performance chips—the kind in that phone in your pocket, the tablet on your desk and nearly every electronic device you own—faster and better. We're passionate about creating solutions that drive progress and help people do what wouldn't be possible without us. The future is calling. Will you answer?\n<br><br>\n<strong>Group/Division</strong>\n<br><br>\nThe RAPID division is the world leading provider of reticle inspection solutions for the semiconductor industry. The company provides inspection solutions to both the mask shops and the semiconductor fabs to ensure that lithography yields are consistently high thus enabling cost-effective manufacturing.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n\n\t\n<li>\n Conduct feasibility investigations to provide valuable guidance for KLA-Tencor's roadmap in optical reticle inspection systems.</li>\n<li>\n Work on experimental designs and experimental benches to characterize environments and understand the optical effects of DUV, VUV materials interaction and effects on contamination and induced damage as it relates to the optical system performance.</li> \n\n\n<li>\n Measure efficacy of different cleaning techniques for the mitigation and cleaning of carbon deposition.</li>\n<li>\n Design experiments and run experimental trials that involve high end optical data collection or other physical measurements.</li> \n\n\n<li>\n Evaluate and recommend preventive methods and have the ability to develop individual high vacuum benches and testing apparatus.</li> \n\n\n<li>\n Acquire, analyze and present data and provide recommendations, as well as contribute to hardware design reviews and work closely with the optics and mechanical engineers to provide guidance.</li> \n</ul>\n<strong>Preferred Qualifications</strong>\n\n<ul>\n\n\t\n<li>\n Ph.D. in a scientific discipline that involves a solid grounding in Physics, Optics, Physical Chemistry or EE is required.</li> \n\n\n<li>\n Proven record of designing highly complex experiments or engineering trials that involve sophisticated data collection and other physical measurements.</li> \n\n\n<li>\n Must have high proficiency in analytical data analysis and demonstrate the ability to extract clear results from large, complex data sets.</li> \n\n\n<li>\n Excellent communication and presentation skills are required.</li>\n<li>\n Other desired skills:\n\n\n<ul>\n\n \n<li>\n Vacuum expertise</li>\n<li>\n Surface measurement and analysis methods (XPS, ellipsometry, AFM, SEM, EDX, TPD)</li>\n<li>\n Outgassing experiments and familiar with RGA and GC/MS analysis.</li> \n</ul>\n\n </li>\n</ul>\n<strong>Minimum Qualifications</strong>\n\n<ul>\n\n\t\n<li>\n Doctorate (Academic) with at least 5 years of experience OR</li>\n<li>\n Master's Level Degree with at least 6 years of experience OR</li>\n<li>\n Bachelor's Level Degree with at least 7 years of experience</li>\n</ul>\n<strong>Equal Employment Opportunity</strong>\n<br><br>\nKLA-Tencor is an Equal Opportunity Employer. Applicants will be considered for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristics protected by applicable law."}