{"job title": "Crop Scientist", "company": "Koch Biological Solutions, LLC (dba Mendel Biological Solutions, LLC)", "city state": "– Hayward, CA", "rating": "NA", "job description": "Who are we? <u>Watch to find out!</u><br><br>In a world with a growing population and diminishing resources, efficient food production is critically important. Koch Biological Solutions, LLC is an emerging leader in delivering targeted, science-driven biological products that improve crop productivity. To this end, our team is focused on developing live microbial and biologically-derived chemistries that improve plant performance at every stage of growth. The scientifically diverse research group, based in Hayward, CA, is proud of our products and our rich pipeline of new technologies.\n<br><br>\nKoch Biological Solutions is recruiting an accomplished <strong>Crop Scientist</strong> to unlock the full potential of the product candidates in our biostimulant and crop protection research and development program. The Scientist will incorporate crop physiology, biochemistry, and molecular genetics to understand the mode-of-action of promising product candidates that boost crop productivity and protect crops from abiotic and biotic stress.\n<br><br>\nA Day In The Life Typically Includes:\n<ul>\n<li>Serving as a subject matter expert and advisor regarding crop physiology, molecular genetics, and other aspects of plant biology that pertains to the vigor and productivity of crop plants.</li>\n<li>Using public literature, transcriptomics, and other experimental results to define R&amp;D objectives for individual product candidates.</li>\n<li>Collaborating with the Biostatistics group to design experiments that produce actionable results.</li> \n\n<li>Establishing robust plant care protocols for target crops (including maize) in the greenhouse and in suitable growth chambers.</li>\n<li>Working with LI-COR instruments and other systems to interrogate the physiological response to treatments with product candidates.</li>\n<li>Mentoring Research Assistants</li>\n<li>Documenting and communicating experimental results in meetings, reports, and patent applications.</li>\n</ul>\nWhat You Will Need:\n<br><br>\nBasic Qualifications:\n<ul>\n<li>Experience in implementing research programs that illuminate the complex interplay between plant physiology, plant productivity and the growth environment.</li>\n<li>Excellent communication skills and a demonstrated ability to establish and maintain effective collaborations.</li>\n<li>Published results with experiments including crop plants such as maize, soy, wheat or cotton.</li>\n<li>3+ years of experience with mentoring or supervising others in a research setting</li>\n<li>A Ph.D. in plant physiology, plant ecophysiology, plant genetics, or related fields.</li>\n</ul>\nWhat Will Put You Ahead?\n<br><br>\nPreferred Qualifications:\n<ul>\n<li>Publication history with crop productivity, photosynthesis, or stress tolerance.</li>\n<li>Experience managing maize or other crop plants in a controlled growth environment.</li>\n<li>Demonstrated research excellence with LI-COR instruments or equivalent gas-exchange systems.</li>\n<li>Experience successfully utilizing omics level data to guide the generation of testable hypotheses.</li>\n</ul>\nWant to learn more about <u>KAES?</u>\n<br><br>\n<strong>This role is not eligible for visa sponsorship.</strong><br><br>Salary and benefits commensurate with experience.\n<br>\nWe are an equal opportunity employer. Minority/Female/Disabled/Veteran\n<br>\nExcept where prohibited by state law, all offers of employment are conditioned upon successfully passing a drug test.\n<br><br>\n This employer uses E-Verify. Please visit the following website for additional information: <u>www.kochcareers.com/doc/Everify.pdf</u><br><br>Follow us"}