{"job title": "Data &amp; AI Architect", "company": "Microsoft", "city state": "– Malvern, Pennsylvania", "rating": "4.1", "job description": "<strong>MTC Technical Architect – Data &amp; AI</strong>\n<br><br>\nAre you motivated with solving complex business and technical problems? Are you passionate about the promise of the cloud? Are you excited about the latest trends in data analysis through machine learning and artificial intelligence (AI)? The Microsoft Technology Center (MTC) in Malvern, PA is looking for individuals that can help customers move to agile, cloud-based solutions that are powered by the Microsoft Azure Cloud platform. As the Data &amp; AI Technical Architect you will be one of the senior technical leaders for Microsoft in the Philadelphia area spanning Data Management, Business Analytics and Artificial Intelligence.\n<br><br>\nYou will win the hearts and minds of Microsoft’s largest and most strategic customers by translating abstract technical data and machine learning concepts to business value, and walking through the solution sales process, from discovery to solution design. As a technical leader you will help influence the future roadmap for the Microsoft Azure Cloud data platform and play an important part in maximizing Microsoft’s long-term vision for empowering every person and organization on the planet to achieve more.\n<br><br>\nYou will work in Microsoft’s state-of-the-art facility where you will showcase the latest Microsoft technologies and lead customers through Strategy Briefings, Architecture Design Sessions, Proof of Concepts, Workshops, and Hackathons.<br><br>Responsibilities<br><br>This position will have the following key responsibilities:\n<ul>\n<li>Articulate the possibilities of the Microsoft Azure Cloud with specific emphasis on the data services including Databases, Analytics, AI + Machine Learning, Internet of Things and Business Intelligence.</li><li>Accelerate the customer’s digital transformation journey using Microsoft Big Data, Advanced Analytics, and Artificial Intelligence (AI) platform.</li><li>Guide business and technical decision makers on creating business value through Architecture Design Sessions, Workshops, and Proof of Concepts.</li> <li>Propose and validate solution architecture and transfer knowledge on best practices to Data Scientists and App Dev Leads.</li><li>Serve as the as the go-to technical expert in the business applications space for the regional sales teams.</li> <li>Deliver speaking engagements evangelizing the Microsoft Cloud Data platform in business and technology conferences.</li><li>Collaborate with the US and worldwide MTC community to drive industry specific scenarios that deliver business value.</li>\n</ul>\n\nQualifications<br><br>This position requires knowledge in the following areas:\n<ul>\n<li>7-10 years’ experience as a solutions architect (or equivalent) in the area of data transformation, warehousing, business intelligence, analytics, analysis, etc.</li><li>Solid background in Machine Learning including Deep learning. One or more of AI domains: Computer vision, NLP, intelligent agents</li><li>Proficiency in architecting data migration scenarios including hybrid and pure cloud data solutions.</li><li>Practical experience in one or more of the following: R or Python, Scikit, Microsoft ML Server, Azure ML, Spark ML, Cognitive Services, Bot Framework, Cognitive Toolkit, Tensorflow, MXNET</li><li>Ability to create actionable business insights and visualization by using large data sets and leveraging Microsoft Business Intelligence capabilities, including in-depth, hands-on knowledge of warehouse architecture, analytics, reporting tools, and SQL operational expertise.</li><li>Experience in using software development skills using both Microsoft tools and Open Source platforms.</li><li>High-level expertise in sophisticated identity, authentication, security, privacy, and compliance requirements, and experience integrating them into cloud and hybrid solutions.</li><li>Experience with cloud, hybrid infrastructures, networking and adjacent technologies, architecture designs, migrations, and industry standards</li><li>Understanding of Data/IoT related Azure services including emerging computing trends such as Machine Learning and Cognitive Services.</li>\n</ul>\nDesired Skills:\n<ul>\n<li>Be a self-starter who takes ownership of opportunities; works independently, manages multiple simultaneous projects, and deals well with ambiguity and last-minute changes.</li><li>Have the ability and passion necessary to maintain technical excellence with emerging technologies, including competitive technologies, while continuing to manage customer opportunities.</li><li>Have a commitment to customer and partner satisfaction, including internal customers, strong listening, communication and presentation skills, and the ability to thrive in a competitive team environment.</li><li>Be able to communicate complex concepts in a simple, business value context.</li>\n</ul>\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n<br><br>\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work."}