{"job title": "Data Infrastructure Engineer", "company": "Pluralsight", "city state": "– South Jordan, Utah", "rating": "4.2", "job description": "Company Description<br><br><strong>About Pluralsight</strong>\n<br><br>\nFounded in 2004 and trusted by Fortune 500 companies, Pluralsight is the technology learning platform organizations and individuals in 150+ countries count on to innovate faster and create progress for the world.\n<br><br>\n<strong>Working at Pluralsight</strong>\n<br><br>\nAt Pluralsight, we believe everyone should have the opportunity to create progress through technology. That everyone should have access to the skills of tomorrow. That technology can\n<br><br>\nmake the world a better place. Through the work we do everyday, we empower the people who power our world.\n<br><br>\nAnd we dont let fear, egos or drama distract us from our mission. Were adults, and we treat each other that way. We have the autonomy to do our jobs, transparency to eliminate office politics and trust each other to do the right thing. We thrive in an environment with creativity around every corner, challenges that keep us on our toes, and peers who inspire us to be the best we can be. We bring different viewpoints, backgrounds and experiences, and united by our mission, we are one.<br><br>Job Description<br><br>How would you like to work on building a data platform that is critical to collecting and making available terabytes of data with real time streaming capabilities? What about creating tools to collect all company data to drive the next product innovation? As a Data Platform team, we are building a platform on top of Kafka, Spark, and Hadoop to work with huge amounts of data each and every day. We are making data available to business departmental analysts and leaders, data analytics engineers, and data scientists across the organization to consume data that will drive the business and customer experience. Our company has a big vision for the future and data is the key to help us achieve it\n<br><br>\nThe perfect applicant for this role has strong programming skills, enjoys getting hands on with big data technology, and believes learning and innovation are keys to success\n<br><br>\n<strong>You will accomplish this by:</strong>\n<ul>\n<li>Developing robust, scalable production systems in Java (or Scala a plus)</li><li>Leveraging Kafka, Spark, and Hadoop to build out a strong data platform</li><li>Building connectors and data sources on Hadoop and relational database systems</li><li>Collecting, processing and cleansing data from a variety of sources by building reusable tools</li><li>Performing rapid prototyping of experimental solutions</li><li>Assisting in data warehousing, data analytics, and data science efforts</li><li>Working with other developers and data engineers to evolve the culture of using data for decision making</li>\n</ul>\n<strong>Qualifications</strong>\n<br><br>\n<strong>Youd be a great fit if your current track record looks like this:</strong>\n<ul>\n<li>Experience building production software in Java (or Scala a plus)</li><li>Experience with data management platforms (e.g. Hadoop, PostgreSQL)</li><li>Experience with OOP languages, such as Java or .Net</li><li>Fluency with data acquisition and quality tools and relational database platforms</li><li>Strong capability to manipulate and analyze complex, high-volume data from a variety of sources</li><li>Effective communication skills with technical team members as well as business partners. Able to distill complex ideas into straightforward language</li><li>Ability to problem solve independently and prioritize work based on anticipated business value</li>\n</ul>\n<strong>And these would be nice to have, as well:</strong>\n<ul>\n<li>Hadoop development experience (e.g. Spark, Hive, Impala, Kafka)</li><li>Expertise in data modeling</li><li>Experience working with data scientists leveraging Hadoop</li><li>Experience solving analytical business problems using data</li>\n</ul>"}