{"job title": "Lead Big Data Engineer", "company": "Swoon", "city state": "– Eden Prairie, Minnesota", "rating": "4.6", "job description": "Our client has an exceptional opportunity for a Senior Data Architect in their Big Data and data science teams.\n<br><br>\nWe have a well-established Data Warehousing and Business Intelligence practice. We are growing in the big data, machine learning, predictive analytics and cognitive computing areas. This role will focus on Big Data while providing support to our Data Warehouse practice and work in partnership with our Business Intelligence architect. As a part of the team, you will be responsible for architecting, designing, and implementing new capabilities across multiple projects with various IT teams in our organization. We are looking for a candidate who seeks big challenges as part of a strong agile team, who has great collaboration skills, and who has an ability to deliver well thought out technology solutions to tough business problems.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n\n\t\n<li>Work with enterprise architects, product architects, product owners, data scientists and engineers to bring big data and data science R&amp;D projects into Production.</li>\n\n<li>Work with the data science delivery lead, product owners and business stakeholders to create the team’s backlog</li>\n\n<li>Create a product architecture roadmap that maintains the integrity of our big data practice and satisfies the business need to fast value delivery</li>\n\n<li>Engage with all teams in a collaborative environment</li>\n\n<li>Architect, design, deliver, test, and troubleshoot complex data implementations</li>\n\n<li>Work with solution architects to improve data strategy, quality and governance</li>\n\n<li>Guide, mentor and influence architectural direction and principles adoption</li>\n\n<li>Work closely with both business and external users to quickly deliver high-quality applications</li>\n\n<li>Work collaboratively with our business leaders to drive adoption of our solutions</li>\n\n</ul>\n<strong>Qualifications:</strong>\n<br><br>\n<strong>Required Qualifications</strong>\n\n<ul>\n\n\t\n<li>2-5 years’ of experience in Big Data, data science, machine learning</li>\n\n<li>5+ years’ experience in Database Administration, Design and Development</li>\n\n<li>5+ years’ experience in Data warehouse/mart experience</li>\n\n<li>Cloud – private/hybrid/public, Big Data (Spark, Cloudera,Hortonworks) ecosystems</li>\n\n<li>Experience in designing big data lake/warehouse for data integration from enterprise wide applications/systems</li>\n\n<li>Experience with various ingestion patterns for large data sets Experience with Open Source and NoSQL technologies (e.g. MongoDB, Redis) at an Enterprise level</li>\n\n<li>Lambda architecture for ingestion including real-time streaming technologies (Kafka, Storm, Spark Streaming)</li>\n\n<li>Knowledge and understanding of ETL design and data processing mechanisms</li>\n\n<li>Knowledge about data replication, data masking, and performance factors, etc.</li>\n\n<li>Ability to formulate solution to handle a new situation presented related to integrating various disparate systems to Warehouse</li>\n\n<li>Ability to combine strong analytical and technical skills with business skills to engage with a wide range of stakeholders</li>\n\n<li>Experience in Agile/Scrum Methodologies</li>\n\n<li>Excellent verbal and written communication skills</li>\n\n</ul>\n<strong>Preferred Qualifications</strong>\n\n<ul>\n\n\t\n<li>Database specific qualifications or certifications</li>\n\n<li>Experience with: C#.NET, Elastic, Angular JS, Node.JS, HTML5, CSS, RESTful Services, Hadoop, Spark, Python, Linux, Hive, Kafka, Redis</li>\n\n</ul>\n<strong>Education</strong>\n\n<ul>\n\n\t\n<li>Undergraduate degree in computer science/software engineering and/or equivalent work experience</li>\n\n</ul>\n<strong>Benefits</strong>\n<br><br>\nWe offer a competitive compensation package and excellent benefits including medical, dental, and vision insurance, prescription drug coverage, paid holidays and vacation, disability insurance, life insurance, 401K with company match, profit sharing, Employee Stock Purchase Plan, and the opportunity to prosper in a growing Fortune 500 company.\n<br><br>\n#ER<br>\n<div>Id: 25600</div>"}