{"job title": "North America Energy Market Data Analyst", "company": "ABB, Inc.", "city state": "– Broomfield, Colorado", "rating": "3.6", "job description": "<strong>Job Description</strong>\n<br><br>\nNorth America Energy Market Data Analyst\n<br><br>\nAre you ready to work with a purpose? At ABB, you can be sure you're helping to create a better world. Our customers operate the largest electrical transmission and distribution networks that keep power and other essential services operating daily around the world. ABB's development teams write the software to make this possible. Come join us in an environment that welcomes innovation and rewards your ability to get the job done while you build highly available, scalable, and reliable features on leading power systems applications.North America Energy Market Data Analysts with the Velocity Suite team acquire experience with key data and concepts within the North American Energy industry. They will also gain exposure to the technologies utilized to maintain a large and complex data warehouse and to support analytical commercial applications. Our database, commercial application and mapping products cover industries including electricity, natural gas, transmission, coal and renewables. Analysts utilize their technical background and problem-solving skills to help us maintain the most accurate energy market database available within the industry. This analyst will work as part of a team to ensure the database has the most complete, accurate and up to date information. Analysts deepen their energy industry experience, while continuously developing new functionality, data or tools for our clients.\n<br>\n<strong>2018-09-07</strong>\n<br><br>\nEntry Level (\n<br>\n<strong>Tasks:</strong>\n<br><br>\nTypical duties/responsibilities may include, but are not limited to, the following:\n\n\n<ul>\n<li>Analyze data loaded via automated processes for errors and anomalies.</li>\n<li>Assist in identifying public data sources for collection and integration into database.</li>\n<li>Assist in testing, maintenance and enhancements of commercial software product prior to release cycle.</li>\n<li>Design and implement automated proofing scripts and reports to ensure data integrity.</li>\n<li>Perform in-depth research of energy infrastructure details and data through a variety of methods including web research, client and industry contacts.</li>\n<li>Able to take responsibility for a set group of data including inception, development, database creation, product creation and quality control.</li>\n<li>Support customers with content and software questions.</li>\n<li>Able to work across departments to facilitate cross product growth and ensure a complete and robust product picture for clients.</li>\n<li>Perform customer training on Velocity Suite software usage and content.</li>\n<li>Provide sales support in all forms including phone calls, marketing material overview, and product demonstrations.</li>\n<li>Bring new perspective and apply techniques to continually drive for automation and process improvements.</li>\n</ul>\n\n<strong>Requirements:</strong>\n<br><br>\n<strong>Basic Qualifications:</strong>\n<br><br>\nBachelor's Degree (Mathematics, Economics, Data Science, Energy, GIS degrees a plus), and up to 2 years of experience\n<br><br>\nAlternatively, this position may be filled at a more senior level for the successful candidate meeting these basic qualifications:\n<br><br>\nBachelor's Degree (Mathematics, Economics, Data Science, Energy, GIS degrees a plus), and 2+ years of experience\n\n\n<ul>\n<li>* Candidates must meet the basic qualifications prior to starting employment **</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Strong computer competency</li>\n<li>Experience with North America Energy Data and/or Industry is ideal</li>\n<li>Team player with strong communication skills</li>\n<li>Self-motivated with ongoing drive for continual development</li>\n<li>Proficient project management skills to fulfill set duties</li>\n<li>Ability to research complicated projects using internet and traditional sources</li>\n<li>Knowledge and experience with market research with ability to work independently</li>\n<li>Ability to exercise independent judgment as to relevance of market research</li>\n<li>Experience with or exposure to SQL, SQR, PL/SQL, Python</li>\n<li>Proficient knowledge of Geographic Information Systems (GIS) including ArcGIS, MapInfo, QGIS, or related open source GIS systems is encouraged.</li>\n<li>Experience with regular expressions, machine learning and/or big data analytics is a plus</li>\n<li>Local candidates preferred - Broomfield, CO</li>\n</ul>\n\nAdditional information\n<br><br>\nEqual Employment Opportunity and Affirmative Action at ABB\n<br><br>\nABB is an Equal Employment Opportunity (EEO) and Affirmative Action Employer encouraging diversity in the workplace.\n<br><br>\nAll qualified applicants will receive consideration for employment without regard to their race, creed, color, ancestry, religion, sex, national origin, citizen status, age, sexual orientation, gender identity, disability, marital status, family medical leave status, or protected veterans status. For more information regarding your (EEO) rights as an applicant, please visit the following websites:\n\n\n<ul>\n<li>***************************************************************</li>\n<li>***************************************** ***********************************************************************************************</li>\n</ul>\n\nAs an Equal Employment Opportunity and Affirmative Action Employer, applicants may request to review the Affirmative Action Plan of a particular ABB facility between the hours of 9:00 A.M. - 5:00 P.M. EST Monday through Friday by contacting an ABB HR Representative at 1-************.\n<br><br>\nProtected veterans and qualified individuals with a disability may request a reasonable accommodation if you are unable or limited in your ability to use or access ABB's career site as a result of your disability. You may request reasonable accommodations by calling an ABB HR Representative at 1-************ or by sending an email to ****************. Resumes and applications will not be accepted in this manner.\n<br><br>\n<strong>Location:</strong>\n<br><br>\nBroomfield, Colorado, USA\n<br><br>\n<strong>Contract type:</strong>\n<br>\nRegular/Permanent\n<br><br>\n<strong>Business unit:</strong>\n<br>\nBusiness Unit Grid Automation\n<br><br>\n<strong>Date posted:</strong>\n<br>\n<strong>2018-08-27</strong>\n<br><br>\n<strong>Job function:</strong>\n<br>\nResearch and Development\n<br><br>\n<strong>Publication ID:</strong>\n<br>\n<strong>US********_E1</strong>\n<br><br>\nABB (ABBN: SIX Swiss Ex) is a pioneering technology leader in power grids, electrification products, industrial automation and robotics and motion, serving customers in utilities, industry and transport &amp; infrastructure globally. Continuing a history of innovation spanning more than 130 years, ABB today is writing the future of industrial digitalization with two clear value propositions: bringing electricity from any power plant to any plug and automating industries from natural resources to finished products. As title partner in ABB Formula E, the fully electric international FIA motorsport class, ABB is pushing the boundaries of e-mobility to contribute to a sustainable future. ABB operates in more than 100 countries with about 147,000 employees. ***********\n<br><br>\nEqual Employment Opportunity and Affirmative Action at ABB Inc.\n<br><br>\nABB Inc. is an Equal Employment Opportunity (EEO) and Affirmative Action Employer encouraging diversity in the workplace.\n<br>\nAll qualified applicants will receive consideration for employment without regard to their sex, gender identity, sexual orientation, race, color, religious creed, national origin, physical or mental disability, protected Veteran status, or any other characteristic protected by law. For more information regarding your (EEO) rights as an applicant, please visit the following websites:\n\n\n<ul>\n<li>***************************************************************</li>\n<li>**********************************************************************************************</li>\n</ul>"}