{"job title": "Color Research Scientist", "company": "Archer Daniels Midland Company", "city state": "– Erlanger, KY", "rating": "3.6", "job description": "For more than a century, the people of Archer Daniels Midland Company (NYSE: ADM) have transformed crops into products that serve the vital needs of a growing world. Today, we're one of the world's largest agricultural processors and food ingredient providers, with approximately 32,000 employees serving customers in more than 160 countries. With a global value chain that includes approximately 500 crop procurement locations, 250 ingredient manufacturing facilities, 38 innovation centers and the world's premier crop transportation network, we connect the harvest to the home, making products for food, animal feed, industrial and energy uses. Learn more at www.adm.com.\n<br><br>\nColor Research Scientist Erlanger, KY\n<br><br>\nADM Nutrition\n<br><br>\nThis is a full time, exempt position\n<br><br>\n<strong>MAIN FUNCTION:</strong>\n<br><br>\nAs a Scientist, this role provides scientific understanding to technical programs that research and create novel, innovative \"natural\" colors that meets the needs of our customers and expands the capabilities of ADM. The candidate will have strong work ethics, scientific curiosity, and ability to work independently.\n<br><br>\n<strong>KEY SKILLS&amp;COMPETENCIES:</strong>\n\n\n<ul>\n<li>Technical Acumen The Individual possesses a scientific understanding of \"natural\" colors, the ability to learn new areas of research on colors, and a sound understanding of experimental design. Fundamental Chemistry and Biochemistry knowledge including that of chemical elements, compounds, reactions and terminology.</li>\n<li>Highly Effective Teamwork Skills - The Individual has ability to work closely within a team, whether regional or global, to achieve productive results. Able to share workload with others. Able to communicate and influence in a friendly yet business appropriate manner. Ability to work in a cross-functional environment.</li>\n<li>Industry Knowledge - Individual has a core knowledge of the target industry including key technologies and appropriate understanding of consumer drivers.</li>\n<li>Project Management Skills With little supervision, the Individual has ability to manage technical programs through direct accountability of success factors to achieve a goal. Routine monitoring, follow-up, corrective action and routine reporting are required.</li>\n<li>Ability to Mentor - The Individual will be capable of assisting in developing others through establishing relationship, identification and encouragement of development areas, and guiding actions that result in an improved behavior or skill.</li>\n<li>Clear Communication - The Individual will be capable of expressing a message to other people clearly and unambiguously, either in written or verbal format.</li>\n<li>May accompany account executives on sales calls as technical support.</li>\n</ul>\n\n<strong>DESCRIPTION OF WORK PERFORMED:</strong>\n\n\n<ul>\n<li>Develop innovative \"natural\" colors for the food industry by assisting in coordinating and conducting longer term research projects.</li>\n<li>Aid in influencing company direction for new technology by identifying areas of needed research on colors and assisting in providing business rationale for delivering targeted opportunities.</li>\n<li>May trouble-shoot any issues regarding formulations/manufacturing procedures, etc. Makes recommendation and implements them based on research.</li>\n<li>Provide support in guiding collaborative, outside research projects.</li>\n<li>May attend customer meetings for joint development opportunities to provide technical expertise.</li>\n<li>Assist in representing ADM in Trade/Scientist meetings and organizations</li>\n<li>Helps protect Intellectual Property by preparing&amp;filing patents in collaboration with team members and Legal Department.</li>\n<li>Demonstrates knowledge of and continues to acquire processing, ingredient and ingredient interaction knowledge.</li>\n<li>Remain current on colors regulations and trends for food&amp;beverage market internationally.</li>\n</ul>"}