{"job title": "RESEARCH SCIENTIST", "company": "Atrium Staffing", "city state": "– Cambridge, Massachusetts", "rating": "3.3", "job description": "<strong>\n<br>\nPosition Overview:</strong> The successful Research Scientist will design, execute and troubleshoot experiments and will be responsible for analyzing and interpreting results. Research work will be focused mainly on in vitro assays with cultured cell lines and primary cells obtained from human donors. They will also be expected to work with in vivo mouse models which involves dosing of experimental compounds and harvesting blood and other tissues. The prospective candidate should be skilled in basic and advanced techniques in molecular and cell biology and ideally possess hands on experience in working with laboratory animals.\n<br>\n<strong>\n<br>\nResponsibilities of the Research Scientist:</strong>\n\n<li>Working in a fast-paced lab environment\n<br><br>\nCulturing of primary CD34+ stem cells through differentiation and characterization</li>\n  <li> Screening and testing experimental small molecule compounds in both primary cells and cultured cell lines for various end points</li> <li> Quantitatively analyzing and communicating results to fellow scientists and non-science members of the company</li> <li> Developing Protocols and Standard Operating Procedures(SOPs) based on the best results</li> <li> Flow cytometry and molecular biological techniques such as mRNA isolation and real time PCR</li> <li> Performing protein assays including ELISA and western blotting</li> <li> Dosing of mouse models with experimental compounds routinely and harvesting of tissues and samples</li> <li> Helping the scientific team develop and achieve goals to meet ambitious deadlines</li>\n<strong> Qualifications for the Research Scientist:</strong>\n\n<li>0-4 years industry experience, but must have research experience from either an internship or independent research project\n<br><br>\nWorking hands on experience in common laboratory in vitro techniques such as cell culture, ELISA, and molecular biology</li>\n  <li> In vivo work experience in rodent handling and drug delivery (IV, IP, SC. IM, Oral) is a must</li> <li> Extensive experience in mouse tissue dissection/collection and processing, and blood collection and subsequent laboratory work in bioanalysis of collected samples using FACS, real time PCR, and other methods</li> <li> Excellent oral and written communication skills</li> <li> The ability to work as part of a cross-functional team</li> <li> Good organizational, interpersonal and communication skills (verbal and written)</li>\n<strong> Education Requirements:</strong>\n<li> BS/MS in Molecular Biology, Cell Biology, or Immunology</li>\n<strong> Benefits: Eligible for Atrium Care Package</strong>"}