{"job title": "Business Intelligence Analyst", "company": "Boeing", "city state": "– Bellevue, Washington", "rating": "3.5", "job description": "Company\n<br>\nThe Boeing Company\n<br><br>\nJob ID\n\n\n<ul>\n<li>*********</li>\n</ul>\n\nDate posted\n<br>\n<strong>08/30/2018</strong>\n<br><br>\nLocation\n<br>\nBellevue Washington United States\n<br><br>\nOther Locations\n<br><br>\nNorth Charleston;South Carolina;United States~Saint Louis;Missouri;United States~\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nBoeing is looking for a Business Intelligence Analyst to join our Information and Analytics team in Bellevue, WA, Saint Louis, MO or North Charleston, SC. Boeing invests more than $23 Billion a year in employees in the form of pay, incentives, benefits and wellbeing programs. At Boeing, Total Compensation is more than a paycheck. It's a market-leading combination of pay, incentives, benefits and well-being programs that can help you through all aspects of life.\n<br>\nWe provide opportunities to work on groundbreaking projects and technology. From commercial airplanes and military fighter jets to satellites and space exploration, Boeing's knowledge of design and manufacturing of all things in the air is unmatchedby anyone. You will be part of an organization that is working to solve the world's most difficult aerospace problems.\n<br><br>\nWe innovate. We imagine the impossible and make it a reality through our integrated One Boeing approach. Our teams in Data Science, Engineering, Human Resources, Procurement, Marketing &amp; Sales, and so many more, work in tandem to give insight that becomes actionable intelligence to improve customer experiences, bring warfighters home safely, and deliver desired outcomes.\n<br><br>\nWe deliver, every day. And have for more than 100 years. Whether through on-time arrivals or completed missions, Boeing delivers outcomes and insights that are making the world a place with limitless possibilities.\n<br><br>\nPosition Responsibilities\n<br><br>\nThe successful candidate will partner in the design of Business Intelligence information models, dashboards, metrics and reports utilizing standard technologies and methodologies that meet business objectives and solutions\n<br>\nSupport one of three primary domains: Commercial and Defense Aftermarket Services; Engineering, Manufacturing, Quality, and Safety; Supply Chain, HR, Finance, and Corporate.\n<br>\nCombine programming, SQL skills, best practices and business expertise to deliver efficient and scalable Business Intelligence solutions to improve business productivity and business outcomes.\n<br>\nPerforms analysis to identify and understand an issue or event. Investigates evident issues through drill-down exploration and descriptive statistics. Boeing is the world's largest aerospace company and leading manufacturer of commercial airplanes and defense, space and security systems. We are bold innovators and dreamers. Join us, and you can build something better for yourself and for our customers and for the world.\n<br><br>\nDivision\n<br><br>\nCIO, Information &amp; Analytics\n<br><br>\nRelocation Assistance Available\n<br><br>\nYes. Available for eligible candidates, if authorized.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nThis position must meet Export Control compliance requirements, therefore a US Person as defined by 22 C.F.R.120.15 is required. US Person includes US Citizen, lawful permanent resident, refugee, or asylee\n<br><br>\nBasic Qualifications (Required Skills and Experience)\n<br><br>\nMinimum 3 year experience of designing Business Intelligence information models, dashboards, metrics and reports utilizing standard technologies and methodologies that meet business objectives.\n<br>\nMinimum 1 year experience in Analysis Algorithms is required.\n<br>\nCoding experience required (SQL, HTML/XML, or JAVA)\n<br>\nBachelor's degree in a computer, engineering or quantitative discipline (e.g., statistics, operations research, bioinformatics, economics, computational biology, computer science, mathematics, physics, electrical engineering, industrial engineering).\n<br>\nDBMS experience required (Oracle, Teradata or SQL Server)\n<br><br>\nDesired Qualifications (Preferred Skills and Experience)\n<br><br>\n3 plus years' experience in reports design and creation\n<br>\n3 plus years' experience in Data Analysis\n<br>\n3 plus years' experience in Data Mining\n<br>\nExcellent oral and written communication skills\n<br>\nPrevious experience with reporting tools and metrics (Cognos, Tableau or R)\n<br>\nExperience with Toad Data Point or Meta Manager\n<br>\nAttention to detail and the ability to learn quickly\n<br>\nAerospace/ or Information Technology industry experience is a plus.\n<br><br>\nTypical Education/Experience\n<br>\nTechnical bachelor's degree and typically 9 or more years' related work experience or a Master's degree with typically 7 or more years' or a PhD degree with typically 4 or more years' related work experience or an equivalent combination of education and experience. A technical degree is defined as any four year degree, or greater, in a mathematic, scientific or information technology field of study.\n<br><br>\nExperience Level\n<br><br>\nIndividual Contributor\n<br><br>\nJob Type\n<br><br>\nStandard\n<br><br>\nTravel\n<br><br>\nYes, 10 % of the Time\n<br><br>\nContingent Upon Program Award\n<br><br>\nNo\n<br><br>\nUnion\n<br><br>\nNo\n<br><br>\nJob Code\n<br><br>\n<strong>BEH6P4</strong>"}