{"job title": "Senior Business Intelligence Analyst at Glens Falls Hospital", "company": "Cerner", "city state": "– United States Glens Falls, New York", "rating": "3.6", "job description": "<strong>Job Description</strong>\n<br>\n <div>The Senior Business Intelligence Analyst collaborates with key internal stakeholders across all organizations to develop and execute client-facing research from methodology, design, data collection, analysis, and closed-loop action planning. You'll have the responsibility for writing and troubleshooting reports, managing multiple projects involving analytics at various points in time and coordinating with associates. The ability to manage time, work collaboratively, be responsive, and visualize quantitative and qualitative findings in PPT are key skill sets.\n<br><br>\nYou will consult with business stakeholders to understand their needs, make recommendations, and manage each client research request from start to finish. In this role you, will be an expert in survey design and be visualizing results and articulating insights to stakeholders. You will analyze complex business problems and issues using data to provide insight to decision makers The Senior Business Intelligence Analyst will serve as the key resource to stakeholders for their client research needs.</div>\n\n<ul>\n</ul>\n\n<strong>Qualifications</strong>\n<br>\n <div><strong>Basic Qualifications</strong></div>\n\n<ul>\n<li><div>Bachelor's Degree, or equivalent relevant work experience</div></li><li><div>At least 2 year of business analytics work experience</div></li>\n</ul>\n\n<div><strong>\n<br>\nPreferred Qualifications</strong></div>\n\n<ul>\n<li><div>Bachelor's Degree in business/ finance, market research, psychology, statistics or math</div></li><li><div>2+ years of Tableau visualization and development experience</div></li><li><div>2+ years of experience, meeting with stakeholders to define report requirements, presenting and interpreting data to executive level</div></li><li><div>2+ years of experience writing SQL queries</div></li><li><div>2+ years of intermediate to expert level Excel skills</div></li>\n</ul>\n\n<div>\n<strong>Basic Qualifications</strong>\n\n<ul>\n<li>Bachelor's Degree, or equivalent relevant work experience</li><li>At least 2 year of business analytics work experience</li>\n</ul>\n\n<strong>Preferred Qualifications</strong>\n\n<ul>\n<li>Bachelor's Degree in business/ finance, market research, psychology, statistics or math</li><li>2+ years of Tableau visualization and development experience</li><li>2+ years of experience, meeting with stakeholders to define report requirements, presenting and interpreting data to executive level</li> <li>2+ years of experience writing SQL queries</li> <li>2+ years of intermediate to expert level Excel skills</li>\n</ul>\n\n<strong>Expectations</strong>\n\n<ul>\n<li>Willing to work additional or irregular hours as needed and allowed by local regulations</li><li>Work in accordance with corporate and organizational security policies and procedures, understand personal role in safeguarding corporate and client assets, and take appropriate action to prevent and report any compromises of security within scope of position</li><li>Perform other responsibilities as assigned</li></ul></div>\n\n<ul>\n<li><div>Willing to work additional or irregular hours as needed and allowed by local regulations</div></li><li><div>Work in accordance with corporate and organizational security policies and procedures, understand personal role in safeguarding corporate and client assets, and take appropriate action to prevent and report any compromises of security within scope of position</div></li><li><div>Perform other responsibilities as assigned</div></li>\n</ul>\nCerner is a place where people are encouraged to innovate with confidence and focus on what is important – people’s health and the care they receive. We are transforming health care by developing tools and technologies that make it more efficient for care providers and patients to navigate the complexity of our health. From single offices to entire countries, Cerner solutions are licensed at more than 25,000 facilities in over 35 countries.\n<br><br>\nCerner’s policy is to provide equal opportunity to all people without regard to race, color, religion, national origin, ancestry, marital status, veteran status, age, disability, pregnancy, genetic information, citizenship status, sex, sexual orientation, gender identity or any other legally protected category. Cerner is proud to be a drug-free workplace.\n<br><br>\nEEO is the Law (English)\n<br>\nE-Verify Participation (English)\n<br>\nRight to Work (English)\n<br><br>\nEEO is the Law (Spanish)\n<br>\nE-Verify Participation (Spanish)\n<br>\nRight to Work (Spanish)"}