{"job title": "Machine Learning Engineer (*Relocation Assistance Available)", "company": "CyberCoders", "city state": "– San Francisco, CA", "rating": "3.8", "job description": "Machine Learning Engineer (*Relocation Assistance Available) <div>\nIf you are a Machine Learning Engineer with experience, please read on!<br><br>If you are interested in joining a cutting edge company that definitely cares about providing a great working environment for its employees, then apply immediately.<br><br>--Your application will be considered incomplete unless the screening questions are answered, and incomplete applications cannot be submitted for further review. Please answer all of the screening questions in detail in order to expedite the process.--\n</div>\n\nWhat You Will Be Doing<div>\n-Be a part of a team that is focused on building data driven systems and machine learning solutions<br>-Use machine learning to solve a wide spectrum of problems across multiple domains such as dynamic pricing, yield management, demand forecasting and recommendation systems<br>-Contribute to ideation, prototyping, design, and production of machine learning algorithms leveraging the latest developments in machine learning, neural networks and computer vision<br>-Get a rare &amp; blue sky opportunity to design, build and scale some of these systems from scratch\n</div>What You Need for this Position<div>\n-3+ years experience writing scalable and performant systems that deliver the output of machine learning models to downstream consumers<br>-Strong fundamentals in algorithms, data structures, statistics, predictive modeling, &amp; distributed systems and the mathematical underpinnings thereof<br>-Experience with AWS technologies (including Redshift, S3, EC2, Lambda) in large-scale data warehousing and machine learning projects<br>-Strong mastery of python and relevant ML libraries<br>-Excellent communication skills with the ability to distill complex issues and analysis<br>-Master's degree or PhD in Computer Science or another highly mathematical discipline\n</div>What's In It for You<div>\n- $130,000-$200,000 Base Salary (DOE)<br>- Unlimited PTO<br>- Medical<br>- Dental<br>- Vision<br>- Employee Discounts\n</div><div>\nSo, if you are a Machine Learning Engineer with experience, please apply today!\n</div> - <p>Applicants must be authorized to work in the U.S.</p><br><br>\n <b>CyberCoders, Inc is proud to be an Equal Opportunity Employer</b>\n <br><br>\n All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n <br><br>\n <b>Your Right to Work</b> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}