{"job title": "Data Analyst", "company": "DentaQuest", "city state": "– Milwaukee, US-WI", "rating": "2.9", "job description": "<strong>JOB SUMMARY:</strong>\n<br><br>\nThe Data Analyst is primarily responsible for the operational execution of data extracts and exchanges with DentaQuest's clients and vendors. This includes loading and processing data files, various operational data maintenance functions, and systemic delivery of files to third parties.\n<br><br>\n<strong>PRIMARY JOB RESPONSIBILITIES:</strong>\n\n<ul>\n<li>Perform routine and ad hoc encounter and claim resubmissions.</li>\n\n\n<ul>\n<li>Use SQL tools to resubmit encounters for clients such as NY, FL, and other markets</li>\n\n<li>Work with BA’s and developers to streamline/automate processes</li>\n</ul>\n\n<li>Run, edit and maintain data extracts, applications, and ad-hoc queries as requested by internal and external customers using SQL, SSIS, Informatica toolset (Powercenter, B2B with MFT)</li>\n\n\n<ul>\n<li>Analyze discrepancies with invoice detail files, provider files, etc.</li>\n\n<li>Re-run TWS or manual jobs to ensure data delivery and compliance</li>\n\n<li>Run, test, deploy, or retire TWS jobs as needed</li>\n\n<li>Ensure scheduled and ad hoc extracts are delivered per schedule</li>\n\n<li>Ensure scheduled EDI and flat files are received per schedule</li>\n\n<li>Onboard inbound and outbound client data to automated file transfer solution</li>\n\n<li>Track inbound/outbound files, errors and discrepancies; identify and report trends.</li>\n</ul>\n\n<li>Analyze data and extract requests and help define technical specifications for efficient development.</li>\n\n\n<ul>\n<li>Requests include custom flat files and a significant focus on healthcare encounters and HIPAA X12 transactions: 837, 999, 277, 835</li>\n\n<li>Support BA’s by reviewing and/or updating data maps, spec docs, etc.</li>\n\n<li>Write/update run docs and other documentation related to deployed extracts</li>\n\n<li>Collaborate on the definition, development, and maintenance of standards and processes.</li>\n</ul>\n\n<li>Facilitate and perform deep dive data analysis and reconciliation with external clients</li>\n\n\n<ul>\n<li>Use SQL tools to develop and automate enrollment reconciliation reporting</li>\n\n<li>Support enrollment error management</li>\n\n<li>Develop a thorough understanding of clients within the assigned region</li></ul>\n\n</ul>\n\n\n<ul>\n\n\n\n<ul>\n<li>Identify and coordinate data changes impacting clients and extracts across multiple business units and departments</li>\n\n<li>Maintain documentation associated with contractual requirements; track operational results to ensure quality metrics are achieved and/or exceeded.</li></ul>\n\n</ul>\n\n\n\n<ul>\n<li>Demonstrate expertise in a variety of IT concepts, practices, and procedures and maintains a general knowledge of company-wide processes and systems (e.g. Windward).</li>\n\n<li>Successfully manage a high volume of projects and tasks with, often with competing priorities.</li>\n\n<li>Ensure regulatory and legal compliance (HIPAA) within the department.</li>\n\n<li>Drive continuous improvement in CDM solutions and processes.</li>\n\n<li>Support DentaQuest’s goals and objectives by working closely with management team to deliver value to the business.</li>\n\n<li>Serve as mentoring resource for other team members.</li>\n\n<li>Other duties as assigned.</li>\n</ul>\n\nRequired Skills<br><br><strong>JOB REQUIREMENTS:</strong>\n<br><br>\nProficiency in the following technical concepts:\n\n<ul>\n<li>2 years experience in business role with operational deliverable responsibilities.</li>\n\n<li>Knowledge of general computer software.</li>\n\n<li>Expert level proficiency in use of advanced features of MS Office.</li>\n\n<li>Relational Database concept knowledge (SQL Server preferred)</li>\n\n<li>Exposure to ETL, reporting concepts, SQL, or SSIS preferred.</li>\n\n<li>Experience with SQL queries.</li>\n\n<li>Good interpersonal skills.</li>\n\n<li>Excellent verbal and written communication skills.</li>\n\n<li>Ability to prioritize and organize multiple tasks with a high attention to detail.</li>\n\n<li>Desired knowledge of dental or medical insurance claims processing including:</li>\n\n\n<ul>\n<li>Hands on experience with HIPAA EDI transaction formats including: 837, 835, 277, 997, 999, 834</li>\n\n<li>Familiarity with appropriate handling of PHI data</li></ul>\n\n\n</ul>\n<br><br>\n<strong>EDUCATION:</strong>\n<br><br>\nBS degree in Business, Computer Science, Engineering, Information Systems or related field (or equivalent<br><br>Required Experience\n<br><br>\nJob Location\n<br>\nMilwaukee, US-WI\n<br>"}