{"job title": "Data Engineer", "company": "Iconma", "city state": "– McLean, Virginia", "rating": "3.4", "job description": "<ul>\n<li>Job Description <strong> Data Engineer</strong></li>\n</ul>\n\nLocation: McLean, VA\n<br>\nDuration: 2 months\n<br><br>\n<strong> Job Requirements</strong>\n\n\n<ul>\n<li>Experience deploying analytics in a cloud environment</li>\n<li>Clean and prepare data for Machine Learning and AI</li>\n<li>Automate frequently used reporting and data analysis workflows</li>\n<li>Assists in the analysis, design, and development of a roadmap and implementation plan based upon a current vs. future state in a cohesive architecture viewpoint</li>\n</ul>\n\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Definition, design, construction, integration, testing, and support of reliable and reusable software solutions, addressing business opportunities.</li>\n<li>Includes systems analysis, creation of specifications, coding, testing, and implementation of application programs and data interfaces.</li>\n<li>Requires a previous domain of experience in applications development.</li>\n<li>Responsible for overall application design, including interfaces with other applications and systems.</li>\n<li>Assures that application designs are consistent with industry best practices application attributes (including scalability, availability, maintainability, and flexibility).</li>\n</ul>\n\n<strong>Skills/Experience:</strong>\n<br>\nBasic Qualification\n\n\n<ul>\n<li>Bachelors or Masters degree in Computer Science, Engineering or related field</li>\n<li>Database programming using SQL Server</li>\n<li>Ability to author and edit VBA/S scripts</li>\n<li>Experience developing reporting solutions using Birst or Tableau</li>\n<li>Experience working with third party data providers</li>\n<li>Minimum of 3-5 years DevOps experience</li>\n</ul>\n\n<strong> Preferred Qualification</strong> \n\n\n<ul>\n<li>Mining and analyzing data sets to extract meaningful trends; producing meaningful and actionable reports</li>\n<li>Demonstrated experience with data migration from legacy systems to new systems/architectures</li>\n<li>Preferably 3-5 years of experience with VB6</li>\n<li>Experience with AWS EC2, AWS Lambda, or Google Cloud</li>\n</ul>"}