{"job title": "Duales Hochschulstudium Wirtschaftsinformatik, Studienrichtung Data Science (Bachelor of Science) ab Oktober 2019 in der Mercedes-Benz Bank AG", "company": "Mercedes-Benz", "city state": "– Fort Worth, Texas", "rating": "3.6", "job description": "<strong> Tasks</strong>\n<br><br>\nDas bieten wir Ihnen in der Theorie:\n<br>\nIn den ersten zwei Studienjahren eignen Sie sich ein breites Wissen in der Informationstechnologie mit den Zusatzfächern Programmierung, Systementwicklung und Projektmanagement an. Hinzu kommen Fächer wie BWL, VWL sowie Recht und Fremdsprachen. Sie fertigen 2-3 Projektarbeiten an, die Sie im Rahmen von Präsentationen an der Dualen Hochschule auch vorstellen. Im letzten Studienjahr steht die Vertiefung Ihres Fachwissens im Vordergrund. Auch hier bilden Informationstechnik, BWL und VWL den Schwerpunkt. Im 5. Praxissemester schreiben Sie Ihre Bachelorarbeit, die zusammen mit den Abschlussprüfungen zum international anerkannten Abschluss \"Bachelor of Science\" führt.\n<br>\nDas bieten wir Ihnen in der Praxis:\n<br>\nDie Themen der 3- bis 4-monatigen Praxiseinsätze im Unternehmen sind auf die zuvor an der Dualen Hochschule vermittelten Inhalte abgestimmt. Einsätze in den jeweiligen Geschäftsbereichen, Produktionswerken, Niederlassungen sowie Produktions- und Vertriebsgesellschaften im In- und Ausland geben Ihnen einen Einblick in unser Unternehmen. Durch aktive Mitarbeit am Tagesgeschäft und in Projektaufgaben lernen Sie erst Informationstechnologische und dann betriebswirtschaftliche Funktionsbereiche kennen. Dazu kommen unternehmensinterne Seminare, die eine Brücke zwischen Theorie und Praxis schlagen. Sie machen sich anhand von Fallstudien, Planspielen und Gruppenübungen mit den inneren Strukturen des Unternehmens vertraut und üben sich in Rhetorik, Präsentation und Projektmanagement. Sie lernen den kompetenten Umgang mit PC-Anwendungsprogrammen und verschiedenen Entwickler-Tools.\n<br><br>\n<strong> Qualifications</strong>\n<br><br>\nDas bieten Sie uns:\n<br>\nSie haben die allgemeine oder fachgebundene Hochschulreife mit einem guten Abschluss in den Fächern Mathematik, Deutsch, Fremdsprachen und gegebenenfalls Informatik. Sie sind interessiert an betriebswirtschaftlichen Themen und begeistern sich vor allem für IT-Themen. Sie können selbstständig und teamorientiert arbeiten. Sie zeigen Engagement, Belastbarkeit und Kreativität. Sie sind mobil.\n<br><br>\n<strong> Additional information</strong>\n<br><br>\nDie Studienrichtung Data Science des Studiengangs Wirtschaftsinformatik hat die Zielsetzung, aus großen Datenmengen (Big Data) Informationen zu generieren und Handlungsempfehlungen für Daimler abzuleiten.\n<br><br>\nDas Studium beginnt mit einem einmonatigen Vorpraktikum, welches Sie bereits in der Mercedes-Benz Bank AG absolvieren werden. Im Anschluss daran folgt das dreijährige Hochschulstudium an der Dualen Hochschule Baden-Württemberg. Die Praxiseinsätze werden in der Mercedes-Benz Bank AG in Stuttgart sowie an weiteren Standorten des Daimler-Konzerns durchgeführt. Die Vorlesungen finden an der DHBW in Mannheim statt. Im Rahmen dieser Studienrichtung besteht die Möglichkeit, einen Praxiseinsatz sowie ein Theoriesemester im Ausland zu absolvieren.\n<br><br>\nWeitere Informationen zum Studium in der Mercedes-Benz Bank AG finden Sie auf unserer Homepage (https://www.mercedes-benz-bank.de/content/mbbank/de/bank/karriere/schueler.html).\n<br><br>\nBitte bewerben Sie sich ausschließlich online und fügen der Bewerbung Ihren Lebenslauf, ein Anschreiben im Motivationsfeld des Online-Formulars und Ihre letzten 2 Zeugnisse bei (max. Gesamtgröße der Anhänge 6 MB).\n<br><br>\nWir freuen uns insbesondere über Onlinebewerbungen schwerbehinderter und ihnen gleichgestellter behinderter Menschen direkt auf diese Ausschreibung.\n<br>\nBei Fragen können Sie sich unter sbv@daimler.com zudem an die Schwerbehindertenvertretung des Standorts wenden, die Sie gerne nach Ihrer Bewerbung im weiteren Bewerbungsprozess unterstützt.\n<br><br>\nBitte beachten Sie, dass sämtlicher Schriftverkehr über Ihre angegebene E-Mail-Adresse erfolgt!\n<br><br>\nInformationen zu den Mindestvoraussetzungen für Ihre Bewerbung finden Sie unter www.daimler.com/karierre in der Rubrik Schüler &gt; Duale Hochschule &gt; Bewerbungsprozess"}