{"job title": "Senior Analytics Consultant", "company": "Pandata Group", "city state": "– Milwaukee, WI", "rating": "5.0", "job description": "<strong>Senior Analytics Consultant</strong>\n<br><br>\nMilwaukee, WI\n<br><br>\n<strong>What You’ll Do:</strong>\n<br><br>\n· Guide clients on optimizing their data environments to work most effectively and efficiently for them.\n<br><br>\n· Lead small teams of consultants on projects\n<br><br>\n· Develop a data model around stated use cases to capture client’s KPIs and data transformations\n<br><br>\n· Implement and provide advice on data warehouse solutions, ETL pipelines, and business intelligence reporting tools.\n<br><br>\n· Teach technical data modeling concepts to a variety of audiences including developers, data architects, business users, and IT professionals\n<br><br>\n<strong>What You Bring to Pandata Group:</strong>\n<br><br>\n· Bachelor’s degree in a technical or quantitative field (e.g. Math, Computer Science, Economics, Statistics). Master’s degree within similar fields preferred.\n<br><br>\n· 5-7 years of work experience in the data analytics space.\n<br><br>\n· A passion for exploring and solving different kinds of problems.\n<br><br>\n· Advanced in SQL.\n<br><br>\n· A desire to learn and assimilate technical information quickly.\n<br><br>\n· Bonus points for:\n<br><br>\no Exposure to developer tools/ workflow (e.g. git/github, SSH)\n<br><br>\no Knowing how to get around a command line environment\n<br><br>\no Experience with cloud ecosystem (Azure, AWS Redshift, Google Big Query, SAP)\n<br><br>\no Experience with business visualization tools (e.g. SAP, Microsoft Power BI, Looker, Tableau)\n<br><br>\no Experience with data warehousing\n<br><br>\no Experience optimizing database/ query performance\n<br><br>\no Proficiency with a scripting language (e.g. Python, R, Perl, bash)\n<br><br>\n<strong>What Pandata Group Brings to You:</strong>\n<br><br>\n· A challenging, dynamic and rewarding work environment which fosters rapid professional growth in a space that is at the forefront of information technology.\n<br><br>\n· An unparalleled opportunity to gain in depth operational experience across a variety of industries and organizational departments.\n<br><br>\n· The opportunity to explore and put into practice cutting edge technology on a regular basis.\n<br><br>\n· An incentivized development program that enhances your skill set with professional training and certifications.\n<br><br>\n· Competitive merit-based compensation and bonus packages that rapidly reward passionate and driven team members.\n<br><br>\n· Small company culture, with big company benefits: 4 Weeks PTO (5 Weeks after 5 Years), HMO/ PPO, Dental, Life, Vision, HSA, 401(k) with matching funds.\n<br><br>\n· A work hard/play hard, familial culture that loves to get together whenever we can for great food (and drink), sporting events, etc. We are equal parts passionate about our people and our work and we like to enjoy ourselves while doing it."}