{"job title": "BSA AML Quantitative Analyst", "company": "Seacoast Bank", "city state": "– Loxahatchee, FL", "rating": "3.5", "job description": "Do you have a growth mindset and thrive under pressure; you are probably a great fit for our team!\n<br><br>\nOur Associates are passionate about growth, innovation and collaboration. We are constantly striving to improve and better ourselves so that we can better support our clients.\n<br><br>\nSeacoast Bank is a fast growing community bank headquartered in Stuart, Florida. As banking continues to change, Seacoast Bank will become a leader in defining community bank in the future with our VISION 2020.\n<br><br>\nTo help Seacoast Bank take another step toward the future we are growing our BSA AML team, creating a new hub out of Palm Beach, FL.\n<br><br>\n<strong>Summary</strong>\n<br><br>\nUnder the direction of the Banks BSA/AML Policy &amp; Risk Manager the Quantitative Analyst is responsible for assisting in the development and execution of the Banks BSA AML analytics capabilities.\n<br><br>\n<strong>BSA Quantitative Analyst Essential Duties and Responsibilities</strong>\n<ul>\n<li>Assist the Operational Risk Officer in identifying new risk analytics projects, assessing their feasibility, and prioritizing on the basis of cost, potential benefit, and overall strategic alignment\n\n<ul>\n<li>Knowledge BSA/AML and how to leverage Data Analytics to drive results</li></ul> </li>\n<li>Consider the different tradeoffs of competing data analysis techniques and apply appropriate, methodologically sound, clearly documented approaches in a SAS programming environment</li>\n<li>Execute and deliver one-off risk analytics projects to support key business decisions related to risk-return tradeoffs in business activities and cost-benefit tradeoffs in internal controls</li>\n<li>Develop and automate additions to the Banks portfolio of risk analytics monitoring that business and support units throughout the Bank use to inform day-to-day risk management decisions</li>\n<li>Provide independent validation and review of models used by different business and support units throughout the Bank.</li>\n<li>Support the Operation Risk Officer in producing monthly reporting related to the Banks Key Risk Indicators and Internal Loss Events</li>\n</ul>\n<strong>Position Requirements:</strong>\n<ul>\n<li>No Banking experience required</li>\n<li>Bachelors Degree, preferred in a related field (Business, Economics, Engineering, Mathematics, Statistics, Computer Science, etc.)</li>\n<li>Additional specialization and training in Data Science, Data Analytics or Applied Statistics (Masters degree or Certifications) preferred but not required</li>\n<li>Minimum three (3) years professional experience programming in SAS to manipulate, analyze and visualize large datasets in a data rich environment (any industry)</li>\n<li>Strong grasp of statistical theory and assumptions with the ability to soundly apply in a SAS programming environment (normal and non-normal distributions, random sampling, hypothesis testing, probability functions, etc.)</li>\n<li>Experience applying linear and logistic multiple regression analysis and at least some of the following additional data analysis techniques: discriminant function, (M)ANOVA, principal components, cluster, constrained optimization, Monte Carlo</li>\n<li>Experience exploring and retrieving data from an Enterprise Data Warehouse preferred</li>\n<li>Familiarity with SAS Visual Analytics, SAS Viya, and/or job scheduling applications a plus</li>\n<li>Proficient in Microsoft Office productsWord, Excel, PowerPoint</li>\n<li>Ability to effectively respond to shifting priorities and manage multiple work streams</li>\n</ul>\n<strong>The statements above are intended to describe the general nature and level of the work being performed by people assigned to this position. They are not intended to be an exhaustive list of responsibilities, duties and skills. Because the statements are general, the job description is used for a variety of purposes including: job evaluations; performance appraisal; recruiting.</strong>"}