{"job title": "Data Engineer", "company": "TEKsystems, Inc", "city state": "– Sunnyvale, California", "rating": "3.4", "job description": "<strong>JOB Summary:</strong>\n<br>\nThe Media Products Analytics Engineering is looking for a top-notch Big Data engineer to develop analytics systems that will generate insights into customer experiences on products such as the TV service, Video, Podcasts etc. Our products reach hundreds of millions of customers around the world, and have revolutionized how people interact with their music, movies, TV shows, apps, books, and podcasts.\n<br><br>\n<strong>Key Qualifications:</strong>\n<br>\nLanguage: Java or Scala\n<br>\nWorking knowledge on the following distributed data processing platforms:\n\n\n<ul>\n<li>Required: Spark, Hadoop</li>\n<li>Great if you also know: HBase, Kafka, Java Map Reduce</li>\n</ul>\n\nAlgorithms: You will be working on developing new algorithms to process large scale data efficiently. We expect you to know:\n\n\n<ul>\n<li>Basic Computer Science algorithms and Data Structures</li>\n<li>Distributed Algorithms to process and mine data, e.g. Map Reduce Algorithm</li>\n<li>Great but not required if you also know about how to develop: Graph, Data classification and clustering algorithms in distributed environment</li>\n</ul>\n\n<strong>Description:</strong>\n<br>\nThe Media Products Analytics Engineering team is responsible for collecting, analyzing, building insights and reporting on customer experience data. From this data we generate insights into how customers interact with our products, and use these insights to drive improvements to user-facing features. You will be working on a small team and will be responsible for processing large amounts of data and developing platforms to process, analyze and mine that data to extract intelligence. Prepare data for visualization, ad-hoc exploration, reporting, and further analysis. We are looking for a well-rounded engineer who has good design sense. The ideal candidate pays close attention to details -- caring about the quality of the input data as well as how the processed data is ultimately interpreted and used. You are also a team player -- ready to contribute during design sessions, and able to give and receive constructive code reviews. Your curiosity drives you to explore new technologies and apply creative solutions to problems.\n<br><br>\n<strong>Additional Requirements:</strong>\n\n\n<ul>\n<li>Build large scale data processing, mining and analysis projects and features, ensuring robust &amp; maintainable solutions are implemented with special attention to data quality, performance and usability details.</li>\n<li>Develop, advocate for, and build consensus on, coding best practices.</li>\n<li>Ability to effectively work with cross functional teams to understand requirements and identify design and engineering impacts</li>\n<li>Experience with architecting big data and analytical applications that scale to petabytes highly preferred.</li>\n</ul>\n\n<strong>About TEKsystems:</strong>\n<br><br>\n<strong> We're partners in transformation. We help clients activate ideas and solutions to take advantage of a new world of opportunity. We are a team of 80,000 strong, working with over 6,000 clients, including 80% of the Fortune 500, across North America, Europe and Asia. As an industry leader in Full-Stack Technology Services, Talent Services, and real-world application, we work with progressive leaders to drive change. That's the power of true partnership. TEKsystems is an Allegis Group company.</strong>"}