{"job title": "Business Data Analyst", "company": "TEKsystems, Inc", "city state": "– Kansas City, Missouri", "rating": "3.4", "job description": "TEKsystems is seeking a Business Data Analyst for a client in Kansas City, MO.\n<br><br>\nOur customer is looking for an experienced data analyst to work with business units to gather information and translate that information into detailed technical requirements. In addition, this individual will be working with the technical teams to translate requirements and conduct meetings with the business end clients.\n<br><br>\nRequired Skills:<li> Understand how to analyze data</li> <li> Ability to write SQL logic for developing technical requirements</li> <li> Ability to conduct meetings with Business and Technical teams</li> <li> Knowledge in reporting tools</li> <li> Exposure to working with a data warehouse (i.e. table joins, foreign keys, data modeling concepts, and transformation rules)</li>\n\nPlease reach out to Nicole Lund with TEKsystems for more information.\n<br><br>\n<strong>About TEKsystems:</strong>\n<br><br>\n<strong> We're partners in transformation. We help clients activate ideas and solutions to take advantage of a new world of opportunity. We are a team of 80,000 strong, working with over 6,000 clients, including 80% of the Fortune 500, across North America, Europe and Asia. As an industry leader in Full-Stack Technology Services, Talent Services, and real-world application, we work with progressive leaders to drive change. That's the power of true partnership. TEKsystems is an Allegis Group company.</strong>\n<br><br>\n<strong> The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.</strong>\n<br><br>\n<strong> If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please call 888 472-3411 or email accommodation@teksystems.com for other accommodation options.</strong>"}