{"job title": "Senior Data Analyst", "company": "TrueCar", "city state": "– Santa Monica, CA", "rating": "3.3", "job description": "Job Description:<br><br>We are looking for a Senior Analyst who will play a critical role within our Partner Development team, which is dedicated to growing TrueCar through key affinity partnerships with over 220 companies including Chase, Sam's Club, Car &amp; Driver, AAA, American Express, Consumer Reports, and GEICO. TrueCar is growing quickly and investing in our Partner Development team is a key priority.\n<br><br>\nThe Senior Analyst role offers a great opportunity to be a student of the business in this fast-paced industry, with a view across multiple segments and brands. We're looking for an analytical, yet artistic solution-driver who thrives on engaging with data to help our business understand and grow our key partnerships. This is an outstanding opportunity to dig deep into a key TrueCar priority, integrate data from a wide variety of internal and external sources, and produce visually compelling insights. In addition to your direct team, you will work closely with other key functional groups within TrueCar outside of Partner &amp; OEM. These interactions will provide you with intimate knowledge of TrueCar's operations, giving you the ability to make informed and thoughtful strategic insights.\n<br><br>\nAuto manufacturers (OEMs) spend over $40B annually on consumer incentives to drive sales; much of it with consumers who would have bought their product anyway. TrueCar offers a specialized digital marketplace and private targeted incentive solutions to help make that spend more efficient, while at the same time providing exclusive savings to the 6M+ consumers who visit our car buying service sites\n<br><br>\n<strong>ABOUT THE JOB:</strong>\n<ul>\n<li>Serve as the champion in data visualization techniques, analytics, dashboard design, and best practices for information delivery</li><li>Own all aspects of analytics, reporting, design, and optimization insights for our all of our TrueCar OEM affinity partners</li><li>Build, maintain and iterate on Tableau data visualizations</li><li>Supervise creation of all visual reports in Tableau for internal and external clients that summarize findings clearly and effectively</li><li>Collaborate with data engineering team to design data pipelines for Tableau Server</li><li>Lead data analysis projects from the research phase to production</li><li>Develop analytics and reporting capabilities for new OEM and Partner programs using Tableau and PowerPoint as they launch</li><li>Track and measure optimization efforts using Google Analytics or Redshift/SQL</li><li>Understand program results from key marketing and product initiatives and articulate the key drivers of program success or needs for improvement</li><li>Leverage insights created by the OEM Partner &amp; OEM team into actionable recommendations to improve program performance</li><li>Must be well-spoken and comfortable with presenting to an executive audience</li><li>Analyze digital marketing campaigns and provide cost analysis</li>\n</ul>\n<strong>WHAT YOU NEED:</strong>\n<ul>\n<li>3 - 5+ years' experience working in an analytics role</li><li>A passion for using data visualization to tell complex data stories</li><li>Ability to communicate complex ideas to any audience, ranging from teammates to business executives</li><li>3+ years of profession experience creating Tableau dashboards</li><li>Experience with publishing and maintaining workbooks on Tableau Server</li><li>3+ years of experience with database software (RedShift, Hive, SQL, MYSQL, ...)</li><li>Experience with statistical programming software (Spark, R, Python preferred)</li><li>Proficiency with Tableau Desktop and Server</li><li>Bachelor's Degree in Statistics, Data Science, Economics, CS, Engineering or related field</li><li>Strong analytical background, with experience identifying trends and key takeaways from data</li><li>Ability to analyze, organize, and integrate large amounts of complex data into clear and concise presentations and status reports</li><li>Outstanding attention to detail and time-management skills</li><li>Expert knowledge in Excel and PowerPoint required</li><li>Experience tracking web metrics using Google Analytics</li>\n</ul>\n<strong>NICE TO HAVE:</strong>\n<ul>\n<li>Passion for the automotive and internet industries</li>\n</ul>\n\nLocation(s): Santa Monica Offices"}