{"job title": "Data Analyst - Customer Obsession", "company": "Uber", "city state": "– San Francisco, California", "rating": "4.2", "job description": "We’re changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now we’re a part of the logistical fabric of more than 600 cities around the world. Whether it’s a ride, a sandwich, or a package, we use technology to give people what they want, when they want it.\n<br><br>\nFor the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer.<br>\n<div>And that’s just what we’re doing today. We’re thinking about the future, too. With teams working on new modalities, self-driving cars and even urban air transportation, we’re in for the long haul. We’re reimagining how people and things move from one place to the next.</div>\n\n<br>Customer ObsessionUber Data Science is looking for world class data analysts to join its Customer Obsession team, a group responsible for ensuring every Uber customer support experience is world-class. Specifically, this team works to build self-service technology and process that’s deeply integrated with the Uber customer support experience, making it easy for our customers and customer support representatives to get to the right outcome, faster. They’re also responsible for building the models and algorithms that help Uber customers answer their own questions or, even better, avoid the need for a customer support experience at all.<br><br>Data Analytics\n<ul>\n<li>Demonstrable domain expertise in product metric identification, improving data quality, experimentation design and execution.</li><li>A degree in statistics or a quantitative domain plus hands-on data analytics experience. Technical understanding must go from the highest abstractions down to the metal.</li><li>3+ years experience delivering, scaling, and owning highly successful and innovative data analytics products with your fingerprints all over them - you’re extremely proud of what you’ve accomplished.</li><li>An ability to connect the deep domain expertise of the researcher with the pragmatism and scrappiness of the entrepreneur - you’re a true generalist.</li><li>A high bar across the board - from your own contributions to the people you work with to the products you work on.</li><li>A “driver” personality - biased toward action, great collaborator and master disambiguator / simplifier - constantly pushing toward clarity and delivery.</li><li>Proficiency in SQL and scripting languages (e.g. R, Python).</li><li>Masterful visualization skills and storytelling abilities.</li>\n</ul>"}