{"job title": "Health Policy Data Analyst", "company": "Vanderbilt University Medical Center", "city state": "– Nashville, TN", "rating": "3.7", "job description": "<strong>Health Policy Data Analyst</strong>\n<br><br>\n<strong>Requisition Number 1806876</strong>\n<br><br>\n<strong>Discover Vanderbilt University Medical Center:</strong>\n<br><br>\nLocated in Nashville, Tennessee, and operating at a global crossroads of teaching, discovery and patient care, VUMC is a community of individuals who come to work each day with the simple aim of changing the world. It is a place where your expertise will be valued, your knowledge expanded and your abilities challenged. It is a place where your diversity of culture, thinking, learning and leading is sought and celebrated. It is a place where employees know they are part of something that is bigger than themselves, take exceptional pride in their work and never settle for what was good enough yesterday. <strong>Vanderbilt's</strong> mission is to advance health and wellness through preeminent programs in patient care, education, and research.\n<br><br>\nClick Here To View The VUMC Promise of Discovery\n<br><br>\n<strong>Department/Unit Summary</strong>\n<br><br>\nPhysical medicine and rehabilitation is often called the quality of life profession because its aim is to enhance a patient's function and well-being after injury or illness. At the Physical Medicine and Rehabilitation Center at VUMC, our specialists focus not on one part of the body. Instead, we take a comprehensive approach to putting all the pieces of a person's life back together after injury or disease. This includes addressing medical, social, emotional, and vocational needs. For more information, please visit .\n<br><br>\n<strong>Your Role:</strong>\n<br><br>\nIn the pivotal role of Health Policy Data Analyst, with guidance and training, you will be responsible for data management and data analysis for research studies, including clinical trials and cohort studies. You must be able to use quantitative and qualitative research methods for data analysis. Our group performs NIH and Patient Centered Outcomes Research Institute(PCORI) funded large clinical trials\n<br><br>\nOur group performs NIH and Patient Centered Outcomes Research Institute (PCORI) funded large clinical trials, cohort studies, and genetic epidemiology. You will have the opportunity to manage and analyze data from these studies, and learn from senior statisticians and musculoskeletal researchers. More information on our studies and team can be found here:\n<br><br>\n<strong>KEY RESPONSIBILITIES:</strong>\n<ul>\n <li>Work as a member of research team and provide expertise in research design</li> <li>Expertise in REDCap data management and design</li> <li>Uses quantitative and qualitative research methods to participate in design, coordination, and conduct of research projects</li> <li>Assist in designing methods to collect research data including procedures for collection, cleaning, and management of data</li> <li>Assist in preparing datasets for analysis</li> <li>Assist in preparing data analysis plans</li> <li>Uses advanced programming and statistical expertise to manage and analyze data</li> <li>Responsible for managing large and/or complex datasets</li> <li>Perform data management and make patient enrollment reports using statistical software</li> <li>Assist in preparation of data analysis sections for manuscript, grants, and oral presentations</li>\n</ul>\nThe ideal candidate must be a self-starter and detail-oriented, be able to handle multiple tasks, and possess strong data analytical skills. The ideal candidate will have strong interpersonal, communication, and organizational skills, and be comfortable interacting with team members including the PI and senior statisticians.\n<br><br>\nThis position will begin July 2018.\n<br><br>\n<strong>Required:</strong>\n<br><br>\nMasters in quantitative health/health sciences fields such as epidemiology, biostatistics, health policy.\n<br><br>\n<strong>Preferred:</strong>\n<br><br>\nPrevious experience with research\n<ul>\n<li>Previous research with R software</li>\n</ul>\n<br><br>\n<strong>VUMC Recent Accomplishments</strong>\n<br><br>\nBecause we are committed to providing the best in patient care, education and research, we are proud of our recent accomplishments:\n<br><br>\n<strong>US News &amp; World Report:</strong> #1 Hospital in Tennessee, #1 Health Care Provider in Nashville, #1 Audiology (Bill Wilkerson Center), 12 adult and 10 pediatric clinical specialties ranked among the nation's best, #15 Education and Training\n<br><br>\n<strong>Truven Health Analytics:</strong> among the top 50 cardiovascular hospitals in the U.S.\n<br><br>\n<strong>Becker's Hospital Review:</strong> one of the \\\"100 Greatest Hospitals in America\\\"\n<br><br>\n<strong>The Leapfrog Group:</strong> grade \\\"A\\\" in Hospital Safety Score\n<br><br>\n<strong>National Institutes of Health:</strong> among the top 10 grant awardees for medical research in the US\n<br><br>\n<strong>Magnet Recognition Program:</strong> Vanderbilt nurses are the only group honored in Middle Tennessee\n<br><br>\n<strong>Nashville Business Journal:</strong> Middle Tennessee's healthiest employer\n<br><br>\n<strong>American Hospital Association:</strong> among the 100 \\\"Most Wired\\\" medical systems in the US\n<br><br>\n*CA<br><br><strong>Qualifications</strong>\n<br><br>\n<strong>Physical Requirements/Strengths needed &amp; Physical Demands:</strong>\n\n<ul>\n<strong>Movement</strong>\n\n<ul>\n<li>Occasional: Sitting: Remaining in seated position</li><li>Occasional: Standing: Remaining on one's feet without moving.</li><li>Occasional: Walking: Moving about on foot.</li><li>Occasional: Lifting under 35 lbs: Raising and lowering objects under 35 lbs from one level to another</li><li>Occasional: Push/Pull: Exerting force to move objects away from or toward.</li><li>Occasional: Bending/Stooping: Trunk bending downward and forward by bending spine at waist requiring full use of lower extremities and back muscles</li><li>Occasional: Reaching below shoulders: Extending arms in any direction below shoulders.</li><li>Occasional: Handling: Seizing, holding, grasping, turning or otherwise working with hand or hands.</li>\n</ul>\n\n<strong>\n\n<ul>\n</ul>\n\nSensory</strong>\n\n<ul>\n<li>Occasional: Vision: Clarity of near vision at 20 inches or less and far vision at 20 feet or more with depth perception, peripheral vision, color vision.</li><li>Frequent: Noise: May include exposure to occupational noise levels which equal or exceed an 8-hr time-weighted average of 85 decibels, requiring enrollment in VUMC's Hearing Conservation Program which includes training, use of hearing protection, and periodic audiometry.</li><li>Continuous: Communication: Expressing or exchanging written/verbal/electronic information.</li></ul>\n</ul>"}