{"job title": "Lead Data Scientist, Marketing", "company": "21st Century Fox", "city state": "– Playa Vista, CA", "rating": "3.6", "job description": "<strong>OVERVIEW OF THE COMPANY</strong>\n<br><br>\nFoxNext\n<br><br>\nFoxNext is driving immersive, next generation entertainment experiences in the areas of augmented and virtual reality, mobile, console/PC games and location-based entertainment across Twentieth Century Fox Film and Fox Networks Group. The division consists of FoxNext Games, FoxNext VR Studio and FoxNext Destinations.\n<br><br>\n<strong>JOB DESCRIPTION</strong>\n<br><br>\nLead Data Scientist, Marketing\n<br><br>\nLos Angeles, CA\n<br><br>\n<strong>WHAT YOU'LL DO:</strong>\n<br><br>\n<strong>Team:</strong>\n<br><br>\nThe Lead Data Scientist, Marketing is responsible for the design and management of FoxNext Games' marketing optimization platform, which guides our media buying efforts. Embedded as a part of the Marketing Team, you will partner closely with other functions within FoxNext Games to create leading-edge tools that will guide how we plan and spend tens-of-millions of advertising dollars.\n<br><br>\n<strong>Day to day duties:</strong>\n\n\n<ul>\n<li>Design, develop and evaluate advanced predictive and machine learning models with a focus on media buying</li>\n<li>Analyze and extract relevant information about user acquisition funnel and in-game player behavior, from both structured and unstructured data, to better understand and enhance our media buying strategy and execution</li>\n<li>Collaborate with colleagues in Marketing and Development to infuse predictive analytics into our marketing, driving increased relevance and business performance</li>\n<li>Mine data (both structured and unstructured) to detect patterns, opportunities and insights that drive our user acquisition strategy and execution</li>\n<li>Build and own all attribution and marketing mix models used to measure performance between offline and direct marketing channels</li>\n<li>Conduct advanced analysis on various marketing efforts to gauge performance, impact and effectiveness against the desired results</li>\n<li>Work with Business Intelligence team to specify features for dashboards and other reporting</li>\n<li>Work with development teams to implement new features that improve the acquisition funnel</li>\n</ul>\n\n<strong>MUST Have Experience:</strong>\n\n\n<ul>\n<li>3-5 years' prior hands-on experience in data science</li>\n<li>Experience leveraging exploratory data analysis, predictive modeling, and machine learning to drive significant business impact</li>\n<li>Ability to paint a picture through analytics that will enhance and determine business decisions</li>\n<li>Experience leveraging visual analytics to create a story that informs business leaders with the necessary knowledge to drive growth</li>\n<li>Expert knowledge programming in R or inPython's data science toolkits</li>\n<li>Capable of interacting with relational databases through SQLDemonstrated willingness to both teach others and learn new techniques</li>\n<li>Ability to handle multiple projects and work independently in a deadline oriented environment</li>\n</ul>\n\n<strong>Desirable Experience:</strong>\n\n\n<ul>\n<li>Previous experience with marketing, media, and customer segmentation strategy</li>\n<li>Experience programming with statistical modeling or machine learning tools to fuel and deliver marketing personalization</li>\n<li>Familiar with manipulating and mining unstructured data to transform business decisions that impact the bottom line</li>\n<li>Familiar with visual analytic tools such as Looker, Tableau, Qlik Sense, Spotfire, or other</li>\n</ul>\n\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, gender identity, disability, protected veteran status, or any other characteristic protected by law. We will consider for employment qualified applicants with criminal histories consistent with applicable law."}