{"job title": "Data Engineer, Alexa Smart Home/IOT", "company": "Amazon", "city state": "– Bellevue, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAlexa is the cloud service that powers Amazon Echo, the groundbreaking device designed around your voice. This is an opportunity to join a growing team that is working to build an exciting new Amazon business in voice. <br><br>We are looking for candidates who want to help shape the future of human-computer interactions. Specifically, we are looking for an outstanding Data Engineer who is looking to work in a new space to help define how we use multi-modal data (voice, mobile, desktop) to understand customer behavior and satisfaction. In this role, you will develop and support the data pipelines that give our teams flexible and structured access to their data.<br><br>The successful candidate will be an expert with coding and scripting languages to build and deploy complex data pipelines. The candidate will need to be a self-starter, comfortable with ambiguity in a fast-paced and ever-changing environment, and able to think big while paying careful attention to detail. <br><br>Responsibilities <br><br>You know and love working with data engineering tools, can model multidimensional datasets, and can partner with other technical teams and end-users to gather data sets needed to answer key business questions. You will also have the opportunity to display your skills in the following areas: <br><ul><li>Design, implement, and support a platform providing ad-hoc access to large data sets</li><li>Interface with other technology teams to extract, transform, and load data from a wide variety of data sources</li><li>Implement data structures using best practices in data modeling, ETL/ELT processes, and SQL, Redshift, and OLAP technologies</li><li>Model data and metadata for ad-hoc and pre-built reporting</li><li>Interface with business customers, gathering requirements and delivering complete reporting solutions</li><li>Build robust and scalable data integration (ETL) pipelines using SQL, Python and Spark.</li><li>Build and deliver high quality data sets to support business analyst, data scientists, and customer reporting needs.</li><li>Continually improve ongoing reporting and analysis processes, automating or simplifying self-service support for customers</li><li>Participate in strategic &amp; tactical planning discussions, including annual budget processes</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Bachelor's degree or higher in a quantitative/technical field (e.g. Computer Science, Statistics, Engineering).</li><li>5+ years of relevant experience in one of the following areas: Data engineering, database engineering, business intelligence or business analytics.</li><li>5+ years of hands-on experience in writing complex, highly-optimized SQL queries across large data sets.</li><li>2+ years of experience in scripting languages like Python etc..</li><li>2+ years of experience in coding languages: Java/Scala</li><li>Demonstrated strength in data modeling, ETL development, and Data warehousing. Data Warehousing · Experience with Redshift, Oracle, etc.</li><li>Experience with AWS services including S3, Redshift, EMR and RDS.</li><li>Experience with Big Data Technologies (Hadoop, Hive, Hbase, Pig, Spark, etc.)</li><li>Experience in working and delivering end-to-end projects independently.</li><li>Knowledge of distributed systems as it pertains to data storage and computing</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Proven success in communicating with users, other technical teams, and senior management to collect requirements, describe data modeling decisions and data engineering strategy</li><li>Experience providing technical leadership and mentoring other engineers for best practices on data engineering</li><li>Knowledge of software engineering best practices across the development lifecycle, including agile methodologies, coding standards, code reviews, source management, build processes, testing, and operations</li><li>Masters in computer science, mathematics, statistics, economics, or other quantitative field</li></ul>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}