{"job title": "Data Scientist, Marketing", "company": "Ancestry", "city state": "– San Francisco", "rating": "3.1", "job description": "Job Description<div>Ancestry is growing its Data Science team globally. We’re looking for a Data Scientist to join us in our San Francisco office. In this role, the individual will be mainly focused on supporting our marketing organization in solving problems concerning marketing optimization, customer journey, contact strategy, marketing mix modeling, etc.\n<br><br>\nThe new hire will be a member of the global Data Science &amp; Machine Learning Team, tackling our toughest and most exciting data science challenges.\n<br><br>\n<strong>Key Responsibilities</strong>\n<ul>\n<li>Use data science to drive innovations in areas such as marketing optimization, customer journey modeling, causal inference and contact strategy</li><li>Apply statistics, clustering, and modeling to extract business insights</li><li>Help champion a data-driven culture and push long-term business value creation through development of best-in-class data science capabilities</li><li>Leverage data mining, statistics, and/or machine learning to increase value across our business</li><li>Write high quality code and work with engineers to deploy models in production</li></ul></div>\n<br>\nQualifications<div>\n\n<ul>\n<li>M.S. or Ph.D. in Statistics, Mathematics, Computer Science or other related fields</li><li>2+ years of working experience as a data scientist</li> <li>Expert in statistical causal inference modeling</li><li>Good level of experience with machine learning modeling</li><li>Highly skilled at translating business requirements from key stakeholders into research problems</li><li>Very strong communication skills</li><li>Proven track record of completing multiple data science projects end to end, from idea generation to objectives formulation to implementation and deliverables</li><li>Fluency in Python or R</li><li>Fluency in SQL</li><li>Experience with SPARK is a big plus</li><li>Experience with cloud computing is a big plus</li><li>Experience in Scala or Java is a plus</li><li>Excellent written and oral communication skills</li></ul></div>\n<br>\nAdditional Information<div>Ancestry is a profitable, growing company with a positive, high-energy environment. Together, our dedicated teams are harnessing the power of technology and using it to simplify the way people connect with their families and their unique legacies. Our work environment is fast-paced and challenging, but also extremely exciting. You’ll work with a team of passionate, engaged individuals. We offer excellent benefits and a competitive compensation package. For additional information, regarding our benefits and career information, please visit our website at http://ancestry.com/careers\n<br><br>\nAncestry is not accepting unsolicited assistance from search firms for this employment opportunity. All resumes submitted by search firms to any employee at Ancestry via-email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Ancestry. No fee will be paid in the event the candidate is hired by Ancestry as a result of the referral or through other means.\n<br><br>\nAncestry is an Equal Opportunity Employer that makes employment decisions without regard to race, color, religious creed (including religious dress and grooming practices), national origin, ancestry, sex (including pregnancy, childbirth, breastfeeding, and medical conditions related thereto), sexual orientation, gender, gender identity and expression, age (40 and older), mental or physical disability (including HIV and AIDS), medical condition (cancer and genetic characteristics), veteran status, citizenship, marital status, genetic information, or any other basis that is prohibited by applicable law. The Company also makes reasonable accommodations to applicants or employees with qualifying disabilities who request them and who otherwise meet the requirements of applicable law. If you would like to request an accommodation during the application process, please contact our Director of Recruiting.\n<br><br>\nAll job offers are contingent on a background check screen that complies with applicable law. For San Francisco office candidates, Ancestry will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of San Francisco's Fair Chance Ordinance.\n<br><br>\nIND2\n<br><br>\n#LI-Post</div>"}