{"job title": "Jr. Data Scientist", "company": "Back Country Store", "city state": "– Park City, UT", "rating": "NA", "job description": "The Jr. Data Scientist, Gearheads will architect, curate, and analyze our customer data, reporting to the Sr. Manager of Operations. The Jr. data Scientist, Gearheads is responsible for developing our data into functional architecture, and conducting deeper back end analysis using data that may require structuring, or higher level tools like Python.\n<br><br>\n<strong>About the Job:</strong>\n\n\n<ul>\n<li>Own all data related to Gearhead Operations</li>\n<li>Own backend architecture of reporting tools and Tableau data</li>\n<li>Work with leadership to implement and operationalize findings, providing administrative support during implementation as needed</li>\n<li>Work with Data&amp;Insights team to structure data in relational databases in a way that enables analysts to conduct accurate and timely analyses</li>\n<li>Advise and recommend best practices for gathering and mining data</li>\n<li>Build advanced analytical tools using automated feature-based learning models</li>\n<li>Be the first step in data quality, by ensuring integrity of structure and monitoring anomalies</li>\n<li>Conduct ad-hoc analysis for management on a range of topics related to customer insights and customer engagement</li>\n<li>Learn new analysis skills with your team by collaborating in weekly team code exchange sessions where analysts share knowledge to help each other make breakthroughs or brainstorm new approaches to problems</li>\n<li>Work directly with our sales teams to understand the root source of our data streams</li>\n<li>Actively commit your energy to our very close-knit team of analysts. We contribute selflessly to each other's success.</li>\n<li>Represent Backcountry's core values through your actions</li>\n</ul>\n\n<strong>About You:</strong>\n\n\n<ul>\n<li>Advanced SQL skills, preferably P-SQL</li>\n<li>Intermediate Python skills</li>\n<li>Experience thoroughly documenting work Github experience preferred</li>\n<li>Experience using SSRS/SSMS as a visualization and reporting automation platform</li>\n<li>Structured thinker you approach ideas and problems by putting a framework around them, and working systematically</li>\n<li>Expert Excel skills</li>\n<li>Continual improver you are constantly growing by looking within yourself and your skills to understand how to offer more to the world and your profession, and then actively working to realize that needed growth</li>\n<li>Bachelor's Degree, Master's Degree preferred in Engineering, Mathematics, Computer Science, Business Analytics, or similar</li>\n<li>Open to critical feedback you will have your work scrutinized and you will be expected to use the feedback to improve your work</li>\n<li>Passionate about the outdoors</li>\n</ul>\n\nAbout Backcountry\n<br><br>\nOur mission is to connect people to their passions. Our five online storesBackcountry, Competitive Cyclist, MotoSport, Bergfreunde, and SteepandCheapaim to supply our customers with the gear, knowledge, and inspiration necessary to get out there and chase down life's greatest moments. We do this by providing the biggest and best assortment of premium outdoor products, a superior shopping experience, personalized Gearhead expertise, lightning-fast and accurate fulfillment, and inspirational, informative, and community-centered content.\n<br><br>\nWe take this concept seriously, both personally and professionally, which for employees translates to careers with growth potential and the ability to take ownership and make an impact daily. Perks such as an excellent gear discount, an annual summer Adventure Contest, summer barbecues, and a pet-friendly office make for a fun work environment. Backcountry employees will have the benefit of working with colleagues who are passionate about their careers as well as the outdoors. Benefits include medical, dental, vision, and disability&amp;life insurance, paid maternity and paternity leave, 401(k) matching, and Flexible Spending or Health Savings Accounts."}