{"job title": "Lead Data Scientist", "company": "Beacon Hill Staffing Group", "city state": "– Boston, Massachusetts", "rating": "4.5", "job description": "<strong>Lead Data Scientist</strong> Compensation: $180k\n<br><br>\n<em>A leader in location technology and intelligence is seeking an experienced data scientist to lead the mission of how to understand and leverage a massive and growing set of diverse location information to solve global challenges.</em>\n<br><br>\nYOUR CAREER GOALS:\n<br><br>\nContribute to the mission of maximizing your share of wallet with location-based technology, services and data insights that power us to make educated data-driven business decisions. Building on your experience, you will help define the Machine Learning roadmap and then be the owner of modeling and delivery of all machine learning technology to support appropriate products and capabilities. This includes a diverse range of needs involving billions of daily global observations of both network infrastructure as well as mobile device movement to improve accuracy and ability to position devices as well as the ability to apply context and understanding to the mobile device movements.\n<br><br>\nYOUR AMAZING QUALITIES:\n<br><br>\nYou are passionate about continuous innovation and selling technology that drastically improves user insights and experiences. You have a Master's Degree or PhD degree in Computer Science, Artificial Intelligence, Machine Learning or a related technical field and:\n<ul>\n<li>5+ years' experience using Python. R, Scala or Java (Python preferred)</li><li>5+ years' experience consuming and deploying data via APIs</li><li>5+ years' experience in Model Selection and Sampling</li><li>5+ years' experience in Business and Leadership</li><li>4+ years' experience in applying different learning techniques (supervised, unsupervised, semi-supervised)</li><li>4+ years' experience in the Machine Learning pipeline - (data ingestion, predicting deploying and diagnosing)</li><li>2+ years' experience in deep learning and natural nets</li>\n</ul>\nAnd if you've got knowledge or experience in:\n<ul>\n<li>Communication/ leadership skills</li><li>SQL experience</li>\n</ul>\nThose are certainly plusses!\n<br><br>\nYou must also be able to thrive in a fast-paced, deadline-driven environment. Leadership ability and excellent interpersonal &amp; communication skills here are absolutely essential.\n<br><br>\nIN EXCHANGE FOR YOUR HARD WORK\n<br><br>\nYou're offered you:\n<ul>\n<li>A fun, collaborative and innovative place to work</li><li>And more!</li>\n</ul>\nFind Us on Facebook!\n<br>\nFollow Us on Twitter!\n<br><br>\nBeacon Hill is an Equal Opportunity Employer that values the strength diversity brings to the workplace. Individuals with Disabilities and Protected Veterans are encouraged to apply.\n<br><br>\n<strong>Company Profile:</strong>\n<br><br>\nBeacon Hill Technologies, a premier National Information Technology Staffing Group, provides world class technology talent across all industries on a contract, direct (permanent), contract-to-direct and project basis. Beacon Hill Technologies' dedicated team of recruiting and staffing experts consistently delivers quality IT professionals to solve our customers' technical and business needs.\n<br><br>\nBeacon Hill Technologies covers a broad spectrum of IT positions, including Project Management and Business Analysis, Programming/Development, Database, Infrastructure, Quality Assurance, Production/Support and ERP roles.\n<br><br>\nLearn more about Beacon Hill Staffing Group and our specialty divisions, Beacon Hill Associates, Beacon Hill Financial, Beacon Hill HR, Beacon Hill Legal, Beacon Hill Pharma and Beacon Hill Technologies by visiting www.beaconhillstaffing.com.\n<br><br>\nWe look forward to working with you.\n<br><br>\nBeacon Hill. Employing the Future"}