{"job title": "Data Scientist and Management Consultant", "company": "Greene Resources", "city state": "– Raleigh, NC", "rating": "3.4", "job description": "Job Description<br><br><strong>Job Number:</strong> 30683\n<br><br>\n<strong>Data Scientist and Management Consultant</strong>\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nOur client, based in Raleigh, NC, is seeking an experienced Data Scientist/Management Consultant to add to their team! This individual will work directly with the Sales team to assist in the strategic solutions for new and existing customers. This position is in a dynamic start-up environment with an opportunity to develop great ideas and put them into action. This is a full time, direct hire opportunity that offers competitive benefits and PTO.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n\n<li>Support the company's sales team in your region in the analysis, strategic solution design and closing of new customers</li>\n<li>Interact with all levels of the target organization and align the company's solution with the customer's strategic goals and most important challenges</li>\n<li>Deliver proof of concept projects and build demo systems on the customer's own data to show the business value of the company's solution to interested customers</li>\n<li>Perform other duties as assigned</li>\n\n</ul>\n<strong>Education Requirements:</strong>\n<ul>\n\n<li>BA/BS (or MA/MS) from a top university or equivalent</li>\n\n</ul>\n<strong>Desired Background/Skills:</strong>\n\n<ul>\n<strong>Qualifications:</strong>\n<ul>\n\n<li>Relevant work experience (3+ years) in the area of enterprise software pre-sales, consulting or business development</li>\n<li>Good understanding of core ERP processes</li>\n<li>Strong analytical skills</li>\n<li>Data science expertise is a plus</li>\n<li>SAP know-how is a plus</li>\n<li>Excellent written, oral communication and presentation skills</li>\n<li>Strong interpersonal and organizational skills</li>\n<li>Ability to work, build and maintain relationships at all levels</li>\n<li>Self-starter who is dedicated, hungry, and driven to succeed</li>\n\n</ul>\n<strong>Other Information:</strong>\n</ul>"}