{"job title": "Data Scientist / Business Intelligence", "company": "JBS USA", "city state": "– Greeley, CO", "rating": "3.0", "job description": "Pilgrim's, the World's largest poultry producer, is seeking an experienced Data Scientist to build new routines and process that will drive critical business decisions. The Scientist will bring the power of analytics to Pilgrim's through the market intel team.\n<br><br>\nResponsible for gathering, maintaining, planning, developing and implementing tools and reports to serve the analysts and the multiple teams. Strong analytical and logical skills, curiosity, organization, attention to details, discipline are crucial for this position.\n<br><br>\n<strong>Successful Candidate:</strong>\n<br><br>\nA successful candidate must be able to take the initiative, easily understand the business dynamics, the big picture. Passion for data and BI tools is very important. Ability to translate data into answers. Understand the uses and needs of information to be able to optimize the BI tools and processes. Relate with multiple teams. Have very good project management skills and know how to prioritize the deliverables. Passion for learning, improving process and attentions to the form of how the information it is presented.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Map and manage our data sources</li>\n<li>Evaluate current data sources and find new ones if current sources aren't providing the value</li>\n<li>Define and provide the right technology</li>\n<li>Manage data acquisition budget and relationship with data and tool providers</li>\n<li>Plan and manage timeline of deliverables</li>\n<li>Provide assistance to multiple teams</li>\n<li>Develop dashboards and visualization tools</li>\n<li>Run and deliver reporting routines</li>\n<li>Produce weekly and monthly reports for the market intel and Executive teams</li>\n</ul>\n\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>Bachelor's degree in Information Technology, Data Science, Economics, BI or related area, Master's degree preferred</li>\n<li>Minimum 4 years of work experience, including a role which involved both business (data analysis) and IT experience</li>\n<li>Management responsibilities preferred</li>\n<li>Great Planner</li>\n<li>Strong analytical and problem solving skills</li>\n<li>Curiosity</li>\n<li>Experience with BI Tools, data management (e.g. SQL and Qlikview)</li>\n<li>Proven ability to communicate results to a non-technical audience</li>\n<li>Good multitasking</li>\n<li>Ability to understand the decision making process.</li>\n<li>Understanding of reporting tools and concepts.</li>\n<li>Working with VBA preferred</li>\n</ul>\n\nEOE/M/F/Vet/Disabled<br><br>SDL2017"}