{"job title": "Lead Data Scientist - NLP", "company": "Karna, LLC", "city state": "– Hyattsville, MD", "rating": "2.9", "job description": "Karna is seeking a full-time Natural Language Processing (senior-level) subject matter expert (NLP SME) to support The Centers for Disease Control and Prevention’s National Center for Health Statistics (NCHS), Division of Health Care Statistics, Ambulatory and Hospital Care Statistics Branch, located in Hyattsville, Maryland.\n<br><br>\nAs the nation’s principal health statistics agency, NCHS’ mission is to compile and publish accurate, relevant, and timely statistical information to guide actions and policies that improve the health of the American people. The Ambulatory and Hospital Care Statistics Branch conducts nationally representative surveys of hospital inpatient, emergency, and outpatient departments; ambulatory surgery centers; and office-based physicians. These surveys collect data about clinicians and organizations, and their patients, and about management of patients’ conditions. Policymakers and researchers use these data to analyze patterns in management of specific conditions, quality of care and disparities among populations, and the effects of policy change. The NLP SME will be a member of the Dissemination Team, which is responsible for disseminating information by creating public use files (PUFs) and publishing government reports and other publications. The NLP SME will provide expert technical assistance and guidance regarding the development, refinement, application and functionality requirements for the NLP-based algorithm. Other responsibilities include:\n<ul>\n<li>Investigate and recommend the best NLP programming platform or package. Considerations when recommending the NLP platform or package should include whether the package or platform is currently supported by CDC infrastructure, whether it is widely used and accepted in the field, and whether it can continue to be used by NCHS staff after the project is completed.</li><li>Provide expert technical assistance and guidance regarding the development, refinement, application and functionality requirements for the NLP-based algorithm.</li><li>Provide input to NCHS project staff and the opioid project’s research analyst (‘research analyst’) on any known or identified NLP algorithms, NLP methods, NLP tools and activities that are in use by federal agencies, public health agencies, academic centers, and commercial vendors, and are programs that are available through the CDC.</li><li>Contribute to the following reports[1] as:</li></ul>\n\n<ul>\n<li>Supporting author on a brief internal memo summarizing efforts to update the existing medical code-based algorithm and apply it to NHCS data to produce counts of opioid-involved visits</li><li>Supporting author on a brief internal memo summarizing efforts to apply the updated DMI program to NHCS data to produce counts of opioid-involved visits</li><li>Lead author on a draft and final plan for building a new NLP algorithm to identify opioid-involved visits using NHCS clinical provider notes. The final plan should incorporate findings from a review of existing NLP and text mining methods for identifying visits involving specific types of opioids. In addition, the final plan provide a sufficient level of detail to guide the Research Analyst in the use of the selected NLP software/platform in building and implementing the algorithm. (Completed in Base Year )</li><li>Lead author on a brief internal memo summarizing development of the NLP algorithm and its application to NCHS data to produce counts of opioid-involved visits</li> <li>Supporting author of a comprehensive report to be submitted to ASPE that will describe each method for identifying opioid-involved visits (i.e., code-based algorithm, DMI program, and NLP algorithm) and the results of an exploratory analysis of an enhanced approach that utilizes all three methods to identify opioid-involved visits from all available information on a given hospital encounter or death certificate</li> <li>Provide expert technical assistance and guidance regarding the development, refinement, application and functionality requirements for the multiple data element approach of the opioid identification system that incorporates the NLP-based algorithm with the code-based algorithm and the DMI program.</li><li>Work with NHCS staff and the research analyst to write abstracts, papers, and presentations for journals and conferences.</li><li>Work with NHCS staff and the research analyst in the development of the webinars and the publication of the journal supplement.</li><li> All reports should include methods and data analysis sections, copies of annotated SAS programs (if applicable), and conform to NCHS data dissemination standards.</li></ul>\n\n<ul>\n<li>A Ph.D. in quantitative or health field with 3 years of experience. Or same type of Master's with 10 years of experience.</li><li>Expertise in linguistics (computational linguistics preferred).</li><li>Experience building NLP algorithms/models for unstructured text (experience building algorithms/models for clinical text is preferred).</li><li>Expertise programming in NLP and text mining software/platforms, such as SAS Visual Text Analytics, SAS Contextual Analytics, Python, Java, or other comparable programming packages.</li><li>Experience with standard medical code systems (e.g., ICD-CM/PCS, CPT, HCPCS, LOINC, SNOMED, RxNORM) is beneficial.</li><li>Experience with electronic health record data is beneficial.</li><li>Additional skills required include good communication skills, both written and oral; good organizational skills; and good interpersonal skills.</li><li>Experience with SAS.</li><li>Optional: Programming experience in SQL is beneficial.</li>\n</ul>\nPM18\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}