{"job title": "Lead Data Scientist", "company": "Kforce", "city state": "– Boston, MA", "rating": "3.7", "job description": "<strong>RESPONSIBILITIES:</strong><br><br>Kforce's client in Boston, MA is looking for a Lead Data Scientist to join their project. \n<br><br>\nResponsibilities: \n\n\n<ul>\n<li> Develop algorithms and mathematical models that significantly improve our current ability to make decisions based on qualitative and quantitative data</li>\n\n<li> Continuously evolve advanced analytics techniques for forecasting and align the process and methodology across Geo's and functions</li>\n\n<li> Measure and continue to improve the predictive accuracy of models</li>\n\n<li> Partner with functional partners in planning, merchandising and product creation teams to drive adoption of analytical insights into their decision-making process</li>\n\n<li> Educate the organization on new analytical techniques and their applicability within the client</li>\n\n<li> Accessing and extracting data from client systems and support continued evolution of the client data capabilities</li>\n\n<li> Work with global partners across the organization to identify and articulate the value that can be derived from analytical models</li>\n\n<li> Work as a team player to improve data science methods and be a positive influence on team advancement</li>\n\n<li> Partner with our technology teams to ensure that once proven these algorithms are implemented in robust platforms to scale for deployment across the organization</li>\n\n<li> As required this person will perform tests and other tasks required to improve the functioning of our analytics platform</li>\n</ul>\n<strong>REQUIREMENTS:</strong>\n\n<ul>\n<li> MS degree or equivalent +5 years' experience in a quantitative field - Statistics, Economics, Advanced Analytics, Applied Mathematics, Decision Sciences, Computer Science, Engineering or other relevant quantitative fields; Ph.D. or equivalent preferred</li>\n\n<li> Rock solid data scientist with demonstrated experience in Machine Learning, AI or distributed systems development</li>\n\n<li> Significant expertise in machine learning algorithms, time series, forecasting, understanding natural language or unstructured data</li>\n\n<li> Strong technical and analytical skillset in one or more data science languages like R and Python</li>\n\n<li> Preferably, have machine learning publications, project code, or work on open source to share</li>\n\n<li> Experience with data processing and storage frameworks like Hadoop or S3, Snowflake, etc.</li>\n\n<li> Experience working with Business Intelligence, Analytics and Data Visualization tools, e.g. Tableau is a plus</li>\n\n<li> Understanding of principles and techniques of web analytics and an understanding of the KPIs that drive a digital retail business</li>\n\n<li> Experience working with Site Catalyst, Discover or Google Analytics is a plus</li>\n\n<li> Experience with agile software processes, data-driven development, reliability, and responsible experimentation</li>\n\n<li> Affinity with Sportswear and Lifestyle Footwear/Apparel is a plus</li>\n\n<li> Global experiences a plus</li>\n</ul>\n\nKforce is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status."}