{"job title": "Senior / Lead Data Scientist", "company": "Kforce", "city state": "– New York, NY", "rating": "3.7", "job description": "<strong>RESPONSIBILITIES:</strong><br><br>Kforce is working with a growing technology firm located in New York, New York (NY) that is seeking a Senior / Lead Data Scientist.\n<br><br>\nOverview:\n<br>\nThis is a newly created role that reports to the senior executive of the data science group. This firm's Data Insights group turns rows of numbers into tangible insights. We streamline and synthesize data that our clients use to make business decisions. The team is passionate about creating new products by looking at and combining data in unique ways for our clients. As a Data Scientist, you will help to spearhead the development of our analytics-focused products and provide new sources of revenue to new and existing clients. You will work with a range of interesting and proprietary data involving a high level of responsibility. Come and work with us for the opportunity to help build a market-leading data business. You will also lead a small team.\n<br><br>\nWhat You'll Do:\n\n\n<ul>\n<li> Strategically develop, deploy, and maintain methodologies that will help drive product offerings, including the application of various statistical modeling and time-series analysis techniques to build top-line, company specific metric predictions</li>\n\n<li> Research and build core understanding of sector and company performance metrics and market controversies to qualitatively inform and interpret models</li>\n\n<li> Support growth and professional development of a team of Junior Analysts</li>\n</ul>\n<strong>REQUIREMENTS:</strong>\n\n<ul>\n<li> Graduate or Undergraduate degree(s) in a qualitative field: CS, Math, Statistics, Engineering, etc.</li>\n\n<li> Advanced working knowledge of SQL, Java, C#, R, MATLAB or other languages/technologies for performing complex data modeling and analysis required</li>\n\n<li> Familiarity with and ability to apply the following concepts to solve data problems; natural language processing, machine learning, conceptual modeling, statistical analysis, predictive modeling, and hypothesis testing</li>\n\n<li> A hunger for solving complex, difficult big data problems with a sense of urgency</li>\n\n<li> Ability to explain complex data analysis techniques and technologies to clients and non-technical decision makers</li>\n\n<li> Interest in and knowledge of financial markets and trends</li>\n</ul>\n\nWhat We Have:\n\n\n<ul>\n<li> Competitive compensation</li>\n\n<li> Free snacks and beverages</li>\n\n<li> Excellent medical, dental, and vision coverage for you and your dependents</li>\n\n<li> 401(k) match, life insurance, commuter benefits, corporate gym rates, paid time-off and parental leave plans</li>\n\n<li> Friday happy hour and -Summer Fridays-</li>\n\n<li> Year-round corporate athletic league</li>\n\n<li> Casual work environment</li>\n</ul>\n\nKforce is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status."}