{"job title": "Data Scientist, Machine Learning for an Automotive Software Company", "company": "OSI Engineering", "city state": "– Santa Clara, CA", "rating": "4.9", "job description": "<strong>JOB DESCRIPTION:</strong>\n<br>\nSeeking a Data Scientist, Machine Learning for an Automotive Software Company in Santa Clara, CA\n<br><br>\nAs a member of the Data Team you will work on data analysis and predictive modeling of sensor data collected from the car and mobile phones. Looking for someone who will enjoy working as a “hands on” scientist with other data scientists and engineers on Data Mining and Predictive Modeling. You will work on many different projects involving different parts of the code base.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Code, test, deploy and maintain tools and applications for developing state of the art solutions.</li>\n<li>Automate large-scale data processing in distributed computing environment.</li>\n<li>Work closely with product management, user experience and engineering peers to determine feature requirements.</li>\n<li>Work on productizing exciting new research from the industry or academia and extracting value from large amounts of data generated from consumers using our service.</li>\n<li>Work both on improving existing software and creating entirely new components.</li>\n</ul>\n\n<strong>Required Skillsets:</strong>\n\n\n<ul>\n<li>Masters in Mathematics, Statistics, or Computer Science.</li>\n<li>2 + years experience with Machine Learning.</li>\n<li>Proficient in Java/Scala and Python A MUST.</li>\n<li>Strong Algorithmic development skills.</li>\n<li>Solid experience developing in a Linux/Unix environment including hands-on development experience with Big Data and modern analytics frameworks (Hadoop and Map Reduce, for example).</li>\n<li>Experienced in modern software development techniques (Test driven development, Agile).</li>\n</ul>\n\n<strong>Desired Skillsets:</strong>\n\n\n<ul>\n<li>PhD.</li>\n<li>Prior knowledge with Amazon EC2 or Google App Engine infrastructure and development/deployment of applications.</li>\n<li>Experience in programming for distributed computing environment.</li>\n<li>Experience working with Web tool development.</li>\n<li>Experience working with databases.</li>\n<li>Experience in building recommender systems</li>\n</ul>\n\nLocation: Santa Clara, CA\n<br>\nType: Fulltime\n<br><br>\n<strong>CONTACT INFORMATION:</strong>\n<br>\nSandra Montes\n<br>\nsandra@OSIengineering.com\n<br>\n(408) 550-2800 x108\n<br>\n<strong>OSIJOBS</strong>"}