{"job title": "Data Scientist/Engineer", "company": "Seagate Technology", "city state": "– Longmont, CO (US)", "rating": "3.0", "job description": "183862 Data Scientist/Engineer (Open)<br><br><strong>Job Title –</strong> Data Scientist/Engineer\n<br><br>\n<strong>About the Role – You will:</strong>\n<ul>\n<li>Develop and implement Hadoop/Spark-based solutions for parallelization of thousands of tasks.</li><li>Experiment with machine learning algorithms on large datasets.</li><li>Implement and tune complex machine learning models to extract actionable insights.</li><li>Develop workflows that combine various sources of data into useful information.</li><li>Develop and implement his/her own solutions.</li><li>Implement and unify team-developed solutions.</li>\n</ul>\n<strong>About Our Group</strong>\n<br><br>\nSeagate, a leader in Storage Technology, is seeking a Data Scientist/Engineer to join our Longmont, Colorado Design Center within the Field Quality Analytics team of the Customer Advocacy organization. Our Longmont facility serves as the base of operations for storage product development in hard disk drive and datacenter solutions markets. The Field Quality Analytics team is focused on delivering data-based solutions to improve decision making for product quality and manufacturing issues. The successful candidate will have an opportunity to work within a creative environment and be part of an energetic, fast-paced team of computer scientists, mathematicians, and engineers.\n<br><br>\n<strong>About You</strong>\n<ul>\n<li>Strong interpersonal and communication skills in order to effectively contribute to technical teams and make presentations to a variety of technical and business personnel.</li><li>Highly analytical thinking ability.</li><li>Driven to be challenge and make an impact in your profession.</li>\n</ul>\n<strong>Your Experience Includes:</strong>\n<ul>\n<li>Demonstrated skills in programming languages such as Python, Java and C++.</li><li>Good understanding and some experience with Hadoop/Spark-based solutions.</li><li>Experience with Linux systems.</li><li>Understanding of software development best practices.</li><li>Some experience using version control systems such as Git.</li><li>Some experience with statistics, applied mathematics and machine learning.</li><li>Bachelor’s Degree or relevant experience</li>\n</ul>\n<strong>Location –</strong> Longmont, CO\n<br><br>\n<strong>Travel:</strong> 0-10%<br><br>Job Family: Engineering Professional"}