{"job title": "Sr Data Scientist", "company": "T-Mobile", "city state": "– Bellevue, WA", "rating": "4.0", "job description": "Job Description:<br><br>Were a Bellevue, Wash. based national provider of wireless voice, messaging, and data, built on Americas fastest 4G LTE Network. Now covering 308 million Americans, we are growing faster than ever, while abolishing the restrictions, runarounds, overages, and over-promises by other wireless companies. Join our revolution to change the wireless industry for good. We arent afraid to break the rules, and we have fun doing it! Are you ready to lead the Uncarrier movement to the next level?\n<br><br>\nThe Team\n<br>\nWe are the Commercial Strategy and Decision Analytics team - a high profile team of outside-the-box thinkers who bring unrivaled analytic horsepower and critical thinking to T-Mobiles product and marketing organizations. We define the critical metrics and perform deep analysis to ensure T-Mobile delivers on its customer obsession while crushing its performance goals. Are you an inquisitive individual and ready to unleash your intellectual curiosity?\n<br>\nOur team provides strategic cross-functional solutions from ideation to implementation to reduce costs, and increase profitability across the enterprise<br><br>Responsibilities:\n<br><br>\nThe Data Scientist will act as one of the analytics team leaders owning and driving various cost savings and optimization initiatives leveraging advanced analytics to empower data-driven decision making.\n<br><br>\nPosition duties and responsibilities include, but are not limited to:\n\n\n<ul>\n<li>Develop, enhance and operationalize the key statistical models we use on a regular basis to understand prospect behavior to inform the development of strategic KPIs.</li>\n<li>Gather, cleanse and analyze data, build mathematical models, and develop solutions for strategic enterprise level problems - - Perform exploratory analysis to determine key business trends and correlations</li>\n<li>Apply predictive analytics to build optimization models with minimal oversight</li>\n<li>Apply statistical methodologies to large, complex data sets</li>\n<li>Building projections/forecasts and articulating the methods, formulas, and assumptions</li>\n<li>Building mathematical models that support business efficiency initiatives</li>\n<li>Foster relationships with key cross-functional partners and internal stakeholders; establish strong partnerships to obtain desired results on behalf of the team</li>\n<li>Explaining complex formulas to others who may not be experts in mathematics/ statistics. Communicate findings in a business context to stakeholders at various business and technical skill levels.</li>\n<li>Apply statistical techniques and mathematical skills to assess the probability of events and the financial and operational impacts to the business at an enterprise level</li>\n<li>Aid in data-driven decision making paired with forward-thinking business and industry trends. Participate in and prepare for sessions to identify the action-oriented hypotheses</li>\n<li>Effectively communicate methodologies, insights, and recommendations to leadership</li>\n<li>Create executive-level presentations and present complex analytics in a clear and concise manner</li>\n<li>Partner with upstream data suppliers and analytics partners to continuously increase efficiency from raw data extraction to insights and data-driven decisions</li>\n</ul>\n\n<strong>Qualifications:</strong>\n<br><br>\n<strong>Functional and technical skill requirements:</strong>\n\n\n<ul>\n<li>2+ years of progressive experience in advanced analytics required</li>\n<li>Bachelors degree in Data Science, Mathematics, or Statistics required. Masters preferred</li>\n<li>Proven experience with data mining, cleansing and manipulations, variable transformations, linear and non-linear multi-variable regression analysis, K-mean and hierarchical cluster analysis, discrete and continuous probability distributions, systems of equations and numerical analysis</li>\n<li>Proven exp using the cloud to do large computations</li>\n<li>Proven exp joining large data sets from various repositories</li>\n<li>Proven experience with 1 or more statistical programming languages: R, Python, Matlab, SAS.</li>\n<li>Experience with queries to extract and transform data from multiple data sources, including Oracle, Teradata, and SQL Server</li>\n<li>Experience utilizing Excel, PowerPoint, and other MS Office software</li>\n<li>Experience with 1 or more statistical analysis software: Minitab, Stata, SPSS, APT</li>\n<li>Knowledgeable about digital, E-commerce, marketing a plus</li>\n</ul>\n\n<strong>Company Profile:</strong>\n<br><br>\nAs Americas Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is redefining the way consumers and businesses buy wireless services through leading product and service innovation. The companys advanced nationwide 4G and 4G LTE network delivers outstanding wireless experiences for customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile US provides services through its subsidiaries and operates its flagship brands, T-Mobile and MetroPCS. For more information, please visit http://www.t-mobile.com\n<br><br>\n<strong>EOE Statement:</strong>\n<br><br>\nWe Take Equal Opportunity Seriously - By Choice\n<br><br>\nT-Mobile USA, Inc. is an Equal Opportunity Employer. All decisions concerning the employment relationship will be made without regard to age, race, ethnicity, color, religion, creed, sex, sexual orientation, gender identity or expression, national origin, marital status, citizenship status, veteran status, the presence of any physical or mental disability, or any other status or characteristic protected by federal, state, or local law. Discrimination or harassment based upon any of these factors is wholly inconsistent with our Company values and will not be tolerated. Furthermore, such discrimination or harassment may violate federal, state, or local law.\n<br><br>"}