{"job title": "DATA SCIENTIST - SENIOR", "company": "The Judge Group, Inc.", "city state": "– Creve Coeur, MO", "rating": "3.6", "job description": "Our client is currently seeking a DATA SCIENTIST - SENIOR No C2C, W2 only .\n<br><br>\nThe responsibilities of this position include development of research strategies for discovery projects in the Facility platform. The successful candidate will use the latest mathematical innovations to propose R&amp;D software solutions that accommodate emerging trends in data quantity and quality. The Data Scientist will design and test algorithms and conduct prototyping to evaluate possible scenarios leveraging computational and statistical techniques for the development of novel approaches for high-throughput data analyses. The successful candidate will have the opportunity to work collaboratively with interdisciplinary scientists internal and external to company, organize challenging problems, develop new solutions, and work with business &amp; development teams to ensure these solutions deliver value.\n<br><br>\n<strong>Required Skills:</strong>\n\n\n<ul>\n<li>PhD or (MS with 6 years of experience) in Mathematics, Statistics, Electrical/Mechanical/Environmental Engineering, Spatial Statistics, Geoinformatics, Environmental Modeling, Engineering, Computer Science, or Computational Biology</li>\n<li>Experience with data mining, statistical modeling and experimental design</li>\n<li>Experience analyzing and presenting complex data and proven problem solving abilities</li>\n<li>3+ years experience with Statistical and Mathematical programming packages (R, Matlab, SAS)</li>\n<li>Strong publication record in leading scientific journals o patents</li>\n<li>Strong organizational, interpersonal, and written communication skills</li>\n<li>Ability to work in a matrix environment, leading &amp; influencing people at varying levels of responsibility</li>\n</ul>\n\n<strong>Desired Skills:</strong>\n\n\n<ul>\n<li>Proficiency in Temporal Statistical Modeling including experimental design</li>\n<li>Experience working with agricultural/biological scientific data is highly desired</li>\n<li>Drive for translating business problems into research initiatives that deliver business value</li>\n<li>Creativity in defining challenging exploratory projects</li>\n</ul>\n\nJudge Group Job Order ID: 582415\n<br><br>\nSalary: Open\n<br><br>\n<strong>Company Description:</strong>\n<br><br>\nWorking at the crossroads of people and transformative technologies, The Judge Group delivers innovative business solutions powered by top talent to help organizations reach their strategic goals and realize opportunities now and in the future.\n<br><br>\nThe Judge Group is a leading professional services firm specializing in technology, talent, and learning solutions. Our services are successfully delivered through a network of more than 35 offices in the United States, Canada, China, and India. The Judge Group serves more than 40 Fortune 100 companies and is responsible for the placement of more than 4,500 professionals annually across a wide range of industries. To learn more, visit www.judge.com."}