{"job title": "Data Scientist 2", "company": "WEX", "city state": "– South Portland, ME", "rating": "3.1", "job description": "WEX Inc is a provider of payment processing and information management services spanning multiple industries including Fleet, Healthcare and Travel with headquarters across the globe, including in Maine, London, Rome and Singapore.\n<br><br>\nWith each of our industry segments come rich data ecosystems that are proving to be abundant veins of capabilities and insights allowing us to solve decade old problems and enabling our team to spearhead the launch of new products that help our customers understand, optimize and streamline their businesses while ensuring that WEX stays ahead of its competitors.\n<br><br>\nAs a data scientist on the ClearView team at WEX you will be at the heart of this product and insight revolution. You will be part of a highly energetic and innovative team that believes that nothing is impossible with creativity and hard work.\n<br><br>\nExperimentation and exploration are at the core of what you do. In this role, you will work to effectively turn business questions into data analysis and provide meaningful recommendations on strategy.\n<br><br>\nWe are looking for a high-energy self-starter with a passion for data science, attention to detail, and a positive attitude. You must enjoy diving deep into data sets and finding interesting patterns through analytical experiments run in a methodical way.\n<br><br>\n<strong>EssentialDuties and Responsibilities:</strong>\n\n\n<ul>\n<li>Conduct data analysis to make businessrecommendations</li>\n<li>Acquire, manage and use data to inform businessdecisions and product design</li>\n<li>Design models and statistical analyses to answerspecific questions for internal and external customers</li>\n<li>Deliver effective presentations of findings andrecommendations to multiple levels of leadership, creating visual displays ofquantitative information</li>\n<li>Build relevant ETL pipelines to transform rawdata and calculate model features</li>\n<li>Develop and automate algorithms, iterativelybuild and prototype dashboards to provide insights at scale, solving foranalytical needs</li>\n<li>Collaborate with engineering team to implementalgorithms in production and productize prototype R&amp;D solutions</li>\n<li>Construct and fit statistical, machine learningand optimization models</li>\n</ul>\n\n<strong>Minimumqualifications:</strong>\n\n\n<ul>\n<li>BA/BS degree in a quantitative field such ascomputer science, mathematics, statistics, economics, physics, psychology orsimilar quantitatively focused subject areas or job-related experience</li>\n<li>Ability to think creatively and solve problems</li>\n<li>Minimum of 2 years of relevant experience in datascience or advanced analytics</li>\n<li>SQL proficiency and experience working withrelational databases</li>\n<li>Track record of writing clear and well documentedcode for data analysis, preferably in Python</li>\n<li>Demonstrated experience with data visualizationtools and libraries such as Tableau, D3 and Matplotlib</li>\n<li>Excellent communication skills with the abilityto distill complex issues and analysis</li>\n<li>Track record of successful data science projects</li>\n<li>Ability of diving into data to discover hiddenpatterns</li>\n</ul>\n\n<strong>Preferredqualifications:</strong>\n\n\n<ul>\n<li>Distributed and cloud-based computing experience</li>\n<li>Experience with AWS Redshift, EMR, EC2, S3,Athena and Sagemaker</li>\n<li>Experience with Google Big Query, TensorFlow,Tensor Board and Keras</li>\n<li>Familiarity with common python data sciencelibraries such as NumPy, SciPy, Pandas and SK-learn</li>\n<li>Experience working with large datasets andknowledge about parallelization</li>\n<li>Strong background in data mining, machinelearning and statistical analysis</li>\n<li>Experience working in an agile softwaredevelopment environment</li>\n<li>Experience working with large sets of data, anddesigning of ETL flows</li>\n<li>Master's degree in quantitative field such asdata science, statistics, machine learning, AI would be a plus</li>\n</ul>\n\nMustpass a successful background investigation\n<br><br>\nWillingnessto travel on occasion in order to attend industry conferences and to conducton-site customer consultation visits.\n<br><br>\nAt WEX, we reward innovation, hard work and excellence.\n<br><br>\n<strong>Benefits include:</strong>\n\n\n<ul>\n<li>401(k) Plan</li>\n<li>Adoption Assistance</li>\n<li>Bonus Plan</li>\n<li>Dental Insurance</li>\n<li>Dependent Life Insurance</li>\n<li>Employee Assistance Program</li>\n<li>Employee Referral Award Program</li>\n<li>Expedition - WEX's Sabbatical Program</li>\n<li>Extended Parental Leave</li>\n<li>Flexible Spending Accounts (Medical and Dependent)</li>\n<li>Health Insurance</li>\n<li>Life Insurance/AD&amp;D</li>\n<li>On Site Fitness Facility in South Portland location</li>\n<li>Pet Insurance</li>\n<li>Paid Time Off(PTO)</li>\n<li>Short- and Long-Term Disability Programs</li>\n<li>Tuition Reimbursement</li>\n<li>Vision</li>\n</ul>\n\nEqual Opportunity Employer/Vets/Disability\n<br><br>\n<strong>#LI-GS1</strong>"}