{"job title": "Scientist - Chemistry", "company": "American Water", "city state": "– Belleville", "rating": "3.1", "job description": "Founded in 1886, American Water is the largest and most geographically diverse publicly traded U.S. water and wastewater utility company. With headquarters in Voorhees, N.J., the company employs 7,200 dedicated professionals who provide regulated and market-based drinking water, wastewater and other related services to an estimated 15 million people in 46 states and Ontario, Canada. To learn more about American Water and additional career opportunities, visit <strong>www.amwater.com.</strong><br>\n<div>Primary Role\n<br><br>\nThe Scientist is responsible for working with high performing teams across technical disciplines to deliver products, solutions and applications (e.g. novel approaches for water quality evaluation) that provide exceptional business value to users across water, wastewater, and water reuse. The Scientist will be responsible for 1) delivering high visibility, innovative and accurate products, services or solutions in a chosen domain area, and 2) supporting and contributing to leadership of research projects using agile methods in a fast-paced environment that may cross multiple business divisions. The Scientist will work under guidance from the Principal/Senior Scientist on large, complex enterprise-level projects requiring integration with other activities and divisions. The Scientist plays a technical and consultative role in the physical product/solutions/applications development in the Water Research and Development space and assist in solving complex problems in a scientific, technology or engineering domain. They contribute to defining the research direction for their domain and contribute to the creation and maintenance of a research and innovation agenda and roadmap to support American Water business needs. The Scientist adheres to research standards and the governance framework set by leadership.\n<br><br>\nKey Accountabilities\n<br><br>\nExecutes research and innovation projects within one’s own domain; tracks project budgets and costs.\n<br><br>\nParticipates in project progress meetings.\n<br><br>\nAssists in preparing technical information and major findings of research and innovation projects into clear, comprehensive written weekly or monthly reports, research reports.\n<br><br>\nContributes to articles in peer-reviewed journals and presentations in national and local conferences.\n<br><br>\nContributes to the development of new products and solutions by researching, developing prototypes or features of a product.\n<br><br>\nKeeps abreast of latest trends and happenings in one’s chosen domain.\n<br><br>\nParticipates in discussions regarding the research and innovation roadmap for a specific domain.\n<br><br>\nPartner with the operations as needed.\n<br><br>\nKnowledge / Skills\n<br><br>\nKnowledge:\n<br><br>\nWorking knowledge from among any combination of the following areas: water quality monitoring, sensors, nanotechnology, water/wastewater process, and/or water analytics, and applicability for the water and wastewater communities.\n<br><br>\nKnowledge of water and wastewater treatment process and water quality monitoring function, and how new processes are developed to improve treatment and operation.\n<br><br>\nKnowledge of operational and business needs of the water and wastewater industry.\n<br><br>\nKnowledge of the agile methodology and application in product development.\n<br><br>\nUnderstanding of utility industry and business unit regulatory environment – NOVs, GAAP, Rates, etc.\n<br><br>\nSkills:\n<br><br>\nAbility to execute research and innovation projects within one’s own domain related to water, wastewater and water reuse sector, including tracking of project budgets and costs.\n<br><br>\nAbility to interpret scientific data and apply results to development and refinement of physical products, services and solutions.\n<br><br>\nAbility to present technical information and major findings of research and innovation projects into clear, comprehensive written progress reports and research reports.\n<br><br>\nAbility to contribute to articles in peer-reviewed journals and presentations in national and local conferences.\n<br><br>\nAbility to ideate new products, services and solutions for water, wastewater, and water reuse industry.\n<br><br>\nAbility to translate scientific knowledge into product development pipelines and communicate the value of the product to internal and external customers or stakeholders.\n<br><br>\nAbility to conduct laboratory and field evaluations of physical products.\n<br><br>\nAbility to work with cross-functional teams to implement products and solutions across the business.\n<br><br>\nCompetencies\n<br><br>\nFunctional / Technical Skills\n<br><br>\nLearning on the Fly\n<br><br>\nOrganizational Agility\n<br><br>\nProblem Solving\n<br><br>\nTime Management\n<br><br>\nExperience / Education\n<br><br>\nExperience:\n<br><br>\nExperience in developing, testing and comparing lab-based and mobile water quality monitoring protocols or prototype devices (e.g., hand-held instrument, sensors) for the water/wastewater industry is desired. Other additional experience in integrating standardized and regulated analytical methodologies for water quality monitoring with novel approaches. Recent graduates in emerging technologies with strong knowledge of environmental/ water chemistry are encouraged to apply.\n<br><br>\nEducation:\n<br><br>\nDegrees equivalent to BS, MS, or PhD in Analytical or Environmental Chemistry; Environmental Science; Microbiology; Chemical, Environmental or Biomedical Engineering; Bioengineering; or related fields.\n<br><br>\nLicenses &amp; Certifications\n<br><br>\nKnowledge of Agile Method is desired but not required.\n<br><br>\nOther\n<br><br>\nStrong interpersonal skills including mentoring, coaching, collaborating, and team building.\n<br><br>\nStrong knowledge and understanding of business needs with the ability to establish/maintain high level of customer trust and confidence.\n<br><br>\nExcellent decision-making ability, balancing what is right with what is realistic.\n<br><br>\nFlexibility to adjust to multiple demands, shifting priorities, ambiguity, and rapid change.\n<br><br>\nDemonstrated ability to lead through influence and to deliver results through others while overcoming obstacles to success.\n<br><br>\nPossess a high energy level, sense of urgency, decisiveness, and an ability to work well under pressure.\n<br><br>\nPossess a curiosity and a passion towards engaging the imagination of line of business leaders in grasping and enabling the fundamentals of change.\n<br><br>\nDemonstrated ability to work and team with a multitude of different people from various lines of business as well as within Technology &amp; Innovation.\n<br><br>\nStrong verbal and written communication skills for a wide variety of audiences including proven ability to deliver conference presentations.\n<br><br>\nCreative approach to problem-solving with the ability to focus on details while simultaneously maintaining the \"big picture\" view.</div>\n<br><strong>Join American Water...We Keep Life Flowing</strong>™\n<br><br>\n<strong>American Water is firmly committed to Equal Employment Opportunity (EEO) and prohibits employment discrimination for employees and applicants</strong> <strong>based on his or her age, race, color, pregnancy, gender, gender identity, sexual orientation, national origin, religion, marital status, citizenship, or because he or she is an individual with a disability, protected veteran or other status protected by federal, state, and local laws.</strong>"}