{"job title": "Associate Scientist", "company": "Charles River Laboratories", "city state": "– Worcester, MA", "rating": "3.0", "job description": "Associate Scientist\n<br><br>\nReq ID #: 38681\n<br><br>\n<strong>Location:</strong>\n<br><br>\nWorcester, MA, US, 01605\n<br><br>\nFor nearly 70 years, Charles River employees have worked together to assist in the discovery, development and safe manufacture of new drug therapies. When you join our family, you will have a significant impact on the health and well-being of people across the globe. Whether your background is in life sciences, finance, IT, sales or another area, your skills will play an important role in the work we perform. In return, we?ll help you build a career that you can feel passionate about.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nWe are seeking an experiencedAssociate Scientist for ourDiscoverysite located inWorcester, MA.\n<br><br>\nThis position will be involved in all aspects of studies supporting the bioanalysis of drug molecules in multiple matrices. The position is hands-on, working in close cooperation with and under the guidance of more senior staff members in a fast-paced environment where a commitment to teamwork, quality data and speed is essential.\n<br><br>\n<strong>DUTIES AND RESPONSIBILITIES INCLUDE:</strong>\n<br><br>\n+ Independently perform routine procedures for sample preparation and analysis.\n<br><br>\n+ With guidance, perform non-routine procedures for sample preparation and analysis.\n<br><br>\n+ Understand and use analytical instrumentation for routine work.\n<br><br>\n+ Troubleshoot analytical instrumentation with the guidance of senior staff.\n<br><br>\n+ Identify and report difficulties with various aspects of extraction / analysis\n<br><br>\n+ Ensure that raw data records are accurate, complete, and in appropriate order.\n<br><br>\n+ Perform all other related duties as assigned.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nThe following are minimum requirements related to theAssociate Scientistposition.\n<br><br>\n+ Education: Bachelor?s Degree (B.S./B.A) or equivalent, preferably in a scientific related discipline.\n<br><br>\n+ Experience: One to three years related experience, preferably in a pharmaceutical or contract laboratory environment, and preferably also with experience performing bioanalysis by LC-MS/MS\n<br><br>\n+ An equivalent combination of education and experience may be accepted as a satisfactory substitute for the specific education and experience listed above.\n<br><br>\n+ Certification/Licensure: None.\n<br><br>\n+ Other: Demonstrated analytical and problem solving capabilities. Written and verbal communication skills. Ability to organize and prioritize work to meet deadlines under minimal direction. Proficiency in the use of standard software including Microsoft? Excel, Word, Powerpoint, etc. and with standard laboratory calculations.\n<br><br>\nAbout Discovery\n<br><br>\nDiscovery from Charles River is industry-proven in the successful development of novel therapies, with over 320 patents and 74 preclinical drug candidates delivered to our sponsors in the past 17 years. Backed by more than 650 scientists, our comprehensive, integrated portfolio employs the latest technology and platforms to provide chemistry, biology, and pharmacology services that support clients from the earliest stages of hit identification all the way through to IND. Our client-focused, collaborative approach creates true partnerships that anticipate challenges, overcome obstacles, and move us forward together on the journey of getting new drugs to market.\n<br><br>\nAbout Charles River\n<br><br>\nCharles River is an early-stage contract research organization (CRO). We have built upon our foundation of laboratory animal medicine and science to develop a diverse portfolio of discovery and safety assessment services, both Good Laboratory Practice (GLP) and non-GLP, to support clients from target identification through preclinical development. Charles River also provides a suite of products and services to support our clients? clinical laboratory testing needs and manufacturing activities. Utilizing this broad portfolio of products and services enables our clients to create a more flexible drug development model, which reduces their costs, enhances their productivity and effectiveness to increase speed to market.\n<br><br>\nWith over 11,000 employees within 70 facilities in 18 countries around the globe, we are strategically positioned to coordinate worldwide resources and apply multidisciplinary perspectives in resolving our client?s unique challenges. Our client base includes global pharmaceutical companies, biotechnology companies, government agencies and hospitals and academic institutions around the world. And in 2016, revenue increased by 23.3% to $1.68 billion from $1.36 billion in 2015.\n<br><br>\nAt Charles River, we are passionate about our role in improving the quality of people?s lives. Our mission, our excellent science and our strong sense of purpose guide us in all that we do, and we approach each day with the knowledge that our work helps to improve the health and well-being of many across the globe. We have proudly supported the development of ~70% of the drugs approved by the FDA in 2016.\n<br><br>\nFor more information, please visitwww.criver.com.\n<br><br>\nEqual Employment Opportunity\n<br><br>\nCharles River Laboratories, Inc. is an Equal Opportunity Employer M/F/Disabled/Vet"}