{"job title": "Microbiome Bioinformatics Postdoctoral Scientist", "company": "Colorado State University", "city state": "– Fort Collins, CO", "rating": "4.2", "job description": "Posting Detail Information\n<br><br>\nWorking Title\n<br>\nMicrobiome Bioinformatics Postdoctoral Scientist\n<br><br>\nResearch Professional Position\n<br>\nYes\n<br><br>\nPosting Number\n<br>\n<strong>201800414AP</strong>\n<br><br>\nPosition Type\n<br>\nAdmin Professional/ Research Professional\n<br><br>\nNumber of Vacancies\n<br><br>\nWork Hours/Week\n<br>\n<strong>40</strong>\n<br><br>\nProposed Annual Salary Range\n<br>\nCommensurate with experience.\n<br><br>\nDesired Start Date\n<br><br>\nPosition End Date (if temporary)\n<br><br>\nOpen Posting Date\n<br><br>\nOpen Until Filled\n<br>\nYes\n<br><br>\nTo ensure full consideration, applications must be received by 11:59pm (MT) on\n<br>\n<strong>07/15/2018</strong>\n<br><br>\nDescription of Work Unit\n<br><br>\nThe Department of Animal Sciences has the unique mission of serving Colorado?s large and diverse livestock industries. Research, teaching and extension outreach activities in the Department of Animal Sciences focus on developing industry leaders and improving profitable production of horses and food animals through the application of science and technology, resource management and food product enhancement, with emphasis on addressing societal issues concerning food safety, product quality and value, animal care and management, and environmental impacts of animal agriculture.\n<br><br>\nThis Metcalf lab is also part of a Microbiome Cluster Initiative hire at CSU. The goal for this faculty cluster hire of microbiome expertise is to create a dynamic, interactive and collaborative community across multiple departments and colleges. Find out more at http://microbiome.agsci.colostate.edu/.\n<br><br>\n<strong>Position Summary</strong>\n<br><br>\nThe microbiome bioinformatics postdoctoral position will analyze multi-omics data sets, including but not limited to: amplicon sequencing data, shotgun metagenomics data, and metabolomics data. The position will be responsible for leading analyses for a National Institute of Justice funded project (developing a microbial clock for estimating the postmortem interval) in addition to several, small pilot projects. Find out more about this lab?s research at jessicaLmetcalf.com. NIJ award abstracts can be found at: https://goo.gl/fzY7do and https://goo.gl/1qP2rg\n<br><br>\nThe postdoc will be expected to contribute to project management, as well as communicate findings at conferences and in peer-reviewed journals.\n<br><br>\nRequired Job Qualifications\n<br><br>\nPh.D. in bioinformatics, ecology, microbiology or similar field.\n<br>\nProficient in coding languages (Python preferred).\n<br>\nDemonstrated knowledge in microbiome science.\n<br>\nDemonstrated success in publishing in the microbiome and/or bioinformatics fields.\n<br><br>\nPreferred Job Qualifications\n<br><br>\nProficient in R software.\n<br>\nExcellent written communication skills.\n<br>\nExperience in leading projects through to publication.\n<br><br>\nDiversity Statement\n<br><br>\n?Reflecting departmental and institutional values, candidates are expected to have the ability to advance the Department?s commitment to diversity and inclusion.\n<br><br>\nEssential Duties\n<br><br>\nJob Duty Category\n<br>\nProject Management\n<br><br>\nDuty/Responsibility\n<br><br>\nThe postdoctoral scientist will be responsible for project management of a National Institute of Justice funded project as well as small pilot projects. This will require the postdoctoral scientist to lead project meetings, plan manuscripts, guide graduate students with analysis and manuscript plans, and communicate project timelines and results to collaborators. These tasks will be essential for the successful completion of projects.\n<br><br>\nPercentage Of Time\n<br>\n<strong>25</strong>\n<br><br>\nEssential Duties\n<br><br>\nJob Duty Category\n<br>\nResearch\n<br><br>\nDuty/Responsibility\n<br><br>\nThe postdoctoral scientist will be responsible for leading analyses for a National Institute of Justice funded project as well as small pilot projects. The postdoctoral scientist will analyze 16S rRNA and 18S rRNA amplicon data and shotgun metagenomics data, and assist on analyses of metabolomics data. The postdoctoral scientist will interpret and synthesize results by collaboratively writing manuscripts for peer-reviewed journals.\n<br><br>\nPercentage Of Time\n<br>\n<strong>60</strong>\n<br><br>\nEssential Duties\n<br><br>\nJob Duty Category\n<br>\nSupervision\n<br><br>\nDuty/Responsibility\n<br><br>\nThe postdoctoral scientist will help train students in the Metcalf lab on bioinformatics approaches.\n<br><br>\nPercentage Of Time\n<br>\n<strong>15</strong>\n<br><br>\nApplication Details\n<br><br>\nSpecial Instructions to Applicants\n<br><br>\nApplications will be accepted until the position is filled, but for full consideration, all materials must be received by Sunday, July 15, 2018. Applicants should upload the following: (1) A cover letter addressing your qualifications; (2) resume; and (3) contact information of three professional references, one of who is/was an immediate supervisor, who has firsthand knowledge of an applicant?s professional abilities. References will not be contacted without prior notification of candidates. For inquiries about the position, contact The.Metcalf.Lab@gmail.com. For additional information about Colorado State University, consult the university?s website at www.colostate.edu. For additional information about the Metcalf Lab, please consult www.jessicaLmetcalf.com.\n<br><br>\nConditions of Employment\n<br>\nPre-employment Criminal Background Check (required for new hires)\n<br><br>\nSearch Contact\n<br>\nThe.Metcalf.Lab@gmail.com\n<br><br>\nEEO Statement\n<br><br>\nColorado State University is committed to providing an environment that is free from discrimination and harassment based on race, age, creed, color, religion, national origin or ancestry, sex, gender, disability, veteran status, genetic information, sexual orientation, gender identity or expression, or pregnancy and will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. Colorado State University is an equal opportunity/equal access/affirmative action employer fully committed to achieving a diverse workforce and complies with all Federal and Colorado State laws, regulations, and executive orders regarding non-discrimination and affirmative action. The Office of Equal Opportunity is located in 101 Student Services.\n<br><br>\nThe Title IX Coordinator is the Executive Director of the Office of Support and Safety Assessment, 123 Student Services Building, Fort Collins, CO 80523 -2026, (970) 491-7407.\n<br><br>\nThe Section 504 and ADA Coordinator is the Associate Vice President for Human Capital, Office of Equal Opportunity, 101 Student Services Building, Fort Collins, CO 80523-0160, (970) 491-5836.\n<br><br>\nBackground Check Policy Statement\n<br><br>\nColorado State University (CSU) strives to provide a safe study, work, and living environment for its faculty, staff, volunteers and students. To support this environment and comply with applicable laws and regulations, CSU conducts background checks. The type of background check conducted varies by position and can include, but is not limited to, criminal (felony and misdemeanor) history, sex offender registry, motor vehicle history, financial history, and/or education verification. Background checks will be conducted when required by law or contract and when, in the discretion of the university, it is reasonable and prudent to do so.\n<br><br>\nReferences Requested\n<br><br>\nReferences Requested\n<br><br>\nMinimum Requested\n<br>\n<strong>3</strong>\n<br><br>\nMaximum Requested\n<br>\n<strong>3</strong>\n<br><br>\nSupplemental Questions\n<br><br>\nRequired fields are indicated with an asterisk (*).\n<br><br>\nApplicant Documents\n<br><br>\nRequired Documents\n<br><br>\n+ Cover Letter\n<br><br>\n+ Resume\n<br><br>\nOptional Documents"}