{"job title": "Staff Scientist, Immunotherapy", "company": "Fred Hutchinson Cancer Research Center", "city state": "– Seattle, WA", "rating": "4.1", "job description": "Overview\n<br><br>\nCures Start Here. At Fred Hutchinson Cancer Research Center, home to three Nobel laureates, interdisciplinary teams of world-renowned scientists seek new and innovative ways to prevent, diagnose and treat cancer, HIV/AIDS and other life-threatening diseases. Fred Hutch's pioneering work in bone marrow transplantation led to the development of immunotherapy, which harnesses the power of the immune system to treat cancer. An independent, nonprofit research institute based in Seattle, Fred Hutch houses the nation's first cancer prevention research program, as well as the clinical coordinating center of the Women's Health Initiative and the international headquarters of the HIV Vaccine Trials Network. Careers Start Here.\n<br><br>\nThe Program of Immunology and Clinical Research Division are seeking an experienced Staff Scientist to work in a collaborative environment to help develop and optimize novel TCR gene therapy products for clinical translation, and to support current and future TCR gene therapy clinical trials.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Cell and Molecular Biology: independently perform routine and non-routine experiments that are moderate to complex: Experiments include cell separation using the FACSorter and autoMACs, analyzing cell phenotype and function using techniques including flow cytometry, proliferation assays, PCR, RT-PCR, sequencing, chromium release assays and ELISpots, and viral transduction of human and mouse cells.</li>\n<li>Cell culture and tissue processing: Establishing and maintaining primary cell culture, including human DCs and long-term culture of human T cells</li>\n<li>Handle projects independently, including literature reviews to assist in determining most suitable methods to be used in research.</li>\n<li>Contribute to the preparation and presentation of written or oral reports concerning studies and assist in publication of results by proofreading, editing, and contributing ideas.</li>\n<li>Assist with the management and organization of a fast-paced lab, and perform other duties as assigned by supervisor as necessary.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>PhD in a related scientific field.</li>\n<li>Extensive scientific knowledge and acumen: In particular, an in depth understanding of immunology is required, and a solid knowledge of T cell biology is preferred.</li>\n<li>Extensive experienceof at least six years, especially in sterile cell culture techniques and flow analysis, including experience in maintaining long term primary cell cultures, particularly T-cells and/or DCs.</li>\n<li>Strong analytical and organizational skills: Ability to identify problems and troubleshoot solutions with limited direction in a fast-paced, goal-oriented environment with the ability to analyze data statistically and present it logically.</li>\n<li>Excellent oral and written communication skills; good interpersonal communication and organizational skills; and flexibility to work in a highly collaborative team environment and interact effectively with different cross-functional groups and potential collaborators on a daily basis.</li>\n</ul>\n\nOur Commitment to DiversityWe are committed to cultivating a workplace in which diverse perspectives and experiences are welcomed and respected. We are proud to be an Equal Opportunity and VEVRAA Employer. We do not discriminate on the basis of race, color, religion, creed, ancestry, national origin, sex, age, disability, marital or veteran status, sexual orientation, gender identity, political ideology, or membership in any other legally protected class. We are an Affirmative Action employer. We encourage individuals with diverse backgrounds to apply and desire priority referrals of protected veterans. If due to a disability you need assistance/and or a reasonable accommodation during the application or recruiting process, please send a request to our Employee Services Center at escmail@fredhutch.org or by calling 206-667-4700."}