{"job title": "Data Insights Team- Senior Data Engineer", "company": "fuboTV", "city state": "– New York, NY", "rating": "5.0", "job description": "<div>\n<div><strong>Who we are:</strong>\n<br><br>\nfuboTV is the fastest growing video streaming startup (backed by some of the world's largest media companies) that is reinventing live television for the sport fan and cord cutting era.\n<br><br>\nOriginally founded as a soccer streaming service, fuboTV is the leading sports-first TV streaming service in the U.S, growing to over 100,000 paying subscribers.\n<br><br>\nfuboTV broadcasts most NFL, MLB, NBA and NHL games, all major soccer leagues, and a wide range of college and other sports. The company also broadcasts a wide variety of movies and entertainment programming including the FOX and NBC broadcast catalogs, Showtime, AMCand much more to come! fuboTV can be accessed on multiple platforms, including web, Android, iOS, tvOS, Fire TV, Android TV, Roku and Chromecast.</div><br>\n\n<div><strong>About the Role:</strong></div><div>fuboTV is looking for exceptional Data Engineers with a passion for processing data at scale with speed.</div>\n<br>\n<div>As a Data Engineer you will get to build highly-available systems, ingest troves of data, and help power our cutting edge experiences on Android, iOS, Web, Roku, and FireTV. fuboTV's data team has a unique opportunity to build and continuously improve greenfield services.</div>\n<br>\n<div>We are looking for Data Engineers who care about code quality, uptime, performance, continuous deployment, SOLID design principles, test-driven development, and agile methodologies.</div><br>\n\n<div><strong>Our tech stack:</strong></div><div>Go/Golang with govendor</div> \n<br>\n<div>Docker and Kubernetes</div>\n<br>\n<div>Apache Beam with Java/Scala</div>\n<br>\n<div>Redis, Google PubSub, BigTable, BigQuery, MongoDB, and PostgreSQL</div><br>\n\n<div><strong>fuboTV Software Engineers have the following responsibilities:</strong></div>\n<ul>\n<li>Architect, design, develop, test, maintain and improve data pipelines and systems</li>\n<li>Collaborate with other engineers and members of the fuboTV team to determine priorities and best practices, and refine functional requirements</li> \n</ul>\n\n<div><strong>All fuboTV Data Engineers must:</strong></div>\n<ul>\n<li>Have 4+ years of experience in delivering working software.</li>\n<li>Experience in processing and serving data at scale</li>\n<li>Write clean, well-tested code</li>\n<li>Be familiar with BigData pipelines for batch and realtime streaming</li>\n<li>Have experience with distributed processing frameworks, filesystems, NoSQL databases (Hadoop, AWS, Google ecosystems)</li>\n<li>Experience working closely with data scientists to production-ize machine learning algorithms</li> \n\n<li>Have mastery of at least one modern backend stack, with a willingness to learn new technologies and methodologies</li>\n<li>Requires at least a Bachelor's Degree in Computer Science, Engineering, Information Technology, Management Information Systems (MIS), Computer Information Systems (CIS) or related field or equivalent as determined by a professional credentials evaluation.</li> \n</ul>\n<strong>Perks &amp; Benefits:</strong>\n\n<ul>\n<li>fuboTV provides a highly competitive compensation based on experience and market standards.</li>\n<li>Robust benefit package including stock options, Health/Dental/Vision coverage sponsored up to 100% for employees, 401k, Life Insurance, and commuter benefits</li>\n<li>Free Premium fuboTV Account</li>\n<li>Health and Wellness initiatives including discounts on Gym Memberships.</li>\n<li>Unlimited PTO days and regular company-wide activities.</li>\n<li>fuboTV's main Headquarters are located in Midtown Manhattan.</li>\n</ul>\n\n</div>\n<br>"}