{"job title": "Sr. Scientist, Image Scientist", "company": "Harris Technology", "city state": "– Rochester, NY", "rating": "NA", "job description": "Recognized as an external and internal expert and thought leader with deep and substantive technical expertise as well as advanced business knowledge and leadership capabilities.\n<br>\nCommunicates with contacts inside and outside of the organization on matters of strategic importance to influence executive leadership on new concepts, practices, and approaches.\n<br>\nEstablishes overall direction for new processes, systems, and solutions.\n<br>\nRecommends and implements strategies and develops operational plans/goals with direct impact to the achievement against functional strategies.\n<br>\nResponsible for establishing the direction for new processes, systems, solutions, and products using significant conceptualization, reason, and interpretation. Solutions are innovative and often define best practice for the future.\n<br>\nOpportunities for problem solving and innovation are regularly complex, requiring broad-based consideration of variables that impact multiple areas of the organization.\n<br>\nExtensively analyzes implications of both near and long-term implications of solutions.\n<br>\nInvestigates, analyzes and provides solutions to complex problems encountered by engineering services and quality control using standard engineering practices.\n<br>\nAuthors technical documents and presentations.\n<br>\nQualifications:\n<br><br>\nBachelor’s Degree with a minimum of 15 years of prior related experience or a Graduate Degree with a minimum of 13 years of prior related experience.\n<br>\nAn Active TS/SCI Clearance\n<br><br>\nPreferred Additional Skills:\n<br><br>\nPhD in Optics, Physics, Imaging Science or Engineering equivalent.\n<br>\nAdvanced knowledge of passive remote sensing systems\n<br>\nAdvanced knowledge of ground processing architectures and image processing algorithms for passive remote sensing systems\n<br>\nA thorough understanding of image processing techniques and software tools.\n<br>\nA proven ability to shape technical strategies and roadmaps simultaneously advancing corporate capabilities and achieving annual business metrics.\n<br>\nA proven ability to incorporate cutting edge technologies to develop new/novel methods of distilling remote sensing data down into actionable intelligence.\n<br>\n20 years of experience working with customer remotely sensed data\n<br>\nExperience with ENVI/IDL programming, MATLAB, Python, UNIX based scripting, and/or C++ programming.\n<br>\nExperience working on proposals as Technical Author or Capture Manager.\n<br>\nExperience as a Technical Lead and/or Chief Architect developing technical solutions for EXP customer, defining processing architecture, and leading development of high-end ground processing algorithms.\n<br>\nExperience in corporate strategic planning, providing technical oversight of IRAD while incorporating novel methods to solve customer problems in alignment with business/strategic objectives.\n<br>\nExperience working on proposals as Technical Author or Capture Manager for Harris EXP customer.\n<br>\nExperience with Advanced Geospatial Intelligence (AGI) and FSG (Full Spectrum GEOINT).\n<br>\nExperience with analysis, exploitation, advanced processing of Visible and IR electro-optical (EO) systems."}