{"job title": "Senior Data Scientist, Emerging Products", "company": "Instacart", "city state": "– San Francisco, CA", "rating": "3.5", "job description": "Instacart is building the best way for people anywhere in the world to shop for groceries. Since Instacart started in 2012, we've launched same-day delivery in 200 US markets. We are laser focused on delivering groceries from your favorite stores right to your door. We now cover over 60% of US households and aim to have 80% coverage by the end 2018that's 90 million households! From a technology point of view, the platform is complex, rapidly scaling and processing millions of transactions in real-time all of the time. Our technology coupled with operational expertise enables Instacart to deliver fresh groceries in as little as an hour. This is a difficult problem to master and we are making it happen. Every day, we solve incredibly hard problems to create an experience for our customers that is absolutely magical.\n<br><br>\n<strong>What you'll be doing:</strong>\n<br>\nAs an data scientist on our rapidly growing team, you will have the opportunity to make a large impact at Instacart. You will be embedded within our data driven emerging products team to test, validate, and optimize new, big products. You will identify key metrics, design experimentation, conduct deep and rigorous analysis, and deliver insights to the team for product improvement. You will be a trusted partner in the team tackling the toughest and most impactful analytical problems while making the data accessible to your teammates. More details on what you'll be doing:<ul>\n<li>Conduct quantitative research and analysis of our \"big bet\" products requiring complex data retrieval that results in actionable insights and recommendations</li>\n<li>Identify key questions, problems, and KPIs using your sharp business acumen and judgment</li>\n<li>Design and analyze rigorous a/b experiments</li>\n<li>Work daily with product managers, engineers, and designers to discover and guide the most impactful product investments</li>\n<li>Provide access to data through dashboards and other analytical tools to empower your team through self service. Look for opportunity to automate insights through alerting and anomaly detection</li>\n<li>Develop and deliver on the consumer analytics roadmap</li>\n</ul>\n<strong>What you should already have:</strong>\n\n<ul>\n<li>Passion for, and track record of leveraging data for business impact, preferably in a consumer product facing digital environment</li>\n<li>Ability to write complex and performant queries in your dialect of SQL to extract data from our Redshift cluster</li>\n<li>Experience building tools and automated processes to extract, clean, and distill data in a procedural language of your choice such as Python, Julia or R</li>\n<li>Understanding of A/B testing and other forms of statistical analysis using statistical packages similar to R, SAS, or Pandas</li>\n<li>Excellent communication skills with the ability to distill complex problems into digestible insights</li>\n<li>Effective data visualization skills with analytical tools such as Tableau, Looker, D3.js or other tools</li>\n<li>Growth mindset; the ability to thrive in a dynamic and collaborative environment</li>\n<li>Experience leading cross-team / cross-functional analytical projects</li>\n</ul>\n<strong>Bonus Points:</strong>\n\n<ul>\n<li>Data modeling, ETL and data pipeline development experience</li>\n<li>Advanced degree in statistics or other quantitative field</li>\n</ul>\n<strong>In your application, please describe the most impactful research project you have been a part of. Describe the problem, outcome/impact and your role in the project.\n<br><br>\nBenefits</strong>\n\n<ul>\n<li>Talented and collaborative coworkers who will both push and support you</li>\n<li>Personal growth plans that let you stretch yourself or grow in new directions</li>\n<li>Market competitive salary, equity</li>\n<li>Medical, dental, vision benefits and 401(k) retirement plan</li>\n<li>Great office in downtown SF</li>\n<li>Take what you need vacation ( and we really mean it )</li>\n<li>16 weeks maternity leave / 8 weeks paternity leave so you can truly bond with your child</li>\n</ul>\n<strong>Resources</strong>\n\n<ul>\n<li><strong>Spotlight on our Data Team</strong></li>\n<li><strong>Team Culture</strong></li>\n</ul>"}