{"job title": "Research Scientist - Assay Development", "company": "Invitae", "city state": "– San Francisco, CA", "rating": "4.1", "job description": "<div>\n<div>\n<div>We have an opening on our assay development team for a skilled development scientist who has experience with Next-Generation Sequencing (NGS). The assay development team designs and develops fully-automated, high-throughput next generation sequencing-based genetic tests from concept through commercial launch. Our team strives to create a highly collaborative environment, with an emphasis on cross-functional projects and teams. We continually assess and integrate cutting-edge technology into our laboratory and development process. You will play a key role in early development work on new assays and features to move toward our goal to make affordable and comprehensive genetic testing a reality.<br><br>What you will bring:\n\n\n<ul>\n<li>Experience with and understanding of high throughput sequencing instruments (Illumina, PacBio)</li>\n<li>Requires minimal scientific guidance beyond project goals and can design/execute experiments independently</li>\n<li>Extensive molecular biology experience</li> \n\n<li>Understanding of human genetics, particularly classes of genetic variation and their intersections with cutting edge molecular technologies</li>\n<li>Master's degree and/or Ph.D. with at least 2 years of industry experience</li>\n<li>Demonstrated ability to optimize processes and complex reactions</li>\n<li>Exquisite attention to detail and organization</li>\n<li>Ability to multitask and operate in a dynamic environment</li>\n<li>Preferred: Assay or technology development experience</li>\n<li>Preferred: Experience with high throughput liquid handlers</li>\n<li>Preferred: Performing analysis of large genetic data sets, use and understanding of common NGS analysis toolkits (gatk, bedtools, samtools), Unix, R, Python</li>\n<li>Location: SF (5 days/week)</li>\n</ul>\n\n</div>\n</div>\n</div>\n<br><em>At Invitae, we value diversity and provide equal employment opportunities (EEO) to all employees and applicants without regard to race, color, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance.</em>"}