{"job title": "Research Scientist-Statistician", "company": "Lilly", "city state": "– Greenfield, IN", "rating": "3.8", "job description": "**43661BR**<br> <br>**Responsibilities:**<br> <br><br> <br>The successful candidate will be responsible for providing statistical support to multiple research and development projects in pursuit of global registrations of novel animal health products. He/she will participate on project teams and will be accountable for the design and analysis of clinical and laboratory trials. The candidate will author the statistical component of study protocols and reports, providing guidance as to data collection and retrieval, prepare randomization schedules, perform sample size calculations as well as plan and execute the statistical analyses. The ideal candidate will seek to innovate and refine our statistical approaches to improve our efficiency and speed in which we develop novel animal products, while keeping global regulatory requirements in mind.<br> <br><br> <br>The candidate will also lead or collaborate on responses to enquiries from global regulatory agencies and assist on scientific publications.<br> <br><br> <br>The individual in this role is expected to perform key leadership responsibilities which provide innovative solutions, a positive and motivating work environment, thereby ultimately delivering the pipeline.<br> <br><br> <br>Key Objectives/Deliverables:<br> <br><br> <br>+ Develop statistical methods, analyze data and write statistical reports to achieve team objectives within agreed upon timelines. Provide input into development timelines regarding statistical tasks.<br> <br>+ Provide scientific input on the design of study protocols (i.e. efficacy, safety, palatability, post marketing).<br> <br>+ Interact with Data Management group(s) to ensure data collected in an appropriate format.<br> <br>+ Liaise with other members of companion animal product development regarding the resolution of any data issues and transfer of data for statistical analysis.<br> <br>+ Coordinate with internal and external statisticians, analysts and programmers with regard to the planning and execution of statistical aspects of laboratory and clinical trials.<br> <br>+ Maintain proficiency with respect to SAS programming.<br> <br>+ Coordinate and liaise with external organizations or internal colleagues to meet statistical resourcing needs.<br> <br>+ Analyze, summarize and interpret data from studies conducted by the project team.<br> <br>+ Responsible for the preparation of statistical tables, listings, figures, reports, or other information required for inclusion in study reports, statistical reports, internal/external presentations and publications.<br> <br>+ Contribute to or co-author the writing of study reports.<br> <br>+ Provide technical support and or consultancy for other R&amp;D teams as a Subject Matter Expert in statistics.<br> <br>+ Contribute in the preparation of regulatory submissions and responses.<br> <br>+ Assist in the development and review of relevant Elanco Functional Practices and guidance documents.<br> <br>+ Actively participate in the statistical Community of Practice; maintain current knowledge of publications and scientific progress in areas of applied statistics and biostatistics.<br> <br>+ Develop and maintain expertise in relevant veterinary pharmaceutical areas.<br> <br>+ Provide statistical expertise by participating in Global Regulatory Agency interactions.<br> <br>+ Devise and promote the use of improved and/or innovative scientific and statistical methodologies.<br> <br>+ Promote a collaborative environment and entrepreneurial mindset by exhibiting the Elanco values.<br> <br>+ Ensure scientific integrity in all activities. <br> <br><br> <br><br> <br><br> <br><br> <br>**Req ID:**<br> <br><br> <br>43661BR<br> <br><br> <br>**Additional Skills/Preferences:**<br> <br><br> <br>+ Good understanding of GXP and quality principles<br> <br>+ Animal Health or Pharmaceutical experience preferred<br> <br><br> <br><br> <br>**Additional Information:**<br> <br><br> <br>+ This role is for either Greenfield, Indiana or Basel Switzerland corporate offices (req #44121BR). Also, it can be a telecommuter role in USA or Europe<br> <br>+ Lilly is an EEO/Affirmative Action Employer and does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.<br> <br>+ <br><br> <br><br> <br>**Workplace Arrangement:**<br> <br><br> <br>Local<br> <br><br> <br>**Location Details:**<br> <br><br> <br>Telecommuter<br> <br><br> <br>**Title:**<br> <br><br> <br>Research Scientist-Statistician (Telecommuter Role)<br> <br><br> <br>**Job Category:**<br> <br><br> <br>Animal Health<br> <br><br> <br>**Basic Qualifications:**<br> <br><br> <br>+ Ph.D. in Statistics, Biostatistics or related scientific discipline with 4 years industry experience, or<br> <br>+ MS in Statistics, Biostatistics with 10 years experience <br> <br><br> <br><br> <br>**Company Overview:**<br> <br><br> <br>Elanco is a global research-based Company that develops and delivers product and services to enhance animal health and production. We value innovation, both in scientific research and daily operations, and strive to cultivate a collaborative work environment for more than 7,000 employees worldwide. Founded in 1954, Elanco is a division of Lilly. Our worldwide headquarters and research facilities are ln Greenfield, Indiana.<br> <br><br> <br>**City:**<br> <br><br> <br>Greenfield, telecommuter<br> <br><br> <br>**Country:**<br> <br><br> <br>USA<br> <br><br> <br>**State / Province:**<br> <br><br> <br>Indiana<br> <br><br> <br>**Region:**<br> <br><br> <br>North America"}