{"job title": "Environmental Scientist I - EC", "company": "Louisville Gas &amp; Electric", "city state": "– Louisville, Kentucky", "rating": "3.9", "job description": "Title Environmental Scientist I - EC\n<br><br>\nRequisition ID 4520BR\n<br><br>\nAddress 220 W Main Street\n<br><br>\nCity Louisville\n<br><br>\nState Kentucky\n<br><br>\nJob Function Environmental\n<br><br>\nPosition Purpose Fulfill professional level duties/assignments to ensure Company facilities comply with environmental monitoring, testing and reporting regulations. Performs assignments that are broad in nature and moderately difficult under immediate supervision using established procedures and practices.\n<br><br>\nRequired Education &amp; Experience\n<br>\nBachelor's degree in science or engineering discipline or an alternate combination of education and experience which results in equivalent job knowledge. Zero to three years of environmental related work experience.\n<br><br>\nMust be able to process environmental data and plant control equipment conditions to assess environmental performance, etc. Must possess knowledge of environmental theories, principles, and practices.\n<br><br>\nExperience with stack testing and reference methods required. Experience with StackVision and ECMPS regulatory reporting required.\n<br><br>\nPreferred Qualifications\n<br>\nWork independently on a variety of environmental tasks, assignments, programs. Ability to accurately interpret environmental monitoring and reporting regulations and implement compliance activities. Ability to maintain and pursue productive and innovative activities with minimal supervision. Excellent interpersonal skills and verbal/written communication skills.\n<br>\nExcellent skill with Excel preferred.\n<br>\nKnowledge of power plant operations/equipment preferred.\n<br>\nHands-on experience with maintenance of CEMS instruments desirable.\n<br>\nQSTI Certification in Groups One to Four, with 1-2 years of stack testing experience is desirable.\n<br><br>\n<strong>Job Description</strong>\n<br>\nAssists in developing emission data analysis and regulatory report preparation.\n<br>\nAssists in providing environmental monitoring related QA/QC activities.\n<br>\nAssist in the review and analysis of proposed/existing environmental monitoring and reporting legislation/regulations.\n<br>\nAssists with installation, communications, troubleshooting and certification testing if Continuous Emissions Monitoring instruments, dataloggers and data acquisition system.\n<br>\nParticipates with the Stack Testing team on all facets of reference testing of particulate, mercury, stack flow, gas emissions, HCl, and as requested.\n<br>\nAssure safety regulations are observed and all emission testing personnel (including contractors) are aware of hazards. Report all unsafe conditions to plant manager or his designate.\n<br>\nAll other duties and projects as assigned.\n<br><br>\nWork Conditions\n<br>\nAnnoyable power plant exposure to stress, dirt, dust, heat, cold, noise, etc. Some work is performed at elevations of 500 feet or more above ground level. Expect to be accessible during off hours through pagers, cell phones, etc. Occasional overnight travel may occur.\n<br><br>\nPhysical Effort Frequent activity in the plant environment that involves frequent standing, climbing ladders, walking, or driving. Must be able to work on grating at high elevations. Ability to climb or descend up to 500 feet (though most facilities are equipped with elevators). Ability to lift and carry 50 pounds."}