{"job title": "Principal Scientist, InvestigativeToxicology", "company": "Pfizer", "city state": "– La Jolla, CA", "rating": "3.9", "job description": "<ul>\n<li>*ROLE SUMMARY**</li>\n</ul>\n\nWe are seeking a highly motivated and accomplished laboratory scientist/investigator to join our nonclinical research team in Global Investigative Toxicology/Drug Safety Research and Development (DSRD), La Jolla Laboratories. The primary responsibility of Global Investigative Toxicology is to design and carry out investigative studies to position toxicity findings for molecules in preclinical and clinical development. These efforts include hypothesis-driven mechanistic studies and the development of novel in vitro models and fit for purpose assays. We are seeking a PhD level research scientist with strong critical thinking skills and demonstrated track record for scientific publications and presentations, with expertise and experiences in cellular and molecular biology. Strong research background in novel in vitro model development and relevant translatable endpoint implementation are highly desired.\n\n\n<ul>\n<li>*ROLE RESPONSIBILITIES**</li>\n</ul>\n\n+ Reports to a Director in Global Investigative Toxicology\n<br><br>\n+ Leads mechanistic /investigational scientific strategy development, participates in issue management teams, independently carries out hypothesis-driven investigative study design, conduct and interpretation of research results\n<br><br>\n+ Develops novel in vitro methods and fit for purpose endpoints that can be used to address toxicity findings/screen subsequent molecules to eliminate toxicity\n<br><br>\n+ Generates high quality laboratory-based investigative data to support portfolio progression and/or mechanistic understanding of toxicity findings\n<br><br>\n+ Analyzes, documents and reports laboratory data in accordance with company standards and procedures\n<br><br>\n+ Effectively communicates experimental findings in both oral and written formats\n<br><br>\n+ Functions collaboratively as part of a global multi-disciplinary team\n\n\n<ul>\n<li>*QUALIFICATIONS**</li>\n</ul>\n\n+ PhD degree in Pharmacology, Toxicology, Cell or Molecular Biology, or a related field; post-doctoral experience highly desirable; 2-4 years of industry experience preferred\n<br><br>\n+ Expertise with mechanistic investigation of toxicity findings and fit for purpose in vitro model and novel endpoints development, with a strong track record of peer-reviewed publications, scientific presentations (e.g. abstracts, posters, podium presentations) related to investigative toxicology\n<br><br>\n+ Deep knowledge of standard laboratory assays such as primary cell culture, biochemical assays, genomics, western blotting, flow cytometry, basic high content imaging, targeted gene knockdown techniques\n<br><br>\nEEO &amp; Employment Eligibility\n<br><br>\nPfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.\n<br><br>\nSunshine Act\n<br><br>\nPfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider's name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.\n\n\n<ul>\n<li>*Other Job Details:**</li>\n</ul>\n\n+ **Last Date to Apply for Job:** October 15, 2018\n<br><br>\n+ Eligible for Relocation Package: yes\n<br><br>\n+ Eligible for Employee Referral Bonus: yes\n<br><br>\nPfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates."}