{"job title": "Research Scientist - Audio", "company": "Pindrop", "city state": "– Atlanta", "rating": "4.0", "job description": "Our Research team continues to expound upon the work of our CEO’s PhD thesis. As a researcher at Pindrop, your work will make an immediate impact for today’s products and our future roadmap.<br><br><strong>what you'll do</strong>\n\n\n<ul>\n<li>Work with customer data to build and tune machine learning models to catch anomalies in audio</li>\n<li>Build upon Pindrop’s product and patent portfolio to advance machine learning models</li>\n<li>Consistently tune model features in order to improve accuracy of our flagship fraud detection product</li>\n<li>Spend time doing your own research in order to contribute to tweaks in the software or for future processes</li>\n<li>In addition to fighting the bad guys, work in an environment that feeds innovation, supports learning, recognizes style, and rewards effort</li>\n</ul>\n\n<strong>who you are</strong>\n\n\n<ul>\n<li>Algorithm implementation in Python and C++</li>\n<li>Fluent with scripting (Python preferred)</li>\n<li>Fluent with the Linux command line (Ubuntu preferred)</li>\n<li>Familiar with machine learning concepts, ideally with applied machine learning and/or data mining</li>\n<li>Competent in at least one database system (MySQL preferred)</li>\n<li>Able to articulate complex technical concepts to non-technical parties</li>\n<li>Strong communication skills and able to effectively communicate with external customers</li>\n<li>MS degree minimum, PhD preferred</li>\n</ul>\n\n<strong>what we offer</strong><br><br>As a part of Pindrop, you’ll have a direct impact on our growing list of products and thus the future of security in the voice driven economy. We hire great people and take care of them. Here’s a snapshot of benefits we offer:\n\n<ul>\n<li>Recognized top employer\n\n\n<ul>\n<li>AJC Top Workplaces 2017</li>\n<li>51 Startups to Bet Your Career On</li>\n<li>50 Startups That Will Boom in 2018</li>\n</ul>\n\n</li>\n<li>Health plans and 401k</li>\n<li>Continued education budget</li>\n<li>Flex schedules</li>\n<li>Best in class tools</li>\n<li>Paid commuter options</li>\n<li>Fun outings to celebrate our accomplishments as a team</li>\n<li>All the good karma you can rack up for fighting bad guys (our conference rooms are named after the ones we’ve busted)</li>\n</ul>\n\n<strong>who we are</strong><br><br>Pindrop is a company founded on research and continues to innovate new ideas to market. Our solutions are leading the way to the future of voice by establishing the standard for security, identity, and trust. Pindrop products secure the future of voice, making technology more human from the call center to IoT devices.<br><br><strong>what we live by</strong><br><br>Pindrop is driven by our DEPTH values. These are reflected in our goals and the base of our team’s peer awards.\n<br><br>\nAct with <strong>D</strong><strong>eliberate</strong> urgency.\n<br>\nCreate <strong>E</strong><strong>vangelical</strong> customers.\n<br>\n<strong>P</strong><strong>assionate</strong> about the fight.\n<br>\nPlaying for the <strong>T</strong><strong>eam</strong>.\n<br>\nMake <strong>H</strong><strong>ard</strong> easy.\n<br><br>\nPindrop is an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}