{"job title": "Principal Scientist - Bonded Abrasives", "company": "Saint-Gobain", "city state": "– Northborough, MA", "rating": "3.8", "job description": "Saint-Gobain?s North American R&amp;D center is looking for a driven, talented, and experienced researcher to join our current team in conducting research, developing technical base, and formulating strategy for future research within the group. Projects will focus on improvement of processes, performance and product development activities related to Saint-Gobain's extensive product line for Abrasives.\n<br><br>\nAs a Principal Scientist, the candidate will be expected to effectively leads cross functional teams by managing (either directly or indirectly) others to execute and deliver project objectives. The candidate will be expected to lead R&amp;D projects in the areas of applications technology and process measurement, collaborate effectively with R&amp;D colleagues, product managers, product engineers, application engineers and external customers, create and execute project plans, design and conduct experiments, analyze data, and present findings in written and oral formats. Candidate is also expected to play a role in proposing projects and programs vital to the R&amp;D direction of the group. Further the candidate with be responsible for developing direct reports and others within group.\n<br><br>\n+ Utilizes broad technical background and experience to develop and/or improve products, processes, and performance and/or reduce costs within a major product area.\n<br><br>\n+ Stays aware of new technology applications and competitive uses of same in work with materials, products and processes, and in development of new knowledge and applies this to personal research/ products.\n<br><br>\n+ Demonstrates open and collaborative approach in all areas of responsibility.\n<br><br>\n+ Seeks out others to enhance and streamline development and decision making.\n<br><br>\n+ Able to communicate technically with internal competencies, university collaborators and customers and utilize knowledge to advance projects and identify productive synergies.\n<br><br>\n+ Required to develop assigned employees and self to fullest potential.\n<br><br>\n+ Takes decision on IP in agreement with upper management and business\n<br><br>\n+ Is seen as a technical leader by others.\n<br><br>\n+ Understands Gate Process methodology/ideology and utilizes and incorporates it in research projects\n<br><br>\n+ Be able to fill in standard deliverables for project management through interactions with internal contacts outside of R&amp;D\n<br><br>\n+ Holds team and group accountable for following gate methodology for any projects R&amp;D group is responsible for\n<br><br>\n+ Must possess a body of technical work commensurate with their years of experience including but not limited to: demonstration of familiarity with statistical tools, data analysis, and drawing conclusions based on a collection of basic data and interpretation, IP, Patents, and technical documents.\n<br><br>\n+ Demonstrated ability to lead projects within a structured process (Gate).\n<br><br>\n+ Demonstrated ability to give and receive constructive feedback.\n<br><br>\n+ Demonstrate ability to network within and out of group.\n<br><br>\n+ Respectful communication and ability to collaborate in a team environment required.\n<br><br>\n+ Develop ability to maintain composure and organize teams in high pressure situation.\n<br><br>\n+ Demonstrate understanding of company policies &amp; corporate structure\n<br><br>\n+ Lead and support project activities from ideation to industrialization &amp; transfer technology to plants and visit customers, manufacturing plants\n<br><br>\n+ Plan, execute project activities and manage resources effectively\n<br><br>\n+ Innovate and document new ideas in invention disclosures and patent disclosures\n<br><br>\n+ Communicate technically with stakeholders and management and utilize knowledge to advance projects\n<br><br>\n+ Provide technical support to plants and other global teams\n<br><br>\n+ Collaborate effectively with cross functional teams (EHS, Purchasing, Product Management, Intellectual Property, Other R&amp;D or competency teams)\n<br><br>\n+ BS Degree with a minimum of 15+ years? experience, or MS with 10+ years of experience, or PhD with 6+ years plus demonstrated technical judgment/accomplishments.\n<br><br>\n+ Degree in Material Science, Mechanical Engineering, or other related disciplines.\n<br><br>\n+ Work experience with manufacturing processes/equipment in an industrial or research setting.\n<br><br>\n+ Exposure and experience in Glass formulation batching and/or glass property characterization is preferred\n<br><br>\n+ Understanding of glass/glass ceramic science and technology\n<br><br>\n+ Understanding of statistical and analytical data analytical tools\n<br><br>\n+ Understanding of current technology of Bonded Abrasive (classical ceramic) processing process is preferred\n<br><br>\n+ Basic knowledge of technology implementation tools ? FMEA, Process Control chart, etc. is preferred\n<br><br>\n+ Understanding techno-commercial and techno-legal aspects of new product/process implementation is preferred\n<br><br>\nSaint-Gobain provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state and local laws. Saint-Gobain is an equal opportunity employer of individuals with disabilities and supports the hiring of veterans."}