{"job title": "Scientist, Protein Sciences", "company": "Summit Partners, L.P", "city state": "– Hopkinton, Massachusetts", "rating": "4.2", "job description": "LakePharma is a leading biologics company specializing in antibody and protein engineering, cell line development, and protein production. Our services can be fully integrated, creating a customized solution for all our customers molecular biology, cell line, and protein needs. We just raised $30m in growth equity from Summit Partners &amp; Ampersand Capital Partners for expansion purposes.\n<br><br>\nWe are rapidly growing and seeking a talented individual to join our Protein Sciences Team. As a Scientist, you will report directly to the Senior Scientist Protein Sciences and will be based in our Hopkinton office.\n<br><br>\nThe successful candidate will be able to work with limited guidance to plan and execute studies and be able to perform routine maintenance on instruments and equipment. You will execute purification of recombinant proteins, antibodies, and enzymes using a variety of classical and contemporary biochemical techniques. Primary duties and responsibilities include:\n<br><br>\n• Express protein using E. coli as an expression system.\n<br><br>\n• Purify proteins using peristaltic pumps or AKTA instruments.\n<br><br>\n• Provide general lab support and management.\n<br><br>\n• Communicate project updates and technical reports to supervisor and senior level management.\n<br><br>\n• Identify and promptly troubleshoot technical issues.\n<br><br>\n• Keen in learning new methods and techniques.<br><br>Requirements<br><br>We are seeking a motivated biochemist with experience in classical and contemporary protein purification procedures for a variety of protein classes. The employee will be responsible for general lab support, executing projects within the laboratory, writing study/research plans, and summarizing data to clients and colleagues via technical reports. The position requires a drive to provide outstanding customer service by maintaining regular communications with clients, as well as meeting or exceeding quality and timeline expectations.\n<br><br>\n• BS/MS in Biochemistry, Biophysics, Biology, Chemistry, or Chemical Engineering.\n<br><br>\n• Experience with bacterial protein expression is preferred.\n<br><br>\n• Experience in protein purification using affinity, IEX, HIC or SEC chromatography is required.\n<br><br>\n• Familiarity with AKTA and Unicorn software is preferred.\n<br><br>\n• Experience in HPLC/UPLC chromatography is a plus.\n<br><br>\n• Good organizational skills are required.\n<br><br>\n• Ability to thrive in a fast-paced work environment.\n<br><br>\n• Must be able to clearly and accurately present written data and be comfortable with oral presentations.\n<br><br>\n• Independent, collaborative, team player.\n<br><br>\n• Excellent multi-tasking abilities and exceptional attention to details are required."}