{"job title": "RDSC Image Scientist", "company": "University of Rochester", "city state": "– Rochester, NY", "rating": "4.1", "job description": "Opening<br><br><br><br><br>Full Time 40 hours Grade 053 Institute for Data Science<br><br>Schedule<br><br><br><br><br>9AM-5PM<br><br>Responsibilities<br><br><br><br><br>**General Purpose:**<br><br>The University of Rochester?s Goergen Institute of Data Sciences (GIDS) is seeking an Image Scientist for its new Rochester Data Science Consortium (RDSC). Under the guidance of RDSC, this role will be responsible for providing dedicated support to RDSC Partner Company under the day to day supervision of Partner Company. At such time when support is no longer need for Partner Company, this role will be utilized as RDSC bench resource and redeployed to another Partner Company as needed.<br><br>As an employee of GIDS/RDSC, the successful candidate will have responsibility for supporting projects in the RDSC, which is focused on advancing regional economic development and supports a range of partnerships with industry in areas of data science research, training, technology development and access to research computing expertise and resources. The candidate will work with the GIDS/RDSC Research Scientists and other university researchers in these domains to understand both current world-class competencies and planned future research thrusts.<br><br>Analytics have shown the power to dramatically transform all aspects of our lives ? Big Data is no longer an issue, rather it is how, when everything has become a data source, we best leverage and capture the meaning of this data. Our goal is to leverage the power of UR Data Sciences to transform regional businesses beyond their existing core offerings to forward-looking, high-value, transformative offerings that propel a redefinition of Rochester as a dynamic economic hub.<br><br>**Specific Responsibilities:**<br><br>* Provides image science expertise to conduct image/product quality analysis throughout TCPED chain.<br>* Assess utility of image processing routines and advanced algorithms operating on today?s baseline and emerging remote sensing systems.<br>* Investigates, analyzes and provides solutions to complex problems encountered by engineering services and quality control using standard engineering practices.<br>* Authors technical documents and presentations.<br><br>**Requirements**:<br><br>Bachelor's degree or higher in related discipline such as Imaging Science, Electrical Engineer (Signal Processing), Mathematics, Physics and 2-3 years of related experience; or an equivalent combination of education and experience.<br><br>US citizenship<br><br>*Required Skills:*<br><br><br>* Matlab or Python experience<br>* algorithm development<br>* full motion video<br>* Image / video processing (NITF, TIFF, JPEG2000 / J2k, MPEG, H.264)<br>* Linux/Unix environment<br><br>*Desired Skills: *<br><br><br>* Java EE7<br>* Ext Js 6<br>* Groovy<br>* Agile software development lifecycle<br>* RESTful services<br>* Relational databases<br>* Python experience<br>* Algorithm development<br>* Full motion video<br>* Image / video processing (NITF, TIFF, JPEG2000 / J2k, MPEG, H.264)<br><br><br><br><br><br><br><br><br>*EOE Minorities/Females/Protected Veterans/Disabled*<br><br><br><br><br>*Job Title:* RDSC Image Scientist<br><br><br>*Location:* The College<br><br><br>*Job ID:* 208568<br><br><br>*Regular/Temporary:* Regular<br><br><br>*Full/Part Time:* Full-Time"}