{"job title": "NEUROETHICS RESEARCH SCIENTIST", "company": "University of Washington", "city state": "– Seattle, Washington", "rating": "4.1", "job description": "Posting Date: 07/12/2018 Closing Info: Open Until Filled Salary: Salary is commensurate with experience and education Shift: First Shift As a UW employee, you have a unique opportunity to change lives on our campuses, in our state and around the world. UW employees offer their boundless energy, creative problem solving skills and dedication to build stronger minds and a healthier world. <br> <br> UW faculty and staff also enjoy outstanding benefits, professional growth opportunities and unique resources in an environment noted for diversity, intellectual excitement, artistic pursuits and natural beauty. All of which has allowed the UW to be nationally recognized as a Great College to Work For for four consecutive years. <br> <br> The Center for Sensorimotor Neural Engineering (CSNE) is an NSF Engineering Research Center focused on developing implanted neural devices to benefit persons with disabilities. <br> <br> <b> The CSNE has an outstanding opportunity for a Neuroethics Research Scientist who will be an integral member of the Ethics Thrust.</b> <br> <br> The responsibilities of the Fellow will be divided between: <br> • Service to CSNE: Working closely with the Ethics Thrust faculty and ERC investigators to consider ethics challenges and solutions throughout the conceptualization, funds-seeking, execution, and reporting phases of research and translation; and, <br> • Independent Research: Developing a portfolio of independent research and publications on ethical challenges in the domain of neural engineering. The slate for independent research is open, but conceptual or empirical ethics research related to brain-computer interface technology will be encouraged.<br> <br> <b> RESPONSIBILITIES:</b> <br> Leading and attending meetings of Thrust Leaders from the School of Medicine, College of Engineering and other campus groups. Formally gathering data and other input from Thrust Leaders for Neuroethics projects. Researching developments in the Neuroethics field and leading discussions, such as through journal clubs, workshops, or lectures. Working with neuroscience PIs and students to keep Neuroethics considerations an active part of their projects. The candidate will actively seek funds from agencies and private foundations to grow the Neuroethics program. The Neuroethics research scientist will write research reports and translational materials to be used in education and outreach. The Neuroethics research scientist will design (with input from Thrust leadership) and execute an independent research project related to brain-computer interface technology. The research scientist will represent the CSNE Neuroethics Thrust at CSNE events, retreats, conferences and other meetings. <br> <br> The start date for the position is Fall 2018, though an earlier or later start date will be considered. This is one year position with possible renewal for a second year. <br> <br> Please submit a cover letter with a statement of your research interests, career goals, and the names and contact information for three references (1.5 page) as well as a curriculum vitae/resume (3 page limit). Additional information, such as letters of reference and examples of published or unpublished work may be requested. Applications will be reviewed beginning July 31st and will continue until the position is filled.<br> <br> <b> REQUIREMENTS: </b> <br> <li> Masters degree in bioethics/neuroethics, neuroscience or neural engineering or related field with 4 years of experience OR a PhD in bioethics/neuroethics, neuroscience or neural engineering or related field and 2 years of experience. Must have outstanding communication skills, both written and verbal; demonstrated collaborative work style and ability to work effectively in a diverse workplace; demonstrated ability to manage large and varied tasks and reporting load. <br> <br> Equivalent education/experience will substitute for all minimum qualifications except when there are legal requirements, such as a license/certification/registration.<br> <br> <b> DESIRED EXPERIENCE</b> <br> </li> <li> Doctoral Degree or Juris Doctorate in bioethics/neuroethics, neuroscience or neural engineering or related field and 4 years of experience.<br> <br> Condition of Employment: <br> This position requires frequent travel several times a year regionally within the Pacific Northwest, with a potential for national and international travel.<br> <br> As a UW employee, you will enjoy generous benefits and work/life programs. For detailed information on Benefits for this position, <br> <br> <b> Application Process:</b> <br> Applications will be considered from professionals with terminal post-graduate degrees (MD, JD, PhD). The ideal candidate will have a background in neuroscience or neural engineering, and expertise in a field relevant to biomedical ethics/neuroethics. The ideal candidate will also have outstanding communication skills, be willing and open to working with people from diverse academic backgrounds, and be able to manage a large and varied research task and reporting load. <br> <br> The application process for UW positions may include completion of a variety of online assessments to obtain additional information that will be used in the evaluation process. These assessments may include Workforce Authorization, Cover Letter and/or others. Any assessments that you need to complete will appear on your screen as soon as you select Apply to this position. Once you begin an assessment, it must be completed at that time; if you do not complete the assessment you will be prompted to do so the next time you access your My Jobs page. If you select to take it later, it will appear on your \"My Jobs\" page to take when you are ready. <b> Please note that your application will not be reviewed, and you will not be considered for this position until all required assessments have been completed.</b> </li> <p> The University of Washington is a leader in , and committed to becoming climate neutral. </p>"}