{"job title": "Scientist, Fermentation", "company": "Zymergen", "city state": "– Emeryville, CA", "rating": "3.3", "job description": "Founded in 2013 and based in the San Francisco Bay Area, Zymergen is a technology company unlocking the power of biology. We deliver better economics for products made from biology that are used across industries, bring new products to market faster, and develop novel products. Our proprietary platform uses robots and machine learning to engineer microbes faster, more predictably, and to a level of performance previously unattainable. These microbes, and the products they produce, have broad applications across industries such as chemicals and materials, agriculture, and healthcare. For more information visit www.zymergen.com.\n<br><br>\n<strong>1. Job Description and Specific Responsibilities</strong>\n<br><br>\nZymergen is hiring a Scientist with experience in fermentation to advance bench-scale and microtiter-plate based fermentation within the company. The Scientist will identify areas of need and address them through developing new technologies or bringing outside technologies into the company.\n<br><br>\nImmediate responsibilities involve:\n\n<ul>\n<li>Scale-down of fermentation processes to microtiter-plate scale for a variety of microbes</li>\n<li>Strain characterization at bench scale and microtiter-plate scale</li>\n<li>Working with colleagues in Operations for ongoing troubleshooting and process improvements</li>\n<li>Improving the quality of measurements made in plates and fermenters</li>\n<li>Building automated solutions to improve fermentation operations workflows</li>\n<li>Developing new high throughput plate-based assays to use across a variety of microbes</li>\n<li>Internal and external technology transfer projects</li>\n</ul>\nThe Fermentation team at Zymergen is essential for screening microbes in high throughput to identify those with improved performance and transferring technologies between Zymergen and our partner organizations. Scientists must bring creativity and perseverance across a variety of large and small projects that contribute to installing, validating, and improving the equipment and processes used by the operations team. The successful candidate will have the opportunity to shape the scientific environment and establish best practices within a growing company.\n<br><br>\n<strong>2. Qualifications and Experience</strong>\n<br><br>\nWe favor candidates with formal training (PhD, MS, or equivalent) in chemical engineering or microbiology and several years of industry experience. We prefer candidates who are familiar with a variety of bench scale fermentation units and who have experience working with or alongside small scale (microtiter plates) and manufacturing scale fermentation processes. We look for candidates with a track record of developing and running highly accurate and precise fermentation processes for evaluating microbes.\n<br><br>\nWe favor a Scientist with experience in some or all of the following areas:\n\n<ul>\n<li>Experience working with a variety of microbes, fermentation processes, and product types</li>\n<li>Strong understanding of the connection between microbial physiology and process performance</li>\n<li>Hands-on experience with bench-scale fermentation and/or plate-based culture methods</li>\n<li>Familiarity with analytical chemistry/assay methods, automation systems, and LIMS</li>\n<li>Strong data analysis skills, including the use of statistics (JMP or similar software) and control charts to monitor and analyze results</li>\n</ul>"}