{"job title": "Environmental Scientist", "company": "AECOM", "city state": "– Kenova, West Virginia", "rating": "3.2", "job description": "<p> <b> Job Summary</b> </p> <p> AECOM is actively seeking a creative, highly talented Environmental Scientist for immediate employment for the Kenova, WV office. AECOM is proud to provide our employees with exciting, challenging projects.</p> <p> The responsibilities of this position include, but are not limited to, those listed below:</p> <li> <p> Compiling, evaluating, and analyzing environmental data</p> </li> <li> <p> GIS Data compilation and mapping</p> </li> <li> <p> Preparation of reports and other technical documents</p> </li> <li> <p> Other duties as required</p> </li> <p> <b> Minimum Requirements</b> </p> <li> <p> 7+ years of experience required</p> </li> <li> <p> General familiarity within a broad field of scientific knowledge of reciprocal effects of the work upon other disciplines/fields</p> </li> <li> <p> Ability to obtain the Transportation Worker Identification Credential (TWIC)</p> </li> <li> <p> Strong organizational and communication skills (both written and oral)</p> </li> <li> <p> Ability to adapt to and learn new skills when needed</p> </li> <li> <p> Strong leadership skills</p> </li> <li> <p> Must be proficient with MS Office applications</p> </li> <li> <p> Must possess a valid drivers license</p> </li> <li> <p> Due to the nature of this position, US Citizenship is required</p> </li> <p> <b> Preferred Qualifications</b> </p> <li> <p> Associates Degree in related field of study</p> </li> <li> <p> 10+ years of experience</p> </li> <li> <p> Proactive and goal-oriented, with the ability to work independently and within a team enviornment</p> </li> <li> <p> Ability to complete assigned tasks with limited supervision</p> </li> <li> <p> Strong oral and written communication skills</p> </li> <p> <b> What We Offer</b> </p> <p> AECOM is a place where you can put your innovative thinking and business skills into high gear and work alongside other highly intelligent and motivated people. It's a place where you can apply your skills to some of the world's most challenging, interesting, and meaningful projects worldwide. It's a place that values the diversity of our areas of practice and our people. It's what makes AECOM a great place to work and grow. AECOM is an Equal Opportunity Employer.</p> <p> At AECOM, employee's safety and security are our top Safeguarding core value. All employees are expected to set the highest level of safety expectation in their work, display the highest level of safe behavior, and actively participate in AECOM's Safety For Life Program. SH&amp;E is a part of our company culture and participation is required for all employees.</p> <p> NOTICE TO THIRD PARTY AGENCIES: Please note that AECOM does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed Recruitment Fee Agreement, AECOM will not consider or agree to payment of any referral compensation or recruiter fee. In the event a recruiter or agency submits a resume or candidate without a previously signed agreement, AECOM explicitly reserves the right to pursue and hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of AECOM.</p> <p> <b> Job Category</b> Sciences</p> <p> <b> Business Group</b> Design and Consulting Services Group (DCS)</p> <p> <b> Country</b> United States of America</p> <p> <b> Position Status</b> Part-time Variable</p> <p> <b> Requisition/Vacancy No.</b> 195072BR</p> <p> Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status.</p>"}