{"job title": "Data Engineer", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nSince 1995, Amazon has focused on being \"the world's most customer centric company.\" Our customers are worldwide, and include not just consumers, but also our sellers. World-class retail brands and individual sellers increase their sales and reach new customers by leveraging the power of the Amazon e-commerce platform. Over 2 million sellers offer new, used, and collectible selections to Amazon customers around the world. To meet our sellers' needs, our smart, diverse, customer-obsessed employees are constantly innovating and building on new ideas.<br><br> Fulfillment by Amazon (FBA) and Amazon Global Services (AGS) is an Amazon service for our third-party Sellers. The FBA and AGS teams partners with sellers and our Amazon fulfillment centers to create a seamless experience for sellers to leverage our world-class facilities. 71% of sellers who use FBA report more than a 20% increase in unit sales after joining FBA. In a very real way, we are changing lives with the work we do. Our FBA and AGS employees wake up every day thinking about how to enable our sellers to be successful on our platform. Enabling seller success allows us to provide Amazon customers with unparalleled selection and pricing. FBA is a win for sellers and a win for customers.<br><br> The FBA and AGS Data Technology Team is looking for a data engineer to help us evolve our technology by developing tools and processes that supplement and enhance our current data technology offerings. As a member of our dynamic team of Data Engineers, Business Intelligence Engineers, Programmer Analysts, and Product Managers, you will leverage your passion for building to help drive the next generation of data analysis for the Fulfillment by Amazon/Amazon Global Selling Tech organization.<br><br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>A desire to work in a collaborative, intellectually curious environment.</li><li>Bachelor’s degree in Computer Science, Engineering, Mathematics, or a related field.</li><li>2+ Years of Data Warehouse Experience with Oracle, Redshift, PostgreSQL, etc.</li><li>Demonstrated strength in SQL, data modeling, ETL development, and data warehousing.</li><li>Experience in maintaining data warehouse systems and working on large scale data transformation using Hadoop, Hive, or other Big Data technologies.</li><li>Coding proficiency in at least one modern programming language (Python, Ruby, Scala, Java, etc.)</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Industry experience as a Data Engineer or related specialty (e.g., Software Engineer, Business Intelligence Engineer, Data Scientist) with a track record of manipulating, processing, and extracting value from large datasets.</li><li>5+ Years of experience building/operating highly available, distributed systems of data extraction, ingestion, and processing of large data sets</li><li>Experience building data products incrementally and integrating and managing datasets from multiple sources</li><li>Experience with large-scale data warehousing and analytics projects, including using AWS technologies – Redshift, DynamoDB, Kinesis, Lambda, S3, EC2, etc.</li><li>Linux/UNIX.</li><li>Experience with AWS</li><li>Experience with Big Data Technologies (Hadoop, Hive, Hbase, Pig, Spark, etc.)</li><li>Experience with security standards like symmetric and asymmetric encryption, virtual private clouds, IP whitelisting, LDAP authentication, and other methods</li></ul>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}