{"job title": "Associate Product &amp; Consumer Scientist", "company": "Kellogg Company", "city state": "– Battle Creek, MI", "rating": "3.6", "job description": "<strong>RES000850</strong>\n<br><br>\nGROW with us as an Associate Product and Consumer Scientist for the Kellogg Company! Are you a sensory and consumer scientist with a strong analytical sensory foundation and creative consumer research skills with good communication and ability to apply research methodology to a variety of objectives? You will be challenged to demonstrate sensory and consumer science research skills working side by side with R&amp;D, Marketing, and Insights and Planning for new product innovation, development, product quality, productivity, and cost-effectiveness projects. Engage with us as you impact our success as an experienced technical resource to various functions within the company and provide sensory and consumer research leadership to project teams. Together we'll build a stronger future for our company and your career.\n<br><br>\nAs a member of a dynamic and experienced team, working with an extensive team of contactors, you will play a role in making us the most innovative food company in the world. We are looking for someone who is motivated, innovative and a good team player who can develop, and translate research, extracting insights that help create experiences to delight our consumers.\n<br><br>\n<strong>HERE'S A TASTE OF WHAT YOU'LL BE DOING</strong>\n\n\n<ul>\n<li>Partnering with cross functional product development teams, including product development, marketing, marketing research, quality assurance, manufacturing and other scientists to focus on the project objective, develop research plans to meet the objective, and conduct research to meet project goals.</li>\n<li>Designing, executing, interpreting data, and reporting results of all test types including descriptive analysis, discrimination testing and consumer research, while customizing research plans based on objectives.</li>\n<li>Leveraging the power of statistics through test design and data interpretation and building a strong relationship with internal statistics department.</li>\n<li>Connect and Partner with senior PCS staff to guide development and implementation of new testing methodologies and opportunities for research on research.</li>\n<li>Providing technical recommendations based on knowledge of food chemistry, packaging, and product development as it applies to sensory and consumer research.</li>\n<li>Keeping current with advancements in sensory and consumer research, ingredient technology and food science by taking advantage of technical journals, attending technical presentations by suppliers, and networking with colleagues and experts in the field.</li>\n<li>Maintaining knowledge of research methodologies in order to provide insights to the product development process, while increasing the technical depth of the organization through participation in technical forums.<br><br>SDL2017</li>\n\n</ul>"}