{"job title": "Research Scientist", "company": "Lockheed Martin", "city state": "– Fort Worth, Texas", "rating": "3.6", "job description": "<strong>Description:</strong> As a Low Observables technology engineer on F-22 fighter aircraft program, the selected candidate will perform a variety of Radio Frequency (RF), radar, and materials tasks in support of our advanced aircraft. As a member of this dynamic team of highly experienced technical experts, you will conduct Radio Frequency (RF) signal processing algorithm development, data analysis, and exploitation associated with RF sensing activities. You will collaborate with aircraft design, maintenance, and special material experts to identify new approaches to Low Observables Technology as applied to the F-22, and will also work with System Effectiveness subject matter experts to identify approaches for improved aircraft survivability. This position provides a rare opportunity to join a team of world class experts working on challenging technologies that are critical enablers of our aircraft capabilities.\n<br>\nMust be a US Citizen. This position is located at a facility that requires special access, and applicant must ultimately be cleared to this level.\n<br><br>\nThis position requires a moderate amount of travel.\n<br>\n<strong>Desired Skills:</strong> -Experience working in a team environment, with ability to work independently when needed.\n\n\n<ul>\n<li>Previous RF, radar, or LO materials experience is highly desirable.</li>\n<li>Understanding of basic RF principles and the basic physics of Electro-Optical / Infrared (EO/IR) sensors and observables.</li>\n<li>Computer programming experience and understanding of analytical/numerical solution of complex systems of equations.</li>\n<li>Familiarity with Database manipulation and Linux / Windows Operating Systems.</li>\n<li>Experience with web design.</li>\n<li>Skilled with MS Office; Powerpoint, Excel, Word, Access, Visual Basic.</li>\n</ul>\n\n<strong>BASIC QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>Knowledge of signal processing for Electromagnetic and Infrared systems.</li>\n<li>Experience creating software algorithms from physical descriptions of phenomena.</li>\n<li>Basic knowledge in mathematical modeling of physical systems.</li>\n</ul>\n\n<strong>Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.</strong>\n<br>\nAs a leading technology innovation company, Lockheed Martins vast team works with partners around the world to bring proven performance to our customers toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.\n<br><br>\nJoin us at Lockheed Martin, where were engineering a better tomorrow."}