{"job title": "Data Engineer âž", "company": "3m", "city state": "– Maplewood, New Jersey", "rating": "3.9", "job description": "<strong> Job Description:</strong>\n<br><br>\n<strong> 3M is seeking a Data Engineer for the Consumer Business Group Key Accounts Analytics Center of Excellence located in Maplewood, Minnesota. At 3M, you can apply your talent in bold ways that matter. Here, you go.</strong>\n<br><br>\n<strong> Job Summary:</strong>\n<br><br>\nAt 3M we are making great progress toward inventing a new future for 3M - a future of faster growth and increased competitiveness, while continuing to deliver superior results. We are currently seeking a <strong> Data Engineer</strong>  for our Analytics Center of Excellence within 3Ms Consumer Business Group. This position will be responsible for the global development, implementation, and on-going support of CBGs POS aggregation program. This is a highly visible position and program within CBGs Analytic Center of Excellence where your talents can shine.\n<br><br>\n<strong> Primary Responsibilities</strong> include but are not limited to the following:\n<li> Design, build, and maintain global ETL processes and Data Warehousing systems to enable advanced retail analytics</li> <li> Develop technology and implementation plans to scale and localize globally</li> <li> Design and implement user/role-based data security methodology</li> <li> Research, evaluate, and prototype new technologies to improve overall system performance</li> <li> Troubleshoot and identify solutions for complex data problems that support critical business functions</li> <li> Monitor server performance and optimize configuration and processes to support changing server demands</li> <li> Be adept at rapidly supporting and fulfilling ad-hoc reporting or data requests</li> <li> Compose and maintain documentation</li>\n<strong> Basic Qualifications:</strong>\n<li> Possess a Bachelors degree or higher (completed and verified prior to start) from an accredited institution</li> <li> Minimum 3 years of experience building, maintaining, and validating databases in a private, public, government or military environment</li> <li> Minimum 3 years of experience writing SQL queries</li> <li> Minimum 1 year of experience with Microsoft SQL Server</li>\n<strong> Preferred Qualifications:</strong>\n<li> Bachelors degree or higher in MIS, computer science, data science or similar from and accredited institution</li> <li> Experience building and managing Data Warehouses</li> <li> Working knowledge of ETL processes, systems, and technologies such as Microsoft SSIS and Azure Data Factory</li> <li> Experience with DAX, Power BI, PowerPivot, and PowerQuery/M</li> <li> Experience building and managing Microsoft SSAS Tabular cubes</li> <li> Experience with retail point-of-sale data in a data warehouse environment</li> <li> Experience with internationalization and localization of text and currency in database systems</li> <li> Experience with scalable, globally deployed database systems</li> <li> Experience with Microsoft Azure data processing and analytic technologies</li> <li> Experience working with enterprise level computing environments</li>\n<strong> Location:</strong>  Maplewood, MN\n<br><br>\n<strong> Travel:</strong>  May include up to 10% travel\n<br><br>\n<strong> Relocation Benefits:</strong>  Are not authorized for this position\n<br><br>\nThis position provides an opportunity to transition from other private, public, government or military environments to a 3M career.\n<br><br>\nMust be legally authorized to work in country of employment without sponsorship for employment visa status (e.g., H1B status)."}