{"job title": "Manufacturing &amp; Supply Chain Digitization - Data Engineer âž", "company": "3m", "city state": "– Maplewood, New Jersey", "rating": "3.9", "job description": "<strong> Job Description:</strong>\n<br><br>\n<strong> 3M is seeking a Data Engineer for the Manufacturing and Supply Chain Digitization Group located</strong>  <strong> in Maplewood, MN. At 3M, you can apply your talent in bold ways that matter. Here, you go.</strong>\n<br><br>\n<strong> Job Summary</strong> :\n<br><br>\nAre you passionate about Data and Data Science and how it can help shape the future? Do you have experience with complex database management, specifically related to 3M and cloud-based platforms? Are you looking to develop and grow your own experience in analytics and digitization related capabilities? Do you have outstanding software architecture capabilities on environments like SAP, DB2, SQL, RDBMs?\n<br><br>\nIf you answered Yes to any of these questions, then please take the time to read about the new exciting position with 3M M&amp;SC.\n<br><br>\n3M is excited to expand our Service Improvement Organizations Digitization team to include a Data Engineer. We are looking for someone with strong experience integrating on-premise data warehouses with cloud-based data storage and applications. The ideal candidate will understand how to navigate within the 3M technical and IT/BT community to manage technical enterprise deployment. This person will support the Digital Twin project as well as other strategic, high impact initiatives to drive value creation.\n<br><br>\n<strong> This position provides an opportunity to transition from other private, public, government or military environments to a 3M career.</strong>\n<br><br>\n<strong> Primary Responsibilities</strong> include but are not limited to the following:\n<li> The qualified candidate will lead the data infrastructure and architecture for applications launching in support of the digitization objectives collaborating closely with IT/BT.</li> <li> Designs scalable, cloud-based data management solutions including sourcing, processing, storage, and consumption of data for analytics applications.</li> <li> Responsible for analyzing current and future business needs in relation to data requirements, identifying potential gaps, evaluating options, and ensuring delivery of solutions.</li> <li> Analyzes and reviews data capabilities to ensure successful implementation and interface with all applicable systems.</li> <li> Collaborates with Project Managers to ensure all IT governance requirements are met.</li> <li> Investigates appropriate new technologies and external partners.</li> <li> Actively participates in relevant corporate programs/initiatives, complies with professional and quality standards, complies with corporate policies and procedures, and acts in a manner consistent with 3Ms values and ethical standards.</li>\n<strong> Basic Qualifications:</strong>\n<li> Possess a Bachelors degree or higher (completed and verified prior to start) from an accredited institution</li> <li> Minimum of five (5) years of experience working with information technology in a <strong> private, public, government or military environment</strong></li>  <li> Experience in the field of data engineering</li>\n<strong> Preferred Qualifications:</strong>\n<li> Experience designing cloud-based advanced analytics on big data.</li> <li> Experience with Azure Data Lake Storage, Databricks, and HDInsight.</li> <li> Experience with SAP HANA and Teradata database management.</li> <li> Solid communication skills, ability to interact with all levels within organization.</li> <li> Work as a member of an agile development organization.</li> <li> Must be self-motivated with a strong desire to learn and continuously improve.</li>\n<strong> Location:</strong>  Maplewood, MN\n<br><br>\n<strong> Travel:</strong>  May include up to 10% domestic\n<br><br>\n<strong> Relocation:</strong>  Is authorized\n<br><br>\nMust be legally authorized to work in country of employment without sponsorship for employment visa status (e.g., H1B status)."}