{"job title": "Research Scientist - Materials Analysis - 3m", "company": "3m", "city state": "– Minnesota", "rating": "3.9", "job description": "<strong> Position Description</strong>\n<br><br>\n<strong> Job Summary</strong> :\n<br><br>\nThe person hired for the position of <strong> Research Specialist-Materials Analysis Focus</strong>  will solve problems across 3M as well as develop technology valuable to new differentiated products via expertise in thermal analysis of polymer materials, systems and products.\n<br><br>\n3M is a global, innovative company that succeeds by inventing new materials/process technologies to enable new products and open new markets. 3M has a global Corporate Research Laboratory with capabilities in multiple disciplines: materials, process, analytical and systems design. 3Ms Corporate Research Laboratory is seeking an expert in polymer/thermal and thermomechanical analysis of materials and products to support research, marketed product development, and manufacturing. We are looking for a talented scientist with both a passion and a vision for creating novel, multidisciplinary approaches to drive 3M growth.\n<br><br>\n<strong> Primary Responsibilities</strong> include but are not limited to the following:\n<li> Leads thermal and thermomechanical properties testing and analysis program</li> <li> Explains how thermal properties of materials relate to polymer architecture, molecular arrangement, processing history and product performance</li> <li> Applies understanding of material properties to develop new materials and manufacturing processes</li>\n<strong> Basic Qualifications:</strong>\n<li> Bachelor's degree or higher from an accredited university</li> <li> Minimum three (3) years of polymer analysis experience that includes rheology, thermal and mechanical analysis</li>\n<strong> Preferred Qualifications:</strong>\n<li> Ph.D. degree in Materials Science, Chemical Engineering, Polymer Science, Physical Chemistry, Physics or related discipline from an accredited university</li> <li> Experience with characterization techniques, including thermal and thermomechanical mechanical measurements such as differential scanning calorimetry (DSC) and thermogravimetric analysis (TGA), dynamic mechanical analysis (DMA) and thermomechanical analysis (TMA)</li> <li> Skills include excellent written and verbal communication skills, strong networking skills, superior interpersonal and leadership skills</li>\n<strong> Travel:</strong>  May include up to 5% domestic/international\n<br><br>\n<strong> Relocation:</strong>  Is authorized"}