{"job title": "Data Analyst", "company": "Arrowpoint Corporation", "city state": "– McLean, Virginia", "rating": "3.0", "job description": "<ul><li>Full Time</li><li>McLean, Virginia</li><li>Posted 2 weeks ago</li></ul><div><div>Login to bookmark this Job</div></div><div><p><strong>Position Summary: </strong>The Data Analyst will work in support of a contract which provides a comprehensive suite of software products encompassing data warehousing, to analysis, to end-user software. These products cover many functional and operational areas and support large numbers of concurrent users. Business casual work environment with exposure to cutting-edge technologies.</p><p><strong> </strong></p><p><strong>Scope:</strong> Works as a member of a team. No budgetary responsibilities.</p><p><strong> </strong></p><p><strong>Essential Functions of the Position: </strong></p><ul><li>Reviews, evaluates, designs, implements and maintains SQL databases. Identifies data sources, constructs data decomposition diagrams, provides data flow diagrams and documents the process. Performs requirements analyses</li><li>Interprets data, analyzes results using statistical techniques and provide ongoing reports</li><li>Develops and implements data collection systems and other strategies that optimize statistical efficiency and data quality</li><li>Acquires data and maintains databases/data systems</li><li>Identifies, analyzes, and interprets trends or patterns in complex data sets</li><li>Filters and “cleans” data, and reviews computer reports, printouts, and performance indicators to locate and correct code problems</li><li>Works closely with management to prioritize business and information needs</li><li>Locates and define new process improvement opportunities</li><li>Writes codes for database access, modifications, and constructions including stored procedures.</li><li>Has expertise with a variety of the field’s concepts, practices, and procedures.</li><li>Typically reports to a project leader or project manager</li><li>May perform other duties as assigned.</li></ul><p><strong> </strong></p><p><strong>Qualifications:</strong></p><ul><li>BS/BA in area of specialty and 3 or more years of experience in the field or in a related area. A combination of 4 additional years of education, technical training and equivalent experience may be substituted for the bachelor’s degree.</li><li>Experience with SQL environment and reporting tools.</li><li>Security+ preferred.</li><li>Ability to work with a team environment.</li><li>Excellent communication, organizational and interpersonal skills required.</li></ul><ul><li>US Citizenship is required and must be able to pass a background investigation in order to gain access to the client site and computer systems.</li></ul><p><strong> </strong></p><p><strong>Additional Skills: </strong></p><ul><li>Microsoft certification preferred.</li></ul><p> </p><p><strong>Physical Demands and Work Environment: </strong></p><ul><li>Usual office working conditions.</li><li>Required to sit for long periods of time using a personal computer.</li><li>Some light physical effort required.</li><li>Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions of this position</li></ul><p><strong> </strong></p><p><strong>Work Location: </strong>McLean, Virginia</p><p><strong> </strong></p><p><strong>Travel: </strong>Possible limited local travel.</p></div><div> <div> First Name<div> </div> Last Name<div> </div> Address 1<div> </div> Address 2 (optional)<div> </div> City<div> </div> State<div> </div> Zip<div> </div> Phone<div> </div> Best Time to Call (optional)<div> </div> Email Address<div> </div> U.S. Citizen?<div> YesNo </div> Salary Requirements<div> </div> Additional Information/Cover Letter (optional)<div></div> Upload Resume<div><div></div> Upload your CV/resume or any other relevant file. Max. file size: 8 MB. </div><p> </p></div></div>"}