{"job title": "Federal Work Study III-Data Analyst Assistant (Ohio History Connection)", "company": "Columbus State Community College", "city state": "– Columbus, Ohio", "rating": "4.1", "job description": "<strong> Requisition ID:</strong>  req2130\n<br>\n<strong>Job Title:</strong> Federal Work Study III-Data Analyst Assistant (Ohio History Connection)\n<br><br>\n<strong>Department:</strong> Career Services\n<br><br>\n<strong>Location:</strong> Columbus Campus\n<br><br>\n<strong>Employment Type:</strong> Student Employment\n<br><br>\n<strong>Employment Status:</strong> Student Employment\n<br><br>\n<strong>Bargaining Unit:</strong> Non-Bargaining Unit\n<br><br>\n<strong>FLSA Status:</strong> Non-Exempt\n<br><br>\n<strong>Compensation Type:</strong> Hourly\n<br><br>\n<strong>Compensation Range:</strong> $10.20 (effective August 16, 2018)\n<br><br>\n<strong>Schedule:</strong> Hours available between Monday-Friday, 9 a.m.-4 p.m. (approximately 10-20 hours a week) with possible weekends. Maximum 20 hours per week.\n<br><br>\n<strong>End Date(if applicable):</strong> 8/10/2019\n<br><br>\n<strong>Job Description:</strong> \n<br>\nTo perform this job successfully, an individual must be able to satisfactorily perform each essential duty listed below. Reasonable accommodations will be made for persons with disabilities, covered by the Americans with Disabilities Act, in accordance with its requirements.\n<br><br>\nDescription: The Data Analyst Assistant will help analyze qualitative and quantitative data gathered on current visitors and past visitors. The data comes in the form of highly focused visitor observations, interviews and questionnaires. This position will use data to uncover information related to who is visiting, why they are visiting, and what the people who are already engaging with us think.\n<br><br>\nOrganization/Agency Overview: The mission of Ohio History Connection is to spark discovery of Ohio's stories and embrace the present, share the past and transform the future.\n<br><br>\nLocation: 800 E. 17th Ave., Columbus Ohio, 43211\n<br><br>\nWebsite: https://www.ohiohistory.org\n<br><br>\nDuties are numbered for convenience, and do not indicate order in terms of importance, frequency that the duty is performed, or the amount of time spent on the duty.\n\n<ul>\n<li> Enters visitor interview and observation data into a database</li> <li> Performs data analysis</li> <li> Prepares preliminary reports and visualizations</li> <li> Occasionally builds questionnaires, compiles or enters data using Microsoft Excel or basic survey interfaces, such as Survey Monkey</li> <li> Performs other duties as assigned</li> \n</ul>\n\n<strong>Knowledge, Skills and Abilities:</strong>\n<br>\nKnowledge of: Basic understanding of descriptive statistics, correlations and regressions, and differences.\n<br><br>\nSkill in: qualitative and quantitative data analysis using Microsoft Excel; oral and written communication; time management; attention to detail.\n<br><br>\nAbility to: record information accurately; be a self-starter and self-directed.\n<br><br>\n<strong>Minimum Qualifications:</strong> \n<br>\nThis position requires applicants to have Federal Work Study as part of their current Financial Aid package with Columbus State. You must also be enrolled in SIX or more credit hours in a degree or certificate program. Click here for a full explanation of eligibility requirements or visit Nestor Hall 113 to request Federal Work Study if you were not awarded it already. Any applicants without Federal Work Study eligibility will not be considered for this position.\n<br><br>\nApplicants must be at least 18 years of age or have received a high school diploma or a certificate of attendance from an accredited secondary school or a certificate of high school equivalence and be exempt from Ohio Revised Code Chapter 4109.\n<br><br>\nMust have reliable transportation or other means to get to work regularly.\n<br><br>\nStudents enrolled as Transient, College Credit Plus, Undecided, or otherwise non degree-seeking are not considered eligible for Student Employment.\n<br><br>\n<strong>Preferred Qualifications:</strong>\n<br>\nStudents from all backgrounds and experience are welcome, especially those who have an interest in working in research and evaluation, museum studies, history, sociology, psychology, marketing, education, and those who want to gain applied social science research skills.\n<br>\nSeeking students from the following Career &amp; Academic Pathways or Majors:\n\n\n<li>Marketing Major </li><li>Psychology Major </li><li>Sociology Major\n\n<br><br>\n<strong>Additional Information:</strong>  This position is a part of the Community Work Study program and is NOT located on-campus at Columbus State. The Hiring Supervisor will directly contact you should they be interested in interviewing.\n<br><br></li>"}