{"job title": "Sr. Quantitative Analyst", "company": "Fifth Third Bank", "city state": "– Chicago, IL", "rating": "3.3", "job description": "If not currently in Cincinnati, OH, the individual selected will be eligible for relocation to the market.\n<br><br>\nThis position may be filled at a higher level.\n<br><br>\nGENERAL FUNCTION: The individual in this role is responsible for resolution of complex problems or transactions, where expertise is required to interpret against policies, guidelines or processes.\n<br><br>\nResponsible and accountable for risk by openly exchanging ideas and opinions, elevating concerns, and personally following policies and procedures as defined. Accountable for always doing the right thing for customers and colleagues, and ensures that actions and behaviors drive a positive customer experience. While operating within the Bank's risk appetite, achieves results by consistently identifying, assessing, managing, monitoring, and reporting risks of all types.\n<br><br>\n<strong>ESSENTIAL DUTIES AND RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>Risk analysis, policy analysis, and updates</li>\n<li>Implementation, modeling, and validation of quantitative models including PD, LGD, ALM, CCAR, QRM, MRM and Economic Capital</li>\n<li>Ongoing development and implementation of quantitative and statistical models</li>\n<li>Ad-hoc reporting requests for quantitative modeling</li>\n</ul>\n\n<strong>MINIMUM KNOWLEDGE, SKILLS AND ABILITIES REQUIRED:</strong>\n\n\n<ul>\n<li>Advanced degree in numeric field- quantitative analytics, economics, statistics, engineering, or a related area.</li>\n<li>4+ years of experience in statistical/econometric modeling and database management</li>\n<li>Database experience, SAS (including statistical modeling), SQL, VBA, and Business Objects</li>\n<li>Experience with Microsoft office products, such as Word, Excel, PowerPoint and Outlook</li>\n<li>Strong verbal and written communication skills</li>\n<li>Strong analytical skills</li>\n<li>Ability to present a professional image</li>\n<li>Ability to work in a collaborative, highly matrixed environment</li>\n<li>Ability to multi-task and to be flexible</li>\n</ul>"}