{"job title": "Enterprise Data Analyst (Financial Systems)", "company": "FirstBank", "city state": "– Nashville, TN", "rating": "3.7", "job description": "<strong>Responsibilities for these positions will include:</strong>\n\n\n<ul>\n<li> Work with stakeholders throughout the Bank to identify opportunities for leveraging company data to drive business solutions.\n\n</li><li> Work with embedded Business Analysts to support ad-hoc report and dashboard development to address specific financial and business reporting needs\n\n</li><li> Mine and analyze data from company databases to drive optimization and improvement of financial system sources and reporting.\n\n</li><li> Assess the effectiveness and accuracy of new data sources and data gathering techniques.\n\n</li><li> Develop custom data models and algorithms to apply to data sets.\n\n</li><li> Work with stakeholders to use predictive modeling to increase and optimize customer experiences, revenue generation, ad targeting and other business outcomes.\n\n</li><li> Coordinate with different functional teams to implement models and monitor outcomes.\n\n</li><li> Develop processes and tools to monitor and analyze model performance and data accuracy.\n\n</li><li> Other projects duties as assigned.\n<br><br>\n<strong>Qualifications</strong>\n<br>\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill and/or ability required. Reasonable accommodations may be made to enable individuals with the disabilities to perform essential functions.\n<br>\nSkill requirements for these positions will include:\n\n\n<ul>\n<li> Strong problem solving skills with an emphasis on data architecture, structure, and analysis\n\n</li><li> Experience developing and querying databases and using database tools such as SQL, Star Schema, SQL cubes etc.\n\n</li><li> Experience visualizing/presenting data for stakeholders using: CognosBI, Tableau, Business Objects etc\n\n</li><li> Experience using statistical computer languages (C#, SQL etc) to manipulate data and draw insights from large data sets.\n\n</li><li> Experience with Accounting and internal/external Financial Reporting systems a plus.\n\n</li><li> Knowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications.\n\n</li><li> Excellent written and verbal communication skills for coordinating across teams.\n\n</li><li> A drive to learn and master new technologies and techniques.\n\n</li><li> 3-5 years of experience manipulating data sets and building data models\n\n</li><li> Bachelors degree in Computer Science, Accounting, or similar. Masters degree or higher a plus.\n<br><br>\nAll statements are intended to describe the general nature and levels of work assigned to the job and are not intended to be an exhaustive list of all responsibilities, duties and skills required for personnel classified within the category. PI103663095</li></ul></li></ul>"}