{"job title": "CIB QR Quantitative Research Spread EMM Modeler Associate", "company": "JPMorgan Chase&amp;Co.", "city state": "– New York, NY", "rating": "3.7", "job description": "Apply Now\n<br><br>\nCIB QR Quantitative Research Spread EMM Modeler Associate\n<br><br>\nReq #: 180070174\n<br><br>\nLocation: New York, NY,US\n<br><br>\nJob Category: Quantitative Research\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nAbout J.P. Morgan\n<br><br>\nJ.P. Morgan is a leader in financial services, working in collaboration across the globe to deliver the best solutions and advice to meet our clients' needs, anywhere in the world. We operate in 150 countries, and hold leadership positions across our businesses. We have an exceptional team of employees who work hard to do the right thing for our clients and the firm, every day. This is why we are the most respected financial institution in the world and why we can offer you an outstanding career.\n<br><br>\nOur business\n<br><br>\nJ.P. Morgan has the leading Global Spread business in terms of volume traded, issuers traded and investor relationships. The Spread business covers Credit, SPG, and Public Finance Markets. J.P. Morgan Global Spread Trading offers first-class, highly integrated financial services to a global client base and provides financial assets and liquidity for banks, insurance companies, finance companies, mutual funds and hedge funds. Traders, salespeople and research analysts work collectively to generate ideas. The Credit business make secondary markets in high grade bonds/CDS, high yield bonds/CDS, distressed bonds, indices, options, correlation products, and more exotic structures. The Securitized Products Group (\"SPG\") engages in origination, syndicate, sales&amp;trading, financing, and principal investments activities. Asset classes include: mortgage-backed securities (commercial, residential, agency and non-agency), mortgage loans, consumer asset-backed securities and receivables (auto, credit card, student, equipment loans).\n<br><br>\nOur team\n<br><br>\nThe Spread QR Electronic Market Making team covers SPG and Credit flow products, including TBAs, Corporate Bonds and Credit Index products. We apply a scientific approach to trading by combining an understanding of the market-microstructure with modern data analytics to develop quoting, market-making and hedging strategies. The team is also responsible for improving traders' workflow and creating new analytical tools.\n<br><br>\nThe Spread QR EMM team is a part of Spread QR, which is responsible for developing and maintaining models for valuation, risk, P&amp;L calculations and analysis tools for the Global Spread business. The responsibilities of the team span the full range from new model specification, going through model approval, implementation of model in library, to integration into production systems as well as their day-to-day support.\n<br><br>\nOpportunity\n<br><br>\nThis opportunity is to join our Spread QR EMM team in New York as an Associate or a VP depending on experience, with a focus on models and analytics for automated quoting and execution of TBAs. This role offers a unique opportunity to participate in the end-to-end development and deployment of the SPG EMM stack. Candidates directly from university will be considered.\n<br><br>\n<strong>Key responsibilities could include:</strong>\n\n\n<ul>\n<li>Research, development, back-testing and reporting of market-making and quoting strategies</li>\n<li>Applying machine learning and statistical techniques to analyze market moves and trade data</li>\n<li>Development, deployment and support of production code for automated and semi-automated quoting and trading of SPG products in our in-house system, Athena</li>\n<li>Working with the Trading Desk to ensure optimal usage of automated strategies and analytical tools, as well as to identify and develop business intelligence tools</li>\n<li>Working with Technology on ongoing improvements to market-making infrastructure, as well as on sourcing, maintaining and exposing various market and reference data feeds</li>\n<li>Working with the Model Review Group to ensure models pass strict in-house standards</li>\n</ul>\n\n<strong>Requirements</strong>\n<br><br>\nWe work in a very dynamic environment, and excellent communication skills are required in our interaction with trading, technology, and control functions. A healthy interest in good software design principles is essential. The role requires a detailed understanding of the SPG TBA market. It is understood that the candidate may not have this knowledge from previous experience, but the successful candidate would be highly motivated to gain this knowledge. A Ph.D. in a numerate subject, specifically focusing on Deep Learning, Reinforcement Learning or Statistical/Probabilistic Modeling, from a top academic institution is highly desirable, but not an absolute requirement.\n<br><br>\n<strong>Essential skills:</strong>\n\n\n<ul>\n<li>Very strong Stochastic Modeling and Data Science background, including Statistics, Probability, Machine Learning and Deep Learning</li>\n<li>Excellent practical data-analysis skills on real datasets, including familiarity with methods for working with large data and tools for data analysis, e.g., Pandas, Numpy, Scikit-learn, TensorFlow, Keras, etc.</li>\n<li>Familiarity with Time-Series analysis using Deep Learning, as well as experience in Reinforcement Learning would be a plus</li>\n<li>Object Oriented Programming (OOP) and software design skills, preferably obtained using C++. Extensive Python experience would be a plus as would be experience with Reactive Programming</li>\n<li>Attention to detail: thorough and persistent in delivering production quality analytics</li>\n<li>Excellent communication skills; explains her/his thought process clearly and communicates model and strategy behaviors to a non-technical audience efficiently</li>\n<li>Ability to work in a high-pressure environment</li>\n<li>Pro-active attitude. Should have a natural interest to learn about our business, models, and infrastructure.</li>\n</ul>"}