{"job title": "Senior Data Science Engineer", "company": "Machine Zone", "city state": "– Palo Alto, CA, US", "rating": "3.9", "job description": "<div>\n<div>MZ Game Studio is on the forefront of applied data science and engineering. With massive scale global systems feeding our team's large streams of real-time data, we are looking for a sharp Data Science Engineer to turn true big data into actionable insights. As a Data Science Engineer you’ll play a crucial role in building out a revolutionary, next generation real-time analytics system. You’ll work closely with the R&amp;D team to turn theoretical and strategic goals into technical products that push the boundaries of analytics, machine learning, and live operations.</div>\n</div>\n<div>\n<div>\nWhat you'll be doing:\n<ul>\n<ul>\n<li>Design and develop high-performance, data-driven systems in a distributed infrastructure</li>\n<li>Research and develop algorithms to analyze high velocity streaming data</li>\n<li>Design and evaluate experiments to monitor key product metrics and understand root causes of changes in performance</li>\n<li>Build user behavior models to guide product roadmaps</li>\n<li>Design experiments to answer targeted questions</li>\n<li>Understand ecosystems, user behaviors, and long-term trends</li>\n<li>Translate strategic requirements into usable tools and infrastructure</li>\n<li>Identify and promote best practices across the organization</li>\n<li>Implement large scale data management and transformation systems</li>\n</ul>\n</ul>\n</div>\n</div>\n<div>\n<div>\nYour background and who you are:\n<ul>\n<ul>\n<li>8+ years experience with Python, R, Java, or Scala</li>\n<li>Advanced degree in Computer Science (with a Data Mining/Machine Learning emphasis) or equivalent experience</li>\n<li>Loves building new products and can take an idea from inception to development to production</li>\n<li>Has a deep research interest in developing novel statistical modeling and machine learning algorithms</li>\n<li>A team player and an effective communicator</li>\n<li>Familiarity/experience with machine learning models, statistical modeling, and validation</li>\n<li>Understanding of modern machine learning techniques (e.g. classification, clustering)</li>\n<li>Applied experience with distributed machine learning and computing framework (e.g. Spark)</li>\n<li>Experience producing machine learning models</li>\n<li>Experience with Python, R, Java, Scala, Shell scripting, Spark, Kafka, Storm, Hadoop, Hive, Presto, MySQL, Redis, Cassandra, Elasticsearch</li>\n</ul>\n</ul>\n</div>\n</div>\n<div>MZ is an equal opportunity employer and considers qualified applicants without regard to race, gender, sexual orientation, gender identity or expression, genetic information, national origin, age, disability, medical condition, religion, marital status or veteran status, or any other basis protected by law.</div>"}