{"job title": "Data Analyst, Sr. - Physician Payment Analyst, Sr.", "company": "Massachusetts General Hospital(MGH)", "city state": "– Boston, Massachusetts", "rating": "3.9", "job description": "Reporting to the Senior Director of Physician Analytics for the MGPO/BWPO, the Analyst II provides advanced analytics to support contract proposals with third party payers/government payers; develops financial models to support physician negotiations and rate implementation; works independently to design and create databases and develop data reporting systems; and researches physician reimbursement and policy issues. Other specific responsibilities include the following:\n\n<ul>\n<li> Collect, analyze and model financial data to forecast impact of payer proposals and yearly fee updates on physician revenues.</li> <li> Review and analyze PHS risk contracts, including Medicare's RVU data, to determine adequacy of negotiated target.</li> <li> Manage projects as it relates to the coordination of data and information across the POs, hospitals, PHS, and/or the physician practices. Represent the project to senior leadership and physician councils.</li> <li> Provide comparative payer data to physician groups to aid in decision making processes regarding rates and contracts.</li> <li> Research Medicare, Medicaid and other payer reimbursement issues, including new technologies and procedures. Research new opportunities for participation in Medicare Pilots such as bundles, etc. Report the findings of such research, including positive and negative impact to physician payment and reimbursement, as well as proposed solutions.</li> <li> Support PHS Contracting in the development of system-wide contract strategies.</li> <li> Work on special projects as assigned.</li> \n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\n<strong>Education</strong> :\n\n<ul>\n<li> Bachelor's degree in related field is required.</li> <li> Masters in Healthcare Administration or Public Health preferred.</li> \n</ul>\n\n<strong>Experience</strong> :\n\n<ul>\n<li> Minimum 3-5 years healthcare/analytic experience.</li> <li> Demonstrated ability to manage multiple responsibilities in complex environment.</li> <li> Working knowledge of physician reimbursement, medical terminology, ICD 9, CPT and HCPCS coding preferred.</li> <li> Payer experience a plus</li> <li> Superior quantitative analytical and problem solving skills.</li> <li> Strong organizational and project management skills with attention to detail to manage multiple projects under aggressive deadlines.</li> <li> Expertise in managing, interpreting, reporting and presenting data to all levels of management.</li> <li> Must be self-directed and self-motivated. Able to work independently and as a part of a team.</li> <li> Able to respond to changing situations and manage time appropriately to meet deadlines.</li> <li> Thorough understanding of RBRVS payment methodology in conjunction with other physician payment systems preferred.</li> <li> Proficiency in Access or other relational databases required. Proficiency in Excel, PowerPoint and Word also desired.</li> <li> Experience with designing advanced data visualizations, and some familiarity with visualization software (e.g. QlikView or Tableau)</li> <li> Good research skills.</li> <li> Business Intelligence Software experience preferred.</li> \n</ul>\n\n<strong>EEO Statement</strong>\n<br>\nMassachusetts General Hospital is an Equal Opportunity Employer. By embracing diverse skills, perspectives and ideas, we choose to lead. Applications from protected veterans and individuals with disabilities are strongly encouraged.\n<br><br>\nPartner's Healthcare is acting as an Employment Agency in relation to this vacancy."}