{"job title": "COMPUTATIONAL BIOLOGIST I", "company": "Massachusetts General Hospital(MGH)", "city state": "– Boston, Massachusetts", "rating": "3.9", "job description": "The MGH Center for Immunology and Inflammatory Diseases (CIID) is looking for exceptional computational biologist candidates to join the Single Cell Genomics Research Program, which is a multidisciplinary research program focused on developing and implementing systems immunology and genomics strategies to further our understanding of the human immune system. The laboratory is also affiliated to the Broad Institute of MIT &amp; Harvard, offering additional opportunities to collaborate and bridge with this vibrant community.\n<br><br>\nThis position offers the opportunity to employ the cutting-edge of computational biology, machine learning and statistical research to solve important problems in health and disease related to the human immune system, autoimmune diseases and cancer. Single cell genomics is revolutionizing our understanding of biology - from redefining our understanding of the types of cells, a fundamental unit in biology, to translating this knowledge to better understand disease phenotypes and the implications of this to therapeutics. We are looking for a highly motivated and talented individual with a computational background to join our efforts. This position represents an exciting opportunity to work as a member of an interdisciplinary team of biologists, laboratory scientists, computational biologists, and physicians working together on transformative translational efforts that are bridging between the clinical and research interfaces. Our research program is developing and implementing unbiased experimental and computational strategies that can directly survey the human immune system in order to define at high resolution the key processes and players underlying healthy human immune responses as a foundation for understanding how immunity is dysregulated in diseases. This includes establishing a more comprehensive roadmap of the human immune system through identifying novel immune cell subpopulations across tissues using single-cell 'omics' strategies along with mapping the cellular ecosystem and associated molecular circuitry driving immune diseases. Collectively, our research program is empowering the study of the human immune system as a function of \"healthy\" baseline, inflammatory state, disease progression, and response to treatment with emphasis on precision medicine, ultimately paving the way for developing a comprehensive human immune lexicon that is key to promoting effective bench-to-beside translation of findings.\n<br><br>\nAs part of this position, you will conceive and apply algorithms as well as analytical approaches to analyze DNA, RNA and single-cell sequencing data generated from a wide-range of human tissue and immune-related disease conditions. The candidates will also take the lead on performing a wide range single-cell genomics analysis and collaborate directly with scientists performing experimental research studies at the bench and physicians seeing the patients. You must be capable of working in an interactive team environment while conducting self-directed research within broader goals set by group.\n<br><br>\nNO PRIOR BIOLOGICAL BACKGROUND REQUIRED, just strong computational &amp; quantitative skills and enthusiasm to learn on the job.\n<br><br>\n<strong> RESPONSIBILITIES</strong> \n\n<ul>\n <li> Design and implement methods for single cell analysis of biological data</li>\n<li> Contribute to single-cell analysis of biological data</li>\n<li> Evaluate and recommend new emerging single-cell analytical approaches</li>\n<li> Integrate single-cell data with other available genetic, sequencing, and epigenetic datasets to help prioritize potential cell types and therapeutic targets</li>\n<li> Collaborate with experimentalists and associate computational biologists to develop and apply functional genomics techniques</li>\n<li> Collaborate with the MGH and Broad Institute single-cell analysis community</li>\n<li> Create scientifically rigorous visualizations, communications, and presentations of results</li>\n</ul>\n\nContribute to generation of protocols, publications, and intellectual property\n<br><br>\n<strong>Qualifications</strong>\n<br>\n<strong> REQUIREMENTS</strong> \n\n<ul>\n <li> Bachelors or Master's degree and 0-2 years' experience in computer science , computational biology, engineering, physics, mathematics, statistics, genetics, or related field with a strong quantitative background and programming emphasis preferred, but talented applicants of all levels are encouraged to apply.</li>\n<li> Solid foundation in the fundamentals of statistics, the use of algorithms and data analysis relevant to computational biology , and the ability to approach problems with scientific rigor.</li>\n<li> Must have demonstrated proficiency with several of the following programing languages:\n<br>\nPython, R, Java, C/C++, or Matlab, with a preference towards Python, and R.</li>\n<li> Proficiency working in a Linux environment, knowledge of terminal shell usage (e.g. bash).</li>\n<li> Familiarity with next-generation sequence data analysis tools; ideally will have some prior experience with statistical methods, pipelines and tools relevant to single-cell RNAseq analysis</li>\n<li> Excellent verbal and written communication skills, and the ability to explain technical/mathematical reasoning to people from non-quantitative backgrounds</li>\n<li> Independent, highly motivated, and highly collaborative with the ability to work together with multi-disciplinary teams of biologists, laboratory scientists, computational biologists, and physicians.</li>\n<li> Experience in a top research lab or the industry working with analysis of real genomic datasets (preferred but not required)</li>\n<li> Some experience with bioinformatics tools or a demonstrated interest in biology (preferred but not required)</li>\n<li> Experience in machine learning, working with high performance compute clusters and cloud compute\n<br>\nsolutions biology (preferred but not required)</li>\n<li> Interest in molecular biology and genomics</li>\n<li> A passion for solving important translational problems and advancing our understanding of the human body, focusing on the immune system</li>\n</ul>\n\n<strong>EEO Statement</strong>\n<br>\nMassachusetts General Hospital is an Equal Opportunity Employer. By embracing diverse skills, perspectives and ideas, we choose to lead. Applications from protected veterans and individuals with disabilities are strongly encouraged.\n<br>\nPartner's Healthcare is acting as an Employment Agency in relation to this vacancy."}