{"job title": "Neuroscience (Brain) Data Analyst", "company": "Massachusetts General Hospital(MGH)", "city state": "– Boston, Massachusetts", "rating": "3.9", "job description": "<strong>GENERAL SUMMARY/ OVERVIEW STATEMENT:</strong>\n<br><br>\nA careful, detail-oriented Programmer/Data Analyst is sought to assist with physiological data analysis, analytical algorithms development, and preparing scientific reports. The goal of this project is to develop analytical and mathematical tools to quantify and better understand an individual's emotional state from physiological measurements. This project is a part of a larger highly collaborative project on the development of neuromodulation devices that sense the brain's activity, then respond in real-time to treat the symptoms of psychiatric illness. The ideal person for this position should possess excellent organizational skills, follow instructions well, pay close attention to details, communicate well, and have superb technical skills. The person will be expected to work independently as well as within a team. The candidate will be expected to work between Massachusetts General Hospital and Department of Mathematics and Statistics at Boston University.\n<br><br>\n<strong>PRINCIPAL DUTIES AND RESPONSIBILITIES:</strong>\n<br><br>\nMajor duties and responsibilities include coding the algorithms provided in Matlab - or Python, data analysis in Matlab, software development, and code management, preparing slides that report the weekly progress, and generating scientific and progress reports. Other responsibilities include attending weekly and bi-weekly meetings, performing independent literature search and understanding and interpreting the literature, conducting the analysis of results, having a theoretical understanding of the algorithms used for data analysis, assisting in the organizing materials for publication or presentation, and maintaining a well-organized and detailed laboratory notebook.\n<br><br>\n<strong>SKILLS/ABILITIES/COMPETENCIES REQUIRED:</strong>\n\n\n<ul>\n<li>Advanced proficiency in Matlab - or Python</li>\n<li>Strong analytical and computer skills including proficiency with Microsoft PowerPoint, and Word</li>\n<li>Proficient with physiological data analysis</li>\n<li>Proficient in statistics and mathematics</li>\n<li>Proficient in Matlab or Python programming.</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br>\n<strong>EDUCATION:</strong>\n<br><br>\nBachelor's degree required. Master's degree preferred.\n<br><br>\n<strong>EXPERIENCE:</strong>\n<br><br>\n1 year of directly related experience in programming/analysis required\n<br><br>\nExperience in signal processing, or statistics, or engineering, and computer programming in Matlab - or Python - is required.\n<br><br>\n<strong>EEO Statement</strong>\n<br>\nMassachusetts General Hospital is an Equal Opportunity Employer. <em>By embracing diverse skills, perspectives and ideas, we choose to lead. Applications from protected veterans and individuals with disabilities are strongly encouraged.</em>  Partner's Healthcare is acting as an Employment Agency in relation to this vacancy."}