{"job title": "Research Scientist, Sr. (Phd)", "company": "Massachusetts General Hospital(MGH)", "city state": "– Boston, Massachusetts", "rating": "3.9", "job description": "The Research Scientist will work independently under the general direction of the PI and Laboratory Director, Dr. David Spriggs. This person is expected to manage and conduct cutting edge research in structural and molecular biology with an eye towards clinical translation, including performing and overseeing preclinical studies.\n<br><br>\n<strong>PRINCIPAL DUTIES AND RESPONSIBILITIES:</strong>\n\n<ul>\n <li>Develop and implement pre-clinical studies in the field of protein / antibody engineering and cellular immunotherapy, including optimization and characterization of antibodies against selected targets in ovarian cancer.</li>  <li>Independently design, execute, and interpret research experiments.</li>  <li>Performs and advises other investigators in techniques relating to structural and molecular biology, and vector construction.</li>  <li>Investigates, creates and develops new methods and technologies for research advancements</li>  <li>Assist in laboratory management and advises laboratory members in troubleshooting techniques in molecular biology</li>  <li>Assists laboratory manager in maintenance of regulatory documents such as minimal-risk human research protocols and animal protocols.</li>  <li>Contribute to scientific literature and present research at scientific forums.</li> \n</ul>\n\n<strong>Qualifications</strong>\n<br>\nPhD or MD required with 4+ years of post-doctoral experience in a research-related field.\n\n<ul>\n <li>Demonstrated ability to work independently and productively.</li>  <li>Strong research design and analytical skills, with demonstrated ability to problem solve.</li>  <li>Strong teaching skills and ability to supervise trainees and students.</li>  <li>In depth knowledge of field of research, molecular biology and protein engineering and analysis.</li>  <li>Extensive post-graduate experience with structural biology of tumor associated models and therapeutics, molecular biology, and immunotherapy.</li> \n</ul>\n\n<strong>EEO Statement</strong>\n<br>\nMassachusetts General Hospital is an Equal Opportunity Employer. By embracing diverse skills, perspectives and ideas, we choose to lead. Applications from protected veterans and individuals with disabilities are strongly encouraged.\n<br>\nPartner's Healthcare is acting as an Employment Agency in relation to this vacancy."}