{"job title": "Senior Financial Data Analyst", "company": "Rhode Island Quality Institute", "city state": "– Providence, RI", "rating": "3.5", "job description": "Reports To: Senior Director, Finance<br><br>Description:<br><br><em>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill and/or ability required for this position. Reasonable accommodations may be made, upon request, to enable individuals with disabilities, who otherwise meet the qualifications, to perform the essential functions of the position.</em>\n<br><br>\nJob Summary:<br><br>This position is primarily responsible for providing financial support and analysis to business leaders to include: business planning, budgeting and forecasting, capital expenditure evaluations, and variance analysis.\n<br><br>\n<strong>Essential Duties and Responsibilities:</strong>\n<ul>\n<li>Responsible for preparing and analyzing specific consolidated reporting at all levels of the organization on actuals, forecasts, and prior fiscal year.</li><li>Responsible for developing financial modeling, financial statement analysis, decision modeling, reporting, and ad-hoc analysis to support strategic initiatives.</li><li>Assist in the continued development of budgeting, financial forecasting, operating plan, and modeling tools.</li><li>Analyze actual operating results and identify key financial and operating issues to be addressed; quantifies actual results versus forecast.</li><li>Research and resolve business unit(s) inquiries for assigned functional areas.</li><li>Routine communication with Senior Leadership relating to financial close, issues, and deliverables.</li><li>Support, analyze, and assist in the preparation and review of RIQI's annual operating budget including:\n\n<ul>\n<li>detailed support and analysis of revenue forecast and departmental budgets</li><li>detailed support and analysis of balance sheet forecasts and the associated cash flow forecasts</li><li>development of presentations to help summarize budget results in a comprehensive and easy-to-understand format</li></ul></li>\n<li>Conduct thorough research and analysis of variances to ensure data accuracy.</li><li>Prepare Financial Reporting requirements package in coordination with the Senior Manager, Finance and Grants Management.</li><li>Responsible for performing special projects to improve process efficiency and performance.</li><li>Assist with month ending closings as needed.</li><li>Cross train as back-ups for other department staff in the case of emergencies.</li></ul>\n\n<ul>\n<li>Performs other project duties as assigned.</li>\n</ul>\n<br><br>\n<strong>General Requirements:</strong>\n<ul>\n<li>Performs quality work within deadlines with or without direct supervision.</li><li>Establishes and maintains effective working relationships.</li><li>Supports and adheres to RIQI's core values and corporate culture.</li><li>Represents RIQI in a positive manner to all stakeholders.</li><li>Performs as a team player.</li><li>Self-starter; energetic; \"can-do\" attitude.</li><li>\"Metrics\" mindset.</li>\n</ul>\n\nMinimum QualificationsEducation and Experience\n\n<ul>\n<li>Bachelor's degree in Finance or related field.</li><li>Minimum of five years relevant experience.</li></ul>\n\n<ul>\n<li>Advanced knowledge of financial statements, accounting objectives, financial modeling, and application of analytical tools.</li></ul>\n\n<ul>\n<li>Advanced Excel experience.</li>\n</ul>\n\nDesired Qualifications\n\n<ul>\n<li>Self-motivated and able to perform high quality work within tight deadlines with or without direct supervision.</li><li>Work in a fast-paced environment and multi-task as necessary.</li></ul>\n\n<ul>\n<li>Excellent written and verbal communication skills with the proven ability to interact effectively with Senior Leadership.</li><li>Excellent analytical and problem-solving skills; including the ability to successfully perform independent, in-depth analysis, and generate concise conclusions.</li></ul>\n\n<ul>\n<li>Attention to detail and accuracy.</li></ul>\n\n<ul>\n<li>General understanding of accounting practices.</li></ul>\n\n<ul>\n<li>Experience working with non-profits preferable.</li><li>Experience with Abila Fund Accounting (MIP).</li>\n</ul>\n\nWork Environment<br><br>This position will work in normal business office conditions.<br><br>Physical Demands<br><br>The tasks of this position are typical for working in an office environment. An associate is regularly required to perform tasks while sitting at a desk, using normal hand dexterity. Mobility is required, including standing, moving about, and sitting. Occasional travel out of the office for meetings, etc. may be required. Must be able to maintain a good attendance record.\n<br><br>\n<strong>Prepared By:</strong> Michelle Dexter &amp; Faye Howard\n<br><br>\n<strong>Date Revised:</strong> August 3, 2018\n<br><br>\nThe statements contained herein reflect information necessary to describe the principle functions of this job, the level of knowledge and skill typically required, and the scope of responsibility, but should not be considered an all-inclusive listing of work requirements. Individuals may perform other duties as assigned, including work in other functional areas to cover absences or relief, to equalize peak work periods, or to otherwise balance the workload.\n<br><br>\n<em>Rhode Island Quality Institute is an EEO/AA Employer.</em><br><br><strong>Job Posted by ApplicantPro</strong>\n<br>"}