{"job title": "Technical Enablement Academy - Senior Associate Analytical Consultant", "company": "SAS Institute", "city state": "– Cary, NC", "rating": "3.8", "job description": "Overview\n<br><br>\nSAS believes in the whole employee experience. Meaningful work. Empowerment to make a difference that changes people's lives. Dynamic work environments that foster innovation. And an award-winning culture that makes it all possible. We believe great ideas can come from anywhere. We build software for the world's most talented thinkers. That means we need to push boundaries daily. At SAS, you'll be encouraged to use your imagination and constantly try new things.\n<br><br>\nCan you apply creative thinking to large data sets to solve customer business problems? Are you looking for an opportunity to utilize your analytic skills across a wide variety of industries? The SAS Analytical Consulting and Enterprise Solutions team (ACES) is seeking talented individuals to help our customers bridge the gap between the data they have and the solutions they need.\n<br><br>\nYou will support customer analytic business needs through requirements gathering, data discovery, analysis, reporting, and presentation.\n<br><br>\nTo prepare you for an opportunity with SAS Professional Services, you'll attend a 16 week technical training program. In addition to providing soft skills training, the Technical Enablement Academy provides training in core SAS technology areas. You'll receive the tools necessary to enable you to build and implement software to address the complex analytical questions of our customers. During the Technical Enablement Academy, key stakeholders provide guidance, coaching and expert feedback. You will also have an opportunity to achieve up to six professional SAS certifications.\n<br><br>\nCan you apply creative thinking to large data sets to solve customer business problems? Are you looking for an opportunity to utilize your analytic skills across a wide variety of industries? The SAS Analytical Consulting and Enterprise Solutions team (ACES) is seeking talented individuals to help our customers bridge the gap between the data they have and the solutions they need.\n<br><br>\nYou will support customer analytic business needs through requirements gathering, data discovery, analysis, reporting, and presentation.\n<br><br>\nTo prepare you for an opportunity with SAS Professional Services, you'll attend a 16 week technical training program. In addition to providing soft skills training, the Technical Enablement Academy provides training in core SAS technology areas. You'll receive the tools necessary to enable you to build and implement software to address the complex analytical questions of our customers. During the Technical Enablement Academy, key stakeholders provide guidance, coaching and expert feedback. You will also have an opportunity to achieve up to six professional SAS certifications.\n<br><br>\nResponsibilities include but are not limited to:\n\n\n<ul>\n<li>Analyzing large volumes of customer data for accuracy and consistency.</li>\n<li>Translating business requirements into analytic methods, building analytic models, and presenting results.</li>\n<li>Automating analytic processes.</li>\n<li>Developing and enhancing custom software tools.</li>\n<li>Assisting in quality assurance efforts for all ACES projects.</li>\n<li>Acquire and maintain a detailed level of SAS product knowledge through continuing training and project delivery.</li>\n<li>Translate customer business needs and problems into requirements for data and analytical approaches.</li>\n<li>Understand, utilize, and communicate best practices and standard industry approaches while incorporating novel analytical solutions.</li>\n</ul>\n\n<strong>Essential Requirements:</strong>\n\n\n<ul>\n<li>Master's degree in Statistics, Mathematics, Computer Science, Operations Research, Analytics, Economics, Physics, or a related quantitative field.</li>\n<li>Analytical Programming experience, ideally in SAS, R, and/or Python</li>\n<li>Willing to relocate or currently located in the Cary, NC area.</li>\n</ul>\n\nEquivalent combination of education, training, and relevant experience may be considered in place of the education requirement stated above.\n<br><br>\n<strong>Preferences:</strong>\n\n\n<ul>\n<li>Experience with analytic approaches related to fraud detection.</li>\n<li>Experience in accounting, financial, risk management, or tax industry domains/verticals.</li>\n<li>Experience with public speaking, such as conference presentations or classroom teaching.</li>\n<li>Experience with big data technologies such as Hadoop, Spark, etc.</li>\n<li>Work or academic experience with information technology concepts such as architecture, databases, software development and deployment, etc.</li>\n<li>2+ years of experience in data analysis or analytical consulting.</li>\n<li>1+ year of experience programming in the SAS System.</li>\n</ul>\n\n<strong>Additional Information:</strong>\n\n\n<ul>\n<li>Excellent written and verbal communication skills.</li>\n<li>Ability to solve customers' complex business problems using innovative analytical processes and techniques.</li>\n<li>Familiarity with data mining approaches.</li>\n<li>Significant project and/or internship experience demonstrating individual and team work abilities.</li>\n<li>Ability to communicate with people of various technical and business backgrounds, including the ability to explain difficult technical concepts in simple terms to business users.</li>\n<li>Ability to work independently and with a team environment.</li>\n<li>Proven record of handling increasing responsibilities.</li>\n<li>Ability to travel as business requirements dictate, up to 25%.</li>\n</ul>\n\nThis is an entry-level position. If you are being considered, please note that you will need to provide a copy of your academic transcript.\n<br><br>\nAdditional Information:To qualify, applicants must be legally authorized to work in the United States, and should not require, now or in the future, sponsorship for employment visa status.SAS is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status or any other characteristic protected by law.The level of this position will be determined based on the applicant's education, skills and experience.Resumes may be considered in the order they are received.SAS employees performing certain job functions may require access to technology or software subject to export or import regulations. To comply with these regulations, SAS may obtain nationality or citizenship information from applicants for employment. SAS collects this information solely for trade law compliance purposes and does not use it to discriminate unfairly in the hiring process.\n<br><br>\nWant to stay up to date on SAS culture, products and jobs? Follow us on LinkedIn"}