{"job title": "Business Intelligence Analyst", "company": "Sparrow Health System", "city state": "– Lansing, MI", "rating": "3.3", "job description": "Job Opportunity Job ID: 10131 Data Analytics, Data Visualization, Reporting Description: <p><strong>Positions Location:</strong> Lansing, MI</p> Job Description <p>Sparrow IT is a team of <strong>enterprising critical thinkers</strong> who enjoy solving problems and improving process and systems in healthcare a field which serves an important public purpose. </p> <p>Our IT department supports all aspects of the health system: administration, business intelligence, clinical, facilities, finance, human resources, informatics, insurance, patient care, project management, supply chain and technology. Our IT team has a variety of curricular and professional backgrounds and has a desire for meaningful work, career advancement and real responsibility. The IT team shares a passion for systems and design thinking, analytics, optimization and process improvement.</p> <p>The <strong>Business Intelligence Analyst</strong> works in a fast paced, changing health care environment. The Business Intelligence (BI) Analyst will coordinate and actively contribute throughout the BI development life cycle from initial requirement analysis, documentation, prototyping, design, and development all the way through to implementation, quality assurance, and user acceptance. The BI Analyst will work with internal and external customers to understand their requirements and present analytical results in an easy to understand communication. The BI analyst will also partner with customers and other IT application analysts to provide technology solutions that incorporate reporting and data analytic needs within SHS applications. </p> <p><strong>Essential Duties</strong>:</p> <ul> <li>Provide data visualizations, dashboards, analysis, extracts and reporting solutions from multiple health care data sources such as Epic EMR, Lawson, and other provider and payer data.</li> <li>Drive BI and data analytic processes and technology improvement initiatives.</li> <li>Use data to identify trends, patterns and opportunities for the business. </li> <li>Identify effective and strategic business reporting solutions through research and analysis of data and business processes. </li> <li>Analyze how information systems and reporting solutions can be applied to reduce cost, increase revenue, improve efficiency, and provide higher quality data and reporting. </li> <li>Communicate with business users and senior leaders regarding areas of opportunity to leverage data and reporting solutions. </li> <li>Research, analyze and recommend health care reporting solution best practices.</li> <li>Create appropriate documentation for BI and data analytic solutions and data definitions.</li> <li>Assist in customer training sessions by providing documentation, topics, and support for complex questions.</li> <li>Present and communicate BI and data analytic solutions and analysis to customers of any level in the health system.</li> <li>Go-live elbow support of BI and DA areas.</li> <li>Manage ticket queue, review tickets, assure correct team is assigned to resolve, obtain additional information from customer</li> <li>Resolve common report/data issues, troubleshoot and document issue resolution.</li> <li>Execute test scripts for unit testing and integrated testing for upgrades</li> <li>Tier II support for warm transfers from helpdesk during peak call times</li> <li>Project support to analysts tasks associated with projects to assist analyst</li> <li>Command center support for go-lives</li> <li>Small optimizations/projects</li> <li>Escalate issues to vendors</li> <li>Develop test scenarios for reports, dashboards, data visualizations</li> <li>Own sub-projects of larger projects lead by intermediate, advanced and senior analysts</li> </ul> <p></p> Job Requirements EducationMust be actively pursuing a bachelor's degree in a relevant course of study including: Engineering (any kind) Accounting, Business, Economics, Finance, Supply Chain Computer Science/Technology Healthcare Administration or Public Health Math/Science/Logic/Statistics Analytically Oriented Humanities fields Specialized Knowledge and SkillsDemonstrable aptitude/willingness to learn: data analysis, data visualization tools, how to query data, structure and content of health care data, how to improve processes using data, report development Excellent verbal and written communication skills Ability to work independently and in a team environment Flexibility and adaptability Strong problem solving, analytical, logical reasoning, customer service and training skills. Professionalism and self-motivation. Candidates should have a passion for improving systems and processes and desire for real responsibility. Demonstrate an aptitude and willingness to learn and teach others. Preferred: Understanding and experience in project management Data analysis and reporting Previous programming, report writing, SQL, ETL, or IT related experience Healthcare related experience <p>After review of application, candidates being considered for next steps will be required to complete a series of aptitude and skills assessments online as part of the consideration process for this position.</p> <p>Sparrow Health System is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected Veteran status.</p> <p>This job description is intended to cover the minimum essential duties assigned on a regular basis. Caregivers may be asked to perform additional duties as assigned by their leader. Leadership has the right to alter or modify the duties of the position.</p> Job Family Information Technology Requirements: Shift Match Any Degree Type / Education Level Bachelor's Status Match Any Facility Match Any Experience Level Under 4 Years<br> Associated topics: business, business analyst, business intelligence, business systems, consult, consultant, customer, market, marketing, sap"}