{"job title": "Data Analyst", "company": "Syracuse City School District", "city state": "– Syracuse, NY", "rating": "3.0", "job description": "The Data Analyst informs and conducts data analysis and interpretation on the City School District research and evaluation efforts to inform District programs, instruction, and curriculum. The incumbent applies data analysis and data delivery skills to support school and overall system improvement efforts, particularly in relation to persistently low-performing schools within the City School District. The incumbent works with teams to develop research and evaluation plans, as well as independently to select methods, analyze data, and make appropriate interpretations. The incumbent also develops tools that effectively and efficiently deliver data results to a wide variety of stakeholders. Work is performed under the general supervision of the Director of Research, Planning and Accountability with leeway allowed for the use of independent judgment in carrying out the details of the work. Does related work as required. TYPICAL WORK ACTIVITIES: Identifies appropriate methods for analyzing and interpreting both qualitative and quantitative data. Analyzes and interprets assessment data resulting from locally selected and state-mandated tests. Assist District Assessment Coordinator(s) in the verification of data and results reported on state-mandated tests. Analyzes and interprets qualitative and quantitative data to inform District programs and initiatives, including those supported by grant funding. Collects, analyzes, and interprets data to inform improvement and change initiatives, including those addressing persistently low-performing schools within the District Develops and administers appropriate data collection tools identified by District program evaluation and research efforts. Informs program evaluation and researches designs, particularly with regard to data sources, collection tools, and analysis techniques. Supports the development and maintenance of electronic databases of assessment and program data. Develops reports and presentations on assessment results for supervisors approval and dissemination to District administrators, schools, and the Board of Education. Adheres to ethical guidelines defined by the American Psychological Association (APA). FULL PERFORMANCE KNOWLEDGES, SKILLS, ABILITIES AND PERSONAL CHARACTERISTICS: Working knowledge and skills in research and program evaluation design. Demonstrated practical experience of knowledge and skills in developing valid and reliable data collection tools. Documented and demonstrated knowledge and skill in developing, maintaining and using databases of various size and complexity. Documented and demonstrated understanding of and skills in qualitative and quantitative analysis techniques. Working knowledge of various assessments, particularly the interpretation and use of resulting data. Advanced skills and practical experience using statistical software packages, such as SPSS. Advanced skills in Microsoft Office programs, including PowerPoint and Excel. Demonstrated skill in effective oral and written communication, including the ability to communicate results to a wide variety of audiences. Evidence of excellent understanding of and skills developing data collection tools. Demonstration of excellent skills and direct, practical experience analyzing and interpreting quantitative and qualitative data. MINIMUM QUALIFICATIONS: A. Graduation from a regionally accredited NYS registered college or university with a Masters Degree in Instructional Design, Instructional Technology, Educational Psychology, Statistics, Public Administration, Business Administration, Economics, Research, Education, Sociology, Political Science or Psychology or a closely related field; OR, B. Graduation from a regionally accredited or NYS registered community college with a Bachelors degree in (A) above and one (1) year of work experience, or its part-time equivalent, in evaluating education systems or institutional research and planning which includes research, evaluation, data collection and analysis; OR, C. Five (5) years of work experience, or its part-time equivalent, in evaluating education systems or institutional research and planning which includes research, evaluation, data collection and analysis. Democrat and Chronicle. Keywords: Data Analyst, Location: Syracuse, NY - 13201"}