{"job title": "Business Intelligence Analyst III", "company": "TalentBurst", "city state": "– San Francisco, California", "rating": "3.5", "job description": "<br> Gather F&amp;S analytics requirements, business logic and key metrics------ Collaborate with F&amp;S business stakeholders on analytics solutions------ Perform Data Analysis using existing BOBJ universes and available datasets------ Prototype Wave dashboards based on requirements gathered------ Work with F&amp;S IT &amp; development counterparts to translate prototypes built and requirements gathered for full implementation------ 4-6 years analysis experience<br> <br> Must Salesforce Admin Certification<br> <br> We are seeking a hands-on Data Management and Insights Business Solution Sr. Analyst to develop solutions for our CSG Analysis, Insights and Data Visualization team. The selected candidate will engage with our business and operations teams from initial project definition through to project completion and will engage on multiple projects. Primary responsibilities will include the development of reporting and analytical solutions, a full suite of documentation, as well as some light application updates to enable such solutions.<br> <br> Deliverables include Salesforce reporting and dashboard solutions and documentation, light application enhancements, and custom analysis. The results of your work will allow us to streamline our reporting operations and enable the generation of new insights that will allow us to transform our Analytics &amp; Insights efforts to support our business strategy.<br> <br> Your Impact - Responsibilities:<br> Develop and maintain comprehensive documentation of complex business reporting requirements.<br> Work with business partners and operations team members to understand complex business reporting requirements and perform analysis of Salesforce and customer activities to determine alternative business solutions or process improvement opportunities.<br> Be very passionate and take pride in creating awesome analysis and insights for our stakeholders.<br> Closely work with operations and other internal teams for project delivery.<br> Resolve ambiguities and conflicting business and technical requirements.<br> Proactively identify issues concerning technical limitations and key product requirements.<br> Performs related duties as assigned or requested."}