{"job title": "Data Analyst", "company": "Workbridge Associates", "city state": "– Philadelphia, Pennsylvania", "rating": "3.1", "job description": "Philadelphias leading law firm is looking for a Data Analyst to join their team. They have a long history of caring deeply about their peers, client and theirmunity. Individual must be able to interact with Attorneys followingpanys standards. Along with interacting with Attorneys, the individual will be part of the important end-client meeting process. Person must have good understanding of Data Structure and how data should be arranged, aligned and needed for producing output. The individual must be able to decode and understand Rules, Logics, Calc, Formulas, Etc. as well as ETL, SQL, SSIS, Advanced XLS (like Vlookup) Etc. Automation, Utilization is nice to have. The position allows for flexible work hours (5 late days per month or 1 month per month).\n<br><br>\n<strong> Required Skills &amp; Experience</strong>\n<li> 5+ years experience or technical background Proficient in ETL, SQL, SSIS</li> <li> Advanced XLS (like VLookup)</li> <li> Good understanding of Data Structure</li> <li> Automation and Utilization is not required but nice to have</li>\n<strong> What You Will Be Doing</strong>\n<br><br>\nTech Breakdown\n<li> 60% data analytics</li> <li> 40% Project Management</li>\n<strong> The Offer</strong>\n<br><br>\nYou will receive the following benefits:\n<li> Medical Insurance &amp; Health Savings Account (HSA)</li> <li> 401(k)</li> <li> Paid Sick Time Leave</li> <li> Pre-taxmuter Benefit</li>\nApplicants must be currently authorized to work in the United States on a full-time basis now and in the future.\n<br><br>\nThis position does not offer sponsorship.\n<br><br>\nWorkbridge Associates, part of the Motion Recruitment network, provides IT Staffing Solutions (Contract, Contract-to-Hire, and Direct Hire) across 11 major North American markets. Our unique expertise in todays highest demand tech skill sets, paired with our deep networks and knowledge of our local technology markets, results in an exemplary track record with candidates and clients."}