{"job title": "Data Analyst", "company": "Accounting Principals", "city state": "– Coppell, Texas", "rating": "3.9", "job description": "Accounting Principals has partnered with a well known Coppell based company to find an experienced Data Analyst for a long term contract. This is a great opportunity to make some good money and gain valuable experience. This role will provide support for client activities, as initiated through advanced troubleshooting inquiries that are efficiently, effectively and securely conducted. The role will assist in the investigation of communication and data reception issues. Will also serve as a technical source for information and work with field personnel on the identification and remediation of data and communication issues. The role drives troubleshooting through to completion and aids in the identification of solutions and best practices, and is an integral team member of the strategy team that forms a key part of this line of business.\n<br><br>\n<strong>What You Will Be Doing:</strong>\n\n\n<ul>\n<li>Drives additional troubleshooting of issues as it relates to the proper functionally of the solution offering to help in the identification of trends and root cause</li>\n<li>Assists in the proposing and execution of remedies</li>\n<li>Aids in the identification of issues with safe data file errors and functionality of support applications (e.g., dashboards)</li>\n<li>Interfaces with internal support and field support groups to help identify and remediate issues</li>\n<li>Ensure that operational policies, procedures, workflows and reporting formats for current and future products are followed</li>\n<li>Support business objectives related to product line growth initiatives</li>\n<li>Support and drive continuous improvement of processes directed toward reducing costs, improving cycle time, increasing sales gross profit, and enhancing customer satisfaction</li>\n<li>Key understanding of Recycler/CompuSafe technology and participates in overall product growth</li>\n<li>Perform other duties as assigned or necessary</li>\n</ul>\n\n<strong>The Ideal Candidate Will Have:</strong>\n\n\n<ul>\n<li>Minimum of 3 years experience implementing technology related solutions</li>\n<li>Minimum of 3 years experience in computer-based tools and Microsoft applications</li>\n<li>Minimum of 3 years experience in common retail, banking and/or treasury practices</li>\n<li>Minimum of 2 years experience in field operations</li>\n<li>Record of achievement including high standards and integrity</li>\n<li>Demonstrated understanding of financial &amp; operational measurement systems\n<br><br>\n<strong> More Information</strong></li>\n\n</ul>"}