{"job title": "Clinical Research Scientist and Operations Manager", "company": "Beacon Hill Staffing", "city state": "– Chicago, Illinois", "rating": "4.5", "job description": "<div> </div>  <div> \n<div><strong>Description:</strong></div><div><strong> Clinical Research Scientist and Operations Manager needed!</strong>\n<br><br>\nThe Clinical Research Scientist and Operations Manager (CRSOM) will provide scientific and operational support for multiple global Phase 4 clinical and epidemiologic studies across all vaccine programs within Medical Development, Scientific and Clinical Affairs (MDSCA). Studies may include routine clinical trials, Research Collaborations and non-interventional studies globally.\n<br><br>\n<strong> Responsibilities:</strong>\n\n<ul>\n<li> Working collaboratively with the Clinical Scientists, Clinical Lead, Medical and Scientific Affairs physicians, to develop study strategies in support of the various vaccine clinical plans.</li>\n<li> The CRSOM may be responsible for drafting study protocols, informed consents, training materials, and other critical study documents.</li>\n<li> This individual will also be responsible for managing the operational aspects of the research projects assigned, to ensure high quality management and implementation of clinical research collaborations and other sponsored research initiatives.</li>\n<li> They will be responsible for coordinating activities and deliverables for all assigned projects within the Clinical Affairs group.</li>\n<li> They will liaise with members of the extended MDSCA team, as well as with other partners including, but not limited to, Development Operations, Regulatory Affairs, Safety &amp; Risk Management, Business Process Owners, Clinical Research Collaboration Liaison, Protocol Operations Lead, Outsourcing &amp; Contracting, Accounts Payable, etc.</li>\n<li> The individual may also provide project support for cross-functional teams including program Epidemiology Sub-teams.</li>\n<li> Participate in external communities to influence architecture and technology standards to support objectives</li>\n</ul>\n<strong> Qualifications:</strong>\n\n<ul>\n<li> Years of Experience: 5-7</li>\n</ul>\nBeacon Hill is an Equal Opportunity Employer that values the strength diversity brings to the workplace. Individuals with Disabilities and Protected Veterans are encouraged to apply.\n</div> </div>"}