{"job title": "Staff Quality Assurance Scientist - Field Actions", "company": "Beckman Coulter - Diagnostics", "city state": "– Miami, Florida", "rating": "NA", "job description": "About UsAt Beckman Coulter, we are dedicated to advancing and optimizing the laboratory. For more than 80 years, we have been a trusted partner for laboratory professionals, helping to advance scientific research and patient care. We do challenging work on a global scale, and are invested in growing our associates careers. We embrace continuous improvement, and are passionate about moving science and healthcare forward.\n<br>\nWe have a vital role at Beckman Coulter: our focus on innovation, reliability and efficiency has led us to become the partner of choice for clinical, research and industrial customers all over the world. Beckman Coulter is a Danaher company, operating in two industries: Diagnostics and Life Sciences.\n<br>\nBeckman Coulter is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, national origin, religion, gender, age, marital status, disability, veteran status, sexual orientation, gender identity, or any other characteristic protected by law.\n<br>\nAll employment offers are contingent upon successful completion of our pre-employment drug screening and background/criminal check. Be sure to follow Beckman Coulter on LinkedIn!\n<br><br>\n<strong><br><br>Description</strong><br><br>The Staff Quality Assurance- Field Actions is responsible for the execution of field action strategies and operational initiatives developed by site leadership in the area of field actions (FA). Responsible for managing and executing the field action and recall functions the Business Unit. Functions include preparing the 806 Notification to the FDA, notification for other Regulatory Bodies, responding to additional requests from Regulatory Bodies and internal requests and maintaining the recall files and records. <strong> Responsibilities:</strong> <li> Provide primary support for Field Action activities; Collaborate in the Field Action (FA) and Recall processes to ensure that voluntary or mandatory corrections, removals and recalls are managed effectively and efficiently and reported to regulatory agencies as required</li> <li> Participate in correction and recall strategies to include effectiveness checks, recall letters and recall reports</li> <li> Coordinate pre-field action activities including project management of the field action Watch list and FA Assessments and work with leadership to implement the FA strategy</li> <li> Obtain data and facts from FA from subject matter experts and use to prepare the initial FA presentations, complete initial FA decision trees, work with leadership to prepare the FA customer letter and obtain the appropriate management reviews and approvals prior to presentation to the Global Field Action Subcommittee</li> <li> Work with Marketing to circulate the FA support package for the required approvals</li> <li> Prepare Agency Reports as related to field actions and circulate for the required approvals</li> <li> Pull customer lists and prepare and send out Customer Letter Mailings and customer email blasts</li> <li> Prepare initial drafts of responses to Agency Inquiries for additional information, circulate for approvals and maintain the associated Master Tracking List</li> <li> Prepare initial drafts of Regulatory Agency Progress Reports and Recall Terminations, circulate for approvals and maintain the associated Master Tracking List</li> <li> Communicate with corporate and international regulatory professionals per corporate procedures</li> <li> Track and document customer responses and recall response rates.</li> <li> Maintain Field Action binders and FA supplemental binders and ensure that supported sites have access to these records at all times</li> <li> Track and communicate Regulatory Agency commitments and due dates</li> <li> Routinely communicate recall project goals, status, requirements, and deliverables to the Business Unit. Work closely with Business Unit to define, support, and implement functional field action infrastructure to support the needs of the Hematology, Cytometry and Urinalysis business</li> <li> Participate in audit preparedness to ensure accuracy and completeness of pertinent records and documentation. Assist in the coordination of document management for data analysis and data review processes for audit readiness</li> <li> Maintain professional and technical knowledge and continually update job knowledge by interacting with Subject Matter Experts, reviewing professional publications, establishing and maintaining personal networks, benchmarking state-of-the-art practices, participating in educational opportunities and professional societies, reading professional publications, and participating in educational opportunities</li> <li> Maintain current knowledge of global regulations impacting complaint handling, adverse event reporting, field action, CAPA and Post Market</li> <li> Surveillance activities. Apply knowledge, develop processes, optimize processes, and suggest improvement to current processes as needed</li> <li> Provide a high level of professional support during internal and external audits; Perform other related duties and assignments as required</li>\n<strong><br><br>Qualifications</strong>\n<li> Bachelors degree in Science and 9+ years of relevant Quality/Regulatory Affairs experience or Masters degree in Science and 7+ years of relevant Quality/Regulatory Affairs experience or doctoral degree in field with 4+ years or relevant experience</li> <li> Experience managing multiple high priority projects at the same time</li> <li> Demonstrated knowledge of BEC products (Hematology, Flow Cytometry, and Urinalysis)</li> <li> FDA regulated environment experience is strongly recommended</li> <li> Ability to drive results, foster teamwork, handle pressure, and provide feedback</li> <li> Experience participating on cross functional teams</li> <li> High level of knowledge of recall requirements in the US, Canada, EU and other international countries</li> <li> High level of knowledge with the Quality and Regulatory requirements associated with recalls which include Risk Management, Complaints,</li> <li> Investigations, CAPAs, and Quality Notifications</li> <li> Excellent communication and interpersonal skills. Strong multitasking abilities</li> <li> Strong organizational and multi-tasking skills; High level of time management skills to oversee multiple recalls during a period of time.</li> <li> Microsoft Office proficient</li> <li> Ability to work on multiple projects with various disciplines are essential. Position requires innovative thinking, ability to solve problems and meet deadlines</li> <li> Readily accepts responsibility and accountability for project success and key decisions</li> <li> Proven ability to work cross-functionally in a team based environment.</li> <li> Willingness to be flexible and adaptable to changing priorities and have a high sense of urgency</li> <li> Excellent oral and written communication skills</li> <li> Effective analytical and problem solving skills</li>\n#LI-SC<br><br>Danaher Corporation OverviewDanaher is a global science &amp; technology innovator committed to helping our customers solve complex challenges and improve quality of life worldwide. Our world class brands are leaders in some of the most demanding and attractive industries, including life sciences, medical diagnostics, dental, environmental and applied solutions. Our globally diverse team of 67,000 associates is united by a common culture and operating system, the Danaher Business System, which serves as our competitive advantage. We generated $18.3B in revenue last year. We are ranked #162 on the Fortune 500 and our stock has outperformed the S&amp;P 500 by more than 1,200% over 20 years. At Danaher, you can build a career in a way no other company can duplicate. Our brands allow us to offer dynamic careers across multiple industries. Were innovative, fast-paced, results-oriented, and we win. We need talented people to keep winning. Here youll learn how DBS is used to shape strategy, focus execution, align our people, and create value for customers and shareholders. Come join our winning team.\n<br><br>\n<strong> Organization</strong>\n<br><br>\n:Beckman Coulter - Diagnostics"}