{"job title": "Data Analyst", "company": "BI Worldwide", "city state": "– Edina, MN", "rating": "3.9", "job description": "We are in the inspiration business!\n<br><br>\nWe apply our talent to get people to change their beliefs and behaviors to produce results for our clients. We work with great companies who value their employees, customers and partners.\n<br><br>\nWe're the leader because of our associates. We hire the best.\n<br><br>\nOur Decision Sciences team is seeking a talented Data Analyst to join their team.\n<br><br>\n<strong>Responsibilities of this position will include:</strong>\n\n\n<ul>\n<li>Conduct data analysis and analytics using multiple techniques and approaches -- Descriptive, Diagnostic, Predictive and/or Prescriptive analytics.</li>\n<li>Provide reporting and analytics solutions to meet the needs of internal and external clients.</li>\n<li>Develop and deliver reports and dashboards through Tableau, Cognos, or other reporting and analytic tools, including responsibility for visual design/look &amp; feel of the reports.</li>\n<li>Effectively manage multiple projects and initiatives simultaneously, with proactive status communication to team members and internal or external clients.</li>\n<li>Identify and mitigate project obstacles, with an attention to detail and accuracy.</li>\n<li>Assist and support Decision Sciences Design resources with the Design and Definition phases related to results reporting, analysis and analytics.</li>\n<li>Provide consultative services to other BI WORLDWIDE resources regarding data, reporting, analysis and analytics.</li>\n</ul>\n\nIdeal candidates will possess the following skills, experience and attributes:\n\n\n<ul>\n<li>BA/BS degree in Business, Finance, Statistics, Technology or other related field is required.</li>\n<li>3+ years of experience conducting analysis in a business environment.</li>\n<li>Advanced experience manipulating and exploring data.</li>\n<li>Knowledge of reporting and analysis tools -- experience with Tableau and/or Cognos tools will be favored.</li>\n<li>Robust curiosity and problem-solving skills.</li>\n<li>Strong skills with multiple analytic techniques/methods.</li>\n<li>Process oriented, with strong attention to detail and accuracy.</li>\n<li>Clear communicator, both verbal and written.</li>\n<li>Extraordinary desire to learn, and learning agility.</li>\n<li>Experience presenting results to clients, both internal<br><br>SDL2017</li>\n\n</ul>"}