{"job title": "Business Data Analyst", "company": "Centerplate", "city state": "– Miami Gardens, FL", "rating": "3.4", "job description": "<strong>Business Data Analyst</strong>\n<br><br>\nA Business Data Analyst position is currently available in Miami, Florida\n<br><br>\n<strong>About Centerplate</strong>\n<br><br>\nFounded in 1929, Centerplate (the \"Company\"), powered by Sodexo, serves as a leading provider of hospitality services to North America and the U.K.'s premier sports facilities, convention centers, and entertainment venues. Centerplate's primary services include: food and beverage / catering services, specialty retail management, and design services. Serving over 170 venues and 100 million guests annually, Centerplate is an integral partner to clients across a broad list of end markers, including: professional sports, convention centers, college athletics, ski resorts, minor league sports, attractions, and theaters, among others.\n<br><br>\n<strong>About the position</strong>\n<br><br>\nCenterplate, powered by Sodexo, is the food and beverage/specialty retail services provider for Hard Rock Stadium, home to the NFL's Miami Dolphins. We are currently in search of a Business Data Analyst to provide analytical expertise through quantitative modeling and critical performance measurement of point-of-sale data across Hardrock Stadium food and beverage retail channels.\n<br><br>\nThe Business Data Analyst position will create customized approaches to deliver actionable insights and solutions to complex business problems. They will leverage and integrate POS data, develop sales strategies and will assist in efficiently calibrating pricing, distribution and promotions. The Business Data Analyst is a polished and experienced research and consulting professional with strong analytic, strategy and leadership skills. Working closely with the local operating team (GM + RVP), Director of Data Analytics and the Vice President &amp; Area Controller of Field Finance, they will lead projects from concept through final delivery to understand and overcome the business' most pressing issues in the areas of Operations, Innovation, Labor Management and Marketing and to add value with executable strategies and tactics.\n<br><br>\n<strong>What does this mean for you?</strong>\n<ul>\n<li>A tangible stake in a growing and successful hospitality company</li><li>Collaboration with exceptional peers who are passionate about what they do</li><li>Flexibility to work on many new and challenging projects</li><li>An opportunity for increased responsibility, leadership and professional growth</li><li>Opportunity to work with world class professional sports team</li>\n</ul>\n<br><br>\n<strong>Responsibilities including:</strong>\n<ul>\n<li>Work collaboratively with client(s) and local Centerplate stakeholders to understand their objectives to offer and demonstrate digestible insights and strategies.</li><li>Leverage technical data from various sources to help tell the story to a non-technical audience.</li><li>Understand consumer dynamics to analyze behavior trends and business performance data, summarize findings, and suggest a clear action plan for improvement.</li> <li>Prepare and present fact-based insights and recommendations to drive value-added and successful action strategies.</li><li>Support the design and development of analytical platforms that helps us and client understand our customers better.</li><li>Collaborate cross functionally with business leaders to test/pilot concepts and help develop plans to scale execution and implementation.</li><li>Periodically travel to company locations in the U.S. for consulting, training or data collection projects.</li> <li>May require travel from time to time, including training and attending industry events and seminars.</li> \n</ul>\n<strong>Ideal Candidate Qualifications:</strong>\n<ul>\n<li>Bachelor's degree (or higher) in business analytics, statistics, economics, finance, or related field.</li><li>Minimum of 2 years' experience in analytics preferred.</li><li>Excellent analytical skill set with spreadsheet modeling experience.</li><li>Natural ability to translate complex findings and analysis in digestible and simple formats to varying groups of seniority levels.</li><li>High proficiency with Excel and PowerPoint. Microsoft Power BI/PowerQuery, Tableau, and SQL a plus.</li><li>Position demands good interpersonal skills (verbal and written), using sound judgement, being a quick learner, and ability to adapt and pivot to new situations.</li> <li>Knowledge of QUEST and Micros POS is highly desired.</li><li>Ability to work in a fast-paced and dynamic environment, exercise independent judgment, work on own initiative and on multiple projects simultaneously</li>\n</ul>\nImmigration or work visa sponsorship is not available for applicants to this position.\n<br><br>\n**Please include salary requirements when applying. **\n<br><br>\nThank you for expressing interest in employment with Centerplate. While only those candidates considered for this position will be contacted, your resume will remain on file for 90 days.\n<br><br>\nCenterplate is an Equal Opportunity Employer.<br><br><strong>Job Posted by ApplicantPro</strong>\n<br>"}