{"job title": "Data Analyst", "company": "CSpring", "city state": "– Indianapolis, IN", "rating": "3.5", "job description": "CSpring is seeking a Data Analyst to join our team in Indianapolis, IN. At CSpring, you truly do make a difference. Be heard, work on challenging assignments, improve your community, and join a growing team that will both challenge you and value your contributions. When you join CSpring, you become part of our Ohana or extended family and our most valuable asset. You are NOT just another \"resource\" as is the case with many other consulting or staffing firms.\n<br><br>\nIf you possess the qualifications listed below, please apply for this position and a member of our recruiting team will contact you directly. Your information will remain confidential and you will never be submitted for a position without your approval.\n<br><br>\nThe Data Analyst will be responsible for creating and maintaining reports for internal and external customers from multiple source systems. The Data Analyst will be accountable for understanding and operating a number of source systems that house data for various functional areas across US Life Companies, including, but not limited to, Operations, Distribution, Finance, and Actuarial. The Data Analyst will generate complete, accurate, timely and transparent reporting as required by various internal and external stakeholders.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Performs data collection, analysis, validation and reporting.</li>\n<li>Designs, tests, and documents processes, SQL queries, and stored procedures.</li>\n<li>Extracts and analyzes data from various sources, including databases, manual files, and external websites</li>\n<li>Responds to data inquiries from various groups within an organization</li>\n<li>Creates and publishes regularly scheduled and ad hoc reports</li>\n<li>Documents reporting requirements and processes and validates data components as required</li>\n<li>Supports USLI functional areas by maintaining standard reporting (through existing dashboards or queries) and responding to internal and external ad-hoc requests.</li>\n<li>Generates standard and ad-hoc reports, applying skill, judgment, and understanding of operational information and needs.</li>\n<li>Creates and then executes queries to download data from multiple source systems to create reports according to customer specifications.</li>\n<li>Delivers regular reporting and assists team leadership with analysis by mining, cleaning or aggregating data.</li>\n<li>Maintains existing reporting and dashboards by keeping refresh schedules, performing data auditing or revising queries as needed.</li>\n<li>Handle incoming ad-hoc analyses, data requests and other questions from key stakeholders.</li>\n<li>Keeping documentation on updates or changes to data sources, reporting or any other analysis.</li>\n<li>Reviews reports to ensure accuracy and compliance.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>Associate's Degree or equivalent work experience</li>\n<li>2-5 years of experience in a Data Analyst or Data Entry role</li>\n<li>Strong customer focus with a passion for providing internal and external customers with responsive, high quality results</li>\n<li>Requires experience with relational databases and knowledge of query tools and/or statistical software.</li>\n<li>Experience gathering information from multiple data sources using a variety of tools</li>\n<li>Ability to run SQL Code and have a basic understanding of coding</li>\n<li>Experience with Business Objects and Spotfire</li>\n<li>Excellent analytical and problem-solving skills</li>\n<li>Ability to see tasks and responsibilities through to completion</li>\n<li>Highly proficient in Microsoft Office products including Excel, Word, Access, and PowerPoint</li>\n<li>Effective communicator verbal &amp; written, formal &amp; informal</li>\n<li>Database maintenance experience</li>\n<li>Ability to SQL code and/or write scripting</li>\n<li>Insurance industry experience, preferably exposure in life or long-term care insurance is preferred but not required</li>\n<li>Insurance process and product knowledge is preferred but not required</li>\n</ul>\n\nCSpring offers a comprehensive compensation, training, and benefits package; including Paid Time Off, PPO and HSA Medical Insurance Options, Dental, Vision, STD, LTD, Life Insurance, and IRA Match. For more information about CSpring, please visit our website at<br><br>SDL2017"}