{"job title": "Machine Learning Engineer", "company": "EdgeCast Networks", "city state": "– Boston, MA", "rating": "4.1", "job description": "Machine Learning Engineer\n\n<ul>\n<li>Boston, MA</li><li>Full-time</li>\n</ul>\n\n<div>Company Description<div><strong>About Pluralsight</strong>\n<br><br>\nFounded in 2004 and trusted by Fortune 500 companies, Pluralsight is <strong><em>the</em></strong> technology learning platform organizations and individuals in 150+ countries count on to innovate faster and create progress for the world.\n<br><br>\n<strong>Working at Pluralsight</strong>\n<br><br>\nAt Pluralsight, we believe everyone should have the opportunity to create progress through technology. That everyone should have access to the skills of tomorrow. That technology can\n<br><br>\nmake the world a better place. Through the work we do everyday, we empower the people who power our world.\n<br><br>\nAnd we don’t let fear, egos or drama distract us from our mission. We’re adults, and we treat each other that way. We have the autonomy to do our jobs, transparency to eliminate office politics and trust each other to do the right thing. We thrive in an environment with creativity around every corner, challenges that keep us on our toes, and peers who inspire us to be the best we can be. We bring different viewpoints, backgrounds and experiences, and united by our mission, we are one.</div>Job Description<div><strong>The Opportunity</strong>\n<br><br>\nIris is Pluralsight’s learning intelligence platform, an innovative and unique user experience, whose aim is to use data to create a smarter, personalized learning journey. It is cutting edge and a key component of Pluralsight’s strategy. We are growing a team of people from multiple disciplines who love solving complex problems with data and are excited by the prospect of creating the brains behind Iris. As a Machine Learning Engineer, you will be responsible for building the infrastructure and implementing the algorithms that make Iris smart. You will be working on a cross-functional team with a Product Manager, UX designer, dev ops specialist, machine learning engineers, and software engineers. You’ll be part of a team that is user focused, has a mentality for experimentation, and iterates quickly.\n<br><br>\n<strong>Who you are:</strong>\n<ul>\n<li>You have a strong foundation in Machine Learning and Computer Science and an understanding of applied statistics and math. You have a broad understanding of state of the art in Machine Learning.</li><li>You are a master of SQL-like databases (e.g. PostGres, Impala, Hive), preferably with experience with Spark and other big data platforms.</li><li>You are a proficient Python programmer and have at least some exposure to R. Regardless of your favorite scientific computing environment, you can flex between the two languages.</li><li>You have experience building production services and/or models, preferably as part of a product development team.A track record of implementing data-driven products is ideal.</li><li>You have worked in a collaborative development environment and have experience with continuous integration and delivery.</li><li>You can describe and speak in an approachable way about complex analyses and concepts within a cross-functional team. You are a great “analytic translator”.</li>\n</ul>\n<strong>What you’ll own:</strong>\n<ul>\n<li>Develop robust, scalable production data science products based on prototype algorithms developed in Python or R by the data science R&amp;D team. You’ll evaluate trade-offs and do performance tuning for production traffic.</li><li>Iterate, and innovate on Machine Learning algorithms in collaboration with Machine Learning Engineers and Software Engineers</li><li>Collect, process and cleanse data from a wide variety of sources. Transform and convert unstructured data set into structured data for algorithm input.</li><li>Evaluate the effectiveness of user experiences, determining what data is needed and how to collect it</li>\n</ul>\n<strong>Experience you’ll need:</strong>\n<ul>\n<li>M.S. or Ph.D in Computer Science or relevant quantitative science</li><li>Minimum of 3 years in a data science engineering role</li><li>Experience working with product development teams and/or with developers</li></ul></div>\n<br>\nAdditional Information<div>Be Yourself.Pluralsight is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</div>I'm interested</div>"}