{"job title": "Business Intelligence Analyst", "company": "Google", "city state": "– Sunnyvale, CA", "rating": "4.4", "job description": "<ul>\n<li>*Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; New York, NY, USA**</li>\n</ul>\n\nAt Google, we work at lightning speed. So when things get in the way of progress, the Business Systems Integration team steps in to remove those roadblocks. The team identifies time-consuming internal processes and then builds solutions that are reliable and scalable enough to work within the size and scope of the company. You listen to and translate Googler needs into high-level technical specifications, design and develop recommended systems and consult with Google executives to ensure smooth implementation. Whether battling large system processes or leveraging our homegrown suite of Google products for Googlers themselves, you help Googlers work faster and more efficiently.\n<br><br>\nThe Corporate Business Intelligence (CorpBI) team provides a full range of BI/analytics services from data curation to reporting and deep data analysis and insights for our partner teams. Many of the teams we support manage services that impact every person at Google. CorpBI helps teams make better data-driven decisions - from planning/forecasting, to operations and strategy. We're passionate about wrangling data for better business leverage and competitive differentiation, and we're looking for an analyst who will help solve big, complex business problems with broad impact at scale.\n<br><br>\nGoogle is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.\n<br><br>\n## Responsibilities\n\n\n<ul>\n<li>Collaborate with cross-functional stakeholders to understand their business needs, formulate a roadmap of project activity that leads to measurable improvement in business performance metrics/key performance indicators (KPIs) over time.</li>\n<li>Conduct end-to-end analysis that includes data gathering and requirements specification, analysis, ongoing scaled deliverables and presentations.</li>\n<li>Architect, develop and automate BI and analytics solutions, iteratively build and prototype dashboards to provide insights at scale leveraging internal Google and BI industry standard technologies - including ETL, data modeling, and data visualization software.</li>\n<li>Make business recommendations (cost-benefit, invest-divest, forecasting, impact analysis) with effective presentations of findings at multiple levels of stakeholders through visual displays of quantitative information.</li>\n</ul>\n\n## Qualifications\n<br><br>\n<strong>Minimum qualifications:</strong>\n\n\n<ul>\n<li>Experience with data modeling and data analytics</li>\n<li>Experience with statistical analytics, data visualization, and SQL</li>\n</ul>\n\n<strong>Preferred qualifications:</strong>\n\n\n<ul>\n<li>Degree with emphasis on coursework of a quantitative nature (Statistics, Computer Science, Engineering, Mathematics) or equivalent experience</li>\n<li>5 years of experience with managing full implementation lifecycle for delivery of BI and analytics solutions using data integration (ETL) and visualization tools (such as Tableau) Working with statistical packages (R, SAS, Stata, MATLAB, etc.)</li>\n<li>Experience analyzing data related to daily functions of an IT organization (e.g. incident ticket volume, ticket response and resolution time, spend, customer satisfaction)</li>\n<li>Deep interest and aptitude in data, metrics, analysis and trends and applied knowledge of measurement, statistics and program evaluation</li>\n<li>Distinctive problem solving skills and impeccable business judgment. Good in articulating business questions, pulling from large datasets (SQL) and using statistics to arrive at an answer</li>\n<li>Capable of translating analysis results into business recommendations. Strong written and verbal communication skills</li>\n<li>* *</li>\n</ul>\n\nAt Google, we don?t just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a disability or special need that requires accommodation, please let us know.\n\n\n<ul>\n<li>*To all recruitment agencies:** Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees or any other company location. Google is not responsible for any fees related to unsolicited resumes.</li>\n</ul>"}