{"job title": "Research Scientist - Machine Learning", "company": "Intel Corporation", "city state": "– Hillsboro, Oregon", "rating": "3.8", "job description": "<strong> Job Description</strong><br><br>Plans, designs and develops tools and models for deep learning. Invent optimized architectures and layers for training convolutional and recurrent networks in low bit-width using Neon, our Python Deep Learning framework. Responsible for instrumenting our library to detect and track overflows and monitor dynamic range. Maintains substantial knowledge of leading edge deep learning models, principles and theories. This job may contribute to deep learning literature and conferences. Masters or PhD in computer science, electrical engineering or related fields (statistics, applied math, computational neuroscience).\n<br><br>\n<strong> Qualifications</strong>\n<br><br>\nYou must possess the minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum qualifications and are considered a plus factor in identifying top candidates. Experience would be obtained through your educational level research and/or relevant job/internship experiences.\n<br><br>\nMinimum Qualifications:\n<li> PhD (or graduating) in artificial intelligence, computer science, electrical engineering, or a similar degree</li> <li> 3 years of research experience in machine learning, deep learning, or reinforcement learning</li> <li> 2 years of experience in the development of algorithms in high-level languages such as Python, C++, Java, etc.</li> <li> A publication record in top-tier conferences and journals in machine learning related fields (NIPS, ICML, AAAI, CVPR, etc.)</li>\nPreferred Qualifications:\n<li> 1 year of experience in neuroscience</li> <li> 1 year of research experience in the industry (incl. internships)</li> <li> 1 year of experience with deep learning frameworks (TensorFlow, Caffe, Torch, Theano, etc.)</li> <li> Strong verbal and written communication skills</li> <strong> Inside this Business Group</strong><br><br>Intel Labs is the company's world-class, industry leading research organization, responsible for driving Intel's technology pipeline and creating new opportunities. The mission of Intel Labs is to deliver breakthrough technologies to fuel Intel's growth. This includes identifying and exploring compelling new technologies and high risk opportunities ahead of business unit investment and demonstrating first-to-market technologies and innovative new usages for computing technology. Intel Labs engages the leading thinkers in academia and industry in addition to partnering closely with Intel business units.\n<br><br>\nUS, California, Santa Clara\n<br><br>\n<strong> Posting Statement</strong>\n<br><br>\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance."}