{"job title": "Research Data Analyst", "company": "Johns Hopkins University", "city state": "– Baltimore, MD", "rating": "4.1", "job description": "Classified title: Research Data Analyst\n<br><br>\nRole/Level/Range: ACRP/4/MC\n<br><br>\nStarting Salary Range: $44,749 - $61,610\n<br><br>\nEmployee group (Full time/Part-time/Limited/Casual): Full-time\n<br><br>\nEmployee subgroup (FLSA Status): Exempt\n<br><br>\nPosition Type (New/Direct Replacement/Restructured Replacement): NEW\n<br><br>\nSchedule (hours/days): MON FRI, 8:30 AM-5:00PM\n<br><br>\nLocation: East Baltimore\n<br><br>\n<strong>General summary/purpose:</strong>\n<br><br>\nUnder the direction of the Principal Investigators and Biostatistician, the Research Data Analyst will be an integral part of the team by developing, maintaining and enhancing data operations for the Johns Hopkins Center for Health Equity. The individual will work closely with other research team members and provide statistical design, data analysis, and data management expertise.\n<br><br>\nThe Center works to promote equity in health for at-risk populations through advancing scientific knowledge, promoting sustainable changes in practice and policy, partnering with communities, raising public awareness of health inequities, and training scholars. The primary study of the Center is a pragmatic cluster randomized trial in which we will compare the effectiveness of clinic-based standard of care plus audit, feedback and education to an intervention that uses a collaborative care team, a community health worker and specialist consultation to deliver contextualized, appropriately stepped care for reducing disparities and improving patient-centered outcomes among patients with hypertension. Thirty primary care clinics, including Federally Qualified Health Centers, across Maryland and Pennsylvania will recruit an average of 63 patients each (total=1,890). The goal of the study is to improve care for hypertension and reduce racial disparities related to health outcomes. The second study is using community engagement strategies to improve the healthy eating habits of participants with kidney disease. The Research Data Analyst will perform data analysis, management and programming functions for both trials, as well as ancillary studies.\n<br><br>\n<strong>Specific duties&amp;responsibilities:</strong>\n<br><br>\nManage and maintain several databases in REDCap, including creating and modifying reports\n<br><br>\nDevelop standard analytical summary data files, produce descriptive reports, including tables and graphs\n<br><br>\nWrite statistical computer programs and review output for consistency and quality\n<br><br>\nAnalyze data and prepare tables for Data and Safety Monitoring Board meetings and interim and final reports\n<br><br>\nAssist in preparing scientific presentations and manuscripts for peer-review publications to report findings, with the opportunity, if appropriate, to present at meetings and contribute as a co-author on manuscripts\n<br><br>\nMeet with Center trainees to advise them on study design and statistical methods and perform data analysis if requested\n<br><br>\nMake changes as needed to the REDCap databases for the primary data collection instruments, including programming skip patterns and logic checks\n<br><br>\nCreate analysis datasets from electronic medical record data received from several different health systems\n<br><br>\nMaintain recruitment and participant tracking databases in REDCap\n<br><br>\nCreate and maintain data dictionaries for datasets\n<br><br>\nTrain interviewers on performing data entry into REDCap\n<br><br>\nProvide weekly/monthly updates to study team on recruitment, study follow-up and other metrics of quality control\n<br><br>\nPerform quality assurance on data\n<br><br>\nDevelop and oversee quality control procedures for data collection/analysis\n<br><br>\nFollow best practices for maintaining datain a secure environment\n<br><br>\nAssist in statistical analyses and preparing tables and figures for grants to secure funding\n<br><br>\nWork collaboratively with other analysts/study coordinators/staff\n<br><br>\nOther duties as assigned.\n<br><br>\n<strong>Minimum qualifications (mandatory):</strong>\n<br><br>\nRequires a bachelor's degree in related discipline\n<br><br>\nMinimum of 3 years of related experience. Additional education may substitute for some experience, to the extent permitted by the JHU equivalency formula.\n<br><br>\n<strong>Special knowledge, skills, and abilities:</strong>\n\n\n<ul>\n<li>Ability to stand, walk or sit for an extended period of time</li>\n<li>Finger dexterity required to manipulate objects with fingers rather than with whole hand(s) or arm(s), for example, using a keyboard</li>\n<li>Ability to see within normal parameters</li>\n<li>Ability to hear within normal range</li>\n<li>Ability to lift 15 pounds</li>\n</ul>\n\nSchool of Medicine - East Baltimore Campus"}