{"job title": "Data Analyst", "company": "Kansas Department of Administration", "city state": "– Shawnee, KS", "rating": "4.1", "job description": "<strong>Job Description:</strong>\n<br><br>\nIn compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment verification document upon hire. KDHE participates in E-Verify and will provide the Social Security Administration and, if necessary, the Department of Homeland Security, with information from each new employee's Form I-9 to confirm work authorization.\n<br><br>\nHealth Program Consultant (K0231699) in the Bureau of Family Health\n<br><br>\nCompile, clean, store and analyze specific data sets on a regular basis (monthly or quarterly depending on data set); work closely with data stewards to ensure accuracy and completeness of data; follow up with data stewards and/or internal or external partners including vendors to correct or complete data; monitor data quality; summarize and document trends within the data sets based on data analysis and develop recommendations for program improvements and/or new initiatives. Complete necessary training to understand how to manipulate and format data in a way that is readily consumed.\n<br><br>\nA complete position description can be emailed upon request.\n<br><br>\n<strong>Minimum Requirements:</strong>\n<br><br>\nOne year of experience in data analysis including evaluating, studying or reporting on statistical, economic, health, fiscal/budget, legislative or administrative data. Education in public health, statistics, epidemiology, computer science or mathematics may be substituted for experience as determined relevant by the agency.\n<br><br>\n<strong>Necessary Special Requirements:</strong>\n<br><br>\nIncumbent is required to have and maintain a valid driver's license when operating a state vehicle, a private vehicle, or a rental vehicle for the benefit of the State.\n<br><br>\n<strong>Preferred Criteria:</strong>\n\n\n<ul>\n<li>Ability to establish and maintain effective relationships</li>\n<li>Ability to record and transmit information</li>\n<li>Ability to understand and follow instructions</li>\n<li>Ability to plan, organize and perform a variety of functions</li>\n<li>Ability to communicate effectively, orally and in writing</li>\n<li>Ability to thrive in a fluid environment</li>\n<li>Ability to enter data into agency information systems</li>\n<li>Project management education/training; collaborative development; collective impact</li>\n<li>Grant writing training/education</li>\n<li>Experience or familiarity with quality improvement processes</li>\n<li>Experience with gathering, reviewing and tracking contracts and fiscal information</li>\n<li>Advanced project management skills</li>\n<li>Flexibility and the ability to work autonomously as well as take direction as needed</li>\n<li>Experience with statistical packages such as SPSS, SAS, R, Python</li>\n<li>Word, Excel, PowerPoint, Access</li>\n<li>Proofreading, editing, attention to detail</li>\n</ul>\n\n<strong>Salary:</strong>\n<br><br>\n$21.13 hourly; can vary depending upon experience and qualifications.\n<br><br>\n<strong>HOW TO APPLY:</strong>\n<br><br>\nThe application process has 3 STEPS.\n<br><br>\nSTEP 1: Register by completing the online Personal Data Form (https://admin.ks.gov/services/state-employment-center/sec-home/state-employment/register-personal-data)\n<br><br>\n(Skip this step if you already have an Applicant ID number.)\n<br><br>\nSTEP 2: Complete the State of Kansas Application Form (https://admin.ks.gov/services/state-employment-center/sec-home/state-employment/apply) and submit to the Kansas Department of Health and Environment\n<br><br>\nSTEP 3: Email these additional documents to recruiter@ks.gov Include the job requisition number and your last name in the subject line.\n\n\n<ul>\n<li>Resume</li>\n<li>Cover Letter</li>\n<li>Copies of Official transcripts if a degree is required or preferred</li>\n<li>Copy of Professional License or Certification if required or preferred</li>\n<li>Kansas Tax Clearance Certificate</li>\n</ul>\n\nKANSAS TAX CLEARANCE CERTIFICATE REQUIRED: Each applicant (even non-residents) applying for a State of Kansas job vacancy must obtain a valid Kansas Certificate of Tax Clearance by accessing the Kansas Department of Revenue's website at http://www.ksrevenue.org/taxclearance.html A Tax Clearance is a comprehensive tax account review to determine and ensure that an individual's account is compliant with all primary Kansas Tax Laws. A Tax Clearance expires every 90 days. All applicants, including current state employees, are responsible for submitting a valid certificate with all other application materials to the hiring agency. This is in accordance with Executive Order 2004-03. If you need assistance with the tax clearance, please contact 785-296-3199.\n<br><br>\n<strong>Recruiter Contact:</strong>\n<br><br>\nKDHE Office of Personnel Services\n<br><br>\nATTN: Recruiter\n<br><br>\n1000 SW Jackson, Suite 580\n<br><br>\nTopeka, KS 66612\n<br><br>\nPhone: 785-296-4486\n<br><br>\nFax: 785-559-4271\n<br><br>\nEmail: recruiter@ks.gov\n<br><br>\n<strong>How You Will Be Evaluated:</strong>\n<br><br>\nYour application will be considered incomplete and you may be found ineligible if you fail to submit all required documentation. Your application will be reviewed to ensure you meet the minimum and any necessary special requirements. Next, your application will be evaluated and rated based on preferred selection criteria and competencies for the position.\n<br><br>\n<strong>What To Expect Next:</strong>\n<br><br>\nAfter your application is evaluated and ranked, you may be referred to the hiring manager for further consideration and possible interview. You will be notified of the outcome after the selection process is complete. You may call or email the recruiter contact listed to inquire about your application.\n<br><br>\n<strong>Veterans Preference' Eligible (VPE):</strong>\n<br><br>\nFormer military personnel or their spouse that have been verified as a \"veteran\" under K.S.A. 73-201 will receive an interview if they meet the competency factors of the position, including any preferred selection criteria established in accordance with K.A.R. 1-6-3. The veterans' preference laws do not guarantee the veteran a job. Positions are filled with the best qualified candidate as determined by the hiring manager. See jobs.ks.gov for additional Veterans' Preference Information.\n<br><br>\nIndividuals with disabilities are encouraged to contact the agency recruiter if reasonable accommodations are needed for any part of the application or hiring process.\n<br><br>\nThe Kansas Department of Health and Environment is an Equal Opportunity Employer. KDHE encourages applications from all persons. Federal and state legislation prohibits discrimination on the basis of race, religion, color, national origin, ancestry, sex, age, disability, and veteran status. Persons with disabilities are encouraged to contact Human Resources at 785-296-1539 if accommodations are needed in completing an application, interviewing and any other aspect of the employment process. EOE\n<br><br>\nThe mission of KDHE is to protect and improve the health and environment of all Kansans.\n<br><br>\nFind out more about us at our website"}