{"job title": "Assay Biologist and Screening Scientist (BS or MS)", "company": "Novartis Pharmaceuticals", "city state": "– Cambridge, MA", "rating": "NA", "job description": "<strong>Job Description</strong>\n<br><br>\nThe Chemical Biology and Therapeutic platform is searching for a scientist to develop and run biochemical and cell-based high-throughput screening (HTS) assays. We are looking for a flexible and motivated team player with practical experience in developing and executing assays for drug discovery. The successful candidate will work with strong expert project team members to develop and optimize assays to support drug discovery efforts across multiple therapeutic areas. The candidate should have a strong background in biochemistry and/or cell biology.\n<br><br>\nIn this position, you will collaborate closely with project team members to assist in the development and implementation of assays on automated systems. You will have access to state-of-the-art automation and equipment covering all assay read-out technologies. To this end, you will develop, optimize, adapt and evaluate assay protocols suitable for automated screening. As well, you will independently run the necessary counterscreens and secondary assays required to validate and characterize compounds as well as medium-throughput screens of focused libraries on stand-alone workstations. In addition to working with automation team members, your duties also involve close collaboration with reagent production laboratories, e.g. through enzymatic testing of protein preparations or alignment of cell supply from automated cell culture systems.\n<br><br>\nAs well, you will evaluate, implement and apply novel readout technologies as well as state-of-the-art technologies which can be constructed to assay biology in new ways. You will document the large amount of data generated in your studies both in databases and in writing, and present your results in project team meetings.\n<br><br>\nEmployment Type\n<br><br>\nRegular"}