{"job title": "Internship - Center for Clinical Data Science", "company": "Partners HealthCare(PHS)", "city state": "– Boston, Massachusetts", "rating": "NA", "job description": "<strong>General Overview:</strong>\n<br>\nMachine learning is on the verge of transforming healthcare, and the MGH &amp; BWH Center for Clinical Data Science (CCDS) is at the forefront of this revolution. We are a fast-paced start-up embedded in two of the nation's leading research hospitals, backed by industry partners like Nvidia and GE Healthcare. We have access to millions of medical records, an on-prem GPU cluster, and a top-tier team from industry and academia. We work closely with clinicians to solve critical problems in patient care - our goal is to make real products that make a real difference in the hospital.\n<br>\n<strong>General Summary:</strong>\n<br>\nThe focus of our ML science team and our intern is to build models to solve critical needs in healthcare.\n\n\n<ul>\n<li>Classification to expedite treatment decisions, prioritize worklists, and improve accuracy</li>\n<li>Segmentation and localization to improve the accuracy and speed of abnormality detection</li>\n<li>Volumetric assessment of pathologies, reducing clinician time per study thereby freeing them to focus on higher-value tasks</li>\n<li>Time series analysis to predict outcomes based on streaming patient data</li>\n<li>Technologies Used: Go, C++, Python, Nginx, PostgreSQL, Redis, gRPC,</li>\n</ul>\n\nReact.js, Bootstrap, Amazon AWS: S3, RDS, ElastiCache, EC2\n<br><br>\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Experienced in designing, build, testing, and deploying applications</li>\n<li>knowledge of Python</li>\n</ul>\n\n<strong>Preferred Major or Course of Study:</strong>\n\n\n<ul>\n<li>Mathematics and Science</li>\n</ul>\n\n<strong>EEO Statement</strong>\n<br>\nPartners HealthCare is an Equal Opportunity Employer &amp; by embracing diverse skills, perspectives and ideas, we choose to lead. All qualified applicants will receive consideration for employment without regard to race, color, religious creed, national origin, sex, age, gender identity, disability, sexual orientation, military service, genetic information, and/or other status protected under law.\n<br>\nPartner's Healthcare is acting as an Employment Agency in relation to this vacancy."}