{"job title": "Radar Data Analyst", "company": "QuantiTech", "city state": "– Huntsville, AL", "rating": "4.7", "job description": "QuantiTech, Inc. is a Woman-Owned Small Business (WOSB) founded in Huntsville, Alabama in 1991 by its CEO, Sheila Brown. QuantiTech has a twenty-six year track record of providing superior technical and management support to both Government and Commercial Customers in Systems Engineering and Integration; Program and Project Management; Test and Evaluation; Logistics Engineering; Safety; Business Management; and Information Technology.\n<br><br>\nQuantiTech is currently seeking an Radar Data Analyst/Electrical Engineer to support our customer at Redstone Arsenal, AL.\n<br><br>\nQuantiTech Inc. has a potential opening for a team member to support a US Army customer on Redstone Arsenal. The position is for an Engineer to support analysis of radar data from data obtained from tests at vendor sites, Yuma Test Center, or White Sands Test Center supporting the Range Radar Replacement Program within the C-RAM Program Directorate. The candidate will support data analysis of test data using Python or other software products and depict results graphically.\n<br><br>\nDuties will include, but are not limited to:\n\n\n<ul>\n<li>Support analysis of radar systems used for detection and tracking targets of interest.</li>\n<li>Support testing of radar systems at various test ranges to include Yuma Proving Ground, White Sands Missile Range, Eglin Air Force Base, etc.</li>\n<li>Provide technical assistance in the collection, analysis, and management of both contractor facility and outdoor range test data.</li>\n<li>Directly participate in radar surveillance testing efforts by observing the real-time video displays, recorded pertinent real-time and post processed information, and utilizing appropriate data reductions to provide complete analysis of key radar parameters.</li>\n<li>Provide support for the development of evaluation tools used in the analysis of radar surveillance data, including the quick-look tools, for the determination of general search/track mission success and more detailed analysis of radar subsystem performance and phenomenology in testing with targets in complex environments.</li>\n<li>Support the development of test reports and the formulation of test results to depict radar system performance.</li>\n</ul>\n\n<strong>Minimum Requirements:</strong>\n\n\n<ul>\n<li>Must currently possess an active and transferrable DoD security clearance with current investigation.</li>\n<li>Bachelor's Degree in Electrical Engineering or related technical area.</li>\n<li>Experience in radar analysis, and exposure to, complex instrumentation or tactical radar systems.</li>\n<li>Ability to develop analysis tools using Python, MATLAB, and other software tools.</li>\n<li>Experience displaying results of radar system performance graphically.</li>\n<li>Ability to schedule and manage resources.</li>\n<li>Experience working in Defense or Government projects.</li>\n<li>Good oral and written communication skills.</li>\n<li>Must be willing and able to travel up to 25% - 35%.</li>\n<li>Ability to work independently and as part of a team.</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>General radar systems related experience desired.</li>\n<li>Experience with Python and MATLAB in performing data analysis.</li>\n</ul>\n\nApplicants for positions which require a US government security clearance must meet eligibility requirements to include US citizenship.\n<br><br>\nQuantiTech is an Equal Employment Opportunity employer as defined by the EEOC. If you are a qualified individual with a disability or are a disabled veteran, and are unable or limited in your ability to use or access our Careers site as a result of your disability, you have the right to receive assistance in completing the application process. Please email your resume to careers@quantitech.com or contact us directly about your interest in employment with QuantiTech.\n<br><br>\nQuantiTech, Inc. is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion or creed, national origin or ancestry, gender, age, sexual orientation, gender orientation, physical or mental disability, veteran status, genetic information, citizenship, or any other federal, state, or locally protected class."}