{"job title": "Data Engineer V", "company": "SCCA Proton Therapy Center, a ProCure Center", "city state": "– Seattle, Washington", "rating": "NA", "job description": "Job ID 11891\n<br>\nType Regular Full-Time\n<br>\nCompany Fred Hutchinson Cancer Research Center\n<br>\nLocation US-WA-Seattle\n<br>\nCategory Information Technology\n<br><br>\nOverview\n<br><br>\nCures Start Here. At Fred Hutchinson Cancer Research Center, home to three Nobel laureates, interdisciplinary teams of world-renowned scientists seek new and innovative ways to prevent, diagnose and treat cancer, HIV/AIDS and other life-threatening diseases. Fred Hutch's pioneering work in bone marrow transplantation led to the development of immunotherapy, which harnesses the power of the immune system to treat cancer. An independent, nonprofit research institute based in Seattle, Fred Hutch houses the nation's first cancer prevention research program, as well as the clinical coordinating center of the Women's Health Initiative and the international headquarters of the HIV Vaccine Trials Network. Careers Start Here.\n<br><br>\nThe Hutch Data Commonwealth (HDC) is a new organization within the Fred Hutchinson Cancer Research Center with a mission to develop new capabilities and services to facilitate the center's interaction with large and complex data sets. As a member of the Data Engineering team this position will play an important role in supporting the collection, management, and analysis of clinical, genomic, and other research related data supporting teams across Fred Hutch and other organizations. In this position you will work independently with multiple product teams and stakeholders defining and delivering innovative data solutions with traditional relational database technologies as well as applying modern data architecture building streaming data pipelines, large-scale distributed processing, and cloud data services. In addition to the technical implementations, this role will work closely with scientists, consortium partners, and other technical staff to apply modern data architecture to design, develop, and implement innovative data solutions.\n<br><br>\nWorking independently, the Senior Data Architect (Data Engineer V) will be responsible for identifying and reviewing processes and services that impact the flow and analysis of data at Fred Hutch. This role will be deeply involved in the research, design, development of data solutions as well as in evangelizing and socializing creative solutions to resolve those problems. While these issues may be addressed by traditional data management technologies, the focus of this position is to apply modern data architecture, devops infrastructure practices, and current big data technologies to develop a shared data platform solution.\n<br><br>\nThe successful candidate will be an expert level individual contributor with the ability to execute highly complex specialized projects and make significant departures from traditional approaches if needed. The senior data architect will possess advanced skills in design, development, implementation and management of data solutions, and will be expected to clearly articulate technical information to all levels of the organization.\n<br><br>\nThe Senior Data Architect will report to the Sr. Director Engineering Operations. In addition, this role will work closely with product managers and other stakeholders across the HDC department.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Lead the research and development of data solutions that meet the data needs of the HDC, ensuring system scalability, administration, security, performance and reliability</li>\n<li>Design and deploy solutions to ingest data, manage metadata, process streaming data, improve data discoverability, and support the analysis of data in the HDC big data platform</li>\n<li>Serve as a technical mentor to staff new to modern data technologies</li>\n<li>Develop prototypes and pilot new data solutions to determine their viability for adoption</li>\n<li>Provide input on the development and enforcement of data standards, data governance, data management processes</li>\n<li>Lead efforts to improve processes and meet strategic goals for data management for the HDC</li>\n<li>Provide high level support for operational issues in the HDC big data platform. Communicate with vendors, cloud providers and Center IT systems engineers to ensure the smooth functioning, optimization and growth of the platform</li>\n<li>Prepare and present information on data solutions to all levels of the organization</li>\n<li>Independently organize and manage multiple complex projects simultaneously</li>\n<li>Prepare written technical design specifications, flow charts and data flow diagrams as needed for new and existing data solutions</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\n<strong>Minimum Qualifications</strong>\n\n\n<ul>\n<li>5 years of hands-on experience with big data technologies, including technical work with some combination of HDFS, Hive, Spark, HBase, Nifi, ambari, Kafka, Sqoop, etc.</li>\n<li>Proven track record researching, implementing and socializing big data solutions</li>\n<li>In-depth knowledge and expertise of data technologies, along with solid programming, design and system analysis skills</li>\n<li>Minimum of 10 years of experience with various data platforms and data structures</li>\n<li>BS in Computer Science, Engineering or equivalent experience</li>\n<li>Expertise in one or more programming language such as Java, Scala, R or python</li>\n<li>Sharp analytical abilities, proven design skills and problem solving</li>\n<li>Proven record of rapid, positive contribution to the work of the team</li>\n</ul>\n\nPreferred Qualifications\n\n\n<ul>\n<li>Graduate degree in computer science, engineering or related field</li>\n<li>Demonstrated leadership in driving operational excellence and best practices</li>\n<li>Demonstrated presentation skills</li>\n<li>Expertise and knowledge of gathering and documenting analytic/reporting requirements</li>\n<li>Previous experience in a research/educational setting and/or support of clinical trials</li>\n</ul>\n\nOur Commitment to Diversity\n<br><br>\nWe are committed to cultivating a workplace in which diverse perspectives and experiences are welcomed and respected. We are proud to be an Equal Opportunity and VEVRAA Employer. We do not discriminate on the basis of race, color, religion, creed, ancestry, national origin, sex, age, disability, marital or veteran status, sexual orientation, gender identity, political ideology, or membership in any other legally protected class. We are an Affirmative Action employer. We encourage individuals with diverse backgrounds to apply and desire priority referrals of protected veterans. If due to a disability you need assistance/and or a reasonable accommodation during the application or recruiting process, please send a request to our Employee Services Center at ********************* or by calling ************.\n<br><br>\nOptions"}