{"job title": "Reporting Data Coordinator", "company": "SCCA Proton Therapy Center, a ProCure Center", "city state": "– Seattle, Washington", "rating": "NA", "job description": "Job ID 11844\n<br>\nType Regular Full-Time\n<br>\nCompany Fred Hutchinson Cancer Research Center\n<br>\nLocation US-WA-Seattle\n<br>\nCategory Clinical Research Support Services\n<br><br>\nOverview\n<br><br>\nCures Start Here. At Fred Hutchinson Cancer Research Center, home to three Nobel laureates, interdisciplinary teams of world-renowned scientists seek new and innovative ways to prevent, diagnose and treat cancer, HIV/AIDS and other life-threatening diseases. Fred Hutch's pioneering work in bone marrow transplantation led to the development of immunotherapy, which harnesses the power of the immune system to treat cancer. An independent, nonprofit research institute based in Seattle, Fred Hutch houses the nation's first cancer prevention research program, as well as the clinical coordinating center of the Women's Health Initiative and the international headquarters of the HIV Vaccine Trials Network. Careers Start Here.\n<br><br>\nThe Reporting Data Coordinator is responsible for reporting clinical trial information and data to government agencies and programs including the NCI, the NCI Clinical Trials Reporting Program (CTRP), and ******************. The position is part of the central clinical trials office, Clinical Research Support (CRS), for the Fred Hutch, University of Washington, and Seattle Children's Cancer Consortium. This position works across the Consortium institutions to ensure complete and accurate reporting on behalf of faculty and the institution that meets all applicable NIH, NCI, and ICMJE requirements. The position reports to the Protocol Review and Monitoring System Manager.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Screen large protocol datasets to identify submissions and verify compliance with CTRP requirements</li>\n<li>Submit protocol amendments and trial record updates to NCI within specified timeline</li>\n<li>Complete and maintain industrial trails registration with NCI</li>\n<li>Review and abstract protocol information and data from electronic systems including a Clinical Trial Management System (CTMS), OnCore</li>\n<li>Communicate with faculty and study staff to validate protocol information and data</li>\n<li>Assist with maintaining applicable SOPs</li>\n<li>Process Quarterly accrual reporting to NCI</li>\n<li>Register New Trials to CTRP and ******************</li>\n<li>Perform Data QC and rectify and issues identified</li>\n<li>Perform Data entry into OnCore for committees overseen by CRS</li>\n<li>Stay current with CTRP, NCI and ****************** reporting requirements</li>\n<li>Assist with Minutes during Committee Meetings</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\nExperience and abilities\n\n\n<ul>\n<li>3+ year's administrative experience in a research environment</li>\n<li>Communicating with all levels of a large organization</li>\n<li>Detail oriented and process oriented</li>\n<li>Experience working with large datasets preferred</li>\n<li>Working in a team environment</li>\n<li>Previous experience working in a CTMS such as OnCore</li>\n</ul>\n\nKnowledge and Skills\n\n\n<ul>\n<li>Bachelor's degree preferred</li>\n<li>Strong computer and word processing skills</li>\n<li>Excellent written and verbal communications</li>\n<li>Proficiency in Microsoft Office</li>\n</ul>\n\nOur Commitment to Diversity\n<br><br>\nWe are committed to cultivating a workplace in which diverse perspectives and experiences are welcomed and respected. We are proud to be an Equal Opportunity and VEVRAA Employer. We do not discriminate on the basis of race, color, religion, creed, ancestry, national origin, sex, age, disability, marital or veteran status, sexual orientation, gender identity, political ideology, or membership in any other legally protected class. We are an Affirmative Action employer. We encourage individuals with diverse backgrounds to apply and desire priority referrals of protected veterans. If due to a disability you need assistance/and or a reasonable accommodation during the application or recruiting process, please send a request to our Employee Services Center at ********************* or by calling ************.\n<br><br>\nOptions"}