{"job title": "Data Analyst", "company": "The Hartford", "city state": "– Wayne, PA", "rating": "3.7", "job description": "Overview of the role: The primary duties of the Data Analyst is to support the\n<br><br>\nInvestment Advisory Group (IAG) and assist with reporting functions that will aid in Hartford Funds oversight, due diligence and institutional sales support efforts. The Investment Analyst must achieve and maintain an expert knowledge of the Hartford Funds product line and the Mutual Fund Industry.\n<br><br>\nThe successful candidate will possess a strong analytical background with an emphasis on enhancing the data analytics function within the team. The role will focus on centralizing all consumable data required by the team, which will contribute to maintaining a high level of data consistency and accuracy.\n<br><br>\n<strong>Responsibilities of the role:</strong>\n\n\n<ul>\n<li>Assist IAG teams with oversight, due diligence and research of internal and external mutual funds and investment products</li>\n<li>Maintain and enhance existing reporting functions by leveraging the in-house Data Warehouse</li>\n<li>Serve as the IAG data steward for the Data Warehouse</li>\n<li>Serve as the main point of contact for standardizing and automating reporting across IAG</li>\n<li>Serve as a the go-to resource within IAG for data related questions</li>\n<li>Become a champion for analytical enhancements and process improvements</li>\n<li>Handle data requests from within and outside of IAG including support of sales, marketing, and senior leadership</li>\n<li>Work with IT to ensure a high level of quality for internal and external data</li>\n<li>Work with IT to manage data processes among software vendors, internal data warehouse, and data providers</li>\n<li>Oversee the maintenance and ongoing development of the Investment Research Library (SharePoint)</li>\n<li>Become an expert user of FactSet, Morningstar, and Bloomberg analytics databases</li>\n<li>Bachelor's Degree in Finance, Business Analytics, Statistics, Mathematics, or Computer Science required</li>\n<li>Prior experience within the Financial Services industry preferred</li>\n<li>Flexible and able to accept, create and manage change</li>\n<li>Ability to work well independently and within a team</li>\n<li>Passion for investment research</li>\n<li>An eagerness to identify and implement process improvement opportunities</li>\n<li>Interest in creative resolutions to complex assignments</li>\n<li>Positive, flexible attitude</li>\n<li>Excellent communication skills</li>\n<li>Strong organizational and prioritization skills</li>\n<li>Responsible, conscientious and self-motivated</li>\n<li>Strong Microsoft Office skills. Visual Basic (VBA) experience a plus.</li>\n<li>Proficiency in at least two of the following languages; R, SQL, VBA, Python, SAS a plus</li>\n<li>Experience using Tableau is a desired</li>\n</ul>\n\n<strong>WHY JOIN HARTFORD FUNDS?</strong>\n<br><br>\nFounded in 1996 and headquartered in Wayne, PA, Hartford Funds is a leading provider of mutual funds, strategic beta ETFs and 529 college savings plans. The company offers a broad range of strategies designed to provide solutions for a variety of investment needs. Excluding affiliated funds of funds, as of March 31, 2018, Hartford Funds Management Company, LLC and its wholly owned subsidiary, Lattice Strategies LLC, had approximately $115.4 billion in discretionary and non-discretionary assets under management. Hartford Funds are primarily sub-advised by Wellington Management or Schroder Investment Management, two leading investment advisors.\n<br><br>\nAt Hartford Funds, we believe in human-centric investinga unique approach that utilizes deep research and insights to understand the rational and emotional ways investors think about money, their investments and their financial advisors, and then create solutions and advisor tools designed to serve those investors and their mindsets.\n<br><br>\nHartford Funds embraces a true entrepreneurial spirit where all employees are encouraged to 'act like an owner' of the firm, and live Hartford Funds' human-centric investing approach. Employees work in a fast-paced, dynamic environment, that is focused on strengthening financial advisor-client relationships by helping investors better realize their true life goals.\n<br><br>\n<strong>WHAT IS THE COMPENSATION OPPORTUNITY?</strong>\n<br><br>\nAt Hartford Funds, our compensation philosophy is simple: we pay competitive base salaries and reward performance. In addition, you will be eligible to participate in our comprehensive benefits program including Medical, Dental, Life and Disability Insurance, a 401K Plan, and more.\n<br><br>\nThis position may be subject to The Hartford Funds political contributions policy.\n<br><br>\nHartford Funds is an Equal Employment Opportunity and Affirmative Action Employer.\n<br><br>\nEqual Opportunity Employer/Females/Minorities/Veterans/Disability/Sexual Orientation/Gender Identity or Expression\n<br><br>\nHartford Funds maintains a drug-free workplace.\n<br><br>\nCommitted to Building Inclusion and Leveraging Diversity\n<br><br>\n<strong>NO AGENCIES PLEASE</strong>"}