{"job title": "Environmental Scientist", "company": "AECOM", "city state": "– Buffalo, New York", "rating": "3.2", "job description": "<strong> Business Line</strong> Environment\n<br><br>\n<strong> Position Title</strong> Environmental Scientist\n<br><br>\nUnited States of America - New York\n<br><br>\nBuffalo\n<br><br>\n<strong> Job Summary</strong>\n<br><br>\nThe Environmental Division of AECOM is actively seeking a creative, motivated Environmental Scientist for employment in the Buffalo, New York office. The appropriately qualified applicant will be considered for a mid-level position in the environmental permitting field.\n<br><br>\nThe responsibilities of this position include, but are not limited to:\n\n<li>Mentor junior staff</li>\n  \n<li>Perform environmental resource field assessments /studies including: wetlands, streams, invasive species, and threatened/endangered species</li>\n  \n<li>Use GPS equipment to gather field data, interpret data in the office, conduct QA/QC review of data and identify data gaps</li>\n  \n<li>Coordinate preparation of GIS or CAD figures from the data acquisition phase</li>\n  \n<li>Prepare environmental reports and permit related documents for submission to clients and regulators</li>\n  \n<li>Possess general knowledge of stormwater related permitting and associated field inspection work</li>\n  \n<li>Perform field sampling and other tasks at a variety of sites including hazardous waste sites</li>\n  \n<li>Research innovative environmental resource assessment technologies and evaluate their suitability to existing projects</li>\n<strong> Minimum Requirements</strong>\n\n<li>Bachelor of Science degree in Environmental Science, Biology, or Natural Resource Management</li>\n  \n<li>4+ years of experience</li>\n  \n<li>Capable of using Microsoft Office programs (word, excel, project, PowerPoint) and Adobe Acrobat</li>\n  \n<li>Must be trained in wetland and stream delineation</li>\n  \n<li>Must have excellent technical writing skills and be able to prepare environmental reports and permit applications</li>\n  \n<li>Must be proficient in Microsoft Office (Word, Excel, Project, and PowerPoint) and Adobe acrobat</li>\n  \n<li>Due to the nature of this work, U.S. citizenship is required</li>\n<strong> Preferred Qualifications</strong>\n\n<li>Preferred experience would include ecological field investigations, NYSDEC stormwater inspection training, and preparation of associated reports</li>\n  \n<li>40 Hour OSHA Hazardous Waste Operator Training also encouraged</li>\n<strong> What We Offer</strong>\n<br><br>\nAECOM is a place where you can put your innovative thinking and business skills into high gear and work alongside other highly intelligent and motivated people. It's a place where you can apply your skills to some of the world's most challenging, interesting, and meaningful projects worldwide. It's a place that values the diversity of our areas of practice and our people. It's what makes AECOM a great place to work and grow.\n<br><br>\nAECOM is an equal opportunity employer and Minorities, Females, Veterans, and Disabled persons are encouraged to apply. For further information, please click here to view the EEO Is The Law poster.\n<br><br>\nNOTICE TO THIRD PARTY AGENCIES:\n<br><br>\nPlease note that AECOM does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed Recruitment Fee Agreement, AECOM will not consider or agree to payment of any referral compensation or recruiter fee. In the event a recruiter or agency submits a resume or candidate without a previously signed agreement, AECOM explicitly reserves the right to pursue and hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of AECOM.\n<br><br>\n<strong> Job Category</strong> Engineering - Environmental\n<br><br>\n<strong> Business Group</strong> Design and Consulting Services Group (DCS)\n<br><br>\n<strong> Country</strong> United States of America\n<br><br>\n<strong> Position Status</strong> Full-Time\n<br><br>\n<strong> Requisition/Vacancy No.</strong> 189230BR\n<br><br>\nQualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status."}