{"job title": "Senior Scientist", "company": "Bristol-Myers Squibb", "city state": "– ", "rating": "3.7", "job description": "<div>At Bristol-Myers Squibb, we’re creating innovative medicines for patients who are fighting serious diseases. We’re also nurturing our own team with inspiring work and challenging career options. No matter our role, each of us makes a contribution. And that makes all the difference.\n<br><br>\nSummary:\n<br><br>\nThe Senior Scientist position will be part of the Process Development Downstream department in Devens, MA that is responsible for late-stage process development of BMS’ growing biologics pipeline. This role is within the Biologics Development organization in Devens, MA. The candidate will lead a team to develop and characterize downstream processes. The candidate will drive platform purification process strategies, and technology development projects. The candidate will actively partner with the overall downstream team, upstream team, Manufacturing, MS&amp;T, Analytical Development, Formulation Development, and Program Management.\n<br><br>\n<strong><strong>Job Duties/Responsibilities:</strong></strong>\n<ul>\n<li>Design, execution, and data interpretation of experiments as well as providing guidance to team members.</li><li>Support process scale-up activities in the pilot plant and clinical and commercial manufacturing sites.</li><li>Certain amount of hands-on operation of equipment, and train team members on lab operations.</li><li>Prepare/review technical documents including process development reports, tech transfer documents, process characterization reports, and in-process control strategy documents, as well as CMC regulatory submissions.</li><li>Participate on cross-functional teams to progress both early and late stage drug candidates.</li>\n</ul>\n<strong>Job Qualifications:</strong>\n<ul>\n<li>Ph.D. in Chemical/Biochemical Engineering, Biochemistry or equivalent with a minimum of 5+ years industry experience.</li><li>Prior experience in downstream process development.</li><li>Managerial experience as well as ability to lead matrix teams.</li><li>Knowledge of analytical techniques.</li><li>Knowledge of statistical experimental design and data analysis.</li><li>Excellent oral and written communication skills.</li><li>Ability to work collaboratively in a team environment.</li></ul></div>\n<br>"}