{"job title": "Distinguished Scientist", "company": "Corden Pharma GmbH", "city state": "– Boulder, Colorado", "rating": "3.4", "job description": "CordenPharma Colorado\n<br>\nJob #1821\n<br><br>\nBoulder, Colorado (US)\n<br>\nFull-time\n<br>\nCordenPharma Colorado\n<br>\nCordenPharma Colorado is a highly sophisticated and entrepreneurial mid-sized pharmaceutical manufacturing company located in Boulder, Colorado. Our chemists and engineers are widely recognized for their history of innovation, having developed efficient manufacturing processes for some of the world's most complex pharmaceutical compounds. CordenPharma Colorado also is acclaimed for its flexible manufacturing facilities and experienced workforce that can handle a wide range of production techniques and volumes. Ultimately, in partnership with our customers, CordenPharma Colorado is focused on its health care mission, proudly producing medicines that help patients around the globe survive and enjoy more comfortable lives.SUMMARY\n<br>\nResponsible for providing strong technical leadership and documentation support for development and manufacturing processes. Responsible for the planning and execution of multi-step syntheses from laboratory to full commercialization. Emphasis is on the creative application of a full range of literature and theoretical concepts from a diverse range of chemistry to the design and implementation of cost-effective processes for the manufacture of Corden pharmaceuticals. Will work within a search, analysis, synthesis, and experimentation on substances for such purposes as product and process development by performing the following duties.\n<br>\nESSENTIAL DUTIES AND RESPONSIBILITIES include the following. Other duties may be assigned.\n\n<li></li><li>Responsible for supplying management with specific project data to facilitate the budgeting process for the development, transfer, or implementation of technology.</li>\n<li>Develops and executes procedures, processes and methods for solutions to chemical and</li>\n\n\ntechnical problems on lab and plant scale.\n\n\n<ul>\n<li>Conducts research and development in order to improve manufacturing processes.</li>\n<li>Leads large and/or multiple teams to accomplish the development, transfer, or implementation of technology at a lab or plant scale.</li>\n<li>Designs, develops and executes innovative procedures, processes, and methods for solutions to chemical and technical problems.</li>\n<li>Confers with scientists and engineers within the whole Corden environment regarding research and prepares technical papers and reports.</li>\n<li>Submits patents, presents at scientific conferences and publishes in scientific journals.</li>\n<li>Serves as liaison with multiple disciplines and/or manufacturing or development sites.LEADERSHIP &amp; BUDGET RESPONSIBILITIES</li>\n</ul>\n\nDemonstrates positive attitude. Supports a positive, healthy and flexible work environment that encourages employees and coworkers to develop their full potential and expand their horizons. Leads team in the development, troubleshooting, transfer, and improvement of chemical and analytical processes.\n<br>\nMay directly lead one to five employees. Carries out leadership responsibilities in accordance with Corden Pharma International policies and applicable laws.\n<br>\nLiaises with external teams and represents local development on regard to these external teams.SAFETY &amp; ENVIRONMENTAL RESPONSIBILITIES\n<br>\nEvery individual is personally responsible for the safety and environmental aspects of his or her activities in the workplace. Each employee is expected to perform their job duties in a safe manner utilizing all of their knowledge, training, ability and experience.QUALIFICATIONS\n<br>\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/orability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.EDUCATION and/or EXPERIENCE\n<br>\nDoctoral degree (Ph.D.) in chemistry and at least one year of postdoctoral experience, preferably specializing in organic synthesis plus 15 years of experience; or equivalent combination of education and experience.LANGUAGE SKILLS\n<br>\nAbility to read, analyze, and interpret common scientific and analytical journals, financial reports, and legal documents. Ability to respond to common inquiries or complaints from customers, regulatory agencies, or members of the business community. Ability to write speeches and articles for publication that conform to prescribed style and format. Ability to effectively present information to top management, public groups, and/or boards of directors.MATHEMATICAL SKILLS\n<br>\nAbility to comprehend and apply principles of advanced calculus, modern algebra, and advanced statistical theory. Ability to work with concepts such as limits, rings quadratic and exponential equations, and proofs of theorems.REASONING ABILITY\n<br>\nAbility to apply principles of logical or scientific thinking to a wide range of intellectual and practical problems. Ability to deal with nonverbal symbolism (chemical formulae, scientific equations, graphs, etc.,) in its most difficult phases. Ability to deal with a variety of abstract and concrete variables.CERTIFICATES, LICENSES, REGISTRATIONS\n<br>\nDomestic and international travel required.PHYSICAL DEMANDS\n<br>\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<br>\nWhile performing the duties of this job, the employee is regularly required to talk or hear. The employee frequently is required to stand, walk, and sit. The employee is occasionally required to work with hands; reach above shoulder height; climb or balance; stoop, kneel, crouch, or crawl; and taste or smell. The employee must occasionally lift and/or move up to 50 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and ability to adjust focus.WORK ENVIRONMENT\n<br>\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<br>\nWhile performing the duties of this job, the employee frequently uses toxic and/or caustic chemicals and there is a risk of exposure. The employee is occasionally exposed to moving mechanical parts, outside weather conditions, and risk of electrical shock. The noise level in the work environment is usually moderate.CORE COMPETENCIES\n<br>\nThese are the specific areas of knowledge, skill and ability that are important for successful job performance. They must be job related and consistent with business necessity.\n\n\n<ul>\n<li>Demonstrates a positive attitude.</li>\n<li>Thorough working knowledge of regulatory issues in pharmaceutical manufacturing including cGMPs, PSM, OSHA, EPA requirements, and process hazard analysis; can interpret regulatory laws, and propose, defend, and implement cost-effective solutions.</li>\n<li>Computer skills, in the areas of: Microsoft Office Products - Word, Excel, PowerPoint; statistical analysis programs, Laboratory Information Management System and business systems (SAP).</li>\n<li>Develops special expertise in products and processes; acknowledged as an expert in one or more technical areas both within and outside site.</li>\n<li>Creates clear, concise goals and strategies that support individual's development and the site's mission; actively participates in proposing and setting process chemist group and manufacturing department goals.</li>\n<li>Routinely demonstrates a proactive approach to problem identification and resolution.</li>\n<li>Understands Corden's business goals and contributes technically to its strategy development.</li>\n<li>Interacts with management in developing project objectives and site strategies; advises management regarding technical opportunities and advances.</li>\n<li>Demonstrated leadership within a multi-functional team-oriented environment.</li>\n<li>Seeks out, assimilates, and applies new and advanced principles, theories, and concepts in developing original programs.</li>\n<li>Has attained the most advanced or expert knowledge within a technical discipline (Subject Matter Expert) and also has diversity in multiple technical areas.</li>\n<li>Known within corporate and professional communities as a technical expert through publications, presentations, involvement, and reputation.</li>\n<li>Establishes and maintains external scientific contacts.</li>\n<li>Has a consistent record of contributing innovative and practical solutions to technical problems; develops or directs the development of solutions to complex technical problems where little or no precedence exists.</li>\n<li>Technical skills frequently utilized for consultation outside of the main job assignment, including contribution to other sites; recognized as a major contributor to their field internally and externally.</li>\n<li>Demonstrates vision of future business direction and needs; drives results which have major economic impact on the site's profitability.</li>\n<li>Champions good ideas through the division/corporation system.SALARY</li>\n</ul>\n\nThis is a non-exempt position. Salary based upon the successful candidate's qualifications and level of experience.Application\n<br>\nPlease refer to: Job #1821 - Distinguished Scientist"}