{"job title": "Glass Surface Scientist", "company": "Corning", "city state": "– Painted Post, NY", "rating": "3.6", "job description": "Corning is one of the world's leading innovators in materials science. For more than 160 years, Corning has applied its unparalleled expertise in specialty glass, ceramics, and optical physics to develop products that have created new industries and transformed people's lives.\n<br><br>\nAt Corning, our growth is fueled by a commitment to innovation. We succeed through sustained investment in research &amp; development, a unique combination of material and process innovation, and close collaboration with customers to solve tough technology challenges. We are a four-time National Medal of Technology winner thanks to our technology leadership and R&amp;D environment, which attract and enable the best scientific minds in the world. This pipeline of talent has brought life-changing innovation to your fingertips for more than 160 years.\n<br><br>\n<strong>Scope of Position:</strong>\n<br><br>\nThis is a research position focused on glass surface modification to manipulate optical, mechanical, wetting and/or haptic properties. The responsibilities of this position include participating in and leading various R&amp;D projects, both fundamental and applied. The candidate should have expertise in printing methods for structuring glass surfaces. The position requires deep fundamental understanding of printing processes as applied to glass surfaces as well as the interaction of ink and glass surface chemistry in the context of printing. This position requires a detailed understanding of glass surface science including surface chemistry, surface topography, interaction with environmental chemistry, and extensive practical knowledge of experimental design and characterization techniques. Other expectations for this role include: contributing to new product development, building internal and external professional network, writing technical reports and contributing to intellectual property.\n<br><br>\n<strong>Day to Day Responsibilities:</strong>\n\n\n<ul>\n<li>Act as a technical expert in glass surface structuring and glass surface chemistry</li>\n<li>Provide technical leadership to solve fundamental problems including working across organizations to leverage interdisciplinary approaches when appropriate</li>\n<li>Identify and articulate problems as well as develop and execute approaches to solving them</li>\n<li>Identify capability gaps and work to address through methods development, capital acquisition and/or through external collaborations</li>\n<li>Function as a team member or team leader on R&amp;D projects</li>\n<li>Make technical presentations to project teams and management</li>\n<li>Provide technical guidance to support staff</li>\n<li>Author invention disclosures, internal reports, and refereed publications</li>\n</ul>\n\n<strong>Travel requirements:</strong>\n\n\n<ul>\n<li>3 - 4 weeks/yr for conferences, customer meetings, plant and lab visits some international</li>\n</ul>\n\n<strong>Hours of work/work schedule/flex-time:</strong>\n\n\n<ul>\n<li>40 hrs/week</li>\n</ul>\n\n<strong>Education and Experience:</strong>\n\n\n<ul>\n<li>Ph.D. in Physics, Chemistry, Material Science, or related field is required.</li>\n<li>Post-graduate industrial, academic, or national laboratory research experience in a materials-related field is desired with 10 years or more experience preferred</li>\n</ul>\n\n<strong>Required Skills:</strong>\n\n\n<ul>\n<li>Strong surface science background including an understanding of cleanliness best practices</li>\n<li>Familiarity with a variety of material characterization techniques and equipment</li>\n<li>Experience with surface structuring through printing</li>\n<li>Understanding of glass surface chemistry</li>\n<li>Project management skills</li>\n<li>Experimental design set-up, execution and data analysis</li>\n<li>Strong communication, technical writing and oral presentational skills</li>\n</ul>\n\n<strong>Desired Skills:</strong>\n\n\n<ul>\n<li>Bulk glass chemistry and physical property understanding</li>\n<li>Experience with applying statistical methods</li>\n<li>Analytical chemistry knowledge and experience with a variety of materials characterization techniques and equipment; ability to develop and refine new characterization techniques</li>\n<li>Customer-facing skills</li>\n</ul>\n\n<strong>Soft Skills:</strong>\n\n\n<ul>\n<li>Works effectively across multiple disciplines in team-oriented environments</li>\n<li>Strong one-on-one communication skills</li>\n<li>Detail oriented</li>\n<li>Good time management</li>\n</ul>\n\nWe prohibit discrimination on the basis of race, color, gender, age, religion, national origin, sexual orientation, gender identity or expression, disability, or veteran status or any other legally protected status.\n<br><br>\nNearest Major Market: Corning<br><br>SDL2017"}