{"job title": "Bioinformatics Scientist 2", "company": "Illumina", "city state": "– San Diego, CA", "rating": "4.2", "job description": "Bioinformatics Scientist\n<br><br>\nIllumina develops tools for the discovery of genetic variation and the analysis of its biological significance. We have developed assays for applications including sequencing, whole genome genotyping, gene expression, methylation, and copy number variation. We are seeking an exceptional individual to contribute to technical comparative analysis of genomic data sets and related software, as well as the ability to develop new informatics tools&amp;workflows. Your responsibilities may include:\n\n\n<ul>\n<li>Analysis of sequencing and/or microarray based data</li>\n<li>Benchmarking of genomics related software tools</li>\n<li>Develop software tools&amp;reports</li>\n<li>Assemble&amp;deliver detailed written&amp;verbal technical analyses</li>\n</ul>\n\nWe seek demonstrated accomplishment in some or all of the following skills:\n\n\n<ul>\n<li>Next Gen sequencing technology, tool usage, and data analysis</li>\n<li>Understanding&amp;usage of biostatistics and bioinformatics algorithms</li>\n<li>Critical problem solving and data analysis</li>\n<li>Proficiency in multiple languages such as Python, Perl, R, Java, C++, and/or C#</li>\n<li>Superior written and verbal communication skills</li>\n</ul>\n\n<strong>Education</strong>\n\n\n<ul>\n<li>Masters or PhD in computer science, mathematics, statistics, bioinformatics, or equivalent</li>\n<li>Genomics experience strongly preferred</li>\n</ul>\n\nWhen you join the high-performing team at Illumina, your work takes on new meaningto an exponential degree. Our growth, our positive culture, and the impact our products are having in the world ignite a passion that drives our people forward. And together, we accomplish beyond expectations.\n<br><br>\nIllumina believes that everyone has the ability to make an impact, and we are proud to be an equal opportunity employer committed to providing employment opportunity regardless of sex, race, creed, color, gender, religion, marital status, domestic partner status, age, national origin or ancestry, physical or mental disability, medical condition, sexual orientation, pregnancy, military or veteran status, citizenship status, and genetic information. If you have a disability or special need that requires accommodation, please contact us at applications@illumina.com. To learn more, visit: https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf"}