{"job title": "Senior Scientist, Method Development -", "company": "IQVIA", "city state": "– Ithaca, NY", "rating": "3.4", "job description": "<div><div>Job Description\n<br>\n Launched in 2015, Q2 Solutions is a leading global clinical trials laboratory services organization. We help biopharmaceutical, medical device and diagnostics customers improve human health through innovation that transforms science and data into actionable medical insights. Q2 Solutions is a quality driven, responsive partner with strong global experience and deep scientific and medical expertise. The Q2 Solutions joint venture was formed by Quintiles and Quest Diagnostics, combining the best of each parent organizations clinical trials laboratory services capabilities.\n<br><br>\n<strong>Description</strong>\n<br><br>\n<strong>PURPOSE</strong>\n<br>\nWorking under minimal supervision of the Associate Director of Method Development, the Senior Scientist is responsible for developing rugged, challenging bioanalytical methods, for providing clear documentation during the method hand-off process, and for assisting in troubleshooting of methods.\n<br><br>\n<strong>RESPONSIBILITIES</strong>\n\n<ul>\n\n<li>Develop reliable extraction, chromatographic and mass spectrometric analysis procedures for highly challenging and complex methods. Document all project work according to Method Development processes and procedures.</li>\n<li>Communicate progress and status to the Associate Director of Method Development and Project Management as necessary.</li>\n<li>Present method development results at Prevalidation Committee Meeting.</li>\n<li>Independently interact with Project Management and client to provide updates on project status as necessary.</li>\n<li>Efficiently guide Wet Lab staff with clear instructions and communication.</li>\n<li>Provide Project Management clear documentation of method and work with analytical staff during the method hand-off process after a successful method development.</li>\n<li>Strengthen knowledge in chromatographic and mass spectrometric techniques.</li>\n<li>Participate in company-wide analytical issues as needed.</li>\n<li>Evaluate rigor of method development processes to ensure successful method hand-off and validation.</li>\n<li>Develop and implement standardized procedures to facilitate routine method development.</li>\n<li>Function as scientific resource, including training, assisting in troubleshooting, and participating in scientific initiatives.</li>\n<li>May prepare biological samples (plasma, serum, urine, tissue, etc) for LC-MS/MS analysis by solid-phase extraction, liquid-liquid extraction, protein precipitation, etc.</li>\n<li>Utilize laboratory equipment including micropipettes, automated extraction instrumentation, centrifuges, glassware, notebooks, etc.</li>\n<li>May prepare stock and working solutions.</li>\n<li>May weigh reference compounds if respirator-certified.</li>\n<li>Develop awareness of new technologies and participate in evaluation processes.</li>\n<li>Assist in maintaining adequate supplies.</li>\n<li>Maintain housekeeping standards for work area.</li></ul></div>\n</div>\n\n<br>"}