{"job title": "Study Data Manager I", "company": "Kelly Services", "city state": "– South San Francisco, CA", "rating": "3.5", "job description": "Kelly Scientific Resources is a specialty service of Kelly Services®. As the world's largest provider of HR solutions to the scientific community, Kelly Scientific Resources is focused exclusively on placing skilled scientific professionals in contract, contract-to-hire, and full-time science jobs across a full spectrum of related industries and disciplines. Our scientists contribute to the research and development of therapeutics that change the lives of those affected with disease. We have an exciting contract opportunity in the South San Francisco, CA Area for Study Data Manager\n<br><br>\n<strong>Study Data Manager I</strong>\n<br><br>\n<strong>JOB DESCRIPTION:</strong>\n<br><br>\nActs as a core member of Study Management Teams and serves as the study data management contact at the study and/or program level, providing expert guidance to program teams.\n<br><br>\nLeads the CDM study team and maintains oversight of all study start-up, study conduct and study close-out data management issues, activities and deliverables for one or more studies.\n<br><br>\nInteracts regularly with Clinical Data Management groups to ensure that project objectives are understood and met.\n<br><br>\nPerforms the following: provides early strategic input into protocol design focused on data management issues; leads the development of eCRFs and database development and testing specifications by interacting with other functional area representatives; responsible for the oversight of all data review and cleaning activities involving close interaction with project clinical research professionals; responsible for the implementation of standards within Study Data Management across one or more CDM study teams; develops and executes ad hoc database queries utilizing data review and query tools; manages projects resourced externally via contract research organizations or corporate partners. Skills: Knowledge of core clinical data management applications Clinical data management systems, electronic data capture, query tools, web browser, MS Office suite\n<br><br>\n<strong>Requirements:</strong>\n<br><br>\nClinical data management system experience: EDC Medidata Rave preferred\n<br><br>\nAbility to apply advanced principles, theories and concepts for CDM as a whole.\n<br><br>\nUnderstanding of the conceptual basis for data management conventions, standards and processes. Good understanding of the role of data management, biostatistics and statistical programming in the drug development process.\n<br><br>\nAbility to develop solutions to complex problems.\n<br><br>\nAbility to multi-task and effectively set own priorities.\n<br><br>\nStrong organizational skills.\n<br><br>\nStrong communication and interpersonal skills.\n<br><br>\nEducation: B.A./B.S. or equivalent with a minimum of 5 years experience in Clinical Data Management<br>\n\n<div>Why Kelly®?</div>\n<br><br>\nWith Kelly, youll have access to some of the worlds highest-regarded scientific organizations\n<br><br>\nproviding you with opportunities to work on todays most challenging, research-intensive, and relevant \n<br><br>\nprojects. Our connections can lead you to innovative scientific pursuits youll be proud to help \n<br><br>\nadvance. We work with 95 of the Fortune 100 companies, and found opportunities for more than 9,000 \n<br><br>\nscientific professionals last year.<br><br>You pursued a career in science to fuel your quest for knowledge and your desire to make the world \n<br><br>\na better place. Let Kelly fuel your careerconnect with us today.<br>\n\n<div>About\n<br>\nKelly Services®</div>\n<br><br>\nAs a workforce advocate for over 70 years, we are proud to directly employ nearly 500,000 people around the world and have a role in connecting thousands more with work through our global network of talent suppliers and partners. Revenue in 2017 was $5.4 billion. Visit <u>kellyservices.com</u> and connect \n<br><br>\nwith us on <u>Facebook</u>, <u>LinkedIn</u> and <u>Twitter</u>.<br><br>Kelly Services is an equal opportunity employer including, but not limited to, Minorities, Females, \n<br><br>\nIndividuals with Disabilities, Protected Veterans, Sexual Orientation, Gender Identity and is \n<br><br>\ncommitted to employing a diverse workforce. <u>Equal Employment Opportunity \n<br><br>\nis The Law.</u>"}