{"job title": "Data Engineer", "company": "Marsh&amp;McLennan Companies, Inc.", "city state": "– Edina, MN", "rating": "3.4", "job description": "This colleague will craft and enhance agile data models used by data scientists and business analytics colleagues across Global Strategic Advisory, and will build data products to provide analysts and data scientists with data they need to deliver business intelligence and insights. This colleague will work with a wide variety of stakeholders from reinsurance broking, catastrophe modeling, actuarial, and IT departments. The Data Engineer will meet the people who are asking for information, learn the details of how they'll use it, and make it accessible in a thoughtful and effective way. This role functions as a core member of an agile team supporting strategic initiatives relying on data to solve complex problems.\n<br><br>\nResponsibilities may include, but are not limited to:\n\n\n<ul>\n<li>Ensure that data ingestion pipelines are scalable, repeatable, and secure, and can serve multiple users across the enterprise.</li>\n<li>Facilitate acquiring data from a variety of different sources, getting it in the right formats, assuring that it adheres to data quality standards, and assuring that users can access data quickly.</li>\n<li>Optimize data querying, logically explaining how the database(s) work to both IT/technical and non-technical stakeholders, and collaborating with our business teams and data architect is required.</li>\n<li>Incorporate data ingestion and provisioning with data integration and API services</li>\n<li>Understand and apply emerging technologies to provision data to others for analysis, reporting, and insights, solving complex business problems leveraging data and developing innovative data solutions.</li>\n<li>Understanding of and experience with architecture and design of highly available / scalable distributed systems.</li>\n<li>Work in a collaborative environment with multiple disciplines</li>\n<li>Conduct impact analysis and identify potential consequences of a change in data model, data access, data provisioning</li>\n<li>Work with Hadoop technologies such as Hive, Spark.</li>\n</ul>\n\nExperience: Our ideal candidate has experience working on a major relational database management system, such as SQL, PostgreSQL, Oracle, or MySQL. Excellent communication skills and insurance industry experience are also preferred. Experience working with large and complex data sets with multi-terabyte scale; and experience with Azure Data Lake or Microsoft Analytics Platform capabilities would be helpful.\n\n\n<ul>\n<li>Combination of education and experience generally attained through a Bachelor's degree in Computer Science, Engineering, Data Science or Data Analytics.</li>\n<li>Minimum of 3 years of experience with data management technologies, business intelligence technologies, advanced analytics technologies, design strategies, and experience with one or more advanced analytics tools</li>\n</ul>\n\nGuy Carpenter&amp;Company, LLC, a leading global risk and reinsurance specialist, has over a 90-year history of providing integrated solutions to the (re)insurance industry. With over 2,300 professionals in more than 50 offices around the world, Guy Carpenter delivers a powerful combination of broking expertise, strategic advisory services and industry-leading analytics to help our clients achieve profitable growth. As our clients' most trusted and valuable reinsurance broker and strategic advisor, we leverage our intellectual capital to anticipate and solve for a range of emerging strategic business challenges and opportunities. We embrace a culture that celebrates and promotes the many backgrounds, heritages and perspectives of our colleagues and clients. Visit www.guycarpenter.com for more information and follow us on LinkedIn and Twitter@GuyCarpenter\n<br><br>\nGuy Carpenter&amp;Company, LLC and its separately incorporated operating entities around the world are part of Marsh&amp;McLennan Companies, a publicly held company (ticker symbol: MMC).\n<br><br>\nMarsh&amp;McLennan Companies offers competitive salaries and comprehensive benefits and programs including: health and welfare, tuition assistance, 401K, employee assistance program, domestic partnership benefits, career mobility, employee network groups, volunteer opportunities, and other programs. For more information about our company, please visit us at: http://www.mmc.com/. We embrace a culture that celebrates and promotes the many backgrounds, heritages and perspectives of our colleagues and clients. For more information, please visit us at: www.mmc.com/diversity.\n<br><br>\nMarsh&amp;McLennan Companies and its Affiliates are EOE Minority/Female/Disability/Vet/Sexual Orientation/Gender Identity employers."}