{"job title": "Bioanalytical Associate Scientist", "company": "Merck USA", "city state": "– West Point, PA", "rating": "3.7", "job description": "<strong>Requisition ID:</strong> BIO005279<br><br>Merck &amp; Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified itslegacy for over a century. Mercks success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.\n<br><br>\nMerck is on a quest for cures and is committed to being the worlds premier, most research-intensive biopharmaceutical company. Today, were doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Mercks leading discovery capabilities and world-class small molecule and biologics R&amp;D expertise to create breakthrough science that radically changes the way we approach serious diseases.\n<br><br>\nVaccine Analytical Development in our research division located in West Point, PA is seeking a candidate for a laboratory analyst position. The successful candidate will be part of a group which develops and runs high-throughput, quantitative, and automated biochemical, immunological, and cell-based assays. Responsibilities include running a diverse portfolio of automated bioanalytical assays to support vaccine process development.\n<br><br>\nThe successful candidate will be responsible for various aspects of sample analysis involving the use of robotic instrumentation, and should have a working knowledge of standard immunological methods and analytical instrumentation. The candidate would also maintain automated equipment in a standardized environment. The candidate will possess excellent communication skills and ability to work in a team environment. Laboratory automation, industrial experience, statistics experience and a working knowledge of GMP/GLP would be beneficial.\n<br><br>\n<strong>Qualifications</strong><br><br>Education Minimum Requirement:\n<br><br>\nBS/BA degree in Science, Engineering, or Informatics\n<br><br>\nRequired Experience and Skills:\n<ul>\n<li>Experience (theory and application) with a variety of analytical assays, including biochemical and immunoassays.</li><li>Previous experience performing research or sample analysis in a laboratory environment (e.g., internship, co-op or thesis project).</li><li>Excellent organizational and problem solving skills.</li>\n</ul>\nPreferred Experience and Skills:\n<ul>\n<li>Exceptional planning skills and ability to prioritize and track multiple projects.</li><li>Demonstrates the ability to work independently and/or in a team environment and is results oriented.</li><li>Familiarity with data analysis using Microsoft Excel or equivalent.</li><li>Understanding of the regulatory guidelines governing the operation of GMP laboratories.</li>\n</ul>\n\n<br><br>Your role at Merck is integral to helping the world meet new breakthroughs that affect generations to come, and were counting on your skills and inventiveness to help make meaningful contributions to global medical advancement. At Merck, were inventing for life.\n<br><br>\nIf you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request to (e-mail removed).\n<br><br>\n<strong>Search Firm Representatives Please Read Carefully:</strong>\n<br><br>\nMerck &amp; Co., Inc. is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any employee at Merck via email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Merck. No fee will be paid in the event the candidate is hired by Merck as a result of the referral or through other means.\n<br><br>\nFor more information about personal rights under Equal Employment Opportunity, visit:\n<br><br>\n"}