{"job title": "Senior Scientist", "company": "Merck", "city state": "– West Point, PA", "rating": "3.7", "job description": "Merck &amp; Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck?s success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.\n<br><br>\nMerck is on a quest for cures and is committed to being the world?s premier, most research-intensive biopharmaceutical company. Today, we?re doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck?s leading discovery capabilities and world-class small molecule and biologics R&amp;D expertise to create breakthrough science that radically changes the way we approach serious diseases.\n<br><br>\nApplications are sought for a motivated and experienced Scientist to join the BioChemistry and BioAssay Labs of the GMP Laboratories group within Vaccine Bioprocess Research and Development in West Point, PA. Primary responsibilities of this position include biochemical assay (chromatography) and bioassay (cell - culture) testing in support of the release and stability of drug substance and drug product clinical supplies for vaccine and biologics clinical candidates. Specific duties include:\n<br><br>\n+ Performing assays to measure BSL1 and BSL2 products and process residuals under cGMP conditions\n<br><br>\n+ Authoring cGMP SOPs and analytical method procedures\n<br><br>\n+ Authoring and executing analytical method qualification protocols\n<br><br>\n+ Actively participating in routine lab maintenance activities\n<br><br>\n+ Authoring and performing instrument validation documents and activities, respectively\n<br><br>\n+ Managing and coordinating projects for cross disciplinary groups\n<br><br>\n+ Activities may require flexible scheduling for occasional shift work\n<br><br>\n<strong>Education Minimum Requirement:</strong>\n<br><br>\n+ A Ph.D in Molecular Biology, Biochemistry, or related discipline; a M.S. Degree with a minimum of 4 years relevant experience in biotech industry; or B.S. Degree with a minimum of 7 years relevant experience\n<br><br>\n<strong>Required Experience and Skills:</strong>\n<br><br>\n+ In - depth knowledge, understanding, and experience performing biochemical and cell - culture assays\n<br><br>\n+ Formal training and experience with analytical instrumentation (e.g. HPLC, plate reader)\n<br><br>\n+ Experience with viral vaccines and/or biologics\n<br><br>\n<strong>Preferred Experience and Skills:</strong>\n<br><br>\n+ Formal training and experience with cGMP expectations, electronic notebooks, electronic data repositories, instrument validation, and SOPs\n<br><br>\n+ Track - record of independent problem-solving and application of advanced innovative scientific approaches\n<br><br>\n+ Committed to working in a collaborative manner across functional areas\n<br><br>\n+ Fast learner with an attention to details\n<br><br>\n+ Excellent written and oral communication skills\n<br><br>\n+ Excellent organization to multi - task and manage multiple projects\n<br><br>\n+ Possess strong scientific skills including sound experimental design, data processing and interpretation skills\n<br><br>\n+ Experience with aseptic handling of cell lines\n<br><br>\n+ Experience with analytical method development and transfer to GMP labs\n<br><br>\nYour role at Merck is integral to helping the world meet new breakthroughs that affect generations to come, and we?re counting on your skills and inventiveness to help make meaningful contributions to global medical advancement. At Merck, we?re inventing for life.\n<br><br>\nIf you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request to staffingaadar@merck.com .\n<br><br>\n<strong>Search Firm Representatives Please Read Carefully:</strong>\n<br><br>\nMerck &amp; Co., Inc. is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any employee at Merck via email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Merck. No fee will be paid in the event the candidate is hired by Merck as a result of the referral or through other means.\n<br><br>\nFor more information about personal rights under Equal Employment Opportunity, visit:\n<br><br>\nEEOC Poster at http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf\n<br><br>\nEEOC GINA Supplement? at http://www1.eeoc.gov/employers/upload/eeoc_gina_supplement.pdf\n<br><br>\nMerck is an equal opportunity employer, Minority/Female/Disability/Veteran ? proudly embracing diversity in all of its manifestations.\n\n\n<ul>\n<li>*Job** _Biological Manuf-Pilot Plant_</li>\n</ul>\n\nMerck is an equal opportunity employer, Minority/Female/Disability/Veteran ? proudly embracing diversity in all of its manifestations.\n\n\n<ul>\n<li>*Title:** _Senior Scientist_</li>\n<li>*Primary Location:** NA-US-PA-West Point</li>\n<li>*Requisition ID:** _BIO005179_</li>\n</ul>"}