{"job title": "Scientist, Analytical Sciences", "company": "Pfenex Inc.", "city state": "– San Diego, CA", "rating": "3.3", "job description": "Pfenex is a clinical-stage biotechnology company engaged in the development of biosimiliar therapeutics and high value, difficult to manufacture proteins.We are committed to providing innovative solutions for global health. Our team is made up of driven, talented, motivated individuals making an immediate impact within our fast-paced dynamic organization.<br>\n<div><strong>POSITION SUMMARY</strong></div>\n<br>As a key member of the Analytical Biochemistry Group, the Scientist is responsible for executing analytical and biochemical characterization activities for biotherapeutic protein product development, including assay development, assay qualification, and product characterization. This position must effectively communicate timelines and issues to ensure successful manufacturing, product testing/release and data package for regulatory filings. Individual technical issue management and cross functional communication are key position attributes. The candidate will work in a team environment, collaborating with various departments to ensure that manufacturing processes are properly characterized to support process transfer, achieve project goals, and timelines.<br>\n<div><strong>ESSENTIAL DUTIES AND PRIMARY RESPONSIBILITIES</strong></div>\n<br><u>Technical Scope</u>\n<ul>\n<li>Partner in the development/ commercialization of recombinant proteins that requires knowledge and application of analytical technologies involving primarily HPLC separations, SDS-PAGE, Western blots, UV-Vis spectrophotometry, and other analytical protein characterization methods.</li><li>Responsible for developing method robustness and other analytical parameters prior to analytical method Tech Transfer to QC CMO for validation.</li><li>Facilitate and lead method transfers between Pfenex &amp; CMO and/or Pfenex partner.</li><li>Partner with a diverse team of Process Development/ Characterization Scientists in USP, DSP and Analytical Biochemistry that support the advancement of a broad portfolio of products.</li><li>Provides expertise, guidance, and feedback on protein analytical results so as to direct effective purification development and product/process control strategies</li><li>Keeps current in analytical method development including literature and technology development and regulatory driven activities</li><li>Author/Review detailed analytical reports and provides direct input/data/statistical analysis to support data package for regulatory submission(s).</li><li>Interface with contract manufacturing or research organizations (CMOs/CROs) in the execution of analytical method transfer, testing, and release and stability studies.</li><li>Assembles and delivers CMC supporting regulatory documentation required to rationalize process analytical, characterization, and release specifications</li><li>With minimal supervision, generates and delivers concise/clear technical presentations to senior management</li><li>Other duties as assigned or required</li>\n</ul><br>\n<div><strong>JOB SKILLS, ABILITIES AND QUALIFICATIONS</strong></div>\n<br>A minimum of a Bachelor's degree in Analytical Chemistry/Biochemistry/Biochemical Engineering with biosimilar and/or biologics experience required\n<ul>\n<li>BS in Biology/Analytical Chemistry/Biochemistry/Biochemical Engineering or related field</li><li>BS 5 years of relevant experience w/a minimum of 5 years of industry experience</li><li>or MS 3 years of relevant experience w/a minimum of 3 years of industry experience</li><li>or PhD 6 to 12 months of relevant industry experience</li><li>Ability to travel up to 10% (US and Internationally)</li><li>Fluent in practical application of PC's, Microsoft project, Word, Excel, Power point and experience to include data analyses, statistical analysis (JMP), method transfers and comparability studies</li><li>Experience in developing and qualifying analytical methods, primarily HPLC separations</li><li>Scientific understanding of current analytical technologies, as well as the ability to explore and develop novel approaches to further advance innovative analytical methodologies</li><li>Proven working knowledge and understanding of GxP (GLP, cGMP, GCP and ISO9000) environments and regulations required</li><li>Ability to work flexible work schedules</li><li>Analyzes reports, metrics and results as required; provides SME and strategic guidance based on findings</li><li>Excellent verbal and written communication skills, an innovative approach to problem-solving, an integrated view of business/scientific issues, and a strong work ethic</li><li>Possesses and demonstrates exceptional research and resource utilization skills as well as practical problem solving capabilities</li><li>Proven ability to work in a lean organization and creatively tackle problems using colleague networks and publicly available solutions; work independently and successfully in a matrix environment; and prioritize and manage multiple tasks simultaneously</li><li>Other duties as assigned or required</li>\n</ul>\nSupplemental Experience (Strong Plus)\n<ul>\n<li>Experience working in a biosimilars drug-development organization highly preferred</li><li>Experience with the full product lifecycle of a biopharmaceutical product (i.e. Phases 1 4) highly preferred</li>\n</ul>\nAdditional Information\n<ul>\n<li>Affirmative Action and Equal Opportunity Employer (EOE)</li><li>No agencies or phone calls please</li><li>Pfenex celebrates the diversity of life and welcomes all individuals to apply</li><li>Must be legally authorized to work in the US without sponsorship</li>\n</ul>\n\n<strong>Job Posted by ApplicantPro</strong>\n<br>"}