{"job title": "Senior Scientist, Regulatory Compliance", "company": "Pfizer", "city state": "– Groton, CT", "rating": "3.9", "job description": "<strong>ROLE SUMMARY</strong>\n<br><br>\n+ Ensure compliance in a lab animal and preclinical GLP setting. Interact with internal and external regulatory bodies including Environmental Health &amp; Safety, Occupational Health &amp; Wellness, internal audits, United States Department of Agriculture, Food &amp; Drug Administration, and AAALACi. Serve as author and subject matter expert on Standard Operating Procedures, documentation management/archiving, and quality control ranging from scientific study data to supplies\n<br><br>\n<strong>+ **ROLE RESPONSIBILITIES**</strong>\n<br><br>\n+ Create, implement and maintain all SOP's and documentation including CM document management and record retention processes including SOPs, QC review, and deviations and serve as primary CM archivist.\n<br><br>\n+ Work proactively with DSRD Study Directors and staff to understand scientific studies and achieve GLP compliance at every level, minimize deviations, and resolve documentation issues in a complex, safety study environment with rodent and non-rodent species.\n<br><br>\n+ Interact during external regulatory inspections and site visits (ex: FDA, AAALAC International, USDA) as well as internal corporate and safety audits.\n<br><br>\n+ Serve as primary contact for MQA for facility and process audits for GLP compliance and work with Regulatory Compliance Lead, Operations Managers, CM SLT, and customer lines for audit resolution and to develop, enhance and promote compliance initiatives and improvement projects.\n<br><br>\n+ Maintain rigorous understanding of safety regulations and internal safety policies and develop processes for compliance with site wide and departmental safety initiatives.\n<br><br>\n+ Serve as back up for IACUC functions such as protocol management, facility inspections, semi-annual program reviews and/or Post-Approval Monitoring program when appropriate, and contribute to IACUC initiatives by devising and reviewing local and global IACUC policies\n<br><br>\n<strong>+ **BASIC QUALIFICATIONS**</strong>\n<br><br>\n+ MS in related field required\n<br><br>\n+ CPIA required\n<br><br>\n+ In general, a colleague at this level will have a minimum 5-7 years of experience in a laboratory animal setting including 3-5 years regulatory experience.\n<br><br>\n+ Expertise in research compliance including in a GLP pharmaceutical setting required.\n<br><br>\n+ Requires a n understanding of animal facility operations and study conduct.\n\n\n<ul>\n<li>*PREFERRED QUALIFICATIONS**</li>\n</ul>\n\n+ Additional certifications including PMP highly preferred.\n<br><br>\n+ Project management experience preferred.\n<br><br>\n+ Must have functional knowledge of Microsoft Office, Outlook, calendar management and Internet Explorer. Colleague should be skilled at advanced capabilities in Excel and other programs such as MS Projects, Spotfire, and other reporting tools and databases.\n\n\n<ul>\n<li>*EEO &amp; Employment Eligibility**</li>\n</ul>\n\nPfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.\n\n\n<ul>\n<li>*Sunshine Act**</li>\n</ul>\n\nPfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider's name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.\n\n\n<ul>\n<li>*Other Job Details:**</li>\n</ul>\n\n+ **Last Date to Apply for Job:** October 15, 2018\n<br><br>\n+ Eligible for Employee Referral Bonus: yes\n<br><br>\nPfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates."}