{"job title": "Data Engineer", "company": "Summit Partners, L.P", "city state": "– Boca Raton, Florida", "rating": "4.2", "job description": "<strong> At Modernizing Medicine, we look for passionate, innovative, creative Rock Stars!</strong>\n<li> Inc. 2017 List of 5000 Fastest-growing Private Companies in America</li>\n<li> Florida Fast 100 - 2016 List of Florida's fastest-growing companies</li>\n<li> Deloittes 2017 Technology Fast 500</li> \n\n<li> Modern Healthcare's Best Places to Work in Healthcare 2015</li>\n<li> SFBJ 2017 Fastest Growing Companies</li>\nModernizing Medicine is looking for an exceptional Data Engineer with a passion for technology to help us revolutionize the world of Healthcare IT. Data engineers are at the core of a data-driven business: they build and maintain infrastructure that empowers analysts and data scientists to drive insights. Weve built a team of passionate, creative and innovative engineers and data scientists that are changing the world and having fun doing it!\n<br><br>\n<strong> You may be a great fit for Mod Meds Data Engineering opportunity, IF</strong>\n<li> You are a gifted Data Engineer; passionate about technology in healthcare IT.</li>\n<li> You are a collaborator. You thrive in environments that freely exchange ideas and view points.</li>\n<li> You are an innovator that believes in making a difference and having fun doing it.</li>\n<strong> Your Role:</strong>\n<li> Create, maintain, and support ETL pipelines.</li>\n<li> Maintain Data Warehouse infrastructure.</li>\n<li> Work with application development teams to understand data representation.</li>\n<li> Maintain documentation for the Data Warehouse and other data products.</li>\n<li> Support data usage and infrastructure needs of downstream analytics teams.</li>\n<strong> Skills &amp; Requirements:</strong>\n<li> BS in Computer Science or equivalent work experience.</li>\n<li> Experience with Talend ETL or similar.</li>\n<li> SQL and relational databases.</li>\n<li> Object-oriented programming.</li>\n<li> Strong problem solving skills, adaptable, proactive and willing to take ownership.</li>\n<li> Strong commitment to quality, architecture and documentation.</li>\n<li> Experience using AWS or other cloud services, a plus.</li>\n<li> Experience with big data tools (Hadoop, Spark, Kafka, Airflow), a plus.</li>\n<li> Experience with Python, Scala and R, a plus.</li>\n<strong> Modernizing Medicine Benefit Highlights:</strong>\n<li> Your compensation is a combination of base salary and bonus potential.</li>\n<li> Health Insurance, 401(k), Vacation, Employee Assistance Program, Flexible Spending Accounts</li>\n<li> Weekly catered breakfast and lunch, treadmill workstations, quarterly onsite massages, onsite dry cleaning, onsite car wash and many more!</li>"}