{"job title": "Associate Scientist Protein Sciences", "company": "Summit Partners, L.P", "city state": "– Hopkinton, Massachusetts", "rating": "4.2", "job description": "Description<br><br>LakePharma is a leading biologics company specializing in antibody and protein engineering, cell line development, and protein production. Our services can be fully integrated, creating a customized solution for all our customers molecular biology, cell line, and protein needs. We just raised $30m in growth equity from Summit Partners &amp; Ampersand Capital Partners for expansion purposes.\n<br><br>\nWe are rapidly growing and seeking a talented individual to join our Protein Sciences Team. As the Associate Scientist, you will report directly to the Senior Scientist Protein Sciences and will be based in our Hopkinton office.\n<br><br>\nWe are seeking a motivated biochemist with experience in classical and contemporary protein purification procedures for a variety of protein classes. The employee will be responsible for general lab support, executing projects within the laboratory, writing study/research plans, and summarizing data to clients and colleagues via technical reports. The position requires a drive to provide outstanding customer service by maintaining regular communications with clients, as well as meeting or exceeding quality and timeline expectations.\n<br><br>\nThe successful candidate will be able to work with limited guidance to plan and execute studies and be able to perform routine maintenance on instruments and equipment. You will execute purification of recombinant proteins, antibodies, and enzymes using a variety of classical and contemporary biochemical techniques.Primary duties and responsibilities include\n<li> Experience with protein purification, preferably using a peristaltic pump or AKTA.</li>\n<li> Experience with protein characterization via SDS-PAGE, Western blot is preferred.</li>\n<li> Experience with E.coli expression is desirable.</li>\n<li> Compose study/research plans in collaboration with clients and other LakePharma employees.</li>\n<li> Communicate project updates and technical reports to clients and senior level management</li>\n<li> Maintain scientific excellence in area of protein biochemistry.</li>\n<li> Ability to identify and promptly troubleshoot technical issues.</li>\n<li> Excellent multi-tasking abilities and exceptional attention to detail are required.</li>\n\n<strong>Requirements</strong>\n\n<li> AS/BS in Biochemistry, Biophysics, Biology, Chemistry, or Chemical Engineering.</li>\n<li> Ability to thrive in a fast-paced work environment.</li>\n<li> Must be able to clearly and accurately present written data to customers and be comfortable with oral presentations.</li>\n<li> Independent, collaborative, team player.</li>\nTo be successful in this role, you are organized and a clear communicator. Youre even-keeled, upbeat, responsive and thrive working in a fast-paced, innovative environment while remaining flexible, proactive, resourceful and efficient.\n<br><br>\nIf you are looking for an opportunity to provide challenge and growth and this role excites you, please Apply Today!"}