{"job title": "Scientist - Protein Sciences", "company": "Summit Partners, L.P", "city state": "– Hopkinton, Massachusetts", "rating": "4.2", "job description": "Description<br><br>LakePharma is a leading biologics company specializing in antibody and protein engineering, cell line development, and protein production. Our services can be fully integrated, creating a customized solution for all our customers molecular biology, cell line, and protein needs. We just raised $30m in growth equity from Summit Partners &amp; Ampersand Capital Partners for expansion purposes.\n<br><br>\nWe are rapidly growing and seeking a talented individual to join our Protein Sciences Team. As a Scientist, you will report directly to the Senior Scientist Protein Sciences and will be based in our Hopkinton office.\n<br><br>\nThe successful candidate will be able to work with limited guidance to plan and execute studies and be able to perform routine maintenance on instruments and equipment. You will execute purification of recombinant proteins, antibodies, and enzymes using a variety of classical and contemporary biochemical techniques.\n<br><br>\n<strong> Primary duties and responsibilities include:</strong>\n<li> Express protein using E. coli as an expression system</li>\n<li> Purify proteins using pumps or Akta instruments</li>\n<li> Characterize protein using HPLC, UPLC, Octet and DLS</li>\n<li> Provide general lab support and management</li>\n<li> Communicate project updates and technical reports to supervisor and senior level management</li>\n<li> Identify and promptly troubleshoot technical issues</li>\n<li> Keen in learning new methods and techniques</li>\n\nRequirements<br><br>We are seeking a motivated biochemist with experience in classical and contemporary protein purification procedures for a variety of protein classes.\n<li> general lab support</li>\n<li> executing projects within the laboratory</li>\n<li> writing study/research plans</li>\n<li> summarizing data to clients and colleagues via technical reports</li>\nThe position requires a drive to provide outstanding customer service by maintaining regular communications with clients, as well as meeting or exceeding quality and timeline expectations.\n<br><br>\nThis position provides a unique opportunity for a person with aspiration to join and contribute to a fast-paced team at a rapidly expanding company with ample opportunity to grow. If you have the <strong> drive, passion, experience</strong> and are excited by this opportunity and ready to take your career to the next level then <strong> Apply Today!</strong>"}