{"job title": "RESEARCH SCIENTIST ENGINEER", "company": "University of Washington", "city state": "– Seattle, Washington", "rating": "4.1", "job description": "Posting Date: 08/30/2018 Closing Info: Open Until Filled Salary: Salary is commensurate with education and experience Shift: First Shift Notes: As a UW employee, you will enjoy generous benefits and work/life programs. For a complete description of our benefits for this position, please visit our website, As a UW employee, you have a unique opportunity to change lives on our campuses, in our state and around the world. UW employees offer their boundless energy, creative problem solving skills and dedication to build stronger minds and a healthier world.\n<br><br>\nUW faculty and staff also enjoy outstanding benefits, professional growth opportunities and unique resources in an environment noted for diversity, intellectual excitement, artistic pursuits and natural beauty. All of which has allowed the UW to be nationally recognized as a Great College to Work For for four consecutive years.\n<br><br>\nThe Department of Neurology offers comprehensive consultation, evaluation and treatment services for adults and children with neurological disorders, through its clinical facilities at the University of Washington Medical Center, Harborview Medical Center, Northwest Hospital and Medical Center, VA Puget Sound Health Care System and Seattle Children's Hospital and Regional Medical Center. Through our commitment to research, we continue to gain insight and understanding into the normal and abnormal functions of the human nervous system and how to care for related disorders. We are then able to share the knowledge gained and results of this research with our colleagues at the University, across the nation, and around the world. The Neurology Clerkship and Residency Training Programs represent significant foci of the Department's efforts. We are extremely proud of our programs, which regularly receives applications for training from around the world. Clinical exposure is outstanding, teaching is a top priority, research and collaborative opportunities are abundant, and our faculty are friendly and approachable.\n<br><br>\nThe Department of Neurology currently has an outstanding opportunity for a <strong> RESEARCH SCIENTIST ENGINEER 3</strong>\n<br><br>\n<strong>Job Responsibilities Include:</strong>\n\n<li> Animal model tissue processing</li>\n<li> Imaging and molecular analyses</li>\n<li> IACUC protocols; PCR, blotting, sequencing</li>\n<li> Assist with managerial duties for lab; Assist with Molecular Biology studies</li>\n<li> Research Sponsors/Stakeholders (e.g. NIH, NSF, other schools or research institutions, etc.)\n<br><br>\n<strong>NIH, MDA:</strong></li><strong>\n\n</strong>\n\n<li> Manage a mouse colony for the laboratory and ensure all animal subjects protocols are followed, including Animal husbandry, ordering, shipping and genotyping mice.</li>\n<li> Write, submit and update animal use and care protocols\n<br><br>\n<strong>Minimum Requirements:</strong></li><strong>\n\n</strong>\n\n<li> Bachelor's Degree in Biology, Chemistry or related field and three to five years of experience\n<br><br>\n<strong> Specific knowledge, skills and abilities required to perform this job include:</strong></li>\n<li> Familiar with use of animal models in genetic studies, experience with molecular biology, antibody and histology techniques</li>\n<li> Graphics and imaging methods for data reporting</li>\n<li> Able to present scientific data to a group; scientific writing skills; able to read and explain scientific publications</li>\n<li> Molecular biology (DNA/RNA, cloning, PCR)</li>\n<li> Experience with animal use and care</li>\n<li> Maintaining databases\n<br><br>\n<strong>Desirable skills/knowledge:</strong></li><strong>\n\n</strong>\n\n<li> Experience with Gene Therapy protocols.\n<br><br>\n<strong>Application Process:</strong>\n<br>\nThe application process for UW positions may include completion of a variety of online assessments to obtain additional information that will be used in the evaluation process. These assessments may include Work Authorization, Cover Letter and/or others. Any assessments that you need to complete will appear on your screen as soon as you select Apply to this position. Once you begin an assessment, it must be completed at that time; if you do not complete the assessment you will be prompted to do so the next time you access your My Jobs page. If you select to take it later, it will appear on your \"My Jobs\" page to take when you are ready. <strong> Please note that your application will not be reviewed, and you will not be considered for this position until all required assessments have been completed.</strong></li>\nThe University of Washington is a leader in , and committed to becoming climate neutral."}