{"job title": "Staff Scientist - Radiation Oncology", "company": "Washington University In St. Louis", "city state": "– Saint Louis, Missouri", "rating": "4.2", "job description": "Job Type/Schedule<br><br>This position is full-time and works approximately 40 hours per week.<br><br>Department Name/Job Location<br><br>This position is in the Department of Radiation Oncology. This position is for the Medical School Campus.<br><br>Essential Functions<br><br><strong> POSITION SUMMARY:</strong>\n<br><br>\nA Staff Scientist position is available in Dr. Aadel Chaudhuris group to work on cell-free DNA, genomics, methods application and development with the goal of improving cancer care through translational research. Assists in developing and conducting research projects, including experimental design, data analysis and documentation of experimental results.\n<br><br>\nThe position offers an excellent opportunity to conduct research in a supportive and stimulating environment, closely collaborating with biologists, clinicians and computer scientists, within the Department and other Institutes across the campus, including the McDonnell Genome Institute and the Institute for Informatics.\n<br><br>\n<strong> PRIMARY DUTIES AND RESPONSIBILITIES:</strong>\n<li> Following instructions and discussions with principal investigator, designs research protocols, including developing procedures for the collection, verification and management of data.</li> <li> Setup cell-free DNA next-generation sequencing experiments to identify and quantitate circulating tumor DNA.</li> <li> Setup single cell sequencing experiments including those involving FACS sorting.</li> <li> Critically analyzes published literature and develops genomics-based approaches to improve clinical cancer care.</li> <li> Effectively visualizes data to convey critical findings to scientists, clinicians, and community members.</li> <li> Assists with grant preparation and reporting of methods, data and results.</li> <li> Performs complex statistical analysis of data collected and writes interpretative reports.</li>  <li> Documents research topics and prepares and submits papers based on research work to publications and committees for publication or presentation to peers.</li> <li> Solves practical problems relating to difficulties with equipment or test subjects. Suggests technical or procedural improvements in testing methods.</li>\n\nRequired Qualifications<br><br>Masters degree with 4 years of experience in research lab operations or equivalent combination of education and experience equaling 9 years required.<br><br>Preferred Qualifications\n\n<li> Doctoral degree in biology, chemistry or biomedical engineering.</li> <li> Proficiency in DNA and RNA sequencing library preparation.</li> <li> Proficiency in flow cytometry and single cell sorting.</li> <li> Experience with translational research involving human subjects.</li> <li> Highly motivated with excellent oral and written communication skills.</li> <li> Understanding of next-generation sequencing technologies.</li> <li> Analytical, reasoning and problem solving skills.</li> <li> Ability to analyze and interpret statistical data and to communicate data in a clear, concise manner.</li>  <li> Computer literacy including the ability to use a variety of software packages to analyze data.</li>\n\nSalary Range<br><br>The hiring range for this position is $46,779 - $63,170 annually.<br><br>Pre-Employment Screening<br><br>Offers made for this position are contingent upon the successful completion of all required pre-employment screens, including a criminal background check, hair sample drug screen, and verification of required professional licenses, registrations, or certifications.<br><br>Department Summary<br><br>The Cancer Biology Division within the Department of Radiation Oncology consists of a core group of clinical, biology, physics and computational science investigators who use both archived and prospectively collected tumor samples to ask fundamental questions about radiotherapy efficacy and cancer biology. There is a strong focus on the identification of biomarkers that can be used to risk-stratify cancer patients and to identify patients for targeted therapies.<br><br>Benefits<br><br>This position is eligible for full-time benefits. Please visit our website at http://hr.wustl.edu to view a summary of benefits.<br><br>Applicant Special Instructions<br><br>Works in laboratory environment with potential exposure to biological, chemical and radioactive hazards. Must be physically able to wear protective equipment. Must be able to provide standard care to research animals.<br><br>EOE Statement<br><br>Washington University is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity or expression, national origin, genetic information, disability, or protected veteran status."}