{"job title": "Data Scientist", "company": "Lawrence Livermore National Laboratory", "city state": "– Livermore, CA", "rating": "4.3", "job description": "<em><strong>Science and Technology on a Mission!</strong></em>\n<br><br>\nFor more than 60 years, the Lawrence Livermore National Laboratory (LLNL) has applied science and technology to make the world a safer place.\n<br><br>\nWe have multiple openings for Data Scientists to provide solutions for various projects. You will work in a dynamic, multidisciplinary team of independent/entrepreneurial computer scientists and engineers who research, develop, and integrate state-of-the-art algorithms, software, hardware, and computer systems solutions to challenging research and development problems. These positions are in the Computation Directorate.\n<br><br>\nThese positions will be filled at either the SES.2 or SES.3 level depending on your qualifications. Additional job responsibilities (outlined below) will be assigned if you are selected at the higher level.\n<br><br>\n<strong>Essential Duties</strong>\n\n\n<ul>\n<li>Collaborate with scientists and researchers in one or more of the following areas: data intensive applications, text processing, graph analysis, machine learning, statistical learning, information visualization, low-level data management, data integration, data streaming, scientific data mining, data fusion, massive-scale knowledge fusion using semantic graphs, database technology, programming models for scalable parallel computing, application performance modeling and analysis, scalable tool development, novel architectures (e.g., FPGAs, GPUs and embedded systems), and HPC architecture simulation and evaluation.</li>\n<li>Work with other LLNL scientists and application developers to bring research results to practical use in LLNL programs.</li>\n<li>Assess the requirements for data sciences research from LLNL programs and external government sponsors.</li>\n<li>Carry out development of data analysis algorithms to address program and sponsor data sciences requirements.</li>\n<li>Engage other developers frequently to share relevant knowledge, opinions, and recommendations, working to fulfill deliverables as a team.</li>\n<li>Design technical solutions independently, participate as a member of a multidisciplinary team to analyze sponsor requirements and designs, and implement software and perform analyses to address these requirements.</li>\n<li>Develop and integrate components-such as web-based user interfaces, access control mechanisms, and commercial indexing products-for creating an operational information and knowledge discovery system.</li>\n<li>Perform other duties as assigned.</li>\n</ul>\n\n<strong>In Addition at the SES.3 Level</strong>\n\n\n<ul>\n<li>Lead multiple parallel tasks and priorities of customers and partners to ensure complex deadlines are met.</li>\n<li>Responsible for various complex projects, use team members’ skills to complete complex projects/tasks, and solve abstract complex problems/ideas and convert them into useable algorithms/software modules.</li>\n<li>Provide solutions that require in-depth analysis of multiple factors and the creative use of established methods.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Bachelor’s degree in computer science, computer engineering, or related field, or the equivalent combination of education and related experience.</li>\n<li>Comprehensive knowledge of one or more of the following: high performance computing, scientific data analysis, statistical analysis, knowledge discovery, computer security, systems programming, large-scale data management, and big data technologies.</li>\n<li>Skilled in all aspects of the software project life cycle: feasibility, requirements, design, implementation, integration, test and deployment.</li>\n<li>Experience developing software with C++, C, Java, Python, R, or Matlab, software applications in Linux, UNIX, Windows environments, data analysis algorithms, data management approaches, relational databases, or machine learning algorithms.</li>\n<li>Demonstrated ability to effectively handle concurrent technical tasks with conflicting priorities, to approach difficult problems with enthusiasm and creativity and to change focus when necessary, and to work independently and implement research concepts in a multi-disciplinary team environment, where commitments and deadlines are important to project success.</li>\n<li>Effective interpersonal skills necessary to interact with all levels of personnel.</li>\n<li>Proficient verbal and written communication skills necessary to effectively collaborate in a team environment and present and explain technical information.</li>\n</ul>\n\n<strong>In Addition at the SES.3 Level</strong>\n\n\n<ul>\n<li>Effective advanced analytical, problem-solving, and decision-making skills to develop creative solutions to complex problems.</li>\n<li>Significant experience with demonstrated expertise in the following technical languages, concepts, or constructs and in one or more of the following advanced areas: high performance computing, scientific data analysis, statistical analysis, knowledge discovery, computer security, systems programming, large-scale data management or big data technologies.</li>\n<li>Advanced verbal and written communication skills necessary to effectively collaborate in a team environment and present and explain technical information and provide advice to management.\n<br><br>\n<strong>Pre-Employment Drug Test:</strong> External applicant(s) selected for this position will be required to pass a post-offer, pre-employment drug test.\n<br><br>\n<strong>Security Clearance:</strong>  This position requires a Department of Energy (DOE) Q-level clearance.\n<br><br>\nIf you are selected, we will initiate a Federal background investigation to determine if you meet eligibility requirements for access to classified information or matter. In addition, all L or Q cleared employees are subject to random drug testing. Q-level clearance requires U.S. citizenship. If you hold multiple citizenships (U.S. and another country), you may be required to renounce your non-U.S. citizenship before a DOE L or Q clearance will be processed/granted.\n<br><br>\n<strong>Note:</strong>  This listing has multiple openings; these are Career Indefinite positions. Lab employees and external candidates may be considered for these positions.\n<br><br>\n<strong>About Us</strong>\n<br><br>\nLawrence Livermore National Laboratory (LLNL), located in the San Francisco Bay Area (East Bay), is a premier applied science laboratory that is part of the National Nuclear Security Administration (NNSA) within the Department of Energy (DOE). LLNL's mission is strengthening national security by developing and applying cutting-edge science, technology, and engineering that respond with vision, quality, integrity, and technical excellence to scientific issues of national importance. The Laboratory has a current annual budget of about $1.8 billion, employing approximately 6,500 employees.\n<br><br>\nLLNL is an affirmative action/ equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, marital status, national origin, ancestry, sex, sexual orientation, gender identity, disability, medical condition, protected veteran status, age, citizenship, or any other characteristic protected by law.</li>\n\n</ul>"}