{"job title": "Data Scientist", "company": "Mayo Clinic", "city state": "– Rochester, MN", "rating": "3.9", "job description": "<strong>City</strong>\n<br><br>\nRochester\n<br><br>\n<strong>State</strong>\n<br><br>\nMinnesota\n<br><br>\n<strong>Telecommute</strong>\n<br><br>\nNo\n<br><br>\n<strong>Department</strong>\n<br><br>\nHealth Sciences Research\n<br><br>\n<strong>Why Mayo Clinic</strong>\n<br><br>\nData science, through the emergence of artificial intelligence research and applications in health care, is unifying several theoretical and computational disciplines to advance the practice of healthcare. Mayo Clinic has a rich tradition of collecting and utilizing healthcare and basic research data starting as early as 1900s with pioneering a unified, indexed medical record system. Mayo Clinic strives to remain a world leader for advanced quantitative approaches and novel insights from the diverse landscape of health care data.\n<br><br>\nThe Department of Health Sciences Research at Mayo Clinic is seeking applications for a faculty position in Data Science to assist in these efforts. Resources to support investigations include a clinical data warehouse containing over twenty years of EMR and supporting data for 9.2 million patients, vibrant radiology practice with state-of-the-art imaging modalities and deep, multi-decadal digital image repository, reference labs including digital pathology, biomedical engineering programs, genomic data, and drug discovery pipelines. Mayo Clinic also leads a national agenda in precision medicine as the biorepository for the NIH All of Us initiative.\n<br><br>\n<strong>Position description</strong>\n<br><br>\nWe are looking for a motivated and talented individual with strong interest in advancing data science in biomedical and healthcare domain in order to transform clinical practice and precision medicine.\n<br><br>\nThe successful candidate will be expected to lead and sustain a research program in data science and work collaboratively with colleagues to advance data science in healthcare transformation and precision medicine. A track record or clearly articulated vision for developing novel methods that can drive improvements in health care through advancements in population health management, clinical decision support, digital pathology, individualized medicine, or health care management is preferred. Successes will be measured by scientific productivity, extramural funding, national and international leadership, institutional citizenship. This person will hold academic rank at Mayo Clinic commensurate with experience and qualifications.\n<br><br>\n<strong>License or certification</strong>\n<br><br>\n<strong>Candidates must have a PhD, MD or equivalent degree</strong> in their respective disciplines with a quantitative science background. Early, middle and senior level candidates are welcomed. Early stage candidates should have demonstrated scientific productivity; evidence of successful competition of external funding is preferred. Middle or senior level candidates should have national leadership and strong extramural funding records.\n<br><br>\n<strong>Applications should include a cover letter, CV and statement of research interests.</strong> \n<br><br>\n<strong>Benefits eligible</strong>\n<br><br>\nYes\n<br><br>\n<strong>Schedule</strong>\n<br><br>\nFull Time\n<br><br>\n<strong>Site description</strong>\n<br><br>\nEvery year, more than 1 million patients from all 50 states and nearly 150 countries choose Mayo Clinic for their medical care. Mayo Clinic has a legacy of inspiring hope and contributing to health and well-being by providing the best care to every patient through integrated clinical practice, education and research.\n<br><br>\nMayo Clinic has campuses in Rochester, MN; Scottsdale and Phoenix, AZ; Jacksonville, FL; and throughout the multistate network of Mayo Clinic Health System. Each campus is an integral part of its community and reflects Mayo Clinic's deeply held values.\n<br><br>\n<strong>Category</strong>\n<br><br>\nPhysicians &amp; Scientists\n<br><br>\n<strong>Career profile</strong>\n<br><br>\nResearch\n<br><br>\n<strong>Specialty</strong>\n<br><br>\nResearch\n<br><br>\n<strong>Job posting number</strong>\n<br><br>\n<strong>100600BR</strong>\n<br><br>\n<strong>Recruiter</strong>\n<br><br>\nJennell Prentice Endrizzi\n<br><br>\n<strong>Equal opportunity employer</strong>\n<br><br>\nMayo Clinic is an equal opportunity educator and employer (including veterans and persons with disabilities).\n<br><br>\nEmail"}