{"job title": "Data Scientist", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "Data Scientist Central Operations\n<br>\nGlobal Specialty Fulfillment (GSF) comprises Prime Now, Fresh, Pantry, Restaurants, Whole Foods, Special Handling, Treasure Truck, and Campus operations, where last mile capacity management and work assignment are managed by GSF Central Operations (CO). Support for CO is provided by the Central Operations Strategy team, which facilitates process integration, standardization, and optimization for CO intake, and is currently developing a new CO-centric analytics and performance appraisal platform called CO2.0 that will be the key component enabling CO scalability for world-wide operations in 2018 through 2020. In particular, CO2.0 is building a new operational data model that will fundamentally change the way GSF surfaces and appraises quality, cost, and capacity variation by identifying deviations in root cause activities and tool settings. This endeavor will allow CO and upstream partner teams to quickly adjust operational levers in order to maintain customer experience.\n<br><br>\nCO Strategy is hiring a Data Scientist who will work within the CO2.0 project to develop the data models and simulations that will enable full development and deployment of this platform. This individual will leverage data that defines success parameters across a spectrum of operational aspects, including FC and CO performance parameters, labor planning accuracy, routing optimization and capacity management. This role will be part of the CO2.0 team and will facilitate science-driven operational decisions at scale that will enable CO to operate effectively and efficiently while also offering analytical depth for upstream teams and their activities that directly impact outbound operations.\n<br><br>\nKey Responsibilities\n<br>\n· Extract data from multiple sources across Amazon and evaluate usability for assessment research\n<br>\n· Perform advanced statistical/quantitative analyses on large and complex data sets\n<br>\n· Create static and dynamic data visualizations\n<br>\n· Identify, leverage, and curate data that defines characteristics of high performance\n<br>\n· Partner with internal and external technology teams for solution extraction\n<br>\n· Develop simulation models that inform optimal configurations for cost, quality and capacity\n<br>\n· Drive effective teamwork, communication, and collaboration across multiple stakeholder groups"}