{"job title": "Data Scientist", "company": "Aware Software", "city state": "– Atlanta, GA", "rating": "3.2", "job description": "About Aware Software by SageNet<br><br>Aware Software by SageNet unites Internet of Things (IoT) managed services with wireless expertise to deliver secure, user friendly, and innovative monitoring solutions. With our Enterprise Managed Services, organizations can easily develop, deploy, monitor, and support devices across multiple mobile platforms and operating systems. Services include hardware procurement, API and development integration, data capture and analytics, and 24/7/365 monitoring and support. With Aware Software, organizations can streamline operations, enhance asset functionality, increase customer loyalty and employee productivity. The companys complete, turnkey services support, monitor and manage asset access to more than 7,000 unique locations across North America.<br><br>Position Description<br><br>Aware Software by SageNet is seeking a Data Scientist to join our growing team. The Data Scientist is primarily responsible for collecting and analyzing statistics and information from multiple sources to spot trends and to gain maximum insight into creating solutions via algorithms to address the needs for our customers. Duties will include creating user information solutions by developing, implementing, and maintaining Java-based components and interfaces for our client-facing solutions.<br><br>Position Responsibilities\n\n\n<ul>\n<li>Defines site objectives by analyzing user requirements; envisioning system features and functionality.</li>\n\n<li>Integrates with databases via SQL, NOSQL, and other methods to extract data and analyze data.</li>\n\n<li>Build prototypes and performs data visualization.</li>\n\n<li>Conducts scalable data research on and off the cloud.</li>\n\n<li>Develops customized algorithms to solve analytics problems with incomplete data sets, and implements automated processes for efficiently producing scale models.</li>\n\n<li>Produce suggestions as to what data is required to provide the best insight into solving specific problem sets.</li>\n\n<li>Collaborate with developers, engineers, architects, database engineers, analysts etc. to develop, refine and scale data management and analytics procedures, systems, workflows, best practices, and other issues.</li>\n\n<li>Implements new or enhanced software design to access and handle data more efficiently.</li>\n\n<li>Documents analysis and conclusions and trains team on approach.</li>\n</ul>\n\nPosition Qualifications\n\n\n<ul>\n<li>1-2 years of data science experience</li>\n\n<li>Object Oriented Design and Development</li>\n\n<li>High level knowledge of micro services architectures is a plus</li>\n\n<li>Knowledge of Postgres is a plus</li>\n\n<li>NoSQL databases</li>\n\n<li>Knowledge of Elastic search is a plus</li>\n\n<li>Test and behavior driven development</li>\n\n<li>Experience with AWS public cloud desired</li>\n\n<li>Strong troubleshooting and good communication skills</li>\n\n<li>Ability to document coding changes</li>\n\n<li>Agile methodology</li>\n\n<li>Relational databases</li>\n\n<li>Bachelors degree in computer science or related field highly desired</li>\n</ul>\n\nEqual Employment Opportunity Statement<br><br>Aware Software by SageNet is an Equal Employment Opportunity Employer and is committed to workplace diversity. Aware Software provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, national origin, age, disability, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state and local laws. Aware Software complies with applicable state and local laws governing non-discrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including, but not limited to, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training."}