{"job title": "BlackHorse Data Scientist", "company": "BlackHorse Solutions", "city state": "– Herndon, VA", "rating": "NA", "job description": "<strong>BlackHorse Solutions|Security for the New Industrial Revolution</strong>\n<br><br>\nBlackHorse Solutions, Inc. is a veteran founded small business providing comprehensive, full-spectrum cyber capabilities and solutions to a wide mission set across the Intelligence, Defense, Federal, and commercial communities. Our philosophy entails creating and leveraging technology combined with many years of security and intelligence expertise to deliver solutions that meet our customers business needs. Our specific capabilities include full spectrum cyber, data analytics, training and tradecraft, and distribution of publicly available information.\n<br><br>\nOur experts and engineers have developed cyber security solutions for multiple phases of Cyberspace Operations supporting Title 10 and Title 50 customers. We created, developed and provided basic, intermediate, and advanced technical training programs for thousands of graduates coming from more than 25 different commands and organizations, as well as various Silicon Valley private organizations.\n<br><br>\nWe seek the industry's best to provide full spectrum cyber capabilities for our customers.\n<br><br>\n<strong>TODAY'S OPPORTUNITY: Data Scientist</strong>\n<br><br>\n<strong>HIGHLIGHTS:</strong>\n<br><br>\nWe are looking for an amazing Data Scientist who wants to be on the ground floor of a revolutionary new product suite. The ideal person for this position is someone who wants to work in an entrepreneurial environment and build a series of innovative products and solutions from the ground up. As a key member of a newly formed technology team, this person will help drive requirements, design, and implementation of original products and solutions. And, of course you have to fit well into our playful and creative company culture. Who is up for the challenge?\n\n<ul>\n<li>USG Secret Clearance required</li>\n<li>B.S. Computer Science, Information Technology, National Security or other related field</li> \n\n<li>Minimum 5-7 years of experience in the following\n\n\n<ul>\n<li>Designing Big Data systems</li>\n<li>Proficiency in one or more scripting and coding languages</li>\n<li>Data modeling and data visualization</li>\n<li>Developing new data mining algorithms</li>\n<li>Designing and implementing cloud based architectures</li>\n<li>Experience with distributed data processing</li>\n<li>Experience with Machine Learning</li>\n</ul>\n\n</li>\n<li>Open to contract work and PT to FT opportunities</li>\n<li>Understanding of security frameworks</li>\n<li>Experience in basic Windows and Linux Administration</li>\n<li>Understanding GIT and software development processes</li>\n<li>Work location: Cool Office-Herndon, Virginia. Scooter sightings are common.</li> \n\n<li>Workmates: The best in the business! You'll work alongside them and learn from each other.</li> \n\n<li>Salary &amp; Benefits: Market competitive and then some! Ask about WFW, Anita's burritos &amp; the Nitro Cold Brew on tap!</li> \n</ul>\nEDUCATION: BS in Computer Science or a similar technical field of study. Candidates that can show extensive work related to the above development can forgo the BS requirement.\n<br><br>\nAre you ready to work on some of the coolest projects with the coolest people?\n<br><br>\n<strong>PROCESS:</strong>  Our hiring process is extensive. (The good ones always are!) In person interviews are a requirement and expect them to take a half day. Come prepared to answer technical questions in any interview. We gauge applicants on culture fit, project fit, and technical depth. Expect \"on the fly questions\" and a white boarding session during your in-person interview process. Depending on experience level, some applicants may be asked to perform a brief project before the in-person interview.\n<br><br>\nThanks for taking the time to read through this post. We look forward to connecting with you!\n<br><br>\n<strong>Security Clearance Requirements:</strong> Applicants selected will be subject to a government security investigation and must meet eligibility requirements. U.S. Citizenship is required.\n<br><br>\n<em>The organizational culture at BlackHorse is very innovative, entrepreneurial, team oriented, fun, professional and absolutely growth driven. BlackHorse hires PhD's and auto-didacts alike. No Egos. Its a meritocracy, and we are proud to be an Equal Opportunity/Affirmative Action employer. People seeking employment at BlackHorse Solutions, Inc. are considered without regards to race, color, religion, national origin, age, sex, marital status, sexual orientation, ancestry, genetics, physical or mental disability, or veteran status.</em>\n<br><br>\nBlackHorse Solutions, Inc. | Security for the New Industrial Revolution\n<br><br>\n<strong><em>To all Staffing, Placement and Recruiting Agencies: We do not pay agency fees. Our job postings are only intended for individuals. To protect the interests of all parties, BlackHorse Solutions, Inc. (BlackHorse) will not accept unsolicited profiles, resumes, CV's or applications from any source other than directly from a candidate.</em> </strong><em>Any unsolicited profiles, resumes, CV's or applications sent to BlackHorse, including unsolicited profiles, resumes, CV's or applications sent to a BlackHorse mailing address, BlackHorse email address, directly to BlackHorse employees and contractors, or to the BlackHorse resume database, will be considered BlackHorse property and BlackHorse will not pay a fee for any placement resulting from the receipt of an unsolicited resume. BlackHorse will consider any candidate for who an Agency has submitted an unsolicited resume to have been referred by the Agency free of any charges or fee.</em>"}