{"job title": "Data Scientist", "company": "Booz Allen Hamilton Inc.", "city state": "– Arlington, VA", "rating": "3.7", "job description": "<strong>Job Number: R0028605</strong>\n<br><br>\nData Scientist<br><br><strong>The Challenge:</strong>\n<br><br>\nAre you excited at the prospect of unlocking the secrets held by a data set? Are you fascinated by the possibilities presented by the IoT, machine learning, and artificial intelligence advances? In an increasingly connected world, massive amounts of structured and unstructured data open up new opportunities. As a data scientist, you can turn these complex data sets into useful information to solve global challenges. Across private and public sectors from fraud detection, to cancer research, to national intelligence you know the answers are in the data.\n<br><br>\nWe have an opportunity for you to use your analytical skills to improve the military operations community. Youll work closely with your customer to understand their questions and needs, and then dig into their data-rich environment to find the pieces of their information puzzle. Youll develop algorithms, write scripts, build predictive analytics, use automation, apply machine learning, and use the right combination of tools and frameworks to turn that set of disparate data points into objective answers to help our military leaders make informed decisions. Youll provide your customer with a deep understanding of their data, what it all means, and how they can use it. Join us as we use data science for good in support of operations.\n<br><br>\nEmpower change with us.\n<br><br>\n<strong>Build Your Career:</strong>\n<br><br>\nAt Booz Allen, we know the power of analytics and were dedicated to helping you grow as a data analysis professional. When you join Booz Allen, you can expect:\n<ul>\n<li>access to online and onsite training in data analysis and presentation methodologies, and tools like Hortonworks, Docker, Tableau, and Splunk</li><li>a chance to change the world with the Data Science Bowlthe worlds premier data science for social good competition</li><li>participation in partnerships with data science leaders, like our partnership with NVIDIA to deliver Deep Learning Institute (DLI) training to the federal government</li>\n</ul>\nYoull have access to a wealth of training resources through our Analytics University, an online learning portal specifically geared towards data science and analytics skills, where you can access more than 5000 functional and technical courses, certifications, and books. Build your technical skills through hands-on training on the latest tools and state-of-the-art tech from our in-house experts. Pursuing certifications? Take advantage of our tuition assistance, on-site boot camps, certification training, academic programs, vendor relationships, and a network of professionals who can give you helpful tips. Well help you develop the career you want, as you chart your own course for success.\n<br><br>\n<strong>You Have:</strong>\n<br><br>\n-3+ years of experience as a data scientist and managing a data scientist team\n<br><br>\n-Experience with building statistical models and developing machine learning algorithms\n<br><br>\n-Experience with data visualization and programming languages, including Python, R, Scala, or Java\n<br><br>\n-Experience with big data technologies, including HDFS, Hadoop, and Spark\n<br><br>\n-Experience with deep learning paradigms and frameworks\n<br><br>\n-Experience with manipulating data and ETL in parallel processing and distributed compute environments\n<br><br>\n-Experience with developing and deriving statistical methodologies for data analysis\n<br><br>\n-Experience with designing and executing machine learning models and applications\n<br><br>\n-Secret clearance\n<br><br>\n-BA or BS degree\n<br><br>\n<strong>Nice If You Have:</strong>\n<br><br>\n-2+ years of experience as a developer with Java, Python, R, or similar high-level languages\n<br><br>\n-2+ years of experience with designing novel data analytic methods and workflows, including full data pipelines from raw data through analysis results\n<br><br>\n-2+ years of experience in managing disparate data sources with varying data structures of content and preparing these for data science and machine learning applications\n<br><br>\n-Experience in working with big data storage, processing, and computation, including one or more of Accumulo, Spark, Storm, Kafka, or MapReduce\n<br><br>\n-Ability to manage and manipulate large data sets, develop data science approaches, and manage data science tasks\n<br><br>\n-Ability to leverage a wide variety of data science capabilities and languages\n<br><br>\n-Ability to exhibit flexibility, initiative, and innovation when dealing with ambiguous and fast-paced situations\n<br><br>\nClearance:\n<br><br>\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; Secret clearance is required.\n<br><br>\nWere an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change.<br><br>SIG2017\n<br><br>"}