{"job title": "Data Scientist", "company": "Collabera", "city state": "– New York, New York", "rating": "3.9", "job description": "New York, New York\n<br>\n<strong>Skills :</strong> Requirements:\n\n\n<ul>\n<li>Required Skills :- Spark with Scala or Java</li>\n<li>Secondary Skills ( Nice to Have) :- Python, R, TensorFlow, scikit-learn, machine learning algorithms, Statistics, Probability</li>\n<li>Minimum of 3 years in a data science engineering role</li>\n<li>Experience working with product development teams and/or with other developers</li>\n</ul>\n\n<strong>Description :</strong> Responsibilities:\n\n\n<ul>\n<li>The candidate will play a technical role in an enterprise area responsible for driving innovative analytical methods to better align IT analytics with CIMA short term and long term goals, adding value by adopting software engineering best practices.</li>\n<li>The candidate must possess excellent analytical and technical skills coupled with the ability to quickly learn new technologies.</li>\n<li>The individual will be hands on with software development, architecture and design to support their various organizations.</li>\n<li>This individual will be a part of a team that delivers innovative solutions to complex problems while driving IT and business process refinements through agile methodology.</li>\n</ul>\n\nSpecific job responsibilities will include the following:\n\n\n<ul>\n<li>Develop robust, scalable production predictive models based on prototype algorithms developed in Python or R</li>\n<li>Iterate, and innovate on Machine Learning algorithms in collaboration with Machine Learning Engineers and Software Engineers</li>\n<li>Collect process and cleanse data from a wide variety of sources. Transform and convert unstructured data set into structured data for algorithm input.</li>\n<li>Evaluate the effectiveness of user experiences, determining what data is needed and how to collect it.</li>\n<li>Provide technical expertise through hands on approach to teams and projects developing enterprise applications based on machine learning algorithms and frameworks</li>\n<li>Out of the box thinker, take part in candid discussions and value other peoples ideas.Requirements:\n</li>\n<li>Required Skills :- Spark with Scala or Java\n</li>\n<li>Secondary Skills ( Nice to Have) :- Python, R, TensorFlow, scikit-learn, machine learning algorithms, Statistics, Probability\n</li>\n<li>Minimum of 3 years in a data science engineering role\n</li>\n<li>Experience working with product development teams and/or with other developers</li>\n</ul>"}