{"job title": "Data Scientist", "company": "Diverse Lynx", "city state": "– Portland, OR", "rating": "4.0", "job description": "<strong>Responsibilities:</strong>\n\n\n<ul>\n\n\t<li>Design and implement distributed data processing pipelines using Spark, Hive, Sqoop, Python, and other tools and languages prevalent in the Hadoop ecosystem. Ability to design and implement end to end solution.</li>\n<li>Build utilities, user defined functions, and frameworks to better enable data flow patterns.</li>\n<li>Research, evaluate and utilize new technologies/tools/frameworks centered around Hadoop and other elements in the Big Data space.</li>\n<li>Build and incorporate automated unit tests, participate in integration testing efforts.</li>\n<li>Work with teams to resolving operational &amp; performance issues</li>\n<li>Work with architecture/engineering leads and other teams to ensure quality solutions are implements, and engineering best practices are defined and adhered to.</li> \n</ul>\n\n<strong>Qualification:</strong>\n\n\n<ul>\n\n\t<li>MS/BS degree in a computer science field or related discipline</li>\n<li>6+ years' experience in large-scale software development</li>\n<li>2+ year experience in Hadoop</li>\n<li>2+ year experience in Data Science</li> \n\n<li>Strong development skills around Hadoop, Spark, &amp; Hive</li>\n<li>Strong Java programming, Python, shell scripting, and SQL</li>\n<li>Good understanding of file formats including Parquet, Avro, JSON and others</li>\n<li>Good understanding of R, TensorFlow, SAS or similar</li>\n<li>Experience with performance/scalability tuning, algorithms and computational complexity</li>\n<li>Experience (at least familiarity) with data warehousing, dimensional modeling and ETL development</li>\n<li>Proven ability to work cross functional teams to deliver appropriate resolution</li>\n</ul>\n\n<strong>Nice to have:</strong>\n\n\n<ul>\n\n\t<li>Experience with AWS components and services, particularly, EMR, S3, and Lambda</li>\n<li>Machine learning frameworks</li> \n</ul>\n\n<em>Diverse Lynx LLC is an Equal Employment Opportunity employer. All qualified applicants will receive due consideration for employment without any discrimination. All applicants will be evaluated solely on the basis of their ability, competence and their proven capability to perform the functions outlined in the corresponding role. We promote and support a diverse workforce across all levels in the company.</em>\n<br><br>"}