{"job title": "Data Scientist", "company": "FedEx", "city state": "– Coraopolis, PA", "rating": "3.7", "job description": "Company: FedEx Services\n<br><br>\nJob Title: Data Scientist\n<br><br>\nJob Requisition Number: RC88836\n<br><br>\nCategory: Information Technology\n<br><br>\n<strong>Locations:</strong>\n<br><br>\nBrookfield, Wisconsin 53045\n<br><br>\nUnited States\n<br><br>\nCoraopolis, Pennsylvania 15108\n<br><br>\nUnited States\n<br><br>\n<strong>Position Summary and Essential Duties:</strong>\n<br><br>\nDuties for this role include but not limited to: provide enterprise level analytics related to vast quantities of data (including disparate data), enterprise analytics, statistical modeling, and initiatives. Responsible for descriptive, predictive, prescriptive and ensemble modeling, advanced statistical techniques, use of databases tools and/or other approaches in quantitative analysis of complex business situations. Creates and executes solutions from initial concept to fully tested production and communicates results to a board range of audiences. Uses data, statistical and quantitative analysis, explanatory and high complexity predictive modeling and fact based management to drive decision making. Leads cross functional teams. Routinely work on multiple highly complex assignments\n<br><br>\n<strong>Job Specific Information:</strong>\n\n\n<ul>\n<li>Deep understanding of ML/ AI architectural patterns and best practices used throughout industry to achieve desired outcome supporting advanced analytic requirements.</li>\n<li>Develops advanced analytic solutions (Machine Learning, Neural Nets, Deep Learning, Cognitive Computing) in alignment to the strategy and standards defined by the Data and Analytic Principal Architects.</li>\n<li>Development of solutions includes but not limited to:</li>\n<li>Data ingestion frameworks to support large volumes of data in a Batch or Real Time velocity to enable ML/AI Models</li>\n<li>Data integration frameworks to classify, standardize, enrich, and harmonize data for the purpose of extracting value.</li>\n<li>Data governance frameworks to increase quality, security, and accessibility of data and information assets created bythe Data and Analytics teams.</li>\n<li>Data as a Service (DaaS) and Information as a Service (IaaS) frameworks supporting the movement of data and information assets following SOA principles</li>\n<li>Collaborates with all Data and Analytic Principal Architects to identify architectural gaps within the data and analytics space specifically around Big Data technologies and Data Science platforms.</li>\n<li>Execution of POCs (Proof of Concept) and POVs (Proof of Value) under the guidance of Data and Analytic Principal Architects</li>\n<li>Collaborates with internal and external data science teams, architects and developers throughout FedEx network to ensure alignment with the enterprise strategy.</li>\n<li>Defined, deploys, and trains team members on data science code development processes, standards, and guidelines</li>\n<li>Oversee CI/CD processes within the Data and Analytics team to ensure sustainable and efficient deployment of algorithm trained models</li>\n</ul>\n\nExperience in One or More of the Following is Considered a Plus:\n\n\n<ul>\n<li>Data Engineer/ Science expertise as a thought leader and practitioner</li>\n<li>Experience leading large data analysis projects</li>\n<li>Experience working in Big Data technologies like Hadoop, Spark, Hive, Kafka, Hbase, etc.</li>\n<li>Experience using one or more analytic software tools or languages such as. Scala, R, Python, SAS</li>\n<li>Demonstrated expertise in developing data pipelines with industrial datasets to enable descriptive, applied, and predictive analytics</li>\n<li>Broad understanding in the following: Probability Theory, Linear and Logistic Regression, SVM, etc..</li>\n<li>Experimental design experience</li>\n<li>Experience with neural network libraries such as Keras, TensorFlow, PyTorch etc.</li>\n<li>Excellent written communication, verbal communication and presentation skills are required.</li>\n<li>Experienced with the information technology aspects of data collection, organization, and integration</li>\n<li>Demonstrated skill at data cleansing, data quality assessment, and using analytics for data assessment</li>\n<li>Knowledge in optimal computational environment required for data processing, and data mining</li>\n</ul>\n\n<strong>Domicile Location:</strong>\n\n\n<ul>\n<li>Brookfield, WI</li>\n<li>Coraopolis, PA (a suburb of Pittsburgh, PA)</li>\n</ul>\n\n<strong>Relocation:</strong>\n<br><br>\nRelocation assistance may be available for this position, but is based on business decision.\n<br><br>\n<strong>Minimum Qualifications:</strong>\n<br><br>\nMaster's degree or equivalent in a quantitative discipline required. Five (5) years work experience in measurement and analysis, quantitative business problem solving, operations analysis, marketing analysis, simulation and/or predictive analytics. Superior analytical skills with diverse analytics and statistical software and applications. Excellent interpersonal skills, written and oral communication skills.\n<br><br>\nWant a career where you are empowered to make a difference? Want to work for a company that is environmentally responsible? Want to grow and develop on the job? If so, FedEx is the place for you! Every day FedEx delivers for its customers with transportation and business solutions. FedEx serves more than 220 countries and territories around the globe. We can serve this global network due to our outstanding team of FedEx employees. FedEx has over 400,000 talented employees who are tasked with making every FedEx experience outstanding. FedEx has been recognized on many different lists both for business success and for being a great employer.\n<br><br>\nHere are some of the recognitions FedEx has received from the past couple of years:\n\n\n<ul>\n<li>FORTUNE \"World's Most Admired Companies\" 2016</li>\n<li>Corporate Responsibility Magazine \"100 Best Corporate Citizens\" 2016</li>\n<li>InformationWeek \"Elite 100\" 2016</li>\n<li>Women's Business Enterprise National Council \"America's Top Corporations for Women's Business Enterprises\" - 2016</li>\n<li>Reputation Institute \"World's Most Reputable Companies\" 2015</li>\n<li>Black Enterprise \"40 Best Companies For Diversity\" 2015</li>\n</ul>\n\nWhen 400,000 employees around the globe are all working together it is amazing what we can achieve! FedEx connects people and ideas. If you would like to make a difference on a global scale while receiving top notch benefits, competitive pay, and plenty of opportunities to develop, click 'Apply' and tell us more about yourself.\n<br><br>\nEEO Statement - FedEx is an equal opportunity/affirmative action employer (minorities/females/disability/veterans) that is committed to diversifying its workforce."}