{"job title": "Data Scientist", "company": "Franklin Templeton Investments", "city state": "– ", "rating": "3.6", "job description": "<p>At Franklin Templeton Investments, we are dedicated to delivering strong results and exceptional service to clients, team members and business partners. Over 9,000 employees working in 60 offices around the world are dedicated to servicing investment solutions for our clients in more than 150 countries. For over 65 years, our success has been a direct result of the talent, skills and persistence of our people, and we are looking for qualified candidates to join our team. </p>\n<p> </p>\n<div>Machines can consume and analyze more data than humans. This is why our team at Franklin Templeton wants you. We recently acquired Random Forest Capital LLC to bring Machine Learning and AI to the investment teams at Franklin Templeton. With over $700 Billion in assets under management, we are looking to expand our team of individuals to come help create solutions that will be used to invest real dollars every day. The future is here and we want you to be a part of it. This role demands confidence, risk taking capabilities and desire to produce code at lightening speeds which will be used to invest capital. </div>\n<div> </div>\n<div><b>Things you should know:</b></div>\n<div> </div>\n<div>At Franklin Templeton, your contribution as a <b>Data Scientist </b>will have a direct impact on our investments. There is no hiding behind code that is never put into production – we want leaders, pioneers, and dreamers. We are not looking for a research team. We are looking for an execution team. </div>\n<div>We are using data to get answers to massive questions:</div>\n<div> </div>\n<div>• Why do consumers live the way they do?</div>\n<div>• Why do consumers spend the way they do?</div>\n<div>• Why do people invest the way they do?</div>\n<div>• Where will the next natural disaster happen?</div>\n<div> </div>\n<div><b>Can you figure out the answers to these questions? If so, we want to hear from you….</b></div>\n<div> </div>\n<div>We are looking for a <b>Data Scientist</b> that will help us discover the information hidden in vast amounts of data, and help us make smarter and better investment decisions. Your primary focus will be in applying data mining techniques, doing statistical analysis, and building high quality prediction software that we can leverage on a global scale within our investment processes </div>\n<div> </div>\n<div><b><em>What are the ongoing responsibilities of the Data Scientist?</em></b></div>\n<ul>\n<li>\n<div>Partnering with investment teams to provide machine learning / AI / Data Analysis expertise to enhance investment decisions and returns</div></li>\n<li>\n<div>Engaging Chief Investment Officer (CIO) and Portfolio Managers in investment team meetings; present and share investment ideas, insights and results</div></li>\n<li>\n<div>Selecting/creating features from raw data, and building/optimizing classifiers using machine learning techniques </div></li>\n<li>\n<div>Data mining using state-of-the-art methods </div></li>\n<li>\n<div>Extending the data used in modeling with third party sources of information </div></li>\n<li>\n<div>Processing, cleaning, and verifying the integrity of data used for analysis </div></li>\n<li>\n<div>Conducting ad-hoc analysis and presenting results in a clear manner </div></li>\n<li>\n<div>Creating automated data consistency checks (e.g. between live/historical data) and unit testing techniques to ensure ongoing model performance</div></li></ul>\n<div><strong><em>What ideal qualifications, skills &amp; experience would help someone to be successful?</em></strong></div>\n<ul>\n<li>\n<div>Masters/PhD in a quantitative discipline.</div></li>\n<li>\n<div>Experience with supervised/unsupervised machine learning techniques, especially tree-based algorithms and k-means clustering. Neural networks experience is a plus, especially with RNNs and CNNs </div></li>\n<li>\n<div>Experience modeling and making sense of complex systems</div></li>\n<li>\n<div>Requires advanced skills in Python- especially Pandas</div></li>\n<li>\n<div>Must be able to output code in Python at a rapid rate </div></li>\n<li>\n<div>Must have at least 4 years of coding experience. </div></li>\n<li>\n<div>The applicant must have a strong underlying coding ability </div></li>\n<li>\n<div>Must have strong applied statistics skills, such as understanding of distributions, hypothesis testing, and probability </div></li>\n<li>\n<div>Must have a passion for trading/investing. Any past trading/investing experience, either personally or professionally, is a plus </div></li>\n<li>\n<div>Great communication skills and experience with data visualization tools in Python </div></li>\n<li>\n<div>Proficiency in SQL is a plus. Must be able to write basic queries at minimum </div></li>\n<li>\n<div>Experience with high performance computing is a plus (e.g. cluster computing on AWS with Spark/Hadoop) </div></li></ul>\n<div><strong>What makes Franklin Templeton Investments unique?</strong> </div>\n<div> </div>\n<div>In addition to the dynamic and professional environment at Franklin Templeton, we strive to ensure that our employees have access to a competitive and valuable set of Total Rewards—the mix of both monetary and non-monetary rewards provided to you in recognition for your time, talents, efforts, and results. </div>\n<div> </div>\n<div><strong>Highlights of our benefits include:</strong> </div>\n<ul>\n<li>Three weeks paid time off the first year </li>\n<li>Medical, dental and vision insurance </li>\n<li>401(k) Retirement Plan with 75&gt; company match, up to the IRS limits </li>\n<li>Employee Stock Investment Program </li>\n<li>Tuition Assistance Program </li>\n<li>Purchase of company funds with no sales charge </li>\n<li>Onsite fitness center and recreation center </li>\n<li>Onsite cafeteria </li></ul>\n<div>We believe that being a good corporate citizen is good business. To us, corporate citizenship means being accountable, serving our clients, being an employer of choice, managing our environmental impact, and supporting our communities. An emphasis on corporate citizenship is embedded in our culture and values, and is an important element of how we achieve success. </div>\n<div> </div>\n<div>We are also committed to your learning and development with resources focused around Experience, Exposure, and Education, to help you achieve your professional development goals. Take some time to, meet some of our people, and see what it means to say, “I AM Franklin Templeton”. </div>\n<div> </div>\n<div>Franklin Templeton Investments is an Equal Opportunity Employer. We are committed to equal employment opportunity for all applicants and existing employees and we evaluate qualified applicants without regard to ancestry, age, color, disability, genetic information, gender, gender identity, or gender expression, marital status, medical condition, military or veteran status, national origin, race, religion, sex, sexual orientation, and any other basis protected by federal, state, or local law, ordinance, or regulation. We invite you to visit us at http://www.franklintempletoncareers.com/ to learn more about our company and our career opportunities. </div>\n<div> </div>\n<div>#LI-US #MID_SENIOR_LEVEL</div>"}