{"job title": "Data Scientist", "company": "Groupon", "city state": "– Seattle, United States", "rating": "3.5", "job description": "<strong><strong>Can data really help local businesses around the world thrive?</strong></strong>\n<br><br>\nAre you ready to test your skills using massive amounts of information to make critical business decisions?\n<br><br>\nGroupon’s mission is to become the daily habit in local commerce and fulfill our purpose of building strong communities through thriving small businesses by connecting people to a vibrant, global marketplace for local services, experiences and goods. In the process, we’re positively impacting the lives of millions of customers and merchants globally. Even with thousands of employees spread across multiple continents, we still maintain a culture that inspires innovation, rewards risk-taking and celebrates success. If you want to take more ownership of your career, then you're ready to be part of Groupon.\n<br><br>\nAs a part of our Technology organization, our Data Science team strives to be the voice of the customer in the decisions Groupon makes. We develop and use cutting-edge data technologies and data science algorithms to sift through large amounts of data and distill it into information about our customers' wants and needs. We then integrate these insights into our automated decision-making systems to constantly improve our services.\n<br><br>\nWe’re looking for a Data Scientist to join our Consumer Intelligence Team, who focus on building predictive models and finding insights to drive decision process for Groupon’s centralized services and tools. As a Data Scientist on this team, you will work closely with leaders across product engineering, relevance, life cycle management, and all computational marketing channels to optimize our consumer experience. If you consider yourself a pro at big data data-mining, predictive modeling, report generation, AB testing, and conveying complex insights in digestible formats, this might be the role you’ve been looking for.\n<br><br>\nWe're a \"best of both worlds\" kind of company. We're big enough to have resources and scale, but small enough that a single person has a surprising amount of autonomy and can make a meaningful impact. We're curious, fun, a little intense, and kind of obsessed with helping local businesses thrive. Does that sound like a compelling place to work?\n<br><br>\n<strong><strong>You’ll spend time on the following:</strong></strong>\n<ul>\n\n<li>Design and develop processes and systems to consolidate and analyze unstructured, diverse data sources to generate actionable insights</li>\n<li>Work with product and service teams to identify questions and issues for data analysis and experimentation</li>\n<li>Use machine learning to build customer models that address areas such as segmentation, churn, affinity, lifetime value, and conversion rates</li>\n<li>Develop and code software programs, algorithms, and automated processes to cleanse, integrate, and evaluate large datasets from multiple disparate sources</li>\n<li>Identify meaningful insights from large data and metadata sources; interpret and communicate insights and findings from analysis and experiments to partners across the organization</li>\n\n</ul>\n<strong><strong>​We’re excited about you if you have:</strong></strong>\n<ul>\n\n<li>5+ years work experience as a data scientist or a related role</li>\n<li>Advanced degree in Computer Science, Statistics, or similar quantitative field, with an emphasis on predictive analytics, data mining, statistics, machine learning, algorithms, etc.</li>\n<li>Understanding of applied math topics, such as probability and statistics, linear algebra, basic optimization techniques, etc.</li>\n<li>You have experience translating business objectives and problems into analytic problems, and analytic solutions into actionable business solutions</li>\n<li>You're a creative problem solver who identifies problems unilaterally and recommends effective plans of action</li>\n<li>You're an expert in SQL with experience in data warehouse technologies</li>\n<li>You have hands-on experience with dynamic scripting languages (e.g., Ruby, Python, Perl)</li>\n<li>You have hands-on experience with predictive analytics tools and machine learning techniques/algorithms</li>\n<li>You have experience with data management technologies like Hadoop and/or Spark ecosystem, working knowledge of Hive, Scala, or other open source big data query tools</li>\n<li>You have experience with one or more Statistical languages (e.g. R, SAS, STATA)</li>\n<li>You have experience designing and analyzing AB tests.</li>\n<li>You have experience with reporting/pivoting tool such as Tableau and Excel</li>\n\n</ul>"}