{"job title": "Data Scientist", "company": "Intel Corp.", "city state": "– Phoenix, AZ", "rating": "3.8", "job description": "Data ScientistJob Description\n<br><br>\nATTD is looking for a data scientist to join a team tasked with developing substrate, assembly and test technology development. Successful candidate will be a member of the ATTD Yield team responsible for tracking yield performance, defining yield roadmap and driving yield improvements on all products in partnership with integration, module engineering, operations and automation. Candidate must be able to quickly synthesize large volumes of data, apply statistical methods and draw meaningful conclusions to help direct the efforts of the organization. Successful candidate will independently drive recommendations in evolving the yield tracking and report-out methodology. Candidate must be able to develop solutions to problems utilizing formal education, statistical knowledge, and problem-solving tools.\n<br><br>\nThis is an entry level position and would be compensated accordingly.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nYou must possess the below minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Experience listed below would be obtained through a combination of your school work/classes/research and/or relevant previous job and/or internship experiences.\n<br><br>\n<strong>Minimum Qualifications:</strong>\n\n\n<ul>\n<li>Posses an M.S. in Industrial Engineering, Mechanical Engineering, Computer Science, and information systems, Electrical Engineering or Chemistry/Physics</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Expertise in engineering analysis tools, data analysis, machine learning and scripting methods in order to automate and train standard analytical tasks</li>\n<li>Prior experience in integration, yield, LYA, FA, test, is a plus.</li>\n<li>Detailed knowledge of some or all of the following is required: data systems and analytics, predictive modeling, machine learning, programing, yield tools, yield reporting and substrate/assembly processes.</li>\n</ul>\n\nInside this Business Group\n<br><br>\nAs the world's largest chip manufacturer, Intel strives to make every facet of semiconductor manufacturing state-of-the-art -- from semiconductor process development and manufacturing, through yield improvement to packaging, final test and optimization, and world class Supply Chain and facilities support. Employees in the Technology and Manufacturing Group are part of a worldwide network of design, development, manufacturing, and assembly/test facilities, all focused on utilizing the power of Moore's Law to bring smart, connected devices to every person on Earth\n<br><br>\nPosting Statement\n<br><br>\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance."}