{"job title": "Data Scientist", "company": "Monsanto", "city state": "– Saint Louis, MO", "rating": "4.0", "job description": "We are seeking an exceptionally talented Data Scientist with a passion for innovation to become an integral part of our Data Science Team within Global Breeding Organization.\n<br><br>\nWe are a cutting-edge group providing recommendations and solutions to accelerate and optimize our company's product development. We foster new game-changing ideas to produce sophisticated, intelligent optimization solutions and predictive models. As part of our diverse, highly dynamic group, you will be exposed to highly exciting research challenges and will have ample opportunity to work with interdisciplinary scientists (Mathematicians, Optimization Experts, Engineers, Operations Managers, and Breeders) to foster your career growth and development while delivering next-generation analytical solutions.\n<br><br>\nIn this role, you are required to use advanced mathematical models, machine learning techniques, optimization and strong business acumen to deliver insight. You will be responsible for transforming large amounts of diverse data into descriptive knowledge using advanced quantitative analysis; formulate and apply mathematical modeling and other optimization methods to develop and interpret information that assists with decision making; working collaboratively with interdisciplinary scientists to address analytical scientific breakthroughs in the field of machine learning; utilizing big data technologies to develop&amp;deploy advanced analytics solutions for high throughput research strategies. You will present compelling, validated stories to all levels of the organization, including peers, senior management and internal customers to drive both strategic and operational changes in business.\n<br><br>\n<strong>Required Skills/Experience:</strong>\n\n\n<ul>\n<li>Minimum of Master's degree in Mathematics, Statistics, Computer Science, Electrical Engineering, Bioinformatics or closely-related field with minimum of three or more years of experience -OR- PhD in Mathematics, Statistics, Computer Science, Electrical Engineering, Bioinformatics or closely-related field</li>\n<li>Strong background in Machine learning in one or more of the following areas: Monte-Carlo simulations, Stochastic Modeling, Estimation and Prediction, Recommender Systems, Boosting and Bagging techniques, Bayesian analysis, Deep learning, Reinforcement learning and/or Optimization</li>\n<li>Strong object oriented and/or functional programming experience with a minimum of two or more years of experience using Python and/or R</li>\n<li>Creative, proactive, bold and out-of-box thinking</li>\n<li>Strong business aptitude, the ability to rapidly learn new problem domains, and become conversant in the domain with subject matter experts</li>\n<li>Ability to work in a matrix environment, leading&amp;influencing people at varying levels of responsibility</li>\n<li>Proven ability to communicate complex qualitative analysis in clear, precise and actionable manner</li>\n</ul>\n\n<strong>Desired Skills/Experience:</strong>\n\n\n<ul>\n<li>Experience with Big data ecosystems such as: Hbase, MongoDB, MapReduce, and/or Spark</li>\n<li>Experience with relational databases and SQL</li>\n<li>Strong background in Machine learning in the following areas: Monte-Carlo simulations, Stochastic Modeling, Estimation and Prediction, Recommender Systems, Boosting and Bagging techniques, Bayesian analysis, Deep learning, Reinforcement learning, and/or Optimization</li>\n<li>Experience implementing machine learning algorithms in using frameworks such as GraphX, MLLib, and/or Tensorflow</li>\n<li>Two or more publications in leading scientific journals</li>\n</ul>\n\nBayer successfully completed the acquisitionof Monsanto in June 2018, bringing together Monsanto's leadership in seeds and plant traits with Bayer's leadership in chemical and biological crop protection. By joining forces, we will create even more extensive career opportunities for talent around the world. We're a global team working to shape agriculture through breakthrough innovation that will benefit farmers, consumers, and our planet.\n<br><br>\nWhile we are now Bayer, we will continue to hire using separate career sites until we can integrate our career platforms. We invite you to explore the career opportunities available at the combined company by visiting advancingtogether.com/careers."}