{"job title": "Sr Data Scientist", "company": "Roofstock", "city state": "– Oakland, CA", "rating": "4.8", "job description": "<div><div>Roofstock is an innovative online marketplace that makes it easy for people to invest in the $3 trillion single-family rental sector. We are passionate about helping our customers build wealth through real estate. At Roofstock, collaboration and teamwork are the norm, as are frequent celebrations of our awesome accomplishments and each other!</div> <br>\n<div>Roofstock was named as one of the top 50 Small Business Great Places to work by Fortune Magazine, and has been certified as a great workplace by the independent analysts at <strong>Great Place to Work®</strong> based on ratings provided by our employees. Check out our company review and see why our employees love working here!</div><br>\n<div>As a “full stack” data scientist you will write code that implements sophisticated models that solve business problems. You will work closely with product and other teams to solve challenges across the company in a high-visibility role. This is an excellent opportunity to join an established but small and quickly growing company working on a wide range of projects with talented data engineers, data analysts, and other data scientists in an integrated Data Team</div></div><div><div>What You Will Do:\n\n<ul>\n\n\n<ul>\n<li> Build statistical, economic, and machine learning systems that address:</li><li>\to Buyer segmentation, propensity modeling, &amp; marketing automation</li><li>\to Graph analysis of ownership networks and entity resolution</li><li>\to NLP and image recognition to extract signal from property listings</li><li>\to Property classification and ranking</li><li>\to Property recommendation, matching, and personalization</li><li>\to Economic modeling of property valuations, capital expenses, repair, maintenance, and operational expenses like tenant churn</li><li>\to Data mining for BD opportunity qualification</li><li>Work with large varied structured and unstructured datasets</li><li>Write robust well-documented code, operating on a modern cloud stack (AWS and Azure)</li></ul>\n</ul>\n\n</div>\n<br>\n<div><div>What You Bring With You:\n<br>\n\n\n<ul>\n\n\n<ul>\n<li>MS or PhD in statistics, computer science, economics, physical or social science, engineering, operations research, or similar quantitative and computational field</li><li>3-5+ years of industry experience (4+ for MS) shipping advanced statistical/ML models</li><li>Proficient in R or python and their related data science ecosystems; expert data carpentry skill</li><li>Engineering skills: you should enjoy writing quality code that runs on servers (we have a production platform to make this more accessible) and talks to SQL and NoSQL databases. Comfort at the command line and shell scripting.</li><li>Demonstrated ability to work independently, rapidly prototyping and testing new ideas</li><li>Drive to solve problems, meet deadlines, and build whatever is necessary along the way</li><li>Experience understanding the strengths and weaknesses of different modeling approaches and can effectively reason about when to apply different combinations and iterate</li><li>Demonstrated expert communication, facilitation, and collaboration skills to effectively present, explain, influence, and advise within cross-functional teams</li></ul>\n</ul>\n\n</div>\n</div><div><div>Roofstock is an equal opportunity employer. In keeping with the values of Roofstock, we make all employment decisions including hiring, evaluation, termination, promotional and training opportunities, without regard to race, religion, color, sex, age, national origin, ancestry, sexual orientation, physical handicap, mental disability, medical condition, disability, gender or identity or expression, pregnancy or pregnancy-related condition, marital status, height and/or weight.</div></div></div>"}