{"job title": "Data Scientist (Product)", "company": "Spotify", "city state": "– New York, NY, United States", "rating": "4.1", "job description": "We are looking for a Data Scientist to join the band and help drive a data-first culture across Spotify.\n<br><br>\nAs a Data Scientist, our mission is to turn terabytes of data into insights and get a deep understanding of how our people use our apps to impact the product, strategy and direction of Spotify. You will study user behavior, strategic initiatives, content, and new features and bring data and insights into every decision we make. Above all, your work will impact the way the world experiences music.\n<br><br>\n<strong>What you’ll do:</strong>\n<ul>\n<li>Perform analyses on large sets of data to extract actionable insights that will help drive product decisions</li><li>Communicate data-driven insights and recommendations to key stakeholders</li><li>Work closely with cross-functional teams of analysts, user researchers, product owners, designers, and engineers who are passionate about Spotify’s success</li><li>Work from our offices in New York</li> <li>Conduct A/B testing to drive iterative improvement through efficient experimentation</li>\n</ul>\n<strong>Who you are:</strong>\n<ul>\n<li>You have at least 4+years of experience in a similar data scientist and a degree in science, computer science, statistics, economics, mathematics, or similar quantitative discipline.</li><li>You have a deep understanding of numbers, as well as a strong business sense.</li><li>Ideally you have experience working in a product analytics or insights role and have conducted A/B tests</li><li>You have the technical competence to perform more advanced analytics:</li>\n\n<ul>\n<li>Coding skills for analytics and data extraction (SQL, R, Python, Pandas)</li><li>Data visualization (such as Tableau, Qlik, D3, ggplot)</li><li>Experience performing analysis with large datasets</li>\n</ul>\n\n<li>You are capable of tackling very loosely defined problems.</li><li>You are a communicative person that values building strong relationships with colleagues and stakeholders and have the ability to explain complex topics in simple terms.</li>\n</ul>\n\nWe are proud to foster a workplace free from discrimination. We strongly believe that diversity of experience, perspectives, and background will lead to a better environment for our employees and a better product for our users and our creators. This is something we value deeply and we encourage everyone to come be a part of changing the way the world listens to music.<br><br><strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}