{"job title": "Senior Data Engineer", "company": "The Meet Group", "city state": "– Greater Philadelphia Area", "rating": "2.6", "job description": "<div>As a Senior Data Engineer, you will build tools that collect, centralize and curate large volumes of data from various The Meet Group products at any scale. Working closely with our Data Scientists, you will also build and maintain real-time data pipelines to support machine learning and predictive scoring algorithms. As a subject matter expert in data architecture, you will mentor junior engineers and data scientists. Above all you should be passionate about working with huge data sets to answer critical business questions on a global scale.</div>Responsibilities\n\n<ul>\n<li>Lead the development and maintenance of a scalable data pipeline</li><li>Gather requirements, scope, architect, develop, build, release, and maintain data oriented projects for different parts of the organization, considering performance, stability, and an error-free operation</li><li>Identify and resolve pipeline issues and discover opportunities for improvement</li><li>Architect scalable and reliable data solutions to move data across systems from multiple products in nearly real time</li><li>Help evaluate new tools and technologies to keep technology stack at the cutting edge</li><li>Help debug critical issues in complex designs or coding schemes</li><li>Monitor existing metrics, analyze data, and partner with other internal teams to solve difficult problems creating a better customer experience.</li>\n</ul>\n\n<strong>Required Skills</strong>\n\n<ul>\n<li>BS in CS, or Masters Preferred with solid understanding of CS concepts such as common data structures and algorithms</li><li>Working with cross-functional teams and business customers is second nature to you</li><li>5+ years of experience building pipelines for processing large amounts of data</li><li>Proficiency with Python and other scripting languages</li><li>Solid experience with Hadoop including MapReduce, Hive and Spark</li><li>Experience with Kafka and RabbitMQ</li><li>Familiarity with Node.js, Java and Scala</li><li>Extensive hands on experience with AWS and cloud-based computing such as EC2, EMR, Kinesis and Redshift</li>\n</ul>\n\n<strong>Desired Skills</strong>\n\n<ul>\n<li>You have built a data pipeline and the infrastructure required to deploy machine learning algorithms and real-time analytics in low latency environments</li><li>Experience with Tableau, including report and dashboard development</li><li>Understanding of build systems, and other software configuration tools such as Jenkins and Rundeck</li><li>Experience with Postgres, Redis or Cassandra</li>\n</ul>\n\n<div><strong>About The Meet Group</strong></div><br>\n<div>The Meet Group, Inc. | NASDAQ: <strong>MEET</strong> | As the leading social network for meeting new people in the US, and the public market leader for social discovery, our mission is to improve our members lives by introducing them to fun and interesting people who share their passions, interests, and ideals. The Meet Group's products include MeetMe, Skout, Tagged, and hi5. The Meet Group is based in New Hope, PA with offices in Philadelphia and San Francisco.</div><br>\n<div>The Meet Group is an equal opportunity employer and a participating employer of Everify. We value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, or marital, veteran, or disability status.</div><br>\n<div>#v120417 ifwe meetme skout tagged hi5</div>"}