{"job title": "Data Scientist", "company": "Wyle Laboratories, Inc.", "city state": "– Houston, TX", "rating": "2.9", "job description": "Data Scientist (2400 NASA Parkway)\n<br><br>\nDescription\n<br><br>\nThe Data Scientist will play a critical role in contributing to the growth of the clinical evidence and outcomes. This position will coordinate with colleagues in Epidemiology, clinical programs, IT, and Human Research Program to lead outcomes, health economics, prospective/retrospective data, real world data, reported events &amp; outcomes and epidemiologic projects.\n<br><br>\n<strong>ESSENTIAL DUTIES &amp; RESPONSIBILITIES</strong>\n\n\n<ul>\n<li>Responsible for compliance with Safety, Health and Environmental plan; must be committed to a high standard of safety and be willing and able to comply with all safety laws and all of the Company's safety policies and rules and must be willing to report safety violations and potential safety violations to appropriate supervisory or management personnel</li>\n<li>Responsible for compliance with the Quality Assurance Plan, policies and procedures</li>\n<li>Must maintain regular and acceptable attendance level as determined by the Company</li>\n<li>Responsible for completing all assigned training</li>\n<li>Collaborate with epidemiologists, flight surgeons, clinical staff and thought leaders in the design and application of outcomes/health economics research in alignment with strategic goals.</li>\n<li>Support concept development, protocol design, and analytic plan development for outcomes research and discovery projects</li>\n<li>Develop and administer data collection instruments to support outcomes research projects</li>\n<li>Build and manage strategic internal and external relationships in order to expand existing outcomes projects, develop new opportunities, facilitate work and achieve business goals.</li>\n<li>In collaboration with key thought leaders across the Directorate, actively participate in the full continuum of care pathway development and on-going review/edit. Will actively promote outcomes projects that demonstrate the impact of care pathways and clinical programs on patients, providers, and health care economics.</li>\n<li>Collaborate with cross-functional colleagues to implement and evolve Data Systems Architecture to support analytic-based outcomes research and real-world-evidence efforts.</li>\n<li>Lead the development and implementation of machine learning algorithms and techniques to solve business problems and optimize member experiences.</li>\n<li>Work interactively with all functions of the company to help achieve the company's vision.</li>\n<li>Collaborate with Senior Management on strategic planning; provide effective leadership in assessments, report generation, and resolution facilitation of problems as needed.</li>\n<li>Interface with the broader analytics community including partners, vendors and academia to contribute to and benefit from research in the area of in-database advanced analytics.</li>\n<li>Maintain a high degree of awareness of the current scientific state and advances in relation to clinical research programs by attendance at relevant symposia, scientific meetings and workshops, and review of key journals.</li>\n<li>Maintain strictest confidentiality.</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\n<strong>EDUCATION/EXPERIENCE</strong>\n<br><br>\n<strong>REQUIRED:</strong>\n\n\n<ul>\n<li>MA/MS in Statistics, Computer Science, Mathematics, Machine Learning, Econometrics, Physics, Biostatistics or related Quantitative disciplines.</li>\n<li>15yrs overall experience with a minimum of 10yrs as a Data Scientist in the medical/healthcare industry</li>\n<li>A deep understanding of research methods, applied statistics, data mining, predictive modeling and forecasting in order to guide and support research that provides clear and actionable insights and strategic direction for business leaders.</li>\n<li>Hands-on experience working with/analyzing diverse data assets: EMR, medical claims, publicly available medical dictionaries, publicly available administrative datasets (population health surveys, hospital discharge data)</li>\n<li>Technical knowledge and capabilities in statistical packages like - SAS, R, STATA, SPSS, SQL</li>\n<li>Should have working knowledge of at least one data science and machine learning platform R, Python, Alpine Data, KNIME, Tensorflow</li>\n<li>Strong knowledge of statistical modeling, econometric, or data mining tools and methods to support clinical and epidemiological research.</li>\n<li>Familiarity with linear models (linear regression, generalized linear regression, logistical regression) and nonlinear modeling techniques such as decision trees.</li>\n</ul>\n\n<strong>SKILLS/TRAINING</strong>\n<br><br>\n<strong>REQUIRED :</strong>\n\n\n<ul>\n<li>Well-developed interpersonal skills; ability to develop and maintain collaborative clinical research relationships.</li>\n<li>Strong communication and presentation skills; ability to convey complex information to diverse audiences</li>\n<li>Advanced business analytic skills, problem solving and creative thinking skills</li>\n<li>Ability to think strategically across disciplines and projects</li>\n<li>Experience with medical and health care data science analysis is a plus</li>\n<li>Epidemiology, health economics and/or outcomes research in the context of a healthcare, academic, pharmaceutical or biotech company</li>\n</ul>\n\nKBR is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, disability, sex, sexual orientation, gender identity or expression, age, national origin, veteran status, genetic information, union status and/or beliefs, or any other characteristic protected by federal, state, or local law.\n<br><br>\nJob: Engineering Technology\n<br><br>\nPrimary Location: US-US-TX-Houston\n<br><br>\nReq ID: 1068894<br><br>SDL2017"}