{"job title": "Data Scientist", "company": "YourMechanic", "city state": "– Mountain View, CA", "rating": "3.4", "job description": "<ul>\n<li>Use Artificial Intelligence techniques to enable users to self-diagnose car problems and book accurate services.</li>\n<li>Enable accurate, instant pricing while accounting for vendor and operational variability.</li>\n<li>Optimize schedules and routes of mechanics to help them maximize their time utilization and earning potential.</li>\n<li>Apply Machine Learning algorithms to formulate customer and mechanic retention programs to maximize value of the marketplace.</li>\n<li>Build Business Intelligence through predictions around appointment completions, conversions with actionable insights for business.</li>\n<li>Enable the organization to make data-driven decisions by preparing and automating data reports and alerts.</li>\n</ul>\n\n<strong>Requirements</strong>\n\n\n<ul>\n<li>Extensive experience with SQL</li>\n<li>B.S. or M.S. in a quantitative field required. PhD in similar fields a plus.</li>\n<li>Extensive experience with Statistical/Machine Learning, NLP, Deep Learning</li>\n<li>Strong programming skills. Able to write algorithms needed for modeling and prediction that deals with advanced data structures.</li>\n<li>Follow Data Science literature and advancements. The most successful candidates possess the ability to apply cutting edge advancements in Data Science methodologies to relevant business problems.</li>\n</ul>\n\n<strong>Benefits</strong>\n\n\n<ul>\n<li>Competitive compensation</li>\n<li>Excellent medical, vision &amp; dental insurance</li>\n<li>1 mile from San Antonio CalTrain station</li>\n<li>401k, FSA, transit/carpool benefits</li>\n<li>Unlimited vacation days and 7 paid holidays</li>\n<li>Daily lunch program &amp; ample stock of snacks and beverages</li>\n<li>Car maintenance discount and free oil changes!</li>\n<li>Awesome team mates!</li>\n</ul>\n\nWe offer an opportunity to build something meaningful. Your work will redefine a massive industry ($220B a year), which is begging for disruption. You will also empower thousands of mechanics to live a better life. We're growing fast and offering the opportunity to build something that really matters and leave a legacy.\n<br><br>\nYourMechanic is backed by top tier investors like Andreessen Horowitz &amp; Softbank.\n<br><br>\nWe welcome international talent and sponsor H1B visas!<br><br>SDL2017"}