{"job title": "Data Scientist", "company": "Lockheed Martin", "city state": "– Fort Worth, Texas", "rating": "3.6", "job description": "<strong>Description:</strong> The individual selected for this position will function as both a practicing Data Scientist and an evangelist for advanced analytics techniques. Position responsibilities include collaboration with business stakeholders to identify business opportunities and needs to develop associated analytical models that deliver useful, actionable insights, or recommendations. Candidates can expect to participate in cross functional teams to address the problem at hand and identify new data driven business opportunities beyond the current business focus by combining existing and new data and help to institutionalize a data-driven analysis. Candidates should be comfortable identifying relevant data sources and applying a variety of tools and techniques to prepare and manipulate the data for analysis, as well as visualization and reporting techniques to present findings and recommendations. In addition to applied problem solving, the successful candidate will drive data architectures needed for sourcing and wider consumption and analysis. Candidates should be comfortable working together with Solution Architects to provide insights into current and future trends in these areas and to translate them into implications for Lockheed Martin including deployment of new technologies. This also includes giving advice on adequate quality, analysis, processing, privacy and security of internal and external data and help to improve our predictive and cognitive capabilities. Position requires self-motivated individuals combined with hands-on entrepreneurial spirit and exceptional drive, with the ability to work in a fast-paced multi-disciplinary environment.\n<br><br>\nLimited travel (less than 25%) will be required for this role.\n<br><br>\nWork location is required to be at a major Lockheed Martin EBS facility, and either Ft Worth, TX or Denver, CO is preferred.\n<br>\n<strong>Desired Skills:</strong> • Experience in applied machine learning and/or artificial intelligence\n\n\n<ul>\n<li>Experience in design and analysis of simulation experiments</li>\n<li>Experience in mathematical optimization</li>\n<li>Experience with SAP HANA, Hadoop (including Hive, Pig or Mahout) and other tools that facilitate the consumption, storage, and analysis of Big Data</li>\n<li>Domain knowledge of Aerospace &amp; Defense industry</li>\n<li>Experience designing efficient algorithms with programming languages and tools, such as Python, PHP, MATLAB, SAS, MapReduce, Java, Ruby, Clojure, for data manipulation and statistical analysis.</li>\n<li>Project Management experience planning and monitoring analytics projects using Agile/Scrum principles</li>\n</ul>\n\n<strong>BASIC QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>Demonstrated expertise in computer science and statistics.</li>\n<li>Strong working knowledge of basic statistical concepts such as point estimation, probability distributions, hypothesis tests, and how they can be applied.</li>\n<li>Ability to build predictive models, such as generalized linear, decision tree, and neural network models</li>\n<li>Ability to perform model selection and evaluation using criteria such as Root Mean Square Error, Receiver Operator Characteristics or Lift tests</li>\n<li>Strong understanding of business fundamentals and the ability to relate them to business processes</li>\n<li>Ability to utilize flexible analytical approaches that allows for results at varying levels of precision</li>\n<li>Demonstrated business and technical communication skills, including the communication of findings and their relevance in business terms</li>\n<li>Demonstrated strong proficiency in designing efficient algorithms and performing analysis with a numerical scripting language such as R, MATLAB or Python</li>\n<li>Experience with integration and cleansing of disparate or incomplete data sets to deliver insight</li>\n<li>Comfort manipulating and analyzing complex, high-volume, high-dimensionality data from varying sources combined with a strong passion for empirical research and for answering hard questions with data and data models</li>\n<li>Effective use of front end reporting and visualization tools that allow for findings to be effectively communicated to and applied by the business</li>\n<li>Ability to build strong relationships with stakeholders, customers, colleagues and suppliers and to communicate complex quantitative analysis in a clear, precise and actionable manner</li>\n</ul>\n\n<strong>Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.</strong>\n<br>\nAs a leading technology innovation company, Lockheed Martins vast team works with partners around the world to bring proven performance to our customers toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.\n<br><br>\nJoin us at Lockheed Martin, where were engineering a better tomorrow."}