{"job title": "Meteorological Scientist", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAre you interested in applying your research experience, science and engineering knowledge, and data science skills to world-changing problems? Are you interested in driving the development of methods, models and systems for understanding of weather event impacts on fulfillment and logistics? If so, then this is the job for you.<br> <br> The Fulfillment Execution Data Science (FEDS) team is responsible for developing tools and models for our fulfillment network to provide analytical-based insights to help improve operational processes. We are looking for motivated scientists with strong meteorological, modeling, and analysis skills to join our team. You will be responsible for utilizing meteorological information, including large scale numerical forecasts, to provide information on weather-related impacts applicable to our business. You will closely work with engineers, business stakeholders, research colleagues, and IT groups in incorporating the essential trade-offs within the models and take an active role in effectively communicating the recommendations to senior management. <br> <br> The qualified candidate will have a proven history of driving critical research and development and developing in-depth analytical understanding of weather impacts to systems. Tools will include understanding of ensemble methods and statistical analysis related to short to medium range weather forecasting.<br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>PhD in Atmospheric Sciences/Meteorology, Applied Mathematics, Statistics or related field, or equivalent experience.</li><li>Experience utilizing weather forecasts for real world decisions, including uncertainty analysis, and leveraging such models to provide guidance for strategic and tactical business decision making.</li><li>Detailed knowledge of large-scale numerical weather forecast models.</li><li>Familiarity with application of statistics in meteorology including ensemble methods.</li><li>Project management experience working with tech and other cross-functional teams.</li><li>Knowledge of tools for large-scale data systems and the ability to manipulate data (e.g. SQL, Python, or Perl).<br></li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Deep understanding of current weather forecasting techniques at varying spatial and temporal scales.</li><li>Experience prototyping and developing software in traditional programming languages (C++/ Java/Python/Perl.</li><li>Experience implementing models and analysis tools through the use of high-level modeling languages (e.g. R, Julia, Matlab).</li><li>Excellent written and verbal communication skills with both technical and business people.</li><li>Strong problem solving ability and dealing with ambiguity.<br></li></ul> <br>BENEFITS<br><ul><li>The rare opportunity to shape the future of supply-chain execution; to change the world by optimizing and reinventing transportation, fulfillment and logistics on a global scale.</li><li>The opportunity to work with bright, resourceful co-workers in a fun office environment.</li><li>A choice of multiple medical plans, designed to meet your individual needs + Dental \\&amp; Vision.</li><li>401(k) savings plan (+company match.) Company-paid basic life, accident and low-cost short/long-term disability plans. Health-care and dependent-care flexible spending account.</li><li>At Amazon, employees have the opportunity to become owners of the Company. We want employees to think like owners, and awarding equity provides an ownership opportunity to our employees. Eligible Amazon employees receive Amazon Restricted Stock Units.</li></ul><br>Amazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation<br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}