{"job title": "Principal Scientist", "company": "Amgen Inc", "city state": "– Thousand Oaks, California", "rating": "3.7", "job description": "Amgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.\n<br><br>\nAmgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve peoples lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the worlds leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.\n<br><br>\nThe Principal Scientist will be responsible for the development and implementation of the modeling and simulation strategies and activities for Amgen clinical development candidates across multiple novel modalities including T-cell engagers, cellular and nucleic acid based therapies in addition to small molecule and monoclonal antibodies.\n<br><br>\nThe Clinical Pharmacology, Modeling &amp; Simulation Department at Amgen is seeking a Principal Scientist, Modeling and Simulation.\n<br><br>\nResponsibilities:\n<br><br>\nConducting PK/PD and exposure-response analyses of data from early to late phase clinical studies using pharmacostatistical and relevant state of the art modeling and simulation techniques\n<br><br>\nPerforming meta-analysis using proprietary and/or literature data\n<br><br>\nParticipating in cross-functional project teams and providing scientific input for dose selection for early and late stage clinical study designs using quantitative methods\n<br><br>\nContributing to clinical pharmacology plans by establishing and implementing high impact modeling and simulation strategy for clinical development candidates\n<br><br>\nAuthoring PK/PD reports and contributing to summary documents for regulatory submissions\n<br><br>\nBasic Qualifications:\n<br><br>\nDoctorate degree and 3 years of modeling &amp; simulation scientist experience\n<br>\n<strong>OR</strong>\n<br>\nMasters degree and 6 years of modeling &amp; simulation scientist experience\n<br>\n<strong>OR</strong>\n<br>\nBachelors degree and 8 years of modeling &amp; simulation scientist experience\n<br><br>\nPreferred Qualifications:\n<br><br>\nPhD with 8+ years of experience as modeling &amp; simulation scientist in applied (bio)statistics, (bio)engineering, applied biomathematics/biophysics or related fields with equivalent professional degrees\n<br><br>\n8+ years of experience as modeling &amp; simulation scientist in the biotechnology/ pharmaceutical industry\n<br><br>\nExperience in analyzing pharmacokinetic, efficacy and safety data from clinical trials using advanced pharmacometric or statistical modeling methodologies and in conducting clinical trial simulations to assist study design\n<br><br>\nExperience in binary and categorical data analyses, time-to-event (hazard) models, Poisson models, logistic regression, MCMC and Bayesian methods as applied to exposure-response analyses and Population PK and PKPD analysis\n<br><br>\nExperience in designing strategic integrated modeling simulation plans in support of development of small molecule and/or protein therapeutics\n<br><br>\nExperience in regulatory filings (NDA/BLA) and responding to regulatory agency questions and knowledge of global regulatory requirements and guidance on quantitative analyses\n<br><br>\nExpertise in modeling software (e.g. NONMEM, R, SAS, STAN, MATLAB)\n<br><br>\nExcellent interpersonal, verbal and written communication skills and the ability to function in a highly matrixed team environment\n<br><br>\nPrevious record of scientific contributions through peer-reviewed articles and external presentations<br><br>Amgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status."}