{"job title": "Tumor Model Scientist", "company": "Atreca", "city state": "– Redwood City, CA", "rating": "4.7", "job description": "Atreca is a dynamic biotechnology company located in Redwood City, California, whose Immune Repertoire Capture TM technology enables the discovery and development of novel cancer immunotherapeutics. Atreca is looking for a talented and self-motivated Scientist to join its research department.\n<br><br>\nThe Scientist II will apply his/her expertise in preclinical rodent oncology models and tumor immunology to Atreca's oncology preclinical research program. In this role, the Scientist II will oversee and perform multiple efficacy studies in mouse tumor models to screen for immuno­ oncology therapeutic leads. The successful candidate will also have the opportunity to participate in mechanism of action studies to characterize present and future antibody leads. As part of a larger multi-disciplinary team the successful candidate will report results and provide input in decision making for both in vitro and in vivo pharmacology.\n<br><br>\nDuties and Responsibilities:\n\n<ul>\n<li>Develop, optimize, and validate in vivo mouse tumor models for use in Atreca's oncology lead identification program</li> \n\n<li>Design, conduct and interpret preclinical efficacy studies using mouse tumor models to test activity of drug candidates</li> \n\n<li>Design and execute in vivo strategies for testing antibody mechanism of action</li>\n\n<li>Manage research associates</li> \n\n<li>Participate with managing research activities at CRO's</li> \n\n<li>Coordinate activities with functional and project team members, interface cross-functionally with other departments</li> \n</ul>\n\n<div>Requirements:<ul>\n<li>PhD with postdoctoral experience in Cancer biology, Immunology or related field</li> \n\n<li>2-4 years of experience testing in vivo preclinical anti-tumor drug candidates in mouse models. Experience in industry is preferred.</li> \n\n<li>Demonstrated proficiency with in vivo efficacy mouse models, including mouse syngeneic and/or xenograft models. Hands-on experience with tumor cell inoculation, animal dosing, tissue collection, tumor measurements and data recording</li> \n\n<li>Experience managing reports in a laboratory setting is required</li> \n\n<li>Must demonstrate the ability to work independently and as well to work in small teams</li> \n\n<li>Proficiency in animal welfare and overall knowledge of federal guidelines for animal care and use</li> \n</ul>\n\n</div>"}