{"job title": "Associate Director, Clinical Scientist, Severe Genetic Diseases", "company": "bluebird bio", "city state": "– Cambridge, MA", "rating": "4.4", "job description": "<p>Join bluebird bio's talented and collaborative team by contributing to the overall success of our novel gene therapy approach. Reporting to the VP, Clinical Research and Development, you will have a key role in drug development in the clinical research and development team. You will work closely with other members of the medical research and corporate development group (medical, statistician, clinical pharmacologist, translational research, operations, and product/portfolio management) to support planning and investigations that deliver the development strategies for several clinical programs. The Clinical Scientist contributes to the product and trial development strategy via clinical asset timeline and protocol development, study design and clinical study execution. May also interface with corporate partners in alliance management activities to support integrated and productive relationships.</p>\n<p> </p>\n<p>The Clinical Scientist is responsible for analyzing and interpreting study data across programs, individual trial and patient level and translating clinical data across and within the programs and studies, ensuring that all studies are conducted with the highest level of ethical and safety standards and are in compliance with GCP and all regulatory policies. </p>\n<p> </p>\n<p> </p>\n<p><strong>About the role:</strong></p>\n<p> </p>\n<ul>\n<li>Lead the clinical study protocol development process by translating the strategy and approved concept into executable, efficient clinical protocols and related documents.</li>\n<li>In collaboration with biostatistics, clinical pharmacology, translational research, clinical operations and data management, contributes to the development of the plan to execute on trial design.</li>\n<li>Collaborate with the clinical development on the review, analysis, and interpretation of study results and assures appropriate data review and accurate data reporting.</li>\n<li>Identify study issues and program issues by reviewing and monitoring of emerging clinical data related to safety and efficacy. Develops sound, strategic solutions to issues and collaborates with the clinical team to ensure issue resolution.</li>\n<li>Works closely with the medical monitor to assure he/she is informed of pertinent study information, including but not limited to safety and efficacy data.</li>\n<li>Provide scientific input to the efficacy and safety endpoint objectives of a trial and assure efficient and innovative clinical study designs</li>\n<li>Provide clinical oversight of the study execution in collaboration with all members of the clinical program/study team.</li>\n<li>Support the VP Clinical Development with the development of program documents, including the clinical sections of various regulatory documents such as IND, clinical study reports, investigator brochures, annual reports and updates, and clinical sections of regulatory submissions to support product approvals.</li>\n<li>Develop presentations and communicates study data results to colleagues internally and to external audiences including investigators at sponsor meetings or general audiences at scientific conferences.</li>\n<li>Maintain current knowledge of the external environment to ensure scientific innovations are considered and/or incorporated into clinical trial development strategy.</li>\n<li>Work as part of a highly matrixed organization to support the operational effectiveness of study execution.</li>\n<li>Travel as necessary to national and international conferences and study sites.</li>\n</ul>\n<p> </p>\n<p><strong> </strong></p>\n<p><strong>About you:</strong></p>\n<p><u> </u></p>\n<ul>\n<li>NP, MS, PhD or PharmD, or equivalent with clinical research experience. Advanced degree candidates preferred.</li>\n<li>At least 5 years of clinical, technical/operational experience in planning, executing, reporting and publishing clinical studies.</li>\n<li>Strong analytical scientific background with industry clinical development experience in hematology or rare genetic diseases</li>\n<li>Candidates must possess effective communication and influencing skills.</li>\n<li>Fluency in the English language, both written and verbal.</li>\n<li>Thorough understanding of the drug development process from pre-IND through registration and post-registration required</li>\n<li>Broad understanding of functional areas of drug development, including preclinical, regulatory, pharmacovigilance, drug supply, data sciences (data management, biostatistics, programming), and clinical operations (including site selection, study start-up, study conduct, and finalization).</li>\n<li>Ability to understand, interpret and communicate clinical information including literature reviews, competitive intelligence, and changing treatment paradigms in order to apply knowledge to support a robust clinical development strategy.</li>\n<li>Understanding of trial design and statistics in order to apply knowledge to the design of clinical protocols</li>\n<li>Ability to interpret, analyze, and present clinical data in order to inform decision-making and set clinical strategy.</li>\n<li>Critical traits for success include strategic and proactive thinking, strong scientific and analytical skills, decisiveness and the ability to perform as a respected team member and leader.</li>\n<li>Ability to work effectively in a collaborative team environment where results are achieved through influence, cooperation, and the incorporation of multiple points of view</li>\n<li>Independently motivated, detail oriented and good problem solving ability</li>\n<li>Excellent organizational skills, with an ability to embrace change and multi-task in an extremely fast-paced environment </li>\n<li>Excellent communications skills and ability to influence across multiple functions</li>\n<li>Be ready to embrace the principles of the bluebird bio culture: <em>b colorful, b cooperative, and b yourself</em></li>\n</ul>\n<p> </p>\n<p> </p>\n<p> </p>"}