{"job title": "Junior Data Analyst", "company": "compstak.com", "city state": "– New York, NY, US", "rating": "4.6", "job description": "<div>\nCompStak is a venture backed tech startup that is revolutionizing the commercial real estate industry. Weve built an innovative platform that enables professionals to trade data they have in exchange for the data they need about deals happening in any given market in the U.S.</div> <br>\n<div>\nWe are looking for an aspiring or current data analyst to help us improve our data pipeline in order to ensure high quality and better scalability. This includes data extraction, preprocessing, augmentation, and verification projects. Doing this will be providing real estate professionals with access to best-in-class data and close to real time deep market insights.</div><br>\n\n<div><strong>Your Mission:</strong></div><ul>\n<li>\nOversee data extraction processes</li>\n<li>\nPreprocess and map out complex crowdsourced data</li>\n<li>\nAugment and verify the processed data to ensure integrity and quality</li>\n<li>\nAnalyze trends and identify erroneous data</li>\n<li>\nCreate ad hoc reports for our biz dev and sales teams</li>\n<li>\nSupport and learn from our team of data scientists and engineers</li>\n<li>\nAsk questions, learn new skills, and enjoy your work</li>\n</ul>\n\n<div><strong>Your Knowledge and Toolset:</strong></div><ul>\n<li>\nBA/BS required</li>\n<li>\n2+ years of experience in a professional role</li>\n<li>\nHighly proficient in Excel</li>\n<li>\nWorking knowledge of relational and NoSQL datastores</li>\n<li>\nWorking knowledge of Python or other scripting languages</li>\n<li>\nExperience with data wrangling and analysis</li>\n<li>\nInterest in Machine Learning</li>\n</ul><br>\n\n<div><strong>Your Personality:</strong></div><ul>\n<li>\nSelf motivated</li>\n<li>\nHigh level of integrity</li>\n<li>\nDesire to learn</li> \n<li>\nAttention to detail and willingness to ask questions</li>\n<li>\nGood time management</li>\n</ul>\n\n<div><strong>Benefits:</strong></div><ul>\n<li>\nBe a part of a fast growing tech company</li> \n<li>\nFully stocked fridge and snack pantry</li>\n<li>\nCatered lunch on Fridays and monthly company events</li>\n<li>\nDog friendly office</li>\n</ul>\n\n<br>\n<div>\nAn Equal Opportunity Employer -----M/F/D/V</div><br>"}