{"job title": "Computer Scientist", "company": "Department Of Transportation", "city state": "– Washington, DC", "rating": "3.9", "job description": "<ul>\n<li>Videos</li>\n<li>Duties</li>\n</ul>\n\nHelpDuties Summary\n<br><br>\nThe incumbent serves as a Computer Scientist in the FAA Office of Airports (ARP) Airport Safety and Standards, Airport Engineering Division, AAS-100, assigned to the Airports Geographic Information System (AGIS) program.\n<br><br>\nLearn more about this agency\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nWorking in conjunction with other AGIS team members, Information and Technology Services (AIT), AGIS contract support and software vendors, the incumbent will be responsible for managing software design/development and computer architecture requirements in support of AGIS.\n<br><br>\nCoordinates with contract support regarding the infrastructure requirements for the collection, preparation, and/or editing of aeronautical and geospatial data.\n<br><br>\nCreates/manages documentation using collaboration and project tools such as Jira, etc..\n<br><br>\nWorks with internal/external AGIS users to identify and maintain system requirements.\n<br><br>\nWorks with contract support to convert validated requirements into system software performance requirements and developing required code; establishing contract software requirements and executing them accordingly, ensuring AGIS software development is accomplished in accordance with applicable software requirements and practices (i.e.PostgreSQL).\n<br><br>\nPerforms cost and schedule analysis for all software development and information technology license requirements; including software and hardware licensing agreements.\n<br><br>\nManages the AGIS software development requirements analysis, design, coding, test/evaluation, and implementation efforts.\n<br><br>\nProvides technical guidance and staff assistance as requested and communicates to management to keep abreast of new and emerging technologies, including current and applicable DOT/FAA cyber security policies and cloud services.\n<br><br>\nCollaborates with AIT on mitigating high, medium and low levels of risk regarding system security (i.e. POA&amp;Ms).\n<br><br>\nAssists in the Security Assessment and Accreditation (A&amp;A) activities. Review and assist in developing required A&amp;A documentation. Attend and support Airports Engineering programs during an A&amp;A review.\n<br><br>\nManages and tracks all Airport Engineering software licenses and renewal dates.\n<br><br>\nAssists in developing annual budget request for all automated Airports Engineering requirements and works in the best interest of the division to reduce operational costs.\n<br><br>\nAssists in the development and oversight of the AGIS service level agreement with AIT.\n<br><br>\nTravel Required\n<br><br>\nNot required - The job does not require any travel.\n<br><br>\nSupervisory status\n<br><br>\nNo\n<br><br>\nPromotion Potential\n<br><br>\n<strong>NA</strong>\n\n\n<ul>\n<li>Job family (Series)</li>\n</ul>\n\n1550 Computer Science\n\n\n<ul>\n<li>Requirements</li>\n</ul>\n\nHelpRequirements Conditions of Employment\n\n\n<ul>\n<li>US Citizenship is required.</li>\n<li>Selective Service Registration is required for males born after 12/31/1959.</li>\n<li>This position has a positive education requirement. Transcript(s) required.</li>\n<li>Form DD 214 is required to claim Veteran's Preference</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\nTo qualify for this position at the FV-J level you must demonstrate in your application that you possess at least one year (52 weeks) of SPECIALIZED EXPERIENCE equivalent to FV-I or GS-13 in the Federal Service. SPECIALIZED EXPERIENCE is experience that has equipped you with the particular knowledge, skills, and abilities to perform successfully the duties of the position. SPECIALIZED EXPERIENCE includes:\n\n\n<ul>\n<li>Experience in software design and development; OR</li>\n<li>Applying information system principles and practices to automation, contractual, and procurement elements of a major NAS program.</li>\n</ul>\n\n<strong>Education</strong>\n<br><br>\nThis position has a positive education requirement: Applicants must submit a copy of their college or university transcripts(s) and certificates by the closing date of announcement to verify qualifications. If selected, an official transcript will be required prior to appointment. You may upload these documents with your application in USAJOBS or fax it to fax number provided in the announcement (please include announcement number on each page).\n<br><br>\nFailure to do so will result in loss of consideration.\n<br><br>\nSchools must be accredited by an accrediting institution recognized by the U.S. Department of Education. Accreditation may be verified at the following website: www.ed.gov/admins/finaid/accred/index.html.\n<br><br>\nForeign education must be evaluated by a private professional organization specializing in interpretation of foreign education credentials or an accredited U.S. educational institution in terms of equivalence to a degree acquired at an American college or university. A copy of the evaluation results must be included, otherwise your foreign education will not be considered.\n<br><br>\n<strong>Basic Requirements:</strong>\n<br><br>\nBachelor's degree in computer science or bachelor's degree with 30 semester hours in a combination of mathematics, statistics, and computer science. At least 15 of the 30 semester hours must have included any combination of statistics and mathematics that included differential and integral calculus. All academic degrees and course work must be from accredited or pre-accredited institutions.\n<br><br>\n<strong>Evaluation of Education:</strong>\n<br><br>\nApplicants should have sufficient knowledge to understand the fundamental concepts and techniques of computer science. Courses designed to provide an introduction to computer science techniques and methodologies, to problems of system design, and to other specialized fields are acceptable. Courses or experience in teaching elementary, business, or shop mathematics are not acceptable.\n<br><br>\nIf you are a current or former Federal employee, and you currently hold or previously held a position classified in the 1550 occupational series, you are not required to submit a college transcript provided you upload a copy of the SF-50 (Notification of Personnel Action) verifying this information.\n<br><br>\nPreview Job Questionnaire\n<br><br>\nMake sure your resume includes detailed information to support your qualifications and answers to the job questionnaire."}