{"job title": "Scientist ,Toxicology", "company": "Heron Therapeutics", "city state": "– San Diego, CA", "rating": "3.1", "job description": "<strong><br><br>JOB DESCRIPTION:</strong>\n<br>\nThe successful candidate will provide support for the non-clinical components for clinical development\n<br>\nprograms and participate in the preparation of regulatory submissions including Investigator Brochures,\n<br>\nINDs, and NDAs. Although the major function of this position will be toxicology the individual will\n<br>\nperform cross-functional activities within the department including pharmacology, bioanalytical and PK\n<br>\nroles.\n<br>\n<strong>ESSENTIAL DUTIES AND RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>Assists in the planning, designs, analyzes, interpretation and reporting of data from non-clinical</li>\n</ul>\n\npharmacology, PK and toxicology studies.\n\n\n<ul>\n<li>Prepare necessary documentation and report study results for IND/NDA submissions.</li>\n<li>Coordinate activities and provide support across the Translational Sciences group (Toxicology,</li>\n</ul>\n\nPK, bioanalytical sciences), and with other groups such as pharmaceutical sciences and the rest\n<br>\nof the organization (clinical operations).\n\n\n<ul>\n<li>Coordinates with CRO regarding shipping of test article and study related samples</li>\n<li>Receive study updates, data and documents, track and maintain study specific milestones</li>\n<li>Ensure proper following of FDA guidelines and internal SOPs for all studies.</li>\n<li>Creation of various data tables (e.g., CTD) and documents for regulatory submissions (e.g. IND,</li>\n</ul>\n\nIB) and perform QC review of regulatory documents\n\n\n<ul>\n<li>Other duties as may be necessary.</li>\n</ul>\n\n<strong>REQUIREMENTS:</strong>\n\n\n<ul>\n<li>Bachelor Degree (B.S.) in Biological Sciences or equivalent, with a minimum of 5 years’</li>\n</ul>\n\nexperience in pharmaceutical research environment.\n\n\n<ul>\n<li>Experience working with GLP regulations is a requirement.</li>\n<li>Experience in the conduct of nonclinical studies to support both drug discovery and drug</li>\n</ul>\n\ndevelopment activities.\n\n\n<ul>\n<li>Strong written and verbal communication skills are a must.</li>\n<li>Experience working with animals in a scientific setting.</li>\n<li>Team-oriented with excellent communication and interpersonal skills.</li>\n<li>Flexibility to work in a fast-paced environment. Ability to manage multiple and diverse issues.</li>\n<li>Ability to “roll up your sleeves” and individually contribute results in a team-based environment.</li>\n<li>Experience authoring of documents, reports and presentations.</li>\n<li>Basic knowledge of FDA and ICH nonclinical guidelines and the ability to interpret and apply</li>\n</ul>\n\napplicable regulations."}