{"job title": "Data Analyst", "company": "ICF", "city state": "– Quantico, VA", "rating": "3.6", "job description": "Working at ICF\n<br><br>\nWorking at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you?re seeking to make a difference in the world, visit www.icf.com/careers to find your next career. ICF?together for tomorrow.\n<br><br>\nData Analyst You will work with clients, subject matter experts, and team members, in a collaborative, fast-paced, and growing organization. As a Data Analyst, you will conduct data mining, perform basic and advanced analytics, and leverage research best practices to support operational decision making. You will play a critical role in helping Defense Security Services use complex data to better understand security risks and potential solutions.\n\n\n<ul>\n<li>**This position is located at the client site in Quantico, VA.</li>\n</ul>\n\n<strong>What you'll be doing:</strong>\n<br><br>\n+ Independently performing a variety of qualitative and quantitative analyses related to risk management, industrial security operations, and program administration.\n<br><br>\n+ Retrieving and interpreting a large volume of complex data from a variety of sources, analyzing results using statistical techniques and providing ongoing reports.\n<br><br>\n+ Identifying root causes and proposing solutions.\n<br><br>\n+ Developing and implementing data collection systems and other strategies that optimize efficiency and data quality.\n<br><br>\n+ Evaluating statistical information to determine risk or non-compliance.\n<br><br>\n+ Conduct data mapping and extract, transform, load (ETL) activities.\n<br><br>\n<strong>Required Skills and Experience:</strong>\n<br><br>\n+ Bachelor?s degree in math, statistics, operations research, economics, or a related quantitative discipline.\n<br><br>\n+ 2+ years of experience with statistical software packages (e.g., SAS, SPSS, R, or STATA).\n<br><br>\n+ 2+ years of experience conducting quantitative analysis (e.g., regression, time series analyses, ANOVA, techniques for dealing with missing data).\n<br><br>\n+ 2+ years of experience conducting research and design of business systems and processes.\n<br><br>\n+ Active clearance.\n<br><br>\n<strong>Desired Skills and Experience:</strong>\n<br><br>\n+ Experience with methods from operations research (e.g., decision and risk analysis, Monte Carlo simulation, sensitivity analysis, and optimization).\n<br><br>\n+ Ability to communicate complex quantitative analysis in a clear, precise, and actionable manner.\n<br><br>\n+ Skill in managing multiple projects and stakeholder interests with timeliness, accuracy, and quality.\n<br><br>\nICF offers an excellent benefits package, an award winning talent development program, and fosters a highly skilled, energized and empowered workforce.\n<br><br>\nICF is an equal opportunity employer that values diversity at all levels. (EOE ? Minorities/Females/ Protected Veterans Status/Disability Status/Sexual Orientation/Gender Identity)\n<br><br>\nPay Transparency Statement: For more information, please click here: https://www.dol.gov/ofccp/pdf/pay-transp_formattedESQA508c.pdf\n<br><br>\nFor a listing of other career opportunities at ICF, please visit our Career Center at www.icfi.com/careers\n<br><br>\nVirginia Client Office (VA88)\n<br><br>\nAbout ICFICF (NASDAQ:ICFI) is a global consulting and technology services provider with more than 5,000 professionals focused on making big things possible for our clients. We are business analysts, policy specialists, technologists, researchers, digital strategists, social scientists and creatives. Since 1969, government and commercial clients have worked with ICF to overcome their toughest challenges on issues that matter profoundly to their success. Come engage with us at icf.com."}