{"job title": "Environmental Scientist", "company": "ICF", "city state": "– Fairfax, VA", "rating": "3.6", "job description": "Working at ICF\n<br><br>\nWorking at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you?re seeking to make a difference in the world, visit www.icf.com/careers to find your next career. ICF?together for tomorrow.\n<br><br>\nWould you like to apply your education and experience to help government agencies improve the way they develop and implement regulations, policies and programs? Consider joining ICF. We have a team of professionals currently supporting the design, implementation, and improvement of federal and private sector programs. That team is seeking recent college graduates to join them About the team? We supports public- and private-sector clients in the full range of economic and policy activities. We estimate costs and benefits of regulations, policies, and programs as well as evaluate program effectiveness. We work with virtually all federal agencies as well as state governments and non-governmental organizations. Key clients include the Environmental Protection Agency, Department of Transportation, Department of Labor, Department of Energy, Department of Homeland Security, and Department of the Interior, as well as state and local agencies, and private-sector clients. What you?ll be doing?. You'll become part of a team participating in short- and long-term projects for federal and state government and other clients who develop and implement policies and regulations affecting water resources and the transportation, the environment, energy, labor markets, and other priorities. You'll also assist in the creation of written documents that convey key analytic findings for distribution to internal and external clients. Work from this team will inform policy decisions by federal, state and local governments.What you?ll do?- Collecting and analyzing data- Reviewing literature and other technical reports- Solving quantitative and qualitative problems- Developing recommendations- Drafting reports and presentations- Operating economic models- Interacting with clients What you?ll need? - Bachelor's degree in natural or physical science, environmental management, economics, engineering, government, political science, public policy, urban planning, or related subjects- Minimum GPA of 3.0 Professional Skills we?re looking for? - Strong analytical and organizational skills- Ability to prioritize and work on multiple projects under strict deadlines in a fast-paced environment- Excellent written and oral communications skills- Strong quantitative and/or modeling skills, including MS Excel capabilities To apply, please submit your resume, transcript, &amp; writing sample. About ICF ICF (NASDAQ:ICFI) is a global consulting and technology services provider with more than 5,000 professionals focused on making big things possible for our clients. We are business analysts, policy specialists, technologists, researchers, digital strategists, social scientists and creatives.Since 1969, government and commercial clients have worked with ICF to overcome their toughest challenges on issues that matter profoundly to their success.ICF offers an excellent benefits package, an award winning talent development program, and fosters a highly skilled, energized and empowered workforce. ICF is an equal opportunity employer that values diversity at all levels. (EOE ? Minorities/Females/ Protected Veterans Status/Disability Status/Sexual Orientation/Gender Identity) Pay Transparency Statement: For more information, please click here: https://www.dol.gov/ofccp/pdf/pay-transp_formattedESQA508c.pdf\n<br><br>\nFairfax, VA (VA01)\n<br><br>\nAbout ICFICF (NASDAQ:ICFI) is a global consulting and technology services provider with more than 5,000 professionals focused on making big things possible for our clients. We are business analysts, policy specialists, technologists, researchers, digital strategists, social scientists and creatives. Since 1969, government and commercial clients have worked with ICF to overcome their toughest challenges on issues that matter profoundly to their success. Come engage with us at icf.com."}