{"job title": "Staff Scientist Consumables Development", "company": "Illumina", "city state": "– San Diego, CA", "rating": "4.2", "job description": "<strong><br><br>Position Summary:</strong>\n<br>\nAs a Staff Scientist in protein characterization you will collaboratively drive the design and development of high quality consumable reagents for Illumina sequencing platforms. As Illumina technology enters the diagnostics space, you will be a key contributor within multidisciplinary teams supporting this transition by striving to enhance performance and robustness across our entire reagent platform. You will leverage your expertise in analytical methods for protein characterization to determine the critical parameters in protein function, stability, and performance.\n<br><br>\nThis process will include technical deep-dives into new applications, driving proof of concept (POC) studies, understanding critical parameters that would impact definition of minimally viable products (MVP), internally and in collaboration with project stakeholders. You will also serve as a liaison on product development projects stemming from the most successful ideas and will play an active role in defining technology roadmaps.\n<br><br>\nThe role will require you to work in a highly matrixed setting, primarily with internal collaborators in the US and the UK. It is expected that you will have proficient interpersonal, verbal, and written communication skills in addition to having a quality-driven and results-oriented mindset. To be successful in this role, you will be the kind of person who enjoys getting out of your comfort zone; feeling equally comfortable interacting with illumina personnel at all levels.\n<br><br>\nResponsibilities\n<br><br>\nEngage in cross-functional technical collaboration with Protein Engineering, Surface Chemistry, Protein Production, Reagent Manufacturing, Operations and QA/QC teams to accelerate the development of novel consumable reagents used in Illumina’s NGS platforms\n<br>\nBe a strong individual contributor and an effective leader\n<br>\nIdentify novel analytical tools for protein characterization and demonstrate their predictive value for reagent performance and quality\n<br>\nProvide technical leadership in the transfer of new processes and products\n<br>\nDevise controlled experiments (including DoE, Gauge R&amp;R) to optimize reagent formulation to achieve enhanced levels of stability, robustness, and performance\n<br>\nEmploy and explain statistical methods to drive decisions\n<br>\nPartner with stakeholders, design experiments, drive design and technical reviews, recommend appropriate external partners and meet product development schedules in a fast-paced product development environment, for several concurrent projects\n<br>\nLead focused matrixed teams of research associates, scientists across departments to deliver on stakeholder-focused projects\n<br>\nProvide line management for a growing team of characterization-focused scientists working across various projects\n<br>\nServe as a subject matter expert in idea reviews and strategic meetings\n<br>\nPerform data analysis; prepare detailed reports and stakeholder-facing project status updates for cross-functional technical teams or senior leadership\n<br>\nManage goals within defined target timeframes and make decisions regarding the goals and progress of small project teams\n<br>\nPerform resource and budget planning in collaboration with finance\n<br>\nSolve complex technology and development challenges\n<br><br>\nSkills, Education &amp; Experience:\n<br><br>\nHighly motivated, curious individual with the proven ability to think innovatively toward solving problems in fast-paced research and/or product development environment\n<br>\nFlexible and open to new opportunities and changing priorities\n<br>\n7+ years of product development experience in the life science or medical diagnostics space, with focus on characterization\n<br>\nExperience working in a similar role in at least one biotechnology or biomedical device company is required. Experience with multiple companies is highly desired\n<br>\nExperience with protein biochemistry, protein characterization and in-depth knowledge of contemporary biophysical techniques is required. Experience with multiple technologies is highly desired\n<br>\nExperience in optimization of protein formulation for increased performance and enhanced stability\n<br>\nAn outstanding publication record, patent history, product launch history, or other evidence of scientific excellence and collaborations are required\n<br>\nAbility to rationally design experiments, perform data analysis for others, and have a demonstrated experience driving technical results-oriented decisions as the leader or part of a team is required\n<br>\nExcellent communication, presentation, and people leadership skills are required to drive internal projects goals to timely completion\n<br>\nExperience of managing across sites and time zones is a plus\n<br>\nExperience in GDP or GLP including working in ISO 13485 environment is a plus\n<br>\nExperience in proteomics with a focus in mass spectrometry a plus\n<br>\nKnowledge of development operations processes and software, such as Confluence, JAMA, Microsoft Project, SAP or other document control systems is a plus\n<br>\nStrong connections with the academic, clinical, or biotechnology communities are highly desired\n<br>\nStatistical and scripting experience is a strong plus\n<br>\nCore team leadership/project management experience is a strong plus\n<br>\nGeneral understanding of business and finance concepts is a plus\n<br>\nA good understanding of the principles of next-generation sequencing is a plus\n<br>\nLocation in San Diego headquarters is required\n<br>\nEducation\n<br><br>\nPhD degree in biochemistry, biophysics, or other related discipline"}