{"job title": "Computer Scientist", "company": "Jacobs", "city state": "– Falls Church", "rating": "3.4", "job description": "Jacobs is one of the world’s largest and most diverse providers of full-spectrum technical, professional and construction services for industrial, commercial and government organizations globally. The company employs over 74,000 people and operates in more than 40 countries around the world.\n<br><br>\nJacobs Technology is actively searching for qualified candidates for this opening. Duties include:\n<ul>\n<li>Conduct operationally relevant assessments of Combatant Command and Service cybersecurity featuring representative cyber threads to evaluate how realistic cyber conditions affect their ability to execute their assigned missions.</li><li>Provide timely feedback to Combatant Command, Service, and Department of Defense leadership on identified problems, associated mission effects and successful defensive strategies.</li><li>Share relevant information with and support those organizations authorized and able to provide remediation and mitigation assistance and to verify remediation and mitigation activit4es are effective</li><li>Report overarching cybersecurity observations and trends in the Director’s Annual Report to Congress</li><li>Evaluate and review Defense Agencies Initiative (DAI) is adherence to all current policies and instructions including DODI 8330.01, DODI 5000.75, and the JITC Interoperability Process Guide Version 2.0 as they apply to the Net Ready Key Performance Parameters (NR KPP) compliance and interoperability certification for Department of Defense (DoD) Information Technology/National Security Strategy (IT/NSS) Defense Business Systems (DBS) programs.</li><li>Provide guidance and recommendations in support of the DAI Department of Defense Architecture Framework (DODAF) architecture products development and criteria validation.</li><li>Perform reviews and validation to verify interoperability data requirements and criteria are testable.</li><li>Collect, analyze, evaluate and report results of DAI data on a monthly basis and during major test cycle events.</li><li>Develop Requirements Analysis Framework for Test (RAFT). RAFT includes Integrated Architectural Traceability Matrix (IATM), Evaluation Framework (EF), and Data Management and Analysis Plan (DMAP).</li> <li>Develop Joint Interoperability Evaluation Plan (JIEP).</li><li>Develop Joint Interoperability Certification Letter and Summary Reports</li><li>Test Observation. Observe User Acceptance Tests (UATs), System Integration Tests (SITs), and Operational Tests (OTs)</li><li>Provide administrative task support such as Monthly Status Reports (MSRs), Weekly Status Reports (WARs) and meeting minutes.</li><li>Position location will be with the DAI PMO in Falls Church, VA</li>\n</ul>\n\n<strong><div>Education and Experience:</div>\n<br>\n</strong>\n<br>\n<div><div>Requires a Doctorate and at least 4 years of experience or a Master’s degree and at least 10 years of experience. The degree must be in a relevant technical curriculum and experience must be related to the job duties.</div><div>\n\n<ul>\n<li>Candidate should have a thorough understanding of Interoperability Testing.</li><li>Candidate should have a thorough understanding of Net Ready – Key Performance Parameters (NR-KPP)</li><li>Candidate should have a thorough understanding Defense Business Systems (DBS)</li><li>Ability to handle stress and work well under pressure</li> <li>Have practical and working knowledge of all Microsoft Office applications, advanced Excel knowledge</li><li>Analytical and critical thinking skills</li> <li>Quality interpersonal skills</li> <li>Must be able to multitask and be organized</li> <li>Quality oral and written communication skills</li> <li>Must have an active Secret clearance at time of hire.</li> </ul></div>\n</div>\n<br>\n<div><u>ESSENTIAL FUNCTIONS</u></div>\n<br>\n<div></div> \n<br>\n<div><strong>Physical Requirements</strong></div>\n<br>\n<div>Work may involve sitting or standing for extended periods of time. Position may require filing, typing, and reading from a computer screen. Must have sufficient mobility, included but not limited to: bending, reaching, turning and kneeling to complete daily duties in a timely and efficient manner. There is a possibility that due to parking availability and location of work, walking moderate to long distances may be required.\n</div><br>\n\n<div><strong>Work Environment</strong></div> \n<br>\n<div>Generally an office environment, but can involve inside or outside work depending on task. An inside environment may be a cubicle (considerations: close quarters, low to moderate noise, bright or dim lighting). Outside work may include various environmental conditions including warm and cold climates. Needs to be able to work well with co-workers, customer, and all levels of management. No hazards on job or unusual environmental conditions. Work site is located in Falls Church, VA.</div>\n\n<br><strong><div>Equipment and Machines:</div> \n<br>\n</strong>\n<br>\n<div>Ability to operate office equipment such as a personal computer, printer, copy machine, telephone, fax machine and other equipment including desk supplies and other work related tools as required. Ability to operate rental cars while TDY.</div>\n<br>\n<div><strong>Attendance</strong> </div>\n<br>\n<div>Regular hours will be between Monday - Friday 8:00am - 5:00pm. Regular attendance of scheduled hours is extremely important, but not critical, except for deadlines and meetings. Punctuality and regular attendance are necessary to meet deadlines. Must exhibit flexibility of work hours to adjust to surge situations based on critical mission requirements.</div>\n<br>\n<div></div> \n<br>\n<div><strong>Other Essential Functions</strong> </div>\n<br>\n<div>U.S. Citizenship and Secret Security Clearance required. Must demonstrate professional behavior at all times when dealing with customers, management and co-workers. Must have clear, concise and accurate communications skills in English, both verbal and written. Grooming and dress must be appropriate for the position and must not impose a safety risk to employees or others. Must maintain a positive work atmosphere by behaving and communicating in a professional manner. Independent personal transportation to office or work site is required. Travel to and from customer’s locations and the test fields may be required to support projects. This may involve airline travel. In some cases, accommodations can possibly be made for POV, if necessary. When operating any vehicle for work purposes, must wear seat belt and in addition, no cellular devices are to be used when vehicle is in motion.</div><div>#cjpost</div>"}