{"job title": "Research Scientist-Software&amp;Analytics", "company": "Lilly", "city state": "– Indianapolis, IN", "rating": "3.8", "job description": "**42754BR**<br> <br>**Responsibilities:**<br> <br><br> <br>Are you driven to work within an innovation culture to derive value from data as we strive to make new medicines? Are you a strong collaborator that believes in the discipline of team science?<br> <br><br> <br>Lilly generates a large volume of biomedical data through discovery research and medicines development through clinical trials. There are also massive public data sets available that provide additional insight into disease and treatment areas of interest to Lilly. Data science and informatics plays a key role in driving actionable insights for discovering new medicines for our patients.<br> <br>Research Informatics at Lilly is seeking a Research Scientist ? IT to join a newly formulated team ?Software and Analytics Engineering?. The ideal person will develop algorithms and machine learning techniques for a range of Lilly research problems with focus on clinical, longitudinal multi-omics datasets. This position will also entail development of a machine learning platform to allow collaboration and productionizing of analytics within Lilly Research Lab.<br> <br><br> <br>**Key Objectives/Deliverables:**<br> <br><br> <br>+ Develop and implement highly scalable computational and machine learning approaches to solve complex drug discovery business problems using research datasets<br> <br>+ Develop and productionize a Machine Learning-As-A-Service platform to manage features and ML models for research<br> <br>+ Participate as a technical and scientific lead on cross-functional research and IT teams. Drive the adoption of the machine platform by understanding use cases in Lilly Research<br> <br>+ Influence and shape informatics strategy by providing regular inputs to projects, innovative computational methods and best software engineering practices in a changing research environment.<br> <br><br> <br>**Req ID:**<br> <br><br> <br>42754BR<br> <br><br> <br>**Additional Skills/Preferences:**<br> <br><br> <br>+ Expert knowledge of R and Python, and machine learning packages such as scikit-learn, ML Lib, Tensorflow.<br> <br>+ Experience with languages such Perl, shell and C++ Experience in high-performance storage and compute environment using Amazon Web Services (AWS), Sun Grid Engine, Hadoop ecosystem such as HDFS and Spark.<br> <br>+ Demonstrable skills for engineering production quality analytics, which are scalable and optimized for large datasets<br> <br>+ Demonstrable skills through open source contributions on GitHub<br> <br>+ Data-driven mindset with a focus on annotation and curation<br> <br>+ Experience with databases and SQL query optimization<br> <br>+ Experience with Image Analysis Preferred<br> <br>+ Experience with Amazon Web Services (AWS) or Google Cloud<br> <br>+ Experience with visualization frameworks such as d3js, bokeh, ggplot.<br> <br>+ Experience utilizing accelerated compute infrastructure (GPU, TPU) for massively parallel computing tasks<br> <br><br> <br>**Additional Information:**<br> <br><br> <br>Lilly is an EEO/Affirmative Action Employer and does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.<br> <br><br> <br>**Title:**<br> <br><br> <br>Research Scientist-Software&amp;Analytics<br> <br><br> <br>**Job Category:**<br> <br><br> <br>Information Technology<br> <br><br> <br>**Basic Qualifications:**<br> <br><br> <br>PhD or MS degree in computational or related fields with 5-10 years of hands-on experience in one or more of the following areas: bioinformatics, statistics, artificial intelligence, machine and deep learning<br> <br><br> <br>**Company Overview:**<br> <br><br> <br>At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 39,000 employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We?re looking for people who are determined to make life better for people around the world.<br> <br><br> <br>**City:**<br> <br><br> <br>Indianapolis<br> <br><br> <br>**Country:**<br> <br><br> <br>USA<br> <br><br> <br>**State / Province:**<br> <br><br> <br>Indiana<br> <br><br> <br>**Region:**<br> <br><br> <br>North America"}