{"job title": "Data Engineer", "company": "lululemon", "city state": "– USA-Washington-Seattle", "rating": "4.1", "job description": "<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Assemble large, complex data sets that meet functional / non-functional business requirements. Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources using SQL, kafka and other ‘big data’ technologies.</li>\n<li>Work with data and analytics experts to strive for greater functionality in our data systems. Work with stakeholders including the Executive, Product, Data and Design teams to assist with data-related technical issues and support their data infrastructure needs.</li>\n<li>Create data tools for analytics and data scientist team members that assist them in building and optimizing our product into an innovative industry leader.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>Strong technical chops</li>\n</ul>\n\no\tDeep technical knowledge and 5 years direct hands on experience with various Big data platforms like Amazon Web Services, Elastic MapReduce or Azure and data migration to the cloud. Experience leading successful big data cloud migration project(s).\n<br>\no\tStrong knowledge of programming and scripting languages such as SQL, Java, Python, Ruby, or R. Data Science and Analytics experience is a plus (Machine Learning, Recommendation Engines, Search Personalization).\n<br>\no\tPractical expertise in performance tuning and optimization, bottleneck problems analysis; Solid technical expertise &amp; troubleshooting skills.\n<br>\no\tBS/MS Degree in Computer Science, Mathematics, Engineering or related technical fields.\n\n\n<ul>\n<li>Strong organization agility</li>\n</ul>\n\no\tBe able to work seamlessly across various biz teams and cross functional Tech teams to get work done. Always exploring opportunities to foster win-win situations that will benefit the broader organization needs.\n\n\n<ul>\n<li>Strong communication skills</li>\n</ul>\n\no\tStrong written and verbal communication skills and be able to communicate effectively across various layers in the organization from data engineers to executives.\n<br>\no\tExperience engaging with senior leaders on various solutions and business problems. Be able to listen, understand and analyze requirements and recommend solutions that solve biz problems with the bigger picture in mind.\n<br><br>\n<strong>#LI-MR1</strong>\n<br><br>\nNOTE: Only those applicants under consideration will be contacted. Please accept our utmost appreciation for your interest. lululemon is an Equal Employment Opportunity employer. Employment decisions are based on merit and business needs, and not on race, color, creed, age, sex, gender, sexual orientation, national origin, religion, marital status, medical condition, physical or mental disability, military service, pregnancy, childbirth and related medical conditions or any other classification protected by federal, state or provincial and local laws and ordinances. Reasonable accommodation is available for qualified individuals with disabilities, upon request. This Equal Employment Opportunity policy applies to all practices relating to recruitment and hiring, compensation, benefits, discipline, transfer, termination and all other terms and conditions of employment. While management is primarily responsible for seeing that lululemon equal employment opportunity policies are implemented, you share in the responsibility for assuring that, by your personal actions, the policies are effective.\n<br>"}