{"job title": "Data Engineer", "company": "Pluralsight", "city state": "– South Jordan, Utah", "rating": "4.2", "job description": "Company Description<br><br>Founded in 2004 and trusted by Fortune 500 companies, Pluralsight is <em>the</em> technology learning platform organizations and individuals in 150+ countries count on to innovate faster and create progress for the world.\n<br><br>\n<strong>Working at Pluralsight</strong>\n<br><br>\nAt Pluralsight, we believe everyone should have the opportunity to create progress through technology. That everyone should have access to the skills of tomorrow. That technology can make the world a better place. Through the work we do everyday, we empower the people who power our world.\n<br><br>\nAnd we dont let fear, egos or drama distract us from our mission. Were adults, and we treat each other that way. We have the autonomy to do our jobs, transparency to eliminate office politics and trust each other to do the right thing. We thrive in an environment with creativity around every corner, challenges that keep us on our toes, and peers who inspire us to be the best we can be. We bring different viewpoints, backgrounds and experiences, and united by our mission, we are one.<br><br>Job Description<br><br>Our Data Engineering team builds and maintains a secure, scalable, flexible and user-friendly analytics hub that allows us to make informed and data-driven decisions. They also construct and curate business critical data sets that allow us to realize the value of all the data we collect.\n<br><br>\nA Data Engineer utilizes a multidisciplinary approach to providing ETL solutions for the business, combining technical, analytical, and domain knowledge.\n<br><br>\nThe perfect applicant for this role has strong development skills, experience transforming and profiling data to determine risks associated with proposed analytics solutions, a willingness to continually interface with analysts in order to determine an optimal approach, and an eagerness to explore data sources to understand the availability, utility, and integrity of our data.\n<br><br>\n<strong>You will accomplish this by:</strong>\n<ul>\n\n<li>Building and enhancing data ingestion pipelines using tools like Python, SQL, AWS</li>\n<li>Leveraging devops best practices, such as IAC and CI/CD to build upon a scalable and extensible data environment.</li>\n<li>Deploying and utilizing tools to ensure the curation of datasets that meet the needs of the business</li>\n<li>Processing and cleansing data from a variety of sources to transform collected data into an accessible and curated state for analysts and Data Scientists.</li>\n<li>Assisting in data warehousing, data analytics, and data science efforts</li>\n\n</ul>\n<strong>Youd be a great fit if your current track record looks like this:</strong>\n<ul>\n\n<li>3-5 years of progressive experience data engineering</li>\n</ul>\n\n<ul>\n\n<li>Experience with Python development, particularly for data manipulation and API integration</li>\n<li>Experience with data management platforms (e.g. Hadoop, EMR, PostgreSQL, RedShift, BigQuery, Cassandra)</li>\n<li>Fluency with data acquisition and relational database platforms</li>\n<li>Strong capability to manipulate and analyze complex, high-volume data from a variety of sources</li>\n<li>Effective communication skills with technical team members as well as business partners. Able to distill complex ideas into straightforward language</li>\n<li>Ability to problem solve independently and prioritize work based on the anticipated business value</li>\n\n</ul>\n<strong>Qualifications:</strong>\n<ul>\n\n<li>At least 3 years experience building software for high traffic websites, using languages such as Javascript or Python</li>\n<li>Full stack experience preferred</li>\n<li>Experience with cloud services such as AWS and APIs</li>\n<li>Deep understanding of relational databases, NoSQL databases and other types of data stores</li>\n<li>A firm grasp of modern testing principles</li>\n\n</ul>\n<strong>Ways we work:</strong>\n<ul>\n\n<li>Software Craftsmanship - we want to be proud of our work. come to utahsc.org</li>\n<li>Test-Driven Development - we take responsibility for our code without QA engineers</li>\n<li>Agile Development - we deliver business value quickly</li>\n<li>Pair programming - we value collaborative development</li>\n<li>Continuous Delivery - teams independently ship code to prod every day</li>\n<li>Continual improvement - we take time to sharpen the saw and adjust how we work</li>\n<li>Autonomous &amp; responsible teams - making their own product &amp; dev choices</li>\n<li>Cross-functional teams - collaborating through all phases of the product dev process</li>\n<li>Customer research - we build what our customers actually want</li>\n<li>Trusting leaders - who trust us to create and dont impose deadlines or features</li>\n<li>Solid technology - of the teams choice, for the right job</li>\n\n</ul>"}