{"job title": "COMPUTATIONAL BIOLOGY RESEARCH SCIENTIST", "company": "University of Pennsylvania", "city state": "– Philadelphia, PA", "rating": "4.2", "job description": "<strong>COMPUTATIONAL BIOLOGY RESEARCH SCIENTIST</strong>\n<br>\nBelow you will find the details for the position including any supplementary documentation and questions you should review before applying for the opening. To apply for the position, please click the Apply for this Job link/button.\n<br><br>\nIf you would like to bookmark this position for later review, click on the Bookmark link. If you would like to print a copy of this position for your records, click on the Print Preview link.\n<br><br>\nBookmark this Posting -\n<br>\nPrint Preview -\n<br>\nApply for this Job\n<br><br>\nPosting Details\n<br><br>\nPosting Details\n<br><br>\nReference Number\n<br>\n<strong>40-29432</strong>\n<br><br>\nPosted Job Title\n<br>\n<strong>COMPUTATIONAL BIOLOGY RESEARCH SCIENTIST</strong>\n<br><br>\nSchool Name\n<br>\nPerelman School of Medicine\n<br><br>\nOrg\n<br>\nID-Institute for Diabetes, Obesity and Metabolism\n<br><br>\nPosted to the Web\n<br>\n<strong>07/24/2018</strong>\n<br><br>\nPosted Job/Salary Grade\n<br>\n<strong>028</strong>\n<br><br>\nEmployment Type\n<br>\nExempt\n<br><br>\nHours\n<br>\n<strong>N/A</strong>\n<br><br>\nPosition Type\n<br>\nFull Time\n<br><br>\nPosition Schedule\n<br>\n<strong>9-6</strong>\n<br><br>\nMonths\n<br>\n<strong>12</strong>\n<br><br>\nPosition Length\n<br>\nContingent Upon Funding\n<br><br>\nPosition End Date\n<br><br>\nUniversity Overview\n<br><br>\nThe University of Pennsylvania, the largest private employer in Philadelphia, is a world-renowned leader in education, research, and innovation. This historic, Ivy League school consistently ranks among the top 10 universities in the annual U.S. News &amp; World Report survey. Penn has 12 highly-regarded schools that provide opportunities for undergraduate, graduate and continuing education, all influenced by Penn?s distinctive interdisciplinary approach to scholarship and learning.\n<br><br>\nPenn offers a unique working environment within the city of Philadelphia. The University is situated on a beautiful urban campus, with easy access to a range of educational, cultural, and recreational activities. With its historical significance and landmarks, lively cultural offerings, and wide variety of atmospheres, Philadelphia is the perfect place to call home for work and play.\n<br><br>\nThe University offers a competitive benefits package that includes excellent healthcare and tuition benefits for employees and their families, generous retirement benefits, a wide variety of professional development opportunities, supportive work and family benefits, a wealth of health and wellness programs and resources, and much more.\n<br><br>\nSchool/Center Overview\n<br><br>\nThe Perelman School of Medicine at the University of Pennsylvania is the oldest and one of the finest medical schools in the United States. Penn is rich in tradition and heritage and at the same time consistently at the forefront of new developments and innovations in medical education and research. Since its founding in 1765 the School has been a strong presence in the community and prides itself on educating the leaders of tomorrow in patient care, biomedical research, and medical education. http://www.med.upenn.edu/\n<br><br>\nDuties\n<br><br>\nThe successful candidates will work closely with experimental biologists and be responsible for developing tools to analyze epigenomic (histone modification and DNA methylation) and genomic (Gro-seq, ChIP-seq) data. Expertise in developing bioinformatics tools using data mining and signal processing is highly recommended. We are seeking a computational biologist with research interests in the functional analysis of genome-wide datasets, in the context of metabolic research. An individual with background in the application or development of state-of-the art computational tools for evaluating Next Generation Sequencing (NGS) studies of transcription factors and epigenetic modifications/factors and large data sets are most highly desired. The most appropriate candidate will take advantage of close interactions with colleagues in IDOM, as well as the Cardiovascular Institute and Epigenetics Institute, which are co-localized in a new research building. Training in experimental biology and interest in systems biology, epigenetics/chromatin biology and/or metabolism would be useful, but not required. Examples of recent IDOM research involving analysis of big data include PMIDs 29760084, 29439026, 29517978, 28951829. For more information about the IDOM, see www.med.upenn.edu/idom.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nThe minimum of a Master?s degree and 3 years to 5 years of experience or equivalent combination of education and experience required. An ideal candidate should have a Ph.D. in bioinformatics/computer science/physics or a related filed, be highly motivated in solving biological problems and have strong programming skills.\n<br><br>\nAffirmative Action Statement\n<br><br>\nPenn adheres to a policy that prohibits discrimination on the basis of race, color, sex, sexual orientation, gender identity, religion, creed, national or ethnic origin, citizenship status, age, disability, veteran status, or any other legally protected class.\n<br><br>\nSpecial Requirements\n<br><br>\nQuick Link\n<br>\nhttp://jobs.hr.upenn.edu/postings/38691\n<br><br>\nPosting Supplemental Questions\n<br><br>\nRequired fields are indicated with an asterisk (*).\n<br><br>\n<strong>+ *</strong>\n<br>\nHow did you hear about this employment opportunity?\n<br><br>\n+ Jobs@Penn\n<br><br>\n+ Contacted by a Penn Recruiter\n<br><br>\n+ Referred by a Penn Employee\n<br><br>\n+ Referred by a friend or family member\n<br><br>\n+ Higher Education Recruitment Consortium (HERC)\n<br><br>\n+ Inside Higher Ed\n<br><br>\n+ Indeed.com\n<br><br>\n+ Other Internet Advertisement\n<br><br>\n+ Linkedin\n<br><br>\n+ Twitter\n<br><br>\n+ Other Social Media Site\n<br><br>\n+ Professional Affiliation/Trade Website\n<br><br>\n+ Diversity Association/Publication Website\n<br><br>\n+ Heard about it at a conference or career fair\n<br><br>\n+ Apple One\n<br><br>\n+ Recruitment and/or staffing agency\n<br><br>\n<strong>+ *</strong>\n<br>\nWhat is your highest level of education completed?\n<br><br>\n+ Less than high school education\n<br><br>\n+ High School Diploma or GED\n<br><br>\n+ Vocational or Technical School\n<br><br>\n+ Associate's Degree or Two Year College\n<br><br>\n+ Bachelor's Degree\n<br><br>\n+ Master's Degree\n<br><br>\n+ PHD/MD/JD or equivalent doctoral degree\n<br><br>\n<strong>+ *</strong>\n<br>\nHow many years of experience do you have related to this position?\n<br><br>\n+ 0 to 1 Year\n<br><br>\n+ 1 to 2 Years\n<br><br>\n+ 2 to 3 Years\n<br><br>\n+ 3 to 5 Years\n<br><br>\n+ 5 to 7 Years\n<br><br>\n+ 7 to 10 Years\n<br><br>\n+ Over 10 Years\n<br><br>\nApplicant Documents\n<br><br>\nRequired Documents\n<br><br>\n+ Resume\n<br><br>\nOptional Documents\n<br><br>\n+ Cover Letter"}