{"job title": "Computer Scientist", "company": "Centers for Disease Control and Prevention", "city state": "– Hyattsville, MD", "rating": "3.8", "job description": "* Videos<br><br>* Duties<br><br>Help<br><br>## Duties<br><br>### Summary<br><br>This position is a scientific position, with an emphasis on computer science methods and techniques as it relates to public health informatics. The primary purpose of the position is to assist in the development of solutions for a variety of problems in the public health informatics field.<br><br>Learn more about this agency<br><br>### Responsibilities<br><br>**As a Computer Scientist (Informatics) you will:**<br><br><br>* Address public health informatics data or management needs, necessitating the need for experimental computer technologies, products, and prototype systems to overcome critical business obstacles.<br><br><br>* Conduct computer analysis and in-depth investigations to identify the most feasible approaches to hardware/software/networking system design and development problems.<br><br><br>* Lead and manage fact finding, design, software surveys, and cost/benefit analyses for new or modified computer applications resulting in the design or modification of systems.<br><br><br>* Plan, construct, and maintain databases for data storage, manipulation, and retrieval.<br><br><br>* Modify commercial database management systems and/or develop programs to maintain files, perform data validation routines, etc.<br><br>### Travel Required<br><br>Not required<br><br>##### Supervisory status<br><br>No<br><br>##### Promotion Potential<br><br>13<br><br>* #### Job family (Series)<br><br>1550 Computer Science<br><br>* Requirements<br><br>Help<br><br>## Requirements<br><br>### Conditions of Employment<br><br>* US Citizenship is required.<br>* Background Investigation is required.<br>* E-Verify: If you are selected for this position, the documentation that you present for purposes of completing the Department of Homeland Security (DHS) Form I-9 will be verified through the DHS \"E-Verify\" System. Federal law requires DHS to use the E-Verify System to verify employment eligibility of all new hires, and as a condition of continued employment obligates the new hire to take affirmative steps to resolve any discrepancies identified by the system. The U.S. Department of Health and Human Services is an E-Verify Participant.<br>* Direct Deposit: All Federal employees are required to have Federal salary payments made by direct deposit to a financial institution of their choosing.<br>* One-year probationary period may be required.<br>* Travel, transportation, and moving expenses will be paid: No<br>* Bargaining Unit Position: Yes<br>* Drug Screening Required: No<br>* Recruitment Incentive may be authorized: No<br>* Annual Leave for non-federal service may be authorized: No<br>* Research position: No.<br>* Promotion potential: Yes: This position has promotion potential to **GS-13**. Promotion to the next grade level is at management's discretion and is based on your meeting qualifications and time-in-grade requirements, demonstrated ability to perform the higher level duties, the continuing need for the higher level duties, and administrative approval. Promotion to the next grade level is not guaranteed and no promise of promotion is implied.<br>* Supervisory position: No<br>* Time in grade (TIG) must be met within 30 days of the closing date of the announcement.<br>* Current or Former Political Appointees: Agencies must seek prior approval from the Office of Personnel Management (OPM) before they can appoint a current or recent political appointee to a competitive or non-political excepted service position at any level under the provisions of title 5, United States Code. If you are currently, or have been within the last 5 years, a political Schedule A, Schedule C, or Non-career SES employee in the executive branch, you MUST disclose that to the Human Resources Office. Failure to disclose this information could result in disciplinary action including removal from Federal Service. Current or Former Political Appointees: Submit SF-50.<br>* All qualification requirements must be met by the closing date of the announcement.<br><br>### Qualifications<br><br>**Basic Qualification:**<br>Applicant must possess a bachelor's degree in computer science or a bachelor's degree with 30 semester hours in a combination of mathematics, statistics, and computer science. At least 15 of the 30 semester hours must have included any combination of statistics and mathematics that included differential and integral calculus. All academic degrees and course work must be from accredited or pre-accredited institutions.<br>**Additional Qualification for the GS 9:**<br>In addition to the Basic Qualifications, applicants must have one (1) year of specialized experience at or equivalent to the GS-7 level in the Federal service.<br>**Specialized Experience:** Specialized experience is experience which is directly related to the position which has equipped the applicant with the particular knowledge, skill and ability (KSAs) to successfully perform the duties of the position to include skills and familiarity with the principles of software development from requirements gathering to program development and testing. Experience with programming in a general purpose language such as C++, Java, Perl, etc.<br>**OR**<br>Completed 2 years of progressively higher level graduate education leading to a master's degree or masters or equivalent graduate degree; OR<br>**OR**<br>A combination of specialized experience and graduate level education that meets 100% of the qualification requirements for this position.<br><br>**Additional Qualification for the GS-11:**<br>In addition to the Basic Qualifications, applicants must have one (1) year of specialized experience at or equivalent to the GS-7 level in the Federal service.<br>**Specialized Experience:**Specialized experience is experience which is directly related to the position which has equipped the applicant with the particular knowledge, skill and ability (KSAs) to successfully perform the duties of the position to include experience with programming in a general purpose language such as C++, Java, Perl, etc. Familiarity with Database Management Systems (DBMS), such as MS SQL server, Oracle, MySQL or MS Access.<br>**OR**<br>Completed three full years of progressively higher level graduate education leading to a PhD degree; or PhD; or equivalent doctoral degree.<br>**OR**<br>Have a combination of specialized experience and graduate education as described above.<br><br>### Education<br><br>Education completed in colleges or universities outside the United States may be used to meet the education requirements. You must provide acceptable documentation that the foreign education is comparable to that received in an accredited educational institution in the United States. For more information on how foreign education is evaluated, visit:<br>https://www.cdc.gov/jobs/future-applicant-information.html.<br><br>**Evaluation of Education:**<br>Applicants should have sufficient knowledge to understand the fundamental concepts and techniques of computer science. Courses designed to provide an introduction to computer science techniques and methodologies, to problems of system design, and to other specialized fields are acceptable. Courses or experience in teaching elementary, business, or shop mathematics are not acceptable.<br><br>### Additional information<br><br>This vacancy is also being announced concurrently with vacancy announcement **HHS-CDC-D2-18-10295104** under competitive procedures. Please review that announcement to see if you are eligible for consideration under competitive procedures.<br><br>NOTE: Applicants must apply separately for each announcement in order to be considered.<br><br>PHS Commissioned Corps Officers interested in performing the duties of this position within the Commissioned Corps (not as a career/career-conditional employee) are encouraged to apply under the merit promotion announcement indicated above.<br><br>Additional selections may be made within the same geographical location CDC-wide.<br><br>If you are a veteran with preference eligibility and you are claiming 5-points veterans' preference, you must submit a copy of your DD-214 or other proof of eligibility. If you are claiming 10-point veterans' preference, you must also submit an SF-15, \"Application for 10-Point Veterans' Preference\" plus the proof required by that form. For more information on veterans' preference see http://www.usajobs.gov/Veterans<br><br>Males born after December 31, 1959 must be registered or exempt from Selective Service (see).<br><br>For information on \"People with Disabilities\" please visit http://opm.gov/disability/PeopleWithDisabilities.asp<br><br>Interagency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible see http://opm.gov/rif/employeeguides/careertransition.asp#ictap. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated at 85.0 or above on the rating criteria for this position.<br><br>To view the questionnaire, click on the following link: https://apply.usastaffing.gov/ViewQuestionnaire/10295106<br><br>If you are unable to apply online or need to fax a document(s), view the following link for information regarding an Alternate Application.<br><br>Read more<br><br>### How You Will Be Evaluated<br><br>You will be evaluated for this job based on how well you meet the qualifications above.<br><br>Once the application process is complete, a review of resume and supporting documentation will be made and compared against your responses to the assessment questionnaire to determine if you are qualified for this job. If, after reviewing your resume and or supporting documentation, a determination is made that you have inflated your qualifications and or experience, you may lose consideration for this position. Please follow all instructions carefully. Errors or omissions may affect your eligibility.<br><br>Your qualifications will be evaluated on the following competencies (knowledge, skills, abilities and other characteristics):<br><br>* Knowledge of computer science concepts, principles, laws, programs and precedents.<br>* Knowledge of statistical methods, techniques, and methods in the collection, processing, analysis, survey sampling, and sampling weights.<br>* Knowledge of the principles, theories, and practices of computer science and their application to the data collection, processing, dissemination, storage and retrieval of health data.<br><br>Read more<br><br>### Background checks and security clearance<br><br>##### Security clearance<br><br>Not Applicable<br><br>##### Drug test required<br><br>No<br><br>* Required Documents<br><br>Help<br><br>## Required Documents<br><br>1. Your résumé showing work schedule, hours worked per week, dates of employment and duties performed.<br>2. Other supporting documents:Veterans Preference Documentation, if applicable<br>* SF-50 (if you are a federal employee or have reinstatement rights as a federal employee)<br>* Transcripts<br>* Schedule A Eligibility Letter if you are applying as a Schedule A candidate.<br>**Note: You may submit an unofficial transcript or a list of college courses completed indicating course titles, credit hours, and grades received. An official transcript from an accredited educational institution is required if you are selected for the position.<br><br>Failure to submit any of the above mentioned required documents may result in loss of consideration due to an incomplete application package. It is your responsibility to ensure all required documents have been submitted.**<br><br>For Résumé and Application Tips visit: https://help.usajobs.gov/index.php/Tips.<br><br>#### If you are relying on your education to meet qualification requirements:<br><br>Education must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education.<br><br>Failure to provide all of the required information as stated in this vacancy announcement may result in an ineligible rating or may affect the overall rating.<br><br>* Benefits<br><br>Help<br><br>## Benefits<br><br>A career with the U.S. Government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Learn more about federal benefits.<br><br>Review our benefits<br><br>Eligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time, or intermittent. Contact the hiring agency for more information on the specific benefits offered.<br><br>* How to Apply<br><br>Help<br><br>## How to Apply<br><br>To apply for this position, you must complete the online application and submit the documentation specified in the Required Documents section below.<br><br>A complete application package must be submitted by 11:59 PM (EST) on 09/19/2018 of this announcement to receive consideration.<br>To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application.<br>Follow the prompts to select your résumé and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process.<br>After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process.<br>You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application.To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/.<br><br>If you cannot apply online:<br><br>You are encouraged to apply online. If you are unable to apply online, please use the Alternate Application link listed in the Additional Information section of this vacancy announcement. Applicants are strongly encouraged to apply online if at all possible. Applying online, through your USAJOBS account, will expedite the application process and allow you to check your application. If you utilize the Alternate Application method, your USAJOBS account will not display this application and you will not receive status updates.<br><br>Read more<br><br>### Agency contact information<br><br>### CDC HELPDESK<br><br>##### Phone<br><br>(770) 488-1725<br><br>##### Email<br><br>HRCS@CDC.GOV<br><br>##### Address<br><br>OPHSS, National Center for Health Statistics<br>1600 Clifton Road, N.E.<br>Atlanta, GA 30333<br>US<br><br>Learn more about this agency<br><br>### Next steps<br><br>Once the online questionnaire is received you will receive an acknowledgement email that your submission was successful. The most highly qualified candidates will be referred to the hiring manager for further consideration and possible interview. We expect to make a selection within 45 days of the closing date of this announcement.<br><br>You will receive notice via email once this process is completed (generally 4-6 weeks).<br><br>Read more<br><br>* Fair &amp; Transparent<br><br>## Fair &amp; Transparent<br><br>The Federal hiring process is setup to be fair and transparent. Please read the following guidance.<br><br>### Equal Employment Opportunity Policy<br><br>The United States Government does not discriminate in employment on the basis of race, color, religion, sex (including pregnancy and gender identity), national origin, political affiliation, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service, or other non-merit factor.<br><br>* Equal Employment Opportunity (EEO) for federal employees &amp; job applicants<br><br>Read more<br><br>### Reasonable Accommodation Policy<br><br>Federal agencies must provide reasonable accommodation to applicants with disabilities where appropriate. Applicants requiring reasonable accommodation for any part of the application process should follow the instructions in the job opportunity announcement. For any part of the remaining hiring process, applicants should contact the hiring agency directly. Determinations on requests for reasonable accommodation will be made on a case-by-case basis.<br><br>A reasonable accommodation is any change to a job, the work environment, or the way things are usually done that enables an individual with a disability to apply for a job, perform job duties or receive equal access to job benefits.<br><br>Under the Rehabilitation Act of 1973, federal agencies must provide reasonable accommodations when:<br><br>* An applicant with a disability needs an accommodation to have an equal opportunity to apply for a job.<br>* An employee with a disability needs an accommodation to perform the essential job duties or to gain access to the workplace.<br>* An employee with a disability needs an accommodation to receive equal access to benefits, such as details, training, and office-sponsored events.<br><br>You can request a reasonable accommodation at any time during the application or hiring process or while on the job. Requests are considered on a case-by-case basis.<br><br>Learn more about disability employment and reasonable accommodations or how to contact an agency.<br><br>Read more<br><br>#### Legal and regulatory guidance<br><br>* Financial suitability<br>* Social security number request<br>* Privacy Act<br>* Signature and false statements<br>* Selective Service<br>* New employee probationary period<br><br>This job originated on www.usajobs.gov. For the full announcement and to apply, visit www.usajobs.gov/GetJob/ViewDetails/510369900. Only resumes submitted according to the instructions on the job announcement listed at www.usajobs.gov will be considered.<br><br><br><br>*Open &amp; closing dates:* 09/10/2018 to 09/19/2018<br><br><br>*Service:* Competitive<br><br><br>*Pay scale &amp; grade:* GS 9 - 11<br><br><br>*Salary:* $56,233 to $88,450 per year<br><br><br>*Appointment type:* Permanent<br><br><br>*Work schedule:* Full-Time"}