{"job title": "Scientist/Senior Scientist, Model Characterization", "company": "eGenesis", "city state": "– Cambridge, MA, US", "rating": "5.0", "job description": "<div>\n<strong>POSITION SUMMARY</strong></div><div>\nWe are looking for a scientist/senior scientist to join our team and lead the effort to characterize cell lines and animal models. This position requires a broad knowledge base in molecular biology, gene editing, immunology, and immunohistology, and specific skill sets include DNA/RNA extraction, Southern blot, PCR, qPCR, Western blot, FACS analysis, and immunostaining of tissue sections. The candidate will be a member of the gene editing team and report to director of genome engineering. This is a full-time position.</div> <div>\n<strong>RESPONSIBILITIES</strong></div>\n\n<ul>\n\n<li>\nDesign and execute experiment</li>\n<li>\nSupervise research assistant(s)</li>\n<li>\nPerform DNA/RNA extraction, qPCR, Western blot and FACS analysis of gene expression</li>\n<li>\nPrepare and stain tissue sections to examine cell type specific gene expression</li>\n<li>\nPerform Southern blot analysis</li>\n<li>\nRecord experiment into laboratory notebooks</li>\n<li>\nSummarize data and interpret results</li>\n<li>\nAdhere to guidelines for personnel and laboratory safety and environment protection</li> \n</ul>\n\n<br>\n<div>\n<strong>QUALIFICATIONS</strong></div>\n\n<ul>\n\n<li>\nM.S. or Ph.D. degree in cell biology, molecular biology, immunology, animal sciences or a related discipline</li>\n<li>\n2 to 5 years of laboratory experience in academia or industry</li>\n<li>\nHands-on experience with general molecular biology and immunology techniques, including DNA/RNA extraction, qPCR, Western blot, FACS, tissue sectioning and immunostaining</li>\n<li>\nAttention to details, strong organizational skills, and ability to prioritize and multitask efficiently in a results-oriented, high performance environment</li>\n<li>\nWilling to collaborate and contribute to team goals</li>\n<li>\nGood oral and written communication skills</li>\n<li>\nCandidate with experience in high-throughput genotyping of cell models and CRISPR-Cas mediated gene editing will be given preference</li>\n</ul>\n\n<br>"}