{"job title": "Scientist, Molecular Engineering", "company": "Fate Therapeutics, Inc.", "city state": "– San Diego, CA", "rating": "4.6", "job description": "Fate Therapeutics is currently seeking a talented and highly motivated molecular biologist\n<br>\nwith strong genetic engineering background to join a multidisciplinary R&amp;D team for\n<br>\ndeveloping stem cell derived off-the-shelf immunotherapies. The candidate will play a key\n<br>\nrole in developing and optimizing strategies for engineering multiple cell types including\n<br>\ninduced pluripotent stem cell (iPSC) lines used for derivation of cell therapy products. The\n<br>\ncandidate will also be involved in developing/validating novel gene editing techniques\n<br>\ncompatible with Fate’s proprietary state-of-the-art iPSC platform. The successful candidate\n<br>\nmust demonstrate broad and in-depth knowledge of cutting-edge genomic engineering\n<br>\ntechniques as well as strong expertise in generation and characterization of genetically\n<br>\nmodified cell lines. The position will require innovative thinking, strong independent and\n<br>\ncollaborative research abilities, and excellent oral and written communication skills. This is\n<br>\na full-time hands-on research position that reports to the Associate Director, Molecular\n<br>\nBiology and is located at Fate’s corporate headquarters in San Diego, CA.\n<br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Drive research projects with timely delivery of conclusions backed by solid data and</li>\n</ul>\n\nmethodical analyses\n\n\n<ul>\n<li>Develop molecular strategies for genomic engineering by applying the latest genetic</li>\n</ul>\n\nmanipulation technologies for optimized efficiency and specificity scalable for\n<br>\nmanufacturing process\n\n\n<ul>\n<li>Propose and test innovative engineering methods to advance Fate’s technology</li>\n</ul>\n\nplatform\n\n\n<ul>\n<li>Establish assays to characterize genetically engineered iPSCs to support early</li>\n</ul>\n\nproduct characterization\n\n\n<ul>\n<li>Design and generate constructs using standard cloning techniques including ligation</li>\n</ul>\n\nand assembly\n\n\n<ul>\n<li>Generate stable/clonal genetically modified iPSC lines with comprehensive molecular</li>\n</ul>\n\nand phenotypic characterization\n\n\n<ul>\n<li>Communicate research and development findings in cross-disciplinary team meetings</li>\n</ul>\n\nas well as with external partners\n\n\n<ul>\n<li>Manage and mentor a team of scientists to complete tasks as defined by corporate</li>\n</ul>\n\nand department objectives\n<br>\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Requires Ph.D. degree and minimum 2 years postdoctoral training in molecular</li>\n</ul>\n\nbiology, synthetic biology, cell biology, or related discipline. Industry experience\n<br>\npreferred.\n\n\n<ul>\n<li>Demonstrated expertise in cutting edge gene editing technologies, including</li>\n</ul>\n\ngRNA design, donor template building, cleavage assays, etc.\n\n\n<ul>\n<li>Experience in genomic characterization including deep sequencing, integration</li>\n</ul>\n\nsite analysis, copy number analysis, and off-target editing evaluation is preferred\n\n\n<ul>\n<li>Extensive experience in molecular cloning, vector construction, transfection and</li>\n</ul>\n\nviral infection, and transgene expression\n\n\n<ul>\n<li>Prior stem cell experience including iPSC is preferred</li>\n<li>Prior immunology experience including T cell and NK cell biology and chimeric</li>\n</ul>\n\nantigen receptors is preferred\n\n\n<ul>\n<li>Experience in working with cGMP compliant/quality controlled procedures is a plus</li>\n<li>Excellent creativity, technical decision-making, and trouble shooting skills</li>\n<li>Excellent communication and presentation skills</li>\n</ul>\n\nWorking Conditions and Physical Requirements\n\n\n<ul>\n<li>Will require working with blood and cell lines of human and animal origin</li>\n<li>Will require working with hazardous materials</li>\n<li>100% on-site work at corporate headquarters in San Diego, CA</li>\n<li>Occasional evening and weekend work will be required</li>\n\n</ul>"}