{"job title": "Senior Research Scientist I – Drug Metabolism", "company": "Gilead Sciences", "city state": "– Foster City, CA (US)", "rating": "3.2", "job description": "For Current Gilead Employees and Contractors:<br><br>Please log onto your Internal Career Site to apply for this job.<br><br>Job Description<br><br><strong>Specific Responsibilities:</strong>\n<br><br>\nThe primary responsibility is to serve as a DMPK representative, providing guidance to drug discovery and drug development project teams\n<br><br>\n<strong>Essential Duties and Job Responsibilities:</strong>\n<ul>\n<li>Serve as a DMPK subject matter expert on dynamic cross-functional Research teams, integrating data from multiple disciplines to guide efforts in lead optimization (primary role) and drug development (secondary role). Includes defining the strategy to achieve the target product profile, generating and interpreting in vitro and in vivo drug absorption and disposition data, making presentations, and authoring regulatory documents.</li><li>Work closely with internal and external resources to assure a high level of quality and timely delivery of data. Develop new assays and capabilities as needed.</li><li>Design and perform complex mechanistic analyses, and develop PK and PKPD models to answer translational questions and to provide general DMPK guidance.</li><li>Make major contributions to scientific literature and conferences through publication and presentation of research results.</li><li>Supervising scientists and associate scientists will likely be required.</li>\n</ul>\n<strong>Knowledge, Experience and Skills:</strong>\n<ul>\n<li>Requires a highly motivated individual with a Ph.D. degree in a relevant scientific discipline and 7 - 12 years experience, with a proven track record in drug discovery and development.</li><li>Demonstrates excellent scientific verbal and technical communication skills and interpersonal skills. Must be organized, detail-oriented and time-efficient.</li><li>Expertise and Experience in one or more of the following areas:\n\n<ul>\n<li>Prediction of human PK by multiple methods, including rationalization of species differences and integration of the influence of physicochemical properties</li><li>Enzymology and/or transport kinetics, especially as applied to mechanistic prediction of human pharmacokinetics and drug-drug interactions</li><li>Mathematical modeling for PK analysis and prediction, PKPD, PBPK etc. with proven experience and application of Simcyp, MATLAB, SAAM II, Berkeley Madonna etc.</li><li>Strong experience in bioanalysis including radioprofiling and metabolite identification</li></ul></li>\n</ul>\n#LI:AW1<br><br>For jobs in the United States:<br><br>As an equal opportunity employer, Gilead Sciences Inc. is committed to a diverse workforce. Employment decisions regarding recruitment and selection will be made without discrimination based on race, color, religion, national origin, gender, age, sexual orientation, physical or mental disability, genetic information or characteristic, gender identity and expression, veteran status, or other non-job related characteristics or other prohibited grounds specified in applicable federal, state and local laws. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Era Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants who require accommodation in the job application process may contact careers@gilead.com for assistance.\n<br><br>\nFor more information about equal employment opportunity protections, please view the ‘EEO is the Law’ poster.\n<br><br>\nNOTICE: EMPLOYEE POLYGRAPH PROTECTION ACT\n<br>\n<strong>YOUR RIGHTS UNDER THE FAMILY AND MEDICAL LEAVE ACT</strong>\n<br>\nPAY TRANSPARENCY NONDISCRIMINATION PROVISION\n<br><br>\nOur environment respects individual differences and recognizes each employee as an integral member of our company. Our workforce reflects these values and celebrates the individuals who make up our growing team.\n<br><br>\nGilead provides a work environment free of harassment and prohibited conduct. We promote and support individual differences and diversity of thoughts and opinion.<br><br>For jobs in France:<br><br>Conformément à la Loi « Informatique et Libertés » (06/01/78), nous vous informons du fait que les données personnelles renseignées pourront faire l'objet d'un traitement informatique par Gilead et pourront être transmises aux Organismes Sociaux. Par ailleurs, vous disposez d'un droit d'accès, de rectification et de suppression des données vous concernant. Vous pouvez exercer ce droit en contactant: FranceDataPrivacy@gilead.com<br><br>For Current Gilead Employees and Contractors:<br><br>Please log onto your Internal Career Site to apply for this job."}