{"job title": "Research Scientist (Reverse Engineering)", "company": "GrammaTech", "city state": "– Ithaca, NY", "rating": "4.5", "job description": "Overview<br><br>Lead research and development efforts on one or more related software reverse engineering research projects through interaction with technical personnel and other researchers to meet project goals and develop innovative prototypes with potential for commercialization.<br><br>Responsibilities\n\n\n<ul>\n\n <li>Analyze existing approaches, tools, and data to guide implementation efforts to achieve project goals.</li>\n<li>Coordinate with other research leads to align technical and labor needs across projects.</li>\n<li>Regularly communicate progress, goals, and milestones through verbal or written reports and presentations.</li>\n</ul>\n\nQualifications<br><br><strong>Required</strong>\n\n<ul>\n\n <li>3+ years experience working with at least one assembly language (x86, ARM, MIPS, etc.)</li>\n<li>Advanced software application development skills in C/C++ and Python</li>\n<li>Ph.D. in computer science with 2+ years experience leading government-funded research efforts <strong>- or -</strong> BS in computer science or equivalent with 5+ years experience leading research teams in industry</li>\n</ul>\n<strong>Preferred</strong>\n\n<ul>\n\n <li>Experience with reverse engineering tools (e.g. IDA Pro, radare2, binwalk, etc.)</li>\n<li>Experience with firmware and/or RTOS development, configuration, deployment and/or emulation</li>\n<li>Experience with fuzzers, at least using and configuring them; experience with AFL especially useful</li>\n<li>Experience with symbolic execution</li>\n<li>Experience with Windows binaries</li>\n</ul>\n<strong>About the Company</strong>\n<br><br>\nInnovation is at the heart of GrammaTech, and we are constantly pushing the boundaries of software research and development–from software assurance and software integrity to cyber‐security, threat mitigation and autonomic computing. We develop new technologies and see the results of our research incorporated into tools used by engineers and security professionals worldwide.\n<br><br>\nGrammaTech was founded in 1988, with the firmly‐grounded purpose of helping today’s organizations develop tomorrow’s software. With a focus on the evolving cyber‐security landscape, software hardening and intelligent systems, we tackle the most challenging software issues through a constant stream of highly innovative research and commercial development programs. Headquartered in the beautiful Finger Lakes Region of New York, we offer positions in Ithaca, NY and Madison, WI, as well as opportunities for remote employment.\n<br><br>\nWe offer a competitive salary and benefits package including health care plan options, a generous paid time off program, flexible hours, company‐sponsored employee pension plan, and opportunities for professional and personal development.\n<br><br>\n<em>GrammaTech, Inc. is an Equal Opportunity/Affirmative Action employer. Members of underrepresented groups are encouraged to apply</em>"}