{"job title": "Data Scientist -COR Administration - Houston Methodist Research Institute", "company": "Houston Methodist", "city state": "– Houston, TX", "rating": "3.9", "job description": "<div><strong>Work Shift:</strong> DAY\n<br><br>\n<strong>Work Week:</strong> M - F<br><br>Job Summary\n<br>\n<div>Houston Methodist (HM) is looking for a data scientist to join the Center for Outcomes Research (COR) to lead and develop informatics initiatives that transform healthcare via data science and informatics. The goal of the HM COR informatics initiative is to benefit patients and society as a whole by utilizing the skills and tools of data science to model patient populations clinically and economically within the context of the patient, the health care and hospital systems so that we can optimize business and clinical operations, improve patient care, reduce costs and position HM to more effectively address population health and other strategic health care needs into the future. The responsibility of the data scientist is to address the best uses of data science and informatics resources for HM clinical and business operations and patient care, including the organizations needs to assess and understand clinical, financial, operational, population health and marketing data. The data scientist should leverage the information in HM enterprise data warehouses and the Epic® electronic medical record as well as contribute to, manage and maintain and adhere to data definition standards crafted by the Hospital Data Governance Council. Under the guidance and direction of the Division Chief of Healthcare Informatics within the COR, the data scientist will work closely with clinicians, care givers, hospital staff, administrators, and other stakeholders to implement projects of clinical, business and societal benefit. The projects for this role will include, but are not limited to: research study protocol design and supporting analysis, predictive analytics, crafting innovative decision support methodology, advanced analytics, outcomes measures, cost reduction, quality improvement, population health management, statistical and advanced modeling techniques applied to different types of health and meta data, and coordinate with clinicians and scientists for the development of business and scientific presentations for a variety of audiences and stakeholders. The position promotes and supports system and department specific ICARE values.\n<br><br>\nPreferred candidates will: obtain and maintain Epic® certification on one or both tracks (clinical and/or financial) for the Epic data model implemented in Clarity® and Caboodle®. (at COR expense), HM Power User certification/credentials and demonstrate compliance and a strong working knowledge of the information policies and procedures governing the use of health care data within the HM organization and maintain a strong working knowledge base of statistics and statistical methodology.\n<br><br>\n<strong>PATIENT AGE GROUP SERVED</strong>\n<br>\nNot applicable</div>\n<br><strong>DUTIES AND RESPONSIBILITIES</strong>\n<br><br>\n<strong>PEOPLE</strong> <strong>(15%)</strong>\n<ul>\n\n<li>Manages client relationships as assigned, by leading the delivery of innovative strategies and solutions for our clients (EF).</li>\n<li>Presents project progresses and results to the stakeholders.</li>\n<li>Reports to Division Chief of Healthcare Informatics in the Center for Outcomes Research.</li>\n\n</ul>\n<strong>FINANCE (10%)</strong>\n<ul>\n\n<li>Applies good fiscal management practices</li>\n<li>Manages the continuous improvement of clinical and operational data and analytics.</li>\n\n</ul>\n<strong>QUALITY/SAFETY (20%)</strong>\n<ul>\n\n<li>Be knowledgeable on clinical data quality issues and assurance as well as patient privacy and data security and compliance.</li>\n<li>Documents the project requirements and results on a timely basis.</li>\n\n</ul>\n<strong>SERVICE (35%)</strong>\n<ul>\n\n<li>Drives the data analytics insights across the hospital system.</li>\n<li>Drives the execution of multiple analytical plans and projects.</li>\n<li>Identify data elements within the clinical/health databases for analytics and decision supports.</li>\n\n</ul>\n<strong>GROWTH/INNOVATION (20%)</strong>\n<ul>\n\n<li>Consults with clinicians and hospital staff regarding process improvement, delivery of best outcomes, decision supports, data insights and recommendations.</li>\n<li>Translates the findings into implementable informatics solutions with the clinicians, hospital administration, and other stakeholders.</li>\n\n</ul>\nThis job description is not intended to be all inclusive; the employee will also perform other reasonably related business/job duties as assigned. Houston Methodist reserves the right to revise job duties and responsibilities as the need arises.\n<br><br>\n<strong>EDUCATION REQUIREMENTS</strong>\n<br><br>\nMasters Degree in Computer Science, Clinical Informatics, Public Health Administration, Business Administration, or Engineering, or an MD with experience in Computing, Informatics, and Statistics.\n<br><br>\n<strong>EXPERIENCE REQUIREMENTS</strong>\n<br><br>\nAt least 4 years of experience in data analytics and/or database management in a healthcare organization.\n<br><br>\n<strong>CERTIFICATES, LICENSES AND REGISTRATIONS REQUIRED</strong>\n<br><br>\nNone\n<br><br>\n<strong>KNOWLEDGE, SKILLS AND ABILITIES REQUIRED</strong>\n<ul>\n\n<li>Experience with clinical settings and healthcare administration.</li>\n<li>Experience with statistical, database and algorithm modeling preferred.</li>\n<li>Experience implementing and managing Health IT software prototyping and applications.</li>\n<li>Experience in process mapping and analytics.</li>\n<li>Experience on decision support methodology and advanced analytics.</li>\n<li>Experience of clinical/health data integration in a health care IT environment.</li>\n<li>Great communications skills, both verbal and written a must especially as it pertains to communicating complicated technical concepts to non-technical stakeholders.</li>\n<li>Proven interaction skills with clinicians and hospital administrators.</li>\n<li>Sufficient proficiency in speaking, reading, and writing the English language necessary to perform the essential functions of this job, especially with regard to activities impacting patient or employee safety or security.</li>\n<li>Ability to effectively communicate with patients, physicians, family members and co-workers in a manner consistent with a customer service focus and application of positive language principles.</li>\n\n</ul>\n<strong>PHYSICAL REQUIREMENTS</strong>\n<br><br>\nActivity Checklist attached (see below)\n<br><br>\n<strong>WORKING ENVIRONMENT</strong>\n<br><br>\nNormal office environment<br><br>Equal Employment Opportunity<br><br>Houston Methodist is an Equal Opportunity Employer.\n<br><br>\n<u>Equal employment opportunity</u> is a sound and just concept to which Houston Methodist is firmly bound. Houston Methodist will not engage in discrimination against or harassment of any person employed or seeking employment with Houston Methodist on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, status as a protected veteran or other characteristics protected by law.\n<br><br>\nVEVRAA Federal Contractor priority referral Protected Veterans requested.<br><br>Company Profile<br><br>Houston Methodist Research Institute was formed in 2004 to rapidly and efficiently translate discoveries made in the laboratory and the clinic into new diagnostics, therapies and treatments. The research institute was created to provide the infrastructure and support for these endeavors, and to house the technology and resources needed to make innovative breakthroughs in important areas of human disease. A 540,000 square foot building dedicated to research, the research institute houses over 1,500 staff and trainees, 277 principal investigators and has more than 840 ongoing clinical trials.</div>"}