{"job title": "Computer Scientist/Research Scientist", "company": "Parsons", "city state": "– Aberdeen, MD", "rating": "3.4", "job description": "<strong> Computer Scientist/Research Scientist \\\"</strong> \n<br><br>\n<strong> Aberdeen Proven Grounds, MD</strong> \n<br><br>\nThe U.S. Army Research Laboratory Computational and Information Sciences Directorate (CISD), Computational Sciences Division conducts research relevant to achieving and implementing future generation digital battlefield. We work with emerging processors and architectures, advanced algorithms, new programming models, machine/deep learning. To support our research, our facilities include high performance computers, emerging processors, and developing neuromorphic platforms.\n<br><br>\nParsons is seeking highly motivated, self-starting individuals to join our team to support CISD. The qualified candidate should be interested in innovative research in the areas of emerging computing architectures, software algorithms, novel computing methodologies, numerical modeling techniques, machine learning and high performance computing.\n<br><br>\n<strong> As a computational science team member, you will:</strong> \n\n<ul>\n<li>Investigate new technologies and novel approaches to deep learning, neural networks and neuromorphic systems.</li><li>Develop new algorithms and extend existing artificial intelligence and machine learning algorithms for Army applications</li><li>Develop decentralized and distributed computing algorithms to include application of distributed ledgers to coordinate and share information across devices</li><li>Develop and exercise data sciences and statistical modeling approaches for distributed processing and analysis of large datasets</li><li>Prepare and present research findings at academic seminars, conferences and workshops</li><li>Publish technical reports and papers</li><li>Work with a multi-disciplinary team</li>\n</ul>\n\n<strong> Required Experience/Skills:</strong> \n\n<ul>\n<li>Bachelors, Master s or PhD in Computer Science, Engineering, Physics, or Math.</li><li>Prior published experience in Artificial Intelligence and Machine Learning.</li><li>Strong programming skills in one or more of: C, C++, Python, Java, CUDA, OpenCL, assembly</li><li>Experience with Linux</li><li>Experience with version control systems such as Git</li><li>Strong math skills; coursework and experience with numerical linear algebra</li>\n</ul>\n\n<strong>Other Requirements:</strong>\n\n<ul>\n<li> Due to the sensitivity of customer related requirements, U.S. Citizenship is required.</li> <li> Ability to obtain a government secret clearance.</li> \n</ul>\n\n<strong>\n<br>\nReady for action? We re looking for the kind of people who see this opportunity and don t hesitate to act. Parsons is a leader in the world of technical services. We hire people with a broad set of technical skills who have proven experience tackling some of the greatest challenges. Take your next step and apply today.\n<br><br>\nParsons Referral Plan\n<br><br>\nMaybe this opportunity isn t the right fit for you, but you know someone who is? Why not join our Parsons external referral program? When you refer other top professionals and they are hired, you are rewarded with an incredible financial incentive. Help us find top talent!</strong>\n<br><br>\nAssociated topics: circuit, electronic, information technology, malware, photonics, programmer, programming, robotics, schematic, software engineer"}