{"job title": "Data Scientist: Insider Threat - FS Poly", "company": "stanleyreid", "city state": "– Fort Meade, MD", "rating": "NA", "job description": "Our client is the sole-source prime on a key multi-decade Data Science program that is the real deal: real data, real impact, real consequences. Some of their teams report directly to the DIRNSA. You will be surprised by both the scope and the depth of work. They have a vast amount of data of all types and all forms. Open-ended exploratory tasking gives this program a research feel, but our client's success and reputation is based on deploying and operationalizing analytics. The data alone gets most Data Scientists excited, but here they also build models that predict the future. They are operationally focused on detecting and preventing espionage, terrorism, sabotage, insider threat, and malicious attacks to national security assets. They support the highest priority cases using mathematical and statistical methods to identify and triage threat vectors in multiple dimensions.\n<br><br>\nOur client is seeking Data Scientists and Predictive Modelers / Analysts with various specializations to join their advanced multi-disciplinary team. In addition to a strong salary and excellent benefits packages, other perks include an employee stock ownership program, work/life/learning balance that includes paid time in the office for technical presentations (with nicely catered lunches), standing/sitting desks, gym membership stipends, and a very strong focus on professional development of staff.\n<br><br>\nTo be considered for this team, you will need the following:\n\n\n<ul>\n<li>US citizenship plus current TS/SCI + FS Poly (CCAs cannot be considered)</li>\n<li>BS and 5+ yrs of relevant experience (MS or PhD preferred and can count toward experience)</li>\n<li>Professional focus on Data Science, Statistics, Machine Learning, NLP, Predictive Modeling, or similar discipline</li>\n<li>Experience with R, MATLAB, SAS, SPSS, Rapid Miner, or similar tools</li>\n</ul>\n\nBackground in any of the following is beneficial:\n\n\n<ul>\n<li>People-centric analytics (human behavior, user activity, risk ranking, psychology, security, CI, etc.)</li>\n<li>Supervised and unsupervised learning techniques (neural networks, regressions, clustering, segmentation, etc.)</li>\n<li>Link analysis and related topics</li>\n<li>Analytic software development in Python, Perl, R, Java, or other languages</li>\n</ul>\n\nThis opportunity is located at Ft. Meade, MD and sites in the surrounding area.\n<br><br>\ncjobs-cat:\"IT - Data Science\"\n<br><br>\n<strong>10695</strong>"}