{"job title": "Lead Scientist (Scientist III)", "company": "State of Virginia", "city state": "– Richmond, VA", "rating": "3.9", "job description": "Virginiaâs State Laboratory, the Division of Consolidated Laboratory Services (DCLS), is the largest consolidated laboratory in the United States, and with a staff of over 250, provides laboratory testing for hundreds of local, state and federal governmental agencies with a mission to promote a healthier world through quality laboratory service. If your goal is to build a career that makes a difference, consider joining the dedicated staff of DCLS. DCLS seeks a qualified candidate to serve as a Bioinformatics Lead Scientist to build and develop bioinformatics tools and infrastructure for the analysis of infectious pathogen next-generation sequence (NGS) data. This grant-funded position will be responsible for leading DCLSâ efforts with respect to bioinformatics activities, including the assessment of sequence raw read quality, establishing quality assurance and quality control parameters, evaluating the sensitivity and specificity of bioinformatics applications and implementing controls in bioinformatics analyses and pipeline construction to meet Clinical Laboratory Improvement Amendments (CLIA) requirements. This position will guide the analysis of infectious disease NGS data through independent verification of bioinformatics tools and pipelines for high-throughput analysis. The scope of work may include, but is not limited to, pathogen identification, genomic epidemiology, mapping antimicrobial-resistance determinants, variant analysis, genome annotation and phylogenies from bacterial, viral, fungal, and parasite genomic data. The successful candidate will provide oversight and technical guidance for interdisciplinary projects; and bioinformatics pipeline deployment, operation and troubleshooting within laboratory testing areas. The Bioinformatics Lead Scientist will be encouraged to explore external partnerships with federal stakeholders, commercial entities and universities with the goal of expanding DCLSâ analytic resources and capabilities. This position will oversee public health laboratory workforce-development trainings in bioinformatics and will serve as a technical subject matter consultant for DCLS and the Mid-Atlantic Region for bioinformatics for infectious pathogens. Additional training responsibilities will include the development and facilitation of introductory, intermediate and advanced bioinformatics trainings for public health scientists and providing assistance, as needed with other state and federally sponsored bioinformatics and advanced molecular training courses. The successful candidate will support additional DCLS regional training needs which may include designing and conducting trainings, preparation and tracking of training-associated grant objectives, and collating training evaluations for the improvement of the bioinformatics training program. This position will be responsible for the writing and submission of grants and cooperative agreements to secure laboratory funding, tracking and managing grant objectives, expenditures and budgets. The successful candidate will work closely with DCLS Senior Management, state and federal agencies to provide highly technical consultation and analytics for emergency response or outbreak incidences. This is a full-time restricted position funded by a federal grant and includes state benefits.\n<br><br>\n<strong>Minimum Qualifications</strong>\n<br><br>\nThe candidate must have a Bachelor of Science degree in chemistry, biology, biochemistry or a closely related scientific field supplemented with courses and/or training and/or experience in bioinformatics. Considerable knowledge of the theory and application of molecular biology, human genomics and the bioinformatics analysis of genomes is required. The applicant must comply with CLIA General Supervisor requirements for high complexity testing personnel. Qualifications include comprehensive knowledge and work related experience in microbial genetics and proficiency in at least one scripting language (Perl, Python, etc.) and Linux operating systems. Knowledge of quality assurance and quality control in the field of bioinformatics and federal and state laws and regulations governing laboratories is essential. Knowledge of statistics methods. Capable of developing, testing and implementing complex bioinformatics solutions with limited supervision. Flexibility in working independently or as an integral part of an interdisciplinary project team. Good project management skills and capacity to manage multiple projects simultaneously. Experience providing bioinformatics results consultation and summarizing results into actionable information for epidemiologists, regulatory officials and scientific staff. The ability to prepare basic to highly technical trainings for public health scientists, epidemiologists and regulatory officials is critical. Ability to organize workload with limited supervision is required. Effective verbal and scientific writing communication skills and the ability to work and communicate collaboratively are essential attributes.\n<br><br>\nPreferred Qualifications\n<br><br>\nAn advanced degree, Doctoral (PhD) or Masterâs in Microbiology, Molecular Biology, Microbial Genetics, Bioinformatics, or related field is strongly preferred. Research experience is preferred. CLIA eligible as Technical Supervisor.\n<br><br>\nSpecial Requirements\n<br><br>\nSponsorship will not be provided for this position. Applicants that indicate they have preferential hiring rights in the form of a yellow form or blue card must submit these to our office prior to the closing of the posting, in accordance with DHRM policy 1.30. Please note that only current and former employees of the Commonwealth of Virginia that will be or have been laid off are eligible for preferential hiring rights. The selected candidate must pass a fingerprint-based criminal background check . CLIA Requirements for General Supervisor for high complexity testing personnel can be found: https://www.ecfr.gov/cgi-bin/text-idx?SID=fdc713e19974b1fefd30f6652bd096f8&amp;mc=true&amp;node=pt42.5.493&amp;rgn=div5#se42.5.493_11461 CLIA requirements for high complexity technical supervisor can be found: https://www.ecfr.gov/cgi-bin/text-idx?SID=fdc713e19974b1fefd30f6652bd096f8&amp;mc=true&amp;node=pt42.5.493&amp;rgn=div5#se42.5.493_11451<br><br>SDL2017"}