{"job title": "Translational Scientist", "company": "Sunrise Systems, Inc.", "city state": "– San Francisco, CA", "rating": "4.1", "job description": "Sunrise System Inc. is currently looking for Translational Scientist in San Francisco, CA with one of our top client.\n<br><br>\nJob Title: Translational Scientist\n<br><br>\nJob Id: 18-13310\n<br><br>\nLocation: San Francisco, CA 94158\n<br><br>\nDuration: 12 months\n<br><br>\nPosition Type: Hourly contract Position (W2 only)\n<br><br>\nSummary\n\n\n<ul>\n<li>The Clinical Research Scientist, Translational Development, contributes to the support efforts of Early Development clinical trials from a clinical science perspective.</li>\n<li>The incumbent will primarily be responsible for clinical data review of ongoing studies in Medidata RAVE and analysis of safety, primary efficacy data (solid and hematologic cancers) in close collaboration with the medical monitor (CRP) and the study team CRS.</li>\n<li>This function is also accountable for working closely with the project and study teams to deliver enhanced efficiencies and quality around tactical deliverables, including protocol development/amendments, informed consents and other supporting clinical trial documents (e.g. case report forms), clinical data quality assurance , investigator and site communications, study reports, regulatory documents and publications.</li>\n</ul>\n\nSpecific Responsibilities include, but are not limited to, the following\n\n\n<ul>\n<li>Collaborate with clinical operations (i.e. study manager, CRAs), data management, translational development operations, medical monitor and the study CRS in the review, querying and reconciliation of clinical data both in real-time and prior to database extraction.</li>\n<li>Assist the medical monitor and the study CRS with regular clinical data review meeting preparation, conduct and documentation of meeting minutes, and with protocol deviation review and documentation.</li>\n<li>Assist the medical monitor and the study CRS with regular review and filing of study documents in the Trial Master File.</li>\n<li>Assist the medical monitor and the study CRS in preparation of data summaries for review at Safety Review Committee meetings, Early Development Advisory Committee (EDAC) Candidate Development Committee (CDC) meetings, Quarterly Research Review meetings and various other internal and external meetings.</li>\n<li>Contribute to the authorship/review and/or amendment of clinical study protocols, consent forms; preparation of investigator brochures, clinical study reports, study subject narratives, abstracts and manuscript and other clinical study and regulatory documents in collaboration with the medical monitor, study CRS and cross-functional study teams.</li>\n<li>Assist the medical monitor and translational scientist in the preparation of abstracts, posters, oral presentations and manuscripts for the purpose of peer-review and reporting of results from Early Development clinical trials at various external meetings (e.g. ASH, ASCO, EHA, ESMO), with the assistance and support of Client Scientific Communications.</li>\n<li>Work with the lead CRS, Study Manager, CRAs, and others, in the day-to-day conduct of clinical studies from a clinical science perspective.</li>\n\n<strong><li>Actively engage/interact with key stakeholders, including:</li>\n\n</strong>\n\n<li>1) internal: medical monitor, clinical operations, translational scientists, translational development leadership, project leadership, data management and biostatistics, regulatory affairs, medical writing, QC/CQA, clinical pharmacology.</li>\n<li>preclinical toxicology, CMC; and 2) external: CROs</li>\n</ul>\n\nSkills/Knowledge Require\n\n\n<ul>\n<li>Bachelors degree required; Advanced degree(s) in relevant field: RN/MSN, PhD, PharmD preferred.</li>\n<li>Minimal 4 years pharmaceutical/biotech industry or related experience preferred</li>\n<li>Proficient in clinical and scientific data review and analysis; experience with RECIST, other tumour response criteria a plus.</li>\n<li>Strong leadership, planning and organization, written and oral communication skills.</li>\n<li>Previous experience in Clinical or Translational Development and proficiency in haematology and oncology disease indications required.</li>\n<li>Working knowledge/familiarity with fundamental concepts in cancer biology as they relate to biomarker-driven early stage clinical trials preferred; knowledge of clinical trial design.</li>\n<li>Knowledge of GCP/ ICH guidelines.</li>\n<li>Proficient in clinical trial protocol and CRF development, Clinical Study Report preparation, Investigator Brochure preparation, regulatory submissions.</li>\n<li>Proficient in industry-standard software (Microsoft Office Suite, electronic data capture, etc.) experience with Medidata RAVE a plus.</li>\n</ul>\n\nPrerequisites\n\n\n<ul>\n<li>Bachelors Degree with a concentration in life sciences with 4-7 year related experience required.</li>\n<li>Advanced degree(s) in relevant field: RN/MSN, MD, PharmD or PhD with experience/knowledge in oncology disease indications preferred.</li>\n<li>One to 4 or more years of academic/industry experience required including (but not limited to) clinical data review/reconciliation/analysis; preparation of protocols/amendments, informed consents and other key clinical study and regulatory documents; Phase 1 to proof-of-concept protocol development, study start-up, execution and close-out.</li>\n</ul>\n\nContact\n<br><br>\nPraful Prasanna\n<br><br>\nEmail: Praful.P@sunrisesys.com - Direct: (732) 272 0326\n<br><br>\nOr\n<br><br>\nSourabh Agrawal - Lead - Talent Acquisition\n<br><br>\nDirect: (732) 272 0301- Email: sourabh@sunrisesys.com\n<br><br>\n<strong>Company Description:</strong>\n<br><br>\nSunrise Systems was founded in 1990 with a clear vision to deliver world-class staffing service solutions in all labor categories, including IT consulting and solutions; all with the commitment to provide service that exceeds expectations and become the most trusted name in the industry. More than two and a half decades later, we pride ourselves on being at the forefront of the staffing industry. Combining our deep industry expertise, insights, and global resources, we have partnered with our clients to connect them with top professionals across several different industries.\n<br><br>\nAt Sunrise Systems, we provide cost effective Managed Staffing Solutions, Information Technology and Information Technology Consulting Services to several Fortune 500 companies and U.S. Government agencies. We provide our clients with flexible engagement models and customized products that are budget and time specific. Understanding the challenges that every business faces, we offer our services either on site at the clients' site or from one of our globally distributed technology centers. Our onshore and offshore development capabilities ensure that we excel at meeting customer requirements every single time.\n<br><br>\nOur collective business experience spans over two and a half decades and ranges from:\n\n\n<ul>\n<li>Business, management, and technical fields</li>\n<li>Information technology consulting and software solutions.</li>\n<li>Providing strategic support for the developmen</li>\n</ul>"}