{"job title": "Scientist I", "company": "TalentBurst", "city state": "– Cambridge, MA", "rating": "3.5", "job description": "Job Description-\n<br>\nA successful candidate will be responsible for developing and executing molecular and cellular assays and methodologies to support target validation projects as well as drug discovery programs.\n<br>\nThe candidate will be responsible for developing, optimizing and implementing functional genomic assays and potentially screen assays for Client target discovery.\n<br><br>\nRequired experiences and skills-\n<br>\nMS degree in biological science with 3- 5 years of experience in the area of molecular and cellular biology\n<br>\nCell culture of adhesion and suspension cells( including primary cell culture).\n<br>\nCell based assays (proliferation, apoptosis, cytotoxicity; luciferase reporter assays, Elisa western blot assay).\n<br>\nDNA and RNA isolation, PCR, RT-PCR and qPCR.\n<br>\nMolecular cloning (recombinant DNA cloning, PCR, plasmid preparation, DNA sequencing analysis, site directed mutagenesis).\n<br>\nGenome editing, Using CRISPR/Cas9 system to KO or KI gene in mammalian cells.\n<br>\nDesign and perform siRNA transfection; inducible shRNA lentivirus infection and rescue with shRNA resistant cDNA.\n<br>\nGeneration Lentivirus vector, packaging virus, virus titer, transduction mammalian cells and establish stable transgenic line.\n<br>\nExperience in cell imaging\n<br>\nCandidate must be a strong team player with excellent oral and written communication skills and be able to work independently to design experiments, interpret data, and troubleshoot.\n<br><br>\nEducation-\n<br>\nBS or MS degree in biological science\n<br><br>\n<strong>Company Description:</strong>\n<br><br>\nTalentBurst is an award winning IT, Accounting &amp; Finance staffing firm headquartered in Boston with offices in San Francisco, Miami, Milwaukee, Toronto, Bangalore, and Gurgaon. Our clients include the leading social media, technology, banks, utilities, pharmaceutical, and biotech companies.\n<br><br>\nWe work with 75 of the Fortune 500 companies. Our recruiting team is one of the most successful in the industry and has a strong reputation for treating our employees well and helping you find your next dream project.\n<br><br>\n<strong>Benefits</strong>\n<br><br>\nAt TalentBurst, one of our founding principles has been to provide our employees with the best benefits available. Benefits we have available include:\n\n\n<ul>\n<li>Health, Dental, and Vision Plan</li>\n<li>401(k) Plan</li>\n<li>Life Insurance</li>\n<li>Immigration assistance</li>\n<li>Credit Union Membership</li>\n<li>Direct Deposit</li>\n<li>Vacation pay (only for FTEs)</li>\n</ul>"}