{"job title": "Scientist II", "company": "TalentBurst", "city state": "– Austin, TX", "rating": "3.5", "job description": "Scientist II or III, Molecular Biology\n<br><br>\n<strong>Required responsibilities:</strong>\n<br><br>\nWill apply technical knowledge to develop kits/reagents/instruments for nucleic acid purification from various sample types, which include FFPE, blood, plasma, cells and tissues Will conduct experiments and/or evaluation of specific productsWill contribute as a team member to meet pre-defined goals Modify experimental procedures to suit the particular needs of experimentsDevelop a hypothesis and then design the necessary set of experiments to test the hypothesis with limited guidanceAnalyze the data derived and explain the outcome of their experimentsHas expertise with one or two specific scientific procedures and areas of researchHas general textbook knowledgeMaintain accurate and detailed lab notebooks and appropriate documentation based on the scientific method enabling other scientists to reproduce their experimentsMay assist in preparing material for manuals, articles for the newsletter, patents or scientific publicationsPrepares regular reports documenting experimentsPresents research data and conclusions in 10-30 minute sessionsAbility to read a scientific paper, reproduce the experiments described and understand the conclusionsAble to exercise independent judgment within generally defined procedures, laboratory methods and techniquesAble to recognize need for deviation from set procedures\n<br><br>\n<strong>Skills and attributes:</strong>\n<br><br>\nStrong laboratory and technical hands on skills required:\n<br><br>\nPipet and perform procedures reproduciblyPerform a dilution series to create a standard curvePerform lab calculations needed to make solutions from powder or from stock solutions and ability to make the buffers from recipesOperate most basic lab equipment such as computers, centrifuges, UV light box and camera, quantitation instruments, Agilent Bioanalyzer, PCR and qPCR instruments, plate reader.Routine experience with most common molecular procedures such as nucleic acid isolation, PCR, RT-PCR...\n<br>\nLevel of comfort with complex biological instrumentation such as microtomes and homogenizersFamiliarity with next-generation technologies such as library prep, sequencing, digital PCR. Working experience a plusExperience with nucleic acid purification automationExperience working with BSL2 sample typesStrong theoretical understanding of the proceduresBasic knowledge of word processing, spreadsheet programs, powerpoint, e-mail and searching the internet.Creative and innovativeGood writing &amp; presentation skillsStrong documentation skillsStrong organizational skillsWorks well in a team settingStrong multi-tasking skillsShows initiative by taking on new tasks, beyond what is generally expected\n<br><br>\n<strong>Requirements:</strong>\n<br>\nBachelors or Masters degree in Biological Science, chemistry, biochemistry, biomedical engineering or related field.\n<br>\nAt least 3 years laboratory experience in either academic or industry setting. Industrial experience in product development environment a plus.\n<br><br>\n<strong>Company Description:</strong>\n<br><br>\nTalentBurst is an award winning IT, Accounting &amp; Finance staffing firm headquartered in Boston with offices in San Francisco, Miami, Milwaukee, Toronto, Bangalore, and Gurgaon. Our clients include the leading social media, technology, banks, utilities, pharmaceutical, and biotech companies.\n<br><br>\nWe work with 75 of the Fortune 500 companies. Our recruiting team is one of the most successful in the industry and has a strong reputation for treating our employees well and helping you find your next dream project.\n<br><br>\n<strong>Benefits</strong>\n<br><br>\nAt TalentBurst, one of our founding principles has been to provide our employees with the best benefits available. Benefits we have available include:\n\n\n<ul>\n<li>Health, Dental, and Vision Plan</li>\n<li>401(k) Plan</li>\n<li>Life Insurance</li>\n<li>Immigration assistance</li>\n<li>Credit Union Membership</li>\n<li>Direct Deposit</li>\n<li>Vacation pay (only for FTEs)</li>\n</ul>"}