{"job title": "Software Engineer/Data Scientist, NLP - Ads Targeting &amp; Modeling", "company": "Twitter", "city state": "– San Francisco, CA", "rating": "4.0", "job description": "<div>\n<div>\n<div>\n<div>\n<div>\nSoftware Engineer/Data Scientist, NLP - Ads Targeting &amp; Modeling</div><br>\n\n<div>\nSan Francisco, CA</div></div>\n</div>\n </div>\n</div><br>\n\n<div>\n<div>\n<div>\n<div>\n<div><strong>Who we are:</strong>\n<br><br>\nOur mission is to provide tools that enable advertisers to reach niche interest groups and personas that resonate with their business. We accomplish this by leveraging machine learning to infer user attributes such as demographics and interests. Advertisers can then use these attributes to specify the type of person their advertisement should target.\n<br><br>\n<strong>What you will do:</strong>\n<br><br>\nThe best way to understand a person’s interests is by understanding how they spend their time online. If we can understand the topics, concepts, and entities related to and referenced in the online content that people engage with on and off of Twitter, then we can understand a person’s interests in great detail. You will help us build machine learned models, as well as the platform that leverages these models to automatically classify tweets, websites, mobile applications, and real world points of interest. You will build cutting-edge deep learning models for understanding the semantics of text, images, and videos. Finally, you will help us build a state-of-the-art entity resolution platform that can identify references to people, places, and things found in text, images, and videos, and then automatically link these references to entity records in our knowledge-base.\n<br><br>\n<strong>Who you are:</strong>\n<br><br>\nYou’re an information retrieval engineer, applied data scientist or machine-learning engineer who wants to work on exciting NLP, image, and video machine learning problems.\n<br><br>\n<strong>Requirements:</strong>\n<ul>\n\n<li>MS or PhD in computer science, data mining, machine learning, information retrieval, recommendation systems, natural language processing, statistics, math, engineering, operations research, or other quantitative discipline; or equivalent work experience</li>\n<li>4+ years industry experience</li>\n<li>Skilled in using machine learning to model text, images, and videos</li>\n<li>Fluent in one or more object oriented languages like Java, Scala, C#, C++</li>\n<li>Experience with Hadoop, Pig or other MapReduce-based architectures</li>\n<li>Knowledgeable of core CS concepts such as: common data structures and algorithms.</li>\n<li>Comfortable conducting design and code reviews.</li>\n<li>Experienced in operating Linux-based systems.</li>\n<li>Passionate about working with large unstructured and structured data sets</li>\n\n</ul>\nWe are committed to an inclusive and diverse Twitter. Twitter is an equal opportunity employer. We do not discriminate based on race, ethnicity, color, ancestry, national origin, religion, sex, sexual orientation, gender identity, age, disability, veteran, genetic information, marital status or any other legally protected status.<br><br>San Francisco applicants: Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</div></div>\n</div>\n </div>\n</div><br>\n\n<div><div><div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n</div></div></div></div></div></div></div></div></div>"}