{"job title": "Data Science Specialist - 3m", "company": "3m", "city state": "– Minnesota", "rating": "3.9", "job description": "<strong> Position Description</strong>\n<br><br>\n<strong> Job Summary</strong> :\n<br><br>\nAt 3M, Science Applied to Life isnt just a slogan its what our data scientists do every day. Our data scientists help improve lives of people with respiratory issues, enable autonomous transportation, keep workers and soldiers safe, and advance health information systems. Our broad market presence and global reach enables your work to have significant impact. 3M is headquartered in the beautiful Twin Cities of Minnesota, known nationwide for their outdoor recreation opportunities, thriving arts, professional sports, and extremely high quality of life.\n<br><br>\nThe person hired for the position of will develop technologies in the areas of machine learning, data science, deep learning, artificial intelligence, or computer vision that create new opportunities for 3M. The Artificial Intelligence Lab works with all the companys business groups to develop digital products and solutions, capitalizing on 3Ms unique materials, advanced technologies, and global reach. At 3M, our data scientists analyze data, create algorithms, and develop real-world solutions for many businesses and markets, including health information, worker safety, digital oral care, power grid, transportation, and many more.\n<br><br>\nThis position provides an opportunity to transition from other private, public, government or military environments to a 3M career.\n<br><br>\n<strong> Primary Responsibilities</strong> include but are not limited to the following:\n<li> Leverage expertise to develop and lead new technologies, providing new growth opportunities in addition to supporting existing 3M products and businesses</li> <li> File patent applications, publish, and present at appropriate conferences</li> <li> Work with global teams to implement impactful solutions in 3Ms diverse markets</li> <li> Collaborate with research teams in corporate research and in business labs to build capabilities and applications to solve emerging challenges</li> <li> Analyze data, develop algorithms, and deploy solutions based on real-world data</li>\n<strong> Basic Qualifications:</strong>\n<li> Possess a Bachelor's degree or higher (completed and verified prior to start) in a science or engineering discipline from an accredited university</li> <li> Minimum of one (1) year of experience (post-academic) working with real world data</li>\n<strong> Preferred Qualifications:</strong>\n<li> Master's degree or higher in Computer Science, Electrical Engineering, Data Science, Cognitive Science, Software Engineering, Applied Physics, Applied Mathematics or related discipline from an accredited university</li> <li> Minimum two (2) years of experience in machine learning, deep learning, data science, computer vision, artificial intelligence, statistics, and/or applied mathematics in industrial and/or national lab environment</li> <li> Fluent in one or more programming languages (e.g. Python, MATLAB, C, C++ and/or R)</li> <li> Strong scientific and technical acumen, with demonstrated interest and ability to make connections between science/technology and real-world concerns</li> <li> Strong problem-solving skills</li> <li> Ability to deal with the ambiguity of early-stage scouting and evaluation of new opportunities and the flexibility to change direction as additional information becomes available</li> <li> Demonstrated scientific excellence as evidenced by publications and presentations</li> <li> Demonstrated leadership and networking skills</li> <li> Self-motivated and self-directed</li> <li> Excellent communication skills (oral, written and presentation)</li>\n<strong> Travel:</strong>  May include up to 10%\n<br><br>\n<strong> Relocation:</strong> Is authorized\n<br><br>\nThis posting is for a Data Science Specialist position at 3M Maplewood. 3M anticipates that multiple openings for this position will occur over time, during the next year. Qualified applicants may be considered as Data Science Specialist openings occur at 3M Maplewood, and 3M will accept applications for up to 1 year from the posting date of this requisition. Applications will be kept open and active until 5/14/2019. After that, the posting will be taken down and applicants will need to apply/re-apply for available open postings at that time."}