{"job title": "HIS Data Engineer", "company": "3m", "city state": "– Salt Lake City, Utah", "rating": "3.9", "job description": "<strong> Position Description</strong>\n<br><br>\n(HIS) is the world leader for innovating the language of health and delivers comprehensive software and consulting services. Working at 3M Health Information Systems you will be helping with todays challenges while preparing for tomorrows. Transforming health care from a system that treats disease, to a system that improves health and wellness begins with accurate health information and payment. From improving the efficiency of medical records coding to outlining success in value-based care and healthcare analytics. All while working with the best and the brightest to advance more than your own career, you are working to advance the entire world.\n<br><br>\n<strong> Job Summary</strong> :\n<br><br>\nAs a Data Engineer in the Research and Applied Data Science team, you will build data pipelines to feed machine learning models and implement services to expose those models into production pipelines to AI-enable 3M HIS products to better address some of the most interesting and important questions in healthcare. These may include the risk of readmission, the risk of healthcare complications, and suggesting accurate medical codes. You will also develop prototypes and proof of concept applications using new technologies and frameworks that help explore and set the future technical direction for 3M HIS. You'll work collaboratively with a team of driven individuals to find ways to better leverage 3M HIS data to improve 3M products for our customers in the healthcare system. In this position, you'll also represent 3M HIS in the broader machine learning community, to partners, and to clients.\n<br><br>\n<strong> Primary Responsibilities</strong> include but are not limited to the following:\n<li> Apply cloud, data, software engineering skills to enable both building and deployment of machine learning / artificial intelligence models.</li> <li> Apply software engineering skills to explore new technologies and frameworks to shape the future technical direction for 3M HIS.</li> <li> Collaborate with other team members (data scientists and data engineers) on data analysis workflow, data pipelines, analysis techniques, and opportunities for model improvements.</li> <li> Clearly articulate and document research and findings in code, notebook, and presentation form.</li> <li> Become an active participant in larger 3M machine learning/data science community.</li> <li> Actively participates in relevant corporate programs/initiatives, complies with professional and quality standards complies with corporate policies and procedures, and acts in a manner consistent with 3Ms values and ethical standards.</li>\n<strong> Basic Qualifications:</strong>\n<li> Possess a Bachelors degree or higher (completed and verified prior to start) from an accredited institution OR High School Diploma/GED or higher from and accredited institution and three (3) years of software development experience in lieu of a Bachelor's degree education requirement</li> <li> Minimum of three (3) combined years of experience developing server side and/or database related software in Python</li> <li> Minimum of three (3) years experience developing software in C#/Java</li> <li> Minimum of three (3) years experience developing software using SQL and an RDBMS</li>\n<strong> Preferred Qualifications:</strong>\n<li> Experience working with Amazon Web Services (AWS) environment. Proficiency in working with S3, EC2, CloudFormation, CloudTrail.</li> <li> Experience working in a healthcare software development environment including an understanding of HIPAA and developing software that secures patient health information.</li> <li> Highly self-directed and able to manage and prioritize multiple concurrent and competing or conflicting challenges and issues</li> <li> Excellent analytical and problem-solving skills</li> <li> Demonstrated team player with a results-oriented track record</li> <li> Strong planning and time management skills</li> <li> Medical field experience, ideally including experience with the output of NLP systems and/or application of deep learning techniques to NLP.</li> <li> Experience with deep learning libraries such as Keras, Tensorflow, Theano, or Pytorch</li> <li> Experience with distributed computing platforms such as Spark.</li> <li> Experience applying machine learning technologies in a large-scale industrial production environment, especially including deployments to cloud infrastructure such as AWS, GCP, or Azure.</li>\n<strong> Travel:</strong>  May include up to 10% domestic\n<br><br>\n<strong> Relocation:</strong>  Is not authorized\n<br><br>\nThis position provides an opportunity to transition from other private, public, government or military environments to a 3M career.\n<br><br>\n<strong> 3M Ethics</strong> .\n<br><br>\nMost Recent great-news / Awards: 3M received recognition as being A Most Ethical Company! Promoting Ethical Business standards and practices internally, enabling managers and employees to make good choices, and shaping future industry standards by introducing tomorrow's best practices today. Honorees have historically out-performed others financially, demonstrating the connection between good ethical practices and performances that are valued. To View this recognition, please visit:\n<br><br>\n<strong> Diverse &amp; Inclusive 3M</strong>\n<br><br>\n3M is a place where you can collaborate with other curious, creative people. Where your diverse talents, inclusiveness, initiative, and leadership are valued. Where youll find challenging opportunities that make your career exciting and rewarding. With a diversity of people, global locations, technologies, and products, 3M is a place to grow and be rewarded for excellence."}