{"job title": "Scientist - Medicinal Chemistry", "company": "Amgen Inc.", "city state": "– Thousand Oaks, CA", "rating": "3.7", "job description": "Career CategoryResearchJob DescriptionThis Scientist will be part of an innovative Medicinal Chemistry group, with responsibilities including (but not limited to) the design, synthesis, and purification of novel compounds for potential clinical drug development.\n<br><br>\nThe successful candidate will devise and implement creative scientific research through conducting laboratory experiments, planning detailed procedures for defined projects including timelines, milestones, methodological approaches, expected results and necessary resources; reviewing, analyzing, and interpreting scientific data and results; providing regular updates, documentation, and/or communication on project results; collaborating with other scientists and keeping current with field of expertise, including literature and technology development. Additional responsibilities may include advising supervisors and colleagues in areas of expertise; participating in national and international scientific meetings; providing scientific results that support the generation of publications, patents, or regulatory submissions and mentoring research associates and laboratory assistants.\n<br><br>\nBasic Qualifications\n<br><br>\nDoctorate degree OR Doctorate degree completed by May 2019\n<br><br>\n<strong>OR</strong>\n<br><br>\nMaster's degree and 4 years of scientific experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nBachelor's degree and 6 years of scientific experience\n<br><br>\nPreferred Qualifications\n<br><br>\nChemistry degree specializing in organic synthesis\n<br><br>\nProven track record of academic accomplishments (i.e., peer-reviewed publications and/or patents)\n<br><br>\nDemonstration of good lab practices, with particular attention to safety\n<br><br>\nClear understanding of structural determination using NMR and mass spectral techniques as well as knowledge of related purification methods\n<br><br>\nUnderstanding of biological and pharmaceutical principles and a working knowledge of the use of structure-based or other computer-aided drug design tools\n<br><br>\nKnowledge of the application of parallel synthesis techniques to medicinal chemistry\n<br><br>\nExcellent communication skills (both written and oral)\n<br><br>\nA Fortune 150 company operating in nearly 100 countries around the world, we invest in highly skilled, dedicated and collaborative individuals who are ready to contribute to our mission in meaningful ways and make a difference in the lives of our patients. That's why, as a member of our cross functional, cross discipline team, we provide you with valuable opportunities to broaden your experience and maximize your potential. Focused on the industry's most compelling scientific discoveries and housed within industry leading facilities within the heart of the world's leading biotechnology hub, our colleagues are growing our pipeline through groundbreaking innovations. We believe in rewarding those who do rewarding work and are committed to providing careers that can help turn the tide of serious, life interrupting illnesses.\n<br><br>\n<strong>#LI-DNP</strong>\n<br><br>\nJoin Us\n<br><br>\nIf you're seeking a career where you can truly make a difference in the lives of others, a career where you can work at the absolute forefront of biotechnology with the top minds in the field, you'll find it at Amgen.\n<br><br>\nAmgen, a biotechnology pioneer, discovers, develops and delivers innovative human therapeutics. Our medicines have helped millions of patients in the fight against cancer, kidney disease, rheumatoid arthritis and other serious illnesses.\n<br><br>\nAs an organization dedicated to improving the quality of life for people around the world, Amgen fosters an inclusive environment of diverse, ethical, committed and highly accomplished people who respect each other but compete intensely to win. Together, we live the Amgen values as we continue advancing science to serve patients.\n<br><br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n<br><br>\n."}