{"job title": "Scientist I - Analytical Development", "company": "Charles River Laboratories", "city state": "– Woburn, Massachusetts", "rating": "3.0", "job description": "Scientist I - Analytical Development\n<br><br>\nReq ID #: 39008\n<br><br>\n<strong>Location:</strong>\n<br>\nWoburn, MA, US, 01801\n<br><br>\nFor 70 years, Charles River employees have worked together to assist in the discovery, development and safe manufacture of new drug therapies. When you join our family, you will have a significant impact on the health and well-being of people across the globe. Whether your background is in life sciences, finance, IT, sales or another area, your skills will play an important role in the work we perform. In return, we'll help you build a career that you can feel passionate about.\n<br><br>\nJob Summary\n<br><br>\nWe are seeking an experienced Scientist I - Analytical Development for our Biologics group located in Woburn, MA.\n<br><br>\nThe Scientist I - Analytical Development position will assist in the development of methods related to the testing and characterization of biotherapeutics using analytical instrumentation and methodologies. Under minimal supervision, this position may be responsible for method development, client interaction, interpretation and reporting of data and regulatory compliance of assigned research projects. Other responsibilities for this position include:\n\n\n<ul>\n<li>Perform and troubleshoot laboratory experiments, test, and procedures within accepted regulatory compliance for the characterization and analysis of biotherapeutics through use of analytical testing and characterization instrumentation and methodologies.</li>\n<li>Perform routine testing techniques such as the following with a high degree of reliability, efficiency and accuracy:</li>\n<li>Chromatographic Analyses including Process Related Residuals</li>\n<li>Quantitative Monosaccharide and Sialic Acid Analysis</li>\n<li>ELISA/ Immunoassay Analyses</li>\n<li>Process Residual/Drug Product Excipient Analyses</li>\n<li>N- Terminal Sequencing</li>\n<li>Amino Acid Compositional Analysis/Extinction Coefficient Determination</li>\n<li>Review, interpret, integrate and present experimental data using assistance of senior technical staff as appropriate, assist in reviewing procedures and data, and generate high-quality protocols and reports in conjunction with senior research personnel.</li>\n<li>Provide technical guidance to junior staff and assist in long-term projects (redesign of SOPs, STMs, basic research procedures or report formats).</li>\n<li>Interact with the client regarding project design, scheduling and conduct as requested as well as collaborate with appropriate departments to coordinate performance of projects, discuss issues and prepare reports.</li>\n</ul>\n\nThe following are minimum requirements related to the Scientist I - Analytical Development position.\n\n\n<ul>\n<li>Bachelor's degree (B.A. /B.S.) or equivalent in Chemistry/Biotechnology or related scientific discipline. M.S. or Ph.D. preferred.</li>\n<li>Minimum three years experience within a contract research, academic or pharmaceutical industry, including experience in the core competencies of characterization and analysis of biotherapeutics.</li>\n<li>An equivalent combination of education and experience with contract research or the pharmaceutical industry may be accepted as a satisfactory substitute for the specific education and experience listed above.</li>\n<li>Ability to work on problems of moderate scope where analysis of situation or data requires a review of identifiable factors. Exercises judgment within defined procedures and practices to determine appropriate action.</li>\n<li>Effective written and verbal communication skills with the ability to handle multiple projects, prioritize work and meet deadlines within a cGMP environment.</li>\n<li>Capable of data interpretation of basic characterization and analysis of biotherapeutics (glycoproteins and peptides) using analytical laboratory tools and methodologies</li>\n<li>Capable of anticipating and recognizing potential problems.</li>\n<li>Regularly observes, inspects and interprets laboratory experiments, requiring close vision and the ability to adjust focus and detect and differentiate colors.</li>\n<li>While performing the duties of this job, regularly required to wear personal protective equipment (safety glasses or goggles, face shield, gloves, respirator et al.), work near toxic or caustic chemicals, and work with biohazards.</li>\n</ul>\n\nAbout Biologics Testing Solutions\n<br>\nWith more than 50 years of experience and proven regulatory expertise, the Charles River Biologics group can address challenging projects for biotechnology and pharmaceutical companies worldwide. Offering a variety of services such as contamination and impurity testing, protein characterization, bioassays, viral clearance studies and stability and lot release programs, we support clients throughout the biologic development cycle, from the establishment and characterization of cell banks through preclinical and clinical studies to marketed products. Whether clients need stand-alone services, a unique package of testing, or insourced support, our Biologics group can create a custom solution to suit their needs. Each year more than 20,000 biologic testing reports are sent each and over 200 licenses products are supported by our biologics testing solutions team.\n<br><br>\nAbout Charles River\n<br>\nCharles River is an early-stage contract research organization (CRO). We have built upon our foundation of laboratory animal medicine and science to develop a diverse portfolio of discovery and safety assessment services, both Good Laboratory Practice (GLP) and non-GLP, to support clients from target identification through preclinical development. Charles River also provides a suite of products and services to support our clients' clinical laboratory testing needs and manufacturing activities. Utilizing this broad portfolio of products and services enables our clients to create a more flexible drug development model, which reduces their costs, enhances their productivity and effectiveness to increase speed to market.\n<br><br>\nWith over 13,000 employees within 80 facilities in 23 countries around the globe, we are strategically positioned to coordinate worldwide resources and apply multidisciplinary perspectives in resolving our client's unique challenges. Our client base includes global pharmaceutical companies, biotechnology companies, government agencies and hospitals and academic institutions around the world.\n<br><br>\nAt Charles River, we are passionate about our role in improving the quality of people's lives. Our mission, our excellent science and our strong sense of purpose guide us in all that we do, and we approach each day with the knowledge that our work helps to improve the health and well-being of many across the globe. We have proudly supported the development of 80% of the drugs approved by the FDA in 2017.\n<br><br>\nFor more information, please visit **************.\n<br><br>\nEqual Employment Opportunity\n<br>\nCharles River Laboratories, Inc. is an Equal Opportunity Employer M/F/Disabled/Vet\n<br><br>\nNearest Major Market: Woburn\n<br>\nNearest Secondary Market: Boston\n<br>\nJob Segment: Chemistry, Analytics, Scientific, Biotech, Scientist, Science, Engineering, Management"}