{"job title": "Director of Data Science", "company": "Feedzai", "city state": "– Atlanta, GA", "rating": "3.5", "job description": "Feedzai is AI. We’re coding the future of commerce with a leading platform powered by artificial intelligence and big data. Founded and developed by data scientists and aerospace engineers, Feedzai has one critical mission: make commerce safe. The world’s largest banks, payment providers and retailers use Feedzai’s machine learning technology to manage risks associated with banking and shopping, whether it’s in person, online or via mobile devices.\n<br><br>\nYou\n<br><br>\nYou will be managing a distributed team of up to six (6) Data Scientists who are part of our client delivery team. The team’s mission is to takes on complex fraud detection problems for our enterprise level clients using Feedzai’s unique product and platform. In addition, the team is tasked with creatively developing and coding innovative data science solutions for our clients that can be generalized as product enhancements. Our client delivery team works with clients all over the USA. Each client project takes between 6 and 12 months to complete.\n<br><br>\nWe are currently recruiting two (2) Data Scientist Directors to be based out of our San Mateo, CA or Atlanta, GA office. For the right candidate, we would also consider a position in our NY office.\n<br><br>\nYour day–to–day\n<br><br>\nYou will be 40% Hands on Data Science and 40% reviewing work of the team:\n<br><br>\nYou will be integral in providing guidance to our Product and Research teams based on insights and models developed for individual clients\n<br>\nOwn the data science relationship with the client for up to 2 client projects\n<br>\nEffectively understand business objectives and communicating data science insights and progress to a non-technical audience\n<br>\nImplement Feedzais machine learning algorithm into our client’s data feeds\n<br>\nWork with the client to explore their data and better understand it\n<br>\nContribute to the team knowledge by keeping up with the state-of-the-art in machine learning applied to our domains\n<br>\nYou will be 20% Team Building\n<br><br>\nBuild out and manage the new employee experience on this team\n<br>\nConduct the performance management process for this team\n<br>\nYour know how\n<br><br>\nYou have 4+ years of Data Science experience\n<br>\nYou have a PhD, in CS, Physics, Engineering, Stats, or similar technical discipline\n<br>\nYou have strong experience with a range of statistical and machine learning techniques, ideally via open source libraries and proprietary models.\n<br>\nYou have experience managing teams\n<br>\nYou have experience with extracting insights from raw data and transforming into useful features\n<br>\nYou can code proficiently in R/Python and an object-oriented language\n<br>\nYou have experience with big data platforms such as Hadoop, MapReduce, Spark, Hive, and Pig\n<br>\nYou are comfortable presenting to non-technical customers.\n<br>\nExperience with building models for fraudulent financial transactions is highly valued\n<br>\nTravel Requirements:\n<br><br>\nUp to 35% travel within the USA\n<br>\nWhile at the client location Feedzai provides corporate housing and meal reimbursement"}