{"job title": "Master Data Management Engineer", "company": "General Mills", "city state": "– Minneapolis, MN", "rating": "3.7", "job description": "Master Data Management Engineer\n<br><br>\nGeneral Mills, Inc. has an opening for a Master Data Management Engineer at our facility in Minneapolis, Minnesota. The Master Data Management Engineer is responsible for implementing a Master Data Management (MDM) solution to reshape the company's core processes. This involves replacing the existing legacy workflow tools and rebuilding a holistic MDM workflow with appropriate validations that reduces time and effort to bring products to life through the company's processes and systems. This position requires a Bachelor's degree or equivalent in Computer Science, Computer Applications, Computer Information Systems, or a related field and five (5) years of related (progressive, post-baccalaureate) experience in Master Data Management. Must also have five (5) years of demonstrated ability (which may have been gained concurrently) with each of the following: (1) coordinating work with both Strategic and Technical Consulting third parties; (2) collaboratively developing the technology and capability roadmap for the Management of Master Data; (3) analyzing business requirements and constructing the processes and data flows to support the requirements; and (4) Technologies: PL/SQL, writing procedures, triggers, MySQL, Java script, Ajax, HTML 5, Dojo, CSS, JSON, Data mapping, Java connectors, ETL Tools, Product Information Management Tools, Eclipse-Ganymede, Informatica Powercenter 9.5.1, Informatica Hub, PIM Stibo Tool, HP Service Center Remedy, WebSphere Application Server 7.0, Windows XP, and UNIX. Must also have three (3) years of demonstrated ability (which may have been gained concurrently) with each of the following: (1) designing and implementing a Stibo MDM solution including the architectural design, integration to SAP ECC and non-SAP downstream systems; (2) participating in the evaluation, implementation and deployment of MDM tools and processes; (3) and leading design, code, and process review sessions to ensure compliance with established MDM standards, policies, and performance guidelines.\n<br><br>\nEqual Opportunity Employer<br><br>recblid hga4ys22mx0s8jb0nrl594q1x4sm0z\n<br><br>\nAssociated topics: data administrator, data architect, data quality, data scientist, data warehouse, data warehousing, database administrator, hbase, mongo database, mongo database administrator"}