{"job title": "ES Manager Data&amp;Analytics", "company": "GlaxoSmithKline", "city state": "– Warren, NJ", "rating": "3.7", "job description": "<strong>Your Responsibilities:</strong>\n<br><br>\n<strong>Your Responsibilities:</strong>\n<br><br>\nGSK is on a journey towards digital transformation to become the global leader in bringing the best in class analytics and insights, to serve the consumer and patient. In April 2017, Emma Walmsley, formerly the Head GSK Consumer, was appointed CEO of GSK and has been vocal about her desire to accelerate GSK's digital transformation. This strategy is far reaching and will extend to all corners of the business from Big Data and applications of artificial intelligence in Healthcare to New Media in bringing to life consumer brands for Expert Sales&amp;Marketing across North America and LATAM countries.\n<br><br>\nThe role is rare in that the scope for you to make an impact is very real and you will interface significantly with senior colleagues across the company in the Commercial Business&amp;in the digital business including product development and new product introduction. This is an excellent time to be joining a highly successful market leader in the healthcare industry and drive significant technology change across the organization.\n<br><br>\nThe ideal candidate is highly experienced in conducting business analysis on multiple projects simultaneously in a distributed global matrix environment with an expertise in SQL and BI tools providing strategic, consultative insights/analysis to senior management across the company in Expert Sales, Commercial, Marketing&amp;in the digital business across North America and LATAM.\n<br><br>\nInfluences strategic decisions with current brand portfolios, new product launches and/ or introductions to the marketplace and the Healthcare Provider that drive our sales. The Business Data&amp;Analytics manager will join a strong technical team in a highly demanding area of the Expert Sales business and should possess a strong background in technology and driving business strategy. This role has changed from providing analysis of Healthcare provider (HCP) transactional data, insights gathered from the CRM system and segmentation&amp;targeting of HCPs to a more strategic role responsible for delivering digital transformation for our Expert sales business, delivering key and critical metrics in line with our strategic purpose of expanding HCP reach.\n<br><br>\n<strong>Key Duties:</strong>\n\n\n<ul>\n<li>Responsible for providing the strategic direction through in-depth analytics which helps set how to best leverage Expert sales resources to deliver the needs of the Expert business and improve productivity across North America&amp;LATAM countries</li>\n<li>Develop high-level business requirements / use cases for projects to support business justification and drive Expert Sales&amp;Marketing strategy.</li>\n<li>Responsible for all emerging capabilities such as Sales Reporting tools, Sales Forecasting tools, SAP Utilization, Microsoft Power BI, SalesForce.com, Territory&amp;Segmentation tools.</li>\n<li>Provide leadership&amp;best practice guidance for requirements analysis and prioritization.</li>\n<li>Development of scorecards and dashboards for use in visual performance management that drives Expert Sales&amp;Marketing strategy.</li>\n<li>Manage / oversee all Systems analytics responsible for managing all aspects of Sales utilization of GSK Global reporting tool Microsoft PowerBI</li>\n<li>Sets the strategic direction with the Technical business lead for Microsoft PowerBI for Expert Sales</li>\n<li>Responsible for defining the strategy in automating integrated business planning processes utilizing various data inputs for Expert Sales, Marketing, Global Analytics team and Finance.</li>\n<li>Understand the different nature of commercial challenges (ie, legal, compliance, financial reporting, country specific) in globally diverse business models in order to frame business analysis in a business context within the NA&amp;LATAM Expert business.</li>\n<li>Understand when to highlight risks or issues and ability to clearly communicate them to management teams and stakeholders.</li>\n<li>Operate effectively in a globally distributed matrix environment</li>\n<li>GSK-LI</li>\n</ul>\n\n<strong>Why You?Basic qualifications:</strong>\n\n\n<ul>\n<li>Bachelor's Degree, IT/Business preferred</li>\n<li>Extensive experience coding in SQL</li>\n<li>Experience with BI Powertools&amp;Reporting</li>\n<li>Significant SAP Operating Environment experience</li>\n<li>5 years of Data Analytics experience, Sales Force System Support, Data Scientist</li>\n<li>Ability to travel 10-25% of the time</li>\n</ul>\n\n<strong>Preferred qualifications:</strong>\n<br><br>\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>7 years of Data Analytics experience</li>\n<li>Six Sigma</li>\n<li>Project Management</li>\n<li>Experience with AI</li>\n</ul>\n\n<strong>Why GSK?:</strong>\n<br><br>\nGSK Consumer Healthcare is one of the world's largest consumer healthcare companies. Our purpose is to help more people around the world to do more, feel better and live longer with everyday healthcare products. We have a heritage that goes back over 160 years. We own some of the world's best loved healthcare brands, including Sensodyne®, Theraflu®, Excedrin®, Nicorette® and NicoDerm®CQ®, Flonase® and TUMS®.\n<br><br>\nOur goal is to build a global, growing business we call a Fast Moving Consumer Healthcare company, dedicated to everyday healthcare with all of the scientific expertise and quality guarantees that demands, working at the speed and with the genuine consumer understanding the modern world expects.\n<br><br>\n<strong>Contact information:</strong>\n<br><br>\nYou may apply for this position online by selecting the Apply now button.\n<br><br>\nIf you require an accommodation or other assistance to apply for a job at GSK, please contact the GSK HR Service Centre at 1-877-694-7547 (US Toll Free) or +1 801 567 5155 (outside US).GSK is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive equal consideration for employment without regard to race, color, national origin, religion, sex, pregnancy, marital status, sexual orientation, gender identity/expression, age, disability, genetic information, military service, covered/protected veteran status or any other federal, state or local protected class.\n<br><br>\nImportant notice to Employment businesses/ Agencies\n<br><br>\nGSK does not accept referrals from employment businesses and/or employment agencies in respect of the vacancies posted on this site. All employment businesses/agencies are required to contact GSK's commercial and general procurement/human resources department to obtain prior written authorization before referring any candidates to GSK. The obtaining of prior written authorization is a condition precedent to any agreement (verbal or written) between the employment business/ agency and GSK. In the absence of such written authorization being obtained any actions undertaken by the employment business/agency shall be deemed to have been performed without the consent or contractual agreement of GSK. GSK shall therefore not be liable for any fees arising from such actions or any fees arising from any referrals by employment businesses/agencies in respect of the vacancies posted on this site.\n<br><br>\nPlease note that if you are a US Licensed Healthcare Professional or Healthcare Professional as defined by the laws of the state issuing your license, GSK may be required to capture and report expenses GSK incurs, on your behalf, in the event you are afforded an interview for employment. This capture of applicable transfers of value is necessary to ensure GSK's compliance to all federal and state US Transparency requirements. For more information, please visit GSK's Transparency Reporting For the Record site."}