{"job title": "Associate Principal Scientist, MSAT", "company": "Lonza, Inc.", "city state": "– Newington, NH", "rating": "2.8", "job description": "At Lonza, we invest in great people. We encourage our employees to challenge themselves and we offer an environment that fosters creativity and success. Headquartered in Basel, Switzerland, we operate production, R&amp;D, and business sites around the world, including Europe, North America, and Asia. Our vision: We strive to be the leading supplier using science and technology to improve the quality of life. Our mission: We work with passion, using advanced technologies, to transform life science into new possibilities for our customers. Do you want to help us as we shape the future of this great organization? Job Description Summary Overview/Role Purpose: This challenging position is available in the process transfer and support group of the Manufacturing Sciences and Technology Department (MSAT) in our Portsmouth facility. This position is responsible for being the primary technical support person for manufacturing processes. This person has developed a core competency in transferring and supporting processes from first run in plant, PPQ campaigns, and commercial campaigns. The supervisor provides general direction and oversight, as this level of Process Scientist is expected to have a good grasp of the requirements of the role. The individual is a subject matter expert for five aspects of the role. This individual may provide immediate supervision or assign tasks to a unit or or group of employees. Key Accountabilities and Duties: -Performs all functions associated with process transfer and process support, e.g. develop process understanding, perform gap analysis / FMEA, generate process models, author / review Process Descriptions and Batch Records, author / review planned deviations and change controls, perform process monitoring (manufacturing data summary and analysis, data presentation), author campaign summary reports, perform activities for lot release (assess deviations and process changes). Recommends improvements for MSAT practices and procedures. May provide guidance on process transfer and support activities to junior members of the team. -Assess all major deviations including those that impact product quality as well as post lot release deviations that may impact multiple products. Identifies potential Root causes using a systematic approach. Expertise in use / application of variety of problem solving tools e.g. Fishbone, Kepner-Tregoe etc. Able to identify potential solutions and lead multidisciplinary teams in developing and implementing solutions. Performs and is able to understand and interpret all types of complex data analysis such as multiple linear regression analysis, ANOVA, multivariate analysis and identify applications where appropriate. -Authors and reviews process descriptions, definitive formulations, batch records, raw material listings, change controls independently and authors/reviews/modifies the corresponding templates. Able to identify and create new documents that would aid in process transfer or support activities. Identifies process changes and assesses change controls for impact of process / equipment or procedural changes that can affect both process performance and product quality. Supports documentation preparation for regulatory purposes. -Represents MSAT on project teams and interfaces with customer technical and quality representatives. Represents MSAT on internal teams (e.g. Deviation and Run Daily Management System meetings). Participates in Customer and Regulatory Audits. Regularly interacts with site leadership on matters concerning several functional areas and/or customers. Minimum Required Qualifications/Skills: 12+ years of biotech industry experience (<br><br>SDL2017"}