{"job title": "Clinical Lab Scientist - Clinical Trials - HIGH GROWTH", "company": "Medix", "city state": "– Springfield, MO", "rating": "3.2", "job description": "<strong>Medix is partnered with one of its oldest and most trusted clients for an entry level research opportunity!!!</strong>\n<br><br>\n<strong>NEW GRADS ARE ENCOURAGED TO APPLY!!!</strong> Come be part of an exciting and growing team that fosters a learning environment, great leadership, and tremendous opportunity to <strong>grow your career</strong> in the research field.\n<br><br>\nAs part of the clinical trials team you will work on ground breaking pharma studies that will help provide potentially <strong>life saving medication</strong> for patients all across the world.\n<br><br>\n<strong>Job Responsibilities Include:</strong>\n<ul>\n<li>Assist in study related functions including routine animal care consisting of feeding, watering, and cage and room cleaning.</li><li>Maintain support areas and supplies for laboratory animal resources.</li><li>Maintain study support areas and procedure rooms, keeping them clean, stocked, and ready for use</li><li>Provide facilities sanitation and maintenance.</li><li>Provide animal restraint and handling, and performed animal identification and randomization.</li><li>Perform various biological sample collection procedures such as blood, urine, fecal, and tissue samples.</li><li>Perform and collect various study requirements such as observations, food and water consumption, and body weight.</li><li>Perform various animal dosing techniques such as oral and IV administrations.</li><li>Provide procedure room set-up and clean-up.</li><li>Assist in laboratory animal health programs.</li><li>Provide observations of animals for detection of disease or other health problems, and administered prescribed treatments to animals as directed.</li><li>Maintain pertinent records in compliance with SOPs, USDA, FDA, and AAALAC regulations and guidelines.</li><li>Maintain study in-life records in an accurate and legible manner.</li><li>Maintain records pertaining to animal care and use in an accurate and legible manner.</li><li>Assist in the operation and maintenance of equipment such as cage and glassware, scales and balances, and analytical equipment.</li><li>Provide weekend, holiday, and after hours work, usually on a rotational basis.</li><li>Collection and data entry of study parameters.</li><li>Prepare and labeled study containers.</li><li>Participate or assisted in the conduct of studies.</li><li>Assist the clinical veterinarian in physical examination and treatment of laboratory animals.</li><li>Help solve technical problems.</li>\n</ul>\n<strong>Job Requirements Include:</strong>\n<ul>\n<li>2-4 year degree in a life science</li><li>Ability to work 50 hour work weeks</li><li>Ability to be up and moving around</li> <li>Strong attention to detail</li><li>Willingness to help in other areas outside of your own</li>\n</ul>\n<strong>If you are interested please feel free to email Ian Mathews your resume directly at or call 913-529-8763</strong>"}