{"job title": "Senior Data Analyst", "company": "Morgan Stanley", "city state": "– New York, NY", "rating": "3.8", "job description": "Description\n<br><br>\nThe Data Management Organization (DMO) is leading the charge on data strategy and management in MS Research. Given the growing strategic importance of data, the Research DMO is a key enabler to both the \"Offense\" (generating new commercial opportunities) and \"Defense\" (ensuring proper data use and risk management). The group is seeking a seasoned Data Analyst with experience in financial services/banking to create data related offerings. The role is dynamic, fast paced and interacts with multiple stakeholders. The Data Analyst will work closely with SMEs and product owners to cleanse and analyze data, establish data quality standards, look for efficiencies in the business process and work with our technology partners to implement solutions.\n\n\n<ul>\n<li>Cleanse and transform the data for new product development and enhancements</li>\n<li>Analyze data inputs and outputs for new products, detect potential data quality issues, and work collaboratively with SMEs and technology to resolve and implement a scalable solution where needed</li>\n<li>Develop a framework and metrics to measure the data quality of our products</li>\n<li>Create efficient and reusable code meant for the improvement, manipulation, and analysis of data</li>\n<li>Use business knowledge to create variables/attributes that will be leveraged in advanced analytics and models</li>\n<li>Create and maintain data documentation (mapping, rulebooks, etc.)</li>\n<li>Aptitude for analytics and identifying patterns within data to generate business insight</li>\n<li>Shape the data infrastructure of the business, inclusive of warehousing, reporting, and analytics platforms</li>\n<li>Build better data flows and processes to support our Research data efforts and various groups in appropriate and effective use of data</li>\n<li>Identify, manage and communicate risks/issues in projects</li>\n</ul>\n\nTechnical Qualifications\n\n\n<ul>\n<li>Experience with using data profiling tools to query the data, identify anomalies, gaps and issues</li>\n<li>Data mining experience</li>\n<li>Experience in data quality management</li>\n<li>Experience in modern programming languages (Python, Perl, JavaScript) and statistical packages such as R or SAS</li>\n<li>Experience in working with data in various forms (data warehouses/SQL, unstructured data environments/PIG,HIVE, Impala)</li>\n<li>General awareness of data management practices, emerging trends, and issues</li>\n<li>Experience in the financial services sector</li>\n</ul>\n\nRequired\n\n\n<ul>\n<li>Bachelor's Degree from an accredited higher learning institution required or equivalent combination of experience and education (preferred area of study: Economics, Quantitative Analysis, Business, Mathematics, Computer Science or other similar fields)</li>\n<li>5 years experience as a data analyst, data scientist, or related quantitative role with some experience managing junior personnel</li>\n<li>3 years experience in banking/financial services</li>\n<li>Excellent analytical and reasoning skills; able to decompose complex problems and projects into manageable pieces; comfortable suggesting and presenting solutions</li>\n<li>Comfortable working in a large organization with a broad set of stakeholders across various functions (i.e., Business, IT, Operations)</li>\n<li>Proven track record of answering business questions using a quantitative, data-driven, analytical approach</li>\n<li>Excellent verbal and written communication skills presenting complex analytical results to technical and non-technical audiences</li>\n<li>Ability and desire to work in a start-up paced environment and culture</li>\n</ul>"}