{"job title": "Senior Scientist, Bioassay Development", "company": "Oncobiologics Inc", "city state": "– Cranbury, NJ", "rating": "3.6", "job description": "<strong>Opportunity and Summary of Position:</strong>\n<br><br>\nSenior Scientist, Bioassay Development, will be responsible for the development, qualification, validation and technical transfer of robust biological test methods for biosimilar monoclonal antibodies. Methodologies include, but are not limited to proliferation inhibition assays, reporter gene assays, immune mediated cytotoxicity assays, binding assays and flow cytometry. Senior Scientist, Bioassay Development, will be responsible for planning, execution, analysis, and reporting of experiments related to the development and characterization of biosimilars in all stages of development.\n<br><br>\n<strong>Reporting Relationships:</strong>\n<br><br>\nThis position will report to the Associate Director, Bioassay Development.\n<br><br>\n<strong>Position Responsibilities:</strong>\n\n<ul>\n\n\t<li>Develop, implement and execute the required biological assays for monoclonal antibodies. Methodologies include, but are not limited to, immunoassays, receptor assays, ligand-binding assays, cell-based assays and potency methods as well as methods that monitor biologics activity</li>\n\n<li>Develop, qualify and validate required methods to global regulatory standards</li>\n\n<li>Lead the activities of method qualification and validation including preparation and review of protocols, SOPs and reports</li>\n\n<li>Lead the sample analysis for biosimilar development and stability studies, CQA assessment, similarity assessment and forced degradation studies</li>\n\n<li>Take a lead for troubleshooting of analytical challenges</li>\n\n<li>Develop and implement innovative, value-added assays/platforms to support similarity assessment</li>\n\n<li>Provide training to scientists</li>\n\n<li>Maintain accurate and timely data records and documentation in both ELN and paper systems</li>\n\n<li>Author or participate in peer reviewed publication of scientific work as well as patent applications when appropriate</li>\n</ul>\n<strong>Candidate Qualifications:</strong>\n<br><br>\nThe company is seeking an individual with the following qualifications and who is willing to make a long-term commitment to the organization:\n<ul>\n\t<li><strong>Education/Certification</strong></li>\n</ul>\nM.S. or Ph.D. in Cell Biology, Life Sciences or equivalent\n<ul>\n\t<li><strong>Qualifications and Skills</strong>\n\n<ul>\n <li>PhD with minimum 2 - 4 years of experience, MS with minimum of 6 - 8 years of experience, or BS with 8 -10 years of experience in the pharmaceutical industry with biological assay development and validation</li> <li>Experience with biosimilar development is a plus</li> <li>In-depth understanding of analytical method development, qualification, validation</li> <li>Good conceptual, analytical, problem solving, and organizational skills – must be detail-oriented, well organized, and able to work independently and in teams</li> <li>Internal expert on data interpretation, applications and instrumentation and theory in chromatography and mass spectrometry</li> <li>Support the continuous improvement of data quality systems required for the stability testing and filing</li> <li>Excellent communication skills, both verbal and written, and the ability to interface effectively with analytical, process, and business development, manufacturing, sales and marketing, and administration</li> <li>A “hands-on” energetic individual who enjoys challenges, a quick pace, and is capable and dedicated to getting the job done</li> <li>Well-organized and accustomed to changing priorities and maintaining excellent records</li></ul>\t</li>\n</ul>"}