{"job title": "Senior Associate Scientist, Medicinal Chemistry (non PhD)", "company": "Pfizer", "city state": "– Groton, CT", "rating": "3.9", "job description": "We are seeking a creative, highly motivated, and experienced synthetic organic chemist to join our Pfizer Global Research and Development laboratories based in Groton, CT. The successful applicant will demonstrate a passion for the theory and laboratory practice of synthetic organic chemistry. He/she will have a proven track record of productivity in generating high-quality technical and scientific results. As part of a medicinal chemistry team, he/she will contribute to the implementation and execution of project chemistry strategy and, through development of innovative chemistry, contribute to the rapid and efficient delivery of clinical candidate molecules.\n\n\n<ul>\n<li>*RESPONSIBILITIES**</li>\n</ul>\n\n+ Design, refine and enable synthetic routes to target molecules including versatile, modular routes for analog generation and efficient scalable routes for preclinical candidates. As needed, employ enabled routes to make analogs in singleton or parallel format.\n<br><br>\n+ As a strong team player, work within interdisciplinary project teams to deliver on project goals via collaboration and clear communication (written and oral).\n<br><br>\n+ Understand project medicinal chemistry strategy and work with the synthesis team to develop a coherent approach for the efficient delivery of target molecules in support of the strategy, be it in the dimensions of prototype synthesis, analogue production or compound scale-up.\n<br><br>\n+ Build effective partnerships with other research lines, in particular analytical, technology, pharmaceutical sciences and process chemistry groups.\n<br><br>\n+ Publish and present research internally and externally to Pfizer.\n\n\n<ul>\n<li>*BASIC QUALIFICATIONS**</li>\n</ul>\n\n+ BS degree with 2+ years of organic chemistry experience or MS degree required.\n\n\n<ul>\n<li>*PREFERRED QUALIFICATIONS**</li>\n</ul>\n\n+ Proven track record of innovation and consistent project impact.\n<br><br>\n+ Experience in multistep synthesis; experience in methodology development is valued.\n<br><br>\n+ Familiarity in either organometallic chemistry, catalysis, peptide chemistry or chemical biology is highly recommended.\n<br><br>\n+ A skilled synthetic organic chemist in practice and theory: firm understanding of reaction mechanisms and reactivity, familiar with a range of reaction types, conditions and scales, knowledge of purification methods and characterization of organic compounds, especially NMR and mass spectroscopy.\n<br><br>\n+ Capable of working independently to solve problems through careful experiment design, data analysis, and mechanistic insight.\n<br><br>\n+ Capable of independent design/refinement of synthetic routes taking into account the needs of the project (e.g., analogue generation, scale-up).\n<br><br>\n+ Effective communication skills (oral and written); must be able to interact effectively within a multidisciplinary team of colleagues. Builds strong working relationships with fellow scientists.\n<br><br>\n+ Self-aware; will seek input from others on ideas and problem-solving; uses others as a resource.\n<br><br>\n+ Change agile, capable of quickly adapting to changes in project direction, project portfolio, reporting relationships and department organization.\n<br><br>\n+ Responds well to scientific challenges and applies significant rigor to their own work.\n<br><br>\n+ Will scientifically challenge fellow colleagues in a constructive manner.\n<br><br>\n+ A regular reader of chemical literature with an up-to-date knowledge of cutting edge developments in synthesis.\n\n\n<ul>\n<li>*EEO &amp; Employment Eligibility**</li>\n</ul>\n\nPfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.\n\n\n<ul>\n<li>*Sunshine Act**</li>\n</ul>\n\nPfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider's name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.\n\n\n<ul>\n<li>*Other Job Details:**</li>\n</ul>\n\n+ **Last Date to Apply for Job: September 14, 2018**\n<br><br>\n+ Eligible for Relocation Package: yes\n<br><br>\n+ Eligible for Employee Referral Bonus: no\n<br><br>\nPfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates."}