{"job title": "Sr Clinical Scientist (Pharmaceutical Trials)", "company": "Philips", "city state": "– Monroeville, Pennsylvania", "rating": "3.4", "job description": "Job Description<br><br><strong> In this role, you have the opportunity to</strong>\n<br><br>\nact as an advisor to sales team and clinical trial customers before, during and after the study. Builds customer confidence in the ability to collect and interpret motion data to provide meaningful study endpoints and enhances the perception of Philips as a vendor.\n<br><br>\n<strong> You are responsible for</strong>\n<li> Assists sales associates in early discussions with prospective customers to supply insight into how motion biosensors may be deployed and the data analyzed to address the questions of interest</li> <li> As the opportunity matures, draws on practical knowledge to advance the selling process by advising customers on study design and subject compliance to increase the probability of a successful engagement and data collection</li> <li> As a study protocol matures, applies practical experience to advise customers on data collection strategies and practical aspects of deployment of motion biosensors in biomedical research for their specific area of inquiry.</li> <li> Consultation on the analysis plan to increase the probability of useful outcomes by selection of useful endpoints.</li> <li> If the analytical needs of the customer are non-standard, assist the operations team on development of methods to process the data to the desired endpoints.</li> <li> Help present and interpret the results of the motion endpoints to the customer, field questions and design further analytical steps if needed.</li> <li> Acts as the scientific advisor to the sales and operations team. Helps interpret complex scientific concepts to enable associates to grow in their expertise.</li> <li> Consult with marketing team to ensure inclusion of accurate and valuable scientific content during the development of sales tools and awareness generation materials.</li> <li> Work together with Field Marketing to develop and deliver scientific abstracts, publications, podium presentations, best practices workshops during trade shows or other promotional activities.</li>\n<strong> You are a part of</strong>\n<br><br>\nPhilips Respironics, which is the worldwide leader at anticipating needs and providing valued solutions to the sleep and respiratory markets. The company's focus on home care, hospital, respiratory drug delivery and international markets provide programs that manage sleep disordered breathing, chronic obstructive pulmonary disease, asthma, infant care, congestive heart failure and restrictive lung disorders. Globally positioned, RI has manufacturing facilities in several domestic and international locations.\n<br><br>\n<strong> To succeed in this role, you should have the following skills and experience</strong>\n<li> Scientific credentials - Ph.D.</li> <li> 5+ Years' experience designing and conducting biomedical research ideally pharmaceutical clinical trials</li> <li> Experience including motion biosensors in research studies, ideally pharmaceutical trials.</li> <li> Experience in data processing, statistical analysis and the development of study analytical plans for biomedical research. Clinical trials experience is ideal.</li> <li> Experienced speaker at scientific conferences and workshops</li> <li> Published scientific author</li> <li> Eager and able to effectively teach/articulate complex scientific or technological concepts to colleagues and customers</li> <li> Strong market foresight, teaming and learning agility.</li> <li> Self-starting and innovative thinker</li>\n<strong> Why should you join Philips?</strong>\n<br><br>\nWorking at Philips is more than a job. Its a calling to create a healthier society through meaningful work, focused on improving 3 billion lives a year by delivering innovative solutions across the health continuum. Our people experience a variety of unexpected moments when their lives and careers come together in meaningful ways."}