{"job title": "Food Scientist", "company": "TreeHouse Foods, Inc.", "city state": "– Oak Brook, Illinois", "rating": "2.6", "job description": "<strong>Employee Type:</strong><br><br>Full time<br><br><strong>Location:</strong><br><br>IL Oak Brook<br><br><strong>Job Type:</strong><br><br>Research and Development<br><br><strong>Job Posting Title:</strong><br><br>Food Scientist<br><br><strong>Job Description:</strong>\n<br><br>\nUnder limited supervision, leads the design, planning, validation, and implementation of new products, line extensions, product improvement and technical service for TreeHouse Foods that meet product offering requirements.\n<br><br>\n<strong>Position Responsibilities:</strong>\n<ul>\n<li>Under limited supervision, works collaboratively in the execution of development from bench to production scale for new products, product improvements and cost savings projects.</li> <li>Defines the formulation, nutritional and process parameters needed to develop a product which meets the project objective(s). Understands the impact of these parameters to overall project.</li><li>Applies sound scientific methods in all stages of development. Including planning and executing trials, analyzing data and defining solutions to achieve project goals.</li><li>Identifies opportunities for competitive market advantage</li><li>Provide judgement and experience to assure that an appropriate level of technical knowledge and discipline are being applied and utilized in business decisions</li><li>Partner and communicate effectively with cross-functional groups: Marketing, Sales, QA, Procurement, Finance, Operations and Engineering</li><li>Ensure the transfer of technology to the operations team when commercializing products. Provide technical oversight of internal and external manufacturing start-ups and ongoing technical service</li><li>Contribute significantly and continually to attain results through the generation and application of advanced, specialized knowledge</li><li>Generate and support pipeline work to drive cost optimization through formulation and processing efficiencies</li><li>Participates in customer presentations and/or preparing product, content for customer meetings</li><li>Ensure all activities follow established safety standards, regulatory requirements (FDA, UDSA &amp; Kosher) and Good Manufacturing Procedures (GMP)</li>\n</ul>\n<strong>Qualifications and Requirements:</strong>\n<ul>\n<li>Three years' experience in Food Science Product Development OR No experience required if holding a PhD in Food Science/Engineering or Related Field</li></ul>\n\n<ul>\n<li>Understanding of ingredient interactions/functionality</li><li>Communicate effectively and openly while working in a cross-functional team.</li><li>Must be a self-starter, independent, energetic and resourceful</li><li>Excellent written and verbal communications skills</li><li>Solid Project Management skills and experience</li><li>Aptitude for technical leadership and project management</li>\n</ul>\n<strong>Education: Bachelor's Degree required: Food Science / Engineering or related field</strong>\n<br><br>\n<strong>Disability Assistance</strong>\n<br>\nTreeHouse Foods is an Equal Employment Opportunity Employer and offers opportunities to all job seekers, including those with disabilities. If you need a reasonable accommodation to assist with your job search or application for employment, please contact us by sending an email to disability-accommodations@treehousefoods.com. In your email please include a description of the specific accommodation you are requesting and a description of the position for which you are applying.\n<br><br>\n<strong>EEO Considerations</strong>\n<br><br>\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, citizenship, disability or protected veteran status."}