{"job title": "Bioinformatics Research Scientist - Epigenetics in Cancer", "company": "Van Andel Institute", "city state": "– Grand Rapids, US-MI", "rating": "4.3", "job description": "<strong>Bioinformatics Research Scientist</strong>\n<br><br>\n<strong>Epigenetics in Cancer</strong>\n<br><br>\nThe Van Andel Research Institute has a position available for one Bioinformatics Research Scientist under the shared direction of Peter W. Laird, Ph.D and/or Hui Shen, Ph.D. Depending on the interests and expertise of the successful candidate, the position can be a sole appointment in either the Laird or Shen laboratory, or a joint appointment between the two labs.\n<br><br>\n<strong>The Laird Laboratory focuses on the role of epigenetics in cancer, combining mechanistic studies in model systems, analysis of human cancer tissues, advanced technology development, and epigenomic data analysis.</strong>\n<br><br>\n<strong>The Shen Laboratory focuses on the epigenome and its interaction with the genome in various diseases, with a specific emphasis on female cancers and cross-cancer comparisons relying on innovative computational tool development and epigenomic data analysis.</strong>\n<br><br>\nAs a Bioinformatics Research Scientist on our team, your first and foremost responsibility will be to work closely with scientists on the design, processing, and analysis of next-generation sequencing studies. Additional responsibilities might include:\n\n<ul>\n<li>Develop, maintain, and support bioinformatics software for projects</li>\n\n<li>Assist research faculty in data mining of publicly available data sets.</li>\n\n<li>Analyze data through established workflows and pipelines.</li>\n\n<li>Integrate primary data and publicly available data sets for comprehensive analysis and evaluation</li>\n\n<li>Analyze data through established and novel bioinformatics techniques.</li>\n\n<li>Provide experimental design and analysis expertise/timelines to research faculty</li>\n\n<li>Participate in grant and manuscript writing</li>\n\n<li>Engage in bioinformatics literature to ensure the availability of robust methods, resources, and data sources to support the user groups</li>\n\n<li>Present novel bioinformatics analyses and/or methods at scientific conferences</li>\n</ul>\nThis position is available immediately for a motivated scientist who meets the qualifications and description outlined below.\n<br><br>\n<strong>Qualifications:</strong>\n\n<ul>\n<li>A Ph.D. in Bioinformatics, Computational Biology, Molecular Biology, or similar field with demonstrable computational and statistical skills</li>\n\n<li>Experience in NGS data analysis and/or data integration (Required)</li>\n\n<li>Understanding of cellular and molecular biology and/or genetics</li>\n\n<li>Experience in R (Required) and at least one other programming/scripting language (i.e. Python, C++, Perl)</li>\n\n<li>Advanced mathematical and/or statistical skills as related to the analysis of NGS data</li>\n\n<li>Experience working in a Linux environment (Required)</li>\n\n<li>Must provide the names of three individuals who can provide recommendations and present a scientific seminar describing his or her previous research.</li>\n</ul>\n<strong>Description of a Successful Candidate:</strong>\n<br><br>\n<ul>\n<li>A “team” focused scientist</li>\n\n<li>A self-motivated and driven individual who is able to exhibit exceptional research productivity and take responsibility for independent management of the project</li>\n\n<li>A detail-oriented researcher who thinks critically to effectively design experiments and solve complex research problems</li>\n\n<li>A strong ability to take initiative and work independently</li>\n\n<li>A collaborative, hands-on researcher who proactively shares knowledge and expertise with lab members and has an interest in helping junior lab members</li>\n\n<li>Excellent written and oral communication skills</li>\n</ul>\n<strong>HOW TO APPLY</strong>\n<br><br>\nIf you possess these attributes and enjoy working with motivated and driven people, we would welcome speaking with you and encourage you to <strong>apply today!</strong>\n\n<ul>\n<li>A cover letter describing your research interests, experience, and how you might contribute to Laird Lab Research.</li>\n\n<li>An up-to-date <em>Curriculum Vitae</em>.</li>\n\n<li>A list of 3 individuals who have agreed to act as references along with their contact details.</li> \n</ul>\nPlease contact Eric Miller (eric.miller@vai.org) for further information or questions, or if you have any difficulty with the application process.\n<br><br>\n<strong>VAI is actively striving to diversify its workforce and strongly encourages qualified individuals from underrepresented groups to apply. <em>Van Andel Institute is an EEO and Affirmative Action Employer</em></strong>\n<br><br>\n<strong></strong>\n<br><br>\n<strong>About Grand Rapids, MI</strong>\n<br><br>\nVan Andel Research Institute is located in downtown Grand Rapids, MI which is the second largest city in Michigan and the largest city in West Michigan. Grand Rapids offers a remarkable combination of cosmopolitan atmosphere and small town warmth, known for its philanthropic and sustainability-driven community, and is ranked one of \"America's Top 100 Places to Live.\"\n<br><br>\nLocated on the banks of the Grand River, Grand Rapids offers all the big-city excitement you would expect from a million-resident metropolis, featuring hundreds of restaurants and nightspots, theaters, museums, sports and concerts. The safe and clean downtown is surrounded by an eclectic mix of walk-able neighborhoods.\n<br><br>\nWith a medical and life sciences industry boom, strong entrepreneurial activity, dedication to green building and living, and innovative employers, Grand Rapids' diverse economy continues to grow, offering endless career opportunities.<br><br>Required Skills\n<br><br>\n<strong>Required Experience</strong>\n<br><br>\nJob Location\n<br>\nGrand Rapids, US-MI\n<br>"}