{"job title": "Staff Scientist - Pediatrics Critical Care - St.", "company": "Washington University In St. Louis", "city state": "– Saint Louis, Missouri", "rating": "4.2", "job description": "Job Type/Schedule<br><br>This position is full-time and works approximately 40 hours per week.<br><br>Department Name/Job Location<br><br>This position is in the Department of Pediatrics Critical Care. This position is for the Medical School Campus.<br><br>Essential Functions<br><br><strong> POSITION SUMMARY:</strong>\n<br><br>\nAssists in developing and conducting research projects, including experiment design, data analysis and documentation of experiment results.\n<br><br>\n<strong> PRIMARY DUTIES AND RESPONSIBILITIES:</strong>\n<li> Following instructions and discussions with principal investigator, designs research protocols, including developing procedures for the collection, verification and management of data.</li> <li> Assists with grant preparation and reporting.</li> <li> Performs complex statistical analysis of data collected and writes interpretative reports. Verifies the correctness of the data submitted and makes recommendations based on these analyses.</li> <li> Documents research topics and prepares and submits papers based on research work to publications and committees for publication or presentation to peers. Ability to maintain complete and organized records/reports including generation of figures and statistical analysis.</li> <li> Solves practical problems relating to difficulties with equipment or test subjects. Suggests technical or procedural improvements in testing methods.</li> <li> Conducts literature searches related to research project.</li>\n\nRequired Qualifications<br><br>Masters degree with 4 years of experience in research lab operations or equivalent combination of education and experience equaling 9 years required.<br><br>Preferred Qualifications\n\n<li> Background in immunology, biochemistry, or molecular biology.</li> <li> Experience with immunologic techniques and animal surgery preferred.</li>  <li> Troubleshooting skills, independent analytical thinking, and research planning skills.</li> <li> Demonstrated ability to work independently with great interpersonal skills to communicate with laboratory staff and investigators.</li> <li> Ability to analyze and interpret statistical data and to communicate data in a clear, concise manner.</li>  <li> Computer literacy including the ability to use a variety of software packages to analyze data.</li>\n\nSalary Range<br><br>The hiring range for this position is $45,864 - $61,921 annually.<br><br>Benefits<br><br>This position is eligible for full-time benefits. Please visit our website at http://hr.wustl.edu to view a summary of benefits.<br><br>Applicant Special Instructions<br><br>Works in laboratory environment with potential exposure to biological, chemical and radioactive hazards. Must be physically able to wear protective equipment. Must be able to provide standard care to research animals.<br><br>EOE Statement<br><br>Washington University is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity or expression, national origin, genetic information, disability, or protected veteran status."}