{"job title": "Research Scientist (PH.D)", "company": "Advanced Technology &amp; Research", "city state": "– West Bethesda, MD", "rating": "3.0", "job description": "JOB LOCATION: West Bethesda, MD\n<br>\n<strong> JOB REQUISITION NUMBER: 751018011</strong>\n\n\n<ul>\n\n <li>Job Listing: August 2018</li>\n<li>Opening: One</li>\n<li>Closing Date: Until Filled</li>\n</ul>\n\n<br>\n<br>\nPRINCIPAL DUTIES AND RESPONSIBILITIES:<br><br>The successful applicant will join ATR's Engineering Services Division, working as a team member of the Advanced Sensors and Technology group at \n<br>\n the Naval Surface Warfare Center in West Bethesda, Maryland. Duties will include using digital signal processing methods for noise reduction in the research, development, design, and testing to achieve underwater signature reduction of underwater electromagnetic fields for frequencies below 3 kHz.<br><br>EDUCATION &amp; EXPERIENCE REQUIREMENTS:\n\n\n<ul>\n\n <li>PhD in Physics, Applied Physics, Applied Mathematics, or Electrical Engineering</li>\n<li>All levels of experience welcome, including recent PhD recipients and postdoctoral scholar</li>\n<li>Job experience with the Navy or other DoD laboratories is a plus</li>\n</ul>\n\n<br>\n<strong>SKILLS &amp; ABILITIES REQUIREMENTS:</strong>\n\n\n<ul>\n\n <li>Familiar with data analysis to extract signals from environmental electromagnetic background clutter</li>\n<li>Ability to apply data analytic methods to identify small electric or magnetic signals in noise</li>\n<li>Ability to quantify errors between experimental data and theoretical models of systems</li>\n<li>Ability to work independently and with other to determine the cause of anomalies in data</li>\n<li>Experience in data science methods such as adaptive signal processing or reduced order modeling is a plus</li>\n<li>Background in other relevant fields such as high energy phenomenology is a plus</li>\n<li>Skilled in use of computer modeling and simulation technology with strong background in EM theories/phenomenon</li>\n<li>Strong verbal and writing ability</li>\n<li>Ability to adapt to various electromagnetics projects</li> \n\n<li>Familiar with writing code, MatLab preferred</li>\n<li>Self-starter and energetic</li> \n\n<li>Strong Research experience</li>\n<li>Proposal writing and briefing skills</li> \n\n<li>Publications in peer reviewed journals</li> \n</ul>\n\n<br>\n<strong>OTHER REQUIREMENTS:</strong>\n\n\n<ul>\n\n <li>Candidate must be a US citizen with the ability to obtain and maintain a security clearance or favorable adjudication of a national security background investigation. Current successful background investigation completion is a plus.</li>\n</ul>\n\n<br>"}