{"job title": "​Data Scientist", "company": "American Academy of Orthopaedic Surgeons", "city state": "– Rosemont, IL United States", "rating": "2.3", "job description": "<strong>You approach data with a mathematical mindset. You use a common language to access, explore and model data. You’ve honed your skills and take more holistic view to manipulate and leverage data to deliver business results and impact. You are excited knowing your analysis and interpretation of complex data, will help drive the</strong> <strong>decision-making of the business.</strong>\n<br><br>\nIf this sounds like you, read on!\n<br><br>\nThe Data Scientist will be required to work in a fast-paced and dynamic association environment. Primary responsibilities will include the ability to analyze, extract, and report relevant information from the Academy's business data to drive new measurement, product development, and continually improve our value chain proposition among our members and the orthopaedic medical community. The Data Scientist will use data mining and statistical reporting techniques to create new insights for business stakeholders. In this role, the incumbent will establish scalable, efficient, automated processes for large scale data analyses that will tie into the Academy’s data repositories, as well as perform exploratory analysis across an open-ended pool of data.\n<br><br>\nUnder management direction assess and ensure that the Academy is harvesting and maximizing knowledge and insights gained from analysis of transactional and historical data. Acquire deep understanding of the business problems and proactively translate them into appropriate mathematical representations providing analysis for strategic priorities. Identify actionable patterns in data, and research data trends through regular reporting positively influence organizational decisions regarding industry and market changes thereby informing future product planning strategies.\n<br><br>\nLead and perform explanatory data analysis, generating and testing working hypotheses that identify patters and result in actionable outcomes for the Academy. Ability to analyze and interpret point-of-sale, membership, and engagement data in collaboration with internal business stakeholders by designing and implementing advanced models, leveraging statistics, mathematics and econometrics to support short and long-term business strategies.\n<br><br>\nServing as a champion for data governance and data quality initiatives, take analytical objectives to identify data quality issues. Working closely with data owners and stewards, recommend quality assurance plans that reduce and/or mitigate data inaccuracies and that identify new sources of information to augment AAOS data systems.\n<br><br>\nOversee the continued development of the Academy’s analytic and reporting capabilities, identify opportunities to improve existing tools and processes contributing to streamlined activities. Document business and technical feasibility assessments related to business requirements, evaluating gaps in data and technical capabilities, and communicating with business and technical teams on the responsibilities related to performing data analysis and data quality tasks. Establish processes that facilitate with the monitoring and development of work ensuring adherence to the data governance and data quality standards and assist with developing proofs of concepts or prototypes as required.\n<br><br>\nSupport the data management team to ensure that the Academy’s data repositories including associated data marts align with business analysis requirements and comply with industry best practices and recognized standards governing information security.\n<br><br>\nTRAVEL:\n<br><br>\n10 to 15 days per year\n<br><br>\nQUALIFICATIONS:\n<br><br>\nRequired:\n<br><br>\nBachelor’s Degree in Computer Science, Statistics, or Mathematics with five years of professional experience working as a Data Scientist\n<br><br>\nProficient with analysis and reporting packages (e.g., R, Python, SAS, Tableau or PowerBI), programming languages (e.g., Java, Python)\n<br><br>\nAdvanced data analytical skills that include familiarity with common business intelligence tools; ability to extract, clean and transform customer and item-level data for the purpose of analysis, modeling, segmentation, and reporting\n<br><br>\nExperienced working in a business environment with demonstrated skills in data visualization, statistical modeling, data mining and information retrieval tools and methodologies\n<br><br>\nDemonstrable domain expertise in communications, product metric identification, improving data quality, A/B testing, and experimentation design and execution\n<br><br>\nAbility to implement, maintain, and troubleshoot big data infrastructures\n<br><br>\nPolished presentation skills; experience creating and presenting findings to executive level staff\n<br><br>\nStrong written, verbal and interpersonal communication skills, with an ability to communicate ideas and solutions effectively\n<br><br>\nMust be highly collaborative with the ability to manage and motivate project teams and meet deliverables\n<br><br>\nHighly resourceful, organized and capable of working on multiple initiatives simultaneously with minimal direction\n<br><br>\nExperienced in data governance, change management, and data stewardship best practices\n<br><br>\nKnowledge of technical architecture, data integration, and a solid understanding of relational databases and content management systems is essential\n<br><br>\nProficiency in Microsoft Office products (Word, Excel, Access, PowerPoint, Visio)\n<br><br>\nDesired:\n<br><br>\nPrevious work experience with medical associations or not-for-profit organizations\n<br><br>\nHands-on, technical experience with Association Management Systems\n<br><br>\nFormal knowledge and experience with the Personify, Inc. association management system\n<br><br>\nIf this describes YOU, please apply by sharing the following:\n<br><br>\n-Clearly communicate why you are the ideal candidate for this role, providing specific examples and experiences as proof points.\n<br><br>\n-Attach your resume, cover letter, salary expectation and any additional materials that support your application"}