{"job title": "Data Scientist - Time Series Modeling", "company": "Calico", "city state": "– South San Francisco, CA", "rating": "5.0", "job description": "<strong>Who we are:</strong>\n<br><br>\nCalico is a research and development company whose mission is to understand the biology of aging, and to help people to lead longer and healthier lives. We aim to combine the best biomedical science with cutting edge technology and computing. We are building a new and unique culture of true partnership between the best biomedical and computational scientists, within a company that is both a nimble startup but also has a firm financial footing.\n<br><br>\n<strong>Position description:</strong>\n<br><br>\nBiology is rapidly becoming a data science due to the exponential growth in high-quality biological and medical data. These data are transforming our understanding of biology and disease, but deriving valuable scientific insights requires careful analysis and interpretation of data done in close collaboration with computational and life scientists. Calico is seeking to expand our group of Data Scientists who are exploring diverse questions from a computational perspective; and who are developing methods which facilitate a deeper understanding of data.\n<br><br>\nAs a data scientist, you will work cross-functionally with other individual contributors within computing, as well as researchers at Calico, on collaborative research projects which may be centered around biological questions, analytical methods, or engineering.\n<br><br>\nWe are seeking an exceptional data scientist with interest and experience in analysis of time series and longitudinal data to join the team.\n<br><br>\n<strong>Position responsibilities:</strong>\n\n<ul>\n<li>Develop longitudinal data models at different time scales integrating diverse data modalities</li>\n<li>Develop methods for visualization and model interpretation that enable the generation of testable hypotheses</li>\n<li>Work with experimental and computational scientists to design experiments and contributing to the analysis of the resulting data</li>\n</ul>\n<strong>Position requirements:</strong>\n\n<ul>\n<li>D. in Bioinformatics, Computational Biology, Statistics, Biological Sciences, Genetics, Genomics, Computer Science, or equivalent preparation and experience</li>\n<li>6+ years of experience in data analysis, including at least 3 years of hands-on work experience with real data (either in an academic environment or in industry)</li>\n<li>Significant experience with the application of statistical and machine learning methods to time series data: autoregressive models, Gaussian Processes, linear dynamical systems, Markov models (HMM, Kalman, etc.), recurrent neural networks</li>\n<li>Track record of effective cross-functional collaboration on complex projects involving people with very diverse backgrounds</li>\n</ul>\n<strong>Nice to have:</strong>\n\n<ul>\n<li>Experience in analyzing time series data in one or more of following data types: gene expression, microbiome composition, deep immune profiles, metabolic cage profiles</li>\n</ul>"}