{"job title": "Sr. Data Scientist", "company": "FM Global", "city state": "– Johnston, RI", "rating": "3.5", "job description": "More information about this job: Overview - External: FM Global is a leading property insurer of the world's largest businesses, providing more than one-third of FORTUNE 1000-size companies with engineering-based risk management and property insurance solutions. FM Global helps clients maintain continuity in their business operations by drawing upon state-of-the-art loss-prevention engineering and research; risk management skills and support services; tailored risk transfer capabilities; and superior financial strength. To do so, we rely on a dynamic, culturally diverse group of employees, working in more than 100 countries, in a variety of challenging roles. Responsibilities - External: As a Senior Data Scientist, you will focus on translating business needs into analytics, interpretation of analytics into business applications, advanced technologies and artificial intelligence solutions. This role will provide you with the opportunity to innovate, explore and build solutions for FM Global using emerging technologies. You will develop and apply artificial intelligence, machine learning, and deep learning to various business problems in loss prevention. Youll be part of a leading-edge and diverse team of sophisticated data and analytics professionals . Youll work alongside multiple departments including operations, innovation, business technology transformation, underwriting and engineering to streamline artificial intelligence efforts. Through constant learning, innnovation, discovery and collaboration youll not only help FM Global deliver on the promise of loss prevention, youll also grow your career and the scope of your impact across the company. You will use your creativity and leverage a vast array of techniques and tools. You will plan, conduct, and direct the development and evaluation of real-world, large-scale problems using artificial intelligence/machine learning with minimal or limited supervision. Your projects will be interesting, exciting and challenging. You will use advanced analytics with artificial intelligence to advance the mission and goals of FM Global. Qualifications - External: Required Ph.D. in Data Science, Computer Science, AI, Applied Mathematics, Statistics, Operations Research, or other relevant fields with 2+ years of business experience (or Masters degree with 10+ years of business experience) Advanced programming skills with modern languages including but not limited to R, Pyhton, C#, Java, Scala and Go Advanced knowledge of ML tasks (supervised, unsupervised) Extensive experience in various ML applications including but not limited to clustering, classification, regression and feature reduction Advanced knowledge of leading AI/ML techniques and frameworks including but not limited to Tensorflow, Chainer, PyTorch, Caffe, CNTK, and Theano Expertise in the analysis of large scale data from a variety of sources (enterprise systems, sensor data, historical data, metadata, etc.) Experience in design, validation and testing of algorithms and systems Experience in state of the art AI learning techniques (reinforcement learning, transfer learning, etc.) and highly scalable deep learning model training and inferencing Experience with deep learning network architectures (unsupervised, convolutional, recurrent, recursive) Familiarity with graph-based algorithms, reasoning systems architectures, Bayesian techniques, ontology-based reasoning Highly analytical with strong problem-solving skills Strong attention to detail Strong verbal and written communication skills Desire and ability to work well with others in a team environment and across disciplines Strongly preferred Understanding of and experience in Agile development process A plus General business knowledge related to risk management and/or insurance"}