{"job title": "Enterprise Analytics - Data Scientist", "company": "Ford Motor Company", "city state": "– Dearborn, MI", "rating": "3.9", "job description": "**31072BR**<br> <br>**Job Title:**<br> <br><br> <br>Enterprise Analytics - Data Scientist<br> <br><br> <br>**Job Description &amp; Qualifications:**<br> <br><br> <br>**Job Description/Overview:**<br> <br><br> <br>The Global Data Insights and Analytics (GDI&amp;A) Enterprise Analytics team supports analytical solutions and insights across the enterprise from Human Resources to General Auditors Office to Office of General Counsel and others. The Data Scientist discovers and curates new and existing data sources to create insight for the business. This is an exciting opportunity to utilize the latest tools and methods in Statistics, Big Data, and Data Science to a variety of business problems.<br> <br><br> <br>The role will have an emphasis in GAO (General Auditors Office) projects by bringing a systematic, disciplined approach to evaluate and improve business controls, risk management, and governance processes. The GAO performs financial and operational audits of Company components that contribute to the efficiency and economy of Company operations. The goal is to be a trusted advisor to GAO and provide Data Science techniques and insights to support the development and implementation of the annual risk-based audit plan.<br> <br><br> <br>The role spans the full lifecycle from analytic problem definition, through data gathering, analysis, reporting/visualization development, testing, and operational deployment.<br> <br><br> <br>**Responsibilities:**<br> <br><br> <br>+ Support the development and delivery of analytic and statistical models using skills such as data acquisition and management, algorithm design, and model development &amp; refinement<br> <br>+ Acquire deep understanding of the business problems and translate them into appropriate statistical models<br> <br>+ Ensure overall quality of the data &amp; solutions throughout the analytic development process<br> <br>+ Interpret results and communicate insights to technical and non-technical audiences including executive leadership<br> <br><br> <br>**Job Requirements**<br> <br>**Basic Qualifications:**<br> <br><br> <br>+ Master's degree in Statistics, Economics, Data Science, Computer Science or Mathematics<br> <br>+ 1+ years of experience in mathematical programming, data mining, and/or statistical analysis<br> <br>+ 1+ years of experience with one or more of the following tools: Data Gathering skills/tools (e.g. SQL, Hadoop, Teradata, SAS, Business Objects, etc.) and/or Visualization skills/tools (e.g. Qlikview, Tableau, WebFocus, etc.)<br> <br><br> <br>**Preferred Qualifications:**<br> <br><br> <br>+ 3+ years of experience in statistical or mathematic modeling<br> <br>+ Visualization software tools such as QlikView, tableau experience<br> <br>+ Large scale data manipulation and mining/pattern recognition experience<br> <br>+ Strong oral and written communication skills<br> <br>+ Strong problem formulation and problem solving skills<br> <br>+ Experience communicating findings to make data analysis actionable and understandable by business partners<br> <br>+ Ability to take complex problems and break them down to create and implement an action plan<br> <br>+ Strong understanding of analysis and computational complexity and ability to programmatically solve problems<br> <br>+ Strong capabilities at designing visual interface for data interaction<br> <br><br> <br>The distance between imagination and ? creation. It can be measured in years of innovation, or in moments of brilliance. When you join the Ford team discover all the benefits, rewards and development opportunities you?d expect from a diverse global leader. You?ll become part of a team that is already leading the way, with ingenious solutions and attainable products ? and it is always ready to go further.<br> <br><br> <br>Candidates for positions with Ford Motor Company must be legally authorized to work in the United States on a permanent basis. Verification of employment eligibility will be required at the time of hire. Visa sponsorship is not available for this position.<br> <br><br> <br>Ford Motor Company is an equal opportunity employer committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, disability status or protected veteran status.<br> <br><br> <br>**Auto req ID:**<br> <br><br> <br>31072BR<br> <br><br> <br>**Company:**<br> <br><br> <br>Ford Motor Company<br> <br><br> <br>**Function:**<br> <br><br> <br>GDIA<br> <br><br> <br>**Skill Team:**<br> <br><br> <br>GDI&amp;A<br> <br><br> <br>**Sub-Component:**<br> <br><br> <br>Enterprise Analytics<br> <br><br> <br>**State:**<br> <br><br> <br>Michigan<br> <br><br> <br>**Location:**<br> <br><br> <br>Dearborn"}