{"job title": "Sr. Data&amp;Applied Scientist", "company": "Microsoft Corporation", "city state": "– Redmond, WA", "rating": "4.1", "job description": "The goal of Azure Customer Growth&amp;Analytics team is to foster a data-driven culture; to encourage and enable the entire organization to make more informed decisions through data. In support of this mission, our Business Analytics team works closely with engineering, marketing, finance, and business leaders to identify opportunities for improving the customer experience and accelerating the growth of our business. Our charter spans the breadth of the Cloud and Enterprise Division at Microsoft, where we design and deliver standardized views of business performance, perform ad hoc analyses of historical data, define benchmarks and models for predicting upcoming performance, and surface key insights used to help define programs targeted at customer acquisition, engagement, and retention.\n<br><br>\nAs the availability of data and demand for analysis grows, we need a capable data scientist to help stakeholders across the organization better understand user behavior and service usage - to create compelling offers and optimize the customer experience. The candidate we hire will bring a new perspective to our diverse and multi-faceted team, a commitment to continuous growth and learning, and the ability to work across teams to solve challenging business problems.\n\n\n<ul>\n<li>5-10 years of experience in analytics, business intelligence, or data driven business strategy.</li>\n<li>Functional knowledge of cloud computing and online services business models, including business, technical, and operational metrics.</li>\n<li>Demonstrated analytical ability; problem deconstruction, statisticalcompetency, meticulous forensic analysis skills, data validation, and scientific rigor.</li>\n<li>Ability to provide clarity and direction around ambiguous business questions/data sets to land insightful business recommendation grounded in sound analysis.</li>\n<li>Demonstrated stakeholder management ability including effective prioritization, clear and concise communication, and delivery of actionable data driven insights.</li>\n<li>Highly proficient with T-SQL and Excel. Experience with Cosmos, Kusto, and/or R preferred.</li>\n<li>Experience applying business concepts to data resulting in insights on customer acquisition funnel, retention, and monetization.</li>\n<li>Experience working with financial data to derive customer insights.</li>\n</ul>\n\n<strong>PERSONAL ATTRIBUTES/INTERPERSONAL SKILLS:</strong>\n\n\n<ul>\n<li>Excellent written and oral communication skills, particularly the ability to synthesize complex problems/scenarios into easy-to-understand concepts.</li>\n<li>Demonstrated ability to work in ambiguous situations and across organizational boundaries.</li>\n<li>Effective presentation skills and experience with engaging audiences of all levels.</li>\n<li>Creative, innovative, organized thinker, with a high attention to detail.</li>\n<li>Committed to continuous learning and bringing a growth mindset to problem solving.</li>\n<li>Effective time management in complex, ambiguous, deadline-driven environments.</li>\n<li>Effective in rapidly evolving environments and working across organizational boundaries.</li>\n<li>Self-discipline and a drive for results.</li>\n</ul>\n\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n<br><br>\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check every two years.\n<br><br>\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.\n\n\n<ul>\n<li>Become a subject matter expert in the C+E business and underlying data ecosystem. Collaborate with product and program owners across the organization to understand objectives, identify opportunities, and prioritize projects in order to maximize business impact.</li>\n<li>Regularly deliver well-crafted insight packages in a form that's easy to understand and actionable by the business. These deliverables require strong data analysis combined with skilled data storytelling.</li>\n<li>Identify changes in customer behavior, system performance, or financial results, and deliver the necessary insights to explain them and recommend actions to be taken.</li>\n<li>Deliver accurate and timely standardized reporting and analysis in support of ongoing business reviews and planning processes. Recognize opportunities for process improvements to increase quality, accelerate delivery, and reduce cost.</li>\n<li>Lead the development and management of metrics, KPIs, and dashboards.</li>\n<li>Ensure the ongoing documentation of analysis methodologies and results.</li>\n<li>Educate users about how to leverage data as an asset for their particular function.</li>\n<li>Manage vendor workloads and ensure quality delivery on a timely basis.</li>\n</ul>"}