{"job title": "Lead Data Scientist", "company": "Nielsen", "city state": "– Chicago, IL", "rating": "3.6", "job description": "<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong><br>\n<div><strong>Lead Data Scientist - 26104</strong>\n<br><br>\nData Science - USA Chicago, Illinois\n<br><br>\n<strong>Nielsen is the largest measurement company in the world with unique measurement technologies, assets, and data that make it one of the most interesting and challenging places for a data scientist to work. We focus on what consumers watch, listen to, and buy in over 95 countries.</strong>\n<br><br>\n<strong>Data Science is core to what Nielsen does, and our research projects have high visibility in directly affecting the results of our business and our clients. The Digital Panels team provides leadership and expertise across Digital Panels to develop innovative, statistically sound, and cost effective research methodologies in support of business strategy for our Desktop and Mobile products. We play a pivotal role in designing best practices and approaches for data collection, respondent recruitment, panelist retention, and bias correction.</strong>\n<br><br>\n<strong>The Digital Product team within the Data Science Watch organization focuses on improving and enhancing Nielsen’s highly successful products out in the marketplace for digital advertising and content measurement. In addition to defining and designing product methodologies, the Lead Data Scientist will also design research studies to support and validate innovative measurement solutions, and lead the development and maintenance of new models to integrate different data sources.</strong>\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n<strong>Skills Required:</strong>\n<br><br>\n<strong>This position requires a detail-oriented person who has experience in data modeling research and who enjoys working in a fast-paced environment. Ability to problem-solve, work independently, manage multiple projects in parallel, and see the big picture are keys to success in this position.</strong>\n<ul>\n\n<li><strong>Bachelor’s in statistics, data science, applied mathematics, economics, quantitative social sciences, operations research, or hard sciences with outstanding analytical expertise and strong technical leadership</strong></li>\n<li><strong>Experience negotiating competing priorities and collaborating with multiple stakeholders</strong></li>\n<li><strong>Knowledge about trend analyses, multivariate statistics (parametric/ non-parametric), sampling, bias reduction, indirect estimation, data aggregation techniques, automation, generalization</strong></li>\n<li><strong>Proficiency in at least one statistical language such as SAS, R, STATA, or SPSS</strong></li>\n<li><strong>Proficiency in Python and SQL</strong></li>\n<li><strong>Demonstrated experience working successfully as part of a team as well as independently</strong></li>\n<li><strong>Ability to communicate complex content to a variety of audiences in written and oral form</strong></li>\n\n</ul>\n<strong>Skills Desired:</strong>\n<ul>\n\n<li><strong>Master’s and/or PHD in statistics, data science, applied mathematics, economics, quantitative social sciences, operations research, or hard sciences</strong></li>\n<li><strong>Experience with executing behavioral methodology research and qualitative analysis</strong></li>\n<li><strong>Experience with data visualization tools (e.g. Tableau, Spotfire)</strong></li>\n<li><strong>Knowledge of digital audience/media measurement</strong></li>\n<li><strong>Knowledge of panel recruitment and retention strategies</strong></li>\n\n</ul>\n<strong>Key Responsibilities</strong>\n<ul>\n\n<li><strong>Work with cross-functional teams to design, implement and test new measurement approaches</strong></li>\n<li><strong>Integrate multiple data sources into consolidated analyses and measures</strong></li>\n<li><strong>Develop, test, and refine data models using multiple types of data for various purposes such as imputation and data correction</strong></li>\n<li><strong>Document new methodologies and best practices</strong></li>\n<li><strong>Work directly with application development teams to ensure correct coding and validation of panel methodology enhancements</strong></li>\n<li><strong>Engage in discussions on strategic direction of panel products within Nielsen</strong></li>\n<li><strong>Stay informed of new research and developments in the field</strong></li>\n<li><strong>Confidently represent Data Science methods and approaches to internal and external partners and clients</strong></li>\n<li><strong>Participate in internal and external knowledge exchanges (conferences, workshops, webinars)</strong></li>\n\n</ul>\n<strong>#US-LI</strong>\n<br><br>\n<strong>About Nielsen:</strong>\n<br><br>\nNielsen N.V. (NYSE: NLSN) is a global performance management company that provides a comprehensive understanding of what consumers Watch and Buy. Nielsen’s Watch segment provides media and advertising clients with Total Audience measurement services across all devices where content — video, audio, and text — is consumed. The Buy segment offers consumer packaged goods manufacturers and retailers the industry’s only global view of retail performance measurement.\n<br><br>\nBy integrating information from its Watch and Buy segments and other data sources, Nielsen provides its clients with both world-class measurement as well as analytics that help improve performance. Nielsen, an S&amp;P 500 company, has operations in over 100 countries that cover more than 90 percent of the world’s population. For more information, visit www.nielsen.com\n<br><br>\n<em>Nielsen is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class.</em>\n<br><br>\n<strong>Job Type:</strong> Regular\n<br><br>\n<strong>Primary Location</strong>: Chicago,Illinois\n<br><br>\n<strong>Secondary Locations:</strong> MD - Columbia, , ,\n<br><br>\n<strong>Travel:</strong> Yes, 10% of the Time</div>"}