{"job title": "Senior Data Scientist", "company": "NORC", "city state": "– Chicago, IL", "rating": "3.1", "job description": "Senior Data Scientist\n<br><br>\nJob no: 493990Work type: Regular Full-TimeLocation: Chicago ? 55 East Monroe Street, ILCapability Area: Business Ventures and Innovation, NORC Labs\n<br><br>\n<strong>JOB DESCRIPTION:</strong>\n<br><br>\nIn your role as Senior Data Scientist, you will play a key role on the NORC Labs team, helping to deliver new and innovative solutions for our clients, and developing new solutions. You will also work collaboratively with other teams across NORC to help drive innovative work. Tasks can include the development of statistical methodology and computational strategies for data mining, predictive and simulation modeling, forecasting, and data visualization.\n<br><br>\nIf you are interested in using data science to solve some of our client?s hardest problems in novel and innovative ways? If you?re excited by some of our previous projects including building an analytics tool to help healthcare organizations sign up the right mix of physician specialties to serve the specific health care needs of a local community, developing a model to proactively identify students at risk of failing to graduate or meet required literacy standards, or using data to help fight the scourge of human trafficking; this just might be the role for you.\n<br><br>\n<strong>DEPARTMENT: NORC LABS</strong>\n<br><br>\nLaunched in 2015, NORC Labs activates and applies innovation across NORC?s diverse offerings, operating as a fast-moving start-up nested within one of the world?s most trusted research institutions. NORC Labs combines the best ideas from NORC?s research and technology experts with a deep understanding of client needs and market trends to develop and incubate the most effective client solutions.\n<br><br>\nAs NORC?s innovation hub, NORC Labs drives the creation and introduction of cutting-edge client solutions, as well as guiding the evolution and enhancement of NORC?s existing services and offerings. As we develop our team?s ideas into new or improved offerings, we?re also constantly monitoring and drawing on advances in data collection, analytics, and technology to deliver the best available solutions to our clients\n<br><br>\n<strong>RESPONSIBILITIES:</strong>\n<br><br>\n? Support the development of the strategy and vision for large data analysis projects\n<br><br>\n? May manage both the activities and the work product of data analysts\n<br><br>\n? Provide input and guidance to task leaders especially regarding data acquisition, data analysis, and overall data visualization\n<br><br>\n? Design, develop, and deploy algorithms, models, visualizations, and work flows to discover valuable information in large volumes of data from various sources\n<br><br>\n? Bring structure to large data sets\n<br><br>\n? Evaluate the data, construct models, create business applications, and work closely with organizational leaders to provide input into strategic business implications for the organization and its clients\n<br><br>\n<strong>REQUIRED SKILLS:</strong>\n<br><br>\n? Master?s or Doctoral Degree in Math, Statistics, Computer Science or related field\n<br><br>\n? Knowledge required: Strong foundation in areas of statistics, mathematics, computer science, machine learning, and/or deep learning\n<br><br>\n? Skills required: Strong problem solving skills, quantitative/qualitative analysis skills\n<br><br>\n? Abilities required: Ability to organize and prioritize work assignments to meet project needs\n<br><br>\n? At least 9 years of experience in positions of increasing responsibility, working with large datasets and conducting statistical and quantitative modeling, melding analytics with strong programming, data mining, clustering and segmentation\n<br><br>\n? Experience in client communications and relationship management; strong technical writing skills, strong verbal skills; and data visualization/presentation.\n<br><br>\n? Able to explain technology, techniques and approaches to others.\n<br><br>\n? Strong data programming skills such as: SQL, Python, R, Hadoop, Hive, MapReduce, and/or other large data systems\n<br><br>\n? Strong ability to rapidly prototype solutions to iteratively meet client needs\n<br><br>\n? Experience in cloud hosting technologies, such as AWS, ideally including AWS Redshift\n<br><br>\n? Strong data visualization or storytelling skills, demonstrated ability to use data visualization tools such as Tableau (preferred) or other visualization technologies such as D3, Shiny, etc\n<br><br>\nPreference for domain expertise in healthcare preferred\n<br><br>\n<strong>ABOUT NORC:</strong>\n<br><br>\nNORC at the University of Chicago is an objective, non-partisan research institution that delivers reliable data and rigorous analysis to guide critical programmatic, business, and policy decisions. Since 1941, NORC has conducted groundbreaking studies, created and applied innovative methods and tools, and advanced principles of scientific integrity and collaboration. Today, government, corporate, and nonprofit clients around the world partner with NORC to transform increasingly complex information into useful knowledge.\n<br><br>\nNORC conducts research in five main areas: Economics, Markets, and the Workforce; Education, Training, and Learning; Global Development; Health and Well-Being; and Society, Media, and Public Affairs.\n<br><br>\nWe provide comprehensive and integrated services that span the research cycle, and offer solutions that anticipate and address critical needs in research and data science. We approach all work with deep technical expertise, a spirit of collaboration, and a commitment to scientific integrity.\n<br><br>\n<strong>A TRADITION OF EXCELLENCE:</strong>\n<br><br>\nAs one of the oldest not-for-profit, academic research organizations in the United States, and through its affiliation with the University of Chicago, NORC maintains the highest standard of professional excellence and scientific rigor, and is committed to broad dissemination of its findings.\n<br><br>\n<strong>A PASSION FOR INNOVATION:</strong>\n<br><br>\nNORC?s subject matter experts and survey professionals develop and employ innovative study designs, research methods, and technical applications to derive meaningful and accurate results.\n<br><br>\n<strong>A COMMITMENT TO COLLEGIALITY:</strong>\n<br><br>\nNORC cultivates an interdisciplinary culture of achievement in which senior investigators from diverse fields and professional backgrounds collaborate with the next generation of researchers in an open, collegial environment.\n<br><br>\n<strong>EEO STATEMENT:</strong>\n<br><br>\nNORC is an affirmative action, equal opportunity employer that values and actively seeks diversity in the workforce. NORC evaluates qualified applicants without regard to race, color, religion, sex, national origin, disability, veteran status, sexual orientation, gender identity, and other legally- protected characteristics.\n<br><br>\nAdvertised: August 16, 2018Central Daylight TimeApplications close:"}