{"job title": "Data Scientist, Marketing", "company": "Tractor Supply Company", "city state": "– Brentwood, TN", "rating": "2.9", "job description": "**Overview**<br> <br><br> <br>**_Tractor Supply Company (TSCO),_** _the largest retail chain of rural lifestyle products in the United States, is dedicated to enhancing our strong company culture built on our team members? commitment to our Mission and Values. With over 1,700 stores in 49 states and an innovative e-commerce platform, Tractor Supply ranks in the Fortune 400 with revenues of $7 billion and growing! Come grow your career with us as we serve those who live_ **_?Life out Here?!_**<br> <br><br> <br>**Job Purpose**<br> <br><br> <br>The Marketing Data Scientist is responsible for building &amp; developing the necessary skills sets in statistical modeling techniques to generate predictive models for the Marketing department. This role will own the translation of predictive modeling results to actionable insights that can be utilized across the TSC organization. In addition, this position will aid the rest of the Analytics &amp; Database Management Team with data analysis request as needed by the business.<br> <br><br> <br>**Responsibilities**<br> <br><br> <br>+ Create and deploy predictive models to enhance business knowledge of customer marketing interactions and shopping behaviors.<br> <br>+ Improve Affinity Cross Basket Analysis purchases utilizing lift and market basket analysis modeling.<br> <br>+ Utilize advanced statistical modeling techniques to measure customer churn and engagement.<br> <br>+ Conduct hands-on analysis of customer and campaign data using analytical and statistical tools such as SQL/SAS to uncover insights and provide program recommendations.<br> <br>+ Provide marketing team with design of experiments (DOE) recommendations and expertise to develop testing parameters for A/B Testing.<br> <br><br> <br>**Qualifications**<br> <br><br> <br>**Education:** Bachelor?s Degree in Mathematics, Statistics, or Econometrics. Master?s Degree preferred.<br> <br><br> <br>**Experience:** 3-5 years of predictive modeling experience utilizing CRM or high level transaction information. Understanding of Retail, CPG, or Marketing Agency business needs<br> <br><br> <br>NOTE: Any suitable combination of education and experience will be considered.<br> <br><br> <br>**Knowledge/Skills/Abilities/Training/Systems**<br> <br><br> <br>+ Experience with and at least moderate aptitude in programming languages such as R, Python, SQL, SAS, or SPSS<br> <br>+ Must possess high degree of aptitude in communicating both verbally and written complex analysis results to Senior &amp; Executive Leadership<br> <br>+ Experience with marketing loyalty programs, email, direct mail, and digital marketing a plus<br> <br>+ Speak, read and write effectively in the English language<br> <br><br> <br>Sorry the Share function is not working properly at this moment. Please refresh the page and try again later.<br> <br><br> <br>Tractor Supply HR Support Center: (p) 844-872-4357 (e-mail) HRPaperwork@TractorSupply.com<br> <br><br> <br>**Requisition ID** _2018-5907_<br> <br><br> <br>**Requisition Post Information* : Post End Date** _Full-Time_"}