{"job title": "Senior Associate, Data Scientist", "company": "UNITED TECHNOLOGIES RESEARCH CENTER", "city state": "– East Hartford, Connecticut", "rating": "3.3", "job description": "Are you a highly motivated individual that enjoys applying cutting edge data analytics and machine learning methods to applied engineering challenges?\n<br><br>\nUnited Technologies Research Center in E. Hartford CT is hiring Data Scientist engineers into the Decision Support &amp; Machine Intelligence group. The group takes on cutting edge challenges in machine learning, deep learning, data mining, and human computer interaction.\n<br><br>\nA broad array of business challenges include autonomous flight, security access and surveillance systems, people transport, analytics of jet engine data, human in the loop adaptive learning and the reduction of building energy usage through monitoring and diagnostics. Were looking for people eager to find new ways to extract value through the integration of new and existing data sources with cutting edge analysis and tools.\n<br><br>\nThe individual contributor Data Scientist role will be responsible for creating, machine learning models. Working knowledge and familiarity with statistical machine learning models are essential. A balance of development, mathematics and problem framing skills is essential.\n<br><br>\nThe candidate will interact with United Technologies Research Center (UTRC) Program Offices and United Technologies Corporation (UTC) business units to enhance existing programs and provide technical expertise for decision support method development.<br><br><strong>Qualification:</strong><br><br>The candidate must be able to work effectively in a multidisciplinary, multinational team environment focused on innovation and be able to partner with leading, worldwide institutions (university, government agencies, national labs, and professional organizations) to meet organizational objectives. The candidate should have good communication skills and must be able to provide timely, accurate and detailed reports, presentations and technical papers.\n<br><br>\nRequired skills:\n<br><br>\n- Statistical modeling / data mining.\n<br><br>\n- Solid machine learning foundation.\n<br><br>\n- Anomaly detection and diagnostics.\n<br><br>\n- Graphical model analysis\n<br><br>\nPlusses:\n<br><br>\n- Cloud / distributed computing experience (Hadoop)\n<br><br>\n- Deep neural network experience\n<br><br>\n- Data management expertise\n<br><br>\n- Big Data mining experience with structured and unstructured data.\n<br><br>\n- Python, Matlab\n<br><br>\nThis role requires US Green card holder or US Citizenship.<br><br><strong>Education:</strong> Required:\n<br>\nM.S.+ 1-2 years experience such as CS, Mathematics, Physics, Engineering or related field.<br><br>United Technologies Corporation is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class."}