{"job title": "Sr. Data Engineer", "company": "Vulcan", "city state": "– Seattle, Washington", "rating": "3.2", "job description": "Description\n<br>\n <div>\n<em>Position at Vulcan</em></div>\n<br><strong>Position Summary</strong>\n<br><br>\nThe ideal Senior Data Engineer candidate will tackle challenges with an entrepreneurial spirit and have the capacity to deliver across a broad range of domains and technologies. On the Skylight team, the most critical skill is to quickly learn and adapt quickly in order to meet the challenges put in front of us. You are an agile enthusiast and evangelist that understand that the culture and environment we create is fundamental to creating a high performance team.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<br><br>\n<strong>Knowledge, experience, skill, and/or ability </strong>\n<br><br>\n<strong>Required</strong>\n<ul>\n<li>Advanced working SQL knowledge and experience with relational databases (preferably PostgreSQL), query authoring (SQL) as well as familiarity with a variety of databases.</li><li>Experience building and optimizing ‘big data’ data pipelines, architectures and data sets.</li><li>Established track record of delivering complex software solutions to delight customers</li><li>Problem-solving skills and the abilities to analyze quantitatively, scope technical requirements and effectively prioritize program deliverables</li><li>A proven ability to work hands-on in a fast-paced changing environment requiring creativity and independent judgement</li><li>Ability to manage multiple priorities in a dynamic environment</li><li>Ability to work in a changing environment and work under tight deadlines</li><li>Demonstrate honesty, responsibility, integrity and fulfillment of commitments</li>\n</ul>\n<strong>Preferred</strong>\n<ul>\n<li>Experience with NoSQL databases such as Cassandra, Mongo and/or HBAse</li><li>Strong data modeling skills (normalized and multidimensional)</li><li>Experience with building Data platforms with open source software such as Kafka, Hadoop, Samza and/or Storm.</li><li>Proven Expertise at several software development languages, preferably Python or Java.</li><li>Be disciplined with implementing unit tests, continuous integration and continuous delivery to production, source code repositories and build systems for delivery of all software.</li><li>Experience delivering solutions on AWS, Google Cloud or Azure</li><li>Experience with modern deployment technologies such as Docker, Kubernetes</li>\n</ul>\n<strong>Education/experience/certifications</strong>\n<ul>\n<li>Bachelor's degree and/or Master's degree in Computer Science or equivalent.</li><li>A minimum of 10 years of software development experience</li>\n</ul>\n<strong>Special Remarks Regarding Work Environment, If Applicable</strong>\n<ul>\n<li>Travel estimated to be 10%</li><li>Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</li>\n</ul>\nVulcan is an equal opportunity employer that values diversity at our company. We encourage people from all walks of life to apply without regard to race, age, gender, religion, disability, LGBTQ status, or any other characteristic protected by law. Our management team does not tolerate discrimination or harassment at any point during our employees’ and applicants’ time with us, especially with respect to recruitment, hiring, placement, promotion, transfer, training, compensation, benefits, employee activities, and general treatment during employment.\n<br><br>\nIf you need accommodation during the application or hiring process, please contact Human Resources at jobs@vulcan.com or your recruiter."}