{"job title": "Applied Data Scientist", "company": "Wolters Kluwer", "city state": "– Waltham, MA", "rating": "3.1", "job description": "Do you want to use your skills and talent to make a meaningful impact on healthcare?\n<br><br>\nWolters Kluwer Health is a fast-growing and innovation-driven healthcare information technology company working on the front lines of clinical care. Our talented team of clinicians, technologists, and product visionaries collaborate to provide advanced solutions that tackle some of the most challenging problems in our healthcare system.\n<br><br>\nWe are searching for a data scientist who is passionate about technology and healthcare to build models and applications in areas such Machine Learning and Natural Language Processing. You should be willing to take on challenges of unknown dimensions, and work hand in hand with clinicians, customers, and developers. You will need to have very strong technical skills in data sciences and a proven ability to deliver products to the market.\n<br><br>\nReporting into the Wolters Kluwer Health CTO team, this role is crucial to the continued growth and evolution of one of the leading global healthcare technology companies.\n<br><br>\n<strong>ESSENTIAL DUTIES AND RESPONSIBILITIES</strong>\n\n\n<ul>\n<li>Engage as a key member of the applied data sciences team</li>\n<li>A self-starter who can align the technology with the overall product strategy</li>\n<li>Develop novel algorithms and models in the medical domain in collaboration with clinicians, product managers, and software engineers</li>\n<li>Develop models to infer or predict disease conditions with a high level of accuracy</li>\n<li>Work on training and refining various models to attain a high bar of required accuracy needed in healthcare</li>\n<li>Learn fast through hands-on rapid prototyping of 3rd party software, both commercial and Open Source, and proprietary development</li>\n<li>Assess various machine learning frameworks and packages</li>\n<li>Collaborate effectively with other data sciences teams to align on direction and leverage existing tools and knowledge</li>\n<li>Monitor trends in AI to influence the solutions within Wolters Kluwer Health</li>\n</ul>\n\n<strong>OTHER DUTIES</strong>\n<br><br>\nPerforms other duties as assigned by supervisor.\n<br><br>\n<strong>Education:</strong>\n\n\n<ul>\n<li>PhD in Computer Science, Electrical Engineering, Mathematics or equivalent; specializing in machine learning, NLP, or a related field.</li>\n</ul>\n\n<strong>Experience:</strong>\n\n\n<ul>\n<li>1+ year work experience in advanced technical domains, data sciences, and machine learning techniques</li>\n<li>Familiarity with programming for data science in languages such as Python or R</li>\n<li>Demonstrated ability to function within a team of multiple disciplines</li>\n</ul>\n\nThe following is highly desired, but not required:\n\n\n<ul>\n<li>Strong research publication record</li>\n<li>Expertise in software development</li>\n<li>Experience in Semantic Web technologies</li>\n<li>Experience in healthcare</li>\n<li>Experience or understanding of SNOMED, ICD-10, LOINC, and CPT</li>\n<li>Strong communication skills and the ability to relay and simplify complex concepts</li>\n</ul>\n\n<strong>TRAVEL REQUIREMENTS</strong>\n<br><br>\nUp to 5% travel might be needed\n<br><br>\n<strong>?</strong>\n<br><br>\nAbout Wolters Kluwer\n<br><br>\n<strong>?</strong>\n<br><br>\nWolters Kluwer N.V. (AEX: WKL) is a global leader in information services and solutions for professionals in the health, tax and accounting, risk and compliance, finance and legal sectors. We help our customers make critical decisions every day by providing expert solutions that combine deep domain knowledge with specialized technology and services.\n<br><br>\n<strong>?</strong>\n<br><br>\nWolters Kluwer reported 2017 annual revenues of ?4.4 billion. The company, headquartered in Alphen aan den Rijn, the Netherlands, serves customers in over 180 countries, maintains operations in over 40 countries and employs 19,000 people worldwide.\n<br><br>\n<strong>?</strong>\n<br><br>\nWolters Kluwer shares are listed on Euronext Amsterdam (WKL) and are included in the AEX and Euronext 100 indices. Wolters Kluwer has a sponsored Level 1 American Depositary Receipt program. The ADRs are traded on the over-the-counter market in the U.S. (WTKWY).\n<br><br>\n<strong>?</strong>\n<br><br>\nFor more information about our solutions and organization, visit www.wolterskluwer.com, follow us on Twitter, Facebook, LinkedIn, and YouTube.\n<br><br>\n<strong>?</strong>\n<br><br>\n<strong>EQUAL EMPLOYMENT OPPORTUNITY</strong>\n<br><br>\nWolters Kluwer U. S. Corporation and all of its subsidiaries, divisions, and customer/business units is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status.\n<br><br>\n<strong>?</strong>\n<br><br>\n<strong>INFORMATION</strong>\n<br><br>\nFor any assistance with your application for this job opening, please call the HR Source at (888) 495-4772 or email HRSource@WoltersKluwer.com. TTY is also available at 888 (495) 4771,\n<br><br>\nEqual Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}