{"job title": "Data Scientist - Auto Valuations", "company": "Ally", "city state": "– Fort Washington, PA", "rating": "3.4", "job description": "Position Description\n<br><br>\nCreate, maintain business intelligence solutions to support operations, online and physical auctions. Work closely with business leaders to identify and analyze emerging trends and make recommendations for future.\n<br><br>\nJob Responsibilities\n<br><br>\n+ Perform data analysis monitoring to provide proactive business strategy\n<br><br>\n+ Analyze online auction sales performance\n<br><br>\n+ Perform ad-hoc analysis to find solutions to business inquiries\n<br><br>\n+ Leverages understanding of business to make recommendations to meet business needs\n<br><br>\n+ Work with 3rd party vendors and IT to implement decisions\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n+ Bachelor's degree in quantitative or technical field required (Mathematics, Statistics, Engineering, Economics, Computer Science, etc). Master's degree strongly preferred.\n<br><br>\n+ 5+ years in a business analytics role in Auto Lending, Risk Management and/or Credit Strategy Development\n<br><br>\n+ Comfortable with analyzing complex problems and creating innovative strategy\n<br><br>\n+ Ability to work independently with strong attention to detail\n<br><br>\n+ Strong written and spoken communication skills\n<br><br>\n+ Represents Ally in a professional and positive manner in all situations\n<br><br>\n<strong>+ Must have SAS strong experience:</strong>\n<br><br>\n+ Experience with structured and unstructured data\n<br><br>\n+ Fluent in SAS Macro language\n<br><br>\n+ Experience with statistical analysis, predictive modeling or artificial intelligence/machine learning algorithms strongly preferred\n<br><br>\n+ Strong skill and experience in data mining\n<br><br>\n+ Proficient working with databases: Oracle, SQL server, Teradata, etc\n<br><br>\nAlly Overview\n<br><br>\nAlly Financial Inc. is a leading automotive financial services company powered by a top direct banking franchise with the opportunity, experience and people to redefine the industry.\n<br><br>\nAlly's automotive services business offers a full suite of financing products and services, including new and used vehicle inventory and consumer financing, leasing, inventory insurance, commercial loans and vehicle remarketing services. Ally Bank, the company's direct banking subsidiary and member FDIC, offers an array of deposit products, including certificates of deposit, savings accounts, money market accounts, IRA deposit products and interest checking. Ally's Corporate Finance unit provides financing to middle-market companies across a broad range of industries.\n<br><br>\nBusiness Unit/Enterprise Function\n<br><br>\nAlly Auto works directly with dealers nationwide to provide one of the most comprehensive suites of auto financing products and services in the industry. Ally offers new and used vehicle inventory financing, consumer financing, leasing, commercial loans and vehicle remarketing services. As a full-service provider, Ally understands dealer needs and is committed to helping them maximize sales and profitability. With nearly 100 years of industry experience, our employees' expertise allows us to provide our customers with the highest level of service, providing value that helps dealers build brands, better serve customers and stay ahead of the competition. Ally is also a full spectrum auto servicing organization that includes value streams from customer care to remarketing, and many support areas. It is a fast-paced, challenging and collaborative working environment. Our employees are focused on consistently delivering a superior customer experience.\n<br><br>\nTotal Rewards Information\n<br><br>\nAlly's compensation program offers market-competitive base pay and bonus pay potential based on achieving personal and company goals. Plus, we have a flexible paid time-off program with an emphasis on work-life balance.\n<br><br>\nAlly offers a variety of benefits to protect your health and well-being, provide financial security and balance your work-life needs including:\n<br><br>\n+ Industry-leading 401K Retirement Savings Plan including Matching and Company Contributions\n<br><br>\n+ Comprehensive wellness program with financial incentives designed to help you achieve your best health\n<br><br>\n+ Flexible health insurance options including dental and vision\n<br><br>\n+ Pre-tax Health Savings Account with generous employer contributions\n<br><br>\n+ Pre-tax dependent care and commuter benefits\n<br><br>\n+ Other work-life integration benefits including Paid Parental &amp; Caregiver Leave, Adoption Assistance, Back-up Child &amp; Adult/Elder Care, Child Care Discounts, Tuition Reimbursement, LifeMatters Employee Assistance Program, Weight Watchers and other employee discount programs\n<br><br>\nAlly is an Equal Opportunity Employer\n<br><br>\nWe extend equal employment opportunities to qualified applicants and employees on an equal basis regardless of an individual's age, race, color, sex, religion, national origin, disability, sexual orientation, gender identity or expression, pregnancy status, marital status, military or veteran status, genetic disposition or any other reason protected by law.\n<br><br>\n<strong>\\#LI-RS1</strong>\n\n\n<ul>\n<li>*Job Title:** Data Scientist - Auto Valuations</li>\n<li>*Company:** Ally Financial Inc.</li>\n<li>*Category:** Financial Analysis</li>\n<li>*BU Function:** Auto</li>\n<li>*Requisition ID:** 18-5770</li>\n</ul>"}