{"job title": "Sr. Data Scientist", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "Amazon.coms Transaction Risk Management Services (TRMS) mission is to make Amazon the safest and most trusted place worldwide to transact online. Amazon runs one of the most dynamic e-commerce marketplaces in the world, with nearly 2 million sellers worldwide selling hundreds of millions of items in ten countries. TRMS safeguards every financial transaction across all Amazon sites. As such, TRMS designs and builds the software systems, risk models, and operational processes that minimize risk and maximize trust in Amazon.com. The TRMS organization is looking for a Data Scientist for its Risk Mining Analytics (RMA)s team, whose mission is to combine advanced analytics with investigator insight to detect negative customer experience, improve system effectiveness, and prevent bad debt across Amazon.\n<br><br>\nAs a Sr. Data Scientist, Risk Mining, you will be responsible for modeling complex problems, discovering insights, and building cutting edge risk algorithms that identify opportunities through statistical models, machine learning, and visualization techniques to improve operational efficiency and reduce bad debt.\n<br><br>\nYou will need to collaborate effectively with business and product leaders within TRMS and cross-functional teams to build scalable solutions against high organizational standards. The candidate should be able to apply a breadth of tools, data sources, and Data Science techniques to answer a wide range of high-impact business questions and proactively present new insights in concise and effective manner.\n<br><br>\nThe candidate should be an effective communicator capable of independently driving issues to resolution and communicating insights to non-technical audiences. This is a high impact role with goals that directly impacts the bottom line of the business.\n<br><br>\n<strong>Responsibilities:</strong>\n<br>\n· Analyze terabytes of data to define and deliver on complex analytical deep dives to unlock insights and build scalable solutions through Data Science to ensure security of Amazons platform and transactions\n<br>\n· Build Machine Learning and/or statistical models that evaluate the transaction legitimacy and track impact over time\n<br>\n· Ensure data quality throughout all stages of acquisition and processing, including data sourcing/collection, ground truth generation, normalization, transformation, and cross-lingual alignment/mapping\n<br>\n· Define and conduct experiments to validate/reject hypotheses, and communicate insights and recommendations to Product and Tech teams\n<br>\n· Develop efficient data querying infrastructure for both offline and online use cases\n<br>\n· Collaborate with cross-functional teams from multidisciplinary science, engineering and business backgrounds to enhance current automation processes\n<br>\n· Learn and understand a broad range of Amazons data resources and know when, how, and which to use and which not to use.\n<br>\n· Maintain technical document and communicate results to diverse audiences with effective writing, visualizations, and presentations\n<br>\n· Provide mentorship and technical guidance to Data Scientists on the team"}