{"job title": "Intern Applied Data Scientist", "company": "Civis Analytics", "city state": "– Chicago, IL", "rating": "4.5", "job description": "<strong>About the Company</strong><br><br>Are you interested in using data science to solve new and challenging problems in innovative ways — like helping a green energy startup find new areas of growth, building a resource optimization solution for a healthcare provider network, or shaping the product and engagement strategy for a large Fortune 500 company? Civis Analytics is looking for an Applied Data Scientist intern to join our commercial practice in our Chicago office and help us solve some of the most challenging and interesting questions facing businesses today.\n<br><br>\nCivis Analytics helps businesses use data to gain a bold advantage in how they identify, attract, and engage loyal customers and employees. With a powerful combination of elite proprietary data, cutting-edge software solutions, and an interdisciplinary team of data scientists, developers, and survey science experts, Civis works with Fortune 500 companies and the country’s largest nonprofits to make data-driven decision-making essential to how the world’s best companies do business.\n<br><br>\nCivis embraces the individuality of our employees and we celebrate each other's differences. Our products, services, and culture benefit from and thrive on the unique perspectives brought by each person in our Civis community. We're proud to be an equal opportunity workplace, and we are committed to equal employment opportunity regardless of race, age, sex, color, ancestry, religion, national origin, sexual orientation, gender identity, citizenship, marital status, disability, or Veteran status. If you have a disability or special need that requires accommodation, please let us know.\n<br><br>\n<strong>About the Role</strong>\n<br><br>\nThe Applied Data Science (ADS) Team is the advisory arm of Civis Analytics, working closely with governments, companies, nonprofits, and campaigns to help solve their toughest challenges with data science. They are critical components of the project team and are expected to take leadership in understanding how to design and implement data science solutions for each client’s unique situation\n<br><br>\nWe are looking for individuals from a diversity of backgrounds with demonstrated quantitative and problem-solving skills. We value creativity, hard work, and on-the-job-excellence and offer competitive compensation. In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States. Juniors and graduate students only. Our paid summer internships are a full-time, 10-12 week commitment.\n<br><br>\n<strong>Minimum Qualifications</strong>\n\n<ul>\n<li>2020 graduate pursuing an undergraduate or graduate degree in social science, mathematics or statistics or a similarly analytical subject</li>\n<li>A demonstrated history of using data in research or applied settings to solve complex problems or make strategic decisions</li>\n<li>Experience identifying, working with, and adapting to imperfect data.</li> \n\n<li>An ability and eagerness to constantly learn and teach others</li> \n\n<li>Demonstrated ability to work independently and in teams</li> \n\n<li>Experience with statistical packages (R, Python, etc) and statistical concepts</li> \n\n<li>Ability to communicate complex analysis to differently technical audiences through strong written and oral communication skills</li>\n<li>Resourceful - not easily deterred by setbacks</li>\n</ul>\n<strong>Preferred Qualifications</strong>\n\n<ul>\n<li>Experience with data cleaning, wrangling</li>\n<li>Proven track record of working with ambiguous problems</li>\n<li>Experience or expertise with SQL</li> \n\n<li>Experience putting together and giving client-ready presentations</li>\n</ul>"}