{"job title": "Data Scientist (eCommerce)", "company": "Electronic Arts", "city state": "– Redwood City, CA", "rating": "3.8", "job description": "<strong>We are EA</strong>\n<br><br>\nAnd we make games how cool is that? In fact, we entertain millions of people across the globe with the most amazing and immersive interactive software in the industry. But making games is hard work. Thats why we employ the most creative, passionate people in the industry.\n<br><br>\n<strong>The Challenge Ahead</strong>\n<br><br>\nThe EA Digital Platform team designs and operates an industry leading service platform that provides hundreds of millions of gamers with personalized experiences registration, login, account security, offer catalog, checkout, fraud prevention, billing &amp; payments, entitlement &amp; DRM services, subscription management, and transactional messaging. Our games are played everywhere in the world and on any kind of gaming device (PC, web, console, mobile, smart TVs) and support a wide range of business models (digital downloads, premium content, free to play, subscriptions).\n<br><br>\nWe are looking for a Data Scientist to work in the Business Operations team that manages fraud operations and payment operations for EAs Digital Platform. Your primary focus will be to analyze the behavior of our user accounts and customers, identify fraud trends and high risk transactions, take statistical or machine learning techniques when designing algorithms and heuristics rules to prevent fraudulent payments and losses, and work with Engineering to implement, test, monitor and improve the performance of the product.\n<br><br>\n<strong>Responsibilities</strong>:\n<ul>\n<li>Analyze large data sets to identify behavior trends among good users and bad actors, using statistics, data mining, and machine learning techniques.</li><li>Develop algorithms and heuristics that will quickly identify fraudulent transactions, fraudulent account creation, account compromise and other high-risk activities</li><li>Research new predictive modeling techniques, assist in business case development for investing in new data technologies needed to support best-of-breed fraud detection</li><li>Build prototype tools for investigating fraud events/behavior and analyzing system-wide trends</li><li>Rapidly respond to operational needs by providing adhoc analytical support</li><li>Partner with Engineering and Operations teams to define product requirements</li><li>Build automated reports (e.g. Tableau), dashboards, and performance metrics, as requested</li>\n</ul>\n<strong>Job Requirements:</strong>\n<ul>\n<li>Ability to thrive in a dynamic, fast-paced environment with ability to multi-task.</li><li>Strong problem solving and team collaboration attitude.</li><li>Results-driven and highly quantitative.</li><li>True passion for understanding customer behavior on-platform and in-game.</li><li>Strong interpersonal and communication skills.</li>\n</ul>\n<strong>Skills and Experience:</strong>\n<ul>\n<li>5 years in business or data analysis with preferred experience from e-commerce, online payments, fraud/risk management, social networking, or gaming industry.</li><li>Masters degree required in a quantitative discipline such as Computer Science, Mathematics, Statistics, Economics, Engineering, Operations Research; PhD preferred.</li><li>Strong analytical skills including the ability to interpret and manipulate large structured and semi-structured data, develop recommendations and analysis.</li><li>Experience to manage and implement advanced analytics projects which solve complex analytical problems using machine learning, pattern recognition, and/or data mining technologies.</li><li>Be familiar with coding in Python/Java/SCALA, and SQL/NoSQL, tools (e.g. R) and Apache Spark framework.</li><li>Ability to communicate insights to technical and non-technical audiences.</li><li>Self-motivated, work well both independently and as part of an agile team.</li>\n</ul>\n<strong>Whats in it for you? Glad you asked!</strong>\n<br><br>\nWe love to brag about our great perks like comprehensive health and benefit packages, tuition reimbursement, 401k with company match and, of course, free video games. And since we realize it takes world-class people to make world-class games, we offer competitive compensation packages and a culture that thrives off of creativity and individuality. At EA, we live the work hard/play hard credo every day.\n<br><br>\nEA is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, ancestry, pregnancy, age, sexual orientation, marital status, protected veteran status, medical condition or disability, or any other characteristic protected by law."}