{"job title": "Principal Data Scientist", "company": "Electronic Arts", "city state": "– Redwood City, CA", "rating": "3.8", "job description": "The Principal Data Scientist is a key position in our Data Science team within the Global Analytics and Insights group at Electronic Arts, charged with helping drive excellence and pushing innovation across EA. The successful candidate will use his or her expertise in applied machine learning and artificial intelligence to drive critical decisions in a fast paced, cross-functional environment.\n<br><br>\n<em><strong>Responsibilities</strong></em>\n<ul>\n<li>Research and design innovative approaches to obtuse problems, aiding in the implementation and scaling of these cutting edge systems</li><li>Push excellence in the rest of the data science organization within the global analytics org and around EA</li><li>Use big data technologies to scale predictive models to millions of players</li><li>Develop new tools and libraries that empower the business</li><li>Communicate actionable results and findings derived from data throughout the organization in a clear, concise way</li><li>Collaborate with other areas of the business on long-term projects</li><li>Learn, implement and share new methodologies</li>\n</ul>\n<em><strong>Background</strong></em>\n<ul>\n<li>Ph.D. in Computer Science, Machine Learning, Artificial Intelligence, Statistics, or related quantitative field</li> <li>10+ years of experience in applied machine learning/deep learning</li><li>Demonstrated experience applying Data Science methodologies to real world problems</li><li>Experience in scaling up smaller projects and sharing work collaboratively across a wider team</li> <li>Expert status in analyzing extremely large, complex, multi-dimensional data sets with a variety of tools</li><li>Strong programming experience in a system programming language such as C/C++ or Java.</li><li>Familiarity with at least one scripting language: R, Python, or Scala</li><li>Experience querying large databases</li><li>Ability to communicate insights to technical and non-technical audiences</li><li>Experience with any of the following is a big plus:</li><li>Big data technologies such as Hadoop, MapReduce, Hive, Pig</li><li>Model production in Spark</li><li>Application deployment using AWS, Virtual Machines, or Docker</li><li>A humility and drive to be a \"learn-it-all\"</li>\n</ul>\n<em><strong>Attributes</strong></em>\n<ul>\n<li>Eager to use data for insights and has a demonstrated passion for applying data science to make business critical decisions and recommendations</li><li>Hypothesis driven uses data to test ideas rigorously and objectively</li><li>Able to create compelling communication for executives</li><li>Willingness to mentor more junior data scientists</li><li>Desire to stay on the cutting edge, going out of their way to find and learn the \"latest and greatest\"</li><li>Flexible and adaptable while maintaining positive attitude</li><li>Self starter with passion, energy, enthusiasm to drive results and affect meaningful change</li><li>A team player who is able to work collaboratively within the group and across business units/functions</li>\n</ul>\n<em><strong>Whats in it for you? Glad you asked!</strong></em>\n<br><br>\nWe love to brag about our great perks like comprehensive health and benefit packages, tuition reimbursement, 401k company match and, of course, many other perks! And since we realize it takes world-class people to make world-class games, we offer competitive compensation packages and a culture that thrives off of creativity and individuality. At EA, we live the work hard/play hard credo every day.\n<br><br>\nMore about our location: https://www.ea.com/careers/careers-overview/redwood-shores\n<br><br>\n<em>EA is an equal opportunity employer. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status or veteran status. We will also consider for employment qualified applicants with criminal records in accordance with applicable law.</em>\n<br><br>\n<em>*LI-AC1</em>"}