{"job title": "Data Scientist - Personalization", "company": "Nike", "city state": "– Beaverton, OR", "rating": "3.9", "job description": "Become a Part of the NIKE, Inc. Team\n<br><br>\nNIKE, Inc. does more than outfit the world's best athletes. It is a place to explore potential, obliterate boundaries and push out the edges of what can be. The company looks for people who can grow, think, dream and create. Its culture thrives by embracing diversity and rewarding imagination. The brand seeks achievers, leaders and visionaries. At Nike, it?s about each person bringing skills and passion to a challenging and constantly evolving game.\n<br><br>\nConsumer conversations and relationships fuel the work of Nike Marketing. It?s the fuel that has built one of the most recognizable brands in the world. Nike Marketing captures the science, art and emotion of Nike's innovations and connects them with the hearts, minds and souls of athletes. The pros in brand strategy, advertising, digital engagement, product presentation, consumer analytics and more foster consumer connections via channels ranging from Nike Stores to social media. They approach marketing in a way that only Nike can: taking risks, pushing boundaries and inspiring consumers to be champions.\n\n\n<ul>\n<li>*Description**</li>\n</ul>\n\nData/Measurement Scientist -- Personalization\n<br><br>\nGlobal Consumer Knowledge\n<br><br>\nNike does more than outfit the world's best athletes. We are a place to explore potential, obliterate boundaries, and push out the edges of what can be.\n<br><br>\nNike?s Global Consumer Knowledge Center of Excellence is a growing team responsible for building and deepening a holistic view of Nike?s consumers through data and analytics, and applying those insights to inform the development of incredible digital services and experiences for our consumers.\n<br><br>\nWe are looking for a scientist with tech industry experience to help build our core data products and modeling/experimentation processes. We want someone who loves modeling and writing code?who likes to get their hands dirty. This is a young and growing team, so the ideal candidate is ready for a leadership role, defining and socializing best practices for the team.\n<br><br>\nWe are looking for a seasoned hand. Someone who is comfortable with state of the art modeling or machine learning algorithms, but can think in terms of the compute process and coupling between systems.\n<br><br>\nWe?re looking for someone who thrives in a dynamic setting. Communication and leadership skills are key. You?ll get to work with scientists with a breadth of experiences across industry and academia, including in machine learning, statistics, epidemiology, and physics. You?ll be expected to go deep and learn with them, as a peer.\n\n\n<ul>\n<li>*Qualifications**</li>\n</ul>\n\n<strong>Key responsibilities:</strong>\n<br><br>\n? Develop models that help us understand and describe our customers, e.g. learning how to extract deep interests and tendencies from event streams.\n<br><br>\n? Manage an experimentation portfolio that validates and feed back into our core customer understandings.\n<br><br>\n? Build processes to support fast, iterative experimentation, both for model creation and for customer-facing products.\n<br><br>\n? Define best practices for scientific code development and deployment.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n<strong>Education:</strong>\n<br><br>\n? B.S. in CS, statistics, applied math, physics or other quantitative discipline\n<br><br>\n? Advanced degree (Masters or PhD) preferred\n<br><br>\nExperience\n<br><br>\n? 2 + years post grad expereince in a role developing predictive or explanatory models and/or experimentation processes\n<br><br>\n? Experience working with data and analytics\n<br><br>\n? Experience with moderate to large-scale data sets (&gt;100GB) preferred\n<br><br>\n? Experience as a lead preferred\n<br><br>\n? Experience with neural nets and deep architectures preferred\n<br><br>\n<strong>Required Skills</strong>\n<br><br>\n? Core mathematical ability to understand, utilize and innovate on state-of-the art machine learning algorithms and/or statistical modeling\n<br><br>\n? Expertise in at least one production-quality programming languages (e.g. java, python, C++)\n<br><br>\n? Exceptional communication skills\n<br><br>\n? Expertise with Hadoop ecosystem (mapreduce, hive, pig, spark) is a plus\n<br><br>\n? Expertise with ETL processes a plus\n<br><br>\n<strong>\n<ul>\n<li>*Qualifications** Key responsibilities:</li>\n</ul>\n\n</strong>\n<br>\n? Develop models that help us understand and describe our customers, e.g. learning how to extract deep interests and tendencies from event streams.\n<br><br>\n? Manage an experimentation portfolio that validates and feed back into our core customer understandings.\n<br><br>\n? Build processes to support fast, iterative experimentation, both for model creation and for customer-facing products.\n<br><br>\n? Define best practices for scientific code development and deployment.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n<strong>Education:</strong>\n<br><br>\n? B.S. in CS, statistics, applied math, physics or other quantitative discipline\n<br><br>\n? Advanced degree (Masters or PhD) preferred\n<br><br>\nExperience\n<br><br>\n? 2 + years post grad expereince in a role developing predictive or explanatory models and/or experimentation processes\n<br><br>\n? Experience working with data and analytics\n<br><br>\n? Experience with moderate to large-scale data sets (&gt;100GB) preferred\n<br><br>\n? Experience as a lead preferred\n<br><br>\n? Experience with neural nets and deep architectures preferred\n<br><br>\n<strong>Required Skills</strong>\n<br><br>\n? Core mathematical ability to understand, utilize and innovate on state-of-the art machine learning algorithms and/or statistical modeling\n<br><br>\n? Expertise in at least one production-quality programming languages (e.g. java, python, C++)\n<br><br>\n? Exceptional communication skills\n<br><br>\n? Expertise with Hadoop ecosystem (mapreduce, hive, pig, spark) is a plus\n<br><br>\n? Expertise with ETL processes a plus\n<br><br>\nNIKE, Inc. is a growth company that looks for team members to grow with it. Nike offers a generous total rewards package, casual work environment, a diverse and inclusive culture, and an electric atmosphere for professional development. No matter the location, or the role, every Nike employee shares one galvanizing mission: To bring inspiration and innovation to every athlete* in the world.\n<br><br>\nNIKE, Inc. is committed to employing a diverse workforce. Qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, veteran status, or disability.\n\n\n<ul>\n<li>*Job ID:** SRC120217 - DS - Per</li>\n<li>*Location:** United States-Oregon-Beaverton</li>\n<li>*Job Category:** Marketing, Marketing &amp; Communications</li>\n</ul>"}