{"job title": "Research Scientist - Data Analytics", "company": "Philips", "city state": "– Cambridge, MA", "rating": "3.4", "job description": "We are seeking an exceptional, self-motivated, seasoned individual with excellent track record to participate in the growth of our Acute Care Solutions group. Our interests are in predictive modeling, simulation, and outcome management.\n<br><br>\n<strong>As a Research Scientist you will:</strong>\n<br><br>\n+ Conduct research, design, develop and evaluate first-of-kind data analytics solutions to provide real time diagnostics and therapeutic decision support applications.\n<br><br>\n+ Interact with clinical customers to understand their problems, share insights and best practices, and validate prototypes of solutions to assess their value in patient care.\n<br><br>\n+ Partner with Philips business groups to deliver innovations in a timely and high-quality manner.\n\n\n<ul>\n<li>*In this role, you have the opportunity to:**</li>\n</ul>\n\nDrive our expanding efforts in healthcare research for real time diagnostic and therapeutic decision support applications. Our interests are in big healthcare data analytics, predictive modeling, precision medicine, and outcome management. Collaborative relationships are maintained with universities, scientific institutions, academic organizations and governmental resources.\n\n\n<ul>\n<li>*You are responsible for:**</li>\n</ul>\n\nWe are seeking a Research Scientist with strong machine learning skills, database experience, and demonstrated experience in healthcare or someone who can bring new expertise in the area of multi-modal modeling including -omic data with a strong clinical understanding. This scientist should be an exceptional, self-motivated, seasoned individual with excellent track record who will participate in the growth of our Acute Care Solutions group. Our interests are in predictive modeling, simulation, and outcome management.\n<br><br>\n+ Conduct research, design, develop and evaluate first-of-kind data analytics solutions to provide real time diagnostics and therapeutic decision support applications.\n<br><br>\n+ Apply wide array of analytic skills including machine learning, statistics, NLP, image processing, to extract insights from real world clinical data.\n<br><br>\n+ Work with big healthcare datasets and build analytic pipelines.\n<br><br>\n+ Generate insights by integrating diverse data types e.g. physiological waveforms, imaging, clinical text, and molecular biomarkers\n<br><br>\n+ Apply machine/deep learning to elucidate disease trajectories, patient subtypes, for conditions encountered in acute care and critical care settings.\n<br><br>\n+ Interact with clinical customers to understand their problems, share insights and best practices, and validate prototypes of solutions to assess their value in patient care.\n<br><br>\n+ Collaborate with Philips business groups to deliver innovations in a timely and high-quality manner.\n\n\n<ul>\n<li>*You are a part of:**</li>\n</ul>\n\nPhilips Research is at the forefront of healthcare research. Existing now for 100 years, Philips Research has been one of the world's premier research labs and now has more than 1000 research scientists and engineers around the world. Our agenda includes discovering fundamental principles and developing scientific and engineering innovations to enhance health and well-being. Philips is a pioneer and leader in the healthcare industry.\n\n\n<ul>\n<li>*To succeed, you should have the following skills and experience:**</li>\n</ul>\n\n+ Ph.D. in computer sciences, biostatistics, medical informatics, mathematics, computer science, biomedical engineering, or a related field.\n<br><br>\n+ Ability to interact with a variety of large-scale data structures e.g. SQL, noSQL, Elastic Search.\n<br><br>\n+ Experience with machine learning libraries and programming languages (Python, R)\n<br><br>\n+ Publishing scientific papers and presenting at scientific conferences\n<br><br>\n+ Excellent oral and written communication skills\n<br><br>\nDesirable skills\n<br><br>\n+ Research experience working on novel applications for use in hospital settings\n<br><br>\n+ Experience working with real world healthcare data.\n<br><br>\n+ Physiological signal processing\n<br><br>\n+ Knowledge of human physiology\n<br><br>\n+ High performance computing using Hadoop, cloud infrastructure, or related technology\n<br><br>\n+ Government grant applications\n<br><br>\n+ Ability to work with cross-functional teams\n\n\n<ul>\n<li>*In return, we offer you:**</li>\n</ul>\n\nWe are happy to provide an opportunity to work with one of the strongest research labs in the world and deliver solutions will have a direct impact on patient care. You will be part of flexible team of highly skilled professionals that are able to find an excellent work-life balance. Just think the solutions you develop will give a better balance to the healthcare professionals and patients they are treating.\n\n\n<ul>\n<li>*Why should you join Philips?**</li>\n</ul>\n\nAre you passionate about having a career that will improve healthcare? Do you want your efforts to be more than a job? At Philips, it is a calling to build a healthier society through relevant work, passionate about improving 3 billion lives a year by delivering creative solutions across the health continuum. Our people experience a variety of unexpected moments when their lives and careers come together in substantial ways.\n<br><br>\nWorking at Philips is more than a job. It?s a calling to create a healthier society through meaningful work, focused on improving 3 billion lives a year by delivering innovative solutions across the health continuum at http://www.philips.com/b-dam/corporate/corporateblog/2016/Philips_Chronic_Disease_5.jpg . Our people experience a variety of unexpected moments when their lives and careers come together in meaningful ways.\n<br><br>\nTo find out more about what it?s like working for Philips at a personal level, visit the Working at Philips page at http://www.philips.com/a-w/careers/healthtech/working-at-philips/working-at-philips.html on our career website, where you can read stories from our employee blog at http://www.usa.philips.com/a-w/our-people/life-at-philips.html . Once there, you can also learn about our recruitment process at http://www.philips.com/a-w/careers/healthtech.html , or find answers to some of the frequently asked questions at http://www.philips.com/a-w/careers/healthtech/faq.html .\n<br><br>\nPhilips is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex (including pregnancy), sexual orientation, gender identity, national origin, genetic information, creed, citizenship, disability, protected veteran or marital status.\n<br><br>\nAs an equal opportunity employer, Philips is committed to a diverse workforce. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants that require accommodation in the job application process may contact 888-367-7223, option 5, for assistance.\n<br><br>\n<strong>\\#LI-PH1</strong>"}