{"job title": "Data Scientist - SME", "company": "SAIC", "city state": "– Fort Bragg, NC", "rating": "3.6", "job description": "Data Scientist - SME (Job Number:439255)<br><br><br><br>*Description:*<br><br><br><br>JOB DESCRIPTION:<br><br>SAIC is looking for a Data Scientist who will interpret and analyze data from digital exploitation processes using exploratory and statistical techniques.<br><br><br><br>Job Tasks and Description:<br><br><br><br>- Lead the development, implementation and utilization of data systems and other strategies that optimize statistical efficiency and data quality.<br><br>- Lead the development of innovative data analysis techniques for ?Big Data?.<br><br>- Lead the analysis and interpret trends or patterns in large complex data sets.<br><br>- Lead the development of data modeling methods.<br><br>- Coordinates multifaceted scientific research and analytic activities and provides scientific and technical consultation.<br><br>- Analyze and interpret trends or patterns in complex data sets.<br><br>- Develop innovations in data analysis techniques.<br><br>- Provide briefings to JSOC leadership related to data science techniques and capabilities developed for exploiting/cataloguing/automating digital forensic exploitation.<br><br>- Conduct quantitative analysis.<br><br><br><br>*Qualifications:*<br><br><br><br>TYPICAL EDUCATION AND EXPERIENCE:<br><br><br><br>- Bachelors and nine (9) years or more experience; Masters and seven (7) years or more experience ; PhD or JD and four (4) years or more experience.<br><br><br><br>CLEARANCE REQUIREMENT:<br><br><br><br>- Must have a current/active TS/SCI security clearance.<br><br><br><br>REQUIRED EXPERIENCE:<br><br><br><br>- At least 6-10 years of recent experience.<br><br>- Experience and proficient in algorithms for data science, probability &amp; statistics, machine learning for data science, data analysis, and visualization.<br><br>- In depth- knowledge of SAS and/or R (prefer R).<br><br>- Ability to code in Python.<br><br>- Experience with Hive or Pig, as well as Hadoop.<br><br>- Ability to write and execute complex queries in SQL.<br><br>- Extensive experience working with unstructured data.<br><br>- Clearly and frequently translates technical findings to a non-technical team by providing quantifiable insights and understanding.<br><br>- Experience and understanding in developing and implementing a new data science program in an organization that is unfamiliar with its contributions.<br><br><br><br><br><br><br><br>*REQUIRED EDUCATION:*<br><br><br><br><br><br>- BA/BS as a minimum in Mathematics and Statistics, Computer Science, or Engineering.<br><br>REQUIRED CERTIFICATION:<br><br><br><br>- Certified Analytics Professional ? INFORMS is recommended<br><br><br><br>SAIC Overview:SAIC is a premier technology integrator providing full life cycle services and solutions in the technical, engineering, intelligence, and enterprise information technology markets. SAIC is Redefining Ingenuity through its deep customer and domain knowledge to enable the delivery of systems engineering and integration offerings for large, complex projects. SAIC's approximately 15,000 employees are driven by integrity and mission focus to serve customers in the U.S. federal government. Headquartered in Reston, Virginia, SAIC has annual revenues of approximately $4.5 billion. For more information, visit saic.com. For information on the benefits SAIC offers, see My SAIC Benefits. EOE AA M/F/Vet/Disability<br><br><br><br>*Job Posting:* Aug 16, 2018, 4:45:20 PM<br><br>*Primary Location:* United States-NC-FORT BRAGG<br><br>*Clearance Level Must Currently Possess:* Top Secret/SCI<br><br>*Clearance Level Must Be Able to Obtain:* Top Secret/SCI<br><br>*Potential for Teleworking:* No<br><br>*Travel:* Yes, 25% of the time<br><br>*Shift:* Day Job<br><br>*Schedule:* Full-time"}