{"job title": "Legacy Data Migration Data Scientist", "company": "SAIC", "city state": "– Fort Knox, KY", "rating": "3.6", "job description": "Legacy Data Migration Data Scientist (Job Number:437984)\n\n\n<ul>\n<li>Description:*</li>\n</ul>\n\nSAIC has a contingent job opportunity for a Legacy Data Migration Data Scientist to support an ARMY customer in Fort Knox, KY. This position is contingent upon contract award.\n<br><br>\n<strong>JOB DESCRIPTION:</strong>\n\n\n<ul>\n<li>The focus will be on legacy data migration of information from the incumbent.</li>\n<li>Translate business processes to develop technical aspects with the raw data. Understands DevOps and fields Operational Environment.</li>\n<li>Works in cross- functional teams with data at all stages of the analysis lifecycle to derive actionable insight.</li>\n<li>Translates mission needs into an end-to-end analytical approach to achieve results.</li>\n<li>Performs the pre-analytics areas of data collection and understanding, data cleansing and integration, and data storage and retrieval.</li>\n<li>Determines the appropriate analytics based on the data and the desired outcomes, using techniques including feature detection, statistics, data mining, predictive modeling, machine learning, natural language processing, and business intelligence. Interprets the validity of results and communicates the meaning of those results.</li>\n<li>Has familiarity with data wrangling, analytics, and visualization software and programming languages, including analytics methods for big data.</li>\n<li>Follows a scientific approach to generate value from data, verifying results at each step.</li>\n<li>Applies advanced technical principles, theories, and concepts.</li>\n<li>Contributes to development of new principles and concepts.</li>\n<li>Participates with senior managers to establish strategic plans and objectives.</li>\n<li>Recommends/makes decisions on administrative or project work matters and ensures effective achievement of program, project, or organizational objectives.</li>\n<li>Works on unusually complex technical problems and provides solutions that are highly innovative and ingenious.</li>\n<li>Works under consultative direction toward pre-determined long- range goals and objectives.</li>\n<li>Work checked through consultation and agreement with others rather than by formal review of supervisor.</li>\n<li>Exercises independent judgment in methods, techniques and evaluation criteria for obtaining results.</li>\n</ul>\n\n<strong>IMPACT:</strong>\n\n\n<ul>\n<li>Develops advanced technological ideas and guides their development into a final product. Erroneous decisions or recommendations would typically results in failure to achieve critical organizational objectives and affect image of organization's technological capability.</li>\n</ul>\n\n<strong>LIASON:</strong>\n\n\n<ul>\n<li>Serves as organization spokesperson on advanced projects and/or programs. Acts as advisor to management and customers on advanced technical research studies and applications.</li>\n<li>Qualifications:*</li>\n</ul>\n\n<strong>EDUCATION AND EXPERIENCE:</strong>\n\n\n<ul>\n<li>Bachelors and fourteen (14) years or more experience; Masters and twelve (12) years or more experience; PhD or JD and nine (9) years or more experience.</li>\n<li>Successfully able to work with unformatted data.</li>\n<li>Must be very strong in Oracle.</li>\n<li>R or Tablo helpful.</li>\n<li>Experience in Data discovery.</li>\n</ul>\n\n<strong>CLEARANCE REQUIREMENT:</strong>\n\n\n<ul>\n<li>Clearance Level Must Currently Possess: Secret</li>\n<li>Clearance Level To Obtain: Secret</li>\n</ul>\n\nSAIC Overview:SAIC is a premier technology integrator providing full life cycle services and solutions in the technical, engineering, intelligence, and enterprise information technology markets. SAIC is Redefining Ingenuity through its deep customer and domain knowledge to enable the delivery of systems engineering and integration offerings for large, complex projects. SAIC's approximately 15,000 employees are driven by integrity and mission focus to serve customers in the U.S. federal government. Headquartered in Reston, Virginia, SAIC has annual revenues of approximately $4.5 billion. For more information, visit saic.com. For information on the benefits SAIC offers, see My SAIC Benefits. EOE AA M/F/Vet/Disability\n\n\n<ul>\n<li>Job Posting:* Jul 17, 2018, 2:43:31 PM</li>\n<li>Primary Location:* United States-KY-FORT KNOX</li>\n<li>Clearance Level Must Currently Possess:* Secret</li>\n<li>Clearance Level Must Be Able to Obtain:* Secret</li>\n<li>Potential for Teleworking:* No</li>\n<li>Travel:* Yes, 25% of the time</li>\n<li>Shift:* Day Job</li>\n<li>Schedule:* Full-time</li>\n</ul>"}