{"job title": "Sr. Data Scientist", "company": "Tech Data", "city state": "– US-FL-Clearwater", "rating": "3.2", "job description": "<div><div>\n<div>\n<p> </p><p>Tech Data is one of the world’s largest technology providers in IT distribution. Tech Data is currently ranked No. 83 on the Fortune 100® and has been named one of Fortune’s “World’s Most Admired Companies” for seven straight years.</p><p> </p><p>The Tech Data difference is in our people. Every day customers like Best Buy, CDW, Office Depot, etc… depend on us to help them cost-effectively support the technology needs of end users of all sizes, including small- and medium-sized businesses, large enterprises, educational institutions, government agencies, and consumers. Working for Tech Data, you will be supporting manufacturers such as, Apple, Brocade, Cisco, Dell, HP, IBM, Lenovo, Microsoft, Oracle, VMWare, etc…</p><p> </p><p><strong>The video link below provides a glimpse into our world!</strong></p><p><strong> </strong></p><p><strong> </strong></p><p> </p><p>The Sr. Data Scientist applies and inspires the adoption of advanced data science and analytics across the business, helping the business continue its evolution into an analytical and data-driven culture. This position will use mathematic and algorithmic techniques to solve some of the most analytically complex business problems, leveraging large amounts of raw information to figure out hidden insight that lies beneath the surface. They will use evidence-based analytics and build robust decision capabilities. The Sr. Data Scientist will also oversee the activities of the junior data scientists, and provide advanced expertise on statistical and mathematical concepts.<br>Ultimately, the data scientist will enable Tech Data to operate and strategize more intelligently, and drive digital transformation through the use of analytics. Their ultimate objective is adding substantial enterprise value by learning from data.</p>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\nEssential Duties &amp; Responsibilities Required\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<p>Essential Duties &amp; Responsibilities Required: <br>• Statistics/Mathematics/Data Warehousing: Utilization and familiarity of tools like SQL, R, Python, Data Modeling, Data Warehouse methodologies, etc. Building analytical tools using common computer programming language. Spearhead statistical analysis, 3rd party data integration, and hypothesis testing using statistical tests, distributions, maximum likelihood estimators, etc. Understanding which are the most appropriate algorithms and approaches to use for statistical models to support a particular approach. Utilization of correlation, multivariate regression and all aspects of massaging data together to look at it from different angles for use in predictive and prescriptive modeling. Experience using SAP Predictive Analytics preferred. <br>• Business Responsibilities: Work closely with colleagues to try and identify data related problems and solve them. Enable the business to make decisions by arming them with quantified insights, in addition to understanding the needs of non-technical colleagues in order to use the data appropriately. Clearly and fluently translate technical findings to a non-technical team. Business domain expertise - identifies the most valid variables and appropriate data sets to build models. <br>• Analytics: Analyzes complex, high-volume, high-dimensional data from various sources to help develop various types of data-driven products. Data mining and cleansing: ability to deal with imperfections in data in disparate sources. Identify data-related problems and solve them; conduct research and collect data; and ensure high quality data is collected to ensure integrity. <br>• Data Visualization and Communication: describing findings or the way techniques work to audiences, both technical and non-technical. Familiar with data visualization tools like d3.js. principles behind visually encoding data and communicating information. Develop programs and data that can be used for data analysis and presentation. Creativity to go beyond current tools to deliver best solution to the problem. Experience using SAP data visualization tools (e.g. Lumira, Analytics Cloud, Design Studio, etc) or Tableau preferred. <br>• Thought Leadership and Collaboration: the Senior Data Analyst provides mentorship and guidance to junior data analysts while simultaneously ensuring that Tech Data adopts best-in-class processes and techniques for statistical analysis and modeling, as well as leading the roll out of Data Science capabilities. </p><p> </p><p> Other Duties &amp; Responsibilities:<br>• Additional duties as assigned<br>• Meets attendance and punctuality standards</p>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\nQualifications, Required Knowledge Skills &amp; Abilities and Working Conditions\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<div> • Able to execute instructions and to request clarification when needed. </div><div> • Able to recognize and attend to important details with accuracy and efficiency. </div><div> • Able to communicate clearly and convey necessary information. </div><div> • Able to create and conduct formal presentations. </div><div> • Able to interact effectively with all levels of management. </div><div> • Able to negotiate skillfully, promote/sell ideas persuasively, and close transactions with mutually beneficial results. </div><div> • Possesses strong multi-cultural interpersonal skills. </div><div> • Possesses strong leadership skills with a willingness to lead, create new ideas, and be assertive. </div><div> • Possesses strong organizational and time management skills, driving tasks to completion. </div><div> • Able to constructively work under stress and pressure when faced with high workloads and deadlines. </div><div> • Able to maintain and promote social, ethical, and organizational standards in conducting internal and external business activities. </div><div> • Able to work independently with minimum supervision. </div><div> • Able to maintain confidentiality of sensitive information </div><div> • Able to quickly learn new systems and technology. </div><div> <p>• Able to use relevant computer system applications at an advanced level.</p><p> </p><div> <u>Experience:</u> </div><div> • 3 to 5 Years of relevant work experience. </div><div> Relevant supervisory / managerial experience will appear here </div><div> </div><div> <u>Education &amp; Certifications:</u> </div><div> • Master's / Postgraduate Degree with Data Science, Mathematics, Statistics Field of Study preferred. </div><div> <p>• Master's / Postgraduate Degree with Data Science, Mathematics, Statistics field of study required.</p><p> </p><p>Working Conditions:</p><p>• Professional, Office Environment</p> </div> </div>\n\n</div>\n</div>\n</div>"}