{"job title": "Senior Analyst, Data Scientist", "company": "The Estee Lauder Companies", "city state": "– New York, NY", "rating": "3.5", "job description": "**Senior Analyst, Data Scientist**<br> <br><br> <br>**Brand:** Est?e Lauder Companies Corporate Departments<br> <br><br> <br>**Description**<br> <br><br> <br>This role is responsible for supporting the strategy, deployment, maintenance and consolidation of the OneSource measurement and insights and analytics program. This position will be supporting the development and roll-out of all scorecards and visualization of information related to the performance of the OneSource Operation. In addition, this role will be supporting the creation of material for all operational performance meetings both internal to ELC and between OneSource and its vendors.<br> <br><br> <br><br><br><br> <br>Responsibilities:<br> <br><br> <br><br><br><br> <br>-Transform raw data into meaningful and impactful analysis characterized by strong data governance, technique transparency and aggressive documentation.<br> <br><br> <br><br><br><br> <br>-Partner with various OneSource team members and stakeholders to identify opportunities for improvement and drive decision-making.<br> <br><br> <br><br><br><br> <br>-Design and analyze rigorous experiments, help teams set great hypotheses, and deliver robust analysis of experiment results.<br> <br><br> <br><br><br><br> <br>-Identify actionable metrics to understand the performance of services, develop dashboards and/or reports to track performance, and ingrain these metrics into teams? day-to-day decision-making.<br> <br><br> <br><br><br><br> <br>-Raise the skill level of entire analyst team through the creation of exemplary work, mentorship and the introduction of better practices, processes and tools.<br> <br><br> <br><br><br><br> <br>-Help advocate for OneSource?s data-driven decision-making process internally and externally.<br> <br><br> <br><br><br><br> <br>-Continually evaluate and refine technical toolkit<br> <br><br> <br><br><br><br> <br>-Support development of OneSource Operational Performance metrics program and supporting systems, processes and reporting<br> <br><br> <br><br><br><br> <br>-support development of standard scorecard reporting complete with business analytics insights<br> <br><br> <br><br><br><br> <br>-Visualization of data sets to create compelling business insights<br> <br><br> <br><br><br><br> <br>-Develop material to communicate OneSource performance during monthly, quarterly and/or annual OneSource performance forums<br> <br><br> <br><br><br><br> <br><br> <br><br><br><br> <br>Competencies:<br> <br><br> <br><br><br><br> <br>-3 years experience as a data scientist or data analyst in which you have extracted meaning from big data sets with little engineering support.<br> <br><br> <br><br><br><br> <br>-Experience with Tableau, or other data visualization software a plus<br> <br><br> <br><br><br><br> <br>-Strong, independent, analytical thinker who enjoys tackling complex and nuanced problems.<br> <br><br> <br><br><br><br> <br>-Ability to communicate insights verbally, visually and in writing.<br> <br><br> <br><br><br><br> <br>-Ability to take on loosely defined problems and distill complex findings into actionable recommendations.<br> <br><br> <br><br><br><br> <br><br> <br><br><br><br> <br><br> <br><br><br><br> <br><br> <br>**Qualifications**<br> <br><br> <br>-Demonstrates Learning Agility: Ability to anticipate change, face reality, draw conclusions, and swiftly<br> <br><br> <br><br><br><br> <br>mobilize to adapt to changing needs and demands.<br> <br><br> <br><br><br><br> <br>-Thinks Strategically: Takes a broad view of the business, industry, and consumer environment to anticipate<br> <br><br> <br><br><br><br> <br>and plan for the future. Identifies the focus and defines where to play, how to win and what capabilities and<br> <br><br> <br><br><br><br> <br>management systems are required.<br> <br><br> <br><br><br><br> <br>-Aligns and Engages the Team in the Vision: Provides clarity to each team member on their role in achieving<br> <br><br> <br><br><br><br> <br>the vision, strategy, and goals.<br> <br><br> <br><br><br><br> <br>-Minimum 3 years experience<br> <br><br> <br>**Job:** Strategy / Business Development<br> <br><br> <br>**Primary Location:** Americas-US-NY-New York<br> <br><br> <br>**Job Type:** Standard<br> <br><br> <br>**Schedule:** Full-time<br> <br><br> <br>**Shift:** 1st (Day) Shift<br> <br><br> <br>We are an equal opportunity employer. Minorities, women, veterans, and individuals with disabilities are encouraged to apply. **Job Number:** 1810924"}