{"job title": "Market Data Scientist", "company": "VWR", "city state": "– Radnor, PA", "rating": "3.1", "job description": "The Market Data Scientist will own development of a lead forecasting model driven by data from Market Intelligence Program, providing actionable tactical and strategic insights to multiple stakeholders. Own modeling and forecasting for account and geographical heatmaps, product line heatmaps and long-term forecasts used to develop marketing strategies and recommendations.\n<br><br>\nMAJOR JOB DUTIES AND RESPONSIBILITIES (List in order of importance)\n<ul>\n<li>Statistical modeling -- develop models to describe the relationship between any business-relevant independent and dependent variables</li><li>Marketing forecast development -- analyze all available existing data sets to determine which variables are more predictive of marketing awareness building and lead generation performance</li> <li>Analyze the effectiveness of tactical and strategic campaigns driven by Market Intelligence; growth, conversion rates, , and participation in programs</li><li>Identification of opportunities for process improvement and innovative solutions to Market Intelligence analytics challenges</li> <li>Data cleansing/processing -- work with IT to create automated processes to ingest and cleanse data from multiple data sources, partners, and vendors</li><li>Data management -- work with IT to develop and maintain databases that support marketing analysis</li><li>Data deployment – work with IT to deploy data via CRM systems globally and creation of management ad-hoc reports</li>\n</ul>\nQUALIFICATIONS (Education/Training, Experience and Certifications)\n<ul>\n<li>MS/BS in a technical field: Data Science, Statistics, or related discipline</li><li>5+ years of experience in a combination of business intelligence / marketing analytic roles</li><li>Strong demonstrated quantitative and qualitative research skills using standard statistical software</li>\n</ul>\nKNOWLEDGE SKILLS AND ABILITIES (Those necessary to perform the job competently)\n<ul>\n<li>Experience with data visualization technologies, such as Tableau, a plus</li><li>Strong organizational skills and customer service focus</li><li>Experience in implementing and streamlining data processes, including marketing automation efforts plus experience with non-theoretical, “messy” datasets</li><li>Ability to work collaboratively and cohesively in a team environment</li><li>Excellent listening, written, and oral communication skills Ability to exercise independent judgment while effectively prioritizing and executing tasks while under pressure</li><li>Builds and maintains relationships with users to ensure buy-in and adoption of processes and solutions</li><li>Strong analytical and problem-solving capabilities</li><li>Team player with the ability to work in a fast-paced environment</li>\n</ul>\nENVIRONMENTAL WORKING CONDITIONS &amp; PHYSICAL EFFORT (Under Typical Positions)\n<ul>\n<li>Typically works in an office environment with adequate lighting and ventilation and a normal range of temperature and noise level.</li><li>Work assignments are diversified. Examples of past precedent are used to resolve work problems. New alternatives may be developed to resolve problems.</li><li>A frequent volume of work and deadlines impose strain on routine basis.</li> \n</ul>"}